{
    "cik": "1644903",
    "company": "cbdMD, Inc.",
    "filing_type": "10-K",
    "filing_date": "2023-12-22",
    "period_of_report": "2023-09-30",
    "sic": "2844",
    "state_of_inc": "NC",
    "state_location": "NC",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1644903/0001437749-23-035228-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1644903/000143774923035228/ycbd20230930_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1644903/0001437749-23-035228.txt",
    "filename": "1644903_10K_2023_0001437749-23-035228.htm",
    "content": "ITEM 1. DESCRIPTION OF BUSINESS\nOur Company\nGeneral\nWe own and operate the nationally recognized CBD (cannabidiol) brands cbdMD, Paw CBD and hempMD. We believe that we are an industry leader producing and distributing hemp derived solution including broad spectrum CBD products and full spectrum CBD products. Our mission is to enhance our customers overall quality of life while bringing cannabinoid education, awareness and accessibility of high quality and effective products to all. We source cannabinoids, including CBD, which are extracted from non-GMO hemp grown on farms in the United States. Our innovative broad spectrum formula utilizes one of the purest hemp extracts, containing CBD, CBG and CBN, while eliminating the presence of tetrahydrocannabinol (THC). Non-THC is defined as below the level of detection using validated scientific analytical methods. Our full spectrum and Delta 9 products contain a variety of cannabinoids and terpenes in addition to CBD while maintaining small amounts of THC that falls within the limits set in the 2018 Farm Act. In addition to our core brands, we also operate cbdMD Therapeutics, LLC to capture the Companys ongoing investments in science related to its existing and future products, including research and development activities for therapeutic applications and Proline Global that houses some of our newer brands.\nOur cbdMD brand of products includes an array of high-grade, premium every day and functional CBD products, including tinctures; gummies; topicals; capsules; drink mixes; and sleep, focus and calming aids. In addition we have clinical based claims and industry leading strength and concentrations to drive product efficacy.\nOur Paw CBD brand of products includes a line of veterinarian-formulated products including tinctures, chews, topicals products in varying strengths and formulas. Paw CBD products have undergone the National Animal Safety Councils rigorous audit and meet their Quality Seal standard.\nOur hempMD brand is a curated line of hemp derived solutions that we believe will open up several new customer acquisition channels.\ncbdMD, Paw CBD and hempMD products are distributed through our e-commerce websites, third party e-commerce sites, select distributors and marketing partners as well as a variety of brick-and-mortar retailers.\nRecent Developments\nManagement ﻿continues to be very focused on delivering positive earnings through a combination of optimizing our product portfolio, right-sizing our cost structure and investing in marketing that will provide positive return on customer acquisition. During fiscal 2023 we made significant changes to our marketing and overall operations including re-platforming our website to significantly reduce our operating costs. While revenue decreased, our cash burn has been significantly reduced.\nAt the end of our third fiscal quarter of 2023 we changed our e-commerce platform to focus on our customer experience and conversion rates. As part of this plan, we planned a site refresh that launched during November of 2023. We continue to focus on our site optimization to ensure we have the industry-best customer experience on our website. As part of our platform change, we concentrated on our subscription base and have seen a strong increase in subscribers year over year and this has accelerated since our platform change.\nDuring the fourth quarter of fiscal 2023 we also attempted to convert the Series A Preferred stock to common stock through a shareholder vote to amend our Series A Preferred Stock designation. Ultimately, we were unable to get the required votes needed to approve the amendment and we canceled the shareholder meeting. We believe the combined market capitalization of both our common and Series A Preferred is being impacted due to our current capital structure. Our goal is to simplify our capital structure and we believe it will help unlock additional equity value and open up more strategic activity for the Company.\nOur Paw CBD brand won yet another Pet Innovations awards this year from Independent Innovations Awards, an independent awards association. This year our Dog Hip and Joint won the Dog Product of the Year for soft chews. In December of 2023, cbdMD products were awarded been named a bronze winner in two distinguished categories at the esteemed Best in Biz Awards. The Companys CBD Freeze Roll-On has been recognized in the Consumer Product of the Year category, while cbdMD PM Softgel Capsules - NSF Certified for Sport® has been honored in the Best New Product of the Year consumer category.\nDuring October 2023, the Company launched its hempMD product line of hemp-derived functional products and have begun opening up additional sales channels, including Amazon.\ncbdMD recently expanded its retail reach in December 2023 by launching several products throughout Sprouts Supermarkets.\nWe have spent significant resources focused on state and national regulatory matters and believe lack of a clear regulatory framework has a negative impact and limits the opportunity for CBD companies that act with integrity and invest in responsible quality and safety standards. We continue to believe in the long term benefits of hemp-derived cannabinoids, but see a longer-term horizon for federal regulatory clarity. As a result, in late 2023 and into early fiscal 2024 the Company has focused on expanding into categories that do not have as many regulatory and channel hurdles.\nDuring December 2023, the Company launched its new functional mushroom line of products with its Super Gummy under the ATRx brand on ATRxlabs.com. At our core, we believe in natural health and wellness solutions and we believe in the benefits derived from functional mushrooms in addition to hemp. We are working to open up additional channels and are in discussions with a large retailer to anchor the launch of 4 new SKUs under the ATRx brand during the balance of fiscal 2024.\nGrowth Strategies\nWe continued to pursue many strategies to grow our revenues and expand the scope of our business in fiscal 2024 and beyond:\n●\nProduct Innovation: Our goal is to provide our customers superior functional based products with greater efficacy claims and absorption. We regularly assess and evaluate our product portfolio, and devote resources to ongoing research and development processes with the goal of improving our product offerings. During fiscal 2023 we focused on expanding some of our core line of products. This included adding to our NSF for Sport product line, as well as our line of Delta 9 gummies and microdose products. In addition, we expanded our line up by launching our proprietary hemp blend under hempMD. In November of 2024 we launched our new CBG tincture and during the first quarter of fiscal 2024 we launched our new nootropic mushroom line under the ATRx brand. We have a robust pipeline of cannabinoid and non-cannabinoid products to launch during fiscal 2024.\n●\nExpand our revenue channels: During fiscal year 2023, our wholesale business continued to face macro industry contraction trends that we believe are tied to low-dose, high-priced products. We continued to pursue relationships with traditional retail accounts and believe our top brand awareness and effective marketing position us as a preferred CBD partner for key traditional retail accounts as this channel has continued to normalize. During the first quarter of fiscal 2024 we launched several SKUs into Sprouts retail footprint. We continue to assess our product channel fit and working with retailers and distributors alike to further grow this channel.\n●\nInternational Expansion: We continue to explore sales in markets outside of the United States. Our products are currently available in 31 countries. We generally partner with local wholesalers and local legal counsel who can help navigate the laws and regulatory requirements within their jurisdiction. We continue to pursue key wholesale accounts in a number of international markets and are gaining market share in Central America through our sanitary registration approvals. We are also expanding our E-commerce business to consumers in the United Kingdom (UK) by expanding onto Amazons platform during fiscal year 2023 and are continuing to grow this channel quarterly. In March 2021, we officially filed our Novel Food Application with the United Kingdoms Food Standards Agency (FSA) and the European Unions (EU) Food Safety Agency (EFSA) and received validation notices during 2022. The UK government has not provided clarity on the timeline to complete their FSA process.\n●\nCultivate Additional Brands: We continue to operate and attempt to grow the Paw CBD business. During fiscal 2024 we launched hempMD as a separate brand and in December 2023 we launched our new nootropic mushroom line under the ATRx brand. We believe there is ongoing opportunities with these brands to focus on education, cross-selling and customer retention.\n●\nAcquisitions: We evaluate acquisitions where we believe (i) there is an accretive customer base that can lower our cost of customer acquisitions through either a complementary direct to consumer base or wholesale channels, or (ii) the target has a profitable business or easily attainable cost synergies that can quickly help contribute and accelerate profitability of our Company.\nMarketing\ncbdMD and its brands are primarily direct to consumer brands and our focus is to grow our base of customers by profitability acquiring new customers while minimizing churn. We employ a multi-channel media approach that allows us to market our brand and products through various distribution efforts, which includes sports and athletes sponsorships, professional partnerships, social media engagement, podcasts, digital and television advertising, affiliate marketing, and influencer endorsements. During fiscal year 2023 we also operated with media partnerships with the Joe Rogan Experience, and a360 Media, LLC. In addition, we work with our retail partners on various marketing efforts to focus on shelf velocity.\nDuring fiscal year 2023 and fiscal year 2022 we spent approximately $6.9 million and $16.4 million, respectively, on brand development, sponsorships and marketing.\nDuring fiscal 2023 we reviewed our customer analytics to better understand customer habits and attribution and identify opportunities to lower our cost of customer acquisition and improve lifetime value. As such we have rationalized a significant amount of marketing spend throughout the year eliminating expensive sponsorships, influencers and digital spend where we could not derive strong attribution, return on allocated capital and resources, or generate sufficient brand exposure. Our goal is to continue to thoughtfully invest in expanding our already highly recognizable brand and place increased emphasis on consumer, retailer and regulatory education. Our goal is to provide a compelling message to consumers and educate them about our superior science, safety and clinical efficacy to attract more consumers to our brands as well as enlighten more retailers to the opportunity and gain more widespread regulatory acceptance.\nSales\nWe distribute our products both through our online sales channel as well as through a number of wholesalers and retailers that resell our products both in brick and mortar locations as well as via their online websites. Sales of our products primarily come from online sales at our websites www.cbdmd.com, www.pawcbd.com, cbdmdbotanicals.com and www.directcbdonline.com and through our inside sales department. Our inside sales team concentrates on B2B niche specialty retailers as well as wholesale distributors, who we believe can help amplify our reach of cbdMD products at physical retail locations.\nDuring fiscal year 2023, our e-commerce business experienced continued growth, with year over year increases in new e-commerce customers. For fiscal 2023, approximately 80% of sales were e-commerce as compared to approximately 75% in 2022. While our revenue trends shifted, we continue to work to expand the stores we serve on our B2B brick and mortar side of our business in addition to distributors that carry our products.\nProduct manufacturing\nWe are committed to producing a safe, high-quality product with testing transparency. We only use cannabinoids extracted from hemp grown in the United States in our products. All suppliers and manufacturers meet strict quality requirements and are validated producers of hemp under state and federal laws.\nDuring fiscal 2022 the Company completed the sale of its manufacturing assets to Steady State, LLC, significantly reducing its fixed overhead costs, migrating to a more variable cost structure, as now all production is outsourced to various manufacturers under short term agreements.\nWe develop detailed product specifications and utilize several manufacturers with specific formulation and format expertise to deliver finished products within specification. These suppliers, who have undergone a detailed supplier verification process, are independently cGMP certified, and are subject to continuing independent audit and certifications. Master Manufacturing Agreements and Quality Assurance Agreements are required for all of our critical supply contract manufacturers. All finished goods are tested by the supplier at an independent ISO accredited third-party laboratory to ensure they meet ingredient label claims, including purity and strength of cannabinoid levels and comply with the THC content requirements in the 2018 Farm Act, before they are released for shipment. We have no long term obligations with any manufacturers or suppliers.\nAs a consumer goods brand dedicated to providing the highest quality hemp extracted cannabinoid consumer products on the market, we strive to meet or exceed the FDAs Good Manufacturing Practice (GMP) guidelines. These guidelines provide a system of processes procedures and documentation to assure a product is manufactured consistently, in a safe manner, and meets label claims for identity, strength, composition, quality, and purity. Our warehouse operation encompassing 80,000 square feet, is fully GMP compliant and NSF dietary supplements certified. Quality of products is a key tenant of our operations. During the second quarter of fiscal 2023 we renewed our NSF GMP 455 certification. We also hold the National Animal Supplement Counsels (NASC) prestigious Quality Seal Award. In addition, during fiscal 2022 we were the first CBD company to commercialize THC Free SKUs that were NSF Certified Products, which is a prestigious third-party guarantee that ensures what we say is in the product is actually in the product. We also spearheaded NSFs Certified for Sport (CFS) for cannabinoid products and were the first company to commercialize products under this rigorous program that gives assurances that a person consuming an NSF CFS product will not fail a World Anti Doping Agency (WADA) test for banned substances, thus assuring our customers they can safely consume our CFS products.\nResearch and development and product enhancements\nNew product development efforts are focused on both near-term and long-term results for the Company. The key objectives and input points driving cbdMDs research and development process include current product improvement efforts and new product development activities. Our product improvement efforts include consumer feedback analysis, market research on emerging trends, and feedback from panels of product testers, among others. In the fourth quarter of fiscal 2023 we expanded our feedback analysis to include biometric device monitoring and expect statistically relevant data to be generated as early as the mid-third quarter of fiscal 2024. We also conduct in-depth market research campaigns and sample size testing and research. Our new product development activities include market research, projecting future product trends, research and identification of clinically proven, proprietary functional ingredients, and research to develop new product offerings, in-depth product testing, and package and graphic development. The Company is continually exploring exclusive partnerships with well-known and established dietary supplement ingredient manufacturers to include their proprietary and clinically studied ingredients in functional combination products to address specific consumer needs in large market segments. The first such partnership was entered into with Unigen Corporation to include their proprietary pain reduction ingredient Univestin in a first of its kind CBD product to address the +$30 billion market for pain management drugs.\ncbdMD Therapeutics, the clinical research arm of the Company, completed two clinical studies in fiscal year 2023:\nIn the first quarter of fiscal 2023, the Company concluded a randomized, double blind, placebo controlled clinical trial in healthy adults utilizing its proprietary hemp extract blend which demonstrated significant benefits in many areas, including reduction of pain, reduced inflammation, and improved mood, and these results are further driving the refinement of current products and the development of new products which utilize the same proprietary blend of hemp extracted cannabinoids.\nIn third quarter of fiscal 2023 the Company concluded a randomized, double blind, placebo controlled clinical study in dogs performed in conjunction with Colorados State Universitys veterinary program. Results indicate that our proprietary broad spectrum hemp extract improved mobility, gait, and quality of life in dogs with osteoarthritis. These results will provide claims related to our proprietary broad spectrum blends efficacy and drive new product development to address the needs of the nearly $2 billion canine arthritis treatment market according to Expert Market Research.\nThe results from both of the clinical studies inform product development and marketing efforts, and will serve as preliminary data for future clinical studies. Publications of the results of the studies is expected sometime in fiscal year 2024.\nThe second paper from the Companys comprehensive safety study was published in the fourth quarter of fiscal 2023. We believe the paper was groundbreaking in the hemp derived cannabinoid industry and was immediately cited in additional safety papers. To our knowledge the data in the publication established cbdMD as only the second company in the world to publish actual clinical safety data on CBD isolates with an extensive number of studies and data in the publication.\nIntellectual property\nWe hold a portfolio of U.S. trademark applications which are held for current and future product offerings and extended branding capability. The portfolio, includes but is not limited to trademarks set forth below:\nMark\nFederal registration No.\nFiling date\nDescription of Mark Usage\nDIRECT CBD ONLINE\n5/10/2019\nService mark\nDIRECT CBD ONLINE\n5/10/2019\nService mark\ncbdMD\n5/29/2019\nStylized word mark (logo in color)\ncbdMD\n5/29/2019\nStandard word mark\nPaw CBD\n10/19/2019\nStandard word mark\nCBDMD\n6/2/2020\nStandard word mark\nhempMD\n6/29/2021\nStandard word mark\nATRX\n10/04/2023\nStandard word mark\nWe currently have filed multiple foreign trademark applications for CBDMD and PAWCBD and have secured marks in the following countries: Chile, Costa Rica, Argentina, Peru, Ecuador, European Union, United Kingdom, Czech Republic, New Zealand, Columbia, Australia, and Switzerland. We continue to prosecute the CBDMD and PAWCBD trademarks in the following countries: Brazil, Canada, China, Spain, Mexico, Norway, and South Africa. Additionally, a growing number of our products hold sanitary registrations in certain Central and South American countries.\nThe Companys U.S. Patent Application No.: 17/359,193 is currently under examination and we expect it to be granted sometime in FY 2024. This patent is expected to provide protection in several key areas, including novel formulations and delivery systems, as well as methods of manufacturing and use.\nIn addition to our trademarks and our patent filing, we rely on a combination of trade secret laws and restrictions on disclosure to protect our intellectual property rights. Our success depends on the protection of the proprietary aspects of our product development, formulation and knowhow, as well as our ability to operate without infringing on the proprietary rights of others. We also enter into proprietary information and confidentiality agreements with our employees, consultants and commercial partners and control access to, and distribution of, our formulas and other proprietary information.\nIn addition to www.cbdmd.com, www.pawcbdmd.com, www.hempMD.co, and www.directcbdonline.com, we own multiple domain names that we may or may not operate in the future. However, as with phone numbers, we do not have and cannot acquire any property rights in an Internet address. The regulation of domain names in the United States and in other countries is subject to change. Regulatory bodies could establish additional top-level domains, appoint additional domain name registers or modify the requirements for holding domain names. As a result, we might not be able to maintain our domain names or obtain comparable domain names, which could harm our business.\nCompetition\nThe CBD-based market has remained fragmented with over 2,000 brands in the category with no clear dominant brand in the US. Our competitors of CBD and cannabinoid-based products include a combination of public and private companies who operate as combination of e-commerce and wholesale brands as well as brick and mortar retail operations.\nGovernment Regulations\nOn December 20, 2018, the President of the United States signed the Farm Bill into law. Among other things, this new law changed certain federal regulations relating to the production and marketing of hemp, defined as cannabis (Cannabis sativa L.), and hemp products containing less than 0.3 percent delta-9-tetrahydrocannabinol (THC), including removing hemp and derivatives of hemp from the Controlled Substance Act. On January 15, 2021 the USDA issued its final rule regarding the Establishment of a Domestic Hemp Production Program which authorized hemp to be grown and processed legally in the United States and made it legal to transport hemp and its derivatives in interstate commerce.\nThe Farm Bill recognizes hemp as distinct from its genetic cousin, marijuana, and specifically industrial hemp has been excluded from U.S. drug laws. The Farm Bill allows for each individual state to regulate industrial hemp and industrial hemp-based products or accept the USDA rules. Although no longer a controlled substance under federal law, cannabinoids derived from industrial hemp are still subject to a patchwork of state regulations. We actively monitor the regulations and proposed regulations in each state to ensure our operations are compliant.\nIn conjunction with the enactment of the Farm Bill, the FDA released a statement about the status of CBD and the agencys actions in the short term with regards to CBD will guide the industry. The statement noted that the Farm Bill explicitly preserved the FDAs authority to regulate products containing cannabis or cannabis-derived compounds under the FDCA and Section 351 of the Public Health Service Act. This authority allows the FDA to continue enforcing the law to protect patients and the public while also providing potential regulatory pathways for products containing cannabis and cannabis-derived compounds. The statement also noted the growing public interest in cannabis and cannabis-derived products, including CBD, and informed the public that the FDA will treat products containing cannabis or cannabis-derived compounds as it does any other FDA-regulated products - meaning the products will be subject to the same authorities and requirements as FDA-regulated products containing any other substance, regardless of the source of the substance, including whether the substance is derived from a plant that is classified as hemp under the Farm Bill.\nAs of the date of this report, and based upon publicly available information, to our knowledge the FDA has not taken any enforcement actions against CBD companies. The FDA, however, has sent warning letters to companies demanding they cease and desist from the production, distribution, or advertising of CBD products, only relating to instances that such CBD companies have made misleading and unapproved label claims. We will continue to monitor the FDAs position on CBD. In December 2020, the FTC announced it was going to seek penalties against companies making deceptive marketing claims and named 6 companies which it had targeted for making egregious and unsupported health claims. On March 5, 2021, the FTC approved the final administrative consent orders with all 6 companies. We are unaware of any further actions and we will continue to monitor the FTCs position with regards to deceptive marketing claims.\nWe are subject to federal and state consumer protection laws, including laws protecting the privacy of customer non-public information and the handling of customer complaints and regulations prohibiting unfair and deceptive trade practices. The growth and demand for online commerce has and may continue to result in more stringent consumer protection laws that impose additional compliance burdens on online companies. These laws may cover issues such as user privacy, spyware and the tracking of consumer activities, marketing e-mails and communications, other advertising and promotional practices, money transfers, pricing, product safety, content and quality of products and services, taxation, electronic contracts and other communications and information security.\nThere is also great uncertainty over whether or how existing laws governing issues such as sales and other taxes, auctions, libel, and personal privacy apply to the internet and commercial online services. These issues may take years to resolve. For example, tax authorities in a number of states, as well as a Congressional advisory commission, are currently reviewing the appropriate tax treatment of companies engaged in online commerce, and new state tax regulations may subject us to additional state sales and income taxes. New legislation or regulation, the application of laws and regulations from jurisdictions whose laws do not currently apply to our business or the application of existing laws and regulations to the internet and commercial online services could result in significant additional taxes or regulatory restrictions on our business. These taxes or restrictions could have an adverse effect on our cash flows, results of operations and overall financial condition. Furthermore, there is a possibility that we may be subject to significant fines or other payments for any past failures to comply with these requirements.\nIn fiscal 2021, we submitted a Novel Foods dossier with both the EU Food Safety Agency (FSA) and the United Kingdoms Food Safety Agency (UK FSA). Novel Foods are foods which have not been widely consumed in the UK or the EU before May 1997. Before a Novel Food can be marketed in the UK or EU, it is required to have a pre-market safety assessment and authorization. The UK has waived the pre-market requirement and is allowing post market submissions for products that were in the marketplace prior to February 2020, which qualifies several products.\nAs of this filing, the Company is in the Risk Assessment stage of the Novel Food approval process in the UK and on hold in the EU pending further determinations by the EU Food Standard Agency. The Company is one of only a handful of original companies submitting Novel Food applications which have been validated and entered the Risk Assessment phase in the UK. The Company is currently actively selling its products in the UK and strongly believes its products will ultimately be approved once the administrative delays in the UK are cleared.\nHuman Capital\nAt December 1, 2023 we had approximately 52 full-time employees. There are no collective bargaining agreements covering any of our employees.\nWe believe that cbdMDs success depends on our ability to attract, develop and retain key personnel. We believe that the skills, experience and industry knowledge of our key employees significantly benefit our operations and performance.\nEmployee levels and expertise are assessed and reviewed on a regular basis and management believes it has sufficient human capital to operate its business successfully.\nAdditional information\nInformation on the history of our company can be found in Note 1 to the notes to our consolidated financial statements appearing later in this report.\nWe file annual, quarterly and other reports, proxy statements and other information with the SEC. The SEC maintains a website at www.sec.gov that contains reports, proxy and information statements, and other information regarding issuers such as our company that file electronically with the SEC.\nOur corporate website address is www.cbdmd.com. We make available free of charge, through the Investor section of our website, annual reports on Form 10-K, quarterly reports on Form 10-Q and current reports on Form 8-K and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Exchange Act as soon as reasonably practicable after we electronically file such material with, or furnish it to, the SEC. The information which appears on our corporate website is not part of this report. ITEM 1A. RISK FACTORS.\nInvesting in our securities involves risks. You should carefully consider the risks described below in addition to the other information set forth in this Annual Report on Form 10-K, including the Managements Discussion and Analysis of Financial Conditions and Results of Operations section and the consolidated financial statements and related notes. If any of the risks and uncertainties described in the cautionary factors described below actually occur or continue to occur, our business, financial condition and results of operations and the trading price of our common stock and our Series A Convertible Preferred Stock could be materially and adversely affected. Moreover, the risks below are not the only risks we face and additional risks not currently known to us or that we presently deem immaterial may emerge or become material at any time and may negatively impact our business, reputation, financial condition, results of operations or the trading price of our securities.\nRISKS RELATED TO OUR OVERALL BUSINESS\nWe have a history of losses from operations and there are no assurances we will report profitable operations in future periods or continue as a going concern.\nWe reported losses from operations of $24.2 million and $78.3 million for fiscal year 2023 and fiscal year 2022, respectively. Included in our loss from operation is a non-cash $0 and $56.6 million impairment of goodwill for fiscal year 2023 and fiscal year 2022, respectively as well as an impairment of $13.2 and $4.3 million on our trade names for fiscal 2023 and 2022, respectively. Not included in our loss from operations for fiscal 2023 is a $0.70 million impairment non-cash charge pertaining to our ownership interest in Steady State, LLC as well as a non-cash income of $0.19 million and non-cash expense of $8.47 million for fiscal 2023 and fiscal 2022, respectively, reflecting a change in value of the contingent liability associated with the Earnout Shares (as hereinafter defined) primarily as a result of the change in the market price of our common stock. Until such time, if ever, that we are successful in generating gross profits which are sufficient to pay our operating expenses it is likely we will continue to report losses from operations in future periods.\nWhile the Company is taking strong action and believes that it can execute its strategy and path to profitability within its balance sheet, and in its ability to raise additional funds, there can be no assurances to that effect. The Companys working capital position may not be sufficient to support the Companys daily operations for the twelve months subsequent to the issuance of these annual financial statements. The Companys ability to continue as a going concern is dependent upon its ability to improve profitability and cash flow and the ability to acquire additional funding. These and other factors raise substantial doubt about the Companys ability to continue as a going concern within twelve months after the date that the annual financial statements are issued. These financial statements do not include any adjustments to reflect the possible future effects on the recoverability and classification of assets or the amounts and classification of liabilities that may result in the Company not being able to continue as a going concern.\nIn the event our revenues do not increase, we will need to raise additional capital to fund our operations in furtherance of our business plan.\nUntil we are profitable, we will need to raise additional capital during the current fiscal year in order to fund our operations in furtherance of our business plan. A potential financing may include shares of common stock, shares of preferred stock, warrants to purchase shares of common stock or preferred stock, debt securities, units consisting of the foregoing securities, equity investments from strategic development partners or some combination of each. Any additional equity financings may be financially dilutive to, and will be dilutive from an ownership perspective to, our stockholders, and such dilution may be significant based upon the size of such financing. Additionally, we cannot assure that such funding will be available on a timely basis, in needed quantities, or on terms favorable to us, if at all.\nOur current capitalization limits our ability to make strategic or accretive acquisitions or attract new investors.\nOur management has engaged in several strategic discussions for both soliciting strategic investment as well as mergers and acquisitions (M&A). Our outstanding shares of Series A Preferred Stock continues to substantially limit opportunities to negotiate strategic investment or M&A. Potential investors and merger candidates view both the dividend obligation as well as the $50 million in Series A Preferred Stock liquidation preference a challenging burden, which impacts managements ability to negotiate potential opportunities at reasonable terms and conditions. Additionally, the change of control rights of the Series A Preferred, which provide for a $55 million redemption right, effectively prevents any future third party from making a bona fide offering to acquire our company or our assets which could provide value to our shareholders. As we continue to act on our plan to rebuild revenues and seek accretive acquisition opportunities and working capital (although as of the date of this report we currently do not have any pending or potential acquisitions or financing alternatives), our outstanding shares of Series A Preferred Stock negatively affect our ability to seek, engage and conduct strategic transactions or raise capital that could have a significant positive impact for its shareholders.\nOur recent negative growth rates may continue.\nWe have now had 2 consecutive fiscal years of revenue declines as the industry and Company have faced numerous headwinds. Net sales decreased $11.2 million or 32% to $24.2 million in fiscal 2023 and $9.0 million, or 20%, to $35.4 million in 2022, as compared to $44.5 million in 2021. This decrease was primarily driven by a decrease in total orders year over year in both our direct to consumer and wholesale divisions and we believe associate with (i) changes in social algorithms and IOS that affect effectiveness and cost of marketing and acquiring new customers, (ii) access to certain channels, (iii) ongoing competitive environment, (iv) statements from the FDA that negatively impacted retailer interest in the category, (v) significant inflationary pressures on consumers and businesses alike and (vi) a significant reduction in marketing spend as we rationalize expenses. Despite this reduction in revenue, we have made consistent reduction of quarterly cash consumed by the business over this 2 year period. We believe that our revenue growth will depend upon, among other factors:\n●\nIncreasing U.S. brand awareness;\n●\nOur ability to obtain adequate protections for our intellectual property;\n●\nProduct innovation to expand our total addressable market; and\n●\nInternational expansion.\nWe made significant changes to our headcount to rationalize our expenses. We are continuing to implement policies and procedures that we believe are appropriate for a company of our size. We may continue to experience difficulties as we continue to implement changes to our business and related policies and procedures to manage our business to positive cash flow. This process may increase the strain on our resources, and we could experience operating difficulties, including without limitations, difficulties in sourcing, logistics, recruiting, maintaining internal controls, marketing, designing innovative products, and meeting consumer needs. If we do not adapt to meet these evolving challenges, the strength of our brand may erode, the quality of our products may suffer, we may not be able to deliver products on a timely basis to our customers, and our corporate culture may be harmed.\nIn addition, we may make investments in our research and development and sales and marketing organizations, expand our operations and infrastructure both domestically and internationally, design and develop new products, and enhance our existing products with newly developed products and through acquisitions. If our sales do not increase at a sufficient rate to offset our operating expenses, our losses may increase in future periods.\nOur business depends on maintaining and strengthening our brand and generating and maintaining ongoing demand for our products, and a significant reduction in such demand could harm our results of operations.\nWe have developed a strong and trusted brand that we believe has contributed significantly to the success of our business, and we believe our continued success depends on our ability to maintain and grow the value and reputation of cbdMD. Maintaining, promoting and positioning our brand and reputation will depend on, among other factors, the success of our product offerings, quality assurance, marketing and merchandising efforts, the reliability and reputation of our supply chain, our ability to grow and capture share of the CBD category, and our ability to provide a consistent, high-quality consumer experience. We have made substantial investments in these areas in order to maintain and enhance our brand and these experiences, but such investments may not be successful. Any negative publicity, regardless of its accuracy, could materially adversely affect our business. For example, our business depends in part on our ability to maintain a strong community of engaged customers and social media and athlete influencers. We may not be able to maintain and enhance a loyal customer base if we receive customer complaints, negative publicity or otherwise fail to live up to consumers expectations, which could materially adversely affect our business, operating results and growth prospects.\nThe growing use of social and digital media by us, our consumers and third parties increases the speed and extent that information or misinformation and opinions can be shared. Negative publicity about us, our brand or our products on social or digital media could seriously damage our brand and reputation. For example, consumer perception could be influenced by negative media attention regarding any consumer complaints about our products, our management team, ownership structure, sourcing practices and supply chain partners, employment practices, ability to execute against our mission and values, and our products or brand, such as any advertising campaigns or media allegations that challenge the sustainability of our products and our supply chain, or that challenge our marketing efforts regarding the quality of our products, which could have an adverse effect on our business, brand and reputation. Similar factors or events could impact the success of any brands or products we introduce in the future.\nOur company image and brands are very important to our vision and growth strategies, particularly our focus on being a good company and operating consistent with our mission and values. We will need to continue to invest in actions that support our mission and values and adjust our offerings to appeal to a broader audience in the future in order to sustain our business and to achieve growth, and there can be no assurance that we will be able to do so. If we do not maintain the favorable perception of our company and our brand, our sales and results of operations could be negatively impacted. Our brand and company image is based on perceptions of subjective qualities, and any incident that erodes the loyalty of our consumers, customers, suppliers or manufacturers, including adverse publicity or a governmental investigation or litigation, could significantly reduce the value of our brand and significantly damage our business, which would have a material adverse effect on our business, financial condition, results of operations and cash flows.\nIf we fail to attract new customers in a cost-effective manner, our business may be harmed.\nA large part of our success depends on our ability to attract new customers in a cost-effective manner. We have made, and may continue to make, significant investments in attracting new customers through advertising spends on social media, radio, podcasts, targeted email communications, other media and events, sponsorships, and influencer sponsorships. Marketing campaigns can be expensive and may not result in the cost-effective acquisition of customers. Further, as our brand becomes more widely known, future marketing campaigns may not attract new customers at the same rate as past campaigns and the cost of acquiring new customers may increase over time. Additionally, regulation, algorithms, or participants in the digital marketing ecosystem may change rules for our industry or access to available demographics which may result in significant changes in the ability to target key demographic pools, impacting our ability to target our customers effectively. If we are unable to attract new customers, or fail to do so in a cost-effective manner, our business may be harmed.\nOur growth depends, in part, on expanding into additional consumer markets, and we may not be successful in doing so.\nWe believe that our future growth depends not only on continuing to provide our current customers with new products, but also continuing to enlarge our customer base. The growth of our business will depend, in part, on our ability to continue to expand in the United States, as well as into international markets. We are investing significant resources in these areas, and although we hope that our products will gain popularity, we may face challenges that are different from those we currently encounter, including competitive, merchandising, distribution, hiring, and other difficulties. We may also encounter difficulties in attracting customers due to a lack of consumer familiarity with or acceptance of our brand, or a resistance to paying for premium products, particularly in international markets. In addition, although we are investing in sales and marketing activities to further penetrate newer regions, including expansion of our dedicated sales force, we may not be successful. If we are not successful, our business and results of operations may be harmed.\nOur plans for international expansion may not be successful.\nContinued expansion into markets outside the United States is one of our key long-term strategies for the future growth of our business. This expansion requires significant investment of capital and human resources, new business processes and marketing platforms, legal compliance, and the attention of many managers and other employees who would otherwise be focused on other aspects of our business. There are significant costs and risks inherent in selling our products in international markets, including: (a) failure to effectively establish our core brand identity; (b) increased employment costs; (c) increased shipping and distribution costs, which could increase our expenses and reduce our margins; (d) potentially lower margins in some regions; (e) longer collection cycles in some regions; (f) increased competition from local providers of similar products; (g) compliance with foreign laws and regulations, including taxes and duties, laws governing the marketing and use of e-commerce websites and enhanced data privacy laws and security, rules, and regulations; (h) establishing and maintaining effective internal controls at foreign locations and the associated increased costs; (i) increased counterfeiting and the uncertainty of protection for intellectual property rights in some countries and practical difficulties of enforcing rights abroad; (j) compliance with anti-bribery, anti-corruption, and anti-money laundering laws, such as the FCPA, the Bribery Act, and OFAC regulations, by us, our employees, and our business partners; (k) currency exchange rate fluctuations and related effects on our results of operations; (l) economic weakness, including inflation, or political instability in foreign economies and markets; (m) compliance with tax, employment, immigration, and labor laws for employees living or traveling abroad; (n) workforce uncertainty in countries where labor unrest is more common than in the United States; (o) business interruptions resulting from geopolitical actions, including war and terrorism, or natural disasters, including earthquakes, typhoons, floods, fires, and public health issues, including the outbreak of a pandemic or contagious disease, such as COVID-19, or xenophobia resulting therefrom; (p) the imposition of tariffs on products that we import into international markets that could make such products more expensive compared to those of our competitors; (q) that our ability to expand internationally could be impacted by the intellectual property rights of third parties that conflict with or are superior to ours; (r) difficulty developing retail relationships; and (s) other costs and risks of doing business internationally.\nThese and other factors could harm our international operations and, consequently, harm our business, results of operations, and financial condition. Further, we may incur significant operating expenses as a result of our planned international expansion, and it may not be successful. We have limited experience with regulatory environments and market practices internationally, and we may not be able to penetrate or successfully operate in new markets. We may also encounter difficulty expanding into international markets because of limited brand recognition, leading to delayed or limited acceptance of our products by customers in these markets, and increased marketing and customer acquisition costs to establish our brand. Accordingly, if we are unable to successfully expand internationally or manage the complexity of our global operations, we may not achieve the expected benefits of this expansion and our financial condition and results of operations could be harmed.\nFluctuations in the cost and availability of raw materials, equipment, labor, and transportation could cause manufacturing delays or increase our costs.\nThe price and availability of key components used to manufacture our products has been increasing and may continue to fluctuate significantly. In addition, the cost of labor within our company or at our third-party manufacturers could increase significantly due to regulation or inflationary pressures. Additionally, the cost of logistics and transportation fluctuates in large part due to the price of oil, and availability can be limited due to political and economic issues. Any fluctuations in the cost and availability of any of our raw materials, packaging, or other sourcing or transportation costs could harm our gross margins and our ability to meet customer demand. If we are unable to successfully mitigate a significant portion of these product cost increases or fluctuations, our results of operations could be harmed.\nWe rely on third-parties for raw materials and to manufacture and compound our products. We have no control over these third parties and if these relationships are disrupted our results of operations in future periods will be adversely impacted.\nWe currently hold short-term supply and manufacturing agreements with unaffiliated third-party vendors for our critical raw materials. In addition, our products are manufactured, compounded, and packaged by unaffiliated third parties and the use of these third-parties changes from time to time due to customer demand and the composition of our product mix and product portfolio. We do not have any long-term committed contracts with any of these third parties, and we expect to compete with other companies for raw materials, production and imported packaging material capacity. If we experience significant increased demand or need to replace an existing raw material supplier or third-party manufacturer, there can be no assurances that replacements for these third-party vendors will be available when required on terms that are acceptable to us, or at all, or that any manufacturer or compounder would allocate sufficient capacity to us in order to meet our requirements. In addition, even if we are able to expand existing or find new sources, we may encounter delays in production and added costs as a result of the time it takes to engage third parties. Any delays, interruption or increased costs in raw materials and/or the manufacturing or compounding of our products could have an adverse effect on our ability to meet retail customer and consumer demand for our products and result in lower revenues and net income both in the short and long-term.\nFailures in our third-party verification and testing protocols may have an adverse impact on our brands which could suppress sales.\nThe quality of our products is essential to our business strategy. We require our raw material suppliers and farms to participate in our supplier verification program and to certify that their source material was grown using strict standards of cultivation. We also employ third-party testing procedures and all incoming cannabinoid ingredients are first tested by an independent, third-party laboratory before they reach our production facilities and then re-tested in-house throughout the production process before sending the ingredients off for final verification by an independent accredited third-party laboratories. We are reliant on these third parties to adhere to our supplier verification program and properly perform the third-party testing procedures. Any intentional or unintentional failure of any of these parties to perform the functions for which we have engaged them would adversely impact the quality of our products and could result in delays in meeting consumer demand or a decline in our sales.\nWe could be harmed by data loss or other security breaches.\nSome of our systems have experienced past security incidents, including a recent incident that compromised some customers' personal and payment information. We conducted a forensic examination, made all notices to customers, governments, banks and card associations as required under local, state and federal laws, merchant agreements and card association rules. We also offered free credit monitoring and reporting to all affected customers and are maintaining a call center to handle any customer issues. We have implemented all remedial measures advised by the forensic examiner engaged by us, and, although we do not believe that any of these incidents have had a material adverse effect on our operating results, there can be no assurance the remedial measures will be effective or of a similar result in the future which could materially and adversely impact our business and operations in future periods.\nWe face risks related to system interruption and lack of redundancy.\nFrom time to time we experience occasional system interruptions and delays that make our websites and product sales unavailable or slow to respond and prevent us from efficiently fulfilling orders which could adversely impact our net sales and the attractiveness of our products. If we are unable to add software and hardware as needed, effectively upgrade our systems and network infrastructure, and take other steps to improve the efficiency of our systems, these failures could cause system interruptions or delays and adversely affect our operating results in future periods. In addition, our computer and communications systems and operations could be damaged or interrupted by fire, flood, power loss, telecommunications failure, earthquakes, acts of war or terrorism, acts of God, computer viruses, physical or electronic break-ins, and similar events or disruptions. Any of these events could cause system interruption, delays, and loss of critical data, and could prevent us from accepting and fulfilling customer orders which could make our product offerings less attractive and subject us to liability. Our systems are not fully redundant, and our disaster recovery planning may not be sufficient. In addition, we may have inadequate insurance coverage to compensate for any related losses. Any of these events could damage our reputation and be expensive to remedy.\nOur future success depends on the continuing efforts of our management and key employees, and on our ability to attract and retain highly skilled personnel and senior management.\nWe depend on the talents and continued efforts of our senior management and key employees. The loss of members of our management or key employees may disrupt our business and harm our results of operations. Furthermore, our ability to manage further expansion will require us to continue to attract, motivate, and retain additional qualified personnel. Competition for this type of personnel is intense, and we may not be successful in attracting, integrating, and retaining the personnel required to grow and operate our business effectively. There can be no assurance that our current management team, or any new members of our management team, will be able to successfully execute our business and operating strategies.\nIf our other intangible assets, or fixed assets become impaired, we may be required to record a charge to our earnings.\nDuring fiscal year 2023 and 2022, we incurred $0 and $56.67 million, respectively of goodwill impairment and $13.22 and $4.29 million, respectively, of intangible impairment as noted in Note 5 of our financial statements. We may be required to record future impairments of other intangible assets, or fixed assets to the extent the fair value of these assets falls below their book value. Our estimates of fair value are based on assumptions regarding future cash flows, gross margins, expenses, discount rates applied to these cash flows, and current market estimates of value. Estimates used for future sales growth rates, gross profit performance, and other assumptions used to estimate fair value could cause us to record material non-cash impairment charges, which could harm our results of operations and financial condition.\nRISKS RELATED TO THE REGULATORY ENVIRONMENT FOR CBD\nLack of clarity and changes to Federal or state laws pertaining to industrial hemp could slow the use of industrial hemp which would materially impact our revenues in future periods.\nContinued development of the industrial hemp industry will be dependent upon new legislative authorization of industrial hemp at the state level, expansion of current state approvals for hemp products, and further amendment or supplementation of legislation at the federal level, including re-authorization and expansion of the hemp language in the upcoming 2024 Farm Act. Any number of events or occurrences could slow or halt progress all together in this space. While progress within the industrial hemp industry is currently encouraging, growth is not assured. While there appears to be ample public support for favorable legislative action, numerous factors may impact or negatively affect the legislative process(es) within the various states where we have business interests. Any one of these factors could slow or halt use of industrial hemp, which could negatively impact the business up to possibly causing us to discontinue operations as a whole. In addition, changes in Federal or state laws could require us to alter the way we conduct our business in order to remain compliant with applicable state laws in ways we are presently unable to foresee. These possible changes, if necessary, could be costly and may adversely impact our results of operations in future periods.\nCosts associated with compliance with numerous laws and regulations could impact our financial results. In addition, we could become subject to increased litigation risks associated with the CBD industry.\nThe manufacture, labeling and distribution by us of the hemp-based cannabinoid products is regulated by various federal, state and local agencies. These governmental authorities may commence regulatory or legal proceedings, which could restrict the permissible scope of our product claims or the ability to sell products in the future. We are subject to regulation by the federal government and other state and local agencies as a result of our hemp-based cannabinoid products. The shifting compliance environment and the need to build and maintain robust systems to comply with different compliance in multiple jurisdictions increases the possibility that we may violate one or more of the requirements. If our operations are found to be in violation of any of such laws or any other governmental regulations that apply to our company, we may be subject to penalties, including, without limitation, civil and criminal penalties, damages, fines, the curtailment or restructuring of our operations, any of which could adversely affect the ability to operate our business and our financial results. Failure to comply with the various federal, state and local requirements may result in, among other things, injunctions, product withdrawals, recalls, product seizures, fines and criminal prosecutions. We are seeing increasing state-level labeling requirements that may increase our costs with respect to monitoring and adhering to unique label requirements in addition to potential product and packaging obsolescence costs. Our advertising is subject to regulation by the U.S. Federal Trade Commission, or FTC, under the Federal Trade Commission Act, and is subject to various state regulations enforced by state agencies and state attorneys general. Additionally, some states also permit advertising and labeling laws to be enforced by private attorneys general who may seek relief for consumers, seek class-action certifications, seek class-wide damages and product recalls of products sold by us. Any actions against our company by governmental authorities or private litigants could be time consuming, costly to defend and could have a material adverse effect on our business, financial condition, and results of operations.\nUncertainty caused by potential changes to legal regulations could impact the use of CBD products.\nThere is substantial uncertainty and different interpretations among federal, state and local regulatory agencies, legislators, academics and businesses as to the scope of operation of Farm Bill-compliant hemp programs relative to the emerging regulation of cannabinoids. These different opinions include, but are not limited to, the regulation of cannabinoids by the U.S. Drug Enforcement Administration and/or the FDA and the extent to which manufacturers of products containing Farm Bill-compliant cultivators and processors may engage in interstate commerce. The uncertainties cannot be resolved without further federal, and perhaps even state-level, legislation, regulation or a definitive judicial interpretation of existing legislation and rules. If these uncertainties continue, they may have an adverse effect upon the introduction of our products in different markets.\nRISKS RELATED TO OWNERSHIP OF OUR SECURITIES\nWe are subject to the continued listing standards of the NYSE American and our failure to satisfy these criteria may result in de-listing of our securities.\nBoth our common stock and our Series A Convertible Preferred Stock are listed on the NYSE American. In order to maintain these listings, we must maintain certain share prices, financial and share distribution targets, including maintaining a minimum amount of shareholders equity and a minimum number of public shareholders. In addition to these objective standards, the NYSE American may delist the securities of any issuer (i) if, in its opinion, the issuers financial condition and/or operating results appear unsatisfactory; (ii) if it appears that the extent of public distribution or the aggregate market value of the security has become so reduced as to make continued listing on the NYSE American inadvisable; (iii) if the issuer sells or disposes of principal operating assets or ceases to be an operating company; (iv) if an issuer fails to comply with the NYSE Americans listing requirements; (v) if an issuers securities sell at what the NYSE American considers a low selling price and the issuer fails to correct this via a reverse split of shares after notification by the NYSE American; or (vi) if any other event occurs or any condition exists which makes continued listing on the NYSE American, in its opinion, inadvisable. If the NYSE American delists either our common stock and/or our Series A Convertible Preferred Stock, investors may face material adverse consequences, including, but not limited to, a lack of trading market for our securities, reduced liquidity, decreased analyst coverage of our securities, and an inability for us to obtain any additional financing to fund our operations that we may need.\nThe Series A Convertible Preferred Stock ranks junior to all of our indebtedness and other liabilities and is effectively junior to all indebtedness and other liabilities of our subsidiaries.\nIn the event of our bankruptcy, liquidation, dissolution or winding-up of our affairs, our assets will be available to pay obligations on the Series A Convertible Preferred Stock only after all of our indebtedness and other liabilities have been paid. The rights of holders of the Series A Convertible Preferred Stock to participate in the distribution of our assets will rank junior to the prior claims of our current and future creditors and any future series or class of preferred stock we may issue (subject to Series A Convertible Preferred Stockholder approval) that ranks senior to the Series A Convertible Preferred Stock. In addition, the Series A Convertible Preferred Stock effectively ranks junior to all existing and future indebtedness and other liabilities of our existing subsidiaries and any future subsidiaries. Our existing subsidiaries are, and any future subsidiaries would be, separate legal entities and have no legal obligation to pay any amounts to us in respect of dividends due on the Series A Convertible Preferred Stock. If we are forced to liquidate our assets to pay our creditors, we may not have sufficient assets to pay amounts due on any or all of the Series A Convertible Preferred Stock then outstanding.\nWe are currently unable to pay dividends on the Series A Convertible Preferred Stock.\nDuring August 2023, the Companys board of directors suspended dividend payment on the Series A Convertible Preferred Stock. We do not anticipate paying any accrued or future dividends on our Series A Convertible Preferred Stock in the future. In order for us to be eligible to pay the dividend, state law requires us to (i) either be able to pay our debts as they become due in the usual course of business, or (ii) have total assets that are greater than the sum of our total liabilities plus the amount that would be needed if we were to be dissolved at the time of the distribution to satisfy the preferential rights upon dissolution of shareholders whose preferential rights are superior to those receiving the distribution. Payment of our dividends depends upon our financial condition and other factors as our board of directors may deem relevant from time to time. We cannot assure you that our businesses will generate sufficient cash flow from operations in an amount sufficient to enable us to make distributions on our common stock and preferred stock, including the Series A Convertible Preferred Stock, or to fund our other liquidity needs.\nHolders of the Series A Convertible Preferred Stock may be unable to use the dividends-received deduction and may not be eligible for the preferential tax rates applicable to qualified dividend income.\nDistributions paid to corporate U.S. holders of the Series A Convertible Preferred Stock may be eligible for the dividends-received deduction, and distributions paid to non-corporate U.S. holders of the Series A Convertible Preferred Stock may be subject to tax at the preferential tax rates applicable to qualified dividend income, if we have current or accumulated earnings and profits, as determined for U.S. federal income tax purposes. We do not currently have any accumulated earnings and profits. Additionally, we may not have sufficient current earnings and profits during future fiscal years for the distributions on the Series A Convertible Preferred Stock to qualify as dividends for U.S. federal income tax purposes. If the distributions fail to qualify as dividends, U.S. holders would be unable to use the dividends-received deduction and may not be eligible for the preferential tax rates applicable to qualified dividend income. If any distributions on the Series A Convertible Preferred Stock with respect to any fiscal year are not eligible for the dividends-received deduction or preferential tax rates applicable to qualified dividend income because of insufficient current or accumulated earnings and profits, it is possible that the market value of the Series A Convertible Preferred Stock might decline.\nThe Series A Convertible Preferred Stock represents perpetual equity interests in us, and investors should not expect us to redeem or convert the Series A Convertible Preferred Stock on the date the Series A Convertible Preferred Stock becomes redeemable or convertible by us or on any particular date afterwards.\nThe Series A Convertible Preferred Stock represents perpetual equity interests in our company, and it has no maturity or mandatory redemption except upon a Change of Control, and is not redeemable at the option of investors under any other circumstances. A Change of Control will generally be deemed to occur when, after the original issuance of the Series A Convertible Preferred Stock, the acquisition by any person, including any syndicate or group deemed to be a person under Section 13(d)(3) of the Exchange Act, of beneficial ownership, directly or indirectly, through a purchase, merger or other acquisition transaction or series of purchases, mergers or other acquisition transactions which were pre-approved by our board of directors of our stock entitling that person to exercise more than 50% of the total voting power of all of our stock entitled to vote generally in the election of the our directors, subject to certain exclusions. As a result, the Series A Convertible Preferred Stock will not give rise to a claim for payment of any amount at a particular date. As a result, holders of the Series A Convertible Preferred Stock may be required to bear the financial risks of an investment in the Series A Convertible Preferred Stock for an indefinite period of time unless the holder chooses to voluntarily convert the shares of Series A Convertible Preferred Stock into shares of our common stock.\nChange of Control redemption obligations of the Series A Convertible Preferred Stock may make it more difficult for a party to acquire us or discourage a party from acquiring us.\nThe Change of Control redemption feature of the Series A Convertible Preferred Stock may have the effect of discouraging a third party from making an acquisition proposal for our company or of delaying, deferring or preventing certain of change of control transactions under circumstances that otherwise could provide the holders of our common stock and Series A Convertible Preferred Stock with the opportunity to realize a premium over the then-current market price of such stock or that shareholders may otherwise believe is in their best interests.\nA holder of Series A Convertible Preferred Stock has extremely limited voting rights.\nThe voting rights for a holder of Series A Convertible Preferred Stock are limited. Our shares of common stock are the only class of our securities that carry full voting rights. Holders of the shares of Series A Convertible Preferred Stock do not have any voting rights other than as set forth below in the next two sentences or unless dividends on the Series A Convertible Preferred Stock are in arrears for each of 12 or more consecutive monthly periods, in which case the holders of the Series A Convertible Preferred Stock will be entitled to vote as a separate class for the election of two additional directors to serve on the board of directors until all dividends that are owed have been paid. Holders of shares of Series A Convertible Preferred Stock, voting as a class, are also entitled to vote if we should seek to issue or create any class or series of capital stock ranking senior to the Series A Convertible Preferred Stock with respect to dividends or distributions, in which event the consent of holders of at least two thirds of the then outstanding Series A Convertible Preferred Stock is required. The consent of the holders of two thirds of the Series A Convertible Preferred Stock, voting as a class, is required if we were to seek to adopt any amendment to our articles of incorporation or bylaws that would materially affect existing terms of the Series A Convertible Preferred Stock, or increase the number of authorized shares of that series, other than in connection with the anti-dilution provisions, or if we seek to create a series or class which ranks pari passu with the Series A Convertible Preferred Stock. Other than these limited circumstances and except to the extent required by law, holders of Series A Convertible Preferred Stock do not have any voting rights.\nWe may redeem the Series A Convertible Preferred Stock at our option, we will be required to redeem the Series A Convertible Preferred Stock upon a Change of Control and we may convert shares of Series A Convertible Preferred Stock upon a Market Trigger into shares of our common stock. In the event of any of these occurrences, you may not receive dividends that you anticipate.\nOn or after October 16, 2023 we may, at our option, redeem the Series A Convertible Preferred Stock, in whole or in part, at any time or from time to time. In addition, upon the occurrence of a board approved Change of Control, we are required to redeem any or all of the shares of Series A Convertible Preferred Stock at a redemption price of $11.00 per share, plus any accrued but unpaid dividends to, but excluding, the redemption date. Furthermore, upon a Market Trigger (as that term is defined in the designations, rights and preferences of the Series A Convertible Preferred Stock), we may convert all or any portion of those shares of Series A Convertible Preferred Stock into shares of our common stock. We may have an incentive to redeem or convert the Series A Convertible Preferred Stock voluntarily if market conditions allow us to issue other preferred stock or debt securities at a rate that is lower than the dividend rate on the Series A Convertible Preferred Stock. If we redeem or convert the Series A Convertible Preferred Stock, then from and after the redemption date or conversion date, as applicable, dividends will cease to accrue on shares of Series A Convertible Preferred Stock, the shares of Series A Convertible Preferred Stock shall no longer be deemed outstanding and all rights as a holder of those shares will terminate, including the rights to receive dividend payments.\nThe liquidation preference of the shares of our Series A Convertible Preferred Stock would reduce the amount available to our common shareholders in the event of our liquidation or winding up.\nHolders of our Series A Convertible Preferred Stock have a liquidation preference of $10.00 per share in the event of our liquidation or winding up. This means that those holders are entitled to receive the liquidation preference before any payment or other distribution of assets to our common shareholders, and the amount of any such payment or other distribution will be reduced by that amount.\nThe issuance of shares upon exercise of our outstanding options, restricted stock awards and warrants, or the conversion of the Series A Convertible Preferred Stock may cause immediate and substantial dilution to our existing shareholders.\nWe presently have options, unvested restricted stock awards and warrants that if exercised would result in the issuance of an additional 93,222 shares of our common stock, and our Series A Convertible Preferred Stock is presently convertible into an additional 185,223 shares of common stock. The issuance of shares upon exercise of warrants and options and/or the conversion of shares of our Series A Convertible Preferred Stock will result in dilution to the interests of other shareholders.\nCompanys former Co-CEOs ongoing legal challenges with the SEC could impact customers and investors perception of the Company.\nIn May of 2022, our former Co-CEO was indicted civilly by the SEC for activities prior to 2019. While the Company was not named as a defendant and we strongly believe no improprieties occurred by the Company, his ongoing legal proceedings and any association could impact customers and investors perception of the Company. ITEM 1B. UNRESOLVED STAFF COMMENTS.\nNot applicable to a smaller reporting company. ITEM 2. DESCRIPTION OF PROPERTY.\nOur headquarters are located in approximately 50,000 square feet in a modern two-story building in Charlotte, North Carolina which we sub-lease under an agreement which began August 1, 2019 and goes through December 2026. The agreement calls for an annual base monthly rent of $76,041 for the first year and escalates 3% annually. We are currently behind in lease payments on our headquarter facility, received a default notice from the landlord in September 2023, and are attempting to renegotiate with the landlord and find another party to sublet or assume our lease. We also have an 80,000 square foot warehouse in Charlotte, North Carolina under an agreement which began November 2019 and goes through December 2024. The agreement calls for an annual base monthly rent of $34,766, inclusive of monthly TICAM for the first year and the rent escalates 3% annually. We currently sublet a portion of our warehouse to offset its expense. ITEM 3. LEGAL PROCEEDINGS.\nIn December 2019, Cynthia Davis filed a purported collective and class action lawsuit in the United States District Court for the Central District of California against cbdMD and certain of our competitors alleging violations of the Californias Unfair Competition Law, Californias False Advertising Law and Californias Consumer Legal Remedies Act, as well as claims for Breach of Express Warranties, Breach of Implied Warranty of Merchantability and Declaratory Relief. On March 4, 2021 the Court granted cbdMDs motion to stay the case until the FDA or Congress takes definitive action on the regulatory status of CBD and the case remains in this status as of this filing. The Company believes this matter will eventually be dismissed but there is no timeline on when the FDA or Congress will take action so the case is expected to be stayed indefinitely.\nIn April 2019 our wholly owned subsidiary, CBDI, filed a cancellation proceeding before the U.S. Patent and Trademark Office Trademark Trial and Appeal Board (TTAB) against Majik Medicine, LLC to cancel its issued supplemental register trademark for CBD MD on multiple grounds. On February 12, 2021 CBDI filed a complaint against Majik Medicine in Federal Court in North Carolina seeking, among other things, the cancellation of Majik Medicines CBD MD mark on various grounds (the Civil Action). On April 28, 2021 the TTAB ruled in favor of a motion filed by CBDI to suspend the cancellation proceedings pending final determination in the Civil Action. The case is currently in the discovery phase. The Company will continue to vigorously pursue its rights and protect the cbdMD brand.\nIn 2022 the global settlement between Company and Plaintiffs in the matter of Warshawsky et al v. cbdMD was approved by the court and the case was dismissed with prejudice. ITEM 4. MINE SAFETY DISCLOSURES.\nNot applicable to our company.\nPART II ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES.\nSince May 1, 2019, commensurate with our name change, our common stock has been listed on the NYSE American under the symbol YCBD and from November 17, 2017 through May 1, 20219 our common stock was listed on the NYSE American under the symbol LEVB.\nOur Series A Convertible Preferred Stock has been listed on the NYSE American since October 21, 2019 under the symbol YCBDpA.\nAs of December 9, 2023, there were approximately 11,419 street owners of our common stock and 1,462 street holder of our Series A Convertible Preferred Stock. These amounts do not reflect persons or entities that hold our securities in nominee or street name through various brokerage firms.\nDividend policy\nCommon Stock\nWe do not currently intend to pay dividends on our common stock. The declaration, amount and payment of any future dividends on shares of our common stock, if any, is subject to the designations, rights and preferences of the Series A Convertible Preferred Stock and will be at the sole discretion of our Board, which may take into account general and economic conditions, our financial condition and results of operations, our available cash and current and anticipated cash needs, capital requirements, contractual, legal, tax and regulatory restrictions, the implications of the payment of dividends by us to our shareholders or by our subsidiaries to us, and any other factors that our Board may deem relevant.\nSeries A Convertible Preferred Stock\nAs of the date of this filing, there are 5 million shares of our Series A Convertible Preferred Stock outstanding. The designations, rights and preferences of our Series A Convertible Preferred Stock provide that we will pay, when, as and if declared by our board of directors, monthly cumulative cash dividends at an annual rate of 8.0%, which is equivalent to $0.80 per annum per share, based on the $10.00 liquidation preference. Dividends on the Series A Convertible Preferred Stock will accrue daily and be cumulative from, and including, the first day of the calendar month in which the shares are issued and will be payable monthly in arrears approximately on the 15th day of each calendar month. From November 1, 2019 until August 1, 2023 the Audit Committee of our board of directors declared a cash dividend of $0.0667 per share of Series A Convertible Preferred Stock payable on or around the 15th of each month to holders of record on the first of each month. On August 22, 2023 the Board of Directors suspended the monthly cash dividend payment on the Companys 8.0% Series A Cumulative Convertible Preferred Stock beginning with the month ending August 31, 2023 as the Company conserves cash in order to continue its efforts to increase sales, develop additional products, continue research and development, reduce operating expenses and attempt to achieve profitability. See Risk Factors.\nRecent sales of unregistered securities\nNone, except as previously reported.\nPurchases of equity securities by the issuer and affiliated purchasers\nNone. ITEM 6. [Reserved] ITEM 7.\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS.\nThe following discussion of our financial condition and results of operations should be read in conjunction with the unaudited condensed consolidated financial statements and the notes to those statements that are included elsewhere in this report. Our discussion includes forward-looking statements based upon current expectations that involve risks and uncertainties, such as our plans, objectives, expectations and intentions. Actual results and the timing of events could differ materially from those anticipated in these forward-looking statements because of several factors, including those set forth under the Part I, Item 1A, Risk Factors and Business sections in this report, and our other filings with the Securities and Exchange Commission. We use words such as anticipate, estimate, plan, project, continuing, ongoing, expect, believe, intend, may, will, should, could, and similar expressions to identify forward-looking statements. In addition, any statements that refer to projections of our future financial performance, our anticipated growth and trends in our businesses, and other characterizations of future events or circumstances are forward-looking statements. Such statements are based on our current expectations and could be affected by the uncertainties and risk factors described throughout this report.\nOverview\nWe own and operate the nationally recognized CBD (cannabidiol) brands cbdMD, Paw CBD and cbdMD Botanicals. We believe that we are an industry leader in producing and distributing broad spectrum CBD products and now full spectrum CBD products. Our mission is to enhance our customers overall quality of life while bringing CBD education, awareness and accessibility of high quality and effective products to all. We source cannabinoids, including CBD, which are extracted from non-GMO hemp grown on farms in the United States. Our innovative broad spectrum formula utilizes one of the purest hemp extracts, containing CBD, CBG and CBN, while eliminating the presence of tetrahydrocannabinol (THC). Non-THC is defined as below the level of detection using validated scientific analytical methods. Our full spectrum products contain a variety of cannabinoids and terpenes in addition to CBD while maintaining trace amounts of THC that falls within the limits set in the 2018 Farm Bill. In addition to our core brands, we also operate cbdMD Therapeutics, LLC to capture the Companys ongoing investments in science related to its existing and future products, including research and development activities for therapeutic applications.\nDuring 2023 we continued to focus on our path to profitability by lowering our costs and focusing on the customer experience. We transitioned a significant part of our organization during the first half of the year in addition to our ecommerce platform at the end of the third quarter. Fiscal 2023 proved to be more challenging for the Company and industry as a whole as inflation reached 30 year records. While we have not yet achieved positive operating income, management has worked hard to rationalize cost structure during fiscal 2023 and we have successfully achieved 8 sequential quarters of Non-GAAP Adjusted Operating Income improvement, although our revenues were negatively impacted as we tightened our marketing spend and consumers were impacted by inflation trends. Operationally we continued to optimize our product portfolio, adding to our NSF for Sport as well as our hemp-derived delta 9 line of products. Since year end we added the hempMD and ATRX line of products to open up and expand our distribution channels and customer base and refreshed our website to improve the customer experience. We believe we are well positioned to take market share during fiscal 2024.\nResults of operations\nThe following tables provide certain selected consolidated financial information for the fiscal years ended September 30, 2023 and 2022:\nFiscal\nFiscal\nChange\nTotal net sales\n$ 24,155,362\n$ 35,403,224\n$ (11,247,862 )\nCost of sales\n9,177,703\n13,066,639\n(3,888,936 )\nGross profit as a percentage of net sales\n62.0 %\n63.1 %\n-1.1 %\nOperating expenses\n24,246,208\n39,647,130\n(15,400,922 )\nImpairment of goodwill and other intangible assets\n13,219,000\n60,955,970\n(47,736,970 )\nOperating loss from operations\n(22,487,549 )\n(78,266,515 )\n55,778,966\n(Increase) decrease on contingent liability\n185,638\n8,473,999\n(8,288,361 )\nNet loss before taxes\n(22,938,209 )\n(70,083,693 )\n47,145,484\nNet loss attributable to cbdMD Inc. common shareholders\n$ (26,940,209 )\n$ (74,085,698 )\n$ 47,145,489\nThe following tables provide certain selected unaudited consolidated financial information for the three months ended September 30, 2023 and 2022:\nSeptember\nSeptember\nChange\nTotal net sales\n$ 5,710,745\n$ 7,859,625\n$ (2,148,880 )\nCost of sales\n2,161,900\n2,844,744\n(682,844 )\nGross profit as a percentage of net sales\n62.1 %\n63.8 %\n-1.7 %\nOperating expenses\n5,546,915\n7,913,256\n(2,366,341 )\nImpairment of goodwill and other intangible assets\n13,219,000\n11,996,249\n1,222,751\nOperating income from operations\n(15,217,070 )\n(14,894,624 )\n(322,446 )\n(Increase) decrease on contingent liability\n31,867\n228,000\n(196,133 )\nNet loss before taxes\n(15,874,941 )\n(14,631,432 )\n(1,243,509 )\nNet loss attributable to cbdMD Inc. common shareholders\n$ (16,875,436 )\n$ (15,631,932 )\n$ (1,243,504 )\nSales\nWe record product sales primarily through two main delivery channels, direct to consumers via our E-commerce sales and direct to wholesalers utilizing our internal sales team. The following table provides information on the contribution of net sales by type of sale to our total net sales for the fiscal years ended September 30, 2023 and 2022.\nFiscal 2023\n% of total\nFiscal 2022\n% of total\nE-commerce sales\n$ 19,436,124\n80.5 %\n$ 26,435,203\n74.7 %\nWholesale sales\n4,719,238\n19.5 %\n8,968,021\n25.3 %\nTotal Net Sales\n$ 24,155,362\n$ 35,403,224\nIn addition, the following table provides information on the contribution of net sales by type of sale to our total net sales for the three months ended September 30, 2023 and 2022 (unaudited):\nSeptember 30,\nSeptember 30,\n% of total\n% of total\nE-commerce sales\n$ 4,639,651\n81.2 %\n$ 6,274,482\n79.8 %\nWholesale sales\n1,070,946\n18.8 %\n1,585,143\n20.2 %\nTotal Net Sales\n$ 5,710,597\n$ 7,859,625\nTotal net sales during the fiscal year ended September 30, 2023 decreased by approximately $11.2 million, or 32% as compared to fiscal year ended September 30, 2022. Wholesale sales decreased by approximately $4.2 million, or 47% year over year while E-commerce sales decreased by $7.0 million or 26%. The change in revenue was driven by a combination of broader CBD category softness which we believe is partially attributed to the macro inflationary environment in addition to management reducing unprofitable marketing expenses that resulted in an increase in net contribution, in addition to some stock outages later in the year. Net sales for the fourth quarter declined 27% year over year as a result of industry trends, a reduction of marketing spend and lower wholesale pricing initiatives with our new high-strength products that launched mid-September of 2022.\nOf our total net sales as indicated above, during the fiscal years ended September 30, 2023 and 2022 our Paw CBD line accounted for net sales of $2,404,787 and $3,748,779, respectively. The year over year decline in our Paw CBD brand is due to increasing competition and a rationalization in marketing efforts specific to the brand.\nCost of sales\nOur cost of sales includes costs associated with distribution, fill and labor expense, components, manufacturing overhead, third-party providers, and freight for our product sales. Our cost of sales as a percentage of net sales was 38.0% and 36.1% for fiscal years ended September 30, 2023 and 2022, respectively. While we made significant strides to reduce our overall fixed overhead cost associated with our cost of goods sold during fiscal 2022, gross margins for the year were impacted by lower overhead absorption based on lower revenue and ongoing product mix change from high-margin tinctures to gummies and functional products. For the fourth quarter of fiscal 2023 our cost of sales as a percentage of net sales was 37.9% as compared to 36.2% in the prior year comparative period. The change reflects the product mix change to our higher strength and additional inventory write downs during the fourth quarter.\nOperating expenses\nOur principal operating expenses include staff related expenses, advertising (which includes expenses related to industry distribution and trade shows), sponsorships, affiliate commissions, merchant fees, technology, travel, rent, professional service fees, and business insurance expenses. Our operating expenses on a consolidated basis decreased approximately $15.1 million, excluding impairment charges, or 37.5% for the fiscal year ended September 30, 2023 versus the fiscal year ended September 30, 2022. The decrease can be attributed to managements efforts to rationalize and right size our expenses across all areas of our business, especially a $5.3 million reduction in payroll, $8.3 million reduction of marketing expenses and $1.0 million of sponsorships. This was partially offset by a $0.8 million non-cash expense as we began amortizing intangibles.\nConsolidated Operating Expenses\nThe following tables provide information on our operating expenses for the fiscal years ended September 30, 2023 and 2022:\nFiscal 2023\nFiscal 2022\nChange\nStaff related expense\n$ 7,440,687\n$ 12,819,447\n$ (5,378,760 )\nAccounting/Legal expense\n986,295\n1,045,836\n(59,541 )\nPreofessional outside services\n846,475\n816,584\n29,891\nAdvertising/marketing/social media/events/tradeshows\n5,960,458\n14,332,235\n(8,371,777 )\nSponsorships\n18,750\n1,031,516\n(1,012,766 )\nAffiliate commissions\n971,132\n1,111,795\n(140,663 )\nMerchant Fees\n791,475\n1,007,025\n(215,550 )\nR&D and regulatory\n173,038\n633,392\n(460,354 )\nNon-cash stock compensation\n349,245\n1,124,130\n(774,885 )\nIntangibles amortization\n1,396,459\n884,380\n512,079\nDepreciation\n404,280\n948,946\n(544,666 )\nAll other expenses\n4,907,914\n3,891,844\n1,016,070\nTotals\n$ 24,246,208\n$ 39,647,130\n$ (15,400,922 )\nCorporate overhead and allocation of management fees to our segments\nIncluded in our consolidated operating expenses are expenses associated with our corporate overhead which are not allocated to the operating business unit, including (i) staff related expenses; (ii) accounting and legal expenses; (iii) professional outside services; (iv) travel and entertainment expenses; (v) rent; (vi) business insurance; and (vii) non-cash stock compensation expense.\nThe following tables provide information on our corporate overhead for the fiscal years ended September 30, 2023 and 2022:\nFiscal 2023\nFiscal 2022\nChange\nStaff related expense\n$ 318,762\n$ 1,066,428\n$ (747,666 )\nAccounting/Legal expense\n704,933\n728,250\n(23,317 )\nProfessional outside services\n428,923\n330,633\n98,290\nTravel expense\n-\n3,932\n(3,932 )\nBusiness insurance\n783,781\n703,107\n80,674\nNon-cash stock compensation\n349,245\n1,124,130\n(774,885 )\nTotals\n$ 2,585,644\n$ 3,956,480\n$ (1,370,836 )\nThe 44.6% decrease in corporate related expenses for the fiscal year ended September 30, 2023 over prior year is primarily due to the decreases in non-cash stock compensation to employees and directors tied to fewer shares issued under our equity incentive plans and at lower prices per share and, decreases in staffing related expenses as well as legal and accounting costs. The decrease was partially offset by $98,000 in professional outside services and increased business insurance rates.\nThe corporate operating expenses are primarily related to the ongoing public company related activities.\nTherapeutics Overhead\nIncluded in our consolidated operating expenses are expenses associated with Therapeutics which are not allocated to the operating business unit, including staff related expenses and R&D and regulatory expenses. The Therapeutic operating expenses include research and development activities for therapeutic applications. Year over years decline is primarily driven by the finishing of our clinical studies.\nThe following tables provide information on our approximate corporate overhead for the fiscal years ended September 30, 2023. Therapeutics was formed March 15, 2021.\nFiscal 2023\nFiscal 2022\nChange\nStaff related expense\n$ 357,871\n$ 338,985\n$ 18,886\nAccounting and legal\n-\n3,119\n3,119\nR&D and Regulatory\n158,795\n565,096\n(406,301 )\nTotals\n$ 516,666\n$ 907,200\n$ (384,296 )\nOther income and other non-operating expenses\nWe also record income and expenses associated with non-operating items. The material components of those are set forth below.\nDecrease in contingent liability\nAs described in Note 6 to the notes to the consolidated financial statements appearing elsewhere in this report, the earn-out provision for the Earnout Shares is accounted for and recorded as a contingent liability with increases in the liability recorded as non-cash other expense and decreases in the liability recorded as non- cash other income. For the three months ended September 30, 2023, the remaining contingent liabilities associated with the business combination, after the issuance of the second quarter fourth marking period Earnout Shares, were decreased by $0.03 million to reflect their reassessed fair values as of September 30, 2023. This decrease in the contingent liability is mostly due to the change in our common stock share price between June 30, 2023 to September 30, 2023 from $1.40 per share to $1.03 per share. For the twelve months ended September 30, 2023, the contingent liability decreased $0.19 million decrease primarily related to the change in our common stock share price between September 30, 2022 to September 30, 2023 from $10.25 per share to $1.03 per share. The earnout ended November 2023 and we will record a final change in the non-cash contingent liability in the first quarter of fiscal 2024.\nIn addition, as of September 30, 2023 the measuring period for the Twenty Two Earnout Shares is over, the threshold was not met and there is no longer any value ascribed to this on our balance sheet.\nLiquidity and Capital Resources\nWe had cash and cash equivalents on hand of $1.8 million and working capital of $3.4 million at September 30, 2023 as compared to cash and cash equivalents on hand of $6.7 million and working capital of $10.7 million at September 30, 2022. Our current assets decreased approximately 49% at September 30, 2023 from September 30, 2022, which is primarily attributable to cash used by operations. Our current liabilities decreased approximately 13% at September 30, 2023 from September 30, 2022. This decrease is primarily attributable to a decrease in accounts payable and accrued expenses.\nDuring the three and twelve months ended September 30, 2023 we used cash primarily to fund our operations and pay the preferred dividend.\nWe do not have any commitments for capital expenditures. We have a commitment for cumulative dividends at an annual rate of 8% payable monthly in arrears for the prior month to our preferred shareholders. As of September 2023, we have stopped paying this in cash monthly and are accruing this dividend instead.\nWhile the Company is taking strong action and believes that it can execute its strategy and path to profitability within its balance sheet, and in its ability to raise additional funds, there can be no assurances to that effect. The Companys working capital position may not be sufficient to support the Companys daily operations for the twelve months subsequent to the issuance this report. The Companys ability to continue as a going concern is dependent upon its ability to improve profitability and cash flow and the ability to acquire additional funding. These and other factors raise substantial doubt about the Companys ability to continue as a going concern within twelve months after the date that our annual financial statements are issued. These financial statements do not include any adjustments to reflect the possible future effects on the recoverability and classification of assets or the amounts and classification of liabilities that may result in the Company not being able to continue as a going concern.\nOur goal from a liquidity perspective is to use operating cash flows to fund day to day operations and we have not met this goal as cash flow from operations has been a net use of $1.0 and $2.8 million for the three months ended September 30, 2023 and 2022, respectively $4.3 and $15.0 million for the twelve months ended September 30, 2023 and 2022, respectively.\nNon-GAAP Adjusted Operating Income\nThe non-GAAP Adjusted Income for the three and twelve months ended September 30, 2023 and September 30, 2022 is as follows:\nThree Months\nYear Ended\nSeptember 30,\nSeptember 30,\nSeptember 30,\nSeptember 30,\n(Unaudited)\nGAAP (loss) from operations\n$ (15,217,070 )\n$ (14,894,624 )\n$ (22,487,549 )\n$ (78,266,515 )\nAdjustments:\nDepreciation & Amortization\n667,950\n455,965\n1,800,739\n1,833,326\nEmployee and director stock compensation (1)\n33,263\n272,613\n349,245\n1,124,130\nInventory adjustment(2)\n70,000\n-\n70,000\n878,142\nImpairment of Goodwill and other intangible assets (3)\n13,219,000\n11,996,249\n13,219,000\n60,955,970\nIncremental bad debt\n45,000\n-\n45,000\n-\nAccrual for severance (4)\n-\n-\n-\n129,761\na360 non-cash trade credit\n609,732\n-\n1,476,967\n-\nAccrual / expenses for discretionary bonus\n-\n-\n-\n150,000\nNon-GAAP adjusted (loss) from operations\n$ (572,125 )\n$ (2,169,797 )\n$ (5,526,598 )\n$ (13,195,186 )\n(1) Represents non-cash expense related to options, warrants, restricted stock expenses that have been amortized during the period.\n(2) Represents an operating expense related to inventory loss related to regulatory changes impacting labels and packaging and obsolete/expired inventory.\n(3) Represents non-cash impairment of the cbdMD, DCO and Technology Relief from Royalty trademarks of $13.21 million during the fourth quarter of fiscal 2023, non-cash impairment of the cbdMD trademark of $4.28 million during the first quarter of fiscal year 2022 and $56.67 million of goodwill impairment during the fiscal year ended 2022.\n(4) Represents one-time severance costs incurred as the Company rationalized a number of positions.\nEarnout Shares\nAs described in Note 6 in notes to our consolidated financial statements appearing elsewhere in this report, on March 31, 2021 we entered into Addendum No. 1 to the Merger Agreement with the holders of the remaining Earnout Rights which amended the measurement periods within the third marking period to change the determination of the aggregate net revenues within the third marking period to a quarterly basis for each of the six fiscal quarters within the third marking period, beginning with the quarter ended March 31, 2021, instead of the initial 18 month period. The fourth and final marking period runs through November 2023.\nCritical accounting policies\nThe preparation of financial statements and related disclosures in conformity with US GAAP and our discussion and analysis of our financial condition and operating results require our management to make judgments, assumptions and estimates that affect the amounts reported in our consolidated financial statements and accompanying notes. Note 1, Organization and Summary of Significant Accounting Policies, of the Notes to our consolidated financial statements appearing elsewhere in this report describes the significant accounting policies and methods used in the preparation of our consolidated financial statements. Management bases its estimates on historical experience and on various other assumptions it believes to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities. Actual results may differ from these estimates, and such differences may be material.\nWe believe that the following critical accounting policies involve the more significant judgments and estimates used in the preparation of our consolidated financial statements and are the most critical to aid you in fully understanding and evaluating our reported financial results. Management considers these policies critical because they are both important to the portrayal of our financial condition and operating results, and they require management to make judgments and estimates about inherently uncertain matters.\nInventory\nInventory is stated at the lower of cost or net realizable value with cost being determined on a weighted average basis. The cost of inventory includes product cost, freight-in, and production fill and labor (portions of which we outsource to third party manufacturers). Write-offs of potentially slow moving or damaged inventory are recorded based on managements analysis of inventory levels, forecasted future sales volume and pricing and through specific identification of obsolete or damaged products. We assess inventory quarterly for slow moving products and potential impairments and at a minimum perform a physical inventory count annually near fiscal year end.\nRevenue Recognition\nThe Company recognizes revenue in accordance with ASC 606, Revenue from Contracts with Customer (ASC 606). The Company performs the following five steps: (i) identify the contract(s) with a customer, (ii) identify the performance obligations in the contract, (iii) determine the transaction price, (iv) allocate the transaction price to the performance obligations in the contract, and (v) recognize revenue when (or as) the entity satisfies a performance obligation. The Company applies the five-step model to arrangements that meet the definition of a contract under the standard, including when it is probable that the entity will collect the consideration it is entitled to in exchange for the goods or services it transfers to the customer. At contract inception, once the contract is determined to be within the scope of revenue accounting, the Company evaluates the goods or services promised within each contract related performance obligation and assesses whether each promised good or service is distinct. The Company recognizes as revenue, the amount of the transaction price that is allocated to the respective performance obligation when (or as) the performance obligation is satisfied.\nThe Company records revenue from the sale of its products when risk of loss and title to the product are transferred to the customer, which is upon shipping (and is typically FOB shipping) which is when our performance obligation is met. Net sales are comprised of gross revenues less product returns, trade discounts and customer allowances, which include costs associated with off-invoice mark-downs and other price reductions, as well as trade promotions. These incentive costs are recognized at the later of the date on which the Company recognizes the related revenue or the date on which the Company offers the incentive. The Company currently offers a 60-day, money back guarantee.\nImpairment of Long Lived Assets\nThe Company reviews all intangible assets for impairment whenever events or changes in circumstances indicate the carrying amount of the assets may not be recoverable. Long-lived assets, such as property and equipment and intangible assets subject to depreciation and amortization, are reviewed for impairment whenever events or changes in circumstances indicate that the carrying value of these assets may not be recoverable or that the useful life is shorter than the Company had originally estimated. Recoverability of these assets is measured by comparison of the carrying amount of each asset or asset group to the future undiscounted cash flows the asset or asset group is expected to generate over their remaining lives. If the asset or asset group is considered to be impaired, the amount of any impairment is measured as the difference between the carrying value and the fair value of the impaired asset or asset group. If the useful life is shorter than originally estimated, the Company amortizes the remaining carrying value over the new shorter useful life. Impairment losses are recorded in selling, general, and administrative expense in the consolidated statements of operations. There was $13,219,000 and $4,285,000 of impairment losses recognized related to long-lived assets for the year ended September 30, 2023 and September 30, 2022, respectively.\nRecent accounting pronouncements\nPlease see Note 1 - Organization and Summary of Significant Accounting Policies appearing in the consolidated financial statements included in this report for information on accounting pronouncements.\nOff balance sheet arrangements\nAs of the date of this report, we do not have any off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources that are material to investors. The term \"off-balance sheet arrangement\" generally means any transaction, agreement or other contractual arrangement to which an entity unconsolidated with us is a party, under which we have any obligation arising under a guarantee contract, derivative instrument or variable interest or a retained or contingent interest in assets transferred to such entity or similar arrangement that serves as credit, liquidity or market risk support for such assets. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK.\nNot applicable for a smaller reporting company. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA.\nPlease see our Financial Statements beginning on page 31 of this annual report.\nThe Auditor Firm ID for our external auditors, Cherry Bekaert LLP, is 677. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE.\nNone. ITEM 9A. CONTROLS AND PROCEDURES.\nEvaluation of Disclosure Controls and Procedures.\nWe maintain disclosure controls and procedures that are designed to ensure that information required to be disclosed in our reports filed pursuant to the Exchange Act is recorded, processed, summarized, and reported within the time periods specified in the Commissions rules and forms and that such information is accumulated and communicated to our management, including Interim Chief Executive Officer (principal executive officer) and Chief Financial Officer, as appropriate, to allow for timely decisions regarding required disclosure. In designing and evaluating the disclosure controls and procedures, management recognizes that any controls and procedures, no matter how well designed and operated, can provide only reasonable assurance of achieving the desired control objectives, and management is required to apply its judgment in evaluating the cost-benefit relationship of possible controls and procedures.\nAs required by Exchange Act Rule 13a-15(e), we carried out an evaluation, under the supervision and with the participation of our management, including our Interim Chief Executive Officer and our Chief Financial Officer, of the effectiveness of the design and operation of our disclosure controls and procedures. Based on that evaluation, our Interim Chief Executive Officer and our Chief Financial Officer concluded that our disclosure controls were effective at September 30, 2023.\nManagements Report on Internal Control over Financial Reporting.\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting as defined in Rule 13a-15(f) under the Exchange Act. Our internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. Our internal control over financial reporting includes those policies and procedures that:\n●\npertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of our assets;\n●\nprovide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that our receipts and expenditures are being made only in accordance with authorizations of our management and directors; and\n●\nprovide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of our assets that could have a material effect on the financial statements.\nBecause of the inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate. All internal control systems, no matter how well designed, have inherent limitations. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation. Because of the inherent limitations of internal control, there is a risk that material misstatements may not be prevented or detected on a timely basis by internal control over financial reporting. However, these inherent limitations are known features of the financial reporting process. Therefore, it is possible to design into the process safeguards to reduce, though not eliminate, this risk.\nOur management, including our Interim Chief Executive Officer and Chief Financial Officer assessed the effectiveness of our internal control over financial reporting as of September 30, 2023. In making this assessment, our management used the criteria set forth by the Committee of Sponsoring Organizations of the 2013 Treadway Commission (COSO) in Internal Control-Integrated Framework. Based on that evaluation, they concluded that, during the period covered by this report, such internal controls and procedures were effective.\nChanges in Internal Control over Financial Reporting\nThere have been no changes in our internal control over financial reporting during our last fiscal year that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting, but for the additional review procedures renumerated above. ITEM 9B. OTHER INFORMATION.\nNone.\nITEM 9C. DISCLOSURE REGARIND FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS.\nNone.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE.\nThe information required by this Item will be contained in our proxy statement for our 2024 Annual Meeting of shareholders to be filed on or prior to January 28, 2024 (the Proxy Statement) and is incorporated herein by this reference. ITEM 11. EXECUTIVE COMPENSATION.\nThe information required by this item will be contained in our Proxy Statement and is incorporated herein by this reference. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS.\nThe information required by this item will be contained in our Proxy Statement and is incorporated herein by this reference. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE.\nThe information required by this item will be contained in our Proxy Statement and is incorporated herein by this reference. ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES.\nThe information required by this item will be contained in our Proxy Statement and is incorporated herein by this reference.\nPART IV ITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES.\n(a)\n(1) Financial statements.\nThe consolidated financial statements and Report of Independent Registered Accounting Firm begin on page 31.\n(2) Financial statement schedules\nAll schedules for which provision is made in the applicable accounting regulations of the SEC are either not required under the related instructions, are not applicable (and therefore have been omitted), or the required disclosures are contained in the consolidated financial statements herein.\n(3) Exhibits.\nThe exhibits that are required to be filed or incorporated by reference herein are listed in the Exhibit Index.\nITEM 16. FORM 10-K SUMMARY.\nNone\nEXHIBIT INDEX\nIncorporated by\nReference\nFiled or\nFurnished\nHerewith\nNo.\nExhibit Description\nForm\nDate Filed\nNumber\n1.1\nUnderwriting Agreement, dated as of April 30, 2023, between cbdMD, Inc. and Maxim Group LLC 8-K\n5/3/23\n1.1\n2.1\nMerger Agreement dated December 3, 2018 by and among Level Brands, Inc., AcqCo, LLC, cbdMD LLC and Cure Based Development, LLC\n8-K\n12/4/18\n2.1\n2.2\nArticles of Merger dated December 20, 2018 as filed with the Secretary of State of Nevada merging AcqCo, LLC with and into Cure Based Development, LLC\n10-Q\n2/14/19\n2.2\n2.3\nArticles of Merger dated December 20, 2018 as filed with the Secretary of State of North Carolina merging AcqCo, LLC with and into Cure Based Development, LLC\n10-Q\n2/14/19\n2.3\n2.4\nArticles of Merger dated December 20, 2018 as filed with the Secretary of State of Nevada merging Cure Based Development, LLC with an into cbdMD LLC\n10-Q\n2/14/19\n2.4\n2.5\nArticles of Merger dated December 20, 2018 as filed with the Secretary of State of North Carolina merging Cure Based Development, LLC with an into cbdMD LLC\n10-Q\n2/14/19\n2.5\n3.1\nArticles of Incorporation\n1-A\n9/18/17\n2.1\n3.2\nArticles of Amendment to the Articles of Incorporation filed April 22, 2015\n1-A\n9/18/17\n2.2\n3.3\nArticles of Amendment to the Articles of Incorporation filed June 22, 2015\n1-A\n9/18/17\n2.3\n3.4\nArticles of Amendment to the Articles of Incorporation filed November 17, 2016\n1-A\n9/18/17\n2.4\n3.5\nArticles of Amendment to the Articles of Incorporation filed December 5, 2016\n1-A\n9/18/17\n2.5\n3.6\nBylaws, as amended\n1-A\n9/18/17\n2.6\n3.7\nArticles of Amendment to Articles of Incorporation dated April 22, 2019\n8-K\n4/29/19\n3.7\n3.8\nArticles of Amendment to the Articles of Incorporation including the Certificate of Designations, Rights and Preferences of the 8% Series A Cumulative Convertible Preferred Stock filed October 11, 2019\n8-A\n10/11/19\n3.1(f)\n4.1\nForm of common stock certificate of the registrant\n1-A\n9/18/17\n3.7\n4.2\n2015 Equity Compensation Plan+\n1-A\n9/18/17\n3.8\n4.3\nForm of stock option award under 2015 Equity Compensation Plan+\n1-A\n9/18/17\n3.9\n4.4\n2021 Equity Compensation Plan+\n8-K\n1/14/21\n10.1\n4.5\nForm of Representatives Warrant dated November 16, 2018\nS-1\n9/26/18\n4.10\n4.6\nForm of Representatives Warrant dated May 15, 2019\n8-K\n5/14/19\n4.1\n4.7\nForm of Representatives Warrant dated October 16, 2019\n8-K\n10/16/19\n4.1\n4.8\nForm of Representatives Warrant dated January 9, 2020\n8-K\n1/10/20\n4.1\n4.9\nForm of Representatives Warrant dated December 11, 2020\n8-K\n12/9/20\n4.1\n4.10\nForm of Representatives Warrant dated June 28, 2021\n8-K\n6/30/21\n4.1\n4.11\nForm of Representatives Warrant dated May 3, 2023 8-K\n5/3/23\n4.1\n10.1\nForm of Indemnification Agreement\n1-A\n9/18/17\n6.21\n10.2\nOffice Lease dated July 11, 2019\n10-Q\n8/14/19\n10.1\n10.3\nWarehouse Lease dated August 27, 2019\n10-Q\n2/13/20\n10.1\n10.4\nForm of Distribution Agreement dated February 26, 2020 by and among cbdMD, Inc., CBD Holdings, LLC and the members of CBD Holdings, LLC\n8-K\n2/28/20\n10.1\n10.5\nEndorsement Agreement effective July 1, 2020\n10-Q\n8/21/20\n10.1\n10.6\nAmended and Restated Executive Employment Agreement dated April 19, 2021 by and between cbdMD, Inc. and Martin A. Sumichrast+\n8-K\n4/21/21\n10.1\n10.7\nAmended and Restated Executive Employment Agreement dated April 19, 2021 by and between CBD Industries LLC and R. Scott Coffman+\n8-K\n4/21/21\n10.2\n10.8\nAsset Purchase Agreement by and among Twenty Two Capital, LLC, cbdMD, Inc., John J. Wiesehan III, Vieo Design, LLC and Bradley D. Trawick dated June 22, 2021\n8-K\n7/27/21\n10.1\n10.9\nEmployment Agreement between cbdMD, Inc. and John Wiesehan III dated July 22, 2021+\n8-K\n7/27/21\n10.2\n10.10\nJohn Wiesehan Separation Agreement and General Release dated December 1, 2021+\n8-K\n12/3/21\n10.1\n10.11\nExecutive Employment Agreement dated October 1, 2021 between cbdMD, Inc. and T. Ronan Kennedy+\n8-K\n10/5/21\n10.1\n10.12\nAmendment 1 to the Amended and Restated Executive Employment Agreement by and between cbd Industries, LLC and R. Scott Coffman Restated Agreement effective January 11, 2022+ 8-K\n1/18/22\n10.1\n10.13\nEquipment Purchase Agreement effective April 7, 2022 by and between cbd Industries, LLC and Old Belts Extracts LLC 10-Q\n5/13/22\n10.21\n10.14\nSeparation Agreement by and between Martin A. Sumchrast and cbdMD, Inc., and its subsidiaries effective June 11, 2022+ 8-K\n6/13/22\n10.1\n10.15\nMembership Interest Transfer Agreement dated June 22, 2022 10-Q\n8/11/22\n10.22\n10.16\nAgreement for Advertising Placement dated February 1, 2023 S-1\n3/13/23\n10.17\n10.17\nSide Letter - Keystone Capital Partners, LLC S-1\n3/13/23\n10.20\n10.18\nCommon Stock Purchase Agreement dated March 2, 2023 by and among cbdMD, Inc. and Keystone Capital Partners, LLC 8-K 3/2/23\n10.1\n10.19\nRegistration Rights Agreement dated March 2, 2023 by and among cbdMD, Inc. and Keystone Capital Partners, LLC 8-K\n3/2/23\n10.2\n14.1\nCode of Business Conduct and Ethics\n1-A\n9/18/17\n15.1\n19.1\nInsider Trading Policy\nFiled\n21.1\nSubsidiaries of the Registrant 10-K\n12/17/21\n21.1\n23.1\nConsent of Cherry Bekaert LLP\nFiled\n24.1\nPower of attorney (included on signature page of this report)\nFiled\n31.1\nRule 13a-14(a)/15d-14(a) Certification of Chief Executive Officer\nFiled\n31.2\nRule 13a-14(a)/15d-14(a) Certification of Chief Financial Officer\nFiled\n32.1\nSection 1350 Certification of Chief Executive Officer and Chief Financial Officer\nFiled\n97.1\nClawback Policy\nFiled\n101 INS\nInline XBRL Instance Document\nFiled\n101 SCH\nInline XBRL Taxonomy Extension Schema\nFiled\n101 CAL\nInline XBRL Taxonomy Extension Calculation Linkbase\nFiled\n101 LAB\nInline XBRL Taxonomy Extension Label Linkbase\nFiled\n101 PRE\nInline XBRL Taxonomy Extension Presentation Linkbase\nFiled\n101 DEF\nInline XBRL Taxonomy Extension Definition Linkbase\nCover Page Interactive Data File (embedded within the Inline XBRL and contained in Exhibit 101)\n+Indicates management contract or compensatory plan.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nDate: December 22, 2023\ncbdMD, Inc.\nBy:\n/s/ T. Ronan Kennedy\nT. Ronan Kennedy\nInterim Chief Executive Officer (Principal Executive Officer)\nDate: December 22, 2023\ncbdMD, Inc.\nBy:\n/s/ T. Ronan Kennedy\nT. Ronan Kennedy\nChief Financial Officer (Principal Accounting and Financial Officer)\nPOWER OF ATTORNEY\nKNOW ALL BY THESE PRESENTS, that each person whose signature appears below hereby constitutes and appoints Ronan Kennedy his true and lawful attorney-in-fact and agent, with full power of substitution and resubstitution, for him and in his name, place and stead, in any and all capacities, to sign any and all amendments and supplements to this report, and to file the same, with all exhibits thereto, and other documents in connection therewith, with the Securities and Exchange Commission, and hereby grants to such attorney-in-fact and agent, full power and authority to do and perform each and every act and thing requisite and necessary to be done, as fully to all intents and purposes as he might or could do in person, hereby ratifying and confirming all that said attorney-in-fact and agent, or his substitute or substitutes, may lawfully do or cause to be done by virtue hereof.\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nName\nPositions\nDate\n/s/ Scott Stephen\nChairman of the Board of Directors\nDecember 22, 2023\nScott Stephen\n/s/ Bakari Sellers\nDirector\nDecember 22, 2023\nBakari Sellers\n/s/ William Raines III\nDirector\nDecember 22, 2023\nWilliam Raines III\nDecember 22, 2023\n/s/ Sibyl Swift\nDirector, VP of Scientific and Regulatory Affairs\nSibyl Swift, PhD\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Shareholders of\ncbdMD, Inc. and subsidiaries\nCharlotte, North Carolina\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of cbdMD, Inc. and subsidiaries (the Company) as of September 30, 2023 and 2022, and the related consolidated statements of operations, comprehensive income (loss), shareholders equity, and cash flows for each of the years in the two-year period ended September 30, 2023, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of September 30, 2023 and 2022, and the results of its operations and its cash flows for each of the years in the two-year period ended September 30, 2023, in conformity with accounting principles generally accepted in the United States of America.\nSubstantial Doubt about the Companys Ability to Continue as a Going Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 1 to the accompanying financial statements, the Company has historically incurred losses, including a net loss of approximately $23 in the current year, resulting in an accumulated deficit of approximately $174 million as of September 30, 2023. These conditions raise substantial doubt about the Companys ability to continue as a going concern. Managements evaluations of the events and conditions and managements plans regarding those matters are also described in Note 1 to the accompanying financial statements. The accompanying financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audit, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the Audit Committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nIntangible Asset Impairment -Finite-lived intangible assets - Refer to Note 5 of the consolidated financial statements.\nCritical Audit Matter Description\nThe Companys consolidated finite-lived intangible assets, prior to the Companys impairment analysis, totaled approximately $17.0 million as of September 30, 2023. Finite-lived intangible assets are tested for impairment if events or circumstances indicate that the assets might be impaired. The Companys impairment evaluation of its finite-lived intangible assets involves the comparison of the fair value of the relevant asset group to their carrying values.\nThe Company performed an undiscounted cash flow analysis on the asset group and determined that the assets may not be recoverable. As such, the Company developed an estimate of fair value of the intangible assets.\nAs a result of the impairment test conducted by management, the Company recorded an impairment charge of approximately $13.2 million to its finite-lived intangible assets.\nGiven the significant estimates and assumptions management made to estimate the fair value of the finite-lived tradenames, performing audit procedures to evaluate the reasonableness of managements methodologies, inputs and assumptions required a high degree of auditor judgment and an increased extent of effort, including the need to involve our fair value specialists.\nHow the Critical Audit Matter Was Addressed in the Audit\nOur audit procedures with respect to managements assessment of impairment to its finite-lived intangible assets included the following, among others:\n●\nWe evaluated managements interpretations of the impairment model as outlined in ASC 360, including the reasonableness of their identification of the asset group and their allocation of identified impairment to the individual assets within the asset group.\n●\nWith the assistance of our fair value specialists, we evaluated the reasonableness of the methodologies utilized by management to derive their fair value estimates. We also evaluated the key inputs and assumptions utilized in the impairment analysis.\n/s/ Cherry Bekaert LLP\nWe have served as the Companys auditor since 2016.\nCharlotte, North Carolina\nDecember 22, 2023\nPART 1 - FINANCIAL INFORMATION\nITEM 1. CONSOLIDATED FINANCIAL STATEMENTS.\ncbdMD, INC.\nCONSOLIDATED BALANCE SHEETS\nSeptember 30, 2023 and 2022\nSeptember 30,\nSeptember 30,\nAssets\nCurrent assets:\nCash and cash equivalents\n$ 1,797,860 $ 6,720,234\nAccounts receivable\n1,216,090 1,447,831\nAccounts receivable - discontinued operations\n- 1,375\nInvestment other securities\n- 1,000,000\nInventory\n4,052,972 4,255,914\nInventory prepaid\n182,675 511,459\nPrepaid sponsorship\n70,061 1,372,845\nPrepaid expenses and other current assets\n750,383 701,945\nTotal current assets\n8,070,041 16,011,603\nOther assets:\nProperty and equipment, net\n716,579 823,310\nOperating lease assets\n3,350,865 4,477,841\nDeposits for facilities\n138,708 244,606\nIntangible assets\n3,219,090 17,834,549\nInvestment in other securities, noncurrent\n700,000 1,400,000\nTotal other assets\n8,125,242 24,780,306\nTotal assets\n$ 16,195,283 $ 40,791,909\nSee Notes to Consolidated Financial Statements\nCONSOLIDATED BALANCE SHEETS\nSeptember 30, 2023 and 2022\n(continued)\nSeptember 30,\nSeptember 30,\nLiabilities and shareholders' equity\nCurrent liabilities:\nAccounts payable\n$ 1,906,319 $ 2,036,558\nAccrued expenses\n1,484,441 2,060,762\nOperating leases - current portion\n1,277,089 1,178,683\nNote payable\n2,492 9,609\nTotal current liabilities\n4,670,341 5,285,612\nLong term liabilities:\nLong term liabilities\n9 125,491\nOperating leases - long term portion\n2,403,286 3,680,375\nContingent liability\n90,363 276,000\nTotal long term liabilities\n2,493,658 4,081,866\nTotal liabilities\n7,163,999 9,367,478\nCommitments and Contingencies (Note 11)\ncbdMD, Inc. shareholders' equity:\nPreferred stock, authorized 50,000,000 shares, $0.001 par value, 5,000,000 and 500,000 shares issued and outstanding, respectively\n5,000 5,000\nCommon stock, authorized 150,000,000 shares, $0.001 par value, 2,960,573 and 1,348,125 shares issued and outstanding, respectively\n2,961 1,348\nAdditional paid in capital\n183,387,095 178,841,646\nAccumulated deficit\n(174,363,772 ) (147,423,563 )\nTotal cbdMD, Inc. shareholders' equity\n9,031,284 31,424,431\nTotal liabilities and shareholders' equity\n$ 16,195,283 $ 40,791,909\nSee Notes to Consolidated Financial Statements\ncbdMD, INC.\nCONSOLIDATED STATEMENTS OF OPERATIONS\nSeptember 30, 2023 and 2022\nGross Sales\n$ 25,053,857 $ 37,122,215\nAllowances\n(898,495 ) (1,718,991 )\nTotal Net Sales\n24,155,362 35,403,224\nCost of sales\n9,177,703 13,066,639\nGross Profit\n14,977,659 22,336,585\nOperating expenses\n24,246,208 39,647,130\nImpairment of goodwill and other intangible assets\n13,219,000 60,955,970\nLoss from operations\n(22,487,549 ) (78,266,515 )\nRealized and unrealized loss on marketable and other securities, including impairments\n(700,000 ) (33,350 )\nGain (loss) on sale of assets\n- 88,769\nRestructuring expense\n- (602,092 )\nDecrease of contingent liability\n185,638 8,473,999\nOther income\n- 239,250\nInterest income\n63,702 16,246\nLoss before provision for income taxes\n(22,938,209 ) (70,083,693 )\nBenefit (expense) for income taxes\n- -\nNet Loss\n(22,938,209 ) (70,083,693 )\nPreferred dividends\n4,002,000 4,002,005\nNet Loss attributable to common shareholders\n$ (26,940,209 ) $ (74,085,698 )\nNet Loss per share:\nBasic loss per share\n(13.32 ) (55.80 )\nDiluted loss per share\n(13.32 ) (55.80 )\nWeighted average number of shares Basic:\n2,022,320 1,327,784\nWeighted average number of shares Diluted:\n2,022,320 1,327,784\nSee Notes to Consolidated Financial Statements\ncbdMD, INC.\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE LOSS\nFOR THE YEARS ENDED September 30, 2023 and 2022\nNet Loss\n$ (22,938,209 ) $ (70,083,693 )\nComprehensive Loss\n(22,938,209 ) (70,083,693 )\nPreferred dividends\n(4,002,000 ) (4,002,005 )\nComprehensive Loss available to common shareholders\n$ (26,940,209 ) $ (74,085,698 )\nSee Notes to Consolidated Financial Statements\ncbdMD, INC.\nCONSOLIDATED STATEMENT OF CASH FLOWS\nFOR THE YEARS ENDED September 30, 2023 and 2022\nCash flows from operating activities:\nNet Loss\n$ (22,938,209 ) $ (70,083,693 )\nAdjustments to reconcile net (income) loss to net cash used by operating activities:\nStock based compensation\n233,666 555,215\nRestricted stock expense\n109,202 373,610\nWrite off of prepaid assets due to termination of contractual obligation\n884,892 -\nMarketing stock amortization\n- 907,774\nInventory and materials impairment\n175,499 878,142\nIntangibles amortization\n1,396,459 884,380\nDepreciation\n404,280 948,962\nImpairment of goodwill and other intangible assets\n13,219,000 60,955,970\nGain on sale of fixed assets\n- (322,017 )\nIncrease/(Decrease) in contingent liability\n(185,638 ) (8,473,999 )\nRealized and unrealized gain of Marketable and other securities\n- 33,350\nOther-than-temporary impairment on other investments\n700,000 -\nAmortization of operating lease asset\n1,126,976 1,137,119\nChanges in operating assets and liabilities:\nAccounts receivable\n278,482 65,541\nDeposits\n105,898 284,977\nInventory\n27,443 (112,189 )\nPrepaid inventory\n328,784 40,060\nPrepaid expenses and other current assets\n2,095,323 (289,586 )\nAccounts payable and accrued expenses\n(1,290,141 ) (1,812,547 )\nOperating lease liability\n(1,178,683 ) (1,151,152 )\nDeferred revenue / customer deposits\n203,341 203,341\nCollection on discontinued operations accounts receivable\n1,375 9,592\nCash used by operating activities\n(4,302,051 ) (14,967,150 )\nCash flows from investing activities:\nProceeds from sale of other investment securities\n1,000,000 -\nPurchase of property and equipment\n(297,549 ) (688,680 )\nCash provided (used) by investing activities\n702,451 (688,680 )\nCash flows from financing activities:\nProceeds from issuance of common stock\n2,478,325 -\nNote payable\n(132,599 ) (33,355 )\nPreferred dividend distribution\n(3,668,500 ) (4,002,005 )\nCash provided by financing activities\n(1,322,774 ) (4,035,360 )\nNet increase (decrease) in cash\n(4,922,374 ) (19,691,190 )\nCash and cash equivalents, beginning of year\n6,720,234 26,411,424\nCash and cash equivalents, end of year\n$ 1,797,860 $ 6,720,234\nSupplemental Disclosures of Cash Flow Information:\nCash Payments for:\nInterest expense\n$ 6,399 $ 2,364\nNon-cash financial/investing activities:\nIssuance of Contingent earnout shares:\n$ - $ 1,086,000\nPreferred dividends accrued but not paid\n$ 667,000 $ -\nSee Notes to Consolidated Financial Statements\ncbdMD, INC.\nCONSOLIDATED STATEMENTS OF SHAREHOLDERS' EQUITY\nFOR THE YEARS ENDED September 30, 2023 and 2022\nAdditional\nCommon Stock\nPreferred Stock\nPaid in\nAccumulated\nShares\nAmount\nShares\nAmount\nCapital\nDeficit\nTotal\nBalance, September 30, 2022\n1,348,125 $ 1,348 5,000,000 $ 5,000 $ 178,841,646 $ (147,423,563 ) $ 31,424,431\nIssuance of Common stock\n1,038 1 - - (1 ) - -\nIssuance of options for share based compensation\n- - - - 79,446 - 79,446\nIssuance of restricted stock for share based compensation\n- - - - 43,449 - 43,449\nPreferred dividend\n- - - - - (1,000,502 ) (1,000,502 )\nNet Income (loss)\n- - - - - (3,956,062 ) (3,956,062 )\nBalance, December 31, 2022\n1,349,163 1,349 5,000,000 5,000 178,964,539 (152,380,127 ) 26,590,761\nIssuance of Common stock\n8,417 8 - - (8 ) - -\nIssuance of options for share based compensation\n- - - - 16,770 - 16,770\nIssuance of restricted stock for share based compensation\n- - - - 56,801 - 56,801\nIssuance of Common stock - A360\n94,277 94 - - 1,399,906 - 1,400,000\nIssuance of Common stock - DCO\n2,223 2 - - 29,998 - 30,000\nIssuance of Common stock - Keystone\n2,616 3 - - 29,190 - 29,193\nRoundup fractional shares resulting from reverse split\n- 1 - - - - 1\nPreferred dividend\n- - - - - (1,000,500 ) (1,000,500 )\nNet Income (loss)\n- - - - - (1,336,802 ) (1,336,802 )\nBalance, March 31, 2023\n1,456,696 1,457 5,000,000 5,000 180,497,196 (154,717,429 ) 25,786,224\nIssuance of Common stock\n9,000 9 - - 69,606 - 69,615\nIssuance of options for share based compensation, net\n- - - - 34,663 - 34,663\nIssuance of restricted stock for share based compensation, net\n- - - - 4,845 - 4,845\nIssuance of Common stock - A360\n- - - - 133,200 - 133,200\nIssuance of Common stock - Maxim\n1,350,000 1,350 - - 2,472,730 - 2,474,080\nFractional share true-up\n39,533 39 - - (39 ) - -\nPreferred dividend\n- - - - - (1,000,501 ) (1,000,501 )\nNet Income (loss)\n- - - - - (1,770,404 ) (1,770,404 )\nBalance, June 30, 2023\n2,855,229 2,855 5,000,000 5,000 183,212,202 (157,488,334 ) 25,731,723\nIssuance of Common stock\n112 0 - - (112 ) - (112 )\nIssuance of options for share based compensation\n- - - - 33,171 - 33,171\nIssuance of restricted stock for share based compensation\n- - - - 3,996 - 3,996\nIssuance of Common stock - Keystone\n105,232 105 - - 97,338 - 97,443\nMaxim transaction expenses\n- - - - 40,500 - 40,500\nPreferred dividend\n- - - - - (1,000,497 ) (1,000,497 )\nNet Income (loss)\n- - - - - (15,874,941 ) (15,874,941 )\nBalance, Balance at September 30, 2023\n2,960,573 $ 2,961 5,000,000 $ 5,000 $ 183,387,095 $ (174,363,772 ) $ 9,031,284\nSee Notes to Condensed Consolidated Financial Statements\ncbdMD, INC.\nCONSOLIDATED STATEMENTS OF SHAREHOLDERS' EQUITY\nFOR THE YEARS ENDED September 30, 2023 and 2022\nAdditional\nCommon Stock\nPreferred Stock\nPaid in\nAccumulated\nShares\nAmount\nShares\nAmount\nCapital\nDeficit\nTotal\nBalance, September 30, 2021\n1,284,075 $ 1,285 5,000,000 $ 5,000 $ 176,473,767 $ (73,337,865 ) $ 103,142,187\nIssuance of Common stock\n10,992 11 - - 404,989 - 405,000\nIssuance of options for share based compensation\n- - - - 505,466 - 505,466\nIssuance of restricted stock for share based compensation\n- - - - 508,754 - 508,754\nPreferred dividend\n- - - - - (1,000,502 ) (1,000,502 )\nNet Income (loss)\n- - - - - (19,160,904 ) (19,160,904 )\nBalance, December 31, 2021\n1,295,067 1,296 5,000,000 5,000 177,892,975 (93,499,271 ) 84,400,000\nIssuance of Common stock\n23,873 24 - - 660,976 - 661,000\nIssuance of options for share based compensation\n- - - - 291,630 - 291,630\nIssuance of restricted stock for share based compensation\n- - - - 328,515 - 328,515\nPreferred dividend\n- - - - - (1,000,500 ) (1,000,500 )\nNet Income (loss)\n- - - - - (4,657,215 ) (4,657,216 )\nBalance, March 31, 2022\n1,318,940 1,320 5,000,000 5,000 179,174,096 (99,156,986 ) 80,023,429\nIssuance of Common Stock\n13,198 13 - - 177,987 - 178,000\nIssuance of options for share based compensation\n- - - - (373,168 ) - (373,168 )\nIssuance of restricted stock for share based compensation\n- - - - (593,617 ) - (593,617 )\nPreferred dividend\n- - - - - (1,000,501 ) (1,000,501 )\nNet Income (loss)\n- - - - - (31,634,143 ) (31,634,143 )\nBalance, June 30, 2022\n1,332,138 1,333 5,000,000 5,000 178,385,298 (131,791,630 ) 46,600,000\nIssuance of Common stock\n15,987 15 - - 197,986 - 198,001\nIssuance of Preferred Stock\n- - - - 128,404 - 128,404\nIssuance of options for share based compensation\n- - - - 129,959 - 129,959\nPreferred dividend\n- - - - - (1,000,501 ) (1,000,501 )\nNet Income (loss)\n(14,631,432 ) (14,631,432 )\nBalance, September 30, 2022\n1,348,125 $ 1,348 5,000,000 $ 5,000 $ 178,841,646 $ (147,423,563 ) $ 31,424,431\nSee Notes to Condensed Consolidated Financial Statements\ncbdMD, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEAR ENDED September 30, 2023 and 2022\nNOTE 1 - ORGANIZATION AND SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nOrganization and Nature of Business\ncbdMD, Inc. (\"cbdMD\", \"we\", \"us\", our, or the Company) is a North Carolina corporation formed on March 17, 2015 as Level Beauty Group, Inc. In November 2016 we changed the name of the Company to Level Brands, Inc. and on May 1, 2019 we changed the name of our Company to cbdMD, Inc. We operate from our offices located in Charlotte, North Carolina. Our fiscal year end is established as September 30.\nOn December 20, 2018 (the Closing Date), the Company, and its newly organized wholly owned subsidiaries AcqCo, LLC and cbdMD LLC (CBDI), completed a two-step merger (the Mergers) with Cure Based Development, LLC, a Nevada limited liability company (Cure Based Development). Upon completion of the Mergers, CBDI survived and operates the prior business of Cure Based Development. As consideration for the Mergers in April of 2019, the Company issued 338,889 shares of our common stock to the members of Cure Based Development, of which unrestricted voting rights to 194,945 of the shares vested over a five-year period and 48,612 shares remain subject to a voting proxy agreement as of September 30, 2023, as well as to issue another 338,889 shares of our common stock (the Earnout Shares) in the future upon certain earnout goals (the Earnout Rights) being achieved within five years from the closing of the Mergers. Up to 87,307 Earnout Shares remain subject to Earnout Rights at September 30, 2023.\nThe Company owns and operates the nationally recognized CBD (cannabidiol) brands cbdMD, Paw CBD and hempMD. The Company sources cannabinoids, including CBD, which are extracted from non-GMO hemp grown on farms in the United States. CBD and other hemp-derived cannabinoids are natural substances produced from the hemp plant. The products manufactured by and for the Company comply with the 2018 Farm Bill - our full spectrum products contain trace amounts of THC under the 0.3% by dry weight limit in the 2018 Farm Act while our broad spectrum products are non-psychoactive as they do not contain detectable levels of tetrahydrocannabinol (THC).\nIn the third quarter of fiscal 2019 cbdMD launched its new CBD pet brand, Paw CBD. Following the initial positive response to the brand from retailers and consumers, cbdMD, Inc. organized Paw CBD, Inc. (Paw CBD) as a separate wholly owned subsidiary on October 22, 2019, to take advantage of its early mover status in the CBD animal health industry. On March 15, 2021 cbdMD formed a new wholly owned subsidiary, cbdMD Therapeutics, LLC (Therapeutics) for the purposes of isolating and quantifying the Companys ongoing investments in science related to its existing and future products, including research and development activities for therapeutic applications. The Company also operates the subsidiary Proline Global, LLC (\"Proline Global\") where it operates some of its newer brand initiatives.\nReverse Stock Split\nOn April 12, 2023, the board effected a reverse stock split at a ratio of one-for-forty-five, effective as of April 24, 2023. Unless otherwise indicated, all share numbers in this filing, including shares of common stock and all securities convertible into, or exercisable for, shares of common stock, give effect to the reverse stock split.\nPrinciples of Consolidation\nThe consolidated financial statements include the accounts of the Company and its wholly owned subsidiaries CBDI, Paw CBD, Proline Global,and Therapeutics. All material intercompany transactions and balances have been eliminated in consolidation.\nUse of Estimates\nThe Company's consolidated financial statements have been prepared in accordance with US GAAP and requires management to make estimates and assumptions that affect amounts of assets and liabilities and disclosures of contingent assets and liabilities as of the date of the financial statements and reported amounts of revenues and expenses during the periods presented. Estimates and assumptions are reviewed periodically, and the effects of revisions are reflected in the consolidated financial statements in the period they are determined to be necessary. Significant estimates made in the accompanying consolidated financial statements include, but are not limited to, allowances for doubtful accounts, inventory valuation reserves, certain assumptions related to the valuation of investments other securities, and acquired intangible and long-lived assets and the recoverability of intangible and long-lived assets. Actual results could differ from these estimates.\nCash and Cash Equivalents\nFor financial statements purposes, the Company considers all highly liquid investments with a maturity of less than three months when purchased to be cash equivalents.\nAccounts Receivable\nAccounts receivables are stated at cost less an allowance for doubtful accounts, if applicable. Credit is extended to customers after an evaluation of the customers financial condition, and generally collateral is not required as a condition of credit extension. Managements determination of the allowance for doubtful accounts is based on an evaluation of the receivables, past experience, current economic conditions, and other risks inherent in the receivables portfolio. As of September 30, 2023 and September 30, 2022, we had an allowance for doubtful accounts of $42,180 and $36,980, respectively.\nMerchant Receivable\nThe Company primarily sells its products through the internet and has an arrangement to process customer payments with multiple third-party payment processors. The Company pays a fee between 2.5% and 5.0% of the transaction amounts processed. Pursuant to these agreements, there can be a waiting period between 2 to 5 days prior to reimbursement to the Company, as well as a calculated reserve which some payment processors hold back. Fees and reserves can change periodically with notice from the processors. At September 30, 2023, the receivable from payment processors included $585,345 for the waiting period amount and is recorded as accounts receivable in the accompanying consolidated balance sheet.\nInventory\nInventory is stated at the lower of cost or net realizable value with cost being determined on a weighted average basis. The cost of inventory includes product cost, freight-in, and production fill and labor (portions of which we outsource to third party manufacturers). Write-offs of potentially slow moving or damaged inventory are recorded based on managements analysis of inventory levels, forecasted future sales volume and pricing and through specific identification of obsolete or damaged products. We assess inventory quarterly for slow moving products and potential impairments and at a minimum perform a physical inventory count annually near fiscal year end.\nCustomer Deposits\nCustomer deposits consist of payments received in advance of revenue recognition. Revenue is recognized as revenue recognition criteria are met.\nProperty and Equipment\nProperty and equipment items are stated at cost less accumulated depreciation. Expenditures for routine maintenance and repairs are charged to operations as incurred. Depreciation is charged to expense over the estimated useful lives of the assets using the straight-line method. Generally, the useful lives are five years for manufacturing equipment and automobiles and three years for software, computer, and furniture and equipment. The useful life for leasehold improvements are over the term of the lease or expected life of the asset, whichever is less. The cost and accumulated depreciation of property are eliminated from the accounts upon disposal, and any resulting gain or loss is included in the consolidated statements of operations for the applicable period. Long-lived assets held and used by the Company are reviewed for impairment whenever changes in circumstance indicate the carrying value of an asset may not be recoverable.\nFair Value Accounting\nThe Company utilizes accounting standards for fair value, which include the definition of fair value, the framework for measuring fair value, and disclosures about fair value measurements. Fair value is a market-based measurement, not an entity-specific measurement. Therefore, a fair value measurement should be determined based on the assumptions that market participants would use in pricing the asset or liability. As a basis for considering market participant assumptions in fair value measurements, fair value accounting standards establish a fair value hierarchy that distinguishes between market participant assumptions based on market data obtained from sources independent of the reporting entity (observable inputs that are classified within Levels 1 and 2 of the hierarchy) and the reporting entitys own assumptions about market participant assumptions (unobservable inputs classified within Level 3 of the hierarchy).\nLevel 1 inputs utilize quoted prices in active markets for identical assets or liabilities that the Company has the ability to access. Level 2 inputs are inputs other than quoted prices included in Level 1 that are directly or indirectly observable for the asset or liability. Level 2 inputs may include quoted prices for similar assets and liabilities in active markets, as well as inputs that are observable for the asset or liability. Level 3 inputs are unobservable inputs for the asset or liability, which are based on an entitys own assumptions, as there is little, if any, observable market activity. In instances where the fair value measurement is based on inputs from different levels of the fair value hierarchy, the level in the fair value hierarchy within which the entire fair value measurement falls is based on the lowest level input that is significant to the fair value measurement in its entirety. The Companys assessment of the significance of a particular input to the fair value measurement in its entirety requires judgment and considers factors specific to the asset or liability.\nWhen the Company records an investment in marketable securities the carrying value is recorded at fair value. Any changes in fair value for marketable securities during a given period will be recorded as an unrealized gain or loss in the consolidated statement of operations. For investment other securities without a readily determinable fair value, the Company may elect to estimate its fair value at cost less impairment plus or minus changes resulting from observable price changes.\nIntangible Assets\nThe Company's intangible assets consist of trademarks and other intellectual property, all of which were previously accounted for in accordance with Accounting Standards Codification (ASC) Topic 350, Intangibles - Goodwill and Other. The Company employed the non-amortization approach to account for purchased intangible assets having indefinite lives. Under the non-amortization approach, intangible assets having indefinite lives were not amortized into the results of operations, but instead were reviewed annually or more frequently if events or changes in circumstances indicate that the assets might be impaired, to assess whether their fair value exceeds their carrying value. We previously performed an annual impairment analysis each fiscal year on the indefinite-lived intangible assets following the steps laid out in ASC 350-30-35-18. Our annual impairment analysis included a qualitative assessment to determine if it was necessary to perform the quantitative impairment test. In performing a qualitative assessment, we reviewed events and circumstances that could affect the significant inputs used to determine if the fair value was less than the carrying value of the intangible assets. If a quantitative analysis was necessary, we would analyze various aspects including revenues from the business, associated with the intangible assets. In addition, intangible assets would be tested on an interim basis if an event or circumstance indicates that it is more likely than not that an impairment loss has been incurred. The Company analyzed a variety of factors on its business to determine if a circumstance could trigger an impairment loss, and, at the time and based on the information then known, had determined that is it was more likely than not that an impairment loss had occurred. See Note 5 more further information on the impairment testing procedures performed at December 31, 2021 and the Companys decision to change from indefinite to definite lived status for its trademarks.\nThe Company now accounts for its trademarks in accordance with Accounting Standards Codification (ASC) Topic 360, Property, Plant and Equipment. The Company began amortizing its trademarks over 20 years beginning January 1, 2022 and will perform impairment tests as prescribed by ASC 360, which states that impairment testing should be completed whenever events or changes in circumstances indicate that the asset group's carrying value may not be recoverable. If there are indications that the asset group's carrying value may not be recoverable, there are two further steps involved in long-lived asset impairment testing. Step I of the impairment test, as per ASC 360, involves estimating the recoverable amount of the asset group and determining the potential for impairment. Step II of the impairment test, as per ASC 360, if necessary, involves quantifying the fair value of the asset group. As further outlined in Note 5, during the July of fiscal 2023, the Company determined that based on regulatory uncertainty and ongoing Company performance it was prudent to change the amortization of the cbdMD and directCBDonline trademarks to 5 years and hempMD trademark to 10 years. This became a triggering event for an impairment test under ASC360 which resulted in an impairment of the intangibles in July 2023. As of the end of the fourth quarter and fiscal 2023, a significant decline in market capitalization of both classes of equity as a result of the proxy vote triggered a subsequent impairment test, resulting in additional impairment during the fourth quarter of 2023.\nContingent Liability\nA significant component of the purchase price consideration for the Companys acquisition of Cure Based Development includes a fixed number of future shares to be issued as well as a variable number of future shares to be issued based upon the post-acquisition entity reaching certain specified future revenue targets, as further described in Note 6. The Company made a determination of the fair value of the contingent liabilities as part of the valuation of the assets acquired and liabilities assumed in the business combination.\nRevenue Recognition\nUnder ASC 606, Revenue from Contracts with Customers, the Company recognizes revenues when its customer obtains control of promised goods or services, in an amount that reflects the consideration which it expects to receive in exchange for those goods. The Company recognizes revenues following the five-step model prescribed under ASC 606: (i) identify contract(s) with a customer; (ii) identify the performance obligations in the contract; (iii) determine the transaction price; (iv) allocate the transaction price to the performance obligations in the contract; and (v) recognize revenues when (or as) we satisfy the performance obligation.\nPerformance Obligations\nA performance obligation is a promise in a contract to transfer a distinct good or service to a customer. The Company meets that obligation when it has shipped products which have been ordered by the customer. The Company has reviewed its various revenue streams for its other contracts under the five-step approach.\nAllocation of Transaction Price\nIn the Companys current business model, it does not have contracts with customers which have multiple elements as revenue is driven purely by online product sales or purchase order-based product sales.\nRevenue Recognition\nThe Company records revenue from the sale of its products when risk of loss and title to the product are transferred to the customer, which is upon shipping (and is typically FOB shipping) which is when our performance obligation is met. Net sales are comprised of gross revenues less product returns, trade discounts and customer allowances, which include costs associated with off-invoice mark-downs and other price reductions, as well as trade promotions. These incentive costs are recognized at the later of the date on which the Company recognizes the related revenue or the date on which the Company offers the incentive. The Company currently offers a 60-day, money back guarantee.\nDisaggregated Revenue\nThe Companys product revenue is generated primarily through two sales channels, E-commerce sales (formerly referred to as consumer sales) and wholesale sales. The Company believes that these categories appropriately reflect how the nature, amount, timing and uncertainty of revenue and cash flows are impacted by economic factors.\nA description of the Companys principal revenue generating activities are as follows:\n-\nE-commerce sales - consumer products sold through the Companys online and telephonic channels. Revenue is recognized when control of the merchandise is transferred to the customer, which generally occurs upon shipment. Payment is typically due prior to the date of shipment; and\n-\nWholesale sales - products sold to the Companys wholesale customers for subsequent resale. Revenue is recognized when control of the goods is transferred to the customer, in accordance with the terms of the applicable agreement. Payment terms vary and can typically be 30 days from the date control over the product is transferred to the customer\nThe following table represents a disaggregation of revenue by sales channel:\nFiscal 2023\n% of total\nFiscal 2022\n% of total\nE-commerce sales\n$ 19,436,124 80.5 % $ 26,435,203 74.7 %\nWholesale sales\n$ 4,719,238 19.5 % $ 8,968,021 25.3 %\nTotal Net Sales\n$ 24,155,362 $ 35,403,224\nContract assets represent unbilled receivables and are presented within accounts receivable, net on the consolidated balance sheets. Contract liabilities represent unearned revenues and are presented as deferred revenue or customer deposits on the consolidated balance sheets. The Company had no material contract assets or liabilities at the beginning or ending of September 30, 2023 and 2022.\nCost of Sales\nThe Companys cost of sales includes costs associated with distribution, fill and labor expense, components, manufacturing overhead, third-party providers, and outbound freight for the Companys products sales. For the Companys product sales, cost of sales also includes the cost of refurbishing products returned by customers that will be offered for resale, if any, and the cost of inventory write-downs associated with adjustments of held inventories to their net realizable value. These expenses are reflected in the Companys consolidated statements of operations when the product is sold and net sales revenues are recognized or, in the case of inventory write-downs, when circumstances indicate that the carrying value of inventories is in excess of their net realizable value.\nAdvertising Costs\nThe Company expenses all costs of advertising and related marketing and promotional costs as incurred. The Company incurred $6.0 million and $14.3 million in advertising and marketing and promotional costs included in operating expenses during the years ended September 30, 2023 and 2022 respectively. The Company believes driving its advertising aids in brand awareness and is critical to maintain brand recognition. We are constantly evaluating advertising methods and costs and working to drive down our cost of customer acquisition.\nIncome Taxes\nThe Company is a North Carolina corporation that is treated as a corporation for federal and state income tax purposes. As of October 1, 2019, CBDI and Paw CBD were wholly owned subsidiaries and are disregarded entities for tax purposes and their entire share of taxable income or loss is included in the tax return of the Company and as of March 15, 2021, Therapeutics is also a wholly owned subsidiary and is a disregarded entity for tax purposes and its entire share of taxable income or loss is included in the tax return of the Company.\nThe Company accounts for income taxes pursuant to the provisions of the Accounting for Income Taxes topic of the Financial Accounting Standards Board (\"FASB\") ASC 740 which requires, among other things, an asset and liability approach to calculating deferred income taxes. The asset and liability approach requires the recognition of deferred tax assets and liabilities for the expected future tax consequences of temporary differences between the carrying amounts and the tax bases of assets and liabilities. The Company uses the inside basis approach to determine deferred tax assets and liabilities associated with its investment in a consolidated pass-through entity. A valuation allowance is provided to offset any net deferred tax assets for which management believes it is more likely than not that the net deferred asset will not be realized.\nUS GAAP requires management to evaluate tax positions taken by the Company and recognize a tax liability (or asset) if the Company has taken an uncertain tax position that more likely than not would not be sustained upon examination by the Internal Revenue Service. Management has analyzed the tax positions taken by the Company, and has concluded that as of September 30, 2023 and 2022, there were no uncertain tax positions taken or expected to be taken that would require recognition of a liability (or asset) or disclosure in the consolidated financial statements.\nConcentrations\nFinancial instruments that potentially expose the Company to concentrations of credit risk consist primarily of cash and cash equivalents, accounts receivable, and securities.\nThe Company places its cash and cash equivalents on deposit with financial institutions in the United States. The Federal Deposit Insurance Corporation (FDIC) covers $250,000 for substantially all depository accounts. The Company from time to time may have amounts on deposit in excess of the insured limits. The Company had a $1,163,360 uninsured balance at September 30, 2023 and a $5,752,550 uninsured balance at September 30, 2022.\nConcentration of credit risk with respect to receivables is principally limited to trade receivables with corporate customers that meet specific credit policies. Management considers these customer receivables to represent normal business risk. The Company did not have any customers that represented a significant amount of our sales for the year ended September 30, 2023.\nStock-Based Compensation\nThe Company accounts for its stock compensation under the ASC 718-10-30, Compensation - Stock Compensation using the fair value-based method. Under this method, compensation cost is measured at the grant date based on the value of the award and is recognized over the service period, which is usually the vesting period. This guidance establishes standards for the accounting for transactions in which an entity exchanges its equity instruments for goods or services. It also addresses transactions in which an entity incurs liabilities in exchange for goods or services that are based on the fair value of the entity's equity instruments or that may be settled by the issuance of those equity instruments.\nThe Company uses the Black-Scholes model for measuring the fair value of options and warrants. The stock based fair value compensation is determined as of the date of the grant or the date at which the performance of the services is completed (measurement date) and is recognized over the vesting periods. The Company recognizes forfeitures when they occur.\nLiquidity and Going Concern Considerations\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. The Company experienced a loss of $23 million for the fiscal year ended September 30, 2023. Excluding the one time non-cash investment impairment charge of $0.7 million and intangible asset impairment charge of $13.2 million, the Companys loss was $9.1 million, resulting in working capital of $3.4 million.\nWhile the Company is taking strong action, believes in the viability of its strategy and path to profitability, and in its ability to raise additional funds, there can be no assurances to that effect. The Companys working capital position may not be sufficient to support the Companys daily operations for the twelve months subsequent to the issuance of these annual financial statements. The Companys ability to continue as a going concern is dependent upon its ability to improve profitability and the ability to acquire additional funding. These and other factors raise substantial doubt about the Companys ability to continue as a going concern within twelve months after the date that the annual financial statements are issued. These financial statements do not include any adjustments to reflect the possible future effects on the recoverability and classification of assets or the amounts and classification of liabilities that may result in the Company not being able to continue as a going concern.\nEarnings (Loss) Per Share\nThe Company uses ASC 260-10, Earnings Per Share for calculating the basic and diluted income (loss) per share. The Company computes basic income (loss) per share by dividing net income (loss) and net income (loss) attributable to common shareholders, after deducting preferred stock dividends, by the weighted average number of common shares outstanding. Common equivalent shares are excluded from the computation of net loss per share if their effect is anti-dilutive.\nOn February 16, 2023, we held an annual meeting of stockholders. At the annual meeting, our stockholders approved an amendment to our articles of incorporation, as amended, to effect a reverse stock split of our issued and outstanding shares of common stock by a ratio of between one-for-twenty to one-for-fifty, inclusive, with the exact ratio to be set at the discretion of our board of directors, at any time after approval of the amendment and prior to February 16, 2024. On April 12, 2023, the board effected a reverse stock split at a ratio of one-for-forty-five, effective as of April 24, 2023 (the \"Reverse Stock Split\"). Unless otherwise indicated, all share numbers in this report, including shares of common stock and all securities convertible into, or exercisable for, shares of common stock, give effect to the Reverse Stock Split.\nNew Accounting Standards\nThe Company will be adopting ASU 2016-13 Financial Instruments - Credit Losses (Topic 326): Measurement of Credit Losses on Financial Instruments (ASC 326) effective October 1, 2023. This standard replaced the incurred loss methodology with an expected loss methodology that is referred to as the current expected credit loss (CECL) methodology. CECL requires an estimate of credit losses for the remaining estimated life of the financial asset using historical experience, current conditions, and reasonable and supportable forecasts and generally applies to financial assets measured at amortized cost, including loan receivables and held-to-maturity debt securities, and some off-balance sheet credit exposures such as unfunded commitments to extend credit. Financial assets measured at amortized cost will be presented at the net amount expected to be collected by using an allowance for credit losses. The Company is still evaluating the impacts this standard may have on the consolidated financial statements.\nNOTE 2 - MARKETABLE SECURITIES AND INVESTMENT OTHER SECURITIES\nThe Company has, from time to time, entered into contracts where a portion of the consideration provided by the customer in exchange for the Company's services was common stock, options or warrants (an equity position). In these situations, upon invoicing the customer for the stock or other instruments, the Company recorded the receivable as accounts receivable other, and used the value of the stock or other instrument upon invoicing to determine the value. If there is insufficient data to support the valuation of the security directly, the Company will value it, and the underlying revenue, on the estimated fair value of the services provided. In determining fair value of marketable securities and investment other securities, the Company utilizes valuation techniques that maximize the use of observable inputs and minimize the use of unobservable inputs to the extent possible and consider counterparty credit risk in our assessment of fair value. The Company determines the fair value of marketable securities and investment other securities based on assumptions that market participants would use in pricing an asset or liability in the principal or most advantageous market. When considering market participant assumptions in fair value measurements, the following fair value hierarchy distinguishes between observable and unobservable inputs, which are categorized in one of the following levels:\n●\nLevel 1 Inputs: Unadjusted quoted prices in active markets for identical assets or liabilities accessible to the reporting entity at the measurement date.\n●\nLevel 2 Inputs: Other than quoted prices included in Level 1 inputs that are observable for the asset or liability, either directly or indirectly, for substantially the full term of the asset or liability.\n●\nLevel 3 Inputs: Unobservable inputs for the asset or liability used to measure fair value to the extent that observable inputs are not available, thereby allowing for situations in which there is little, if any, market activity for the asset or liability at the measurement date.\nFor the year ended September 30, 2023 and September 30, 2022 the Company recorded $(700,000) and $(33,350), respectively of realized and unrealized gain (loss) on marketable and other securities, including impairments.\nIn September 2020, the Company purchased a membership interest in Adara Sponsor LLC for $250,000, which along with proceeds from other investors was utilized as an investment in Adara Acquisition Corporation (Adara), a newly organized blank check company formed for the purpose of effecting a merger, capital stock exchange, asset acquisition, stock purchase, reorganization or similar business combination (a SPAC). On January 13, 2021, the Company executed second tranche subscriptions agreements and funded the remaining $750,000. On June 22, 2022, the Company executed a transfer agreement with affiliates of Adara Sponsor, LLC whereby the Company's interest would be transferred to the affiliates of Adara Sponsor, LLC upon Adara's acquisition of Allliance Entertainment, Inc. (the \"Target\") in consideration of the Company's original purchase price. As a result of the SEC litigation against our former CEO, the Target provided a demand to Adara that it required cbdMD and Mr. Sumichrast to dispose of our interests in Adara Sponsor, LLC as a condition of proceeding with any business combination. In December 2022, Adara filed its definitive proxy to approve the acquisition and query shareholders redemption. Effective February 10, 2023, the Company completed the Membership Interest Transfer Agreement with Blystone & Donaldson, LLC, and Mr. Thomas Finke (collectively, the Transferees) dated June 22, 2022. Pursuant to the terms of the agreement, the Company sold its entire ownership interest in Adara Sponsor, LLC, to the Transferees for the total purchase price of $1,000,000 which constitutes the Companys original purchase price of the interest.\nOn April 7, 2022, CBD Industries, LLC entered into an asset sale agreement to sell substantially all its manufacturing assets to a subsidiary of Steady State, LLC (\"Steady State\"). The equipment sale was initially valued at approximately $1.8 million for accounting purposes, the sale price consisting of a trade credit for products to be provided to the Company under the manufacturing and supply agreement and $1.4 million of which the Company invested into Steady State in the form of an equity investment consistent with the terms of Steady State's completed Series C financing. The Company performed a valuation analysis and as of September 30, 2023 determined a $700,000 impairment was needed on the carrying value of this investment. The determination was based on a number of factors, including Steady States financial performance, our experience with production and cbdMDs determination to re-source production to other suppliers. As such we believe it was prudent to reassess the carrying value of this non-liquid security.\nThe table below summarizes the assets and liabilities valued at fair value as of September 30, 2023:\nIn Active\nMarkets for Significant Other Significant\nIdentical Assets\nObservable\nUnobservable\nand Liabilities\nInputs\nInputs\n(Level 1)\n(Level 2)\n(Level 3)\nBalance at September 30, 2021\n$ 33,351 $ - $ (9,856,000 )\nChange in value of equities\n(33,351 ) - -\nChange in value of contingent liability\n- - 9,580,000\nAdditional Investment\n- - -\nBalance at September 30, 2022\n- - (276,000 )\nChange in value of contingent liability\n- - 185,638\nAdditional Investment\n- - -\nBalance at September 30, 2023\n$ - $ - $ (90,362 )\nNOTE 3 - INVENTORY\nInventory at September 30, 2023 and 2022 consists of the following:\nSeptember 30,\nSeptember 30,\nFinished Goods\n$ 2,782,680 $ 3,198,488\nInventory Components\n1,397,034 1,213,724\nInventory Reserve\n(126,742 ) (156,298 )\nInventory prepaid\n182,675 511,459\nTotal Inventory\n$ 4,235,647 $ 4,767,373\nAbnormal amounts of idle facility expense, freight, handling costs, scrap, and wasted material (spoilage) are expensed in the period they are incurred and no material expenses related to these items occurred in the year ended September 30, 2023. The Company wrote down inventory of $175,499 during the fourth quarter of fiscal year ended September 30, 2023 primarily related to obsolete and expired stock keeping units (SKUs). We work hard to minimize inventory write-downs and slow moving and aging SKUs and work, as we work to streamline our offerings to higher velocity products and eliminate slow-moving and aging SKUs.\nNOTE 4 - PROPERTY AND EQUIPMENT\nMajor classes of property and equipment at September 30, 2023 and 2022 consist of the following:\nSeptember 30,\nSeptember 30,\nComputers, furniture and equipment\n$ 1,392,776 $ 1,095,228\nManufacturing equipment\n284,275 284,275\nLeasehold improvements\n487,081 487,081\nAutomobiles\n11,087 11,087\n2,175,219 1,877,671\nLess accumulated depreciation\n(1,458,640 ) (1,054,361 )\nProperty and equipment, net\n$ 716,579 $ 823,310\nDepreciation expense related to property and equipment was $404,280 and $948,962 for the year ended September 30, 2023 and 2022, respectively. During the third quarter, the Company sold substantially all the assets of its manufacturing facility and as a result the gross investment and accumulated depreciation was removed from the balance sheet, reducing net PP&E\nNOTE 5 - GOODWILL AND INTANGIBLE ASSETS\nGoodwill\nThe Company had goodwill at September 30, 2023 and September 2022 of $0. The Company performed multiple impairment analyses of their goodwill during FY2022 and, as a result, the entire $56.7 million balance was written off.\nIntangible Assets\nOn December 20, 2018, the Company completed the Mergers with Cure Based Development and acquired certain assets, including the trademark cbdMD and its variants and certain other intellectual property. The trademark is the cornerstone of this subsidiary and is key as the Company creates and distributes products and continue to build this brand. The Company believed the trademark did not have limits on the time it would contribute to the generation of cash flows and therefore identified these as indefinite lived intangible assets.\nIn September 2019, the Company purchased the rights to the trademark name hempMD for $50,000. This trademark will be used in the marketing and branding of certain products to be released under this brand name. At the time of acquisition, the Company believed the trademark did not have limits on the time it would contribute to the generation of cash flows and therefore had identified these as indefinite-lived intangible assets.\nIn July 2021, the Company completed the acquisition of DCO and acquired certain assets, including the trade name, domains and certain other intellectual property. The tradename will be used in marketing and branding of the website. The Company believes the trade name has a 10 year life. In addition to the trade name, DCO has a technology platform used to market to its customer and the Company believes it has a 4 year life.\nAs of December 31, 2021, the Company has re-assessed the cbdMD and hempMD trademarks and determined that the trademarks should be classified as definite lived intangible assets with useful lives of 20 years versus indefinite lived intangible assets. The Company used a variety of factors in determining the reclassifications and have made the reclassifications following guidance prescribed by ASC 350-30-35-17, which states that when a reporting entity subsequently determines that in indefinite-lived intangible asset has a finite useful life, the reporting entity should test the asset for impairment as an indefinite lived asset prior to commencing amortization. As of December 31, 2021, the Company has prepared a tradename impairment analysis in accordance with ASC 350 and has determined that the cbdMD trademark was impaired by $4,285,000. The Company has recorded this impairment charge as a reduction in the carrying value of the intangible assets on its consolidated balance sheets with the corresponding impairment expense recorded on its consolidated statements of operations. The Company began amortizing the trademarks over their useful lives of 20 years as of January 2022.\nAs of July 1, 2023 the Company determined that based on market forces and the Companys outlook it was prudent to adjust the useful lives of cbdMDs and DCO intangibles to 5 year useful lives and hempMDs trademark to 10 year amortization to better reflect the outlook of the brands. This re-evaluation of the tradenames became a triggering event for a valuation test under ASC 360. As a result of a multi-step approach under ASC 360 we determined that the cbdMD, DirectCBDOnline tradenames and the technology relieve asset was impaired by $6,027,000, and as a result, the amortization was adjusted to account for any changes in the value and estimated useful life of each asset. Amortization expense for the year ended September 30, 2023 was $1,396,459 and was recorded on the consolidated statements of operations.\nAt September 30, 2023, the Company prepared a tradename impairment analysis in accordance with ASC 360 and has determined that based on market sentiment and the sharp decline in combined market capitalization of the common stock and Series A Preferred as a result of the ongoing proxy vote, a triggering event occurred. The Company prepared an impairment analysis and as a result of a multi-step approach under ASC 360 we determined that the cbdMD DirectCBDOnline tradenames and technology relieve were further impaired by $7,192,000 in fiscal year 2023, resulting in a total impairment charge of $13,219,000 for the fiscal year ended September 30, 2023.\nIntangible assets as of September 30, 2023 and 2022 consisted of the following:\nSeptember 30,\nSeptember 30,\nTrademark related to cbdMD\n$ 21,585,000 $ 21,585,000\nTrademark for HempMD\n50,000 50,000\nTechnology Relief from Royalty related to DirectCBDOnline.com\n667,844 667,844\nTradename related to DirectCBDOnline.com\n749,567 749,567\nImpairment of definite lived intangible assets:\n(17,504,000 ) (4,285,000 )\nAmortization of definite lived intangible assets:\n(2,329,321 ) (932,862 )\nTotal\n$ 3,219,090 $ 17,834,549\nFuture amortization of intangible assets as of September 30, 2023 is as follow:\nFor the year ended September 30,\n$ 691,368\n688,757\n660,040\n660,040\n496,223\nThereafter\n22,662\nTotal future intangibles amortization\n$ 3,219,090\nNOTE 6 - CONTINGENT LIABILITY\nAs consideration for the Mergers, described in Note 1, the Company had a contractual obligation to issue 338,889 shares of its common stock, after approval by its shareholders, to the members of Cure Based Development, issued in two tranches of 144,445 shares and 194,945 shares, both of which are subject to leak out provisions, and the unrestricted voting rights to 194,945 tranche of shares vesting over a five year period and are subject to a voting proxy agreement. The Merger Agreement also provided that an additional 338,889 Earnout Shares can be issued upon the satisfaction of certain aggregate net revenue criteria by cbdMD within 60 months following the closing date.\nThe contractual obligations and earn out provision are accounted for as a contingent liability and fair value is determined using Level 3 inputs, as estimating the fair value of these contingent liabilities require the use of significant and subjective inputs that may and are likely to change over the duration of the liabilities with related changes in internal and external market factors.\nThe initial two tranches totaling 338,889 shares have been valued using a market approach method and included the use of the following inputs: share price upon contractual obligation, discount for lack of marketability to address leak out restrictions, and probability of shareholder disapproval. In addition, the 194,945 shares in the second tranche also included an input for a discount for lack of voting rights during the vest periods.\nThe Merger Agreement provides that an additional 338,889 Earnout Shares would be issued as part of the consideration for the Mergers, upon the satisfaction of certain aggregate net revenue criteria by cbdMD within 60 months following the Closing Date as follows, as measured at four intervals (each a marking period): the completion of 12, 24, 42, and 59 calendar months from the Closing Date, and based upon the ratios set forth below:\nAggregate Net Revenues\nShares Issued/ Each $ of Aggregate Net Revenue Ratio\n$1 - $20,000,000\n0.004236111\n$20,000,001 - $60,000,000\n0.002118056\n$60,000,001 - $140,000,000\n0.001059028\n$140,000,001 - $300,000,000\n0.005295139\nFor clarification purposes, the Aggregate Net Revenues during a Marking Period shall be multiplied by the applicable Shares Issued/Each $ of Aggregate Net Revenue Ratio, minus, the number of shares issued as a result of Aggregate Net Revenues during the prior marking periods.\nThe third quarter of the third marketing period ended on September 30, 2021 and based on the measurement criteria an additional 10,372 Earnout Shares were earned and issued in December 2021. These shares decreased in value by $366,841 during the quarter through the time of issuance and had a value of $405,000, which was reclassified from the contingent liability to additional paid in capital on the consolidated balance sheet. The fourth quarter of the third marketing period ended on December 31, 2021 and based on the measurement criteria an additional 9,873 Earnout Shares were earned and issued in March 2022. These shares increased in value by $41,914 during the quarter through the time of issuance and had a value of $325,000, which was reclassified from the contingent liability to additional paid in capital on the consolidated balance sheet. The fifth quarter of the third marketing period ended on March 31, 2022 and based on the measurement criteria an additional 10,198 Earnout Shares were earned and issued in May 2022. These shares decreased in value by $90,792 during the quarter through the time of issuance and had a value of $178,000, which was reclassified from the contingent liability to additional paid in capital on the consolidated balance sheet. The sixth quarter of the third marketing period ended on June 30, 2022 and based on the measurement criteria an additional 9,101 Earnout Shares were earned and issued in August 2022. These shares increased in value by $17,718 during the quarter through the time of issuance and had a value of $198,000 at the time of issuance, which was reclassified from the contingent liability to additional paid in capital on the consolidated balance sheet. At September 30, 2023, up to 87,307 remaining Earnout Shares are subject to issuance by the Company.\nThe third marking period was originally an 18 month period commencing on January 1, 2021 and ending on June 30, 2022 (the Third Marking Period End Date), after which time the determination of the issuance of any remaining Earnout Shares would be made pursuant to the terms of the Merger Agreement. On March 31, 2021 the Company entered into Addendum No. 1 to the Merger Agreement (Addendum No. 1) with the holders of the remaining Earnout Rights which amended the measurement periods within the third marking period to change the determination of the aggregate net revenues within the third marking period to a quarterly basis for each of the six fiscal quarters within the third marking period, beginning with the quarter ended March 31, 2021, instead of following Third Marking Period End Date. This change in the measurement date, however, has no effect on the number of remaining Earnout Shares issuable under the Earnout Rights and no effect on the earnout targets; Addendum No. 1 simply changes the physical issuance date(s) of the remaining Earnout Shares, if in fact, such shares are earned pursuant to the terms of the Merger Agreement. Addendum No. 1 did not change any of the terms of the fourth marking period (as that term is defined in the Merger Agreement). This change did not impact the fair value of the contingent liability. The value of the contingent liability was $90,362 and $276,000 at September 30, 2023 and September 30, 2022, respectively.\nThe fourth marketing period began on July 1, 2022 and ended during November 2023. As of November 2023, the preliminary revenue for the fourth marking period totaled approximately $35.8 million. Based on the ratios, we estimate the final share obligation to fully satisfy the Earnout Shares to be approximately 20,500.\nAs part of the Twenty Two acquisition in July 2021, the Company has a contractual obligation to issue up to an additional 4,445 shares of its common stock as additional consideration, dependent upon the acquisition entity meeting future revenue targets. Under GAAP the Company is required to record a non-cash contingent liability associated with the Twenty Two Earnout Shares and at the date of the acquisition, recorded a total contingent liability of $488,561. Under GAAP the Company is obligated to reassess the obligations associated with the Twenty Two Earnout Shares on a quarterly basis and, in the event its estimate of the fair value of the contingent consideration changes, the Company will record increases or decreases in the fair value as an adjustment to earnings. In particular, changes in the market price of the Companys common stock, which is one of the inputs used in determining the amount of the non-cash contingent liability, will result in increases or decreases in this liability and positively or negatively impact the Companys net loss or profit for the period. At September 30, 2022, the Company recorded a decrease in value of the contingent liability of $73,561 related to a decrease in the market price of our common stock, which adjusted the total contingent liability related to the Twenty Two Earnout Shares to $416,000. As of September 2022 the measurement period has ended and there is no further obligation with respect to this earnout.\nIn December 2022, the Company entered into a contractual obligation to issue up to 556 options and 556 RSUs to an employee. The shares are subject to meeting a minimum direct to consumer revenue of $45 million for any four consecutive quarters before December 31, 2024. Based on the present revenue run rate, the Company has valued these obligations at $0 for September 30, 2023.\nNOTE 7 - RELATED PARTY TRANSACTIONS\nNone.\nNOTE 8 - SHAREHOLDERS EQUITY\nPreferred Stock - The Company is authorized to issue 50,000,000 shares of preferred stock, par value $0.001 per share. In October 2019, the Company designated 5,000,000 of these shares as 8.0% Series A Cumulative Convertible Preferred Stock. Our 8.0% Series A Cumulative Convertible Preferred Stock ranks senior to our common stock for liquidation or dividend provisions and holders are entitled to receive cumulative cash dividends at an annual rate of 8.0% payable monthly in arrears for the prior month. The Company reviewed ASC 480 - Distinguishing Liabilities from Equity in order to determine the appropriate accounting treatment for the preferred stock and determined that the preferred stock should be treated as equity. There were 5,000,000 and 5,000,000 shares of 8.0% Series A Cumulative Convertible Preferred Stock issued and outstanding at September 30, 2023 and September 30, 2022, respectively.\nThe total amount of dividends declared were $4,002,000 for the year ended September 30, 2023. The total amount of dividends declared and paid were $4,002,005 for the years ended September 30, 2022. The company suspended payment of the dividend in August of 2023 and as such recorded an accrual of $667,000 for the dividends declared but not paid in August and September.\nCommon Stock - The Company is authorized to issue 150,000,000 shares of common stock, par value $0.001 per share. There were 2,960,573 and 1,348,125 shares of common stock issued and outstanding at September 30, 2023 and 2022, respectively.\nPreferred stock transactions:\nThe Company has no preferred stock transactions in the year ended September 30, 2023 and 2022.\nCommon stock transactions:\nIn the year ended September 30, 2023:\nIn September of 2023, the company issued 102,616 shares under the Purchase Agreement to Keystone.\nIn July of 2023 the Company issued 2,616 shares to Keystone pertaining to the commitment shares under the Purchase Agreement.\nOn May 3, 2023, the Company completed an underwritten public offering of 1,350,000 shares of its common stock at a public offering price of $2.10 per share. Gross proceeds from the offering before deducting underwriting discounts and commissions and offering expenses were approximately $2.8 million. Under the terms of the Underwriting Agreement, the Company granted the Underwriter an option, exercisable for 45 days, to purchase up to an additional 202,500 shares of common stock. The net proceeds to the Company from the Offering were approximately $2.5 million, after deducting underwriting discounts and commissions and estimated Offering expenses payable by the Company, and does not take into account the exercise by the Underwriter of its option to purchase additional shares of common stock. The Company also issued the Underwriter a warrant to purchase up to 40,500 shares of its common stock exercisable at $2.52 per share.\nOn April 24, 2023 the Company issued a total of 39,533 shares of common stock to account for rounding up of fractional shares related to the Reverse Stock Split.\nIn March 2, 2023, the Company entered into a Purchase Agreement (the \"Purchase Agreement\") with Keystone Capital Partners, LLC (Keystone), pursuant to which Keystone has committed to purchase up to 281,934 of shares of our common stock. Upon the execution of the Purchase Agreement, The Company issued 2,616 shares of common stock as \"Commitment Shares\" to Keystone as consideration for its commitment to purchase shares of our common stock under the Purchase Agreement. Additional Commitment Shares (6,104) will be issued over 180 days from March 2, 2023. The 281,934 shares of the Company's common stock were registered for resale and may be issued under the Purchase Agreement or sold by us to Keystone at our discretion from time to time over a 12-month period commencing April 1, 2023, subject to a 75 day blackout period commencing April 30, 2023. The purchase price for the shares that the Company may sell to Keystone under the Purchase Agreement will fluctuate based on the price of the Company's common stock. Depending on market liquidity at the time, sales of such shares may cause the trading price of our common stock to fall.\nIn April 2023, the Company issued 8,889 shares to Keystone under the Purchase Agreement entered into in March of 2023.\nOn February 1, 2023, the Company entered into an Agreement for Advertising Placement with a360 Media, LLC (a360) in which a360 will provide professional media support and advertising placement in exchange for up to 134,681 shares of the Companys common stock valued at $14.85 per share. A360 will receive the shares by providing the Company with a credit in the amount of $2,000,000 to be used for media support and advertising placement to the Company, of which $514,904 remains unutilized as of September 30,2023. The shares are 70% fully vested; 15% of the Shares shall vest upon each advertising placement accrue pro-rata as percentage of the total advertising placement; and 15% of the shares shall vest provided there are no restrictions in product categories that the Company is able to market with a360 while the Company utilizes the advertising placement. Any shares which do not vest within the term of the agreement shall be forfeited. The Advertising Placement must be used by the Company prior to December 30, 2023, unless otherwise agreed in writing by both parties.\nIn January of 2023, the Company issued 2,223 shares of common stock to Twenty Two Capital as the final obligation under the 2021 acquisition agreement upon the expiration of the indemnification period.\nIn the year ended September 30, 2022:\nIn August 2022, the Company issued 112 shares of restricted common stock to a newly appointed board member. The stock award was valued at the fair market price of $2,854 and vested at the grant date.\nIn August 2022, the Company issued 2,223 of restricted common stock to a consultant as part of an advisory agreement under the Company's Equity Compensation Plan. The stock awards were valued at the fair market price of $41,000 and vested at the grant date.\nIn August 2022, the Company issued 9,101 shares of restricted common stock in connection with the Earnout Shares as referenced in Note 6.\nIn May 2022, the Company issued 10,198 shares of restricted common stock in connection with the Earnout Shares as referenced in Note 6.\nIn March 2022 the Company issued 9,873 shares of restricted common stock in connection with the Earnout Shares as referenced in Note 6.\nIn January 2022, the Company issued 667 shares of restricted stock awards to six employees. The stock awards were valued at the fair market price of $29,250 and vested at the grant date.\nIn January 2022, the Company issued 7,112 shares to a professional athlete in conjunction with an amendment to the athletes sponsorship agreement as referenced in Note 11. The stock grant was valuated at the fair market price of $336,000 upon issuance and will be amortized over the remaining term of the agreement.\nOn December 28, 2021, the Company issued 10,372 shares of restricted common stock in connection with the Earnout Shares as referenced in Note 6.\nIn October 2021, the Company issued 556 shares of restricted common stock to an executive officer of the Company, subject to vesting on January 1, 2022.\nStock option transactions:\nIn the year ended September 30, 2023:\nIn February of 2023, the Company granted its board of directors an aggregate of 2,667 common stock options. The options vested immediately, have a strike price of $12.60 and a five-year term. The Company has recorded a total prepaid expense of $21,120 and intends to amortize the expense over the 12-month board term.\nIn January 2023, the Company issued 2,334 options to a group of employees. The stock options awards vested at issuance, had a strike price of $10.53, five-year term and a fair market value upon issuance of $15,225.\nIn December 2022, the Company issued 2,223 options to an employee. 1,667 options vest equally at each anniversary for the next 3 years, have a strike price of $11.25 and a five year term. The total expense of these options is $13,150 and will be amortized over the term of the vesting periods. 556 options vest based on meeting certain direct to consumer revenue requirements by the end of December 2024.\nIn the year ended September 30, 2022:\nIn August 2022, the Company granted a new board member an aggregate of 667 common stock options. The options vested immediately, have a strike price of $25.56 and a five-year term. The Company has recorded a total prepaid expense of $10,290 and were expensed at the issuance date.\nIn June 2022, a former executive officer of the company forfeited 16,667 common stock options. The forfeited options had an unrecognized value of $555,286. The Company recognized contra-expense of $604,714 for the forfeited options related to the previously amortized expense for these options.\nIn May 2022, the Company granted a new executive an aggregate of 9,000 common stock options. The options vest equally over 1, 2, and 3 years from the grant date. The options have a strike price $38 and a five-year term. The total expense of these options totaled $176,985 and will be amortized over the term of the vesting periods.\nIn April 2022, the Company issued 4,445 options to a consultant as part of an advisory agreement under the Company's Equity Compensation Plan. Fifty thousand of the shares vested upon the grant, 50,000 vest and 6 months from the effective date and 2,223 upon renewal of the consulting agreement in March 2023. The options have a strike price of $45 and five-year term. The total expense of these options totaled $131,300 and will be amortized over the term of the vesting periods.\nIn April 2022, the Company issued 2,223 common stock options to an employee that vest upon the Company achieving certain direct to consumer revenue growth targets for the quarter ended December 2022. The options have a $45 strike price. The Company performs analysis on these options and as of September 30, 2023 no expense was ascribed to these options.\nIn March 2022, the Company granted its board of directors an aggregate of 2,667 common stock options. The options vested immediately, have a strike price of $36.81 and a five-year term. The Company has recorded a total prepaid expense of $57,000 and intends to amortize the expense over the 12-month board term.\nIn January 2022, the Company granted an aggregate of 2,889 common stock options to a group of 9 employees. These options vest upon grant and the Company has recorded an expense for these options of $79,500 for the three months ended June 30, 2022\nIn October 2021, the Company granted an aggregate of 1,667 common stock options to an executive officer. These options vest on October 1, 2022.\nThe Company has recorded an expense for these options of $23,025 and $46,050 for the three and twelve months ended September 30, 2023.\nThe expected volatility rate was estimated based on comparison to the volatility of a blend of the Company's own stock and a peer group of companies in similar industries. The expected term used was the full term of the contract for the issuances. The risk-free interest rate for periods within the contractual life of the option is based on U.S. Treasury securities. The pre-vesting forfeiture rate of zero is based upon the experience of the Company. As required under ASC 718, the Company will adjust the estimated forfeiture rate to its actual experience. Management will continue to assess the assumptions and methodologies used to calculate estimated fair value of share-based compensation. Circumstances may change and additional data may become available over time, which could result in changes to these assumptions and methodologies, and thereby materially impact our fair value determination.\nThe following table summarizes the inputs used for the Black-Scholes pricing model on the options issued in the years ended September 30, 2023 and 2022:\nWeighted average exercise price\n10.355 -12.6060 $ 44.55\nRisk free interest rate\n3.93% -4.71 % 2.56% - 2.97 %\nVolatility\n106.48% - 106.51 % 101.23% - 103.98 %\nExpected term (in years)\n2.5 -4 2.5 - 5.5\nDividend yield\nNone\nNone\nWarrant transactions:\nAs part of the public underwritten offer discussed earlier in Note 8, the Company issued the Underwriter a warrant to purchase up to 40,500 shares of its common stock exercisable at $2.52 per share.\nThe Company had no warrant transactions during the twelve months ended September 30, 2022.\nThe following table summarizes the inputs used for the Black-Scholes pricing model on the warrants issued in the year ended September 30, 2023:\nWeighted average exercise price\n$ 2.52\nRisk free interest rate\n3.37 %\nVolatility\n113.12 %\nExpected term (in years)\n2.75\nDividend yield\nNone\nNOTE 9 -STOCK-BASED COMPENSATION\nEquity Compensation Plan - On June 2, 2015, the Board of Directors of the Company approved the 2015 Equity Compensation Plan (2015 Plan). The 2015 Plan made 26,112 common stock shares, either unissued or reacquired by the Company, available for awards of options, restricted stocks, other stock grants, or any combination thereof. The number of shares of common stock available for issuance under the 2015 Plan shall automatically increase on the first trading day of our fiscal year during the term of the 2015 Plan, beginning with calendar year 2016, by an amount equal to one percent (1%) of the total number of shares of common stock outstanding on the last trading day in September of the immediately preceding fiscal year, but in no event shall any such annual increase exceed 2,223 shares of common stock. On April 19, 2019, shareholders approved an amendment to the 2015 Plan and increased the number of shares available for issuance under the 2015 Plan to 45,445 and retained the annual evergreen increase provision of the plan. Subsequent thereto, on August 7, 2019 the Companys Board of Directors approved an amendment to the 2015 Plan changing the date the automatic evergreen increase is determined to the first trading day of October each calendar year during the term of the 2015 Plan to coincide with the Companys fiscal year.\nOn January 8, 2021, the Companys Board of Directors approved the 2021 Equity Compensation Plan (the 2021 Plan) and it was subsequently ratified by its shareholders at its annual meeting held on March 12, 2021. The purpose of the 2021 Plan is to advance the interests of the Company by providing an incentive to attract, retain and motivate highly qualified and competent persons who are important to it and upon whose efforts and judgment the success of the Company is largely dependent. The 2021 Plan made 111,112 common shares, either unissued or reacquired by the Company, available for awards of options, restricted stocks, other stock grants, or any combination thereof. The 2021 Plan also contains an evergreen formula pursuant to which the number of shares of common stock available for issuance under the 2021 Plan will automatically increase on October 1 of each calendar year during the term of the 2021 Plan, beginning with calendar year 2022, by an amount equal to 1.0% of the total number of shares of common stock outstanding on September 30 of such calendar year, up to a maximum of 5,556 shares.\nThe Company accounts for stock-based compensation using the provisions of ASC 718. ASC 718 codification requires companies to recognize the fair value of stock-based compensation expense in the financial statements based on the grant date fair value of the options. All options are approved by the Compensation, Corporate Governance and Nominating Committee of the Board of Directors. Restricted stock awards that vest in accordance with service conditions are amortized over their applicable vesting period using the straight-line method. The fair value of the Companys stock option awards or modifications is estimated at the date of grant using the Black-Scholes option pricing model.\nEligible recipients include employees, officers, directors and consultants who are deemed to have rendered or to be able to render significant services to the Company or its subsidiaries and who are deemed to have contributed or to have the potential to contribute to the success of the Company. Options granted generally have a five-to-ten-year term and have vesting terms that cover one to three years from the date of grant. Certain of the stock options granted under the plan have been granted pursuant to various stock option agreements. Each stock option agreement contains specific terms.\nStock Options:\nThe Company currently has awards outstanding with service conditions and graded-vesting features. We recognize compensation cost on a straight-line basis over the requisite service period.\nThe fair value of each time-based award is estimated on the date of grant using the Black-Scholes option valuation model. Our weighted-average assumptions used in the Black-Scholes valuation model for equity awards with time-based vesting provisions granted during the year.\nThe following table summarizes stock option activity under both plans for the fiscal years ended September 30, 2023 and 2022:\nWeighted-average\nremaining\nAggregate\nWeighted-average\ncontractual term\nintrinsic value\nNumber of shares\nexercise price\n(in years)\n(in thousands)\nOutstanding at September 30, 2021\n60,101 $ 198.90 5.13 $ -\nGranted\n23,556 43.65 -\nExercised\n- - -\nForfeited\n(28,000 ) 163.35 -\nOutstanding at September 30, 2022\n55,656 151.10 4.55 -\nGranted\n7,233 11.51 -\nExercised\n- - -\nForfeited\n(21,124 ) 88.12 -\nOutstanding at September 30, 2023\n41,765 144.43 3.65 -\nExercisable at September 30, 2023\n39,542 $ 151.92 3.67 $ -\nAs of September 30, 2023, there was approximately $7,858 of total unrecognized compensation cost related to non-vested stock options which vest over a period of approximately 2.3 years.\nRestricted Stock Award transactions:\nIn the twelve months ended September 30, 2023:\nIn February of 2023, the Company issued 448 restricted stock awards to the Companys board of directors. The shares vest quarterly one fourth on June 30, 2023, one fourth, on September 30, 2023, one fourth on December 31, 2023, and one fourth on March 31, 2024. The stock awards were valued at the fair market price of $5,660 upon issuance and will amortize over the individual vesting periods.\nIn January 2023, the Company issued 3,889 shares to a group of employees. The shares vested upon issuance, having a fair market value upon issuance of $40,950.\nIn December 2022, the Company issued 1,112 shares of restricted common stock to an employee. 556 shares vested upon issuance and the Company recorded a total expense of $6,250. 556 shares vest based on meeting certain direct to consumer revenue performance hurdles prior to December 2024.\nIn the twelve months ended September 30, 2022:\nIn August 2022, the Company issued 112 shares of restricted common stock to a newly appointed board member. The stock award was valued at the fair market price of $2,854 and vested at the grant date.\nIn August 2022, the Company issued 2,223 of restricted common stock to a consultant as part of an advisory agreement under the Company's Equity Compensation Plan. The stock awards were valued at the fair market price of $41,000 and vested at the grant date.\nIn June 2022, the Company issued 8,889 shares of restricted common stock in connection with the Separation Agreement with a former executive officer in which the former employee forfeited 11,112 shares of unvested restricted stock awards and 11,112 unvested options. These shares are subject to vest one-half on July 1, 2022 and the balance January 1, 2023. The fair market value of these shares totaled $172,000 and will be amortized over the vesting periods. The forfeited RSUs and options had an unrecognized value of $799,572 and $555,286, respectively. The Company recognized contra-expense of $880,428 and $604,714 for the forfeited RSUs and options, respectively, related to the previously amortized expense for these RSUs and options.\nIn May 2022 the Company issued 2,778 shares of restricted common stock to an executive office of the Company as part of a new hire compensation package.\nIn May 2022 the Company issued 112 of restricted common stock to an employee of the Company. The stock award was valued at the fair market price $3,350 of and expensed upon issuance.\nIn March 2022, the Company issued 448 of restricted stock awards to the Companys board of directors. The shares vest quarterly one fourth on June 30, 2022, one fourth, on September 30, 2022, one fourth on December 31, 2022, and one fourth on March 31, 2023. The stock awards were valued at the fair market price of $16,360 upon issuance and will amortize over the individual vesting periods.\nIn January 2022, the Company issued 667 shares of restricted stock awards to six employees. The stock awards were valued at the fair market price of $29,250 and vested at the grant date.\nIn January 2022, the Company issued 7,112 shares to a professional athlete in conjunction with an amendment to the athletes sponsorship agreement as referenced in Note 11. The stock grant was valuated at the fair market price of $336,000 upon issuance and will be amortized over the remaining term of the agreement.\nIn November 2021, the Company issued 2,667 shares of restricted stock awards to an employee, subject to certain revenue performances metrics through December 2022, as referenced in Note 6. These shares were forfeited during January 2022.\nIn October 2021 the Company issued 112 shares of restricted stock awards to an employee, which vested immediately upon issuance.\nIn October 2021 the Company issued 556 shares of restricted stock awards to an executive officer, subject to a four-month vesting schedule.\nNOTE 10 - WARRANTS\nTransactions involving the Company equity-classified warrants for the fiscal years ended September 30, 2023 and 2022 are summarized as follows:\nWeighted-average\nremaining\nAggregate\nWeighted-average\ncontractual term\nintrinsic value\nNumber of shares\nexercise price\n(in years)\n(in thousands)\nOutstanding at September 30, 2021\n14,771 $ 174.60 3.23 $ -\nGranted\n- - -\nExercised\n- - -\nForfeited\n(1,567 ) 242.55 -\nOutstanding at September 30, 2022\n13,204 210.45 2.30 -\nGranted\n40,500 2.52 -\nExercised\n- - -\nForfeited\n(3,395 ) 289.08 -\nOutstanding at September 30, 2023\n50,309 37.75 4.07 -\nExercisable at September 30, 2023\n9,809 $ 183.23 - $ -\nThe following table summarizes outstanding common stock purchase warrants as of September 30, 2023:\nWeighted-average\nNumber of shares\nexercise price\nExpiration\nExercisable at $337.5 per share\n1,352 $ 337.50 May 2024\nExercisable at $176.06 per share\n1,079 176.06 October 2024\nExercisable at $56.25 per share\n822 56.25 January 2025\nExercisable at $168.30 per share\n3,357 168.30 December 2025\nExercisable at $168.75 per share\n3,199 168.75 June 2026\nExercisable at $2.52 per share\n40,500 2.52 April 2028\n50,309 $ 37.75\nNOTE 11 - COMMITMENTS AND CONTINGENCIES\nIn May 2019, the Company entered into an endorsement agreement with a professional athlete. On November 4, 2022, the Company entered into a separation agreement with the athlete that required a final payment truing up the Companys cash obligation through November 2022. No further obligations exist between the parties. The Company recorded a one-time non-cash expense of approximately $885,000 associated with the outstanding un-expensed portion of stock compensation expense from previously issued stock at higher stock prices.\nEffective February 2022, the Company entered into an endorsement agreement with a professional athlete. The term of the agreement is through February 2025 and is tied to performance of the athlete in so many professional events annually, and also includes promotion of the Company via social media, wearing of logo during competition, requirement to provide production days for advertising creation and attendance at meet and greets. The potential base payments, if all services are provided is $1,500,000 over the term of the agreement, in addition to some incentives for sales directly influenced by the athlete. During May 2023, the Company exercised its rights to terminate the contract.\nAs previously disclosed, during June of 2022, the Company's CEO resigned from the board of directors and his role as an executive of the Company in June 2022 under the terms of a separation agreement with the Company.\nNOTE 12 - NOTE PAYABLE\nIn July 2019, the Company entered into a loan arrangement in the amount of $249,100 for a line of equipment as part of the sale of manufacturing equipment during April 2022, the balance of this loan was paid off resulting in a balance of $0 as of September 30, 2022. In January 2020, the Company entered into a loan arrangement for $35,660 for equipment, of which $3,000 is a long term note payable at September 30, 2023. Payments are for 48 months and have a financing rate of 6.2%, which requires a monthly payment of $841.\nNOTE 13 - LEASES\nThe Company has lease agreements for its corporate, warehouse and laboratory offices with lease periods expiring between 2024 and 2026. ASC 842 requires the recognition of leasing arrangements on the consolidated balance sheet as right-of-use assets and liabilities pertaining to the rights and obligations created by the leased assets. The Company determines whether an arrangement is a lease at inception and classify it as finance or operating. All of the Companys leases are classified as operating leases. The Companys leases do not contain any residual value guarantees.\nRight-of-use lease assets and corresponding lease liabilities are recognized at commencement date based on the present value of lease payments over the expected lease term. Since the interest rate implicit in our lease arrangements is not readily determinable, the Company determined an incremental borrowing rate for each lease based on the approximate interest rate on a collateralized basis with similar remaining terms and payments as of the lease commencement date to determine the present value of future lease payments. The Companys lease terms may include options to extend or terminate the lease.\nIn addition to the monthly base amounts in the lease agreements, the Company is required to pay real estate taxes, insurance and common area maintenance expenses during the lease terms.\nLease costs on operating leases are recognized on a straight-line basis over the lease term and included as a selling, general and administrative expense in the consolidated statements of operations.\nComponents of operating lease costs are summarized as follows:\nYear Ended\nSeptember 30,\nTotal Operating Lease Costs\n$ 1,328,497\nSupplemental cash flow information related to operating leases is summarized as follows:\nYear Ended\nSeptember 30,\nCash paid for amounts included in the measurement of operating lease liabilities\n$ 1,380,204\nAs of September 30, 2023, our operating leases had a weighted average remaining lease term of 2.99 years and a weighted average discount rate of 4.66%. Future minimum aggregate lease payments under operating leases as of September 30, 2023 are summarized as follows:\nFor the year ended September 30,\n$ 1,421,610\n1,159,949\n1,372,862\n280,565\nTotal future lease payments\n4,234,986\nLess interest\n274,046\nTotal lease liabilities\n$ 3,960,940\nFuture minimum lease payments (including interest) under non-cancelable operating leases as of September 30, 2022 are summarized as follows:\nFor the year ended September 30,\n$ 1,421,610\n1,159,949\n1,372,862\n280,565\nTotal future lease payments\n4,234,986\nLess interest\n274,046\nTotal lease liabilities\n$ 3,960,940\nNOTE 14 - LOSS PER SHARE\nThe following table sets forth the computation of basic and diluted earnings per share for the following periods:\nYear Ended\nSeptember 30,\nSeptember 30,\nBasic:\nNet loss\n$ (22,938,209 ) $ (70,083,693 )\nPreferred dividends paid or accrued\n4,002,000 4,002,005\nNet income loss attributable to cbdMD Inc. common shareholders\n(26,940,209 ) (74,085,698 )\nShares used in computing basic earnings per share\n2,022,320 1,327,784\nShares used in computing diluted earnings per share\n2,022,320 1,327,784\nEarnings per share Basic:\nBasic earnings per share\n(13.32 ) (55.80 )\nEarnings per share Diluted:\nDiluted earnings per share\n(13.32 ) (55.80 )\nAt the year ended September 30, 2023, 93,222 potential shares underlying options, unvested RSUs and warrants as well as 185,223 shares issuable upon conversion of our Series A Preferred stock and 40,404 a360 shares subject to certain vesting requirements, as well as a total 872 remaining commitment shares under the Keystone Purchase Agreement were related to the a360 transaction which are excluded from the shares used to calculate diluted loss per share as their inclusion would reduce net loss per share.\nNOTE 15 - INCOME TAXES\nThe Company generated operating losses for the years ended September 30, 2023 and 2022 on which it has recognized a full valuation allowance. The Company accounts for is state franchise and minimum taxes as a component of its general and administrative expenses.\nThe following table presents the components of the provision for income taxes from continuing operations for the fiscal years ended September 30, 2023 and 2022:\nYear Ended September 30,\nCurrent\nFederal\n$ - $ -\nState\n- -\nTotal current\n- -\nDeferred\nFederal\n- -\nState\n- -\nTotal deferred\n- -\nTotal provision\n$ - $ -\nA reconciliation for the federal statutory income tax rate to the Companys effective income tax rate is as follows:\nYear Ended September 30,\nFederal statutory income tax rate\n21.0 % 21.0 %\nState income taxes, net of federal benefit\n1.4 0.4\nPermanent differences\n(1.5 ) (17.1 )\nContingent derivative expense\n0.2 2.5\nChange in valuation allowance\n(21.1 ) (6.8 )\nProvision for income taxes\n0.0 % 0.0 %\nSignificant components of the Companys deferred income taxes are shown below:\nYear Ended September 30,\nDeferred tax assets:\nNet operating loss carryforwards\n$ 14,784,000 $ 12,909,000\nROU - Liability\n824,000 1,087,000\nCapital loss carryforward\n702,000 702,000\nAllowance for doubtful accounts\n9,000 8,000\nStock compensation\n521,000 833,000\nIntangibles\n105,000 -\nInvestments\n180,000 452,000\nAccrued expenses\n87,000 214,000\nFixed Assets\n45,000 40,000\nInventory reserve\n28,000 35,000\nCapitalized expenses\n43,000 48,000\nCharitable contributions\n39,000 45,000\nTotal deferred tax assets\n17,367,000 16,373,000\nDeferred tax liabilities:\nPrepaid Expenses\n(107,000 ) (257,000 )\nROU - Assets\n(750,000 ) (1,002,000 )\nIntangibles\n- (3,426,000 )\nTotal deferred tax liabilities\n(857,000 ) (4,685,000 )\nNet deferred tax assets\n16,510,000 11,688,000\nValuation allowance\n(16,510,000 ) (11,688,000 )\nNet deferred tax liability\n$ - $ -\nNet deferred tax liability\nThe Company has established a valuation allowance against net deferred tax assets due to the uncertainty that such assets will be realized. The deferred tax liabilities that result from indefinite life intangibles cannot be offset by deferred tax assets. The Company periodically evaluates the recoverability of the deferred tax assets. At such time as it is determined that it is more likely than not that deferred tax assets will be realizable, the valuation allowance will be reduced. Under Internal Revenue Code (IRC) Section 382, the use of net operating loss (NOL) carryforwards may be limited if a change in ownership of a company occurs. During the year ending September 30, 2018, the company determined that a change of ownership under IRC Section 382 had occurred during the years ending September 30, 2017 and 2015. As a result of these ownership changes, the pre-ownership change NOL carryforwards would be limited and approximately $2.1 million of such NOLs will expire before being utilized. Therefore, at September 30, 2018 the Company reduced the deferred tax asset and related valuation allowance associated with these NOLs by approximately $0.5 million due to IRC Section 382.\nDuring the year ended September 30, 2020, the Company determined that a change in ownership under IRC had occurred during the year ending September 30, 2019. As a result of these ownership changes, the pre-ownership change NOL carryforwards would be limited and approximately $11.4 million of such NOLs will expire before being utilized. Therefore, at September 30, 2020 the Company reduced the deferred tax asset and related valuation allowance associated with these NOLs by approximately $2.7 million due to IRC Section 382.\nThere have been issuances of stock since 2019 but the Company has not performed any analysis since then to determine if any additional ownership changes have occurred that would further limit the use of the NOLs to offset future income.\nAt September 30, 2023, the Company has utilizable NOL carryforwards of approximately $65.9 million which for federal purposes will carryforward indefinitely.\nThe Company accounts for its state franchise and minimum taxes as a component of its general and administrative expenses.\nThe Company files income tax returns in the United States, and various state jurisdictions. The Companys policy is to recognize interest expense and penalties related to income tax matters as tax expense. At September 30, 2023 and 2022, there are no unrecognized tax benefits, and there are no significant accruals for interest related to unrecognized tax benefits or tax penalties.\nThe Company has had a valuation allowance against the net deferred tax assets, with the exception of the deferred tax liabilities that result from indefinite-life intangibles (\"naked credits\"). During the year ended September 30, 2021, the Company generated enough indefinite life deferred tax assets from post-merger NOLs to reduce the naked credits to zero during the year and continue to record a valuation allowance on remaining deferred tax assets.\nNOTE 16 - SUBSEQUENT EVENTS\nNone."
}