{
    "cik": "1644378",
    "company": "RMR GROUP INC.",
    "filing_type": "10-K",
    "filing_date": "2022-11-14",
    "period_of_report": "2022-09-30",
    "sic": "8742",
    "state_of_inc": "MD",
    "state_location": "MA",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1644378/0001644378-22-000047-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1644378/000164437822000047/rmr-20220930.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1644378/0001644378-22-000047.txt",
    "filename": "1644378_10K_2022_0001644378-22-000047.htm",
    "content": "Item 1. Business\nOur Company\nThe RMR Group Inc., or RMR Inc., is a holding company incorporated as a Maryland corporation and substantially all of its business is conducted by its majority owned subsidiary, The RMR Group LLC, or RMR LLC. RMR LLC is a Maryland limited liability company. RMR Inc. serves as the sole managing member of RMR LLC and, in that capacity, operates and controls the business and affairs of RMR LLC. In this Annual Report on Form 10-K, unless otherwise indicated, we, us and our refers to RMR Inc. and its direct and indirect subsidiaries, including RMR LLC.\nAs of September 30, 2022, RMR Inc. owned 15,606,115 class A membership units of RMR LLC, or Class A Units, and 1,000,000 class B membership units of RMR LLC, or Class B Units. The aggregate RMR LLC membership units RMR Inc. owns represent approximately 52.5% of the economic interest of RMR LLC. A subsidiary of ABP Trust owns 15,000,000 redeemable Class A Units, representing approximately 47.5% of the economic interest of RMR LLC.\nAdam D. Portnoy, the Chair of our Board and one of our Managing Directors, is the sole trustee of our controlling shareholder, ABP Trust, and owns all of ABP Trusts voting securities. As of September 30, 2022, Adam D. Portnoy beneficially owned (including through ABP Trust), in aggregate, (i) 185,502 shares of Class A common stock of RMR Inc., or Class A Common Shares; (ii) all the outstanding shares of Class B-1 common stock of RMR Inc., or Class B-1 Common Shares; and (iii) all the outstanding shares of Class B-2 common stock of RMR Inc., or Class B-2 Common Shares.\nSince its founding in 1986, RMR LLC has substantially grown assets under management and the number of real estate businesses it manages. As of September 30, 2022, we had $37.3 billion of assets under management.\nOur business primarily consists of providing management services to four publicly traded equity real estate investment trusts, or REITs, whose securities are listed on The Nasdaq Stock Market LLC, or Nasdaq: Diversified Healthcare Trust, a Maryland REIT, including its subsidiaries, or DHC; Industrial Logistics Properties Trust, a Maryland REIT, including its subsidiaries, or ILPT; Office Properties Income Trust, a Maryland REIT, including its subsidiaries, or OPI; and Service Properties Trust, a Maryland REIT, including its subsidiaries, or SVC. DHC, ILPT, OPI and SVC are collectively referred to as the Managed Equity REITs. We also provide management services to three real estate operating companies: AlerisLife Inc., a Maryland corporation, or ALR; Sonesta International Hotels Corporation, a Maryland corporation, or Sonesta; and TravelCenters of America Inc., a Maryland corporation, or TA. ALR, Sonesta and TA are collectively referred to as the Managed Operating Companies.\nAs manager of the Managed Equity REITs, we are responsible for implementing investment strategies and managing day to day operations, subject to supervision and oversight by each Managed Equity REITs board of trustees. The Managed Equity REITs have no employees, and we provide the personnel and services necessary for each Managed Equity REIT to conduct its business. The Managed Equity REITs invest in diverse income producing properties across multiple real estate asset classes as follows:\nDHC (Nasdaq: DHC) owns medical office and life science properties, senior living communities and wellness centers. As of September 30, 2022, DHC owned 379 properties located in 36 states and the District of Columbia.\nILPT (Nasdaq: ILPT) owns and leases industrial and logistics properties. As of September 30, 2022, ILPT owned 413 properties, including 226 buildings, leasable land parcels and easements in Oahu, Hawaii and 187 properties located in 38 other states.\nOPI (Nasdaq: OPI) owns office properties primarily leased to single tenants and those with high quality credit characteristics, including the government. As of September 30, 2022, OPI owned 162 properties located in 31 states and the District of Columbia.\nSVC (Nasdaq: SVC) owns a diverse portfolio of hotels and net lease service and necessity-based retail properties. As of September 30, 2022, SVC owned 1,011 properties (242 hotels and 769 net lease properties) located in 46 states, Puerto Rico, Canada and the District of Columbia.\nWe also provide management services to the Managed Operating Companies that have diverse businesses as follows:\nALR (Nasdaq: ALR) operates senior living communities, many of which are owned by DHC. As of September 30, 2022, ALR managed or operated 140 senior living communities located in 28 states, including 120 communities that it managed and 20 communities that it owned and operated.\nSonesta is a privately owned franchisor and operator of hotels, resorts and cruise ships in the United States, Latin America, the Caribbean and the Middle East, and many of the U.S. hotels that Sonesta operates are owned by SVC. As of September 30, 2022, Sonestas business included 1,116 properties in eight countries.\nTA (Nasdaq: TA) operates and franchises travel centers primarily along the U.S. interstate highway system, many of which are owned by SVC, and standalone truck service facilities. As of September 30, 2022, TA operated or franchised 284 properties of which TA owned 57 (55 travel centers and two standalone truck service facilities) located in 44 states in the United States.\nRMR LLCs wholly owned subsidiary, Tremont Realty Capital LLC, or Tremont, an investment adviser registered with the Securities and Exchange Commission, or SEC, provides advisory services for Seven Hills Realty Trust, or SEVN. SEVN is a publicly traded mortgage REIT that focuses on originating and investing in first mortgage whole loans secured by middle market and transitional commercial real estate. Until September 30, 2021, Tremont also provided advisory services to Tremont Mortgage Trust, or TRMT, a publicly traded mortgage REIT that merged with and into SEVN on September 30, 2021, or the Merger, with SEVN continuing as the surviving company.\nThe Managed Equity REITs, SEVN and, until September 30, 2021, TRMT, are collectively referred to as the Managed REITs or the Managed Public Real Estate Capital clients.\nIn addition, RMR LLC provides management services to private capital vehicles, including ABP Trust and its subsidiaries, or collectively ABP Trust, and other private entities that own commercial real estate, of which certain of our Managed Equity REITs own minority equity interests. In this Annual Report on Form 10-K, we refer to these clients as the Managed Private Real Estate Capital clients.\nOur Business Strategy\nOur business strategy is to provide an expanded range of management services to our existing clients, as well as to diversify the number of clients to which we provide services and the sources of capital upon which those clients may rely for growth.\nWe believe that we have several strengths that distinguish our business from other alternative asset managers:\nRevenue Base. Our revenues are primarily earned from long term agreements with credit quality companies, many of which are permanent capital vehicles. Our agreements with the Managed Equity REITs are 20 year term evergreen contracts with significant termination fees payable in certain circumstances. For the fiscal year ended September 30, 2022, revenues earned from the Managed Equity REITs represented 74.1% of our total management and advisory services revenue.\nStrong Operating Margins and Resulting Cash Flows. For the fiscal year ended September 30, 2022, we continued to generate strong operating margins resulting in net cash from operating activities of $101.3 million and net income of $77.5 million. We have no debt outstanding. Our regular dividend of $0.40 per share per quarter ($1.60 per share per year) has been well covered by our cash flows.\nDiverse Portfolio of Managed Real Estate. We provide management services to a wide range of real estate assets and businesses that include healthcare facilities, senior living and other apartments, hotels, office buildings, industrial buildings, leased lands, net-lease service and necessity-based retail, including travel centers, and various specialized properties such as properties leased to government tenants and properties specially designed for medical and biotech research. The properties and businesses we managed as of September 30, 2022, are located throughout the United States in 46 states and Washington D.C., and in Puerto Rico and Canada. The diversity of our managed portfolio helps provide balance throughout economic cycles, as the impacts to each respective real estate sector can vary.\nGrowth. Since the founding of RMR LLC in 1986, we have substantially grown our assets under management and the number and variety of real estate businesses we manage. As of September 30, 2022, we had $37.3 billion of assets under management, including 2,100 properties. The synergies among our clients may also facilitate their and\nour growth. We assist our clients in realizing investment opportunities by working together to make acquisitions, obtain financing, identifying possible joint venture partners, completing redevelopment activities, facilitating capital recycling from strategic property dispositions and assisting in portfolio repositioning and other business arrangements and strategic restructurings.\nIn addition, we expect to use cash on hand, future operating cash flows and may issue equity or incur debt to fund our growth and diversify our operations through possible acquisition opportunities or seeding new clients. In recent years, we sought to expand the sources of capital underlying our assets under management, with our Managed Private Real Estate Capital clients representing $3.9 billion of our assets under management as of September 30, 2022, an increase of $2.6 billion from September 30, 2021.\nQuality and Depth of Management. Our highly qualified and experienced management team provides a broad base of deep expertise to our clients. Our senior management has worked together through several business cycles in which they acquired, financed, managed and disposed of real estate assets and started real estate businesses. We are a vertically integrated manager and as of September 30, 2022, we employed over 600 real estate professionals in more than 30 offices throughout the United States. Additionally, the clients we manage collectively had approximately $12.2 billion of annual revenues and over 38,000 employees at September 30, 2022. We have also assisted our clients to grow by successfully accessing the capital markets; since our founding in 1986, our clients have successfully completed over $42.0 billion of financing in approximately 185 capital raising transactions.\nAlignment of Interests. We believe our structure fosters strong alignment of interests between our principal executive officer and our shareholders because our principal executive officer, Adam D. Portnoy, has a 51.2% economic interest in RMR LLC. Alignment of interests also exists between us and our Managed Equity REITs due to the manner upon which we earn base management fees and incentive management fees under our Management Agreements with the Managed Equity REITs, as described in more detail below.\nWe can provide no assurance that we will be able to implement our business strategy or achieve our desired growth. Our business and the businesses of our clients are subject to a number of risks and uncertainties. See Risk Factors beginning on page 13.\nOur Management Agreements with the Managed Equity REITs\nRMR LLC is party to a business management agreement and a property management agreement with each Managed Equity REIT. The following is a summary of the terms of our business and property management agreements with the Managed Equity REITs. The summary does not purport to be complete and is subject to, and qualified in its entirety by, reference to the actual agreements, copies of which are filed or incorporated as exhibits to this Annual Report on Form 10-K.\nBusiness Management Agreement Services\nEach business management agreement requires RMR LLC to use its reasonable best efforts to present the Managed Equity REIT with a continuing and suitable real estate investment program consistent with the REITs real estate investment policies and objectives.\nSubject to the overall management, direction and oversight of the Board of Trustees of each Managed Equity REIT, RMR LLC has the responsibility to:\nprovide research and economic and statistical data in connection with the Managed Equity REITs real estate investments and recommend changes in the Managed Equity REITs real estate investment policies when appropriate;\ninvestigate, evaluate and negotiate contracts for the investment in, or the acquisition or disposition of, real estate and related interests, financing and refinancing opportunities and make recommendations concerning specific real estate investments to the Board of Trustees of the Managed Equity REIT;\ninvestigate, evaluate, prosecute and negotiate any of the Managed Equity REITs claims in connection with its real estate investments or otherwise in connection with the conduct of the Managed Equity REITs business;\nadminister bookkeeping and accounting functions as required for the Managed Equity REITs business and operation, contract for audits and prepare or cause to be prepared reports and filings required by a governmental\nauthority in connection with the conduct of the Managed Equity REITs business, and otherwise advise and assist the Managed Equity REIT with its compliance with applicable legal and regulatory requirements;\nadvise and assist in the preparation of all equity and debt offering documents and all registration statements, prospectuses or other documents filed by the Managed Equity REIT with the SEC or any state;\nretain counsel, consultants and other third party professionals on behalf of the Managed Equity REIT;\nprovide internal audit services;\nadvise and assist with the Managed Equity REITs risk management and business oversight function;\nadvise and assist the Managed Equity REIT with respect to the Managed Equity REITs public relations, preparation of marketing materials, internet website and investor relations services;\nprovide communication facilities for the Managed Equity REIT and its officers and trustees and provide meeting space as required;\nprovide office space, equipment and experienced and qualified personnel necessary for the performance of the foregoing services; and\nto the extent not covered above, advise and assist the Managed Equity REIT in the review and negotiation of the Managed Equity REITs contracts and agreements, coordination and supervision of all third party legal services and oversight for processing of claims by or against the Managed Equity REIT.\nProperty Management Agreement Services\nUnder each property management agreement, subject to the overall management and supervision of the Board of Trustees of each Managed Equity REIT, RMR LLC is required to act as managing agent for each Managed Equity REITs properties and devote such time, attention and effort as may be appropriate to operate and manage the Managed Equity REITs properties in a diligent, orderly and efficient manner.\nTerm and Termination\nThe business and property management agreements with each Managed Equity REIT automatically extend on December 31st of each year and have terms thereafter that end on the 20th anniversary of the date of each extension. A Managed Equity REIT has the right to terminate its management agreements with RMR LLC: (1) at any time upon 60 days written notice for convenience, (2) immediately upon written notice for cause, as defined in the agreements, (3) upon written notice given within 60 days after the end of an applicable calendar year for a performance reason, as defined in the agreements, and (4) by written notice during the 12 months following a manager change of control, as defined in the agreements. RMR LLC has the right to terminate the management agreements for good reason, as defined in the agreements.\nIf a Managed Equity REIT terminates a management agreement for convenience, or if RMR LLC terminates a management agreement with a Managed Equity REIT for good reason, the Managed Equity REIT is obligated to pay RMR LLC a termination fee equal to the sum of the present values of the monthly future fees, as defined in the agreement, payable for the remaining term of the agreement, assuming it had not been terminated. If a Managed Equity REIT terminates a management agreement for a performance reason, as defined in the agreement, the Managed Equity REIT is obligated to pay RMR LLC the termination fee calculated as described above, but assuming a remaining term of ten years.\nThe management agreements provide for certain adjustments to the termination fees if a Managed Equity REIT merges with another REIT to which RMR LLC is providing management services or if the Managed Equity REIT spins off a subsidiary to which it contributed properties and to which RMR LLC is providing management services both at the time of the spin off and on the date of the expiration or termination of either of the management agreements.\nA Managed Equity REIT is not required to pay any termination fee if it terminates its business or property management agreements for cause, or as a result of a manager change of control, in each case as defined in such agreements.\nBusiness Management Agreement Fees and Expense Reimbursement\nEach business management agreement between RMR LLC and a Managed Equity REIT provides for (i) an annual base management fee, payable monthly in arrears, and (ii) an annual incentive business management fee.\nThe annual base management fee generally is calculated as the lesser of:\nthe sum of (a) 0.5% of the historical cost of transferred real estate assets, if any, as defined in the applicable business management agreement, plus (b) 0.7% of the average invested capital (exclusive of the transferred real estate assets), as defined in the applicable business management agreement, up to $250.0 million, plus (c) 0.5% of the average invested capital exceeding $250.0 million; and\nthe sum of (a) 0.7% of the average market capitalization, as defined in the applicable business management agreement, up to $250.0 million, plus (b) 0.5% of the average market capitalization exceeding $250.0 million.\nThe annual incentive business management fee payable by each Managed Equity REIT, if any, is calculated as follows:\nThe incentive business management fee is calculated as an amount equal to 12.0% of the product of (a) the equity market capitalization of the Managed Equity REIT, as defined in the applicable business management agreement, on the last trading day of the year immediately prior to the measurement period, and (b) the amount, expressed as a percentage, by which the Managed Equity REITs total return per share realized by its common shareholders (i.e. share price appreciation plus dividends) or the total return per share, exceeds the total shareholder return of a specified REIT index, the benchmark return per share, for the relevant measurement period, with each of (a) and (b) subject to adjustments for net common shares issued by the Managed Equity REIT during the measurement period.\nThe measurement period for an annual incentive business management fee is defined as the three year period ending on December 31 of the year for which such fee is being calculated.\nThe specified REIT index utilized to calculate the benchmark return per share for each of our Managed Equity REITs when calculating the incentive business management fees is as follows:\nFor the Periods\nThrough July 31, 2021 On and After August 1, 2021\nDHC SNL U.S. REIT Healthcare Index MSCI U.S. REIT/Health Care Index\nILPT SNL U.S. Industrial REIT Index MSCI U.S. REIT/Industrial REIT Index\nOPI SNL U.S. Office REIT Index MSCI U.S. REIT/Office REIT Index\nSVC SNL U.S. REIT Hotel Index MSCI U.S. REIT/Hotel & Resort REIT Index\nNo incentive business management fee is payable by the Managed Equity REIT unless its total return per share during the measurement period is positive.\nIf the Managed Equity REITs total return per share exceeds 12% per year in the measurement period, the benchmark return per share is adjusted to be the lesser of the total shareholder return of the specified REIT index for such measurement period and 12% per year, or the adjusted benchmark return per share. In instances where the adjusted benchmark return per share applies, the incentive fee will be reduced if the Managed Equity REITs total return per share is between 200 basis points and 500 basis points below the specified REIT index in any year, by a low return factor, as defined in the applicable business management agreement, and there will be no incentive business management fee paid if, in these instances, the Managed Equity REITs total return per share is more than 500 basis points below the specified REIT index in any year, determined on a cumulative basis (i.e., between 200 basis points and 500 basis points per year multiplied by the number of years in the measurement period and below the applicable market index).\nThe incentive business management fee payable by the Managed Equity REIT is subject to a cap equal to the value of the number of its common shares which would, after issuance, represent (a) 1.5% of the number of its common shares outstanding on December 31 of the year for which such fee is being calculated multiplied by (b) the average closing price of its common shares during the 10 consecutive trading days having the highest average closing prices during the final 30 trading days of the relevant measurement period.\nIncentive fees paid by the Managed Equity REIT for any measurement period may be subject to certain clawback if the financial statements of the Managed Equity REIT for that measurement period are restated due to material non-compliance with any financial reporting requirements under the securities laws as a result of the bad faith, fraud, willful misconduct or gross negligence of RMR LLC and the amount of the incentive fee paid by the Managed Equity REIT was greater than the amount it would have paid based on the restated financial statements.\nIf the business management agreement is terminated, the base business management fee and incentive business management fee due in respect of any partial period prior to the date of termination will be prorated as provided in the agreement.\nUnder each business management agreement: the Managed Equity REIT pays or reimburses RMR LLC for all of the expenses relating to the Managed Equity REITs activities, including the costs and expenses of investigating, acquiring, owning and disposing of its real estate (third party property diligence costs, appraisal, reporting, audit and legal fees), its costs of borrowing money, its costs of securities listing, transfer, registration and compliance with reporting requirements and its costs of third party professional services, including legal and accounting fees, and as otherwise agreed; and RMR LLC bears its general and administrative expenses relating to its performance of its obligations under the agreement, including expenses of its personnel, rent and other office expenses. Also, the allocable cost of internal audit services is reimbursed by each Managed Equity REIT to RMR LLC.\nProperty Management Agreement Fees and Expense Reimbursement\nEach property management agreement between RMR LLC and a Managed Equity REIT provides for the following:\n(i) a management fee equal to 3.0% of the gross rents collected from tenants, which is not applicable to any hotels, senior living communities or travel centers which are leased to, or managed by, a Managed Operating Company or another operating business such as a hotel management company or a senior living or healthcare services provider; and\n(ii) a construction supervision fee equal to 5.0% of the cost of any construction, renovation or repair activities at the Managed Equity REITs properties, other than ordinary maintenance and repairs, and 3% of the cost of any major capital project or repositionings at DHCs senior living communities and SVCs hotels.\nAlso, under each property management agreement, the Managed Equity REIT pays certain allocable expenses of RMR LLC in the performance of its duties, including wages for onsite property management personnel and allocated costs of centralized property management services.\nOther Provisions\nUnder both the business and property management agreements, each Managed Equity REIT has agreed to indemnify RMR LLC, its members, officers, employees and affiliates against liabilities relating to acts or omissions of RMR LLC with respect to the provision of services by RMR LLC, except to the extent such provision of services was in bad faith or fraudulent, constituted willful misconduct or was grossly negligent. In addition, each management agreement provides that any disputes, as defined in those agreements, arising out of or relating to the agreement or the provision of services pursuant thereto, upon the demand of a party to the dispute, will be subject to mandatory arbitration in accordance with procedures provided in the agreement.\nOur Management Agreements with the Managed Operating Companies\nRMR LLC provides services and earns fees pursuant to a management agreement with each of the Managed Operating Companies. Under these agreements, RMR LLC provides services to the Managed Operating Companies relating to, or assists them with, among other things, their compliance with various laws and rules applicable to them, capital markets and financing activities, maintenance of their properties, selection of new business sites and evaluation of other business opportunities, accounting and financial reporting, internal audit, investor relations and general oversight of the companys daily business activities, including legal and tax matters, human resources, insurance programs and management information systems.\nEach Managed Operating Company pays RMR LLC a fee under its management agreement in an amount equal to 0.6% of: (i) in the case of ALR, ALRs revenues from all sources reportable under U.S. Generally Accepted Accounting Principles, or GAAP, less any revenues reportable by ALR with respect to properties for which it provides management services, plus the gross revenues at those properties determined in accordance with GAAP; (ii) in the case of Sonesta, Sonestas revenues from all sources reportable under GAAP, less any revenues reportable by Sonesta with respect to hotels for which it provides management services, plus the gross revenues at those hotels determined in accordance with GAAP; and (iii) in the case of TA, the sum of TAs gross fuel margin, determined as TAs fuel sales revenues less its cost of fuel sales, plus TAs total nonfuel revenues. In addition, the management agreement with each Managed Operating Company provides that the compensation of senior executives of the Managed Operating Company, who are also employees or officers of RMR LLC, is the responsibility of the party to or on behalf of which the individual renders services. In the past, because at least 80.0% of each of these executives business time was devoted to services to the Managed Operating\nCompany, 80.0% of these executives total cash compensation was paid by the Managed Operating Company and the remainder was paid by RMR LLC.\nThe terms of the management agreements with each Managed Operating Company end on December 31st of each year, and automatically extend for successive one year terms, unless RMR LLC or the applicable Managed Operating Company gives notice of non-renewal before the expiration of the applicable term. Also, a Managed Operating Company may terminate its management agreement at any time (i) for ALR and TA, on 60 days notice and RMR LLC may terminate such agreements at any time on 120 days notice and (ii) for Sonesta, on 30 days notice and RMR LLC may terminate its agreement with Sonesta on 30 days notice. If ALR or TA terminates or elects not to renew its agreement, other than for cause as defined in each agreement, the Managed Operating Company is obligated to pay RMR LLC a termination fee equal to 2.875 times the sum of the annual base management fee and the annual internal audit services expense, which amounts are based on averages during the 24 consecutive calendar months prior to the date of notice of nonrenewal or termination.\nEach Managed Operating Company has agreed to indemnify RMR LLC, its members, officers, employees and affiliates against liabilities relating to acts or omissions of RMR LLC with respect to the provision of services by RMR LLC, except to the extent such provision of services was in bad faith or was grossly negligent. In addition, each agreement provides that any disputes, as defined in those agreements, arising out of or relating to the agreement or the provision of services pursuant thereto, upon the demand of a party to the dispute, shall be subject to mandatory arbitration in accordance with procedures provided in the agreement.\nOur Management Agreements with the Managed Private Real Estate Capital Clients\nRMR LLC provides management services to our Managed Private Real Estate Capital clients for which we receive, depending upon the services provided, a management fee based on a percentage of average invested capital, as defined in the applicable management agreements, a property management fee in an amount equal to 3.0% of rents collected from managed properties and a construction supervision fee in an amount equal to 5.0% of the cost of any construction, renovation or repair activities at the managed properties, other than ordinary maintenance and repairs.\nOur Management Agreements with Advisory Clients\nTremont is party to a management agreement with SEVN. Pursuant to this agreement, Tremont provides SEVN with a continuous investment program, makes day to day investment decisions and generally manages the business affairs of SEVN in accordance with SEVNs investment objectives and policies.\nTremont is compensated pursuant to its management agreement with SEVN at an annual rate of 1.5% of equity, as defined in the agreement. Tremont may also earn an incentive fee under this management agreement beginning the second calendar quarter of 2021 equal to the difference between: (a) the product of (i) 20% and (ii) the difference between (A) SEVNs core earnings, as defined in the agreement, for the most recent 12 month period (or such lesser number of completed calendar quarters, if applicable), including the calendar quarter (or part thereof) for which the calculation of the incentive fee is being made, and (B) the product of (1) SEVNs equity in the most recent 12 month period (or such lesser number of completed calendar quarters, if applicable), including the calendar quarter (or part thereof) for which the calculation of the incentive fee is being made, and (2) 7% per year and (b) the sum of any incentive fees paid to Tremont with respect to the first three calendar quarters of the most recent 12 month period (or such lesser number of completed calendar quarters preceding the applicable period, if applicable). No incentive fee shall be payable with respect to any calendar quarter unless core earnings for the 12 most recently completed calendar quarters (or such lesser number of completed calendar quarters from January 5, 2021) in the aggregate is greater than zero. The incentive fee may not be less than zero.\nThe initial term of the management agreement with SEVN ends on December 31, 2023, and the agreement will automatically renew for successive one year terms beginning January 1, 2024 and each January 1 thereafter, unless it is sooner terminated upon written notice delivered no later than 180 days prior to a renewal date by the affirmative vote of at least two-thirds (2/3) of the independent trustees of SEVN based upon a determination that (a) Tremonts performance is unsatisfactory and materially detrimental to SEVN or (b) the base management fee and incentive fee, taken as a whole, payable to Tremont under the management agreement is not fair to SEVN (provided that in the instance of (b), Tremont will be afforded the opportunity to renegotiate the base management fee and incentive fee prior to termination). The management agreement may be terminated by Tremont before each annual renewal upon written notice delivered to the board of trustees of SEVN no later than 180 days prior to an annual renewal date.\nIn the event the management agreement is terminated by SEVN without a cause event or by Tremont for a material breach, SEVN will be required to pay Tremont a termination fee equal to (a) three times the sum of (i) the average annual\nbase management fee and (ii) the average annual incentive fee, in each case paid or payable to Tremont during the 24 month period immediately preceding the most recently completed calendar quarter prior to the date of termination or, if such termination occurs within 24 months of its initial commencement, the base management fee and the incentive fee will be annualized for such two year period based on such fees earned by Tremont during such period, plus (b) $1.6 million. In addition, the initial organizational costs related to TRMTs formation and the costs of its initial public offering and the concurrent private placement that Tremont had paid pursuant to its management agreement with TRMT will be included in the Termination Fee under and as defined in SEVNs management agreement with Tremont. No termination fee will be payable if the management agreement is terminated by SEVN for a cause event or by Tremont without SEVNs material breach.\nTremont, and not SEVN, will be responsible for the costs of Tremonts employees who provide services to SEVN, including the cost of Tremonts personnel who originate SEVNs loans, unless any such payment or reimbursement is specifically approved by a majority of the independent trustees of SEVN or is a shared services cost or relates to awards made under any equity compensation plan adopted by SEVN from time to time. SEVN is required to pay or to reimburse Tremont and its affiliates for all other costs and expenses of SEVNs operations, including but not limited to, the costs of rent, utilities, office furniture, equipment, machinery and other overhead type expenses, the costs of legal, accounting, auditing, tax planning and tax return preparation, consulting services, diligence costs related to SEVNs investments, investor relations expenses and other professional services, and other costs and expenses not specifically required under the management agreement to be borne by Tremont. Some of these overhead, professional and other services will be provided by RMR LLC pursuant to a shared services agreement between Tremont and RMR LLC. In addition, SEVN will also pay its pro rata costs of any combined directors and officers liability or other insurance programs arranged by RMR LLC for public companies managed by RMR LLC or its affiliates and SEVNs pro rata portion of internal audit costs incurred by RMR LLC on behalf of SEVN and other public companies to which RMR LLC or its affiliates provides management services.\nOur Organizational Structure\nOur organizational structure has not materially changed since September 30, 2019. For a discussion of our organizational structure, see Part I, Item 1 Business - Our Organizational Structure in our Annual Report on Form 10-K for the fiscal year ended September 30, 2019.\nRegulation\nWe and our clients are subject to supervision and regulation by state, federal and non-U.S. governmental authorities and are subject to various laws and judicial and administrative decisions imposing various requirements and restrictions upon the ways in which we and our clients do business including various requirements for public disclosure of our and their activities.\nThe Managed REITs have qualified and expect to continue to qualify to be taxed as REITs under Sections 856 through 860 of the Internal Revenue Code of 1986, as amended, or the Code. In addition, the Managed REITs generally distribute 100.0% of their taxable income to avoid paying corporate federal income taxes; and as REITs, such companies must currently distribute, at a minimum, an amount equal to 90.0% of their taxable income. REITs are also subject to a number of organizational and operational requirements in order to elect and maintain REIT status, including share ownership tests and assets and gross income composition tests. If a Managed REIT fails to continue to qualify as a REIT under Sections 856 through 860 of the Code in any taxable year, it will be subject to federal income tax (including any applicable alternative minimum tax) on its taxable income at regular corporate tax rates. Even if a Managed REIT qualifies for taxation as a REIT, it may be subject to state and local income taxes and to federal income tax and excise tax on its undistributed income.\nCertain of our clients own or operate healthcare and senior living properties. These companies are subject to numerous federal, state and local laws and regulations that are subject to frequent and material changes (sometimes applied retroactively) resulting from legislation, adoption of rules and regulations and administrative and judicial interpretations of existing laws. Some of the revenues received by these companies are paid by governmental programs which are also subject to periodic and material changes.\nCertain of our clients own and operate hotels and some provide dining, food and beverage services, including the sale of alcoholic beverages. The operation of such properties is subject to numerous regulations by various governmental entities.\nTA is also required to comply with federal and state regulations regarding the storage and sale of petroleum and natural gas products and franchising of petroleum retailers. In addition, as a result of TAs involvement in gaming operations, TA and certain of its subsidiaries are subject to gaming regulations in Illinois, Louisiana, Montana, Nevada and Pennsylvania; and because SVC owns TA properties where gaming occurs, SVC is also subject to gaming regulations in some of those jurisdictions.\nTremont is registered with the SEC as an investment adviser under the Investment Advisers Act of 1940, as amended, or the Investment Advisers Act. Tremont provides investment advisory and administrative services to mortgage REITs, including SEVN, and may, in the future, provide such services to private funds that invest in commercial real estate debt. Employees of Tremont may also act as transaction originators for its non-investment advisory clients, which we refer to as the Tremont business. These activities result in certain aspects of our asset management business being supervised by the SEC and requires our compliance with numerous obligations, including record keeping requirements, operational procedures and disclosure obligations. SEVN intends to conduct its business in a manner that does not require its registration under the Investment Company Act of 1940, or the 1940 Act, and to do so, may rely on any available exemption from registration, or exclusion from the definition of investment company, under the 1940 Act. To maintain this exemption from registration, SEVN will be required to ensure the composition of its portfolio complies with certain tests.\nThe ownership and operation of real estate properties are subject to various federal, state and local laws and regulations concerning the protection of the environment, including air and water quality, hazardous or toxic substances and health and safety. Certain of our clients own real estate, and we may be responsible for compliance with some of these environmental protection laws.\nWhile we incur significant expense to comply with the various regulations to which we and our clients are subject, we do not believe that existing statutes and regulations have had a material adverse effect on our business. However, it is not possible to forecast the nature of future legislation, regulations, judicial decisions, orders or interpretations, nor their impact upon our future business, financial condition, results of operations or prospects.\nCompetition\nThe asset management industry is intensely competitive, and we expect it to remain so. Our continued growth will depend upon our ability to manage or assist our clients in an effective manner and identify and execute on opportunities to expand our services to new clients and new sources of capital.\nOur existing clients face significant competition in their respective sectors or industries. The Managed Equity REITs compete on a national and regional basis with many third parties engaged in real estate investment activities including other publicly traded REITs, non-traded REITs, commercial and investment banking firms, private institutional funds, private equity funds and other investors. ALR competes with numerous other companies that provide senior living services, including home healthcare companies and other real estate based service providers. Sonesta competes with other hotel operators and franchisors. TA competes on a national and local basis with companies operating travel centers, as well as retailers operating in the convenience store and retail gas station industries. SEVN competes on a national and regional basis with a variety of institutional investors, including other REITs, specialty finance companies, public and private funds (including funds or investors that we or our affiliates may sponsor, advise or manage), banks, credit unions, insurance companies and other financial institutions.\nWe compete with other businesses in the real estate management and asset management businesses. Many of these competitors may have greater financial, technical, marketing and other resources than we or our clients have. Such competitors may also enjoy significant competitive advantages that result from, among other things, a lower cost of capital, greater business scale and enhanced operating efficiencies. Certain competitors may also be subject to different regulatory regimes or rules that may allow them more flexibility or better access to pursue potential investments and raise capital for themselves or their managed companies. In addition, certain competitors may have higher risk tolerance, different risk assessments or lower return thresholds, which could allow them to consider a broader range of investments and to bid more aggressively for investment opportunities. Our ability and the ability of our clients to continue to compete effectively will depend in large part upon the ability to attract, retain and motivate employees.\nCorporate Sustainability\nOver our more than three decades in business, we and our clients have been guided by Environmental, Social and Governance, or ESG, principles. Given the magnitude of our platform, we believe corporate sustainability must be a strategic focus alongside our focus on economic performance. Our sustainability practices - minimizing our impact on the environment, embracing the communities where we operate and attracting top professionals - are critical elements supporting our long-term success.\nEnvironmental Focus\nWe recognize our responsibility to minimize the impact of our business on the environment. We seek to preserve natural resources and maximize efficiencies in order to reduce the impact the properties we manage have on the planet. Our\nenvironmental sustainability strategies and best practices help to mitigate our managed properties environmental footprint, optimize operational efficiency and enhance our competitiveness in the marketplace. Certifications help to benchmark performance and mitigate risk.\nIn 2022, we announced our Zero Emissions Promise. For all properties where we directly manage energy, we are committing to a goal of net zero by 2050 and a 50% reduction by 2030 from a 2019 baseline as it relates to scope 1 and 2 emissions. We anticipate emissions reductions will occur through a combination of strategic capital investments in energy efficiency by the Managed Equity REITs, stakeholder engagement to promote sustainable behavior, the deployment of on site solar and the purchase of energy from renewable sources. We believe our efforts toward these goals will add value to our clients properties, benefit tenants by lowering their operating costs, drive sustainable economic returns and address investor demands that our clients have viable strategies to mitigate climate risk.\nWe drive value, manage risk and benchmark the performance of our managed properties by effectively capturing and managing data through real-time energy monitoring, or RTM. RTM facilitates advanced data analytics and access to detect faults and inefficiencies in equipment operations faster, meanwhile enhancing building system control in a cost-effective and scalable way. We launched this program in 2017 and it is now deployed in 63 managed properties, totaling approximately 50% of our managed annual electricity spend and through the end of 2021, has generated cumulative savings of $7.6 million. We continue to expand our RTM program and expect to cost effectively scale to cover up to 90% of our managed energy spend, resulting in operational savings and reduced equipment wear and tear, while maintaining high tenant comfort.\nOur energy performance programs drive down energy consumption and reduce carbon emissions of our managed properties. Lower energy use and emissions reduce our managed properties' potential exposure to policies that call for a carbon tax or other emissions-based penalties. Our existing business practices align with the Task Force on Climate-related Financial Disclosures, or TCFD, framework across both physical and transition risks and opportunities.\nAs a result of our sustainability initiatives, we and our managed properties have historically received honors from The Building Owners and Managers Association, or BOMA, The Environmental Protection Agency, or EPA, and the U.S. Green Building Council, or USGBC, amongst others. In 2021, the honors achieved by our Managed Equity REITs, included 60 BOMA 360 Certified Properties, 70 ENERGY STAR Certified Properties and 56 LEED Certified Properties. Finally, for the second year in a row, we received the 2022 ENERGY STAR Partner of the Year Sustained Excellence Award for outstanding efforts in Energy Management, and for the third year in a row, OPI received the 2022 ENERGY STAR Partner of the Year Sustained Excellence Award for outstanding efforts in Energy Management.\nHuman Capital Resources and Governance\nWe are led by an experienced management team with proven ability to manage and grow a resilient business. Moreover, significant insider ownership and the structure of the contracts with our clients provide a strong alignment of interests with our clients and with public shareholders. Our dedicated asset management and property management teams blend long-term strategic vision with careful execution of day-to-day operations to optimize efficiency and foster the sustainable growth of our Managed Equity REITs. Our property management organization is dedicated solely to the assets of our clients.\nEmployees and Equal Opportunity\nAs of September 30, 2022, RMR LLC employed approximately 600 real estate professionals, including 49% in our corporate office and 51% across our more than 30 offices throughout the United States. The average tenure of our employees was 6.5 years. Our employees are the foundation of our success and in many ways our most critical asset. We ensure employees receive competitive salaries and benefits and we aim to attract professionals who will uphold our values of social and environmental stewardship.\nWe are an equal opportunity employer, with all qualified applicants receiving consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status. Throughout our organization, including our Board, we are committed to racial equality and fostering a culture of diversity and inclusion. We have made diversity and inclusion an important part of our hiring, retention and development programs. As of September 30, 2022, 35% and 28% of our approximately 600 employees were female and non-white, respectively.\nBoard Diversity\nAs of September 30, 2022, our Board of Directors composition included 50% of members from underrepresented communities, including 33% female and 17% African American.\nEmployee Engagement, Education and Training\nOur employee engagement initiatives align with our goal of being an employer of choice with a thriving workforce that encourages career enrichment and positions us for growth. Our programs are carefully designed for hiring, developing and retaining the best talent in the real estate industry. Our compensation is designed to motivate and retain employees and align their interests with those of our clients. We believe our compensation and benefits are best in class and are consistent with companies in the alternative asset management industry. We periodically review the effectiveness and competitiveness of our compensation program.\nOur recruiting programs, on-boarding and retention programs and our development and on-going training programs currently include the following:\nLiveWell Employee Wellness Program: Our LiveWell program has steadily gained traction since it was launched in 2016 with the goal of providing resources and incentives to enhance employees physical, emotional and financial wellness. LiveWell includes a range of educational presentations, webinar series and wellness competitions.\nManaging with Impact: Since 2016, we hosted Managing with Impact workshops for managers throughout the company to expand their perspectives and increase their confidence as a new manager. Within their first year, managers complete the workshop and learn how to effectively delegate, solve problems and give meaningful performance feedback.\nTuition Reimbursement Program: We offer tuition assistance up to $20,000 annually for work-related education from accredited colleges and universities in order to deepen employees skillsets and support personal enrichment.\nAnalyst Conversion Program: Our Analyst Conversion Program is designed to attract new talent to our industry who otherwise may not have thought of real estate as a career path. The program echos our belief that a great first step toward a successful and lasting career in real estate is an analyst role and that we can increase the diversity in our talent pipeline with outreach to students who are members of groups traditionally underrepresented in real estate by gender, race and ethnicity.\nEngineering Development Program: Given the increasing challenges within the real estate industry of attracting qualified engineers throughout the country, we made it a strategic focus to develop the next generation of qualified building engineers. Our Engineering Development Program standardizes the recruitment and development of engineering candidates to prepare them for open positions and to plan for future engineering needs. We recruit from various trade schools and job fairs to identify candidates for the two-year program with a curriculum that includes specific onboarding plans for training in electrical, HVAC, or plumbing trades and covers a range of essential engineering staff development topics.\nNext Generation Executive Program: Our commitment to racial equality and to fostering a culture of diversity and inclusion at all levels of management motivated our decision to sponsor rising leaders in The Partnership, Inc.s Next Generation Executive program. Admission to this program is highly competitive and limited to a select group of Americas most promising multi-cultural leaders. The program prepares future leaders to meet the unique challenges facing todays senior executive. Areas of instruction include strategic innovation, organizational change, operating in a global market, team leadership and executive resiliency.\nIndustry Associations & Credentials: In order to further their professional development, many of our employees seek out credentials and association memberships, with any membership costs reimbursed by us. Examples of credentials and association memberships include: Building Owners and Managers Association Membership and Event Participation, Certified Property Manager, Certified Public Accountant and National Association of Industrial and Office Properties.\nCybersecurity\nOur cybersecurity program is led by our Chief Information Officer, who works closely with our senior management to develop and advance our cybersecurity strategy and regularly reports to our Audit Committee on cybersecurity matters. Our program is aligned with the National Institute of Standards and Technology five phase Cybersecurity Framework (Identify-Protect-Detect-Respond-Recover). We use industry leading security tools, regularly update our technology roadmaps, conduct simulated attacks, provide custom-built training for high-risk departments and mandate cybersecurity awareness and training a requirement for all employees. We have a detailed incident response plan in place in the event of a cybersecurity incident for contacting authorities and informing key stakeholders to ensure that any non-routine events are properly\nescalated. These plans are validated regularly to consider the types of decisions that would need to be made in the event of a cyber incident.\nInternet Website\nOur internet website address is www.rmrgroup.com. We make available, free of charge, through the Investors & Media section of our website, our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and amendments to these reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934, as amended, or the Exchange Act, as soon as reasonably practicable after these forms are filed with, or furnished to, the SEC. Any material we file with or furnish to the SEC is also maintained on the SEC website (sec.gov).\nThe information on or accessible through our website is not incorporated by reference into this Annual Report on Form 10-K or other documents we file with, or furnish to, the SEC. We intend to use our website as a means of disclosing material non-public information and for complying with our disclosure obligations under Regulation FD. Such disclosures will be included on our website in the Investors & Media section. Accordingly, investors should monitor such portions of our website, in addition to following our press releases, SEC filings and public conference calls and webcasts. Item 1A. Risk Factors\nSummary of Risk Factors\nOur business is subject to a number of risks and uncertainties. The following is a summary of the principal risk factors described in this section:\nunfavorable market and industry conditions may have a material adverse effect on our and our clients results of operations, financial condition and ability to pay dividends;\nsome of our clients businesses may not return to levels experienced prior to the COVID-19 pandemic;\nmost of our revenues are derived from services to a limited number of clients;\nour management fees from our clients are based, in general, on cost of assets, market capitalization, shareholder returns, rent receipts, capital projects or certain revenues, as applicable, and, accordingly our future revenues, income and cash flows will decline if the business activities, assets, market capitalizations, shareholder returns, rent receipts, capital projects or certain revenues of our clients decline;\nour revenues may be highly variable;\npotential terminations of our management agreements with our clients;\nincreases in market interest rates may significantly reduce our revenues or impede our growth;\nour ability to expand our business depends upon the growth and performance of our clients and our ability to obtain or create new clients for our business and is often dependent upon circumstances beyond our control;\nour ability to continue to pay a regular quarterly dividend is dependent on many factors, including current and expected earnings and alternative uses for available cash and our Board of Directors may decide to lower our dividends;\nour and our Managed Operating Companies ability to attract, retain and motivate sufficient qualified personnel in a challenging labor market and to effectively manage our and their labor costs;\nour ability to retain the services of our controlling shareholder and other key and talented personnel;\nour and our clients risks associated with our and their costs of compliance with laws and regulations, including securities regulations, exchange listing standards and other laws and regulations affecting public companies;\nESG initiatives, requirements and market expectations may impose additional costs and expose us and our clients to new risks;\nrisks related to the security of our information technology;\nrisks related to supply chain constraints, commodity pricing and other inflation, including inflation impacting wages and employee benefits;\nrisks related to acquisitions, dispositions and other activities by or among our clients;\nallegations, even if untrue, of any conflicts of interest arising from our management activities; and\nrisks to holders of our Class A Common Shares as a result of our dual class capital structure.\nProspective investors should carefully consider the risks described in this section, together with all of the other information in this Annual Report on Form 10-K. These risks may not be the only risks we face but are risks we believe may be material at this time. Additional risks and uncertainties that we do not yet know of, or that we currently think are immaterial, may also impair our business operations or financial results. If any of the events or circumstances described in this section occur, our business, financial condition or results of operations and the trading price of our securities could decline. Investors and prospective investors should consider these risks, the information contained under the heading Warning Concerning Forward-Looking Statements and the risks described elsewhere in this Annual Report on Form 10-K before deciding whether to invest in our securities. We may update these risk factors in our future periodic reports.\nRisks Related to Our Business\nUnfavorable market and industry conditions may have a material adverse effect on our and our clients results of operations, financial condition and ability to pay dividends.\nOur business may be adversely affected by market and economic volatility experienced by the U.S. and global economies, the real estate industry as a whole and/or the local economies in the markets in which our clients properties are located. Unfavorable economic and industry conditions may be due to, among other things, rising interest rates, labor market challenges, supply chain disruptions, volatility in the public equity and debt markets, pandemics, geopolitical instability (such as the war in Ukraine), and other conditions beyond our control. These current conditions, or similar conditions existing in the future, have adversely affected, and may continue to adversely affect, our and our clients and their tenants and managers results of operations, financial condition and ability to pay dividends. These impacts have reduced, and may continue to reduce, our clients market capitalizations, revenues and capital projects, which may reduce the fees we earn from them. Higher interest rates may reduce the value of our clients properties, increase the cost of their capital, and reduce their ability to make acquisitions. Higher interest rates also may reduce dispositions by the Managed Equity REITs that could limit their ability to reduce leverage and recycle capital. Further, current market conditions have negatively impacted the stock price of some of the Managed Equity REITs, which in turn has negatively impacted the fees we earn from them. Additionally, some of our clients may be negatively impacted by an economic downturn and a corresponding reduction in economic activity that reduces trucking volume, business and leisure travel, hotel occupancy and demand for diesel fuel, gasoline, and office, retail and industrial space, and may also limit the ability of residents and potential residents to pay for senior living communities.\nSome of our clients businesses may not return to the levels experienced prior to the COVID-19 pandemic.\nSome of our clients businesses were significantly impacted by the COVID-19 pandemic, including senior living, hotels, office and retail. Although these businesses have significantly improved from the low points experienced during the COVID-19 pandemic, they have not returned to pre-pandemic levels and there is a risk they may not due to changed market practices, delayed returns to prior market practices, industry conditions or otherwise. For instance, occupancy has increased at DHCs senior living communities but not to pre-pandemic levels. In addition, although workers have increasingly returned to the office, they have not to date done so at the levels experienced prior to the pandemic and the adoption of remote, hybrid and other flexible working arrangements may result in long term declines in office occupancy and declines in demand for office space. Additionally, although leisure travel has increased, business travel has not experienced the same level of increase and it is unclear when or if business travel will return to pre-pandemic levels. If these businesses do not further improve and grow, our business, operating results and financial condition may be harmed, including if we experience a reduction or slower growth in the fees we receive from our clients.\nMost of our revenues are derived from our provision of management services to a limited number of companies. The loss or failure, or decline in business or assets, of any of the Managed Equity REITs could substantially reduce our revenues.\nThe fees we earn from providing management services to, and the reimbursable fees we receive from, the Managed Equity REITs comprise most of our revenues. Further, our Managed Private Real Estate Capital clients have comprised an increasing portion of our revenues and our current business plans contemplate that trend continuing. Our operating results and our ability to maintain and grow our revenues depend upon the ability of our Managed Equity REITs, and increasingly, our Managed Private Real Estate Capital clients to raise or contribute capital to invest in real estate assets, to maintain and grow their investments and, as applicable, market capitalizations, and to achieve positive shareholder returns in excess of applicable REIT total shareholder return indexes. Reduced business activities, market capitalizations, shareholder returns, rents or capital projects of the Managed Equity REITs or Managed Private Real Estate Capital clients may materially reduce our revenues and our profitability.\nOur revenues may be highly variable.\nRMR LLCs business management agreement with each Managed Equity REIT provides for a base business management fee that is based on the lower of the average historical costs of the Managed Equity REITs assets under management or its average market capitalization, as calculated in accordance with the applicable business management agreement, and an incentive business management fee that is based on the Managed Equity REITs relative outperformance of a specified REIT total shareholder return index. The management fees we earn under these agreements are highly variable.\nThe base business management fee payable by a Managed Equity REIT may increase or decrease materially as the Managed Equity REIT acquires or disposes of real estate assets or its market capitalization increases or decreases. In addition, we generally only earn an incentive business management fee under our business management agreement with a Managed Equity REIT if it outperforms an identified REIT total shareholder return index during the measurement period and certain\nother conditions are satisfied, as measured at the end of the applicable measurement period. The shareholder returns realized by a Managed Equity REIT, its market capitalization and its ability to raise capital or make investments may be impacted by trends in the Managed Equity REITs portfolio, the U.S. real estate industry generally, the Managed Equity REITs industry specifically or other factors that are outside of our or its control, including inflation, rising interest rates, supply chain challenges and economic downturns or recessions. Whether we earn an incentive fee, and the amount of any incentive fee we may earn, may have a significant impact on the amount of revenues we earn. For example, in the fiscal year ended September 30, 2019, our incentive business management fees earned from the Managed Equity REITs was 39.9% of our total management and advisory services revenues, and we earned no incentive business management fees during the past three fiscal years from the Managed Equity REITs. Further, the fees we earn under our property management agreements with the Managed Equity REITs and our Managed Private Real Estate Capital clients are based on a percentage of the rents they receive and a percentage of the costs of construction, in each case, at properties we manage for them and certain of our Managed Operating Companies. To the extent the Managed Equity REITs or our applicable Managed Operating Companies receive reduced rent or incur lower construction costs, our property management fee revenues would be negatively impacted. Also, the fees under our management agreements with the Managed Operating Companies are based on a percentage of revenues earned by them or generated at the properties they manage. Our Managed Operating Companies have experienced high revenue volatility in the past, and given the nature of the Managed Operating Companies businesses (i.e., travel centers, senior living communities and hotels), may continue to experience revenue volatility for the reasonably foreseeable future.\nOur management agreements with our clients are subject to termination.\nOur management agreements with our clients may be terminated by a client or by us in certain circumstances. For example, if we do not satisfy the applicable measures for calendar year 2022 under our management agreements with DHC or SVC, DHC or SVC, as applicable, will have the right to terminate its management agreement by prior written notice to us within 60 days following December 31, 2022, and in which case, it would be required to pay us the applicable termination fee. If any of our management or advisory agreements with a client is terminated, we may be unable to replace the lost revenue. Even if we receive a termination fee upon the termination of a management agreement with a client, we may be unable to invest the after tax proceeds from the termination fee we receive in opportunities that earn returns equal to or greater than the revenues lost as a result of the terminated management agreement. The termination of our management agreement or advisory agreement with any of our clients could have a material adverse impact on our business, results of operations and financial condition.\nWe are significantly dependent on conditions in the commercial real estate industry.\nOur business and operations are significantly dependent on conditions in the commercial real estate industry, which in turn is impacted by general economic conditions in the United States. Significant portions of the commercial real estate market in the United States were negatively impacted by the COVID-19 pandemic and the resulting changes to market and workplace practices, including remote work for many office based workers, reduced hotel occupancy and declines in senior living communities operations. Although those conditions have since improved, some parts of the commercial real estate market have not returned to pre-COVID 19 pandemic levels. Further, current negative economic conditions exist, including rising interest rates, inflation, supply chain disruptions and possible economic recession. Adverse conditions in the commercial real estate industry and declining real estate values would harm our business and financial condition by limiting our and our clients access to debt and equity capital and our and their ability to grow our and their businesses. Adverse conditions may also give rise to an increase in tenant defaults under our clients leases, defaults of SEVNs loans, and decreased market capitalizations, shareholder returns, rent receipts and capital projects for the Managed Equity REITs.\nIncreases in market interest rates may significantly reduce our revenues or impede our growth.\nThe recent increases in interest rates may significantly reduce our revenues or impede our growth. In response to significant and prolonged increases in inflation over the past year, the Federal Reserve has raised interest rates six times since the beginning of calendar 2022 and has announced an expectation that it will continue to raise interest rates through the end of 2022 and into 2023. The timing, number and amount of any future interest rate increases are uncertain.\nIncreases in market interest rates may materially and negatively affect us. One of the factors that investors typically consider important in deciding whether to buy or sell the common shares of our Managed REITs is the distribution rate with respect to such shares relative to prevailing market interest rates. If market interest rates go up, investors may expect a higher distribution rate before investing in a Managed REIT or they may sell the Managed REITs common shares and seek alternate investments with a higher distribution rate. Sales of common shares of the Managed Equity REITs may cause a decline in the market prices of such shares, which reduces the market capitalizations and total shareholder returns of the Managed Equity REITs, which, in turn, may materially reduce the fees we earn under our business management agreements with them. Moreover, the increases in interest rates has led to increased borrowing costs for our clients and may negatively impact their access to capital to fund future growth, reduce their earnings and total shareholder returns and cause SEVNs borrowers to\ndefault, which may materially reduce the fees we earn under our business management agreements with our clients. Further, during periods of increased borrowing costs, real estate transaction volumes often slow along with real estate valuation growth which may impact the results of operation of our clients and the fees we earn from those clients.\nIf we cannot retain and motivate our key and talented personnel and recruit, retain and motivate new talented personnel, our business, results and financial condition could be adversely affected.\nOur people are the foundation of our success and in many ways our most critical asset. Our continued success depends to a great extent on our ability to retain and motivate our key and talented personnel and strategically recruit, retain and motivate new talented personnel. However, we may not be successful in these efforts as the market for qualified employees in the asset management industry is highly competitive. Historically we have not had employment agreements with our key employees and we have no present intention to enter into any. Our ability to recruit, retain and motivate our personnel is dependent on our ability to offer attractive compensation, opportunities for professional growth and a desirable work environment. In connection with the COVID-19 pandemic, there has been a shift to a hybrid work model and, in our recruiting efforts, we have seen increased focus by prospective candidates on remote, hybrid and flexible work arrangements, including around location. If there is a further shift to a longer-term fully remote model that does not require maintaining close proximity to our offices, we may experience an even further increase in competition for talent and it may be difficult to recruit and retain our professionals. In addition, our clients have historically granted equity awards to our officers and certain other employees of ours. If our clients reduce the amount of, or stop making, similar grants in the future, or if the value of any equity awards they may grant are lower than anticipated, we may need to increase the amount of compensation we pay to offset the reduction in compensation our officers and other applicable employees would otherwise receive. In order to recruit and retain existing and future personnel, we may need to increase the level of compensation that we pay to them, which may cause a higher amount of our revenue to be paid out in the form of compensation, which may have an adverse impact on our profits.\nWe depend on our controlling shareholder and other key and talented personnel.\nWe depend on the efforts, skills, reputations and business contacts of our controlling shareholder, Adam D. Portnoy, and other key and talented personnel. The extent and nature of the experience of our executive officers and of the relationships they have with real estate professionals and financial institutions, although not a guarantee of positive results, are critical to the success of our business. The loss of the services of any of them or the loss of investor confidence in such personnel could have a material adverse effect on our revenues, operating income and cash flows and could impair our ability to maintain or grow assets under management in our clients or otherwise maintain or grow our business.\nWe are subject to substantial regulation and numerous contractual obligations and internal policies, and failure to comply with these provisions could have a material adverse effect on our business, financial condition and results of operations.\nWe are subject to substantial regulation and numerous contractual obligations and internal policies. We are subject to regulation by the SEC, Nasdaq, and other federal, state and local or international governmental bodies and agencies or self-regulatory organizations. Our subsidiary, Tremont, is registered with the SEC as an investment adviser under the Investment Advisers Act. The Investment Advisers Act requires registered investment advisers to comply with numerous obligations, including compliance, record keeping, operating and marketing requirements, disclosure obligations and limitations on certain activities. Investment advisers also may owe fiduciary duties to certain of their clients.\nWe are also responsible for managing or assisting with the regulatory aspects of certain of our clients, including the Managed REITs compliance with applicable REIT rules and SEVNs maintenance of its exemption from registration under the 1940 Act. The level of regulation and supervision to which we and our clients are subject varies from jurisdiction to jurisdiction and is based on the type of business activity involved. For example, we and SEVN may also be subject to state licensing requirements to conduct lending activities. The regulations to which we and our clients are subject are extensive, complex and require substantial management time and attention. In addition, regulatory oversight and enforcement may increase and become more rigorous. Our or our clients failure to comply with any of the regulations, contractual obligations or policies applicable to it may subject us to litigation, extensive investigations, enforcement actions, as well as substantial fines, penalties and reputational risk, and our business and operations could be materially adversely affected.\nOur lack of compliance with applicable law could result in, among other things, our inability to enforce contracts, our default under contracts (including our management agreements or advisory agreements with our clients) and our ineligibility to contract with, and receive revenue from, governmental authorities and agencies, our clients or other third parties.\nWe have numerous contractual obligations with which we must comply on a continuous basis to operate our business, the default of which could have a material adverse effect on our business and financial condition. We have established internal policies designed to ensure that we manage our business in accordance with applicable law and regulation and in accordance\nwith our contractual obligations. These internal policies may not be effective in all regards; and, if we fail to comply with our internal policies, we could be subjected to additional risk and liability.\nESG initiatives, requirements and market expectations may impose additional costs and expose us and our clients to new risks.\nThere is an increasing focus from investors, certain of our clients tenants, managers, borrowers, customers, employees, and other stakeholders, and regulators concerning corporate sustainability. Some investors may use ESG factors to guide their investment strategies and, in some cases, may choose not to invest in us or our clients, or otherwise do business with us or our clients, if they believe our or their policies relating to corporate responsibility are inadequate. Third party providers of corporate responsibility ratings and reports on companies have increased in number, resulting in varied and in some cases inconsistent standards. In addition, the criteria by which companies' corporate responsibility practices are assessed are evolving, which could result in greater expectations of us and our clients and cause us and our clients to undertake costly initiatives to satisfy such new criteria. Alternatively, if we or our clients elect not to or are unable to satisfy such new criteria or do not meet the criteria of a specific third party provider, some investors may conclude that our or their policies with respect to corporate responsibility are inadequate. In July 2022, we announced our zero emissions goal pursuant to which we have pledged to reduce our scope 1 and 2 emissions to net zero by 2050 with a 50% reduction commitment by 2030 from a 2019 baseline. We and our clients may face reputational damage in the event that our or their corporate responsibility procedures or standards do not meet the goals we or they have set or the standards set by various constituencies. If we and our clients fail to satisfy the expectations of investors and our clients tenants, managers, borrowers, customers, employees and other stakeholders or our or our clients announced goals and other initiatives are not executed as planned, our and our clients reputation and financial results could be adversely affected, the management fees we may earn from our clients may decline, and our revenues, results of operations and ability to grow our business may be negatively impacted. In addition, we or our clients may incur significant costs in attempting to comply with ESG policies or third party expectations or demands.\nWe and our clients are subject to risks from adverse weather, natural disasters and climate events.\nWe and our clients are subject to risks and could be exposed to additional costs from adverse weather, natural disasters and climate events. For example, the properties owned by our Managed Equity REITs and our Managed Private Real Estate Capital clients could be severely damaged or destroyed by physical climate risks that could materialize as either singular extreme weather events (for example floods, storms and wildfires) or through long-term impacts of climatic conditions (such as precipitation frequency, weather instability and rise of sea levels). Such events could also adversely impact our other clients and cause significant losses if such clients or their tenants, managers or borrowers are unable to operate their businesses due to damage resulting from such events. Insurance may not sufficiently cover all losses sustained by our clients and their tenants, managers or borrowers. If we or our clients fail to adequately prepare for such events, our and our clients revenues, results of operations and financial condition may be impacted.\nWe rely on information technology and systems in our operations, and any material failure, inadequacy, interruption or security breach of that technology or those systems could materially harm our business.\nWe rely on information technology and systems, including the Internet and cloud-based infrastructures, commercially available software and our internally developed applications, to process, transmit, store and safeguard information and to manage or support a variety of our business processes, including financial transactions and maintenance of records, which may include personal identifying information of employees, tenants, borrowers and guarantors and lease data. If we experience material failures, inadequacies or interruptions or security breaches of our information technology, we could incur material costs and losses. Further, third party vendors have experienced and could experience similar events with respect to their information technology and systems that impact the products and services they provide to us or our clients. We rely on commercially available systems, software, tools and monitoring, as well as our internally developed applications and internal procedures and personnel, to provide security for processing, transmitting, storing and safeguarding confidential tenant, customer, borrower, guarantor and vendor information, such as personally identifiable information related to our employees and others and information regarding our and our clients financial accounts. We take various actions, and we incur significant costs, to maintain and protect the operation and security of our information technology and systems, including the data maintained in those systems. However, it is possible that these measures will not prevent the systems improper functioning or a compromise in security, such as in the event of a cyberattack or the improper disclosure of personally identifiable information. Security breaches, computer viruses, attacks by hackers, online fraud schemes and similar breaches have created and can create significant system disruptions, shutdowns, fraudulent transfer of assets or unauthorized disclosure of confidential information. The risk of a security breach or disruption, particularly through cyberattack or cyber intrusion, including by computer hackers, foreign governments and cyber terrorists, has generally increased as the number, intensity and sophistication of attempted attacks and intrusions from around the world have increased.\nThe cybersecurity risks to us, our clients and third party vendors are heightened by, among other things, the evolving nature of the threats faced, advances in computer capabilities, new discoveries in the field of cryptography and new and increasingly sophisticated methods used to perpetrate illegal or fraudulent activities against us, including cyberattacks, email or wire fraud and other attacks exploiting security vulnerabilities in our or other third parties information technology networks and systems or operations. Although much of our staff returned to our offices during the pandemic, flexible working arrangements have resulted in a higher extent of remote working than we experienced prior to the pandemic. This and other possible changing work practices have adversely impacted, and may in the future adversely impact, our ability to maintain the security, proper function and availability of our information technology and systems since remote working by our employees could strain our technology resources and introduce operational risk, including heightened cybersecurity risk. Remote working environments may be less secure and more susceptible to hacking attacks, including phishing and social engineering attempts that have sought, and may seek, to exploit remote working environments. In addition, our data security, data privacy, investor reporting and business continuity processes could be impacted by a third partys inability to perform in a remote work environment or by the failure of, or attack on, their information systems and technology. Any failure to maintain the security, proper function and availability of our information technology and systems, or certain third party vendors failure to similarly protect their information technology and systems that are relevant to our or our clients operations, or to safeguard our or our clients business processes, assets and information could result in financial losses, interrupt our operations, damage our reputation, cause us to be in default of material contracts and subject us to liability claims or regulatory penalties, any of which could materially and adversely affect us.\nSupply chain constraints and commodity pricing and other inflation, including inflation impacting wages and employee benefits, may continue to negatively impact us and our clients and our and their businesses, results of operations and ability to grow.\nThe global economy has been experiencing supply chain constraints and commodity pricing and other inflation, including inflation impacting wages and employee benefits. Inflation rates, particularly in the United States, have increased recently to levels not seen in years. These conditions have increased the costs for materials, other goods and labor, and these rising costs are impacting us and our clients. For example, various construction supplies and materials have experienced significant price increases as have other commodities, such as food and fuel. These pricing increases as well as increases in labor costs have increased the operating costs for certain of our clients. If these inflationary pressures continue, our clients may reduce or delay construction projects that we oversee and may realize decreased earnings, negative impacts on their ability to increase or maintain dividends that they pay to their shareholders and reduced market capitalizations. In that case, the management fees we earn may decline and our revenues, results of operations and ability to grow our business may be negatively impacted.\nEmployee misconduct could harm us by subjecting us to significant legal liability, reputational harm and loss of business.\nAs an asset manager, our business, and our ability to retain and attract new clients, is dependent upon our maintaining a positive reputation in the marketplace. There is a risk that our employees could engage in misconduct that adversely affects our reputation and, hence, our business. We are subject to a number of obligations and standards arising from our business and our authority over the companies and assets we manage. The violation of these obligations and standards by any of our employees may adversely affect our clients and us. Our business often requires that we deal with confidential matters of great significance to our clients. If our employees improperly use or disclose confidential information, we and the concerned client could suffer serious harm to our and its reputation, financial position and current and future business relationships and face potentially significant litigation. It is not always possible to detect or deter employee misconduct, and the precautions we take to detect and prevent this activity may not be effective in all cases. If any of our employees were to engage in or be accused of misconduct, our business and our reputation could be adversely affected. Misconduct by an employee might rise to the level of a default that would permit a client to terminate its management agreements or advisory agreements with us for cause and without paying a termination fee, which could materially adversely affect our business, results of operations and financial condition.\nRMR LLCs required quarterly tax distributions may limit our ability to implement our business or pursue growth opportunities.\nUnder the RMR LLC operating agreement, RMR LLC is required to make certain pro rata distributions to each member of RMR LLC, including RMR Inc., quarterly on the basis of the assumed tax liabilities of the members. From time to time, RMR LLCs cash flows from operations may be insufficient to enable it to make required minimum tax distributions to its members. RMR LLC may have to borrow funds or sell assets to fund its distribution requirements, and thereby materially adversely affect our liquidity and financial condition. Further, by making cash distributions rather than investing that cash in our businesses, we might risk slowing the pace of our growth, or not having a sufficient amount of cash to fund our operations, new investments or unanticipated capital expenditures, should the need arise. In such event, we may not be able to implement our business and growth strategy to the extent intended.\nRisks Related to the Businesses of Our Clients\nRisks associated with our clients businesses could adversely affect their respective abilities to grow, generate revenue, increase their market capitalizations and pay management fees.\nWe have presented in this Annual Report on Form 10-K historical fees that we have earned from our clients. The historical fees earned from our clients, including those presented in this Annual Report on Form 10-K, should not be considered as indicative of the future results of our clients or of our future results. The risks associated with each clients business could adversely affect its ability to carry out its business plans and objectives, and, as a result, could adversely impact its ability to pay us management or advisory fees or cause the amounts of those fees to decline. For more information see Managements Discussion and Analysis of Financial Condition and Results of Operations-Overview. Risks to our clients, in addition to the risks noted elsewhere in this Annual Report on Form 10-K, include, but are not limited to, the following:\nadverse economic and market conditions;\nthe inability of our clients tenants, managers and borrowers to weather the current adverse economic conditions, including rising interest rates, prolonged high inflation, supply chain disruptions, economic downturn and possible recession and thereby impair their ability to pay rent and returns and make loan payments;\nthe inability of our clients to access debt and equity capital on attractive terms, or at all which could reduce our clients ability to pursue acquisition and development opportunities and refinance existing debt, and reduce our clients returns from acquisition and development activities and increase their future interest expense;\nthe Managed Equity REITs face competition for tenants at substantially all of their properties and competing properties may be more attractive to tenants;\nour clients face significant competition for investment opportunities from other investors, some of which have greater financial resources, including publicly traded REITs, non-traded REITs, insurance companies, banking firms, private institutional funds, private equity funds and other investors;\na sustained period of rising interest rates may increase operating costs, reduce the value of properties, increase cost of capital and make raising capital difficult for our clients whereas low interest rates may increase the amount of debt capital available, which may result in declining capitalization rates for property acquisitions and impede the growth of our clients businesses;\nchanging general economic and financial market conditions could significantly reduce the value of the real estate, loans and other investments of our clients and reduce the amounts earned on those investments;\nchanging market, consumer and workplace practices and trends could result in decreased demand for business travel, hotel stays, conference facilities, office space, diesel fuel and gasoline;\nthe real estate and real estate related investments of our clients may be less liquid than other investments and the ability of our clients to adjust their portfolios in response to changes in economic or other conditions may be limited;\nour Managed Operating Companies ability to attract, retain and motivate sufficient qualified personnel in a challenging labor market and to effectively manage their labor costs;\nchanges in investor preferences or market conditions could limit our clients ability to raise capital to competitively maintain their properties and operations or make new investments;\nshareholder activism, complaints about management strategies and structures, corporate governance and other matters may divert management attention and be disruptive to the operation of our clients;\nESG initiatives, requirements and market expectations may impose additional costs and expose our clients to new risks;\nchanges in tax laws, regulation or accounting rules may make certain types of investments in or by our clients less valuable;\nour clients are exposed to environmental, building and other laws, natural disasters, adverse impacts from global climate change and other factors beyond their control as a result of their investment in real estate;\nour clients have significant investments in certain types of assets, such as hotels, senior living communities, healthcare properties and travel centers, and market changes which impact these specific types of assets (e.g., a reduction in levels of business travel and occupancy at hotels and senior living communities as a result of adverse economic and market conditions, tenant and customer trends, new competition for short term accommodations, changes in Medicare and Medicaid rates, and other regulatory matters, fuel price volatility, fuel efficiency improvements and alternative energy sourcing) may adversely impact certain of the clients ability to maintain or grow their business;\nthe failure of a Managed REIT to continue to qualify as a REIT would subject it to U.S. federal income tax and reduce cash available for distributions to its shareholders, adversely impacting its ability to raise capital and operate its business;\nthe failure of our clients to comply with applicable laws and regulations could result in legal liability, regulatory fines and the loss of, or an inability to obtain, licenses required to operate their businesses; and\ncomplying with REIT requirements may cause a Managed REIT to forgo otherwise attractive opportunities or liquidate otherwise attractive investments.\nMany of our clients are SEC registrants and file reports with the SEC as required by the Exchange Act. A discussion of the businesses and the risks associated with the businesses of our clients that are SEC registrants is contained in the reports filed by our clients, including in the section captioned Risk Factors in each Managed REITs, ALRs and TAs Annual Reports on Form 10-K for the year ended December 31, 2021, as those Risk Factors may have been updated or supplemented in those companies Quarterly Reports on Form 10-Q filed subsequently. Copies of these reports are available at the SECs website, www.sec.gov.\nRisks Related to Our Securities\nA trading market that provides adequate liquidity may not be sustained for our Class A Common Shares and the market price of our Class A Common Shares may fluctuate widely.\nOur public float represents about 48.8% of the economic interest in RMR LLC. As a result, a significant amount of the economic interest in RMR LLC is not represented in our public float, which may adversely impact trading in our Class A Common Shares. There can be no assurance that an active trading market for our Class A Common Shares will be sustained in the future.\nThe market price of our Class A Common Shares may fluctuate widely, depending upon many factors, some of which are beyond our control, including, but not limited to, the following:\nmarket and economic volatility due to adverse economic, geopolitical and public health conditions and the resulting market disruption on us and our clients;\ndeclines in the market prices of our clients common shares;\na relatively thin trading market for our Class A Common Shares could cause trades of small blocks of shares to have a significant impact on the price of our Class A Common Shares;\nour quarterly or annual earnings, or those of other comparable companies;\nactual or anticipated fluctuations in our operating results;\nchanges in accounting standards, policies, guidance, interpretations or principles;\nannouncements by us, our clients or our competitors of significant investments, acquisitions or dispositions;\nthe inclusion, exclusion, or deletion of our Class A Common Shares from any trading indices;\nthe failure of securities analysts to cover our Class A Common Shares;\nchanges in earnings estimates by securities analysts or in our ability to meet those estimates;\nthe operating and stock price performance of other comparable companies;\noverall market fluctuations; and\ngeneral economic conditions.\nStock markets in general often experience volatility that is unrelated to the operating performance of a particular company. These broad market fluctuations may adversely affect the trading price of our Class A Common Shares. Our shareholders may not be able to resell their Class A Common Shares following periods of volatility because of the markets adverse reaction to volatility.\nSome investors may be precluded from investing in our Class A Common Shares as a result of our dual class capital structure, which may adversely affect the trading price of our Class A Common Shares.\nS&P Dow Jones, a provider of widely followed stock indices, does not include companies with multiple share classes, such as ours, in certain of their indices. In addition, several stockholder advisory firms oppose the use of multiple class structures. As a result, our Class A Common Shares will likely not be eligible for these stock indices and may cause stockholder advisory firms to publish negative commentary about our corporate governance practices or otherwise seek to cause us to change our capital structure. FTSE Russell, another provider of widely followed stock indices, adopted rules requiring new constituents of its indices to have at least five percent of their voting rights in the hands of public stockholders. Many investment funds are precluded from investing in companies that are not included in such indices, and these funds would be unable to purchase our Class A Common Shares. We cannot assure you that other stock indices will not take a similar approach to S&P Dow Jones or FTSE Russell in the future. Exclusion from indices could make our Class A Common Shares less attractive to investors and, as a result, the market price of our Class A Common Shares could be adversely affected. Additionally, any actions or publications by stockholder advisory firms critical of our corporate governance practices or capital structure could also adversely affect the value of our Class A Common Shares.\nOur dividend policy is subject to change.\nRMR Inc. currently plans to pay a regular quarterly cash dividend equal to $0.40 per share ($1.60 per share per year) to holders of its Class A Common Shares. However, the amount of distributions RMR LLC may make in the future is not certain, and there is no assurance that future distributions will be made. The declaration and payment of any dividends to our shareholders will be at the discretion of our Board of Directors which considers many factors when setting dividend rates including RMR Inc.s current and expected earnings and the availability of cash to fund dividends as compared to alternative uses of such cash. Our Board of Directors may change the distribution policy or discontinue the payment of dividends at any time. Accordingly, any future dividends may be increased or decreased and there is no assurance as to the rate at which any future dividends will be paid, and they could decline in amount or be suspended or discontinued. Any change in our dividend policy could have a material adverse effect on the market price of our Class A Common Shares.\nRisks Related to Our Relationships with Our Controlling Shareholder and Our Clients\nOur controlling shareholder controls our voting power, and our other shareholders will have less influence over our business than shareholders of most other publicly traded companies.\nSubstantially all of the voting power in RMR Inc. and a majority of the economic interest in RMR LLC is held by ABP Trust, an entity controlled by its sole trustee, Adam D. Portnoy. Mr. Portnoy is Chair of our Board of Directors and one of our Managing Directors and is our President and Chief Executive Officer. RMR Inc. is the managing member of RMR LLC. As of September 30, 2022, Adam D. Portnoy beneficially owned in aggregate, directly and indirectly through ABP Trust, a combined direct and indirect 51.2% economic interest in RMR LLC and controlled 91.2% of the aggregate voting power of our outstanding capital stock. As a result of this voting control, Adam D. Portnoy is effectively able to determine the outcome of all matters requiring shareholder approval, including, but not limited to, election of our directors. Adam D. Portnoy is able to cause or prevent a change of control of RMR Inc., and this voting control could preclude any unsolicited acquisition of RMR Inc. The voting control of Adam D. Portnoy could deprive our shareholders of an opportunity to receive a premium for their Class A Common Shares as part of a sale of us and may affect the market price of our Class A Common Shares.\nOur management agreements with the Managed Equity REITs may discourage our change of control.\nEach Managed Equity REIT may terminate its management agreements with us if we experience a change of control, as defined in those agreements, without payment of any termination fee. We may be unable to duplicate the long term management arrangements we have with each of the Managed Equity REITs if the management agreements were terminated following our change of control. As a result, the management agreements may discourage a change of control of us, including a change of control which might result in payment of a premium for our Class A Common Shares.\nThe registration of Tremont under the Investment Advisers Act may discourage our change of control.\nOur subsidiary, Tremont, is registered as an investment adviser under the Investment Advisers Act. Any change in control of Tremont, as defined in and interpreted pursuant to the Investment Advisers Act, would trigger a shareholder approval right by SEVN shareholders or other advisory clients of Tremont as applicable, under that Act. The need for such approval may discourage a change of control of us, including a change of control which might result in payment of a premium for our Class A Common Shares.\nThe ability of ABP Trust to sell its ownership stake in us and speculation about any such sale may adversely affect the market price of our Class A Common Shares.\nABP Trust controls 100.0% of our Class B-1 Common Shares (which are exchangeable for Class A Common Shares) and Class B-2 Common Shares, some of our currently outstanding Class A Common Shares and approximately 49.0% of our Class A Units of RMR LLC (which ABP Trust may cause RMR LLC to redeem for, at our election, Class A Common Shares on a one for one basis or cash). Thus, a significant portion of our ownership is not trading in the public markets. ABP Trust may sell any or all of its Class A Common Shares at any time without approval by our other shareholders. Speculation by the press, stock analysts, our shareholders or others regarding the intention of ABP Trust to dispose of Class A Common Shares could adversely affect the market price of our Class A Common Shares. Moreover, the market price of our Class A Common Shares may be adversely impacted by the fact that a significant amount of our outstanding shares are not included in the public float of our Class A Common Shares and by our dual-stock structure. Accordingly, our Class A Common Shares may be worth less than they would be if the Class A Common Shares that ABP Trust controls or has a right to acquire were trading in the public markets.\nWe and our clients are party to transactions with related parties that may increase the risk of allegations of conflicts of interest.\nWe and our clients are party to transactions with related parties, including with entities controlled by Adam D. Portnoy and entities that we manage. For example, because of the relationships among us, Adam D. Portnoy, and our clients, the agreements we are party to with them, including our management agreements, are among related parties. Other examples include: SVC is TAs principal landlord, and TA is SVCs largest tenant, operating travel center locations owned by SVC pursuant to long term leases; ALR manages many of the senior living communities owned by DHC pursuant to long term management agreements, DHC owns approximately 33% of ALRs outstanding common stock and most of the senior living communities ALR operates are owned by DHC; Sonesta manages the majority of SVCs hotels pursuant to management agreements, SVC owns approximately 34% of Sonestas outstanding common stock and most of the hotels Sonesta operates are owned by SVC. Our and our clients agreements with related parties or in respect of transactions among related parties may not be on terms as favorable to us as they would have been if they had been negotiated among unrelated parties. Moreover, we are subject to the risk that our shareholders or the shareholders of one or more of our clients may challenge any such related party transactions. If challenges to related party transactions were to be successful, we or our clients might not realize the benefits expected from the transactions being challenged. Moreover, any such challenge could result in substantial costs and a diversion of our managements attention, could have a material adverse effect on our or our clients reputation, business and growth and could adversely affect our or our clients ability to realize the benefits expected from the transactions, whether or not the allegations have merit or are substantiated.\nDeclines in revenue, business or assets of a client may result in a corresponding decline or reduced market capitalizations for another client due to their business relationships with each other.\nSome of our clients have significant interests in other clients of ours, including ownership interests and business arrangements. For example: ALR manages many of the senior living communities owned by DHC and DHC owns approximately 33% of ALRs outstanding common stock; Sonesta manages most of SVCs hotels and the majority of the hotels operated by Sonesta are owned by SVC and SVC owns approximately 34% of Sonestas outstanding common stock; and TA leases all of SVCs travel center properties and SVC owns approximately 8.0% of TAs outstanding common stock. Accordingly, a decline in revenue, business or assets of ALR would be expected to adversely impact DHC, and a decline in revenue, business or assets of Sonesta or TA would be expected to adversely impact SVC.\nOur management responsibilities to each of our clients and any future companies we may manage may give rise to actual, potential or perceived conflicts of interest.\nSome of our clients have overlapping investment objectives, and if and as we expand our management services to include additional private real estate capital clients, additional overlapping investment objectives may result. Additionally, some of our clients have material business relationships with, and in some instances have engaged in material transactions with, other of our\nclients that could give rise to conflicting interests. Our controlling shareholders investment in some of our clients also could give rise to conflicting interests. Our clients rely on information and management services we provide to them. While we and our clients have policies and procedures in place that are intended to mitigate the risks of conflicts of interest, our allocation of investment opportunities and cost reimbursements, advice, recommendations and commitments of our management team across our clients might be perceived to favor one client at the expense of another.\nIn addition to serving as the Chair and a member of our Board of Directors and on our executive team, Adam D. Portnoy serves as the chair of the board and as a managing trustee or managing director, of each Managed REIT, TA and ALR and as a director of Sonesta (and its parent); certain of our other officers serve as managing trustees, managing directors or directors of our clients; and all of the executive officers of the Managed REITs and many of the executive officers of the Managed Operating Companies are our officers and employees. In addition, several of the independent trustees and independent directors of our public clients also serve as independent trustees or independent directors of other public clients. These multiple responsibilities and varying interests could create competition for the time and efforts of Adam D. Portnoy and RMR LLC and its subsidiaries and their officers and employees, and actual, potential or perceived conflicts of interest may arise.\nShareholder litigation, dissident shareholder director nominations and dissident shareholder proposals have often been instituted against companies alleging conflicts of interest in business dealings with affiliated and related persons and entities. The various relationships noted above may precipitate such activities. In addition, certain proxy advisory firms which have significant influence over the voting by shareholders of public companies, have, in the past, recommended that shareholders vote against, or withhold votes for, the election of board members at annual meetings of shareholders of our clients, and they may advocate for similar voting actions for future meetings. These actions may affect the outcome of those elections and impact the governance of those clients, which may increase the risk of shareholder activism and litigation at those clients. These activities could result in substantial costs and diversion of our managements attention and could have a material adverse effect on our and our clients reputations and businesses.\nRisks Related to Our Organization and Structure\nWe are a controlled company within the meaning of the Nasdaq listing rules and, as a result, qualify for, and may rely on, exemptions from certain corporate governance requirements. Our shareholders will not have the same protections afforded to shareholders of companies that are subject to such requirements.\nAdam D. Portnoy, as sole trustee of ABP Trust, holds more than 50.0% of the voting power of our shares eligible to vote. As a result, we are a controlled company under the Nasdaq listing rules. Under these rules, a company of which more than 50.0% of the voting power in the election of directors is held by an individual, group or another company is a controlled company and may elect not to comply with certain listed company governance requirements, including the requirements that the board of directors be comprised of a majority of independent directors and that we have a compensation committee and a nominating and corporate governance committee composed entirely of independent directors. Although we are not currently availing ourselves of these exceptions, the fact that we could in the future may cause our Class A Common Shares to trade at a lower price than if these protections were provided.\nOur rights and the rights of our shareholders to take action against our directors and officers are limited.\nOur governing documents limit the liability of our directors and officers to us and our shareholders for money damages to the maximum extent permitted under Maryland law. Under current Maryland law, our directors and officers will not have any liability to us and our shareholders for money damages other than liability resulting from:\nactual receipt of an improper benefit or profit in money, property or services; or\nactive and deliberate dishonesty by the director or officer that was established by a final judgment as being material to the cause of action adjudicated.\nAdditionally, our governing documents require us to indemnify, to the maximum extent permitted by Maryland law, any of our present or former directors or executive officers who is made or threatened to be made a party to a proceeding by reason of his, her or their service in that capacity. We also entered into separate agreements with our directors and executive officers providing for indemnification and advancement of expenses in addition to any rights such person may have under our governing documents.\nAs a result of these limitations on liability and indemnification obligations, we and our shareholders may have more limited rights against our present and former directors and officers than might exist with other companies, which could limit shareholder recourse in the event of actions which some shareholders may believe are not in our best interest.\nOur bylaws designate the Circuit Court for Baltimore City, Maryland or, if that court does not have jurisdiction, the United States District Court for the District of Maryland, Baltimore Division, as the sole and exclusive forum for certain actions and proceedings that may be initiated by our shareholders, which could limit our shareholders ability to obtain a favorable judicial forum for disputes with us or our directors, officers, manager, agents or employees.\nOur bylaws currently provide that, unless the dispute has been referred to binding arbitration, the Circuit Court for Baltimore City, Maryland or, if that court does not have jurisdiction, the United States District Court for the District of Maryland, Baltimore Division, will be the sole and exclusive forum for: (1) any derivative action or proceeding brought on our behalf; (2) any action asserting a claim for breach of a fiduciary duty owed by any director, officer, agent or employee of ours to us or our shareholders; (3) any action asserting a claim against us or any director, officer, agent or employee of ours arising pursuant to Maryland law or our charter or bylaws brought by or on behalf of a shareholder either on such shareholders own behalf, on our behalf or on behalf of any series or class of our shareholders or shareholders against us or any of our directors, officers, agents or employees, including any claims relating to the meaning, interpretation, effect, validity, performance or enforcement of our charter or bylaws; or (4) any action asserting a claim against us or any director, officer, agent or employee of ours that is governed by the internal affairs doctrine of the State of Maryland. The exclusive forum provision of our bylaws does not apply to any dispute that has been referred to binding arbitration in accordance with our bylaws. The exclusive forum provision of our bylaws does not establish exclusive jurisdiction in the Circuit Court for Baltimore City, Maryland for claims that arise under the Securities Act, the Exchange Act or other federal securities laws if there is exclusive or concurrent jurisdiction in the federal courts. Any person or entity purchasing or otherwise acquiring or holding any interest in our shares of beneficial interest shall be deemed to have notice of and to have consented to these provisions of our bylaws, as they may be amended from time to time. The arbitration and exclusive forum provisions of our bylaws may limit a shareholders ability to bring a claim in a judicial forum that the shareholder believes is favorable for disputes with us or our directors, officers, employees or agents, which may discourage lawsuits against us and our directors, officers, employees or agents.\nShareholder litigation against us or our directors, officers, employees or other agents may be referred to mandatory arbitration proceedings, which follow different procedures than in-court litigation and may be more restrictive to shareholders asserting claims than in-court litigation.\nOur shareholders agree, by virtue of becoming shareholders, that they are bound by our governing documents, including the arbitration provisions of our bylaws, as they may be amended from time to time. Our bylaws provide that certain actions by one or more of our shareholders against us or any of our directors, officers, employees or other agents will be referred to mandatory, binding and final arbitration proceedings if we, or any other party to such dispute, including any of our directors, officers, employees or other agents, unilaterally so demands. As a result, we and our shareholders would not be able to pursue litigation in state or federal court against us or our directors, officers, employees or other agents, including, for example, claims alleging violations of federal securities laws or breach of fiduciary duties or similar director or officer duties under Maryland Law, if we or any of our directors, officers, employees, agents or other parties against whom the claim is made unilaterally demands the matter be resolved by arbitration. Instead, our shareholders would be required to pursue such claims through binding and final arbitration.\nOur bylaws provide that such arbitration proceedings would be conducted in accordance with the procedures of the Commercial Arbitration Rules of the American Arbitration Association, as modified in our bylaws. These procedures may provide materially more limited rights to our shareholders than litigation in a federal or state court. For example, arbitration in accordance with these procedures does not include the opportunity for a jury trial, document discovery is limited, arbitration hearings generally are not open to the public, there are no witness depositions in advance of arbitration hearings and arbitrators may have different qualifications or experiences than judges. In addition, although our bylaws arbitration provisions contemplate that arbitration may be brought in a representative capacity or on behalf of a class of our shareholders, the rules governing such representation or class arbitration may be different from, and less favorable to shareholders than, the rules governing representative or class action litigation in courts. Our bylaws also generally provide that each party to such an arbitration is required to bear its own costs in the arbitration, including attorneys fees, and that the arbitrators may not render an award that includes shifting of such costs or, in a derivative or class proceeding, award any portion of our award to any shareholder or such shareholders attorneys. The arbitration provisions of our bylaws may discourage our shareholders from bringing, and attorneys from agreeing to represent our shareholders wishing to bring, litigation against us or our directors, officers, employees, manager or other agents. A number of our contracts with Adam D. Portnoy, ABP Trust and our clients have similar arbitration provisions to those in our bylaws.\nWe believe that the arbitration provisions in our bylaws are enforceable under both state and federal law, including with respect to federal securities laws claims. We are a Maryland corporation and Maryland courts have upheld the enforceability of arbitration bylaws. In addition, the United States Supreme Court has repeatedly upheld agreements to arbitrate other federal statutory claims, including those that implicate important federal policies. However, some academics, legal practitioners and\nothers are of the view that charter or bylaw provisions mandating arbitration are not enforceable with respect to federal securities laws claims. It is possible that the arbitration provisions of our bylaws may ultimately be determined to be unenforceable.\nBy agreeing to the arbitration provisions of our bylaws, shareholders will not be deemed to have waived compliance by us with federal securities laws and the rules and regulations thereunder.\nRMR Inc. is required to pay ABP Trust for certain tax benefits it claims as a result of the tax basis step up we received as part of the RMR LLC reorganization on June 5, 2015 and will receive upon future redemptions by ABP Trust for Class A Common Shares or for cash. In certain circumstances, payments under the tax receivable agreement may be accelerated and/or significantly exceed the actual tax benefits RMR Inc. realizes.\nABP Trust may redeem Class A Units it owns for Class A Common Shares or cash. See Business-Our Organizational Structure-The RMR LLC Operating Agreement-Redemption rights of holders of Class A Units in our Annual Report on Form 10-K for the fiscal year ended September 30, 2019. Both ABP Trusts initial purchase of Class A Units and any future redemptions that ABP Trust may effect may result in increases in our tax basis of our assets that otherwise would not have been available. Such increases in tax basis are likely to increase (for tax purposes) depreciation and amortization deductions and therefore reduce the amount of income tax we otherwise would be required to pay in the future. These increases in tax basis may also decrease gain (or increase loss) on future dispositions of certain capital assets to the extent the increased tax basis is allocated to those assets. The Internal Revenue Service, or the IRS, may challenge all or part of these tax basis increases, and a court might sustain such a challenge.\nWe have entered into a tax receivable agreement, dated June 5, 2015, by and among RMR Inc., RMR LLC and ABP Trust that provides for the payment by RMR Inc. to ABP Trust of 85.0% of the amount of cash savings, if any, in U.S. federal, state and local income tax or franchise tax that RMR Inc. actually realizes as a result of (a) the increases in tax basis attributable to its dealings with ABP Trust and (b) tax benefits related to imputed interest deemed to be paid by us as a result of the tax receivable agreement. See Business-Our Organizational Structure-Tax Receivable Agreement in our Annual Report on Form 10-K for the fiscal year ended September 30, 2019 for further information regarding the tax receivable agreement. While the actual increase in tax basis, as well as the amount and timing of any payments under the tax receivable agreement, will vary depending upon a number of factors, including the timing of redemptions, the price of our Class A Common Shares at the time of the redemption, the extent to which such redemptions are taxable, and the amount and timing of our income, we expect that, as a result of the size of the increases in the tax basis of the tangible and intangible assets of RMR LLC attributable to RMR Inc.s interests in RMR LLC, during the expected term of the tax receivable agreement, the payments that RMR Inc. makes to ABP Trust may be substantial. ABP Trust generally will not reimburse RMR Inc. for any payments that may have been made under the tax receivable agreement. As a result, in certain circumstances RMR Inc. could make payments to ABP Trust under the tax receivable agreement in excess of cash tax savings. Our ability to achieve benefits from any tax basis increase, and the payments to be made under the tax receivable agreement, will depend upon a number of factors, including the timing and amount of our future income.\nIn addition, the tax receivable agreement provides that, upon certain changes of control and certain breaches of the agreement that we fail to cure in accordance with the terms of the agreement, our obligations with respect to Class A Units will be accelerated. In those circumstances, our obligations under the tax receivable agreement would be based on certain assumptions, including that we would have sufficient taxable income to fully utilize the deductions arising from the increased tax deductions and tax basis and other benefits described in the tax receivable agreement, and that any Class A Units that have not been redeemed will be deemed redeemed for the market value of the Class A Common Shares at the time of the change of control or breach, as applicable. Consequently, it is possible, in these circumstances, that the actual cash tax savings realized by RMR Inc. may be significantly less than the corresponding tax receivable agreement payments.\nOur governing documents permit our directors and officers, our clients and ABP Trust to retain corporate opportunities for their own benefit.\nUnder RMR Inc.s governing documents and RMR LLCs operating agreement, no director or officer of ours who is also serving as an officer, employee or agent of a client or ABP Trust or any of its affiliates is required to present, communicate or offer any business opportunity to us, and such person shall have the right to hold any business opportunity for themselves or transfer it to any other person to the maximum extent permitted by Maryland law. If any of these persons fails to present an opportunity to us or takes the opportunity for themselves, to the maximum extent permitted under Maryland law they will not be liable to us. We have renounced all potential interest or expectation in certain business opportunities which may fit our growth objectives in the future or otherwise have value to us. These opportunities may be directed to the clients or other persons or entities to which RMR LLC may have a relationship. Additionally, under our governing documents, our directors, officers, employees and agents are permitted to engage in other business activities that are similar to, or even competitive with, our own.\nIf such persons engage in competitive business activities, we may have no remedy under our governing documents in these circumstances.\nOur governing documents do not limit our ability to enter into new lines of businesses and doing so may result in additional risks and uncertainties in our businesses.\nOur governing documents do not limit our business to the management of commercial real estate assets or businesses related thereto. Accordingly, we may pursue other business initiatives. To the extent we enter into a new line of business, we will face numerous risks and uncertainties, including risks associated with: (i) the required investment of capital and other resources; (ii) the possibility that we have insufficient expertise to engage in such activities competently or profitably; (iii) combining or integrating operational and management systems and controls; and (iv) the broadening of our geographic footprint, including the risks associated with conducting operations in non-U.S. jurisdictions. Entry into certain lines of business may subject us to new laws and regulations with which we are not familiar, or from which we are currently exempt, and may lead to increased litigation and regulatory risk. During the past year, we expanded our managed private real estate capital through the execution of new business ventures; our managed private real estate capital assets under management increased during the past year from approximately $1.3 billion as of September 30, 2021 to $3.9 billion as of September 30, 2022. Our Managed Private Real Estate Capital clients are subject to many of the same risks noted elsewhere in this Annual Report on Form 10-K and may be subject to additional risks. For example, our strategic initiatives may include joint ventures or partnerships, in which case we will be subject to additional risks and uncertainties because we may be dependent upon, and subject to liability, losses or reputational damage relating to systems, controls and personnel that are not under our control. There can be no assurance that our increased focus on private real estate capital will be successful in the future or that we will achieve our performance objectives.\nOur only material asset is our interest in RMR LLC, and we are accordingly dependent upon distributions from RMR LLC to pay our taxes and expenses.\nRMR Inc. is organized as a holding company of RMR LLC and its only material asset is its limited liability company membership units of RMR LLC. RMR Inc. has no independent means of generating revenue. Pursuant to RMR Inc.s agreements with RMR LLC, RMR Inc., as the managing member of RMR LLC, intends to cause RMR LLC to make distributions in an amount that is at least sufficient to cover applicable taxes payable by its members, other expenses and some or all of the dividends, if any, declared by us.\nDeterioration in the financial condition, earnings or cash flow of RMR LLC for any reason could limit or impair its ability to pay such distributions to us. Additionally, to the extent that RMR Inc. requires funds and RMR LLC is restricted from making such distributions under applicable law or regulation or under the terms of financing or other arrangements, or is otherwise unable to provide such funds, our liquidity and financial condition could be materially adversely affected. Item 1B. Unresolved Staff Comments\nNone. Item 2. Properties\nOur principal executive offices are located at Two Newton Place, 255 Washington Street, Newton, MA 02458-1634. These offices are leased from an affiliate of ABP Trust through 2030. A copy of the lease is incorporated by reference as an exhibit to this Annual Report on Form 10-K.\nWe also lease other ancillary and local office space from ABP Trust, from certain Managed Equity REITs and from third parties. We consider these leased premises suitable and adequate for our business. For more information about our leased facilities, please see Note 10, Leases, to our consolidated financial statements included in Part IV, Item 15 of this Annual Report on Form 10-K. Item 3. Legal Proceedings\nFrom time to time, we may become involved in litigation matters incidental to the ordinary course of our business. Although we are unable to predict with certainty the eventual outcome of any litigation, we are currently not a party to any litigation which we expect to have a material adverse effect on our business. Item 4. Mine Safety Disclosures\nNot applicable.\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nOur Class A Common Shares are traded on Nasdaq (symbol: RMR). There is no publicly traded market for our Class B-1 Common Shares or our Class B-2 Common Shares, all of which are held by ABP Trust.\nAs of November 7, 2022, there were 2,315 shareholders of record of our Class A Common Shares.\nIssuer purchases of equity securities.\nThe following table provides information about our purchases of our equity securities during the fiscal year ended September 30, 2022:\nMaximum\nTotal Number of Approximate Dollar\nShares Purchased Value of Shares that\nNumber of Average as Part of Publicly May Yet Be Purchased\nShares Price Paid Announced Plans Under the Plans or\nCalendar Month Purchased (1)\nper Share or Programs Programs\nOctober 2021 225 $ 34.05 N/A N/A\nMarch 2022 745 $ 30.65 N/A N/A\nSeptember 2022 19,941 $ 25.89 N/A N/A\nTotal 20,911 $ 26.15 N/A N/A\n(1)These Class A Common Share withholdings and purchases were made to satisfy tax withholding and payment obligations of certain of our Directors, officers and employees in connection with the vesting of awards of our Class A Common Shares. We withheld and purchased these shares at their fair market values based upon the trading prices of our Class A Common Shares at the close of trading on Nasdaq on the purchase dates. Item 6. [Reserved] Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations\nThe following information should be read in conjunction with our consolidated financial statements and accompanying notes included in Part IV, Item 15 of this Annual Report on Form 10-K.\nOVERVIEW (dollars in thousands)\nRMR Inc. is a holding company and substantially all of its business is conducted by RMR LLC. RMR Inc. has no employees, and the personnel and various services it requires to operate are provided by RMR LLC. RMR LLC manages a diverse portfolio of real estate and real estate related businesses. As of September 30, 2022, RMR LLC managed 2,100 properties in 46 states, Washington, D.C., Puerto Rico and Canada that are principally owned by the Managed Equity REITs.\nBusiness Environment and Outlook\nThe continuation and growth of our business depends upon our ability to operate the Managed REITs so as to maintain, grow and increase the value of their businesses, to assist our Managed Operating Companies to grow their businesses and operate profitably and to successfully expand our Managed Private Real Estate Capital business through the execution of new business ventures and additional investments. Our business and the businesses of our clients generally follow the business cycle of the U.S. real estate industry, but with certain property type and regional geographic variations. Typically, as the general U.S. economy expands, commercial real estate occupancies increase and new real estate development occurs; new development frequently leads to increased real estate supply and reduced occupancies; and then the cycle repeats. These general trends can be impacted by property type characteristics or regional factors; for example, demographic factors such as the aging U.S. population, the growth of e-commerce retail sales or net population migration across different geographic regions can slow, accelerate, overwhelm or otherwise impact general cyclical trends. Because of such multiple factors, we believe it is often possible to grow real estate based businesses in selected property types or geographic areas despite general national trends.\nBeyond general real estate industry trends, we also take into account general economic factors impacting our clients. More specifically, in the U.S., the Federal Reserve has increased the federal funds rate six times since the beginning of calendar 2022 and has announced an expectation that it will continue to raise rates, in an attempt to slow inflation, which has in turn lead to increased borrowing costs and disruptions in the financial markets. In a period of increased borrowing costs, real estate transaction volumes often slow along with real estate valuation growth, which the commercial real estate industry has been experiencing. Rising interest rates also adversely impact our clients with floating rate debt, which they, in some instances, attempt to address with interest rate caps and other strategic actions to reduce leverage. Further, while the Federal Reserve is looking to slow inflation, its efforts may not be successful. The impact of rising costs, both for goods and human capital, are impacting us and our clients and we and our clients are implementing mitigation strategies to minimize the impact of increased costs on our and our clients earnings, where possible.\nWe consider industry and general economic factors when providing services to our clients and attempt to take advantage of opportunities when they arise. For example: (i) since March 2020, ILPT and DHC have completed several joint venture transactions with institutional investors and subsequently grown some of those ventures by acquiring additional properties; (ii) SVC transitioned over 200 hotels from other hotel operators to Sonesta, which on March 17, 2021, completed its acquisition of RLH Corporation, establishing it as one of the largest hotel companies in the U.S. and expanding its franchising capabilities; (iii) on September 30, 2021, SEVN and TRMT merged, resulting in a larger, more diversified mortgage REIT with an expanded capital base; and (iv) on February 25, 2022, ILPT completed its acquisition of 126 new, Class A, single tenant, net leased, e-commerce focused industrial properties as a result of its acquisition of Monmouth Real Estate Investment Corporation, or MNR, in an all-cash transaction valued at approximately $4.0 billion. In addition, we balance our pursuit of growth of our and our clients businesses by executing, on behalf of our clients, prudent capital recycling or business arrangement restructurings in an attempt to help our clients prudently manage leverage and increased operating costs. We also look to reposition their portfolios and businesses when circumstances warrant such changes or when other more desirable opportunities are identified.\nPlease see elsewhere in this Annual Report on Form 10-K, including Warning Concerning Forward Looking Statements, Part 1, Item 1 Business and Part I, Item 1A Risk Factors for a discussion of some of the circumstances that may adversely affect us and our business.\nManaged Equity REITs\nThe base business management fees we earn from the Managed Equity REITs are calculated monthly in accordance with the applicable business management agreement and are based on a percentage of the lower of (i) the average historical cost of each REITs properties and (ii) each REITs average market capitalization. The property management fees we earn from the Managed Equity REITs are principally based on a percentage of the gross rents collected at certain managed properties owned\nby the Managed Equity REITs, excluding rents or other revenues from hotels, travel centers, senior living properties and wellness centers, which are separately managed by our Managed Operating Companies or a third party. Also under the terms of the property management agreements, we receive construction supervision fees in connection with certain construction activities undertaken at the properties owned by the Managed Equity REITs and certain of the Managed Operating Companies based on a percentage of the cost of such construction. For further information regarding the fees we earn, see Note 2, Summary of Significant Accounting Policies, to our consolidated financial statements included in Part IV, Item 15 of this Annual Report on Form 10-K.\nThe following table presents for each Managed Equity REIT a summary of its primary strategy and the lesser of the historical cost of its assets under management and its market capitalization as of September 30, 2022 and 2021, as applicable:\nLesser of Historical Cost of Assets\nUnder Management or\nTotal Market Capitalization as of\nSeptember 30,\nREIT Primary Strategy 2022 2021\nDHC Medical office and life science properties, senior living communities and wellness centers $ 3,328,069 $ 5,150,401\nILPT Industrial and logistics properties 4,656,472 2,100,020\nOPI\nOffice properties primarily leased to single tenants, including the government 3,102,253 3,837,235\nSVC Hotels and net lease service and necessity-based retail properties 6,651,976 9,050,693\n$ 17,738,770 $ 20,138,349\nA Managed Equity REITs historical cost of assets under management includes the real estate it owns and its consolidated assets invested directly or indirectly in equity interests in or loans secured by real estate and personal property owned in connection with such real estate (including acquisition related costs which may be allocated to intangibles or are unallocated), all before reserves for depreciation, amortization, impairment charges or bad debts or other similar non-cash reserves. A Managed Equity REITs average market capitalization includes the average value of the Managed Equity REITs outstanding common equity value during the period, plus the daily weighted average of each of the aggregate liquidation preference of preferred shares and the principal amount of consolidated indebtedness during the period.\nThe table above presents for each Managed Equity REIT, the lesser of the historical cost of its assets under management and its market capitalization as of the end of each period. The basis on which our base business management fees are calculated for the fiscal years ended September 30, 2022 and 2021 may differ from the basis at the end of the periods presented in the table above. As of September 30, 2022, the market capitalization was lower than the historical cost of assets under management for each of the Managed Equity REITs; the historical cost of assets under management for DHC, ILPT, OPI and SVC as of September 30, 2022, were $7,354,104, $5,693,562, $5,907,788 and $11,285,303, respectively.\nThe fee revenues we earned from the Managed Equity REITs for the fiscal years ended September 30, 2022 and 2021 are set forth in the following tables:\nFiscal Year Ended September 30,\n2022 2021\nBase Base Base Base\nBusiness Property Construction Business Property Construction\nManagement Management Supervision Management Management Supervision\nREIT Revenues Revenues Revenues Total Revenues Revenues Revenues Total\nDHC $ 19,408 $ 6,365 $ 4,570 $ 30,343 $ 23,247 $ 9,851 $ 3,274 $ 36,372\nILPT 20,810 9,738 806 31,354 11,110 6,471 164 17,745\nOPI\n17,369 15,936 8,899 42,204 17,025 16,021 4,205 37,251\nSVC 38,444 3,998 1,751 44,193 41,771 3,494 589 45,854\n$ 96,031 $ 36,037 $ 16,026 $ 148,094 $ 93,153 $ 35,837 $ 8,232 $ 137,222\nManaged Operating Companies and Managed Private Real Estate Capital\nWe provide business management services to the Managed Operating Companies. ALR operates senior living communities throughout the United States, many of which are owned by and managed for DHC. Sonesta manages and franchises hotels,\nresorts and cruise ships in the United States, Latin America, the Caribbean and the Middle East; many of the U.S. hotels that Sonesta operates are owned by SVC. TA operates, leases and franchises travel centers along the U.S. interstate highway system, many of which are owned by SVC, and standalone truck service facilities. Generally, our fees earned from business management services to the Managed Operating Companies are based on a percentage of certain revenues.\nIn addition, we also provide management services to the Managed Private Real Estate Capital clients and earn fees based on a percentage of average invested capital, as defined in the applicable agreements, property management fees based on a percentage of rents collected from managed properties and construction management fees based on a percentage of the cost of construction activities.\nOur fee revenues from services to the Managed Operating Companies and the Managed Private Real Estate Capital clients for the fiscal years ended September 30, 2022 and 2021, are set forth in the following tables:\nFiscal Year Ended September 30,\n2022 2021\nBase Base Base Base\nBusiness Property Construction Business Property Construction\nManagement Management Supervision Management Management Supervision\nRevenues Revenues Revenues Total Revenues Revenues Revenues Total\nABP Trust $ 2,046 $ 1,498 $ 556 $ 4,100 $ 2,335 $ 1,776 $ 184 $ 4,295\nOther private entities 8,056 5,389 152 13,597 2,423 1,288 60 3,771\nALR 4,908 - - 4,908 7,123 - - 7,123\nSonesta 8,717 - 9 8,726 4,497 - - 4,497\nTA 15,926 - - 15,926 13,727 - - 13,727\n$ 39,653 $ 6,887 $ 717 $ 47,257 $ 30,105 $ 3,064 $ 244 $ 33,413\nAdvisory Business\nTremont provides advisory services to SEVN, a publicly traded mortgage REIT that focuses on originating and investing in first mortgage whole loans secured by middle market and transitional commercial real estate. Tremont also provided advisory services to TRMT until September 30, 2021, when it merged with and into SEVN. Tremont is primarily compensated pursuant to its management agreements with SEVN (beginning January 6, 2021) and TRMT (until September 30, 2021) based on a percentage of equity, as defined in the applicable agreements.\nFor the fiscal years ended September 30, 2022 and 2021, we earned advisory services revenue of $4,530 and $3,956, respectively, and incentive fees of $0 and $620, respectively.\nThe Tremont business acts as a transaction broker for non-investment advisory clients for negotiated fees. The Tremont business earned fees for such brokerage services of $99 and $467 for the fiscal years ended September 30, 2022 and 2021, respectively, which amounts are included in management services revenue in our consolidated statements of income.\nRESULTS OF OPERATIONS (dollars in thousands)\nThe following table presents the changes in our operating results for the fiscal year ended September 30, 2022 compared to the fiscal year ended September 30, 2021:\nFiscal Year Ended September 30,\n2022 2021 $ Change % Change\nRevenues:\nManagement services $ 195,450 $ 171,102 $ 24,348 14.2%\nIncentive business management fees - 620 (620) n/m\nAdvisory services 4,530 3,956 574 14.5%\nTotal management and advisory services revenues 199,980 175,678 24,302 13.8%\nReimbursable compensation and benefits 56,684 52,369 4,315 8.2%\nReimbursable equity based compensation 7,072 9,154 (2,082) (22.7)%\nOther reimbursable expenses 568,767 370,037 198,730 53.7%\nTotal reimbursable costs 632,523 431,560 200,963 46.6%\nTotal revenues 832,503 607,238 225,265 37.1%\nExpenses:\nCompensation and benefits 129,872 119,644 10,228 8.5%\nEquity based compensation 10,136 12,022 (1,886) (15.7)%\nSeparation costs 1,315 4,525 (3,210) (70.9)%\nTotal compensation and benefits expense 141,323 136,191 5,132 3.8%\nGeneral and administrative 32,919 26,961 5,958 22.1%\nOther reimbursable expenses 568,767 370,037 198,730 53.7%\nTransaction and acquisition related costs 132 984 (852) (86.6)%\nDepreciation and amortization 993 973 20 2.1%\nTotal expenses 744,134 535,146 208,988 39.1%\nOperating income 88,369 72,092 16,277 22.6%\nInterest and other income 1,322 760 562 73.9%\nGain on Tremont Mortgage Trust investment - 2,059 (2,059) n/m\nEquity in earnings of investees - 443 (443) n/m\nUnrealized gain on equity method investments accounted for under the fair value option 1,010 18,811 (17,801) (94.6)%\nIncome before income tax expense 90,701 94,165 (3,464) (3.7)%\nIncome tax expense (13,233) (13,152) (81) (0.6)%\nNet income 77,468 81,013 (3,545) (4.4)%\nNet income attributable to noncontrolling interest (43,464) (45,317) 1,853 4.1%\nNet income attributable to The RMR Group Inc. $ 34,004 $ 35,696 $ (1,692) (4.7)%\nn/m - not meaningful\nReferences to changes in the income and expense categories below relate to the comparison of consolidated results for the fiscal year ended September 30, 2022, compared to the fiscal year ended September 30, 2021. For a comparison of consolidated results for the fiscal year ended September 30, 2021 compared to the fiscal year ended September 30, 2020, see Part II, Item 7 Managements Discussion and Analysis of Financial Condition and Results of Operations in our Annual Report on Form 10-K for the fiscal year ended September 30, 2021.\nManagement services revenue. Management services revenue increased $24,348 primarily due to (i) growth in base business management fees of $9,700 and property and construction management fees of $3,909 earned from ILPT, primarily due to its acquisition of MNR, (ii) increases in construction supervision fees earned from OPI, SVC and DHC aggregating $7,152 due to increased development activity, and (iii) an increase in management fees earned from Sonesta of $4,229 primarily resulting from an increase in travel as pandemic restrictions have eased and an increase in the number of hotels that it manages and franchises during the current fiscal year. These increases were partially offset by a decline in base business\nmanagement fees earned from DHC and SVC of $7,166 driven by declines in the enterprise values of these respective clients during the current fiscal year.\nIncentive business management fees. Incentive business management fees of $620 in the prior fiscal year represent fees earned from TRMT. For further information about these incentive fees, see Note 2, Summary of Significant Accounting Policies, to our consolidated financial statements included in Part IV, Item 15 of this Annual Report on Form 10-K.\nAdvisory services revenue. Advisory services revenue increased $574 primarily due to the expiration of the fee waiver that was previously provided to TRMT in effect until December 31, 2020. For further information about this waiver, see Note 2, Summary of Significant Accounting Policies, to our consolidated financial statements included in Part IV, Item 15 of this Annual Report on Form 10-K.\nReimbursable compensation and benefits. Reimbursable compensation and benefits include reimbursements, at cost, that arise primarily from services our employees provide pursuant to our property management agreements at the properties of our clients. A significant portion of these compensation and benefits are charged or passed through to and paid by tenants of our clients. Reimbursable compensation and benefits increased $4,315 primarily due to increases in employee compensation and benefits for which we receive reimbursement.\nReimbursable equity based compensation. Reimbursable equity based compensation includes awards of common shares by our clients directly to certain of our officers and employees in connection with the provision of management services to those clients. We record an equal offsetting amount as equity based compensation expense for the value of these awards. Reimbursable equity based compensation revenue decreased $2,082 primarily as a result of decreases in our clients respective share prices.\nOther reimbursable expenses. For further information about these reimbursements, see Note 2, Summary of Significant Accounting Policies, to our consolidated financial statements included in Part IV, Item 15 of this Annual Report on Form 10-K.\nCompensation and benefits. Compensation and benefits consist of employee salaries and other employment related costs, including health insurance expenses and contributions related to our employee retirement plan. Compensation and benefits expense increased $10,228 primarily due to annual employee merit and bonus increases in the current fiscal year and increased headcount.\nEquity based compensation. Equity based compensation consists of the value of vested shares awarded to certain of our employees under our and our clients equity compensation plans. Equity based compensation decreased $1,886 primarily as a result of decreases in our clients respective share prices.\nSeparation costs. Separation costs consist of employment termination costs. For further information about these costs, see Note 5, Related Person Transactions, to our consolidated financial statements included in Part IV, Item 15 of this Annual Report on Form 10-K.\nGeneral and administrative. General and administrative expenses consist of office related expenses, information technology related expenses, employee training, travel, professional services expenses, director compensation and other administrative expenses. General and administrative costs increased $5,958 primarily due to increases in technology infrastructure costs, third-party costs related to our expanded role in construction oversight and increases in recruiting and other professional fees.\nTransaction and acquisition related costs. The decrease in transaction and acquisition related costs primarily relates to costs incurred in the prior fiscal year in connection with RMR Mortgage Trusts conversion from a registered investment company to a commercial mortgage REIT and other strategic initiatives.\nInterest and other income. Interest and other income increased $562 primarily due to higher interest earned during the current fiscal year as a result of higher interest rates.\nGain on Tremont Mortgage Trust investment. The gain on Tremont Mortgage Trust investment in the prior fiscal year represents the difference between the cost basis of our former investment in TRMT and the fair value of our investment in SEVN on the date of the Merger. For further information see Note 2, Summary of Significant Accounting Policies, to our consolidated financial statements included in Part IV, Item 15 of this Annual Report on Form 10-K.\nEquity in earnings of investees. Equity in earnings of investees represents our proportionate share of earnings from our former equity interest in TRMT. For further information, see Note 2, Summary of Significant Accounting Policies, to our consolidated financial statements included in Part IV, Item 15 of this Annual Report on Form 10-K.\nUnrealized gain on equity method investments accounted for under the fair value option. Unrealized gain on equity method investments accounted for under the fair value option represents the unrealized gain or loss on our investments in SEVN and TA common shares. For further information, see Note 2, Summary of Significant Accounting Policies, to our consolidated financial statements included in Part IV, Item 15 of this Annual Report on Form 10-K.\nIncome tax expense. The increase in income tax expense of $81 is primarily attributable to higher taxable income during the current fiscal year and an increase in the annual effective tax rate compared to the prior fiscal year. For further information see Note 3, Income Taxes, to our consolidated financial statements included in Part IV, Item 15 of this Annual Report on Form 10-K.\nLIQUIDITY AND CAPITAL RESOURCES (dollars in thousands, except per share amounts)\nOur current assets have historically been comprised predominantly of cash, cash equivalents and receivables for business management, property management and advisory services fees. As of September 30, 2022 and 2021, we had cash and cash equivalents of $189,088 and $159,835, respectively, of which $21,492 and $23,338, respectively, was held by RMR Inc., with the remainder being held at RMR LLC. Cash and cash equivalents include all short term, highly liquid investments that are readily convertible to known amounts of cash and have original maturities of three months or less from the date of purchase. As of September 30, 2022 and 2021, $181,219 and $131,065, respectively, of our cash and cash equivalents were invested in money market funds. We believe that our cash and cash equivalents leave us well positioned to pursue a range of capital allocation strategies, with a focus on the growth of our private capital business, and to fund our operations and obligations, in the next twelve months.\nOur liquidity is highly dependent upon our receipt of fees from the businesses that we manage. Historically, we have funded our working capital needs with cash generated from our operating activities and we currently do not maintain any credit facilities. We expect that our future working capital needs will relate largely to our operating expenses, primarily consisting of employee compensation and benefits costs, our obligation to make quarterly tax distributions to the members of RMR LLC, our plan to make quarterly distributions on our Class A Common Shares and Class B-1 Common Shares and our plan to pay quarterly distributions to the members of RMR LLC in connection with the quarterly dividends to RMR Inc. shareholders. Our management fees are typically payable to us within 30 days of the end of each month or, in the case of annual incentive business management fees earned from the Managed Equity REITs, if any, within 30 days following each calendar year end. Quarterly incentive fees earned from SEVN, if any, are payable generally within 30 days following the end of the applicable quarter. Historically, we have not experienced losses on collection of our fees and have not recorded any allowances for bad debts.\nDuring the fiscal year ended September 30, 2022, we paid cash distributions to the holders of our Class A Common Shares, Class B-1 Common Shares and to the other owner of RMR LLC membership units in the aggregate amount of $44,330. On October 13, 2022, we declared a quarterly dividend on our Class A Common Shares and Class B-1 Common Shares to our shareholders of record as of October 24, 2022 in the amount of $0.40 per Class A Common Share and Class B-1 Common Share, or $6,642. This dividend will be partially funded by a distribution from RMR LLC to holders of its membership units in the amount of $0.32 per unit, or $10,114, of which $5,314 will be distributed to us based on our aggregate ownership of 16,605,741 membership units of RMR LLC and $4,800 will be distributed to ABP Trust based on its ownership of 15,000,000 membership units of RMR LLC. The remainder of this dividend will be funded with cash accumulated at RMR Inc. We expect the total dividend will amount to approximately $11,442 and we expect to pay this dividend on or about November 17, 2022. See Note 6, Shareholders Equity, to our consolidated financial statements included in Part IV, Item 15 of this Annual Report on Form 10-K for more information regarding these distributions.\nFor the fiscal year ended September 30, 2022, pursuant to the RMR LLC operating agreement, RMR LLC made required quarterly tax distributions to its holders of its membership units totaling $30,281, of which $15,940 was distributed to us and $14,341 was distributed to ABP Trust, based on each membership unit holders then respective ownership percentage in RMR LLC. The $15,940 distributed to us was eliminated in our consolidated financial statements included in Part IV, Item 15 of this Annual Report on Form 10-K, and the $14,341 distributed to ABP Trust was recorded as a reduction of their noncontrolling interest. We used a portion of these funds distributed to us to pay our tax liabilities and amounts due under the tax receivable agreement.\nTax Receivable Agreement\nWe are party to a tax receivable agreement which provides for the payment by RMR Inc. to ABP Trust of 85.0% of the amount of savings, if any, in U.S. federal, state and local income tax or franchise tax that RMR Inc. realizes as a result of (a) the increases in tax basis attributable to RMR Inc.s dealings with ABP Trust and (b) tax benefits related to imputed interest deemed to be paid by it as a result of the tax receivable agreement. See Note 5, Related Person Transactions, to our consolidated financial statements included in Part IV, Item 15 of this Annual Report on Form 10-K. As of September 30, 2022, our consolidated balance sheet reflects a liability related to the tax receivable agreement of $25,583, of which we expect to pay $2,275 to ABP Trust during the fourth quarter of fiscal year 2023.\nCash Flows\nOur changes in cash flows for the fiscal year ended September 30, 2022 compared to the prior fiscal year were as follows: (i) net cash from operating activities increased from $71,794 in the prior fiscal year to $101,270 in the current fiscal year; (ii)\nnet cash used in investing activities increased from $1,142 in the prior fiscal year to $10,590 in the current fiscal year; and (iii) net cash used in financing activities decreased from $280,480 in the prior fiscal year to $61,427 in the current fiscal year.\nThe increase in net cash from operating activities for the fiscal year ended September 30, 2022 compared to the prior fiscal year primarily reflects increases in net income, after the exclusion of non-cash gains and losses, as well as favorable changes in working capital. The increase in net cash used in investing activities for the fiscal year ended September 30, 2022 compared to the prior fiscal year was primarily due to the purchase of 882,407 SEVN common shares in the current fiscal year. The decrease in net cash used in financing activities for the fiscal year ended September 30, 2022 compared to the prior fiscal year was primarily due to a one-time, special cash dividend of $7.00 per Class A Common Share and Class B-1 Common Share, or $219,851, paid in the prior fiscal year.\nAs of September 30, 2022, we had no off-balance sheet arrangements that have had or that we expect would be reasonably likely to have a material effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources.\nMarket Risk and Credit Risk\nWe have not invested in derivative instruments, borrowed through issuing debt securities or transacted in foreign currencies. As a result, we are not now subject to significant direct market risk related to interest rate changes, changes to the market standard for determining interest rates, commodity price changes or credit risks; however, if any of these risks were to negatively impact our clients businesses or market capitalization, our revenues would likely decline. To the extent we change our approach on the foregoing activities, or engage in other activities, our market and credit risks could change. Please see Part I, Item 1A Risk Factors of this Annual Report on Form 10-K for the risks to us and our clients.\nRisks Related to Cash and Short Term Investments\nOur cash and cash equivalents include short term, highly liquid investments readily convertible to known amounts of cash that have original maturities of three months or less from the date of purchase. We invest a substantial amount of our cash in money market funds. The majority of our cash is maintained in U.S. bank accounts. Some U.S. bank account balances exceed the Federal Deposit Insurance Corporation insurance limit. We believe our cash and short term investments are not subject to any material interest rate risk, equity price risk, credit risk or other market risk.\nRelated Person Transactions\nWe have relationships and historical and continuing transactions with Adam D. Portnoy, the Chair of our Board and one of our Managing Directors, as well as our clients. For further information about these and other such relationships and related person transactions, please see Note 2, Summary of Significant Accounting Policies and Note 5, Related Person Transactions, to our consolidated financial statements included in Part IV, Item 15 of this Annual Report on Form 10-K, which is incorporated herein by reference, the section captioned Business above in Part I, Item 1 of this Annual Report on Form 10-K, our other filings with the SEC and our definitive Proxy Statement for our 2023 Annual Meeting of Shareholders, or the 2023 Proxy Statement, to be filed within 120 days after the close of the fiscal year ended September 30, 2022. In addition, for more information about these transactions and relationships and about the risks that may arise as a result of these and other related person transactions and relationships, please see elsewhere in this Annual Report on Form 10-K, including Warning Concerning Forward Looking Statements and Part I, Item 1A Risk Factors. We may engage in additional transactions with related persons, including businesses to which RMR LLC or its subsidiaries provide management services.\nCritical Accounting Estimates\nAn understanding of our accounting policies is necessary for a complete analysis of our results, financial position, liquidity and trends. The preparation of our consolidated financial statements requires our management to make certain critical accounting estimates and judgments that impact (i) the revenue recognized during the reporting periods and (ii) our principles of consolidation. These accounting estimates are based on our managements judgment. We consider them to be critical because of their significance to our consolidated financial statements and the possibility that future events may cause differences from current judgments or because the use of different assumptions could result in materially different estimates. We review these estimates on a periodic basis to test their reasonableness. Although actual amounts likely differ from such estimated amounts, we believe such differences are not likely to be material.\nRevenue Recognition. Our principal sources of revenue are:\nbusiness management fees, including base and incentive business management fees; and\nproperty management fees, including construction supervision fees and reimbursement for certain compensation and benefits related expenses.\nWe recognize revenue from business management and property management fees as earned in accordance with our management agreements. We consider the incentive business management fees earned from the REITs that we manage to be contingent performance based fees, which we recognize as revenue when earned at the end of each measurement period. We also recognize as revenue certain compensation and benefits reimbursements in our capacity as property manager, at cost, when we incur the related reimbursable compensation and benefits and other costs on behalf of our clients. See the Revenue Recognition section of Note 2, Summary of Significant Accounting Policies, to our consolidated financial statements included in Part IV, Item 15 of this Annual Report on Form 10-K for a detailed discussion of our revenue recognition policies and our contractual arrangements.\nConsolidation. Our consolidated financial statements included in Part IV, Item 15 of this Annual Report on Form 10-K include only the accounts of the entities we control. We continually assess whether our existing contractual rights give us the ability to direct the activities of the entities we manage that most significantly affect the results of that entity. The activities and factors we consider include, but are not limited to:\nour representation on the entitys governing body;\nthe size of our investment in each entity compared to the size of the entity and the size of other investors interests; and\nthe ability and rights to participate in significant policy making decisions and to replace our manager of those entities.\nBased on our historical assessments, we have not consolidated the entities we manage. We will reassess these conclusions if and when facts and circumstances indicate that there are changes to the elements evidencing control. Item 7A. Quantitative and Qualitative Disclosures About Market Risk\nQuantitative and Qualitative disclosures about market risk are set forth above in Item 7 - Managements Discussion and Analysis of Financial Condition and Results of Operation-Market Risk and Credit Risk. Item 8. Financial Statements and Supplementary Data\nThe information required by this item is included in Item 15 of this Annual Report on Form 10-K. Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone. Item 9A. Controls and Procedures\nAs of the end of the period covered by this Annual Report on Form 10-K, our management carried out an evaluation, under the supervision and with the participation of our President and Chief Executive Officer and our Executive Vice President, Chief Financial Officer and Treasurer, of the effectiveness of our disclosure controls and procedures pursuant to Rules 13a-15 and 15d-15 under the Exchange Act. Based upon that evaluation, our President and Chief Executive Officer and our Executive Vice President, Chief Financial Officer and Treasurer concluded that our disclosure controls and procedures are effective.\nThere have been no changes in our internal control over financial reporting during the quarter ended September 30, 2022 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nManagement Report on Assessment of Internal Control Over Financial Reporting\nWe are responsible for establishing and maintaining adequate internal control over financial reporting. Our internal control system is designed to provide reasonable assurance to our management and Board of Directors regarding the preparation and fair presentation of published financial statements. All internal control systems, no matter how well designed, have inherent limitations. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation.\nOur management assessed the effectiveness of our internal control over financial reporting as of September 30, 2022. In making this assessment, it used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) in Internal Control-Integrated Framework. Based on this assessment, we believe that, as of September 30, 2022, our internal control over financial reporting is effective.\nDeloitte & Touche LLP, the independent registered public accounting firm that audited our 2022 Consolidated Financial Statements included in Part IV, Item 15 of this Annual Report on Form 10-K, has issued an attestation report on our internal control over financial reporting. Its report appears elsewhere herein. Item 9B. Other Information\nOn November 14, 2022, our Board of Directors adopted Articles of Amendment, effective that same day, to increase the number of authorized shares of our Class A common stock by 350,000, which is equal to an increase in the total number of shares of our Class A common stock available for issuance under our Amended and Restated 2016 Omnibus Equity Plan, as approved by our shareholders at our annual meeting of shareholders held on March 10, 2022. The Articles of Amendment were filed with the State of Marylands State Department of Assessments and Taxation on November 14, 2022.\nThe foregoing description of the Articles of Amendment does not purport to be complete and is qualified in its entirety by reference to the full text of the Articles of Amendment, a copy of which is filed as Exhibit 3.5 and incorporated herein by reference.\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNone.\nPART III Item 10. Directors, Executive Officers and Corporate Governance\nThe information required by this Item 10 of Form 10-K will be included in the 2023 Proxy Statement and is incorporated herein by reference. Item 11. Executive Compensation\nThe information required by this Item 11 of Form 10-K will be included in the 2023 Proxy Statement and is incorporated herein by reference. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nEquity Compensation Plan Information. We may award our Class A Common Shares to our officers and employees under the Amended and Restated 2016 Omnibus Equity Plan, or the 2016 Plan. In addition, each of our Directors receives Class A Common Shares under the 2016 Plan as part of his or her annual compensation for serving as a Director. The terms of awards made under the 2016 Plan are determined by the Compensation Committee of our Board of Directors, at the time of the award. The following table is as of September 30, 2022.\nNumber of securities\nNumber of securities remaining available for\nto be issued upon Weighted-average future issuance under equity\nexercise of exercise price of compensation plans (excluding\noutstanding options, outstanding options, securities\nPlan category warrants and rights\nwarrants and rights reflected in column (a))\n(a) (b) (c)\nEquity compensation plans approved by security holders - 2016 Plan None. None. 343,885 (1)\nEquity compensation plans not approved by security holders None. None. None.\nTotal None. None. 343,885 (1)\n(1) Consists of shares available for issuance pursuant to the terms of the 2016 Plan. Share awards that are repurchased or forfeited will be added to the shares available for issuance under the 2016 Plan. At our annual meeting of shareholders held on March 10, 2022, our shareholders approved the 2016 Plan, which amended and restated our prior equity plan to increase the total number of Class A Common Shares available for award by 350,000.\nOther information required by this Item 12 of Form 10-K will be included in the 2023 Proxy Statement and is incorporated herein by reference. Item 13. Certain Relationships and Related Person Transactions, and Director Independence\nThe information required by this Item 13 of Form 10-K will be included in the 2023 Proxy Statement and is incorporated herein by reference. Item 14. Principal Accountant Fees and Services\nThe information required by this Item 14 of Form 10-K will be included in the 2023 Proxy Statement and is incorporated herein by reference.\nPART IV Item 15. Exhibits and Financial Statement Schedules\n(a) Index to Financial Statements and Financial Statement Schedules\nThe following consolidated financial statements of The RMR Group Inc. are included on the pages indicated:\nReports of Independent Registered Public Accounting Firm (PCAOB ID No. 34)\nConsolidated Balance Sheets as of September 30, 2022 and 2021\nConsolidated Statements of Income for the fiscal years ended September 30, 2022, 2021 and 2020\nConsolidated Statements of Shareholders Equity for the fiscal years ended September 30, 2022, 2021 and 2020\nConsolidated Statements of Cash Flows for the fiscal years ended September 30, 2022, 2021 and 2020\nNotes to Consolidated Financial Statements\nAll other schedules for which provision is made in the applicable accounting regulations of the SEC are not required under the related instructions, or are inapplicable, and therefore have been omitted.\n(b) Exhibits\nExhibit\nNumber Description\n3.1 Articles of Amendment and Restatement of the Registrant (1)\n3.2 Articles of Amendment, filed July 30, 2015 (1)\n3.3 Articles of Amendment, filed September 11, 2015 (1)\n3.4 Articles of Amendment, filed March 9, 2016 (2)\n3.5 Articles of Amendment, filed November 14, 2022 (filed herewith.)\n3.6 Fourth Amended and Restated Bylaws of the Registrant adopted September 13, 2017 (3)\n4.1 Form of The RMR Group Inc. Share Certificate for Class A Common Stock (4)\n4.2 Registration Rights Agreement, dated as of June 5, 2015, by and between the Registrant and ABP Trust (formerly known as Reit Management & Research Trust) (1)\n4.3 Description of Capital Stock (5)\n10.1 The RMR Group LLC Amended and Restated Operating Agreement, dated as of October 14, 2015, as updated December 22, 2017, by and among The RMR Group LLC and its Members (6)\n10.2 Amended and Restated Business Management Agreement, dated as of January 1, 2020, by and between ABP Trust and The RMR Group LLC (17)\n10.3 Amended and Restated Business Management and Shared Services Agreement, dated as of June 5, 2015, by and between Sonesta International Hotels Corporation and The RMR Group LLC (1)\n10.4 First Amendment to Amended and Restated Business Management and Shared Services Agreement, dated as of May 31, 2022, by and between Sonesta International Hotels Corporation and The RMR Group LLC (21)\n10.5 Second Amended and Restated Business Management Agreement, dated as of June 5, 2015, by and between Office Properties Income Trust (formerly known as Government Properties Income Trust) and The RMR Group LLC (1)\n10.6 Amendment to Second Amended and Restated Business Management Agreement, dated December 31, 2018, between Office Properties Income Trust (formerly known as Government Properties Income Trust) and The RMR Group LLC (12)\n10.7 Second Amendment to Second Amended and Restated Business Management Agreement, dated August 1, 2021, between Office Properties Income Trust and The RMR Group LLC (19)\n10.8 Second Amended and Restated Business Management Agreement, dated as of June 5, 2015, by and between Service Properties Trust (formerly known as Hospitality Properties Trust) and The RMR Group LLC (1)\n10.9 First Amendment to Second Amended and Restated Business Management Agreement, dated as of August 1, 2021, by and between Service Properties Trust and The RMR Group LLC (19)\n10.10 Second Amended and Restated Business Management Agreement, dated as of June 5, 2015, by and between Diversified Healthcare Trust (formerly known as Senior Housing Properties Trust) and The RMR Group LLC (1)\n10.11 First Amendment to Second Amended and Restated Business Management Agreement, dated as of August 1, 2021, by and between Diversified Healthcare Trust and The RMR Group LLC (19)\n10.12 Business Management Agreement, dated as of January 17, 2018, by and between Industrial Logistics Properties Trust and The RMR Group LLC (7)\n10.13 Amendment to Business Management Agreement, dated December 31, 2018, between Industrial Logistics Properties Trust and The RMR Group LLC (12)\n10.14 Second Amendment to Business Management Agreement, dated August 1, 2021, between Industrial Logistics Properties Trust and The RMR Group LLC (19)\n10.15 Amended and Restated Property Management Agreement, by and between The RMR Group LLC and ABP Trust (formerly known as Reit Management & Research Trust) (1)\n10.16 Second Amended and Restated Property Management Agreement, dated as of June 5, 2015, by and between The RMR Group LLC and Office Properties Income Trust (formerly known as Government Properties Income Trust) (1)\n10.17 Third Amended and Restated Property Management Agreement, dated as of June 22, 2021, by and between The RMR Group LLC and Service Properties Trust (18)\n10.18 Third Amended and Restated Property Management Agreement, dated as of June 9, 2021, by and between The RMR Group LLC and Diversified Healthcare Trust (18)\n10.19 Property Management Agreement, dated as of January 17, 2018, by and between The RMR Group LLC and Industrial Logistics Properties Trust (7)\n10.20 Tax Receivable Agreement, dated as of June 5, 2015, by and among the Registrant, The RMR Group LLC and ABP Trust (formerly known as Reit Management & Research Trust) (1)\n10.21 Lease, dated as of June 1, 2015, by and between RMR West LLC and The RMR Group LLC (1)\n10.22 Amendment No. 1 to the Lease, dated as of June 1, 2015, by and between RMR West LLC and The RMR Group LLC, effective as of January 1, 2016 (8)\n10.23 Amendment No. 2 to the Lease, dated as of June 1, 2015, by and between ABP Trust and The RMR Group LLC, effective as of July 19, 2018 (8)\n10.24 Amendment No. 3 to the Lease, dated as of June 1, 2015, by and between ABP Trust and The RMR Group LLC, effective as of June 13, 2019 (13)\n10.25 Form of Indemnification Agreement for the Registrant and its directors and executive officers (1)\n10.26 The RMR Group Inc. Amended and Restated 2016 Omnibus Equity Plan (+) (9)\n10.27 Summary of Director Compensation (9)\n10.28 Form of The RMR Group Inc. Share Award Agreement (+) (Filed herewith.)\n21.1 Subsidiaries of the Registrant (Filed herewith.)\n23.1 Consent of Deloitte & Touche LLP (Filed herewith.)\n31.1 Rule 13a-14(a) Certification (Filed herewith.)\n31.2 Rule 13a-14(a) Certification (Filed herewith.)\n32.1 Section 1350 Certification (Furnished herewith.)\n99.1 Letter, dated March 24, 2017, between The RMR Group LLC and Diversified Healthcare Trust (formerly known as Senior Housing Properties Trust), regarding Second Amended and Restated Business Management Agreement (10)\n99.2 Letter, dated October 2, 2017, between The RMR Group LLC and Office Properties Income Trust (formerly known as Government Properties Income Trust), regarding Second Amended and Restated Property Management Agreement (11)\n99.3 Letter, dated January 17, 2018, between Office Properties Income Trust (as successor to Select Income REIT) and The RMR Group LLC, regarding Business Management Agreement and Property Management Agreement, between Industrial Logistics Properties Trust and The RMR Group LLC (7)\n99.4 Letter, dated January 29, 2019, between The RMR Group LLC and Industrial Logistics Properties Trust, regarding Property Management Agreement, between Industrial Logistics Properties Trust and The RMR Group LLC (14)\n99.5 Amended and Restated Business Management and Shared Services Agreement, dated as of March 16, 2015, between AlerisLife Inc. (formerly known as Five Star Quality Care, Inc.) and The RMR Group LLC (15)\n99.6 Amended and Restated Business Management and Shared Services Agreement, dated as of March 12, 2015, by and between TravelCenters of America Inc. (formerly known as TravelCenters of America LLC) and The RMR Group LLC (16)\n99.7 Letter Agreement, dated as of February 21, 2020, between Industrial Logistics Properties Trust and The RMR Group LLC (17)\n99.8 Letter, dated February 25, 2022, between Industrial Logistics Properties Trust and The RMR Group LLC regarding Business Management Agreement between Industrial Logistics Properties Trust and The RMR Group LLC (20)\n101.INS XBRL Instance Document - the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document.\n101.SCH XBRL Taxonomy Extension Schema Document. (Filed herewith.)\n101.CAL XBRL Taxonomy Extension Calculation Linkbase Document. (Filed herewith.)\n101.DEF XBRL Taxonomy Extension Definition Linkbase Document. (Filed herewith.)\n101.LAB XBRL Taxonomy Extension Label Linkbase Document. (Filed herewith.)\n101.PRE XBRL Taxonomy Extension Presentation Linkbase Document. (Filed herewith.)\n104 Cover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101)\n(1) Incorporated by reference to the Registrants Registration Statement on Form S-1 (File No. 333-207423) filed with the SEC on October 14, 2015.\n(2) Incorporated by reference to the Registrants Current Report on Form 8-K (File No. 001-37616) filed with the SEC on March 11, 2016.\n(3) Incorporated by reference to the Registrants Current Report on Form 8-K (File No. 001-37616) filed with the SEC on September 15, 2017.\n(4) Incorporated by reference to the Registrants Amendment No. 1 to Registration Statement on Form S-1 (File No. 333-207423) filed with the SEC on November 2, 2015.\n(5) Incorporated by reference to the Registrants Annual Report on Form 10-K (File No. 001-37616) filed with the SEC on November 22, 2019.\n(6) Incorporated by reference to the Registrants Quarterly Report on Form 10-Q (File No. 001-37616) filed with the SEC on February 8, 2018.\n(7) Incorporated by reference to the Registrants Current Report on Form 8-K (File No. 001-37616) filed with the SEC on January 18, 2018.\n(8) Incorporated by reference to the Registrants Quarterly Report on Form 10-Q (File No. 001-37616) filed with the SEC on August 8, 2018.\n(9) Incorporated by reference to the Registrants Current Report on Form 8-K (File No. 001-37616) filed with the SEC on March 11, 2022.\n(10) Incorporated by reference to the Registrants Quarterly Report on Form 10-Q (File No. 001-37616) filed with the SEC on May 10, 2017.\n(11) Incorporated by reference to the Registrants Annual Report on Form 10-K (File No. 001-37616) filed with the SEC on December 12, 2017.\n(12) Incorporated by reference to the Registrants Quarterly Report on Form 10-Q (File No. 001-37616) filed with the SEC on February 7, 2019.\n(13) Incorporated by reference to the Registrants Current Report on Form 8-K (File No. 001-37616) filed with the SEC on June 14, 2019.\n(14) Incorporated by reference to the Registrants Quarterly Report on Form 10-Q (File No. 001-37616) filed with the SEC on May 10, 2019.\n(15) Incorporated by reference to AlerisLife Inc.s (formerly known as Five Star Quality Care, Inc.) Annual Report on Form 10-K (File No. 001-16817) filed with the SEC on March 16, 2015.\n(16) Incorporated by reference to TravelCenters of America Inc.s Annual Report on Form 10-K (File No. 001- 33274) filed with the SEC on March 13, 2015.\n(17) Incorporated by reference to the Registrants Quarterly Report on Form 10-Q (File No. 001-37616) filed with the SEC on May 11, 2020.\n(18) Incorporated by reference to the Registrants Quarterly Report on Form 10-Q (File No. 001-37616) filed with the SEC on August 5, 2021.\n(19) Incorporated by reference to the Registrants Annual Report on Form 10-K (File No. 001-37616) filed with the SEC on November 15, 2021.\n(20) Incorporated by reference to the Registrants Quarterly Report on Form 10-Q (File No. 001-37616) filed with the SEC on May 4, 2022.\n(21) Incorporated by reference to the Registrants Quarterly Report on Form 10-Q (File No. 001-37616) filed with the SEC on August 4, 2022.\n(+) Contract with management or compensatory plan or arrangement.\nItem 16. Form 10-K Summary\nNone.\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Shareholders and the Board of Directors of The RMR Group Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of The RMR Group Inc. (the Company) as of September 30, 2022 and 2021, the related consolidated statements of income, shareholders equity, and cash flows for each of the three years in the period ended September 30, 2022, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of September 30, 2022 and 2021, and the results of its operations and its cash flows for each of the three years in the period ended September 30, 2022, in conformity with accounting principles generally accepted in the United States of America.\nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Companys internal control over financial reporting as of September 30, 2022, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission and our report dated November 14, 2022, expressed an unqualified opinion on the Companys internal control over financial reporting.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current-period audit of the financial statements that was communicated or required to be communicated to the audit committee and that (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nEvaluation of the identification of related parties and related party transactions - Refer to Notes 1, 2 and 5 to the consolidated financial statements\nCritical Audit Matter Description\nAs discussed in Notes 1 and 2 to the consolidated financial statements, the Company generates its revenue by providing management services to four publicly traded equity real estate investment trusts, three real estate operating companies, and private capital vehicles, as well as providing advisory services to a publicly traded mortgage real estate investment trust, all of which are related parties. These entities are considered to be related parties for the reasons discussed in Note 5 to the consolidated financial statements. In addition, the Company has also entered into a number of other arrangements with its related parties as further discussed in Note 5.\nGiven the number of related parties and related party transactions, we determined the evaluation of the identification of related parties and related party transactions to be a critical audit matter. Auditor judgment and effort was involved in assessing the sufficiency of the procedures the Company performed to identify and disclose related parties and related party transactions.\nHow the Critical Audit Matter Was Addressed in the Audit\nOur audit procedures related to the identification and disclosure of related parties and related party transactions included the following, among others:\nWe tested the effectiveness of controls over the Companys identification of related party relationships and transactions.\nWe evaluated the process used by management to identify and disclose related parties and related party transactions by:\n◦Inspecting the Companys minutes from meetings of the Board of Directors and related committees to determine whether there were any related parties or transactions not previously identified.\n◦Inspecting questionnaires completed by the Companys directors and officers to identify potential related party transactions.\n◦Inquiring with executive officers, key members of management, and the Audit Committee of the Board of Directors regarding their knowledge of the Companys related party transactions.\n◦Reading public filings made by the Company, in addition to external news sources for information related to transactions between the Company and related parties to compare to the Companys detail of related party transactions.\n◦Listening to the Companys quarterly earnings investor calls to identify any undisclosed related parties, transactions, or agreements.\n◦Inspecting new and amended agreements between the Company and related parties to ensure they were properly disclosed.\n◦Inspecting the Companys check register and accounts payable sub-ledger to determine whether there were any payments made or to be made to related parties for transactions not previously identified.\n/s/ Deloitte & Touche LLP\nBoston, Massachusetts\nNovember 14, 2022\nWe have served as the Companys auditor since 2020.\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Shareholders and the Board of Directors of The RMR Group Inc.\nOpinion on Internal Control over Financial Reporting\nWe have audited the internal control over financial reporting of The RMR Group Inc. (the Company) as of September 30, 2022, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). In our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of September 30, 2022, based on criteria established in Internal Control - Integrated Framework (2013) issued by COSO.\nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated financial statements as of and for the year ended September 30, 2022, of the Company and our report dated November 14, 2022, expressed an unqualified opinion on those financial statements.\nBasis for Opinion\nThe Companys management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Management Report on Assessment of Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Companys internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. Our audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control over Financial Reporting\nA companys internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A companys internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ Deloitte & Touche LLP\nBoston, Massachusetts\nNovember 14, 2022\nThe RMR Group Inc.\nConsolidated Balance Sheets\n(dollars in thousands, except per share amounts)\nSeptember 30,\n2022 2021\nAssets\nCurrent assets:\nCash and cash equivalents $ 189,088 $ 159,835\nDue from related parties 108,821 88,661\nPrepaid and other current assets 5,372 6,021\nTotal current assets 303,281 254,517\nProperty and equipment, net 2,495 2,218\nDue from related parties, net of current portion 14,557 14,331\nEquity method investments accounted for under the fair value option 49,114 39,476\nGoodwill and intangible assets, net of amortization 2,057 2,094\nOperating lease right of use assets 28,894 32,293\nDeferred tax asset 17,112 18,671\nOther assets, net of amortization 124,895 134,311\nTotal assets $ 542,405 $ 497,911\nLiabilities and Equity\nCurrent liabilities:\nReimbursable accounts payable and accrued expenses $ 80,221 $ 55,115\nAccounts payable and accrued expenses 16,745 15,027\nOperating lease liabilities 4,693 4,922\nEmployer compensation liability 7,516 6,076\nTotal current liabilities 109,175 81,140\nOperating lease liabilities, net of current portion 25,626 29,148\nAmounts due pursuant to tax receivable agreement, net of current portion 23,308 25,577\nEmployer compensation liability, net of current portion 14,557 14,331\nTotal liabilities 172,666 150,196\nCommitments and contingencies\nEquity:\nClass A common stock, $0.001 par value; 31,600,000 shares authorized; 15,606,115 and 15,485,236 shares issued and outstanding, respectively\n16 15\nClass B-1 common stock, $0.001 par value; 1,000,000 shares authorized, issued and outstanding\n1 1\nClass B-2 common stock, $0.001 par value; 15,000,000 shares authorized, issued and outstanding\n15 15\nAdditional paid in capital 113,136 109,910\nRetained earnings 355,949 321,945\nCumulative common distributions (262,496) (236,766)\nTotal shareholders equity 206,621 195,120\nNoncontrolling interest 163,118 152,595\nTotal equity 369,739 347,715\nTotal liabilities and equity $ 542,405 $ 497,911\nSee accompanying notes.\nThe RMR Group Inc.\nConsolidated Statements of Income\n(amounts in thousands, except per share amounts)\nFiscal Year Ended September 30,\n2022 2021 2020\nRevenues:\nManagement services $ 195,450 $ 171,102 $ 168,766\nIncentive business management fees - 620 -\nAdvisory services 4,530 3,956 2,911\nTotal management and advisory services revenues 199,980 175,678 171,677\nReimbursable compensation and benefits 56,684 52,369 52,344\nReimbursable equity based compensation 7,072 9,154 4,912\nOther reimbursable expenses 568,767 370,037 360,572\nTotal reimbursable costs 632,523 431,560 417,828\nTotal revenues 832,503 607,238 589,505\nExpenses:\nCompensation and benefits 129,872 119,644 121,386\nEquity based compensation 10,136 12,022 7,828\nSeparation costs 1,315 4,525 1,881\nTotal compensation and benefits expense 141,323 136,191 131,095\nGeneral and administrative 32,919 26,961 26,514\nOther reimbursable expenses 568,767 370,037 360,572\nTransaction and acquisition related costs 132 984 1,618\nDepreciation and amortization 993 973 968\nTotal expenses 744,134 535,146 520,767\nOperating income 88,369 72,092 68,738\nInterest and other income 1,322 760 4,451\nGain on Tremont Mortgage Trust investment - 2,059 -\nEquity in earnings of investees - 443 1,545\nUnrealized gain on equity method investments accounted for under the fair value option 1,010 18,811 3,151\nIncome before income tax expense 90,701 94,165 77,885\nIncome tax expense (13,233) (13,152) (11,552)\nNet income 77,468 81,013 66,333\nNet income attributable to noncontrolling interest (43,464) (45,317) (37,541)\nNet income attributable to The RMR Group Inc. $ 34,004 $ 35,696 $ 28,792\nWeighted average common shares outstanding - basic 16,338 16,266 16,194\nWeighted average common shares outstanding - diluted 31,348 31,282 31,194\nNet income attributable to The RMR Group Inc. per common share - basic $ 2.06 $ 2.18 $ 1.77\nNet income attributable to The RMR Group Inc. per common share - diluted $ 2.04 $ 2.15 $ 1.75\nSubstantially all revenues are earned from related parties. See accompanying notes.\nThe RMR Group Inc.\nConsolidated Statements of Shareholders Equity\n(dollars in thousands)\nClass A Common Stock Class B-1 Common Stock Class B-2 Common Stock Additional Paid In Capital Retained Earnings Cumulative Common Distributions Total Shareholders' Equity Noncontrolling Interest Total Equity\nBalance at September 30, 2019 $ 15 $ 1 $ 15 $ 103,360 $ 257,457 $ (72,194) $ 288,654 $ 240,381 $ 529,035\nShare awards, net - - - 3,262 - - 3,262 - 3,262\nNet income - - - - 28,792 - 28,792 37,541 66,333\nTax distributions to member - - - - - - - (14,939) (14,939)\nCommon share distributions - - - - - (24,789) (24,789) (18,000) (42,789)\nBalance at September 30, 2020 15 1 15 106,622 286,249 (96,983) 295,919 244,983 540,902\nShare awards, net - - - 3,288 - - 3,288 - 3,288\nNet income - - - - 35,696 - 35,696 45,317 81,013\nTax distributions to member - - - - - - - (14,705) (14,705)\nCommon share distributions - - - - - (139,783) (139,783) (123,000) (262,783)\nBalance at September 30, 2021 15 1 15 109,910 321,945 (236,766) 195,120 152,595 347,715\nShare awards, net 1 - - 3,226 - - 3,227 - 3,227\nNet income - - - - 34,004 - 34,004 43,464 77,468\nTax distributions to member - - - - - - - (14,341) (14,341)\nCommon share distributions - - - - - (25,730) (25,730) (18,600) (44,330)\nBalance at September 30, 2022 $ 16 $ 1 $ 15 $ 113,136 $ 355,949 $ (262,496) $ 206,621 $ 163,118 $ 369,739\nSee accompanying notes.\nThe RMR Group Inc.\nConsolidated Statements of Cash Flows\n(dollars in thousands)\nFiscal Year Ended September 30,\n2022 2021 2020\nCash Flows from Operating Activities:\nNet income $ 77,468 $ 81,013 $ 66,333\nAdjustments to reconcile net income to net cash from operating activities:\nDepreciation and amortization 993 973 968\nStraight line office rent (352) 3 154\nAmortization expense related to other assets 9,416 9,416 9,416\nDeferred income taxes 1,559 5,229 1,829\nOperating expenses paid in The RMR Group Inc. common shares 3,774 4,122 3,785\nEquity in earnings of investees - (443) (1,545)\nDistributions from equity method investments 841 1,456 736\nGain on Tremont Mortgage Trust investment - (2,059) -\nUnrealized gain on equity method investments accounted for under the fair value option (1,010) (18,811) (3,151)\nChanges in assets and liabilities:\nDue from related parties (18,720) (4,278) 10,400\nPrepaid and other current assets 649 (2,144) 1,971\nReimbursable accounts payable and accrued expenses 25,106 (964) (9,830)\nAccounts payable and accrued expenses 1,546 (1,719) (3,569)\nNet cash from operating activities 101,270 71,794 77,497\nCash Flows from Investing Activities:\nPurchase of property and equipment (1,121) (1,142) (601)\nEquity method investment in Seven Hills Realty Trust (9,469) - -\nEquity method investment in TravelCenters of America Inc. - - (5,319)\nNet cash used in investing activities (10,590) (1,142) (5,920)\nCash Flows from Financing Activities:\nDistributions to noncontrolling interest (32,941) (137,705) (32,939)\nDistributions to common shareholders (25,730) (139,783) (24,789)\nRepurchase of common shares (547) (834) (523)\nPayments under the tax receivable agreement (2,209) (2,158) (2,111)\nNet cash used in financing activities (61,427) (280,480) (60,362)\nIncrease (decrease) in cash and cash equivalents 29,253 (209,828) 11,215\nCash and cash equivalents at beginning of period 159,835 369,663 358,448\nCash and cash equivalents at end of period $ 189,088 $ 159,835 $ 369,663\nSupplemental Cash Flow Information and Non-Cash Activities:\nIncome taxes paid $ 9,555 $ 10,047 $ 10,189\nFair value of share based payments recorded $ 7,072 $ 9,154 $ 4,912\nRecognition of right of use assets and related lease liabilities $ 1,295 $ 2,249 $ 40,765\nEquity method investment in Seven Hills Realty Trust $ - $ (8,513) $ -\nEquity method investment in Tremont Mortgage Trust $ - $ 6,454 $ -\nSee accompanying notes.\nThe RMR Group Inc.\nNotes to Consolidated Financial Statements\n(dollars in thousands, except per share amounts)\nNote 1. Organization\nThe RMR Group Inc., or RMR Inc., is a holding company and substantially all of its business is conducted by its majority owned subsidiary, The RMR Group LLC, or RMR LLC. RMR Inc. is a Maryland corporation and RMR LLC is a Maryland limited liability company. RMR Inc. serves as the sole managing member of RMR LLC and, in that capacity, operates and controls the business and affairs of RMR LLC. In these financial statements, unless otherwise indicated, we, us and our refer to RMR Inc. and its direct and indirect subsidiaries, including RMR LLC.\nAs of September 30, 2022, RMR Inc. owned 15,606,115 class A membership units of RMR LLC, or Class A Units, and 1,000,000 class B membership units of RMR LLC, or Class B Units. The aggregate RMR LLC membership units RMR Inc. owns represented 52.5% of the economic interest of RMR LLC as of September 30, 2022. We refer to economic interest as the right of a holder of a Class A Unit or Class B Unit to share in distributions made by RMR LLC and, upon liquidation, dissolution or winding up of RMR LLC, to share in the assets of RMR LLC after payments to creditors. A wholly owned subsidiary of ABP Trust, a Maryland statutory trust, owns 15,000,000 redeemable Class A Units, representing 47.5% of the economic interest of RMR LLC as of September 30, 2022, which is presented as a noncontrolling interest within the consolidated financial statements. Adam D. Portnoy, the Chair of our Board and one of our Managing Directors, is the sole trustee of ABP Trust, and owns all of ABP Trusts voting securities.\nRMR LLC was founded in 1986 to manage public investments in real estate and, as of September 30, 2022, managed a diverse portfolio of real estate and real estate related businesses. RMR LLC provides management services to four publicly traded equity real estate investment trusts, or REITs: Diversified Healthcare Trust, or DHC, which owns medical office and life science properties, senior living communities and wellness centers; Industrial Logistics Properties Trust, or ILPT, which owns and leases industrial and logistics properties; Office Properties Income Trust, or OPI, which owns office properties primarily leased to single tenants and those with high quality credit characteristics, including the government; and Service Properties Trust, or SVC, which owns a diverse portfolio of hotels and net lease service and necessity-based retail properties. DHC, ILPT, OPI and SVC are collectively referred to as the Managed Equity REITs.\nRMR LLC also provides management services to three real estate operating companies: AlerisLife Inc., or ALR, a publicly traded operator of senior living communities, many of which are owned by DHC; Sonesta International Hotels Corporation, or Sonesta, a privately owned franchisor and operator of hotels, resorts and cruise ships in the United States, Latin America, the Caribbean and the Middle East, and many of the U.S. hotels that Sonesta operates are owned by SVC; and TravelCenters of America Inc., or TA, an operator and franchisor of travel centers primarily along the U.S. interstate highway system, many of which are owned by SVC, and standalone truck service facilities. ALR, Sonesta and TA are collectively referred to as the Managed Operating Companies.\nIn addition, RMR LLC provides management services to private capital vehicles, including ABP Trust and its subsidiaries, or collectively ABP Trust, and other private entities that own commercial real estate of which certain of our Managed Equity REITs own minority equity interests. In these financial statements, we refer to these clients as the Managed Private Real Estate Capital clients.\nRMR LLCs wholly owned subsidiary, Tremont Realty Capital LLC, or Tremont, an investment adviser registered with the Securities and Exchange Commission, or SEC, provides advisory services for Seven Hills Realty Trust, or SEVN. SEVN is a publicly traded mortgage REIT that focuses on originating and investing in first mortgage whole loans secured by middle market and transitional commercial real estate. Until September 30, 2021, Tremont also provided advisory services to Tremont Mortgage Trust, or TRMT, a publicly traded mortgage REIT that merged with and into SEVN on September 30, 2021, or the Merger, with SEVN continuing as the surviving company. Tremont continues to manage the combined company pursuant to its management agreement with SEVN and waived the termination fee that would have otherwise been payable by TRMT as a result of the Merger. Tremont has in the past and may in the future manage additional accounts that invest in commercial real estate debt. Tremont may also act as a transaction broker for non-investment advisory clients for negotiated fees, which we refer to as the Tremont business.\nThe Managed Equity REITs, SEVN, and, until September 30, 2021, TRMT, are collectively referred to as the Managed REITs or the Managed Public Real Estate Capital clients.\nThe RMR Group Inc.\nNotes to Consolidated Financial Statements (Continued)\n(dollars in thousands, except per share amounts)\nNote 2. Summary of Significant Accounting Policies\nBasis of Presentation\nAll intercompany transactions and balances with or among our consolidated entities have been eliminated.\nUse of Estimates\nPreparation of these financial statements in conformity with U.S. Generally Accepted Accounting Principles, or GAAP, requires our management to make certain estimates and assumptions that may affect the amounts reported in these consolidated financial statements and related notes. The actual results could differ from these estimates.\nRevenue Recognition\nRevenues from services that we provide are recognized as earned over time as the services provided represent performance obligations that are satisfied over time.\nManagement Agreements with the Managed Equity REITs\nWe are party to a business management and a property management agreement with each Managed Equity REIT. The following is a summary of the fees we earn pursuant to our business management agreements with the Managed Equity REITs. For a summary of the fees we earn pursuant to our property management agreements with the Managed Equity REITs, please see Property Management Agreements, below.\nBase Business Management Fees - We earn annual base business management fees from the Managed Equity REITs by providing continuous services pursuant to business management agreements equal to the lesser of:\nthe sum of (a) 0.5% of the historical cost of transferred real estate assets, if any, as defined in the applicable business management agreement, plus (b) 0.7% of the average invested capital (exclusive of the transferred real estate assets), as defined in the applicable business management agreement, up to $250,000, plus (c) 0.5% of the average invested capital exceeding $250,000; and\nthe sum of (a) 0.7% of the average market capitalization, as defined in the applicable business management agreement, up to $250,000, plus (b) 0.5% of the average market capitalization exceeding $250,000.\nThe foregoing base business management fees are paid in cash monthly in arrears.\nFor the fiscal years ended September 30, 2022, 2021 and 2020, we earned aggregate base business management fees from the Managed Equity REITs of $96,031, $93,153 and $94,354, respectively.\nIncentive Business Management Fees - We also may earn annual incentive business management fees from the Managed Equity REITs under the business management agreements. The incentive business management fees, which are payable in cash, are contingent performance based fees recognized only when earned at the end of each respective measurement period. Incentive business management fees are excluded from the transaction price until it becomes probable that there will not be a significant reversal of cumulative revenue recognized.\nThe incentive business management fees are calculated for each Managed Equity REIT as 12.0% of the product of (a) the equity market capitalization of the Managed Equity REIT, as defined in the applicable business management agreement, on the last trading day of the year immediately prior to the relevant measurement period and (b) the amount, expressed as a percentage, by which the Managed Equity REITs total return per share, as defined in the applicable business management agreement, exceeded the applicable benchmark total return per share, as defined in the applicable business management agreement, of a specified REIT index identified in the applicable business management agreement for the measurement period, as adjusted for net share issuances during the period and subject to caps on the values of the incentive fees. The measurement period for the annual incentive business management fees is defined as the three year period ending on December 31 of the year for which such fee is being calculated.\nRMR LLC and each Managed Equity REIT amended their business management agreements effective August 1, 2021 to replace the benchmark indexes used in the calculation of incentive business management fees. Pursuant to the amendment, for periods beginning on and after August 1, 2021, each Managed Equity REITs respective subsector index of the MSCI U.S.\nThe RMR Group Inc.\nNotes to Consolidated Financial Statements (Continued)\n(dollars in thousands, except per share amounts)\nREIT indexes replaced the discontinued SNL U.S. REIT indexes and are used to calculate benchmark returns per share for purposes of determining any incentive business management fee payable by the Managed Equity REIT to RMR LLC. The replacement indexes are: MSCI U.S. REIT/Health Care Index for DHC; MSCI U.S. REIT/Industrial REIT Index for ILPT; MSCI U.S. REIT/Office REIT Index for OPI; and MSCI U.S. REIT/Hotel & Resort REIT Index for SVC. For periods prior to August 1, 2021, the previously used and now discontinued SNL U.S. REIT indexes continue to be used. Accordingly, the calculation of incentive business management fees for the next two measurement periods will continue to use the SNL U.S. REIT indexes in calculating the benchmark returns for periods through July 31, 2021.\nWe did not earn incentive business management fees from the Managed Equity REITs for the calendar years 2021, 2020 or 2019.\nTerm and Termination - Our management agreements with the Managed Equity REITs automatically extend on December 31st of each year and have terms thereafter that end on the 20th anniversary of the date of each extension. Each of the Managed Equity REITs has the right to terminate each management agreement: (i) at any time upon 60 days written notice for convenience, (ii) immediately upon written notice for cause, as defined in the agreements, (iii) upon written notice given within 60 days after the end of an applicable calendar year for a performance reason, as defined in the agreements, and (iv) by written notice during the 12 months following a change of control of RMR LLC, as defined in the agreements. We have the right to terminate the management agreements for good reason, as defined therein.\nUnder our management agreements with the Managed Equity REITs, if a Managed Equity REIT terminates our management agreements for convenience, or if we terminate one or both of our management agreements with a Managed Equity REIT for good reason, the Managed Equity REIT is obligated to pay us a termination fee in an amount equal to the sum of the present values of the Managed Equity REITs monthly future fees, as defined therein, for the terminated management agreement(s) for the remaining term, assuming it had not been terminated. If a Managed Equity REIT terminates one or both of our management agreements for a performance reason, as defined therein, the Managed Equity REIT has agreed to pay to us the termination fee calculated as described above, but assuming a remaining term of 10 years. No termination fee is payable by a Managed Equity REIT if it terminates one or both of our management agreements for cause or as a result of a change of control of us, as defined in the applicable management agreement.\nOther Management Agreements\nManaged Operating Companies - We earn management fees by providing continuous services pursuant to the management agreements from the Managed Operating Companies equal to 0.6% of: (i) in the case of ALR, ALRs revenues from all sources reportable under GAAP, less any revenues reportable by ALR with respect to properties for which it provides management services, plus the gross revenues at those properties determined in accordance with GAAP; (ii) in the case of Sonesta, Sonestas revenues from all sources reportable under GAAP, less any revenues reportable by Sonesta with respect to hotels for which it provides management services, plus the gross revenues at those hotels determined in accordance with GAAP; and (iii) in the case of TA, the sum of TAs gross fuel margin, as defined in the applicable agreement, plus TAs total nonfuel revenues. These management fees are estimated and payable in cash monthly in advance.\nFor the fiscal years ended September 30, 2022, 2021 and 2020, we earned aggregate fees from the Managed Operating Companies of $29,551, $25,347 and $23,376, respectively.\nManaged Private Real Estate Capital - We earn management fees from the Managed Private Real Estate Capital clients based on a percentage of average invested capital, as defined in the applicable management agreements. These management fees are payable in cash monthly in arrears.\nFor the fiscal years ended September 30, 2022, 2021 and 2020, we earned aggregate fees from the Managed Private Real Estate Capital clients of $10,102, $4,758 and $2,530, respectively.\nProperty Management Agreements\nWe earn property management fees by providing continuous services pursuant to property management agreements with our clients. We generally earn fees under these agreements equal to 3.0% of gross collected rents. Also, under the terms of the property management agreements, we receive additional fees for construction supervision services in connection with certain construction activities undertaken at certain of the properties up to 5.0% of the cost of such construction.\nThe RMR Group Inc.\nNotes to Consolidated Financial Statements (Continued)\n(dollars in thousands, except per share amounts)\nFor the fiscal years ended September 30, 2022, 2021 and 2020, we earned aggregate property management fees of $59,667, $47,377 and $47,690, respectively, including construction supervision fees of $16,743, $8,476 and $7,940, respectively.\nManagement Agreements with Advisory Clients\nTremont is primarily compensated pursuant to its management agreements with SEVN (beginning January 6, 2021) and TRMT (until September 30, 2021 when it was terminated in connection with the Merger) at an annual rate of 1.5% of equity, as defined in the applicable agreements. Tremont waived any business management fees otherwise due and payable by TRMT pursuant to the management agreement for the period beginning July 1, 2018 until December 31, 2020.\nFor the fiscal years ended September 30, 2022, 2021 and 2020, we earned advisory services revenue of $4,530, $3,956 and $2,911, respectively.\nTremont may also earn an incentive fee under its management agreements with SEVN (beginning the second calendar quarter of 2021) and TRMT (until September 30, 2021) equal to, with respect to each company, the difference between: (a) the product of (i) 20% and (ii) the difference between (A) core earnings, as defined in the applicable agreements, for the most recent 12 month period (or such lesser number of completed calendar quarters, if applicable), including the calendar quarter (or part thereof) for which the calculation of the incentive fee is being made, and (B) the product of (1) equity in the most recent 12 month period (or such lesser number of completed calendar quarters, if applicable), including the calendar quarter (or part thereof) for which the calculation of the incentive fee is being made, and (2) 7% per year and (b) the sum of any incentive fees paid to Tremont with respect to the first three calendar quarters of the most recent 12 month period (or such lesser number of completed calendar quarters preceding the applicable period, if applicable). No incentive fee shall be payable with respect to any calendar quarter unless core earnings for the 12 most recently completed calendar quarters (or such lesser number of completed calendar quarters from January 5, 2021 for SEVN) in the aggregate is greater than zero. The incentive fee may not be less than zero. Tremont waived any incentive fees otherwise due and payable by TRMT pursuant to the management agreement prior to December 31, 2020. For the fiscal years ended September 30, 2022, 2021, 2020, Tremont earned incentive fees of $0, $620 and $0, respectively.\nThe Tremont business earns between 0.5% and 1.0% of the aggregate principal amounts of any loans it brokers. For the fiscal years ended September 30, 2022, 2021 and 2020, the Tremont business earned fees for such brokerage services of $99, $467 and $816, respectively, which amounts are included in management services revenue in our consolidated statements of income.\nReimbursable Costs\nIn accordance with Accounting Standards Update 2014-09, Revenue from Contracts with Customers, which has been codified as ASC Section 606, we determined that we control the services provided by third parties for certain of our clients and therefore account for the cost of these services and the related reimbursement revenue on a gross basis.\nReimbursable Compensation and Benefits - Reimbursable compensation and benefits include reimbursements, at cost, that arise primarily from services our employees provide pursuant to our property management agreements at the properties of our clients. A significant portion of these compensation and benefits are charged or passed through to and paid by tenants of our clients. We recognize the revenue for reimbursements when we incur the related reimbursable compensation and benefits expense on behalf of our clients.\nReimbursable Equity Based Compensation - Reimbursable equity based compensation includes awards of common shares by our clients directly to certain of our officers and employees in connection with the provision of management services to those clients. The revenue in respect of each award is based on the fair value as of the award date for those shares that have vested, with subsequent changes in the fair value of the unvested awards being recognized in our consolidated statements of income over the requisite service periods. We record an equal, offsetting amount as equity based compensation expense for the value of these awards.\nOther Reimbursable Expenses - Other reimbursable expenses include reimbursements that arise from services we provide pursuant to our property management agreements, which include third party costs related to matters such as maintenance and repairs, security and cleaning services, a significant portion of which are charged or passed through to and paid by tenants of our clients.\nThe RMR Group Inc.\nNotes to Consolidated Financial Statements (Continued)\n(dollars in thousands, except per share amounts)\nEquity Method Investments\nSeven Hills Realty Trust\nAs of September 30, 2022, Tremont owned 1,708,058, or approximately 11.6%, of SEVNs outstanding common shares, which includes 882,407 shares purchased by Tremont from Diane Portnoy on May 11, 2022 for $9,469. We account for our investment in SEVN using the equity method of accounting because we are deemed to exert significant influence, but not control, over SEVNs most significant activities.\nWe elected the fair value option to account for our equity method investment in SEVN and determine fair value using the closing price of SEVNs common shares as of the end of the period, which is a Level 1 fair value input. The aggregate market value of our investment in SEVN as of September 30, 2022 and 2021, based on quoted market prices, was $15,577 and $8,513, respectively. The unrealized loss in our consolidated statements of income related to our investment in SEVN was $1,564 for the fiscal year ended September 30, 2022. During the fiscal year ended September 30, 2022, we received distributions from SEVN of $841.\nImmediately prior to the consummation of the Merger, Tremont owned 1,600,100, or approximately 19.3%, of TRMTs then outstanding common shares that were accounted for under the equity method of accounting. Pursuant to the equity method, we recorded our share of earnings from our investment in TRMT in equity in earnings of investees in our consolidated statements of income which totaled $443 and $1,545 for the fiscal years ended September 30, 2021 and 2020, respectively. We received aggregate distributions from TRMT of $1,456 and $736 during the fiscal years ended September 30, 2021 and 2020, respectively. Pursuant to the Merger, each common share of TRMT converted to 0.516 common shares of SEVN. Upon completion of the conversion, we elected the fair value option to account for our equity method investment in the surviving entity, SEVN. As a result, we recorded a gain of $2,059 equal to the difference between the cost basis of our investment in TRMT and the fair value of our investment in SEVN at the time of the Merger.\nTravelCenters of America Inc.\nAs of September 30, 2022, we owned 621,853, or approximately 4.2%, of TAs outstanding common shares. We account for our investment in TA using the equity method of accounting because we are deemed to exert significant influence, but not control, over TAs most significant activities. We elected the fair value option to account for our equity method investment in TA and determine fair value using the closing price of TAs common shares as of the end of the period, which is a Level 1 fair value input. The aggregate market value of our investment in TA at September 30, 2022 and 2021, based on quoted market prices, was $33,537 and $30,963, respectively. The unrealized gain in our consolidated statements of income related to our investment in TA was $2,574, $18,811 and $3,151 for the fiscal years ended September 30, 2022, 2021 and 2020, respectively.\nVariable Interest Entities\nWe regularly evaluate our relationships and investments to determine if they constitute variable interests. A variable interest is an investment or interest that will absorb portions of an entitys expected losses or receive portions of an entitys expected returns. If we determine we have a variable interest in an entity, we evaluate whether such interest is in a variable interest entity, or VIE. Under the VIE model, we would be required to consolidate a VIE we manage if we are determined to be the primary beneficiary of the entity. We continuously assess whether we must consolidate any of the entities we manage. Consideration of factors included, but was not limited to, our representation on the entitys governing body, the size of our investment in each entity compared to the size of the entity and the size of other investors interests, the ability and rights to participate in significant policy making decisions and to replace the manager of those entities. Based on this assessment, we concluded that we are not required to consolidate any of our clients.\nCash and Cash Equivalents\nWe consider highly liquid investments with original maturities of three months or less on the date of purchase to be cash equivalents, the majority of which is held at major commercial banks. Certain cash account balances exceed Federal Deposit Insurance Corporation insurance limits of $250,000 per account and, as a result, there is a concentration of credit risk related to amounts in excess of the insurance limits. We regularly monitor the financial stability of these financial institutions and believe that we are not exposed to any significant credit risk in cash and cash equivalents.\nThe RMR Group Inc.\nNotes to Consolidated Financial Statements (Continued)\n(dollars in thousands, except per share amounts)\nProperty and Equipment\nProperty and equipment are stated at cost. Depreciation of furniture and equipment is computed using the straight line method over estimated useful lives ranging from three to ten years. Depreciation for leasehold improvements is computed using the straight line method over the term of the lesser of their useful lives or related lease agreements. Capitalized software costs are depreciated using the straight line method over useful lives ranging between three and five years.\nThe following is a summary of property and equipment presented in our consolidated balance sheets:\nSeptember 30,\n2022 2021\nFurniture and equipment $ 4,620 $ 4,609\nLeasehold improvements 244 260\nCapitalized software costs 251 284\nTotal property and equipment 5,115 5,153\nAccumulated depreciation (2,620) (2,935)\nProperty and equipment, net $ 2,495 $ 2,218\nDepreciation expense related to property and equipment and capitalized software costs for the fiscal years ended September 30, 2022, 2021 and 2020, was $956, $931 and $922, respectively.\nGoodwill and Intangible Assets\nGoodwill represents the costs of business acquisitions in excess of the fair value of identifiable net assets acquired. We evaluate the recoverability of goodwill annually in the fourth quarter of each fiscal year, or more frequently, if events or changes in circumstances indicate that goodwill might be impaired. If our review indicates that the carrying amount of goodwill exceeds its fair value, we would reduce the carrying amount of goodwill to fair value.\nThe following is a summary of goodwill and intangible assets, net of amortization, presented in our consolidated balance sheets:\nSeptember 30,\n2022 2021\nGoodwill $ 1,859 $ 1,859\nIntangible assets, net of amortization 198 235\nGoodwill and intangible assets, net of amortization $ 2,057 $ 2,094\nEquity-Based Compensation\nThe awards made under our share award plan to our Directors, officers and employees to date, have been shares of Class A common stock of RMR Inc., or Class A Common Shares. Shares issued to Directors vest immediately. Shares issued to our officers and employees vest in five equal, consecutive, annual installments, with the first installment vesting on the date of award. We recognize share forfeitures as they occur. Compensation expense related to share awards is determined based on the market value of our shares on the date of award, with the aggregate value of the awarded shares amortized to expense over the related vesting period. Expense recognized for shares awarded to Directors are included in general and administrative expenses and for shares awarded to employees are included in equity based compensation expenses in our consolidated statements of income.\nOther Assets\nOn June 5, 2015 in connection with the formation of RMR Inc., each of DHC, OPI (then Government Properties Income Trust, or GOV, and Select Income REIT, or SIR) and SVC contributed cash and shares with a combined value of $167,764. The consideration received from such Managed Equity REITs for our Class A Common Shares represented a discount to the fair value of RMR Inc.s Class A Common Shares in the amount of $193,806, which we recorded in other assets. The other assets are being amortized against revenue recognized related to the management agreements using the straight line method through\nThe RMR Group Inc.\nNotes to Consolidated Financial Statements (Continued)\n(dollars in thousands, except per share amounts)\nthe period ended December 31, 2035. For the fiscal years ended September 30, 2022, 2021 and 2020, we reduced revenue by $9,416 each year, related to the amortization of these other assets. As of September 30, 2022, the remaining amount of these other assets to be amortized was $124,895.\nTransaction and Acquisition Related Costs\nTransaction and acquisition related costs include costs related to acquisitions and other strategic transactions. Such costs include legal, accounting, valuation, other professional or consulting fees. Transaction and acquisition related costs are expensed as incurred.\nSegment Reporting\nDuring the fiscal year ended September 30, 2022, we changed our reportable segments to a single reportable segment, which reflects how our chief operating decision maker allocates resources and evaluates our financial results. Because we have a single reportable segment, restated segment information for prior periods has not been presented and all required financial segment information can be found directly in our consolidated financial statements.\nNote 3. Income Taxes\nWe are the sole managing member of RMR LLC. We are a corporation subject to U.S. federal and state income tax with respect to our allocable share of any taxable income of RMR LLC and its tax consolidated subsidiaries. RMR LLC is treated as a partnership for U.S. federal and most applicable state and local income tax purposes. As a partnership, RMR LLC is generally not subject to U.S. federal and most state income taxes. Any taxable income or loss generated by RMR LLC is passed through to and included in the taxable income or loss of its members, including RMR Inc. and ABP Trust, based on each members respective ownership percentage. During the fiscal years ended September 30, 2022, 2021 and 2020, all of our income before taxes was derived solely from domestic operations.\nWe had a provision for income taxes which consists of the following:\nFiscal Year Ended September 30,\n2022 2021 2020\nCurrent:\nFederal $ 8,553 $ 5,820 $ 7,138\nState 3,121 2,103 2,584\nDeferred:\nFederal 1,176 3,834 1,252\nState 383 1,395 578\nTotal $ 13,233 $ 13,152 $ 11,552\nA reconciliation of the statutory income tax rate to the effective tax rate is as follows:\nFiscal Year Ended September 30,\n2022 2021 2020\nIncome taxes computed at the federal statutory rate 21.0 % 21.0 % 21.0 %\nState taxes, net of federal benefit 3.0 % 3.1 % 2.9 %\nPermanent items 0.7 % 0.6 % 1.0 %\nNet income attributable to noncontrolling interest (10.1) % (10.1) % (10.1) %\nOther (1)\n- % (0.6) % - %\nTotal 14.6 % 14.0 % 14.8 %\n(1) In December 2020, the Internal Revenue Service and Department of Treasury released final regulations which, among other clarifications, established the effective date as it relates to limitations on the deductibility of certain executive compensation. The final regulations provide that the application of the limit applies to deductions after December 18, 2020. As such, during the three months ended December 31, 2020, we reduced our provision for income taxes for limitations applied prior to the effective date by $520, or $0.02 per diluted share.\nThe components of the deferred tax assets as of September 30, 2022 and 2021 are entirely comprised of the outside basis difference in our partnership interest in RMR LLC.\nThe RMR Group Inc.\nNotes to Consolidated Financial Statements (Continued)\n(dollars in thousands, except per share amounts)\nASC 740, Income Taxes, provides a model for how a company should recognize, measure and present in its financial statements uncertain tax positions that have been taken or are expected to be taken with respect to all open years and in all significant jurisdictions. Pursuant to this topic, we recognize a tax benefit only if it is more likely than not that a particular tax position will be sustained upon examination or audit. To the extent the more likely than not standard has been satisfied, the benefit associated with a tax position is measured as the largest amount that is greater than 50.0% likely to be realized upon settlement. As of September 30, 2022, 2021 and 2020, we had no uncertain tax positions.\nNote 4. Fair Value of Financial Instruments\nAs of September 30, 2022 and 2021, the fair values of our financial instruments, which include cash and cash equivalents, amounts due from related parties, accounts payable and accrued expenses and reimbursable accounts payable and accrued expenses, were not materially different from their carrying values due to the short term nature of these financial instruments.\nOn a recurring basis, we measure certain financial assets and financial liabilities at fair value based upon quoted market prices. ASC 820, Fair Value Measurements, establishes a fair value hierarchy that prioritizes the inputs to valuation techniques used to measure fair value. The hierarchy gives the highest priority to unadjusted quoted prices in active markets for identical assets and liabilities (Level 1), and the lowest priority to unobservable inputs (Level 3). A financial assets or financial liabilitys fair value measurement level within the fair value hierarchy is based on the lowest level of any input that is significant to the fair value measurement.\nThe following are our assets and liabilities that have been measured at fair value using Level 1 inputs in the fair value hierarchy as of September 30, 2022 and 2021:\nSeptember 30,\n2022 2021\nMoney market funds included in cash and cash equivalents $ 181,219 $ 131,065\nCurrent portion of due from related parties related to share based payment awards 7,516 6,076\nLong term portion of due from related parties related to share based payment awards 14,557 14,331\nEquity method investment in SEVN 15,577 8,513\nEquity method investment in TA 33,537 30,963\nCurrent portion of employer compensation liability related to share based payment awards 7,516 6,076\nLong term portion of employer compensation liability related to share based payment awards 14,557 14,331\nNote 5. Related Person Transactions\nAdam D. Portnoy, the Chair of our Board and one of our Managing Directors, is the sole trustee of our controlling shareholder, ABP Trust, and owns all of ABP Trusts voting securities and a majority of the economic interests of ABP Trust. As of September 30, 2022, Adam D. Portnoy beneficially owned, in aggregate, (i) 185,502 shares of Class A Common Shares; (ii) all the outstanding shares of Class B-1 common stock of RMR Inc., or Class B-1 Common Shares; (iii) all the outstanding shares of Class B-2 common stock of RMR Inc., or Class B-2 Common Shares; and (iv) 15,000,000 Class A Units of RMR LLC. Adam D. Portnoy and Jennifer B. Clark, our other Managing Director, are also officers of ABP Trust and RMR Inc. and officers and employees of RMR LLC. Matthew P. Jordan, our Executive Vice President, Chief Financial Officer and Treasurer, is also an officer of ABP Trust and an officer and employee of RMR LLC.\nAdam D. Portnoy is the chair of the board and a managing trustee or managing director of each of the Managed REITs, ALR and TA, a director of Sonesta (and its parent) and the controlling shareholder of Sonesta (and its parent). Jennifer B. Clark is a managing trustee of OPI, a managing director of ALR, and a director of Sonesta (and its parent), and she previously served as a managing trustee of each of DHC and SEVN until June 3, 2021 and January 5, 2021, respectively. Ms. Clark also serves as the secretary of all our publicly traded clients and Sonesta.\nAs of September 30, 2022, Adam D. Portnoy beneficially owned, in aggregate, 6.2% of ALRs outstanding common shares, 1.1% of SVCs outstanding common shares, 1.2% of ILPTs outstanding common shares, 1.5% of OPIs outstanding common shares, 1.1% of DHCs outstanding common shares, 4.5% of TAs outstanding common shares (including through RMR LLC) and 13.4% of SEVNs outstanding common shares (including through Tremont).\nThe RMR Group Inc.\nNotes to Consolidated Financial Statements (Continued)\n(dollars in thousands, except per share amounts)\nThe Managed REITs have no employees. RMR LLC provides or arranges for all the personnel, overhead and services required for the operation of the Managed Equity REITs pursuant to management agreements with them. All the officers of the Managed Equity REITs and ABP Trust are officers or employees of RMR LLC. All the officers, overhead and required office space of SEVN are provided or arranged by Tremont, and prior to the Merger, Tremont provided or arranged for the officers, overhead and required office space for TRMT. All of SEVNs officers are officers or employees of Tremont or RMR LLC. Many of the executive officers of the Managed Operating Companies are officers or employees of RMR LLC. Some of our executive officers are also managing directors or managing trustees of certain of the Managed REITs and the Managed Operating Companies.\nRevenues from Related Parties\nFor the fiscal years ended September 30, 2022, 2021 and 2020, we recognized revenues from related parties as set forth in the following tables:\nFiscal Year Ended September 30, 2022\nTotal Total\nManagement and Advisory Reimbursable Total\nServices Revenues Costs Revenues\nManaged Public Real Estate Capital: (1)\nDHC $ 30,343 $ 157,770 $ 188,113\nILPT 31,354 33,593 64,947\nOPI 42,204 308,139 350,343\nSVC 44,193 67,844 112,037\nTotal Managed Equity REITs 148,094 567,346 715,440\nSEVN 4,530 5,692 10,222\n152,624 573,038 725,662\nManaged Private Real Estate Capital: (1)\nABP Trust 4,100 25,837 29,937\nOther private entities 13,597 30,883 44,480\n17,697 56,720 74,417\nManaged Operating Companies:\nALR 4,908 309 5,217\nSonesta 8,726 396 9,122\nTA 15,926 2,060 17,986\n29,560 2,765 32,325\nTotal revenues from related parties 199,881 632,523 832,404\nRevenues from unrelated parties 99 - 99\n$ 199,980 $ 632,523 $ 832,503\n(1)On December 23, 2021, DHC sold a 35% equity interest in its existing joint venture with an institutional investor. Following this sale, DHC owned a 20% equity interest in this joint venture. As a result, the management fees earned with respect to this joint venture are characterized as Managed Private Real Estate Capital for periods on and after December 23, 2021 and as Managed Public Real Estate Capital for periods prior to December 23, 2021. On June 29, 2022, DHC sold an additional 10% equity interest in this joint venture. Following this additional sale, DHC owns a 10% equity interest in this joint venture.\nThe RMR Group Inc.\nNotes to Consolidated Financial Statements (Continued)\n(dollars in thousands, except per share amounts)\nFiscal Year Ended September 30, 2021\nTotal Total\nManagement and Advisory Reimbursable Total\nServices Revenues Costs Revenues\nManaged Public Real Estate Capital:\nDHC $ 36,372 $ 135,146 $ 171,518\nILPT 17,745 20,094 37,839\nOPI 37,251 206,351 243,602\nSVC 45,854 33,552 79,406\nTotal Managed Equity REITs 137,222 395,143 532,365\nSEVN 2,798 2,129 4,927\nTRMT (1)\n1,778 3,620 5,398\n141,798 400,892 542,690\nManaged Private Real Estate Capital:\nABP Trust 4,295 23,324 27,619\nOther private entities 3,771 6,006 9,777\n8,066 29,330 37,396\nManaged Operating Companies:\nALR 7,123 368 7,491\nSonesta 4,497 196 4,693\nTA 13,727 774 14,501\n25,347 1,338 26,685\nTotal revenues from related parties 175,211 431,560 606,771\nRevenues from unrelated parties 467 - 467\n$ 175,678 $ 431,560 $ 607,238\n(1)As discussed in Note 1, Organization, TRMT merged with and into SEVN on September 30, 2021, with SEVN continuing as the surviving company. This table presents revenues for the fiscal year ended September 30, 2021, for TRMT separately as they relate to a period prior to the Merger.\nThe RMR Group Inc.\nNotes to Consolidated Financial Statements (Continued)\n(dollars in thousands, except per share amounts)\nFiscal Year Ended September 30, 2020\nTotal Total\nManagement and Advisory Reimbursable Total\nServices Revenues Costs Revenues\nManaged Public Real Estate Capital:\nDHC $ 36,185 $ 138,897 $ 175,082\nILPT 21,473 26,583 48,056\nOPI 37,935 204,282 242,217\nSVC 44,301 17,535 61,836\nTotal Managed Equity REITs 139,894 387,297 527,191\nSEVN 2,767 - 2,767\nTRMT (1)\n144 2,406 2,550\n142,805 389,703 532,508\nManaged Private Real Estate Capital:\nABP Trust 4,639 26,893 31,532\nOther private entities - 213 213\n4,639 27,106 31,745\nManaged Operating Companies:\nALR 8,787 297 9,084\nSonesta 1,505 233 1,738\nTA 13,084 481 13,565\n23,376 1,011 24,387\nTotal revenues from related parties 170,820 417,820 588,640\nRevenues from unrelated parties 857 8 865\n$ 171,677 $ 417,828 $ 589,505\n(1)As discussed in Note 1, Organization, TRMT merged with and into SEVN on September 30, 2021, with SEVN continuing as the surviving company. This table presents revenues for the fiscal year ended September 30, 2020, for TRMT separately as they relate to a period prior to the Merger.\nFor additional information regarding our management or advisory agreements with these related parties, please see Note 2, Summary of Significant Accounting Policies.\nThe RMR Group Inc.\nNotes to Consolidated Financial Statements (Continued)\n(dollars in thousands, except per share amounts)\nAmounts Due From Related Parties\nThe following table represents amounts due from related parties as of the dates indicated:\nSeptember 30,\n2022 2021\nAccounts Reimbursable Accounts Reimbursable\nReceivable Costs Total Receivable Costs Total\nManaged Public Real Estate Capital:\nDHC $ 8,098 $ 14,148 $ 22,246 $ 6,005 $ 17,866 $ 23,871\nILPT 3,235 13,717 16,952 2,934 6,928 9,862\nOPI 335 47,943 48,278 8,625 33,693 42,318\nSVC 5,627 5,357 10,984 5,841 8,992 14,833\nTotal Managed Equity REITs 17,295 81,165 98,460 23,405 67,479 90,884\nSEVN 1,768 1,262 3,030 1,717 1,180 2,897\n19,063 82,427 101,490 25,122 68,659 93,781\nManaged Private Real Estate Capital:\nABP Trust 876 1,653 2,529 1,202 2,678 3,880\nOther private entities 782 5,797 6,579 869 770 1,639\n1,658 7,450 9,108 2,071 3,448 5,519\nManaged Operating Companies:\nALR 112 492 604 136 422 558\nSonesta 127 290 417 17 - 17\nTA 124 11,635 11,759 124 2,993 3,117\n363 12,417 12,780 277 3,415 3,692\n$ 21,084 $ 102,294 $ 123,378 $ 27,470 $ 75,522 $ 102,992\nLeases\nAs of September 30, 2022, we leased from ABP Trust and certain Managed Equity REITs office space for use as our headquarters and local offices. During the fiscal years ended September 30, 2022, 2021 and 2020, we incurred rental expense pursuant to these leases aggregating $5,859, $5,667 and $5,619, respectively. Our related party leases have various termination dates and many have renewal options. Some of our related party leases are terminable on 30 days notice and many allow us to terminate early if our management agreements for the buildings in which we lease space are terminated. For additional information regarding these leases, please see Note 10, Leases.\nTax-Related Payments\nPursuant to our tax receivable agreement with ABP Trust, RMR Inc. pays to ABP Trust 85.0% of the amount of cash savings, if any, in U.S. federal, state and local income tax or franchise tax that RMR Inc. realizes as a result of (a) the increases in tax basis attributable to our dealings with ABP Trust and (b) tax benefits related to imputed interest deemed to be paid by us. as a result of the tax receivable agreement. During the fiscal years ended September 30, 2022, 2021 and 2020, we paid $2,209, $2,158 and $2,111, respectively, to ABP Trust pursuant to the tax receivable agreement. As of September 30, 2022, our consolidated balance sheet reflects a liability related to the tax receivable agreement of $25,583, including $2,275 classified as a current liability in accounts payable and accrued expenses that we expect to pay to ABP Trust during the fourth quarter of fiscal year 2023.\nThe RMR Group Inc.\nNotes to Consolidated Financial Statements (Continued)\n(dollars in thousands, except per share amounts)\nUnder the RMR LLC operating agreement, RMR LLC is also required to make certain pro rata distributions to each member of RMR LLC quarterly on the basis of the estimated tax liabilities of its members, subject to future adjustment based on actual results. For the fiscal years ended September 30, 2022, 2021 and 2020, pursuant to the RMR LLC operating agreement, RMR LLC made required quarterly tax distributions to holders of its membership units totaling $30,281, $31,469 and $31,545, respectively, of which $15,940, $16,764 and $16,606, respectively, was distributed to us and $14,341, $14,705 and $14,939, respectively, was distributed to ABP Trust, based on each membership unit holders respective ownership percentage. The amounts distributed to us were eliminated in our consolidated financial statements, and the amounts distributed to ABP Trust were recorded as a reduction of its noncontrolling interest. We used funds from these distributions to pay certain of our U.S. federal and state income tax liabilities and to pay part of our obligations under the tax receivable agreement.\nRegistration and Lock-up Agreements\nThe following registration rights and lock-up agreements are in effect:\nABP Trust Registration Rights Agreement. RMR Inc. is party to a registration rights agreement with ABP Trust pursuant to which RMR Inc. has granted ABP Trust demand and piggyback registration rights, subject to certain limitations, covering the Class A Common Shares ABP Trust owns, including the shares received on conversion of Class B-1 Common Shares or redemption of the paired Class B-2 Common Shares and Class A Units of RMR LLC.\nFounders Registration Rights and Lock-Up Agreements. Adam D. Portnoy and ABP Trust are parties to a registration rights and lock-up agreement with each of DHC, OPI and SVC with respect to each such Managed Equity REITs common shares pursuant to which ABP Trust and Adam D. Portnoy agreed not to transfer the Managed Equity REITs common shares they acquired in connection with RMR LLCs reorganization in June 2015 for a period of ten years, subject to certain exceptions, and each of those Managed Equity REITs has granted ABP Trust and Adam D. Portnoy demand and piggyback registration rights, subject to certain limitations.\nRegistration Rights and Lock-Up Agreement with ALR. Adam D. Portnoy and ABP Trust are parties to a registration rights and lock-up agreement with ALR with respect to ALRs common stock pursuant to which ABP Trust and Adam D. Portnoy agreed not to transfer the ALR common stock they acquired in 2016 for a period of ten years, subject to certain exceptions, and ALR has granted ABP Trust and Adam D. Portnoy demand and piggyback registration rights, subject to certain limitations.\nIn addition, in connection with a capital market transaction that we or any of our clients may engage in from time-to-time, we or other clients and our and their related parties may enter into customary lock up agreements with the underwriters for that capital transaction with respect to the shares that we or the other clients may own of the issuer in that capital market transaction.\nSeparation Arrangements\nWe entered into retirement agreements with certain of our former executive officers. Pursuant to these agreements, we made various cash payments and accelerated the vesting of unvested shares RMR Inc. previously awarded to these retiring officers. We also enter into separation arrangements from time to time with other nonexecutive officers and employees of ours. All costs associated with separation arrangements, for which there remain no substantive performance obligations, are recorded in our consolidated statements of income as separation costs.\nIn October 2020, we entered into a retirement agreement with David M. Blackman, a former Executive Vice President of RMR LLC. Under Mr. Blackmans retirement agreement, RMR LLC paid combined cash payments in the amount of $2,850 to Mr. Blackman and $50 in related taxes. In addition, our Compensation Committee approved the acceleration of all 9,400 unvested shares owned by Mr. Blackman of us as of his retirement date, June 30, 2021.\nThe RMR Group Inc.\nNotes to Consolidated Financial Statements (Continued)\n(dollars in thousands, except per share amounts)\nFor the fiscal years ended September 30, 2022, 2021 and 2020, we recognized cash and equity based separation costs as set forth in the following table:\nFiscal Year Ended September 30,\n2022 2021 2020\nFormer executive officers:\nCash separation costs $ - $ 2,900 $ 260\nEquity based separation costs - 295 281\n- 3,195 541\nFormer nonexecutive officers and other:\nCash separation costs (1)\n1,152 1,142 1,316\nEquity based separation costs 163 188 24\n1,315 1,330 1,340\nTotal separation costs $ 1,315 $ 4,525 $ 1,881\n(1)During the fiscal year ended September 30, 2021, we were indemnified for a withdrawal liability of $515 that we had recorded during the fiscal year ended September 30, 2020 related to a prior clients shared pension plan accounted for as a multiemployer benefit plan.\nOther\nThe Managed REITs, ALR and TA award common shares directly to certain of our officers and employees in connection with the provision of services to those companies. For a description of the accounting implications to us of these share awards, please see Note 2, Summary of Significant Accounting Policies and Note 6, Shareholders Equity.\nThe compensation of senior executives of the Managed Operating Companies, who are also employees or officers of RMR LLC, is the sole responsibility of the party to or on behalf of which the individual renders services. In the past, because at least 80.0% of each of these executives business time was devoted to services to the Managed Operating Company, 80.0% of their total cash compensation was paid by the Managed Operating Companies and the remainder was paid by RMR LLC.\nNote 6. Shareholders Equity\nCommon Shares\nClass A Common Shares-Class A Common Shares entitle holders to one vote for each share held of record on all matters submitted to a vote of shareholders.\nClass B-1 Common Shares-Class B-1 Common Shares entitle holders to ten votes for each share on all matters submitted to a vote of shareholders. Each Class B-1 Common Share may, at the option of its holder, be converted into a Class A Common Share, on a one for one basis.\nClass B-2 Common Shares-ABP Trust owns 15,000,000 Class B-2 Common Shares, which are paired with the 15,000,000 RMR LLC Class A Units and have no independent economic interest in RMR Inc. The Class A Units may, at the option of the holder, be redeemed for Class A Common Shares on a one to one basis, and upon such redemption our Class B-2 Common Shares that are paired with the Class A Units are automatically canceled. RMR Inc. has the option to settle the redemption in cash. Each Class B-2 Common Share entitles the holder to ten votes per share, and, accordingly, the issuance of additional Class B-2 Common Shares would have a significant dilutive effect on the voting power of the then current holders of our Class A Common Shares.\nExcept as otherwise required in the charter or by applicable law, all holders of Class A Common Shares, Class B-1 Common Shares, and Class B-2 Common Shares shall vote together as a single class on all matters on which shareholders are generally entitled to vote. The holders of a class of common shares shall each be entitled to vote separately as a single class with respect to (and only with respect to) amendments to the charter that alter or change the powers or rights of the shares of such class of common shares so as to affect them materially and adversely; provided, however, if such amendments affect all holders of common shares materially and adversely in the same manner, the separate voting requirement shall not be applicable and all holders of common shares shall vote together as a single class.\nThe RMR Group Inc.\nNotes to Consolidated Financial Statements (Continued)\n(dollars in thousands, except per share amounts)\nIssuances and Repurchases\nWe award our Class A Common Shares to our officers and employees under the Amended and Restated 2016 Omnibus Equity Plan, or the 2016 Plan. In addition, each of our Directors receives Class A Common Shares under the 2016 Plan as part of his or her annual compensation for serving as a Director. During the fiscal years ended September 30, 2022, 2021 and 2020, we awarded to our Managing Directors, in their capacities as our officers and employees, and to certain of our other officers and employees, an aggregate of 125,700, 96,300 and 93,700, respectively, of our Class A Common Shares. We also awarded to each of our Managing Directors and Independent Directors, 3,000 of our Class A Common Shares during each of the fiscal years ended September 30, 2022, 2021 and 2020, as part of his or her annual compensation for serving as a Director.\nThe Class A Common Shares awarded to our Independent Directors and Managing Directors, in their capacities as Directors, vest immediately and are included in general and administrative expense in our consolidated statements of income. The Class A Common Shares awarded to our Managing Directors, in their capacities as our officers and employees, and to our other officers and employees vest in five equal, consecutive, annual installments beginning on the date of the award and are included in equity based compensation expense in our consolidated statements of income. We recognize forfeitures as they occur. During the fiscal years ended September 30, 2022, 2021 and 2020, we recognized forfeitures of $55, $22 and $49, respectively. During the fiscal years ended September 30, 2022, 2021 and 2020, we recorded general and administrative expenses of $547, $771 and $564, respectively, and equity based compensation expenses of $3,064, $2,868 and $2,916, respectively, related to awards we made under the 2016 Plan.\nIn connection with the vesting and issuance of awards of our Class A Common Shares to our Directors, officers and employees, we provide for the ability to repurchase our Class A Common Shares to satisfy tax withholding and payment obligations. The repurchase price is based on the closing price of our Class A Common Shares on The Nasdaq Stock Market LLC, or Nasdaq. The aggregate value of Class A Common Shares repurchased during the fiscal years ended September 30, 2022, 2021 and 2020, was $547, $834 and $523, respectively, which is recorded as a decrease to additional paid in capital within shareholders equity in our consolidated balance sheets.\nIn connection with the issuances and repurchases of our Class A Common Shares, and as required by the RMR LLC operating agreement, RMR LLC concurrently issues or acquires an identical number of Class A Units from RMR Inc.\nA summary of shares awarded and vested, including shares withheld, repurchased or forfeited, under the terms of the 2016 Plan for the fiscal years ended September 30, 2022, 2021 and 2020 is as follows:\n2022 2021 2020\nWeighted Weighted Weighted\nNumber Average Number Average Number Average\nof Award Date of Award Date of Award Date\nShares Fair Value Shares Fair Value Shares Fair Value\nUnvested shares, beginning of year 160,310 $ 37.36 143,990 $ 44.10 126,160 $ 59.38\nShares awarded 143,700 $ 26.82 114,300 $ 35.23 111,700 $ 30.04\nVested shares withheld and repurchased (20,911) $ 26.15 (24,125) $ 34.57 (17,539) $ 29.83\nShares vested (78,449) $ 26.85 (73,275) $ 36.13 (75,101) $ 39.18\nShares forfeited (1,910) $ 28.96 (580) $ 37.65 (1,230) $ 40.08\nUnvested shares, end of year 202,740 $ 30.14 160,310 $ 37.36 143,990 $ 44.10\nThe 202,740 unvested shares as of September 30, 2022 are scheduled to vest as follows: 72,740 shares in 2023, 60,820 shares in 2024, 44,040 shares in 2025 and 25,140 shares in 2026. As of September 30, 2022, the estimated future compensation expense for the unvested shares was $6,110 based on the award date fair value of these shares. The weighted average period over which this compensation expense will be recorded is approximately 25 months.\nAt our annual meeting of shareholders held on March 10, 2022, our shareholders approved the 2016 Plan, which amended and restated our prior equity plan to increase the total number of Class A Common Shares available for award by 350,000. At September 30, 2022, 343,885 of our Class A Common Shares remained available for award under the 2016 Plan.\nThe RMR Group Inc.\nNotes to Consolidated Financial Statements (Continued)\n(dollars in thousands, except per share amounts)\nDistributions\nDuring the fiscal years ended September 30, 2022, 2021 and 2020, we declared and paid dividends on our Class A Common Shares and Class B-1 Common Shares as follows:\nDeclaration Record Paid Distributions Total\nDate Date Date Per Common Share Distributions\nFiscal Year Ended September 30, 2022\n10/14/2021 10/25/2021 11/18/2021 $ 0.38 $ 6,264\n1/13/2022 1/24/2022 2/17/2022 0.38 6,265\n4/14/2022 4/25/2022 5/19/2022 0.40 6,601\n7/14/2022 7/25/2022 8/18/2022 0.40 6,600\n$ 1.56 $ 25,730\nFiscal Year Ended September 30, 2021\n10/15/2020 10/26/2020 11/19/2020 $ 0.38 $ 6,230\n1/14/2021 1/25/2021 2/18/2021 0.38 6,230\n4/15/2021 4/26/2021 5/20/2021 0.38 6,237\n7/15/2021 7/26/2021 8/19/2021 0.38 6,235\n8/25/2021 9/6/2021 9/16/2021 7.00 114,851\n$ 8.52 $ 139,783\nFiscal Year Ended September 30, 2020\n10/17/2019 10/28/2019 11/14/2019 $ 0.38 $ 6,195\n1/16/2020 1/27/2020 2/20/2020 0.38 6,194\n4/16/2020 4/27/2020 5/21/2020 0.38 6,200\n7/16/2020 7/27/2020 8/20/2020 0.38 6,200\n$ 1.52 $ 24,789\nThe RMR Group Inc.\nNotes to Consolidated Financial Statements (Continued)\n(dollars in thousands, except per share amounts)\nThese dividends were funded in part by distributions from RMR LLC to holders of its membership units as follows:\nDistributions Per Total RMR LLC RMR LLC\nDeclaration Record Paid RMR LLC RMR LLC Distributions Distributions\nDate Date Date Membership Unit Distributions to RMR Inc. to ABP Trust\nFiscal Year Ended September 30, 2022\n10/14/2021 10/25/2021 11/18/2021 $ 0.30 $ 9,446 $ 4,946 $ 4,500\n1/13/2022 1/24/2022 2/17/2022 0.30 9,446 4,946 4,500\n4/14/2022 4/25/2022 5/19/2022 0.32 10,080 5,280 4,800\n7/14/2022 7/25/2022 8/18/2022 0.32 10,080 5,280 4,800\n$ 1.24 $ 39,052 $ 20,452 $ 18,600\nFiscal Year Ended September 30, 2021\n10/15/2020 10/26/2020 11/19/2020 $ 0.30 $ 9,419 $ 4,919 $ 4,500\n1/14/2021 1/25/2021 2/18/2021 0.30 9,419 4,919 4,500\n4/15/2021 4/26/2021 5/20/2021 0.30 9,424 4,924 4,500\n7/15/2021 7/26/2021 8/19/2021 0.30 9,422 4,922 4,500\n8/25/2021 9/6/2021 9/16/2021 7.00 219,851 114,851 105,000\n$ 8.20 $ 257,535 $ 134,535 $ 123,000\nFiscal Year Ended September 30, 2020\n10/17/2019 10/28/2019 11/14/2019 $ 0.30 $ 9,391 $ 4,891 $ 4,500\n1/16/2020 1/27/2020 2/20/2020 0.30 9,390 4,890 4,500\n4/16/2020 4/27/2020 5/21/2020 0.30 9,394 4,894 4,500\n7/16/2020 7/27/2020 8/20/2020 0.30 9,395 4,895 4,500\n$ 1.20 $ 37,570 $ 19,570 $ 18,000\nThe remainder of the dividends noted above were funded with cash accumulated at RMR Inc.\nOn October 13, 2022, we declared a quarterly dividend on our Class A Common Shares and Class B-1 Common Shares to our shareholders of record as of October 24, 2022, in the amount of $0.40 per Class A Common Share and Class B-1 Common Share, or $6,642. This dividend will be partially funded by a distribution from RMR LLC to holders of its membership units in the amount of $0.32 per unit, or $10,114, of which $5,314 will be distributed to us based on our aggregate ownership of 16,605,741 membership units of RMR LLC and $4,800 will be distributed to ABP Trust based on its ownership of 15,000,000 membership units of RMR LLC. The remainder of this dividend will be funded with cash accumulated at RMR Inc. We expect to pay this dividend on or about November 17, 2022.\nNote 7. Per Common Share Amounts\nWe calculate basic earnings per share using the two-class method. Unvested Class A Common Shares awarded to our employees are deemed participating securities for purposes of calculating basic earnings per common share because they have dividend rights. Under the two-class method, we allocate earnings proportionately to vested Class A Common Shares and Class B-1 Common Shares outstanding and unvested Class A Common Shares outstanding for the period. Accordingly, earnings attributable to unvested Class A Common Shares are excluded from basic earnings per share under the two-class method. Our Class B-2 Common Shares, which are paired with ABP Trusts Class A Units, have no independent economic interest in RMR Inc. and thus are not included as common shares outstanding for purposes of calculating basic earnings per common share.\nDiluted earnings per common share is calculated using the treasury stock method for unvested Class A Common Shares and the if-converted method for Class B-2 Common Shares. The 15,000,000 Class A Units that we do not own may be redeemed for our Class A Common Shares on a one-for-one basis, or upon such redemption, we may elect to pay cash instead of issuing Class A Common Shares. Upon redemption of a Class A Unit, the Class B-2 Common Share paired with such unit is canceled for no additional consideration. In computing the dilutive effect, if any, that the aforementioned redemption would have on earnings per share, we considered that net income available to holders of our Class A Common Shares would increase due to elimination of the noncontrolling interest offset by any tax effect, which may be dilutive. For the fiscal years ended September 30, 2022, 2021 and 2020, the assumed redemption is dilutive to earnings per share as presented in the table below.\nThe RMR Group Inc.\nNotes to Consolidated Financial Statements (Continued)\n(dollars in thousands, except per share amounts)\nThe calculation of basic and diluted earnings per share for the fiscal years ended September 30, 2022, 2021 and 2020, is as follows:\nFiscal Year Ended September 30,\n2022 2021 2020\nNumerators:\nNet income attributable to The RMR Group Inc. $ 34,004 $ 35,696 $ 28,792\nLess: income attributable to unvested participating securities (329) (309) (209)\nNet income attributable to The RMR Group Inc. used in calculating basic EPS\n33,675 35,387 28,583\nEffect of dilutive securities:\nAdd back: income attributable to unvested participating securities 329 309 -\nAdd back: net income attributable to noncontrolling interest\n43,464 45,317 37,541\nAdd back: income tax expense\n13,233 13,152 11,552\nLess: income tax expense assuming redemption of noncontrolling interests Class A Units for Class A Common Shares (1)\n(26,732) (27,061) (23,183)\nNet income used in calculating diluted EPS $ 63,969 $ 67,104 $ 54,493\nDenominators:\nCommon shares outstanding 16,606 16,485 16,396\nLess: unvested participating securities (268) (219) (202)\nWeighted average common shares outstanding - basic\n16,338 16,266 16,194\nEffect of dilutive securities:\nAdd: assumed redemption of noncontrolling interests Class A Units for Class A Common Shares 15,000 15,000 15,000\nAdd: incremental unvested shares 10 16 -\nWeighted average common shares outstanding - diluted\n31,348 31,282 31,194\nNet income attributable to The RMR Group Inc. per common share - basic\n$ 2.06 $ 2.18 $ 1.77\nNet income attributable to The RMR Group Inc. per common share - diluted\n$ 2.04 $ 2.15 $ 1.75\n(1)Income tax expense assumes the hypothetical conversion of the noncontrolling interest, which results in estimated tax rates of 29.5%, 28.7% and 29.8% for the fiscal years ended September 30, 2022, 2021 and 2020, respectively.\nNote 8. Net Income Attributable to RMR Inc.\nNet income attributable to RMR Inc. for the fiscal years ended September 30, 2022, 2021 and 2020, is calculated as follows:\nFiscal Year Ended September 30,\n2022 2021 2020\nIncome before income tax expense $ 90,701 $ 94,165 $ 77,885\nRMR Inc. franchise tax expense and interest income 568 763 481\nNet income before noncontrolling interest 91,269 94,928 78,366\nNet income attributable to noncontrolling interest (43,464) (45,317) (37,541)\nNet income attributable to RMR Inc. before income tax expense 47,805 49,611 40,825\nIncome tax expense attributable to RMR Inc. (13,233) (13,152) (11,552)\nRMR Inc. franchise tax expense and interest income (568) (763) (481)\nNet income attributable to RMR Inc. $ 34,004 $ 35,696 $ 28,792\nThe RMR Group Inc.\nNotes to Consolidated Financial Statements (Continued)\n(dollars in thousands, except per share amounts)\nNote 9. Employee Benefits\nWe have established a defined contribution savings plan for eligible employees under the provisions of U.S. Internal Revenue Code Section 401(k) whereby we contribute 100.0% of the first 3.0% and 50.0% of the next 2.0% of an employees cash compensation contributed to the plan up to stated maximums. All employees are eligible to participate in the plan and are entitled, upon termination or retirement, to receive their vested portion of the plan assets. Employees contributions and our related matching contributions are fully vested when made. Our plan contributions and expenses for the fiscal years ended September 30, 2022, 2021 and 2020, were $2,726, $2,633 and $2,603, respectively.\nNote 10. Leases\nWe enter into operating leases, as the lessee, for office space and vehicles and determine if an arrangement is a lease at inception of the arrangement. Operating lease liabilities and right of use assets are recognized on our consolidated balance sheet for leases with an initial term greater than 12 months based on the present value of the future minimum lease payments over the lease term using our estimated incremental borrowing rate. Operating lease expense associated with minimum lease payments is recognized on a straight-line basis over the lease term. When additional payments are based on usage or vary based on other factors, they are expensed when incurred as variable lease expense. Certain leases include lease and non-lease components, which we account for as a single lease component. Minimum lease payments for leases with an initial term of 12 months or less are not recorded on our consolidated balance sheet. As of September 30, 2022, we had 35 leases that expire at various dates through 2031, with a weighted average remaining lease term of 7.2 years and a weighted average discount rate of 3.1%.\nFor the fiscal years ended September 30, 2022, 2021 and 2020, the components of operating lease costs were as follows:\nFiscal Year Ended September 30,\n2022 2021 2020\nFixed rent expense (1)\n$ 6,144 $ 5,757 $ 5,620\nVariable lease payments 1,001 727 660\nTotal cash portion of rent expense 7,145 6,484 6,280\nNon-cash straight line rent expense (352) 3 154\nTotal operating lease costs $ 6,793 $ 6,487 $ 6,434\n(1)Includes expense for leases with an initial term of 12 months or less of $83, $138 and $68 for the fiscal years ended September 30, 2022, 2021 and 2020, respectively.\nThe following table presents the undiscounted cash flows on an annual fiscal year basis for our operating lease liabilities as of September 30, 2022:\nFiscal Year Amount\n2023 $ 5,570\n2024 5,141\n2025 4,767\n2026 4,099\n2027 3,862\nThereafter 10,438\nTotal lease payments (1)\n33,877\nLess: imputed interest (3,558)\nPresent value of operating lease liabilities 30,319\nLess: current portion of operating lease liabilities (4,693)\nOperating lease liabilities, net of current portion $ 25,626\n(1) Excludes $637 of lease payments for signed leases that have not yet commenced.\nAs of September 30, 2022, $29,534 of total lease payments and $3,315 of imputed interest are for our principal executive offices, which are leased from an affiliate of ABP Trust pursuant to a lease agreement that expires in 2030.\nSIGNATURES\nPursuant to the requirements of Section 13 and 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nTHE RMR GROUP INC.\nBy: /s/ Adam D. Portnoy\nAdam D. Portnoy\nManaging Director, President and Chief Executive Officer\nDated: November 14, 2022\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature Title Date\n/s/ Adam D. Portnoy Managing Director, President and Chief Executive Officer November 14, 2022\nAdam D. Portnoy (principal executive officer)\n/s/ Matthew P. Jordan Executive Vice President, Chief Financial Officer and Treasurer November 14, 2022\nMatthew P. Jordan (principal financial officer and principal accounting officer)\n/s/ Jennifer B. Clark Managing Director, Executive Vice President, General Counsel November 14, 2022\nJennifer B. Clark and Secretary\n/s/ Ann Logan Independent Director November 14, 2022\nAnn Logan\n/s/ Rosen Plevneliev Independent Director November 14, 2022\nRosen Plevneliev\n/s/ Jonathan Veitch Independent Director November 14, 2022\nJonathan Veitch\n/s/ Walter C. Watkins, Jr. Independent Director November 14, 2022\nWalter C. Watkins, Jr."
}