{
    "cik": "1650739",
    "company": "Ajia Innogroup Holdings, Ltd.",
    "filing_type": "10-K",
    "filing_date": "2022-10-13",
    "period_of_report": "2022-06-30",
    "sic": "7200",
    "state_of_inc": "NV",
    "state_location": "NV",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1650739/0001477932-22-007608-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1650739/000147793222007608/ajia_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1650739/0001477932-22-007608.txt",
    "filename": "1650739_10K_2022_0001477932-22-007608.htm",
    "content": "Item 1. Business\nDoing Business in China and Hong Kong Corporate Overview\nAjia Innogroup Holdings Ltd. is a Nevada holding company that conducts all of its operations and operates its business in the Peoples Republic of China (PRC) and Hong Kong, through its subsidiaries, in particular, (collectively the Operating Subsidiaries). Investors in our ordinary shares should be aware that they are not permitted to directly hold equity interests in the Chinese operating entities. Investors can only purchase equity solely Ajia Innogroup Holdings Ltd. which owns the majority equity interests in our Operating Subsidiaries.\nBecause of our corporate structure, we as well as the investors are subject to unique risks due to uncertainty of the interpretation and the application of the PRC laws and regulations. We are also subject to the risks of uncertainty about any future actions of the PRC government in this regard. We may also be subject to sanctions imposed by PRC regulatory agencies including the Chinese Securities Regulatory Commission (CSRC) if we fail to comply with their rules and regulations. The Chinese regulatory authorities could disallow our operating structure in the future, and this would likely result in a material change in our financial performance, our results of operations, our actual operations in China, and/or the value of our ordinary shares, which could cause the value of such securities to significantly decline or become worthless.\nWe face various legal and operational risks and uncertainties related to having all of our operations in China. The PRC government has significant authority to exert influence on the ability of a China-based company, such as us, to conduct its business, accept foreign investments, or list on U.S. or other foreign exchanges. For example, we may face risks associated with regulatory approvals of offshore offerings, anti-monopoly regulatory actions, as well as oversight on cybersecurity and data privacy. Such risks could result in a material change in our operations and/or the value of our ordinary shares or could significantly limit or completely hinder our ability to offer or continue to offer our ordinary shares and/or other securities to investors and cause the value of such securities to significantly decline or be worthless.\nThe Chinese government has exercised and continues to exercise substantial control over virtually every sector of the Chinese economy through regulation and state ownership. Our ability to operate in China may be harmed by changes in its laws and regulations, including those relating to securities regulation, data protection, cybersecurity and mergers and acquisitions and other matters. The central or local governments of these jurisdictions may impose new, stricter regulations or interpretations of existing regulations with little advance notice that would require additional expenditures and efforts on our part to ensure our compliance with such regulations or interpretations. Government actions in the future could significantly affect economic conditions in China or particular regions thereof and could require us to materially change our operating activities or divest ourselves of any interests we hold in Chinese assets. Our business may be subject to various government and regulatory interference. We may incur increased costs necessary to comply with existing and newly adopted laws and regulations or penalties for any failure to comply. Our operations could be adversely affected, directly or indirectly, by existing or future laws and regulations relating to our business or industry.\nGiven recent statements by the Chinese government indicating an intent to exert more oversight and control over offerings that are conducted overseas and/or foreign investment in China-based issuers, any such action could significantly limit or completely hinder our ability to offer or continue to offer securities to investors and cause the value of such securities to significantly decline or become worthless.\nAdditionally, more stringent criteria have been imposed by the SEC and the PCAOB, recently, our securities may be prohibited from trading if our auditor cannot be fully inspected. As of the date of the report, J&S Associate, our auditor, is not subject to the determinations as to the inability to inspect or investigate registered firms completely announced by the PCAOB on December 16, 2021. The recent joint statement by the SEC and PCAOB, proposed rule changes submitted by Nasdaq, and the Holding Foreign Companies Accountable Act all call for additional and more stringent criteria to be applied to emerging market companies upon assessing the qualification of their auditors, especially the non-U.S. auditors who are not inspected by the PCAOB. These developments could add uncertainties to our offering.\nAs of September 2022, we have disposed of our operation in the PRC, and operate primarily from our Hong Kong based subsidiaries. Current PRC regulations permit our PRC Subsidiaries to pay dividends to us through our subsidiaries in Hong Kong, only out of their accumulated profits, if any, determined in accordance with Chinese accounting standards and regulations. In addition, each of our PRC Subsidiaries is required to set aside at least 10% of its after-tax profits each year, if any, to fund a statutory reserve until such reserve reaches 50% of its registered capital. As of the date hereof, we have had no transactions that involved the transfer of cash or assets throughout our corporate structure since at least July 1, 2020. The PRC Subsidiaries have not transferred cash or other assets to the Company, including by way of dividends. The Company does not currently plan or anticipate transferring cash or other assets from our operations in China to any non-Chinese entity. As of the date hereof, no transfers, dividends, or distributions have been made to our U.S. investors.\nFor a detailed description of risks related to doing business in China, see Risk Factors - Risks Related to Doing Business in China.\nCorporate Background- Business Development\nAjia Innogroup Holdings, Limited. (the Company) was incorporated in the State of Nevada on March 19, 2014, and our fiscal year end is June 30. The Companys administrative address is 187 E. Warm Springs Road, Suite B307, Las Vegas, Nevada 89119. The telephone number is: (702) 833-9872\nThe Company had intended to provide a website and mobile app to assist event planners in locating performers, bands and speakers, booking locations and planning events in areas around the United States and Canada. However, The Company changed its business plan in 2017 and pursued the business of self-help photo kiosks to be implemented at major convenient locations, such as shopping mall, buildings near subway stations, etc. to attract customers to use the service.\nIn September 2017, the Company began exploring a business plan for a sales system for food and beverage products also sometimes referred to as a catering integration system. The system consists of a website and app which offers menu and ordering systems for end users, which predominantly consists of restaurants and food vendors. We generate revenue from the licensing of our sales system and we provide all necessary training to restaurant staff, system maintenance and updates. In addition, the Company provides system development consulting and training services.\nOn November 24, 2017, the Board of Directors (the Board) accepted the resignation of Ms. Yin Ling (Elaine) Wan as Chief Executive and Chief Financial Officer of the Company. At the same time, the Board elected the following individuals to the following positions: Mr. Zhi Qiang Liang was elected as President, Chief Executive Officer and Director of the Company; Mr. Wai Hing (Samuel) Lai was elected as Chief Financial Officer of the Company; Shun Ching (Dickson) Wong was elected as a Director and a Member of the Audit Committee of the Company; Ms. Sin Kei Stella Hui was elected as a Director and a Member of the Audit Committee; Ms. Kiu Chung Jacqueline Tang was elected as Chief Operating Officer of the Company; Mr. Jeffrey Firestone was elected as Director and Vice President of Investor Relations of the Company; Dr. Kwai Lam (Terence) Wong was elected as Vice President of Investor Relations and Yin Ling (Elaine) Wan was elected as Director, Secretary and Treasurer.\nOn December 1, 2017, the Company acquired a ten percent (10%) ownership interest in a collection code project (Project), the purpose of which is to improve the marketability and market penetration of Alipay Network Technology Co., Ltd. (Alipay) collection code system. As a part of the agreement, the Company will share 10% of expenses and profit on the Project.\nEffective February 9, 2018, the Board accepted the resignation of Jeffrey S. Firestone from his position as Vice President and director of the Company.\nOn April 25, 2018, the Company announced that its wholly owned subsidiary, Guangzhou Shengjia Trading Co., Ltd. of Guangzhou, China (Shengjia) has entered into an agreement with Guangzhou Renhai Network Technology Co., Ltd. (Renhai) in which Shengjia would replace its 10% interest in the Alipay payment code business development project (Alipay Project), with a 30% interest of Renhais new China Mobile project. Renhai has recently reached an agreement with China Mobile Communications Corporation (China Mobile) whereby Renhai and China Mobile are to sign an agreement appointing Renhai as one of China Mobiles marketers in promoting China Mobiles business products for the period from April 1, 2018 to September 30, 2018. Renhais China Mobile agreement will be extended once certain business targets are fulfilled.\nNevertheless, even with the above remedies, the returns from the projects are still not satisfied by the Companys management and are far below the estimations made from Renhai to the Company. In this regard, on December 28, 2018, both parties agreed that the agreements between Shengia and Renhai are rescinded and voided. Renhai shall return the Companys 3,000,000 shares to the Company for cancellation and the Company shall return all the incomes previously received from Renhai. The Company cancelled these 3,000,000 shares of common stock on December 28, 2018.\nOn July 28, 2018, the Company issued a convertible promissory note in the amount of $300,000.00 to Full Yick International Ltd. Pursuant to the terms the convertible promissory note was convertible into 93,750,000 common shares of the Company at $0.0032 per share on July 31, 2019. On or about August 9, 2019, Full Yick International Ltd. exercised their option to convert the $300,000.00 note into 93,750,000 common shares of the Company, which constitutes approximately 92.8% of the issued and outstanding common shares of the Company and instructed the Company to issue the shares to approximately 84 shareholders. Of those approximately 84 shareholders, the largest, Full Yick International, Ltd. holds 12,038,723 shares, or approximately 11.9% of the issued and outstanding shares of the Company. There are no arrangements between the members of the former and new control groups and their associates with respect to election of directors or other matters.\nOn September 20, 2019, Mr. Kin Chung (Ken) Tam was appointed as members of the Board of Directors (the Board) of the Companys Executive directors. Mr. Hung Hin Samuel Leung and Mr. Kwok Fai (Thomas) Yip were appointed as members of the Board of the Companys Independent and Non-executive directors - Audit committee. On September 20, 2019, Ms. Sin Kei Stella Hui and Mr. Shun Ching (Dickson) Wong were resigned from the member of the Board of the Company.\nOn March 30, 2020, Splendor Radiant Limited, a wholly-owned subsidiary of the Company entered into a Memorandum of Understanding (MOU) with Allied Precision Medicine Consultants Limited (Allied), a Hong Kong corporation, in which the Parties have committed to jointly promote stem cell products and services in Hong Kong and Macau. Ajia has initially issued 100,000 shares of its common stock to Allied to acquire 50% sharing of the profits in this project. The Board shall then appoint an independent third party to carry out due diligence and valuation of the project and, based upon the recommendation of this valuation report, the Board shall issue additional common shares of Ajia to Allied as fair consideration and compensation to acquire 50% profit sharing interest in the project. The project has not yet commenced.\nOn September 28, 2020, Mr. Kwok Fai YIP, Thomas (Mr. Yip) was resigned from a member of our Board of Directors of the Companys Independent and Non-executive directors - Audit committee. Concurrently, Mr. Yip was appointed as the Companys Executive Director and Vice Chairman. Mr. Yips position as the Companys Independent and non-executive director was immediately replaced by Ms. Kiu Chung Jacqueline Tang (Ms. Tang) who was formerly engaged as the Companys Chief Operating Officer (COO). Ms. Tang resigned from the position of COO concurrently with this appointment.\nOn November 17, 2020, subsequent to our year end, Mr. Zhi Qiang Liang resigned as Chief Executive Officer and Mr. Yip was appointed as Chief Executive Officer.\nIn October 16, 2020, Splendor Radiant Limited entered into a joint venture agreement with its strategic partner, Mr. Tsz Man (Eric) Ngan. Both parties agreed to establish a joint venture relationship in order to collaborate to form a company, Ajia Corporate Systems Architecture Solution Limited (ACSA) which Splendor Radiant own 51% of the shares. ACSA has planned to acquire or become business partner in insurance and finance industries, which includes licensed insurance brokerage, trust servicing consulting team and licensed money lender in Hong Kong. ACSA has owned 51% of Tangent Asia Pacific Finance Ltd (TAPF), licensed money lender in Hong Kong and willing to develop money lending in Hong Kong and global. TAPF is focusing on the money lending business on second mortgage on property market and lending on crypto assets as collateral that seeks for 8% to 10% return on principle per annum. The Company believes that the finance business in Hong Kong is profitable and has great potential because of the increasing demand for lending on second mortgages on property and cryptocurrency assets.\nIn June 2021, ACSA purchased 51% shares of Jia Yu Insurance Finance limited (JYIF), which is a licensed Insurance brokerage firm in Hong Kong. JYIFs primary role is to provide local lump sum universal life, annuity assurance and offshore insurance products both life and non-life, which include compliant US PPLI, UL, and IUL policies, to designated clients asset growth purposes with complied tax solutions. There is a growing need and demand for Asian clients to purchase compliant PPLI, UL, and IUL policies in order to receive tax benefits and investment returns, and these products are becoming increasingly popular. The Company utilizes Hong Kong as a hub to organize US PPLI, UL, and IUL policies for high-net-worth clients from China, Japan, Taiwan, Korea, Thailand, and Indonesia. PPLI, IUL, and UL policies are increasingly in demand, and the Company has a professional technical team as well as US lawyers and tax advisors on hand to service these clients as a one-stop shop for all their insurance needs.\nIn 2021, Guangzhou Shengjia Trading Co., Ltd (GST), subsidiary of AJIA, aims to provide back-end support on project called Easy Picture Mobile Application (Easy Picture). Easy Picture is an application for mobile photos software for end customers who want to take qualified photos to apply for visas to China. Easy Picture is an accessible cost saving application offering user-friendly interface. GST has signed up agreement with a travel agency to use this Easy Picture App, however, execution of the business has been delayed due to COVID-19 and resulting closure of travel.\nThe details of the Companys subsidiaries are described below:\nName\nPlace of incorporation\nand kind of\nlegal entity\nPrincipal activities\nand place of operation\nParticulars of issued/\nregistered share\ncapital\nEffective interest\nHeld\nSplendor Radiant Limited\nBritish Virgin Islands, a limited liability company\nInvestment holding\n1 ordinary share of US$1 each\n100%\nAjia Creative Holdings Limited\nHong Kong, a limited liability company\nProvision of food and beverage sales system setup and maintenance service\n100 ordinary shares for HK$100\n100%\nGuangzhou Shengjia Trading Co., Ltd(1)\nThe PRC, a limited liability company\nProvision of mobile app back-end support service\nHK$1,000,000\n100%\nAjia Corporate Systems Architecture Solution Limited\nHong Kong, a limited liability company\nProvision of money lending, insurance brokerage and business development trustee service\n10,000 ordinary shares of HK$10,000\n51%\nUnion Passenger Limited\nHong Kong, a limited liability company\nProvision of catering member service solutions and service platform\n1,000 ordinary shares for HK$1,000\n100%\n(1) This subsidiary was disposed of on September 1, 2022.\nAJIA and its subsidiaries are hereinafter referred to as (the Company).\nInvestors can only purchase equity solely Ajia Innogroup Holdings Ltd. which owns the majority equity interests in our Operating Subsidiaries.\nBusiness Plan\nIn September 2017, the Company began exploring a business plan for a sales system for food and beverage products also sometimes referred to as a catering integration system. The system consists of a website and app which offers menu and ordering systems for end users, which predominantly consists of restaurants and food vendors. Its catering integration system has a crossover sales promotion program with our restaurants and food suppliers members to set up an incentive program for their seasonal and festival sales to meet with the HK Government consumption vouchers scheme during the COVID-19. The Company generates revenue from the licensing of its sales system and we provide all necessary training to restaurant staff, system maintenance and updates.\nOn December 1, 2017, the Company acquired a ten percent (10%) ownership interest in a collection code project (Project), the purpose of which is to improve the marketability and market penetration of Alipay Network Technology Co., Ltd. (Alipay) collection code system. The Company plans to acquire additional interest in this project as the project develops.\nOn October 15, 2020, the Company ratified entry into a Memorandum of Understanding with Union Patron Limited for the formation of holding joint venture company, AJIA Corporate Systems Architecture Solution Ltd (Ajia Corporate), which the Company shall own a 51% interest in. Ajia Corporate is a company registered in Hong Kong and intends to enter a Memorandum of Understanding (MOU) to expand its business developments in the following areas:\n1.\nBig Data Strategic enterprise solution,\n2.\nCloud and digital trading solution,\n3.\nCombined enterprise syndication planning and solution, and\n4.\nE-compliance system and enterprise solutions.\nThe Companys insurance brokerage firm, Jia Yu Insurance Finance limited (JYIF), in which Ajia Corporate owns 51% interest, is a licensed brokerage firm in Hong Kong. JYIFs primary role is to design and place insurance for high net worth clients in Asia who either reside or plan to reside abroad. JYIF offers local lump sum universal life, annuity assurance, and offshore insurance products (both life and non-life), which include compliant US PPLI, UL, and IUL policies, to those designated clients for asset growth purposes (as well as other commercial reasons and purposes).\nIn June 2022, the Company purchased 100% shares of Union Passenger Limited (UPL), a company incorporated in Hong Kong. According to the acquisition agreement, the Company will appoint UPL as its exclusive partner for the promotion of Companys catering, services and total solutions for restaurants in Asia (Products). The Company shall share 100% of the profits and losses of the offering of Products to third party customers which are introduced by UPL.\nPrincipal Products, Services and Their Markets\nIn last year, our business plan consisted of the following three primary segments: 1) the sales and licensing of our point of sales system for food and beverage products also sometimes referred to as a catering integration system, which we offer in Hong Kong, 2) our insurance private placement operations through Ajia Corporate Systems Architecture Solution Limited (ACSA), and 3) our Easy Picture application. We hope to expand our markets outside of Hong Kong in the future.\nStatus of Publicly Announced New Products or Services\nAjia currently has no new publicly announced products or services.\nCompetitive Business Conditions and Strategy; Position in the Industry\nAjia intends to establish itself as a competitive company in the point of sale technology market. Ajias main competitors are firms offering similar technologies and services. Our largest competitors are Multiable and MasterSoft.\nPatents, Trademarks, Licenses, Agreements or Contracts\nAs part of our business, we will seek to protect our intellectual property rights in various ways, including through trademarks, copyrights, trade secrets, including know-how, patents, patent applications, employee and third-party nondisclosure agreements, intellectual property licenses and other contractual rights. At this time, however, there are no aspects of our business plan which require a patent, trademark, or product license. We have not entered into any vendor agreements or contracts that give or could give rise to any obligations or concessions.\nGovernmental Controls, Approval and Licensing Requirements\nOur operation through ACSA requires a license from the Hong Kong insurance authority to operate. We were granted a three years license for our coming operation from 24 June, 2021 to 23 June, 2024. Additionally, certain roles within ACSA require an individual to hold a brokers license from August 2021. We currently have 12 licensed individuals employed by ACSA.\nAs of September 2022, we have disposed of our operation in the PRC, and operate primarily from our Hong Kong based subsidiaries. Apart from customary business laws and regulations, the PRC government does not regulate the catering, services and total solutions for restaurants business industry. The PRC government may, however, from time to time institute rules and regulations on such businesses which makes it difficult or impossible for us to operate successfully, if at all, in the PRC. Please see the section on Risk Factors for further details.\nOther than as mentioned above, we are unaware of any government regulations that are directly affecting our business, however, as we grow our business activities may become subject to various governmental regulations in different countries in which we operate, including regulations relating to: various business/investment approvals; trade affairs, including customs, import and export control; competition and antitrust; anti-bribery; advertising and promotion; intellectual property; consumer and business taxation; foreign exchange controls; personal information protection; labor; human rights; conflict; occupational health and safety; environmental; and recycling requirements.\nResearch and Development Activities and Costs\nWe have spent no time on specialized research and development activities, and have no plans to undertake any research or development in the future.\nCash Management Systems\nWe have no cash management policies that dictate how funds are transferred.\nNumber of Employees\nThe Company has approximately 20 part and full time employees at ACSA and 6 employees and IT support personnel working with Easy Picture application. We have no other significant employees other than our officers and directors and one employee who is responsible for the accounting and general administrative matters. In addition, the Company outsources its financial and management matters to various management consultants during the year. We intend to increase the size of our management team and hire additional employees in the future to manage the continued growth of our company and to increase our sales force and marketing efforts.\nPlace of Operation\nOur executive and operating office is located at Room 1001, 10/F., Grandmark, No. 10 Granville Road, Tsim Sha Tsui, Kowloon, Hong Kong. Our management team is located at this office and will have to travel to Asian regions regularly to pursue the development of its businesses.\nRegulatory Permission\nWe are currently not required to obtain approval from Chinese authorities to list on U.S. exchanges, however, if our subsidiaries or the holding company were required to obtain approval in the future and were denied permission from Chinese authorities to list on U.S. exchanges, we will not be able to continue listing on a U.S. exchange, which would materially affect the interest of the investors. It is uncertain when and whether the Company will be required to obtain permission from the PRC government to list on U.S. exchanges in the future, and when such permission is obtained, whether it will be rescinded. Although the Company is currently not required to obtain permission from any of the PRC federal or local government to list on U.S. exchanges and has not received any denial to list on a U.S. exchange, our operations could be adversely affected, directly or indirectly, by existing or future laws and regulations relating to its business or industry. If we are subsequently advised by any Chinese authorities that permission for this offering and/or listing on the Nasdaq Stock Market was required, we may not be able to obtain such permission in a timely manner, if at all. If this risk occurs, our ability to offer securities to investors could be significantly limited or completely hindered and the securities currently being offered may substantially decline in value or become worthless.\nRecently, the General Office of the Central Committee of the Communist Party of China and the General Office of the State Council jointly issued the Opinions on Strictly Cracking Down on Illegal Securities Activities, which were made available to the public on July 6, 2021. The Opinions on Strictly Cracking Down on Illegal Securities Activities emphasized the need to strengthen the administration over illegal securities activities, and the need to strengthen the supervision over overseas listings by Chinese companies. Pursuant to the Opinions, Chinese regulators are required to accelerate rulemaking related to the overseas issuance and listing of securities, and update the existing laws and regulations related to data security, cross-border data flow, and management of confidential information. Numerous regulations, guidelines and other measures are expected to be adopted under the umbrella of or in addition to the Cybersecurity Law and Data Security Law. As of the date of this report, no official guidance or related implementation rules have been issued. As a result, the Opinions on Strictly Cracking Down on Illegal Securities Activities remain unclear on how they will be interpreted, amended and implemented by the relevant PRC governmental authorities.\nOn December 28, 2021, the Cyberspace Administration of China jointly with the relevant authorities formally published Measures for Cybersecurity Review (2021) which will took effect on February 15, 2022 and replace the former Measures for Cybersecurity Review (2020). Measures for Cybersecurity Review (2021) stipulates that operators of critical information infrastructure purchasing network products and services, and online platform operator (together with the operators of critical information infrastructure, the Operators) carrying out data processing activities that affect or may affect national security, shall conduct a cybersecurity review, any online platform operator who controls more than one million users personal information must go through a cybersecurity review by the cybersecurity review office if it seeks to be listed in a foreign country. Given that: (i) we do not possess personal information on more than one million users in our business operations; and (ii) data processed in our business does not have a bearing on national security and thus may not be classified as core or important data by the authorities, we would not be required to apply for a cybersecurity review under the Measures for Cybersecurity Review (2021).\nOur PRC subsidiary was disposed of on September 1, 2022 and we do not believe the Company or its PRC subsidiary are or will become subject to enhanced cybersecurity review or investigation. Further, while we continue to have operations in Hong Kong through the Hong Kong subsidiaries, we believe that our operations are not affected by this since these statements and regulatory actions are new, it is highly uncertain how soon the legislative or administrative regulation making bodies will respond and what existing or new laws or regulations or detailed implementations and interpretations will be modified or promulgated, if any. It is also highly uncertain what the potential impacts such modified or new laws and regulations will have on our business operations, its ability to accept foreign investments and the listing of our Shares on a U.S. or other foreign exchanges. If certain PRC laws and regulations were to become applicable to a company such as us in the future, the application of such laws and regulations may have a material adverse impact on our business, financial condition and results of operations and our ability to offer or continue to offer securities to investors, any of which may cause the value of our securities, including our common Shares, to significantly decline or become worthless.\nIf the CSRC, CAC or other regulatory agencies later promulgate new rules or explanations requiring that we obtain their approvals, we may be unable to obtain such approvals and we may face sanctions by the CSRC, CAC or other PRC regulatory agencies for failure to seek their approval which could significantly limit or completely hinder our ability to offer or continue to offer securities to our investors and the securities currently being offered may substantially decline in value and be worthless.\nHolding Foreign Companies Accountable Act\nU.S. laws and regulations, including the Holding Foreign Companies Accountable Act, or HFCAA, may restrict or eliminate our ability to complete a business combination with certain companies, particularly those acquisition candidates with substantial operations in China.\nOn March 24, 2021, the SEC adopted interim final rules relating to the implementation of certain disclosure and documentation requirements of the HFCAA. An identified issuer will be required to comply with these rules if the SEC identifies it as having a non-inspection year under a process to be subsequently established by the SEC. In June 2021, the Senate passed the Accelerating Holding Foreign Companies Accountable Act, which, if signed into law, would reduce the time period for the delisting of foreign companies under the HFCAA to two consecutive years instead of three years. If our auditor cannot be inspected by the Public Company Accounting Oversight Board, or the PCAOB, for two consecutive years, the trading of our securities on any U.S. national securities exchanges, as well as any over-the-counter trading in the U.S., will be prohibited. Additionally, and as a result of a failure to be inspected, the exchange on which we are then listed may determine to delist our securities.\nOn September 22, 2021, the PCAOB adopted a final rule implementing the HFCAA, which provides a framework for the PCAOB to use when determining, as contemplated under the HFCAA, whether the PCAOB is unable to inspect or investigate completely registered public accounting firms located in a foreign jurisdiction because of a position taken by one or more authorities in that jurisdiction. On December 2, 2021, the SEC issued amendments to finalize rules implementing the submission and disclosure requirements in the HFCA Act. The rules apply to registrants that the SEC identifies as having filed an annual report with an audit report issued by a registered public accounting firm that is located in a foreign jurisdiction and that PCAOB is unable to inspect or investigate completely because of a position taken by an authority in foreign jurisdictions. On December 16, 2021, the PCAOB issued a report on its determinations that it is unable to inspect or investigate completely PCAOB-registered public accounting firms headquartered in mainland China and in Hong Kong, because of positions taken by PRC authorities in those jurisdictions. As of the date of this Annual Report on Form 10-K, J&S Associate, our auditor, is not subject to the determinations as to the inability to inspect or investigate registered firms completely announced by the PCAOB on December 16, 2021. Item 1A. Risk Factors\nThere are certain inherent risks which will have an effect on our development in the future and the most significant risks and uncertainties known and identified by our management are described below.\nSUMMARY RISK FACTORS\n·\nChanges in Chinas economic, political or social conditions or government policies could have a material adverse effect on our business, results of operations, financial condition and prospects. For more details, see Risk Factors - General Risks Associated with Doing Business in China - Changes in the policies, regulations, rules and the enforcement of laws of the PRC government may be quick with little advance notice and could have a significant impact upon the business we may be able to conduct in the PRC and the profitability of such business.\n·\nThere are uncertainties regarding the interpretation and enforcement of PRC laws, rules and regulations. For more details, see Risk Factors - General Risks Related to Doing Business in China - There are uncertainties regarding the interpretation and enforcement of PRC laws, rules and regulations..\n·\nWe may rely on dividends and other distributions on equity paid by our PRC or Hong Kong subsidiaries to fund any cash and financing requirements we may have, and any limitation on the ability of our PRC and Hong Kong subsidiaries to make payments to us could have a material and adverse effect on our ability to conduct our business. See Risk Factors - General Risks Related to Doing Business in China - Dividends and Other Distributions to U.S. Investors and Tax Consequences\n·\nTo the extent cash in the business is in PRC, Hong Kong or a Hong Kong entity, funds may not be available to fund operations or for other use outside of Hong Kong due to interventions in or the imposition of restrictions and limitations on the ability of the Company and its subsidiaries by the PRC government to transfer cash. See Risk Factors - General Risks Related to Doing Business in China - Transfers of Cash to and from our Subsidiaries in Hong Kong\nRISKS RELATED TO PANDEMICS\nThe effects of the recent COVID-19 coronavirus pandemic are not immediately known, but may adversely affect our business, results of operations, financial condition, liquidity, and cash flow.\nPresently, the impact of COVID-19 has not shown any imminent adverse effects on our business. This notwithstanding, it is still unknown and difficult to predict what adverse effects, if any, COVID-19 can have on our business, or against the various aspects of same, or how COVID-19 will continue to effect the world as the virus case numbers rise and fall.\nAs of the date of this Annual Report, COVID-19 coronavirus has been declared a pandemic by the World Health Organization, has been declared a National Emergency by the United States Government. COVID-19 coronavirus caused significant volatility in global markets. The spread of COVID-19 coronavirus has caused public health officials to recommend precautions to mitigate the spread of the virus, especially as to travel and congregating in large numbers. In addition, certain countries, states and municipalities have enacted, quarantining and shelter-in-place regulations which severely limit the ability of people to move and travel and require non-essential businesses and organizations to close. While some places have lessened their shelter-in-place restrictions and travel bans, as they are removed there is no certainty that an outbreak will not occur and additional restrictions imposed again in response.\nHong Kong has been the subject of significant COVID-19 related closures and quarantine restrictions which have affected businesses, individuals and travel. As these restrictions are being lifted, we cannot assure that restrictions will not be re-implemented in response to further COVID-19 outbreaks.\nFurther, It is unclear how such restrictions, which will contribute to a general slowdown in the global economy, will affect our business, results of operations, financial condition and our future strategic plans. Shelter-in-place and essential-only travel regulations could negatively impact us. The current status of COVID-19 coronavirus closures and restrictions could negatively impact our ability to receive funding from our existing capital sources as each business is and has been affected uniquely.\nIf any of our employees, consultant, customers, or visitors were to become infected we could be forced to close our operations temporarily as a preventative measure to prevent the risk of spread which could also negatively impact our ability to receive funding from our existing capital sources as each business is and has been affected uniquely.\nIn addition, our headquarters are located in Hong Kong which experienced restrictions on individuals and business shutdowns as the result of COVID-19. It is unclear at this time how these restrictions will be continued and/or amended as the pandemic evolves. We are hopeful that COVID-19 closures will have only a limited effect on our operations.\nGeneral securities market uncertainties resulting from the COVID-19 pandemic.\nSince the outset of the pandemic the United States and worldwide national securities markets have undergone unprecedented stress due to the uncertainties of the pandemic and the resulting reactions and outcomes of government, business and the general population. These uncertainties have resulted in declines in all market sectors, increases in volumes due to flight to safety and governmental actions to support the markets. As a result, until the pandemic has stabilized, the markets may not be available to the Company for purposes of raising required capital. Should we not be able to obtain financing when required, in the amounts necessary to execute on our plans in full, or on terms which are economically feasible we may be unable to sustain the necessary capital to pursue our strategic plan and may have to reduce the planned future growth and/or scope of our operations.\nRISKS ASSOCIATED WITH OUR BUSINESS\nOur independent auditors have issued an audit opinion for Ajia which includes a statement describing our going concern status. Our financial status creates a doubt whether we will continue as a going concern.\nAs described in Note 2 of our accompanying financial statements, our auditors have issued a going concern opinion regarding the Company. This means there is substantial doubt we can continue as an ongoing business for the next twelve months. The financial statements do not include any adjustments that might result from the uncertainty regarding our ability to continue in business. As such, we may have to cease operations and investors could lose part or all of their investment in the Company.\nWe lack an operating history and have losses which we expect to continue into the future. There is no assurance our future operations will result in profitable revenues. If we cannot generate sufficient revenues to operate profitably, we may suspend or cease operations.\nWe were incorporated on March 19, 2014, and we have not fully developed our proposed business operations and have realized limited revenues. We have limited operating history upon which an evaluation of our future success or failure can be made. Our net loss for the years ended June 30, 2022 and 2021, was $412,837 and $184,262, respectively, most of which is for general and administrative expenses and professional fees. Our ability to achieve and maintain profitability and positive cash flow is dependent upon our ability to raise capital if needed, to attract customers who will use our services, and to generate revenue through the sale of our services.\nBased upon current plans, we expect to incur operating losses in future periods because we will be incurring expenses and generating limited revenues. We cannot guarantee that we will be successful in generating revenues in the future. In the event the Company is unable to generate revenues, it may be required to seek additional funding. Such funding may not be available, or may not be available on terms which are beneficial and/or acceptable to the Company. In the event the Company cannot generate sufficient revenues and/or secure additional financing, the Company may be forced to cease operations and investors will likely lose some or all of their investment in the Company.\nAlthough we obtain clients or customers, there is no assurance that we will make a profit.\nEven if we obtain clients or customers for our services, there is no guarantee that we will develop products and/or services that our clients/customers will want to use. If we are unable to attract enough customers/clients to purchase services (and any products we may develop or sell) it will have a negative effect on our ability to generate sufficient revenue from which we can operate or expand our business. The lack of sufficient revenues will have a negative effect on the ability of the Company to continue operations and it could force the Company to cease operations.\nSome of our competitors have significantly greater financial and marketing resources than we do.\nOur industry has many competitors that have significantly greater financial and marketing resources than do we. There are no assurances that our efforts to compete in the marketplace will be successful. We are a relatively late entry into a mature market for our services. There can be no assurance that we will be able to develop a profitable niche in this market.\nWe are in a competitive market which could impact our ability to gain market share which could harm our financial performance.\nOur business can be competitive; we face competition from traditional caterers, marketing services, and other industry specific technologies offering similar services. The barriers to entry are relatively low, and we may face competitive pressures from companies anxious to join this niche. We face competition from larger businesses who are easily accessible proven companies that offer similar niche service which may prevent us from gaining enough market shares to become successful. These competitors have existing customers that may form a large part of our targeted client base, and such clients may be hesitant to switch over from already established competitors to our service. If we cannot gain enough market share, our business and our financial performance will be adversely affected.\nWe do not have any additional source of funding for our business plans and may be unable to find any such funding if and when needed, resulting in the failure of our business.\nWe have no source of capital that has been identified or sought. As a result we do not have an alternate source of funds. If we do find an alternative source of capital, the terms and conditions of acquiring such capital may result in dilution and the resultant lessening of value of the shares of stockholders. As widely reported, the global and domestic financial markets have been extremely volatile in recent months. If such conditions and constraints continue or if there is no investor appetite to finance our specific business, we may not be able to acquire additional financing through credit markets or equity markets. Even if additional financing is available, it may not be available on terms favourable to us. At this time, we have not identified or secured sources of additional financing. Our failure to secure additional financing when it becomes required will have an adverse effect on our ability to remain in business.\nIf we are not successful in raising sufficient funds, we will be faced with several options:\n1. abandon our business plans, cease operations and go out of business;\n2. continue to seek alternative and acceptable sources of capital; or\n3. bring in additional capital that may result in a change of control.\nWe possess minimal capital, which may severely restrict our ability to develop our services. If we are unable to raise additional capital, our business will fail.\nWe possess minimal capital and must limit the amount of marketing we can perform with respect to our services. We feel we require a minimum of $100,000 over the next 12 months to continue operations and carry out our business plan. Our limited marketing activities may not attract enough clients to generate sufficient revenue to operate profitably, expand our services, implement our business plan or continue operating our business. Our limited marketing capabilities may have a negative effect on our business and may cause us to limit or cease our business operations which could result in investors losing some or all of their investment in the Company.\nIf our estimates related to future expenditures are erroneous or inaccurate, our business will fail and you could lose your entire investment.\nOur success is dependent in part upon the accuracy of our managements estimates of our future cost expenditures for legal and accounting services (including those we expect to incur as a publicly reporting company), for website marketing and development expenses, and for administrative expenses, which management estimates to be approximately between $25,000 and $45,000 over the next twelve months. If such estimates are erroneous or inaccurate, or if we encounter unforeseen costs, we may not be able to carry out our business plan, which could result in the failure of our business and the loss of your entire investment.\nOur auditor has raised substantial doubts about our ability to continue as a going concern and if we are unable to continue our business, our shares may have little or no value.\nThe companys ability to become a profitable operating company is dependent upon its ability to generate revenues and/or obtain financing adequate to fulfil its research and market introduction activities, and achieving a level of revenues adequate to support our cost structure has raised substantial doubts about our ability to continue as a going concern. We plan to attempt to raise additional equity capital by selling shares and, if necessary, through one or more private placement or public offerings.\nHowever, the doubts raised, relating to our ability to continue as a going concern, may make our shares an unattractive investment for potential investors. These factors, among others, may make it difficult to raise any additional capital.\nRISKS RELATED TO DOING BUSINESS IN CHINA\nTransfers of Cash to and from our Subsidiaries; We may not be able to obtain certain benefits under relevant tax treaties on dividends paid by our PRC subsidiaries to us through our Hong Kong subsidiary.\nWe are a US company with subsidiaries incorporated under the laws of Hong Kong and PRC (although such operations have been winded down as of September 1, 2022). We are not a Chinese operating company. The Companys ability to pay dividends to its shareholders and to service any debt it may incur may depend upon dividends paid by our subsidiaries. If any of our subsidiaries incurs debt on its own in the future, the instruments governing such debt may restrict its ability to pay dividends to the Company. In addition, our subsidiaries are required to make appropriations to certain statutory reserve funds, which are not distributable as cash dividends except in the event of a solvent liquidation of the companies. We have never paid any dividends and do not intend to as of the date of this Report. Pursuant to the PRC Enterprise Income Tax Law, a withholding tax rate of 10% currently applies to dividends paid by a PRC resident enterprise to a foreign enterprise investor, unless any such foreign investors jurisdiction of incorporation has a tax treaty with China that provides for preferential tax treatment. Pursuant to the Arrangement between the Mainland China and the Hong Kong Special Administrative Region for the Avoidance of Double Taxation and Tax Evasion on Income, or the Double Tax Avoidance Arrangement, such withholding tax rate may be lowered to 5% if a Hong Kong resident enterprise owns no less than 25% of a PRC enterprise. Furthermore, the Administrative Measures for Non-Resident Enterprises to Enjoy Treatments under Tax Treaties, which became effective in August 2015, require non-resident enterprises to determine whether they are qualified to enjoy the preferential tax treatment under the tax treaties and file the relevant report and materials with the tax authorities. There are also other conditions for enjoying the reduced withholding tax rate, according to other relevant tax rules and regulations. As of the date of this Report, we did not record any withholding tax on the retained earnings of our subsidiaries in the PRC, as we intend to re-invest all earnings generated from our PRC subsidiaries for the operation and expansion of our business in China, and we intend to continue this practice in the foreseeable future. Should our tax policy change to allow for offshore distribution of our earnings, we would be subject to a significant withholding tax. We cannot assure you that our determination regarding our qualification to enjoy the preferential tax treatment will not be challenged by the relevant tax authority or if we will be able to complete the necessary filings with the relevant tax authority and enjoy the preferential withholding tax rate of 5% under the Double Taxation Arrangement with respect to dividends to be paid by our PRC subsidiaries to our Hong Kong subsidiary.\nTo address persistent capital outflows and the RMBs depreciation against the U.S. dollar in the fourth quarter of 2016, the Peoples Bank of China and the State Administration of Foreign Exchange, or SAFE, implemented a series of capital control measures in the subsequent months, including stricter vetting procedures for China-based companies to remit foreign currency for overseas acquisitions, dividend payments and shareholder loan repayments. The PRC government may continue to strengthen its capital controls and our PRC subsidiaries dividends and other distributions may be subject to tightened scrutiny in the future. The PRC government also imposes controls on the conversion of RMB into foreign currencies and the remittance of currencies out of the PRC. Therefore, we may experience difficulties in completing the administrative procedures necessary to obtain and remit foreign currency for the payment of dividends from our profits, if any. In addition, to the extent cash is in our mainland China or Hong Kong subsidiaries, there can be no assurance that the PRC government will not intervene or impose restrictions on the ability of the Company or its subsidiaries to transfer or distribute cash within our organization or to foreign investors, which could result in an inability or prohibition on funding our operations or making transfers or distributions outside of mainland China and Hong Kong for other use.\nCurrently, other than complying with the applicable PRC laws and regulations, we do not have our own cash management policy and procedures that dictate how funds are transferred.\nTransfers of Cash to and from our Subsidiaries in Hong Kong\nThe Company conducts operations in Hong Kong through Ajia Creative Holdings Limited Systems, Architecture Solution Limited, and Union Passenger Limited, each a Hong Kong entity and collectively its Hong Kong subsidiaries. The Company may rely on dividends or payments to be paid by its Hong Kong subsidiaries, to fund its cash and financing requirements, including the funds necessary to pay dividends and other cash distributions to our shareholders and U.S. investors, to service any debt we may incur and to pay our operating expenses\nThe Company is permitted to provide funding to its subsidiary in Hong Kong through loans or capital contributions without restrictions on the amount of the funds. The Hong Kong Subsidiaries are also permitted under the laws of Hong Kong to provide funding to the Company, through dividend distributions or payments, without restrictions on the amount of the funds.\nThere are no restrictions or limitation on our ability to distribute earnings by dividends from our subsidiaries, including our subsidiaries in Hong Kong, to the Company and our shareholders and U.S. investors, provided that the entity remains solvent after such distribution. According to the Companies Ordinance of Hong Kong, a Hong Kong company may only make a distribution out of profits available for distribution. We have not adopted or maintain any cash management policies and procedures as of the date of this report. There is no further Hong Kong statutory restriction on the amount of funds which may be distributed by us by dividend.\nAs of the date of this report, there are no restrictions or limitation under the laws of Hong Kong imposed on the conversion of HK$ into foreign currencies and the remittance of currencies out of Hong Kong or across borders and to U.S investors. The PRC laws and regulations do not currently have any material impact on transfer of cash from our Hong Kong Subsidiaries to the Company, our shareholders or U.S. investors. However, in the future, funds may not be available to fund operations or for other use outside of Hong Kong, due to interventions in, or the imposition of restrictions and limitations on, our ability or on our subsidiarys ability by the PRC government to transfer cash. Any limitation on the ability of our subsidiary to make payments to us could have a material adverse effect on our ability to conduct our business and might materially decrease the value of our Shares or cause them to be worthless. Currently, all of our operations are in Hong Kong. We do not have or intend to set up any subsidiary or enter into any contractual arrangements to establish a variable interest entity, or VIE, structure with any entity in mainland China. Since Hong Kong is a special administrative region of the PRC and the basic policies of the PRC regarding Hong Kong are reflected in the Basic Law of the Hong Kong Special Administrative Region of the Peoples Republic of China, or the Basic Law, providing Hong Kong with a high degree of autonomy and executive, legislative and independent judicial powers, including that of final adjudication under the principle of one country, two systems. The PRC laws and regulations do not currently have any material impact on transfer of cash between the Company and the Hong Kong Subsidiaries and the investors in the U.S. However, the Chinese government may, in the future, impose restrictions or limitations on our ability to transfer money out of Hong Kong, to distribute earnings and pay dividends to and from the other entities within our organization, or to reinvest in our business outside of Hong Kong. Such restrictions and limitations, if imposed in the future, may delay or hinder the expansion of our business to outside of Hong Kong and may affect our ability to receive funds from our operating subsidiary in Hong Kong. The promulgation of new laws or regulations, or the new interpretation of existing laws and regulations, in each case, that restrict or otherwise unfavorably impact the ability or way we conduct our business, could require us to change certain aspects of our business to ensure compliance, which could decrease demand for our services, reduce revenues, increase costs, require us to obtain more licenses, permits, approvals or certificates, or subject us to additional liabilities. To the extent any new or more stringent measures are required to be implemented, our business, financial condition and results of operations could be adversely affected and such measured could materially decrease the value of our Shares, potentially rendering it worthless.\nRegulations related to Hong Kong taxation\nUnder the current practice of the Inland Revenue Department of Hong Kong, no tax is payable in Hong Kong in respect of dividends paid by us. The PRC laws and regulations do not currently have any material impact on transfers of cash from the Company to Hong Kong Subsidiaries, our shareholders and U.S. investors. However, the Chinese government may, in the future, impose restrictions or limitations on our ability to transfer money out of Hong Kong, to distribute earnings and pay dividends to and from the other entities within our organization, or to reinvest in our business outside of Hong Kong. Such restrictions and limitations, if imposed in the future, may delay or hinder the expansion of our business to outside of Hong Kong and may affect our ability to receive funds from our operating subsidiaries in Hong Kong. The promulgation of new laws or regulations, or the new interpretation of existing laws and regulations, in each case, that restrict or otherwise unfavorably impact the ability or way we conduct our business, could require us to change certain aspects of our business to ensure compliance, which could decrease demand for our services, reduce revenues, increase costs, require us to obtain more licenses, permits, approvals or certificates, or subject us to additional liabilities. To the extent any new or more stringent measures are required to be implemented, our business, financial condition and results of operations could be adversely affected and such measured could materially decrease the value of our Shares, potentially rendering them worthless.\nDividends and Other Distributions to U.S. Investors and Tax Consequences\nAs of the date of this report, neither the Company nor any of its subsidiaries have paid dividends or made distributions to U.S. investors. We intend to retain most, if not all, of our available funds and any future earnings after this offering to the development and growth of our business in China and Hong Kong. We do not expect to pay dividends in the foreseeable future.\nSubject to the passive foreign investment company rules, the gross amount of any distribution that we make to investors with respect to the Companys securities (including any amounts withheld to reflect PRC withholding taxes) will be taxable as a dividend, to the extent paid out of our current or accumulated earnings and profits, as determined under United States federal income tax principles.\nThe PRC Enterprise Income Tax Law and its implementation rules provide that a withholding tax at a rate of 10% will be applicable to dividends payable by Chinese companies to non-PRC-resident enterprises unless reduced under treaties or arrangements between the PRC central government and the governments of other countries or regions where the non-PRC resident enterprises are tax resident. Pursuant to the tax agreement between mainland China and the Hong Kong Special Administrative Region, the withholding tax rate in respect to the payment of dividends by a PRC enterprise to a Hong Kong enterprise may be reduced to 5% from a standard rate of 10%. However, if the relevant tax authorities determine that our transactions or arrangements are for the primary purpose of enjoying a favorable tax treatment, the relevant tax authorities may adjust the favorable withholding tax in the future. Accordingly, there is no assurance that the reduced 5% withholding rate will apply to dividends received by our Hong Kong subsidiary from our PRC subsidiaries. This withholding tax will reduce the amount of dividends we may receive from our PRC subsidiaries.\nChanges in the policies, regulations, rules and the enforcement of laws of the PRC government may be quick with little advance notice and could have a significant impact upon the business we may be able to conduct in the PRC and the profitability of such business.\nThe PRCs economy is in a transition from a planned economy to a market oriented economy subject to five-year and annual plans adopted by the central government that set national economic development goals. Policies of the PRC government can have significant effects on the economic conditions of the PRC. The PRC government has confirmed that economic development will follow the model of a market economy. Under this direction, we believe that the PRC will continue to strengthen its economic and trading relationships with foreign countries and business development in the PRC will follow market forces. While we believe that this trend will continue, we cannot assure you that this will be the case. Changes in policies, regulations, rules and the enforcement of laws by the PRC government, which changes may be quick with little advance notice, could adversely affect our interests by, among other factors: changes in laws, regulations or the interpretation thereof, confiscatory taxation, restrictions on currency conversion, imports or sources of supplies, or the expropriation or nationalization of private enterprises. Although the PRC government has been pursuing economic reform policies for more than two decades, we cannot assure you that the government will continue to pursue such policies or that such policies may not be significantly altered, especially in the event of a change in leadership, social or political disruption, or other circumstances affecting the PRCs political, economic and social environment.\nThere are uncertainties regarding the interpretation and enforcement of PRC laws, rules and regulations.\nWe had one subsidiary in PRC which has been inactive since July 2020 and winded down as of September 2022; the remainder of our subsidiaries are operating in Hong Kong. The PRC legal system is a civil law system based on written statutes. Unlike the common law system, prior court decisions may be cited for reference but have limited precedential value.\nIn 1979, the PRC government began to promulgate a comprehensive system of laws, rules and regulations governing economic matters in general. The overall effect of legislation over the past four decades has significantly enhanced the protections afforded to various forms of foreign investment in China. However, China has not developed a fully integrated legal system, and recently enacted laws, rules and regulations may not sufficiently cover all aspects of economic activities in China or may be subject to significant degree of interpretation by PRC regulatory agencies and courts. In particular, because these laws, rules and regulations are relatively new, and because of the limited number of published decisions and the non-precedential nature of these decisions, and because the laws, rules and regulations often give the relevant regulator significant discretion in how to enforce them, the interpretation and enforcement of these laws, rules and regulations involve uncertainties and can be inconsistent and unpredictable. Therefore, it is possible that our existing operations may be found not to be in full compliance with relevant laws and regulations in the future. In addition, the PRC legal system is based in part on government policies and internal rules, some of which are not published on a timely basis or at all, and which may have a retroactive effect. As a result, we may not be aware of our violation of these policies and rules until after the occurrence of the violation.\nAny administrative and court proceedings in China may be protracted, resulting in substantial costs and diversion of resources and management attention. Since PRC administrative and court authorities have significant discretion in interpreting and implementing statutory and contractual terms, it may be more difficult to evaluate the outcome of administrative and court proceedings and the level of legal protection we enjoy than in more developed legal systems. These uncertainties may impede our ability to enforce the contracts we have entered into and could materially and adversely affect our business, financial condition and results of operations.\nOur Company is incorporated in Nevada and is subject to laws and regulations applicable to Nevada, and our subsidiary Guangzhou Shengjia Trading Co., Ltd (GST), is also subject to various Chinese laws and regulations generally applicable to companies incorporated in China. GST has been dormant since July 1, 2020 that it has not received any income and has only incurred administrative expenses, mainly for book keeping and statutory filing We have disposed of our GST operations as of September 1, 2022. However, since these laws and regulations are relatively new and the PRC legal system continues to rapidly evolve, the interpretations of many laws, regulations and rules are not always uniform and enforcement of these laws, regulations and rules involves uncertainties.\nFrom time to time, we may have to resort to administrative and court proceedings to enforce our legal rights. However, since PRC administrative and court authorities have significant discretion in interpreting and implementing statutory and contractual terms, it may be more difficult to evaluate the outcome of administrative and court proceedings and the level of protection we enjoy than in more developed legal systems. Furthermore, the PRC legal system is based in part on government policies and internal rules, some of which are not published on a timely basis or at all, and which may have a retroactive effect. As a result, we may not be aware of our violation of any of these policies and rules until sometime after the violation. In addition, any administrative and court proceedings in China may be protracted, resulting in substantial costs and diversion of resources and management attention. Such uncertainties, including uncertainty over the scope and effect of our contractual, property (including intellectual property) and procedural rights, and any failure to respond to changes in the regulatory environment in China could materially and adversely affect our business and impede our ability to continue our operations.\nThe Chinese government exerts substantial influence over the manner in which we must conduct our business activities, which could result in a material change in our operations and/or the value of our ordinary shares. The Chinese government may intervene or influence our operations at any time, which could result in a material change in our operations and the value of our ordinary shares. Additionally, governmental and regulatory interference could significantly limit or completely hinder our ability to offer or continue to offer securities to investors and cause the value of such securities to significantly decline or be worthless.\nThe Chinese government has exercised and continues to exercise substantial control over virtually every sector of the Chinese economy through regulation and state ownership. Our ability to operate in China may be harmed by changes in its laws and regulations, including those relating to taxation, environmental regulations, land use rights, property, and other matters. The central or local governments of these jurisdictions may impose new, stricter regulations or interpretations of existing regulations that would require additional expenditures and efforts on our part to ensure our compliance with such regulations or interpretations. Accordingly, government actions in the future, including any decision not to continue to support recent economic reforms and to return to a more centrally planned economy or regional or local variations in the implementation of economic policies, could have a significant effect on economic conditions in China or particular regions thereof and could require us to divest ourselves of any interest we then hold in Chinese properties.\nAs such, the Companys business segments may be subject to various government and regulatory interference in the provinces in which they operate. The Company could be subject to regulation by various political and regulatory entities, including various local and municipal agencies and government sub-divisions. The Company may incur increased costs necessary to comply with existing and newly adopted laws and regulations or penalties for any failure to comply. The Companys operations could be adversely affected, directly or indirectly, by existing or future laws and regulations relating to its business or industry. Given that the Chinese government may intervene or influence our operations at any time, it could result in a material change in our operation and the value of our ordinary shares. Given recent statements by the Chinese government indicating an intent to exert more oversight and control over offerings that are conducted overseas, any such action could significantly limit or completely hinder our ability to offer or continue to offer securities to investors and cause the value of such securities to significantly decline or be worthless.\nRecently, the General Office of the Central Committee of the Communist Party of China and the General Office of the State Council jointly issued the Opinions on Severe and Lawful Crackdown on Illegal Securities Activities, which were available to the public on July 6, 2021. These opinions emphasized the need to strengthen the administration over illegal securities activities and the supervision on overseas listings by China-based companies. These opinions proposed to take effective measures, such as promoting the construction of relevant regulatory systems, to deal with the risks and incidents facing China-based overseas-listed companies and the demand for cybersecurity and data privacy protection. Moreover, the State Internet Information Office issued the Measures of Cybersecurity Review (Revised Draft for Comments, not yet effective) on July 10, 2021, which require operators with personal information of more than 1 million users who want to list abroad to file a cybersecurity review with the Office of Cybersecurity Review. The aforementioned policies and any related implementation rules to be enacted may subject us to additional compliance requirement in the future.\nOur PRC subsidiary was disposed of on September 1, 2022 and we do not believe the Company or its PRC subsidiary are or will become subject to enhanced cybersecurity review or investigation. Further, while we continue to have operations in Hong Kong through the Hong Kong subsidiaries, we believe that our operations are not affected by this since these statements and regulatory actions are new, it is highly uncertain how soon the legislative or administrative regulation making bodies will respond and what existing or new laws or regulations or detailed implementations and interpretations will be modified or promulgated, if any. It is also highly uncertain what the potential impacts such modified or new laws and regulations will have on our business operations, its ability to accept foreign investments and the listing of our Shares on a U.S. or other foreign exchanges. If certain PRC laws and regulations were to become applicable to a company such as us in the future, the application of such laws and regulations may have a material adverse impact on our business, financial condition and results of operations and our ability to offer or continue to offer securities to investors, any of which may cause the value of our securities, including our Shares, to significantly decline or become worthless.\nWe may be liable for improper use or appropriation of personal information provided by our customers.\nAlthough limited, our business involves retaining certain customer data. We also maintain information about various aspects of our operations as well as regarding our employees. Our customers and employees expect that we will adequately protect their personal information. We are required by applicable laws to keep strictly confidential the personal information that we collect, and to take adequate security measures to safeguard such information.\nThe Civil Code of the PRC (issued by the PRC National Peoples Congress on May 28, 2020 and effective from January 1, 2021) provides legal basis for privacy and personal information infringement claims under the Chinese civil laws. PRC regulators, including the CAC, the Ministry of Industry and Information Technology, or MIIT, and the Ministry of Public Security, have been increasingly focused on regulation in data security and data protection.\nThe PRC regulatory requirements regarding cybersecurity are evolving. For instance, various regulatory bodies in China, including the CAC, the Ministry of Public Security, and the State Administration for Market Regulation, or the SAMR (formerly known as State Administration for Industry and Commerce, or the SAIC), have enforced data privacy and protection laws and regulations with varying and evolving standards and interpretations. In April 2020, the Chinese government promulgated Cybersecurity Review Measures, which came into effect on June 1, 2020. According to the Cybersecurity Review Measures, operators of critical information infrastructure must pass a cybersecurity review when purchasing network products and services which do or may affect national security.\nAs there remains significant uncertainty in the interpretation and enforcement of relevant PRC cybersecurity laws and regulations, we could be subject to cybersecurity review, and if so, we may not be able to pass such review in relation to this offering. In addition, we could become subject to enhanced cybersecurity review or investigations launched by PRC regulators in the future. Any failure or delay in the completion of the cybersecurity review procedures or any other non-compliance with the related laws and regulations may result in fines or other penalties, including suspension of business, website closure, removal of our app from the relevant app stores, and revocation of prerequisite licenses, as well as reputational damage or legal proceedings or actions against us, which may have material adverse effect on our business, financial condition or results of operations.\nOn June 10, 2021, the SCNPC promulgated the PRC Data Security Law, which took effect in September 2021. The PRC Data Security Law imposes data security and privacy obligations on entities and individuals carrying out data activities, and introduces a data classification and hierarchical protection system based on the importance of data in economic and social development, and the degree of harm it will cause to national security, public interests, or legitimate rights and interests of individuals or organizations when such data is tampered with, destroyed, leaked, illegally acquired or used. The PRC Data Security Law also provides for a national security review procedure for data activities that may affect national security and imposes export restrictions on certain data an information.\nAs uncertainties remain regarding the interpretation and implementation of these laws and regulations, we cannot assure you that we will comply with such regulations in all respects, and we may be ordered to rectify or terminate any actions that are deemed illegal by regulatory authorities. We may also become subject to fines and/or other sanctions which may have material adverse effect on our business, operations, and financial condition.\nWhile we take various measures to comply with all applicable data privacy and protection laws and regulations, our current security measures and those of our third-party service providers may not always be adequate for the protection of our customer, employee, or company data. We may be a target for computer hackers, foreign governments, or cyber terrorists in the future.\nUnauthorized access to our proprietary internal and customer data may be obtained through break-ins, sabotage, breach of our secure network by an unauthorized party, computer viruses, computer denial-of-service attacks, employee theft or misuse, breach of the security of the networks of our third-party service providers, or other misconduct. Because the techniques used by computer programmers who may attempt to penetrate and sabotage our proprietary internal and customer data change frequently and may not be recognized until launched against a target, we may be unable to anticipate these techniques.\nUnauthorized access to our proprietary internal and customer data may also be obtained through inadequate use of security controls. Any of such incidents may harm our reputation and adversely affect our business and results of operations. In addition, we may be subject to negative publicity about our security and privacy policies, systems, or measurements. Any failure to prevent or mitigate security breaches, cyber-attacks or other unauthorized access to our systems or disclosure of our customers data, including their personal information, could result in loss or misuse of such data, interruptions to our service system, diminished customer experience, loss of customer confidence and trust, impairment of our technology infrastructure, and harm our reputation and business, resulting in significant legal and financial exposure and potential lawsuits.\nYou may face difficulties in protecting your interests and exercising your rights as a stockholder of ours since we conduct substantially all of our operations in Hong Kong and all of our officers and directors reside in Hong Kong.\nWe conduct substantially all of our operations in Hong Kong. All of our current officers and directors reside outside the United States and substantially all of the assets of those persons are located outside of the United States. Because of this factor, it may be difficult for you to conduct due diligence on our company, our executive officers or directors and attend stockholders meetings if the meetings are held in China. As a result, our public stockholders may have more difficulty in protecting their interests through actions against our management, directors or major stockholders than would stockholders of a corporation doing business entirely or predominantly within the United States.\nIf we become subject to additional scrutiny, criticism and negative publicity involving U.S.-listed China-based companies, we may have to expend significant resources to investigate and resolve the matter which could harm our business operations, this offering and our reputation and could result in a loss of your investment in our ordinary shares, especially if such matter cannot be addressed and resolved favourably.\nRecently, U.S. public companies that have substantially all of their operations in China have been the subject of intense scrutiny, criticism and negative publicity by investors, financial commentators and regulatory agencies. Much of the scrutiny, criticism and negative publicity has centered around financial and accounting irregularities, a lack of effective internal controls over financial accounting, inadequate corporate governance policies or a lack of adherence thereto and, in some cases, allegations of fraud. As a result of the scrutiny, criticism and negative publicity, the publicly traded stock of many U.S.-listed China-based companies has decreased in value and, in some cases, has become virtually worthless. Many of these companies have been subject to shareholder lawsuits and SEC enforcement actions and have conducted internal and external investigations into the allegations. It is not clear what effect this sector-wide scrutiny, criticism and negative publicity will have on us, our business and this offering. If we become the subject of any unfavourable allegations, whether such allegations are proven to be true or untrue, we will have to expend significant resources to investigate such allegations and/or defend our company. This situation may be a major distraction to our management. If such allegations are not proven to be groundless, our business operations will be severely hindered and your investment in our ordinary shares could be rendered worthless.\nRisk of Investing in Hong Kong: Investments in Hong Kong issuers may subject the Fund to legal, regulatory, political, currency, security, and economic risk specific to Hong Kong. China is Hong Kongs largest trading partner, both in terms of exports and imports. Any changes in the Chinese economy, trade regulations or currency exchange rates, or a tightening of Chinas control over Hong Kong, including in connection with recent protests and unrest, may have an adverse impact on Hong Kongs economy.\nRisk of Investing in China: Investment exposure to China subjects the Fund to risks specific to China. China may be subject to considerable degrees of economic, political and social instability. Concerns about the rising government and household debt levels could impact the stability of the Chinese economy. China is an emerging market and demonstrates significantly higher volatility from time to time in comparison to developed markets. Over the last few decades, the Chinese government has undertaken reform of economic and market practices, including recent reforms to liberalize its capital markets and expand the sphere for private ownership of property in China. However, Chinese markets generally continue to experience inefficiency, volatility and pricing anomalies resulting from governmental influence, a lack of publicly available information and/or political and social instability. Internal social unrest or confrontations with other neighboring countries, including military conflicts in response to such events, may also disrupt economic development in China and result in a greater risk of currency fluctuations, currency convertibility, interest rate fluctuations and higher rates of inflation. China has experienced security concerns, such as terrorism and strained international relations, as well as major health crises. These health crises include, but are not limited to, the rapid and pandemic spread of novel viruses commonly known as SARS, MERS, and COVID-19 (Coronavirus). Such health crises could exacerbate political, social, and economic risks previously mentioned. Additionally, China is alleged to have participated in state-sponsored cyberattacks against foreign companies and foreign governments. Actual and threatened responses to such activity, including purchasing restrictions, sanctions, tariffs or cyberattacks on the Chinese government or Chinese companies, may impact Chinas economy and Chinese issuers of securities in which the Fund invests. Incidents involving Chinas or the regions security, including the contagion of infectious viruses or diseases, may cause uncertainty in Chinese markets and may adversely affect the Chinese economy and the Funds investments. Export growth continues to be a major driver of Chinas rapid economic growth. Elevated trade tensions between China and its trading partners, including the imposition of U.S. tariffs on certain Chinese goods and increased international pressure related to Chinese trade policy and forced technology transfers and intellectual property protections, may have a substantial impact on the Chinese economy. Reduction in spending on Chinese products and services, institution of additional tariffs or other trade barriers (including as a result of heightened trade tensions between China and the U.S. or in response to actual or alleged Chinese cyber activity), or a downturn in any of the economies of Chinas key trading partners may have an adverse impact on the Chinese economy. The continuation or worsening of the current political climate between China and the U.S. could result in additional regulatory restrictions being contemplated or imposed on the U.S. or in China that could impact the Funds ability to invest in certain companies. Chinese companies, including Chinese companies that are listed on U.S. exchanges, are not subject to the same degree of regulatory requirements, accounting standards or auditor oversight as companies in more developed countries, and as a result, information about the Chinese securities in which the Fund invests may be less reliable or complete. There may be significant obstacles to obtaining information necessary for investigations into or litigation against Chinese companies and shareholders may have limited legal remedies. Investments in China may be subject to loss due to expropriation or nationalization of assets and property or the imposition of restrictions on foreign investments and repatriation of capital. China has implemented a number of tax reforms in recent years and may amend or revise its existing tax laws and/or procedures in the future, possibly with retroactive effect. Changes in applicable Chinese tax law could reduce the after-tax profits of the Fund, directly or indirectly, including by reducing the after-tax profits of companies in China in which the Fund invests. Uncertainties in Chinese tax rules could result in unexpected tax liabilities for the Fund.\nRisks Related to our Common Stock\nTrading in our stock is limited by the SECs penny stock regulations.\nOur stock is categorized as a penny stock. The SEC has adopted Rule 15g-9 which generally defines penny stock to be any equity security that has a market price (as defined) less than US$ 5.00 per share or an exercise price of less than US $5.00 per share, subject to certain exclusions (e.g., net tangible assets in excess of $2,000,000 or average revenue of at least $6,000,000 for the last three years). The penny stock rules impose additional sales practice requirements on broker-dealers who sell to persons other than established customers and accredited investors. The penny stock rules require a broker-dealer, prior to a transaction in a penny stock not otherwise exempt from the rules, to deliver a standardized risk disclosure document in a form prepared by the SEC, which provides information about penny stocks and the nature and level of risks in the penny stock market. The broker-dealer also must provide the customer with current bid and offer quotations for the penny stock, the compensation of the broker-dealer and its salesperson in the transaction, and monthly account statements showing the market value of each penny stock held in the customers account. The bid and offer quotations, and the broker-dealer and salesperson compensation information, must be given to the customer orally or in writing prior to effecting the transaction and must be given to the customer in writing before or with the customers confirmation. In addition, the penny stock rules require that prior to a transaction in a penny stock not otherwise exempt from these rules, the broker-dealer must make a special written determination that the penny stock is a suitable investment for the purchaser and receive the purchasers written agreement to the transaction. Finally, broker-dealers may not handle penny stocks under $0.10 per share.\nThese disclosure requirements reduce the level of trading activity in the secondary market for the stock that is subject to these penny stock rules. Consequently, these penny stock rules would affect the ability of broker-dealers to trade our securities if we become subject to them in the future. The penny stock rules also could discourage investor interest in and limit the marketability of our common stock to future investors, resulting in limited ability for investors to sell their shares.\nFINRA sales practice requirements may also limit a shareholders ability to buy and sell our stock.\nIn addition to the penny stock rules described above, FINRA has adopted rules that require that in recommending an investment to a customer, a broker-dealer must have reasonable grounds for believing that the investment is suitable for that customer. Prior to recommending speculative low priced securities to their non-institutional customers, broker-dealers must make reasonable efforts to obtain information about the customers financial status, tax status, investment objectives and other information. Under interpretations of these rules, FINRA believes that there is a high probability that speculative low priced securities will not be suitable for at least some customers. The FINRA requirements make it more difficult for broker-dealers to recommend that their customers buy our common stock, which may limit your ability to buy and sell our stock and have an adverse effect on the market for our shares.\nThe market price of our common stock may be volatile.\nThe market price of our common stock has been and is likely in the future to be volatile. Our common stock price may fluctuate in response to factors such as:\nHalting of trading by the SEC or FINRA.\nAnnouncements by us regarding liquidity, legal proceedings, significant acquisitions, equity investments and divestitures, strategic relationships, addition or loss of significant customers and contracts, capital expenditure commitments, loan, note payable and agreement defaults, loss of our subsidiaries and impairment of assets,\nIssuance of convertible or equity securities for general or merger and acquisition purposes,\nIssuance or repayment of debt, accounts payable or convertible debt for general or merger and acquisition purposes,\nSale of a significant number of shares of our common stock by shareholders,\nGeneral market and economic conditions,\nQuarterly variations in our operating results,\nInvestor relation activities,\nAnnouncements of technological innovations,\nNew product introductions by us or our competitors,\nCompetitive activities, and\nAdditions or departures of key personnel.\nThese broad market and industry factors may have a material adverse effect on the market price of our common stock, regardless of our actual operating performance. These factors could have a material adverse effect on our business, financial condition, and/or results of operations.\nWe do not anticipate paying any cash dividends on our capital stock in the foreseeable future.\nWe have never declared or paid cash dividends on our capital stock. We currently intend to retain all of our future earnings, if any, to finance the growth and development of our business, and we do not anticipate paying any cash dividends on our capital stock in the foreseeable future. In addition, the terms of any future debt agreements may preclude us from paying dividends. As a result, capital appreciation, if any, of our common stock will be your sole source of gain for the foreseeable future. Item 1B. Unresolved Staff Comments.\nWe are a smaller reporting company as defined by Rule 12b-2 of the Securities Exchange Act of 1934 and are not required to provide the information under this item. The Company is undergoing a comment response to Staff comments primarily related to risks related to doing business in China and Hong Kong which it is in the process of responding to as of the date of this report. Item 2. Properties.\nThe Companys corporate address for administrative matters is 187 E. Warm Springs Road, Suite B307, Las Vegas, Nevada 89119; Phone: (702) 362-2677. Our executive and operating office is located at Room 1001, 10/F., Grandmark, No. 10 Granville Road, Tsim Sha Tsui, Kowloon, Hong Kong. We lease this space which consists of 640 sq ft of office for $2,562 (equal to approximately HK$20,000) per month. We believe that this space is adequate for our current and immediately foreseeable operating needs. Item 3. Legal Proceedings.\nWe know of no material, existing or pending legal proceedings against our company, nor are we involved as a plaintiff in any material proceeding or pending litigation. There are no proceedings in which any of our directors, officers or affiliates, or any registered or beneficial stockholder, is an adverse party or has a material interest adverse to our interest. Item 4. Mine Safety Disclosures.\nNot Applicable\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities.\nMarket Information\nOur common stock is currently quoted on Over-the-Counter Bulletin Board (OTCBB). Our common stock commenced quotation on the OTCBB under the trading symbol WGYY. On March 5, 2018, our symbol was changed to AJIA to reflect the Companys name change to Ajia Innogroup Holding Limited. Our common stock began trading in November 2016. Because we are quoted on the OTC Pink Sheet, our common stock may be less liquid, receive less coverage by security analysts and news media, and generate lower prices than might otherwise be obtained if it were listed on a national securities exchange.\nThe following table sets forth the high and low bid prices for our Common Stock per quarter as reported by the OTC Markets for the quarterly periods indicated below based on our fiscal year end June 30. These prices represent quotations between dealers without adjustment for retail mark-up, markdown or commission and may not represent actual transactions.\nFiscal Quarter\nHigh\nLow\nFirst Quarter (Jul. 1, 2020- Sept. 30, 2020)\n$ 0.75\n$ 0.55\nSecond Quarter (Oct. 1, 2020- Dec. 31, 2020)\n$ 0.90\n$ 0.55\nThird Quarter (Jan. 1, 2021 - Mar. 31, 2021)\n$ 1.50\n$ 0.42\nFourth Quarter (Apr. 1, 2021 - Jun. 30, 2021)\n$ 2.00\n$ 0.75\nFirst Quarter (Jul. 1, 2021- Sept. 30, 2021)\n$ 2.50\n$ 0.75\nSecond Quarter (Oct. 1, 2021- Dec. 31, 2021)\n$ 1.20\n$ 0.60\nThird Quarter (Jan. 1, 2022 - Mar. 31, 2022)\n$ 0.60\n$ 0.60\nFourth Quarter (Apr. 1, 2022 - Jun. 30, 2022)\n$ 0.60\n$ 0.60\nRecord Holders\nAs of June 30, 2022, the approximate number of registered holders of our common stock was 241. As of June 30, 2022, there were 109,225,000 shares of common stock issued and outstanding and there were 1,000 shares of preferred stock issued and outstanding. There were no shares of common stock subject to outstanding warrants, and there were no shares of common stock subject to outstanding stock options.\nSecurities Authorized for Issuance under Equity Compensation Plans\nNone.\nDividend Policy\nThe Company does not anticipate paying dividends on the Common Stock at any time in the foreseeable future. The Companys Board of Directors currently plans to retain earnings for the development and expansion of the Companys business. Any future determination as to the payment of dividends will be at the discretion of the Board of Directors of the Company and will depend on a number of factors including future earnings, capital requirements, financial conditions and such other factors as the Board of Directors may deem relevant.\nTransfer Agent\nOur Transfer Agent is:\nDirect Transfer, LLC a subsidiary of\nIssuer Direct Corporation\nOne Glenwood Avenue, Suite 1001\nRaleigh, NC, 27603\nWebsite: www.issuerdirect.com\nTel: 919.744.2722\nRecent Sales of Unregistered Securities:\nThe following sets forth certain information concerning securities which were sold or issued by us without the registration of the securities under the Securities Act of 1933 in reliance on exemptions from such registration requirements within the past two years:\nOn July 28, 2018, the Company issued a convertible promissory note in the amount of $300,000.00 to Full Yick International Ltd. Pursuant to the terms the convertible promissory note was convertible into 93,750,000 common shares of the Company at $0.0032 per share on July 31, 2019. On or about August 9, 2019, Full Yick International Ltd. exercised their option to convert the $300,000.00 note into 93,750,000 common shares of the Company, which constitutes approximately 92.8% of the issued and outstanding common shares of the Company, and instructed the Company to issue the shares to approximately 84 shareholders.\nOn March 19, 2020, the Company issued 1,000 shares of Series A Preferred Stock to MS. YIN LING WAN as security for advances made to the Company. The shares were issued in May 2020.\nIn April 2020, the Company issued 100,000 shares to Allied Precision Medicine Consultants as consideration for the MOU dated March 30, 2020.\nOn June 24, 2022, the Company issued an aggregate 8,000,000 shares of its common stock at the price of $0.6 per share to acquire 100% interest of Union.\nOn June 24, 2022, the Company issued 105,000 shares of common stock at the price of $0.6 per share to compensate certain directors in rendering services to the Company.\nThe sales of the above securities were exempt from registration under the Securities Act of 1933, as amended (Securities Act), in reliance upon Section 4(2) of the Securities Act, or Rule 701 promulgated under Section 3(b) of the Securities Act as transactions by an issuer not involving any public offering or pursuant to benefit plans and contracts relating to compensation as provided under Rule 701. The recipients of the securities in each of these transactions represented their intentions to acquire the securities for investment only and not with a view to or for sale in connection with any distribution thereof, and appropriate legends were placed upon the stock certificates issued in these transactions.\nExemption From Registration. The shares of Common Stock and Preferred Stock referenced herein were issued in reliance upon one of the following exemptions:\n(a)The shares of Common Stock referenced herein were issued in reliance upon the exemption from securities registration afforded by the provisions of Section 4(2) of the Securities Act of 1933, as amended, (Securities Act), based upon the following: (a) each of the persons to whom the shares of Common Stock were issued (each such person, an Investor) confirmed to the Company that it or he is an accredited investor, as defined in Rule 501 of Regulation D promulgated under the Securities Act and has such background, education and experience in financial and business matters as to be able to evaluate the merits and risks of an investment in the securities, (b) there was no public offering or general solicitation with respect to the offering of such shares, (c) each Investor was provided with certain disclosure materials and all other information requested with respect to the Company, (d) each Investor acknowledged that all securities being purchased were being purchased for investment intent and were restricted securities for purposes of the Securities Act, and agreed to transfer such securities only in a transaction registered under the Securities Act or exempt from registration under the Securities Act and (e) a legend has been, or will be, placed on the certificates representing each such security stating that it was restricted and could only be transferred if subsequently registered under the Securities Act or transferred in a transaction exempt from registration under the Securities Act.\n(b)The shares of common stock referenced herein were issued pursuant to and in accordance with Rule 506 of Regulation D and Section 4(2) of the Securities Act. We made this determination in part based on the representations of the Investor(s), which included, in pertinent part, that such Investor(s) was an accredited investor as defined in Rule 501(a) under the Securities Act, and upon such further representations from the Investor(s) that (a) the Investor is acquiring the securities for his, her or its own account for investment and not for the account of any other person and not with a view to or for distribution, assignment or resale in connection with any distribution within the meaning of the Securities Act, (b) the Investor agrees not to sell or otherwise transfer the purchased securities unless they are registered under the Securities Act and any applicable state securities laws, or an exemption or exemptions from such registration are available, (c) the Investor either alone or together with its representatives has knowledge and experience in financial and business matters such that he, she or it is capable of evaluating the merits and risks of an investment in us, and (d) the Investor has no need for the liquidity in its investment in us and could afford the complete loss of such investment. Our determination is made based further upon our action of (a) making written disclosure to each Investor prior to the closing of sale that the securities have not been registered under the Securities Act and therefore cannot be resold unless they are registered or unless an exemption from registration is available, (b) making written descriptions of the securities being offered, the use of the proceeds from the offering and any material changes in the Companys affairs that are not disclosed in the documents furnished, and (c) placement of a legend on the certificate that evidences the securities stating that the securities have not been registered under the Securities Act and setting forth the restrictions on transferability and sale of the securities, and upon such inaction of the Company of any general solicitation or advertising for securities herein issued in reliance upon Rule 506 of Regulation D and Section 4(2) of the Securities Act.\n(c) The shares of Common Stock referenced herein were issued pursuant to and in accordance with Rule 903 of Regulation S of the Act. We completed the offering of the shares pursuant to Rule 903 of Regulation S of the Act on the basis that the sale of the shares was completed in an offshore transaction, as defined in Rule 902(h) of Regulation S. We did not engage in any directed selling efforts, as defined in Regulation S, in the United States in connection with the sale of the shares. Each investor represented to us that the investor was not a U.S. person, as defined in Regulation S, and was not acquiring the shares for the account or benefit of a U.S. person. The agreement executed between us and each investor included statements that the securities had not been registered pursuant to the Act and that the securities may not be offered or sold in the United States unless the securities are registered under the Act or pursuant to an exemption from the Act. Each investor agreed by execution of the agreement for the shares: (i) to resell the securities purchased only in accordance with the provisions of Regulation S, pursuant to registration under the Act or pursuant to an exemption from registration under the Act; (ii) that we are required to refuse to register any sale of the securities purchased unless the transfer is in accordance with the provisions of Regulation S, pursuant to registration under the Act or pursuant to an exemption from registration under the Act; and (iii) not to engage in hedging transactions with regards to the securities purchased unless in compliance with the Act. All certificates representing the shares were or upon issuance will be endorsed with a restrictive legend confirming that the securities had been issued pursuant to Regulation S of the Act and could not be resold without registration under the Act or an applicable exemption from the registration requirements of the Act. Item 6. Selected Financial Data.\nWe are a smaller reporting company as defined by Rule 12b-2 of the Securities Exchange Act of 1934 and are not required to provide the information under this item. Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion should be read in conjunction with our audited financial statements and notes thereto included herein. We caution readers regarding certain forward looking statements in the following discussion and elsewhere in this report and in any other statement made by, or on our behalf, whether or not in future filings with the Securities and Exchange Commission. Forward-looking statements are statements not based on historical information and which relate to future operations, strategies, financial results or other developments. Forward looking statements are necessarily based upon estimates and assumptions that are inherently subject to significant business, economic and competitive uncertainties and contingencies, many of which are beyond our control and many of which, with respect to future business decisions, are subject to change. These uncertainties and contingencies can affect actual results and could cause actual results to differ materially from those expressed in any forward looking statements made by, or our behalf. We disclaim any obligation to update forward-looking statements.\nOverview\nWe qualify as an emerging growth company under the JOBS Act. As a result, we are permitted to, and intend to, rely on exemptions from certain disclosure requirements. For so long as we are an emerging growth company, we will not be required to:\nhave an auditor report on our internal controls over financial reporting pursuant to Section 404(b) of the Sarbanes-Oxley Act;\ncomply with any requirement that may be adopted by the Public Company Accounting Oversight Board regarding mandatory audit firm rotation or a supplement to the auditors report providing additional information about the audit and the financial statements (i.e., an auditor discussion and analysis);\nsubmit certain executive compensation matters to shareholder advisory votes, such as say-on-pay and say-on-frequency; and\ndisclose certain executive compensation related items such as the correlation between executive compensation and performance and comparisons of the CEOs compensation to median employee compensation.\nIn addition, Section 107 of the JOBS Act also provides that an emerging growth company can take advantage of the extended transition period provided in Section 7(a)(2)(B) of the Securities Act for complying with new or revised accounting standards. In other words, an emerging growth company can delay the adoption of certain accounting standards until those standards would otherwise apply to private companies. We have elected to take advantage of the benefits of this extended transition period. Our financial statements may therefore not be comparable to those of companies that comply with such new or revised accounting standards.\nWe will remain an emerging growth company for up to five years, or until the earliest of (i) the last day of the first fiscal year in which our total annual gross revenues exceed $1 billion, (ii) the date that we become a large accelerated filer as defined in Rule 12b-2 under the Exchange Act, which would occur if the market value of our ordinary shares that is held by non-affiliates exceeds $700 million as of the last business day of our most recently completed second fiscal quarter or (iii) the date on which we have issued more than $1 billion in non-convertible debt during the preceding three year period.\nComparison of the Years Ended June 30, 2022 and 2021\nDuring the years ended June 30, 2022 and 2021, COVID-19 affected the operational and financial performance of the Company: Hong Kong, PRC, and United States national economic shutdown that was imposed to limit the spread of COVID-19. Both global and local markets have suffered huge public and private financial and economic losses. The closures resulting from COVID have required management to focus on making rapid decisions to protect employees, address new customers concerns and needs and shareholder support. Management has had to readjust and act-Resolve, Resilience, Return, Reimagination, and Reform- both in order to address to immediate crisis and to prepare for the next normal after the battle against coronavirus has been won.\nAs of June 30, 2022, we suffered from a working capital deficit of $827,447. As a result, our continuation as a going concern is dependent upon improving our profitability and the continuing financial support from our stockholders or other capital sources. Management believes that the continuing financial support from the existing shareholders and external financing will provide the additional cash to meet our obligations as they become due. Our financial statements do not include any adjustments to reflect the possible future effects on the recoverability and classification of assets and liabilities that may result in the Company not being able to continue as a going concern.\nThe following table sets forth certain operational data for the year ended June 30, 2022, compared to the year ended June 30, 2021:\nYears ended June 30,\nRevenue\n$ 112,462\n$ 98,394\nCost of revenue\n(15,190 )\n(6,504 )\nGross profit\n97,272\n91,890\nGeneral and administrative expenses\n(448,347 )\n(215,718 )\nProfessional fees\n(62,286 )\n(69,487 )\nLoss from operation\n(413,361 )\n(193,315 )\nTotal other income\n9,053\nIncome tax expense\n-\n-\nNET LOSS\n$ (412,837 )\n$ (184,262 )\nRevenues\nDuring the years ended June 30, 2022 and 2021, we have derived income of $112,462 and $98,394 sales from the maintenance service from the catering system sales and income from insurance brokerage transactions.\nOperating Expenses\nThe Companys operating expenses for the years ended June 30, 2022 and 2021 were $510,633 and $285,205, respectively. Operating expenses during the year ended June 30, 2022 consisted of professional fees of $62,286 and general and administrative expense $448,347. Operating expenses during the year ended June 30, 2021 consisted of professional fees of $69,487 and general and administrative expense $215,718.\nTotal Other Income\nDuring the year ended June 30, 2022, the Company recorded total other income of $524, mainly consisted of government subsidy income of $514. During the year ended June 30, 2021, the Company recorded total other income of $9,053, mainly consisted of foreign exchange gain of $153, interest income of $2 and $8,898 of government subsidy income.\nNet Loss\nDuring the years ended June 30, 2022 and 2021, the Company recognized net losses of $412,837 and $184,262, respectively.\nLiquidity and Capital Resources\nAt June 30, 2022 and 2021, we had current assets of $192,399 and $106,752 which consisting of cash and cash equivalents, trade receivables, earnest deposit and prepaid expenses. At June 30, 2022 and 2021, our total current liabilities were $1,019,846 and $335,747, respectively consisting of other payables and accrued liabilities and due to related parties.\nWe believe that our current cash and other sources of liquidity discussed below are adequate to support general operations for at least the next 12 months.\nYears Ended June 30,\nNet cash used in operating activities\n$ (59,636 )\n$ (15,527 )\nNet cash used in investing activities\n(122,115 )\n-\nNet cash provided by financing activities\n$ 236,530\n$ 12,813\nNet Cash Used In Operating Activities.\nFor the year ended June 30, 2022, net cash used in operating activities was $59,636, which consisted primarily of a net loss of $412,837, depreciation of plant and equipment of $247, loss on disposal of a subsidiary of $161,559, stock-based compensation of $63,000, offset by a decrease in other receivables of $374 and an increase in other payables and accrued liabilities of $128,021.\nFor the year ended June 30, 2021, net cash used in operating activities was $15,527, which consisted primarily of a net loss of $184,262, offset by a decrease in accounts receivables of $3,871, offset by a decrease in prepayments and other receivables of $117, an increase in accounts payable and accrued liabilities of $164,518 and the depreciation of plant and equipment of $229.\nWe expect to continue to rely on cash generated through financing from our existing shareholders and private placements of our securities, however, to finance our operations and future acquisitions.\nNet Cash Used In Investing Activities.\nFor the year ended June 30, 2022, net cash used in investing activities was $122,115 consisting primarily of the cash outflow from acquisition of a subsidiary of $79,737 and cash outflow from disposal of a subsidiary of $42,378.\nFor the year ended June 30, 2021, no cash used in investing activities.\nNet Cash Provided By Financing Activities.\nFor the year ended June 30, 2022, net cash provided by financing activities was $236,530 consisting primarily of advances from the Companys related parties of $236,530.\nFor the year ended June 30, 2021, net cash provided by financing activities was $12,813 consisting primarily of advances from the Companys related parties.\nWe have not yet generated net profits from our operations. We will require additional funds to fully implement our plans. These funds may be raised through equity financing, debt financing, or other sources, which may result in the dilution in the equity ownership of our shares. We currently do not have any arrangements for additional financing and we may not be able to obtain financing when required. Our future is dependent upon our ability to obtain financing, a successful marketing and promotion program and, further in the future, achieving a profitable level of operations. The issuance of additional equity securities by us could result in a significant dilution in the equity interests of our current stockholders. Obtaining commercial loans, assuming those loans would be available, will increase our liabilities and future cash commitments. We will require additional funds to maintain our reporting status with the SEC and remain in good standing with the state of Nevada.\nCash Requirements /Future Financing\nThere is no historical financial information about us on which to base an evaluation of our performance. We are a development stage company and have not generated much revenue from operations. We cannot guarantee we will be successful in our business operations. Our business is subject to risks inherent in the establishment of a new business enterprise, including limited capital resources, possible delays in developing our website, and possible cost overruns due to the price and cost increases in supplies and services.\nWhile an officer and director has generally indicated a willingness to provide services and financial contributions if necessary, there are presently no agreements, arrangements, commitments, or specific understandings, either verbally or in writing, between any officer and director, and Ajia. During the first year of operations, our officer and director will also provide his labor at no charge.\nIf we are unable to meet our needs for cash from either the money that we raise from our offering, or possible alternative sources, then we may be unable to continue, develop, or expand our operations.\nWe have no plans to undertake any product research and development during the next twelve months. There are also no plans or expectations to acquire or sell any plant or plant equipment in the first year of operations.\nOff-Balance Sheet Arrangements\nWe do not have any off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources that is material to investors.\nAjia Innogroup Holdings, Limited has never been in bankruptcy or receivership.\nOffice\nThe Company has an administrative office is located at 187 E. Warm Springs Road, Suite B307 Las Vegas, NV 89119. The telephone number is: (702) 833-9872.\nCritical Accounting Policies\nWhile our significant accounting policies are more fully described in Note 3 to our financial statements, we believe the following accounting policies are the most critical to aid you in fully understanding and evaluating this management discussion and analysis\nRevenue recognition\nThe Companys revenue recognition policies are in compliance with ASC 605-35 Revenue Recognition. Revenue is recognized when a formal arrangement exists, the price is fixed or determinable, all obligations have been performed pursuant to the terms of the formal arrangement and collectability is reasonably assured.\nFor the Companys business in catering system development and training, monthly revenue is recognized when the Company satisfies its obligation by transferring control of the promised goods or performance of services to the customer.\nThe Company recognizes revenues on sales of its services, based on the terms of the customer agreement. The customer agreement takes the form of either a contract or a customer purchase order and each provides information with respect to the service being sold and the sales price. If the customer agreement does not have specific delivery or customer acceptance terms, revenue is recognized at the time the service is provided to the customer. The Company applies the following five steps in order to determine the appropriate amount of revenue to be recognized as it fulfils its obligations under each of its agreements:\nidentify the contract with a customer;\nidentify the performance obligations in the contract;\ndetermine the transaction price;\nallocate the transaction price to performance obligations in the contract; and\nrecognize revenue as the performance obligation is satisfied.\nComprehensive income or loss\nASC Topic 220, Comprehensive Income establishes standards for reporting and display of comprehensive income or loss, its components and accumulated balances. Comprehensive income or loss as defined includes all changes in equity during a period from non-owner sources. Accumulated comprehensive income or loss, as presented in the accompanying consolidated statement of stockholders deficit consists of changes in unrealized gains and losses on foreign currency translation. This comprehensive income or loss is not included in the computation of income tax expense or benefit.\nForeign currencies translation\nTransactions denominated in currencies other than the functional currency are translated into the functional currency at the exchange rates prevailing at the dates of the transaction. Monetary assets and liabilities denominated in currencies other than the functional currency are translated into the functional currency using the applicable exchange rates at the balance sheet dates. The resulting exchange differences are recorded in the statement of operations.\nThe reporting currency of the Company is United States Dollars (US$). The Companys subsidiaries operating in Hong Kong and the PRC maintained their books and records in their local currency, Hong Kong Dollars (HK$) and Renminbi Yuan (RMB), which are functional currencies as being the primary currency of the economic environment in which these entities operate.\nIn general, for consolidation purposes, assets and liabilities of its subsidiaries whose functional currency is not the US$ are translated into US$, in accordance with ASC Topic 830-30, Translation of Financial Statement, using the exchange rate on the balance sheet date. Revenues and expenses are translated at average rates prevailing during the period. The gains and losses resulting from translation of financial statements of foreign subsidiaries are recorded as a separate component of accumulated other comprehensive income within the statement of stockholders equity.\nContractual Obligations\nWe are a smaller reporting company as defined by Rule 12b-2 of the Securities Exchange Act of 1934 and are not required to provide the information under this item. Item 7A. Quantitative and Qualitative Disclosures about Market Risk.\nWe are a smaller reporting company as defined by Rule 12b-2 of the Securities Exchange Act of 1934 and are not required to provide the information under this item. Item 8. Financial Statements and Supplementary Data.\nAJIA INNOGROUP HOLDINGS, LTD.\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\nPage\nReport of Independent Registered Public Accounting Firm - J&S Associate\nReport of Independent Registered Public Accounting Firm - Total Asia Associates PLT\nConsolidated Balance Sheets as of June 30, 2022 and 2021\nConsolidated Statements of Operations And Comprehensive Loss for the Years ended June 30, 2022 and 2021\nConsolidated Statements of Cash Flows for the Years ended June 30, 2022 and 2021\nConsolidated Statements of Shareholders Deficit for the Years ended June 30, 2022 and 2021\nNotes to Consolidated Financial Statements\nto\nJ&S ASSOCIATE (AF002380)\n(Registered with US PCAOB and Malaysia MIA)\nB-11-14, Megan Avenue II,\n12, Jalan Yap Kwan Seng,\n50450, Kuala Lumpur, Malaysia.\nTel : +6019 280 2989\nEmail : info@jns-associate.com\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nThe Board of Director and Stockholder of\nAJIA INNOGROUP HOLDINGS LIMITED\nOpinion on the Financial Statement\nWe have audited the accompanying balance sheets of Ajia Innogroup Holdings Limited (the Company) as of June 30, 2022, the related statements of operations and comprehensive loss, changes in shareholders (deficit) equity and cash flows for the year ended June 30, 2022 and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of June 30, 2022, and the results of its operations and its cash flows for the year ended June 30, 2022, in conformity with accounting principles generally accepted in the United States of America.\nGoing Concern Uncertainty\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in note 2 to the financial statements, the Company experienced a net loss of $412,837 and suffered from negative cash flows from operations during the year and incurred an accumulated deficit of $1,118,412 as of June 30, 2022. These factors create an uncertainty as to the Companys ability to continue as a going concern. Managements plans in regard to these matters are also described in note 2. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Company's internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nCritical audit matters are matters arising from the current year audit of the financial statements that were communicated or are required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements, and (2) involved especially challenging, subjective, or complex judgements. We determined that there are no critical audit matters.\n/s/ J&S Associate\nCertified Public Accountants\nPCAOB Number: 6743\nWe have served as the Companys auditor since 2022.\nKuala Lumpur, Malaysia\nOctober 13, 2022\nTOTAL ASIA ASSOCIATES PLT\n(AF002128 & LLP0016837-LCA)\nA Firm registered with US PCAOB and Malaysian MIA\nNo. 36 G-2, Jalan Radin Anum, Bandar Sri Petaling,\n57000, Kuala Lumpur.\nTel: (603) 9057 3131\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nThe Board of Directors and Stockholders of\nAJIA INNOGROUP HOLDINGS, LTD.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheet of Ajia Innogroup Holdings, Ltd. and its subsidiaries (the ‘Company) as of June 30, 2021, and the related consolidated statements of operations and comprehensive income, changes in shareholders equity and cash flows for the year ended June 30, 2021, and the related notes (collectively referred to as the financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of June 30, 2021, and the results of its operations and its cash flows for the year ended June 30, 2021, in conformity with accounting principles generally accepted in the United States of America.\nGoing Concern Uncertainty\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in note 2 to the financial statements, the Company experienced a net loss of $184,262 and suffered from negative cash flows from operations during the year and incurred an accumulated deficit of $829,497 as of June 30, 2021. These factors create an uncertainty as to the Companys ability to continue as a going concern. Managements plans in regard to these matters are also described in note 2. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audit we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audit provides a reasonable basis for our opinion.\nCritical Audit Matters\nCritical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to those charged with governance that: (1) related to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgements. We determined that there are no critical matters.\n/s/ TOTAL ASIA ASSOCIATES PLT\nTOTAL ASIA ASSOCIATES PLT\nSeptember 28, 2021\nWe have served as the Companys auditor since 2018.\nKuala Lumpur, Malaysia\nAJIA INNOGROUP HOLDINGS, LTD.\nCONSOLIDATED BALANCE SHEETS\nAS OF JUNE 30, 2022 AND 2021\n(Currency expressed in United States Dollars (US$), except for number of shares)\nAs of June 30,\nASSETS\nCurrent assets:\nCash and cash equivalents\n$ 61,963\n$ 1,120\nDeposits and prepayments\n18,432\n-\nEarnest deposit\n105,000\n105,000\nOther receivables\n7,004\nTotal current assets\n192,399\n106,752\nNon-current assets:\nPlant and equipment, net\n29,737\nGoodwill\n5,029,592\n-\nTOTAL ASSETS\n$ 5,251,728\n$ 107,185\nLIABILITIES AND SHAREHOLDERS EQUITY (DEFICIT)\nCurrent liabilities:\nOther payables and accrued liabilities\n$ 422,654\n$ 215,075\nAmounts due to related parties\n597,192\n120,672\nTotal current liabilities\n1,019,846\n335,747\nCommitments and contingencies\n-\n-\nShareholders equity (deficit):\nPreferred stock, $0.001 par value, 100,000,000 shares authorized; 1,000 shares issued and outstanding at June 30, 2022 and 2021\nCommon stock, $0.001 par value; 500,000,000 shares authorized; 109,225,000 and 101,120,000 shares issued and outstanding as of June 30, 2022 and 2021\n109,225\n101,120\nAdditional paid-in capital\n5,358,445\n503,550\nNon-controlling interest\n(120,813 )\nAccumulated other comprehensive income (loss)\n3,436\n(4,368 )\nAccumulated deficit\n(1,118,412 )\n(829,497 )\nTotal shareholders equity (deficit)\n4,231,882\n(228,562 )\nTOTAL LIABILITIES AND SHAREHOLDERS EQUITY (DEFICIT)\n$ 5,251,728\n$ 107,185\nSee accompanying notes to consolidated financial statements.\nAJIA INNOGROUP HOLDINGS, LTD.\nCONSOLIDATED STATEMENTS OF OPERATIONS AND COMPREHENSIVE LOSS\nFOR THE YEARS ENDED JUNE 30, 2022 AND 2021\n(Currency expressed in United States Dollars (US$), except for number of shares)\nYears ended June 30,\nRevenues, net\n$ 112,462\n$ 98,394\nCost of revenue\n(15,190 )\n(6,504 )\nGross profit\n97,272\n91,890\nOperating expenses:\nGeneral and administrative\n(448,347 )\n(215,718 )\nProfessional fee\n(62,286 )\n(69,487 )\nTotal operating expenses\n(510,633 )\n(285,205 )\nLOSS FROM OPERATIONS\n(413,361 )\n(193,315 )\nOther income:\nForeign exchange gain\n-\nGovernment subsidy\n8,898\nSundry income\n-\nInterest income\n-\nTotal other income\n9,053\nLOSS BEFORE INCOME TAXES\n(412,837 )\n(184,262 )\nIncome tax expense\n-\n-\nNET LOSS\n$ (412,837 )\n$ (184,262 )\nNet loss attributable to non-controlling interest\n(123,922 )\n-\nNet loss attributable to Ajia Innogroup Holdings, Ltd. shareholders\n$ (288,915 )\n$ (184,262 )\nOther comprehensive loss:\n- Foreign currency translation gain (loss)\n6,191\n(1,612 )\n- Release of foreign currency translation upon sale of a subsidiary\n1,613\n-\nCOMPREHENSIVE LOSS\n$ (281,111 )\n$ (185,874 )\nNet loss per share - Basic and diluted\n$ (0.00 )\n$ (0.00 )\nWeighted average shares outstanding - Basic and diluted\n101,275,438\n101,120,000\nSee accompanying notes to consolidated financial statements.\nAJIA INNOGROUP HOLDINGS, LTD.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nFOR THE YEARS ENDED JUNE 30, 2022 AND 2021\n(Currency expressed in United States Dollars (US$))\nYears ended June 30,\nCash flows from operating activities:\nNet loss\n$ (412,837 )\n$ (184,262 )\nAdjustment to reconcile net loss to net cash used in operating activities\nDepreciation and amortization\nStock-based compensation\n63,000\n-\nLoss on disposal of a subsidiary\n161,559\n-\nChange in operating assets and liabilities:\nOther receivables\n3,871\nDeposits and prepayments\n-\nOther payables and accrued liabilities\n128,021\n164,518\nNet cash used in operating activities\n(59,636 )\n(15,527 )\nCash flows from investing activities:\nCash from acquisition of a subsidiary\n(79,737 )\n-\nCash from disposal of a subsidiary\n(42,378 )\n-\nNet cash used in investing activities\n(122,115 )\n-\nCash flows from financing activities:\nAdvances from a director\n236,530\n12,813\nNet cash provided by financing activities\n236,530\n12,813\nEffect of exchange rate changes on cash and cash equivalents\n6,064\n(1,612 )\nNet change in cash and cash equivalents\n60,843\n(4,326 )\nCASH AND CASH EQUIVALENT, BEGINNING OF YEAR\n1,120\n5,446\nCASH AND CASH EQUIVALENT, END OF YEAR\n$ 61,963\n$ 1,120\nSUPPLEMENTAL DISCLOSURE OF CASH FLOW INFORMATION:\nCash paid for income taxes\n$ -\n$ -\nCash paid for interest\n$ -\n$ -\nSee accompanying notes to consolidated financial statements.\nAJIA INNOGROUP HOLDINGS, LTD.\nCONSOLIDATED STATEMENTS OF CHANGES IN SHAREHOLDERS EQUITY (DEFICIT)\nFOR THE YEARS ENDED JUNE 30, 2022 AND 2021\n(Currency expressed in United States Dollars (US$), except for number of shares)\nEquity attributable to Ajia Innogroup Holdings, Ltd.\nPreferred stock\nCommon stock\nAdditional\nAccumulated\nother\ncomprehensive\nNon-\nTotal\nstockholders\nNo. of\nshares\nAmount\nNo. of\nshares\nAmount\npaid-in\ncapital\nincome\n(loss)\nAccumulated\ndeficit\ncontrolling interest\nequity\n(deficit)\nBalance as of July 1, 2020\n1,000\n$ 1\n101,120,000\n$ 101,120\n$ 503,550\n$ (2,756 )\n$ (645,235 )\n$ -\n$ (43,320 )\nAcquisition of a subsidiary\n-\n-\n-\n-\n-\n-\n-\nNet loss for the year\n-\n-\n-\n-\n-\n-\n(184,262 )\n-\n(184,262 )\nForeign currency translation adjustment\n-\n-\n-\n-\n-\n(1,612 )\n-\n-\nBalance as of June 30, 2021\n1,000\n$ 1\n101,120,000\n$ 101,120\n$ 503,550\n$ (4,368 )\n$ (829,497 )\n$ 632\n$ (228,562 )\nBalance as of July 1, 2021\n1,000\n$ 1\n101,120,000\n$ 101,120\n$ 503,550\n$ (4,368 )\n$ (829,497 )\n$ 632\n$ (228,562 )\nAcquisition of a subsidiary\n-\n-\n8,000,000\n8,000\n4,854,895\n-\n36,921\n4,899,816\nDisposal of a subsidiary\n-\n-\n-\n-\n-\n1,613\n-\n(34,444 )\n(32,831 )\nStock-based compensation\n-\n-\n105,000\n-\n-\n-\n-\nNet loss for the year\n-\n-\n-\n-\n-\n-\n(288,915 )\n(123,922 )\n(412,837 )\nForeign currency translation adjustment\n-\n-\n-\n-\n-\n6,191\n-\n-\n6,191\nBalance as of June 30, 2022\n1,000\n$ 1\n109,225,000\n$ 109,225\n$ 5,358,445\n$ 3,436\n$ (1,118,412 )\n$ (120,813 )\n$ 4,231,882\nSee accompanying notes to consolidated financial statements.\nAJIA INNOGROUP HOLDINGS, LTD.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED JUNE 30, 2022 AND 2021\n(Currency expressed in United States Dollars (US$), except for number of shares)\n1. ORGANIZATION AND BUSINESS BACKGROUND\nAjia Innogroup Holdings, Ltd., formerly Wigi4you, Inc. (the Company or AJIA) was incorporated in the State of Nevada on March 19, 2014.\nAs of June 30, 2022, the details of the Companys subsidiaries are described below:\nName\nPlace of incorporation\nand kind of\nlegal entity\nPrincipal activities\nand place of operation\nParticulars of issued/\nregistered share\ncapital\nEffective interest\nHeld\nSplendor Radiant Limited (SRL)\nBritish Virgin Islands, a limited liability company\nInvestment holding\n1 issued share of US$1 each\n100%\nA Jia Creative Holdings Limited(ACHL)\nHong Kong, a limited liability company\nProvision of food and beverage sales system setup and maintenance service\n100 ordinary shares for HK$100\n100%\nGuangzhou Shengjia Trading Co., Ltd (GSTL)\nThe PRC, a limited liability company\nProvision of mobile app back-end support service\nHK$1,000,000\n100%\nAjia Corporate Systems Architecture Solution Limited (ACSL)\nHong Kong, a limited liability company\nProvision of money lending, insurance brokerage and business development trustee service\n10,000 ordinary shares for HK$10,000\n51%\nUnion Passenger Limited (UPL)\nHong Kong, a limited liability company\nProvision of catering member service solutions and service platform\n1,000 ordinary shares for HK$1,000\n100%\nAJIA and its subsidiaries are hereinafter referred to as (the Company).\nThe Company had intended to provide a website and mobile app to assist event planners in locating performers, bands and speakers, booking locations and planning events in areas around the United States and Canada. However, The Company changed its business plan in 2017 and is currently planning to pursue the business in having self-help photo kiosks to be implemented at major convenient locations, such as shopping mall, buildings near subway stations, etc. to attract customers to use the service. In addition, the Company provides system development consulting and training services. The main revenue for these businesses will be generated from the self-help photo kiosks at which one can do photo printing, WeChat printing, game commemorative photos, copying documents, etc., as well as from consulting contracts.\nIn June 2021, ACSA purchased 51% shares of JiaYu Insurance Finance limited (JYIF), which is a licensed Insurance brokerage firm in Hong Kong. JYIFs primary role is to provide local lump sum universal life, annuity assurance and offshore insurance products both life and non-life, which include compliant US PPLI, UL, and IUL policies, to designated clients asset growth purposes with complied tax solutions. There is a growing need and demand for Asian clients to purchase compliant PPLI, UL, and IUL policies in order to receive tax benefits and investment returns, and these products are becoming increasingly popular. The Company utilizes Hong Kong as a hub to organize US PPLI, UL, and IUL policies for high-net-worth clients from China, Japan, Taiwan, Korea, Thailand, and Indonesia. PPLI, IUL, and UL policies are increasingly in demand, and the Company has a professional technical team as well as US lawyers and tax advisors on hand to service these clients as a one-stop shop for all their insurance needs.\nIn June 2022, the Company purchased 100% shares of Union Passenger Limited (UPL), a company incorporated in Hong Kong. According to the acquisition agreement, the Company will appoint UPL as its exclusive partner for the promotion of Companys catering, services and total solutions for restaurants in Asia (Products). The Company shall share 100% of the profits and losses of the offering of Products to third party customers which are introduced by UPL.\n2. GOING CONCERN UNCERTAINTIES\nThe accompanying consolidated financial statements have been prepared using the going concern basis of accounting, which contemplates the realization of assets and the satisfaction of liabilities in the normal course of business.\nThe Company experienced a net loss of $412,837 and suffered from negative cash flows from operations during the year and incurred an accumulated deficit of $1,118,412 as of June 30, 2022. The continuation of the Company as a going concern through June 30, 2023 is dependent upon the continued financial support from its stockholders. Management believes the Company is currently pursuing additional financing for its operations. However, there is no assurance that the Company will be successful in securing sufficient funds to sustain the operations.\nThese and other factors raise substantial doubt about the Companys ability to continue as a going concern. These consolidated financial statements do not include any adjustments to reflect the possible future effects on the recoverability and classification of assets and liabilities that may result in the Company not being able to continue as a going concern.\n3. SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\n·\nBasis of presentation\nThese accompanying consolidated financial statements of the Company have been prepared in accordance with generally accepted accounting principles in the United States of America (US GAAP).\n·\nUse of estimates\nIn preparing these consolidated financial statements, management makes estimates and assumptions that affect the reported amounts of assets and liabilities in the balance sheets and revenues and expenses during the years reported. Actual results may differ from these estimates.\n·\nBasis of consolidation\nThe consolidated financial statements include the financial statements of AJIA and its subsidiaries. All significant inter-company balances and transactions within the Company have been eliminated upon consolidation.\n· Business combinations\nThe Company accounts for its business combinations using the acquisition method of accounting. The cost of an acquisition is measured as the aggregate of the acquisition date fair values of the assets transferred and liabilities assumed by the Company to the sellers cash consideration and equity instruments issued. Transaction costs directly attributable to the acquisition are expensed as incurred. The excess of (i) the total costs of acquisition over (ii) the fair value of the identifiable net assets of the acquiree is recorded as identifiable intangible assets and goodwill.\n·\nCash and cash equivalents\nCash and cash equivalents are carried at cost and represent cash on hand, demand deposits placed with banks or other financial institutions and all highly liquid investments with an original maturity of three months or less as of the purchase date of such investments.\n·\nPlant and equipment\nPlant and equipment are stated at cost less accumulated depreciation and accumulated impairment losses, if any. Depreciation is calculated on the straight-line basis over the following expected useful lives from the date on which they become fully operational and after taking into account their estimated residual values:\nExpected useful lives\nComputer equipment\n5 years\nLeasehold improvement\n3 years\nFurniture & fixtures\n3 years\nComputer software\n3 years\nExpenditures for repairs and maintenance are expensed as incurred. When assets have been retired or sold, the cost and related accumulated depreciation are removed from the accounts and any resulting gain or loss is recognized in the results of operations.\n· Goodwill\nGoodwill represents the excess of purchase price over the fair value of identifiable net assets acquired in a business combination. Goodwill is tested for impairment at least annually in accordance with the provisions of ASC Topic 350, Intangibles-Goodwill and Other (ASC 350). Under ASC 350, annual or interim goodwill impairment testing is performed by comparing the estimated fair value of a reporting unit with its carrying amount. An impairment charge is recognized for the amount by which the carrying amount exceeds the reporting units fair value, not to exceed the carrying value of goodwill.\n·\nImpairment of long-lived assets\nIn accordance with the provisions of ASC Topic 360, Impairment or Disposal of Long-Lived Assets, all long-lived assets such as plant and equipment held and used by the Company are reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable. Recoverability of assets to be held and used is evaluated by a comparison of the carrying amount of an asset to its estimated future undiscounted cash flows expected to be generated by the asset. If such assets are considered to be impaired, the impairment to be recognized is measured by the amount by which the carrying amounts of the assets exceed the fair value of the assets. There has been no impairment charge for the years presented.\n·\nRevenue recognition\nThe Companys revenue recognition policies are in compliance with ASC 605-35 Revenue Recognition. Revenue is recognized when a formal arrangement exists, the price is fixed or determinable, all obligations have been performed pursuant to the terms of the formal arrangement and collectability is reasonably assured.\nFor the Companys business in catering system development and training, monthly revenue is recognized when the Company satisfies its obligation by transferring control of the promised goods or performance of services to the customer.\nThe Company recognizes revenues on sales of its services, based on the terms of the customer agreement. The customer agreement takes the form of either a contract or a customer purchase order and each provides information with respect to the service being sold and the sales price. If the customer agreement does not have specific delivery or customer acceptance terms, revenue is recognized at the time the service is provided to the customer. The Company applies the following five steps in order to determine the appropriate amount of revenue to be recognized as it fulfills its obligations under each of its agreements:\nidentify the contract with a customer;\nidentify the performance obligations in the contract;\ndetermine the transaction price;\nallocate the transaction price to performance obligations in the contract; and\nrecognize revenue as the performance obligation is satisfied.\n·\nComprehensive income or loss\nASC Topic 220, Comprehensive Income establishes standards for reporting and display of comprehensive income or loss, its components and accumulated balances. Comprehensive income or loss as defined includes all changes in equity during a period from non-owner sources. Accumulated comprehensive income or loss, as presented in the accompanying consolidated statement of stockholders deficit consists of changes in unrealized gains and losses on foreign currency translation. This comprehensive income or loss is not included in the computation of income tax expense or benefit.\n·\nIncome taxes\nThe provision for income taxes is determined in accordance with the provisions of ASC Topic 740, Income Taxes (ASC 740). Under this method, deferred tax assets and liabilities are recognized for the future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax basis. Deferred tax assets and liabilities are measured using enacted income tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. Any effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date.\nASC 740 prescribes a comprehensive model for how companies should recognize, measure, present, and discloses in their financial statements uncertain tax positions taken or expected to be taken on a tax return. Under ASC 740, tax positions must initially be recognized in the financial statements when it is more likely than not the position will be sustained upon examination by the tax authorities. Such tax positions must initially and subsequently be measured as the largest amount of tax benefit that has a greater than 50% likelihood of being realized upon ultimate settlement with the tax authority assuming full knowledge of the position and relevant facts.\nThe Company did not have any unrecognized tax positions or benefits and there was no effect on the financial condition or results of operations for the years ended June 30, 2022 and 2021. The Company and its subsidiaries are subject to local and various foreign tax jurisdictions. The Companys tax returns remain open subject to examination by major tax jurisdictions.\n·\nNet loss per share\nThe Company calculates net loss per share in accordance with ASC Topic 260 Earnings per Share. Basic loss per share is computed by dividing the net loss by the weighted-average number of common shares outstanding during the period. Diluted loss per share is computed similar to basic loss per share except that the denominator is increased to include the number of additional common shares that would have been outstanding if the potential common stock equivalents had been issued and if the additional common shares were dilutive.\n·\nForeign currencies translation\nTransactions denominated in currencies other than the functional currency are translated into the functional currency at the exchange rates prevailing at the dates of the transaction. Monetary assets and liabilities denominated in currencies other than the functional currency are translated into the functional currency using the applicable exchange rates at the balance sheet dates. The resulting exchange differences are recorded in the statement of operations.\nThe reporting currency of the Company is United States Dollars (US$). The Companys subsidiaries operating in Hong Kong and the PRC maintained their books and records in their local currency, Hong Kong Dollars (HK$) and Renminbi Yuan (RMB), which are functional currencies as being the primary currency of the economic environment in which these entities operate.\nIn general, for consolidation purposes, assets and liabilities of its subsidiaries whose functional currency is not the US$ are translated into US$, in accordance with ASC Topic 830-30, Translation of Financial Statement, using the exchange rate on the balance sheet date. Revenues and expenses are translated at average rates prevailing during the period. The gains and losses resulting from translation of financial statements of foreign subsidiaries are recorded as a separate component of accumulated other comprehensive income within the statement of stockholders equity.\nTranslation of amounts from its reporting currencies into US$ has been made at the following exchange rates for the respective year:\nYear-end HK$:US$1 exchange rate\n7.8469\n7.7654\nAnnual average HK$:US$1 exchange rate\n7.8049\n7.7566\nYear-end RMB:US$1 exchange rate\n6.6991\n6.4608\nAnnual average RMB:US$1 exchange rate\n6.4550\n6.6192\n·\nRetirement plan costs\nContributions to retirement plans (which are defined contribution plans) are charged to general and administrative expenses in the accompanying statements of operation as the related employee service is provided.\n·\nRelated parties\nParties, which can be a corporation or individual, are considered to be related if the Company has the ability, directly or indirectly, to control the other party or exercise significant influence over the other party in making financial and operating decisions. Companies are also considered to be related if they are subject to common control or common significant influence.\n·\nStock-based compensation\nThe Company recognizes stock-based compensation in accordance with ASC Topic 718 Stock Compensation, which requires the measurement and recognition of compensation expense for all share-based payment awards made to employees and directors including employee stock options and employee stock purchases related to an Employee Stock Purchase Plan based on the estimated fair values.\nFor non-employee stock-based compensation, the Company has adopted ASC 2018-07, Improvements to Nonemployee Share-Based Payment Accounting which expands on the scope of ASC 718 to include share-based payment transactions for acquiring services from non-employees and requires stock-based compensation related to non-employees to be accounted for based on the fair value of the related stock or the fair value of the services at the grant date, whichever is more readily determinable in accordance with ASC Topic 718.\n·\nSegment reporting\nASC Topic 280, Segment Reporting establishes standards for reporting information about operating segments on a basis consistent with the Companys internal organization structure as well as information about geographical areas, business segments and major customers in financial statements. For the years ended June 30, 2022 and 2021, the Company operates in one reportable operating segment in Hong Kong.\n·\nConcentration of credit risk\nThe Company is subject to credit risk through its accounts receivable consisting primarily of amounts due from franchisees for royalty income, and other products. The financial condition of these franchisees is largely dependent upon the underlying business trends of our brands and market conditions within the vending industry. This concentration of credit risk is mitigated, in part, by the large number of franchisees spread over a large geographical area and the short-term nature of the receivables.\n·\nCommitments and contingencies\nThe Company follows the ASC 450-20, Commitments to report accounting for contingencies. Certain conditions may exist as of the date the financial statements are issued, which may result in a loss to the Company but which will only be resolved when one or more future events occur or fail to occur. The Company assesses such contingent liabilities, and such assessment inherently involves an exercise of judgment. In assessing loss contingencies related to legal proceedings that are pending against the Company or un-asserted claims that may result in such proceedings, the Company evaluates the perceived merits of any legal proceedings or un-asserted claims as well as the perceived merits of the amount of relief sought or expected to be sought therein.\nIf the assessment of a contingency indicates that it is probable that a material loss has been incurred and the amount of the liability can be estimated, then the estimated liability would be accrued in the Companys financial statements. If the assessment indicates that a potentially material loss contingency is not probable but is reasonably possible, or is probable but cannot be estimated, then the nature of the contingent liability, and an estimate of the range of possible losses, if determinable and material, would be disclosed.\nLoss contingencies considered remote are generally not disclosed unless they involve guarantees, in which case the guarantees would be disclosed. Management does not believe, based upon information available at this time that these matters will have a material adverse effect on the Companys financial position, results of operations or cash flows. However, there is no assurance that such matters will not materially and adversely affect the Companys business, financial position, and results of operations or cash flows.\n·\nFair value of financial instruments\nThe carrying value of the Companys financial instruments: cash and cash equivalents, prepayments and other receivables, accounts payable, amount due to a related party, other payables and accrued liabilities approximate at their fair values because of the short-term nature of these financial instruments.\nThe Company also follows the guidance of the ASC Topic 820-10, Fair Value Measurements and Disclosures (ASC 820-10), with respect to financial assets and liabilities that are measured at fair value. ASC 820-10 establishes a three-tier fair value hierarchy that prioritizes the inputs used in measuring fair value as follows:\nLevel 1 : Observable inputs such as quoted prices in active markets;\nLevel 2 : Inputs, other than the quoted prices in active markets, that are observable either directly or indirectly; and\nLevel 3 : Unobservable inputs in which there is little or no market data, which require the reporting entity to develop its own assumptions\nFair value estimates are made at a specific point in time based on relevant market information about the financial instrument. These estimates are subjective in nature and involve uncertainties and matters of significant judgment and, therefore, cannot be determined with precision. Changes in assumptions could significantly affect the estimates.\n·\nRecent accounting pronouncements\nThe Company has considered all new accounting pronouncements and has concluded that there are no new pronouncements that may have a material impact on the results of operations, financial condition, or cash flows, based on the current information.\n4. BUSINESS COMBINATION\nAcquisition of JYIF\nOn July 1, 2021, the Company completed the acquisition of 51% equity interest of JiaYu Insurance Finance Limited (JYIF). The total consideration of the acquisition is $137,919.\nThe purchase price allocation resulted in $127,399 of goodwill, as below:\nAcquired assets:\nUS$\nCash and cash equivalents\n$ 2,596\nPrepayments\n1,743\nPlant and equipment\n2,138\nAmount due from related parties\n21,203\n27,680\nLess: Assumed liabilities\nAccrued liabilities and other payables\n(7,053 )\n(7,053 )\nFair value of net assets acquired\n20,627\nNon-controlling interest\n(10,107 )\nGoodwill recorded\n127,399\nCash consideration allocated\n$ 137,919\nDuring the year ended June 30, 2022, the Company disposed of its 51% equity interest and resulted with a loss of $161,559.\nAcquisition of UPL\nOn June 30, 2022, the Company completed the acquisition of 100% equity interest of Union Passenger Limited (Union) (the Acquisition). The total consideration of the acquisition is issuance of an aggregate 8,000,000 restricted share of Company common stock (valued at $0.60 per share, equivalent to $4,800,000).\nThe purchase price allocation resulted in $5,029,592 of goodwill, as below:\nAcquired assets:\nUS$\nCash and cash equivalents\n$ 53,942\nDeposits\n18,432\nPlant and equipment\n29,401\nOther receivable\n6,372\nAmounts due from related parties\n24,545\n132,692\nLess: Assumed liabilities\nAccounts payable\n(61,324 )\nAccrued liabilities and other payables\n(14,222 )\nAmounts due to related parties\n(286,738 )\n(362,284 )\nFair value of net liabilities acquired\n(229,592 )\nGoodwill recorded\n5,029,592\nConsideration allocated\n$ 4,800,000\n5. PLANT AND EQUIPMENT\nPlant and equipment consisted of the following:\nAs of June 30,\nAt cost:\nComputer equipment\n$ 1,291\n$ 1,128\nComputer software\n27,872\n-\nFurniture and fixtures, at cost\n1,529\n-\nForeign translation difference\n(12 )\n30,680\n1,138\nLess: accumulated depreciation\n(949 )\n(702 )\nLess: foreign translation difference\n(3 )\n$ 29,737\n$ 433\nDepreciation expense for the years ended June 30, 2022 and 2021 were $247 and $229, respectively.\n6. AMOUNTS DUE TO RELATED PARTIES\nAs of June 30, 2022 and 2021, amounts due to related parties represented temporary advances made by a director of the Company, Ms. WAN Yin Ling, and shareholders of the Company, Mr. WONG Bik Chun and Mr. POON Wai Han, which were unsecured, interest-free and had no fixed terms of repayment.\n7. INCOME TAXES\nThe Company operates in various countries: United States, British Virgin Island, Hong Kong and the PRC that are subject to taxes in the jurisdictions in which they operate, as follows:\nUnited States of America\nAJIA is registered in the State of Nevada and is subject to the tax laws of United States of America. The U.S. Tax Cuts and Jobs Act (the Tax Reform Act) was signed into law. The Tax Reform Act significantly revised the U.S. corporate income tax regime by, among other things, lowering the U.S. corporate tax rate from 35% to 21% effective January 1, 2018. The Companys policy is to recognize accrued interest and penalties related to unrecognized tax benefits in its income tax provision. The Company has not accrued or paid interest or penalties which were not material to its results of operations for the periods presented. Deferred tax asset is not provided for as the tax losses may not be able to carry forward after a change in substantial ownership of the Company.\nFor the years ended June 30, 2022 and 2021, there were no operating income.\nBritish Virgin Island\nUnder the current BVI law, SRL is not subject to tax on income.\nHong Kong\nACHL, ACSL and UPL are subject to Hong Kong tax regime. For the years ended June 30, 2022 and 2021, no provision for Hong Kong Profits Tax is provided for, since the Companys income neither arises in, nor is derived from Hong Kong under its applicable tax law. The reconciliation of income tax rate to the effective income tax rate based on loss before income taxes from foreign operation for the years ended June 30, 2022 and 2021 are as follows:\nYears ended June 30,\nLoss before income taxes\n$ (120,425 )\n$ (43,818 )\nStatutory income tax rate\n16.5 %\n16.5 %\nIncome tax impact at the statutory rate\n(19,870 )\n(7,230 )\nNon-deductible items\n26,708\nNon-taxable item\n(85 )\n-\nDeductible items\n(27 )\n(1,519 )\nNet operating loss\n(6,726 )\n8,712\nIncome tax expense\n$ -\n$ -\nThe PRC\nFor the years ended June 30, 2022 and 2021, GSTL generated no operating result and accordingly, no provision for income tax has been recorded.\nAs of June 30, 2022, GSTL incurred $30,809 of net operating losses carryforward available for income tax purposes that may be used to offset future taxable income and will begin to expire in 5 years from the year of incurrence, if unutilized. The Company has provided for a full valuation allowance against the deferred tax assets on the expected future tax benefits from the net operating loss carryforwards as the management believes it is more likely than not that these assets will not be realized in the future.\nThe following table sets forth the significant components of the aggregate net deferred tax assets of the Company as of June 30, 2022 and 2021:\nAs of June 30,\nDeferred tax assets:\nNet operating loss carryforward from:\n- United States of America\n$ 222,065\n$ 160,892\n- Hong Kong\n62,137\n26,632\n- The PRC\n7,702\n7,424\nTotal deferred tax assets\n291,904\n194,948\nLess: valuation allowance\n(291,904 )\n(194,948 )\nNet deferred tax assets\n$ -\n$ -\nAs of June 30, 2022, the Company incurred $1,118,412 the aggregate net operating loss carryforwards available to offset its taxable income for income tax purposes. The Company has provided for a full valuation allowance against the deferred tax assets of $291,904 on the expected future tax benefits from the net operating loss carryforwards as the management believes it is more likely than not that these assets will not be realized in the future. For the year ended June 30, 2022, the valuation allowance increased by $96,956, primarily relating to net operating loss carryforwards.\n8. PENSION COSTS\nContributions to retirement schemes (which are defined contribution plans) are charged to general and administrative expenses in the statements of operation and comprehensive income as and when the related employee service is provided.\nThe Company is required to make contribution under a defined contribution pension scheme for all of its eligible employees in Hong Kong. The Company is required to contribute a specified percentage of the participants relevant income based on their ages and wages level. The total contributions made were $568 and $2,895 for the years ended June 30, 2022 and 2021, respectively.\n9. SHAREHOLDERS EQUITY (DEFICIT)\n(a) Preferred stock\nThe Company was authorized to issue one hundred million (100,000,000) shares of preferred stock, par value $0.001 per share. On June 30, 2022, one thousand shares of preferred stock have been issued.\n(b) Common stock\nShares authorized\nUpon formation, the total number of shares of all classes of stock which the Company was authorized to issue seventy-five million (75,000,000) shares of common stock, par value of $0.001 per share. On December 15, 2018, the Company increased its authorized common shares to 500,000,000 shares at par value $0.001 per share.\nCommon stock issued\nOn June 24, 2022, the Company issued an aggregate 8,000,000 shares of its common stock at the price of $0.6 per share to acquire 100% interest of Union.\nOn June 24, 2022, the Company issued 105,000 shares of common stock at the price of $0.6 per share to compensate certain directors in rendering services to the Company.\nAs of June 30, 2022, the Company had a total of 109,225,000 shares of its common stock issued and outstanding.\nAs of June 30, 2021, the Company had a total of 101,210,000 shares of its common stock issued and outstanding.\n10. NET LOSS PER SHARE\nNet loss per share is provided in accordance with FASB ASC 260-10, Earnings per share. Basic net loss per common share (EPS) is computed by dividing net loss available to common stockholders by the weighted average number of common shares outstanding for the period. Diluted earnings (loss) per share is computed by dividing net income (loss) by the weighted average shares outstanding, assuming all dilutive potential common shares were issued, unless doing so is anti-dilutive.\nThe following table sets forth the computation of basic and diluted net loss per share for the years ended June 30, 2022 and 2021:\nYears ended June 30,\nNet loss attributable to Ajia Innogroup Holdings, Ltd ‘s shareholders\n$ (288,915 )\n$ (184,262 )\nWeighted average shares outstanding - Basic and diluted\n101,275,438\n101,120,000\nBasic and diluted loss per share\n$ (0.00 )\n$ (0.00 )\n11. RELATED PARTY TRANSACTIONS\nFrom time to time, the stockholder and director of the Company advanced funds to the Company for working capital purpose. Those advances are unsecured, non-interest bearing and due on demand. The imputed interest on the loan from a related party was not significant.\nApart from the transactions and balances detailed elsewhere in these accompanying consolidated financial statements, the Company has no other significant or material related party transactions during the years presented.\n12. CONCENTRATIONS OF RISK\nThe Company is exposed to the following concentrations of risk:\n(a) Major customers\nFor the years ended June 30, 2022 and 2021, the individual customer who accounts for 10% or more of the Companys revenues and its outstanding receivable balances as at year-end dates, are presented as follows:\nYear ended June 30, 2022\nJune 30, 2022\nCustomers\nRevenues\nPercentage\nof revenues\nAccounts\nreceivable\nCustomer A\n$ 94,941\n84 %\nTotal:\n$ -\nYear ended June 30, 2021\nJune 30, 2021\nCustomers\nRevenues\nPercentage\nof revenues\nAccounts\nreceivable\nCustomer A\n$ 70,392\n72 %\n$ -\nCustomer B\n24,134\n24 %\n-\nTotal:\n$ 94,526\n96 %\nTotal:\n$ -\nThese customers are located in Hong Kong.\n(b) Credit risk\nFinancial instruments that are potentially subject to credit risk consist principally of trade receivables. The Company believes the concentration of credit risk in its trade receivables is substantially mitigated by its ongoing credit evaluation process and relatively short collection terms. The Company does not generally require collateral from customers. The Company evaluates the need for an allowance for doubtful accounts based upon factors surrounding the credit risk of specific customers, historical trends and other information.\n(c) Exchange rate risk\nThe reporting currency of the Company is US$, to date the majority of the revenues and costs are denominated in HK$ and a significant portion of the assets and liabilities are denominated in HK$. As a result, the Company is exposed to foreign exchange risk as its revenues and results of operations may be affected by fluctuations in the exchange rate between US$ and HK$. The Company does not hold any derivative or other financial instruments that expose to substantial market risk.\n13. COMMITMENTS AND CONTINGENCIES\nAs of June 30, 2022, there were no commitments and contingencies involved.\n14. SUBSEQUENT EVENTS\nIn accordance with ASC Topic 855, Subsequent Events, which establishes general standards of accounting for and disclosure of events that occur after the balance sheet date but before financial statements are issued, the Company has evaluated all events or transactions that occurred after June 30, 2022, up through the date the Company issued the audited consolidated financial statements. During the period, the Company did not have any material recognizable subsequent events. Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure.\nThe Board of Directors of AJIA. (the \"Company\"), acting as the Companys Audit Committee, announces that it has appointed J&S Associate (J&S) as the Companys independent auditor for the 2022 fiscal year ending June 30, 2022, replacing TOTAL ASIA ASSOCIATES PLT. (TATP). J&Ss address is Unit B2-2-2 Solaris Dutamas 1, Jalan Dutamas 1, 50480, Kuala Lumpur, Malaysia.\nThis action effectively terminates the Company's engagement of TATP for the fiscal year ending June 30, 2022. Through the date of this Form 8-K, there have been no disagreements with TATP on any matter of accounting principles or practices, financial statement disclosure or auditing scope or procedure, which disagreements if not resolved to TATPs satisfaction would have caused them to make reference to the subject matter of the disagreement in connection with their reports. For the year ended June 30, 2021 and 2022 and through the date of this Form 8-K, there were no \"reportable events\" as that term is described in Item 304(a)(1)(v) of Regulation S-K.\nThe Company has provided TATP with a copy of the form 8-K dated April 1, 2022 and the Company has requested that TATP furnish a letter addressed to the Commission stating whether they agree with the statements above.\nFor the years ended June 30, 2021 and 2022 and through April 1, 2022, neither the Company nor anyone acting on the Company's behalf consulted J&S with respect to the application of accounting principles to a specified transaction, either completed or proposed, or the type of audit opinion that might be rendered on the Company's consolidated financial statements, or any other matters or reportable events as defined in Item 304(a)(2)(i) and (ii) of Regulation S-K. J&S has been asked to review this disclosure and J&S has been provided an opportunity to furnish a letter to the SEC containing any new information, clarification, or disagreement with the statements made herein. Item 9A. Controls and Procedures.\nAs of June 30, 2022, our Chief Executive Officer and Chief Financial Officer, conducted an evaluation of the effectiveness of the design and operation of our disclosure controls and procedures, as required by Exchange Act Rule 13a-15. Based on that evaluation, our Chief Executive Officer and Chief Financial Officer concluded that our disclosure controls and procedures were not effective as of the end of the period covered by this report. Disclosure controls and procedures are controls and other procedures that are designed to ensure that information required to be disclosed in our reports filed or submitted under the Exchange Act is recorded, processed, summarized and reported, within the time periods specified in the SECs rules and forms. Disclosure controls and procedures include, without limitation, controls and procedures designed to ensure that information required to be disclosed in our reports filed under the Exchange Act is accumulated and communicated to management, including our Chief Executive Officer and our Chief Financial Officer, to allow timely decisions regarding required disclosure.\nManagements Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting as defined in Rules 13a-15(f) and 15d-15(f) under the Securities Exchange Act of 1934. Our internal control over financial reporting is a process designed by, or under the supervision of, our chief executive officer and chief financial officer, or persons performing similar functions, and effected by our board of directors, management and other personnel, to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with accounting principles generally accepted in the United States of America (GAAP). Our internal control over financial reporting includes those policies and procedures that: (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and disposition of the assets of the Company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with GAAP and that receipts and expenditures of the Company are being made only in accordance with authorization of management and directors of the Company; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the Companys assets that could have a material effect on the financial statements.\nManagement assessed the effectiveness of the Companys internal control over financial reporting as of June 30, 2022. In making this assessment, management used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission in the 2013 Internal Control-Integrated Framework. Based on its evaluation, management has concluded that the Companys internal control over financial reporting was not effective as of June 30, 2022.\nDuring the year ended June 30, 2022, management identified the following weaknesses, which were deemed to be material weaknesses in internal controls:\n1 Due to the size of the Company and available resources, there are limited personnel to assist with the accounting and financial reporting function, which results in a lack of segregation of duties.\n2. We did not implement appropriate information technology controls - As at June 30, 2022, the Company retains copies of all financial data and material agreements; however there is no formal procedure or evidence of normal backup of the Companys data or off-site storage of data in the event of theft, misplacement, or loss due to unmitigated factors.\nPursuant to Regulation S-K Item 308(b), this Annual Report on Form 10-K does not include an attestation report of our companys registered public accounting firm regarding internal control over financial reporting.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions or that the degree of compliance with the policies or procedures may deteriorate. A control system, no matter how well designed and operated can provide only reasonable, but not absolute, assurance that the control systems objectives will be met. The design of a control system must reflect the fact that there are resource constraints, and the benefits of controls must be considered relative to their cost.\nChanges in Internal Control and Financial Reporting\nThere have been no changes in our internal control over financial reporting in the fiscal year ended June 30, 2022, which were identified in connection with our managements evaluation required by paragraph (d) of rules 13a-15 and 15d-15 under the Exchange Act, that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. Item 9B. Other Information.\nNone.\nPart III Item 10. Directors, Executive Offices and Corporate Governance\nOur directors are elected by the stockholders to a term of one year and serves until his or her successor is elected and qualified. Our officer is appointed by the board of directors (the Board) to a term of one year and serves until his or her successor is duly elected and qualified, or until he or she is removed from office.\nSet forth below are the present directors, director nominees and executive officers of the Company as of October 7, 2022. There are no other persons who have been nominated or chosen to become directors nor are there any other persons who have been chosen to become executive officers. There are no arrangements or understandings between any of the directors, officers and other persons pursuant to which such person was selected as a director or an officer. Directors are elected to serve until the next annual meeting of stockholders and until their successors have been elected and have qualified. Officers are appointed to serve until the meeting of the board of directors following the next annual meeting of stockholders and until their successors have been elected and qualified.\nName\nAge\nPosition\nMr. Kwai Lam Wong\nChief Executive Officer, President and Director\nWai Hing (Samuel) LAI\nChief Financial Officer\nKiu Chung Jacqueline TANG\nIndependent Director\nYin Ling (Elaine) WAN\nDirector, Secretary and Treasurer\nMr. Kin Chung TAM\nIndependent Director\nThe persons named above are expected to hold their offices/positions until the next annual meeting of our stockholders. The officer and director set forth herein is our only officer, director, promoter and control person, as that term is defined in the rules and regulations promulgated under the Securities and Exchange Act of 1933.\nInformation about our Executive Officers\nThe business experience during the past five years of the person presently listed above as an Officer or Director of the Company is as follows:\nMr. Kwai Lam Wong - Chief Executive Officer, President, Director\nMr. Wong, 61, obtaining Doctorate of Philosophy at the University of California, Los Angeles, Mr. Wong has had over 30 years of experience working and leading the media sector in Hong Kong, Toronto, and Vancouver. In the mid 1970s, Mr. Wong gained further proficiency training in presentation techniques with the National Broadcasting School in England.\nMr. Wong is a professional public speaker and trainer, with courses specializing in sales and communication skills, human relationships, and crisis management. He has conducted seminars and workshops for many organizations and education institutes in Hong Kong including the Mass Transit Railway (MTR), Hong Kong Television Broadcasting Ltd. (TVB), Hong Kong Jockey Club, Hong Kong and Shanghai Bank (HSBC), Bank of China, Cathay Pacific Airways Ltd., Hong Kong University, various government departments including the Hong Kong Police and Hong Kong Customs and Excise Department, and numerous other organizations in the insurance and real estate industries.\nIn 1982, Mr. Wong founded the Hong Kong COMMA Society, which is an association formed with many notable public figures in Hong Kong focusing on the art of public speaking and interpersonal communication. Since then, Mr. Wong has published a score of books dealing with topics such as interpersonal relationships, positive lifestyles, personal growth, the art of public speaking, and crisis management. Dr. Wong also regularly publishes articles in the newspapers and magazines in Hong Kong.\nMr. Wong is widely known for his dynamic speeches and rich training and lecture experience. He now mostly does corporate training and consulting for large firms in Hong Kong.\nWai Hing LAI (Samuel) - Chief Financial Officer\nHe obtained Hon. Diploma in Accountancy from Lingnan University (formerly known as Lingnan College) in 1993. Samuel completed the joint examination lodged by ACCA/HKSA in 1996 and has become the Fellow Member of ACCA presently. He has been a senior manager at three major accounting firms in Hong Kong and Singapore, specializing in tax planning and international taxation from 1995 to 2002. In addition, he has worked for a number of financial enterprises and exchange listed companies in Hong Kong, including Foxconn International Holdings Limited and Pico Far East Holdings Limited. He was the Group Financial Controller of a Singapore listed company, China Sky Chemical Fibre Co Limited. Since 2012, he has been working for the International Professional Consultants Corporation of Hong Kong as its Vice President, advising on listing issues and group restructuring.\nKiu Chung TANG (Jacqueline) - Independent Director and Member of the Audit Committee\nMs. Tang obtained BSc. in Accounting and a Finance degree from University of Surrey in 2012. She has 5 years of business management and director experience. In 2013, she joined Go Fun Project Limited (NGO) and Y&L Group International Company Limited as their director. Since 2019, she has been a director of the Go Inside Kitchen Limited.\nOn September 28, 2020, Ms. Tang resigned from Companys Chief Operating Officer (COO) and appointed as Independent and non-executive director and member of the audit committee.\nYin Ling WAN (Elaine) - Director, Secretary, Treasurer\nMs. Wan graduated from the University of Management & Technology in Arlington, Virginia in 2010. Ms. Wan currently has been the Director of Full Yick International Limited located in Hong Kong since May of 2018. Prior to her position she was Director at Suntransfer Limited in Hong Kong since 2018. She is also director of Jiayu Insurance Finance Limited in Hong Kong since 2017 and Director of Shine Spread Limited in Hong Kong since 2007.\nMs. Wan has extensive experience in managing and consulting.\nMr. Kin Chung TAM- Independent Director and Member of the Audit Committee\nMr. Tam, 32, possess bachelor Degree from Victoria University of Wellington New Zealand since 2014. He is handle on market development, promotion, operation and management for long time. Nowadays, he is founder Brand Production Limited in Hong Kong and director Create Sth Marketing Limited in Hong Kong, lead the Company to profitable growth for 3 years.\nMr. Tam was invited to join the senior executive team of GoFun Group since 2018, and contributed his valuable marketing and management experience to the Group.\nIdentification of Significant Employees\nWe have no significant employees other than our officers and directors.\nFamily Relationship\nWe currently do not have any officers or directors of our Company who are related to each other.\nPotential Conflicts of Interest\nWe are not aware of any conflicts of interest with any of our executive officers or directors.\nInvolvement in Certain Legal Proceedings\nDuring the past ten years no director, executive officer, promoter or control person of the Company has been involved in the following:\n(1)\nA petition under the Federal bankruptcy laws or any state insolvency law which was filed by or against, or a receiver, fiscal agent or similar officer was appointed by a court for the business or property of such person, or any partnership in which he was a general partner at or within two years before the time of such filing, or any corporation or business association of which he was an executive officer at or within two years before the time of such filing;\n(2)\nSuch person was convicted in a criminal proceeding or is a named subject of a pending criminal proceeding (excluding traffic violations and other minor offenses);\n(3)\nSuch person was the subject of any order, judgment, or decree, not subsequently reversed, suspended or vacated, of any court of competent jurisdiction, permanently or temporarily enjoining him from, or otherwise limiting, the following activities:\ni. Acting as a futures commission merchant, introducing broker, commodity trading advisor, commodity pool operator, floor broker, leverage transaction merchant, any other person regulated by the Commodity Futures Trading Commission, or an associated person of any of the foregoing, or as an investment adviser, underwriter, broker or dealer in securities, or as an affiliated person, director or employee of any investment company, bank, savings and loan association or insurance company, or engaging in or continuing any conduct or practice in connection with such activity;\nii. Engaging in any type of business practice; or\niii. Engaging in any activity in connection with the purchase or sale of any security or commodity or in connection with any violation of Federal or State securities laws or Federal commodities laws;\n(4)\nSuch person was the subject of any order, judgment or decree, not subsequently reversed, suspended or vacated, of any Federal or State authority barring, suspending or otherwise limiting for more than 60 days the right of such person to engage in any activity described in paragraph (f)(3)(i) of this section, or to be associated with persons engaged in any such activity;\n(5)\nSuch person was found by a court of competent jurisdiction in a civil action or by the Commission to have violated any Federal or State securities law, and the judgment in such civil action or finding by the Commission has not been subsequently reversed, suspended, or vacated;\n(6)\nSuch person was found by a court of competent jurisdiction in a civil action or by the Commodity Futures Trading Commission to have violated any Federal commodities law, and the judgment in such civil action or finding by the Commodity Futures Trading Commission has not been subsequently reversed, suspended or vacated;\n(7)\nSuch person was the subject of, or a party to, any Federal or State judicial or administrative order, judgment, decree, or finding, not subsequently reversed, suspended or vacated, relating to an alleged violation of:\ni. Any Federal or State securities or commodities law or regulation; or\nii. Any law or regulation respecting financial institutions or insurance companies including, but not limited to, a temporary or permanent injunction, order of disgorgement or restitution, civil money penalty or temporary or permanent cease-and-desist order, or removal or prohibition order; or\niii. Any law or regulation prohibiting mail or wire fraud or fraud in connection with any business entity; or\n(8)\nSuch person was the subject of, or a party to, any sanction or order, not subsequently reversed, suspended or vacated, of any self-regulatory organization (as defined in Section 3(a)(26) of the Exchange Act (15 U.S.C. 78c(a)(26))), any registered entity (as defined in Section 1(a)(29) of the Commodity Exchange Act (7 U.S.C. 1(a)(29))), or any equivalent exchange, association, entity or organization that has disciplinary authority over its members or persons associated with a member.\nAudit Committee\nOur Audit Committee current consists of Kiu Chung Jacqueline Tang and Mr. Kin Chung Tam.\nCode of Ethics\nWe have not adopted a code of ethics that applies to our officer, director and employee. When we do adopt a code of ethics, we will disclose it in a Current Report on Form 8-K. Item 11. Executive Compensation\nThe following table sets forth for the years ended June 30, 2022 and 2021, the compensation awarded to, paid to, or earned by, our officers and directors.\nName and principal position\nYear\nSalary\n($)\nBonus\n($)\nStock Awards\n($)\nOption Awards\n($)\nNon-Equity Incentive Plan Compensation ($)\nNonqualified Deferred Compensation Earnings\n($)\nAll Other Compensation\nTotal\n($)\nZhi Qiang, Liang Director,\n-\n-\n-\n-\n-\n-\n-\n-\nand President (former CEO)(4)\n-\n-\n-\n-\n-\n-\n-\n-\nWai Hing Lai (Samuel), CFO\n8,109\n-\n-\n-\n-\n-\n-\n8,109\n10,762\n-\n-\n-\n-\n-\n-\n10,762\nKin Chung TAM, Ken,\n-\n-\n-\n-\n-\n-\n-\n-\nFormer Director (1)\n-\n-\n-\n-\n-\n-\n-\n-\nHung Hin Samuel LEUNG\n18,101\n-\n-\n-\n-\n-\n-\n18,101\nFormer Director and Member of Audit Committee\n26,983\n-\n-\n-\n-\n-\n-\n26,983\nKwok Fai YIP, Thomas,\n24,134\n-\n-\n-\n-\n-\n-\n24,134\nFormer Director and Member of Audit Committee (3)\n35,978\n-\n-\n-\n-\n-\n-\n35,978\nKiu Chung Jacqueline Tang, Independent Director\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\nElaine Yin Ling Wan,\n24,134\n-\n-\n-\n-\n-\n-\n24,134\nDirector, Secretary, Treasurer\n47,970\n-\n-\n-\n-\n-\n-\n47,970\nNotes to Summary Compensation Table\n(1) On September 28, 2020, Mr. Kwok Fai (Thomas) YIP (Mr. Yip) resigned as a member of our Board of Directors of the Companys Independent and Non-executive directors - Audit committee. Concurrently, Mr. Yip was appointed as the Companys Executive Director and Vice Chairman. Mr. Yips position as the Companys Independent and non-executive director was immediately replaced by Ms. Kiu Chung Jacqueline Tang (Ms. Tang) who was formerly engaged as the Companys Chief Operating Officer (COO). Ms. Tang resigned from the position of COO concurrently with this appointment. Ms. Tang was appointed as independent director on June 30, 2021\n(2) Zhi Qiang, Liang has been President and Director since November 2017, He was CEO from November 2017 to September 28, 2020. He resigned on April 1, 2022.\nNarrative Disclosure to Summary Compensation Table\nCurrently, none of our officers and directors are being not compensated for their services during the development stage of our business operations, and they are not considered to be employees of the Company.\nWe have not paid any salaries in 2022 or 2020. We will not begin paying salaries until we have adequate funds to do so.\nAny out-of-pocket expenses incurred by our officer and director shall accrue as a liability of the Company and shall be reimbursed when sufficient funds are available. In the future we may approve payment of salaries for our officers and directors, but currently, no such plans have been approved. We also do not currently have any benefits, such as health insurance, life insurance or any other benefits available to our employees.\nWe have not issued any stock options or maintained any stock option or other incentive plans since our inception. We have no plans in place and have never maintained any plans that provide for the payment of retirement benefits or benefits that will be paid primarily following retirement including, but not limited to, tax qualified deferred benefit plans, supplemental executive retirement plans, tax-qualified deferred contribution plans and nonqualified deferred contribution plans. Similarly, we have no contracts, agreements, plans or arrangements, whether written or unwritten, that provide for payments to the named executive officers or any other persons following, or in connection with the resignation, retirement or other termination of a named executive officer, or a change in control of us or a change in a named executive officers responsibilities following a change in control.\nCompensation of Directors\nOur directors have not received any compensation for serving as such, for serving on committees of the Board of Directors or for special assignments. During the years ended June 30, 2022 and 2021, there were no other arrangements between us and our directors that resulted in our making payments to our directors for any services provided to us by them as director.\nPension, Retirement or Similar Benefit Plans\nThere are no arrangements or plans in which we provide pension, retirement or similar benefits for directors or executive officers. We have no material bonus or profit sharing plans pursuant to which cash or non-cash compensation is or may be paid to our directors or executive officers, except that stock options may be granted at the discretion of the board of directors or a committee thereof.\nIndebtedness of Directors, Senior Officers, Executive Officers and Other Management\nNone of our directors or executive officers or any associate or affiliate of our company during the last two fiscal years is or has been indebted to our company by way of guarantee, support agreement, letter of credit or other similar agreement or understanding currently outstanding. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nSecurity Ownership of Certain Beneficial Owners and Management\nThe following table lists, as of October 7, 2022, the number of shares of common stock that are beneficially owned by (i) each person or entity known to the Company to be the beneficial owner of more than 5% of the outstanding common stock; (ii) each officer and director of the Company; and (iii) all officers and directors as a group. Information relating to beneficial ownership of common stock by principal shareholders and management is based upon information furnished by each person using beneficial ownership concepts under the rules of the Securities and Exchange Commission. Under these rules, a person is deemed to be a beneficial owner of a security if that person has or shares voting power, which includes the power to vote or direct the voting of the security, or investment power, which includes the power to vote or direct the voting of the security. The person is also deemed to be a beneficial owner of any security of which that person has a right to acquire beneficial ownership within 60 days. Under the Securities and Exchange Commission rules, more than one person may be deemed to be a beneficial owner of the same securities, and a person may be deemed to be a beneficial owner of securities as to which he or she may not have any pecuniary beneficial interest. Except as noted below, each person has sole voting and investment power.\nTitle of Class\nName of Beneficial Owner (1)\nAmount and\nNature of\nBeneficial Ownership (2)\nPercent of\nClass (3)\nCommon\nMr. Kwai Lam Wong\n%\nCommon\nFull Yick International Ltd.(Elain Wan) (4)\n12,969,519\n11.87\n%\nCommon\nWai Hing LAI\n%\nCommon\nMr. Kin Chung TAM\n1,877,838\n1.72\n%\nCommon\nKiu Chung Jacqueline TANG\n%\nCommon\nDirectors and Officers as a Group (5 individuals and 1 entity)\n14,847,357\n13.59\n%\nPreferred stock(5)\nYin Ling WAN\n1,000\n%\n(1)\nThe person named above may be deemed to be a parent and promoter of the Company, within the meaning of such terms under the Securities Act of 1933, as amended, by virtue of his direct holdings in the Company.\n(2)\nEach shareholder owns his or her shares directly, unless otherwise noted.\n(3)\nBased on 109,225,000 common shares issued and outstanding as of October 7, 2022 and 1,000 preferred shares issued and outstanding as of October 7, 2022.\n(4)\nFull Yick International Ltd.s director and controlling shareholder is Yin Ling (Elaine) Wan, our director, secretary and treasurer.\n(5)\nPreferred stock as a class has the right to vote in an amount equal to 51% of the total vote with respect to any proposal relating to (a) increasing the authorized share capital of the Company, (b) effecting any forward stock split of the Companys authorized, issued or outstanding shares of capital stock, and (c) any other matter subject to a shareholder vote. The Preferred Stock has no rights to dividends, liquidation preference or to conversion. The Preferred Stock as a class shall automatically be redeemed in the event Ms. Yin Ling Wan is no longer or director or if the Companys common stock trades on a national securities exchange. On September 27, 2021, Ms. Wan voluntarily agreed to cancel and return the Preferred Stock to the Company for cancellation so as to simplify the Companys voting and control system.\nChanges in Control\nThere are no present arrangements or pledges of the Companys securities which may result in a change in control of the Company. Item 13. Certain Relationships and Related Transactions, and Director Independence\nDirector Independence\nFor purposes of determining director independence, we have applied the definitions set out in NASDAQ Rule 5605(a)(2). The OTCBB on which shares of common stock are quoted does not have any director independence requirements. The NASDAQ definition of Independent Director means a person other than an Executive Officer or employee of the Company or any other individual having a relationship which, in the opinion of the Companys Board of Directors, would interfere with the exercise of independent judgment in carrying out the responsibilities of a director.\nAccording to the NASDAQ definition, Mr. Kwai Lam Wong, and Mr. Wai Hing (Samuel) Lai are not independent directors because each is also an executive officer of the Company. According to the NASDAQ definition, Kiu Chung Jacqueline TANG and Kin Chung TAM are each independent directors at this time. All current directors are or may become in the future shareholders of the Company.\nRelated Party Transactions\nAs of June 30, 2022 and 2021, the balance $310,454 and $120,672 represented the loan account of the Director - Ms. Wan, which is unsecured, non-interest bearing, and due on demand.\nAs of June 30, 2022 and 2021, the balance $191,159 and $0 represented the loan account of the shareholder - Wong Bik Chun.\nAs of June 30, 2022 and 2021, the balance $95,579 and $0 represented the loan account of the shareholder - Poon Wai Han.\nAll of balances are unsecured, non-interest bearing, and due on demand.\nOther than the foregoing, none of the directors or executive officers of the Company, nor any person who owned of record or was known to own beneficially more than 5% of the Companys outstanding shares of its Common Stock, nor any associate or affiliate of such persons or companies, has any material interest, direct or indirect, in any transaction that has occurred during the past fiscal year, or in any proposed transaction, which has materially affected or will affect the Company.\nWith regard to any future related party transaction, we plan to fully disclose any and all related party transactions in the following manner:\nDisclosing such transactions in reports where required;\nDisclosing in any and all filings with the SEC, where required;\nObtaining disinterested directors consent; and\nObtaining shareholder consent where required.\nReview, Approval or Ratification of Transactions with Related Persons\nWe are a smaller reporting company as defined by Rule 12b-2 of the Securities Exchange Act of 1934 and are not required to provide the information under this item. Item 14. Principal Accounting Fees and Services\nOn April 1, 2022, the Company appointed J&S Associate (J&S) as the Companys registered independent public accounting firm. Our principal independent accountant during the year ended June 30, 2022 was J&S. Their pre-approved fees billed to the Company are set forth below:\nOn December 10, 2018, the Company appointed Total Asia Associates PLT (TAAP) as the Companys registered independent public accounting firm. Our principal independent accountant during the year ended June 30, 2021 was TAAP. TAAP resigned on April 1, 2022. Their pre-approved fees billed to the Company are set forth below:\nJune 30,\nJune 30,\nAudit Fees and Audit Related Fees\n$ 28,000\n$ 25,000\nTax Fees\n-\n-\nAll Other Fees\n-\n-\nTOTAL\n$ 28,000\n$ 25,000\nAudit Fees\nDuring the fiscal year ended June 30, 2022, we incurred approximately $28,000 in fees to our principal independent accountants for professional services rendered in connection with the audit and review of our financial statements for fiscal year ended June 30, 2022.\nDuring the fiscal year ended June 30, 2021, we incurred approximately $25,000 in fees to our principal independent accountants for professional services rendered in connection with the audit and review of our financial statements for fiscal year ended June 30, 2021.\nAudit-Related Fees\nThe aggregate fees billed during the fiscal years ended June 30, 2022 and 2021 for assurance and related services by our principal independent accountants that are reasonably related to the performance of the audit or review of our financial statements (and are not reported under Item 9(e)(1) of Schedule 14A) was $NIL and $NIL, respectively.\nTax Fees\nThe aggregate fees billed during the fiscal years ended June 30, 2022 and 2021 for professional services rendered by our principal accountant for tax compliance were $NIL and $NIL, respectively.\nAll Other Fees\nThe aggregate fees billed during the fiscal years ended June 30, 2022 and 2021 for products and services provided by our principal independent accountants (other than the services reported in Items 9(e)(1) through 9(e)(3) of Schedule 14A) was $NIL and $NIL, respectively.\nPart IV Item 15. Exhibits, Financial Statement Schedules\nThe following exhibits are included with this registration statement filing:\nExhibit\nNumber\nExhibit Description\n3.1\nArticles of Incorporation\nFiled as exhibit to Form S-1, August 18, 2015\n3.2\nAmended and Restated Articles of Incorporation\nFiled as an exhibit to Def14C on January 18, 2018\n3.3\nBylaws\nFiled as exhibit to Form S-1, August 18, 2015\n10.1\nMemorandum between Company and Union Patron Limited dated October 15, 2020\nFiled as exhibit 10.1 to Form 8-K filed November 4, 2020\n10.2\nAgreement between Company and Splendor Radiant Limited\nFiled as exhibit 10.2 to Form 8-K filed November 4, 2020\n10.3\nMemorandum between Ajia Systems Corporation Architecture Solution Limited and Union Patron Limited\nFiled as exhibit 10.3 to Form 8-K filed November 4, 2020\n10.4\nPurchase and Sale Agreement of Jiayu Insurance Finance Limited dated June 29, 2021\nFiled as exhibit 10.1 to Form 8-K filed July 2, 2021\n10.5\nAcquisition Agreement with Union Passenger Limited, dated June 23, 2022\nFiled as exhibit 10.1 to Form 8-K filed July 25, 2022\n31.01\nCertification of Principal Executive Officer Pursuant to Rule 13a-14\nFiled herewith.\n31.02\nCertification of Principal Financial Officer Pursuant to Rule 13a-14\nFiled herewith.\n32.01\nCEO Certification Pursuant to Section 906 of the Sarbanes-Oxley Act\nFiled herewith.\n32.02\nCFO Certification Pursuant to Section 906 of the Sarbanes-Oxley Act\nFiled herewith.\n101.INS*\nXBRL Instance Document\nFiled herewith.\n101.SCH*\nXBRL Taxonomy Extension Schema Document\nFiled herewith.\n101.CAL*\nXBRL Taxonomy Extension Calculation Linkbase Document\nFiled herewith.\n101.LAB*\nXBRL Taxonomy Extension Labels Linkbase Document\nFiled herewith.\n101.PRE*\nXBRL Taxonomy Extension Presentation Linkbase Document\nFiled herewith.\n101.DEF*\nXBRL Taxonomy Extension Definition Linkbase Document\nFiled herewith.\n*Pursuant to Regulation S-T, this interactive data file is deemed not filed or part of a registration statement or prospectus for purposes of Sections 11 or 12 of the Securities Act of 1933, is deemed not filed for purposes of Section 18 of the Securities Exchange Act of 1934, and otherwise is not subject to liability under these sections.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereto duly authorized.\nAJIA INNOGROUP HOLDINGS, LTD.\n(Registrant)\nDated: October 13, 2022\n/s/ Mr. Kwai Lam WONG\nMr. Kwai Lam WONG\nDirector and Chief Executive Officer\n(Principal Executive Officer)\nDated: October 13, 2022\n/s/ Wai Hing (Samuel) LAI\nWai Hing (Samuel) LAI\nChief Financial Officer\n(Principal Accounting Officer\nand Principal Financial Officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nDated: October 13, 2022\n/s/ Mr. Kwai Lam WONG\nMr. Kwai Lam WONG\nDirector and Chief Executive Officer\n(Principal Executive Officer)\nDated: October 13, 2022\n/s/ Wai Hing (Samuel) LAI\nWai Hing (Samuel) LAI\nChief Financial Officer\n(Principal Accounting Officer\nand Principal Financial Officer)\n/s/ Ms. Yin Ling WAN\nDated: October 13, 2022\nMs. Yin Ling WAN\nDirector, Secretary and Treasurer\n/s/ Ms. Kiu Chung Jacqueline TANG\nDated: October 13, 2022\nKiu Chung Jacqueline TANG\nIndependent Director\n/s/ Mr. Kin Chung TAM\nDated: October 13, 2022\nMr. Kin Chung TAM\nIndependent Director\nAudit Committee"
}