{
    "cik": "1656501",
    "company": "BorrowMoney.com, Inc.",
    "filing_type": "10-K",
    "filing_date": "2023-12-14",
    "period_of_report": "2023-08-31",
    "sic": "7389",
    "state_of_inc": "FL",
    "state_location": "FL",
    "fiscal_year_end": "0831",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1656501/0001493152-23-044833-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1656501/000149315223044833/form10-k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1656501/0001493152-23-044833.txt",
    "filename": "1656501_10K_2023_0001493152-23-044833.htm",
    "content": "ITEM 1. Business\nOur Company\nBorrowMoney.com, Inc. (BorrowMoney.com, the Company, we or us) operates what it believes to be the leading online loan marketplace for consumers seeking loans and other credit-based offerings. The Companys online marketplace provides consumers with access to product offerings from active lenders (which the Company refers to as Network Lenders), including mortgage loans, home equity loans and lines of credit, reverse mortgage loans, auto loans, credit cards, deposit accounts, personal loans, student loans, small business loans and other related offerings. In addition, the Company offers tools and resources, including free credit scores, that facilitate comparison shopping for these loans, deposits and other credit-based offerings. The Company seeks to match consumers with multiple lenders, who can then provide them with competing quotes for the product they are seeking. By providing consumers access to a broad array of credit-based offerings directly from multiple lenders, rather than just multiple quotes from the same lender or indirectly through intermediaries, the Company believes its marketplace is differentiated from other providers operating loan comparison-shopping marketplaces.\nThe Company strategically designed and executed advertising and marketing campaigns (which is referred to as performance marketing) span a wide array of digital and traditional media acquisition channels and promote its BorrowMoney.com and other brands and product offerings. The Companys marketing efforts are designed to attract consumers to its websites and toll-free telephone numbers. Interested consumers complete inquiry forms, providing detailed information about themselves and the loans or other offerings they are seeking. The Company refers to such consumer inquiries as loan requests. The Company then matches these loan requests with lenders in its marketplace that are seeking to serve these consumers needs. The Company plans to generate revenue from these lenders, generally at the time of transmitting a loan request to them, in the form of a match fee. In certain instances, outside the mortgage business, the Company plans to charge other kinds of fees, such as closed loan or closed sale fees. In addition to its primary loan request data referral business, BorrowMoney also matches consumers with lenders via website clicks and calls for which the Company anticipates lenders paying either front-end or back-end fees.\nThe Company is continually working to improve the consumer experience. The Company has made investments in technologically-adept personnel and utilizes in-market real-time testing to improve its digital platforms. Additionally, the Company works with its lenders, including providing training and other resources, to improve the consumer experience throughout the loan process. Further, the Company has been building and improving its My BorrowMoney platform, which provides a relationship-based consumer experience, rather than just a transaction-based experience.\nThe Company generated $0 revenues for the year ending August 31, 2023 and $24,930 for the year ending August 31, 2022.\nEvolution and Future Growth of Our Business\nThe Company has actively sought to expand the suite of loan and other product offerings it provides to consumers, in order to both leverage the applicability of the BorrowMoney.com brand as well as more fully serve the needs of consumers and lenders. The Company believes that consumers with existing BorrowMoney-branded associations will be more likely to utilize its other service offerings than those of other providers whose brands consumers may not recognize.\nIn October 2021, the Company completed its backend and software and continued its development with My BorrowMoney.com, a platform that offers a personalized loan comparison-shopping experience, by providing free credit scores and credit score analysis. The platform enables the Company to observe consumers credit profiles and then identify and alert them to loan and other credit-based offerings in its marketplace that may be more favorable than the loans they have at a given point in time. This is designed to provide consumers with measurable savings opportunities over their lifetimes.\nBy expanding the Companys portfolio of loans and other product offerings, it is growing and diversifying its business and sources of revenue. The Company intends to capitalize on its expertise in performance marketing, product development and technology and to leverage the widespread recognition of the BorrowMoney.com brand, in order to generate leads.\nThe Company believes the consumer and small business financial services industry has undergone a fundamental shift to online product offerings, similar to the shift that started in retail and travel many years ago and is now well established. The Company believes that, like retail and travel, as consumers continue to move towards online shopping and transactions for financial services, suppliers will increasingly shift their product offerings and advertising budgets toward the online channel. The Company believes the strength of its brands and of its lender network place the Company in a strong position to continue to benefit from this market shift.\nProducts\nThe Company currently reports its revenues in two product categories: (i) mortgage products and (ii) non-mortgage products. Non-mortgage products include credit cards, personal loans, home equity loans, reverse mortgage loans, auto loans, small business loans and student loans. Non-mortgage products also include deposit accounts, home improvement referrals and other credit products such as credit repair and debt settlement.\nBorrowMoney.com does not charge individual consumers for the use of our services. Commercial loans may have certain service fees attached to their loans. Revenues from our mortgage products plan to be derived from lead generation fees paid by the Network Lenders that receive a loan request, and in some cases upfront fees for clicks or call transfers. Because a given loan request form can be matched with more than one Network Lender, up to five match fees may be generated from a single consumer loan request form. Revenues from the Companys non-mortgage products plan to be derived from upfront match fees paid on delivery of a loan request, click or call and closed loan fees. For the Companys products, the Company sends click traffic to issuers and anticipate being paid per approval.\nMortgage Products\nThe Companys mortgage inquiry products category includes purchase and refinance products.\nThe Company partners with lenders throughout the United States to provide full geographic lending coverage and to offer a complete suite of loan offerings on our marketplace. To participate on its marketplace, lenders are required to enter into contracts that state the terms and conditions for such participation, although these contracts generally may be terminated for convenience by either party. The Company performs certain due diligence procedures on prospective new lenders, including screening against a national anti-fraud database maintained by the Mortgage Asset Research Institute, which helps manage risk exposure. The data is utilized to determine whether a lender and its principals are eligible to participate within the Companys marketplace and have not been convicted of and/or penalized for fraudulent activity.\nConsumers seeking mortgage loans through our loan marketplace can receive multiple conditional loan offers from participating lenders in response to a single loan request form. We refer to the process by which we match consumers and Network Lenders as the matching process. This matching process consists of the following steps:\n1) Loan Request. Consumers complete a single loan request form with information regarding the type of mortgage loan product they are seeking, loan preferences and other data. Consumers also consent to a soft inquiry regarding their credit.\n2) Loan Request Form Matching and Transmission. Our proprietary systems and technology match a given consumers loan request form data, credit profile and geographic location against certain pre-established criteria of Network Lenders, which may be modified from time to time. Once a given loan request passes through the matching process, the loan request is automatically transmitted to up to five participating Network Lenders.\n3) Lender Evaluation and Response. Network Lenders that receive a loan request form evaluate the information contained in it to determine whether to make a conditional loan offer.\n4) Communication of a Conditional Offer. All matched Network Lenders and any conditional offers are presented to the consumer upon completion of the loan request form. Consumers can return to the site and view their offer(s) at any time by logging in to their MyBorrowMoney.com profile. Additionally, matched lenders and offers are also sent to the email address associated with the consumer request.\nThe Company also offers consumers other mortgage marketplace products such as:\n- an alternative short-form matching process, which provides them with lender contact information rather than conditional offers from Network Lenders, and\n- a rate table loan marketplace, where consumers can enter their loan and credit profile and dynamically view real-time rates from lenders without entering their contact information.\nNon-Mortgage Products\nLending Products. Other lending products which will soon be available on the Companys online marketplace include information, tools and access to multiple conditional loan offers for the following:\n- Auto, which includes our auto refinance and purchase loan products. Auto loans enable consumers to purchase new or used vehicles or refinance an existing loan secured by an automobile.\n- Home equity loans and lines of credit, which enable homeowners to borrow against the equity in their home, as measured by the difference between the market value of the home and any existing loans secured by the home. Home equity loans are one-time lump sum loans, whereas a home equity line of credit reflects a line of revolving credit where the borrower has flexibility to draw down and repay the line.\n- Personal loans, which are unsecured obligations generally carrying shorter terms and smaller loan amounts than home mortgages.\n- Reverse mortgage loans, which are a loan product available to qualifying homeowners age 62 or older.\n- Small business loans, which include a broad array of financing types, including but not limited to loans secured by working capital, equipment, real estate and other forms of financing, provided to small and medium-sized businesses.\n- Student loans, which includes both new loans to finance an education and related expenses, as well as refinancing of existing loans.\nThe Company intends to continue adding new lending offerings for consumers, small businesses and lenders on its online marketplace, in order to grow and diversify its sources of revenue. The Company may develop such new offerings through internal product development efforts, strategic business relationships with third parties and/or acquisitions.\nOther Products. Other products will be available in the future and will include information, tools and access to the following:\n- Small business loans, which include a broad array of financing types, including but not limited to loans secured by working capital, equipment, real estate and other forms of financing, provided to small and medium-sized businesses.\n- Student loans, which include both new loans to finance education and related expenses, as well as refinancing of existing loans.\n- Deposit accounts, through which consumers can access depository deals and analysis covering all major deposit product categories.\n- Credit repair, through which consumers can obtain assistance improving their credit profiles, in order to expand and improve loan and other financial product opportunities available to them.\n- Debt relief services, through which consumers can obtain assistance negotiating existing loans.\n- Home improvement services, through which consumers have the opportunity to research and find home improvement professional services.\n- Personal credit data, through which consumers can gain insights into how prospective lenders and other third parties view their credit profiles.\n- Real estate brokerage services, through which consumers are matched with local realtors who can assist them in their home purchase or sale efforts.\n- Various consumer insurance products, including home and automobile, through which consumers are matched with insurance lead aggregators to obtain insurance offers.\nThe Company refers to the various purchasers of leads from its other marketplaces as lead purchasers. The Company plans to generate revenue from the deposit account product from a consumer clicking from its website through to a financial institutions website. The Company plans to generate revenue through the insurance products and real estate brokerage services through match fees paid to the Company by insurance lead aggregators and real estate brokers participating in its online marketplace. The Company plans to generate revenue from credit repair and debt relief services either through a fee for a customer referral to a service provider partner or through a fee at the time a consumer enrolls in a program with one of its partners. Revenue for home services is planned to be derived primarily through matching of leads to other home services lead aggregators.\nSeasonality\nThe Company anticipates revenue in its lending business to be subject to cyclical and seasonal trends. Home sales (and purchase mortgages) typically rise during the spring and summer months and decline during the fall and winter months, while refinancing and home equity activity is principally driven by mortgage interest rates as well as real estate values. However, in certain historical periods, additional factors affecting the mortgage and real estate markets, such as the 2008-2009 financial crisis and ensuing recession, have impacted customary seasonal trends.\nThe Company anticipates revenue in its newer products will be cyclical as well; however, the Company has limited historical data to predict the nature and magnitude of this cyclicality. Based on industry data, the Company anticipates that as its personal loan product matures, will experience less consumer demand during the fourth and first quarters of each year. The Company anticipates higher consumer demand for deposit accounts in the first quarter of each year. The majority of consumer demand for student loan products occurs in the third quarter coinciding with collegiate enrollment in late summer. Other factors affecting its businesses include macro factors such as credit availability in the market, interest rates, the strength of the economy and employment.\nCompetition\nThe Company competes with other online marketing companies, including online intermediaries that operate network-type arrangements. The Company also faces competition from lenders that source consumer loan originations directly. These companies typically operate consumer-branded websites and attract consumers via online banner ads, keyword placement on search engines, direct mail, television ads, retail branches, realtors, brokers, radio and other sources, partnerships with affiliates and business development arrangements with others, including major online portals.\nProduct Development\nThe Company invests in the continued development of both new and existing products to enhance the experiences of consumers and lenders as they interact with the Company.\nCorporate History\nBorrowMoney.com, Inc. was incorporated in the state of New York on January 27, 2000. The Company was reincorporated in Florida on May 4, 2015. The Company completed a share exchange with all of the stockholders of BorrowMoney.com, Inc., a New York corporation whereby 100% of the issued and outstanding shares of the New York corporation were exchanged for 20 million shares of the Florida corporation, which resulted in BorrowMoney.com, Inc. The New York corporation becoming a wholly owned subsidiary of the Florida corporation. Unless the context otherwise requires, all references to the Company, we, our BorrowMoney or us and other similar terms collectively means BorrowMoney.com, Inc., the Florida corporation.\nRegulation and Legal Compliance\nThe goal of the Companys businesses is to market and provide services in heavily regulated industries through a number of different online and offline channels across the United States. As a result, the Company is subject to a variety of statutes, rules, regulations, policies and procedures in various jurisdictions in the United States, including:\n- Restrictions on the manner in which consumer loans are marketed and originated, including, but not limited to, the making of required consumer disclosures, such as the Federal Trade Commissions Mortgage Advertising Practices (MAP) Rules, federal Truth-in-Lending Act, the federal Equal Credit Opportunity Act, the federal Fair Credit Reporting Act, the federal Fair Housing Act, the federal Real Estate Settlement Procedures Act (RESPA), and similar state laws;\n- Restrictions imposed by the Dodd-Frank Wall Street Reform and Consumer Protection Act (the Dodd Frank Act) and current or future rules promulgated thereunder, including, but not limited to, limitations on fees charged by mortgage lenders, mortgage broker disclosures and rules promulgated by the Consumer Financial Protection Bureau (CFPB), which was created under the Dodd-Frank Act;\n- Restrictions on the amount and nature of fees that may be charged to lenders and real estate professionals for providing or obtaining consumer loan requests, such as under RESPA;\n- Federal and State laws relating to the implementation of the Secure and Fair Enforcement of Mortgage Licensing Act of 2008 (the SAFE Act) that require us to be licensed in all States and the District of Columbia (licensing requirements are applicable to both individuals and/or businesses engaged in the solicitation of or the brokering of residential mortgage loans and/or the brokering of real estate transactions);\n- State and federal restrictions on the marketing activities conducted by telephone, mail, email, mobile device or the internet, including the Telemarketing Sales Rule (TSR), the Telephone Consumer Protection Act (TCPA), state telemarketing laws, federal and state privacy laws, the CAN-SPAM Act, and the Federal Trade Commission Act and their accompanying regulations and guidelines;\n- State laws requiring licensure for or otherwise imposing restrictions on the solicitation of or brokering of consumer loans which could affect us in our personal loan, automobile loan, student loan, credit card, or other non-mortgage consumer lending businesses;\n- Restrictions on the usage and storage of consumer credit information, such as those contained in the federal Fair Credit Reporting Act and the federal Credit Repair Organization Act; and\n- State Bird Dog laws which restrict the amount and nature of fees, if any, that may be charged to consumers for automobile direct and indirect financing.\nIntellectual Property\nThe Company believes that its intellectual property rights are vital to its success. To protect its intellectual property rights in its brand, technology, products, improvements, and inventions, the Company relies on a combination of trademarks, trade secrets, patents and other laws, and contractual restrictions on disclosure, including confidentiality agreements with strategic partners, employees, consultants and other third parties. As new or improved proprietary technologies are developed or inventions are identified, the Company plans to seek patent protection in the United States and abroad, as appropriate.\nMany of the Companys services are offered under proprietary trademarks and service marks. The Company generally applies to register or secure, by contract its principal trademarks and service marks as they are developed and used.\nThe Company reserves and registers its domain names when and where deemed appropriate, and currently have over 30 registered domain names. The Company also has agreements with third parties that provide for the licensing of patented and proprietary technology used in its business.\nFrom time to time, the Company may be subjected to legal proceedings and claims, or threatened legal proceedings or claims, including allegations of infringement of third-party trademarks, copyrights, patents and other intellectual property rights of third parties. In addition, the use of litigation and other dispute resolution processes, such as Uniform Domain Name Dispute Resolution, may be necessary for the Company to enforce its intellectual property rights, protect trade secrets or to determine the validity and scope of proprietary rights claimed by others. Any litigation of this nature, regardless of outcome or merit, could result in substantial costs and diversion of management and technical resources, any of which could adversely affect its business, financial condition, and results of operations.\nEmployees\nNone\nAdditional Information\nWebsite and Public Filings\nThe Company maintains a corporate website at BorrowMoney.com and an investor relations website at www.borrowmoney.com/investor-relations. None of the information on the website is incorporated by reference in this report, or in any other filings with, or in any information furnished or submitted to, the SEC.\nThe Company makes available, free of charge through its website, reports on Forms 10-K, 10-Q and 8-K, proxy statements for annual stockholders meetings and beneficial ownership reports on Forms 3, 4 and 5 as soon as reasonably practicable after the Company files such materials with, or furnish such materials to, the SEC.\nCode of Business Conduct and Ethics\nThe Companys code of business conduct and ethics, which applies to all employees, including all executive officers and senior financial officers and directors, is posted on the Companys website at borrowmoney.com/investor-relations. ITEM 1A. Risk Factors\nAs a smaller reporting company, the Company is not required to provide the information required by this Item.\nThe above statement notwithstanding, stockholders and prospective investors should be aware that certain risks exist with respect to the Company and its business, including those risk factors contained in the most recent Registration Statements on Form S-1, as amended. These risks include, among others: limited assets, lack of significant revenues and only losses since inception, industry risks, dependence on third party manufacturers/suppliers and the need for additional capital. The Companys management is aware of these risks and has established the minimum controls and procedures to ensure adequate risk assessment and execution to reduce loss exposure. Item 1B. Unresolved Staff Comments\nNone. Item 2. Properties\nThe Companys principal executive offices are located in a Fort Lauderdale, Florida. Item 3. Legal Proceedings\nOn March 22, 2022 the Company was served a summons, filed March 18, 2022, related to a civil lawsuit by Ajuni Properties, LLC. (plaintiff) versus BorrowMoney.Com, Inc. (defendant). The claim relates to the nonpayment of leased office space and the amount of claim is between $15,000 - $30,000. The Company has reflected an accrual on its balance sheet of approximately $13,000 as of August 31, 2023 included in Due to Related Party.\nOn March 27, 2022 the Company was served a summons, filed March 18, 2022, related to a civil lawsuit by Harthorne Capital, Inc. (plaintiff) versus BorrowMoney.Com, Inc. (defendant). The claim relates to the outstanding line of credit, and the amount of claim is between $8,000 - $15,000. The Company currently reflects the outstanding balance of $13,033 as of August 31, 2023 on its balance sheet under the line item - Line of credit - related party.\nThe Company is disputing both claims and has recently filed a written response.\nOn June 21, 2022, Andrew Trumbach filed an action against BorrowMoney.Com for breach of contract and unpaid wages arising out of an alleged business arrangement between himself and BorrowMoney.Com. Mr. Trumbachs amount of claim is over $100,000. The Company has decided not to accrue any amount related to the claim, as it believes the claim lacks any arguable basis. Item 4. Mine Safety Disclosures\nNot applicable. Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nThe trading price of the Companys common stock could be subject to wide fluctuations in response to various events or factors, many of which are beyond the Companys control.\nThe Companys common stock trades on a limited and sporadic basis and should not be deemed to constitute an established public trading market. There may not be liquidity in the common stock.\nThe following table sets forth the high and low sale prices for the period from September 1, 2022, through August 31, 2023. The information reflects prices between dealers, and does not include retail markup, markdown, or commission, and may not represent actual transactions.\nFiscal Year Period High Sales\nPrice\nLow Sales\nPrice\nFirst Quarter (Sep 1, 2022, to Nov 30, 2022) $ 0.0350 $ 0.0320\nSecond Quarter (Dec 1, 2022, to Feb 28, 2023) $ 0.0405 $ 0.0350\nThird Quarter (Mar 1, 2023, to May 31, 2023) $ 0.0298 $ 0.0200\nFourth Quarter (Jun 1, 2023, to Aug 31, 2023) $ 0.0125 $ 0.0120\nDividends\nThe Company has never paid any cash dividends on its common stock. The Company currently anticipates that it will retain all future earnings for use in its business. Consequently, the Company does not anticipate paying any cash dividends in the foreseeable future. The payment of dividends in the future will depend upon its results of operations, as well as its short-term and long-term cash availability, working capital, working capital needs, and other factors as determined by its Board of Directors. Currently, except as may be provided by applicable laws, there are no contractual or other restrictions on its ability to pay dividends if the Company was to decide to declare and pay dividends.\nHolders of Our Common Stock\nAs of the date of this Annual Report, the Company had 79 stockholders of common stock, not including any persons who hold their stock in street name.\nPenny Stock\nThe SEC has adopted rules that regulate broker-dealer practices in connection with transactions in penny stocks. Penny stocks are generally equity securities with a market price of less than $5.00, other than securities registered on certain national securities exchanges or quoted on the NASDAQ system, provided that current price and volume information with respect to transactions in such securities is provided by the exchange or system. The penny stock rules require a broker-dealer, prior to a transaction in a penny stock, to deliver a standardized risk disclosure document prepared by the SEC, that: (a) contains a description of the nature and level of risk in the market for penny stocks in both public offerings and secondary trading; (b) contains a description of the brokers or dealers duties to the customer and of the rights and remedies available to the customer with respect to a violation of such duties or other requirements of the securities laws; (c) contains a brief, clear, narrative description of a dealer market, including bid and ask prices for penny stocks and the significance of the spread between the bid and ask price; (d) contains a toll-free telephone number for inquiries on disciplinary actions; (e) defines significant terms in the disclosure document or in the conduct of trading in penny stocks; and (f) contains such other information and is in such form, including language, type size and format, as the SEC shall require by rule or regulation.\nThe broker-dealer also must provide, prior to effecting any transaction in a penny stock, the customer with (a) bid and offer quotations for the penny stock; (b) the compensation of the broker-dealer and its salesperson in the transaction; (c) the number of shares to which such bid and ask prices apply, or other comparable information relating to the depth and liquidity of the market for such stock; and (d) a monthly account statement showing the market value of each penny stock held in the customers account.\nIn addition, the penny stock rules require that prior to a transaction in a penny stock not otherwise exempt from those rules, the broker-dealer must make a special written determination that the penny stock is a suitable investment for the purchaser and receive the purchasers written acknowledgment of the receipt of a risk disclosure statement, a written agreement as to transactions involving penny stocks, and a signed and dated copy of a written suitability statement.\nThese disclosure requirements may have the effect of reducing the trading activity for its common stock should the stock ever be traded on a public market. Therefore, stockholders may have difficulty selling the securities.\nSecurities Authorized for Issuance under Equity Compensation Plans\nThe Company does not have any equity compensation plans.\nThe Company claims an exemption from registration for the grant/issuance and sales described above pursuant to Section 4(a)(2) and/or Rule 506 of Regulation D of the Securities Act, since the foregoing grant/issuance did not involve a public offering, the recipients were accredited investors and/or had access to similar information as would be included in a Registration Statement under the Securities Act. The securities were offered without any general solicitation by the Company or its representatives. No underwriters or agents were involved in the foregoing issuances and the Company paid no underwriting discounts or commissions. The securities are subject to transfer restrictions, and the certificates evidencing the securities contain an appropriate legend stating that such securities have not been registered under the Securities Act and may not be offered or sold absent registration or pursuant to an exemption therefrom. The securities were not registered under the Securities Act and such securities may not be offered or sold in the United States absent registration or an exemption from registration under the Securities Act and any applicable state securities laws.\nPurchase of Equity Securities by the Issuer and Affiliated Purchasers\nThe Company does not have any recent purchases of equity securities. Item 6. Selected Financial Data\nAs a smaller reporting company, the Company is not required to provide the information required by this Item. Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations\nThe following information specifies certain forward-looking statements of management of the Company. Forward-looking statements are statements that estimate the happening of future events are not based on historical fact. Forward-looking statements may be identified by the use of forward-looking terminology such as, may, shall, could, expect, estimate, anticipate, predict, probable, possible, should, continue, or similar terms, variations of those terms or the negative of those terms. The forward-looking statements specified in the following information have been complied by our management and considered by management to be reasonable. The Companys future operating results, however, are impossible to predict and no representation, guaranty or warranty is to be inferred from those forward-looking statements.\nThe assumptions used for purposes of the forward-looking statements specified in the following information represent estimates of future events and are subject to uncertainty as to possible changes in economic, legislative, industry and other circumstances. As a result, the identification and interpretation of data and other information and their use in developing and selecting assumptions from and among reasonable alternatives requires the exercise of judgment. To the extent that the assumed events do not occur, the outcome may vary substantially from anticipated or projected results, and accordingly, no opinion is expressed on the achievability of these forward-looking statements. No assurance can be given that any of the assumptions relating to the forward-looking statements specified in the following information are accurate, and we assume no obligation to update any such forward-looking statements.\nOverview\nBorrowMoney.com, Inc. operates as a leading online loan marketplace for consumers seeking loans and other credit-based offerings. The Company offers borrowers screened lenders and takes steps to ensure the lenders trustworthiness and legitimacy. The Company provides institutional lenders with innovative digital solutions by offering fintech technologically advanced gathered leads through an exclusive proprietary platform. Its online marketplace provides consumers with access to product offerings from our Network Lenders, including mortgage loans, home equity loans and lines of credit, reverse mortgage loans, auto loans, credit cards, deposit accounts, personal loans, student loans, small business loans and other related offerings. In addition, we offer tools and resources, including free credit scores that facilitate comparison shopping for these loans, deposits and other credit-based offerings. We seek to match consumers with multiple lenders, who can provide them with competing quotes for the product they are seeking.\nThe Company also serves as a valued partner to lenders seeking an efficient, scalable and flexible source of customer acquisition with directly measurable benefits, by matching the consumer inquiries we generate with these lenders.\nThe BorrowMoney.com platform offers a personalized loan comparison-shopping experience by providing free credit scores and credit score analysis. This platform enables us to observe consumers credit profiles and then identify and alert them to loan and other credit-based opportunities on our marketplace that may be more favorable than the loans they may have at a given point in time. This is designed to provide consumers with measurable savings opportunities over their lifetimes.\nIn addition to operating its core mortgage inquiry and leads business, the Company is focused on growing its non-mortgage lending businesses and developing new product offerings and enhancements to improve the experiences that consumers and lenders have as they interact with us. By expanding its portfolio of loans and other product offerings, the Company is growing and diversifying its business and sources of revenue. The Company intends to capitalize on its expertise in performance marketing, product development and technology, and to leverage the widespread recognition of the BorrowMoney.com brand to affect this strategy.\nThe Company believes the consumer and small business financial services industry is in the early stages of a fundamental shift to online product offerings, similar to the shift that started in retail and travel many years ago and is now well established. The Company believes that like retail and travel, as consumers continue to move towards online shopping and transactions for financial services, suppliers will increasingly shift their product offerings and advertising budgets toward the online channel. The Company believes the strength of its brands and its lender network, place the Company in a strong position to continue to benefit from this market shift.\nBorrowMoney.com, Inc.s main objective is to provide lead generation services to the mortgage and loan lenders. BorrowMoney.com, Inc.s business model envisions providing current, qualified leads to local lending institutions nationwide. These leads will represent qualified borrowers in targeted zip code locations where the lender conducts business. The Companys internet platform offers a portal geared toward providing services to lending institutions who would be its customers. The key function of the Companys platform is to provide qualified leads to local mortgage and lending professionals. The Company generates customer inquiries using various marketing methods. The Company also sells advertising space on its website and creates revenue through the sale of advertisement space, membership fees and lead packages.\nThe Company is an emerging growth company, as defined in Section 2(a) of the Securities Act, as modified by the Jumpstart Our Business Startups Act of 2012, or the JOBS Act. As such, is eligible to take advantage of certain exemptions from various reporting requirements that are applicable to other public companies that are not emerging growth companies including, but not limited to, not being required to comply with the auditor attestation requirements of Section 404 of the Sarbanes-Oxley Act of 2002, or the Sarbanes-Oxley Act, reduced disclosure obligations regarding executive compensation in our periodic reports and proxy statements, and exemptions from the requirements of holding a non-binding advisory vote on executive compensation and stockholder approval of any golden parachute payments not previously approved. If some investors find our securities less attractive as a result, there may be a less active trading market for our securities and the prices of our securities may be more volatile.\nIn addition, Section 107 of the JOBS Act also provides that an emerging growth company can take advantage of the extended transition period provided in Section 7(a)(2)(B) of the Securities Act for complying with new or revised accounting standards. In other words, an emerging growth company can delay the adoption of certain accounting standards until those standards would otherwise apply to private companies. The Company intends to take advantage of the benefits of this extended transition period until we are no longer an emerging growth company.\nThe Company will remain an emerging growth company until the earlier of (1) the last day of the fiscal year (a) in which the Company has total annual gross revenue of at least $1.07 billion, or (b) in which is deemed to be a large accelerated filer, which means the market value of common stock that is held by non-affiliates exceeds $700 million as (2) the date on which the Company has issued more than $1.0 billion in non-convertible debt during the prior three-year period.\nLimited Operating History\nThe Company has not previously demonstrated that it will be able to expand its business through an increased investment in its product lines and/or marketing efforts. The Company cannot guarantee that the expansion efforts described in this report will be successful. The Companys business is subject to risks inherent in growing an enterprise, including limited capital resources and possible rejection of its products and/or sales methods.\nManagement Changes\nOn December 1, 2022, the Board of Directors of BorrowMoney.com, Inc. accepted the appointment of Anne Marie Chipolone as a director of the BorrowMoney.com, Inc.\nOn September 1, 2023 the Board of Directors of BorrowMoney.com, Inc. accepted the appointment of Aldo Piscitello as President and Aldo Piscitello as Secretary of BorrowMoney.com, Inc.\nPlan of Operations\nThe Company has completed its technology platform. The Company is now entering its operational phase which includes contracting business loan, mortgage and personal loan lenders for geographic areas using ZIP Codes. In addition to expanding its network of lenders over the next 12 months, the Company intends to continue optimizing and enhancing its Internet-based platform to focus on lead generation and generating additional revenues for the marketplace services. The Companys mission is to be the premier loan lead generation company. The budget for the next 12 months is estimated to be $500,000, which is expected to come from friends, family, and officers. A breakdown of the estimated cost for our next 12 months of operation are as follows:\n(000s )\nLegal and Professional Fees $ 50.0\nWeb Hosting Service, and Maintenance 8.0\nSubcontracting Services 280.0\nOffice Expenses 5.0\nIT Maintenance and Service 10.0\nDomain Names Hosting, Service and Maintenance 2.5\nWebsite Development and Related Service 15.0\nLicenses and Permits 3.5\nMarketing and Advertising 50.0\nBank Charges and Credit Card Processing Fees 3.0\nRent 25.0\nDues and Subscriptions 7.5\nComputer Expenses 5.0\nTransfer and Recording Costs 10.0\nOffice Space Rent 22.0\nTelephone Service 3.5\nTotal $ 500.0\nRevenues are expected to be minimal as the volume of lender agreements during this stage of operation is expected to increase at a gradual pace throughout the year. We expect to operate at a loss during our initial growth/operating period. President, Directors, or other executive officers will be compensated with sweat equity options until such time that the company has positive cash flows.\nContingent upon the successful completion of our next 12 months of operation, we plan to aggressively expand our operation and business from existing revenues. Our expansion would be accompanied by an increase in the number of personnel to obtain lender agreements for ever-expanding geographic areas.\nChannels of Distribution; Marketing Costs\nBorrowMoney.com markets and offers services directly to customers through its branded website allowing customers to be pre-qualified in a one stop platform and have access to all the major lenders and loan programs. The Company has made, and expects to continue to make, substantial investments in its online technology platform and marketing strategy to build its brand awareness in the marketplace that will drive traffic and generate leads. The need for online mortgages and personal money loan platform is driven not only by the millennium generation that are moving away from traditional brick and mortar banks but also from the new lifestyle changes caused by the Covid-19 pandemic. BorrowMoney.com expects to take advantage of this opportunity to capture a large portion of this new marketplace demand and increase its revenue exponentially.\nResults of Operations\nThe Company had $0 in revenues for the year ended August 31, 2023 and $24,930 for the year ended August 31, 2022. The revenue decline is primarily attributed to the strategic shift in focus during the year ending August 31, 2023. While revenue for 2022 was non-mortgage related, 2023 saw no revenue due to the companys dedicated resources in addressing unwarranted lawsuits from the former CFO. The company aims to resume revenue generation post-lawsuit conclusion, prioritizing financial stability and sustainable growth. Operating expenses for the year ended August 31, 2023 were $64,126 compared to $121,552 for the year ended August 31, 2022. Other expense for the year ended August 31, 2023 were $30,333 compared to $643,302 for the year ended August 31, 2022. The decrease in other expense was primarily due to fees of $605,111 incurred in the second quarter of 2022, related to the settlement with William Coburn, which was settled with the issuance of unrestricted common stock.\nThe following table provides selected financial data about the Company as of August 31, 2023, and August 31, 2022.\nBalance Sheet Date (000s) August 31,\nAugust 31,\nCash $ 48.8 $ 4.0\nTotal Assets $ 55.798 $ 4.0\nTotal Liabilities $ 828.1 $ 681.9\nStockholders Deficit $ (772.4 ) $ (677.9 )\nWorking Capital Deficit $ (751.6 ) $ (677.9 )\nAs of August 31, 2023, the Companys cash balance was $48,818 compared to $4,025 as of August 31, 2022, and our total assets as of August 31, 2023, were $55,798.\nAs of August 31, 2023, the Company had total liabilities of $828,175 compared with total liabilities of $681,943 as of August 31, 2022. The increase in total liabilities for the year ended August 31, 2023, was primarily the result of an increase in accrued interest and notes.\nThe Company had $65,228 of cash used in operating activities for the year ended August 31, 2023, compared to $63,448 of cash used in operating activities for the year ended August 31, 2022.\nThe Company had $8,332 of cash used in investing activities for the year ended August 31, 2023, compared to $0 of cash used in investing activities for the year ended August 31, 2022.\nThe Company had $118,354 cash provided by financing activities for the year ended August 31, 2023, compared to $58,158 of cash provided by financing activities for the year ended August 31, 2022.\nFinancial Position, Liquidity and Capital Resource\nAs of August 31, 2023, all cash loaned to the Company to pay its operating and development expenses has been furnished by loans from its founder and President, Aldo Piscitello, as well as from the sale of equity and advances by related parties and advances from a line of credit. Additionally, the Company anticipates selling shares of the Company through a private offering of its securities to supplement its capital requirements in the future, as funding is needed.\nInterest expense of $41,269 and $38,192 for the years ended August 31, 2023, and 2022, respectively, was the result of accruals related to shareholder and related party.\nPlan of Operation and Funding\nDuring the next twelve months, the Company anticipates that its principal sources of funding will comprise of proceeds from sales of common stock, revenue generated from our operations, and additional debt, if needed.\nCritical Accounting Policies\nThe Companys critical accounting policies, including the assumptions and judgments underlying them, are disclosed in the Notes to the Consolidated Financial Statements. The Company has consistently applied these policies in all material respects. The Company does not believe that its operations to date have involved uncertainty of accounting treatment, subjective judgment, or estimates, to any significant degree.\nAccounting Estimates - The preparation of financial statements in conformity with accounting principles generally accepted in the United States of America, requires management to make estimates and assumptions that affect certain reported amounts and disclosures. These estimates and assumptions affect the reported amounts of assets and liabilities, the disclosure of contingent liabilities, and the reported amounts of revenues and expenses. Accordingly, actual results could differ from those estimates.\nCash and Cash Equivalents - For financial statement presentation purposes, the Company considers those short-term, highly liquid investments with original maturities of three months or less to be cash or cash equivalents. There were no cash equivalents on August 31, 2023 and August 31, 2022.\nRevenue Recognition - The Company recognizes revenue in accordance with Accounting Standards Update (ASU) No. 2014-09, Revenue from Contracts with Customer. The Company applies the following five steps in order to determine the appropriate amount of revenue to be recognized as it fulfills its obligations under each of its agreements:\nRevenue is recognized based on the following five step model:\n● Identification of the contract with a customer\n● Identification of the performance obligations in the contract\n● Determination of the transaction price\n● Allocation of the transaction price to the performance obligations in the contract\n● Recognition of revenue when, or as, the Company satisfies a performance obligation\nRevenues are recognized when control of the promised goods or services is transferred to the customer in an amount that reflects the consideration the Company expects to be entitled to in exchange for transferring those goods or services.\nGoing Concern\nBecause the Company has suffered recurring losses from operations and negative operating cash flows, there is substantial doubt about the Companys ability to continue as a going concern. The ability to continue as a going concern is dependent on Managements plans, which include potential asset acquisitions, mergers or business combinations with other entities, further implementation of its business plan and continuing to raise funds through debt or equity raises. The accompanying consolidated financial statements have been prepared on a going concern basis, which contemplates the realization of assets and the satisfaction of liabilities in the normal course of business.\nOff-Balance Sheet Arrangements\nThe Company has no off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on its financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources that is material to stockholders. Item 7A. Quantitative and Qualitative Disclosures about Market Risk\nAs a smaller reporting company, as defined by Rule 229.10(f) (1) of Regulation S-K, the Company is not required to provide the information required by this Item. The Company has chosen to disclose, however, that it has not engaged in any transactions, issued or bought any financial instruments or entered into any contracts that are required to be disclosed in response to this item. Item 8. Financial Statements and Supplementary Data\nCertified Public Accountants and Advisors\nA PCAOB Registered Firm\n817-721-0341 bartoncpafirm.com Cypress, Texas\nReport of Independent Registered Public Accounting Firm\nTo the Board of Directors and Shareholders\nBorrowmoney.com, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of Borrowmoney.com, Inc. as of August 31, 2023, and the related statements of operations, stockholders equity, and cash flows for the year then ended, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of Borrowmoney.com, Inc. as of August 31, 2023, and the results of its operations and its cash flows for the year ended August 31, 2023, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the entitys management. Our responsibility is to express an opinion on these financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to Borrowmoney.com, Inc. in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Borrowmoney.com, Inc. is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the entitys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nSubstantial Doubt About the Entitys Ability to Continue as a Going Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 2 to the financial statements, the Company has yet to generate revenue from intended operations, has a net capital deficiency, and therefore a substantial doubt exists about the Companys ability to continue as a going concern. Managements evaluation of the events and conditions and managements plans regarding these matters are also described in Note 2. The financial statements do not include any adjustments that might result from the outcome of this uncertainty. Our opinion is not modified with respect to this matter.\nCritical Audit Matters\nCritical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. We determined that there are no critical audit matters\nWe have served as Borrowmoney.com, Inc.s auditor since 2023.\nCypress, Texas\nBARTON CPA.,\nDecember 11, 2023\nPCAOB ID: 6968\nBorrowMoney.com, Inc.\nConsolidated Balance Sheets\nAugust 31,\nAugust 31,\nAssets\nCurrent assets:\nCash $ 48,819 $ 4,025\nTotal current assets 48,819 4,025\nNon-current assets:\nSoftware Development 6,979 -\nTotal noncurrent assets 6,979 -\nTotal Assets $ 55,798 $ 4,025\nLiabilities and Stockholders Deficit\nCurrent liabilities:\nAccounts payable and accrued expenses $ 17,694 $ 31,075\nLine of credit - related party - 13,033\nAccrued interest 201,612 160,353\nDue to related party - 14,738\nNote payable-related party, current portion 581,098 462,744\nTotal current liabilities 800,404 681,943\nNon-current liabilities:\nLine of credit - related party 13,033 -\nDue to related party 14,738 -\nTotal non-current liabilities 27,771 -\nTotal Liabilities $ 828,175 $ 681,943\nCommitments and Contingencies (see note 6) - -\nStockholders deficit:\nPreferred stock, 100,000,000 $0.001 par value shares authorized\nnone issued and outstanding at August 31, 2023, and 2022 - -\nCommon stock, 500,000,000 shares authorized $0.001 par value; 111,619,561 and 111,619,561 shares issued and outstanding on August 31, 2023 and 2022, respectively 111,619 111,619\nStock subscription receivable (4,000 ) (4,000 )\nAdditional paid-in capital 1,037,873 1,037,873\nAccumulated deficit (1,917,869 ) (1,823,410 )\nTotal stockholders deficit (772,377 ) (677,918 )\nTotal Liabilities and Stockholders Deficit $ 55,798 $ 4,025\nThe accompanying notes to the financial statements are an integral part of these financial statements\nBorrowMoney.com, Inc.\nConsolidated Statements of Operations\nFor the year ended For the year ended\nAugust 31, 2023 August 31, 2022\nRevenue $ - $ 24,930\nCost of goods sold - 1,550\nGross Profit - 23,380\nOperating expenses:\nProfessional fees 15,500 47,386\nLegal fees 23,928 21,672\nGeneral and administrative 24,698 52,494\nTotal operating expenses 64,126 121,552\nLoss from operations (64,126 ) (98,172 )\nOther income (expense):\nOther Ordinary Income 10,936 -\nArbitration settlement - (605,111 )\nInterest expense (41,269 ) (38,191 )\nTotal other income (expenses) (30,333 ) (643,302 )\nNet loss before income taxes (94,459 ) (741,474 )\nIncome tax expense - -\nNet loss $ (94,459 ) $ (741,474 )\nBasic and diluted per common share amounts:\nBasic and diluted net loss per share $ (0.0008 ) $ (0.01 )\nWeighted average common shares outstanding (basic and diluted) 111,619,561 110,592,620\nThe accompanying notes to the financial statements are an integral part of these financial statements\nBorrowMoney.com, Inc.\nStatements of Changes in Stockholders Deficit\nCommon Stock Additional Stock\nTotal\nShares Common\nStock Paid-In\nCapital Subscription\nReceivable Accumulated\nDeficit Stockholders\nDeficit\nBalance at August 31, 2021 109,475,000 $ 109,475 $ 350,475 $ (4,000 ) $ (1,081,936 ) $ (625,986 )\nShares issued for cash 118,200 44,982 - - 45,100\nShares issued for services 50,633 28,314 - - 28,364\nShares issued for legal settlement 1,975,728 1,976 614,102 - - 616,078\nNet loss - - - - (741,474 ) (741,474 )\nBalance at August 31, 2022 111,619,561 $ 111,619 $ 1,037,873 $ (4,000 ) $ (1,823,410 ) $ (677,918 )\nBalance 111,619,561 $ 111,619 $ 1,037,873 $ (4,000 ) $ (1,823,410 ) $ (677,918 )\nNet loss - - - - (94,459 ) (94,459 )\nBalance at August 31, 2023 111,619,561 $ 111,619 $ 1,037,873 $ (4,000 ) $ (1,917,869 ) $ (772,377 )\nBalance 111,619,561 $ 111,619 $ 1,037,873 $ (4,000 ) $ (1,917,869 ) $ (772,377 )\nThe accompanying notes to the financial statements are an integral part of these financial statements\nBorrowMoney.com, Inc.\nStatements of Cash Flows\nFor the year ended For the year ended\nAugust 31, 2023 August 31, 2022\nCash flows from operating activities:\nNet loss $ (94,459 ) $ (741,474 )\nAdjustments to reconcile net loss to net cash used in operating activities:\nNon-cash item: Amortization expense 1,353 -\nStock based compensation - arbitration settlement - 605,111\nStock based compensation - other - 39,331\nChanges in net assets and liabilities\nAccounts payable and accrued expenses (13,382 ) (2,829 )\nAccrued interest 41,259 36,413\nCash (used in) operating activities (65,229 ) (63,448 )\nCash flows from investing activities\nSoftware Development (8,332 ) -\nCash used in investing activities (8,332 ) -\nCash flows from financing activities:\nNet change in note payable - related party 118,354 9,283\nNet change in due to related party - 1,995\nNet change in line of credit - related party - 1,779\nProceeds from sale of common stock - 45,100\nCash provided by financing activities 118,354 58,157\nNet change in cash 44,793 (5,291 )\nCash-beginning of period 4,025 9,316\nCash-end of period $ 48,818 $ 4,025\nSupplemental cash flow information\nCash paid for interest $ - $ -\nCash paid for taxes $ - $ -\nThe accompanying notes to the financial statements are an integral part of these financial statements\nBORROWMONEY.COM, INC.\nNotes to the Financial Statements\nFor the Years Ended August 31, 2023, and 2022\nNOTE 1 - ORGANIZATION AND NATURE OF BUSINESS\nBorrowMoney.com, Inc. (the Company), a Florida corporation formed in 2015, provides an internet-based platform that can match mortgage and loan providers with prospective borrowers. The Company offers to borrowers screened lenders and ensures the lenders trustworthiness and legitimacy. The Company provides institutional lenders with innovative digital solutions by offering fintech technologically advanced gathered leads through an exclusive proprietary platform.\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBasis of Presentation - The accompanying financial statements have been prepared in accordance with United States generally accepted accounting principles (U.S. GAAP).\nGoing Concern - The Company adopted Accounting Standards Update (ASU) No. 2014-15, Presentation of Financial Statements-Going Concern (Subtopic 205-40): Disclosure of Uncertainties about an Entitys Ability to Continue as a Going Concern (ASU 2014-15). The accompanying financial statements have been prepared assuming the Company will continue as a going concern, which contemplates, among other things, the realization of assets and satisfaction of liabilities in the normal course of business. The Company has earned $0 in revenue for the year ended August 31, 2023 and $24,930 for the year ended August 31, 2022.\nThe Company is commencing operations to generate sufficient revenue; however, the Companys cash position may not be sufficient to support the Companys daily operations. Management intends to raise additional funds by way of a private or public offering. While the Company believes in the viability of its strategy to commence operations and generate sufficient revenue and in its ability to raise additional funds, there can be no assurances to that effect. The ability of the Company to continue as a going concern is dependent upon the Companys ability to further implement its business plan and generate sufficient revenue and its ability to raise additional funds by way of private offerings. The financial statements do not include any adjustments related to the recoverability and classification of recorded asset amounts or the amounts and classification of liabilities that might be necessary should the Company be unable to continue as a going concern.\nReclassification of Prior Year Items - The Company reflected the reclassification of prior year items in order to be consistent with current period breakouts.\nAccounting Estimates - The preparation of financial statements in conformity with accounting principles generally accepted in the United States of America, requires management to make estimates and assumptions that affect certain reported amounts and disclosures. These estimates and assumptions affect the reported amounts of assets and liabilities, the disclosure of contingent liabilities, and the reported amounts of revenues and expenses. Accordingly, actual results could differ from those estimates.\nRisks and Uncertainties - The Company intends to operate in a highly competitive industry that is subject to intense competition, government regulation and rapid technological change. The Companys operations are subject to significant risk and uncertainties including financial, operational, technological, regulatory, and other risks associated with an emerging business, including the potential risk of business failure.\nCash and Cash Equivalents - For financial statement presentation purposes, the Company considers those short-term, highly liquid investments with original maturities of three months or less to be cash or cash equivalents. There were no cash equivalents on August 31, 2023 and August 31, 2022.\nWebsite Development Costs - The Company accounts for website development costs in accordance with Accounting Standards Codification (ASC) 350-50, Website Development Costs (ASC 350-50). All costs incurred in the planning stage are expensed as incurred, costs incurred in the website application and infrastructure development stage are accounted for in accordance with ASC 350-50 which requires the capitalization of certain costs that meet specific criteria, and costs incurred in the day to day operation of the website are expensed as incurred. The Company capitalizes external website development costs (website costs), which primarily include third-party costs related to acquiring domains and developing applications, as well as costs incurred to develop or acquire and customize code for web applications, costs to develop HTML web pages or develop templates and costs to create initial graphics for the website that included the design or layout of each page. The Company capitalized $8,332 and $0 for website costs for the years ended August 31, 2023 and August 31, 2022, respectively.\nConcentrations of Credit Risk - Accounts which potentially subject the Company to concentrations of credit risk consist of cash, cash and cash equivalents. The Company considers all highly liquid instruments with an original purchased maturity of three months or less to be cash equivalents. The Company maintains its cash and equivalents at insured financial institutions. The balances of which, at times may exceed the FDIC insured limits. Management believes the risk of loss is minimal.\nFair Value of Financial Instruments - The Companys financial instruments consist of cash and notes payable. Management estimates that the fair value of the notes payable does not differ materially from the aggregate carrying value of these financial instruments recorded (at cost) in the accompanying balance sheets. The Company has financial assets and liabilities, not required to be measured at fair value on a recurring basis, which primarily consist of cash, payables, and debt. The carrying value of cash and payables, approximate their fair values due to their short-term nature. Considerable judgment is required in interpreting market data to develop the estimates of fair value and, accordingly, the estimates are not necessarily indicative of the amounts that the Company could realize in a current market exchange.\nFair Value Measurements - The Company measures fair value under a framework that utilizes a fair value hierarchy that prioritizes the inputs to valuation techniques used to measure fair value. The hierarchy gives the highest priority to unadjusted quoted prices in active markets for identical assets or liabilities (level 1 measurements) and the lowest priority to unobservable inputs (level 3 measurements).\nThe three levels of inputs which prioritize the inputs used in measuring fair value are:\nLevel 1: Inputs to the valuation methodology are unadjusted quoted prices for identical assets or liabilities in active markets that the Company has the ability to access.\nLevel 2: Inputs to the valuation methodology include:\n● Quoted prices for similar assets or liabilities in active markets;\n● Quoted prices for identical or similar assets or liabilities in inactive markets;\n● Inputs other than quoted prices that are observable for the asset or liability; and\n● Inputs that are derived principally from or corroborated by observable market data by correlation or other means.\nIf the asset or liability has a specified (contractual) term, the level 2 input must be observable for substantially the full term of the asset or liability.\nLevel 3: Inputs to the valuation methodology are unobservable and significant to the fair value measurement.\nThe assets or liabilities fair value measurement level within the fair value hierarchy is based on the lowest level of any input that is significant to the fair value measurement. Valuation techniques used need to maximize the use of observable inputs and minimize the use of unobservable inputs.\nWhen the Company changes its valuation inputs for measuring financial assets and liabilities at fair value, either due to changes in current market conditions or other factors, it may need to transfer those assets or liabilities to another level in the hierarchy based on the new inputs used. The Company recognizes these transfers at the end of the reporting period that the transfers occur. For the fiscal years ended August 31, 2023, and 2022 there were no significant transfers of financial assets or financial liabilities between the hierarchy levels.\nRevenue Recognition - The Company recognizes revenue in accordance with ASU No. 2014-09, Revenue from Contracts with Customer (ASU No. 2014-09). The Company applies the following five steps in order to determine the appropriate amount of revenue to be recognized as it fulfills its obligations under each of its agreements-:\nRevenue is recognized based on the following five step model:\n● Identification of the contract with a customer\n● Identification of the performance obligations in the contract\n● Determination of the transaction price\n● Allocation of the transaction price to the performance obligations in the contract\n● Recognition of revenue when, or as, the Company satisfies a performance obligation\nRevenues are recognized when control of the promised goods or services is transferred to the customer in an amount that reflects the consideration the Company expects to be entitled to in exchange for transferring those goods or services.\nCosts to Obtain Customer Contracts\nSales commissions and related expenses are considered incremental and recoverable costs of acquiring customer contracts. These costs are capitalized and amortized on a straight-line basis over the anticipated period of benefit. The Company determined the period of benefit by taking into consideration the length of its customer contracts, its technology lifecycle, and other factors. Amortization expense is recorded in sales and marketing expense within the statement of operations. Historically the Company has not incurred incremental cost to acquire customer contracts.\nStock-Based Awards - The Company measures the cost of employee services received in exchange for an award of equity instruments, including stock options, based on the grant date fair value of the award and to recognize it as compensation expense over the period the employee is required to provide service in exchange for the award, usually the vesting period. The Company estimates the fair value of share-based payment awards on the date of grant using an option-pricing model. The value of the portion of the award that is ultimately expected to vest is recognized as expense over the requisite service periods in the Companys statement of operations. The forfeitures are estimated at the time of grant and revised, if necessary, in subsequent periods if actual forfeitures differ from those estimates. For the fiscal years ended August 31, 2023 and August 31, 2022, no awards were granted.\nIncome Taxes - The Company accounts for deferred income taxes on the asset and liability method whereby deferred tax assets are recognized for deductible temporary differences and deferred tax liabilities are recognized for taxable temporary differences. Temporary differences are the differences between the reported amounts of assets and liabilities and their tax bases. Deferred tax assets and liabilities are adjusted for the effects of changes in tax laws and rates on the date of enactment.\nDeferred tax assets are reduced by a valuation allowance when, in the opinion of management, it is more likely than not that some portion of all of the deferred tax assets will not be realized.\nWhen tax returns are filed, it is highly certain that some positions taken would be sustained upon examination by the taxing authorities, while others are subject to uncertainty about the merits of the position taken or the amount of the position that would be ultimately sustained. The benefit of a tax position is recognized in the financial statements in the period during which, based on all available evidence, management believes it is more likely than not that the position will be sustained upon examination, including the resolution of appeals or litigation processes, if any. Tax positions taken are not offset or aggregated with other positions. Tax positions that meet the more-likely-than-not recognition threshold are measured as the largest amount of tax benefit that is more than 50 percent likely of being realized upon settlement with the applicable taxing authority. The portion of the benefits associated with tax positions taken that exceeds the amount measured as described above is reflected as a liability for unrecognized tax benefits along with any associated interest and penalties that would be payable to the taxing authorities upon examination. As of August 31, 2023 the Company had no unrecognized tax benefits, and the Company had no positions which, in the opinion of management, would be reversed if challenged by a taxing authority.\nThe Companys evaluation of tax positions was performed for those tax years which remain open to audit. The Company may, from time to time, be assessed interest or penalties by the taxing authorities, although any such assessments historically have been minimal and immaterial to the Companys financial results. In the event the Company is assessed interest and/or penalties, such amounts will be classified as income tax expense in the financial statements.\nLoss Per Common Share - The basic earnings (loss) per common share is computed by dividing net income (loss) available to common stockholders by the weighted average number of common shares outstanding. Diluted loss per share is computed similarly to basic loss per share except that the denominator is increased to include the number of additional common shares that would have been outstanding if the potential common shares had been issued and if the additional common shares were dilutive. As of August 31, 2023 and August 31, 2022 there were 50,000 warrants and no potentially dilutive securities outstanding, respectively, all of which were excluded from loss per share calculation due to their anti-dilutive effect.\nRelated Party Transactions - The Company follows ASC 850-10, Related Party Disclosures (ASC 850-10), for the identification of related parties and disclosure of related party transactions. Pursuant to Section 850-10-20 the related parties include (a) affiliates of the Company (Affiliate means, with respect to any specified Person, any other Person that, directly or indirectly through one or more intermediaries, controls, is controlled by or is under common control with such Person, as such terms are used in and construed under Rule 405 under the Securities Act); (b) entities for which investments in their equity securities would be required, absent the election of the fair value option under the Fair Value Option Subsection of Section 825-10-15, to be accounted for by the equity method by the investing entity; (c) trusts for the benefit of employees, such as pension and profit-sharing trusts that are managed by or under the trusteeship of management; (d) principal owners of the Company; (e) management of the Company; (f) other parties with which the Company may deal if one party controls or can significantly influence the management or operating policies of the other to an extent that one of the transacting parties might be prevented from fully pursuing its own separate interests; and (g) other parties that can significantly influence the management or operating policies of the transacting parties or that have an ownership interest in one of the transacting parties and can significantly influence the other to an extent that one or more of the transacting parties might be prevented from fully pursuing its own separate interests. The financial statements shall include disclosures of material related party transactions, other than compensation arrangements, expense allowances, and other similar items in the ordinary course of business. However, disclosure of transactions that are eliminated in the preparation of consolidated or combined financial statements is not required in those statements. The disclosures shall include: (a) the nature of the relationship(s) involved; (b) a description of the transactions, including transactions to which no amounts or nominal amounts were ascribed, for each of the periods for which income statements are presented, and such other information deemed necessary to an understanding of the effects of the transactions on the financial statements; (c) the dollar amounts of transactions for each of the periods for which income statements are presented and the effects of any change in the method of establishing the terms from that used in the preceding period; and (d) amounts due from or to related parties as of the date of each balance sheet presented and, if not otherwise apparent, the terms and manner of settlement.\nRecently issued accounting pronouncements - The Company does not believe that any recently issued effective pronouncements, or pronouncements issued but not yet effective, if adopted, would have a material effect on the accompanying consolidated financial statements.\nNOTE 3 - RELATED PARTY TRANSACTIONS\nIn connection with a related party promissory note, the Company has an accrued interest obligation as of August 31, 2023, and August 31, 2022 of $201,612 and $160,353, respectively. The note was due on September 1, 2022 and was not paid off due to limited capital. As such, the parties agreed to continue the note at 8% until sufficient funds are available to pay off the loan. As of August 31, 2023, and 2022, the outstanding principal balance was $581,098 and $462,744, respectively. The whole amount is currently classified as current liability on or before March 2024 based on the agreement.\nThe Company utilizes approximately 1,500 square feet of office space in 512 Bayshore Dr, Fort Lauderdale Florida. The space is owned by the President and is provided without charge to the Company. In addition, the Company utilized approximately 1,200 square feet of office space at 4403 Peters Road, Fort Lauderdale, Florida for at a total rental charge of $14,500 for the year ending August 31, 2022. The Company did not utilize the space in 2023.\nThe Company obtained a line of credit from a Delaware Corporation (owned by the former CFO) on November 30, 2020. Total advanced under this line of credit, to include interest, is $13,033 for the year ending August 31, 2023 and $13,033 for the year ending August 31, 2022. The line matured on November 25, 2022 and carries a default interest rate of 17%.\nNOTE 4 - EQUITY\nCommon Stock Warrants\nIn July 2019, the Company granted common stock warrants to purchase 50,000 shares of common stock to a service provider. The warrants have a 4.4 year term and an exercise price of $0.10 per share. The warrants are fully earned upon issuance and become exercisable on January 1, 2020. As of August 31, 2023, the warrants have not been exercised. The Company valued the warrants using the Black-Scholes model with the following key assumptions ranging from: stock price, $1.00, exercise price, $0.10, term remaining 4.4 years, volatility 292%, annual risk-free interest rate, 1.8%.\nAs of August 31, 2023, the Company valued the warrants using the Black-Scholes model with the following key assumptions: stock price, $0.0125, exercise price, $0.10, term remaining 0.33 year, volatility 52.5%, annual risk-free interest rate, 0.5%, exercise period; this warrant shall be exercisable, in whole or in part, on or after 9:00 am Eastern Time, January 1st, 2020, and until 5:00 pm Eastern Time, December 29th, 2023 (the Exercise Period).. At August 31, 2023 there was $0 in intrinsic value of outstanding stock warrants.\nThe Company has not declared or paid any dividends or returned any capital to common stock shareholders as of August 31, 2023, and 2022.\nNOTE 5 - INCOME TAXES\nThe Company has approximately $1,766,942 as of August 31, 2023, in available net operating loss (NOL) carryovers available to reduce future income taxes. These carryovers expire at various dates through the year 2040. The Company has adopted ASC 740 which provides for the recognition of a deferred tax asset based upon the value the loss carry-forwards will have to reduce future income taxes and managements estimate of the probability of the realization of these tax benefits. The Company has determined it is more likely than not that these timing differences will not materialize and have provided a valuation allowance against its entire net deferred tax asset of approximately $464,567.\nFuture utilization of currently generated federal and state NOL and tax credit carry forwards may be subject to a substantial annual limitation due to the ownership change limitations provided by the Internal Revenue Code of 1986, as amended and similar state provisions. The annual limitation may result in the expiration of NOL and tax credit carryforwards before full utilization.\nThe Company determines whether it is more likely than not that a tax position will be sustained upon examination based upon the technical merits of the position. If the more likely than not threshold is met, the Company measures the tax position to determine the amount to recognize in the financial statements. The Company performed a review of its material tax positions in accordance with these recognition and measurement standards. The Company has concluded that there are no significant uncertain tax positions requiring disclosure and there are not material amounts of unrecognized tax benefits.\nThe Company uses the asset and liability method of accounting for income taxes. Under this method, deferred tax assets and liabilities are recognized for the future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax basis. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to reverse.\nThe components of the current and deferred provision at August 31, 2023 and 2022 were as follows:\nFollowing is a summary of the components giving rise to the tax provision.\nSUMMARY OF COMPONENTS TO THE TAX PROVISION\nAugust 31, 2023\nAugust 31, 2022\nCurrently payable:\nFederal\n$ -\n$ -\nState\n-\n-\nTotal currently payable:\n-\n-\nIncrease (decrease) in Deferred:\nFederal\n(19,836 )\n(155,710 )\nState\n(5,195 )\n(40,781 )\nTotal Deferred:\n(25,031 )\n(196,491 )\nAllowance\n25,031\n196,491\nNet deferred\n-\n-\nTotal income tax provision (benefit)\n$ -\n$ -\nSCHEDULE OF DEFERRED TAX ASSETS\nAugust 31, 2023 August 31, 2022\nIndividual components giving rise to the deferred tax assets are as follows:\nFutures tax benefit arising from net operating loss carryovers $ 464,567 $ 439,536\nLess valuation allowance (464,567 ) (439,536 )\nNet deferred $ - $ -\nFor the fiscal years ended August 31, 2023 and 2022, the valuation allowance increased primarily as a result of the increase in net operating losses. In assessing the realizability of deferred income tax assets, management considers whether it is more likely than not that some portion or all of the deferred income tax assets will not be realized.\nNOL Carryforwards and Other Matters\nThe Company files income tax returns in the U.S. federal jurisdiction and the state of Florida. The Companys federal and state tax years for the 2019 fiscal year and forward are subject to examination by taxing authorities.\nThe Company did not have any unrecognized tax benefits as of August 31, 2023, and 2022. The Companys policy is to account for any interest expense and penalties for unrecognized tax benefits as part of the income tax provision. The Company does not anticipate that unrecognized tax benefits will significantly increase or decrease within the next twelve months.\nThe item accounting for the difference between income taxes computed at the federal statutory rate and the provision for income taxes are as follows:\nSCHEDULE OF EFFECTIVE INCOME TAX RATE AT FEDERAL STATUTORY RATE\nFor the Year For the Year\nEnded Ended\nAugust 31, 2023 August 31, 2022\nIncome tax at federal statutory rate (21.00 )% (21.00 )%\nState tax, net of federal effect (5.50 )% (5.50 )%\nIncome tax federal and state net (26.50 )% (26.50 )%\nValuation allowance 26.50 % 26.50 %\nEffective rate 0.00 % 0.00 %\nNOTE 6 - COMMITMENTS AND CONTINGENCIES\nDuring the normal course of business, the Company may be exposed to litigation. When the Company becomes aware of potential litigation, it evaluates the merits of the case in accordance with FASB ASC 450-20-50, Contingencies. The Company evaluates its exposure to the matter, possible legal or settlement strategies and the likelihood of an unfavorable outcome. If the Company determines that an unfavorable outcome is probable and can be reasonably estimated, it establishes the necessary accruals.\nOn March 22, 2022 the Company was served a summons, filed March 18, 2022, related to a civil lawsuit by Ajuni Properties, LLC. (plaintiff) versus BorrowMoney.Com, Inc. (defendant). The claim relates to the nonpayment of leased office space and the amount of claim is between $15,000 - $30,000. The Company has reflected an accrual on its balance sheet of approximately $14,000 as of August 31, 2023.\nOn March 27, 2022 the Company was served a summons, filed March 18, 2022, related to a civil lawsuit by Harthorne Capital, Inc. (plaintiff) versus BorrowMoney.Com, Inc. (defendant). The claim relates to the outstanding line of credit and the amount of claim is between $8,000 - $15,000. The Company currently reflects the outstanding balance of $13,033 as of August 31, 2023 on its balance sheet under the line item - Line of credit - related party.\nOn June 21, 2022, Andrew Trumbach filed an action against BorrowMoney.Com for breach of contract and unpaid wages arising out of an alleged business arrangement between himself and BorrowMoney.Com. Mr. Trumbachs amount of claim is over $100,000. The Company has decided not to accrue any amount related to the claim, as it believes the claim lacks any arguable basis.\nNOTE 7 - LEGAL SETTLEMENT\nA claim was made against Borrowmoney.com by William Coburn, a former officer of Borrowmoney.com, related to a contractual dispute over compensation. Borrowmoney.com, Inc. decided to engage in arbitration with Mr. Coburn in order to reduce legal expenses associated with his claim. On February 23, 2022, the Company entered into a settlement agreement with William Coburn. The settlement included issuance of 1,467,647 shares of the Companys common stock to William Coburn in addition to the issuance of 484,323 shares of the Companys common stock to Mr. Coburns attorneys, LaGarde Law Firm P.C. The issuance of the shares, represent the complete and final settlement of the claims Mr. Coburn had against the Company.\nNOTE 8 - SUBSEQUENT EVENTS\nThe Company has evaluated all subsequent events through December 11, 2023, the date the financial statements were available to be issued. There are no subsequent events to report. Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nOn March 21, 2023, BorrowMoney.com, Inc. (BorrowMoney.com or Company), (OTC: BWMY), announced that on March 21, 2023, its board of directors unanimously approved a change in auditors from ACCELL AUDIT & COMPLINCE, P.A. to BARTON CPA, a Texas CPA firm. The Company had chosen to use a more accessible CPA firm. Item 9A. Controls and Procedures\nEvaluation of Disclosure Controls and Procedure.\nDisclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) under the Exchange Act) are designed to ensure that information required to be disclosed in reports filed or submitted under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in Securities and Exchange Commission rules and forms and that such information is accumulated and communicated to management, including the Companys Principal Executive Officer/Principal Financial Officer (our principal executive officer and principal financial officer), to allow timely decisions regarding required disclosures. As of the end of the period covered by this report, the Company carried out an evaluation, under the supervision and with the participation of Aldo Piscitello, who is the Companys Principal Executive Officer/Principal Financial Officer, of the effectiveness of the design and operation of the Companys disclosure controls and procedures. The Companys Principal Executive Officer/Principal Financial Officer has concluded that the Companys disclosure controls and procedures are, in fact, not effective, as the Company still lacks segregation of duties as of the period covered.\nThe Company does not expect that its disclosure controls and procedures will prevent all errors and all instances of fraud. Disclosure controls and procedures, no matter how well conceived and operated, can provide only reasonable, not absolute, assurance that the objectives of the disclosure controls and procedures are met. Further, the design of disclosure controls and procedures must reflect the fact that there are resource constraints, and the benefits must be considered relative to their costs. Because of the inherent limitations in all disclosure controls and procedures, no evaluation of disclosure controls and procedures can provide absolute assurance that we have detected all our control deficiencies and instances of fraud, if any. The design of disclosure controls and procedures also is based partly on certain assumptions about the likelihood of future events, and there can be no assurance that any design will succeed in achieving its stated goals under all potential future conditions.\nManagements Report on Internal Control Over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting. Internal control over financial reporting is defined in Rules 13a-15(f) and 15d-15(f) under the Securities Exchange Act of 1934, as amended, as a process designed by, or under the supervision of, our principal executive and principal financial officers and effected by our Board, management and other personnel to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles and includes those policies and procedures that:\n● pertain to the maintenance of records that in reasonable detail accurately and fairly reflect the transactions and dispositions of our assets;\n● provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with U.S. generally accepted accounting principles, and that receipts and expenditures of the Company are being made only in accordance with authorizations of our management and directors; and\n● provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of the companys assets that could have a material effect on the financial statements.\nManagement assessed the effectiveness of its internal control over financial reporting as of August 31, 2023. In making this assessment, management used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in the 2013 Internal Control-Integrated Framework. Based on this assessment, management concluded that its internal control over financial reporting was not effective as of August 31, 2023, due to the existence of the material weaknesses as of August 31, 2023, discussed below. A material weakness is a control deficiency, or a combination of control deficiencies, that results in more than a remote likelihood that a material misstatement of the annual or interim financial statements will not be prevented or detected in the following areas:\n● Because of the Companys limited resources, there are limited controls over information processing.\n● There is an inadequate segregation of duties consistent with control objectives. The Companys management is composed of only one person, resulting in a situation where limitations on segregation of duties exist. In order to remedy this situation, the Company would need to hire additional staff to provide greater segregation of duties. Currently, it is not feasible to hire additional staff to obtain optimal segregation of duties. Management will reassess this matter in the following year to determine whether improvement in segregation of duties is feasible.\n● The Company does not have a formal audit committee with a financial expert, and thus the Company lacks the board oversight role within the financial reporting process.\n● There is a lack of formal policies and procedures necessary to adequately review significant accounting transactions. The Company utilizes a third-party independent contractor for the preparation of its financial statements. Although the financial statements and footnotes are reviewed by its management, the Company does not have a formal policy to review significant accounting transactions and the accounting treatment of such transactions. The third-party independent contractor is not involved in the day-to-day operations of the Company and may not be provided information from management on a timely basis to allow for adequate reporting/consideration of certain transactions.\nManagement believes that the material weaknesses set forth above were the result of the scale of its operations and are intrinsic to its small size. Management believes these weaknesses did not have a material effect on its financial results and intends to take remedial actions upon receiving funding for the Companys business operations.\nManagement will continue to monitor and evaluate the effectiveness of its internal controls and procedures and its internal controls over financial reporting on an ongoing basis and is committed to taking further action and implementing additional enhancements or improvements, as necessary and as funds allow.\nThis Annual Report on Form 10-K does not include an attestation report of our companys registered public accounting firm regarding internal control over financial reporting due to permanent exemptions for smaller reporting companies.\nChanges in Internal Controls over Financial Reporting\nThere were no changes to the Companys internal controls over financial reporting, during the year ended August 31, 2023, that have been materially affected, or are reasonably likely to materially effect, the Companys internal controls over financial reporting. Item 9B. Other Information\nNone.\nPART III Item 10. Directors, Executive Officers and Corporate Governance\nAll directors of the Company hold office until the next annual meeting of the security holders or until their successors have been elected and qualified. The officers of the Company are appointed by the Board of Directors and hold office until their death, resignation or removal from office. The directors and executive officers, their ages, positions held, and duration as such, are as follows:\nName\nAge\nTitle\nHeld Position Since\nAldo Piscitello\nDirector\nAugust,\nSvetlana Coliban\nDirector\nNovember\nAnne Marie Chipolone\nDirector\nDecember\nThe name, age and position of the Companys officer(s) are set forth below:\nName\nAge\nTitle\nHeld Position Since\nAldo Piscitello\nPresident/CEO/Secretary/Treasurer\nAugust,\nThe following information sets forth the backgrounds and business experience of our directors and executive officers.\nBios of Officers and Directors\nAldo Piscitello - President, CEO, CFO, Secretary, Treasurer and Chairman\nMr. Piscitello has served as a Director, Chief Executive Officer and President, since he founded the Company in 2010. In his capacity as Chief Executive Officer, he has spearheaded the development of the Companys products and information delivery systems, including procuring the Companys most valuable asset, the name BorrowMoney.com. Prior to his involvement in the Company, Mr. Piscitello operated an interior design business, which enabled him to have sufficient funds to open and operate One Stop Auto Center in New York in 1979, which he ran until he sold the business in 1987. He then started and built Navistar Beer Distribution, Inc. which was sold in 2000. Mr. Piscitello also founded A to Z Auto and Tire Center in 1987, which was sold in 2009. In 2010, Mr. Piscitello began the development of BorrowMoney.com, Inc. which he now devotes all of his time and energies to. Among his responsibilities were the securing of the name, developing the program and platform the Company is using, marketing the products and services to the industry and seeing to the everyday operation of the business.\nDirector Qualifications:\nThe Board of Directors believes that Mr. Piscitello is highly qualified to serve as a director of the Company due to his past experience operating companies.\nSvetlana Coliban - Director\nMiss Coliban was immediately recruited by Gallerie Diurne in Paris after graduation, to be in charge of international business development, based in Paris, then in New York. While in New York she managed and coordinated all international business development, sales, marketing, identification and research of potential leads and opportunities, appointments with new and existing clients, including trade shows, exhibitions and dealing with a diverse range of clients in the private and public sector. Miss Colibans one of many personal skills are the ability of Fluent English, French, Russian and Romanian Bilingual, which enhance her work experience including processing good team spirit, deadline oriented and having the ability to succeed in a demand sales environment. She is committed to liaison to the host of user group of Borrowmoney.com, Inc. board of directors. This involves participating in all of the board meetings, planning the conference and ensuring they work closely together to best serve all of our users. When not working at the Company, Miss Coliban is a Project Manager (since 2019) at Modis, part of Adecco Group, where she manages and delivers CRM and CX transformation projects at clients, in an Agile mode. Projects vary from strategic discoveries to CRM implementations (with Salesforce as enabling technology). Miss Coliban drives high performance from people while fostering collaboration across businesses and borders in order to meet the clients and Modiss key objectives. She leads by example and develops high-performing people and teams by challenging, supporting and continuously coaching them. Last and not the least, she acts as an entrepreneur and contributes to the growth of our business. Miss Coliban holds a BA in economics & management at Paris 8 University of France, a masters degree in Communication and Marketing and a masters degree in international business developmental at Pole Paris Alternance Business School of France. Miss Coliban also obtained a Salesforce Certified Administrator certification.\nDirector Qualifications:\nThe Board of Directors believes that Miss Coliban is highly qualified to serve as a director of the Company due to her past experience and educational background.\nAnne Marie Chipolone - Director\nEffective November 30, 2022, the Board of Directors of the Company appointed Anne Marie Chipolone, age 59, as a director of the Company until the next regular meeting of shareholders or until his successor is elected and qualified. He shall also continue to serve as Director of Borrowmoney.com, Inc.\nMs. Chipolone\n● Provide excellent customer service and quick problem-solving skills in support of advertising, ad design, and ad placement.\n● Manage administrative tasks such as managing files, completing documents.\n● Administer emails, presentation, appointments, and travel.\nEmployment Agreements\nThe Company has no formal employment agreements with any of its directors or officers.\nFamily Relationships\nAldo Piscitello, Director, CEO, CFO and Svetlana Coliban, Director, are husband and wife. There are no family relationships between any of the other directors, executive officers and proposed directors or executive officers.\nTerm of Office\nDirectors are elected to serve until the next annual meeting of stockholders and until their successors have been elected and qualified. Officers are appointed by the Board of Directors and hold their positions at the will of the Board of Directors.\nBoard Leadership Structure\nThe Board of Directors has the responsibility for selecting the appropriate leadership structure for the Company. In making leadership structure determinations, the Board of Directors considers many factors, including the specific needs of the business and what is in the best interests of the Companys stockholders. The current leadership structure is comprised of a combined Chairman of the Board and Chief Executive Officer (CEO) and Chief Financial Officer (CFO), Mr. Piscitello. The Board of Directors believes that this leadership structure is the most effective and efficient for the Company at this time. Mr. Piscitello possesses detailed and in-depth knowledge of the issues, opportunities, and challenges facing the Company, and is thus best positioned to develop agendas that ensure that the Board of Directors time and attention are focused on the most critical matters. Combining the Chairman of the Board and CEO roles promotes decisive leadership, fosters clear accountability and enhances the Companys ability to communicate its message and strategy clearly and consistently to our stockholders, particularly during periods of turbulent economic and industry conditions.\nRisk Oversight\nEffective risk oversight is an important priority of the Board of Directors. Because risks are considered in virtually every business decision, the Board of Directors discusses risks throughout the year generally or in connection with specific proposed actions. The Board of Directors approach to risk oversight includes understanding the critical risks in the Companys business and strategy, evaluating the Companys risk management processes, allocating responsibilities for risk oversight, and fostering an appropriate culture of integrity and compliance with legal responsibilities. The directors exercise direct oversight of strategic risks to the Company.\nArrangements between Officers and Directors\nTo the Companys knowledge, there is no arrangement or understanding between any of its officers and any other person, including directors, pursuant to which the officer was selected to serve as an officer.\nOther Directorships\nNo director of the Company is also a director of issuers with a class of securities registered under Section 12 of the Exchange Act (or which otherwise are required to file periodic reports under the Exchange Act).\nInvolvement in Certain Legal Proceedings\nTo the best of the Companys knowledge, none of its directors or executive officers were involved in any of the following during the past ten years: (1) any bankruptcy petition filed by or against any business of which such person was a general partner or executive officer either at the time of the bankruptcy or within two years prior to that time; (2) any conviction in a criminal proceeding or being a named subject to a pending criminal proceeding (excluding traffic violations and other minor offenses); (3) being subject to any order, judgment, or decree, not subsequently reversed, suspended or vacated, of any court of competent jurisdiction, permanently or temporarily enjoining, barring, suspending or otherwise limiting his involvement in any type of business, securities or banking activities; (4) being found by a court of competent jurisdiction (in a civil action), the SEC or the Commodities Futures Trading Commission to have violated a federal or state securities or commodities law, (5) being the subject of, or a party to, any Federal or State judicial or administrative order, judgment, decree, or finding, not subsequently reversed, suspended or vacated, relating to an alleged violation of (i) any Federal or State securities or commodities law or regulation; (ii) any law or regulation respecting financial institutions or insurance companies including, but not limited to, a temporary or permanent injunction, order of disgorgement or restitution, civil money penalty or temporary or permanent cease-and-desist order, or removal or prohibition order; or (iii) any law or regulation prohibiting mail or wire fraud or fraud in connection with any business entity; or (6) being the subject of, or a party to, any sanction or order, not subsequently reversed, suspended or vacated, of any self-regulatory organization (as defined in Section 3(a)(26) of the Exchange Act), any registered entity (as defined in Section 1(a)(29) of the Commodity Exchange Act), or any equivalent exchange, association, entity or organization that has disciplinary authority over its members or persons associated with a member.\nCommittees of the Board\nThe Company currently does not have nominating, compensation or audit committees or committees performing similar functions, nor does the Company have a written nominating, compensation or audit committee charter. The directors believe that it is not necessary to have such committees, at this time, because the functions of such committees can be adequately performed by its Board of Directors.\nStockholder Communications with the Board\nA stockholder who wishes to communicate with the Board of Directors may do so by directing a written request addressed to the Companys Secretary, 512 Bayshore Drive, Fort Lauderdale, Florida, 33304, who, upon receipt of any communication other than one that is clearly marked Confidential, will note the date the communication was received, open the communication, make a copy of it for its files and promptly forward the communication to the director(s) to whom it is addressed. Upon receipt of any communication that is clearly marked Confidential, the Secretary will not open the communication, but will note the date the communication was received and promptly forward the communication to the director(s) to whom it is addressed.\nCorporate Governance\nThe Company promotes accountability for adherence to honest and ethical conduct and strives to be compliant with applicable governmental laws, rules and regulations.\nIn lieu of an Audit Committee, the Companys Board of Directors is responsible for reviewing and making recommendations concerning the selection of outside auditors, reviewing the scope, results and effectiveness of the annual audit of the Companys financial statements and other services provided by the Companys independent public accountants. The Board of Directors reviews the Companys internal accounting controls, practices and policies.\nDirector Independence\nThe Company is not required to have independent members of its Board of Directors.\nAs described above, the Company does not have a separately designated audit, nominating or compensation committee.\nCode of Ethics\nThe Companys code of business conduct and ethics, which applies to all employees, including all executive officers and senior financial officers and directors, is posted on its website at https://www.borrowmoney.com/investor-relations.\nBoard and Committee Meetings\nThe Board of Directors held no formal meetings during the year ended August 31, 2023. All proceedings of the Board of Directors were conducted by resolutions consented to in writing by all the directors and filed with the minutes of the proceedings of the directors. Such resolutions consented to in writing by the directors entitled to vote on that resolution at a meeting of the directors are, according to applicable and the Companys Bylaws, as valid and effective as if they had been passed at a meeting of the directors duly called and held.\nNomination Process\nAs of August 31, 2023, the Company did not affect any material changes to the procedures by which its stockholders may recommend nominees to the Board of Directors. The Board of Directors does not have a policy with regards to the consideration of any director candidates recommended by its stockholders. The Board of Directors has determined that it is in the best position to evaluate the companys requirements as well as the qualifications of each candidate when the board considers a nominee for a position on its Board of Directors. If stockholders wish to recommend candidates directly to its board, they may do so by sending communications to the president of the Company at the address on the cover of this annual report. Item 11. Executive Compensation\nSummary Compensation Table\nThe following table sets forth information concerning the compensation of (i) all individuals serving as our principal executive officer or acting in a similar capacity during the last completed fiscal year (PEO), regardless of compensation level; (ii) our two most highly compensated executive officers other than the CEO who were serving as executive officers at the end of the last completed fiscal year, if any; and (iii) up to two additional individuals for whom disclosure would have been provided pursuant to paragraph (ii) but for the fact that the individual was not serving as an executive officer at the end of the last completed fiscal year (collectively, the Named Executive Officers).\nSalaries paid in 2023 and 2022*\nAldo Piscitello - Director, Chief Executive Officer, CFO, Secretary, Treasurer, and President -\n-\nAndrew Trumbach - Past CFO $ -\nHouston Reid - Past COO $ 21,000\n* Does not include perquisites and other personal benefits, or property, unless the aggregate amount of such compensation is more than $10,000. No executive officer earned any non-equity incentive plan compensation or nonqualified deferred compensation during the periods reported above. There have been no changes in the Companys compensation policies since August 31, 2023.\nCompensation Discussion and Analysis/Employment and Other Agreements\nThe Companys directors and executive officers did not receive an employment salary during the fiscal year ended August 31, 2023 and August 31, 2022.\nStock Option Grants\nTo date, the Company has not granted any stock options to any officer or director or any other employee. The Company has not adopted any stock option or any other similar compensation plan.\nDirector Compensation\nDuring 2023, Directors were entitled to reimbursement for expenses in attending meetings, but received no other compensation for services as Directors. Directors who were employees, were entitled to receive compensation for services other than as director. No compensation has been paid to Directors for services. There were no formal or informal arrangements or agreements to compensate Directors for services provided as a director during 2022.\nPension, Retirement or Similar Benefit Plans\nThere are no arrangements or plans in which the Company provides pension, retirement or similar benefits for directors or executive officers. The Company has no material bonus or profit-sharing plans pursuant to which cash or non-cash compensation is or may be paid to its directors or executive officers, except that stock options may be granted at the discretion of the Board of Directors or a committee thereof. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe following table presents certain information regarding the beneficial ownership of all shares of common stock as of August 31, 2023 by (i) each person who owns beneficially more than five percent (5%) of the outstanding shares of common stock, based on 111,619,561 shares outstanding as of August 31, 2023, (ii) each of the directors, (iii) each named executive officer and (iv) all directors and officers as a group. Except as otherwise indicated, all shares are owned directly.\nBeneficial ownership is determined in accordance with the rules of the Securities and Exchange Commission and includes voting and/or investing power with respect to securities. The Company believes that, except as otherwise noted and subject to applicable community property laws, each person named in the following table has sole investment and voting power with respect to the shares of common stock shown as beneficially owned by such person. Additionally, shares of common stock subject to options, warrants or other convertible securities that are currently exercisable or convertible, or exercisable or convertible within 60 days of August 31, 2023, are deemed to be outstanding and to be beneficially owned by the person or group holding such options, warrants or other convertible securities for the purpose of computing the percentage ownership of such person or group, but are not treated as outstanding for the purpose of computing the percentage ownership of any other person or group.\nThe Company believes that, except as otherwise noted and subject to applicable community property laws, each person named in the following table has sole investment and voting power with respect to the shares of common stock shown as beneficially owned by such person. Unless otherwise indicated, the address for each of the officers or directors listed in the table below is 512 Bayshore Drive, Fort Lauderdale, Florida, 33304.\nName Number of Common\nStock Shares\nBeneficially Owned\nPercent of\nCommon Stock\nAldo Piscitello 100,000,000 89.59 %\nSvetlana Coliban - -\nAll of the officers and directors as a group 100,000,000 89.59 %\nChange in Control Arrangements\nThe Company is not aware of any arrangements that could result in a change of control\nStock Incentive Plans\nTo date, the Company has not adopted any stock incentive or equity incentive plans. Item 13. Certain Relationships and Related Transactions, and Director Independence\nExcept as disclosed below, there have been no transactions since September 1, 2022, and there is not currently any proposed transaction, in which the Company was or is to be a participant, where the amount involved exceeds the lesser of $120,000 or one percent of the average of the Companys total assets at year end, for the last two completed fiscal years, and in which any officer, director, or any stockholder owning greater than five percent (5%) of the Companys outstanding voting shares, nor any member of the above referenced individuals immediate family, had or will have a direct or indirect material interest.\nThe principal stockholder and President have funded the company via loans from time to time. As of August 31, 2023, the total amount of such lending was $581,098. Such amount was memorialized as a note payable by the Company with interest at the rate of eight (8%) per annum, which is payable on demand. In connection with the note, the Company has an accrued interest obligation as of August 31, 2023 of $201,612.\nThe past CFO advanced $13,330, as of August 31, 2023, under a line of credit from a company owned by the past CFO.\nReview, Approval and Ratification of Related Party Transactions\nGiven the Companys small size and limited financial resources, has not adopted formal policies and procedures for the review, approval or ratification of transactions, such as those described above, with its executive officers, directors and significant stockholders. However, all of the transactions described above were approved and ratified by the Board of Directors. In connection with the approval of the transactions described above, the Board of Directors took into account various factors, including their fiduciary duty to the Company; the relationships of the related parties described above to the Company; the material facts underlying each transaction; the anticipated benefits to the Company and related costs associated with such benefits; whether comparable products or services were available; and the terms the Company could receive from an unrelated third party.\nThe Company intends to establish formal policies and procedures in the future, once the Company has sufficient resources and have appointed additional directors. On a moving forward basis, the Board of Directors will continue to approve any related party transaction based on the criteria set forth above. Item 14. Principal Accounting Fees and Services\nThe aggregate fees billed for the most recently completed fiscal year ended August 31, 2023 and for fiscal year ended August 31, 2022 for the audit of the Companys annual financial statements and review of the financial statements, included in the Form 10-K and services that are normally provided by the accountant in connection with statutory and regulatory filings, or engagements for these fiscal periods are as follows:\nAugust 31,\nAudit & Related Fees $ 15,000 $ 20,525\nTax Fees - -\n$ 15,000 $ 20,525\nThe Board of Directors pre-approves all services provided by its independent auditors. All of the above services and fees were reviewed and approved by the Board of Directors either before or after the respective services were rendered.\nThe Board of Directors has considered the nature and amount of fees billed by the independent auditors and believes that the provision of services for activities unrelated to the audit is compatible with maintaining its independent auditors independence.\nPART IV Item 15. Exhibits, Financial Statement Schedules\nSee the Exhibit Index following the signature page to this Annual Report on Form 10-K for a list of exhibits filed or furnished with this report, which Exhibit Index is incorporated herein by reference.\nItem 16. Form 10-K Summary\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nBorrowMoney.com, Inc.\nDated: December 14, 2023 By: /s/ Aldo Piscitello\nAldo Piscitello\nChief Executive Officer, CFO and Chairman of Board of Directors\nPursuant to the requirements of the Securities Act of 1933, this registrant statement has been signed by the following persons in the capacities and on the dates indicated.\n/s/ Aldo Piscitello\nChief Executive Officer, CFO\nDecember 14, 2023\nAldo Piscitello\nChairman of Board of Directors\n/s/ Svetlana Coliban\nDirector\nDecember 14, 2023\nSvetlana Coliban\nEXHIBIT INDEX\nExhibit\nNumber\nFiled or\nFurnished\nHerewith\nForm\nExhibit Number\nFile No.\n3.1\nArticles of Incorporation of Sports.Com, Inc.\nS-1/A\n3.1\n333-208854\n3.2\nArticles of Amendment to Articles of Incorporation changing the name of the Company to Lumigene Corporation\nS-1/A\n3.2\n333-208854\n3.3\nArticles of Amendment to Articles of Incorporation changing the name of the Company to IBMS, Inc.\nS-1/A\n3.4\n333-208854\n3.4\nArticles of Amendment to Articles of Incorporation changing the name of the Company to Horizon Group Holdings, Inc.\nS-1/A\n3.3\n333-208854\n2.5\nArticles of Amendment to Articles of Incorporation changing the name of the Company to BorrowMoney.com, Inc.\nS-1/A\n3.5\n333-208854\n2.6\nAmended Bylaws\nS-1/A\n3.6\n333-208854\n10.1\nLine of Credit Promissory Note in the amount of $500,000 payable to Aldo Piscitello dated March 21, 2013\nS-1/A\n10.1\n333-208854\n10.2\nWritten Description by E-Wiz Solutions, Inc.\nS-1/A\n10.2\n333-208854\n10.3\nDemand Note payable to Aldo Piscitello dated March 1, 2017\nS-1/A\n10.3\n333-208854\n10.4*\nForm of Service Warrants (July 2019)\nX\n10.5*\nForm of Subscription Agreement (September 2019)\nX\n14.1*\nCode of Ethics\nX\n21.1\nSubsidiaries\nS-1/A\n21.1\n333-208854\n31.1\nCertification of Principal Executive Officer and Principal Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act*\nX\n32.1\nCertification of Principal Executive Officer and Principal Financial Officer Pursuant to Section 906 of the Sarbanes-Oxley Act**\nX\n101.INS\nInline XBRL Instance Document\n101.SCH\nInline XBRL Taxonomy Extension Schema Document\n101.CAL\nInline XBRL Taxonomy Extension Calculation Document\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document\nCover Page Interactive Data File (embedded within the Inline XBRL document)\n** Furnished herewith.\n*** Indicates management contract or compensatory plan or arrangement."
}