{
    "cik": "1658520",
    "company": "OS Support, Inc.",
    "filing_type": "10-K",
    "filing_date": "2022-11-18",
    "period_of_report": "2022-06-30",
    "sic": "7371",
    "state_of_inc": "NV",
    "state_location": "K7",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1658520/0001477932-22-008704-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1658520/000147793222008704/os_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1658520/0001477932-22-008704.txt",
    "filename": "1658520_10K_2022_0001477932-22-008704.htm",
    "content": "Item 1. Business.\nOS Support, Inc. is a shell company as defined in Rule 405, because it is a company with nominal operations and it has assets consisting solely of cash and cash equivalents. Accordingly, there will be illiquidity of any future trading market until the company is no longer considered a shell company.\nThe Company has not yet implemented its business model and to date has generated no revenues.\nOn April 15, 2015, Mr. Paramjit Mann, president and sole director, incorporated the Company in the State of Nevada and established a fiscal year end of June 30. OS Support is a development-stage company that intends to market, sell and provide pay-as-you-go support services for the top 10 Open-source software programs that are downloaded daily.\nOpen-source software (OSS) is computer software with its source code made available with a license in which the copyright holder provides the rights to study, change and distribute the software to anyone and for any purpose. Open-source software is often developed in a public, collaborative manner. Open-source software is the most prominent example of open-source development and often compared to (technically defined) user-generated content or (legally defined) open-content movements.\nFor example, one of the most popular open source software programs is called WordPress ™, which according to its founder it has been download over 46 million times, and is used in over 60 million websites. The product provides tools and blogging capabilities and is used in the development of websites and mobile applications. As one of our planned supported applications, the Company will provide product support and eventually training to users of WordPress.\nThe Company will initially provide support for following 10 open source applications:\n1.\nWordPress* is a free and open source blogging tool and a content management system.\n2.\nMagento is an open source e-commerce web application.\n3.\nMozilla Firefox* is a free and open source web browser.\n4.\nPidgin* is an open-source multi-platform instant messaging client\n5.\nAudacity* is a free open source digital audio editor and recording computer software application.\n6.\nApache OpenOffice* is amongst the most well known open source office suites available today.\n7.\nVLC* media player is a portable free and open-source cross-platform media player and streaming media server.\n8.\n7-Zip* is an open source application used to compress files.\n9.\nFilezilla* is a free and cross-platform FTP software.\n10.\nGIMP* is an image retouching and editing tool.\nProduct Description\nOne of the issues with free open source software is that users have little or no support or training available when they are experiencing difficulties and have questions. The Company will offer 3 levels of support:\n1.\nRegular support - $39.00 response within 24 hours with a money back guarantee.\n2.\nPremium Support - $78.00 response with 12 hours.\n3.\nPlatinum Support - instant live support one hour minimum $119.00 per hour.\nThe Company initially plans to employ 10 support staff members under contract. Our support staff members will be located in India and will work from their residences in Mohali. Each support staff member will be an expert in two of the top ten Open-source software applications and we plan to have each staff member working or on call in shifts of 12 hours per day. To enhance customer support, the Company plans to utilize Customer Relationship Management software (CRM software), Email and Voice Over The Internet (VOIP) technology. We plan to provide support by telephone using VOIP technology, live interactive chat and desktop sharing tools where support personal can see and control a customers computer remotely. The Company expects that most support issues will be communicated via email to or planned the support center. The Company feels up to 80% of support issues and or questions can be answered without direct live contact with the customer. The Company will respond within 24 hours of a support issue arriving.\nThe company intends to provide support for small and medium sized companies in the United States. The companys google ad words and other product awareness efforts will be focused on American markets. The Company anticipates all its revenues will be derived from the corporations in United States.\nOutsourced information technology enabled services do not require any prior approval from any Indian regulatory authority.\nWhere consumers of Information technology enabled services do not fall within Indias tax jurisdiction (for example, where the consumers are located in the United States and the service is considered to have been exported to them), no service tax is payable. As service tax is a consumption tax, it is only levied on services consumed in India (The Export of Service Rules 2005, as amended from time to time) (Export Rules). The Export Rules also contain criteria to determine whether a service has been exported from India. Essentially, the export criteria are based on location, performance or recipient, depending on the service in question. For a service to be exported, it must be:\n·\nProvided from India.\n·\nUsed outside India.\n·\nPaid for in convertible foreign exchange.\nCustomer payments for services rendered will be held in a bank account that the company intends to open in the state of Nevada.\nCompetitive Environment\nCompanies like OpenLogic, Canonical and Pantek provide a commercial support services for Open-source software. Even OpenOffice.org comes with an option for paid support. Although we know of no single competitor that offers paid for support for all of the applications listed above, management believes that pay-as-you-go support is increasingly an option for businesses. Item 1A. Risk Factors.\nWe are a smaller reporting company as defined in Rule 12b-2 of the Exchange Act and are not required to provide the information required under this item. Item 1B. Unresolved Staff Comments.\nWe are a smaller reporting company as defined in Rule 12b-2 of the Exchange Act and are not required to provide the information required under this item. Item 2. Properties.\nWe do not own any real estate or other properties. The Companys office is located at North H.No. 1055 Sec 70, Mohali, Punjab, India. Item 3. Legal Proceedings.\nThe Company is not a party to any pending legal proceedings, and no such proceedings are known to be contemplated.\nNo director, officer, or affiliate of the issuer and no owner of record or beneficiary of more than 5% of the securities of the issuer, or any security holder is a party adverse to the small business issuer or has a material interest adverse to the small business issuer. Item 4. Mine Safety Disclosures.\nN/A\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities.\nAs of June 30, 2018, the Company had 29 shareholders of record. There is no established public trading market for the Companys common. The Company has not paid cash dividends and has no outstanding options. Item 6. Selected Financial Data.\nWe are a smaller reporting company as defined in Rule 12b-2 of the Exchange Act and are not required to provide the information required under this item. Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations.\nThis annual report contains forward looking statements relating to our Companys future economic performance, plans and objectives of management for future operations, projections of revenue mix and other financial items that are based on the beliefs of, as well as assumptions made by and information currently known to, our management. The words expects, intends, believes, anticipates, may, could, should and similar expressions and variations thereof are intended to identify forward-looking statements. The cautionary statements set forth in this section are intended to emphasize that actual results may differ materially from those contained in any forward looking statement.\nOur auditors report on our June 30, 2022 financial statements expresses an opinion that substantial doubt exists as to whether we can continue as an ongoing business. Since our officer and director may be unwilling or unable to loan or advance us additional capital, we believe that if we do not raise additional capital over the next 12 months, we may be required to suspend or cease the implementation of our business plans. See June 30, 2022 Audited Financial Statements - Auditors Report.\nLiquidity and Capital Resources\nAs of June 30, 2022, OS Support had $NIL in assets, and $NIL in assets as of June 30, 2021. Management believes this amount will not satisfy our cash requirements for the next twelve months or until such time that additional proceeds are raised. We plan to satisfy our future cash requirements - primarily the working capital required for the development of our course guides and marketing campaign and to offset legal and accounting fees - by additional equity financing. This will likely be in the form of private placements of common stock.\nManagement believes that if subsequent private placements are successful, we will be able to generate sales revenue within the following twelve months thereof. However, additional equity financing may not be available to us on acceptable terms or at all, and thus we could fail to satisfy our future cash requirements.\nIf OS Support is unsuccessful in raising the additional proceeds through a private placement offering it will then have to seek additional funds through debt financing, which would be highly difficult for a new development stage company to secure. Therefore, the company is highly dependent upon the success of the anticipated private placement offering and failure thereof would result in OS Support having to seek capital from other sources such as debt financing, which may not even be available to the company. However, if such financing were available, because OS Support is a development stage company with no revenue to date, it would likely have to pay additional costs associated with high risk loans and be subject to an above market interest rate. At such time these funds are required, management would evaluate the terms of such debt financing and determine whether the business could sustain operations and growth and manage the debt load. If OS Support cannot raise additional proceeds via a private placement of its common stock or secure debt financing it would be required to cease business operations. As a result, investors in OS Support common stock would lose all of their investment.\nAs of June 30, 2022, the balance of loan from Paramjit Mann, the Companys Director is $58,408. The amounts due to the related party are unsecured and non- interest-bearing with no set terms of repayment.\nResults of Operations\nSince April 15. 2015 (inception) through June 30, 2022, the Company has no revenues and has accumulated losses since inception of $143,846. For fiscal year ended June 30, 2022, we incurred operating expenses in the amount of $13,430 and a net loss of $13,492 as compared to operating expenses of $24,090 and a net loss of $24,170 in for the fiscal year ended June 30, 2021. The net loss for the fiscal year ended June 30, 2022 was a result of General and administrative fees of $2,930 comprised of printing and filing fees, Professional fees of 10,500 comprised primarily of accounting fees, Exchange Loss of $115 and Interest income of $52. This compares to the net loss for the period ended June 30, 2021 of $24,170 which was a result of General and administrative expense of $13,990 comprised primarily of filing fees and transfer fees, Professional fees of $10,500 comprised primarily of accounting fees, Exchange Gain of $215 and Interest Income of $105.\nOff Balance Sheet Arrangements.\nAs of the date of this Annual Report, the current funds available to the Company will not be sufficient to continue operations. The cost to establish the Company and begin operations is estimated to be $120,000 over the next twelve months and the cost of maintaining our reporting status is estimated to be $12,000 over this same period. The officer and director during this period, Paramjit Mann, has undertaken to provide the Company with operating capital to sustain the Companys business over the next twelve month period as the expenses are incurred in the form of a non-secured loan. However, there is no contract in place or written agreement securing this agreement. Management believes that if the Company cannot raise sufficient revenues or maintain its reporting status with the SEC it will have to cease all efforts directed towards the Company. As such, any investment previously made would be lost in its entirety.\nOther than the above described situation the Company does not have any off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on the Companys financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources that are material to investors.\nGoing Consideration\nOur independent auditors included an explanatory paragraph in their report on the accompanying financial statements regarding concerns about our ability to continue as a going concern. Our financial statements contain additional note disclosures describing the circumstances that lead to this disclosure by our independent auditors. Our financial statements do not include any adjustments related to the recoverability or classification of asset-carrying amounts or the amounts and classifications of liabilities that may result should the Company be unable to continue as a going concern. Item 7A. Quantitative and Qualitative Disclosures About Market Risk.\nWe are a smaller reporting company as defined in Rule 12b-2 of the Exchange Act and are not required to provide the information required under this item. Item 8. Financial Statements and Supplementary Data\nOS SUPPORT, INC.\nFINANCIAL STATEMENTS\nJune 30, 2022\nAudited\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nBALANCE SHEETS\nSTATEMENT OF OPERATIONS\nSTATEMENTS OF STOCKHOLDERS' EQUITY (DEFICIT)\nSTATEMENT OF CASH FLOWS\nNOTES TO FINANCIAL STATEMENTS\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Shareholders and\nBoard of Directors of OS Support, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of OS Support, Inc. (the Company) as of June 30, 2022, the related consolidated statements of operations, changes in stockholders equity (deficit), and consolidated cash flows for year period ended June 30, 2022, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of June 30, 2022, and the results of its operations and its cash flows for the year ended June 30, 2022, in conformity with accounting principles generally accepted in the United States of America.\nSubstantial Doubt About the Companys Ability to Continue as a Going Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 1 to the financial statements, the Companys lack of revenues, recurring operating losses and working capital deficit raise substantial doubt about its ability to continue as a going concern for one year from the issuance of these financial statements. Managements plans are also described in Note 1. The financial statements do not include adjustments that might result from the outcome of this uncertainty.\nBasis of Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with standards of the Public Company Accounting Oversight Board (United States). Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to fraud or error. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audit, we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audit provides a reasonable basis for our opinion.\nCritical Audit Matters\nCritical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. We determined that there are no critical audit matters.\nOther matters\nThe audit for the accompanying consolidated balance sheets of OS Support, Inc. as of June 30, 2021, the related consolidated statements of operations, changes in stockholders equity (deficit), and consolidated cash flows for the year then ended June 30, 2021, and the related notes was performed by another Independent Registered Public Accounting Firm, Boyle CPA, LLC.\n/s/ Victor Mokuolu, CPA PLLC\nPCAOB ID: 6771\nWe have served as the Companys auditor since 2022\nHouston, Texas\nNovember 18, 2022\nOS SUPPORT, INC.\nBALANCE SHEETS\nJune 30,\nJune 30,\nASSETS\nTOTAL ASSETS\n$ -\n$ -\nLIABILITIES AND STOCKHOLDERS' EQUITY (DEFICIT)\nCURRENT LIABILITIES\nAccounts payable and accrued liabilities\n$ 30,736\n$ 25,519\nLoan from related party\n58,408\n50,133\nTOTAL CURRENT LIABILITIES\n$ 89,144\n$ 75,652\nSTOCKHOLDERS' EQUITY (DEFICIT)\nCommon Stock\nAuthorized\n75,000,000 shares of common stock, $0.001 par value,\nIssued and outstanding\n54,720,000 shares of Common Stock at June 30, 2022 and June 30, 2021\n$ 54,720\n$ 54,720\nAdditional Paid-in Capital\n(43,970 )\n(43,970 )\nAccumulated Deficit\n(99,894 )\n(86,402 )\nTOTAL STOCKHOLDERS' EQUITY/(DEFICIT)\n$ (89,144 )\n$ (75,652 )\nTOTAL LIABILITIES AND STOCKHOLDERS' EQUITY/(DEFICIT)\n$ -\n$ -\nThe accompanying notes are an integral part of these financial statements\nOS SUPPORT, INC.\nSTATEMENT OF OPERATIONS\nAudited\nYear\nYear\nended\nended\nJune 30,\nJune 30,\nREVENUE\n-\n$ -\nEXPENSES\nGeneral and Administrative\n$ 2,930\n$ 13,990\nProfessional Fees\n10,500\n10,500\nTOTAL OPERATING EXPENSES\n$ 13,430\n$ 24,490\nOTHER INCOME (EXPENSES)\nExchange Gain (Loss)\n(114 )\nInterest Income\nNET LOSS\n$ (13,492 )\n$ (24,170 )\nBASIC AND DILUTED LOSS PER COMMON SHARE\n$ (0.00 )\n$ (0.00 )\nWEIGHTED AVERAGE NUMBER OF COMMON SHARES OUTSTANDING\n54,720,000\n54,720,000\nThe accompanying notes are an integral part of these financial statements\nOS SUPPORT, INC.\nSTATEMENTS OF STOCKHOLDERS' EQUITY (DEFICIT)\nYEARS ENDED JUNE 2022 AND 2021\nAudited\nCommon Stock\nAdditional\nShare\nNumber of\nPaid-in\nSubscriptions\nAccumulated\nshares\nAmount\nCapital\nReceivable\nDeficit\nTotal\nBalance, June 30, 2020\n54,720,000\n$ 54,720\n$ (43,970 )\n$ -\n$ (62,232 )\n$ (51,482 )\nNet Loss\n-\n-\n(24,170 )\n(24,170 )\nBalance, June 30, 2021\n54,720,000\n54,720\n(43,970 )\n-\n(86,402 )\n(75,652 )\nNet Loss\n(13,492 )\n(13,492 )\nBalance, June 30, 2022\n54,720,000\n$ 54,720\n$ (43,970 )\n$ -\n$ (99,894 )\n(89,144 )\nOS SUPPORT, INC.\nSTATEMENT OF CASH FLOWS\nAudited\nYear\nYear\nended\nended\nJune 30,\nJune 30,\nOPERATING ACTIVITIES\nNet loss\n$ (13,492 )\n$ (24,170 )\nAdjustment to reconcile net loss to net cash\nused in operating activities:\nIncrease (decrease) in Payables\n5,217\n12,533\nNET CASH PROVIDED BY (USED IN) OPERATING ACTIVITIES\n$ (8,275 )\n$ (36,703 )\nFINANCING ACTIVITIES\nLoan from related party\n8,275\n36,703\nNET CASH PROVIDED BY FINANCING ACTIVITIES\nNET INCREASE (DECREASE) IN CASH\n$ -\n$ -\nCASH, BEGINNING OF PERIOD\n$ -\n$ -\nCASH, END OF PERIOD\n$ -\n$ -\nSupplemental cash flow information and noncash financing activities:\nCash paid for:\nInterest\n$ -\n$ -\nIncome taxes\n$ -\n$ -\nThe accompanying notes are an integral part of these financial statements\nOS SUPPORT, INC.\nNOTES TO THE AUDITED FINANCIAL STATEMENTS\nJune 30, 2022\nNOTE 1 - NATURE OF OPERATIONS AND BASIS OF PRESENTATION\nThe Company was incorporated in the State of Nevada as a for-profit Company on April 15, 2015 and established a fiscal year end of June 30. The Company was organized to initially provide a pay as you go support service for the top 10 free open sources software programs. The Company has not yet implemented its business model and to date has generated no revenues. As such, the Company is considered a shell company.\nGoing Concern\nTo date the Company has generated no revenues from its business operations and has an Accumulated Deficit since inception of $99,894. (June 2021 $86,402) The Company's expenses have primarily been paid the President of the Company. As at June 30, 2022, the Company has a working capital deficit of $89,144 (June 2021 $75,672). The Company requires additional funding to meet its ongoing obligations and to fund anticipated deficits. The ability of the Company to continue as a going concern is dependent on raising capital to fund its initial business plan and ultimately to attain profitable operations. Accordingly, these factors raise substantial doubt as to the Companys ability to continue as a going concern. The Company intends to continue to fund its business by way of private placements and advances from related parties as may be required. These financial statements do not include any adjustments relating to the recoverability and classification of recorded asset amounts, or amounts and classification of liabilities that might result from this uncertainty.\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBasis of Presentation\nThe financial statements present the balance sheet, statements of operations, stockholders equity and cash flows of the Company. These financial statements are presented in the United States dollars and have been prepared in accordance with accounting principles generally accepted in the United States of America.\nStock Split\nOn October 29, 2021, the Company authorized a 256:1 stock split. As part of the stock split, the CEO waived 1,761,280,000 of the post-split shares, resulting in 23,720,000 additional shares being issued to the CEO. As a result of the stock split, the total outstanding shares of the Company increased from 7,093,750 to 54,720,000. All share and per share data have been retrospectively adjusted to reflect this stock split.\nEmerging Growth Company\nThe Company is an emerging growth company. The JOBS Act exempts emerging growth companies from being required to comply with new or revised financial accounting standards until private companies (that is, those that have not had a Securities Act registration statement declared effective or do not have a class of securities registered under the Securities and Exchange Act of 1934, as amended) are required to comply with the new or revised financial accounting standards. The JOBS Act provides that a company can elect to opt out of the extended transition period and comply with the requirements that apply to non-emerging growth companies but any such an election to opt out is irrevocable. The Company has elected not to opt out of such extended transition period which means that when a standard is issued or revised and it has different application dates for public or private companies, the Company, as an emerging growth company, can adopt the new or revised standard at the time private companies adopt the new or revised standard.\nUse of Estimates and Assumptions\nPreparation of the financial statements in conformity with generally accepted accounting principles requires management to make estimates and assumptions that affect certain reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the period. Accordingly, actual results could differ from those estimates.\nCash and Cash Equivalents\nFor purposes of the statement of cash flows, the Company considers highly liquid financial instruments purchased with a maturity of three months or less to be cash equivalents.\nForeign currency and Translation\nTransactions denominated in foreign currencies are translated at the average exchange rates during the periods in accordance with the requirements of Accounting Standards Codification subtopic 830-10, Foreign Currency Matters (ASC 830-10). Foreign currency transaction gains and losses arising from exchange rate fluctuations on transactions denominated in a currency other than the functional currency are included in the results of operations.\nFair Value of Financial Instruments\nThe carrying amount of the Companys financial assets and liabilities approximates their fair values due to their short term maturities.\nLoss per Common Share\nThe basic loss per share is calculated by dividing the Companys net income available to common shareholders by the weighted average number of common shares during the year. The diluted earnings (loss) per share is calculated by dividing the Companys net loss available to common shareholders by the diluted weighted average number of shares outstanding during the year. The diluted weighted average number of shares outstanding is the basic weighted number of shares adjusted for any potentially dilutive debt or equity. Diluted loss per share are the same as basic loss per share due to the lack of dilutive items in the Company. As of June 30, 2022, there were 54,720,000 shares of common stock outstanding.\nIncome Taxes\nUnder ASC 740, Income Taxes, deferred tax assets and liabilities are recognized for the future tax consequences attributable to temporary differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period of the enactment date. Valuation allowances are established when it is more likely than not that some or all of the deferred tax assets will not be realized.\nASC 740 prescribes a recognition threshold and a measurement attribute for the financial statement recognition and measurement of tax positions taken or expected to be taken in a tax return. For those benefits to be recognized, a tax position must be more-likely-than-not to be sustained upon examination by taxing authorities. The Company recognizes accrued interest and penalties related to unrecognized tax benefits as income tax expense. No amounts were accrued for the payment of interest and penalties at June 30, 2022. The Company is currently not aware of any issues under review that could result in significant payments, accruals or material deviation from its position.\nStock-based Compensation\nThe Company follows ASC 718-10, \"Stock Compensation\", which addresses the accounting for transactions in which an entity exchanges its equity instruments for goods or services, with a primary focus on transactions in which an entity obtains employee services in share-based payment transactions. ASC 718-10 is a revision to SFAS No. 123, \"Accounting for Stock-Based Compensation,\" and supersedes Accounting Principles Board (\"APB\") Opinion No. 25, \"Accounting for Stock Issued to Employees,\" and its related implementation guidance. ASC 718-10 requires measurement of the cost of employee services received in exchange for an award of equity instruments based on the grant-date fair value of the award (with limited exceptions). Incremental compensation costs arising from subsequent modifications of awards after the grant date must be recognized. The Company has not adopted a stock option plan and has not granted any stock options.\nRecent Accounting Pronouncements\nThe Company does not expect the adoption of any recent accounting pronouncements to have a material impact on its financial statements.\nNOTE 3 - COMMON STOCK\nThe Companys capitalization is 75,000,000 common shares with a par value of $0.001 per share. No preferred shares have been authorized or issued.\nOn July 4, 2015 the Company issued 30,720,000 common shares at $0.0002 per share to the sole director and President of the Company for cash proceeds of $7,000.\nIn July and August 2017, the Company issued 24,000,000 common shares for cash at $0.0002 per share for net proceeds to the Company of $3,750. As of March 31, 2022, the Company had not adopted a stock option plan nor had it granted any stock options. Accordingly, no stock-based compensation has been recorded to date. As of June 30, 2022, 54,720,000 shares issued and outstanding.\nNOTE 4 - RELATED PARTY TRANSACTIONS\nAs of June 30, 2022, the balance of loan from Paramjit Mann, the Companys Director is $58,408. The amounts due to the related party are unsecured and non- interest-bearing with no set terms of repayment.\nNOTE 5 - SUBSEQUENT EVENTS\nManagement has performed an evaluation of subsequent events through the date of issuance of the financial statements, noting no items which require adjustment or disclosure. Item 9. Changes in and Disagreements With Accountants on Accounting and Financial Disclosure.\nNone Item 9A. Controls and Procedures.\nEvaluation of Disclosure Controls and Procedures\nDisclosure controls and procedures are controls and other procedures that are designed to ensure that information required to be disclosed in our reports filed or submitted under the Securities Exchange Act of 1934 is recorded, processed, summarized and reported, within the time period specified in the SECs rules and forms. Disclosure controls and procedures include, without limitation, controls and procedures designed to ensure that information required to be disclosed in our reports filed or submitted under the Securities Exchange Act of 1934 is accumulated and communicated to management including our principal executive officer and principal financial officer as appropriate, to allow timely decisions regarding required disclosure.\nIn connection with this annual report, as required by Rule 13a -15d and 15d-15e under the Securities Exchange Act of 1934, we have carried out an evaluation of the effectiveness of the design and operation of our Companys disclosure controls and procedures. This evaluation was carried out under the supervision and with the participation of our Companys management, including our Companys principal executive officer and principal financial officer. Based upon that evaluation, our companys principal executive officer and principal financial officer concluded that as of June 30, 2022 our disclosure controls and procedures were not effective due to the existence of material weaknesses in our internal controls over financial reporting.\nManagements Annual Report on Internal Control Over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting. Internal control over financial reporting is defined in Rule 13a-15(f) or 15d-15(f) promulgated under the Securities Exchange Act of 1934 as a process designed by, or under the supervision of, the Companys Principal Executive and Principal Financial officer and effected by the Companys board of directors, management and other personnel to provide reasonable assurance regarding the reliability of our financial reporting and the preparation of financial statements for external purposes in accordance with accounting principles generally accepted in the United States of America and includes those policies and procedures that:\n1.\nPertains to the maintenance of records that in reasonable detail accurately and fairly reflect our transactions and disposition of assets;\n2.\nProvide reasonable assurance that transactions are recorded as necessary to permit preparation of our financial statements in accordance with accounting principles generally accepted in the United States of America and receipts and expenditures are being made in accordance with authorizations of management and directors; and\n3.\nProvide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of company assets that could have a material effect on our financial statements.\nManagement assessed the effectiveness of the Companys internal control over financial reporting based on the criteria for effective internal control over financial reporting established in SEC guidance on conducting such assessments as of the end of the period covered by this report. Management conducted the assessment based on certain criteria established in Internal Control - Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission in 2013. As of June 30, 2022, management determined material weaknesses occurred over our internal control over financial reporting as discussed below.\nThe matters involving internal controls and procedures that the Companys management considered to be material weaknesses under the standards of the Public Company Accounting Oversight Board were: (1) lack of a functioning audit committee and lack of a majority of outside directors on the Companys board of directors, resulting in ineffective oversight in the establishment and monitoring of required internal controls and procedures; (2) inadequate segregation of duties consistent with control objectives; (3) insufficient written policies and procedures for accounting and financial reporting with respect to the requirements and application of US GAAP and SEC disclosure requirements; and (4) ineffective controls over period end financial disclosure and reporting processes. Due to these material weaknesses management concluded that our internal control over financial reporting was not effective as of June 30, 2022.\nMaterial Weakness Discussion and Remediation\nManagement believes that the material weaknesses set forth in items (2), (3) and (4) above did not have an affect on the Companys previous reported financial results. However, management believes that the lack of a functioning audit committee and lack of a majority of outside directors on the Companys board of directors, resulting in ineffective oversight in the establishment and monitoring of required internal controls and procedures can result in the Companys determination to its financial statements for the future periods.\nWe are committed to improving our financial organization. As part of this commitment, we will create a position to segregate duties consistent with control objectives and will increase our personnel resources and technical accounting expertise within the accounting function when funds are available to the Company: i) Appointing one or more outside directors to our board of directors who shall be appointed to the audit committee of the Company resulting in a fully functioning audit committee who will undertake the oversight in the establishment and monitoring of required internal controls and procedures; and ii) Preparing and implementing sufficient written policies and checklists which will set forth procedures for accounting and financial reporting with respect to the requirements and application of US GAAP and SEC disclosure requirements.\nManagement believes that the appointment of one or more outside directors, who shall be appointed to a fully functioning audit committee, will remedy the lack of a functioning audit committee and a lack of a majority of outside directors on the Companys Board. In addition, management believes that preparing and implementing sufficient written policies and checklists will remedy the following material weaknesses (i) insufficient written policies and procedures for accounting and financial reporting with respect to the requirements and application of US GAAP and SEC disclosure requirements; and (ii) ineffective controls over period end financial close and reporting processes. Further, management believes that the hiring of additional personnel who have the technical expertise and knowledge will result proper segregation of duties and provide more checks and balances within the department. Additional personnel will also provide the cross training needed to support the Company if personnel turn over issues within the department occur. This coupled with the appointment of additional outside directors will greatly decrease any control and procedure issues the company may encounter in the future.\nWe will continue to monitor and evaluate the effectiveness of our internal controls and procedures and our internal controls over financial reporting on an ongoing basis and are committed to taking further action and implementing additional enhancements or improvements, as necessary and as funds allow.\nThis annual report does not include an attestation report of the companys registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by the companys registered public accounting firm pursuant to temporary rules of the Securities and Exchange Commission that permit the Company to provide only managements report in this annual report.\nChanges in Internal Control Over Financial Reporting\nThere have been no changes in our internal control over financial reporting identified in connection with the evaluation required by paragraph (d) of Rules 13a-15 or 15d-15 under the Exchange Act that occurred during the small business issuers last fiscal year that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting. Item 9B. Other Information.\nNone\nPART III Item 10. Directors, Executive Officers and Corporate Governance.\nThe name, address, age and position of our present sole officer and director is set forth below:\nName\nAge\nPosition(s)\nParamjit Mann\nPresident, Secretary/ Treasurer, Chief Financial Officer and Chairman of the Board of Directors.\nThe person named above has held his offices/positions since inception of our company and is expected to hold his offices/positions at least until the next annual meeting of our stockholders.\nBusiness Experience\nSince September 2010, Mr. Mann is employed as an accountant in Guru Nanak Foundation Public School, Chappar Chiri, Mohali, India. Prior to his employment as an accountant, Mr. Mann was Zonal Officer with Tops Security Ltd. in Chandigarh. As a Zonal Officer Mr. Mann was responsible for the management of over 350 people in a specific client sector dedicated to the security of physical assets for private corporations. In addition, he has five years experience as a cashier with New Fatehgarh Sahib Tpt. Co. in Ludhiana, India.\nEducational Qualifications\n➢\n12th grade from Punjab School Education Board\n➢\nI.T.I. Diploma 2yr. (Radio & TV) Ropar\n➢\n8 Months Diploma in Financial Accounting, Tally & MS Office.\n➢\nB.A. from Kurukshetra University, Kurukshetra.\n➢\nM.B.A. from Sikkim Manipal University. (HR & Marketing).\nThe Company feels that Mr. Manns entrepreneurship and his work experience make him an excellent choice for the president of the Company.\nDirector Independence\nOur board of directors is currently composed of one member, Paramjit Mann, who does not qualify as an independent director in accordance with the published listing requirements of the NASDAQ Global Market. The NASDAQ independence definition includes a series of objective tests, such as that the director is not, and has not been for at least three years, one of our employees and that neither the director, nor any of his family members has engaged in various types of business dealings with us. In addition, our board of directors has not made a subjective determination as to each director that no relationships exist which, in the opinion of our board of directors, would interfere with the exercise of independent judgment in carrying out the responsibilities of a director, though such subjective determination is required by the NASDAQ rules. Had our board of directors made these determinations, our board of directors would have reviewed and discussed information provided by the directors and us with regard to each directors business and personal activities and relationships as they may relate to us and our management.\nConflicts of Interest\nAt the present time, the company does not foresee any direct conflict between Mr. Manns other business interests and his involvement in OS Support, Inc.\nEXECUTIVE COMPENSATION\nOS Support, Inc. has made no provisions for paying cash or non-cash compensation to its sole officer and director. No salaries are being paid at the present time, and none will be paid unless and until our operations generate sufficient cash flows.\nThe table below summarizes all compensation awarded to, earned by, or paid to our named executive officer for all services rendered in all capacities to us for the period from inception through June 30, 2022.\nName\nand\nprincipal\nposition\nYear\nSalary\n($)\nBonus\n($)\nStock\nAwards\n($)\nOption\nAwards\n($)\nNon-Equity\nIncentive Plan\nCompensation\n($)\nNonqualified\nDeferred\nCompensation\nEarnings ($)\nAll Other\nCompensation\n($)\nTotal\n($)\nPARAMJIT\nMANN\nPresident\nWe did not pay any salaries in 2022. We do not anticipate beginning to pay salaries until we have adequate funds to do so. There are no other stock option plans, retirement, pension, or profit sharing plans for the benefit of our officer and director other than as described herein.\nSignificant Employees\nThe Company does not, at present, have any employees other than the current officer and director. We have not entered into any employment agreements, as we currently do not have any employees other than the current officer and director.\nFamily Relations\nThere are no family relationships among the Directors and Officers of OS Support, Inc.\nInvolvement in Legal Proceedings\nNo executive Officer or Director of the Company has been convicted in any criminal proceeding (excluding traffic violations) or is the subject of a criminal proceeding that is currently pending.\nNo executive Officer or Director of the Company is the subject of any pending legal proceedings.\nNo Executive Officer or Director of the Company is involved in any bankruptcy petition by or against any business in which they are a general partner or executive officer at this time or within two years of any involvement as a general partner, executive officer, or Director of any business. Item 11. Executive Compensation.\nOS Support, Inc. has made no provisions for paying cash or non-cash compensation to its sole officer and director. No salaries are being paid at the present time, and none will be paid unless and until our operations generate sufficient cash flows.\nThe table below summarizes all compensation awarded to, earned by, or paid to our named executive officer for all services rendered in all capacities to us for the period from inception through June 30, 2022.\nName\nand\nprincipal\nposition\nYear\nSalary\n($)\nBonus\n($)\nStock\nAwards\n($)\nOption\nAwards\n($)\nNon-Equity\nIncentive Plan\nCompensation\n($)\nNonqualified\nDeferred\nCompensation\nEarnings ($)\nAll Other\nCompensation\n($)\nTotal\n($)\nPARAMJIT\nMANN\nPresident\nWe did not pay any salaries in 2022. We do not anticipate beginning to pay salaries until we have adequate funds to do so. There are no other stock option plans, retirement, pension, or profit sharing plans for the benefit of our officer and director other than as described herein.\nOutstanding Equity Awards at Fiscal Year-End\nThe table below summarizes all unexercised options, stock that has not vested, and equity incentive plan awards for each named executive officer as of June 30, 2022.\nParamjit Mann\n-\n-\n-\n-\n-\n-\n-\n-\n-\nThere were no grants of stock options since inception to the date of this Form 10-K.\nWe do not have any long-term incentive plans that provide compensation intended to serve as incentive for performance.\nThe Board of Directors of the Company has not adopted a stock option plan. The company has no plans to adopt it but may choose to do so in the future. If such a plan is adopted, this may be administered by the board or a committee appointed by the board (the Committee). The committee would have the power to modify, extend or renew outstanding options and to authorize the grant of new options in substitution therefore, provided that any such action may not impair any rights under any option previously granted. OS Support, Inc. may develop an incentive based stock option plan for its officers and directors and may reserve up to 10% of its outstanding shares of common stock for that purpose.\nStock Awards Plan\nThe Company has not adopted a Stock Awards Plan, but may do so in the future. The terms of any such plan have not been determined.\nDirector Compensation\nThe table below summarizes all compensation awarded to, earned by, or paid to our directors for all services rendered in all capacities to us for the period from inception (April 15,2015) through June 30, 2022.\nDIRECTOR COMPENSATION\nName\nFees Earned or\nPaid in\nCash\n($)\nStock Awards\n($)\nOption\nAwards\n($)\nNon-Equity\nIncentive\nPlan\nCompensation\n($)\nNon-Qualified\nDeferred\nCompensation\nEarnings\n($)\nAll\nOther\nCompensation\n($)\nTotal\n($)\nParamjit Mann Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nThe following table sets forth, as of the date of this Form 10-K, the total number of shares owned beneficially by our sole officer and director, and key employees, individually and as a group, and the present owners of 5% or more of our total outstanding shares. The table also reflects what this ownership will be assuming completion of the sale of all shares in this offering. The stockholder listed below has direct ownership of his shares and possesses sole voting and dispositive power with respect to the shares.\nTitle of Class\nName and Address\nBeneficial Owner [1]\nAmount and Nature of Beneficial Owner\nPercent of Class\nCommon Stock\nParamjit Mann,\n7,000,000\n98.6\nAll Officers and Directors as a Group (1 person)\n7,000,000\n98.6%\n[1]\nThe person named above may be deemed to be a parent and promoter of our company, within the meaning of such terms under the Securities Act of 1933, as amended, by virtue of his direct and indirect stock holdings. Mr.Mann is the only promoter of our company.\n[2]\nBeneficial ownership is determined in accordance with the Rule 13d-3(d)(1) of the Exchange Act, as amended and generally includes voting or investment power with respect to securities. Pursuant to the rules and regulations of the Securities and Exchange Commission, shares of common stock that an individual or group has a right to acquire within 60 days pursuant to the exercise of options or warrants are deemed to be outstanding for the purposes of computing the percentage ownership of such individual or group and includes shares that could be obtained by the named individual within the next 60 days Item 13. Certain Relationships and Related Transactions, and Director Independence.\nCurrently, there are no contemplated transactions that the Company may enter into with our officers, directors or affiliates. If any such transactions are contemplated we will file such disclosure in a timely manner with the Commission on the proper form making such transaction available for the public to view.\nThe Company has no formal written employment agreement or other contracts with our current officer and director and there is no assurance that the services to be provided by her will be available for any specific length of time in the future. Mr. Mann anticipates devoting at a minimum fifteen percent of his available time to the Companys affairs. The amounts of compensation and other terms of any full time employment arrangements would be determined, if and when, such arrangements become necessary. Item 14. Principal Accounting Fees and Services.\nThe aggregate fees billed for the two most recently completed fiscal years for professional services rendered by Boyle CPA, LLC, our independent auditor as disclosed on Form 8-K filed with the SEC on March 17, 2020, for the audit of our annual financial statements and review of the financial statements that are normally provided by the accountant in connection with statutory and regulatory filings or engagements for those fiscal periods were as follows:\nYear Ended June 30, 2022\nYear Ended June 30, 2021\nAudit Fees\n$ 2,500\n$2,500\nAudit-Related Fees\n$ Nil\n$Nil\nTax Fees\n$ Nil\n$Nil\nAll Other Fees\n$8,000\n$8,000\nTotal\n$10,500\n$10,500\nThe SEC requires that before our independent registered public accounting firm is engaged by us to render any auditing or permitted non-audit related service, the engagement be either: (i) approved by our Audit Committee or (ii) entered into pursuant to pre-approval policies and procedures established by the Audit Committee, provided that the policies and procedures are detailed as to the particular service, the Audit Committee is informed of each service, and such policies and procedures do not include delegation of the Audit Committees responsibilities to management.\nAs of date of this filing the Company does not have an Audit Committee. Our Board pre-approves all services provided by our independent registered public accounting firm. All of the above services and fees paid during 2022 and 2021 were pre-approved by our Board.\nPART IV Item 15. Exhibits, Financial Statement Schedules.\nThe following exhibits are incorporated into this Form 10-K Annual Report:\nExhibit No.\nDescription\n3.1\nArticles of Incorporation [1]\n3.2\nBy-Laws Inc. [2]\n31.1\nCertification of Chief Executive Officer Pursuant to Rule 13a-14(a) or 15d-14(a) of the Securities Exchange Act of 1934\n31.2\nCertification of Chief Financial Officer Pursuant to Rule 13a-14(a) or 15d-14(a) of the Securities Exchange Act of 1934*\n32.1\nCertification of Chief Executive Officer under Section 1350 as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n32.2\nCertification of Chief Financial Officer under Section 1350 as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002**\n101.INS\nInline XBRL Instance Document (the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document).\n101.SCH\nInline XBRL Taxonomy Extension Schema Document.\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document.\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document.\n101.LAB\nInline XBRL Taxonomy Extension Labels Linkbase Document.\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document.\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101).\n[1]\nIncorporated by reference from the Companys S-1 filed with the Commission on December 21, 2016.\n[2]\nIncorporated by reference from the Companys S-1 filed with the Commission on December 21, 2016.\n* Included in Exhibit 31.1\n** Included in Exhibit 32.1\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities and Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nOS Support, Inc.\nBy: /s/ Paramjit Mann\nParamjit Mann\nPresident and Director\nPrincipal Executive Officer\nPrincipal Financial Officer\nPrincipal Accounting Officer\nDated: November 18, 2022"
}