{
    "cik": "1659207",
    "company": "Fellazo Corp",
    "filing_type": "10-K",
    "filing_date": "2022-12-13",
    "period_of_report": "2022-08-31",
    "sic": "2750",
    "state_of_inc": "NV",
    "state_location": "N8",
    "fiscal_year_end": "0831",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1659207/0001640334-22-002627-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1659207/000164033422002627/fllz_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1659207/0001640334-22-002627.txt",
    "filename": "1659207_10K_2022_0001640334-22-002627.htm",
    "content": "Item 1. Business\nGENERAL\nFellazo Corp. (the Company, we, us or our) was incorporated in the State of Nevada on May 28, 2014.\nThe Companys core business is Healthcare and Personal Wellness products - primarily bird-nest based, which include manufacturing and retail (retail chain and online). With our expertise in online applications platforms, we will be developing an online network platform to market and sell our products. and also create a system to source and purchase raw materials we required.\nIn mid of October 2019, the Companys 49% subsidiary Fellazo Berhad (FB) started purchases of raw bird-nests directly from bird-nest farmers or their agents, and re-sold them to bird-nest processors; wherever possible these raw bird-nests are delivered directly from the farmer to the processor, so that we would not have to maintain a facility to store these raw bird-nests at an early stage of our business development.\nFBs show factory had since moved to a new location after our Head-Office moved to Putrajaya, the Malaysian Governments Federal Administrative Center. The new show factory is located within half an hour from our office and continues to be managed by our Management Agent, Swipypay Berhad.\nDue to the continuous effects of the Covid-19 pandemic and the economy uncertainty, we are minimally operating and any plan for expansion had been put on hold until the overall economic climate improves.\nOn April 1, 2021, Yap Kit Chuan, President, director and owner of ninety-six percent (96%) of the issued and outstanding shares of Common Stock of the Company, agreed to transfer, to a number of business associates, up to approximately 26,000,000 shares of the Companys Common Stock, representing thirty percent (30%) of the total issued and outstanding shares of Common Stock of the Company.\nOn July 15, 2021, Yap Kit Chuan, agreed to increase the proposed transfers up to a total of 35,000,000 shares, representing up to forty-one percent (41%) of the issued and outstanding shares of the Companys Common Stock. The transfers will occur from time to time and will now be completed on or before August 31, 2021. The transfers will be undertaken pursuant to Regulation S of the Securities Act of 1933, and the shares transferred will continue to carry a restrictive legend.\nAs of August 31, 2021, the total of 34,835,373 shares have been transferred to 249 new and 9 existing shareholders, and the number of shares belonged to Yap Kit Chuan was 48,368,127 shares.\nOur office is located at T2-L8-3, Level 8, IOI City Tower Two, Lebuh IRC, IOI Resort City, 62502 Putrajaya, Malaysia. Our corporate website is http://fellazo.com.\nWe have never declared bankruptcy, been in receivership, or involved in any kind of legal proceeding.\nPRODUCTS\nOur Companys main core products during the next accounting year are expected to be the following, and these would depend heavily on the economy recovery from effects of the pandemic.\n(a)\nRaw bird-nests - FB will purchase raw bird-nests from bird-nest farmers locally in Malaysia, but we are also seeking sources from nearby countries in South East Asia, such as Indonesia, Philippines, Vietnam and others. This initial plan is also to create a network of consistent supplies of raw bird-nests. The raw bird-nests will then be sold to bird-nest processing factories and for use at our show-factory located at our premise.\n(b)\nClean bird-nests - we have made arrangements with small-holder bird-nest processing factories to supply them with raw bird-nests, who will then sell all the same finished clean products to us. This will ensure we have a constant supply of clean bird-nests.\nThe clean bird-nests will be packed in different packages in according to volume and grades for stock-up and sale at our retail outlet on our premise.\n(c)\nOEM personal cleansing and nourishing facial products under the brand name of Yanduopin (YDP) - which name means Multiple Bird Nest Product - we are still in the process of testing and performing consumer surveys on our personal cleansing and nourishing facial products.\nCUSTOMERS\nOur target customers are;\n(1)\nRaw bird-nest - small and medium size processing factories in Malaysia.\n(2)\nClean bird-nest - consumers, targeting Asian females between 18 and 65 years of age.\n(3)\nYDP+ Y-Essence Personal Cleansing & Nourishing Facial products - consumers, targeting Asian females between 23 and 65 years of age.\nSALES AND MARKETING\nFB had a show-factory for processing of raw bird-nests and we expect this will entice visits by tourists and tour groups to our retail outlet.\nOur plan of setting-up our own online business for our products are also put on hold pending due to the pandemic.\nSUPPLY, MANUFACTURE AND DISTRIBUTION\n(1)\nTo create a network of consistent supplies of raw bird-nests and clean bird-nests to sustain our sales.\n(2)\nBy setting-up our show-factory, we hope to also provide a platform for our management to learn and experience all the requirements, regulations and procedures of operating a bird-nest processing factory, should we decide to set-up our own factories.\nSEASONALITY\nOur products are not influenced by seasonality.\nCOMPETITION\nThe bird-nest industry is becoming a very competitive market, and increasingly popular due to the huge consumer market in China. There are a number of companies, especially in Malaysia, who are venturing into the bird-nest and bird-nest related products market.\nBecause competition for raw bird-nest is very high, so it is essential to establish a network of suppliers to ensure consistent supplies. Our company is considering options to acquire our own bird-nesting houses to ensure consistent and quality supplies.\nWe target to be ahead of our competitors by;\n(a)\nsourcing good quality raw bird-nest locally or overseas\n(b)\nensuring efficiency of bird-nest processing by our factory/partner to reduce wastage\n(c)\nselling our products in the most effective manner by bringing our products to the consumer through online sales or retail outlets at consumers locality.\nGOVERNMENT REGULATION\nWe will always comply with all regulations, rules and directives of governmental authorities and agencies applicable to our business in any jurisdiction which we would conduct activities. We do not believe that governmental regulation will have a material impact on the way we conduct our business.\nRESEARCH AND DEVELOPMENT\nNone.\nINTELLECTUAL PROPERTY\nNot Applicable.\nEMPLOYEES\nPresently FB had 2 marketing staff under its employment, all whom reports directly to Director Choo Chee Loong.\nAll other administrative functions are handled on behalf by our appointed Management Agent, Swipypay Berhad.\nThe Board is assisted by a team consisting of highly competent professional consultants and experts in the related the fields during this period of transformation exercise. Item 1A. Risk Factors\nNot Applicable to smaller reporting company. Item 1B. Unresolved Staff Comments\nNot Applicable.\nItem 1C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections.\nNone. Item 2. Properties\nOur Company does not own any property, our office in Putrajaya is shared with our Management Agent. Item 3. Legal Proceedings\nFrom time to time, we may become involved in litigation relating to claims arising out of our operations in the normal course of business. We are not involved in any pending legal proceeding or litigation and, to the best of our knowledge, no governmental authority is contemplating any proceeding to which we are a party and which would reasonably be likely to have a material adverse effect on our company. To date, our company has never been involved in litigation, as either a party or a witness, nor has our company been involved in any legal proceedings commenced by any regulatory agency against our company. Item 4. Mine Safety Disclosure\nNot Applicable.\nPART II Item 5. Market for Registrants Common Equity Related Stockholder Matters and Issuer Purchases of Equity Securities\nOur Common shares are listed for quotation on the OTC Markets under the symbol FLLZ.\nThere is no established current public market for the shares of our Common Stock. There can be no assurance that a liquid market for our securities will ever develop. Transfer of our Common Stock may also be restricted under the securities or blue sky laws of various states and foreign jurisdictions. Consequently, investors may not be able to liquidate their investments and should be prepared to hold the Common Stock for an indefinite period of time.\nOur shares are issued in registered form. Globex Transfer, LLC, with an address at 780 Deltona Blvd., Suite 202, Deltona, FL 32725 and telephone number is 813-344-4490, is the registrar and transfer agent for our common shares.\nOn December 13, 2021, there were 289 registered shareholders with 86,264,000 shares of Common Stock outstanding.\nDividends\nNo cash dividends were paid on our shares of Common Stock during the fiscal year ended August 31, 2022, and since our incorporation on May 28, 2014, and presently we have no plans to declare any dividend on our Common Stock.\nRecent Sales of Unregistered Securities\nNo unregistered sales of equity securities took place during the year ended August 31, 2022.\nPurchases of Equity Securities by the Registrant and Affiliated Purchasers\nNone. Item 6. Selected Financial Data\nWe are a smaller reporting company as defined by Rule 12b-2 of the Securities Exchange Act of 1934 and are not required to provide the information under this item. Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations.\nRESULTS OF OPERATIONS\nThe following summary of our results of operations should be read in conjunction with our financial statements included elsewhere in this annual report.\nAs at August 31, 2022, the Company has a working capital deficit of $1,735,407 and has not yet established a stabilized source of revenue sufficient to cover operating cost for the foreseeable future. These factors, among others, may raise substantial doubt about the Companys ability to continue as a going concern.\nOur financial statements have been prepared assuming that we will continue as a going concern and, accordingly, do not include adjustments relating to the recoverability and realization of assets and classification of liabilities that might be necessary should we be unable to continue in operation. We expect we will require additional capital to meet our long term operating requirements. We expect to raise additional capital through, among other things, the sale of equity or debt securities.\nComparison of the years ended August 31, 2022 and, 2021\nYears ended\nAugust 31,\nChange\n%\nRevenue\n$ 81,846\n$ 246,861\n$ (165,015 )\n(67%)\nCost of Goods Sold\n55,941\n182,306\n(126,365 )\n(69%)\nGeneral and administrative expenses\n372,020\n391,378\n(19,358 )\n(5%)\nNet loss\n$ 346,115\n$ 326,823\n$ 19,292\n6%\nFor the year ended August 31, 2022, we had revenue of $81,846 and cost of revenue of $55,941, as compared to revenue of $246,861 and cost of revenue of $182,306 for the same period in 2021. The Company started with trading of raw bird-nest since fiscal year 2020 and it is an initial stage of our operations. The decrease in revenue is mainly due to the economic climate resulted from the still lingering Covid-19 pandemic. The decrease in cost of revenue is mainly due to a decrease in revenue.\nOur general and administrative expenses were $372,020 for the year ended August 31, 2022, with a decrease of $18,858 as compared to $391,378 for the same period in 2021. General and administrative expense mainly consisted of management fees, payroll expenses, professional fees for ongoing regulatory requirements.\nLiquidity and Capital Resources\nWorking Capital\nAugust 31,\nAugust 31,\nChange\n%\nCurrent assets\n$ 20,873\n$ 7,361\n$ 13,512\n23 %\nCurrent liabilities\n$ 1,756,280\n$ 1,422,950\n$ 333,330\n23 %\nWorking capital deficiency\n$ (1,735,407 )\n$ (1,415,589 )\n$ (319,818 )\n23 %\nThe Companys current assets consists of cash of $9,055 and prepaid expense of $11,818 at August 31, 2022, with an increase of $13,512 as compared to cash of $7,361 at August 31, 2021.\nAs at August 31, 2022, current liabilities consisted of accounts payable and accrued liabilities of $18,317 and due to a related party of $1,737,963, as compared to August 31, 2021 current liabilities consisted of accounts payable and accrued liabilities of $13,721 and due to a related party of $1,409,229. The increase in current liabilities of $333,330 is primarily due to the operating expenses paid by the related party.\nCash Flows\nYears ended\nAugust 31,\nChange\nCash provided by operating activities\n$ 50,717\n$ 68,935\n$ (18,218 )\nCash used in financing activities\n(47,127 )\n(68,163 )\n21,036\nEffects on changes in foreign exchange rate\n(1,896 )\n(76 )\n(1,820 )\nNet change in cash\n$ 1,694\n$ 696\n$ 998\nCash Flow from Operating Activities\nCash flows provided by operations was $50,717 during the year ended August 31, 2022, compared with $68,935 during the same period in 2021. The decrease of $18,218 is mainly due to an increase in net loss.\nCash Flow from Financing Activities\nCash flows used in financing activities was $47,127 during the year ended August 31, 2022. It consists of advances from related party of $51,570 and repayment to related party of $98,697. Cash flows used in financing activities was $68,163 during the year ended August 31, 2021. It consists of advances from related party of $15,555 and repayment to related party of $83,718.\nPlan of Operation and Funding\nWe expect that working capital requirements will continue to be funded through further issuances of our securities and loans from our executive officers and principal shareholders, including Joseph Ho; although we have no formal agreement with anyone to allow the Company to borrow any funds. Our working capital requirements are expected to increase in line with the growth of our business.\nExisting working capital, further advances and debt instruments, and anticipated cash flow are not expected to be adequate to fund our operations and potential acquisitions over the next twelve months. We have no lines of credit or other bank financing arrangements. Generally, we have financed operations to date through the proceeds of the private placement of equity and debt instruments. In connection with our business plan, management anticipates additional increases in operating expenses and capital expenditures relating to: (i) the acquisition of businesses in the health-related industry; (ii) acquisition of inventory; (iii) developmental expenses associated with a start-up business; and (iv) marketing expenses. We intend to finance these expenses with further issuances of equity securities and debt instruments. Thereafter, we expect we will need to raise additional capital and generate revenues to meet long-term operating requirements. Additional issuances of equity or convertible debt securities will result in dilution to our current shareholders. Further, such securities might have rights, preferences or privileges senior to our Common Stock. Additional financing may not be available upon acceptable terms, or at all. If adequate funds are not available or are not available on acceptable terms, we may not be able to take advantage of prospective new business endeavors or opportunities, which could significantly and materially restrict our business operations.\nWe will also be sourcing funds from potential investors to finance purchases of raw materials needed to support our operations and surplus for potential buyers.\nWe believe our business plan will create a significant growth potential to the Company which would generate more than sufficient revenue and liquidity to sustain the Company for the next twelve months and a significant future growth.\nOff-Balance Sheet Arrangements\nAs of the date of this Annual Report, we do not have any off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources that are material to investors.\nGoing Concern\nThe accompanying consolidated financial statements have been prepared assuming that the Company will continue as a going concern, which contemplates the realization of assets and the discharge of liabilities in the normal course of business for the foreseeable future.\nAs of August 31, 2022, the Company had an accumulated deficit of $1,666,632 and net loss of $346,115 for the year ended August 31, 2022. Losses have principally occurred as a result of the substantial resources required for general and administrative expenses associated with our operations. The continuation of the Company as a going concern is dependent upon the continued financial support from its stockholders or external financing. Management believes the existing stockholders will provide the additional cash to meet with the Companys obligations as they become due. However, there is no assurance that the Company will be successful in securing sufficient funds to sustain the operations.\nThese conditions raise substantial doubt about the Companys ability to continue as a going concern. These financial statements do not include any adjustments to reflect the possible future effect on the recoverability and classification of assets or the amounts and classifications of liabilities that may result from the outcome of these uncertainties. Management believes that the actions presently being taken to obtain additional funding and implement its strategic plan provides the opportunity for the Company to continue as a going concern.\nCritical Accounting Policies\nWe have identified the following policies below as critical to our business and results of operations. Our reported results are impacted by the application of the following accounting policies, certain of which require management to make subjective or complex judgments. These judgments involve making estimates about the effect of matters that are inherently uncertain and may significantly impact quarterly or annual results of operations. For all of these policies, management cautions that future events rarely develop exactly as expected, and the best estimates routinely require adjustment. Specific risks associated with these critical accounting policies are described in the following paragraphs.\nUse of Estimates\nThe preparation of financial statements in conformity with U.S. GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements as well as the reported amount of revenues and expenses during the reporting period. Actual results could differ from these estimates.\nRecent Accounting Pronouncements\nOur Company has implemented all new accounting pronouncements and does not believe that there are any other accounting pronouncements that have been issued that may have a material impact on its financial statements. Item 7A. Quantitative and Qualitative Disclosures about Market Risk.\nAs a smaller reporting company, we are not required to provide the information required by this Item. Item 8. Financial Statements and Supplementary Data\nFELLAZO CORP. FINANCIAL STATEMENTS FOR THE YEAR ENDED AUGUST 31, 2022\nPage\nReport of Independent Registered Public Accounting Firms (PCAOB ID: 1171)\nConsolidated Balance Sheets\nConsolidated Statements of Operations and Comprehensive Loss\nConsolidated Statements of Changes in Stockholders Deficit\nConsolidated Statements of Cash Flow\nNotes to the Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo: The Board of Directors and Stockholders of\nFellazo Corp.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Fellazo Corp. (the Company) as of August 31, 2022 and 2021, and the related consolidated statements of operations and comprehensive loss, changes in stockholders deficit, and cash flows for each of the years in the two-year period ended August 31, 2022, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of August 31, 2022 and 2021, and the results of its operations and its cash flows for each of the years in the two-year period ended August 31, 2022, in conformity with accounting principles generally accepted in the United States of America.\nEmphasis of Matter\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 1 to the financial statements, the Company had incurred substantial losses during the year ended August 31, 2021, and had a working capital deficit, which raised substantial doubt about its ability to continue as a going concern. As of and for the year ended August 31, 2022, the Company continued to have a working capital deficit and continued to incur substantial losses which continue to give rise to the substantial doubt that the Company will continue as a going concern. Managements plans to address this substantial doubt are set forth in Note 1. These financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nCritical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. We determined that there were no critical audit matters.\n/s/ WWC, P.C.\nWWC, P.C.\nCertified Public Accountants\nWe have served as the Companys auditor since January 6, 2020\nSan Mateo, California\nDecember 13, 2022\nFELLAZO CORP.\nConsolidated Balance Sheets\nAugust 31,\nAugust 31,\nASSETS\nCurrent Assets\nCash\n$ 9,055\n$ 7,361\nDeposit for purchases of inventory\n11,818\n-\nTotal Current Assets\n20,873\n7,361\nTOTAL ASSETS\n$ 20,873\n$ 7,361\nLIABILITIES AND STOCKHOLDERS' DEFICIT\nCurrent Liabilities\nAccounts payable and accrued liabilities\n$ 18,317\n$ 13,721\nDue to related party\n1,737,963\n1,409,229\nTotal Current Liabilities\n1,756,280\n1,422,950\nTOTAL LIABILITIES\n1,756,280\n1,422,950\nCommitment and contingencies\nStockholders' Deficit\nCommon stock, $0.001 par value, 1,000,000,000 shares authorized; 86,264,000 shares issued and outstanding\n86,264\n86,264\nAdditional paid-in capital\n36,122\n36,122\nAccumulated deficit\n(1,666,632 )\n(1,403,624 )\nAccumulated other comprehensive income (loss)\n11,905\n(981 )\nTotal Fellazo Corp. Stockholders' Deficit\n(1,532,341 )\n(1,282,219 )\nNon-controlling interest\n(203,066 )\n(133,370 )\nTotal Stockholders' Deficit\n(1,735,407 )\n(1,415,589 )\nTOTAL LIABILITIES AND STOCKHOLDERS' DEFICIT\n$ 20,873\n$ 7,361\nThe accompanying notes are an integral part of these consolidated financial statements.\nFELLAZO CORP.\nConsolidated Statements of Operations and Comprehensive Loss\nYears ended\nAugust 31,\nRevenues\n$ 73,177\n$ 196,916\nRevenues from related parties\n8,669\n49,945\nRevenues total\n81,846\n246,861\nCost of goods sold\n7,492\n148,323\nCost of goods sold from related party\n48,449\n33,983\nCost of goods sold total\n55,941\n182,306\nGross profit\n25,905\n64,555\nOperating Expenses\nGeneral and administrative expenses\n$ 372,020\n$ 391,378\nTotal operating expenses\n372,020\n391,378\nLoss from operations\n(346,115 )\n(326,823 )\nLoss before taxes\n(346,115 )\n(326,823 )\nProvision for income tax\n-\n-\nNet loss\n(346,115 )\n(326,823 )\nNet loss attributable to the non-controlling interest\n(83,107 )\n(66,818 )\nNet Loss Attributable to the Shareholders of Fellazo Corp.\n$ (263,008 )\n$ (260,005 )\nOther comprehensive loss\nForeign currency translation gain (loss)\n26,297\nTotal comprehensive loss\n(319,818 )\n(326,593 )\nComprehensive Loss attributable to the non-controlling interest\n(69,696 )\n(66,701 )\nComprehensive Loss Attributable to The Shareholders of Fellazo Corp.\n$ (250,122 )\n$ (259,892 )\nBasic and dilutive net loss per common share\n$ (0.00 )\n$ (0.00 )\nWeighted average number of common shares outstanding - basic and diluted\n86,264,000\n86,264,000\nThe accompanying notes are an integral part of these consolidated financial statements.\nFELLAZO CORP.\nConsolidated Statements of Changes in Stockholders Deficit\nFor the Years Ended August 31, 2022 and 2021\nAdditional\nAccumulated other\nNon\nCommon Stock\npaid in\nAccumulated\ncomprehensive\ncontrolling\nShares\nAmount\nCapital\nDeficit\nIncome (loss)\nInterest\nTotal\nBalance, August 31, 2020\n86,264,000\n$ 86,264\n$ 36,122\n$ (1,143,619 )\n$ (1,094 )\n$ (66,669 )\n$ (1,088,996 )\nNet loss for the year\n-\n-\n-\n(260,005 )\n-\n(66,818 )\n(326,823 )\nForeign currency translation gain\n-\n-\n-\n-\nBalance, August 31, 2021\n86,264,000\n$ 86,264\n$ 36,122\n$ (1,403,624 )\n$ (981 )\n$ (133,370 )\n$ (1,415,589 )\nNet loss for the year\n-\n-\n-\n(263,008 )\n-\n(83,107 )\n(346,115 )\nForeign currency translation gain\n-\n-\n-\n-\n12,886\n13,411\n26,297\nBalance, August 31, 2022\n86,264,000\n$ 86,264\n$ 36,122\n$ (1,666,632 )\n$ 11,905\n$ (203,066 )\n$ (1,735,407 )\nThe accompanying notes are an integral part of these consolidated financial statements\nFELLAZO CORP.\nConsolidated Statements of Cash Flows\nYears ended\nAugust 31,\nCash Flows from Operating Activities:\nNet loss\n$ (346,115 )\n$ (326,823 )\nAdjustments to reconcile net loss to net cash used in operations:\nExpenses paid by related party\n403,980\n404,400\nChanges in operating assets and liabilities:\nPrepaid expenses\n-\n1,133\nDeposit for purchase of inventory\n(11,818 )\n6,663\nAccounts payable and accrued liabilities\n4,670\n(16,438 )\nNet Cash Provided by Operating Activities\n50,717\n68,935\nCash Flows from Financing Activities:\nAdvances from related party\n51,570\n15,555\nRepayment to related party\n(98,697 )\n(83,718 )\nNet Cash Used in Financing Activities\n(47,127 )\n(68,163 )\nEffects on changes in foreign exchange rate\n(1,896 )\n(76 )\nNet change in cash\n1,694\nCash, beginning of period\n7,361\n6,665\nCash, end of period\n$ 9,055\n$ 7,361\nSupplemental cash flow information\nInterest paid\n$ -\n$ -\nIncome taxes paid\n$ -\n$ -\nThe accompanying notes are an integral part of these consolidated financial statements\nFELLAZO CORP.\nNotes to the Consolidated Financial Statements\nNOTE 1 - ORGANIZATION, DESCRIPTION OF BUSINESS AND GOING CONCERN\nFellazo Corp. (the Company, we, us or our) was incorporated in the State of Nevada on May 28, 2014.\nDuring the year ended August 31, 2022, the Company had continued its transformation process into an IT based company specialized in Mobile Application Developments with worldwide clientele and a portfolio investment company in primary industries such as healthcare, energy, development and capital market. The Company had commenced to be engaged in the industry of Healthcare and Personal Wellness products and related products. Activities include but not limited to sourcing raw materials or partly or fully finished products, manufacturing, wholesale and trading of these products.\nOur office is located at 8th Floor, Wisma Huazong, Lot 15285, 0.7km Lebuhraya SungeiBesi, 43300 Seri Kembangan, Selangor Darul Ehsan, Malaysia.\nGoing Concern Uncertainties\nThe accompanying consolidated financial statements have been prepared assuming that the Company will continue as a going concern, which contemplates the realization of assets and the discharge of liabilities in the normal course of business for the foreseeable future.\nAs of August 31, 2022, the Company had an accumulated deficit of $1,672,977, and net loss of $358,544 for the year ended August 31, 2022. Losses have principally occurred as a result of the substantial resources required for general and administrative expenses associated with our operations. The continuation of the Company as a going concern is dependent upon the continued financial support from its stockholders or external financing. Management believes the existing stockholders will provide the additional cash to meet with the Companys obligations as they become due. However, there is no assurance that the Company will be successful in securing sufficient funds to sustain the operations.\nThese conditions raise substantial doubt about the Companys ability to continue as a going concern. These financial statements do not include any adjustments to reflect the possible future effect on the recoverability and classification of assets or the amounts and classifications of liabilities that may result from the outcome of these uncertainties. Management believes that the actions presently being taken to obtain additional funding and implement its strategic plan provides the opportunity for the Company to continue as a going concern.\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBasis of Presentation\nThese accompanying consolidated financial statements have been prepared in accordance with generally accepted accounting principles in the United States of America (U.S. GAAP).\nPrinciples of Consolidation\nThe accompanying consolidated financial statements include the financial statements of the Company and its 49% owned subsidiary Fellazo Berhad, an entity under common control. All significant inter-company balances and transactions within the Company have been eliminated upon consolidation.\nVariable Interest Entities\nThe Company holds both the power to direct the most significant activities of FB, as well as an economic interest in FB and, as such, is deemed to be the primary beneficiary or consolidator of FB. The determination of the VIEs primary beneficiary requires an evaluation of the contractual and implied rights and obligations associated with each partys relationship with or involvement in the entity, an estimate of the entitys expected losses and expected residual returns and the allocation of such estimates to each party involved in the entity.\nUse of Estimates\nIn preparing these financial statements, in conformity with GAAP requires management makes estimates and assumptions that affect the reported amounts of assets and liabilities in the balance sheet and revenues and expenses during the years reported. Actual results may differ from these estimates. Making estimates requires management to exercise significant judgement. It is at least reasonably possible that the estimate of the effect of a condition, situation or set of circumstances that existed at the date of the financial statements, which management considered in formulating its estimate, could change in the near term due to one or more future confirming events. Accordingly, the actual results could differ significantly from those estimates.\nForeign Currency Translation\nTransactions denominated in currencies other than the functional currency are translated into the functional currency at the exchange rates prevailing at the dates of the transaction. Monetary assets and liabilities denominated in currencies other than the functional currency are translated into the functional currency using the applicable exchange rates at the balance sheet dates. The resulting aggerated amount of exchange differences are recorded as general and administrative expenses in the statement of operations.\nThe reporting currency of the Company is the United States Dollar (USD). The Companys subsidiary in Malaysia maintains their books and records in their local currency, the Malaysia Ringgit (RM), which is the functional currency as being the primary currency of the economic environment in which these entities operate.\nIn general, for consolidation purposes, assets and liabilities of its subsidiary whose functional currency is not the USD are translated into USD, in accordance with ASC 830, Translation of Financial Statements, using the exchange rate on the balance sheet date. Revenues and expenses are translated at average rates prevailing during the period. The gains and losses resulting from translation of financial statements of foreign subsidiary are recorded as a separate component of accumulated other comprehensive income within the statement of stockholders equity.\nExchange Rates\nAugust 31,\nAugust 31,\nSpot rate RM : USD exchange rate\n0.2234\n0.2406\nAverage period RM : USD exchange rate\n0.2343\n0.2389\nCash and Cash Equivalents\nCash and cash equivalents are carried at cost and represent cash on hand, demand deposits placed with banks or other financial institutions and all highly liquid investments with an original maturity of three months or less as of the purchase date of such investments. As of August 31, 2022 and 2021, the Company had $9,055 and $7,361 in cash and cash equivalents, respectively.\nFair value of financial instruments\nThe carrying value of the Companys financial instruments (excluding short-term bank borrowing and note payable): cash and cash equivalents, accounts payable and accrued liabilities and amount due to a related party at their fair values because of the short-term nature of these financial instruments.\nThe Company also follows the guidance of the ASC Topic 820-10, Fair Value Measurements and Disclosures (ASC 820-10), with respect to financial assets and liabilities that are measured at fair value. ASC 820-10 establishes a three-tier fair value hierarchy that prioritizes the inputs used in measuring fair value as follows:\n·\nLevel 1 : Inputs are based upon unadjusted quoted prices for identical instruments traded in active markets;\n·\nLevel 2 : Inputs are based upon quoted prices for similar instruments in active markets, quoted prices for identical or similar instruments in markets that are not active, and model-based valuation techniques (e.g. Black-Scholes Option-Pricing model) for which all significant inputs are observable in the market or can be corroborated by observable market data for substantially the full term of the assets or liabilities. Where applicable, these models project future cash flows and discount the future amounts to a present value using market-based observable inputs; and\n·\nLevel 3 : Inputs are generally unobservable and typically reflect managements estimates of assumptions that market participants would use in pricing the asset or liability. The fair values are therefore determined using model-based techniques, including option pricing models and discounted cash flow models.\nFair value estimates are made at a specific point in time based on relevant market information about the financial instrument. These estimates are subjective in nature and involve uncertainties and matters of significant judgment and, therefore, cannot be determined with precision. Changes in assumptions could significantly affect the estimates.\nRevenue recognition\nThe Company commenced its operation in mid-October 2019. At this initial stage revenue is earned from the trading of raw bird-nest only. During the year ended August 31, 2022, the Company began selling durian paste to its customers.\nThe Companys revenue recognition procedures consist of the following five steps in order to determine the appropriate amount of revenue to be recognized as it fulfills its obligations pursuant to each of its sales transactions:\n·\nidentify the contract with a customer;\n·\nidentify the performance obligations in the contract;\n·\ndetermine the transaction price;\n·\nallocate the transaction price to performance obligations in the contract; and\n·\nrecognize revenue as the performance obligation is satisfied.\nThe Company believes it is still in the initial stage of its operations which started with the trading of raw bird-nest and with the recent addition of the product, durian past, the management is using this initial stage as exposure of the management to the bird-nest business in order to learn and gain experience with our suppliers whom are bird-nest farmers or their agents, determination of quality of the raw materials, the process of raw bird-nest cleaning of the different class of the raw material and market for these clean bird-nest, and handling of durian paste as a food product.\nThus at this initial stage we have not entered into any formal contract with our suppliers and purchasers, most of the suppliers and purchasers are known to our management or introduced to the management by closed business friends. The Company recognizes the revenue at a point in time when products are transferred to its customers which also typically corresponds with the issuance of invoices to those customers. The Company has a single performance obligation which is completed when goods are physically transferred to its customers.\nCost of Goods Sold\nAt the current stage of stage of business operations which the management considered as exposure, gaining of knowledge and experience of the overall bird-nest and durian paste business, our Cost of goods sold only include the actual cost of the raw bird-nest and durian paste purchased from suppliers.\nCommitments and contingencies\nThe Company follows subtopic 450-20 of the FASB Accounting Standards Codification to report accounting for contingencies. Certain conditions may exist as of the date the financial statements are issued, which may result in a loss to the Company, but which will only be resolved when one or more future events occur or fail to occur. The Company assesses such contingent liabilities, and such assessment inherently involves an exercise of judgment. In assessing loss contingencies related to legal proceedings that are pending against the Company or un-asserted claims that may result in such proceedings, the Company evaluates the perceived merits of any legal proceedings or un-asserted claims as well as the perceived merits of the amount of relief sought or expected to be sought therein.\nIf the assessment of a contingency indicates that it is probable that a material loss has been incurred and the amount of the liability can be estimated, then the estimated liability would be accrued in the Companys financial statements. If the assessment indicates that a potentially material loss contingency is not probable but is reasonably possible, or is probable but cannot be estimated, then the nature of the contingent liability, and an estimate of the range of possible losses, if determinable and material, would be disclosed.\nLoss contingencies considered remote are generally not disclosed unless they involve guarantees, in which case the guarantees would be disclosed. Management does not believe, based upon information available at this time, that these matters will have a material adverse effect on the Companys consolidated financial position, results of operations or cash flows. However, there is no assurance that such matters will not materially and adversely affect the Companys business, financial position, and results of operations or cash flows.\nConcentrations\nSale\nDuring the year ended August 31, 2022, the Company had a concentration in demand for its products as two customers comprised 89.7% of the Companys sales where for one customer was 46.5%, and a second customer was 43.1.\nDuring the year ended August 31, 2021, the Company had a concentration in demand for its products as three customers comprised 66.2% of the Companys sales where for one customer was 32.0%, a second customer was 21.9%, and a third customer was 12.3%.\nDuring the year ended August 31, 2022, the Company had a concentration in its products portfolio as one product comprised 100% of birds nest.\nDuring the year ended August 31, 2021, the Company had a concentration in its products portfolio as two products comprised 100% of which 32.0% was durian past and 68.0% was birds nest the Companys sales.\nPurchase\nDuring the year ended August 31, 2022, the Company had a concentration in supply of its products as one supplier provided 86.7%.\nDuring the year ended August 31, 2021, the Company had a concentration in supply of its products as one supplier provided 19.0% and second supplier provided 42% of the Companys purchases totaling 61.0%\nIncome taxes\nThe Company complies with the accounting and reporting requirements of ASC Topic 740, Income Taxes, which requires an asset and liability approach to financial accounting and reporting for income taxes. Deferred income tax assets and liabilities are computed for differences between the financial statement and tax bases of assets and liabilities that will result in future taxable or deductible amounts, based on enacted tax laws and rates applicable to the periods in which the differences are expected to affect taxable income. Valuation allowances are established, when necessary, to reduce deferred tax assets to the amount expected to be realized.\nASC Topic 740 prescribes a recognition threshold and a measurement attribute for the financial statement recognition and measurement of tax positions taken or expected to be taken in a tax return. For those benefits to be recognized, a tax position must be more-likely-than-not to be sustained upon examination by taxing authorities. The Companys management determined that the Hong Kong is the Companys major tax jurisdiction. The Company recognizes accrued interest and penalties related to unrecognized tax benefits, if any, as income tax expense. There were no unrecognized tax benefits and no amounts accrued for interest and penalties as of August 31, 2022. The Company is currently not aware of any issues under review that could result in significant payments, accruals or material deviation from its position.\nThe Company conducts businesses in Malaysia and is subject to tax in this jurisdiction. As a result of its business activities, the Company will file tax returns that are subject to examination by the foreign tax authority.\nNet loss per share\nThe Company calculates net loss per share in accordance with ASC Topic 260, Earnings per Share. Basic income per share is computed by dividing the net income by the weighted-average number of common shares outstanding during the period. Diluted income per share is computed similar to basic income per share except that the denominator is increased to include the number of additional common shares that would have been outstanding if the potential common stock equivalents had been issued and if the additional common shares were dilutive. As of August 31, 2022 and 2021, the Company has no dilutive securities.\nRelated Parties\nParties, which can be a corporation or individual, are considered to be related if the Company has the ability, directly or indirectly, to control the other party or exercise significant influence over the other party in making financial and operational decisions. Companies are also considered to be related if they are subject to common control or common significant influence.\nRecent Accounting Pronouncements\nManagement has considered all recent accounting pronouncements issued. The Companys management believes that these recent pronouncements will not have a material effect on the Companys financial statements.\nNOTE 3 - DEPOSIT FOR PURCHASES OF INVENTORY\nAs of August 31, 2022 and 2021, the Company had $11,818 and $0, respectively for purchase deposit on bird nests.\nNOTE 4 - RELATED PARTY TRANSACTIONS\nOur Management Agent, Swipypay Berhad (a company established in Malaysia) is 80% owned by our Director - Mr Yap Kit Chuan. Total outstanding amount due to our Management Agent was $1,737,963 and $1,409,229 as of August 31, 2022 and 2021 respectively. The additional amount of $328,734 incurred in the year ended August 31, 2022 consisted of operating expenses paid on behalf of the Company of $403,980 and advances from a related party of $51,570, and repayment to related party of $98,697. The difference of amount was a result of change of exchange rate.\nDuring the years ended August 31, 2022 and 2021, we had purchased $48,449 and $33,983 worth of raw bird-nest from Swipypay Berhad (also an agent for bird-nest farmers), respectively.\nOur Company does not own or lease any real property, and our registered office in Malaysia is provided by our Management Agent.\nNOTE 5 - STOCKHOLDERS DEFICIT\nThe Company is authorized to issue 1,000,000,000 shares of common stock at a par value $0.001.\nDuring the years ended August 31, 2022 and 2021, there were no issuances of common stock.\nAs of August 31, 2022 and 2021, 86,264,000 shares of common stock were issued and outstanding, respectively.\nNOTE 6 - INCOME TAXES\nFellazo Corp. was formed in 2014. Prior to the acquisition of FB in January 2019, the Company only had operations in the United States. In January 2019, the Company became the parent of FB, a Malaysia subsidiary, which files tax returns in Malaysia.\nFor the years ended August 31, 2022 and 2021, the local (United States of America) and foreign components of loss before income taxes were comprised of the following:\nYears ended\nAugust 31,\nTax jurisdiction from:\n- Local\n$ (183,160 )\n$ (195,807 )\n- Foreign\n(162,955 )\n(131,016 )\nLoss before income taxes\n$ (346,115 )\n$ (326,823 )\nUnited States of America\nFellazo Corp operates in the United States and files tax returns in these jurisdictions.\nThe reconciliation of income tax rate to the effective income tax rate for the year ended August 31, 2022 and 2021 is as follows:\nYears ended\nAugust 31,\nLoss before income taxes from US operation\n$ (183,160 )\n$ (195,807 )\nStatutory income tax rate\n21.00 %\n21.00 %\nIncome tax expense at statutory rate\n(38,464 )\n(41,119 )\nTax losses carryforward\n38,464\n41,119\nIncome tax expense\n$ -\n$ -\nAs of August 31, 2022, the operations in the United States recognized a deferred tax assets in the amount of $304,153 as a result of accumulated net operating losses. This asset is available to be carried forward to offset future income taxes payable. Management assessed the likelihood of realizing these deferred tax assets, and determined that at August 31, 2022, it was not able to reliably estimate future taxable profits, accordingly, Management has provided for a full valuation allowance against the deferred tax assets of $304,153.\nMalaysia\nThe Companys subsidiary FB operating in Malaysia is subject to the Malaysia Profits Tax at a standard income tax rate range of 24% on the assessable income arising in Malaysia during its tax year. The reconciliation of income tax rate to the effective income tax rate for the year ended August 31, 2022 and 2021 is as follows:\nYears ended\nAugust 31,\nLoss before income taxes from Malaysia operation\n$ (162,955 )\n$ (131,016 )\nStatutory income tax rate\n24.00 %\n24.00 %\nIncome tax expense at statutory rate\n(39,109 )\n(31,444 )\nTax losses carryforward\n39,109\n31,444\nIncome tax expense\n$ -\n$ -\nAs of August 31, 2022, the operations in Malaysia recognized a deferred tax assets in the amount of $106,910 as a result of accumulated net operating losses. This asset is available to be carried forward to offset future income taxes payable. Management assessed the likelihood of realizing these deferred tax assets, and determined that at August 31, 2022, it was not able to reliably estimate future taxable profits, accordingly, Management has provided for a full valuation allowance against the deferred tax assets of $106,910.\nThe following table sets forth the significant components of the aggregate deferred tax assets of the Company as of August 31, 2022 and 2021:\nAugust 31,\nAugust 31,\nDeferred tax assets:\nNet operating loss carryforwards\nUnited States\n$ 304,153\n$ 265,689\nMalaysia\n106,910\n67,801\nTotal\n411,063\n333,490\nLess: valuation allowance\n(411,063 )\n(333,490 )\nNet deferred tax asset\n$ -\n$ -\nManagement believes that it is more likely than not that the deferred tax assets will not be fully realizable in the future. Accordingly, the Company provided for a full valuation allowance against its deferred tax assets of $411,063 as of August 31, 2022. In the period, the valuation allowance increased by $77,573.\nNOTE 7 - SUBSEQUENT EVENTS\nThe Company evaluates subsequent events that have occurred after the balance sheet date but before the financial statements are issued. There are two types of subsequent events: (i) recognized, or those that provide additional evidence with respect to conditions that existed at the date of the balance sheet, including the estimates inherent in the process of preparing financial statements, and (ii) non-recognized, or those that provide evidence with respect to conditions that did not exist at the date of the balance sheet but arose subsequent to that date. Management has assessed any material events that may have occurred subsequent August 31, 2022 through the date of this report December 13, 2022, and has determined that there are no material subsequent events that require disclosure. Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNot Applicable. Item 9A. Controls and Procedures.\nEvaluation of disclosure controls and procedures\nPursuant to Rule 13a-15(b) under the Securities Exchange Act of 1934 (Exchange Act), our Company carried out an evaluation, with the participation of our Companys management, including our Companys Chief Executive Officer (our principal executive officer and our principal financial and accounting officer), of the effectiveness of our companys disclosure controls and procedures (as defined under Rule 13a-15(e) under the Exchange Act) as of the end of the period covered by this report. Based upon that evaluation, our Companys CEO concluded that our Companys disclosure controls and procedures are not effective to ensure that information required to be disclosed by our Company in the reports that our company files or submits under the Exchange Act, is recorded, processed, summarized and reported, within the time periods specified in the SECs rules and forms, and that such information is accumulated and communicated to our Companys management, including our companys CEO, as appropriate, to allow timely decisions regarding required disclosure, due to the material weaknesses identified below.\nIt should be noted that any system of controls, however well designed and operated, can provide only reasonable, and not absolute, assurance that the objectives of the system are met. In addition, the design of any control system is based in part upon certain assumptions about the likelihood of future events. Because of these and other inherent limitations of control systems, there can be no assurance that any design will succeed in achieving its stated goals under all potential future conditions.\nReport of Management on Internal Control over Financial Reporting\nManagement of our Company is responsible for establishing and maintaining adequate internal control over financial reporting for our Company. Our internal control system was designed, in general, to provide reasonable assurance to our Companys management and board regarding the preparation and fair presentation of published financial statements, but because of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nManagement conducted an evaluation of the effectiveness of our internal control over financial reporting based on the framework in Internal Control - Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission. A material weakness is a deficiency, or a combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement to our companys annual or interim financial statements will not be prevented or detected.\nIn the course of managements assessment, management concluded that our internal control over financial reporting was not effective as of August 31, 2022. We have identified the following material weaknesses in internal control over financial reporting:\nSegregation of Duties - As a result of limited resources, we did not maintain proper segregation of incompatible duties, namely the lack of an audit committee, an understaffed financial and accounting function, and the need for additional personnel to prepare and analyze financial information in a timely manner and to allow review and on-going monitoring and enhancement of our controls. The effect of the lack of segregation of duties potentially affects multiple processes and procedures\nMaintenance of Current Accounting Records - We may from time to time fail to maintain our records that in reasonable detail accurately and fairly reflect the transactions of our company.\nWe are in the continuous process of improving our internal control over financial reporting in an effort to eliminate these material weaknesses through improved supervision and training of our staff, but additional effort is needed to fully remedy these deficiencies. Management has engaged a Certified Public Accountant as a consultant to assist with the financial reporting process in an effort to mitigate some of the identified weaknesses. Our Company is still in its development stage and intends on hiring the necessary staff to address the weaknesses once revenue has been realized.\nThis annual report does not include an attestation report of our Companys registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by our Companys registered public accounting firm pursuant to temporary rules of the Securities and Exchange Commission that permit our Company to provide only managements report in this annual report.\nChanges in Internal Control Over Financial Reporting\nThere have been no changes in our internal controls over financial reporting that occurred during the year ended August 31, 2022 that have materially or are reasonably likely to materially affect, our internal controls over financial reporting. Item 9B. Other Information.\nExcept as provided above, there is no information to be disclosed in a report on Form 8-K during the fourth quarter of the year covered by this Form 10-K that has not been previously filed with the Securities and Exchange Commission.\nPART III Item 10. Directors, Executive Officers, and Corporate Governance.\nThe name, age and titles of our executive officer and director are as follows:\nName of Executive Officer and/or Director\nAge\nPosition\nHUANG Minxi\nDirector\n(Appointed as Director on September 9, 2016)\nYAP Kit Chuan\nPresident, CEO, CFO, Treasurer, Secretary and Director\n(Appointed as Director on September 9, 2016, Appointed as President, CEO, CFO, Treasurer and Secretary on May 15, 2018)\nProfessor Dr. HUANG Minxi has special research and professional interest in in-depth profiling of new ideas, opportunities and challenges in network technology development in the era of digital economy. He holds two doctoral degrees and is Senior Economist appointed Adjunct Professor at Institute of Politics and International Relations, Beijing Normal University. In addition, his international appointment includes Professor of National University of the Philippines and Adjunct Professor at Malaysian Hospitality College. Dr. Huang plays active roles in NGOs such as the Deputy Secretary General of Chinese Experts and Scholars Association, Vice President of the China Electronic Commerce Association and Senior Adviser to Hainan Vocational Education Institute. Professor Huang has demonstrated his entrepreneurship ability, over the past 20 years, by leading two successful enterprises, General Counsel to Tongxiang Palms Network Technology Co., Ltd. and Tongxiang Wuzhen PZ Points Software Development Co., Ltd. Both combined yearly revenues of USD100 million and manages over 100 employees in total.\nOur company believes that Dr. Huangs professional background experience gives him the qualifications and skills necessary to serve as a director of our company.\nDato Antheny YAP Kit Chuan received his State honour from His Highness of Pahang State of Malaysia carrying the Dato title, in honouring his social and economic contribution. In 2013 DatoAntheny won the Top Brand Award for his mobile payment gateway solutions ventures and subsequently in 2016 ASEAN Most Recognised Brand Award in mobile business apps development. He was an entrepreneur at 18 years of age. He is now Executive Director and CEO to Asia Loyalty Corporation Pte Ltd (HK) with businesses in Information Technology, Education, Healthcare and Property Development. Dato Antheny has experience and knowledge in software development and payment gateway industry. In the past ten years, he has been involved in the corporate environment, particularly in merger and acquisition and capital market.\nOur Company believes that Mr. Yaps professional background experience gives him the qualifications and skills necessary to serve as a director of our Company.\nFamily Relationships\nThere are no family relationships between any of our directors, executive officers and proposed directors or executive officers.\nInvolvement in Certain Legal Proceedings\nTo the best of our knowledge, none of our directors or executive officers has, during the past ten years:\n1.\nbeen convicted in a criminal proceeding or been subject to a pending criminal proceeding (excluding traffic violations and other minor offences);\n2.\nhad any bankruptcy petition filed by or against the business or property of the person, or of any partnership, corporation or business association of which he was a general partner or executive officer, either at the time of the bankruptcy filing or within two years prior to that time;\n3.\nbeen subject to any order, judgment, or decree, not subsequently reversed, suspended or vacated, of any court of competent jurisdiction or federal or state authority, permanently or temporarily enjoining, barring, suspending or otherwise limiting, his involvement in any type of business, securities, futures, commodities, investment, banking, savings and loan, or insurance activities, or to be associated with persons engaged in any such activity;\n4.\nbeen found by a court of competent jurisdiction in a civil action or by the SEC or the Commodity Futures Trading Commission to have violated a federal or state securities or commodities law, and the judgment has not been reversed, suspended, or vacated;\n5.\nbeen the subject of, or a party to, any federal or state judicial or administrative order, judgment, decree, or finding, not subsequently reversed, suspended or vacated (not including any settlement of a civil proceeding among private litigants), relating to an alleged violation of any federal or state securities or commodities law or regulation, any law or regulation respecting financial institutions or insurance companies including, but not limited to, a temporary or permanent injunction, order of disgorgement or restitution, civil money penalty or temporary or permanent cease-and-desist order, or removal or prohibition order, or any law or regulation prohibiting mail or wire fraud or fraud in connection with any business entity; or\n6.\nbeen the subject of, or a party to, any sanction or order, not subsequently reversed, suspended or vacated, of any self-regulatory organization (as defined in Section 3(a)(26) of the Exchange Act (15 U.S.C. 78c(a)(26)), any registered entity (as defined in Section 1(a)(29) of the Commodity Exchange Act (7 U.S.C. 1(a)(29)), or any equivalent exchange, association, entity or organization that has disciplinary authority over its members or persons associated with a member.\nTERM OF OFFICE\nOur directors are appointed to hold office until the next annual meeting of our stockholders or until their respective successor is elected and qualified, or until a director resigns or is removed in accordance with the provisions of the Nevada Revised Statues. Our Board of Directors hold office until removed by the Board or until their resignation appoints our officer. Item 11. Executive Compensation\nThe particulars of the compensation paid to the following persons:\n(a)\nour principal executive officer;\n(b)\neach of our two most highly compensated executive officers who were serving as executive officers at the end of the years ended August 31, 2022 and 2021; and\n(c)\nup to two additional individuals for whom disclosure would have been provided under (b) but for the fact that the individual was not serving as our executive officer at the end of the years ended August 31, 2022 and 2021, who we will collectively refer to as the named executive officers of our company, are set out in the following summary compensation table, except that no disclosure is provided for any named executive officer, other than our principal executive officers, whose total compensation did not exceed $100,000 for the respective fiscal year:\nSUMMARY COMPENSATION TABLE\nName and Principal Position\nYear\nSalary\n($)\nBonus\n($)\nStock Awards ($)\nOption Awards\n($)\nNon-Equity Incentive Plan Compensa-tion\n($)\nChange in Pension\nValue and Nonqualified Deferred Compensa-tion Earnings\n($)\nAll\nOther Compensa-tion\n($)\nTotal\n($)\nYap Kit Chuan\n92,902\n-\n-\n-\n-\n-\n-\n92,902\nPresident, CEO, CFO, Treasurer, Secretary and Director\n92,902\n-\n-\n-\n-\n-\n-\n92,902\nHuang Minxi\n-\n-\n-\n-\n-\n-\n-\n-\nDirector\n-\n-\n-\n-\n-\n-\n-\n-\nMr. Yap Kit Chuan is drawing a monthly salary of RM30,000 (approximately $6,897) with contributions to Employee Provident Fund and Social Security (in accordance to Malaysian labor law) of RM3,676.95 (approximately $845), hence a total monthly salary compensation of RM 33,676.95 (approximately $7,742) effective from December 2016.\nThere are no annuity, pension or retirement benefits proposed to be paid to the officer or director or employees in the event of retirement at normal retirement date pursuant to any presently existing plan provided or contributed to by the company or any of its subsidiaries, if any. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe following table sets forth certain information concerning the number of our common stock shares of owned beneficially as of December 13, 2021 by: (i) each person (including any group) who is known to us to own more than five percent (5%) of any class of our voting securities, (ii) our director, and or (iii) our officer. Unless otherwise indicated, the stockholder listed possesses sole voting and investment power with respect to the shares shown.\nTitle of\nClass\nName and Address\nof Beneficial Owner\nAffiliation\nAmount and\nNature\nof Beneficial\nOwnership\nPercentage\nCommon Stock\nYap Kit Chuan of B-18-2 Blok B, East Lake, Seksyen 3, Taman Serdang Perdana, 43300 Seri Kembangan, Selangor Darul Ehsan, Malaysia.\nDirector\n48,368,127\n(Direct)\n56.07\n%\nCommon Stock\nHuang Minxi of Room 4 Building No. 27, Ren Huang Shan Zhuang, Feng Huang Street, Wuxing District, Huzhou City, China\nDirector\n1,295,500\n(Direct)\n1.50\n%\nA beneficial owner of a security includes any person who, directly or indirectly, through any contract, arrangement, understanding, relationship, or otherwise has or shares: (i) voting power, which includes the power to vote, or to direct the voting of shares; and (ii) investment power, which includes the power to dispose or direct the disposition of shares. Certain shares may be deemed to be beneficially owned by more than one person (if, for example, persons share the power to vote or the power to dispose of the shares). In addition, shares are deemed to be beneficially owned by a person if the person has the right to acquire the shares (for example, upon exercise of an option) within 60 days of the date as of which the information is provided. In computing the percentage ownership of any person, the amount of shares outstanding is deemed to include the amount of shares beneficially owned by such person (and only such person) by reason of these acquisition rights. As of December 13, 2022, there were 86,264,000 shares of our Common Stock issued and outstanding. Item 13. Certain Relationships and Related Transactions and Director Independence\nExcept as described below, during the year ended August 31, 2022, we did not enter into any transactions with our Executive Officer or Directors, or persons nominated for these positions, beneficial owners of 5% or more of our common stock, or family members of these persons wherein the amount involved in the transaction or a series of similar transactions exceeded the value of 1% of the average of our total assets for the last three fiscal years. Item 14. Principal Accountant Fees and Services\nThe following table sets forth the aggregate fees billed to the Company by its independent registered public accounting firm, for the fiscal years indicated.\nAccounting Fees & Services\nFor Year\nEnded\nAugust 31,\nFor Year\nEnded\nAugust 31,\nAudit fees\n$ 11,400\n$ 10,900\nAudit related fees\n-\n-\nTax fee\n-\n-\nAll other fess - acquisition advice\n-\n-\nTotal\n$ 11,400\n$ 10,900\nAll of the professional services rendered by principal accountants for the review and audit of our financial statements that are normally provided by the accountant in connection with statutory and regulatory filings or engagements for last three fiscal years were approved by our Board of Directors.\nPART IV Item 15. Exhibits\nThe following exhibits are included as part of this report by reference:\nExhibit\nNo.\nTitle\nForm\nExhibit\nFiling Date\n3.1\nArticles of Incorporation\nS-1\n3.1\n11/27/2015\n3.3\nBylaws\nS-1\n3.2\n11/27/2015\n3.4\nCertificate of Amendment to Articles of Incorporation, effective as of September 19, 2017\n8-K\n3.1\n09/22/2017\n10.1\nStock purchase agreement\n10-Q\n10.1\n04/23/2019\n31.1*\nCertification Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n32.1**\nCertification Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n101*\nInline XBRL Document Set for the consolidated financial statements and accompanying notes in Part II, Item 8, Financial Statements and Supplementary Data of this Annual Report on Form 10-K.\n104*\nInline XBRL for the cover page of this Annual Report on Form 10-K, included in the Exhibit 101 Inline XBRL Document Set.\n___________\n*\nFiled herewith\n**\nFurnished herewith\n_______\n*\nFiled herewith.\n**\nAs filed in the Registrants Registration Statement on Form S-1 (File No. 333-208237)\nItem 16. Form 10-K Summary\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this Report to be signed on its behalf by the undersigned, thereunto duly authorized.\nFELLAZO CORP.\n/s/ Yap Kit Chuan\nDate: December 13, 2022\nYAP KIT CHUAN\nPresident, CEO, CFO, Treasurer, Secretary and Chairman of the Board of Directors of the Company\n(Principal Executive Officer, Principal Financial Officer and Principal Accounting Officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\n/s/ Yap Kit Chuan\nDate: December 13, 2022\nYAP KIT CHUAN\nPresident, CEO, CFO, Treasurer, Secretary and Chairman of the Board of Directors of the Company\n(Principal Executive Officer, Principal Financial Officer and Principal Accounting Officer)\nDate: December 13, 2022\n/s/ Huang Minxi\nHUANG MINXI\nDirector"
}