{
    "cik": "1668523",
    "company": "GSG GROUP INC.",
    "filing_type": "10-K",
    "filing_date": "2022-10-05",
    "period_of_report": "2021-12-31",
    "sic": "2750",
    "state_of_inc": null,
    "state_location": "P7",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1668523/0001640334-22-002167-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1668523/000164033422002167/gsgg_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1668523/0001640334-22-002167.txt",
    "filename": "1668523_10K_2021_0001640334-22-002167.htm",
    "content": "ITEM 1. BUSINESS\nGeneral Information\nGSG Group Inc. (the Company, we, us or our) has been incorporated as Wike Corp. in the State of Nevada on November 11, 2014. Initially we were a development-stage company in the ornamental ribbons printing business. On April 6, 2017, we changed the business to consulting services for investors into the Asian real estate market and other growth industries. On September 15, 2017, the name change to GSG Group Inc. was approved by the Financial Industry Regulatory Authority (\"FINRA\") and the Company began discussions to add Medical Devices production and trading to its business portfolio. Since July 24th, 2020 the Company has its office at Haagwinde 20, 5262 KZ Vught, The Netherlands.\nOn August 28, 2019 Company entered into an Asset Assignment Agreement (as amended on July 12, 2020 and extended on December 28, 2021) with Prejex Holding GmbH in Germany, under which it acquires certain brand rights (brand registration and the Prejex website, currently held in trust for Company by related party Medical Consult Europe B.V.) and the right to use certain competences regarding production of needle free injection devices. In return it promises to invest the total amount of US$ 1,000,000.00 within 24 months from the date of the Agreement into producing such needle free injection devices and making Prejex Holding GmbH the exclusive production manager worldwide with a remuneration to Prejex Holding GmbH of 5% of all worldwide turnover as relates to the assigned Business Assets as defined by the Agreement. Under the amendment dated July 12, 2020, Company agreed to induce its shareholder Mr. Xin Chen to cancel 19,000,000 of his shares against payment of US$ 150,000.00 by Prejex Holding GmbH to Mr. Chen no later than June 30, 2021. While Mr. Chen had his shares cancelled on November 06, 2020, the parties extended the deadline for Prejex´ payment by mutual consent to June 30, 2022.\nOn July 13, 2020, the shareholders of the Company in a majority vote appointed Mr. Frank Raymakers as new director, President and CEO, Mr. Maarten Stuut as new director and CFO, Mr. Alfred Kelly as director and Chief Operating Officers and Mr. Eric P. Ditkowsky as new director and Chief Sales Officer. Mr. Gim Hooi OOI was appointed as the new Chief Marketing Officer.\nOn April 14, 2021, our CFO Mr. Maarten Stuut was appointed also as CEO due to the sudden passing of Mr. Raymakers on April 11, 2021.\nOn December 28, 2021, all deadlines stipulated in the Asset Assignment Agreement have been extended until December 31, 2023, where necessary, by the Extension of Asset Assignment Agreement concluded between the parties on that date. The extension had become necessary due to the impact of Covid restrictions on the ability of the parties to execute their business plan within the timelines estimated before.\nDIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE.\nDirectors and Executive Officers\nThe following sets forth the name and position of each of our executive officers and directors as at the end of the reporting period:\nNAME\nAGE\nPOSITION\nMaarten Stuut\nDirector & CFO & temporary CEO\nAlfred Kelly\nDirector & COO\nEric P. Ditkowsky\nDirector & CSO\nGim Hooi OOI\nDirector & CMO\nMaarten Stuut\nMr. Maarten Stuut, age 61, - Vice President & CFO - also a founder & director of PREJEX GmbH, is a serial entrepreneur and investor with 30 years of business experience in telecommunications and medical devices. Maarten will work with Frank Raymakers to manage all European manufacturing, Quality Systems, and regulatory activities. Maarten owns several small companies and manages sales and growth of these businesses in Europe and the Middle East. One of his last endeavors was Simpel, a Netherlands Telco company he founded and later sold at some 40+m USD - Simpel is valued at around 100m USD today. Maarten is responsible for coordinating all financing matters for our Company as well as financial controlling of the PREJEX product line - from procurement and production to global delivery. He will also work with Frank to scale deal flow and sales in the European, Middle East and African regions and expand into other markets of interest. Mr. Stuut has temporarily also assumed the function of CEO on April 14, 2021 in response to the sudden passing of his predecessor, Mr. Frank Raymakers.\nAlfred Kelly\nMr. Alfred Kelly, age 56, - Chief Operating Officer - is a strategic and results driven business developer with over 20 years of accomplishments growing revenue, advancing market position, strengthening product portfolio, streamlining supply chain and expanding customer base within diverse competitive markets. His extensive international and domestic background in senior management, sales and marketing in medical devices, network communications, industrial and commercial markets will allow him to manage all our North American operations. In his career Mr. Kelly held senior management and C-Level positions with multiple organizations, e.g. Honeywell-Envitec (Germany), Plexus (USA) or HealthSTATS (Singapore). On his most recent project in France he generated and then managed customer accounts and business volume in excess of 10m USD.\nEric P. Ditkowsky\nMr. Eric P. Ditkowsky, age 64, - Chief Sales Officer - is a highly experienced leader with over 20 years in the medical and life sciences technology sector. He has developed relationships with several Fortune 100 companies such as Dell Healthcare, WebMD, Best Buy, PSS World Medical, Honeywell HomMed as well as with the Accountable Care Association of America (ACCA) and the United States Department of Veteran Affairs (VA), Healthcare Finance Management Association (HFMA), Medical Group Management Association (MGMA), to name a few. As our Chief Sales Officer (Americas) he brings his wealth of experience and network to the Company and will help to quickly implement our market entry and substantial market expansion through a growing number of global distributors, pharmacies, physicians, and directly online.\nGim Hooi OOI\nGim Hooi Ooi, age 41, - Chief Marketing Officer - had earlier been serving as a Senior Relationship Manager of Alliance Bank Malaysia Berhad since 2013. From 2012 to 2013, he served as an Account Relationship Manager at Hong Leong Bank Berhad. From 2009 to 2012, he served as a Team Leader at UOB (M) Bank Berhad. Mr. Ooi brings his extensive experience in banking, financial services and compliance procedures to the Company.\nProducts\nOriginally, we specialized mostly on ribbons printing. Since 2017 until late 2018 we stopped the printing business and focused on advising investors on the Asia real estate market, specifically in Cambodia. This is also how we decided in Q2/2019 to enter into discussions about production of medical devices in Cambodia.\nOn August 28, 2019 and July 12, 2020 we signed the Asset Assignment Agreement which stipulates the acquisition of certain brand and production rights from Prejex Holding GmbH in Germany, which allow us the production and distribution of certain needle free injection devices globally.\nAt the time of this document the Company is working with its partners in Germany on an updated version of its needle free injector device. With production capacities on standby, management has also begun the process of preparing update filings for re-admission with the FDA in the USA and, at the same time are in discussions with potential OEM partners for the product´s market roll-out in the Middle and Near East. The Company is determined to start building cash flows in the medical devices area as quickly as possible.\nMarket Overview\nOther than applying our network in Cambodia in real estate and private infrastructure to identify potential production sites, our most recent inclusion of the medical devices space with the needle free injection technology has led us to put more focus on a US market roll-out for the ready produced devices.\nAccording to Datamonitor Healthcare, 35% of global prescription sales for the top 50 pharmaceutical companies were attributed to injectable drugs, with sales growing at 43% from 2010 to 2018. The combination of the growing importance of injectable drugs, to the phobia caused by needles, the increase in self-administered or at home injections, and the rising cost associated with needle stick injuries, provides the dynamics for the accelerated growth of the needle-free or injection technology marketplace.\nThe global needle-free drug delivery devices market was valued at USD 10.9 billion by 2019, following a 2012-2019 compound annual growth rate (CAGR) of 14.6%.\nIn 2019, insulin delivery for diabetes was observed to be the leading application segment accounting for 31.0% of the total market already then. According to the World Health Organization (WHO), the total number of people diagnosed with diabetes was 177 million in 2000 and is expected to reach 300 million by 2025. Thus, the rise in prevalence of diabetes and increasing non-communicable diseases has been and is expected to continue to boost the growth of the needle-free drug delivery devices market globally.\nNorth America was observed to be the largest market for needle-free drug delivery devices and accounted for 43.1% of the total market in 2019. The market is mainly driven by high public awareness about novel drug delivery systems, government initiatives for the introduction of needle free drug delivery devices in community vaccination programs and key players domiciled in this region. Asia Pacific was observed to be one of the fastest growing markets with the highest CAGR of 16.3% during the period from 2013 to 2019. The factors attributed to the growth of the market are opportunities available with a wide range of undiscovered applications and untapped countries with high potential in this geography.\nAbout us\nGSG Group Inc. (GSGG) is a shell company currently looking to leverage its managements´ excellent network globally to initiate business activities in highly profitable geographical and industrial areas. At this point our focus is on establishing the production of needle free injection devices in locations in Europe and Asia and the sale of such devices first in the North American markets, to be followed shortly by sales globally thereafter.\nWe are working on marketing our products through our long built networks to all relevant business partners, industry leaders and decision makers in our target markets locally. We intend to increase our online presences and to utilize alternative marketing tools in the future to further increase our exposure and recognition of our products and brand with our target clients.\nWe believe that our marketing campaign shall attract many clients and develop a strong reputation of quality, diligent and efficient service and product provider. Hopefully, our clients will continue to readily recommend us to others.\nEmployees\nAs of December 31, 2021, the Company had no employees, other than our officers and directors.\nOffices\nThe phone number is +31 (623)-407-058. The office is located at Haagwinde 20, 5262 KZ Vught, The Netherlands, which is provided by our director free of charge.\nGovernment Regulation\nWe are required to comply with all regulations, rules and directives of governmental authorities and agencies applicable to the consulting business in any jurisdiction which we would conduct activities. We do not believe that regulation will have a material impact on the way we conduct our business.\nLegal Proceedings\nWe are not currently a party to any legal proceedings, and we are not aware of any pending or potential legal actions. ITEM 1A. RISK FACTORS\nNot applicable to smaller reporting companies. ITEM 1B. UNRESOLVED STAFF COMMENT\nNot applicable. ITEM 2. PROPERTIES.\nWe do not own any real estate or other properties. We currently have no investment policies as they pertain to real estate, real estate interests or real estate mortgages. ITEM 3. LEGAL PROCEEDINGS.\nWe know of no material, active or pending legal proceedings against our company, nor are we involved as a plaintiff in any material proceeding or pending litigation. There are no proceedings in which our director, officer or affiliates, or any registered or beneficial shareholder is an adverse party or has a material interest adverse to our interest. ITEM 4. MINE SAFETY DISCLOSURES.\nNone.\nPART II ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES.\nMarket for Securities\nOur common stock is listed on the Over-the Counter Bulletin Board. There has been no active trading of our common stock.\nHolders of our Common Stock\nAs of December 31, 2021 and 2020 there were 50 and 50 registered stockholders holding 30,125,000 (2020: 30,125,000) shares in aggregate of our issued and outstanding common stock. As of the date of this document, there were 50 registered stockholders holding 30,125,000 shares in aggregate of our issued and outstanding common stock.\nDividend Policy\nThere are no restrictions in our articles of incorporation or bylaws that prevent us from declaring dividends. The Nevada Revised Statutes, however, do prohibit us from declaring dividends where, after giving effect to the distribution of the dividend:\n1.\nWe would not be able to pay our debts as they become due in the usual course of business; or\n2.\nOur total assets would be less than the sum of our total liabilities plus the amount that would be needed to satisfy the rights of shareholders who have preferential rights superior to those receiving the distribution.\nWe have not declared any dividends and we do not, at this point in time, plan to declare any dividends in the foreseeable future.\nRecent Sales of Unregistered Securities\nThere were no recent sales of unregistered securities. As of December 31, 2021, there were no outstanding stock options or warrants.\nPurchases of Equity Securities by the Issuer and Affiliated Purchasers\nWe did not purchase any of our shares of common stock or other securities during our fiscal years ended December 31, 2021 and December 31, 2020, respectively.\nSecurities Authorized for Issuance under Equity Compensation Plans\nWe do not have any equity compensation plans. ITEM 6. SELECTED FINANCIAL DATA.\nNot Applicable. ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATION.\nResults of Operations\nWe recorded no revenues for the year ended December 31, 2021 (year ended December 31, 2020: $0) and incurred no cost of goods sold for the year ended December 31, 2021 (year ended December 31, 2020: $0). Respectively, there was no gross profit or loss recorded for the year ended December 31, 2021 (from a gross profit of $0 for the year ended December 31, 2020).\nThe operating expenses comprised general and administrative expenses of $11,376 for the recent period (compared to $14,966 for the year ended December 31, 2020), a decrease of 32%. This decrease was mainly caused by a decrease of professional fees from the transfer agent due to no billable transfer incidents.\nThe net loss for the year ended December 31, 2021 was $11,376 (year ended December 31, 2020: $14,966), a decrease of 32%, caused by decreased operating expenses, see above.\nOur total assets at December 31, 2021 were $200 (December 31, 2020: $200) which was all cash (December 31, 2020: $200)\nOur total current liabilities at December 31, 2021 were $98,225 which comprised accrued liabilities of $33,619 and payables to related parties of $64,606. The current liabilities at December 31, 2020 were $86,849 which mainly comprised accrued liabilities of $22,243 and other payables to related parties of $64,606..\nWe currently anticipate our operating expenses (being legal and profession fees, IT cost and further website and software development and testing, marketing and advertising, and other expenses) over the next 12 months will be approximately $50,000.\nOn December 31, 2021 the Company had authorized 75,000,000 (December 31, 2020: 75,000,000) shares of common stock with a par value of $0.001 per share.\nAs of December 31, 2021, the Company had 30,125,000 (December 31, 2020: 30,125,000) shares of common stock issued and outstanding and there were no outstanding stock options or warrants.\nFor the year ended December 31, 2021 we reported a net loss of $11,376 and an accumulated deficit of $146,411. At December 31, 2021 we had cash on hand of $200. The report of our independent registered public accounting firm on our financial statements for the year ended December 31, 2021 contains an explanatory paragraph regarding our ability to continue as a going concern based upon our minimal cash and no source of revenues which are insufficient to cover our operating costs. These factors, among others, raise substantial doubt about our ability to continue as a going concern. Our financial statements do not include any adjustments that might result from the outcome of this uncertainty. There are no assurances we will be successful in our efforts to raise capital, develop a source of revenues, report profitable operations or to continue as a going concern, in which event investors would lose their entire investment in our company.\nLiquidity and Capital Resources\nAt December 31, 2021, we had $200 in cash and there were outstanding liabilities of $98,225 (cash of $200 and liabilities of $86,849 on December 31, 2020, respectively). There was $1,266 used by operations in 2021 ($20,165 net cash used through operating activities in 2020, respectively) and $1,266 provided through financing activities in 2021 (2020: $20,166). This resulted in no changes in net cash in 2021 (no changes in 2020, respectively).\nOur two major shareholders, Decimus Beheer B.V. and Medical Consult Europe B.V. have, through their directors, verbally agreed to continue to loan the company funds for operating expenses in a limited scenario, but have entered no legal obligation to do so.\nThere is limited historical financial information about us upon which to base an evaluation of our performance. We have meaningfully commenced business operations based upon the amount of revenue we have been able to generate. We are in start-up stage operations. We cannot guarantee we will be successful in our business operations. Our business is subject to risks inherent in the establishment of a new business enterprise, including limited capital resources and possible cost overruns due to price and cost increases in services and products.\nWe have no assurance that future financing will be available to us on acceptable terms. If financing is not available on satisfactory terms, we may be unable to continue, develop or expand our operations. Equity financing could result in additional dilution to existing shareholders.\nOff-Balance Sheet Arrangements\nWe do not have any off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources that is material to investors, except as may be disclosed in the section Recent Events.\nSummary of significant accounting policies:\nRefer to Note 2 of the financial statements in ITEM 8 below. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURE ABOUT MARKET RISK\nDisclosure not required for a smaller reporting Company. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA.\nReport of Independent Registered Public Accounting Firm\nTo the Shareholders and Board of Directors of GSG Group Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of GSG Group Inc. (the Company) as of December 31, 2021 and 2020, and the related statements of operations, changes in stockholders deficit, and cash flows for the years ended December 31, 2021 and 2020, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2021 and 2020, and the results of its operations and its cash flows for the years ended December 31, 2021 and 2020, in conformity with accounting principles generally accepted in the United States of America.\nGoing Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 2 to the financial statements, the Company has suffered recurring losses from operations and has a net capital deficiency that raises substantial doubt about its ability to continue as a going concern. Management's plans in regard to these matters are also described in Note 2. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (\"PCAOB\") and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB . Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Company's internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\n/s/ JTC Fair Song CPA Firm\nJTC Fair Song CPA Firm\nWe have served as the Companys auditor since 2019.\nShenzhen, China\nOctober 3, 2022\n(PCAOB ID 2747)\nGSG GROUP INC.\nBALANCE SHEETS\nDecember 31\nDecember 31\nASSETS\nCURRENT ASSETS\nCash\n$ 200\n$ 200\nTOTAL ASSETS\n$ 200\n$ 200\nLIABILITIES AND STOCKHOLDERS' DEFICIT\nLIABILITIES\nCurrent Liabilities:\nAccrued liabilities and other payables\n$ 33,619\n$ 22,243\nOther payables - related parties\n64,606\n64,606\nTOTAL LIABILITIES\n98,225\n86,849\nSTOCKHOLDERS' DEFICIT\nCommon stock: authorized 75,000,000; $0.001 par value; 30,125,000 shares issued and outstanding at December 31, 2021 and 49,125,000 on December 31, 2020\n30,125\n30,125\nAdditional Paid in Capital\n18,261\n18,261\nAccumulated deficit\n(146,411 )\n(135,035 )\nTotal Stockholders' deficits\n(98,025 )\n(86,649 )\n$ 200\n$ 200\nThe accompanying notes are an integral part of these financial statements\nGSG GROUP INC.\nSTATEMENTS OF OPERATIONS\nYear Ended\nYear Ended\nDecember 31, 2021\nDecember 31, 2020\nRevenue\n$ -\n$ -\nCost of Goods Sold\nPurchases\n-\n-\nGross Profit (Loss)\n-\n-\nOperating Expenses\nGeneral and administrative\n(11,376 )\n(14,966 )\nTotal Expenses\n(11,376 )\n(14,966 )\nNet loss before income tax provision\n(11,376 )\n(14,966 )\nProvision for income tax\n-\n-\nNet loss for the period\n$ (11,376 )\n$ (14,966 )\nNet earnings (loss) per share\nBasic and diluted\n$ (0.00 )\n$ (0.00 )\nWeighted average number of shares outstanding\nBasic and diluted\n30,125,000\n30,125,000\nThe accompanying notes are an integral part of these financial statements\nGSG GROUP INC.\nSTATEMENTS OF CHANGES IN SHAREHOLDERS' DEFICIT\nCommon Stock\nTotal\nNumber of\nAdditional\nAccumulated\nShareholders'\nShares\nPar Value\nPaid in Capital\nDeficit\nEquity/(Deficit)\nBalance, December 31, 2019\n49,125,000\n$ 49,125\n$ 18,261\n$ (139,069 )\n$ (71,683 )\nNet loss for the year\n-\n-\n-\n(14,966 )\n(14,966 )\n19m shares cancelled on Nov 6, 2020\n(19,000,000 )\n$ (19,000 )\n$ -\n$ 19,000\n$ -\nBalance, December 31, 2020\n30,125,000\n$ 30,125\n$ 18,261\n$ (135,035 )\n$ (86,649 )\nNet loss for the year\n-\n-\n-\n(11,376 )\n(11,376 )\nBalance, December 31, 2021\n30,125,000\n$ 30,125\n$ 18,261\n$ (146,411 )\n$ (98,025 )\nThe accompanying notes are an integral part of these financial statements\nGSG GROUP INC.\nSTATEMENTS OF CASH FLOWS\nYear Ended\nYear Ended\nDecember 31, 2021\nDecember 31, 2020\nOperating activities:\nNet loss\n$ (11,376 )\n$ (14,966 )\nAccrued expenses\n10,110\n(5,200 )\nNet cash provided by operating activities\n(1,266 )\n(20,166 )\nCash flows from financing activities\nProceeds from sale of common stock\n-\n-\nProceeds from related party loans\n1,266\n20,165\nRepayments to related party\nNet cash provided by financing activities\n1,266\n20,165\nNet increase in cash\n-\n-\nCash, beginning of period\n$ 200\nCash, end of period\nThe accompanying notes are an integral part of these financial statements\nNote 1: Organization and Basis of Presentation\nGSG Group Inc. (the Company) is a for profit corporation established under the corporate laws of the State of Nevada on November 11, 2014.\nThe financial statements of the Company have been prepared in accordance with generally accepted accounting principles in the United States of America and are presented in US dollars. The Financial Statements and related disclosures as of December 31, 2021 are audited pursuant to the rules and regulations of the United States Securities and Exchange Commission (SEC). Unless the context otherwise requires, all references to GSG, we, us, our or the Company are to GSG Group Inc.\nNote 2: Significant Accounting Policies and Recent Accounting Pronouncements\nBasis of Presentation\nThe accompanying financial statements of the Company for the years ended December 31, 2021 and 2020 have been prepared in accordance with accounting principles generally accepted in the United States of America (U.S. GAAP).\nGoing Concern\nThe accompanying financial statements and notes have been prepared assuming that the Company will continue as a going concern.\nThe Company had limited operations during the year ended December 31, 2021 with a net loss of $11,376. There is no guarantee that the Company will begin to generate revenues. The report of our independent registered public accounting firm on our financial statements for the year ended December 31, 2021 contains an explanatory paragraph regarding our ability to continue as a going concern based upon our minimal cash and no source of revenues which are insufficient to cover our operating costs. These factors, among others, raise substantial doubt about our ability to continue as a going concern.\nManagement anticipates that the Company will be dependent, for the near future, on borrowings from related party to fund operating expenses. In light of managements efforts, there are no assurances that the Company will be successful in any of its endeavors or become financially viable and continue as a going concern. These financial statements do not include any adjustments relating to the recoverability and classification of recorded asset amounts, or amounts and classification of liabilities that might result from this uncertainty.\nUse of Estimates and Assumptions\nThe preparation of financial statements in conformity with generally accepted accounting principles requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the period. Actual results could differ from those estimates.\nDue to the limited level of operations, the Company has not had to make material assumptions or estimates other than the assumption that the Company is a going concern.\nCash and Cash Equivalents\nThe Company considers all highly liquid investments with an original maturity of three months or less when purchased to be cash equivalents.\nFair Value of Financial Instruments\nASC 825, Disclosures about Fair Value of Financial Instruments, requires disclosure of fair value information about financial instruments. ASC 820, Fair Value Measurements defines fair value, establishes a framework for measuring fair value in generally accepted accounting principles, and expands disclosures about fair value measurements. Fair value estimates discussed herein are based upon certain market assumptions and pertinent information available to management as of December 31, 2021.\nAuthoritative literature provides a fair value hierarchy that requires an entity to maximize the use of observable inputs and minimize the use of unobservable inputs when measuring fair value. A financial instruments categorization within the fair value hierarchy is based upon the lowest level of input that is significant to the fair value measurement as follows:\nLevel 1 - Quoted market prices available in active markets for identical assets or liabilities that the Company has the ability to access at the measurement date.\nLevel 2 - Inputs include quoted prices for similar assets and liabilities in active markets, quoted prices for identical or similar assets or liabilities in markets that are not active, inputs other than quoted prices that are observable for the asset or liability (e.g., interest rates, yield curves, etc.), and inputs that are derived principally from or corroborated by observable market data by correlation or other means (market corroborated inputs).\nLevel 3 - Unobservable inputs that reflect our assumptions about the assumptions that market participants would use in pricing the asset or liability.\nThe respective carrying values of certain on-balance-sheet financial instruments approximate their fair values. These financial instruments include cash, accrued liabilities and notes payable. Fair values were assumed to approximate carrying values for these financial instruments since they are short term in nature and their carrying amounts approximate fair value.\nBasic and Diluted Loss per Share\nThe Company computes earnings (loss) per share in accordance with ASC 260-10-45 Earnings per Share, which requires presentation of both basic and diluted earnings per share on the face of the statement of operations. Basic earnings (loss) per share is computed by dividing net earnings (loss) available to common stockholders by the weighted average number of outstanding common shares during the period. Diluted earnings (loss) per share gives effect to all dilutive potential common shares outstanding during the period. Dilutive earnings (loss) per share excludes all potential common shares if their effect is anti-dilutive. The Company has no potential dilutive instruments, and therefore, basic and diluted earnings (loss) per share are equal.\nRevenue Recognition\nIn accordance with ASC 605 Revenue Recognition, the Company recognizes revenue when the following four criteria are met: (1) delivery has occurred or services rendered; (2) persuasive evidence of an arrangement exists; (3) there are no continuing obligations to the customer; and (4) the collection of related accounts receivable is probable.\nRevenue is measured at the fair value of the consideration received or receivable, net of discounts and taxes applicable to the revenue. Revenue is recognized when the product has been prepaid by the customer, shipped from either our office or one of our vendors and the product has been delivered to, or picked up by, the customer.\nThe Company has had no revenue for the reporting year ended December 31, 2021.\nIncome Taxes\nWe use the asset and liability method of accounting for income taxes in accordance with ASC Topic 740, Income Taxes. Under this method, income tax expense is recognized for the amount of: (i) taxes payable or refundable for the current year and (ii) deferred tax consequences of temporary differences resulting from matters that have been recognized in an entitys financial statements or tax returns. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in the results of operations in the period that includes the enactment date. A valuation allowance is provided to reduce the deferred tax assets reported if based on the weight of the available positive and negative evidence, it is more likely than not some portion or all of the deferred tax assets will not be realized.\nASC Topic 740.10.30 clarifies the accounting for uncertainty in income taxes recognized in an enterprises financial statements and prescribes a recognition threshold and measurement attribute for the financial statement recognition and measurement of a tax position taken or expected to be taken in a tax return. ASC Topic 740.10.40 provides guidance on de-recognition, classification, interest and penalties, accounting in interim periods, disclosure, and transition. We have no material uncertain tax positions for any of the reporting periods presented.\nThe Company has evaluated Staff Accounting Bulletin No. 118 regarding the impact of the decreased tax rates of the Tax Cuts & Jobs Act. Deferred tax assets and liabilities are adjusted for the effects of changes in tax laws and rates on the date of enactment. The U.S. federal income tax rate of 21% is being used due to tax law enacted in 2018.\nRecent Accounting Pronouncements\nThere are no recent accounting pronouncements that impact the Company´s operations.\nReclassification\nCertain comparative figures have been reclassified so as to conform to the current years presentation. The reclassification has had no effect on the reported results of operations or accumulated deficit.\nNote 3: Capital Stock\nAt December 31, 2021, we recorded $30,125 as equity and $18,261 paid in excess of par, represented in 30,125,000 shares issued and outstanding ($49,125 as equity and 18,261 paid in excess of par, represented in 49,125,000 shares issued and outstanding, in 2020 respectively).\nAs of December 31, 2021 and 2020, the Company had authorized shares of common stock of 75,000,000 shares with a par value of $0.001 per share.\nAs of December 31, 2021 and 2020, there were no outstanding stock options or warrants.\nNote 4: Income Taxes\nDeferred taxes are provided on a liability method whereby deferred tax assets are recognized for deductible temporary differences and operating loss and tax credit carry forwards and deferred tax liabilities are recognized for taxable temporary differences. Temporary differences are the differences between the reported amounts of assets and liabilities and their tax bases. Deferred tax assets are reduced by a valuation allowance when, in the opinion of management, it is more likely than not that some portion or all of the deferred tax assets will not be realized.\nOn December 22, 2017, the US Congress enacted the Tax Cuts and Jobs Act (Tax Reform Legislation), which made significant changes to US federal income tax law including a reduction in the corporate tax rate to 21% for tax years beginning with 2018. These changes will impact the changes in the valuation allowance, components of the tax rate reconciliation and realization of loss carryforwards.\nThe Company did have an income tax provision or benefit for the year ended December 31, 2021 and 2020. The Company has incurred losses and therefore has provided a full valuation against net deferred tax assets as December 31, 2021 and 2020.\nThe significant components of deferred tax assets and liabilities are as follows:\nYear\nEnded\nYear\nEnded\nDeferred tax assets\n12/31/2021\n12/31/2020\nNet operating losses\n$ (11,376 )\n$ (14,966 )\nDeferred tax liability\nNet deferred tax assets\n$ 11,376\n$ 14,966\nLess: valuation allowance\n$ (11,376 )\n$ (14,966 )\nDeferred tax asset - net valuation allowance\n-\n-\nNote 5: Related Party Transactions\nThe director of the Company provided office space and services free of charge. During the year ended December 31, 2021 our CEO, Mr. Maarten Stuut paid $0 against expenses on behalf of the Company and had, during that same period received $0 repaid from the Company. As of December 31, 2021, the Company owed $40,323 to Mr. OOI under a related party loan ($40,323 on December 31, 2020, respectively), and $24,283 to Decimus Beheer B.V., one of our major shareholders ($24,283 on December 31, 2020, respectively), both of which loans are non-interest bearing, unsecured and due on demand.\nNote 6: Commitments and Contingencies\nThe Company did not have any commitments or contingencies as at December 31, 2021 and December 31, 2020.\nNote 7: Subsequent Events\nIn accordance with ASC 855-16, management has performed an evaluation of subsequent events through the date that the financial statements were available to be issued and has determined that it does not have any material subsequent events to disclose.\nNote 8: Re-classification of comparative figures\nDuring the preparation of our annual report on Form 10-K for the fiscal year of 2021, the Company has discovered an error in the comparative figures relating to the classification of balances between Accrued Liabilities and Other Payables - Related Parties as of December 31, 2020. The Company has amended its balance sheet as of December 31, 2020 to decrease Other Payables - Related Parties by USD 11,999.00 and to increase Accrued Liabilities by the same amount. This re-classification has no significant financial impact on the financial position and financial performance of the Company for the fiscal year of 2020.\nThe management of the Company, including the CFO of the Company, have come to the conclusion and made the decision that this re-classification has fairly and properly been accounted for in this document. Because consistency of presentation of current year figures has been achieved by this re-classification, management concluded that no re-statement is required nor any other publication of the fact or the related figures other than stating the re-classification in this document. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE.\nNothing to report. ITEM 9A. CONTROLS AND PROCEDURES.\nEvaluation of Disclosure Controls and Procedures\nThe Chief Executive Officer, Directors, and Chief Financial Officer have evaluated the effectiveness of the Company's disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) under the Exchange Act) as of the fiscal period ending December 31, 2021 covered by this Annual Report on Form 10-K. Based upon such evaluation, the Chief Executive Officer, Directors, and Chief Financial Officer ha d concluded that, as of the end of such period, the Company's disclosure controls and procedures were effective as required under Rules 13a-15(e) and 15d-15(e) under the Exchange Act. This conclusion by the Company's Chief Executive Officer, Directors, and Chief Financial Officer does not relate to reporting periods after December 31, 2021.\nManagement's Report on Internal Control Over Financial Reporting\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) of the Exchange Act) of the Company. Internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with accounting principles generally accepted in the United States of America.\nThe Company's internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with accounting principles generally accepted in the United States of America, and that receipts and expenditures of the Company are being made only in accordance with authorizations of management and directors of the Company; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of the Company's assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nManagement, under the supervision of the Company's Chief Executive Officer, Directors, and Chief Financial Officer conducted an evaluation of the effectiveness of internal control over financial reporting based on the framework in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on this evaluation, management concluded that the Company's internal control over financial reporting was effective as of December 31, 2021 under the criteria set forth in the in Internal Control-Integrated Framework.\nA material weakness is a deficiency, or combination of deficiencies, in internal control over financial reporting such that there is a reasonable possibility that a material misstatement of the Company's annual or interim financial statements will not be prevented or detected on a timely basis. Management has determined that material weaknesses did not exist.\nThis annual report does not include an attestation report of the Company's registered public accounting firm regarding internal control over financial reporting. Management's report was not subject to attestation by our registered public accounting firm pursuant to temporary rules of the SEC that permit us to provide only management's report in this Annual Report on Form 10-K.\nChanges in Internal Control over Financial Reporting\nThere were no significant changes in the Company's internal controls, or other factors, that could significantly affect the Company's controls subsequent to the date of the evaluations performed by the executive officers of the Company. No deficiencies or material weaknesses were found that would require corrective action. ITEM 9B. OTHER INFORMATION.\nNone.\nPart III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE.\nThe following sets forth the name and position of each of our executive officers and directors as of the end of the reporting period.\nNAME\nAGE\nPOSITION\nMaarten Stuut\nDirector & CFO\nAlfred Kelly\nDirector & COO\nEric P. Ditkowsky\nDirector & CSO\nGim Hooi OOI\nDirector & CMO ITEM 11. EXECUTIVE COMPENSATION.\nThe directors received no compensation during the reporting period and no compensation claims were accrued. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS.\nThe following table sets forth certain information concerning the number of shares of our common stock owned beneficially as of December 31, 2021 by: (i) each person (including any group) known to us to own more than five percent (5%) of any class of our voting securities, (ii) our director, and or (iii) our officer. Unless otherwise indicated, the stockholder listed possesses sole voting and investment power with respect to the shares shown.\nTitle of Class\nName and Address of\nBeneficial Owner\nAmount and Nature of\nBeneficial Ownership\nPercentage\nCommon Stock\nDecimus Beheer B.V.\nHaagwinde 20\n5262 KZ Vught, The Netherlands\n8,523,625 shares\n28,29%\nCommon Stock\nMedical Consult Europe B.V.\nHaagwinde 20\n5262 KZ Vught, The Netherlands\n9,185,473 shares\n30,49%\n(1) A beneficial owner of a security includes any person who, directly or indirectly, through any contract, arrangement, understanding, relationship, or otherwise has or shares: (i) voting power, which includes the power to vote, or to direct the voting of shares; and (ii) investment power, which includes the power to dispose or direct the disposition of shares. Certain shares may be deemed to be beneficially owned by more than one person (if, for example, persons share the power to vote or the power to dispose of the shares). In addition, shares are deemed to be beneficially owned by a person if the person has the right to acquire the shares (for example, upon exercise of an option) within 60 days of the date as of which the information is provided. In computing the percentage ownership of any person, the amount of shares outstanding is deemed to include the amount of shares beneficially owned by such person (and only such person) by reason of these acquisition rights. As of December 31, 2021, there were 30,125,000 shares of our common stock issued and outstanding. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE.\nThe successors and heirs of our former CEO, Mr. Frank Raymakers, provided office space free of charge. During the year ended December 31, 2021 our CEO, Mr. Maarten Stuut paid $0 in expenses on behalf of the Company and received $0 repaid (Mr. Stuut had, in total, paid $0 in expenses on behalf of the Company and received $0 repaid in 2020 respectively). As of December 31, 2021 and 2020, the Company owed $40,323 and $40,323 to Mr. OOI, our former CEO under a related party loan, which is non-interest bearing, unsecured and due on demand.\nMr. Frank Raymakers, our former President & CEO was also the owner of Medical Consult Europe B.V., one of our major shareholders. Since the change of operating address on July 24, 2021, Mr. Frank Raymakers provides office space at the Haagwinde 20 offices free of charge. His successors and heirs have confirmed to continue providing office space until futher notice.\nMr. Maarten Stuut, currently one of our directors & CFO/ CEO is also the owner of Decimus Beheer B.V., one of our major shareholders. ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nDuring the year ended December 31, 2021，the total audit fees billed was $10,000, for audit-related services was $0, for tax services was $0 and for all other services was $0.\nDuring the year ended December 31, 2020, the total audit fees billed was $10,000, for audit-related services was $0, for tax services was $0 and for all other services was $0.\nAudit fees are charged by the auditor for providing its audit report. Fees for audit-related services might be charged by lawyers or valuers providing third party expertise or opinions required to prepare or provide the audit report\nFees for tax services might be charged by accountants or tax advisors for providing services that relate to tax matters like tax calculations, tax advice or tax filings.\nFees for other services might be charged by any other service provider for providing any other service that might be of interest to the company.\nPart IV\nITEM 14. EXHIBITS, FINANCIAL STATEMENT SCHEDULES.\nThe following exhibits are included with this annual report:\nExhibit\nNumber\nDescription\n31.1*\nCertification of Chief Executive Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n31.2*\nCertification of Chief Financial Officer pursuant Section 906 Certifications under Sarbanes-Oxley Act of 2002\n32.1*\nCertification of Chief Executive Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n32.2*\nCertification of Chief Financial Officer pursuant Section 906 Certifications under Sarbanes-Oxley Act of 2002\n101*\nInteractive data files pursuant to Rule 405 of Regulation S-T\n* Filed herewith\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nGSG Group Inc.\nRegistrant\nDate: October 03, 2022\nBy:\n/s/ Maarten Stuut\nMaarten Stuut\n(Chief Executive Officer)\nGSG Group Inc.\nRegistrant\nDate: October 03, 2022\nBy:\n/s/ Maarten Stuut\nMaarten Stuut\n(Chief Financial Officer)"
}