{
    "cik": "1676852",
    "company": "OMNIA WELLNESS INC.",
    "filing_type": "10-K",
    "filing_date": "2022-10-17",
    "period_of_report": "2022-03-31",
    "sic": "3841",
    "state_of_inc": "NV",
    "state_location": "NY",
    "fiscal_year_end": "0331",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1676852/0001493152-22-028595-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1676852/000149315222028595/form10-k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1676852/0001493152-22-028595.txt",
    "filename": "1676852_10K_2022_0001493152-22-028595.htm",
    "content": "Item 1. Business\nCorporate History and Background\nThe Company incorporated as a Nevada corporation on March 2, 2016 by the filing of articles of incorporation with the Secretary of State of the State of Nevada under the name Glolex, Inc.\nOn June 25, 2019, Maksim Charniak, the Companys then sole executive officer and director and the owner of 3,000,000 shares (pre-stock split) of the Companys common stock, sold all of his shares of common stock of the Company to Amer Samad, resulting in a change of control of the Company. As part of that transaction, Mr. Charniak resigned from all of his officer and director positions, and Mr. Samad was appointed as the Chief Executive Officer, President, Chief Financial Officer and Secretary of the Company, and was appointed to the Board of Directors of the Company. Mr. Samad also purchased 1,167,937 shares (pre-stock split) of the Companys common stock in a series of private transactions, resulting in Mr. Samad owning 4,167,937 shares (pre-stock split) of the Companys common stock, or approximately 95.6% of the issued and outstanding common stock of the Company.\nOn March 5, 2020, the Company filed Amended and Restated Articles of Incorporation with the Secretary of State of the State of Nevada to, among other things, (i) increase the Companys authorized shares of common stock from 75,000,000 to 100,000,000, (ii) create and authorize 10,000,000 shares of blank check preferred stock, and (iii) effect a 12.6374:1 forward stock split of the common stock. In addition, on March 16, 2020, the Company filed a Certificate of Amendment to its Amended and Restated Articles of Incorporation with the Secretary of State of the State of Nevada to change the name of the Company from Glolex Inc. to Omnia Wellness Inc. On April 15, 2020, the stock of the Company began trading on the OTC Pink market under the symbol OMWS.\nOn April 17, 2020, we entered into a Share Exchange and Reorganization Agreement (the Exchange Agreement) with Omnia Wellness Corporation (formerly known as Bed Therapies Inc.), a Texas corporation (Omnia Corp.), and the beneficial stockholders of Omnia Corp. to acquire 100% of the issued and outstanding shares of capital stock of Omnia Corp. The transactions contemplated by the Exchange Agreement were consummated on January 5, 2021, and, pursuant to the terms of the Exchange Agreement, among other things, all outstanding shares of common stock of Omnia Corp., no par value, or the Omnia Corp. Shares, were exchanged for shares of our common stock, par value $0.001 per share, based on the exchange ratio of one share of our common stock for every one Omnia Corp. Share. We refer herein to the transactions contemplated by the Exchange Agreement, collectively, as the Acquisition. Accordingly, we acquired 100% of Omnia Corp. in exchange for the issuance of 10,000,000 (not adjusted to reflect our 15:1 forward stock split on April 6, 2021) shares of our common stock and Omnia Corp. became our wholly-owned subsidiary. As of the closing of the Acquisition (the Closing), Mr. Samad, resigned as an officer and director of the Company and agreed to cancel 52,656,888 (pre-stock split) shares of our common stock owned beneficially and of record by him as part of the conditions to Closing, which were cancelled immediately following the Closing. The Company also issued an aggregate of 1,269,665 (pre-stock split) shares of common stock on January 5, 2021 as a result of the conversion in accordance with their terms of outstanding convertible promissory notes in the aggregate principal amount of approximately $539,000.\nAs of immediately prior to the closing of the Acquisition, we entered into an Assignment and Assumption Agreement with RZI Consulting LLC (the Assignment Agreement), pursuant to which RZI Consulting LLC assumed substantially all of our remaining assets and liabilities through the closing of the Acquisition. Accordingly, as of the closing of the Acquisition, we had no assets or liabilities (other than relating to general and administrative expenses).\nFollowing the Acquisition, the Company, through its wholly-owned subsidiary Omnia Corp., now develops and markets products for wellness and physical therapy markets, using patented dry-hydro therapy equipment that the Company plans to offer and sell in medical and fitness markets.\nOn April 6, 2021, the Company filed a Certificate of Change with the Secretary of State of the State of Nevada to (i) increase the Companys authorized shares of common stock from 100,000,000 to 1,500,000,000, (ii) increase the Companys authorized shares of blank check preferred stock from 10,000,000 to 150,000,000, and (iii) effect a 1:15 forward stock split of the common stock.\nOur principal executive office is located at 999 18th St., Suite 3000, Denver, CO 80202, and our telephone number is 303-325-3738. Our website address is www.omniawellness.com. The information on our website is not part of this Annual Report on Form 10-K.\nCOVID-19 Pandemic\nIn March 2020 the World Health Organization declared COVID-19 a pandemic. The Company is still assessing the impact COVID-19 may have on its business, but there can be no assurance that this analysis will enable the Company to avoid part or all of any impact from the spread of COVID-19 or its consequences, including downturns in business sentiment generally. The extent to which the COVID-19 pandemic and global efforts to contain its spread will impact the Companys operations will depend on future developments, which are highly uncertain and cannot be predicted at this time, and include the duration, severity and scope of the pandemic and the actions taken to contain or treat the COVID-19 pandemic.\nBusiness Plan\nThe Companys post-Acquisition mission is to redefine the massage industry by introducing affordable, on demand massage memberships through a network of retail locations, which we refer to as Relaxation Centers, which feature a patented, touchless SOLAJET™ massage, a technology equivalent to hands-on massage. The Company seeks to become the leading provider of therapeutic massage and the most recognized brand in the massage category through the rapid and focused expansion of Relaxation Centers in key markets throughout the U.S. and Europe. The goal is not only to capture a significant share of the existing market but also to expand the massage market as a whole by attracting a large segment of potential customers who are averse to human touch.\nThe Company plans to introduce a disruptive business model into the traditional massage industry by delivering the important benefits of massage in a more affordable and convenient way. The Company has created a unique and expandable business model that the Company believes breaks through the main barriers of massage which include cost, scheduling, and quality/consistency.\nCentral to the Companys business plan is the creation of Relaxation Centers, which are premium, spa-like locations that can be located, and an appointment booked, by customers or members using a smartphone app or the web (massage on demand). The Company expects that each Relaxation Center will have an average of ten patented dry-hydrotherapy SOLAJET™ massage systems where customers will receive a private, deeply relaxing, consistent and therapeutic massage. The Company believes that the experience is equal to a traditional hands-on massage provided by an experienced, licensed masseuse. The SOLAJET™ massage systems are designed to permit customers to control virtually every aspect of the massage session by the touch of a button.\nThe Companys retail membership model is currently based upon a price from $5 to $10 per fifteen-minute session. The Company believes that the combined experience of deep tissue massage, therapeutic heat and proprietary wave therapy is so significant, the effects of a one-hour hands-on massage can be felt in as little as one fifteen-minute session. Due to this technology advantage, the Company expects to operate the Relaxation Centers with a minimal amount of staffing, as well as potentially franchise Relaxation Centers to third parties to enhance the rate of growth. Based on projected usage rates determined by us after multiple years of product development and market testing, the Company estimates that a single SOLAJET™ massage system may generate approximately $60,000 in annual revenue with a target gross margin of approximately 60%.\nResearch and Development\nTo develop our proprietary technology and prepare our product for commercialization, Omnia Corp. and its founder and affiliates have spent multiple years designing and placing over 500 units in high volume usage commercial settings. This product verification program was important to validate the products reliability, performance, consumer features and production capacity. The Company is continuing to develop additional products to offer in the wellness market and will incur research and development expenses on an ongoing basis.\nManufacturing\nThe Company outsources its manufacturing pursuant to a Contract Services Agreement with DryRX, LLC dated as of January 1, 2020, which replaced and superseded the Contract Services Agreement with DryRX, LLC dated as of July 22, 2018 which expired in accordance with its terms. The Contract Services Agreement, among other things, provides that DryRX shall provide manufacturing and support services on behalf of the Company, and shall be responsible for the manufacturing oversight and production operations of the Companys products. In return, the Company is obligated to pay to DryRX a fee equal to 10% of net sales less cost-of-goods-sold and all expenses associated with the services. DryRX is owned and controlled by Steve Howes brother.\nMarket Analysis\nThe global health and wellness industry had revenue of over $4.5 trillion per year prior to the COVID-19 pandemic and, as the pandemic waned in 2021 and continues to do so in 2022 as a result of available vaccines, and the global, national and local economies rebound, will continue to afford great opportunities for companies that offer innovative wellness solutions According to a report published in September 2022, by Wakefield Research, over 3 in 5 Americans (63%) believe investing in wellness activities, services and products that can help them save on the long-term financial costs of the effects of aging and sickness. With more than 3 in 4 Americans (76%) reporting they frequently experience negative physical or mental symptoms like stress, anxiety, fatigue, lack of focus, chronic pain, and unhealthy skin, its no wonder many are seeking better support for their bodies and minds. The challenges faced by aging populations, working populations who are interested in regular wellness maintenance and active people who need recovery support from various physical activities. Now more than ever, people suffer from tension/stress, chronic pain, lack of exercise and a broad range of conditions which may be alleviated or treated by massage and other modalities offered by Omnia Wellness.\nThe Company believes that its technology has been and will continue to be embraced by some of the leading professionals in the wellness market. The Company has received testimonials which describe experiences ranging from how the product has made a big difference in daily personal lives to how commercial providers have enjoyed significant profits by charging for clients to use our deeply relaxing and therapeutic technology.\nThe Company saw a decrease in sales of its available products during 2020 which it believes was a direct result of the COVID-19 pandemic, as gyms and other locations were closed and communities and individuals were quarantined for parts of the year. The Company started to see indicators late in the third quarter of 2020 and early in the fourth quarter of 2020 that business was starting to pick up again on the medical side and that continued into 2021 and early 2022. The SOLAJET™ massage system allows the option of getting a treatment without being in a room with another person, which management believes that this will allow an additional way to market the beds over the next several years.\nProducts and Services\nSOLAJET™ Massage System\nThe SOLAJET™ massage system is a patented and unique touch-less treatment that helps reduce pain, improve range of motion, revive and rejuvenate the body. Inside the system, a powerful traveling water jet performs a relaxing full body Endo-Kinetic™ treatment but is also able to isolate to any part of the body at the touch of a button. Highlights include:\n● Rated equivalent to hands-on massage therapy, and 8 to 1 over a hot tub or massage chair experience based on Company-administered trials and surveys.\n● Deep tissue penetration, therapeutic heat and a flushing body wave motion combine 3 therapies in one, delivering a similar feeling of an hour-long traditional massage in as little as 15 minutes.\n● Users remain clothed and dry. No oils, disrobing or getting wet.\n● SOLAJET™ massage system features a full body massage with user-controlled programs, pressure and custom adjustments via a touch screen controller or smartphone app.\n● Company-administered surveys have suggested a 93% interest in continued use, and the system also appeals to a significant percentage of the population who will not normally seek a massage because they do not like personal touch.\nAQUAVIVE™ Recliner System\nThe AQUAVIVE™ Recliner System, expected to be introduced in 2021, is a first in class, zero-gravity platform that uses water infused chambers to stimulate, soothe and compress soft tissue, delivering massage-like feeling while being able to rapidly vary temperature from 50 to 95 Degrees in approximately 1 minute. Highlights include:\n● Rapid cooling or heating at the touch of a button;\n● Water roller system to ensure comfort and effective massage;\n● Painless massage patterns mimic hand motion; and\n● Seamless/sanitary cover system for simple disinfection between uses.\nRelaxation Centers\nThe Companys business model is to create a national chain of BodyStop® Relaxation Centers. Earlier Company focus groups have shown that individuals introduced to the proposed BodyStop® Relaxation Center concept had a high interest in the services offered. The Company also had similar results selling SOLAJET™ memberships in commercial settings with a compelling conversion rate for users to purchase a monthly massage membership. The Company believes this is a strong indication that retention or membership sales will be high once consumers experience a SOLAJET™ massage in a relaxing and stress-free environment. The Companys first two BodyStop® locations are currently under construction on Long Island, New York and at the LA Fitness in Fountain Valley, California, with an expected opening date of November, 2022.\nThe Company intends to offer the following at each BodyStop® location:\n● Luxurious feeling, open and stress free environment.\n● Relaxing pre-massage/recovery area provides the soothing tone of relaxation with an arrangement of colors, scents, lighting and décor.\n● Privacy massage rooms for security and mental relaxation.\n● Hydration stations - customizable energy water dispenser to help relax and replenish the body after massage.\n● Sign-up/Sign-in kiosk - Registration will be done through a smartphone app, the internet or an in-store kiosk. The in-store kiosk will also be available to learn more about SOLAJET™.\n● Consumers are able to control the massage and where to focus force via a control panel.\n● BodyStop® No Tip policy creates a high value, cashless retail environment.\n● Approximately ten SOLAJET™ massage systems.\nFor the BodyStop® Relaxation Centers, the Company continues to develop, product branding and marketing using professional marketing agencies and intends to hire consultants to develop the store layout and associated marketing concepts. The locations are intended to represent a human oasis or an affordable recharge station for our stressed-out world. The Company intends to work closely with its franchise consultants during the testing and modeling of the centers to make certain any franchise offering has the best opportunity to be successful.\n● A new therapeutic massage experience with wider appeal than traditional massage;\n● Affordable monthly membership program - making the luxury of a regular massage attainable;\n● Convenient booking system making massage on-demand;\n● Convenient locations;\n● Relaxing and welcoming atmosphere;\n● High customer service focus - minimal staff administrative burden allows center employees to focus a majority of their time of service and hospitality; and\n● User friendly control system using touch-screens to manage the touchless massage system.\nOther Products and Offerings\nThe Company intends to introduce from time to time other products and service offerings. For instance, the Company is intending to introduce the SolaProTM mobile deep-tissue massage gun, which it believes will provide superior soft tissue treatment when compared to other products on the market.\nPlan of Operations\nThe Company intends to implement an aggressive go-to-market plan intended to validate its business model, including to:\n● Engage a professional branding and marketing group to develop BodyStop® name and marketing collateral (print, web, mobile and social media).\n● Employ a design consultant to properly design the BodyStop® layout, theme, lighting and structure.\n● Secure a real estate specialist to determine proper retail locations based on population, demographics and foot traffic.\n● Initially launch ten BodyStop® in the metro-located in areas such as Southern California, Florida, Texas, and Colorado to validate the business model.\nFurthermore, the Company plans to market the pre and post-launch of its BodyStop® Relaxation Centers by:\n● Driving customer flow to the BodyStop® Relaxation Centers by building brand awareness through conveniently located, highly visible locations and by using traditional retail-oriented marketing and customer acquisition techniques and by participating in community awareness events.\n● Heavily promoting free massages as an attractive means to drive traffic to the locations for the prospective customers first trial massage. We believe that the history of user usage patterns predicts a high retention or desire for ongoing use once someone experiences the SOLAJET™ massage in a Relaxation Center.\n● Developing a social media presence.\n● Creating media and public relations exposure.\nAfter the Companys BodyStop® Relaxation Centers have been in service for a reasonable test period, management plans to evaluate each locations results and determine the proper course of action for the identification and installation of future locations. If results from the test market demonstrate that the concept is profitable and scalable, the Company intends to build up the headquarter organization and expects to open approximately 50 to 100 company owned BodyStop® Relaxation Centers in the U.S. within the following 12 - 24 months, subject to the availability of funds.\nOmnia Wellness has decided to enter the European market starting from Switzerland which is a renowned test market for innovative products, as the positive reception from local customers is usually assurance of success. In Switzerland, Omnia Wellness is actively building several market verticals with elderly homes, property developers, fitness centers and corporations (employee wellbeing). In order to have an efficient and reliable local presence, Omnia Wellness is negotiating a service agreement with MITAC, a noted Swiss company in the whirlpool and spa markets, for installation, servicing, and maintenance of Omnias products.\nIn addition to a national chain of company-owned BodyStop® Relaxation Centers, the Company is considering franchising the Relaxation Centers, and sell SOLAJET™ memberships in commercial settings through the purchase of monthly massage memberships. Along with the retail and commercial elements of the business plan, the Company expects to launch a medical rental program targeting physical therapists and chiropractors, which we believe removes the cost factor that would otherwise prevent practitioners from purchasing our products - a major barrier of entry. Our first beta franchise center is expected to open in the fourth quarter of 2022.\nRevenue Share Model\nThe Company has also tested, and now offers, the installation and operation of a smaller version of the Relaxation Centers in a limited number of the nations leading health and fitness clubs. For instance, the Company and LA Fitness have opened the initial BodyStop® Center located in LA Fitness, Mission Viejo, California in January 2019, and a second location in Irvine, California opened in July 2019. The Company has confirmed the model with LA Fitness and is scheduling the opening of two BodyStop® Relaxation Centers in August 2022 and expand eventually to 100 to 300 LA Fitness centers. In June 2022, the Company and LA Fitness entered into a new license agreement to expand the number of modalities offered at each LA Fitness location where the Company was operating prior to the Covid shut down and to expand the same package of modalities to other locations as well. Our value proposition to this and other potential partnerships include:\n● No capital investment by the fitness partner, as the Company will install and own the beds;\n● Profitability drivers utilizing existing members or traffic, assisted by co-marketing with our partner,\n● Service and support by the Company;\n● Turn-key marketing support;\n● Kiosk enrollment and operation; and\n● The Company shares the revenue with the partner, in the range of 60% to 70% of gross revenue to the Company and 30% to 40% to the partner.\nTarget Customers\nPotential retail target customers for the SOLAJET™ massage experience include the following:\n● Employees exposed to high levels of stress;\n● Sedentary workers;\n● Manual and strenuous labor employees;\n● Seniors;\n● Overweight individuals; and\n● Individuals with chronic pain/disabilities.\nThe Company expects the physiological massage experience, the centers relaxing environment, ongoing massage education and overall financial value to resonate well with potential consumers, creating a strong consumer brand and loyal members.\nThe Company plans to create a focused marketing plan targeting specific segments of the population. The emphasis of the marketing messages will be on the specific benefits of consistent massage as a means of providing long-term and short-term health benefits.\nWe are also building a business unit to focus on the healthcare and wellness professional market, to sell or rent SOLAJET™ massage systems to professionals, with the initial focus on the chiropractic and physical therapy industries where pricing and terms can range from $600-$800/month per rental to approximately $20,000 for purchase.\nCompetition\nWe intend to compete with private spas and massage centers. Companies within the traditional massage market historically have been highly fragmented. Recently, national and regional massage chains have emerged offering discounted pricing for a monthly massage commitment. Top chains include: Massage Envy®, Zen Massage®, Massage Heights®, and Hand & Stone®. These chains attempt to standardize the massage category by assuring customers a licensed massage at a predictable price to secure continued usage.\nCommercial competition includes four main competitors who are solely focused on selling water-based massage systems into the medical and leisure markets. Each command a high sales price of $15,000 - $35,000, and management believes that its competitors offer inferior massage experiences compared to the SOLAJET™ massage system. To date, based on publicly available information, none have initiated a relaxation center or franchise model and each are focused on growing and expanding the dry-hydrotherapy segment, primarily in the fitness market.\nSome of our expected competitors currently have significantly greater resources than we do, have previously validated their business plan and launched their business, and may have greater resources for product development, sales and marketing, additional lines of products and the ability to offer financial incentives such as rebates, bundled products or discounts on other product lines that we may not be able to provide.\nWe intend to compete based on pricing, convenience and superior products and experience.\nIntellectual Property\nProtection of our intellectual property is a strategic priority for our business. We rely on a combination of patents, trademarks, copyrights, trade secrets as well as nondisclosure and assignment of invention agreements, material transfer agreements, confidentiality agreements and other measures to protect our intellectual property and other proprietary rights.\nPatents and trademarks are significant to our business to the extent that a product or an attribute of a product represents a unique design or process. Patent protection of our products restricts competitors from duplicating these unique designs and features. To protect our proprietary secrets and competitive technologies, we have obtained and are seeking to further obtain patent, trade secret, trademark and other intellectual property protection on our products whenever appropriate. As of the date hereof, the Company holds the following patents or pending patents through its exclusive license with Drywave Technologies USA, Inc. described further below:\nDescription Patent No. Date Issued Expiration\nSystems and Methods for Providing Dry Hydrotherapy to a Reclined Human Subject 7,311,683 December 25, 2007 December 25, 2027\nDry Hydrotherapy Bed D662,211 June 19, 2012 June 19, 2026\nWater Encapsulated and Mechanical Hybrid Body Massage Chair with Rapid Heating and Cooling Control U.S. Provisional Application, Serial No. 62/862,777, filed on June 18, 2019 Pending Pending\nTrademarks include SOLAJET™, MassageWave®, BodyStop®, AquaVive® and several related URLs.\nIn addition to the patents, there are a number of proprietary processes in the design, assembly and manufacturing of the SOLAJET™ massage system. Our ability to protect and use our intellectual property in the continued development and commercialization of our technologies and products and to prevent others from infringing on our intellectual property is important to success. Our basic patent strategy is to augment our current portfolio by applying for patents on new developments and obtaining licenses to promising product candidates and related technologies. We also maintain various trade secrets which we have chosen not to reveal by filing for patent protection. Our issued patents and patent applications provide protection for our core technologies. In addition to the foregoing patent activity, several continuations-in-part and international patents have been filed. Patent applications related to our proprietary aqua roller system, rapid heating and cooling systems have been filed.\nWe also rely on trade secrets and unpatentable know-how that we seek to protect, in part, by confidentiality agreements. Our policy is to require our employees, consultants, contractors, manufacturers, outside scientific collaborators and sponsored researchers, board of directors, technical review board and other advisors to execute confidentiality agreements upon the commencement of employment or consulting relationships with us. These agreements provide that all confidential information developed or made known to the individual during the course of the individuals relationship with us is to be kept confidential and not disclosed to third parties except in specific limited circumstances. We also require signed confidentiality or material transfer agreements from any company that is to receive our confidential information. In the case of employees, consultants and contractors, the agreements provide that all inventions conceived by the individual while rendering services to us shall be assigned to us as the exclusive property of our company. There can be no assurance, however, that all persons who we desire to sign such agreements will sign, or if they do, that these agreements will not be breached, that we would have adequate remedies for any breach, or that our trade secrets or unpatentable know-how will not otherwise become known or be independently developed by competitors.\nOn April 30, 2019, Omnia Corp. entered into a worldwide exclusive license with Drywave Technologies USA, Inc., which is the owner or exclusive licensee of certain of the technology, patent and other intellectual property rights, and know-how related to our dry hydrotherapy massage products. Pursuant to the terms and conditions of the license agreement, the Company received intellectual property rights to manufacture, use, and offer for sale all the products related to the patents and trademarks for dry hydrotherapy therapy technologies. The license fee to acquire the technology was $2,000,000, all of which has been paid. The Company is also obligated to pay to Drywave a royalty of 3% of net sales beginning May 1, 2020 and continuing for the longer of the period in which there are valid patent claims or ten years. Drywave is wholly-owned by Steve Howe, our Executive Chairman. The Company has a liability of $27,945 on its consolidated financial statements at March 31, 2022.\nOur success will also depend in part on our ability to commercialize our technology without infringing the proprietary rights of others. Although we have conducted freedom of use patent searches no assurance can be given that patents do not exist or could not be filed which would have an adverse effect on our ability to market our technology or maintain our competitive position with respect to our technology. If our technology components, products, processes or other subject matter are claimed under other existing United States or foreign patents or are otherwise protected by third party proprietary rights, we may be subject to infringement actions. In such event, we may challenge the validity of such patents or other proprietary rights or we may be required to obtain licenses from such companies in order to develop, manufacture or market our technology. There can be no assurances that we would be able to obtain such licenses or that such licenses, if available, could be obtained on commercially reasonable terms. Furthermore, the failure to either develop a commercially viable alternative or obtain such licenses could result in delays in marketing our proposed technology or the inability to proceed with the development, manufacture or sale of products requiring such licenses, which could have a material adverse effect on our business, financial condition and results of operations. If we are required to defend ourselves against charges of patent infringement or to protect our proprietary rights against third parties, substantial costs will be incurred regardless of whether we are successful. Such proceedings are typically protracted with no certainty of success. An adverse outcome could subject us to significant liabilities to third parties and force us to curtail or cease our development and commercialization of our technology.\nGovernment Regulation\nRegulation by governmental authorities in the United States and foreign countries can be a significant factor in the development, manufacture and marketing of health-related products. Currently, other than a Class I medical device registration form and annual fee payment, none of our products require formal regulatory approval by governmental agencies prior to commercialization. Class I medical devices are those products deemed to be low-risk, and as such are subject to the least amount of regulatory control. As a business strategy, we intend to conduct some key clinical studies to provide a basis to make medical claims regarding the use of our SOLAJET™ and AQUAVIVE™ products.\nEmployees\nAs of September 10, 2022, we had 9 full-time employees. These employees oversee day-to-day operations of the Company supporting management and leading engineering, manufacturing, intellectual property and administration functions of the Company. We also use the services of consultants as-needed from time to time. We are subject to labor laws and regulations within our locations in the U.S. These laws and regulations principally concern matters such as pensions, paid annual vacation, paid sick days, length of the workday and work week, minimum wages, overtime pay, insurance for work-related accidents, severance pay and other conditions of employment. None of our employees are represented by a labor union or covered by a collective bargaining agreement. We consider our relationship with our employees to be satisfactory.\nSEC Filings\nWe file Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q and current event reports on Form 8-K, and other information with the SEC. The SEC maintains a website at www.sec.gov that contains reports, information statements, and other information regarding issuers that file electronically with the SEC. You can read our SEC filings over the internet at the SECs website at www.sec.gov. Item 1A. Risk Factors\nA purchase of any of our securities involves a high degree of risk. Investors should consider carefully the following information about these risks, together with the other information contained in this prospectus before the purchase of any of our Shares. If any of the following risks actually occur, the business, financial condition or results of operations of the Company would likely suffer, the market price of the common stock would likely decline, and investors could lose all or a portion of their investment. The Company has listed the following risk factors which it believes to be those material to an investment decision in this offering.\nRisks Related to Our Business and Financial Status\nWe are a development stage company with a limited operating history, making it difficult for you to evaluate our business and your investment.\nOur operations are subject to all of the risks inherent in the establishment of a new business enterprise, including but not limited to the absence of an operating history, lack of fully-developed or commercialized products, insufficient capital, expected substantial and continual losses for the foreseeable future, limited experience in dealing with regulatory issues, lack of manufacturing and marketing experience, need to rely on third parties for the development and commercialization of our proposed products, a competitive environment characterized by well-established and well-capitalized competitors and reliance on key personnel.\nWe may not be successful in carrying out our business objectives. The revenue and income potential of our business and operations are unproven as the lack of operating history makes it difficult to evaluate the future prospects of our business. There is nothing at this time on which to base an assumption that our business operations will prove to be successful or that we will ever be able to operate profitably. Accordingly, we have no track record of successful business activities, strategic decision-making by management, fund-raising ability, and other factors that would allow an investor to assess the likelihood that we will be successful in our business. There is a substantial risk that we will not be successful in fully implementing our business plan, or if initially successful, in thereafter generating material operating revenues or in achieving profitable operations.\nSince inception, we have not established any material and recurring revenues or operations that will provide financial stability in the long term, and there can be no assurance that we will realize our plans on our projected timetable (or at all) in order to reach sustainable or profitable operations.\nInvestors are subject to all the risks incident to the creation and development of a new business and each investor should be prepared to withstand a complete loss of his, her or its investment. Furthermore, the accompanying financial statements have been prepared assuming that we will continue as a going concern. We have not emerged from the development stage, and may be unable to raise further equity. These factors raise substantial doubt about our ability to continue as a going concern. Our financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nEven if we successfully develop and market our products and business plan, we may not generate sufficient or sustainable revenue to achieve or sustain profitability, which could cause us to cease operations and cause you to lose all of your investment. Because we are subject to these risks, you may have a difficult time evaluating our business and your investment in our Company.\nWe are at an early stage of marketing and sales and we have commercial products with limited sales history.\nOur efforts may not lead to commercially successful products, for a number of reasons, including that:\n● our products may not be accepted by the individuals or commercial customers;\n● we may not have adequate financial or other resources to complete the development and commercialization of our products; and any products that are sold may not be accepted or may have significant competition in the marketplace.\n● If sales of our projects are delayed, we may have to raise additional capital or reduce or cease our operations.\nWe may never become profitable.\nTo become profitable, we must successfully develop, manufacture and market our existing and planned products, either alone in on conjunction with possible collaborators. We may never have any significant recurring revenues or become profitable. In order to become profitable, broad acceptance of dry hydro massage service is necessary along with our ability to successfully acquire enough paying members within nine months of a locations opening and limit customer attrition to make them profitable, and there can be no assurance that we will attain this goal.\nIf we fail to obtain additional financing, we may be unable to complete the development and commercialization of our product candidates.\nOur operations will consume substantial amounts of cash. We expect that our monthly cash used by operations will continue to increase for the next several years. Our ability to obtain additional financing will be subject to a number of factors, including market conditions, commercial acceptance of our products, our operating performance and the terms of our existing indebtedness. We cannot assure you that we will be able to raise additional funds on terms favorable to us or at all. If we raise additional funds through the sale of equity or convertible debt securities, the ownership percentage of then existing stockholders will be reduced. In addition, any such transaction may dilute the value of our common stock. We may have to issue securities that have rights, preferences and privileges that rank senior to those of our common stock. The terms of any additional indebtedness may include restrictive financial and operating covenants that would limit our ability to compete and expand. Our failure to obtain any required future financing could materially and adversely affect our financial condition. If we do not obtain adequate short-term working capital and permanent financing, we would have to curtail our development and production activities and adopt an alternative operating model to continue as a going concern.\nIn 2020, the Coronavirus outbreak was declared a pandemic by the World Health Organization and may continue to adversely affect our business operations, employee availability, financial condition, liquidity and cash flow for an extended period of time.\nThe outbreak of the Coronavirus (COVID-19) continues to grow both in the U.S. and globally, and related government and private sector responsive actions may continue to adversely affect our business operations. It is impossible to predict the effect and ultimate impact of the COVID-19 pandemic as the situation is rapidly and continually evolving.\nOngoing significant reductions in business related activities could result in further loss of projected sales and other material adverse effects. The extent of the impact of COVID-19 on our business, financial results, liquidity and cash flows will depend largely on future developments, including new information that may emerge concerning the severity and action taken to contain or prevent further spread within the U.S. and the related impact on consumer confidence and spending, all of which are highly uncertain and cannot be predicted.\nThese recent global health concerns are materially impacting our planned roll-out of Relaxation Centers and of partnerships with health and fitness clubs, medical offices and physical therapy centers, which if not soon alleviated will have a material adverse effect on our business and our results of operation and financial condition. We may be unable to successfully secure new locations for our products due to COVID-19 shutdowns or other limitations, and there can be no assurances that we will be able to open new Relaxation Centers or further expand sites in which our dry-hydrotherapy SOLAJET™ massage systems are located.\nAs COVID-19 continues and persists for an extended period of time, we expect there will also be significant and material disruptions and delays in the manufacturing and shipment of our products, which may then also have a material adverse effect on our business and results of operations.\nThese and other potential impacts of COVID-19 could therefore materially and adversely affect our business, financial condition and results of operations.\nWe are subject to significant accounts payable and other current liabilities, which we may be unable to repay.\nWe have accounts payable, accrued liabilities, loans payable, interest and other liabilities of approximately $7,400,000 as of March 31, 2022. We currently owe, or there will become due in 2023, indebtedness evidenced by promissory notes aggregating in excess of $5.8 million (exclusive of interest), of which approximately $1.2 million is convertible debt. We also expect to incur additional indebtedness from time to time to fund operations. Our operations are not currently able to generate sufficient cash flows to meet our payable and other liabilities, which could reduce our financial flexibility, increase interest expenses, and adversely impact our operations. We may not generate sufficient cash flow from operations to enable us to repay this indebtedness and to fund other liquidity needs, including capital expenditure requirements. Such indebtedness could affect our operations in several ways, including the following:\n● a significant portion of our cash flows could be required to be used to service such indebtedness.\n● a high level of indebtedness could increase our vulnerability to general adverse economic and industry conditions.\n● any covenants contained in the agreements governing such outstanding indebtedness could limit our ability to borrow additional funds, dispose of assets, pay dividends and make certain investments.\n● a high level of indebtedness may place us at a competitive disadvantage compared to our competitors that are less leveraged and, therefore, our competitors may be able to take advantage of opportunities that our indebtedness may prevent us from pursuing.\n● debt covenants may affect our flexibility in planning for, and reacting to, changes in the economy and in our industry, if any; and\n● any ability to convert or exchange such indebtedness for equity in the Company can cause substantial dilution to existing stockholders of the Company.\nWe may need to refinance or restructure all or a portion of our indebtedness and other liabilities on or before maturity. We may not be able to refinance any of our indebtedness or other liabilities on commercially reasonable terms, or at all.\nA high level of indebtedness and other liabilities increases the risk that we may default on our debt obligations and other liabilities. We currently owe, or there will become due in 2023, indebtedness evidenced by promissory notes aggregating in excess of $5.8 million (exclusive of interest), of which approximately $1.2 million is convertible debt. We may not be able to generate sufficient cash flows to pay the principal or interest on our debt. If we cannot service or refinance our indebtedness and other liabilities or convert or exchange indebtedness for equity in the Company, we may have to take actions such as selling significant assets, seeking additional equity financing (which will result in additional dilution to stockholders) or reducing or delaying capital expenditures, any of which could have a material adverse effect on our operations and financial condition. Furthermore, if we do not have sufficient funds and are otherwise unable to arrange financing to repay our outstanding indebtedness, our assets may be foreclosed upon, among other damages to lenders, which could have a material adverse effect on our business, financial condition and results of operation. The Company requires additional funding which it does not yet have secured and if this new funding is not received it will have a material adverse effect on our business, financial condition, and results of operation.\nDue to our reliance on contract manufacturing or other third parties to conduct sales and marketing, we are unable to directly control the timing, conduct and expense of our product launches.\nWe plan to rely primarily on third parties to manufacture our products. As a result, we will have less control over the delivery of products than would be the case if we were to rely entirely upon our own staff. Communicating with outside parties can also be challenging, potentially leading to mistakes as well as difficulties in coordinating activities. Outside parties may have staffing difficulties, may undergo changes in priorities or may become financially distressed, adversely affecting their willingness or ability to produce our products. We may experience unexpected increased costs that are beyond our control. Problems with the timeliness or quality of the work of a contract manufacturing organization may lead us to seek to terminate the relationship and use an alternative service provider. However, making this change may be costly and may delay our product delivery, and contractual restrictions may make such a change difficult or impossible. Additionally, it may be impossible to find a replacement organization that can conduct our trials in an acceptable manner and at an acceptable cost.\nOur competitors may develop and market products that are less expensive than our product candidates.\nThe markets in which we operate are highly competitive. It is possible that our competitors will develop and market products that are less expensive, more effective or safer than our products or future products or that will render our products obsolete. We expect that competition from companies in this sector will increase. Many of these competitors have substantially greater financial, technical, research and other resources than we do. We may not have the financial resources, technical and research expertise or marketing, distribution or support capabilities to compete successfully.\nWe have an unproven business plan.\nWe have an unproven business plan and do not expect to be profitable for the next several years. Before investing in our securities, you should consider the challenges, expenses and difficulties that we will face as an early-stage company seeking to develop and manufacture new products.\nViable markets for our products may never develop, may take longer to develop than we anticipate or may not be sustainable.\nWe must be able to develop additional commercially viable products for our business to succeed. If a viable market fails to develop or develops more slowly than we anticipate, we may be unable to recover the losses we will have incurred to develop our products and may be unable to achieve profitability. We will need to develop adequate marketing capabilities in order to sell our products. In addition, the development of a viable market for our products may be impacted by many factors which are partly or totally out of our control, including:\n● the cost competitiveness of our products;\n● consumer reluctance to try new products; and\n● consumer perceptions of our products safety or efficacy.\nWe provide warranty coverage and product recall coverage for some of our products, and we do not have historical experience to project possible warranty or recall claims and costs. If warranty or recall claims are significantly higher than our initial projections, our financial results could be adversely affected.\nWe provide warranty coverage for our products. We have established a warranty reserve based on our expected warranty claims, but there is no assurance that this provision will be sufficient. Therefore, our financial results could vary based upon actual experience relative to how we account for any expected warranty claims. Furthermore, a significant warranty claim or product recall could materially adversely affect our financial results.\nWe may not meet our development and commercialization milestones.\nWe have established product development and commercialization milestones that we use to assess our progress toward developing commercially viable products. We cannot assure you that we will successfully achieve our milestones in the future or that any failure to achieve these milestones will not result in potential competitors gaining advantages in our target market. Failure to meet our development and commercialization milestones might have a material adverse effect on our operations and the value of our stock.\nOur business depends on retaining and attracting highly capable management and operating personnel.\nOur success depends in large part on our ability to retain and attract qualified management and operating personnel. To retain and attract key personnel, we plan to use various measures, including employment agreements, a stock incentive plan and incentive payments for key employees. These measures may not be enough to retain and attract the personnel we need or to offset the impact on our business of the loss of the services of key officers or employees. We could face difficulty hiring and retaining qualified management and operating personnel. If we are unable to recruit, hire, develop and retain a talented, competitive work force, we may not be able to meet our strategic business objectives.\nWe may be unable to manage rapid growth effectively.\nWe expect to expand our manufacturing capabilities, accelerate the commercialization of our products and enter a period of growth, all of which will place a significant strain on our senior management team and our financial and other resources. Our proposed expansion will expose us to increased competition, greater overhead, marketing and support costs and other risks associated with the commercialization of a new product. Our ability to manage our growth effectively will require us to continue to improve our operations and our financial and management information systems and to train, motivate and manage our employees. Difficulties in effectively managing the budgeting, forecasting and other process control issues presented by such a rapid expansion could harm our business, prospects, results of operations and financial condition.\nCredit market volatility and illiquidity may affect our ability to raise capital to finance our operations, manufacturing expansion and growth.\nThe credit markets have remained illiquid despite injections of capital by the Federal government and foreign governments, and banks and other lenders, such as equipment leasing companies, have significantly increased credit requirements and reduced the amounts available to borrowers. Companies with low credit ratings may not have access to the debt markets until liquidity improves, if at all. If current credit market conditions do not improve, we may not be able to access debt or leasing markets to finance our plant expansion plans.\nRisks Related to Our Intellectual Property\nWe are substantially dependent on patent and other proprietary rights and failing to protect such rights or to be successful in litigation related to our rights or the rights of others may result in our payment of significant monetary damages and/or royalty payments, negatively impact our ability to sell current or future products, or prohibit us from enforcing our patent and other proprietary rights against others.\nWe are and will continue to be materially dependent on a combination of patents, trade secrets, and trademarks, non-disclosure and non-competition agreements, and other intellectual property protections which will enable us to maintain our proprietary competitiveness. We may also be subject to patent litigation. Patent litigation against us can result in significant damage awards and injunctions that could prevent our manufacture and sale of affected products or require us to pay significant royalties in order to continue to manufacture or sell affected products. At any given time, we could potentially be involved as a plaintiff and/or as a defendant in a number of patent infringement and/or other contractual or intellectual property related actions, the outcomes of which may not be known for prolonged periods of time. While it is not possible to predict the outcome of such litigation, we acknowledge the possibility that any such litigation could result in our payment of significant monetary damages and/or royalty payments, negatively impact our ability to sell current or future products, or prohibit us from enforcing our patent and proprietary rights against others, which would have a material adverse effect on the financial condition of our business and on our business operations.\nWhile we intend to defend against any threats to our intellectual property, including our patents, trade secrets, and trademarks, and while we intend to defend against any actual or threatened breaches of our non-disclosure and non-competition agreements, we may not adequately protect our intellectual property or enforce such agreements. Further, patent or trademark applications currently pending that are owned by us may not result in patents or trademarks being issued to us, patents or trademarks issued to or licensed by us in the past or in the future may be challenged or circumvented by competitors and such patents or trademarks may be found invalid, unenforceable or insufficiently broad to protect our proprietary advantages.\nCompetitors may harm our sales by designing products or offering services that mirror the capabilities of our products, or the technology contained therein, without infringing our intellectual property rights. If we are unable to protect our intellectual property, it could have a material adverse effect on our financial condition and business operations.\nWe may be unable to adequately prevent disclosure of trade secrets and other proprietary information.\nWe rely on trade secrets to protect our proprietary know-how and technological advances, especially where we do not believe patent protection is appropriate or obtainable. However, trade secrets are difficult to protect. We rely in part on confidentiality agreements with our employees, consultants, and other advisors to protect our trade secrets and other proprietary information. These agreements may not effectively prevent disclosure of confidential information and may not provide an adequate remedy in the event of unauthorized disclosure of confidential information. In addition, others may independently discover our trade secrets and proprietary information. Costly and time-consuming litigation could be necessary to enforce and determine the scope of our proprietary rights. Failure to obtain or maintain trade secret protection could enable competitors to use our proprietary information to develop products that compete with our products or cause additional, material adverse effects upon our competitive business position.\nLitigation regarding patents, patent applications and other proprietary rights may be expensive and time consuming. If we are involved in such litigation, it could cause delays in bringing product candidates to market and harm our ability to operate\nOur commercial success will depend in part on our ability to manufacture, use, sell and offer to sell our product candidates and proposed product candidates without infringing patents or other proprietary rights of third parties. Other parties may obtain patents in the future and allege that the use of our technologies infringes these patent claims or that we are employing their proprietary technology without authorization. Likewise, third parties may challenge or infringe upon our or our licensors existing or future patents. Proceedings involving our patents or patent applications or those of others could result in adverse decisions regarding the patentability of our inventions relating to our product candidates or the enforceability, validity or scope of protection offered by our patents relating to our product candidates.\nEven if we are successful in these proceedings, we may incur substantial costs and divert management time and attention in pursuing these proceedings. If we are unable to avoid infringing the patent rights of others, we may be required to seek a license, defend an infringement action or challenge the validity of the patents in court. Patent litigation is costly and time-consuming. We may not have sufficient resources to bring these actions to a successful conclusion. In addition, if we do not obtain a license, develop or obtain non-infringing technology, fail to defend an infringement action successfully or have our patents declared invalid, we may incur substantial monetary damages; encounter significant delays in bringing our product candidates to market; or be precluded from participating in the manufacture, use or sale of our product candidates or methods of treatment requiring licenses.\nRisks Related to Investment in our Securities\nThere is a limited trading market for our common stock, which could make it difficult for you to liquidate an investment in our common stock, in a timely manner.\nOur common stock is currently traded on the OTC Pink market. Because there is a limited public market for our common stock, you may not be able to liquidate your investment when you want. We cannot assure you that an active trading market for our common stock will ever develop.\nThere is limited trading in our common stock and we cannot assure you that an active public market for our common stock will ever develop. The lack of an active public trading market means that you may not be able to sell your shares of common stock when you want, thereby increasing your market risk. Until our common stock is listed on an national securities exchange, which we can provide no assurance, we expect that it will continue to be listed on the OTC Pink market. An investor may find it difficult to obtain accurate quotations as to the market value of the common stock and trading of our common stock may be extremely sporadic. For example, several days may pass before any shares may be traded. A more active market for our common stock may never develop. In addition, if we failed to meet the criteria set forth in SEC regulations, various requirements would be imposed by law on broker-dealers who sell our securities to persons other than established customers and accredited investors. Consequently, such regulations may deter broker-dealers from recommending or selling the common stock, which may further affect its liquidity. This would also make it more difficult for us to raise additional capital.\nWe cannot assure you that our common stock will become listed on a securities exchange and the failure to do so may adversely affect your ability to dispose of our common stock in a timely fashion.\nWe plan to seek listing of our common stock on the NYSE MKT or a Nasdaq exchange as soon as reasonably practicable. We may not currently meet the initial listing standards of any of those exchanges or any other stock exchange, and cannot assure you when or if we will meet the listing standards, or that we will be able to maintain a listing of the common stock on any stock exchange.\nThe market price and trading volume of our common stock may be volatile, which may adversely affect its market price.\nThe market price of our common stock could be subject to significant fluctuations due to factors such as:\n● actual or anticipated fluctuations in our financial condition or results of operations;\n● the success or failure of our operating strategies and our perceived prospects; realization of any of the risks described in this section; failure to be covered by securities analysts or failure to meet the expectations of securities analysts;\n● a decline in the stock prices of peer companies; and\n● a discount in the trading multiple of our common stock relative to that of common stock of certain of our peer companies due to perceived risks associated with our smaller size.\nAs a result, shares of our common stock may trade at prices significantly below the price you paid to acquire them. Furthermore, declines in the price of our common stock may adversely affect our ability to conduct future offerings or to recruit and retain key employees, including our managing directors and other key professional employees.\nYour interest in us may be diluted if we issue additional shares of common stock.\nIn general, stockholders do not have preemptive rights to any common stock issued by us in the future. Therefore, stockholders may experience dilution of their equity investment if we issue additional shares of common stock in the future, including shares issuable under equity incentive plans, or if we issue securities that are convertible into shares of our common stock, which we intend to do.\nWe are a smaller reporting company, and the reduced reporting requirements applicable to smaller reporting companies may make our common stock less attractive to investors.\nWe are a smaller reporting company as defined in Section 12 of the Securities Exchange Act of 1934, as amended (the Exchange Act). For as long as we continue to be a smaller reporting company, we may take advantage of exemptions from various reporting requirements that are applicable to other public companies that are not smaller reporting companies, including not being required to comply with the auditor attestation requirements of Section 404 of Sarbanes-Oxley Act of 2002 (SOX), reduced disclosure obligations regarding executive compensation in our periodic reports and proxy statements, and exemptions from the requirements of holding nonbinding advisory votes on executive compensation, and stockholder approval of any golden parachute payments not previously approved. We cannot predict if investors will find our common stock less attractive because we may rely on these exemptions. If some investors find our common stock less attractive as a result, there may be a less active trading market for our common stock and our stock price may be more volatile.\nOur common stock is subject to the penny stock rules of the SEC, which makes transactions in our stock cumbersome and may reduce the value of an investment in our stock.\nThe SEC has adopted regulations which generally define a penny stock as an equity security that has a market price of less than $5.00 per share, subject to specific exemptions. The SECs penny stock rules require a broker-dealer, before a transaction in a penny stock not otherwise exempt from the rules, to deliver a standardized risk disclosure document that provides information about penny stocks and the risks in the penny stock market. The broker-dealer must also provide the customer with current bid and offer quotations for the penny stock, the compensation of the broker-dealer and the salesperson in the transaction, and monthly account statements showing the market value of each penny stock held in the customers account. In addition, the penny stock rules generally require that before a transaction in a penny stock occurs, the broker-dealer must make a special written determination that the penny stock is a suitable investment for the purchaser and receive the purchasers agreement to the transaction. If applicable in the future, these rules may restrict the ability of brokers-dealers to sell our common stock and may affect the ability of investors to sell their shares, until our common stock no longer is considered a penny stock.\nWe intend to issue more shares to raise capital, which will result in substantial dilution.\nOur certificate of incorporation authorizes the issuance of a maximum of 1,500,000,000 shares of common stock and 150,000,000 shares of blank check preferred stock. Any additional financings effected by us, and any future conversion of existing indebtedness into our equity securities, may result in the issuance of additional securities without stockholder approval and the substantial dilution in the percentage of common stock held by our then existing stockholders. Moreover, the securities issued in any such transaction may be valued on an arbitrary or non-arms-length basis by our management, resulting in an additional reduction in the percentage of common stock held by our current stockholders on an as converted, fully-diluted basis. Our board of directors has the power to issue any or all of such authorized but unissued shares without stockholder approval. To the extent that additional shares of common stock or other securities convertible into or exchangeable for common stock are issued in connection with a financing, dilution to the interests of our stockholders will occur and the rights of the holder of common stock might be materially and adversely affected.\nAnti-takeover provisions that may be in our charter and bylaws may prevent or frustrate attempts by stockholders to change the board of directors or current management and could make a third-party acquisition of us difficult.\nOur certificate of incorporation and bylaws may contain provisions that may discourage, delay or prevent a merger, acquisition or other change in control that stockholders may consider favorable, including transactions in which stockholders might otherwise receive a premium for their shares. These provisions could limit the price that investors might be willing to pay in the future for shares of our common stock.\nWe do not intend to pay cash dividends in the foreseeable future.\nWe have never declared or paid cash dividends on our capital stock. We currently intend to retain all available funds and any future earnings for use in the operation and expansion of our business and do not anticipate paying any cash dividends in the foreseeable future. Accordingly, you may have to sell some or all of your shares of our common stock in order to generate cash flow from your investment. You may not receive a gain on your investment when you sell shares and you may lose the entire amount of the investment.\nWe incur increased costs and demands upon management as a result of being a public company.\nAs a public company in the United States, we incur significant additional legal, accounting and other costs. These additional costs could negatively affect our financial results. In addition, changing laws, regulations and standards relating to corporate governance and public disclosure, including regulations implemented by the SEC and the stock exchange on which we may list our common stock, may increase legal and financial compliance costs and make some activities more time-consuming. These laws, regulations and standards are subject to varying interpretations and, as a result, their application in practice may evolve over time as new guidance is provided by regulatory and governing bodies. We intend to invest resources to comply with evolving laws, regulations and standards, and this investment may result in increased general and administrative expenses and a diversion of managements time and attention from revenue-generating activities to compliance activities. If, notwithstanding our efforts to comply with new laws, regulations and standards, we fail to comply, regulatory authorities may initiate legal proceedings against us and our business may be harmed.\nFailure to comply with these rules might also make it more difficult for us to obtain some types of insurance, including director and officer liability insurance, and we might be forced to accept reduced policy limits and coverage or incur substantially higher costs to obtain the same or similar coverage. The impact of these events could also make it more difficult for us to attract and retain qualified persons to serve on our board of directors, on committees of our board of directors or as members of senior management.\nFailure to establish and maintain an effective system of internal controls could result in material misstatements of our financial statements or cause us to fail to meet our reporting obligations or fail to prevent fraud in which case, our stockholders could lose confidence in our financial reporting, which would harm our business and could negatively impact the price of our stock. Furthermore, our management and our independent auditors have identified certain internal control deficiencies, which management and our independent auditors believe constitute material weaknesses.\nPrior to the Acquisition, Omnia Corp. was a private company with limited accounting personnel and other resources with which to address our internal controls and procedures. Following the Acquisition, we must review and update our internal controls, disclosure controls and procedures, and corporate governance policies as our Company continues to evolve. In addition, in connection with the Acquisition and becoming a company that files reports with the SEC, we are required to comply with the internal control evaluation and certification requirements of Section 404 of SOX and management is required to report annually on our internal control over financial reporting. Our independent registered public accounting firm will not be required to formally attest to the effectiveness of our internal control over financial reporting pursuant to Section 404 of SOX until the date we are no longer a smaller reporting company as defined by applicable SEC rules. We will remain a smaller reporting company as long as our public float remains less than $250 million as of the last business day of our most recently-completed second fiscal quarter.\nAny ineffective internal control regarding our financial reporting could have an adverse effect on our business and financial results and the price of our common stock could be negatively affected once we become a registrant required to file registration statements with the SEC. This reporting requirement could also make it more difficult or more costly for us to obtain certain types of insurance, including director and officer liability insurance, and we may be forced to accept reduced policy limits and coverage or incur substantially higher costs to obtain the same or similar coverage. Any system of internal controls, however well designed and operated, is based in part on certain assumptions and can provide only reasonable, not absolute, assurances that the objectives of the system are met. Any failure or circumvention of the controls and procedures or failure to comply with regulation concerning control and procedures could have a material effect on our business, results of operation and financial condition. Any of these events could result in an adverse reaction in the financial marketplace due to a loss of investor confidence in the reliability of our financial statements, which ultimately could negatively affect the market price of our shares, increase the volatility of our stock price and adversely affect our ability to raise additional funding. The effect of these events could also make it more difficult for us to attract and retain qualified persons to serve on our board of directors and as executive officers.\nWe will need to evaluate our existing internal controls over financial reporting against the criteria set forth in Internal Control - Integrated Framework (2013) (the Framework) issued by the Committee of Sponsoring Organizations of the Treadway Commission. During the course of our ongoing evaluation of the internal controls, we may identify other areas requiring improvement, and may have to design enhanced processes and controls to address issues identified through this review. Remediating any deficiencies, significant deficiencies or material weaknesses that we or our independent registered public accounting firm may identify may require us to incur significant costs and expend significant time and management resources. We cannot assure you that any of the measures we implement to remedy any such deficiencies will effectively mitigate or remedy such deficiencies. The existence of one or more material weaknesses could affect the accuracy and timing of our financial reporting. Investors could lose confidence in our financial reports, and the value of our common stock may be harmed, if our internal controls over financial reporting are found not to be effective by management or by an independent registered public accounting firm or if we make disclosure of existing or potential material weaknesses in those controls.\nEven if we conclude that our internal control over financial reporting provides reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles, because of its inherent limitations, internal control over financial reporting may not prevent or detect fraud or misstatements. Failure to implement required new or improved controls, or difficulties encountered in their implementation, could harm our operating results or cause us to fail to meet our future reporting obligations.\nOur reporting obligations as a public company will place a significant strain on our management, operational and financial resources and systems for the foreseeable future. If we fail to timely achieve and maintain the adequacy of our internal control over financial reporting, we may not be able to produce reliable financial reports or help prevent fraud. Our failure to achieve and maintain effective internal control over financial reporting could prevent us from filing our periodic reports on a timely basis which could result in the loss of investor confidence in the reliability of our financial statements, harm our business and negatively impact the trading price of our common stock.\nA significant portion of our total outstanding shares are restricted from immediate resale but may be sold into the market in the future. This could cause the market price of our common stock to drop significantly, even if our business is doing well.\nSales of a substantial number of shares of our common stock in the public market could occur at any time. If our stockholders sell, or the market perceives that our stockholders intend to sell, substantial amounts of our common stock in the public market, the market price of our common stock could decline significantly.\nOf the 232,222,818 shares of our common stock issued and outstanding as of March 31, 2022, approximately 36,316,830 shares are freely tradable without restriction by stockholders who are not our affiliates. All of the remaining shares are restricted securities as defined in Rule 144, and may be publicly resold subject to the limitations described in Rule 144.\nIn addition, in the future, we intend to file one or more registration statements on Form S-8 registering the issuance of 30,000,000 shares of common stock subject to options or other equity awards issued. Shares registered under these registration statements on Form S-8 will be available for sale in the public market subject to vesting arrangements and exercise of options and the restrictions of Rule 144 in the case of our affiliates.\nIf securities or industry analysts do not publish research or reports, or publish unfavorable research or reports, about us, our business or our market, our stock price and trading volume could decline.\nThe trading market for our common stock will be influenced by the research and reports that securities or industry analysts publish about us and our business. Securities or industry analysts may elect not to provide coverage of our common stock, and such lack of coverage may adversely affect the market price of our common stock. In the event we do not secure additional securities or industry analyst coverage, we will not have any control over the analysts or the content and opinions included in their reports. The price of our stock could decline if one or more securities or industry analysts downgrade our stock or issue other unfavorable commentary or research. If one or more securities or industry analysts ceases coverage of our company or fails to publish reports on us regularly, demand for our stock could decrease, which in turn could cause our stock price or trading volume to decline.\nRisks Related to Conflicts of Interest\nOur Executive Chairman may be in a position of conflict and no formal policy regarding any such potential conflicts exists.\nSteve Howe, our Executive Chairman and the beneficial owner of more than 30% of our common stock, is also the sole owner of Drywave Technologies USA, Inc., which is the owner or exclusive licensee of certain of the technology, patent and other intellectual property rights, and know-how relate to our dry hydrotherapy message products. Furthermore, Mr. Howes brother owns a company that provides manufacturing and support services to the Company.\nWhile there is a certain alignment of interests between the Company and Drywave Technologies in that Mr. Howe owns equity in both companies and the successful sale of the licensed products by the Company will financially benefit both companies, and therefore Mr. Howe has an interest in assuring the success of the Company, there may be instances in the future when those interests are no longer aligned. In such cases, Mr. Howe may face a conflict in selecting between the Company and Drywave Technologies. As a result, our business and results of operations could be materially adversely affected.\nWe have not formulated a formal policy for the resolution of such conflicts. However, any decision made by Mr. Howe will be made in accordance with his fiduciary duties, and he shall refrain from voting on any matter in which he may have a conflict of interest, all in accordance with applicable law.\nThe directors and executive officers of the Corporation also serve as directors and/or officers of, and investors in, other companies, and there exists the possibility for such directors and officers to be in a position of conflict.\nCertain of the officers and directors of the Company are and may in the future become involved in other business activities and opportunities. If a specific business opportunity becomes available, such person(s) may face a conflict in selecting between the Company and his other business interests. The Company has not formulated a policy for the resolution of such conflicts. The Company will not share in the risks or rewards of such other ventures; however, such other ventures will compete for their time and attention, which might create other conflicts of interest. The Company does not at this time require its officers or directors to devote any particular amount of time to the Company. As a result, our business and results of operations could be materially adversely affected.\nIN ADDITION TO THE ABOVE RISKS, BUSINESSES ARE OFTEN SUBJECT TO RISKS NOT FORESEEN OR FULLY APPRECIATED BY MANAGEMENT. IN REVIEWING THIS PROSPECTUS, POTENTIAL INVESTORS SHOULD KEEP IN MIND THAT THERE MAY BE OTHER POSSIBLE RISKS THAT COULD BE IMPORTANT. Item 1B. Unresolved Staff Comments\nNot applicable. Item 2. Description of Property\nOur corporate headquarters are located at 999 18th St., Suite 3000, Denver, Colorado 80202, where we lease approximately 200 square feet on a month-to-month basis. Under the lease, the lease term continues for 12 months and may be terminated upon 30 days prior notice from the landlord or, by us, upon 30 days prior notice. We believe that these facilities are adequate for our current needs, including providing the space and infrastructure to accommodate our development work based on our current operating plan. We believe that as may be needed, additional space can be leased in the same building we currently utilize. We do not own any real estate. Item 3. Legal Proceedings\nFrom time to time, we may become involved in various lawsuits and legal proceedings, which arise in the ordinary course of business. However, litigation is subject to inherent uncertainties, and an adverse result in these or other matters may arise from time to time that may harm business.\nWe are not currently a party in any legal proceeding or governmental regulatory proceeding nor are we currently aware of any pending or potential legal proceeding or governmental regulatory proceeding proposed to be initiated against us that would have a material adverse effect on us or our business. Item 4. Mine Safety Disclosures\nNot applicable.\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nMarket Information\nThere is no established trading market for our shares of common stock. Our common stock is currently quoted on the OTC Pink Market under the ticker symbol OMWS since April 15, 2020. There can be no assurance that a trading market will ever develop or, if such a market does develop, that it will continue. Prior to April 15, 2020, our common stock was quoted on the OTC Pink Market under the symbol GLLX. There were no trades in our common stock prior to May 27, 2019.\nThe following table sets forth for the periods indicated the high and low bid prices per share of our common stock as reported on OTC Pink Market, but as adjusted to reflect our April 6, 2021 15:1 forward stock split. These prices represent quotations between dealers without adjustment for retail mark-up, markdown or commission and may not represent actual transactions.\nQuarterly Period Ended High Low\nJune 30, 2021 $ 0.35 $ 0.167\nSeptember 30, 2021 $ 0.42 $ 0.16\nDecember 31, 2021 $ 0.40 $ 0.25\nMarch 31, 2022 $ 0.414 $ 0.20\nJune 30, 2020 $ 0.20 $ 0.10\nSeptember 30, 2020 $ 0.20 $ 0.12\nDecember 31, 2020 $ 0.20 $ 0.12\nMarch 31, 2021 $ 0.18 $ 0.12\nNumber of Holders\nAs of July 11, 2022, 232,222,818 shares of our common stock were issued and outstanding, which were held by approximately 44 holders of record.\nDividends\nWe have never declared or paid any cash dividend. We do not anticipate that we will declare or pay any dividends in the foreseeable future. Our current policy is to retain earnings, if any, to fund operations, and the development and growth of our business. Any future determination to pay cash dividends will be at the discretion of our Board and will be dependent upon our financial condition, operation results, capital requirements, applicable contractual restrictions, restrictions in our organizational documents, and any other factors that our Board deems relevant.\nPenny Stock\nOur Common Stock is subject to provisions of Section 15(g) and Rule 15g-9 of the Exchange Act, commonly referred to as the penny stock rule. Section 15(g) sets forth certain requirements for transactions in penny stock, and Rule 15g-9(d) incorporates the definition of penny stock that is found in Rule 3a51-1 of the Exchange Act. The SEC generally defines a penny stock to be any equity security that has a market price less than $5.00 per share, subject to certain exceptions. The Company is subject to the SECs penny stock rules.\nSince the Common Stock will be deemed to be penny stock, trading in the shares of our common stock is subject to additional sales practice requirements on broker-dealers who sell penny stock to persons other than established customers and accredited investors, as defined in Regulation D promulgated under the Securities Act. For transactions covered by these rules, broker-dealers must make a special suitability determination for the purchase of such security and must have the purchasers written consent to the transaction prior to the purchase. Additionally, for any transaction involving a penny stock, unless exempt the rules require the delivery, prior to the first transaction of a risk disclosure document, prepared by the SEC, relating to the penny stock market. A broker-dealer also must disclose the commissions payable to both the broker-dealer and the registered representative and current quotations for the securities. Finally, monthly statements must be sent disclosing recent price information for the penny stocks held in an account and information to the limited market in penny stocks. Consequently, these rules may restrict the ability of broker-dealer to trade and/or maintain a market in our common stock and may affect the ability of the Companys stockholders to sell their shares of common stock.\nSecurities Authorized for Issuance under Equity Compensation Plans\nIn March 2020, our board of directors adopted subject to the closing of the Acquisition, and stockholders approved the 2020 Equity Incentive Plan.\nUnder the 2020 Equity Incentive Plan, we may grant equity-based incentive awards, including options, restricted stock, and other stock-based awards, to any directors, employees, advisers, and consultants that provide services to us or any of our subsidiaries on terms and conditions that are from time to time determined by us. An aggregate of up to 2,000,000 of our common stock are reserved for issuance under the 2020 Plan. No grants under the 2020 Plan are outstanding as of March 31, 2021. The purpose of the 2020 Plan is to provide financial incentives for selected directors, employees, advisers, and consultants of the Company and/or its subsidiaries, thereby promoting the long-term growth and financial success of the Company. The board of directors believes that the 2020 Plan will serve a critical role in attracting and retaining high caliber employees, consultants and directors essential to our success and in motivating these individuals to strive to meet our goals.\nThe table below sets forth information as of March 31, 2022 with respect to compensation plans under which our common stock is authorized for issuance.\n(a) (b) (c)\nPlan Category Number of securities to be\nissued upon exercise of\noutstanding options,\nwarrants and rights\nWeighted-average\nexercise price of\noutstanding options,\nwarrants and rights\nNumber of securities\nremaining available for\nfuture issuance under\nequity compensation plans\n(excluding securities\nreflected in column (a))\nEquity compensation plans approved by security holders - $          -  2,000,000\nEquity compensation plans not approved by security holders - $ - -\nTotal -\n2,000,000\nRecent Sales of Unregistered Securities\nDuring the year ended March 31, 2022, we issued an aggregate of 1,314,827 shares of our common stock to consultants as consideration for services. The securities were issued in private transactions in reliance upon an exemption from registration pursuant to Section 4(a)(2) of the Securities Act, as transactions not involving any public offering. Pursuant to one of the consulting agreements, the Company issued a common stock purchase Warrant for 166,667 shares of the Companys common stock. The Warrant has an exercise price of $0.30 per share, subject to customary adjustments (including anti-dilution adjustments), and may be exercised at any time until the three year anniversary of the Warrant.\nDuring the year ended March 31, 2022, we issued 4,626,339 shares of our common stock upon conversion of outstanding indebtedness held by a holder of our indebtedness. Such shares were issued in reliance on the exemption from registration provided by Section 4(a)(2) of the Securities Act of 1933, as amended, as no general solicitation or advertising was used in the offer and sale of such securities.\nDuring the year ended March 31, 2022, we issued 1,600,000 shares of our common stock upon extension of outstanding indebtedness held by a holder of our indebtedness. Such shares were issued in reliance on the exemption from registration provided by Section 4(a)(2) of the Securities Act of 1933, as amended, as no general solicitation or advertising was used in the offer and sale of such securities.\nDuring the year ended March 31, 2022, the Company issued 454,545 shares of common stock to an investor pursuant to the terms of a Stock Purchase Agreement. The shares were issued in reliance on the exemption from registration provided by Section 4(a)(2) of the Securities Act, as no general solicitation was used in the offer and sale of such securities, and/or Regulation S promulgated under the Securities Act as the investor is a non-U.S. person and the offer was made in an offshore transaction.\nDuring the year ended March 31, 2022, the Company entered into a Securities Purchase Agreement (the Purchase Agreement) dated as of June 24, 2021 (the Issuance Date) and issued and sold to Auctus Fund, LLC (the Investor), a Senior Secured Promissory Note (the Note) in the principal amount of $650,000 (the Capital Raise). Also pursuant to the Purchase Agreement, in connection with the issuance of the Note, the Company issued two common stock purchase warrants (separately, the First Warrant and the Second Warrant and together, the Warrants) to the Investor, each allowing the Investor to purchase an aggregate of 4,333,333 shares of the Companys common stock (the Common Stock). The Second Warrant is subject to cancellation pursuant to the terms of the Note, and may not be exercised until the Trigger Date (as defined in the Second Warrant). The Warrants each have an exercise price of $0.15 per share, subject to customary adjustments (including anti-dilution adjustments), and may be exercised at any time until the three year anniversary of the Warrants; provided, however, in the event the Company repays the Note in its entirety on or prior to the Maturity Date, the Second Warrant shall automatically expire and may only be exercised in the event it does not so automatically expire. The Warrants include a cashless exercise provision as set forth therein. The Note and the Warrants each was, and, unless subsequently registered, the shares underlying the Warrants will be, issued in reliance on the exemption from registration provided by Section 4(a)(2) of the Securities Act and/or Regulation D promulgated thereunder, as no general solicitation was used in the offer and sale of such securities. Item 6. Selected Financial Data\nNot applicable. Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations\nYou should read the following discussion and analysis of financial condition and results of operations of the Company together with our financial statements and the related notes included in Item 8, Financial Statements and Supplementary Data, of this Annual Report on Form 10-K. Some of the information contained in this discussion and analysis or set forth elsewhere in this Annual Report on Form 10-K, including information with respect to our plans and strategy for our business, includes forward-looking statements that involve risks and uncertainties. You should review the Risk Factors section of this Annual Report on Form 10-K for a discussion of important factors that could cause actual results to differ materially from the results described in or implied by the forward-looking statements contained in the following discussion and analysis.\nOverview\nOn April 17, 2020, we entered into the Exchange Agreement with Omnia Corp. and the beneficial stockholders of Omnia Corp. to acquire 100% of the issued and outstanding shares of capital stock of Omnia Corp. The transactions contemplated by the Exchange Agreement were consummated on January 5, 2021 and, pursuant to the terms of the Exchange Agreement, among other things, all outstanding Omnia Corp. Shares were exchanged for shares of our common stock, par value $0.001 per share, based on the exchange ratio of one share of our common stock for every one Omnia Corp. Share. Accordingly, we acquired 100% of Omnia Corp. in exchange for the issuance of 10,000,000 shares of our common stock and Omnia Corp. became our wholly-owned subsidiary. As of the Closing, Mr. Amer Samad, formerly our sole director and executive officer, agreed to cancel 52,656,888 (pre-stock split) shares of our common stock owned beneficially and of record by him as part of the conditions to Closing, which were cancelled immediately after the Closing. The Company also issued an aggregate of 1,269,665 shares of common stock on January 5, 2021 as a result of the conversion in accordance with their terms of outstanding convertible promissory notes in the aggregate principal amount of approximately $539,000.\nAs of immediately prior to the closing of the Acquisition, we entered into an Assignment and Assumption Agreement with RZI Consulting LLC (the Assignment Agreement), pursuant to which RZI Consulting LLC assumed substantially all of our remaining assets and liabilities through the closing of the Acquisition. Accordingly, as of the closing of the Acquisition, we had no assets or liabilities (other than relating to general and administrative expenses).\nOur sole business is the business of Omnia Corp. Our managements discussion and analysis below is based on the financial results of the combined company for the fiscal years ended March 31, 2021 and 2020. Except as otherwise indicated herein, all share and per share information in this Managements Discussion and Analysis of Financial Condition and Results of Operations section gives retroactive effect to the exchange of Omnia Corp. Shares for shares of our common stock in the Acquisition. The following discussion and analysis provides information which we believe to be relevant to an assessment and understanding of the results of operations and financial condition of the Company.\nWe develop and market products for wellness and physical therapy markets, using patented dry-hydro therapy equipment that the Company plans to offer and sell in medical and fitness markets.\nSignificant Accounting Policies and Estimates\nThe discussion and analysis of the financial condition and results of operations are based upon the financial statements, which have been prepared in accordance with accounting principles generally accepted in the United States. The preparation of consolidated financial statements in conformity with accounting principles generally accepted in the United States requires us to make estimates and assumptions that affect the reported amounts of assets and liabilities, disclosure of any contingent liabilities at the financial statement date and reported amounts of revenue and expenses during the reporting period. On an on-going basis we review our estimates and assumptions. The estimates were based on historical experience and other assumptions that we believe to be reasonable under the circumstances. Actual results are likely to differ from those estimates under different assumptions or conditions, but we do not believe such differences will materially affect our financial position or results of operations.\nResults of Operations\nWe have incurred recurring losses to date. Our financial statements have been prepared assuming that we will continue as a going concern and, accordingly, do not include adjustments relating to the recoverability and realization of assets and classification of liabilities that might be necessary should we be unable to continue in operation.\nWe expect we will require additional capital to meet our long-term operating requirements. We expect to raise additional capital through, among other things, the sale of equity or debt securities.\nFiscal Year Ended March 31, 2022 Compared to the Fiscal Year Ended March 31, 2021\nRevenues\nTotal revenue was $290,715 for the year ended March 31, 2022, compared to $218,874 for the year ended March 31, 2021. The increased revenue during 2022 is due to a targeted marketing program to gyms and medical facilities.\nCost of Goods Sold\nTotal cost of goods sold was $77,327 for the year ended March 31, 2022, compared to $120,253 for the year ended March 31, 2021. The decrease in cost of goods sold in 2022 was mainly due to the Company operating with current inventory, having written down obsolete items in 2021.\nOperating expenses\nTotal operating expenses was $3,608,929 for the year ended March 31, 2022, compared to $1,722,161 for the year ended March 31, 2021. There was increased depreciation and amortization, legal and professional fees, payroll expenses, consulting expenses, general and administrative expenses, and research and development costs in 2022 as Omnia Corp. continued to build its business, offset by a decrease in selling and marketing expenses, related party consulting fees, and warranty expense.\nInterest expenses and finance costs\nInterest expense and finance costs was $2,689,870 for the year ended March 31, 2022, compared to $611,536 for the year ended March 31, 2021. The increase in interest expense is due to the issuance of additional promissory notes to investors in 2022.\nNet Loss\nThe net loss for the fiscal year ended March 31, 2022 was $(5,522,578), resulting in loss per share of $(0.02), compared to net loss for the period ending March 31, 2021 of $(2,235,075) resulting in loss per share of $(0.01).\nLiquidity and Capital Resources\nWe have historically funded operations through the issuance of loans, evidenced by convertible and non-convertible promissory notes. Since inception, we have raised an aggregate of $6,231,000 through the sale of such promissory notes, of which approximately $5,879,205 principal amount remains outstanding and either is currently due and continuing to accrue default interest, or will be due in 2022. Additionally, in 2020 and 2021 we received funding of $588,891 pursuant to the federal Paycheck Protection Program under the Coronavirus Aid, Relief and Economic Security (CARES) Act, all of which was forgiven in May 2021.\nBased on our current burn rate, we need to raise additional capital in the short term to fund operations and meet expected future liquidity requirements, as well as to repay our remaining existing total indebtedness of approximately $7,442,642, if not converted to equity, or we will be required to curtail or terminate some or all of our product lines or our operations. We are continuously in discussions to raise additional capital, which may include or be a combination of convertible or term loans and equity which, if successful, will enable us to continue operations based on our current burn rate, for the next 12 months; however, we cannot give any assurance at this time that we will successfully raise all or some of such capital or any other capital. Furthermore, at this time, we do not have an established source of funds sufficient to cover operating costs after July 2022. Funds raised, if any, during 2022, are anticipated to fund not just repayment of existing obligations, but our ongoing operations including validating the business model for Relaxation Centers, hiring additional personnel, and expanding the revenue share model with additional facilities.\nWe do not currently have available funds to repay currently-due liabilities of approximately $5,462,466 or to repay indebtedness that is expected to become due in 2022, and are exploring refinancing, extending the maturity date and/or converting some or all of such indebtedness into equity.\nThere can be no assurance that necessary debt or equity financing will be available, or will be available on terms acceptable to us, in which case we may be unable to meet our obligations or fully implement our business plan, if at all. These conditions raise substantial doubt about the Companys ability to continue as a going concern. The accompanying condensed consolidated financial statements do not include any adjustments to reflect the possible future effects on recoverability and reclassification of assets or the amounts and classification of liabilities that may result from the outcome of this uncertainty.\nAdditionally, we will need additional funds to respond to business opportunities including potential acquisitions of complementary technologies, protect our intellectual property, develop new lines of business, and enhance our operating infrastructure. While we may need to seek additional funding for any such purposes, we may not be able to obtain financing on acceptable terms, or at all. In addition, the terms of our financings may be dilutive to, or otherwise adversely affect, holders of our common stock. However, the recent COVID-19 pandemic has presented unprecedented challenges to businesses and the investing landscape around the world. Therefore, there can be no assurance that managements plans will be successful. We may not be able to negotiate any such arrangements on acceptable terms, if at all. If we are unable to obtain additional funding on a timely basis, we may be required to curtail or terminate some or all of our product lines or our operations.\nAs a result of the COVID-19 pandemic and actions taken to slow its spread, the global credit and financial markets have experienced extreme volatility, including diminished liquidity and credit availability, declines in consumer confidence, declines in economic growth, increases in unemployment rates and uncertainty about economic stability. There can be no assurance that further deterioration in credit and financial markets and confidence in economic conditions will not occur. If equity and credit markets deteriorate, it may make any necessary debt or equity financing more difficult to obtain, more costly and/or more dilutive. Any of these actions could materially harm our business, results of operations and future prospects.\nGoing Concern\nThe Company is commencing operations to generate sufficient revenue; however, the Companys cash position is not currently and, in the future, may not be sufficient to support the Companys daily operations. Management intends to raise additional funds by way of a private or public offering but can give no assurance of success. While the Company believes in the viability of its strategy to commence operations and generate sufficient revenue and in its ability to raise additional funds, there can be no assurances to that effect. The ability of the Company to continue as a going concern is dependent upon the Companys ability to further implement its business plan and generate sufficient revenue and its ability to raise additional funds by way of private offering. The financial statements do not include any adjustments related to the recoverability and classification of recorded asset amounts or the amounts and classification of liabilities that might be necessary should the Company be unable to continue as a going concern.\nOff-Balance Sheet Arrangements\nWe had no off-balance sheet transactions. Item 7A. Quantitative and Qualitative Disclosures About Market Risk\nNot applicable. Item 8. Financial Statements and Supplementary Data\nPage\nReport of Independent Registered Public Accounting Firm PCAOB ID : 5041\nConsolidated Balance Sheets, March 31, 2022 and 2021\nConsolidated Statements of Operations for the years ended March 31, 2022 and 2021\nConsolidated Statements of Changes in Stockholders Deficit for the years ended March 31, 2022 and 2021\nConsolidated Statements of Cash Flows for the years ended March 31, 2022 and 2021\nNotes to the Consolidated Financial Statements 35-49\nReport of Independent Registered Public Accounting Firm\nTo the shareholders and the board of directors of Omnia Wellness Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Omnia Wellness Inc. as of March 31, 2022 and 2021, the related statements of operations, stockholders equity (deficit), and cash flows for the years then ended, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of March 31, 2022 and 2021, and the results of its operations and its cash flows for the years then ended, in conformity with accounting principles generally accepted in the United States.\nSubstantial Doubt about the Companys Ability to Continue as a Going Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 3 to the financial statements, the Company has suffered recurring losses from operations and has a significant accumulated deficit. In addition, the Company continues to experience negative cash flows from operations. These factors raise substantial doubt about the Companys ability to continue as a going concern. Managements plans in regard to these matters are also described in Note 3. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audit provides a reasonable basis for our opinion.\n/S/ BF Borgers CPA PC\nBF Borgers CPA PC\nWe have served as the Companys auditor since 2016\nLakewood, CO\nOmnia Wellness Inc.\nConsolidated Balance Sheet\nYear Ended\nMarch 31, 2022 Year Ended\nMarch 31, 2021\nASSETS\nCurrent assets:\nCash $ 1,894 $ 28,761\nAccounts receivable 206,949 38,341\nDue from related parties 2,780 163,200\nAdvances on inventory - 16,000\nInventory 24,000 -\nTotal current assets 235,623 246,302\nNon-current assets:\nFixed assets, net 515,113 314,377\nIntangible assets, net 1,450,900 1,600,975\nROU assets, net 160,197 -\nTotal non-current assets 2,126,210 1,915,352\nTotal assets $ 2,361,832 $ 2,161,654\nLIABILITIES AND STOCKHOLDERS DEFICIT\nCurrent liabilities:\nAccounts payable and accrued liabilities $ 562,213 $ 103,205\nAccounts payable, related party - 1,500\nDeposit liability 8,002 21,764\nAccrued interest 615,261 427,910\nLease liability 99,464 -\nWarranty liability 25,667 25,667\nRoyalty Liability 143,817\nNonconvertible notes, related party 1,102,735 834,653\nNonconvertible notes 1,765,219 1,745,000\nConvertible notes, related party 29,970 29,970\nConvertible notes 1,229,443 1,107,143\nTotal current liabilities 5,581,790 4,296,812\nNon-current liabilities:\nAdvances due to related party 143,239 -\nLease liability 80,099\nPPP Loan - 588,891\nSenior secured notes 675,000 -\nNonconvertible notes, related party 891,920 509,972\nNonconvertible notes 189,918 174,620\nTotal non-current liabilities 1,980,176 1,273,483\nTotal liabilities 7,561,966 5,570,294\nStockholders deficit:\nStock Payable 642,867 -\nPreferred stock; 150,000,000 shares authorized; no shares issued or outstanding - -\nCommon stock; $0.001 par value, 1,500,000,000 shares authorized; 232,222,818 and 224,227,107 issued and outstanding, respectively 232,223 14,900\nCommon stock subscribed: $0.001 par value subscribed common shares, 2,500,000 and -0- shares outstanding, respectively 2,500\n-\nAdditional paid-in capital 5,344,318 2,065,923\nAccumulated deficit (11,012,042 ) (5,489,464 )\nSubscription Receivable (410,000\n) -\nTotal stockholders deficit (5,200,134 ) (3,408,640 )\nTotal liabilities and stockholders deficit $ 2,361,832 $ 2,161,654\nThe accompanying notes are an integral part of these consolidated financial statements.\nOmnia Wellness Inc.\nConsolidated Statements of Operations\nYear Ended Year Ended\nMarch 31, 2022 March 31, 2021\nRevenue\nSales, net $ 286,284 $ 218,124\nLease income 2,694 -\nFreight and delivery income 1,737\nTotal revenue 290,715 218,874\nCost of goods sold\nCost of goods sold 77,327 120,253\nTotal cost of goods sold 77,327 120,253\nGross Profit 213,388 98,621\nOperating expenses:\nWarranty expense - 13,399\nDepreciation and amortization 322,317 272,779\nLegal and professional fees 321,092 177,589\nPayroll expense 335,509 240,395\nSelling and marketing expense 62,996 52,804\nSelling and marketing expense, related party 356,261\nConsulting 1,020,154 25,985\nConsulting, related party 13,620 244,186\nLicense royalties - 33,771\nRoyalty Expense 143,817\nGeneral and administrative 370,139 304,992\nResearch and development 1,019,200 -\nTotal operating expenses 3,608,929 1,722,161\nOther (income) expense:\nGain on PPP loan forgiven (593,546 ) -\nLoss on debt settlement 30,713 -\nInterest expense and finance costs 2,689,870 611,536\nTotal other (income) expense 2,127,037 611,536\nNet loss (5,522,578 ) (2,235,075 )\nNet loss per common share - basic and diluted $ (0.02 ) $ (0.01 )\nWeighted average common shares outstanding-basic and diluted\n227,242,753 191,762,740\nThe accompanying notes are an integral part of these consolidated financial statements.\nOmnia Wellness Inc.\nConsolidated Statements of Changes in Stockholders (Deficit)\nCommon Stock Shares Common Stock Par Value\nCommon Stock Receivable Preferred Stock Shares Preferred Stock Value Stock Payable\nSubscription Receivable Additional Paid-in Capital Accumulated Deficit Total\nBalance, March 31, 2020 264,384,488 $ 55,058\n$ -\n- $ - $ -\n$ -\n$ (10,224 ) $ (77,847 ) $ (33,013 )\nChange in shares issued (40,157,381 ) (40,158 )\n-\n- - -\n-\n- - (40,158 )\nConversion of debt - -\n-\n- - -\n-\n2,076,147 - 2,076,147\nReverse merger, consolidation adjustment - -\n-\n- - -\n-\n- (3,176,541 ) (3,176,541 )\nNet loss - -\n-\n- - -\n-\n- (2,235,075 ) (2,235,075 )\nBalance, March 31, 2021 224,227,107 $ 14,900\n$ -\n- $ - $ -\n$ -\n$ 2,065,923 $ (5,489,464 ) $ (3,408,640 )\nReclass par value of shares - 209,327\n-\n- - -\n-\n(209,327 ) - -\nBeneficial conversion feature on convertible notes - -\n-\n- - -\n-\n914,075 - 914,075\nSubscription Receivable - -\n-\n- - -\n(410,000 ) - - (410,000 )\nCommon Stock Recievable\n2,500\n(2,500 )\n-\nStock issued for conversion of debt 4,626,339 4,626\n-\n- - 150,867\n-\n819,757 - 975,250\nStock issued for note extensions 1,600,000 1,600\n-\n- - 15,000\n-\n670,400 - 687,000\nStock issued for consulting 1,314,827 1,315\n-\n- - 64,500\n-\n418,785 - 484,600\nStock issued at $0.16 - -\n-\n- - 287,500\n-\n- - 287,500\nStock issued at $0.17 - -\n-\n- - 125,000\n-\n- - 125,000\nStock issued at $0.22 454,545\n-\n- - -\n-\n99,545 - 100,000\nWarrants issued - -\n-\n- - -\n-\n567,660\n567,660\nNet loss - -\n- -\n-\n- (5,522,578 ) (5,522,578 )\nBalance, March 31, 2022 232,222,818 $ 232,223\n$ 2,500\n- $ - $ 642,867\n$ (410,000\n) $ 5,344,318 $ (11,012,042 ) $ (5,200,134 )\nThe accompanying notes are an integral part of these consolidated financial statements.\nOmnia Wellness Inc.\nConsolidated Statements of Cash Flows\nYear Ended Year Ended\nMarch 31, 2022 March 31, 2021\nCash flows from operating activities:\nNet loss $ (5,522,578 ) $ (2,235,075 )\nAdjustments to reconcile net loss to net cash used in operating activities:\nDepreciation and amortization 218,590 272,779\nBCF on convertible notes 914,076 -\nLoss on debt settlement 30,713 -\nStock based compensation 484,600 -\nAmortization of ROU asset 104,266 -\nAmortization of warrants 567,660 -\nDiscount on notes 25,000 -\nRoyalty on Sales 143,817 -\nFinance costs related to note payable 216,506 -\nFinance costs paid in stock 672,000 -\nGain on PPP loan forgiven (593,546 ) -\nRent payments on lease liability (84,899 ) -\nBad debt expense (2,200 ) -\nChange in:\nAccounts receivables, net (168,608 ) (38,341 )\nDue from related parties 160,420 (163,200 )\nInventory (24,000 ) -\nDeposits (13,762 ) -\nAdvance payments on purchase of inventory, related party 16,000 (16,000 )\nAccounts payable and accrued liabilities 427,508 152,136\nInterest payable 261,755 413,443\nNet cash used - operating activities (2,166,683 ) (1,614,258 )\nCash flows from investing activities:\nPurchase of fixed assets (269,251 ) (387,131 )\nPayments on license agreement, related party - (1,801,000 )\nNet cash used - investing activities (269,251 ) (2,188,131 )\nCash flows from financing activities:\nSubscriptions receivable (410,000 ) -\nProceeds from advances 606,158\nProceeds from loans payable 2,860,000 4,971,703\nPayments on loans payable (684,672 ) -\nPayments on advances (432,920 )\nIncrease in stock subscription payable 370,500\nProceeds from issuing stock net of offering costs 100,000\nChange in shareholders equity, net - (1,100,394 )\nChange in common stock - (40,158 )\nNet cash provided - financing activities 2,409,066 3,831,151\nNet increase (decrease) in cash (26,867 ) 28,761\nCash - beginning of year 28,761 -\nCash - end of year $ 1,894 $ 28,761\nSupplemental disclosures of cash flow information\nNon-cash investing and financing activities:\nIssuance of common stock for notes payable $ 905,500\nIssuance of common stock for interest payable $ 69,750\nThe accompanying notes are an integral part of these consolidated financial statements.\nOmnia Wellness Inc.\nNotes to the Consolidated Financial Statements\n1. NATURE OF OPERATIONS\nOmnia Wellness Inc. (the Company) was incorporated as a Nevada corporation on March 2, 2016 by the filing of articles of incorporation with the Secretary of State of the State of Nevada under the name Glolex, Inc.\nOn June 25, 2019, Maksim Charniak, the Companys then sole executive officer and director and the owner of 3,000,000 shares (pre-stock split) of the Companys common stock, sold all of his shares of common stock of the Company to Amer Samad, resulting in a change of control of the Company. As part of that transaction, Mr. Charniak resigned from all of his officer and director positions, and Mr. Samad was appointed as the Chief Executive Officer, President, Chief Financial Officer and Secretary of the Company, and was appointed to the Board of Directors of the Company. Mr. Samad also purchased 1,167,937 shares (pre-stock split) of the Companys common stock in a series of private transactions, resulting in Mr. Samad owning 4,167,937 shares (pre-stock split) of the Companys common stock, or approximately 95.6% of the issued and outstanding common stock of the Company.\nOn March 5, 2020, the Company filed Amended and Restated Articles of Incorporation with the Secretary of State of the State of Nevada to, among other things, (i) increase the Companys authorized shares of common stock from 75,000,000 to 100,000,000, (ii) create and authorize 10,000,000 shares of blank check preferred stock, and (iii) effect a 12.6374:1 forward stock split of the common stock. In addition, on March 16, 2020, the Company filed a Certificate of Amendment to its Amended and Restated Articles of Incorporation with the Secretary of State of the State of Nevada to change the name of the Company from Glolex Inc. to Omnia Wellness Inc. On April 15, 2020, the stock of the Company began trading on the OTC Pink market under the symbol OMWS.\nOn April 17, 2020, the Company entered into a Share Exchange and Reorganization Agreement (the Exchange Agreement) with Omnia Wellness Corporation (formerly known as Bed Therapies Inc.), a Texas corporation (Omnia Corp.), and the beneficial stockholders of Omnia Corp. to acquire 100% of the issued and outstanding shares of capital stock of Omnia Corp. The transactions contemplated by the Exchange Agreement were consummated on January 5, 2021, and, pursuant to the terms of the Exchange Agreement, among other things, all outstanding shares of common stock of Omnia Corp., no par value, or the Omnia Corp. Shares, were exchanged for shares of the Companys common stock, par value $0.001 per share, based on the exchange ratio of one share of the Companys common stock for every one Omnia Corp. Share. The Company refers herein to the transactions contemplated by the Exchange Agreement, collectively, as the Acquisition. Accordingly, the Company acquired 100% of Omnia Corp. in exchange for the issuance of 10,000,000 (not adjusted to reflect the Companys 15:1 forward stock split on April 6, 2021) shares of the Companys common stock and Omnia Corp. became the Companys wholly-owned subsidiary. As of the closing of the Acquisition (the Closing), Mr. Samad, resigned as an officer and director of the Company and agreed to cancel 52,656,888 (pre-stock split) shares of the Companys common stock owned beneficially and of record by him as part of the conditions to Closing, which were cancelled immediately following the Closing. The Company also issued an aggregate of 1,269,665 (pre-stock split) shares of common stock on January 5, 2021 as a result of the conversion in accordance with their terms of outstanding convertible promissory notes in the aggregate principal amount of approximately $539,000.\nAs of immediately prior to the closing of the Acquisition, the Company entered into an Assignment and Assumption Agreement with RZI Consulting LLC (the Assignment Agreement), pursuant to which RZI Consulting LLC assumed substantially all of the Companys remaining assets and liabilities through the closing of the Acquisition. Accordingly, as of the closing of the Acquisition, the Company had no assets or liabilities (other than relating to general and administrative expenses).\nFollowing the Acquisition, the Company, through its wholly-owned subsidiary Omnia Corp., now develops and markets products for wellness and physical therapy markets, using patented dry-hydro therapy equipment that the Company plans to offer and sell in medical and fitness markets.\nOmnia Wellness Inc.\nNotes to the Consolidated Financial Statements\nOn April 6, 2021, the Company filed a Certificate of Change with the Secretary of State of the State of Nevada to (i) increase the Companys authorized shares of common stock from 100,000,000 to 1,500,000,000, (ii) increase the Companys authorized shares of blank check preferred stock from 10,000,000 to 150,000,000, and (iii) effect a 1:15 forward stock split of the common stock.\nThe Companys principal executive office is located at 999 18th St., Suite 3000, Denver, CO 80202, and its telephone number is 303-325-3738. The Companys website address is www.omniawellness.com.\nIn March 2020 the World Health Organization declared COVID-19 a pandemic. The Company is still assessing the impact COVID-19 may have on its business, but there can be no assurance that this analysis will enable the Company to avoid part or all of any impact from the spread of COVID-19 or its consequences, including downturns in business sentiment generally. The extent to which the COVID-19 pandemic and global efforts to contain its spread will impact the Companys operations will depend on future developments, which are highly uncertain and cannot be predicted at this time, and include the duration, severity and scope of the pandemic and the actions taken to contain or treat the COVID-19 pandemic.\n2. SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nThe principal accounting policies applied in the preparation of these financial statements are set out below.\nBasis of Presentation - The consolidated financial statements have been prepared in accordance with accounting principles generally accepted in the United States of America (GAAP).\nPrinciples of Consolidation - The consolidated financial statements include accounts of the Companys wholly-owned subsidiary Omnia Wellness Corp., and Omnia Wellness Corp.s wholly-owned subsidiary Solajet™ Financing Company, LLC. All significant intercompany balances and transactions have been eliminated in consolidation.\nAccounting Estimates - The preparation of financial statements in conformity with GAAP requires management to make estimates and assumptions that affect the reported amounts in the financial statements and the accompanying notes. Such estimates and assumptions impact, among others, the following: the allowance for doubtful accounts, determination of impairment on investments and determination of recoverability of deferred tax assets. Actual results could differ from those estimates.\nRisks and Uncertainties - The Companys operations may be subject to significant risk and uncertainties including financial, operational, regulatory and other risks associated with a start-up company, including the potential risk of business failure. See Note 3 regarding going concern matters.\nLoss Per Common Share - Basic net loss per common share is computed by dividing the net loss applicable to common stockholders by the weighted average number of common shares outstanding for each period presented. Diluted net loss per common share is computed by giving effect to all potential shares of Common Stock, including stock options and warrants, to the extent dilutive. As of March 31, 2022 and 2021, there were 227,242,753 and 191,762,740, respectively, of common stock equivalents.\nCash - In the consolidated statement of cash flows, cash includes cash in hand and other short-term highly liquid investments with original maturities of three months or less. The Company places its cash on deposit with financial institutions it believes to be of high quality.\nAccounts Receivable - Accounts receivable balances are established for amounts owed to the Company from its customers from the sale of products and services. The Company closely monitors the collectability of outstanding accounts receivable and provide an allowance for doubtful accounts based on estimated collections of outstanding amounts. The Company evaluated the accounts receivable and determined no collection loss reserve was necessary. There were $206,949 and $38,341 in outstanding accounts receivable as of March 31, 2022 and 2021 respectively.\nOther Receivable - During the year ended March 31, 2022, the Company advanced $410,000 to Drywave under no specific terms. As of March 31, 2022, we have a recorded receivable for this advance on the consolidated balance sheet. There were $410,000 and $-0- outstanding other receivable as of March 31, 2022 and 2021 respectively.\nOmnia Wellness Inc.\nNotes to the Consolidated Financial Statements\nRelated Party Transactions - The Company follows subtopic 850-10 of the FASB Accounting Standards Codification for the identification of related parties and disclosure of related party transactions. Pursuant to Section 850-10-20 the related parties include (a) affiliates of the Company (Affiliate means, with respect to any specified Person, any other Person that, directly or indirectly through one or more intermediaries, controls, is controlled by or is under common control with such Person, as such terms are used in and construed under Rule 405 under the Securities Act); (b) entities for which investments in their equity securities would be required, absent the election of the fair value option under the Fair Value Option Subsection of Section 825-10-15, to be accounted for by the equity method by the investing entity; (c) trusts for the benefit of employees, such as pension and profit-sharing trusts that are managed by or under the trusteeship of management; (d) principal owners of the Company; (e) management of the Company; (f) other parties with which the Company may deal if one party controls or can significantly influence the management or operating policies of the other to an extent that one of the transacting parties might be prevented from fully pursuing its own separate interests; and (g) other parties that can significantly influence the management or operating policies of the transacting parties or that have an ownership interest in one of the transacting parties and can significantly influence the other to an extent that one or more of the transacting parties might be prevented from fully pursuing its own separate interests. The financial statements shall include disclosures of material related party transactions, other than compensation arrangements, expense allowances, and other similar items in the ordinary course of business. However, disclosure of transactions that are eliminated in the preparation of consolidated or combined financial statements is not required in those statements. The disclosures shall include: (a) the nature of the relationship(s) involved; (b) a description of the transactions, including transactions to which no amounts or nominal amounts were ascribed, for each of the periods for which income statements are presented, and such other information deemed necessary to an understanding of the effects of the transactions on the financial statements; (c) the dollar amounts of transactions for each of the periods for which income statements are presented and the effects of any change in the method of establishing the terms from that used in the preceding period; and (d) amounts due from or to related parties as of the date of each balance sheet presented and, if not otherwise apparent, the terms and manner of settlement.\nAdvance Payments on Purchases of Inventory, related party - Advance payments on purchases of inventory consists of hydro-therapy beds and related equipment that are held by DryRx, a company owned and controlled by the Chairmans brother, under a Contract Services Agreement until ownership is transferred, which is when a sale or a use of the bed and equipment occurs and beds are placed in service. The value of the advance payments is stated at the lower of cost or market, determined using the first in, first-out method. Inventory held by third parties in use, which is inventory installed at a third-party location and ownership is maintained by the Company, is re-classified to fixed assets and depreciated over its useful life using the straight-line method of depreciation. All inventory held as advance payments on purchases of inventory are available either for sale or for use to be installed at third-party locations and not transferred until a transaction has occurred. The balance of advance payments on purchases of inventory was $-0- and $16,000 as of March 31, 2022 and 2021, respectively.\nFixed Assets - Fixed assets are carried at cost less accumulated depreciation and amortization. Depreciation is computed using the straight-line method over the estimated useful lives. The fixed assets include equipment placed in service at certain locations which ownership is maintained by the Company. The accumulated depreciation was calculated to be $194,219 and $108,746 as of March 31, 2022, and 2021, respectively.\nPatent Cost - Patents with a finite useful life that are acquired through the license agreement are carried at cost less accumulated amortization and accumulated impairment losses. Amortization is recognized on a straight-line basis over their estimated useful lives. The estimated useful life and amortization method are reviewed at the end of each reporting period, with the effect of any impairment changes being accounted for on an annual basis. The expected life of the current patent recorded is expected to be 10 years. The accumulated amortization was calculated to be $550,100 and $362,500 as of March 31, 2022 and 2021, respectively.\nLeases - Operating lease right of use (ROU) assets represent the right to use the leased asset for the lease term and operating lease liabilities are recognized based on the present value of the future minimum lease payments over the lease term at commencement date. As most leases do not provide an implicit rate, the Company uses an incremental borrowing rate based on the information available at the adoption date in determining the present value of future payments. Lease expense for minimum lease payments is amortized on a straight-line basis over the lease term and is included in operating expenses in the consolidated statements of operations.\nOmnia Wellness Inc.\nNotes to the Consolidated Financial Statements\nLicense Payable, related party - License payable is the remaining balance due for the initial intangible asset cost. License payable is classified as current liabilities if payment is due within one year or less. If not, they are presented as non-current liabilities.\nWarranty Liability - For sales to customers, the Company provides a warranty on the beds sold which includes, a three-year warranty on parts, a five-year warranty on the frame and a 90 day warranty on any labor. Warranty liability is accrued and is estimated at 5% of monthly sales and adjusted for actual repairs, replacements, and warranties as they are incurred. The Company periodically assesses the adequacy of our recorded warranty liability and records adjustments as claims data and experience warrants.\nBeneficial Conversion Features - The Company accounts for convertible notes payable in accordance with ASC 470-20. A beneficial conversion feature (BCF) is a non-detachable conversion feature that is in the money at the commitment date, which requires recognition of interest expense for underlying debt instruments and a deemed dividend for underlying equity instruments. A conversion option is in the money if the effective conversion price is lower than the commitment date fair value of a share into which it is convertible. As of March 31, 2022 and 2021, the Company did not have any conversion options that were in the money.\nDerivatives - The Company accounts for derivative instruments in accordance with ASC815 and ASC470, which establishes accounting and reporting standards for derivative instruments and hedging activities, including certain derivative instruments embedded in other financial instruments or contracts and requires recognition of all derivatives on the balance sheet at fair value, regardless of hedging relationship designation. Accounting for changes in fair values of the derivative instruments depends on whether the derivatives qualify as hedging relationships and the types of relationships designated are based on the exposures hedged. At March 31, 2022 and 2021, the Company did not have any derivative instruments that were designated as hedges.\nRevenue - Revenue Recognition Standard, ASC 606 is used by the Company to recognize revenue. ASC 606 standards were jointly issued by the Financial Accounting Standards Board (FASB) and the International Accounting Standards Board (IASB). The five conditions of ASC 606 applied to revenue are: 1. Identify the contract with the customer; 2. Identify the performance obligations in the contract; 3. Determine the transaction price; 4. Allocate the transaction price to separate performance obligations; and 5. Recognize revenue as each performance obligation is satisfied.\nThe Company derives its revenues primarily from the usage fees and sales of hydrotherapy massage beds and installation services. Revenues from sales are recognized when the products are sold and delivered to its customers and the usage fees are earned based on subscription or actual usage. Sales taxes and other taxes the Company collects concurrent with revenue-producing activities are excluded from revenue. Shipping and handling fees charged to customers are reported within revenue.\nIncome Taxes - The Company accounts for income taxes under Section 740-10-30 of the FASB Accounting Standards Codification. Deferred income tax assets and liabilities are determined based upon differences between the financial reporting and tax bases of assets and liabilities and are measured using the enacted tax rates and laws that will be in effect when the differences are expected to reverse. Deferred tax assets are reduced by a valuation allowance to the extent management concludes it is more likely than not that the assets will not be realized. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in the statements of operations in the period that includes the enactment date.\nOmnia Wellness Inc.\nNotes to the Consolidated Financial Statements\nThe Company adopted section 740-10-25 of the FASB Accounting Standards Codification (Section 740-10-25). Section 740-10-25 addresses the determination of whether tax benefits claimed or expected to be claimed on a tax return should be recorded in the financial statements. Under Section 740-10-25, the Company may recognize the tax benefit from an uncertain tax position only if it is more likely than not that the tax position will be sustained on examination by the taxing authorities, based on the technical merits of the position. The tax benefits recognized in the financial statements from such a position should be measured based on the largest benefit that has a greater than fifty percent (50%) likelihood of being realized upon ultimate settlement. Section 740-10-25 also provides guidance on de-recognition, classification, interest and penalties on income taxes, accounting in interim periods and requires increased disclosures.\nThe estimated future tax effects of temporary differences between the tax basis of assets and liabilities are reported in the accompanying balance sheets, as well as tax credit carry-backs and carry-forwards. The Company periodically reviews the recoverability of deferred tax assets recorded on its balance sheets and provides valuation allowances as management deems necessary.\nManagement makes judgments as to the interpretation of the tax laws that might be challenged upon an audit and cause changes to previous estimates of tax liability. In addition, the Company operates within multiple taxing jurisdictions and is subject to audit in these jurisdictions. In managements opinion, adequate provisions for income taxes have been made for all years. If actual taxable income by tax jurisdiction varies from estimates, additional allowances or reversals of reserves may be necessary.\nFair Value of Financial Instruments - From inception, the Company adopted ASC 820, Fair Value Measurements and Disclosures, which provides a framework for measuring fair value under GAAP. Fair value is defined as the exchange price that would be received for an asset or paid to transfer a liability (an exit price) in the principal or most advantageous market for the asset or liability in an orderly transaction between market participants on the measurement date. The standard also expands disclosures about instruments measured at fair value and establishes a fair value hierarchy, which requires an entity to maximize the use of observable inputs and minimize the use of unobservable inputs when measuring fair value. The standard describes three levels of inputs that may be used to measure fair value:\n● Level 1: Quoted prices for identical assets and liabilities in active markets;\n● Level 2: Quoted prices for similar assets and liabilities in active markets; quoted prices for identical or similar assets and liabilities in markets that are not active; and model-derived valuations in which all significant inputs and significant value drivers are observable in active markets; and\n● Level 3: Valuations derived from valuation techniques in which one or more significant inputs or significant value drivers are unobservable.\nThe carrying amounts of financial instruments including cash, accounts payable, warrant liability and notes payable approximated fair value as of March 31, 2022 and 2021 due to the relatively short maturity of the respective instruments.\nRecently Issued Accounting Pronouncements - In June 2016, the FASB issued ASU 2016-13, Financial Instruments - Credit Losses (Topic 326) Measurement of Credit Losses on Financial Instruments (ASU 2016-13). The main objective of ASU 2016-13 is to provide financial statement users with more decision-useful information about the expected credit losses on financial instruments and other commitments to extend credit held by a reporting entity at each reporting date. To achieve this objective, the amendments in ASU 2016-13 replace the incurred loss impairment methodology in current U.S. GAAP with a methodology that reflects expected credit losses and requires consideration of a broader range of reasonable and supportable information to inform credit loss estimates. ASU 2016-13 is effective for fiscal years beginning after December 15, 2021, including interim periods within those years, and must be adopted under a modified retrospective method approach. Entities may adopt ASU 2016-13 earlier as of the fiscal years beginning after December 15, 2018, including interim periods within those years. The Company is currently evaluating the provisions of this guidance and assessing its impact on the Companys financial statements and disclosures. Implementation of this ASU had no material impact on the consolidated financial statements.\nOmnia Wellness Inc.\nNotes to the Consolidated Financial Statements\nIn August 2020, the FASB issued ASU 2020-06, Debt-Debt with Conversion and Other Options (Subtopic 470-20) and Derivatives and Hedging-Contracts in Entitys Own Equity (Subtopic 815-40)-Accounting for Convertible Instruments and Contracts in an Entitys Own Equity. ASU 2020-06 reduces the number of accounting models for convertible debt instruments and convertible preferred stock. For convertible instruments with conversion features that are not required to be accounted for as derivatives under Topic 815, Derivatives and Hedging, or that do not result in substantial premiums accounted for as paid-in capital, the embedded conversion features no longer are separated from the host contract. ASU 2020-06 also removes certain conditions that should be considered in the derivatives scope exception evaluation under Subtopic 815-40, Derivatives and Hedging-Contracts in Entitys Own Equity, and clarify the scope and certain requirements under Subtopic 815-40. In addition, ASU 2020-06 improves the guidance related to the disclosures and earnings-per-share (EPS) for convertible instruments and contract in entitys own equity. ASU 2020-06 is effective for public business entities that meet the definition of a Securities and Exchange Commission (SEC) filer, excluding entities eligible to be smaller reporting companies as defined by the SEC, for fiscal years beginning after December 15, 2021, including interim periods within those fiscal years. For all other entities, the amendments are effective for fiscal years beginning after December 15, 2023, including interim periods within those fiscal years. Early adoption is permitted, but no earlier than fiscal years beginning after December 15, 2020, including interim periods within those fiscal years. The Board specified that an entity should adopt the guidance as of the beginning of its annual fiscal year. Implementation of this ASU had no material impact on the consolidated financial statements.\nAs of March 31, 2022, there were several new accounting pronouncements issued by the Financial Accounting Standards Board. Each of these pronouncements, as applicable, has been or will be adopted by the Company. Management does not believe the adoption of any of these accounting pronouncements has had or will have a material impact on the Companys consolidated financial statements.\n3. GOING CONCERN\nThe Company adopted Accounting Standards Update No. 2014-15, Presentation of Financial Statements-Going Concern (Subtopic 205-40): Disclosure of Uncertainties about an Entitys Ability to Continue as a Going Concern (ASU 2014-15). The Companys financial statements have been prepared assuming that it will continue as a going concern, which contemplates continuity of operations, realization of assets, and liquidation of liabilities in the normal course of business. As reflected in the financial statements, the Company had an accumulated deficit at March 31, 2022 and 2021, a net loss and net cash used in operating activities for the reporting periods then ended. These factors raise substantial doubt about the Companys ability to continue as a going concern.\nThe Company is commencing operations to generate sufficient revenue; however, the Companys cash position may not be sufficient to support the Companys daily operations. Management intends to raise additional funds by way of a private or public offering. While the Company believes in the viability of its strategy to commence operations and generate sufficient revenue and in its ability to raise additional funds, there can be no assurances to that effect. The ability of the Company to continue as a going concern is dependent upon the Companys ability to further implement its business plan and generate sufficient revenue and its ability to raise additional funds by way of private offering. The financial statements do not include any adjustments related to the recoverability and classification of recorded asset amounts or the amounts and classification of liabilities that might be necessary should the Company be unable to continue as a going concern.\n4. RELATED PARTIES\nThe Company outsources its manufacturing pursuant to a Contract Services Agreement with DryRX, LLC dated as of January 1, 2020, which replaced and superseded the Contract Services Agreement with DryRX, LLC dated as of July 22, 2018, which expired in accordance with its terms. The Contract Services Agreement, among other things, provides that DryRX shall provide manufacturing and support services on behalf of the Company, and shall be responsible for the manufacturing oversight and production operations of the Companys products. In return, the Company is obligated to pay to DryRX a fee equal to 10% of net sales less cost-of-goods-sold and all expenses associated with the services. DryRX is owned and controlled by Steve Howes brother. As at March 31, 2022, the Company has recorded a royalty liability of $115,872 and is on the consolidated balance sheet. No royalty has been paid as of the date of this filing.\nOmnia Wellness Inc.\nNotes to the Consolidated Financial Statements\nThe Company entered into a Consulting Agreement with Massagewave, Inc, owned and controlled by Steve Howe, to assist with business development and administrative activities. The agreement was entered into on May 1, 2018 and had required monthly payments of $15,000 per month. The agreement expired on April 30, 2020 with renewal options. The Company incurred consulting expense, related party of $13,620 and $244,186 as of March 31, 2022 and 2021, respectively. The Company also has an accounts payable, related party balance of $-0- and $1,500 as of March 31, 2022 and 2021, respectively. The due to and due from accounts are to various investors and related parties above for business related activities.\n5. FIXED ASSETS\nThe carrying basis and accumulated depreciation of fixed assets at March 31, 2022 and 2021 is as follows:\nSCHEDULE OF FIXED ASSETS\nUseful Lives March 31, 2022 March 31, 2021\nEquipment in use 5 years $ 182,620 $ 99,000\nEquipment at 3rd party locations 5 years 212,000 212,000\nBuilding and Improvements 40 years 254,446 68,815\nVehicles and trailers 5 years 60,266 60,266\nLess depreciation\n(194,219 ) (125,704 )\nTotal fixed assets, net\n$ 515,113 314,377\nThe Company recorded depreciation expense of $161,641 and $55,796 for the years ended March 31, 2022 and 2021, respectively. The increase is due to the depreciation of the ROU Assets.\n6. LICENSE AGREEMENT, RELATED PARTY\nOn April 30, 2019 the Company entered worldwide exclusive license with Drywave Technologies, Inc. (Drywave), a Company owned by Steve Howe. On the terms and conditions of the agreement, the Company received intellectual property rights to manufacture, use, and offer for sale all the products related to the patents and trademarks for dry hydrotherapy therapy technologies. The license fee to acquire the technology was $2,000,000, and is payable as follows:\n(a) $350,000, plus $1,000 escrow fee, due on or before April 30, 2019 (First Payment);\n(b) $200,000 due on or before October 30, 2019 (Second Payment); and\n(c) $1,450,000 due on or before March 2, 2020 (Third Payment)\nThe Company made all the required payments as of March 31, 2021. After payment of the $2,000,000 License Fee and not later than April 30, 2020, the Company began paying to Drywave a royalty of 3% of Net Sales beginning May 1, 2020 and continuing for the longer of the period in which there are valid patent claims or ten years. The Company is performing on this agreement. As at March 31, 2022, the Company has recorded a royalty liability of $27,945 and is on the consolidated balance sheet. No royalty has been paid as of the date of this filing.\nThe company recorded the original license fee as an intangible asset as of April 30, 2019 and is amortizing the asset over the expected useful life of the asset of 10 years. The Company recorded amortization expense of $150,075 and $162,500 for the years ended March 31, 2022 and 2021, respectively.\nOmnia Wellness Inc.\nNotes to the Consolidated Financial Statements\n7. LEASE LIABILITY\nOn January 1, 2022, we adopted ASC Topic 842 - Leases. Under this new guidance, lessees are required to recognize assets and liabilities on the balance sheet for the rights and obligations created by all leases. Upon adoption, we recognized operating lease right-of-use (ROU) assets and corresponding lease liabilities of $179,563.\nLessee accounting\nWe determine if an arrangement is or contains a lease at inception. Our assessment is based on (1) whether the contract involves the use of a distinct identified asset, (2) whether we obtain the right to substantially all the economic benefit from the use of the asset throughout the period and (3) whether we have the right to direct the use of the asset. Leases are classified as either finance leases or operating leases. A lease is classified as a finance lease if any one of the following criteria are met: the lease transfers ownership of the asset by the end of the lease term, the lease contains an option to purchase the asset that is reasonably certain to be exercised, the lease term is for the majority of the remaining useful life of the asset or the present value of the lease payments equals or exceeds substantially all of the fair value of the asset. A lease is classified as an operating lease if it does not meet any one of these criteria. The lease classification affects the expense recognition in the income statement. Operating lease costs are recorded entirely in operating expenses. Finance lease costs are split, where amortization of the ROU asset is recorded in operating expenses and an implied interest component is recorded in interest expense.\nUnder the guidance of ASC 842, operating leases are included in right-of-use assets, current lease liabilities, and noncurrent lease liabilities on our balance sheets. ROU assets and lease liabilities are recognized at commencement date based on the present value of the future minimum lease payments over the lease term. As most of our leases do not provide an implicit interest rate, we use our incremental borrowing rate based on the information available at transition date in determining the present value of future payments. The ROU asset includes any lease payments made but excludes lease incentives and initial direct costs incurred, if any. Lease expense for minimum lease payments is recognized on a straight-line basis over the lease term.\nLease extensions\nMany leases have options to either extend or terminate the lease. In determining the lease term, we considered all available contract extensions that are reasonably certain of occurring.\nOperating leases\nThe Company has three operating leases, each with different terms. Lease 1 entered into on July 23, 2020 is effective for 3 years and 1 month from the commencement date. The lease requires adjustment upon the annual commencement date with an increase to the monthly rent by 3%. Lease 2 entered into on February 24, 2021 is effective for 3 years and 1 month from the commencement date. The lease requires monthly increases until the monthly amount reaches $5,000, then a 3% annual increase thereafter. Upon notice, the lease can be renewed for an additional two-year term at a rate 5% higher than set on schedule A of the lease. Lease 3 entered into on April 22, 2021 is effective for 3 years and 1 month from the commencement date. The lease may be renewed with renewal options to be determined at that time.\nOmnia Wellness Inc.\nNotes to the Consolidated Financial Statements\nThe following table summarizes balance sheet data related to leases at March 31, 2022 and March 31, 2021:\nSCHEDULE OF BALANCE SHEET RELATED TO LEASES\nMarch 31, 2022 March 31, 2021\nAssets\nOperating lease right of use assets #1 $ 71,401 $ -\nOperating lease right of use assets #2 145,855 -\nOperating lease right of use assets #3 47,207 -\nOperating lease right of use assets - -\nLess accumulated depreciation (104,266 ) -\nTotal operating lease right of use assets $ 160,197 $ -\nLiabilities\nOperating lease liability, current 99,464 -\nOperating lease liability, noncurrent 80,099 -\nTotal lease liabilities 179,563 -\nOperating lease liability is presented net of lease payments. The Company is required to make monthly payments for each lease. During the year ended March 31, 2022, the Company paid $84,899 towards the lease liability and $27,184 in interest expense.\n8. NOTES PAYABLE\nCovid-19 PPP Loan\nDuring the year ended March 31, 2021, the Company entered into loans under the Paycheck Protection Program (PPP) sponsored by the U.S. Small Business Administration (SBA) providing for proceeds of $588,891. The PPP loans were made pursuant to the Coronavirus Aid, Relief, and Economic Security Act (the CARES Act) and was administered by the SBA. The interest rate on the PPP loans were 1.0%. The PPP loans were unsecured and contained customary events of default relating to, among other things, payment defaults, making materially false and misleading representations to the SBA or the Lender, or breaching the terms of the PPP Loan. The occurrence of an event of default may result in the repayment of all amounts outstanding, collection of all amounts owing from the Company, or filing suit and obtaining judgment against the Company. In May 2021, $294,066 was forgiven, with another $146,200 forgiven in August 2021 and the remaining $148,625 forgiven in October 2021, resulting in a gain on forgiveness of $593,546 including interest during the year ended March 31, 2022.\nSenior Secured Notes\nIn June 2021, the Company entered into a Senior Secured Note with Auctus Fund for $650,000, discounted $55,000, resulting in net proceeds of $595,000, with a maturity date of June 23, 2022. The note bears interest of 12% per annum with the first twelve months of interest to be due and payable on the issue date of the note. Interest of $78,000 was expensed during the year ended March 31, 2022. Any principal amount or interest on this note which is not paid when due shall bear interest at the rate of the lesser of (i) sixteen percent (16%) per annum and (ii) the maximum amount permitted by law from the due date thereof until the same is paid.\nOn July 14, 2021, the principal amount of the note was increased by $25,000 in return for a one-time waiver by the Lender of one of the covenants under the note, bringing the balance of the note to $675,000.\nAlso pursuant to the agreement, in connection with the issuance of the note, the Company issued two common stock purchase warrants (separately, the First Warrant and the Second Warrant and together, the Warrants) to Auctus, each allowing Auctus to purchase an aggregate of 4,333,333 shares of the Companys common stock. The Second Warrant is subject to cancellation pursuant to the terms of the Auctus Note and may not be exercised until the Trigger Date (as defined in the Second Warrant). The Warrants each have an exercise price of $0.15 per share, subject to customary adjustments (including anti-dilution adjustments), and may be exercised at any time until the three-year anniversary of the Warrants; provided, however, in the event the Company repays the Auctus Note in its entirety on or prior to the maturity date, the Second Warrant shall automatically expire and may only be exercised in the event it does not so automatically expire. The Warrants include a cashless exercise provision as set forth therein.\nOmnia Wellness Inc.\nNotes to the Consolidated Financial Statements\nThe total fair value of the warrants was estimated on the issue date at $513,827 using the following weighted average assumptions:\nSCHEDULE OF FAIR VALUE OF THE WARRANTS\nJune 24, 2022\nMarket price of common stock on date of issuance $ 0.30\nRisk-free interest rate 0.48 %\nExpected dividend yield\nExpected term (in years)\nExpected volatility 199.6 %\nOn or about November 22, 2021, the Company triggered an event of default under the Auctus Note and related documents which entitled Auctus, among other things, to accelerate the due date of the unpaid principal amount of, and all accrued and unpaid interest on, the Auctus Note. On February 17, 2022, Auctus and the Company executed a Waiver Letter which waived such defaults effective as of November 22, 2021.\nThe note is secured by an Affidavit of Confession of Judgment and ranks senior over all existing and future indebtedness of the Borrower.\nNonconvertible Notes - Related Party\nAt March 31, 2021, the Company had $1,344,625 in notes payable due to related party investors. During the year ended March 31, 2022, the Company entered into additional notes payable - related party for $750,000 discounted at approximately 3%, or $25,000, resulting in net proceeds of $725,000. Additionally, a note of $99,970 that was previously held by a related party was reclassed to a non-related party and subsequently paid. As of March 31, 2022, the Company has issued $1,994,655 in notes payable to investors, of which $1,102,735 is due in the short term and $891,920 is due in the long term. The following table reflects the nonconvertible notes related party outstanding as of March 31, 2022.\nSCHEDULE OF NONCONVERTIBLE NOTES RELATED PARTY\nInterest Rate Issuance Date Maturity March 31, 2022\n4 % 12/31/18 12/31/23 $ 55,250\n4 % 12/31/18 12/31/21 $ 66,900\n4 % 12/31/18 12/31/23 $ 74,220\n4 % 9/30/19 9/29/21 $ 314,000\n4 % 9/17/19 9/16/20 $ 81,500\n4 % 9/30/19 12/31/23 $ 12,450\n1 % 12/31/20 12/30/22 $ 254,382\n1 % 12/31/20 12/30/22 $ 235,600\n1 % 12/31/20 12/30/22 $ 83,785\n4 % 12/31/20 12/31/21 $ 53,100\n4 % 12/31/20 12/31/21 $ 2,850\n12 % 1/10/22 5/10/23 $ 750,000\nadjustment\n$ 10,618\n$ 1,994,655\nNonconvertible Notes\nAt March 31, 2021, the Company had $1,919,620 in notes payable due. During the year ended March 31, 2022, the Company entered into additional notes payable for $370,189 including fees resulting in net proceeds of $150,000 and repaid $339,672. As of March 31, 2022, the Company has issued $1,955,137 in notes payable to investors, of which $1,760,219 is due in the short term and $189,918 is due in the long term. The following table reflects the nonconvertible notes outstanding as of March 31, 2022.\nOmnia Wellness Inc.\nNotes to the Consolidated Financial Statements\nSCHEDULE OF NONCONVERTIBLE NOTES NON RELATED\nInterest Rate Default Rate Issuance Date Maturity March 31, 2022\n14 % N/A 8/1/18 1/31/22 $ 500,000\n14.2 % 25 % 9/18/19 9/18/23 $ 23,347\n14.2 % 25 % 10/9/19 10/9/23 $ 37,037\n14 % Additional 2 % 10/30/19 10/29/21 $ 229,500\n14 % Additional 2 % 12/31/19 12/31/20 $ 102,000\n14 % N/A 2/5/20 2/5/21 $ 50,000\n20 % Additional 2 % 2/25/20 8/24/22 $ 216,000\n20 % Additional 2 % 2/28/20 6/30/21 $ 104,000\n14.2 % 25 % 3/10/20 3/10/24 $ 90,654\n20 % Additional 2 % 4/24/20 4/23/21 $ 20,000\n30 % Additional 2 % 10/29/20 2/28/21 $ 25,500\n12 % Additional 2 % 10/30/20 11/1/21 $ 25,500\n12 % Additional 2 % 10/30/20 11/1/21 $ 25,500\n20 % N/A % 2/2/21 5/31/22 $ 45,000\n15 % N/A % 4/1/21 3/31/24 $ 38,880\n10 % N/A % 4/1/21 3/31/22 $ 100,000\nN/A % N/A % 8/11/21 12/31/21 $ 322,219\n$ 1,955,137\nConvertible Notes - Related Party\nThe Company has issued $29,970 in convertible notes payable to a related party, bearing an annual interest rate of 4% and a default interest rate of an additional 2%. The note was due December 30, 2020 unless sooner paid in full or converted in accordance with the terms of Conversion, (the Maturity Date) provided, however, that if a Qualified IPO (as defined below) does not occur on or before the Maturity Date, the Maturity Date shall be extended automatically for an additional one-year period and, during such period, the notes will bear interest at an annual rate of eight percent (8%). At March 31, 2022 and 2021, the Company had $29,970 and $29,970, respectively, in outstanding convertible notes - related party.\nConvertible Notes\nAt March 31, 2021, the Company had $1,107,143 in convertible notes payable. During the year ended March 31, 2022, the Company entered into additional notes payable for $1,387,800 net of adjustments resulting in cash proceeds of $1,390,000 gross, converted $905,500 into 5,883,564 common shares, of which 1,257,225 are still to be issued, and repaid $360,000. As of March 31, 2022, the Company has issued $1,229,443 in convertible notes payable to investors with all due in the short term. The following table reflects the convertible notes outstanding as of March 31, 2022.\nOmnia Wellness Inc.\nNotes to the Consolidated Financial Statements\nSCHEDULE OF CONVERTIBLE NOTES\nInterest Rate Conversion Rate Issuance Date Maturity March 31, 2022\n12 % $ 1.80 5/5/19 1/26/21 $ 102,000\n12 % $ 1.80 7/10/19 7/9/21 $ 153,000\n12 % $ 1.80 2/12/20 2/11/21 $ 102,000\n8 % $ 0.22 3/9/21 3/8/22 $ 100,000\n2 % $ 0.30 6/16/21 3/31/22 $ 250,000\n10 % $ 0.30 6/22/21 6/21/22 $ 50,000\n10 % $ 7.50 8/30/21 8/29/22 $ 150,000\n10 % $ 7.50 8/31/21 8/30/22 $ 75,000\n10 % $ -* 8/31/21 8/30/22 $ 50,000\n10 % $ -* 9/15/21 9/14/22 $ 20,000\n10 % $ -* 9/20/21 9/19/22 $ 10,000\n10 % $ -* 9/22/21 9/21/22 $ 10,000\n10 % $ -* 10/13/21 10/12/22 $ 50,000\n10 % $ 7.50 10/18/21 10/17/22 $ 25,000\n10 % $ 7.50 10/20/21 10/19/22 $ 20,000\n10 % $ -* 10/28/21 10/27/22 $ 20,000\n10 % $ -* 12/27/21 12/26/22 $ 20,000\n10 % $ -* 2/11/22 2/10/23 $ 10,000\n10 % $ -* 2/22/22 2/21/23 $ 5,000\nadjustment\n$ 7,443\n$ 1,229,443\n* Upon commencement by the Company of a Qualified Financing, all of the outstanding principal and interest shall convert into that number of shares of New Round Stock, based upon a conversion price equal to the actual price per share of New Round Stock in the Qualified Financing. If not converted prior to the twelve-month anniversary of the issuance of the Notes, the Notes will be payable upon demand. Prepayment is not permitted prior to a payoff event.\nThe Company evaluates these notes at commencement for beneficial conversion features and derivatives. During the year ended March 31, 2022, the Company recorded a beneficial conversion feature on the convertible notes of $914,076 compared to $-0- at March 31, 2021.\nThe following table depicts the total notes payable at March 31, 2022 and March 31, 2021:\nSCHEDULE OF NOTE PAYABLE OUTSTANDING BALANCE\nMarch 31, 2022 March 31, 2021\nPPP Loan $ - $ 588,891\nSenior secured notes $ 675,000 $ -\nNonconvertible notes - related party $ 1,994,655 $ 1,344,625\nNonconvertible notes $ 1,955,137 $ 1,919,620\nConvertible notes - related party $ 29,970 $ 29,970\nConvertible notes $ 1,229,443 $ 1,107,143\nLess:\nNon-current portion of senior secured notes $ 675,000 $ -\nNon-current portion of PPP Loan $ - $ (588,891 )\nNon-current portion of nonconvertible notes - related party $ (891,920 ) $ (509,972 )\nNon-current portion of nonconvertible notes $ (189,918 ) $ (174,620 )\nCurrent notes payable $ 4,127,367 $ 3,716,766\nOmnia Wellness Inc.\nNotes to the Consolidated Financial Statements\n9. SHAREHOLDERS EQUITY (DEFECIT)\nCommon Stock\nThe Company is authorized to issue 1,500,000,000 shares of common stock, par value $0.001 per share. All shares of the Companys common stock have equal rights and privileges with respect to voting, liquidation and dividend rights. Each share of common stock entitles the holder thereof to:\na. One non-cumulative vote for each share held of record on all matters submitted to a vote of the stockholders;\nb. To participate equally and to receive any and all such dividends as may be declared by the Board of Directors out of funds legally available therefore; and\nc. To participate pro rata in any distribution of assets available for distribution upon liquidation.\nStockholders have no pre-emptive rights to acquire additional shares of common stock or any other securities. Common shares are not subject to redemption and carry no subscription or conversion rights.\nDuring the year ended March 31, 2022, the Company converted $824,383 of notes payable and interest and issued 4,626,339 common shares. The Company also converted $150,867 of notes payable and interest which is included in stock payable at March 31, 2022. Upon issuance, the $150,867 will convert into an additional 1,257,225 common shares.\nDuring the year ended March 31, 2022, the Company issued 1,600,000 common shares to extend the maturity dates of two notes payable, and an additional $15,000 in finance costs is included in stock payable at March 31, 2022, which upon issuance, will convert into an additional 50,000 common shares.\nDuring the year ended March 31, 2022, the Company issued 1,314,827 common shares for consulting fees with an additional $64,500 in stock payable at March 31, 2022. Upon issuance, will convert into an additional 215,000 common shares. Also pursuant to one of the consulting agreements, the Company issued a common stock purchase warrant allowing the holder to purchase 166,667 shares of the Companys common stock. The Warrants have an exercise price of $0.30 per share, subject to customary adjustments (including anti-dilution adjustments), and may be exercised at any time until the three-year anniversary of the Warrants. The Warrants include a cashless exercise provision as set forth therein.\nThe total fair value of the warrants was estimated on the issue date at $53,833 using the following weighted average assumptions:\nSCHEDULE OF FAIR VALUE OF THE WARRANTS\nJune 16, 2022\nMarket price of common stock on date of issuance $ 0.35\nRisk-free interest rate 0.41 %\nExpected dividend yield\nExpected term (in years)\nExpected volatility 200.4 %\nOmnia Wellness Inc.\nNotes to the Consolidated Financial Statements\nIn July 2021, the Company issued 454,545 common shares at a price of $0.22 per share for proceeds of $100,000.\nIn March 2022, the Company sold 1,742,425 common shares at a price of $0.16 per share for proceeds of $287,500 and 757,575 common shares at a price of $0.17 per share for proceeds of $125,000. These amounts are included in stock payable at March 31, 2022.\nPreferred Stock\nOn April 6, 2021, the Company increased its authorized shares of blank check preferred stock from 10,000,000 to 150,000,000 shares, which may be issued from time to time in one or more series and/or classes. No shares of preferred stock have been issued or are outstanding as of March 31, 2022.\nThe Company has not declared or paid any dividends or returned any capital to common stock shareholders as of March 31, 2022 and 2021.\n10. INCOME TAXES\nIncome Tax Expense\nFor the fiscal year ended March 31, 2022, the reconciliation between the income tax benefit computed by applying the statutory U.S. federal income tax rate to the pre-tax loss before income taxes, and total income tax expense recognized in the financial statements is the change in the valuation allowance. For the fiscal year ended March 31, 2022 and 2021, the Company did not recognize any current income tax expense or benefit due to a full valuation allowance on its deferred income tax assets.\nDeferred Income Tax Assets\nAs of March 31, 2022 and 2021, the income tax effects of temporary differences that give rise to significant deferred income tax assets and liabilities are as follows (in thousands):\nSUMMARY OF SIGNIFICANT DEFERRED INCOME TAX ASSETS AND LIABILITIES\nMarch 31, 2022 March 31, 2021\nDeferred income tax assets:\nNet operating loss carryforwards - -\nOther - -\nTotal deferred income tax assets - -\nValuation allowance for deferred income tax assets - -\nNet deferred income tax assets - -\nFor the fiscal years ended March 31, 2022 and 2021, the valuation allowance increased primarily as a result of the increase in net operating losses. In assessing the realizability of deferred income tax assets, management considers whether it is more likely than not that some portion or all of the deferred income tax assets will not be realized.\nNOL Carryforwards and Other Matters\nThe Company files income tax returns in the U.S. federal jurisdiction and the state of Colorado. The Companys federal and state tax years for the 2018 fiscal year and forward are subject to examination by taxing authorities.\nOmnia Wellness Inc.\nNotes to the Consolidated Financial Statements\nThe Company did not have any unrecognized tax benefits as of March 31, 2022 and 2021. The Companys policy is to account for any interest expense and penalties for unrecognized tax benefits as part of the income tax provision. The Company does not anticipate that unrecognized tax benefits will significantly increase or decrease within the next twelve months.\n11. COMMITMENTS AND CONTINGENCIES\nOff-Balance Sheet Arrangements - The Company has no off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources.\nLegal Matters - From time to time, the Company may be involved in litigation relating to claims arising out of operations in the normal course of business. During the periods ended March 31, 2022 and 2021, there are no proceedings in which the Company or any of our directors, officers or affiliates, or any registered or beneficial shareholders, is an adverse party or has a material interest adverse to our interest.\n12. RESTATEMENT\nThe Company amended its Annual Report on Form 10-K for the fiscal year ended March 31, 2021 (the Original Filing), to restate its audited consolidated financial statements and related footnote disclosures to retroactively report an April 6, 2021, 15-1 forward stock split and delete the incorrect leases of inventory revenue disclosure statement for the period covered in the Original Filing.\nThe Company currently does not hold any leases of inventory and has removed this disclosure from the footnotes of the financial statements in the Amendment No. 1 to the Original Filing, instead providing that the Company derives its revenues primarily from the usage fees and sales of hydrotherapy massage beds and installation services. Revenues from sales are recognized when the products are sold and delivered to its customers and the usage fees are earned based on subscription or actual usage. Sales Taxes and other taxes the Company collects concurrent with revenue-producing activities are excluded from revenue. Shipping and handling fees charged to customers are reported within revenue.\nIn addition, the weighted average earnings per share have been recalculated in the Consolidated Balance Sheets in the Amendment No. 1 to the Original Filing.\n13. SUBSEQUENT EVENTS\nThe Company entered into a loan agreement with 1800 Diagonal Lending LLC., a Virginia limited liability company, for the sum of $70,000.00 and interest, due on November 15, 2023.\nThe Company entered into a loan agreement with GS Capital Partners LLC, for the aggregate principal amount of $55,000 on May 11, 2022, that matures on May 17, 2023. Item 9. Changes In and Disagreements with Accountants on Accounting and Financial Disclosure\nThere have been no disagreements between the Company and its accountants regarding any matter or accounting principles or practice or financial statement disclosures. Item 9A. Controls and Procedures\nWe maintain a system of disclosure controls and procedures (as defined in Rule 13a-15(e) under the Exchange Act). As required by Rule 13a-15(b) under the Exchange Act, management of the Company, under the direction of our Chief Executive Officer and Chief Financial Officer, reviewed and performed an evaluation of the effectiveness of design and operation of our disclosure controls and procedures (as defined in Rule 13a-15(e) under the Exchange Act) as of March 31, 2022. Based on that review and evaluation, the Chief Executive Officer and Chief Financial Officer, along with the management of the Company, have determined that as of March 31, 2022, the disclosure controls and procedures were not effective to provide reasonable assurance that information required to be disclosed by us in the reports that we file or submit under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in the SECs rules and forms and were not effective to provide reasonable assurance that such information is accumulated and communicated to our management, including our principal executive officer and principal financial officer, as appropriate to allow timely decisions regarding required disclosures.\nManagements Annual Report on Internal Control Over Financial Reporting\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Exchange Act Rule 13a-15(f)). The Companys internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with accounting principles generally accepted in the United States of America. Because of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate. Under the supervision and with the participation of management, including the Chief Executive Officer and Chief Financial Officer, the Company conducted an evaluation of the effectiveness of the Companys internal control over financial reporting as of March 31, 2022 using the criteria established in Internal Control - Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) 2013.\nA material weakness is a deficiency, or combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of the Companys annual or interim financial statements will not be prevented or detected on a timely basis. In its assessment of the effectiveness of internal control over financial reporting as of March 31, 2022, the Company determined that there were control deficiencies that constituted material weaknesses, as described below.\n1. We do not have an Audit Committee - While not being legally obligated to have an audit committee, it is the managements view that such a committee, including a financial expert member, is an utmost important entity level control over the Companys financial statements. Currently the Board of Directors act in the capacity of the Audit Committee, and does not include a member that is considered to be independent of management to provide the necessary oversight over managements activities.\n2. We did not maintain appropriate cash controls. As of March 31, 2022, the Company has not maintained sufficient internal controls over financial reporting for the cash process, including failure to segregate cash handling and accounting functions, and did not require dual signature on the Companys bank accounts. Alternatively, the effects of poor cash controls were mitigated by the fact that the Company had limited transactions in their bank accounts.\n3. We did not implement appropriate information technology controls. As at March 31, 2022, the Company retains copies of all financial data and material agreements; however, there is no formal procedure or evidence of normal backup of the Companys data or off-site storage of data in the event of theft, misplacement, or loss due to unmitigated factors.\nAs of March 31, 2022, our remediation of these deficiencies is incomplete.\nManagement, including our Chief Executive Officer and Chief Financial Officer, has discussed the material weaknesses noted above with our independent registered public accounting firm. Due to the nature of these material weaknesses, the Company concluded that these control deficiencies resulted in a reasonable possibility that a material misstatement of the annual or interim financial statements will not be prevented or detected on a timely basis by the companys internal controls.\nAs a result of the material weaknesses described above, management has concluded that the Company did not maintain effective internal control over financial reporting as of March 31, 2022 based on criteria established in Internal Control-Integrated Framework issued by COSO.\nThis annual report does not include an attestation report of the Companys registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by the Companys registered public accounting firm pursuant to temporary rules of the SEC that permit the Company to provide only managements report in this annual report.\nChanges in Internal Control over Financial Reporting\nThere has been no change in our internal control over financial reporting identified in connection with the evaluation we conducted of the effectiveness of our internal control over financial reporting as of March 31, 2022, that occurred during our fourth fiscal quarter that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting. Item 9B. Other Information\nNot Applicable.\nPART III Item 10. Directors, Executive Officers, and Corporate Governance\nDirectors and Executive Officers\nOur executive officers and directors are as follows:\nName\nAge\nTitles\nSteve R. Howe\nExecutive Chairman and Director\nDr. Andrew E. Trumbach\nChief Financial Officer\nNickolay Kukekov\nDirector\nJainal Bhuiyan\nPresident and Director\nSteve R. Howe, Executive Chairman and Director. Mr. Howe has been the Executive Chairman and Director of Omnia Corp. since August 1, 2019, and has been the Executive Chairman and Director of the Company since the closing of the Acquisition. Mr. Howe is also the owner and manager of Drywave Technologies USA, Inc., which owns certain of the technologies and intellectual property licensed to us. Prior to his service with Omnia Corp., Mr. Howe served as Chairman of the Board and Chief Executive Officer of AntriaBio from its formation in 2011 to 2014 and the Chairman of the Board and Chief Executive of PR Pharmaceuticals from its formation in 1998 to 2010. Mr. Howe was a founder of Micrel Limited, Inc., a privately held drug delivery company, and served as the Chief Executive Officer for Micrel from 1987 through 1998, when it merged into PR Pharmaceuticals. Mr. Howe received his BA in Business Administration, with an emphasis on finance and accounting, from the University of Wyoming in 1974.\nThe Company believes that Mr. Howe is qualified to serve as Executive Chairman due to his extensive experience with building and leading companies, and as a founder of Omnia Corp.\nNickolay Kukekov, Director. Dr. Kukekov was a founder and co-managing member of the predecessor of Omnia Corp. from its formation in 2018 until its conversion into Omnia Corp. in July 2019. Upon the conversion of Omnia Corp.s predecessor into Omnia Corp. in July 2019, Dr. Kukekov became a member of Omnia Corp.s Board of Directors. Dr. Kukekov has served as a Director of the Company since the Closing of the Acquisition. Dr. Kukekov currently serves as member of the Board of Directors of MemoryMD, Inc. since September 2017 and as a member of the Board of Directors of Brain Scientific Inc. (which acquired MemoryMD) since September 2018. Dr. Kukekov currently serves as the managing director of HRA Capital (formerly Highline Research Advisors). Prior to forming Highline Research Advisors in 2012, Dr. Kukekov was the Managing Director of Healthcare Investment Banking at Summer Street Research from October 2010 to August 2012. In September 2009, Dr. Kukekov was a co-founder of the Healthcare Investment Banking group at Gilford Securities. From December 2007 to July 2009, Dr. Kukekov served as the managing director of Paramount BioCapital, where he ran the advisory, M&A and capital raising services for in-house private and public portfolio companies. Dr. Kukekov holds a Bachelor of Science degree in Molecular, Cellular and Developmental Biology from the University of Colorado at Boulder and a Ph.D. in Neuroscience from Columbia University, College of Physicians and Surgeons in New York.\nThe Company believes that Dr. Kukekov is qualified to serve as a member of the Board of Directors due to his extensive experience in healthcare and medical device investment banking.\nJainal Bhuiyan, President and Director. Mr. Bhuiyan was a founder and co-managing member of the predecessor of Omnia Corp. from its formation in 2018 until its conversion into Omnia Corp. in July 2019. Upon the conversion of Omnia Corp.s predecessor into Omnia Corp. in July 2019, Mr. Bhuiyan became a member of Omnia Corp.s Board of Directors. Mr. Bhuiyan has served as the President and as a Director of the Company since the Closing of the Acquisition. He has spent over 15 years of his career focused in the health and wellness sector, and has executed over $3 billion in financings of early-stage and growth companies. His primary efforts have been dedicated to investment banking, capital markets and public and private equity investments. He is currently a Senior Managing Director at Paulson in investment banking. Since 2012, he has been a partner at HRA Capital, a healthcare merchant investment bank. Prior to HRA Capital, he was a Senior Vice President of healthcare investment banking at Rodman & Renshaw, where he was also Head of Healthcare Equity Capital Markets. Early in his career, he worked as a Senior Analyst at Provident Healthcare Partners, a Boston-based boutique M&A shop focused on healthcare services, and prior to that he worked as a Management Analyst with BearingPoint, consulting to the Department of Defense. Mr. Bhuiyan serves as Chairman of the Board of FundRx, a healthcare venture investment platform. Mr. Bhuiyan has a Bachelor of Science degree from Cornell Universitys Charles H. Dyson School of Applied Economics and Management. He currently holds FINRA Series 7, Series 63 and Series 79 licenses.\nThe Company believes that Mr. Bhuiyan is qualified to serve as a member of the Board of Directors due to his extensive experience in healthcare and medical device investment banking.\nDr. Andrew E. Trumbach, Chief Financial Officer. As of March 11, 2021, the Company appointed Dr. Andrew E. Trumbach as its Chief Financial Officer. Since 1992, Dr. Trumbach has been a consultant providing tax, accounting and financial analysis services and accounting information systems solutions to middle market companies and family-owned businesses. From 2008 to 2014, Dr. Trumbach was a part-time Professor at Nova Southeastern University, H. Wayne Huizenga School of Business and Entrepreneurship, where he taught classes on accounting, management and cost accounting, and accounting information systems. He was the CFO of a holding company from 2008 to 2019 that owned and operated one of the largest perfume distribution businesses operating worldwide. The company acquired and managed affiliated companies that included over 45 retail stores and a duty-free company operating airline, cruise, and retail duty free and duty paid concessions located in cruise, airport, and border locations worldwide. Prior to 2008, Dr. Trumbach spent 14 years as the CFO/CIO and Sr VP of a family-owned holding and investment company that included a portfolio that consisted of commercial, industrial, and residential real estate holdings, mining operations, outdoor advertising, publishing, polling, water and sewer utility, mobile home parks, data centers, and funeral homes. Prior to moving to industry, Dr. Trumbach spent three years working in an international accounting firm and five years in a regional firm working in public accounting in both the Caribbean and the United States. Dr. Trumbach is currently a director of Borrowmoney.com, Inc. (OTCPink:BWMY). In addition to a Bachelor of Science degree in Accounting and a Master of Business Administration degree, Dr. Trumbach has earned Doctorate degrees in both Information Technology Management and Accounting. He has undertaken numerous consulting projects for major companies in the United States and the Caribbean.\nFamily Relationships\nThere are no familial relationships between any of our officers and directors.\nStructure and Operation of the Board\nWe do not have standing audit, compensation or nominating committees of our Board. However, the full Board performs all of the functions of a standing audit committee, compensation committee and nominating committee. The Board currently consists of three directors: Mr. Howe (Executive Chairman), Mr. Bhuiyan and Dr. Kukekov. The following is a brief description of these functions of the Board:\nNomination of Directors\nThe Board does not currently have a standing nominating committee, and thus we do not have a nominating committee charter. Due to our small size and limited operations to date, the Board determined that it was appropriate for the entire Board to act as the nominating committee. The full Board currently has the responsibility of selecting individuals to be nominated for election to the Board. Board candidates are typically identified by existing directors or members of management. The Board will consider director candidates recommended by stockholders. Any such candidates will be evaluated on the same basis as other candidates being evaluated by the Board. Information with respect to such candidates should be sent to Omnia Wellness Inc., 999 18th St., Suite 3000, Denver, Colorado 80202; c/o Chairman. The Board considers the needs for the Board as a whole when identifying and evaluating nominees and, among other things, considers diversity in background, age, experience, qualifications, attributes and skills in identifying nominees, although it does not have a formal policy regarding the consideration of diversity.\nAudit Committee Related Function\nWe do not have a standing audit committee, and thus we do not have an audit committee charter. Due to our small size and limited operations to date, the Board determined that it was appropriate for the entire Board to act as the audit committee. The Board intends to review with management and the Companys independent public accountants the Companys financial statements, the accounting principles applied in their preparation, the scope of the audit, any comments made by the independent accountants upon the financial condition of the Company and its accounting controls and procedures and such other matters as the Board deems appropriate. Because the Companys common stock is traded on the OTC Pink market, the Company is not subject to the listing requirements of any securities exchange regarding audit committee related matters.\nReport of Board on Audit Related Matters\nIn discharging its responsibility for oversight of the audit process, the Board obtained from the Companys newly appointed independent auditors, BF Borgers CPA PC, a formal written statement describing any relationships between the auditors and the Company that might bear on the auditors independence, consistent with the Independence Standards Board Standard No. 1, Independence Discussions with Audit Committees. In addition, the Board discussed with the auditors any relationships that might impact the auditors objectivity and independence. The Board is satisfied as to the auditors independence.\nAudit Committee Financial Expert\nWe do not have an audit committee financial expert, because we do not have an audit committee.\nRisk Oversight\nThe Boards risk oversight is administered primarily through the following:\n● review and approval of an annual business plan;\n● review of a summary of risks and opportunities at meetings of the Board;\n● review of business developments, business plan implementation and financial results;\n● oversight of internal controls over financial reporting; and\n● review of employee compensation and its relationship to our business plans.\nDue to the small size and early stage of the Company, we have not adopted a formal policy on whether there should be a separate Non-Executive Chairman.\nCompensation Committee Related Function\nThe Board does not currently have a standing compensation committee, and thus we do not have a compensation committee charter. Due to our small size and limited operations to date, the Board determined that it was appropriate for the entire Board to act as the compensation committee. The full Board currently has the responsibility for reviewing and establishing compensation for executive officers and making policy decisions concerning salaries and incentive compensation for executive officers of the Company.\nThe Companys executive compensation program is administered by the Board, which determines the compensation of the Executive Chairman and other executive officers of the Company. In reviewing the compensation of the individual executive officers (other than the Executive Chairman), the Board intends to consider the recommendations of the Executive Chairman, published compensation surveys and current market conditions.\nCommunication with Stockholders\nStockholders wishing to communicate with the Board can send an email to showe@solajet.com or write or telephone to the Companys corporate offices:\nOmnia Wellness Inc.\nExecutive Chairman\n18th St., Suite 3000\nDenver, Colorado 80202\nTelephone: 303-325-3738\nCode of Business Conduct and Ethics\nWe adopted a Code of Business Conduct and Ethics that applies to, among other persons, our principal executive officers, principal financial officer, principal accounting officer or controller, and persons performing similar functions. Our Code of Business Conduct and Ethics is available on our website www.omniawellness.com. Item 11. Executive Compensation\nCompensation of Executive Officers\nThe following table sets forth information regarding each element of compensation that was paid or awarded to the named executive officers of the Company for the periods indicated.\nName and Principal Position Year Salary ($) Bonus ($) Stock Awards ($) Option Awards ($) Non-Equity Incentive Plan Compensation\n($) Change in Pension Value and Nonqualified Deferred Compensation Earnings\n($) All other Compensation ($) Total ($)\nSteve R. Howe (Executive Chairman and Director) - - - - - - 13,620 13,620\n- - - - - - 244,186 (1) 244,186\nJainal Bhuiyan (President and Director) - - - - - - - -\n- - - - - - - -\nDr. Andrew E. Trumbach (2) (Chief Financial Officer) - - - - - - 16,000 16,000\n- - - - - - 2,000 2,000\nAmer Samad (3) (Former Chief Executive Officer, President, Treasurer and Director) - - - - - - - -\n- - - - - - - -\n(1) Represents consulting fees paid to an affiliate of Mr. Howe for the period indicated pursuant to a consulting agreement that terminated in accordance with its terms in 2020.\n(2) Dr. Trumbach was appointed as the Companys Chief Financial Officer on March 11, 2021.\n(3) Mr. Samad was appointed as the Companys sole officer and director on June 25, 2019, and he resigned from all positions on January 5, 2021.\nOutstanding Equity Awards at Fiscal Year-End\nThere were no outstanding equity awards held by any of the named executive officers as of the end of the fiscal year ended March 31, 2022.\nOption Exercises and Fiscal Year-End Option Value Table\nThere were no stock options exercised during the fiscal year ended March 31, 2022 by the named executive officers.\nLong-Term Incentive Plans and Awards\nThere were no awards made to a named executive officer in the fiscal year ended March 31, 2022 under any long-term incentive plan.\nEmployment Agreements\nThe Company entered into a CFO Consulting Agreement with Dr. Trumbach, dated as of March 11, 2021 (the CFO Consulting Agreement). Pursuant to the CFO Consulting Agreement, Dr. Trumbach will serve as the non-employee chief financial officer of the Company on a part-time basis. The term of the CFO Consulting Agreement is one year, subject to the Companys right to terminate on 30 days written notice.\nAs compensation for the services to be provided by Dr. Trumbach, the Company shall pay an initial $2,000/month, which amount will be reviewed in thirty days and adjusted based on the amount of back work or other projects that may have to be completed outside the normal scope contemplated by the CFO Consulting Agreement.\nOther than the CFO Consulting Agreement, the Company is not party to any employment or similar agreement with any of its other executive officers.\nDirector Compensation\nNo compensation was paid by the Company to its directors as such during the year ended March 31, 2022 or 2021. In consideration for their board service, we intend to compensate our outside directors in the form of options for each year for their continued service. We also reimburse our directors reasonable out of pocket expenses incurred in attending board meetings and in carrying out their board duties.\nEquity Incentive Plan\nAs of March 5, 2020, subject to the Acquisition, our Board of Directors adopted the Omnia Wellness Inc. 2020 Equity Incentive Plan, or the 2020 Plan, which was approved by stockholders holding a majority of our common stock on March 5, 2020.\nThe Board believes that our ability to offer our key employees, non-employee directors and certain consultants and advisers long-term, equity-based compensation will help enable us to attract, motivate and retain experienced and highly qualified employees, directors and other service providers who will contribute to our financial success. It is the judgment of the Board that approval of the 2020 Plan is in the best interests of the Company and its stockholders.\nThe 2020 Plan permits the issuance of equity-based awards, including incentive stock options, or ISOs, nonqualified stock options, restricted stock and restricted stock units, or RSUs (the Awards).\nThe 2020 Plan is administered by the Board, or a committee composed of two or more members of the Board (the Committee) which is authorized to grant Awards.\nPurpose and Eligible Individuals. The purpose of the 2020 Plan is to retain the services of valued key employees and consultants of the Company and such other persons as the Committee determines and to encourage such persons to acquire a greater proprietary interest in the Company, thereby strengthening their incentive to achieve the objectives of the stockholders of the Company, to serve as an aid and inducement in the hiring of new employees and to provide an equity incentive to consultants and other persons selected by the Committee. Under the 2020 Plan, Awards may be granted to our officers, directors, employees and consultants or the officers, directors, employees and consultants of our subsidiary. Because the grant of Awards under the 2020 Plan will be within the discretion of the Committee, it is not possible to determine the Awards that will be made to executive officers or directors under the 2020 Plan.\nShares Subject to the 2020 Plan. The total number of Awards to acquire shares of Common Stock, shares of restricted stock and RSUs shall be 2,000,000. The maximum number of shares that may be subject to ISOs granted under the 2020 Plan shall be 2,000,000, subject to adjustment as provided in the 2020 Plan. The total amount of Common Stock that may be granted under the 2020 Plan to any single person in any calendar year may not exceed in the aggregate 2,000,000 shares. To the extent that an Award lapses or is forfeited, the shares subject to such Award will again become available for grant under the terms of the 2020 Plan.\nAdministration. Although the Board has the authority to administer the 2020 Plan, it has the right to delegate this authority to the Committee. Each member of the Committee, if any, will be a non-employee director within the meaning of Rule 16b-3 promulgated under the Securities Exchange Act of 1934, as amended, or the Exchange Act, and an outside director within the meaning of Section 162(m) of the Internal Revenue Code of 1986, as amended, or the Code.\nSubject to the terms of the 2020 Plan, the Committees authority includes the authority to: (1) select or approve Award recipients; (2) determine the terms and conditions of Awards, including the price to be paid by a participant for any Common Stock; and (3) interpret the 2020 Plan and prescribe rules and regulations for its administration.\nStock Options. The Committee may grant ISOs or nonqualified stock options, or Options. The Committee determines the number of shares of Common Stock subject to each Option, provided that in no event shall the aggregate fair market value of the shares of Common Stock with respect to which ISOs are exercisable for the first time by a participant during any calendar year shall not exceed $100,000. The Committee determines the exercise price of an Option, its duration and the manner and time of exercise. However, in no event shall an Option be exercisable more than ten years following the grant date thereof. ISOs may be issued only to employees of the Company or of a corporate subsidiary of ours, and the exercise price must be at least equal to the fair market value of the Common Stock as of the date the Option is granted. Further, an ISO must be exercised within ten years of grant. The Committee, in its discretion, may provide the vesting terms of any Option, provided that if no schedule is specified at the time of grant, the Option shall vest as follows: (i) on the six month anniversary of the date of the grant, the Option shall vest and shall become exercisable with respect to 25% of the Common Stock to which it pertains; and (ii) on the seven month and each successive month anniversary to and including the twenty four month anniversary, the Award shall vest and become exercisable with respect to an additional 1/24th of shares of Common Stock to which it pertains. The vesting of one or more outstanding Options may be accelerated by the Committee at such times and in such amounts as it shall determine in its sole discretion. Options may be exercisable for one year following the termination of employment or other service relationship, unless the Committee specifies otherwise, in the event the Option is an ISO, in the event of a termination for cause or the expiration date of the Option.\nThe exercise price of an Option may be paid in cash or by certified or cashiers check, or, at the discretion of the Committee, in shares of Common Stock owned by the participant, or by means of a cashless exercise procedure in which a broker transmits to us the exercise price in cash, either as a margin loan or against the participants notice of exercise and confirmation by us that we will issue and deliver to the broker stock certificates for that number of shares of Common Stock having an aggregate fair market value equal to the exercise price.\nOptions granted under the 2020 Plan and the rights and privileges conferred by the 2020 Plan may not be transferred, assigned, pledged or hypothecated in any manner (whether by operation of law or otherwise) other than by will or by applicable laws of descent and distribution.\nStock Grants. The Committee may issue shares of Common Stock to participants with restrictions, as determined by it in its discretion, as well as restricted stock units, which are contractual commitments to deliver shares of Common Stock pursuant to a vesting schedule. Restrictions may include conditions that require the participant to forfeit the shares in the event that the holder ceases to provide services to us and/or if certain performance goals are not met (see discussion below). The recipient of a stock grant, including a stock grant subject to restrictions, unless otherwise provided for in a restricted stock agreement, has the rights of a stockholder of ours to vote and to receive payment of dividends on our Common Stock. Holders of restricted stock units and Options do not enjoy voting and dividend rights until the Award is settled in actual shares of Common Stock or the option is exercised, as the case may be.\nEffect of Certain Corporate Transactions. If a recapitalization or similar transaction occurs that does not alter the existing proportionate ownership of the Common Stock, appropriate adjustments shall be made in the exercise price and number of outstanding Options and in the terms of restricted stock and RSUs. In the case of a merger, acquisitive transaction, reorganization, liquidation or other transaction, or Major Transaction, that does alter such proportionate ownership, vested Options generally may be exercised before such transaction and persons owning Common Stock as a result of Awards made under the 2020 Plan will participate on the same basis as other owners of Common Stock. Alternatively, the Board may determine in the case of a Major Transaction that Options, restricted stock and RSUs will continue in effect on a basis similar to that in effect prior to such Major Transaction, including with respect to vesting, except that such rights shall apply with respect to the surviving entity. The Board may, in its discretion, accelerate vesting in whole or in part in connection with a Major Transaction.\nPerformance Goals. If the Committee desires to tie an Award to performance goals, the performance goals selected by the Committee must be based on the achievement of specified levels of one, or any combination, of the following business criteria: return on equity, return on assets, share price, market share, sales, earnings per share, costs, net earnings, net worth, inventories, cash and cash equivalents, gross margin or the Companys performance relative to its internal business plan. Performance objectives may be in respect of the performance of the Company as a whole (whether on a consolidated or unconsolidated basis), a related corporation, or a subdivision, operating unit, product or product line of either of the foregoing. Performance objectives may be absolute or relative and may be expressed in terms of a progression or a range. An Award that is exercisable (in full or in part) upon the achievement of one or more performance objectives may be exercised only following written notice to the participant and the Company by the Committee that the performance objective has been achieved. After the close of the applicable performance period, which may consist of more than one year, and generally before the close of the next years first quarter, the Committee will determine the extent to which the performance goals were satisfied and make a final determination with respect to an Award.\nFurther Amendments to the 2020 Plan. The Board or the Committee may, at any time, modify, amend or terminate the 2020 Plan or modify or amend Awards granted under the 2020 Plan, including, without limitation, such modifications or amendments as are necessary to maintain compliance with applicable laws. However, the Board or the Committee may not, without approval of the Companys stockholders: (1) increase the total number of shares covered by the 2020 Plan, except by adjustments upon certain changes in capitalization; (2) change the aggregate number of shares of Common Stock that may be issued to any single person; (3) change the class of persons eligible to receive Awards under the 2020 Plan; or (4) make other changes in the 2020 Plan that require stockholder approval under applicable law (including any rules of any applicable stock exchange or stock quotation system of which the Companys shares of Common Stock are is traded). Except as otherwise provided in the 2020 Plan or an award agreement, no amendment will adversely affect outstanding Awards without the consent of the participant. Any termination of the 2020 Plan will not terminate Awards then outstanding, without the consent of the participant.\nTerm of the 2020 Plan. Unless sooner terminated by the Board, the 2020 Plan will terminate on the day prior to the 10th anniversary of its adoption by the Board. No Award may be granted after such termination or during any suspension of the 2020 Plan.\nU.S. Tax Treatment. The following description of the federal income tax consequences of Awards is general and does not purport to be complete.\nIncentive Stock Options\nGenerally, a participant incurs no federal income tax liability on either the grant or the exercise of an ISO, although a participant will generally have taxable income for alternative minimum tax purposes at the time of exercise equal to the excess of the fair market value of the shares subject to the Option over the exercise price. Provided that the shares are held for at least one year after the date of exercise of the Option and at least two years after its date of grant, any gain realized on a subsequent sale of the shares will be taxed as long-term capital gain. If the shares are disposed of within a shorter period of time, the participant will recognize ordinary compensation income in an amount equal to the difference between the fair market value of the shares on the date of exercise (or the sale price of the shares sold, if less) over the exercise price. The Company receives no tax deduction on the grant or exercise of an ISO, but the Company is entitled to a tax deduction if the participant recognizes ordinary compensation income on account of a premature disposition of shares acquired on exercise of an ISO, in the same amount and at the same time as the participant recognizes income.\nNonQualified Stock Options\nA participant realizes no taxable income when a nonqualified stock option is granted. Instead, the difference between the fair market value of the shares acquired pursuant to the exercise of the Option and the exercise price paid is taxed as ordinary compensation income when the Option is exercised. The difference is measured and taxed as of the date of exercise, if the shares are not subject to a substantial risk of forfeiture, or as of the date or dates on which the risk terminates in other cases. A participant may elect (as described under Stock Awards below) to be taxed on the difference between the exercise price and the fair market value of the shares on the date of exercise, even though some or all of the shares acquired are subject to a substantial risk of forfeiture. Once ordinary compensation income is recognized, gain on the subsequent sale of the shares is taxed as short-term or long-term capital gain, depending on the holding period after exercise. The Company receives no tax deduction on the grant of a nonqualified stock option, but it is entitled to a tax deduction when a participant recognizes ordinary compensation income on or after exercise of the Option, in the same amount as the income recognized by the participant.\nStock Awards\nA person who receives an award of shares without any restrictions will recognize ordinary compensation income equal to the fair market value of the shares over the amount (if any) paid. If the shares are subject to restrictions, the recipient generally will not recognize ordinary compensation income at the time the award is received but will recognize ordinary compensation income when restrictions constituting a substantial risk of forfeiture lapse, including satisfying any accelerated vesting conditions as a result of retirement. The amount of that income will be equal to the excess of the aggregate fair market value, as of the date the restrictions lapse, over the amount (if any) paid for the shares. Alternatively, a person may elect to be taxed, pursuant to Section 83(b) of the Code, on the excess of the fair market value of the shares at the time of grant over the amount (if any) paid for the shares, notwithstanding any restrictions. All such taxable amounts are deductible by the Company at the time and in the amount of the ordinary compensation income recognized by the recipient.\nRestricted Stock Units\nA person who receives RSUs generally will not recognize ordinary compensation income at the time of grant. Rather, the recipient will generally recognize ordinary compensation income equal to the fair market value of the shares or cash received less the price paid, if any, at the time the RSUs settles (generally shortly after vesting, although further deferral may be permitted). When any shares received are subsequently sold, the recipient generally will recognize capital gain or loss equal to the difference between the amount realized upon the sale of the shares and his or her tax basis in the shares (generally, the fair market value of the shares when acquired). The capital gain or loss will be long-term if the shares were held for more than one (1) year or short-term if held for a shorter period. The Company will be entitled to a tax deduction when the recipient recognizes ordinary compensation income.\nDividends\nThe full amount of dividends or other distributions of property made with respect to share Awards before the lapse of any applicable restrictions will constitute ordinary compensation income, and the Company is entitled to a deduction at the same time and in the same amount as the income is realized by the recipient (unless an election under Section 83(b) of the Code has been made). Cash dividends are generally not available with respect to Options and RSUs until exercised or settled, respectively. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nBeneficial ownership is determined in accordance with the rules of the SEC, and generally includes voting power and/or investment power with respect to the securities held. Shares of common stock subject to options and warrants currently exercisable or which may become exercisable within 60 days of July 28, 2021 are deemed outstanding and beneficially owned by the person holding such options or warrants for purposes of computing the number of shares and percentage beneficially owned by such person, but are not deemed outstanding for purposes of computing the percentage beneficially owned by any other person. Except as indicated in the footnotes to this table, the persons or entities named have sole voting and investment power with respect to all shares of our common stock shown as beneficially owned by them.\nThe following table provides for percentage ownership assuming 232,222,818 shares are issued and outstanding as of July 13, 2022. Unless otherwise indicated, the address of each beneficial holder of our common stock is our corporate address.\nName of Beneficial Owner Shares of\nCommon Stock Beneficially\nOwned Percentage of\nShares of\nCommon Stock\nBeneficially Owned\nGreater than 10% Stockholders\nLexxus, LLC(1) $ 67,500,000 29.07 %\nLifestyle Healthcare LLC(2) 24,658,290 10.62 %\nNamed Executive Officers and Directors\nSteven R. Howe(1) $ 67,500,000 29.07 %\nJainal Bhuiyan(3) 49,861,500 21.47 %\nNickolay Kukekov(4) 58,408,290 25.15 %\nDr. Andrew E. Trumbach - -\nAll Directors and Officers as a Group (4 persons) (2)(3)(4) $ 175,769,790 75.9 %\n(1) Steve Howe, the Executive Chairman and Director of the Company, is the managing member and sole owner of Lexxus, LLC, and has voting and dispositive control over the shares owned by Lexxus, LLC.\n(2) The address of Lifestyle Healthcare is 4524 Westway Avenue, Dallas, TX 75205. Nickolay Kukekov has voting and dispositive power over the shares. Dr. Kukekov disclaims beneficial ownership of these shares except to the extent of his pecuniary interest therein.\n(3) Includes 3,563,025 shares held of record by Formul8 Labs. Mr. Bhuiyan is the principal and sole owner of such entity and has voting and dispositive control over such shares.\n(4) Includes 24,658,290 held by Lifestyle Healthcare LLC. Dr. Kukekov disclaims beneficial ownership of the shares held by Lifestyle except to the extent of his pecuniary interest therein. Item 13. Certain Relationships and Related Transactions, and Director Independence\nThere have been no transactions since March 31, 2018 to which the Company has been a participant in which the amount involved exceeded or will exceed the lesser of $120,000 or 1% of the average of the Companys total assets as of March 31, 2022, and in which any of our directors, executive officers or holders of more than five percent of our capital stock, or any members of their immediate family, had or will have a direct or indirect material interest, other than compensation arrangements which are described under Executive Compensation and as provided below\nContract Services Agreement\nThe Company outsources its manufacturing pursuant to a Contract Services Agreement with DryRX, LLC dated as of January 1, 2020, which replaced and superseded the Contract Services Agreement with DryRX, LLC dated as of July 22, 2018 which expired in accordance with its terms. The Contract Services Agreement, among other things, provides that DryRX shall provide manufacturing and support services, including sales, marketing, invoicing and technical support, on behalf of the Company, and shall be responsible for the manufacturing oversight and production operations of the Companys products. In return, the Company is obligated to pay to DryRX a fee equal to 10% of net sales less cost-of-goods-sold and all expenses associated with the services. The Company advanced funds to DryRX to cover the work they are performing under the agreement. As expenses are incurred the balance is moved from due from related party to expenses. The Company incurred expenses under this agreement for selling and marketing expenses of $356,261 and $52,804 during the years ended March 31, 2021 and 2020, respectively. DryRX is owned and controlled by Steve Howes brother.\nConsulting Agreement\nThe Company entered into a Consulting Agreement with an affiliate of Steve Howe pursuant to which he provided management and oversight on behalf of the Company, which Consulting Agreement was extended through 2021 in accordance with its terms. The Company incurred consulting expenses under this agreement of $13,620 ended March 31, 2022 and $244,186 (of which $240,000 was compensation to Mr. Howe and the remainder as reimbursement of expenses) for the fiscal year ended March 31, 2021.\nLicense Agreement\nOn April 30, 2019, Omnia Corp. entered into a worldwide exclusive license with Drywave Technologies USA, Inc., which is the owner or exclusive licensee of certain of the technology, patent and other intellectual property rights, and know-how related to our dry hydrotherapy massage products. Pursuant to the terms and conditions of the license agreement, the Company received intellectual property rights to manufacture, use, and offer for sale all the products related to the patents and trademarks for dry hydrotherapy therapy technologies. The license fee to acquire the technology is $2,000,000, all of which has been paid. The Company is also obligated to pay to Drywave a royalty of 3% of net sales beginning May 1, 2020 and continuing for the longer of the period in which there are valid patent claims or ten years. Drywave is wholly-owned by Steve Howe, our Executive Chairman.\nThe Acquisition\nPursuant to the Exchange Agreement for the Acquisition whereby Omnia Corp. became a wholly-owned subsidiary of the Company, each holder of Omnia Corp. shares outstanding immediately prior to the Closing received shares of our common stock in exchange therefore based on a one-for-one exchange ratio, with all fractional shares rounded up to the nearest whole share. Accordingly, we issued 2,500,000 and 2,250,000 shares of our common stock to Messrs. Bhuiyan and Kukekov, respectively, 750,000 shares of our common stock to Lifestyle Healthcare LLC, an affiliate of Dr. Kukekov, and 4,500,000 shares of our common stock to Lexxus, LLC, an affiliate of Steve Howe. Furthermore, at the Closing, in connection with the Acquisition, an aggregate of $500,000 principal amount of convertible promissory notes of Omnia Corp. converted in accordance with their terms into an aggregate of 1,269,665 shares of our common stock. Of such shares, 729,730 were issued to Nickolay Kukekov, a director, and 539,935 were issued to M. Jainal Bhuiyan, a director and executive officer, or their respective affiliates. Prior to the Closing, Messrs. Kukekov and Bhuiyan, or their affiliates, already owned an aggregate of 448,321 shares of Omnia Inc.s common stock, which represented approximately 1% of Omnia Inc.s issued and outstanding common stock at that time.\nAdditionally, as of the Closing, Mr. Amer Samad, our former sole director and executive officer, agreed to cancel 52,656,888 shares of our common stock as part of the conditions to Closing.\nAssignment and Assumption Agreement\nAs of immediately prior to the closing of the Acquisition, the Company entered into an Assignment and Assumption Agreement with RZI Consulting LLC (the Assignment Agreement), pursuant to which RZI Consulting LLC assumed substantially all of the Companys remaining assets and liabilities through the closing of the Acquisition. Accordingly, as of the closing of the Acquisition, the Company had no assets or liabilities (other than relating to general and administrative expenses). RZI Consulting LLC is owned by Messrs. Kukekov and Bhuiyan.\nNotes Outstanding\nAs of July 28, 2021, and taking into account the Closing and the conversion of an aggregate of approximately $500,000 in convertible notes specified above, the Company has outstanding indebtedness in favor of Messrs. Kukekov and Bhuiyan, and their respective affiliates, in the aggregate principal amount of approximately $1,048,110.\nIndemnification Agreements\nOur certificate of incorporation contains provisions limiting the liability of directors, and our bylaws provides that we indemnify each of our directors to the fullest extent permitted under Nevada law. Our certificate of incorporation and bylaws also provide our board of directors with discretion to indemnify our officers and employees when determined appropriate by the board.\nRelated Person Transaction Policy\nThe Board intends to implement a policy to review, approve and oversee any transaction between us and any related person and any other potential conflict of interest situations on an ongoing basis, and develops policies and procedures for the approval of related party transactions. Prior to consideration of a transaction with a related person, the material facts as to the related persons relationship or interest in the transaction would be disclosed to the disinterested directors. The transaction would not be approved unless a majority of the members of the Board who are not interested in the transaction approve the transaction. The Board intends to takes into account, among other factors that it deems appropriate, whether the related person transaction is on terms no less favorable to us than terms generally available in a transaction with an unrelated third-party under the same or similar circumstances and the extent of the related persons interest in the related person transaction.\nDirector Independence\nWe use the definition of independence of The NASDAQ Stock Market to make this determination. NASDAQ Listing Rule 5605(a)(2) provides that an independent director is a person other than an officer or employee of the company or any other individual having a relationship, which, in the opinion of the Companys Board, would interfere with the exercise of independent judgment in carrying out the responsibilities of a director. The NASDAQ listing rules provide that a director cannot be considered independent if:\n● The director is, or at any time during the past three years was, an employee of the company;\n● The director or a family member of the director accepted any compensation from the company in excess of $120,000 during any period of 12 consecutive months within the three years preceding the independence determination (subject to certain exclusions, including, among other things, compensation for board or board committee service);\n● A family member of the director is, or at any time during the past three years was, an executive officer of the company;\n● The director or a family member of the director is a partner in, controlling stockholder of, or an executive officer of an entity to which the company made, or from which the company received, payments in the current or any of the past three fiscal years that exceed 5% of the recipients consolidated gross revenue for that year or $200,000, whichever is greater (subject to certain exclusions);\n● The director or a family member of the director is employed as an executive officer of an entity where, at any time during the past three years, any of the executive officers of the company served on the compensation committee of such other entity; or\n● The director or a family member of the director is a current partner of the companys outside auditor, or at any time during the past three years was a partner or employee of the companys outside auditor, and who worked on the companys audit.\nUnder such definitions, none of our directors can be considered independent. Item 14. Principal Accounting Fees and Services\nThe following table sets forth the aggregate fees billed to us and expected to be billed to us BF Borgers CPA PC, our principal accountants for 2022 and 2021:\nYear Ended March 31,\n(In thousands)\nAudit fees $ 168,300 $ 102,100\nAudit related fees - -\nTax fees - -\nAll other fees - -\nTotal fees billed $ 168,300 $ 102,100\nPART IV Item 15. Exhibits, Financial Statement Schedules\nDocuments Filed as Part of Report\nFinancial Statements\nThe following Consolidated Financial Statements of the Company are filed as part of this report:\n1. Report of Independent Registered Public Accounting Firm.\n2. Consolidated Balance Sheets - At March 31, 2022 and 2021.\n3. Consolidated Statements of Operations - Years ended March 31, 2022 and 2021.\n4. Consolidated Statements of Changes in Stockholders (Deficit) - Years ended March 31, 2022 and 2021.\n5. Consolidated Statements of Cash Flows- Years ended March 31, 2022 and 2021.\n6. Notes to Consolidated Financial Statements.\nSee Item 8. Financial Statements and Supplementary Data.\nFinancial Statement Schedules\nNo other financial statement schedules are filed as part of this report because such schedules are not applicable or the required information is shown in the Consolidated Financial Statements or notes thereto. See Item 8. Financial Statements and Supplementary Data.\nExhibits\nThe following exhibits are filed as part of this Annual Report:\nExhibit No.\nDocument\n2.1\nShare Exchange And Reorganization Agreement by and among Glolex Inc., Bed Therapies Inc. and the beneficial stockholders of Bed Therapies Inc., dated as of April 17, 2020 (Incorporated by reference to the Companys Current Report on Form 8-K filed on April 22, 2020)\n3.1\nAmended and Restated Articles of Incorporation of Omnia Wellness Inc. (Incorporated by reference to the Companys Current Report on Form 8-K filed on March 11, 2020)\n3.2\nCertificate of Amendment to Amended and Restated Articles of Incorporation of Omnia Wellness Inc. (Incorporated by reference to the Companys Current Report on Form 8-K filed on March 18, 2020)\n3.3\nAmended and Restated By-Laws of Omnia Wellness Inc. (Incorporated by reference to the Companys Current Report on Form 8-K filed on January 11, 2021)\n3.4\nCertificate of Change (Incorporated by reference to the Companys Current Report on Form 8-K filed on April 7, 2021)\n4.1\nForm of Common Stock Certificate (Incorporated by reference to the Companys Current Report on Form 8-K filed on January 11, 2021)\n4.2\nFirst Common Stock Purchase Warrant (Incorporated by reference to the Companys Current Report on Form 8-K filed on June 30, 2021)\n4.3\nSecond Common Stock Purchase Warrant (Incorporated by reference to the Companys Current Report on Form 8-K filed on June 30, 2021)\n10.1\n2020 Equity Incentive Plan (Incorporated by reference to the Companys Current Report on Form 8-K filed on January 11, 2021)\n10.2\nForm of Stock Option Award Agreement pursuant to 2020 Equity Incentive Plan (Incorporated by reference to the Companys Current Report on Form 8-K filed on January 11, 2021)\n10.3\nWorldwide Exclusive License Agreement, dated April 30, 2019, between the Company and Drywave Technologies, Inc. (Incorporated by reference to the Companys Current Report on Form 8-K filed on January 11, 2021)\n10.4\nContract Services Agreement, effective as of January 1, 2020, by and between Solajet Financing Company LLC and DryRx, LLC (Incorporated by reference to the Companys Current Report on Form 8-K filed on January 11, 2021)\n10.5\nMaster Facility License Agreement, dated as of August 9, 2018, by and between Fitness International, LLC, both on its own and on behalf of its wholly owned subsidiary, Fitness & Sports Clubs, LLC, and Drywave Technologies, USA, Inc., both on its own and on behalf of its wholly owned subsidiary, Massagewave, Inc. (Incorporated by reference to the Companys Current Report on Form 8-K filed on January 11, 2021)\n10.6\nMaster Facility License Agreement Assignment, dated as of September 30, 2018, by and between Bed Therapies, LLC, Fitness International, LLC, both on its own and on behalf of its wholly owned subsidiary, Fitness & Sports Clubs, LLC, and Drywave Technologies, USA, Inc., both on its own and on behalf of its wholly owned subsidiary, Massagewave, Inc. (Incorporated by reference to the Companys Current Report on Form 8-K filed on January 11, 2021)\n10.7\nForm of 4% Promissory Note (Incorporated by reference to the Companys Current Report on Form 8-K filed on January 11, 2021)\n10.8\nForm of Promissory Note (10%/14%/20%) (Incorporated by reference to the Companys Current Report on Form 8-K filed on January 11, 2021)\n10.9\nForm of Convertible Promissory Note (1%/4%/12%) (Incorporated by reference to the Companys Current Report on Form 8-K filed on January 11, 2021)\n10.10\nAssignment and Assumption Agreement (Incorporated by reference to the Companys Current Report on Form 8-K filed on January 11, 2021)\n10.11\nForm of 12% Convertible Promissory Note (Incorporated by reference to the Companys Current Report on Form 8-K filed on January 11, 2021)\n10.12\nSecured Loan and Revenue Participation Agreement, dated as of September 18, 2019, by and between LG 2017 Holdings LLC and Solajet Financing Company LLC (Incorporated by reference to the Companys Current Report on Form 8-K filed on January 11, 2021)\n10.13\nAmendment to Secured Loan and Revenue Participation Agreement, dated as of February 24, 2020, by and between LG 2017 Holdings LLC and Solajet Financing Company LLC (Incorporated by reference to the Companys Current Report on Form 8-K filed on January 11, 2021)\n10.14\nSecured Loan and Revenue Participation Agreement, dated as of October 9, 2019, by and between Chartwell Capital US LP and Solajet Financing Company LLC (Incorporated by reference to the Companys Current Report on Form 8-K filed on January 11, 2021)\n10.15\nSecured Loan and Revenue Participation Agreement, dated as of March 10, 2020, by and between Chartwell Capital US LP and Solajet Financing Company LLC (Incorporated by reference to the Companys Current Report on Form 8-K filed on January 11, 2021)\n10.16\nAmendment to Secured Loan and Revenue Participation Agreement, dated as of February 24, 2020, by and between Chartwell Capital US LP and Solajet Financing Company LLC (Incorporated by reference to the Companys Current Report on Form 8-K filed on January 11, 2021)\n10.17\nExtension to Promissory Note, dated as of February 1, 2020, by and between Bed Therapies, Inc. and Barry Pressman (Incorporated by reference to the Companys Current Report on Form 8-K filed on January 11, 2021)\n10.18\nConvertible Promissory Note (Incorporated by reference to the Companys Current Report on Form 8-K filed on February 1, 2021)\n10.19\nExtension to Promissory Note (Incorporated by reference to the Companys Current Report on Form 8-K filed on February 9, 2021)\n10.20\nConvertible Promissory Note (Incorporated by reference to the Companys Current Report on Form 8-K filed on February 9, 2021)\n10.21\nConvertible Promissory Note (Incorporated by reference to the Companys Current Report on Form 8-K filed on March 15, 2021)\n10.22\nCFO Consulting Agreement (Incorporated by reference to the Companys Current Report on Form 8-K filed on March 15, 2021)\n10.23\nPromissory Note (Incorporated by reference to the Companys Current Report on Form 8-K filed on April 7, 2021)\n10.24\n10% Promissory Note (Incorporated by reference to the Companys Current Report on Form 8-K filed on April 7, 2021)\n10.25\n$50K Convertible Promissory Note (Incorporated by reference to the Companys Current Report on Form 8-K filed on June 24, 2021)\n10.26\n$250K Optional Convertible Promissory Note (Incorporated by reference to the Companys Current Report on Form 8-K filed on June 24, 2021)\n10.27\nStock Purchase Agreement (Incorporated by reference to the Companys Current Report on Form 8-K filed on June 28, 2021)\n10.28\nStock Purchase Agreement (Incorporated by reference to the Companys Current Report on Form 8-K filed on June 30, 2021)\n10.29\nSecured Promissory Note (Incorporated by reference to the Companys Current Report on Form 8-K filed on June 30, 2021)\n10.30\nSecurity Agreement (Incorporated by reference to the Companys Current Report on Form 8-K filed on June 30, 2021)\n10.31\nSubsidiary Guarantee (Incorporated by reference to the Companys Current Report on Form 8-K filed on June 30, 2021)\n14.1\nCode of Business Conduct and Ethics (Incorporated by reference to the Companys Current Report on Form 8-K filed on January 11, 2021)\n21.1\nSubsidiaries of Registrant (Incorporated by reference to the Companys Current Report on Form 8-K filed on January 11, 2021)\n31.1\nCertification Pursuant to Securities Exchange Act Rule 13(a)-14(a), as Adopted Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 (Steve R. Howe, Principal Executive Officer)\n31.2\nCertification Pursuant to Securities Exchange Act Rule 13(a)-14(a), as Adopted Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 (Dr. Andrew E. Trumbach, Principal Financial Officer)\n32.1\nCertification Pursuant to 18 U.S.C. Section 1350, As Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002 (Steve R. Howe, Principal Executive Officer)\n32.2\nCertification Pursuant to 18 U.S.C. Section 1350, As Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002 (Dr. Andrew E. Trumbach, Principal Financial Officer)\n101.1 Inline XBRL Instance.\n101.SCH Inline XBRL Taxonomy Extension Schema.\n101.CAL Inline XBRL Taxonomy Extension Calculation.\n101.DEF Inline XBRL Taxonomy Extension Definition.\n101.LAB Inline XBRL Taxonomy Extension Labels.\n101.PRE Inline XBRL Taxonomy Extension Presentation.\nCover Page Interactive Data File\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nOMNIA WELLNESS INC.\n/s/ Steve R. Howe\nSteve R. Howe, Executive Chairman, Principal Executive Officer\nDate: October 17, 2022\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nOMNIA WELLNESS INC.\n/s/ Andrew E. Trumbach\nAndrew E. Trumbach, Chief Financial Officer, Principal Financial Officer\nDate: October 17, 2022\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nDate: October 17, 2022\n/s/ Steve R. Howe\nSteve R. Howe, Executive Chairman and Director\nDate: October 17, 2022\n/s/ Jainal Bhuiyan\nJainal Bhuiyan, President and Director\nDate: October 17, 2022\n/s/ Nickolay Kukekov\nNickolay Kukekov, Director"
}