{
    "cik": "1678105",
    "company": "Caro Holdings Inc.",
    "filing_type": "10-K",
    "filing_date": "2022-10-17",
    "period_of_report": "2022-03-31",
    "sic": "5961",
    "state_of_inc": "NV",
    "state_location": "X0",
    "fiscal_year_end": "0331",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1678105/0001640334-22-002242-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1678105/000164033422002242/caro_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1678105/0001640334-22-002242.txt",
    "filename": "1678105_10K_2022_0001640334-22-002242.htm",
    "content": "Item 1. Description of Business.\nOur Company\nThis annual report contains forward-looking statements. These statements relate to future events or our future financial performance. In some cases, you can identify forward-looking statements by terminology such as may, should, expects, plans, anticipates, believes, estimates, predicts, potential or continue or the negative of these terms or other comparable terminology. These statements are only predictions and involve known and unknown risks, uncertainties and other factors, including the risks in the section entitled Risk Factors that may cause our or our industrys actual results, levels of activity, performance or achievements to be materially different from any future results, levels of activity, performance or achievements expressed or implied by these forward-looking statements.\nAlthough we believe that the expectations reflected in the forward-looking statements are reasonable, we cannot guarantee future results, levels of activity, performance or achievements. Except as required by applicable law, including the securities laws of the United States, we do not intend to update any of the forward-looking statements to conform these statements to actual results.\nOur financial statements are stated in United States Dollars (US$) and are prepared in accordance with United States Generally Accepted Accounting Principles.\nIn this annual report, unless otherwise specified, all dollar amounts are expressed in United States dollars and all references to common shares refer to the common shares in our capital stock.\nAs used in this current report and unless otherwise indicated, the terms we, us, our and \"Caro\" mean Caro Holdings Inc., unless otherwise indicated.\nOur History\nOur company was incorporated on March 29, 2016 in the State of Nevada. We had been engaged in the subscription box business with our initial focus on offering sock subscriptions to our customers. Our subscription box was a package of a pair of socks that will be sent directly to a customer on a recurring basis. For example, a potential subscriber would subscribe to receive a pair of socks once a month for either a period of 6 months or 12 months. Our subscription sock boxes were a marketing strategy and a method of product distribution, allowing us to target a wide range of customers and cater to their variety of specific needs and interests. We are a small early-stage development company. To date, our company's activities have been limited to the sourcing of our advertising channels, initial branding efforts, and in our formation and the raising of equity capital. We have no revenues and have limited cash on hand. We have sustained losses since inception and have relied upon loans from directors and officers and the sale of our securities for funding. We have never declared bankruptcy, been in receivership, or involved in any kind of legal proceeding.\nRevenue\nWe had no revenue for the year ended March 31, 2022 and 2021.\nOur Current Business\nWe are now engaged in the development of our Direct To Consumer systems and methodologies where we analyze the marketplace and work with mid-size brands that have a strong bricks and mortar presence, and have a desire to increase their digital presence.\nOur Direct to Consumer System (D2C) will be a fully integrated, end-to-end system that allows full control of data that provides insight from multiple channels so together with our clients successful marketing decisions can be based on the entire business' performance. Based on these analytics, the system can immediately deploy personalization and optimization independently and readily understand how customer interactions vary across different regions. Furthermore, we believe we have the necessary infrastructure to take advantage of growth opportunities with minimal additional costs.\nInventory\nThe Company does not currently have any inventory on hand.\nStatus of Any Publicly Announced New Product or Service\nWe have not developed any new or unique products or services that have not already been announced.\nGovernment Regulation\nWe are subject to general business regulations and laws, as well as regulations and laws specifically governing the Internet and e-commerce. Existing and future laws and regulations may impede the growth of our Internet or e-commerce services. These regulations and laws may cover taxation, privacy, data protection, pricing, content, copyrights, distribution, mobile communications, electronic contracts and other communications, consumer protection, the provision of e-commerce payment services, unencumbered Internet communications, consumer protection, the provision of e-commerce payment services, unencumbered Internet access to our services, the design and operation of websites and the characteristics and quality of products and services. It is not clear how certain existing laws governing issues such as property ownership, libel and personal privacy apply to the Internet and e-commerce. Unfavorable regulations and laws could diminish the demand for our products and services and increase our costs of doing business. In addition, we may be subject to international trade agreements, such as the North American Free Trade Agreement and the activities and regulations of the World Trade Organization. We believe that we are in conformity with all applicable laws in the United States and the Philippines. While we believe that our operations are in compliance with all applicable regulations, there can be no assurances that from time to time unintentional violations of such regulations will not occur.\nCost and Effects of Compliance with Environmental Laws\nCompliance with federal, state and local provisions regulating the discharge of material into the environment or otherwise relating to the protection of the environment has not had a material effect upon our capital expenditures, earnings or competitive position. We believe the nature of our operations have little, if any, environmental impact. We therefore anticipate no material capital expenditures for environmental control facilities for our current fiscal year or for the near future. Our Employees We have no employees. Our sole officer and director furnishes their time to the development of our company at no cost. We do not foresee hiring any employees in the near future. We will engage independent contractors to help design and develop our website and marketing efforts.\nAcquisition Interest\nAs part of our investigation, we expect to meet personally with management and key personnel, visit and inspect material facilities, obtain independent analysis of verification of certain information provided, check references of management and key personnel, and take other reasonable investigative measures, to the extent of our limited financial resources and management expertise. The manner in which we participate in an opportunity will depend on the nature of the opportunity, the respective needs and desires of both parties, and the management of the opportunity.\nWith respect to any merger or acquisition, and depending upon, among other things, the target companys assets and liabilities, our stockholders will in all likelihood hold a substantially lesser percentage ownership interest in us following any merger or acquisition. The percentage ownership may be subject to significant reduction in the event we acquire a target company with assets and expectations of growth. Any merger or acquisition can be expected to have a significant dilutive effect on the percentage of shares held by our stockholders.\nWe will participate in a business opportunity only after the negotiation and execution of appropriate written business agreements. Although the terms of such agreements cannot be predicted, generally we anticipate that such agreements will (i) require specific representations and warranties by all of the parties; (ii) specify certain events of default; (iii) detail the terms of closing and the conditions which must be satisfied by each of the parties prior to and after such closing; (iv) outline the manner of bearing costs, including costs associated with the Companys attorneys and accountants; (v) set forth remedies on defaults; and (vi) include miscellaneous other terms.\nAs stated above, we will not acquire or merge with any entity which cannot provide independent audited financial statements within a reasonable period of time after closing of the proposed transaction. If such audited financial statements are not available at closing, or within time parameters necessary to insure our compliance within the requirements of the 1934 Act, or if the audited financial statements provided do not conform to the representations made by that business to be acquired, the definitive closing documents will provide that the proposed transaction will be voidable, at the discretion of our present management. If such transaction is voided, the definitive closing documents will also contain a provision providing for reimbursement for our costs associated with the proposed transaction.\nInvestment Company Act 1940\nAlthough we will be subject to regulation under the Securities Act of 1933, as amended, and the 1934 Act, we believe we will not be subject to regulation under the Investment Company Act of 1940 (the 1940 Act) insofar as we will not be engaged in the business of investing or trading in securities. In the event we engage in business combinations that result in us holding passive investment interests in a number of entities, we could be subject to regulation under the 1940 Act. In such event, we would be required to register as an investment company and incur significant registration and compliance costs. We have obtained no formal determination from the SEC as to our status under the 1940 Act and, consequently, any violation of the 1940 Act would subject us to material adverse consequences. We believe that, currently, we are exempt under Regulation 3a-2 of the 1940 Act.\nIntellectual Property\nWe own no intellectual property.\nEmployees\nWe presently have no full time executive, operational or clerical staff.\nFactors Effecting Future Performance\nRather than an operating business, our goal is to obtain debt and/or equity financing to meet our ongoing operating expenses and attempt to merge with another entity with experienced management and opportunities for growth in return for shares of our common stock to create value for our shareholders.\nAlthough there is no assurance that this series of events will be successfully completed, we believe we can successfully complete an acquisition or merger which will enable us to continue as a going concern. Any acquisition or merger will most likely be dilutive to our existing stockholders.\nWHERE YOU CAN FIND MORE INFORMATION\nYou are advised to read this Form 10-K in conjunction with other reports and documents that we file from time to time with the SEC. Our Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and amendments to reports filed or furnished pursuant to Sections 13(a) and 15(d) of the Securities Exchange Act of 1934, as amended, are available from the SEC website at www.sec.gov and on our corporate website at www.caroholdings.com. Item 1A. Risk Factors\nAs a smaller reporting company, we are not required to provide the information required by this Item. Item 1B. Unresolved Staff Comments\nAs a smaller reporting company, we are not required to provide the information required by this Item. Item 2. Properties\nOur principal business and corporate address is 848 Brickell Ave. Penthouse #5 Miami, FL 331331; our telephone number is +1 (786) 755 3210. We plan to find offices for our programmers, sales teams and executive team in the near future, as we evolve from a development stage company to an operational company.\nOur corporate website is http://www.caroholdings.com. Item 3. Legal Proceedings\nWe know of no material pending legal proceedings to which our company is a party or of which any of our properties, or the properties of our subsidiaries, is the subject. In addition, we do not know of any such proceedings contemplated by any governmental authorities. We know of no material proceedings in which any of our directors, officers or affiliates, or any registered or beneficial stockholder is a party adverse to our company or has a material interest adverse to our company or our subsidiaries. Item 4. Mine Safety Disclosures\nNot applicable. Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nOur common stock is quoted on the OTC Markets Group, Inc. over-the-counter marketplace.\nOur shares are issued in registered form. ClearTrust, LLC, 16540 Pointe Village Drive, Suite 210, Lutz, Florida 33558 (Telephone: (813) 235-4490; Facsimile: (813) 388-4549) is the registrar and transfer agent for our common shares.\nOn October 13, 2022, the shareholders list showed 8 registered shareholders with 40,000,000 shares of common stock outstanding.\nDividend Policy\nThere are no restrictions in our articles of incorporation or bylaws that prevent us from declaring dividends. The Nevada Revised Statutes, however, do prohibit us from declaring dividends where after giving effect to the distribution of the dividend: 1. we would not be able to pay our debts as they become due in the usual course of business, or; 2. our total assets would be less than the sum of our total liabilities plus the amount that would be needed to satisfy the rights of shareholders who have preferential rights superior to those receiving the distribution. We have not declared any dividends and we do not plan to declare any dividends in the foreseeable future.\nEquity Compensation Plan Information\nWe do not have any equity compensation plans.\nRecent Sales of Unregistered Securities; Use of Proceeds from Registered Securities\nWe did not sell any equity securities which were not registered under the Securities Act during the year ended March 31, 2022 that were not otherwise disclosed on our quarterly reports on Form 10-Q or our current reports on Form 8-K filed during the year ended March 31, 2022.\nPurchase of Equity Securities by the Issuer and Affiliated Purchasers\nWe did not purchase any of our shares of common stock or other securities during our fourth quarter of our fiscal year ended March 31, 2022. Item 6. Selected Financial Data\nAs a smaller reporting company, we are not required to provide the information required by this Item. Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion should be read in conjunction with our consolidated audited financial statements and the related notes that appear elsewhere in this annual report. The following discussion contains forward-looking statements that reflect our plans, estimates and beliefs. Our actual results could differ materially from those discussed in the forward looking statements. Factors that could cause or contribute to such differences include, but are not limited to those discussed below and elsewhere in this annual report. Our consolidated audited financial statements are stated in United States Dollars and are prepared in accordance with United States Generally Accepted Accounting Principles.\nResults of Operations\nThe following summary of our results of operations should be read in conjunction with our financial statements for the year ended March 31, 2022, which are included herein. Our operating results for the year ended March 31, 2022, for the year ended March 31, 2021 and the changes between those periods for the respective items are summarized as follows:\nYear Ended\nMarch 31,\nChange\nChange\nAmount\nPercentage\nOperating expenses\n$ 61,099\n$ 28,720\n32,379\n113 %\nLoss from operations\n(61,099 )\n(28,720 )\n(32,379 )\n113 %\nNet loss\n$ (61,099 )\n$ (28,720 )\n$ (32,379 )\n113 %\nDuring the year ended March 31, 2022 and 2021, we did not generate revenues.\nOperating expenses for the year ended March 31, 2022 consisted of audit and accounting fees, transfer agent fees, legal fees, rent expense and office general expenses. The increase in operating expenses was primarily as a result of increase in professional fees including DTC application fees of $18,000 incurred during the year ended March 31, 2022.\nLiquidity and Financial Condition\nWorking Capital (Deficiency)\nMarch 31, 2022\nMarch 31, 2021\nCurrent Assets\n$ -\n$ 3,929\nCurrent Liabilities\n22,003\n100,211\nWorking Capital (Deficiency)\n$ (22,003 )\n$ (96,282 )\nThe working capital deficiency decreased to $22,003 as of March 31, 2022 from $96,282 as of March 31, 2021 mainly due to a decrease in due to related party from $87,378 as of March 31, 2021 to $1,800 as of March 31, 2022. During the year ended March 31, 2022, the Company issued 32,295,000 shares of common stock at $0.0042 per share for the repayment of related party loan of $135,378.\nOur total current assets as of March 31, 2022 were $0 as compared to total current assets of $3,929 as of March 31, 2021.\nOur total current liabilities as of March 31, 2022 were $22,003 as compared to total current liabilities of $100,211 as of March 31, 2021. The decrease was primarily attributed by a decrease in due to related party.\nThe report of our auditors on our audited financial statements for the fiscal year ended March 31, 2022, contains a going concern qualification as we have suffered losses since our inception. We have minimal assets and have achieved limited operating revenues since our inception. We have been dependent on sales of equity securities to conduct operations. Unless and until we commence material operations and achieve material revenues, we will remain dependent on financings to continue our operations.\nCash Flows\nYear Ended\nMarch 31,\nCash used in Operating Activities\n$ (1,929 )\n$ (635 )\nCash provided by Financing Activities\n$ 500\n$ 650\nNet changes in cash during year\n$ (1,429 )\n$ 15\nOperating Activities\nFor the year ended March 31, 2022, net cash used in operating activities was $1,929, related to our net loss of $61,099 reduced by a decrease in prepaid expenses of $2,500 and an increase in accounts payable and accrued liabilities of $56,670. For the year ended March 31, 2021, net cash used in operating activities was $635, related to our net loss of $28,720, increased by an increase in prepaid expenses of $2,500 and reduced by an increase in accounts payable and accrued liabilities of $30,585.\nInvesting Activities\nWe did not use any funds for investing activities for the year ended March 31, 2022 and March 31, 2021. Financing Activities For the year ended March 31, 2022 and 2021, net cash provided by financing activities was $500 and $650 from advancement from related party for payment of operation expenses, respectively.\nCash Requirements\nWe will require additional funds for our budgeted expenses over the next 12 months. These funds may be raised through equity financing, debt financing, or other sources, which may result in further dilution in the equity ownership of our shares. There is still no assurance that we will be able to maintain operations at a level sufficient for an investor to obtain a return on his investment in our common stock. Further, we may continue to be unprofitable. We need to raise additional funds in the immediate future in order to proceed with our budgeted expenses.\nSpecifically, based on nominal operations we estimate our operating expenses and working capital requirements for the next 12 months to be as follows:\nWe will require additional financing in order to enable us to proceed with our plan of operations, as discussed above, including approximately $150,000 over the next 12 months to pay for our ongoing expenses. These expenses, which will of course be higher in the event we enter into any transactions include legal, accounting and audit fees as well as general and administrative expenses. These cash requirements are in excess of our current cash and working capital resources. Accordingly, we will require additional financing in order to continue operations and to repay our liabilities. There is no assurance that any party will advance additional funds to us in order to enable us to sustain our plan of operations or to repay our liabilities.\nWe anticipate continuing to rely on equity sales of our common stock in order to continue to fund our business operations. Issuances of additional shares will result in dilution to our existing stockholders. There is no assurance that we will achieve any additional sales of our equity securities or arrange for debt or other financing to fund our planned business activities.\nWe presently do not have any arrangements for additional financing for the expansion of our operations, and no potential lines of credit or sources of financing are currently available for the purpose of proceeding with our plan of operations.\nContractual Obligations\nAs a smaller reporting company, we are not required to provide tabular disclosure obligations.\nGoing Concern\nOur auditors have issued a going concern opinion. This means that there is substantial doubt that we can continue as an on-going business for the next twelve months. Our ability to continue as a going concern is dependent upon our ability to generate future profitable operations and/or obtain the necessary financing to meet our obligations and repay our liabilities arising from normal business operations when they become due. We intend to finance operating costs over the next twelve months through continued financial support from our shareholders and private placements of common stock. Off-Balance Sheet Arrangements We have no off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources that is material to stockholders.\nCritical Accounting Policies\nThe preparation of financial statements in accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. A change in managements estimates or assumptions could have a material impact on our financial condition and results of operations during the period in which such changes occurred. Actual results could differ from those estimates. Our financial statements reflect all adjustments that management believes are necessary for the fair presentation of their financial condition and results of operations for the periods presented.\nRecently Issued Accounting Pronouncements\nThe Company has implemented all new accounting pronouncements that are in effect and that may impact its financial statements and does not believe that there are any other new accounting pronouncements that have been issued that might have a material impact on its financial position or results of operations. The Company regularly reviews and analyses the recent accounting pronouncements. Item 7A. Quantitative and Qualitative Disclosures About Market Risk\nAs a smaller reporting company, we are not required to provide the information required by this Item. Item 8. Financial Statements and Supplementary Data\nCARO HOLDINGS, INC.\nFINANCIAL STATEMENTS\nPages\nReport of Independent Registered Public Accounting Firm PCAOB ID 206\nBalance Sheets\nStatements of Operations\nStatements of Changes in Stockholders Deficit\nStatements of Cash Flows\nNotes to Financial Statements\n-\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Shareholders and Board of Directors of\nCaro Holdings Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of Caro Holdings Inc. (the Company) as of March 31, 2022 and 2021, and the related statements of operations, change in stockholders deficit, and cash flows for the years then ended, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of March 31,2022 and 2021, and the results of its operations and its cash flows for the years then ended, in conformity with accounting principles generally accepted in the United States of America.\nGoing Concern Matter\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 2 to the financial statements, the Company has suffered recurring losses from operations and has a net capital deficiency that raises substantial doubt about its ability to continue as a going concern. Management's plans in regard to these matters are also described in Note 2. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (\"PCAOB\") and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Company's internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. We determined that there are no critical audit matters.\n/s/ MaloneBailey, LLP\nwww.malonebailey.com\nWe have served as the Company's auditor since 2016.\nHouston, Texas\nOctober 17, 2022\nCARO HOLDINGS INC.\nBALANCE SHEETS\nMarch 31,\nMarch 31,\nASSETS\nCurrent Assets\nCash\n$ -\n$ 1,429\nPrepaid expenses\n-\n2,500\nTotal Current Assets\n-\n3,929\nTOTAL ASSETS\n$ -\n$ 3,929\nLIABILITIES AND STOCKHOLDERS' DEFICIT\nCurrent Liabilities\nAccounts payable and accrued liabilities\n$ 20,203\n$ 12,833\nDue to related party\n1,800\n87,378\nTotal Current Liabilities\n22,003\n100,211\nTOTAL LIABILITIES\n22,003\n100,211\nStockholders' Deficit\nPreferred stock: 75,000,000 authorized; $0.00001 par value. No shares issued and outstanding\n-\n-\nCommon stock: 75,000,000 authorized; $0.00001 par value. 40,000,000 shares and 7,705,000 shares issued and outstanding as of March 31, 2022 and 2021, respectively\nAdditional paid in capital\n185,028\n49,973\nAccumulated deficit\n(207,431 )\n(146,332 )\nTotal Stockholders' Deficit\n(22,003 )\n(96,282 )\nTOTAL LIABILITIES AND STOCKHOLDERS' DEFICIT\n$ -\n$ 3,929\nThe accompanying notes are an integral part of these financial statements.\nCARO HOLDINGS INC.\nSTATEMENTS OF OPERATIONS\nFor the Years Ended\nMarch 31,\nOperating Expenses\nGeneral and administration\n$ 61,099\n$ 28,720\nTotal operating expenses\n61,099\n28,720\nNet loss\n$ (61,099 )\n$ (28,720 )\nNet Loss Per Common Share - Basic and Diluted\n$ (0.00 )\n$ (0.00 )\nWeighted Average Common Shares Outstanding\n12,836,808\n7,705,000\nThe accompanying notes are an integral part of these financial statements.\nCARO HOLDINGS INC.\nSTATEMENTS OF CHANGES IN STOCKHOLDERS DEFICIT\nFOR THE YEARS ENDED MARCH 31, 2022 AND MARCH 31, 2021\nAdditional\nTotal\nCommon Stock\nPaid in\nAccumulated\nStockholder's\nNumber of Shares\nAmount\nCapital\nDeficit\nDeficit\nBalance - March 31, 2020\n7,705,000\n$ 77\n$ 49,973\n$ (117,612 )\n$ (67,562 )\nNet loss\n-\n-\n-\n(28,720 )\n(28,720 )\nBalance - March 31, 2021\n7,705,000\n$ 77\n$ 49,973\n$ (146,332 )\n$ (96,282 )\nIssuance of common stock for repayment of related party loan\n32,295,000\n135,055\n-\n135,378\nNet loss\n-\n-\n-\n(61,099 )\n(61,099 )\nBalance - March 31, 2022\n40,000,000\n$ 400\n$ 185,028\n$ (207,431 )\n$ (22,003 )\nThe accompanying notes are an integral part of these financial statements.\nCARO HOLDINGS INC.\nSTATEMENTS OF CASH FLOWS\nFor the Years Ended\nMarch 31,\nCash Flows from Operating Activities:\nNet loss\n$ (61,099 )\n$ (28,720 )\nAdjustments to reconcile net loss to net cash used in operating activities:\nChanges in operating assets and liabilities:\nPrepaid expenses\n2,500\n(2,500 )\nAccounts payable and accrued liabilities\n56,670\n30,585\nNet Cash Used in Operating Activities\n(1,929 )\n(635 )\nCash Flows from Financing Activities:\nAdvancement from related party\nNet Cash Provided by Financing Activities\nNet Changes in Cash\n(1,429 )\nCash at beginning of year\n1,429\n1,414\nCash at end of year\n$ -\n$ 1,429\nSupplemental Disclosure Information:\nCash paid for interest\n$ -\n$ -\nCash paid for taxes\n$ -\n$ -\nNon-Cash Investing and Financing Activities:\nOperating expenses paid by related party\n$ 49,300\n$ 30,852\nCommon stock issued for repayment of related party loan\n$ 135,378\n$ -\nThe accompanying notes are an integral part of these financial statements.\nCARO HOLDINGS INC.\nNOTES TO THE FINANCIAL STATEMENTS\nMARCH 31, 2022\nNOTE 1 - ORGANIZATION AND DESCRIPTION OF BUSINESS\nCaro Holdings Inc. (the Company) was incorporated in the State of Nevada on March 29, 2016 and is engaged in the subscription box business with its initial focus on offering sock subscriptions to its customers.\nOn November 26, 2021, the Companys location and the location of the Companys books and records has changed from 28th Floor Cityland Pasong Tamo Tower U2807, 2210 Chino Roces Avenue (Pasong Tamo), Makati City, Philippines, to 848 Brickell Ave, Pent #5 Miami, FL 33131.\nNOTE 2 - GOING CONCERN UNCERTAINTY\nAs reflected in the accompanying financial statements, the Company has an accumulated deficit of $207,431, and a net loss of $61,099 for the year ended March 31, 2022. The Company did not generate revenues during the year ended March 31, 2022. These factors among others raise substantial doubt about our ability to continue as a going concern. The Companys ability to continue as a going concern is dependent on its ability to raise additional capital and implement its business plan. These financial statements do not include any adjustments to the recoverability and classification of recorded asset amounts and classification of liabilities that might be necessary should the Company be unable to continue as a going concern.\nManagement believes that the current actions to obtain additional funding and implement its strategic plans provide the opportunity for the Company to continue as a going concern. There are no assurances that additional funds will be available when needed from any source or, if available, will be available on terms that are acceptable to us.\nNOTE 3 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBasis of Presentation\nThe accompanying financial statements have been prepared in accordance with generally accepted accounting principles in the United States of America. The Companys year end is March 31.\nUse of Estimates\nThe preparation of financial statements in conformity with generally accepted accounting principles requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date the financial statements and the reported amount of revenues and expenses during the reporting period. Actual results could differ from those estimates.\nCash and Cash Equivalents\nThe Company considers all highly liquid investments with the original maturities of three months (90 days) or less to be cash equivalents.\nRelated Parties\nWe follow ASC 850, Related Party Disclosures, for the identification of related parties and disclosure of related party transactions (see Note 5).\nFair Value of Financial Instruments\nASC 820, Fair Value Measurements and Disclosures, defines fair value, establishes a three-level valuation hierarchy for disclosures of fair value measurement and enhances disclosure requirements for fair value measures. The three levels are defined as follows:\nLevel 1 - inputs to the valuation methodology are quoted prices (unadjusted) for identical assets or liabilities in active markets.\nLevel 2 - inputs to the valuation methodology include quoted prices for similar assets and liabilities in active markets, and inputs that are observable for the assets or liability, either directly or indirectly, for substantially the full term of the financial instruments.\nLevel 3 - inputs to the valuation methodology are unobservable and significant to the fair value.\nThe Companys financial instruments include cash and cash equivalents and accounts payable and accrued liabilities. It is managements opinion that the carrying values are a reasonable estimate of fair value because of the short period of time between the origination of such instruments and their expected realization and if applicable, their stated interest rate approximates current rates available.\nThe Companys financial instruments include cash and cash equivalents and accounts payable and accrued liabilities. It is managements opinion that the carrying values are a reasonable estimate of fair value because of the short period of time between the origination of such instruments and their expected realization and if applicable, their stated interest rate approximates current rates available.\nManagement believes it is not practical to determine the fair value of accounts payable and accrued liabilities, and note payable to related parties and lease and management arrangement with related parties, if any, because the transactions cannot be assumed to have been consummated at arms length, the terms are not deemed to be market terms, there are no quoted values available for these instruments, and an independent valuation would not be practical due to the lack of data regarding similar instruments, if any, and the associated potential costs.\nTransactions involving related parties cannot be presumed to be carried out on an arms-length basis, as the requisite conditions of competitive, free-market dealings may not exist. Representations about transactions with related parties, if made, shall not imply that the related party transactions were consummated on terms equivalent to those that prevail in arms-length transactions unless such representations can be substantiated.\nNet Income (Loss) per Share\nBasic net income (loss) per share is computed by dividing net income (loss) available to common shareholders by the weighted-average number of common shares outstanding during the period. Diluted net income per share is computed similar to basic net income (loss) per share except that the denominator is increased to include the number of additional common shares that would have been outstanding if the potential common shares had been issued and if the additional common shares were dilutive. If applicable, diluted net income per share assumes the conversion, exercise or issuance of all common stock instruments, such as convertible notes, unless the effect is to reduce a loss or increase earnings per share. As of March 31, 2022, there were no dilutive potential common shares.\nIncome Taxes\nThe Company accounts for income taxes pursuant to FASB ASC 740 Income Taxes. Pursuant to ASC 740, deferred income taxes are provided on a liability method whereby deferred tax assets are recognized for deductible temporary differences, and operating loss carry forwards and deferred tax liabilities are recognized for taxable temporary differences. Temporary differences are the differences between the reported amounts of assets and liabilities and their tax bases. Deferred tax assets are reduced by a valuation allowance when, in the opinion of management, it is more likely than not that some portion or all of the deferred tax assets will not be realized. The provision for income taxes represents the tax expense for the period, if any, and the change during the period in deferred tax assets and liabilities. Deferred tax assets and liabilities are adjusted for the effects of changes in tax laws and rates on the date of enactment.\nASC 740 also provides criteria for the recognition, measurement, presentation and disclosure of uncertain tax positions. Under ASC 740, the impact of an uncertain tax position on the income tax return may only be recognized at the largest amount that is more-likely-than-not to be sustained upon audit by the relevant taxing authority. At March 31, 2022 and 2021, there were no unrecognized tax benefits (see Note 4).\nRecently Accounting Pronouncements\nManagement has considered all recent accounting pronouncements issued. The Companys management believes that these recent pronouncements will not have a material effect on the Companys financial statements.\nNOTE 4 - INCOME TAXES\nThe Company provides for income taxes under ASC 740, Income Taxes. Under the asset and liability method of ASC 740, deferred tax assets and liabilities are recorded based on the differences between the financial statement and tax basis of assets and liabilities and the tax rates in effect when these differences are expected to reverse. A valuation allowance is provided for certain deferred tax assets if it is more likely than not that the Company will not realize tax assets through future operations.\nThe components of the Companys deferred tax asset and reconciliation of income taxes computed at the statutory rate to the income tax amount recorded as of March 31, 2022 and 2021, are as follows:\nMarch 31,\nMarch 31,\nNet operating loss carryforward\n$ (207,431 )\n$ (146,332 )\nTax Rate\n21 %\n21 %\nDeferred tax asset\n(43,561 )\n(30,730 )\nLess: Valuation allowance\n43,561\n30,730\nDeferred tax asset\n$ -\n$ -\nAs of March 31, 2022, the Company had approximately $207,000 in net operating losses (NOLs) that may be available to offset future taxable income, which begin to expire between 2036 and 2038. NOLs generated in tax years prior to March 31, 2018, can be carry forward for twenty years, whereas NOLs generated after March 31, 2018 can be carry forward indefinitely. In accordance with Section 382 of the U.S. Internal Revenue Code, the usage of the Companys net operating loss carry forwards is subject to annual limitations following greater than 50% ownership changes. Tax returns for the years ended 2016 through 2022 are subject to review by the tax authorities.\nNOTE 5 - RELATED PARTY TRANSACTIONS\nDuring the years ended March 31, 2022 and 2021, the then sole director and Chief Executive Officer (CEO) as of March 31, 2022 of the Company paid $49,300 and $30,852 on behalf of the Company for business operation purpose, respectively.\nDuring the years ended March 31, 2022 and 2021, the then sole director and CEO of the Company made advancement of $500 and $650 to the Company, respectively.\nOn February 2, 2022, the Company issued 32,295,000 shares of common stock for the repayment of related party loan of $135,378.\nAs of March 31, 2022 and March 31, 2021, there was $1,800 and $87,378 due to this related party, respectively.\nNOTE 6 - EQUITY\nAuthorized Stock\nThe Companys authorized common stock consists of 75,000,000 shares at $0.00001 par value.\nCommon Stock\nOn February 2, 2022, the Company issued 32,295,000 shares of common stock for the repayment of related party loan of $135,378. (see Note 5)\nAs of March 31, 2022 and March 31, 2021, the issued and outstanding common stock was 40,000,000 shares and 7,705,000 shares, respectively.\nNOTE 7 - RISKS AND UNCERTAINTIES\nIn early 2020, the World Health Organization declared the rapidly spreading coronavirus disease (COVID-19) outbreak a pandemic. This pandemic has resulted in governments worldwide enacting emergency measures to combat the spread of the virus. The Company considered the impact of COVID-19 on the assumptions and estimates used and determined that there were no material adverse impacts on the Companys results of operations and financial position at March 31, 2022. The full extent of the future impacts of COVID-19 on the Companys operations is uncertain. A prolonged outbreak could have a material adverse impact on financial results and business operations of the Company in the future. The Company is not aware of any specific event or circumstance that would require an update to its estimates or judgments or a revision of the carrying value of its assets or liabilities as of the date of issuance of this financial statements. These estimates may change, as new events occur and additional information is obtained.\nNOTE 8 - SUBSEQUENT EVENTS\nIn accordance with ASC 855-10, the Company has analyzed its operations subsequent to the March 31, 2022 to the date these financial statements were issued and has determined that it has the following material subsequent events:\nChange In Control of Registrant\nEffective April 28, 2022, Rozh Caroro, the previous sole director, CEO and majority shareholder of the Company, entered into a stock purchase agreement for the sale of 36,795,000 shares of Common Stock of the Company to Christopher McEachnie.\nAs a result of the stock transfer, Mr. McEachnie holds approximately 92% of the issued and outstanding shares of Common Stock of the Company, and as such he is able to unilaterally control the election of our board of directors, all matters upon which shareholder approval is required and, ultimately, the direction of our Company.\nAlso effective April 25, 2022, the previous sole officer and director of the company, Rozh Caroro, resigned her positions with the Company. Upon her resignation, Mr. McEachnie was appointed as Chief Executive Officer, Treasurer and Secretary, and sole Director of the Company.\nAppointment of Principal Officer\nOn May 26, 2022, Warren Walsh was appointed as Chief Operating Officer, as well as Chief Technology Officer of the Company.\nOn September 7, 2022, Warren Walsh was terminated as the Companys Chief Operating Officer, Chief Technology Officer and all other positions and Meriesha Rennalls was appointed to act as the Companys President, Chief Operating Officer and Secretary. Also on October 10, 2022, Meriesha Rennalls was elected to the Board of Directors. Item 9. Changes In and Disagreements With Accountants on Accounting and Financial Disclosure.\nNot applicable. Item 9A. Controls and Procedures.\nEvaluation of Disclosure Controls and Procedures\nDisclosure controls and procedures are designed with an objective of ensuring that information required to be disclosed in our periodic reports filed with the Securities and Exchange Commission, such as this Annual Report on Form 10-K, is recorded, processed, summarized and reported within the time periods specified by the Securities and Exchange Commission. Disclosure controls are also designed with an objective of ensuring that such information is accumulated and communicated to our management, including our chief executive officer, in order to allow timely consideration regarding required disclosures.\nThe evaluation of our disclosure controls by our principal executive officer included a review of the controls objectives and design, the operation of the controls, and the effect of the controls on the information presented in this Annual Report. Our management, including our chief executive officer, does not expect that disclosure controls can or will prevent or detect all errors and all fraud, if any. A control system, no matter how well designed and operated, can provide only reasonable, not absolute, assurance that the objectives of the control system are met. Also, projections of any evaluation of the disclosure controls and procedures to future periods are subject to the risk that the disclosure controls and procedures may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nAs of the end of the period covered by this report, we carried out an evaluation, under the supervision and with the participation of our management, including our Chief Executive Officer and Principal Financial Officer, of the effectiveness of our disclosure controls and procedures, as defined in Rules 13a-15(e) and 15d-15(e) of the Securities Exchange Act of 1934 as of the end of the period covered by this report. Based on that evaluation, our Principal Executive Officer and Principal Financial Officer have concluded that our disclosure controls and procedures as of March 31, 2022 and 2021 were ineffective to ensure that information required to be disclosed by us in reports that we file or submit under the Securities Exchange Act of 1934 is recorded, processed, summarized and reported within the time periods specified in the Securities and Exchange Commissions rules and forms. There have been no material changes in our internal controls over financial reporting or in other factors that could materially affect, or are reasonably likely to affect, our internal controls over financial reporting during the years ended March 31, 2022 and 2021.\nManagements Annual Report on Internal Control Over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting for the company in accordance with as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act. Our internal control over financial reporting is designed to provide reasonable assurance regarding the (i) effectiveness and efficiency of operations, (ii) reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles, and (iii) compliance with applicable laws and regulations. Our internal controls framework is based on the criteria set forth in the Internal Control - Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nManagements assessment of the effectiveness of the small business issuers internal control over financial reporting is as of the year ended March 31, 2022. We believe that internal control over financial reporting is not effective. We have identified current material weaknesses considering the nature and extent of our current operations and any risks or errors in financial reporting under current operations. The Company has inadequate segregation of duties and ineffective risk assessment, and insufficient written policies and procedures for accounting and financial reporting with respect to the requirements and application of both US GAAP and SEC guidelines. This is caused by a very limited number of personnel.\nThis annual report does not include an attestation report of the companys registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by the Companys registered public accounting firm pursuant to temporary rules of the SEC that permit the Company to provide only managements report in this annual report.\nChanges in Internal Control Financial Reporting\nThere was no change in our internal control over financial reporting that occurred during the fiscal year ended March 31, 2022, that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting. Item 9B. Other Information.\nNot applicable.\nPART III Item 10. Directors, Executive Officers, Promoters and Control Persons of the Company\nDirectors and Executive Officers\nThe following table sets forth the names, ages, and positions with us for each of our directors and officers as of October 13, 2022:\nName\nAge\nPosition\nSince\nChristopher McEachnie\nDirector, President, Chief Executive Officer, and Treasurer\nApril 2022\nChristopher McEachnie\nDirector, Chief Executive Officer\nSeptember 2022\nMeriesha Rennalls\nChief Operating Officer, and Secretary\nSeptember 2022\nMeriesha Rennalls\nDirector\nOctober 2022\nChristopher McEachnie - Mr. McEachnie grew up in West Vancouver with his older brothers. At the age of 19 he moved to Whistler BC and started a successful ski tuning company called Midnights Edge while working summers at Whistler Woodcraft Ltd. He ventured in real estate investment eventually purchasing several homes in Whistler Squamish and North Vancouver. Still based out of western Canada, Mr. McEachnie now runs a successful roofing company that installs commercial and residential roofs across the region. He also runs social media platform Umiie World Inc. which is a project he began working on several years ago.\nMeriesha Rennalls - For the past 2 years, Ms. Rennalls has been acting as a COO for a telecom company, handling operations, client care and providing engineering support. She is an experienced product and project manager, familiar with the full suite of product in Unified Communications. She is an experienced operational telecom executive with broad based perspective gained from more than 15 years in the field, working with suppliers such KCOM, KCOM, Verizon, Voxbone and BT/Openreach.\nAudit Committee\nThe Company does not presently have an Audit Committee and the entire Board acts in such capacity for the immediate future due to the limited size of the Board. The Company intends to increase the size of its Board in the future, at which time it may appoint an Audit Committee.\nIn lieu of an Audit Committee the Board is empowered to make such examinations as are necessary to monitor the corporate financial reporting and the external audits of the Company, to provide to the Board of Directors (the Board) the results of its examinations and recommendations derived there from, to outline to the Board improvements made, or to be made, in internal control, to nominate independent auditors, and to provide to the Board such additional information and materials as it may deem necessary to make the Board aware of significant financial matters that require Board attention.\nCompensation Committee\nThe Company does not presently have a Nominating Committee and the Board acts in such capacity for the immediate future due to the limited size of the Board. The Company intends to increase the size of its Board in the future, at which time it may appoint a Compensation Committee.\nThe Compensation Committee will be authorized to review and make recommendations to the Board regarding all forms of compensation to be provided to the executive officers and directors of the Company, including stock compensation, and bonus compensation to all employees.\nNominating Committee\nThe Company does not have a Nominating Committee and the Board acts in such capacity.\nCode of Conduct and Ethics\nOur board of directors has adopted a code of business conduct and ethics applicable to our directors, officers and employees, in accordance with applicable federal securities laws and the FINRA Rules.\nIndemnification of Executive Officers and Directors\nOur articles provide to the fullest extent permitted by Nevada law, that our directors or officers shall not be personally liable to the Company or our stockholders for damages for breach of such directors or officers fiduciary duty. The effect of this provision of our articles is to eliminate our rights and the rights of our stockholders (through stockholders derivative suits on behalf of the Company) to recover damages against a director or officer for breach of the fiduciary duty of care as a director or officer (including breaches resulting from negligent or grossly negligent behavior), except under certain situations defined by statute. We believe that the indemnification provisions in our articles are necessary to attract and retain qualified persons as directors and officers.\nNevada corporate law provides that a corporation may indemnify a director, officer, employee or agent made a party to an action by reason of that fact that he was a director, officer employee or agent of the corporation or was serving at the request of the corporation against expenses actually and reasonably incurred by him in connection with such action if he acted in good faith and in a manner he reasonably believed to be in, or not opposed to, the best interests of the corporation and with respect to any criminal action, had no reasonable cause to believe his conduct was unlawful. Item 11. Executive Compensation\nDuring the years ended March 31, 2022 and 2021, Ms. Rozh Caroro was our sole director and officer.\nExecutive compensation during the years ended March 31, 2022 was as follows:\nName And Principal Position\nYear\nSalary\nBonus\nStock\nAwards\nOptions\nAwards\n($)\nNonqualified Deferred Compensation ($)\nAll Other\nComp\nTotal\nRozh Caroro (1),\nDirector, President,\nChief Executive Officer,\nChief Financial Officer\n(1)\nOn April 25, 2022, Rozh Caroro resigned her position as sole officer and director of the Company. Upon her resignation, Christopher McEachnie was appointed as Chief Executive Officer, Treasurer and Secretary, and sole Director of the Company.\nEmployment Agreement\nWe do not have any employment agreements with our officers.\nStock Option Plan\nWe do not have a stock option plan and we have not issued any warrants, options or other rights to acquire our securities.\nEmployee Pension, Profit Sharing or other Retirement Plans\nWe do not have a defined benefit, pension plan, profit sharing or other retirement plan, although we may adopt one or more of such plans in the future.\nDirectors Compensation\nAt present we do not pay our directors for attending meetings of our Board of Directors, although we expect to adopt a director compensation policy by the end of the current year. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nThe following table sets forth as of October 13, 2022 the number and percentage of the outstanding shares of common stock, which, according to the information available to us, were beneficially owned by:\n(i)\neach person who is currently a director,\n(ii)\neach executive officer,\n(iii)\nall current directors and executive officers as a group, and\n(iv)\neach person who is known by us to own beneficially more than 5% of our outstanding common stock.\nExcept as otherwise indicated, the persons named in the table have sole voting and dispositive power with respect to all shares beneficially owned, subject to community property laws where applicable.\nName and Address of Beneficial Owner\nNumber of Common Shares\nPercent of Class\nChristopher McEachnie\n36,865,000\n92.163 %\nc/o848 Brickell Ave. Penthouse #5 Miami, FL 331331 Item 13. Certain Relationships and Related Transactions\nEmployee Benefit Plans\nWe have no employee benefit plans or stock option plans. Item 14. Principal Accountant Fees and Services.\nThe aggregate fees billed for the most recently completed fiscal year ended March 31, 2022 and for fiscal year ended March 31, 2021 for professional services rendered by the principal accountant for the audit of our annual financial statements and review of the financial statements included in our quarterly reports on Form 10-Q and services that are normally provided by the accountant in connection with statutory and regulatory filings or engagements for these fiscal periods were as follows:\nYear Ended\nMarch 31,\nMarch 31,\nAudit Fees\n$ 29,000\n$ 15,500\nAudit Related Fees\n-\n-\nTax Fees\n-\n-\nAll Other Fees\n-\n-\nTotal\n$ 29,000\n$ 15,500\nPre-Approval Policy\nOur Board as a whole pre-approved all services provided by accountants, for any non-audit or non-audit related services and the Board must conclude that such services are compatible with their independence as our auditors.\nPART IV Item 15. Exhibits.\nEXHIBITS:\nExhibit Number\nDescription of Exhibits\n10.0\nDebt Settlement\n10.1\nDebt Conversion\n17.1\nGeneral Release and Certificate\n31.1\nCertification by the Principal Executive Officer\n32.1\nCertification by the Principal Executive Officer\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this amended report to be signed on its behalf by the undersigned, thereunto duly authorized on the 14th day of October 2022.\nCARO HOLDINGS INC.\nBy:\n/s/ Christopher McEachnie\nChristopher McEachnie, President\n(Principal Executive Officer)\nIn accordance with the requirements of the Securities and Exchange Act of 1934, this amended report has been signed by the following persons on behalf of the Registrant and in the capacities indicated and on the dates stated.\n/s/ Christopher McEachnie\nDated: October 17, 2022\nChristopher McEachnie\nPresident (Principal Executive Officer) and Director"
}