{
    "cik": "1680237",
    "company": "China King Spirit Group Ltd.",
    "filing_type": "10-K",
    "filing_date": "2022-11-15",
    "period_of_report": "2022-06-30",
    "sic": "2400",
    "state_of_inc": "CO",
    "state_location": "CA",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1680237/0001477932-22-008624-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1680237/000147793222008624/cksg_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1680237/0001477932-22-008624.txt",
    "filename": "1680237_10K_2022_0001477932-22-008624.htm",
    "content": "ITEM 1. BUSINESS\nBusiness Overview\nThe Company was incorporated in the state of Nevada on October 7, 2014. From inceptions (October 7, 2014) until September 8, 2017, China King Spirit Group Ltd. (FNA Jasmin Corp.), was in the business of the production and distribution of cork products.\nOn September 8, 2017, Jean-Paul Chavanz, the previous sole officer and director and majority shareholder of China King Spirit Group Ltd., entered into a stock purchase agreement for the sale of an aggregate of 10,000,000 shares of Common Stock of the Company, representing 79% of the issued and outstanding shares of common stock of the Company. Pursuant to this agreement, the Company decided to discontinue its business plan of producing and distributing Cork products and explore new opportunities. As part of the transition all the Companys assets were retained by the former majority shareholder and the liabilities were assumed by Mr. Chavanz as well. As a result of this strategic shift all historical results of the Company should be classified as discontinued operations in accordance with ASC 105-20.\nOn September 11, 2017 Xu Dam was appointed its Chief Executive Officer, Chief Financial Officer and sole Director and Mr. Richard Rappaport was appointed Secretary. In addition, Mr. Jean-Paul Chavanaz submitted his resignations from all executive officer positions with the Company, including Chief Executive Officer and President effective September 11, 2017, and submitted his resignation as a member of the Board.\nOn September 27, 2018, Xu Dan submitted her resignation from all executive officer positions with the Company, including Chief Executive Officer, Chief Financial Officer, and President, effective immediately. In addition, Xu Dan submitted her resignation as a member of the Board, which resignation was effective immediately. In addition, on September 27, 2018 Richard Rappaport submitted his resignation as Secretary of the Company, which resignation was effective immediately. On September _27, 2018, Zanfang Wang was appointed as Chief Executive Officer, Secretary, Chief Financial Officer, and sole Director and Chairman, each effective immediately.\nOn September 27, 2018 the Board of Directors and shareholders of China King Spirit Group Ltd. (the Company) approved an amendment to the Registrants Articles of Incorporation increasing the number of authorized shares of Common Stock from 75,000,000 to 200,000,000 and effecting a five-for-one forward split of the Companys outstanding shares of common stock.\nIn addition, on September 27, 2018 the Board of directors and the majority of its shareholders of China King Spirit Group Ltd., approved an amendment of the Companys current Certificate of Incorporation in conformity with the applicable laws of the State of Nevada to change the name of the Company from Jasmin Corp. to China King Spirit Group Ltd. and change the symbol from JSMM to CKSG. The Company is waiting for approval of the name change and symbol change from FINRA at which time it will file the amendment with the Nevada Secretary of State.\nThe information presented below with regard to the year ended June 30, 2022 should be read as historic information on the Company. As a result of the decision to discontinue operations, the Company as of the date of this filing is an empty shell with no liquidity, limited capital resources, and no operations other than the search for new business opportunities.\nCorporate History\nThe Company was incorporated by its former President and sole director in the State of Nevada on October 7, 2014 and established a June 30 fiscal year end.\nRecent Developments\nCapital Stock\nSubsequent to the year ending June 30, 2021 the Board of Directors and shareholders of China King Spirit Group Ltd. (the Company) on September 27, 2018 approved an amendment to the Companys Articles of Incorporation increasing the number of authorized shares of Common Stock from 75,000,000 to 200,000,000 and effecting a five-for-one forward split of the Companys outstanding shares of common stock.\nThe Company has 200,000,000 common shares authorized with a par value of $0.001 per share. No preferred shares have been authorized or issued.\nThere were 12,644,500 (pre-split 2,528,900) shares of common stock issued and outstanding as of June 30, 2022 and June 30, 2021 respectively.\nAll references in these financial statements to number of common shares, price per share and weighted average number of shares outstanding prior to the 5:1 forward split have been adjusted to reflect the stock split on a retroactive basis unless otherwise noted.\nPatent and Trademarks\nWe do not currently own any domestic or foreign patents relating to any products.\nEmployees\nAs of June 30, 2022, other than its President, Secretary, CFO and Treasurer, Zanfang Wang of, the Company has no other employee. ITEM 1A. RISK FACTORS\nAs a smaller reporting company, as defined in Rule 12b-2 of the Exchange Act, we are not required to provide the information called for by this Item. ITEM 1B. UNRESOLVED STAFF COMMENTS\nNot applicable to a smaller reporting company as defined in Item 10(f)(1) of Regulation S-K. ITEM 2. PROPERTIES\nThe Company does not own any real estate or other properties and has not entered into any long- term lease or rental agreements for property. ITEM 3. LEGAL PROCEEDINGS\nThere are no pending legal proceedings to which the Company is a party or in which any director, officer or affiliate of the Company, any owner of record or beneficially of more than 5% of any class of voting securities of the Company, or stockholder is a party adverse to the Company or has a material interest adverse to the Company. Our address for service of process in Nevada is; State Agent and Transfer Syndicate Inc., 112 North Curry Street, Curry Street, Carson City, Nevada 89703, Telephone; (1-800-253-1013.) ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\nPART II ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nMarket Information\nAs of June 30, 2022, the Company had 9 shareholders of record. There is no established public trading market for the Companys common stock whose common stock is quoted under the symbol is CKSG. The Company has not paid cash dividends and has no outstanding options.\nOn September 27, 2018 the Board of directors and the majority of its shareholders of China King Spirit Group Ltd.., approved an amendment of the Companys current Certificate of Incorporation in conformity with the applicable laws of the State of Nevada to change the name of the Company from Jasmin Corp. to China King Spirit Group Ltd. and change the symbol from JSMM to CKSG. ITEM 6. SELECTED FINANCIAL DATA\nNot applicable to a smaller reporting company as defined in Rule 12b-2 of the Exchange Act. ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThis Managements Discussion and Analysis of Financial Condition and Results of Operations is intended to provide a reader of our financial statements with a narrative from the perspective of our management on our financial condition, results of operations, liquidity, and certain other factors that may affect our future results. The following discussion and analysis should be read in conjunction with our audited consolidated financial statements and the accompanying notes thereto included in Item 8. Financial Statements and Supplementary Data. In addition to historical financial information, the following discussion and analysis contains forward-looking statements that involve risks, uncertainties and assumptions. See Forward-Looking Statements. Our results and the timing of selected events may differ materially from those anticipated in these forward-looking statements as a result of many factors.\nPlan of Operations\nAs a result of the Companys decision to discontinue operations in the producing and distribution of cork products, the Company as of the date of this filing is an empty shell with no liquidity, no capital resources, and no operations other than the search for new business opportunities.\nGoing Concern\nConditions exist that raise substantial doubt about our ability to continue as a going concern due to our recurring losses from operations, deficit in equity, and the need to raise additional capital to fund operations. The going concern opinion by our auditor could impair our ability to finance our operations through the sale of debt or equity securities.\nResults of Operations\nFiscal Year Ended June 30, 2022 compared to Year Ended June 30, 2021\nWe had no revenues and $43,463 in expenses consisting of $36,000 in professional fees; $3,069 in transfer agent fees; and $4,394 in filing fees for the year ended June 30, 2022. In the year ended June 30, 2021, we had no revenues, expenses of $75 in transfer agent fees. The increase in expenses for the period ending June 30, 2022 compared to the period ending June 30, 2021 is due to the Company updating its filing with the SEC.\nCapital Resources and Liquidity\nSince our director and shareholders may be unwilling or unable to loan or advance us additional capital, we believe that if we do not raise additional capital over the next 12 months, we may be required to suspend or cease operations (the Company is a shell with no current business plan).\nAs of June 30, 2022, we had no currents assets and we had $97,774 in current liabilities; we had an accumulated deficit of $110,060. As of June 30, 2021, we had no current assets and we had $54,311 in current liabilities; we had a accumulated deficit of $66,597.\nThe Company requires additional funding to meet its ongoing obligations and to fund anticipated operating losses. Our auditor has expressed substantial doubt about our ability to continue as a going concern. The ability of the Company to continue as a going concern is dependent on raising capital to fund its operation and ultimately to find new profitable operations. These financial statements do not include any adjustments relating to the recoverability and classification of recorded asset amounts or amounts and classification of liabilities that might result from this uncertainty.\nIf we cannot raise additional funds, we will have to cease business operations. As a result, investors in the Companys common stock would lose all their investment.\nOff Balance Sheet Arrangements\nThe company has no off-balance sheet arrangements that have or are reasonably likely to have a current or future effect or change on the companys financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources that are material to investors. The term off-balance sheet arrangement generally means any transaction, agreement or other contractual arrangement to which an entity unconsolidated with the company is a party, under which the company has (i) any obligation arising under a guarantee contract, derivative instrument or variable interest; or (ii) a retained or contingent interest in assets transferred to such entity or similar arrangement that serves as credit, liquidity or market risk support for such assets.\nRecent Accounting Pronouncements\nThe Company has implemented all new accounting pronouncements that are in effect and that may impact its financial statements and does not believe that there are any other new accounting pronouncements that have been issued that might have a material impact on its financial position or results of operations. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nNot applicable to a smaller reporting company as defined in Rule 12b-2 of the Exchange Act. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nThe full text of the Companys audited consolidated financial statements for the fiscal year ended June 30, 2022 and June 30, 2021, begins on page of this Annual Report on Form 10-K.\nChina King Spirit Group Ltd.\nFINANCIAL STATEMENTS\nCONTENTS\nReport of Independent Registered Accounting Firm - Michael Gillespie & Associates, PLLC\nBalance Sheets - As of June 30, 2022 and 2021\nStatements of Operations - Years ended June 30, 2022 and 2021\nStatements Changes in Stockholders Deficit\nStatements of Cash Flows - For the Years ended June 30, 2022 and 2021\nNotes to Financial Statements\n-\nMICHAEL GILLESPIE & ASSOCIATES, PLLC\nv\nCERTIFIED PUBLIC ACCOUNTANTS\nVANCOUVER, WA 98666\n206.353.5736\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Shareholders & Board of Directors\nChina King Spirit Group Ltd.\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of China King Spirit Group Ltd. as of June 30, 2022 and 2021, and the related statements of operations, changes in stockholders deficit, cash flows, and the related notes (collectively referred to as financial statements) for the years then ended. In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of June 30, 2022 and 2021, and the results of its operations and its cash flows for the years then ended in conformity with accounting principles generally accepted in the United States of America.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nGoing Concern\nAs described further in Note 2 to the financial statements, the Company has incurred losses from inception through June 30, 2022, and expects to incur additional losses in the future.\nWe determined the Companys ability to continue as a going concern is a critical audit matter due to the estimation and uncertainty regarding the Companys future cash flows and the risk of bias in managements judgments and assumptions in estimating these cash flows.\nOur audit procedures related to the Companys assertion on its ability to continue as a going concern included the following, among others:\nWe reviewed the Companys working capital and liquidity ratios and forecasted revenue, operating expenses, and uses and sources of cash used in managements assessment of whether the Company has sufficient liquidity to fund operations for at least one year from the financial statement issuance date. This testing included inquiries with management, comparison of prior period forecasts to actual results, consideration of positive and negative evidence impacting managements forecasts, the Companys financing arrangements in place as of the report date, market and industry factors and consideration of the Companys relationships with its financing partners.\nGoing Concern\nThe accompanying financial statements have been prepared assuming the Company will continue as a going concern. As discussed in Note 2 to the financial statements, although the Company has limited operations it has yet to attain profitability. This raises substantial doubt about its ability to continue as a going concern. Managements plan in regard to these matters is also described in Note 2. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audit, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audit provides a reasonable basis for our opinion.\n/S/ MICHAEL GILLESPIE & ASSOCIATES, PLLC\nWe have served as the Companys auditor since 2022.\nPCAOB ID: 6108\nVancouver, Washington\nNovember 10, 2022\nCHINA KING SPIRIT GROUP LTD.\nBALANCE SHEETS\nJune 30,\nJune 30,\nASSETS\nASSETS\nCurrent Assets\nCash\n$ -\n$ -\nTOTAL CURRENT ASSETS\n-\n-\nTOTAL ASSETS\n$ -\n$ -\nLIABILITIES AND STOCKHOLDERS DEFICIT\nCURRENT LIABILITIES\nAccounts payable\n$ 5,597\n$ 5,482\nRelated parties - loans\n92,177\n48,829\nTOTAL CURRENT LIABILITIES\n97,774\n54,311\nCommitments and Contingencies\nSTOCKHOLDERS DEFICIT\nCommon stock, $0.001 par value, 200,000,000 shares authorized; 12,644,500\nissued and outstanding, June 30, 2022 and June 30, 2021 respectively\n12,645\n12,645\nAdditional paid-in capital\n(359 )\n(359 )\nAccumulated deficit\n(110,060 )\n(66,597 )\nTOTAL STOCKHOLDERS DEFICIT\n(97,774 )\n(54,311 )\nTOTAL LIABILITIES AND STOCKHOLDERS DEFICIT\n$ -\n$ -\nThe accompanying notes are an integral part of these financial statements.\nCHINA KING SPIRIT GROUP LTD.\nSTATEMENTS OF OPERATIONS\nYear\nended\nJune 30,\nYear ended\nJune 30,\nRevenues\n$ -\n$ -\nCost of Goods Sold\n-\n-\nGross Profit\n-\n-\nGeneral and Administrative Expenses\n43,463\nLoss before income taxes\n(43,463 )\n(75 )\nIncome tax expenses\n-\n-\nLoss from Operations\n(43,463 )\n(75 )\nNET INCOME (LOSS)\n$ (43,463 )\n$ (75 )\nLOSS PER COMMON SHARE - BASIC AND DILUTED\n$ (0.00 )\n$ (0.00 )\nWEIGHTED AVERAGE NUMBER OF COMMON SHARES OUTSTANDING - BASIC AND DILUTED\n12,644,500\n12,644,500\nThe accompanying notes are an integral part of these financial statements.\nCHINA KING SPIRIT GROUP LTD.\nSTATEMENTS OF CHANGES IN STOCKHOLDERS DEFICIT\nYears Ended June 30, 2022 and 2021\nCommon Stock\nAdditional\nNumber of shares\nAmount\nPaid-in\nCapital\nAccumulated\nDeficit\nTotal\nBalance, June 30, 2020\n12,644,500\n$ 12,645\n$ (359 )\n$ (66,522 )\n(54,236 )\nNet loss for the year ended June 30, 2021\n-\n-\n(75 )\n(75 )\nBalance, June 30, 2021\n12,645,500\n$ 12,645\n$ (359 )\n$ (66,597 )\n$ (54,311 )\nNet loss for the year ended June 30, 2022\n-\n-\n-\n(43,463 )\n(43,463 )\nBalance, June 30, 2022\n12,645,500\n$ 12,645\n$ (359 )\n$ (110,060 )\n$ (97,774 )\nThe accompanying notes are an integral part of these financial statements.\nCHINA KING SPIRIT GROUP LTD.\nSTATEMENTS OF CASH FLOWS\nYear ended\nJune 30,\nYear ended\nJune 30,\nCASH FLOWS FROM OPERATING ACTIVITIES\nNet loss\n$ (43,463 )\n$ (75 )\nAdjustments to reconcile net loss to net cash used in operating activities\nChanges in operating assets and liabilities\nAccounts payable\nNET CASH USED IN OPERATING ACTIVITIES\n(43,348 )\n-\nCASH FLOWS FROM FINANCING ACTIVITIES\nProceeds from related parties\n43,348\n-\nNET CASH PROVIDED BY FINANCING ACTIVITIES\n43,348\n-\nNET DECREASE IN CASH\n-\n-\nCASH, BEGINNING OF PERIOD\n-\n-\nCASH, END OF PERIOD\n$ -\n$ -\nSUPPLEMENTAL CASH FLOW INFORMATION\nIncome tax paid\n$ -\n$ -\nInterest paid\n$ -\n$ -\nThe accompanying notes are an integral part of these financial statements.\nCHINA KING SPIRIT GROUP LTD.\nNOTES TO THE FINANCIAL STATEMENTS\nNOTE 1 - NATURE OF OPERATIONS AND SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nThe Company\nChina King Spirit Group Ltd. (FKA Jasmin Corp.) (the Company, we, us or our) was incorporated in the State of Nevada on October 7, 2014. Jasmin was an e-commerce early stage company that intended to establish itself as a designing industry of home and space decorations made from cork materials in France, Europe. The new management of the Company is abandoning its existing business and is in the process of evaluating other business opportunities.\nOn September 27, 2018, Xu Dan submitted her resignation from all executive officer positions with the Registrant, including Chief Executive Officer, Chief Financial Officer, and President, effective immediately. In addition, Xu Dan submitted her resignation as a member of the Board, which resignation was effective immediately. In addition, on September 27, 2018 Richard Rappaport submitted his resignation as Secretary of the Registrant, which resignation was effective immediately. On September _27, 2018, Zhanfang Wang was appointed as Chief Executive Officer, Secretary, Chief Financial Officer, and sole Director and Chairman, each effective immediately.\nOn September 27, 2018 Jasmin Corp. (the Registrant) filed a Certificate of Amendment to Articles of Incorporation effecting (i) a 5-for-1 forward stock split of the Registrants common stock, (ii) an increase in the number of authorized shares of Common Stock from 75,000,000 to 200,000,000 and (iii) changing its name from Jasmin Corp. to China King Spirit Group Ltd., which Certificate of Amendment was approved by the Nevada Secretary of State on December 20, 2018. The Registrant notified the Financial Industry Regulatory Authority (FINRA) pursuant to a corporate action request to approve the change of its listing name to China King Spirit Group Ltd. On December 20, 2018, FINRA notified the Registrant that it had approved the aforementioned forward stock split, increase in authorized number of shares and name change, announced on their daily list on December 21, 2018 that the market effective date was December 24, 2018.\nSubsequent Events\nManagement has evaluated all events or transactions that occurred after June 30, 2022 through November 10, 2022 the report date of the financial statements. During the period, the Company did not have any material recognizable subsequent events.\nBasis of Presentation\nThe accompanying financial statements have been prepared in accordance with generally accepting accounting principals in the United States of America. The Companys yearend is June 30.\nUse of Estimates and Assumptions\nPreparation of the financial statements in conformity with generally accepted accounting principles requires management to make estimates and assumptions that affect certain reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the period. Accordingly, actual results could differ from those estimates.\nCash and Cash Equivalents\nFor purposes of the statement of cash flows, the Company considers highly liquid financial instruments purchased with a maturity of three months or less to be cash equivalents.\nCHINA KING SPIRIT GROUP LTD.\nNOTES TO THE FINANCIAL STATEMENTS\nNOTE 1 - NATURE OF OPERATIONS AND SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nEarnings (Loss) per Common Share\nThe basic earnings (loss) per common share is calculated by dividing the Companys net income (loss) available to common shareholders by the weighted average number of common shares during the period. The diluted earnings (loss) per share is calculated by dividing the Companys net income (loss) available to common shareholders by the diluted weighted average number of shares outstanding during the year. The diluted weighted average number of shares outstanding is the basic weighted number of shares adjusted for any potentially dilutive debt or equity securities unless they are anti-dilutive. Diluted earnings (loss) per share are the same as basic earnings (loss) per share due to the lack of dilutive items in the Company. As of June 30, 2022, and 2021, there were no common stock equivalents outstanding.\nIncome Taxes\nThe Company follows the liability method of accounting for income taxes. Under this method, deferred tax assets and liabilities are recognized for the future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax balances and tax loss carry-forwards. Deferred tax assets and liabilities are measured using enacted or substantially enacted tax rates expected to apply to the taxable income in the years in which those differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the date of enactment or substantive enactment.\nRecent Accounting Pronouncements\nThe Company does not expect the adoption of any recent accounting pronouncements to have a material impact on its financial statements.\nNOTE 2 - GOING CONCERN\nTo date the Company has generated limited revenues from its business operations and has an accumulated deficit of $110,060 since inception. As at June 30, 2022, the Company has a working capital deficit of $97,774. The Company requires additional funding to meet its ongoing obligations and to fund anticipated operating losses. The ability of the Company to continue as a going concern is dependent on raising capital to fund its initial business plan and ultimately to attain profitable operations. Accordingly, these factors raise substantial doubt as to the Companys ability to continue as a going concern. The Company intends to continue to fund its business by way of private placements and advances from related parties as may be required. These financial statements do not include any adjustments relating to the recoverability and classification of recorded asset amounts or amounts and classification of liabilities that might result from this uncertainty.\nCHINA KING SPIRIT GROUP LTD.\nNOTES TO THE FINANCIAL STATEMENTS\nNOTE 3 - EQUITY\nOn September 27, 2018 the Board of Directors and shareholders of China King Spirit Group Ltd. (FNA Jasmin Corp.) (the Company) approved an amendment to the Companys Articles of Incorporation increasing the number of authorized shares of Common Stock from 75,000,000 to 200,000,000 and effecting a five-for-one forward split of the Companys outstanding shares of common stock.\nThe Company has 200,000,000 common shares authorized with a par value of $0.001 per share. No preferred shares have been authorized or issued.\nThere were 12,644,500 (pre-split 2,528,900) shares of common stock issued and outstanding as of June 30, 2022 and June 30, 2021 respectively.\nAll references in these financial statements to number of common shares, price per share and weighted average number of shares outstanding prior to the 5:1 forward split have been adjusted to reflect the stock split on a retroactive basis unless otherwise noted.\nNOTE 4 - RELATED PARTIES\nDuring the period the Company received a total of $43,348 in shareholder loans from WP Acquisition (currently known as Century Acquisition LLC), a Company controlled by a shareholder. Total amount owing in shareholder loans as of June 30, 2022 is $92,177. The amounts due to related parties are unsecured and non- interest-bearing with no set terms of repayment.\nNOTE 5 - INCOME TAXES\nThe significant components of deferred income tax assets at June 30, 2022, and 2021 are as follows:\nJune 30,\nJune 30,\nNet operating loss carry-forward\n$\n(23,113\n)\n(13,985\n)\nLess: valuation allowance\n23,113\n13,985\nNet deferred income tax asset\n$\n-\n-\nThe amount taken into income as deferred income tax assets must reflect that portion of the income tax loss carry forwards that is more likely-than-not to be realized from future operations. The Company has chosen to provide a full valuation allowance against all available income tax loss carry forwards. The Company has recognized a valuation allowance for the deferred income tax asset since the Company cannot be assured that it is more likely than not that such benefit will be utilized in future years. The valuation allowance is reviewed annually. When circumstances change, and which cause a change in managements judgment about the realizability of deferred income tax assets, the impact of the change on the valuation allowance is generally reflected in current income.\nOn December 22, 2017, new federal tax reform legislation was enacted in the United States (the 2017 Tax Act), resulting in significant changes from previous tax law. The 2017 Tax Act reduces the federal corporate income tax rate to 21% from 35% effective July 1, 2018 for the Company. The rate change, along with certain immaterial changes in tax basis resulting from the 2017 Tax Act, resulted in a reduction of the Companys deferred tax assets of $6,834 and a corresponding reduction in the valuation allowance.\nAs of June 30, 2022, and 2021, the Company has no unrecognized income tax benefits. The Companys policy for classifying interest and penalties associated with unrecognized income tax benefits is to include such items as tax expense. No interest or penalties have been recorded during the year ended June 30, 2022 and June 30, 2021 and no interest or penalties have been accrued as of June 30, 2022 and 2021. As of June 30, 2022, and 2021, the Company did not have any amounts recorded pertaining to uncertain tax positions.\nA reconciliation of the provision for income taxes at the United States federal statutory rate for the years ended June 30, 2022 and 2021 is as follows:\nJune 30,\nJune 30,\nNet Operating Loss\n$ (43,463 )\n(75 )\nIncome tax rate\n21 %\n21 %\nIncome tax benefit at statutory rate\n(9,127 )\n(16 )\nChange in valuation allowance\n9,127\nProvision for income taxes\n$ -\n-\nNOTE 6 - SUBSEQUENT EVENTS\nManagement has evaluated all events or transactions that occurred after June 30, 2022 through November 10, 2022 the report date of the financial statements. During the period, the Company did not have any material recognizable subsequent events. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISLCOSURES\nThere have been no changes in or disagreements with accountants regarding our accounting, financial disclosures or any other matter. ITEM 9A. CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nThe management of the Company is responsible for establishing and maintaining adequate internal control over financial reporting, as required by Sarbanes-Oxley (SOX) Section 404 A. The Companys internal control over financial reporting is a process designed under the supervision of the Companys Chief Executive Officer and Chief Financial Officer to provide reasonable assurance regarding the reliability of financial reporting and the preparation of the Companys financial statements for external purposes in accordance with U.S. generally accepted accounting principles.\nManagement assessed the effectiveness of the Companys internal control over financial reporting based on the criteria for effective internal control over financial reporting established in SEC guidance on conducting such assessments as of the end of the period covered by this report. Management conducted the assessment based on certain criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on this assessment, management concluded that our internal controls over financial reporting were not effective as of June 30, 2022.\nThe matters involving internal controls and procedures that the Companys management considered to be material weaknesses under the standards of the Public Company Accounting Oversight Board were: (1) lack of a functioning audit committee and lack of a majority of outside directors on the Companys board of directors, resulting in ineffective oversight in the establishment and monitoring of required internal controls and procedures; (2) inadequate segregation of duties consistent with control objectives; (3) insufficient written policies and procedures for accounting and financial reporting with respect to the requirements and application of US GAAP and SEC disclosure requirements; and (4) ineffective controls over period end financial disclosure and reporting processes. The aforementioned material weaknesses were identified by the Companys Chief Financial Officer in connection with the audit of our financial statements as of June 30, 2022 and communicated the matters to our management.\nManagement believes that the material weaknesses set forth in items (2), (3) and (4) above did not have an affect on the Companys financial results. However, management believes that the lack of a functioning audit committee and lack of a majority of outside directors on the Companys board of directors, resulting in ineffective oversight in the establishment and monitoring of required internal controls and procedures can result in the Companys determination to its financial statements for the future years.\nWe are committed to improving our financial organization. As part of this commitment, we will create a position to segregate duties consistent with control objectives and will increase our personnel resources and technical accounting expertise within the accounting function when funds are available to the Company: i) Appointing one or more outside directors to our board of directors who shall be appointed to the audit committee of the Company resulting in a fully functioning audit committee who will undertake the oversight in the establishment and monitoring of required internal controls and procedures; and ii) Preparing and implementing sufficient written policies and checklists which will set forth procedures for accounting and financial reporting with respect to the requirements and application of US GAAP and SEC disclosure requirements.\nManagement believes that the appointment of one or more outside directors, who shall be appointed to a fully functioning audit committee, will remedy the lack of a functioning audit committee and a lack of a majority of outside directors on the Companys Board. In addition, management believes that preparing and implementing sufficient written policies and checklists will remedy the following material weaknesses (i) insufficient written policies and procedures for accounting and financial reporting with respect to the requirements and application of US GAAP and SEC disclosure requirements; and (ii) ineffective controls over period end financial close and reporting processes. Further, management believes that the hiring of additional personnel who have the technical expertise and knowledge will result proper segregation of duties and provide more checks and balances within the department. Additional personnel will also provide the cross training needed to support the Company if personnel turn over issues within the department occur. This coupled with the appointment of additional outside directors will greatly decrease any control and procedure issues the company may encounter in the future.\nWe will continue to monitor and evaluate the effectiveness of our internal controls and procedures and our internal controls over financial reporting on an ongoing basis and are committed to taking further action and implementing additional enhancements or improvements, as necessary and as funds allow.\nThis annual report does not include an attestation report of the companys registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by the companys registered public accounting firm pursuant to temporary rules of the Securities and Exchange Commission that permit the Company to provide only managements report in this annual report.\nChanges in Internal Control over Financial Reporting\nThere were no changes that have affected, or are reasonably likely to materially affect, our internal control over financial reporting (as defined in Rules 13a-15(f) or 15d-15(f) under the Exchange Act) during the fiscal year ended June 30, 2022. ITEM 9B. OTHER INFORMATION\nNone\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nOur executive officers and director are as follows:\nName\nAge\nPosition\nZanfang Wang*\nPresident, Chief Executive Officer, Treasurer, Secretary, Chief Financial Officer and Chairman of the Board of Directors\n*On September 27, 2018, Zanfang Wang was appointed as Chief Executive Officer, Secretary, Chief Financial Officer, and sole Director and Chairman, each effective immediately.\nBusiness Experience\nZanfang Wang was born in August 1964 in Xian County of Hebei Province. Between 1991 and 1994, Mr. Wang served as manager of Xian County Grain and Oil Negotiation Company. In 1996 he serviced as deputy director of Xian County Food Bureau and was promoted in 1998 to its Director. In April 2002 Mr. Wang became the Chairman and president of China Spirit Group Ltd. and remains its Chairman and president.\nDirector Independence\nOur board of directors is currently composed of one member, Zanfang Wang, who does not qualify as an independent director in accordance with the published listing requirements of the NASDAQ Global Market. The NASDAQ independence definition includes a series of objective tests, such as that the director is not, and has not been for at least three years, one of our employees and that neither the director, nor any of his family members has engaged in various types of business dealings with us. In addition, our board of directors has not made a subjective determination as to each director that no relationships exists which, in the opinion of our board of directors, would interfere with the exercise of independent judgment in carrying out the responsibilities of a director, though such subjective determination is required by the NASDAQ rules. Had our board of directors made these determinations, our board of directors would have reviewed and discussed information provided by the directors and us with regard to each directors business and personal activities and relationships as they may relate to us and our management.\nInvolvement in Legal Proceedings\nTo our knowledge, there have been no material legal proceedings during the last ten years that would require disclosure under the federal securities laws that are material to an evaluation of the ability or integrity of any of our directors or executive officers.\nPotential Conflicts of Interest\nWe are not aware of any current or potential conflicts of interest with Mr. Wang or other business interests and his involvement with China King Spirit Group Ltd. ITEM 11. EXECUTIVE COMPENSATION\nSummary Compensation Table\nChina King Spirit Group Ltd. has made no provisions for paying cash or non-cash compensation to its sole officer and director. No salaries are being paid at the present time, and none will be paid unless and until our operations generate sufficient cash flows.\nThe table below summarizes all compensation awarded to, earned by, or paid to our named executive officer for all services rendered in all capacities to us for the period from inception through June 30, 2022.\nSummary Compensation of Named Executive Officers\nName and Principal Position\nFiscal Year\nSalary\n($)\nBonus\n($)\nStock Awards\n($)\nOption Awards\n($)\nAll Other Compensation\n($)\nTotal\n($)\nZanfang Wang, CEO, CFO, President and Secretary\n-\n-\n-\n-\n-\n-\nZanfang Wang, CEO, CFO, President and Secretary\n-\n-\n-\n-\n-\n-\nOn September 27, 2018, Zanfang Wang was appointed as Chief Executive Officer, Secretary, Chief Financial Officer, and sole Director and Chairman, each effective immediately.\nOutstanding Equity Awards at Fiscal Year End\nWe did not pay any salaries in 2022 and 2021. None of our executive officer(s) received any equity awards, including, options, restricted stock, performance awards or other equity incentives during the years ended June 30, 2022 and 2021 for China King Spirit Group Ltd.\nEmployment Contracts\nAt this time, China King Spirit Group Ltd., has not entered into any employment agreements with its sole officer and director. If there is sufficient cash flow available from our future operations, the company may enter into employment agreements with our sole officer and director or future key staff members.\nStock Awards Plan\nThe company has not adopted a Stock Awards Plan but may do so in the future. The terms of any such plan have not been determined.\nDirector Compensation\nThe Board of Directors of the Company has not adopted a stock option plan. The company has no plans to adopt it but may choose to do so in the future. If such a plan is adopted, this may be administered by the board or a committee appointed by the board (the Committee). The committee would have the power to modify, extend or renew outstanding options and to authorize the grant of new options in substitution therefore, provided that any such action may not impair any rights under any option previously granted. China King Spirit Group Ltd. may develop an incentive-based stock option plan for its officers and directors and may reserve up to 10% of its outstanding shares of common stock for that purpose.\nThe table below summarizes all compensation awarded to, earned by, or paid to our directors for all services rendered in all capacities to us for the period inception (April 20, 2015) through June 30, 2022.\nDIRECTOR COMPENSATION\nName\nFees\nEarned or\nPaid in\nCash\n($)\nStock Awards\n($)\nOption Awards\n($)\nNon-Equity\nIncentive\nPlan\nCompensation\n($)\nNon-Qualified\nDeferred\nCompensation\nEarnings\n($)\nAll\nOther\nCompensation\n($)\nTotal\n($)\nJean Paul Chavanaz - former director\nXu Dan - former director\nZanfang Wang - current director\nBoard Committees\nWe have not formed an Audit Committee, Compensation Committee or Nominating and Corporate Governance Committee as of the filing of this Annual Report. Our Board of Directors performs the principal functions of an Audit Committee. We currently do not have an audit committee financial expert on our Board of Directors. We believe that an audit committee financial expert is not required because the cost of hiring an audit committee financial expert to act as one of our directors and to be a member of an Audit Committee outweighs the benefits of having an audit committee financial expert at this time. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe following table sets forth certain information with respect to the beneficial ownership of our voting securities by (i) each director and named executive officer, (ii) all executive officers and directors as a group; and (iii) each shareholder known to be the beneficial owner of 5% or more of the outstanding common stock of the Company as of June 30, 2022.\nBeneficial ownership is determined in accordance with the rules of the SEC. Generally, a person is considered to beneficially own securities: (i) over which such person, directly or indirectly, exercises sole or shared voting or investment power, and (ii) of which such person has the right to acquire beneficial ownership at any time within 60 days (such as through exercise of stock options or warrants). For purposes of computing the percentage of outstanding shares held by each person or group of persons, any shares that such person or persons has the right to acquire within 60 days of June 30, 2022 are deemed to be outstanding but are not deemed to be outstanding for the purpose of computing the percentage ownership of any other person. The inclusion herein of any shares listed as beneficially owned does not constitute an admission of beneficial ownership.\nName and Address of Beneficial Owner\nAmount and Nature of Beneficial Ownership Common Stock (1)\nControlling Shareholders\nNo. of Shares\n% of Class\nCentury Acquisitions LLC (formerly WP Acquisition Company, LLC)\n5,750,000\n45.47 %\nControlling shareholder Richard Rapport - former secretary of Company\n1900 Avenue of the Stars, Suite 310, Los Angeles, CA 90067\nXu Dan\n3,500,000\n27.68\n24A Builidng 7 Huangting Century Garden\n3004 Yitian Road Futian District, Shenzhen, Buangdon Province, China\nAll controlling shareholders as a group\n9,250,000\n73.15 %\n__________\n(1)\nBased on 12,644,500 shares of common stock issued and outstanding as of June 30, 2022.\nOn September 27, 2018 the Board of Directors and shareholders of China King Spirit Group Ltd. (FNA Jasmin Corp.) (the Company) approved an amendment to the Registrants Articles of Incorporation increasing the number of authorized shares of Common Stock from 75,000,000 to 200,000,000 and effecting a five-for-one forward split of the Companys outstanding shares of common stock. ITEM 13. CERTAIN RELATIONSHIP AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE.\nTransactions with Related Persons\nFrom July 1, 2021 to June 30, 2022 the Company did not receive any shareholder loans. The amounts due to related parties are unsecured and non- interest-bearing with no set terms of repayment. ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES.\nFees paid to Auditors\nAudit Fees\nFor the year ended June 30, 2022, audit and related fees were $24,000. For the year ended June 30, 2021, audit fees were $nil. The audit fees were paid in 2019 were to the Companys previous auditors Haynie & Company.\nThe SEC requires that before our independent registered public accounting firm is engaged by us to render any auditing or permitted non-audit related service, the engagement be either: (i) approved by our Audit Committee or (ii) entered into pursuant to pre-approval policies and procedures established by the Audit Committee, provided that the policies and procedures are detailed as to the particular service, the Audit Committee is informed of each service, and such policies and procedures do not include delegation of the Audit Committees responsibilities to management.\nWe do not have an Audit Committee. Our Board pre-approves all services provided by our independent registered public accounting firm. All the above services and fees paid during 2022 and 2021 were pre-approved by our Board.\nPART IV ITEM 15. EXHIBITS, FINANCIAL STATEMENT SCHEDULES\nPlease see the Exhibit Index, which is incorporated herein by reference, following the signature page for a list of our exhibits.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nChina King Spirit Group Ltd.\nDated: November 10, 2022\nBy:\n/s/ Zanfang Wang\nZanfang Wang\nPresident and Director\nPrincipal Executive Officer\nPrincipal Financial Officer\nPrincipal Accounting Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature\nDate\n/s/ Zanfang Wang\nNovember 10, 2022\nZanfang Wang\nPresident and Director\nPrincipal Executive Officer\nPrincipal Financial Officer\nPrincipal Accounting Officer\nEXHIBIT INDEX\n3.1\nArticles of Incorporation\n3.2\nBy-Laws Inc\n31.1\nCertification of Chief Executive Officer pursuant to Rule 13(a)-14(a)/15(d)-14(a) of the Securities Act of 1934\n31.2\nCertification of Chief Financial Officer pursuant to Rule 13(a)-14(a)/15(d)-14(a) of the Securities Act of 1934 *\n32.1\nCertification of Chief Executive Officer Executive Officer under Section 1350 as Adopted pursuant Section 906 of the Sarbanes-Oxley Act of 2002\n32.2\nCertification of Chief Financial Officer under Section 1350 as Adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002. **\nInteractive data files pursuant to Rule 405 of Regulation S-T\n___________\n* Included in Exhibit 31.1\n** Included in Exhibit 32.1"
}