{
    "cik": "1680132",
    "company": "CANNABIS SUISSE CORP.",
    "filing_type": "10-K",
    "filing_date": "2022-11-23",
    "period_of_report": "2022-05-31",
    "sic": "2600",
    "state_of_inc": "NV",
    "state_location": "FL",
    "fiscal_year_end": "0531",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1680132/0001393905-22-000475-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1680132/000139390522000475/csui-20220531.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1680132/0001393905-22-000475.txt",
    "filename": "1680132_10K_2022_0001393905-22-000475.htm",
    "content": "Item 1. Description of Business\nGeneral\nCannabis Suisse Corp. (the Company, we or our) utilized Swiss4Life as its retail brand for online selling. At this stage, Cannabis Suisse Corp. offers the following products:\n1)Flavored Broad-Spectrum CBD Oils. The products come in one fluid ounce (30ml) bottles available in two flavors: Crème de Menthe and Cherry Vanilla. Available CBD concentrations are 1500 mg, 2500 mg and 3500 mg.\n2)CBD Isolate Tinctures with no THC. The products come in one fluid ounce (30ml) bottles with 1000mg CBD concentrations per bottle and 33.33 mg CBD per serving. CBD Tinctures are designed to therapeutic effects.\nAs of May 31, 2022, we had no operations and are no longer involved with any aspect of the cannabis industry.\nEmployees; Identification of Certain Significant Employees\nWe currently do not have any employees. Our sole officer serves as consultant to the Company. Item 1A. Risk Factors\nRisks Related to Our Business.\nNo Operations. In May 2022, our then CEO/majority stockholder sold his stock in the Company and resigned all positions with the Company. As a result, we currently have no operations and no assets. We are classified as a shell company. No assurance can be given that we will have any business operation going forward.\nLack of Operating Funds-Going Concern. We do not have a bank account. Our sole director pays our expenses. Therefore, there is substantial doubt as to the Companys ability to continue as an ongoing enterprise.\nRisks Related to our Common Stock\nVoting Control is Held by One Stockholder. Our sole Director and CEO holds a majority of the voting stock of the Company. As a result, he will be able to control the election of directors to our Board of Directors and our business and affairs, including any determination with respect to mergers or other business combinations, the acquisition or disposition of any assets, the incurrence of additional indebtedness, the issuance of additional shares of our common\nand preferred stock or any other equity securities, the recapitalization, repurchase or redemption of our common stock and the payments of any dividends.\nPenny Stock Considerations. Our shares are penny stocks as that term is generally defined in the Securities Exchange Act of 1934 as equity securities with a price of less than $5.00. As a result, the penny stock rules apply. Such rules require, among other things, that brokers who trade penny stocks to persons other than established customers complete certain documentation, make suitability inquires of investors and provide investors with certain information concerning trading in the security, including a risk disclosure document and quote information under certain circumstances. Many brokers have decided not to trade penny stocks and, as a result, the number of broker-dealers willing to act as market makers is limited. Because our securities are subject to the penny stock rules, investors will find it more difficult to dispose of our securities, because of the requirements. Because our securities are subject to these rules it will make it more difficult to obtain needed capital in the future. In addition, the liquidity for our securities may be adversely affected with a corresponding decrease in the price of our securities. Item 1B. Unresolved Staff Comments\nNone Item 2. Description of Property\nWe do not own or lease any real estate or other properties. Our sole director/CEO has provided an office address at no cost to the Company. Item 3. Legal Proceedings\nWe know of no legal proceedings to which we are a party or to which any of our property is the subject which are pending, threatened or contemplated or any unsatisfied judgments against us. Item 4. Mine Safety Disclosures\nNot applicable.\nPART II Item 5. Market for Common Equity and Related Stockholder Matters and Issuer Purchases of Equity Securities.\nMarket Information\nCommon stock of the Company is quoted on the OTC Pink tier of the OTC Markets Group Inc under the symbol CSUI. The closing price of our common stock on the OTC Pink on November 14, 2022, was $0.05. Set forth below is the high and low bid information of our common stock for each quarter for the last two fiscal years. The quotations reflect inter-dealer prices, without retail markup. Mark-down or commissions and may not represent actual transactions.\nFY 2021\nHigh\nLow\nThird Quarter\n$\n0.07\n$\n0.04\nFourth Quarter\n$\n0.35\n$\n0.04\nFirst Quarter\n$\n0.15\n$\n0.04\nSecond Quarter\n$\n0.12\n$\n0.06\nFY 2022\nHigh\nLow\nThird Quarter\n$\n0.07\n$\n0.03\nFourth Quarter\n$\n0.35\n$\n0.04\nFirst Quarter\n$\n0.15\n$\n0.04\nSecond Quarter\n$\n0.12\n$\n0.06\nNumber of Holders\nAs of November 10, 2022, there were a total of 15 stockholders of record.\nDividends\nNo cash dividends were paid on our shares of common stock during the fiscal years ended May 31, 2022 and 2021. We do not expect to pay any dividends in the near future.\nAuthorized Capital Stock\nThe Company has 250,000,000 shares of common stock, $0.001 par value, and 20,000,000 shares of preferred stock, $0.001 par value, authorized.\nOther Stockholder Matters\nNone. Item 6. [Reserved] Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations\nCannabis Suisse Corp. developed an IT product called Cannabis Life. It is a mobile application based on an AI-chatbot that will have access to the most up-to-date information and find out data about companies and brands that sell seeds, cannabis types, etc.\nCannabis Life is an innovative way of searching and learning any cannabis related data. Using the most relevant sources of today, the app will keep its users up with the trends and tendencies of cannabis industry. Communicating with the chatbot will be as smooth as it would be with a real human being thus giving users additional immersion into the learning process.\nAs of May 31, 2022, we had no operations and were no longer involved with any aspect of the cannabis business.\nThe following discussion should be read in conjunction with our financial statements, including the notes thereto, appearing elsewhere in this Annual Report. The following discussion contains forward-looking statements that reflect our plans, estimates and beliefs. Our actual results could differ materially from those discussed in the forward-looking statements. Our audited financial statements are stated in United States Dollars and are prepared in accordance with United States Generally Accepted Accounting Principles.\nResults of Operations for the years ended May 31, 2022, and 2021:\nRevenue\nFor the year ended May 31, 2021, the Company generated total revenue of $50,850 from selling products to the customer. The cost of goods sold for the year ended May 31, 2021, was $102,648, which represent the cost of raw materials.\nFor the year ended May 31, 2022, the Company generated total revenue of $7,770 from selling products to the customer. The cost of goods sold for the year ended May 31, 2022, was $1,734.\nThe decrease in revenues and cost of goods sold is a result of the separation of Cannabis Suisse LLC in November 2020.\nOperating expenses\nTotal operating expenses for the year ended May 31, 2021, were $306,655. The operating expenses for the year ended May 31, 2021 included professional fees of $39,592; depreciation expense of $9,649 and general and administrative expenses of $257,414.\nTotal operating expenses for the year ended May 31, 2022, were $163,191. The operating expenses for the year ended May 31, 2022 included professional fees of $25,580; depreciation expense of $1,999 and general and administrative expenses of $135,612.\nThe decrease in operating expenses is related to the decrease of general and administrative expenses due to significant reduction of business activities in the year ended May 31, 2022.\nChanges in Fair Value of Derivatives\nThe gain in fair value of derivatives for the years ended May 31, 2022 and 2021, was $2,454 and $7,903, respectively.\nNet Loss\nThe net loss for the years ended May 31, 2022 and 2021 was $187,890 and $410,894, respectively.\nComprehensive Loss\nThe comprehensive loss for the years ended May 31, 2022 and 2021 was $187,890 and $419,372, respectively.\nLiquidity and Capital Resources and Cash Requirements\nAs of May 31, 2022, the Company had cash of $0. Furthermore, the Company had a working capital deficit of $274,092 and $191,877 as of May 31, 2022 and 2021, respectively.\nDuring the year ended May 31, 2022, the Company used $32,089 of cash in operating activities due to its net loss of $187,890; depreciation and amortization of $1,999; gain on extinguishment of debt of $32,774; change in fair value of derivative liability $2,454; amortization of debt discount $63,579; increase in accounts payable of $883; increase in accrued wages of $120,000, decrease in inventory of $1,734; increase in loss on asset disposal of $2,384 and decrease in prepaid expenses of $450.\nDuring the year ended May 31, 2021, the Company used $130,606 of cash in operating activities due to its net loss of $419,372; depreciation and amortization of $9,650; provision for doubtful accounts $78,827; amortization expense $12,772, change in fair value of derivative liability $25,228; decrease in accounts receivable of $1,979; decrease in related party receivables $8,422; amortization of debt discount $27,213; decrease in VAT tax receivable $9,563; decrease in inventory of $26,425; increase in accounts payable of $30,100; increase in accrued wages of $62,995 and increase in prepaid expenses of $450.\nDuring the years ended May 31, 2022 and 2021 the Company did not have cash in investing activities.\nDuring the year ended May 31, 2022, the Company increase $32,089 of cash in financing activities, which came from advances from related parties.\nDuring the year ended May 31, 2021, the Company generated $130,601 of cash in financing activities, which came from advances from related parties of $(20,414), convertible notes payable of $130,000 and bank indebtedness of $21,015.\nOur auditors have issued a going concern opinion, meaning that there is substantial doubt we can continue as an on-going business for the next twelve months unless we obtain additional capital. Our only sources for cash during the period were investments by others, selling our products and loans from our director.\nOff-Balance Sheet Arrangements\nThe Company does not have any off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on the Companys financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources.\nRelated Party Transactions\nThe Companys then CEO had agreed to provide interest free advances, due on demand, to the Company up to $100,000. As of May 31, 2022 and 2021, Suneetha Nandana Silva Sudusinghe advanced to the Company $1,589 and $0, respectively.\nThe Company also owed the former shareholder, then CEO, compensation for his services as CEO. The Company accrued $70,000 and $56,620 for the years ended May 31, 2022 and 2021, respectively. As of May 31, 2022 and 2021, the Company owed to the former CEO $126,620 and $56,620, respectively.\nCritical Accounting Policies\nThe preparation of financial statements in accordance with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. A change in managements estimates or assumptions could have a material impact on our financial condition and results of operations during the period in which such changes occurred. Actual results could differ from those estimates. Our financial statements reflect all adjustments that management believes are necessary for the fair presentation of their financial condition and results of operations for the periods presented. Item 7A. Quantitative and Qualitative Disclosures about Market Risk\nNot applicable to smaller reporting companies. Item 8. Financial Statements and Supplementary Data\nCANNABIS SUISSE CORP.\nFINANCIAL STATEMENTS\nYears Ended May 31, 2022 and 2021\nPage\nReports of Independent Registered Public Accounting Firm\nBalance Sheets as of May 31, 2022 and 2021\nStatements of Operations and Comprehensive Loss for the years ended May 31, 2022 and 2021\nStatements of Changes in Stockholders Deficit for the years ended May 31, 2022 and 2021\nStatements of Cash Flows for the years ended May 31, 2022 and 2021\nNotes to the Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and\nStockholders of Cannabis Suisse Corp.\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of Cannabis Suisse Corp. (the Company) as of May 31, 2022 and 2021, and the related statements of operations and comprehensive loss, changes in stockholders deficit, and cash flows for the years then ended, and the related notes and schedules (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of May 31, 2022 and 2021, and the results of its operations and its cash flows for the years then ended, in conformity with accounting principles generally accepted in the United States of America.\nSubstantial Doubt about the Companys Ability to Continue as a Going Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 3, the Company has limited revenues and recurring losses as of May 31, 2022 and has not completed its efforts to establish a stabilized source of revenues to cover operating costs over an extended period of time. These factors, and the need for additional financing in order for the Company to meet its business plans, raise substantial doubt about the Companys ability to continue as a going concern. Our opinion is not modified with respect to that matter.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\n3001 N. Rocky Point Dr. East, Suite 200 * Tampa, Florida 33607 * 813.367.3527\nDerivatives\nAs described in Note 2 to the Companys consolidated financial statements, derivative instruments are reported at fair value and the changes in the fair value derivative instruments are recognized in earnings each period, unless the derivative is designated and qualifies as a cash flow or net investment hedge.\nWe identified the Companys application of the accounting for convertible notes as a critical audit matter. The principal considerations for our determination of this critical audit matter related to the high degree of subjectivity in the Companys judgments in determining the qualitative factors. Auditing these judgments and assumptions by the Company involves auditor judgment due to the nature and extent of audit evidence and effort required to address these matters.\nThe primary procedures we performed to address this critical audit matters included the following:\n·We obtained debt related agreements and performed the following procedures:\n-Reviewed agreements for all relevant terms.\n-Tested managements identification and treatment of agreement terms.\n-Recalculated managements fair value of each conversion feature based on the terms in the agreements.\n-Assessed the terms and evaluated the appropriateness of managements application of their accounting policies, along with their use of estimates, in the determination of the amortization of the debt discount.\nAccell Audit & Compliance, P.A.\nWe have served as the Companys auditor since 2019.\nPCAOB Firm ID#3289\nTampa, Florida\nNovember 21, 2022\nCANNABIS SUISSE CORP.\nBALANCE SHEETS\nMay 31,\nMay 31,\nASSETS\nCurrent Assets\nInventory, net\n$\n-\n$\n1,734\nPrepaid Expenses\n-\nTotal Current Assets\n-\n2,184\nProperty and Equipment, net\n-\n4,383\nTOTAL ASSETS\n$\n-\n$\n6,567\nLIABILITIES & STOCKHOLDERS DEFICIT\nCurrent Liabilities\nAccounts Payable\n$\n$\n-\nAccrued Wages\n136,620\n101,620\nAdvances From Related Parties\n1,589\n-\nConvertible Notes Payable, net of debt discount of $0\nand $62,787 at May 31, 2022 and 201\n135,000\n67,213\nDerivative Liability\n-\n25,228\nTotal Current Liabilities\n274,092\n194,061\nTotal Liabilities\n274,092\n194,061\nCommitments and Contingencies (Note 6)\nStockholders Deficit\nPreferred stock, par value $0.001; 20,000,000 shares\nauthorized, 5,000,000 and 0 shares issued and outstanding\nas of May 31, 2022, and 2021, respectively\n5,000\n-\nCommon stock, par value $0.001; 250,000,000 shares\nauthorized, 40,654,938 and 34,500,000 shares issued and\noutstanding as of May 31, 2022, and 2021, respectively\n40,655\n34,500\nAdditional Paid-In-Capital\n742,997\n652,860\nAccumulated Deficit\n(1,062,744)\n(874,854)\nTotal Stockholders Deficit\n(274,092)\n(187,494)\nTOTAL LIABILITIES & STOCKHOLDERS DEFICIT\n$\n-\n$\n6,567\nThe accompanying notes are an integral part of these financial statements.\nCANNABIS SUISSE CORP.\nSTATEMENTS OF OPERATIONS AND COMPREHENSIVE LOSS\nFor the years ended May 31,\nREVENUES\nSales of goods from principal activity\n$\n7,770\n$\n36,945\nSales of goods from secondary activity\n-\n13,905\nTotal Revenues\n7,770\n50,850\nCost of goods sold\n1,734\n102,648\nGross Profit (Loss)\n6,036\n(51,798)\nOPERATING EXPENSES\nProfessional fees\n25,580\n39,592\nDepreciation\n1,999\n9,649\nGeneral and administrative expenses\n135,612\n257,414\nTOTAL OPERATING EXPENSES\n163,191\n306,655\nOPERATING LOSS\n(157,155)\n(358,453)\nInterest expense, net\n(63,579)\n(60,344)\nLoss on asset disposal\n(2,384)\n-\nNet loss on extinguishment of debt\n32,774\n-\nChange in fair value of derivative liability\n2,454\n7,903\nLOSS BEFORE INCOME TAXES\n(187,890)\n(410,894)\nPROVISION FOR INCOME TAXES\n-\n-\nNET LOSS\n$\n(187,890)\n$\n(410,894)\nOther comprehensive (loss) income:\nForeign currency translation adjustment\n-\n(8,478)\nCOMPREHENSIVE LOSS\n$\n(187,890)\n$\n(419,372)\nNET LOSS PER SHARE: BASIC AND DILUTED\n$\n(0.01)\n$\n(0.01)\nWEIGHTED AVERAGE NUMBER OF SHARES\nOUTSTANDING: BASIC AND DILUTED\n33,069,046\n34,500,000\nThe accompanying notes are an integral part of these financial statements.\nCANNABIS SUISSE CORP.\nSTATEMENTS OF CHANGES IN STOCKHOLDERS DEFICIT\nPreferred Stock\nCommon Stock\nShares\nAmount\nShares\nAmount\nAdditional\nPaid-In-\nCapital\nAccumulated\nOther\nComprehensive\nLoss\nAccumulated\nDeficit\nTotal\nStockholders\nDeficit\nBalance, May 31, 2020\n-\n$\n-\n34,500,000\n$\n34,500\n$\n51,695\n$\n(17,221)\n$\n(455,482)\n$\n(386,508)\nDisposal of Subsidiary\n-\n-\n-\n-\n511,165\n17,378\n-\n528,543\nForeign currency\ntranslation adjustment\n-\n-\n-\n-\n-\n(157)\n-\n(157)\nDebt Discount upon issuance\nof convertible notes\n-\n-\n-\n-\n90,000\n-\n-\n90,000\nNet loss\n-\n-\n-\n-\n-\n-\n(419,372)\n(419,372)\nBalance, May 31, 2021\n-\n$\n-\n34,500,000\n$\n34,500\n$\n652,860\n$\n-\n$\n(874,854)\n$\n(187,494)\nConversion of Common\nShares into Preferred Shares\n5,000,000\n5,000\n(5,000,000)\n(5,000)\n-\n-\n-\n-\nConversion of Notes Payable\ninto Common Shares\n-\n-\n11,154,938\n11,155\n89,345\n-\n-\n100,500\nDebt discount upon issuance\nof convertible note payable\n-\n-\n-\n-\n-\n-\nNet loss\n-\n-\n-\n-\n-\n-\n(187,890)\n(187,890)\nBalance, May 31, 2022\n5,000,000\n$\n5,000\n40,654,938\n$\n40,655\n$\n742,997\n$\n-\n$\n(1,062,744)\n$\n(274,092)\nThe accompanying notes are an integral part of these financial statements.\nCANNABIS SUISSE CORP.\nSTATEMENTS OF CASH FLOWS\nFor the years ended May 31,\nOPERATING ACTIVITIES\nNet loss\n$\n(187,890)\n$\n(419,372)\nAdjustments to reconcile net loss to net cash used in operations:\nLoss on disposal of asset\n2,384\n-\nDepreciation\n1,999\n9,650\nProvision for Doubtful Accounts\n-\n78,827\nAmortization Expense\n-\n12,772\nAmortization of Debt Discount\n63,579\n27,213\nGain on Extinguishment of Debt\n(32,774)\n-\nChange in Fair Value of Derivative Liability\n(2,454)\n25,228\nChanges in assets and liabilities:\nAccounts receivable\n-\n(1,979)\nRelated party receivables\n-\n8,422\nVAT tax receivable\n-\n9,563\nInventory\n1,734\n26,425\nPrepaid assets\n(450)\nAccounts payable\n30,100\nAccrued wages\n120,000\n62,995\nNet cash used in Operating Activities\n(32,089)\n(130,606)\nFINANCING ACTIVITIES\nAdvances from related parties, net\n32,089\n(20,414)\nBank indebtedness\n-\n21,015\nIssuance of Convertible Notes Payable\n-\n130,000\nNet cash provided by Financing Activities\n32,089\n130,601\nNet cash decrease for period\n-\n(5)\nCash at beginning of period\n-\nCash at end of period\n$\n-\n$\n-\nSUPPLEMENTAL\nCash paid for taxes\n$\n-\n$\n-\nCash paid for interest\n$\n-\n$\n-\nSupplemental disclosures of cash flow information\non the cash flow\nConversion debt to equity\n$\n100,500\n$\n-\nConversion of accrued wages to convertible note\n$\n115,500\n$\n-\nThe accompanying notes are an integral part of these financial statements.\nCANNABIS SUISSE CORP.\nNOTES TO THE FINANCIAL STATEMENTS\nMAY 31, 2022, and 2021\nNOTE 1 - ORGANIZATION AND NATURE OF BUSINESS\nThe Company is engaged in the business of production of OTC (over-the-counter) products - for example CBD oils, retail branded cigarettes and also some health-related supplements. We use various distribution channels for various types of customers. The Companys products can be sold to both corporate customers and individual clients.\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBasis of presentation and consolidation\nThe accompanying financial statements have been prepared in accordance with accounting principles generally accepted in the United States of America, (GAAP). The Companys year-end is May 31. The financial statements include the accounts of the Company and its former wholly-owned subsidiary, Cannabis Suisse LLC, through the date of disposal (see Note 4). All significant inter-company accounts and transactions have been eliminated in consolidation.\nUse of Estimates\nThe preparation of financial statements in conformity with GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date the financial statements and the reported amount of revenues and expenses during the reporting period. Actual results could differ from those estimates.\nCash and Cash Equivalents\nThe Company considers all highly liquid investments with the original maturities of three months or less to be cash equivalents. The Company had no cash and cash equivalents as of May 31, 2022 and 2021, respectively.\nAccounts Receivable\nThe Company records accounts receivable at the time products and services are delivered. An allowance for losses is established through a provision for losses charged to expenses. Receivables are charged against the allowance for losses when management believes collectability is unlikely. The allowance (if any) is an amount that management believes will be adequate to absorb estimated losses on existing receivables, based on evaluation of the collectability of the accounts and prior loss experience.\nInventories\nInventories are stated at the lower of cost or market. The Company had $0 and $1,734 in inventory as of May 31, 2022 and 2021, respectively. The Company also determines a reserve for excess and obsolete inventory based on historical usage, and projecting the year in which inventory will be consumed into a finished product. The valuation of inventories requires management to make significant assumptions, including the assessment of market value by inventory category considering historical usage, future usage and market demand for their products, and qualitative judgments related to discontinued, slow moving and obsolete inventories. The Company had $0 in reserve for excess and obsolete inventory as of May 31, 2022 and 2021, respectively.\nProperty and equipment\nProperty and equipment are carried at cost less accumulated depreciation. Depreciation is provided over the assets estimated useful lives, using the straight-line method. Estimated useful lives of the plant and equipment are as follows:\nEquipment, Furniture and fixtures\n5-10 years\nOffice machines, IT equipment\n5-10 years\nLeasehold Improvements\n2-5 years\nThe cost and related accumulated depreciation of assets sold or otherwise retired are eliminated from the accounts and any gain or loss is included in the statements of operations and comprehensive loss. The cost of maintenance and repairs is charged to the statements of operations and comprehensive loss as incurred, whereas significant renewals and betterments are capitalized.\nCANNABIS SUISSE CORP.\nNOTES TO THE FINANCIAL STATEMENTS\nMAY 31, 2022, and 2021\nImpairment\nWe evaluate the impairment of long-lived assets whenever events or changes in circumstances indicate that the carrying amount may not be recoverable. Our evaluation is based on an assessment of potential indicators of impairment, such as an adverse change in the business climate that could affect the value of an asset, current or forecasted operating or cash flow losses that demonstrate continuing losses associated with the use of an asset, and a current expectation that, more likely than not, an asset will be disposed of before the end of its previously estimated useful life. Recoverability of assets to be held and used is measured by a comparison of the carrying amount of an asset to future undiscounted net cash flows expected to be generated by the asset. If such assets are considered to be impaired, the impairment to be recognized is measured by the amount by which the carrying amount of the assets exceeds the fair value of the assets. Assets to be disposed of are reported at the lower of the carrying amount or fair value less costs to sell.\nFair Value of Financial Instruments\nAccounting Standards Codification (ASC) 820 Fair Value Measurements and Disclosures establishes a three-tier fair value hierarchy, which prioritizes the inputs in measuring fair value. The hierarchy prioritizes the inputs into three levels based on the extent to which inputs used in measuring fair value are observable in the market.\nThese tiers include:\nLevel 1:defined as observable inputs such as quoted prices in active markets;\nLevel 2:defined as inputs other than quoted prices in active markets that are either directly or indirectly observable; and\nLevel 3:defined as unobservable inputs in which little or no market data exists, therefore requiring an entity to develop its own assumptions.\nThe carrying value of the Companys cash, other current assets, accounts payable, accrued expenses and advances from related parties approximates its fair value due to their short-term maturity. The Company has derivatives that are measured at level 3. The derivatives may require appropriate valuation adjustments that a market participant would require to arrive at fair value.\nDerivatives\nDerivative instruments are recognized in the financial statements at fair value. Where the Company has entered into master netting agreements with counterparties, the derivative positions are netted by counterparties and are reported accordingly in other assets or other liabilities. Changes in the fair value of derivative instruments are recognized in earnings each period, unless the derivative is designated and qualifies as a cash flow or net investment hedge.\nIncome Taxes\nThe Company accounts for its income taxes in accordance with ASC 740, Income Taxes, which requires recognition of deferred tax assets and liabilities for future tax consequences attributable to differences between the financial statements carrying amounts of existing assets and liabilities and their respective tax bases and tax credits and carry forwards. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in operations in the period that includes the enactment date.\nRevenue Recognition\nThe Company recognizes revenue in accordance with Accounting Standards Update (ASU) 2014-09, Revenue from contracts with customers (Topic 606). Revenue is recognized when a customer obtains control of promised goods or services. In addition, the standard requires disclosure of the nature, amount, timing, and uncertainty of revenue and cash flows arising from contracts with customers. The amount of revenue that is recorded reflects the considerations that the Company expects to receive in exchange for those goods.\nThe Company applies the following five-step model in order to determine this amount: (i) identification of the promised goods in the contract; (ii) determination of whether the promised goods are performance obligations, including whether they are distinct in the context of the contract; (iii) measurement of the transaction price, including the constraint on variable consideration; (iv) allocation of the transaction price to the performance obligations; and (v) recognition of revenue when (or as) the Company satisfies each performance obligation.\nCANNABIS SUISSE CORP.\nNOTES TO THE FINANCIAL STATEMENTS\nMAY 31, 2022, and 2021\nThe Company only applies the five-step model to contracts when it is probably that the entity will collect the consideration it is entitled in exchange for the goods or services it transfers to the customer. Once a contract is determined to be within the scope of ASC 606 at contract inception, the Company reviews the contract to determine which performance obligations the Company must deliver and which of these performance obligations are distinct. The Company recognizes as revenues the amount of the transaction price that is allocated to the respective performance obligation when the performance obligation is satisfied or as it is satisfied. Generally, the Companys performance obligations are transferred to customers at a point in time, typically upon delivery.\nCost of Goods Sold\nCost of goods sold includes direct costs of selling items, direct labor cost, rent expense and electricity.\nBasic Income (Loss) Per Share\nThe Company computes income (loss) per share in accordance with ASC 260, Earnings per Share. Basic loss per share is computed by dividing net income (loss) available to common shareholders by the weighted average number of outstanding common shares during the period. Diluted income (loss) per share gives effect to all dilutive potential common shares outstanding during the period. Dilutive loss per share excludes all potential common shares if their effect is anti-dilutive. As of May 31, 2022 and 2021, there were no potentially dilutive debt or equity instruments issued or outstanding.\nRecent Accounting Pronouncements\nThere have been no recent accounting pronouncements or changes in accounting pronouncements during the year ended May 31, 2022 that are of significance or potential significance to the Company.\nNOTE 3 - GOING CONCERN\nThe accompanying financial statements have been prepared in conformity with GAAP, which contemplate continuation of the Company as a going concern. However, the Company had limited revenues and recurring losses as of May 31, 2022. The Company has not completed its efforts to establish a stabilized source of revenues sufficient to cover operating costs over an extended period of time. Therefore, there is substantial doubt about the Companys ability to continue as a going concern.\nManagement anticipates that the Company will be dependent, for the near future, on additional investment capital to fund operating expenses. The Company intends to position itself so that it will be able to raise additional funds through the capital markets. In light of managements efforts, there are no assurances that the Company will be successful in this or any of its endeavors or become financially viable and continue as a going concern.\nThe impact of the COVID-19 pandemic has had, and is expected to continue to have, an adverse effect on our business and our financial results. The COVID-19 pandemic has negatively affected global economy, disrupted consumer spending and global supply chains and created significant volatility and disruption of financial markets. The pandemic had and will continue to have an adverse effect on the Companys business and financial performance. The extent of the impact of the COVID-19, including the Companys ability to execute its business strategies as planned, will depend on future developments, including the duration and severity of the pandemic, which are uncertain and cannot be predicted. The COVID-19 pandemic could also adversely affect the Companys liquidity and ability to access the capital markets. Uncertainty regarding the duration of the COVID-19 pandemic may adversely impact the Companys ability to raise additional capital, or require additional capital.\nNOTE 4 - BUSINESS COMBINATION\nOn November 23, 2020, Cannabis Suisse Corp. (the Transferor), entered into an Asset Transfer Agreement with Cecillia Merige Jensen (the Transferee) and Cannabis Suisse LLC. In accordance with the terms of the Agreement, the Transferor transferred to the Transferee all its right, title and interest to one hundred percent (100%) of Cannabis Suisse LLC, including all its right, title and interest to one hundred percent (100%) of Grow Factory GmbH and the Transferee transferred and assigned to the Transferor 10,000,000 restricted shares of Cannabis Suisse Corp., free and clear of any and all liens and encumbrances. The above-mentioned Asset Transfer Agreement hereby revokes the effect of the Stock Transfer Agreement entered into with Cecillia Jensen on May 31, 2019, and the 10,000,000 shares were returned to the President of the Company to reinstate his ownership percentage pre-acquisition.\nCANNABIS SUISSE CORP.\nNOTES TO THE FINANCIAL STATEMENTS\nMAY 31, 2022, and 2021\nDisposal of Assets:\nRelated Party Receivable\n$\n1,618\nInventory\n29,902\nPrepaid Taxes\n12,346\nProperty and Equipment\n71,006\nVAT Tax Receivable\n4,316\nOperating lease right of use asset\n126,881\nTotal Assets Transferred\n$\n246,069\nNOTE 5 - PROPERTY AND EQUIPMENT\nMay 31, 2022\nMay 31, 2021\nEquipment\n$\n-\n$\n16,451\nLeasehold Improvements\n-\n8,354\nAccumulated depreciation\n-\n(20,422)\nNet property and equipment\n$\n-\n$\n4,383\nFor the years ended May 31, 2022, and 2021 the Company recognized depreciation expense in the amount of $1,999 and $9,649, respectively.\nNOTE 6 - COMMITMENTS AND CONTINGENCIES\nDuring the normal course of business, the Company may be exposed to litigation. When the Company becomes aware of potential litigation, it evaluates the merits of the case in accordance with ASC 450-20-50, Contingencies. The Company evaluates its exposure to the matter, possible legal or settlement strategies and the likelihood of an unfavorable outcome. If the Company determines that an unfavorable outcome is probable and can be reasonably estimated, it establishes the necessary accruals. As of May 31, 2022, the Company is not aware of any contingent liabilities that should be reflected in the financial statements.\nNOTE 7 - RELATED PARTY TRANSACTIONS\nThe Companys then CEO had agreed to provide interest free advances, due on demand, to the Company up to $100,000. As of May 31, 2022, and 2021, Suneetha Nandana Silva Sudusinghe advanced to the Company $1,589 and $0, respectively.\nThe Company also owed the former shareholder, then CEO, compensation for his services as CEO. The Company accrued $70,000 and $56,620 for the years ended May 31, 2022, and 2021, respectively. As of May 31, 2022, and 2021, the Company owed to the former CEO $126,620 and $56,620, respectively.\nNOTE 8 - CONVERTIBLE NOTES PAYABLE\nOn December 1, 2020, Suneetha Nandana Silva Sudusinghe assigned SAPA Investments, LLC $10,000 of his loan to Cannabis Suisse Corp. The Agreement contains a provision that allows SAPA Investments, LLC to convert the loan to common stock at a 70%-discount to the market price at the time of conversion after a period of lockup of 30 days. The note was converted to equity in July 2021.\nOn December 4, 2020, Suneetha Nandana Silva Sudusinghe assigned SAPA Group, LLC $10,000 of his loan to Cannabis Suisse Corp. The Agreement contains a provision that allows SAPA Group, LLC to convert the loan to common stock at a 70%-discount to the market price at the time of conversion after a period of lockup of 30 days. The note was converted to equity in July 2021.\nOn December 7, 2020, Suneetha Nandana Silva Sudusinghe assigned GSS Group LLC $10,000 of his loan to Cannabis Suisse Corp. The Agreement contains a provision that allows GSS Group LLC to convert the loan to common stock at a 70%-discount to the market price at the time of conversion after a period of lockup of 30 days. The note was converted to equity in July 2021.\nCANNABIS SUISSE CORP.\nNOTES TO THE FINANCIAL STATEMENTS\nMAY 31, 2022, and 2021\nOn December 10, 2020, Suneetha Nandana Silva Sudusinghe assigned Noi Tech LLC $10,000 of his loan to Cannabis Suisse Corp. The Agreement contains a provision that allows Noi Tech LLC to convert the loan to common stock at a 70%-discount to the market price at the time of conversion after a period of lockup of 30 days. The note was converted to equity in July 2021.\nOn April 1, 2021, Suneetha Nandana Silva Sudusinghe assigned Serhii Cherniienko $60,000 of his loan to Cannabis Suisse Corp. The Agreement contains a provision that allows Serhii Cherniienko to convert the loan to common stock at a fixed price of $0.01 per share. Beneficial conversion feature was $60,000. Of the $60,000, $30,000 was converted to equity in December 2021, and the rest of $30,000 was assigned to Okie LLC.\nOn April 15, 2021, Suneetha Nandana Silva Sudusinghe assigned Noi Tech LLC $30,000 of his loan to Cannabis Suisse Corp. The Agreement contains a provision that allows Noi Tech LLC to convert the loan to common stock at a fixed price of $0.01 per share. Beneficial conversion feature was $30,000. The note was assigned to Okie LLC with a $10,000 discount in May 2022.\nOn December 1, 2021, Suneetha Nandana Silva Sudusinghe assigned Serghei Dumanov $12,000 of his loan to Cannabis Suisse Corp. The Agreement contains a provision that allows Serghei Dumanov to convert the loan to common stock at a fixed price of $0.005 per share. The note was converted to equity in February 2022.\nOn February 1, 2022, Suneetha Nandana Silva Sudusinghe assigned Galina Balan $18,500 of his loan to Cannabis Suisse Corp. The Agreement contains a provision that allows Galina Balan to convert the loan to common stock at a fixed price of $0.005 per share. The note was converted to equity in April 2022.\nIn May 2022, Alain Parrik assigned his convertible note of $85,000 the Company owed him to Okie LLC. According to the note terms and conditions, the note can be converted to shares at a fixed price of $0.005 per share.\nThe following table summarizes the note activities described above:\nActivities During the year ended May 31, 2022\nDate\nCreditor\nBalance at\nMay 31, 2021\nNote\nIssuance\nConversion\nto Equity\nNote\nDiscount\nNote\nAssignment\nBalance at\nMay 31, 2022\n12/01/20\nSAPA Investments, LLC\n(10,000)\n-\n10,000\n-\n-\n-\n12/04/20\nSAPA Group, LLC\n(10,000)\n-\n10,000\n-\n-\n-\n12/07/20\nGSS Group LLC\n(10,000)\n-\n10,000\n-\n-\n-\n12/10/20\nNoi Tech LLC\n(10,000)\n-\n10,000\n-\n-\n-\n04/01/21\nSerhii Cherniienko\n(60,000)\n-\n30,000\n-\n30,000\n-\n04/15/21\nNoi Tech LLC\n(30,000)\n-\n-\n10,000\n20,000\n-\n12/01/21\nSerghei Dumanov\n-\n(12,000)\n12,000\n-\n-\n-\n02/01/22\nGalina Balan\n-\n(18,500)\n18,500\n-\n-\n-\n01/19/22\nAlain Parrik\n-\n(85,000)\n-\n-\n85,000\n-\n05/31/22\nOkie LLC\n-\n-\n-\n-\n(135,000)\n(135,000)\nCurrent Maturities of Convertible Notes Payable\n(130,000)\n(115,500)\n100,500\n10,000\n-\n(135,000)\nThe Companys convertible promissory notes gave rise to derivative financial instruments. The notes embodied certain terms and conditions that were not clearly and closely related to the host debt agreement in terms of economic risks and characteristics. These terms and features consist of the embedded conversion option.\nThe following tables summarize the components of the Companys derivative liabilities and linked common shares as of February 28, 2022, and 2021 and the amounts that were reflected in income related to derivatives for the period ended:\nMay 31, 2022\nThe financings giving rise to derivative financial instruments\nIndexed\nShares\nFair\nValues\nEmbedded derivatives\n-\n$\n-\nTotal\n-\n$\n-\nCANNABIS SUISSE CORP.\nNOTES TO THE FINANCIAL STATEMENTS\nMAY 31, 2022, and 2021\nMay 31, 2021\nThe financings giving rise to derivative financial instruments\nIndexed\nShares\nFair\nValues\nEmbedded derivatives\n814,967\n$\n25,227\nTotal\n814,967\n$\n25,227\nThe following table summarizes the effects on the Companys gain (loss) associated with changes in the fair values of the derivative financial instruments by type of financing for the years ended May 31, 2022 and 2021:\nFor the Three Months Ended\nMay 31, 2022\nMay 31, 2021\nEmbedded derivatives\n$\n$\n10,981\nTotal\n$\n$\n10,981\nCurrent accounting principles that are provided in ASC 815 - Derivatives and Hedging require derivative financial instruments to be classified in liabilities and carried at fair value with changes recorded in income. The Company has selected the Monte Carlo Simulation Model, which approximates the Monte Carlo Simulations, valuation technique to fair value the embedded derivative because it believes that this technique is reflective of all significant assumption types, and ranges of assumption inputs, that market participants would likely consider in transactions involving embedded derivatives. Such assumptions include, among other inputs, interest risk assumptions, credit risk assumptions and redemption behaviors in addition to traditional inputs for option models such as market trading volatility and risk-free rates. The Binomial Lattice Model technique is a level three valuation technique because it requires the development of significant internal assumptions in addition to observable market indicators. For instruments in which the time to expiration has expired, the Company has utilized the intrinsic value as the fair value. The intrinsic value is the difference between the quoted market price on the valuation date and the applicable conversion price.\nSignificant inputs and results arising from the Monte Carlo Simulation process are as follows for the embedded derivatives that have been bifurcated from the convertible notes and classified in liabilities:\nDecember 1, 2020\nQuoted market price on valuation date\n$0.0615\nEffective contractual conversion rates\n$0.044\nContractual term to maturity\n0.25 years\nMarket volatility:\nVolatility\n299.09% - 479.35%\nRisk-adjusted interest rate\n0.13%\nDecember 4, 2020\nQuoted market price on valuation date\n$0.0722\nEffective contractual conversion rates\n$0.056\nContractual term to maturity\n0.25 years\nMarket volatility:\nVolatility\n239.43% - 391.85%\nRisk-adjusted interest rate\n0.13%\nDecember 7, 2020\nQuoted market price on valuation date\n$0.06\nEffective contractual conversion rates\n$0.0455\nContractual term to maturity\n0.25 years\nMarket volatility:\nVolatility\n281.02% - 381.87%\nRisk-adjusted interest rate\n0.12%\nCANNABIS SUISSE CORP.\nNOTES TO THE FINANCIAL STATEMENTS\nMAY 31, 2022, and 2021\nDecember 10, 2020\nQuoted market price on valuation date\n$0.0551\nEffective contractual conversion rates\n$0.0419\nContractual term to maturity\n0.25 years\nMarket volatility:\nVolatility\n196.85% - 382.99%\nRisk-adjusted interest rate\n0.12%\nMay 10, 2022\nQuoted market price on valuation date\n$0.0209\nEffective contractual conversion rates\n$0.0147\nContractual term to maturity\n0.25 years\nMarket volatility:\nVolatility\n59.26%\nRisk-adjusted interest rate\n3.25%\nThe following table reflects the issuances of embedded derivatives and changes in fair value inputs and assumptions related to the embedded derivatives as of May 31, 2022 and 2021.\nYears Ended\nBalances at beginning of period\n$\n25,228\n$\n-\nIssuances:\nEmbedded derivatives\n-\n33,132\nConversions\n(22,773)\nChanges in fair value inputs and assumptions reflected in income\n(2,454)\n(7,904)\nBalances at end of period\n$\n-\n$\n25,228\nNOTE 9 - REPORTABLE SEGMENTS\nThe Company follows segment reporting in accordance with ASC Topic 280, Segment Reporting. As a result of the business combination with Cannabis Suisse LLC in May 2019, the Company has changed its operating segments to consist of the Cannabis Suisse LLC segment and the Cannabis Suisse Corp segment. After the Cannabis Suisse LLC business combination, the Companys CEO began assessing performance and allocating resources based on the financial information of these two reporting segments.\nThe Cannabis Suisse LLC segment is involved in cannabis cultivation and distribution in Switzerland of recreational tobacco products and medical CBD oils. On November 23, 2020, Cannabis Suisse LLC and Cannabis Suisse Corp canceled their acquisition by Asset Transfer Agreement (see Note 4).\nCannabis Suisse Corp was engaged in the development of its business activities by conquering the USA market of CBD products since November 2020. As of May 31, 2022, we had no operations and were no longer involved with any aspect of the cannabis business.\nNet revenue by reporting segment for the years ended May 31, 2022, and 2021, is as follows:\nCannabis Suisse Corp\n$\n7,770\n$\n-\nCannabis Suisse LLC\n-\n50,850\nTotal Revenue\n$\n7,770\n$\n50,850\nCANNABIS SUISSE CORP.\nNOTES TO THE FINANCIAL STATEMENTS\nMAY 31, 2022, and 2021\nGross profit by reporting segment for the years ended May 31, 2022, and 2021, is as follows:\nCannabis Suisse Corp\n$\n6,036\n$\n-\nCannabis Suisse LLC\n-\n(51,798)\nTotal Gross (Loss) Profit\n$\n6,036\n$\n(51,798)\nAssets by reporting segment as of May 31, 2022, and 2021, is as follows:\nCannabis Suisse Corp\n$\n-\n$\n6,567\nCannabis Suisse LLC\n-\n-\nTotal Assets\n$\n-\n$\n6,567\nNOTE 10 - STOCKHOLDERS EQUITY\nOn March 17, 2021, the Board of Directors, along with the majority stockholder, resolved that the 5,000,000 preferred shares with voting rights of 1 to 10 shall be issued to Suneetha Nandana Silva Sudusinghe in exchange for 5,000,000 common shares that Suneetha Nandana Silva Sudusinghe owned previously.\nNOTE 11 - INCOME TAXES\nThe Company adopted the provisions of uncertain tax positions as addressed in ASC 740-10-65-1. As a result of the implementation of ASC 740-10-65-1, the Company recognized no increase in the liability for unrecognized tax benefits.\nThe Company has no tax position at May 31, 2022 for which the ultimate deductibility is highly certain but for which there is uncertainty about the timing of such deductibility. The Company recognizes interest accrued related to unrecognized tax benefits in interest expense and penalties in operating expenses. No such interest or penalties were recognized during the period presented. The Company had no accruals for interest and penalties at May 31, 2022. The Companys utilization of any net operating loss carryforward may be unlikely as a result of its intended activities.\nThe valuation allowance at May 31, 2022 was $223,176. The net change in valuation allowance for the year ended May 31, 2022, and May 31, 2021 was $39,457 and $88,068, respectively. In assessing the realizability of deferred tax assets, management considers whether it is more likely than not that some portion or all of the deferred income tax assets will not be realized. The ultimate realization of deferred income tax assets is dependent upon the generation of future taxable income during the periods in which those temporary differences become deductible. Management considers the scheduled reversal of deferred income tax liabilities, projected future taxable income, and tax planning strategies in making this assessment.\nBased on consideration of these items, management has determined that enough uncertainty exists relative to the realization of the deferred income tax asset balances to warrant the application of a full valuation allowance as of May 31, 2022, and 2021. All tax years since inception remains open for examination only by taxing authorities of US Federal and state of Nevada.\nThe Company has a net operating loss carryforward for tax purposes totaling $1,062,744 at May 31, 2022, expiring through fiscal year 2037. There is a limitation on the amount of taxable income that can be offset by carryforwards after a change in control (generally greater than a 50% change in ownership). The loss carryforward has a full valuation allowance which increased $39,457 during the fiscal year ended May 31, 2022.\nCANNABIS SUISSE CORP.\nNOTES TO THE FINANCIAL STATEMENTS\nMAY 31, 2022, and 2021\nThe components of the Companys deferred tax asset and reconciliation of income taxes computed at the statutory rate of 21% to the income tax amount recorded as of May 31, 2022 and 2021 are as follows:\nMay 31, 2022\nMay 31, 2021\nNet operating loss carryforward\n$\n(1,062,744)\n$\n(874,854)\nEffective tax rate\n21%\n21%\nDeferred tax asset\n223,176\n183,719\nLess: Valuation allowance\n(223,176)\n(183,719)\nNet deferred asset\n$\n-\n$\n-\nNOTE 12 - SUBSEQUENT EVENTS\nIn accordance with SFAS 165 (ASC 855), Subsequent Events, the Company has analyzed its operations subsequent to May 31, 2022 to the date these financial statements were issued, and has determined that it does not have any material subsequent events to disclose except the following:\n1.In November 2022, the Company issued a convertible promissory note in the principal of $135,000 to the Companys CEO for funds he has advanced the Company for expenses. The Note has a term of four years, the interest rate is 12% and the conversion price is $0.04 per share.\n2.In November 2022, Okie LLC assigned its convertible notes to the following parties, respectively:\nA.Scott McAlister, $85,000;\nB.Clifford Koschnick, $30,000; and\nC.Clifford Koschnick, $20,000. Item 9. Changes In and Disagreements with Accountants on Accounting and Financial Disclosure\nNone. Item 9A(T) Controls and Procedures\nManagements Report on Internal Controls over Financial Disclosure Controls and Procedures\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Exchange Act Rule 13a-15(f)). The Companys internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with accounting principles generally accepted in the United States of America. Because of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate. Under the supervision and with the participation of management, including the Chief Executive Officer and Chief Financial Officer, the Company conducted an evaluation of the effectiveness of the Companys internal control over financial reporting as of May 31, 2022 using the criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).\nA material weakness is a deficiency, or combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of the Companys annual or interim financial statements will not be prevented or detected on a timely basis. In its assessment of the effectiveness of internal control over financial reporting as of May 31, 2022, the Company determined that there were control deficiencies that constituted material weaknesses, as described below.\n1.We do not have an Audit Committee - While not being legally obligated to have an audit committee, it is the managements view that such a committee, including a financial expert member, is an utmost important entity level control over the Companys financial statements. Currently the Board of Directors acts in the capacity of the Audit Committee, and does not include a member that is considered to be independent of management to provide the necessary oversight over managements activities.\n2.We did not maintain appropriate cash controls - As of May 31, 2022, the Company has not maintained sufficient internal controls over financial reporting for the cash process, including failure to segregate cash handling and accounting functions, and did not require dual signature on the Companys bank accounts. Alternatively, the effects of poor cash controls were mitigated by the fact that the Company had limited transactions.\n3.We did not implement appropriate information technology controls - As at May 31, 2022, the Company retains copies of all financial data and material agreements; however there is no formal procedure or evidence of normal backup of the Companys data or off-site storage of data in the event of theft, misplacement, or loss due to unmitigated factors.\nAccordingly, the Company concluded that these control deficiencies resulted in a reasonable possibility that a material misstatement of the annual or interim financial statements will not be prevented or detected on a timely basis by the companys internal controls.\nAs a result of the material weaknesses described above, management has concluded that the Company did not maintain effective internal control over financial reporting as of May 31, 2022, based on criteria established in Internal Control- Integrated Framework (2013) issued by COSO.\nSystem of Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining a system of disclosure controls and procedures (as defined in Rule 13a-15(e) and 15d-15(e) under the Exchange Act) that is designed to ensure that information required to be disclosed by us in the reports that we file or submit under the Exchange Act is recorded, processed, summarized and reported, within the time periods specified in the Commissions rules and forms. Disclosure controls and procedures include, without limitation, controls and procedures designed to ensure that information required to be disclosed by an issuer in the reports that it files or submits under the Exchange Act is accumulated and communicated\nto the issuers management, including its principal executive officer or officers and principal financial officer or officers, or persons performing similar functions, as appropriate to allow timely decisions regarding required disclosure.\nAn evaluation was conducted under the supervision and with the participation of our management of the effectiveness of the design and operation of our disclosure controls and procedures as of May 31, 2022. Based on that evaluation, our management concluded that our disclosure controls and procedures were not effective as of such date to ensure that information required to be disclosed in the reports that we file or submit under the Exchange Act, is recorded, processed, summarized and reported within the time periods specified in SEC rules and forms.\nChanges in Internal Control over Financial Reporting\nThere has been no change in the Companys internal control over financial reporting during the period covered by this report that has materially affected, or is reasonably likely to materially affect, the Companys internal control over financial reporting. Item 9B. Other Information.\nNone.\nPART III Item 10. Directors, Executive Officers, Promoters and Control Persons of the Company\nOfficers and Directors\nThe names and ages of our directors and executive officers are set forth below. Also included is their principal occupation(s). The board of directors has no nominating, auditing or compensation committees.\nThe name, address, age and position of our present officers and directors are set forth below:\nName\nAge\nPosition(s)\nScott McAlister\nDirector, CEO/CFO\nMr. McAlister has served in his capacity as a Director since May 2022, and as CEO/CFO since September 2022. He has been the owner of SWM Contractors, Inc., a commercial real estate development company since 2017. From 2005 to 2017 he was the owner of SWM Builders, LLC, a commercial real estate development company. Mr. McAlister is a licensed general contractor in Florida. He graduated in 2000, from the University of North Florida, Jacksonville Florida, with a bachelors degree in psychology.\nDelinquent Section 16(a) Reports\nMr. Scott McAlister, our CEO/CFO and sole director did not file a Form 3 on a timely basis.\nTerm of Office\nA director is appointed to hold office until the next annual meeting of our stockholders or until his respective successor is elected and qualified, or until he resigns or is removed in accordance with the provisions of the Nevada Revised Statues. Our director holds office until removed by the Board or until his resignation appoints our officer.\nCorporate Governance\nOur Board has not established any committees, including an audit committee, a compensation committee or a nominating committee, or any committee performing a similar function. The functions of those committees are being undertaken by our sole Director.\nDirector Independence\nThe Company has adopted the NASDAQ Listing Rules; Rule 5605 and 5605 (a) (20, for determining the independence of its directors. Directors are deemed independent only if the Board affirmatively determines that the director has no material relationship with the Company directly or as an officer, share owner or partner of an entity that has a relationship with the Company or any other relationship which, in the opinion of the Board, would interfere with the exercise of independent judgment in carrying out the responsibilities of a director. Our sole director is also the majority holder of the voting stock of the Company. As such he is not independent as that term is defined under the afore stated NASDAQ Listing Rules. Item 11. Executive Compensation\nThe following table sets forth the compensation paid by us for the years ended May 31, 2022 and 2021 for our executive officers and directors. This information includes the dollar value of base salaries, bonus awards and number of stock options granted, and certain other compensation, if any. The compensation discussed addresses all compensation awarded to, earned by, or paid or named executive officers.\nEXECUTIVE COMPENSATION SUMMARY COMPENSATION TABLE\nName and\nPrincipal\nPosition\nYear\nSalary\n(US$)\nBonus\n(US$)\nStock\nAwards\n(US$)\nOption\nAwards\n(US$)\nNon-Equity\nIncentive Plan\nCompensation\n(US$)\nNonqualified\nDeferred\nCompensation\nEarnings\n(US$)\nAll Other\nCompensation\n(US$)\nTotal\n(US$)\nSuneetha Sudusinghe,\nPresident, CEO, CFO\n$70,000\n$-\n$-\n$-\n$-\n$-\n$-\n$70,000\n$36,620\n$20,000\n$-\n$-\n$-\n$-\n$-\n$56,620\nAlain Parrik,\nCOO\n$40,000\n$-\n$-\n$-\n$-\n$-\n$-\n$40,000\n$30,000\n$15,000\n$-\n$-\n$-\n$-\n$-\n$45,000\nButkus Mantas,\nDirector\n$10,000\n$-\n$-\n$-\n$-\n$-\n$-\n$10,000\n$-\n$-\n$-\n$-\n$-\n$-\n$-\n$-\nThe pay examined in this delivers all remuneration recompensed to, earned by, or paid to our named executive officers and directors.\nOur current CEO/CFO receives no compensation for his services at this time.\nLong-Term Incentive Plan Awards\nWe do not have any long-term incentive plans that provide compensation intended to serve as incentive for performance.\nIndemnification\nUnder our Articles of Incorporation and Bylaws of the corporation, we may indemnify an officer or director who is made a party to any proceeding, including a lawsuit, because of his position, if he acted in good faith and in a manner he reasonably believed to be in our best interest. We may advance expenses incurred in defending a proceeding. To the extent that the officer or director is successful on the merits in a proceeding as to which he is to be indemnified, we must indemnify him against all expenses incurred, including attorneys fees. With respect to a derivative action, indemnity may be made only for expenses actually and reasonably incurred in defending the proceeding, and if the officer or director is judged liable, only by a court order. The indemnification is intended to be to the fullest extent permitted by the laws of the State of Nevada. Regarding indemnification for liabilities arising under the Securities Act of 1933, which may be permitted to directors or officers under Nevada law, we are informed that, in the opinion of the Securities and Exchange Commission, indemnification is against public policy, as expressed in the Act and is, therefore, unenforceable. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nTitle of class\nName of\nBeneficial Owner\nAmount and Nature of\nBeneficial Ownership\nPercent of\nCommon Stock\nCommon Stock\nScott McAlister\n37,775,000 (1)\n61%\n(1)Represents 12,400,000 shares of common stock and 5,000,000 shares of preferred stock convertible into common stock on a one-to-one basis. The principal amount of the note is $85,000. The preferred stock votes on a one to ten basis. Also includes 17,000,000, shares of common stock obtainable through the conversion of a promissory note whereby the Holder has the right to convert all or part of the note at $.005 per share. Also includes 3,375,000 shares of common stock obtainable through the conversation of a convertible promissory note in the principal amount of $135,000, excluding any interest Item 13. Certain Relationships and Related Transactions\nThe Companys former president had verbally agreed to provide interest free advances, due on demand, to the Company up to $100,000. As of May 31, 2022, and 2021, the Company has drawn $1,589 and $0, respectively, of advances.\nIn November 2022, the Company issued a convertible promissory note in the principal of $135,000 to the Companys CEO for funds he has advanced the Company for expenses. The Note has a term of four years, the interest rate is 12% and the conversion price is $0.04 per share. Item 14. Principal Accounting Fees and Services\nDuring fiscal year ended May 31, 2022, we incurred approximately $18,000 in fees to our principal independent accountants Accell Audit & Compliance, P.A. for professional services rendered in connection with annual audit and quarterly reviews.\nDuring fiscal year ended May 31, 2021, we incurred approximately $28,132 in fees to our principal independent accountants Accell Audit & Compliance, P.A. for professional services rendered in connection with annual audit and quarterly reviews.\nDuring the fiscal years ended May 31, 2022, and 2021 we incurred no audited related fees, tax related fees, and $0 in all other fees.\nPART IV Item 15. Exhibits, Financial Statements Schedules\n(a)List of documents filed as part of this Report:\n(1)Financial Statements\nThe financial statements are included under Item 8 of this Annual Report on Form 10-K.\n(2)Financial Statement Schedules\nAll schedules have been omitted because the required information is included in the financial statements included under Item 8 of this Annual Report on Form 10-K or the notes thereto, or because it is not required.\n(3)Financial Statement Schedules\nSee exhibits listed under Part (b) below.\n(b)Exhibits\nExhibit\nNumber\nExhibit Description\n31.1*\nCertification of Chief Executive Officer pursuant to Securities Exchange Act of 1934 Rule 13a-14(a) or 15d-14(a).\n31.2*\nCertification of Chief Financial Officer pursuant to Securities Exchange Act of 1934 Rule 13a-14(a) or 15d-14(a).\n32.1**\nCertifications pursuant to Securities Exchange Act of 1934 Rule 13a-14(b) or 15d-14(b) and 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes- Oxley Act of 2002.\n32.2**\nCertification pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n101.INS\nInline XBRL Instance Document\n101.SCH\nInline XBRL Taxonomy Extension Schema Document\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101)\nItem 16. Form 10-K Summary\nNot applicable.\nSIGNATURES\nIn accordance with Section 13 or 15(d) of the Exchange Act, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nCANNABIS SUISSE CORP.\n(Registrant)\nNovember 22, 2022\nBy:\n/s/ Scott McAlister\nScott McAlister\nChief Executive Officer\nIn accordance with the Exchange Act, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nNovember 22, 2022\nBy:\n/s/ Scott McAlister\nScott McAlister\nChief Executive Officer, Chief Financial Officer, Principal Accounting officer"
}