{
    "cik": "1683252",
    "company": "TOKEN COMMUNITIES LTD.",
    "filing_type": "10-K",
    "filing_date": "2023-10-13",
    "period_of_report": "2023-06-30",
    "sic": "7374",
    "state_of_inc": "DE",
    "state_location": "FL",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1683252/0001477932-23-007616-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1683252/000147793223007616/tkcm_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1683252/0001477932-23-007616.txt",
    "filename": "1683252_10K_2023_0001477932-23-007616.htm",
    "content": "Item 1. Business\nOverview\nUp to the end of calendar 2022, Token Communities, Ltd. (hereinafter the Company, Our, We or Us) researched and created white paper analysis for companies regarding block chain technology, and also operated the Lukki Exchange, until its sale in April 2022. Unfortunately, China banned foreign crypto currency operations such as these and we began, at the end of 2022, to research developing, naturopathic supplements to diversify the operations of the Company. At the time we formed a research and development team. This team developed six products as wellness supplements with a company located in Xi-An, China. This led the Company to acquire Elements of Health and Wellness, Inc. (Elements) in January 2023.\nBackground\nThe Company was organized under the laws of the State of Delaware on March 6, 2014, under the name Pacific Media Group Enterprises, Inc. On April 7, 2017, the Company amended its Certificate of Incorporation with the Secretary of State of Delaware, changing its name to Extract Pharmaceuticals Inc. On January 26, 2018, the Board of Directors adopted an Amendment to its Articles, changing its name to Token Communities Ltd. The Company researched and created white paper analysis for companies regarding block chain technology, and also operated the Lukki Exchange, including all client lists, intellectual property related to the brand Lukki.\nOn February 26, 2018, the Company entered into an Acquisition and Share Exchange Agreement with Token Communities PLC, a Gibraltar company (PLC) whereby PLC became a wholly owned subsidiary of the Company. PLC is a Gibraltar Financial Advisory firm which specializes in Blockchain, Artificial Intelligence and Fin-Tech investment in incubating as well as advising and managing qualified companies in the blockchain and distributed ledger technologies arena, including smart contracts, TGEs, DApps, and more.\nOn January 10, 2023 the Company entered into a Stock Purchase Agreement with Elements whereby the Company acquired ninety shares of common stock of Elements (which represents ninety percent of the outstanding shares of common stock of Elements). As a result of the closing of transaction set forth above, Elements has become a subsidiary of the Company and the Company has expanded its business operations into the health and wellness sector.\nOur principal executive offices are located at 4802 Lena Road, Unit 105, Bradenton, Florida, 34211 and our telephone number is (631) 397-1111.\nOur Company\nUntil January 2023 the Company researched and created white paper analysis for companies regarding block chain technology, and also operated the Lukki Exchange. We currently actively engaged in the Health and Wellness Sector developing holistic and naturopathic products, including plant stem cell, natural supplements, cosmetic facial masks and more. We are developing an eCommerce platform to commence sales of all products. We currently have five products that we market and sell: our Detox, Brainer, Cleaner, Apollo, and Venus supplements.\nOur Products\nWe are currently selling five different products in China through 10 distribution centers. Our current products include:\nDetox\nOur Detox Enhancer was developed with the goal to work on damaged liver tissues, with the goal to: restore the liver's blood sugar regulation function, reverse endocrine disorders related to insulin resistance, regulate the metabolic function of beneficial probiotic microbiota in the body, and improve the normal cellular functions within the human body.\nBrainer\nOur Brainer product was developed to enhance the metabolism of necrotic cells and remove various deposits and harmful substances within brain tissues, with the goal to: restore normal functioning of brain cells, normal blood flow rate and oxygen supply within cerebral blood vessels.\nCleaner\nOur Cleaner product was developed with the goal to help to naturally dissolve blood lipids and harmful substances inside blood vessels, restoring the elasticity and smoothness of the blood vessels, as well as normal blood flow rate and pressure inside the blood vessels.\nApollo\nOur Apollo was developed with the goal to enhance the endocrine function that may decline in males during middle age, promoting hormonal supplementation and providing the necessary nutrients for maintaining youthful vitality, metabolism, and energy in males.\nVenus\nOur Venus product was developed with the goal to: enhance the subcutaneous collagen components and collagen proteins that gradually diminish in females after adulthood, supplementing and maintaining the necessary nutrients for youthful vitality, metabolism, and energy in females.\nWe currently sell our products in China through a group of distribution centers located in various regions of China and we also established a new regional center in Kunming, Yunnan. This strategic expansion is aimed at better serving the healthcare needs of the southern China region. In a commitment to enhancing accessibility, Elements of Health and Wellness has joined with ten regional and private clinics throughout China to provide comprehensive support and care\nRecent Developments\nIn July 2023 the Companys subsidiary Elements of Health and Wellness Inc. entered into a Tier-One Master Distributorship Agreement to sell our Detox, Brainer, Cleaner, Apollo, Venus, and Slim Eve supplements in Beijing, China.\nIntellectual Property\nWe do not currently own, and do not have any current plans to seek, any patents in connection with our operations. We do not have any copyrights or trademarks, but we generally rely upon copyright, trademark and trade secret laws to protect and maintain our proprietary rights for our technology and products. Notwithstanding the steps we have taken to protect our intellectual property rights, third parties may infringe or misappropriate our proprietary rights. Competitors may also independently develop supplements that are substantially equivalent or superior to the supplements we developed and sell.\nCompetition\nThere are many companies offering or developing supplements, and there can be no assurance that direct competitors will arise. We face significant competition, including from companies that have entered this space much earlier than us and are better capitalized, with vertically integrated business models, larger than us, have more access to capital and have lower operating costs than we do. These competitors may be able to respond more rapidly to new or emerging supplements and changes in customer requirements or to devote greater resources to the development, promotion and sale of their products. These competitors may enter our existing or future markets with currencies that may be less expensive, that may provide higher performance or additional features or that may be introduced more quickly than our products.\nGovernment Regulation\nOur products have not been evaluated by the U.S. Food and Drug Administration (FDA) or any similar regulatory body for safety and efficacy. We anticipate in the future that our products may be subject to regulation by one or more federal agencies, including but not limited to the Food and Drug Administration (FDA), the Federal Trade Commission (FTC), the Consumer Product Safety Commission (CPSC), the United States Department of Agriculture, and the Environmental Protection Agency.\nThe FDAs revision of labeling requirements also affects the labeling of certain supplements. Our manufacturers may have revised labels on some of our supplements to comply with the requirements.\nEmployees\nCurrently we and our subsidiaries employ a total of two individuals. Item 1A. Risk Factors.\nSmaller reporting companies are not required to provide the information required by this Item. Item 1B. Unresolved Staff Comments.\nThe Company is neither an accelerated filer nor a large accelerated filer, as defined in Rule 12b-2 of the Exchange Act (§240.12b-2 of this chapter), nor is it a well-known seasoned issuer as defined in Rule 405 of the Securities Act (§230.405 of this chapter), and as such is not required to provide the information required by this item. Item 2. Properties.\nCurrently the Company utilizes offices provided by the President of the Company no charge. Item 3. Legal Proceedings.\nNeither the Company nor its property is a party to any pending material legal proceeding. Item 4. Mine Safety Disclosures.\nNot applicable.\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities.\nMarket Information\nOur common stock is quoted on the OTC Pink market under the symbol TKCM. Our common stock trades on a limited or sporadic basis and should not be deemed to constitute an established public trading market. There is no assurance that there will be liquidity in the common stock.\nHolders\nAs of June 30, 2023, there were 2,095,671,162 shares of common stock outstanding, which were held by approximately 162 record holders.\nDividends\nThrough June 30, 2023, we have never paid cash dividends on any of our capital stock and we currently intend to retain our future earnings, if any, to fund the development and growth of our business. We do not intend to pay cash dividends to holders of our common stock in the foreseeable future.\nRecent Sales of Unregistered Securities\nDuring the year ended June 30, 2023, there were no sales by the Company (which have not been included in a Quarterly Report on Form 10-Q or in a Current Report on Form 8-K) that were not registered under the Securities Act. Item 6. [Reserved] Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations.\nThe following discussion should be read in conjunction with our audited financial statements and the related notes that appear elsewhere in this Annual Report. The following discussion contains forward-looking statements that reflect our plans, estimates and beliefs. Our actual results could differ materially from those discussed in the forward-looking statements. Factors that could cause or contribute to such differences include, but are not limited to those discussed below and elsewhere in this Annual Report. Our audited financial statements are stated in United States Dollars and are prepared in accordance with United States Generally Accepted Accounting Principles.\nPlan of Operation\nUntil January 2023 the Company researched and created white paper analysis for companies regarding block chain technology, and also operates the Lukki Exchange, (until its sale in April 2022) including all client lists, intellectual property related to the brand Lukki. Commencing the end of the calendar year in 2022 the Company expanded its business operations into the health and wellness sector resulting in the acquisition of Elements in January 2023.\nResults from Operations - For the year ended June 30, 2023 as compared to June 30, 2022\nRevenue\nFor the years ended June 30, 2023 and 2022, the Company had total sales of $31,937 and $0, respectively. The increase in revenues was due to the acquisition of Elements in January 2023.\nOperating Expenses\nTotal operating expenses decreased to $285,944 in 2023 from $318,564 in 2022, a decrease of $32,620. The decrease was primarily due to the decrease in both rent and salary during the fiscal year ended June 30, 2023.\nLoss From Operations\nAs a result of the foregoing, our loss from operations was $254,007 for the year ended June 30, 2023, compared with $318,564, for the year ended June 30, 2022. The decrease in our overall loss from operations was a result of a decrease in General and Administrative expenses in Shenzhen.\nOther Income (Expense)\nOther Income (Expense) decreased from $ $50,000 in 2022 to $0 in 2023. This decrease was due to the sale of the Lukki exchange in fiscal 2022.\nNet Income (Loss)\nFor the year ended June 30, 2023 the Company had net loss of $248,815 compared to a net loss of $268,564 for the year ended June 30, 2022, a decrease of $18,749. The decrease is primarily due to an increase in revenues and a decrease in operating expenses.\nLiquidity and Capital Resources\nAs of June 30, 2023, the Company had $98,725 in Total Assets, consisting of $1,430 in cash, $50,000 in Accounts Receivable, and $46,480 in Inventory. The Companys total liabilities exceeded its consolidated current assets by approximately $1,612,330 as of June 30, 2023 primarily due to $1,520,885 due to related parties. Total liabilities exceeded its consolidated current assets by approximately $1,309,444 as of June 30, 2022.\nAs of June 30, 2023, the Company has yet to achieve profitable operations, and while the Company hopes to achieve profitable operations in the future, if not it may need to raise capital from stockholders or other sources to sustain operations and to ultimately achieve viable operations. These factors raise substantial doubt about the Companys ability to continue as a going concern. The Companys principal sources of liquidity have been cash provided by operating activities, as well as its ability to raise capital. The Companys operating results for future periods are subject to numerous uncertainties and it is uncertain if the Company will be able to become profitable and continue growth for the foreseeable future. If management is not able to increase revenue and/or manage operating expenses, the Company may not be able to maintain profitability. The Companys ability to continue in existence is dependent on the Companys ability to achieve profitable operations.\nTo continue operations for the next 12 months we will have a cash need of approximately $250,000. Should we not be able to fulfill our cash needs through the increase of revenue we will need to raise money through outside investors through convertible notes, debt or similar instrument(s), the Company has no committed external source of funds, and there is no guarantee we would be able to raise such funds. The Company plans to pay off current liabilities through sales and increasing revenue through sales of Company services and or products, or through financing activities as mentioned above.\nOur cash flows for the year ended June 30, 2023 and 2022 are summarized below:\nYear\nEnding\nJune 30,\nYear\nEnding\nJune 30,\nNet cash used in operating activities\n$ (212,212 )\n$ (318,564 )\nNet cash used in investing activities\n$ 0\n$ 0\nNet cash provided by financing activities\n$ 262,209\n$ 336,887\nNet Change in Cash\n$ 0\n$ 0\nCash at beginning of year\n$ 312\n$ 312\nCash at end of year\n$ 1,431\n$ 312\nNet Cash Used in Operating Activities\nFor the year ended June 30, 2023, ($212,212) net cash used in operating activities was primarily attributable to loss from operations, offset by the overall increase in operating assets and liabilities. For the year ended June 30, 2022, ($318,564) net cash used in operating activities was primarily due to loss from operations and the increase in deposits for the sale of the Lukki exchange.\nNet Cash Used in Investing Activities\nFor the year ended June 30, 2023 and June 30, 2023, net cash used in investing activities was $0.\nNet Cash Provided by Financing Activities\nFor the year ended June 30, 2023, net cash provided by financing activities was $262,209 as compared to $336,887 for the year ended June 30, 2022. The change was due to an advance from a related party.\nCritical Accounting Policies\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and the disclosure of contingent assets and liabilities of the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Notes to the Consolidated Financial Statements describes the significant accounting policies and methods used in the preparation of the Consolidated Financial Statements. Estimates are used for, but not limited to, contingencies and taxes. Actual results could differ materially from those estimates. The following critical accounting policies are impacted significantly by judgments, assumptions, and estimates used in the preparation of the Consolidated Financial Statements.\nLoss Contingencies\nThe Company is subject to various loss contingencies arising in the ordinary course of business. The Company considers the likelihood of loss or impairment of an asset or the incurrence of a liability, as well as its ability to reasonably estimate the amount of loss in determining loss contingencies. An estimated loss contingency is accrued when management concludes that it is probable that an asset has been impaired or a liability has been incurred and the amount of the loss can be reasonably estimated. The Company regularly evaluates current information available to us to determine whether such accruals should be adjusted.\nIncome Taxes\nThe Company recognizes deferred tax assets (future tax benefits) and liabilities for the expected future tax consequences of temporary differences between the book carrying amounts and the tax basis of assets and liabilities. The deferred tax assets and liabilities represent the expected future tax return consequences of those differences, which are expected to be either deductible or taxable when the assets and liabilities are recovered or settled.\nRecent Accounting Pronouncements\nSee Note 2 of the consolidated financial statements for discussion of Recent Accounting Pronouncements.\nOff-Balance Sheet Arrangements\nWe are not currently a party to, or otherwise involved with, any off-balance sheet arrangements that have or are reasonably likely to have a current or future material effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources.\nRecently Adopted Accounting Standards\nIn May 2014, the FASB issued Accounting Standards Update (ASU) No. 2014-09, Revenue from Contracts with Customers: Topic 606, or ASU 2014-09. ASU 2014-09 establishes the principles for recognizing revenue and develops a common revenue standard for U.S. GAAP. The standard outlines a single comprehensive model for entities to use in accounting for revenue arising from contracts with customers and supersedes most current revenue recognition guidance, including industry-specific guidance. In applying the new revenue recognition model to contracts with customers, an entity: (1) identifies the contract(s) with a customer; (2) identifies the performance obligations in the contract(s); (3) determines the transaction price; (4) allocates the transaction price to the performance obligations in the contract(s); and (5) recognizes revenue when (or as) the entity satisfies a performance obligation. The accounting standards update applies to all contracts with customers except those that are within the scope of other topics in the FASB Accounting Standards Codification. The accounting standards update also requires significantly expanded quantitative and qualitative disclosures regarding the nature, amount, timing and uncertainty of revenue and cash flows arising from contracts with customers. This guidance is effective for fiscal years and interim periods within those years beginning after December 15, 2017. The Company adopt ed ASU 2014-09 effective January 1, 2018. The adoption of this standard had no material impact on the Companys financial statements. Item 7A. Quantitative and Qualitative Disclosures About Market Risk.\nPursuant to Item 305(e) of Regulation S-K (§ 229.305(e)), the Company is not required to provide the information required by this Item as it is a smaller reporting company, as defined by Rule 229.10(f)(1). Item 8. Financial Statements and Supplementary Data.\nReport of the Independent Registered Public Accounting Firm (PCAOB ID: 6778)\nConsolidated Balance Sheets as of June 30, 2023 and 2022\nConsolidated Statements of Operations for the Years Ended June 30, 2023 and 2022\nConsolidated Statements of Stockholders Equity for the Years Ended June 30, 2023 and 2022\nConsolidated Statements of Cash Flows for the Years Ended June 30, 2023 and 2022\nNotes to Consolidated Financial Statements\n-\nGries & Associates, LLC\nCertified Public Accountants\n501 S. Cherry Street, Suite 1100\nDenver, Colorado 80246\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nBoard of Directors and Shareholders\nToken Communities, Ltd.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Token Communities, Ltd. (the Company) as of June 30, 2023 and 2022, and the related consolidated statements of operations, statements of stockholders deficit, and cash flows for each of the two years then ended, and the related notes and schedules (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of June 31, 2023 and 2022, and the results of its operations and its cash flows for each of the years then ended, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the entitys management. Our responsibility is to express an opinion on these financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (\"PCAOB\") and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the entitys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nGoing Concern Uncertainty\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 1 to the financial statements, the Company has incurred losses since inception of $2,801,855. These factors create uncertainty as to the Companys ability to continue as a going concern. Managements plans in regard to these matters are also described in note 1. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nEmphasis of Matters-Risks and Uncertainties.\nThe Company is not able to predict the ultimate impact that COVID -19 will have on its business. However, if the current economic conditions continue, the pandemic could have an adverse impact on the economies and\nfinancial markets of many countries, including the geographical area in which the Company plans to operate.\n/s/ Gries & Associates, LLC\nWe have served as the Companys auditor since 2021.\nDenver, CO\nPCAOB# 6778\nOctober 13, 2023\nblaze@griesandassociates.com\n501 S. Cherry Street, Suite 1100, Denver, Colorado 80246\n(O)720-464-2875 (M)773-255-5631 (F)720-222-5846\nTOKEN COMMUNITIES LTD. AND SUBSIDIARY\nCONSOLIDATED BALANCE SHEET\nAs of June 30, 2023, and June 30, 2022\nJune 30,\nJune 30,\nASSETS\nAssets\nCurrent Assets:\nCash and equivalents\n$ 1,430\n$ 312\nDeposits receivable\n50,000\n50,000\nInventory\n46,480\n-\nTotal current assets\n97,910\n50,312\nOther assets\nTOTAL ASSETS\n$ 98,725\n$ 51,148\nLIABILITIES AND STOCKHOLDERS DEFICIT\nCurrent Liabilities:\nAccounts payable and accrued expenses\n$ 190,170\n$ 101,916\nDue to related parties\n1,520,885\n1,258,676\nTotal current liabilities\n1,711,055\n1,360,592\nSTOCKHOLDERS DEFICIT\n2,095,872,947 shares of common stock issued and outstanding, respectively\n209,587\n209,587\nAdditional paid-in capital\n1,039,610\n1,039,610\nOther comprehensive income\n(54,481 )\n(5,603 )\nAccumulated deficit\n(2,801,855 )\n(2,553,038 )\nNon-controlling interest\n(5,191 )\nTotal stockholders deficit\n(1,612,330 )\n(1,309,444 )\nTOTAL LIABILITIES AND STOCKHOLDERS DEFICIT\n$ 98,725\n$ 51,148\nThe accompanying notes are an integral part of these financial statements.\nTOKEN COMMUNITIES LTD. AND SUBSIDIARY\nCONSOLIDATED STATEMENTS OF OPERATIONS\nFOR THE YEAR ENDED JUNE 30, 2023 AND 2022\nTwelve months\nTwelve months\nended\nended\n30-Jun-23\n30-Jun-22\nREVENUES\n$ 31,937\n$ -\nOPERATING EXPENSES\nPayroll Related Expenses\n46,823\n63,891\nRent Expense\n24,565\n44,145\nAudit and Legal Fees\n98,668\n129,000\nGeneral and administrative\n115,888\n81,528\nTOTAL OPERATING EXPENSES\n285,944\n318,564\nLOSS FROM OPERATIONS\n(254,007 )\n(318,564 )\nOTHER INCOME (EXPENSES)\nGain on sale of Lukki Exchange\n-\n50,000\nTOTAL OTHER INCOME (EXPENSES)\n-\n50,000\nPROVISION FOR INCOME TAXES\n-\n-\nNET INCOME (LOSS) BEFORE NON-CONTROLLING INTEREST\n$ (254,007 )\n$ (268,564 )\nLess non-controlling interest\n(5,192 )\n-\nNET INCOME (LOSS)\n$ (248,815 )\n$ (268,564 )\nForeign exchange translation gain (loss)\n(48,878 )\n(18,323 )\nComprehensive income\n$ (297,693 )\n$ (286,887 )\nNET INCOME (LOSS) PER SHARE: BASIC AND DILUTED\n$ -\n$ -\nWEIGHTED AVERAGE NUMBER OF SHARES OUTSTANDING: BASIC AND DILUTED\n2,095,872,947\n2,095,872,947\nThe accompanying footnotes are an integral part of these financial statements.\nTOKEN COMMUNITIES LTD. AND SUBSIDIARY\nCONSOLIDATED STATEMENT OF STOCKHOLDERS EQUITY\nJUNE 30, 2023\nAdditional\nNon-\nCommon Stock\nPaid-in\nComprehensive\nAccumulated\ncontrolling\nShares\nAmount\nCapital\nincome\nDeficit\nInterest\nTotal\nBalance, June 30, 2021\n2,095,872,947\n$ 209,587\n$ 1,039,610\n$ 12,720\n$ (2,290,673 )\n$ -\n$ (1,028,756 )\nForeign currency translation gain\n-\n-\n-\n(16,491 )\n-\n-\n(16,491 )\nNet income for the period\n-\n-\n-\n-\n(160,391 )\n-\n(160,391 )\nBalance, December 31, 2021\n2,095,872,947\n$ 209,587\n$ 1,039,610\n$ (3,771 )\n$ (2,451,064 )\n$ -\n$ (1,205,638 )\nBalance, June 30, 2022\n2,095,872,947\n$ 209,587\n$ 1,039,610\n$ (5,603 )\n$ (2,553,038 )\n$ -\n$ (1,309,444 )\nForeign currency translation gain\n-\n-\n-\n(3,374 )\n-\n-\n(3,374 )\nNet income for the period\n-\n-\n-\n-\n(163,626 )\n-\n(163,626 )\nBalance, December 31, 2022\n2,095,872,947\n$ 209,587\n$ 1,039,610\n$ (8,977 )\n$ (2,716,664 )\n$ -\n$ (1,476,444 )\nForeign currency translation gain\n-\n-\n-\n61,253\n-\n-\n61,253\nNet income for the period\n-\n-\n-\n-\n(27,085 )\n(1,965 )\n(29,050 )\nBalance, March 31, 2023\n2,095,872,947\n$ 209,587\n$ 1,039,610\n$ 52,276\n$ (2,743,749 )\n$ (1,965 )\n$ (1,444,241 )\nForeign currency translation gain\n-\n-\n-\n(106,757 )\n-\n-\n(106,757 )\nNet income for the period\n-\n-\n-\n-\n(58,106 )\n(3,226 )\n(61,332 )\nBalance, June 30, 2023\n2,095,872,947\n$ 209,587\n$ 1,039,610\n$ (54,481 )\n$ (2,801,855 )\n$ (5,191 )\n$ (1,612,330 )\nThe accompanying notes are an integral part of these financial statements.\nTOKEN COMMUNITIES LTD. AND SUBSIDIARY\nCONSOLIDATED STATEMENT OF CASH FLOWS\nFOR THE TWELVE MONTHS ENDED JUNE 30, 2023 AND 2022\nJune 30,\nJune 30,\nCASH FLOWS FROM OPERATING ACTIVITIES:\nNet income (loss)\n$ (254,007 )\n$ (268,564 )\nChanges in operating assets and liabilities\nDeposits\n-\n(50,000 )\nInventory\n(46,459 )\n-\nAccounts payable and accrued expenses\n88,254\n-\nNet cash used in operating activities\n(212,212 )\n(318,564 )\nCASH FLOWS FROM INVESTING ACTIVITIES:\nPayment for other assets\n-\n-\nNet cased in investing activities\n-\n-\nCASH FLOWS FROM FINANCING ACTIVITIES:\nAdvances from related parties, net\n262,208\n336,887\nNet cash provided by financing activities\n262,208\n336,887\nEffect of exchange rate changes on cash and equivalents\n$ (48,878 )\n$ (18,323 )\nNET DECREASE IN CASH AND EQUIVALENTS\n-\n-\nCASH AND EQUIVALENTS, BEGINNING OF PERIOD\n$ 312\n$ 312\nCASH AND EQUIVALENTS, END OF PERIOD\n$ 1,430\n$ 312\nThe accompanying notes are an integral part of these financial statements.\nTOKEN COMMUNITIES LTD. AND SUBSIDIARY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 1 - ORGANIZATION AND BASIS OF PRESENTATION\nOrganization and Line of Business\nToken Communities Ltd. (the Company or Limited) was organized under the laws of the State of Delaware on March 6, 2014, under the name Pacific Media Group Enterprises, Inc. On April 7, 2017, the Company amended its Certificate of Incorporation with the Secretary of State of Delaware, changing its name to Extract Pharmaceuticals Inc. On January 26, 2018, the Board of Directors adopted an Amendment to its Certificate of Incorporation, changing its name to Token Communities Ltd.\nOn February 26, 2018, the Company entered into an Acquisition and Share Exchange Agreement with Token Communities PLC (PLC). Under the Agreement, the Companys majority shareholder returned 19,266,000 common shares to treasury, and at closing 100% of the issued and outstanding shares of PLC were acquired by the Company, for 172,800,000 newly issued common shares equal to 64% of the Companys outstanding common stock as of the closing date, thus making the stockholders of PLC the majority stockholders of the Company. The transaction closed on May 18, 2018. This transaction was accounted for as a reverse acquisition under the purchase method of accounting since PLC obtained control of Limited. Accordingly, the merger of PLC into Limited was recorded as a recapitalization of PLC, PLC being treated as the continuing entity. The transaction was treated as a recapitalization and not as a business combination. Limited had 116,466,000 shares outstanding prior to the merger. At the time of the merger, Limiteds principal stockholder surrendered 19,266,000 shares, which were cancelled. After the merger the total number of Limited shares outstanding was 270,000,000.\nPLC is a Gibraltar Financial Advisory firm which specializes in Blockchain, Artificial Intelligence and Fin-Tech investment in incubating as well as advising and managing qualified companies in the blockchain and distributed ledger technologies arena, including smart contracts, TGEs, DApps, and more. Advisement comprises the authoring of industry standard White Papers, technical aspects, design and implementation of market strategies, business appraisal and more. All potential clients are vetted and Anti-Money Laundering / Know-Your-Customer approved. The Company is also developing its own software technology with its dedicated team of developers.\nThe historical financial statements presented are the financial statements of PLC. The Acquisition and Share Exchange Agreement was treated as a recapitalization and not as a business combination; therefore, no pro forma information is disclosed. At the date of the merger, the net liabilities of the legal acquirer, Limited, were $57,107.\nThe Company is a development stage company that presently markets and sells naturopathic supplements in China, and previously researched and created white paper analysis for companies regarding block chain technology.\nOn May 28, 2020, the Company acquired 3.5 billion iRide tokens in exchange for 80 million shares provided to iRide.io Tech Pte., Ltd., valued at $8,000, which was immediately expensed.\nOn July 14, 2020, a change in control of the Company was affected by a privately held corporation ( controlled by two individuals) acquiring 83% of the outstanding stock from other control individuals. As part of this transaction, the Company transferred the 3.5 billion iRide tokens and 1,745,406 shares of its common stock to American Software in exchange for all technology, software codes and other intelligent products of the Lukki Exchange, a non-operating cyber coin exchange. Since the Lukki exchange had no previous material revenue nor assets, the acquisition has been accounted for as an asset acquisition and due to the facts that it has no value, and the parties to this transaction are related, the transaction has been accounted for as $(0), the value of the tokens are $(0), and no financial statements are being provided as part of the transaction.\nAs a condition to the closing of the transactions contemplated in the Asset Purchase Agreement shareholders agreed to cancel an aggregate of 174,540,600 shares of Common Stock of the Company, and the holders of the Companys Series A, B, C, D and E warrants agreed to the cancellation of all such warrants.\nOn April 25, 2022 the Company closed on the sale of the Lukki Exchange and related Lukki tokens in exchange for Fifty Thousand Dollars. This consideration has not been received by the Company and has been reflected under Accounts Receivable heading in the Consolidated Balance Sheet. There are no terms for payment of this amount. This was due to the Chinese governments restrictions on foreign cryptocurrencies. Given this the Company has remained in the advisory and consulting or companies regarding block chain technology and has maintained a remote staff in China to conduct research and development on naturopathic medicine.\nOn January 10, 2023 the Company entered into a Stock Purchase Agreement with Elements of Health and Wellness, Inc., a company incorporated in the Florida (Elements) whereby the Company acquired ninety shares of common stock of Elements (which represents ninety percent of the outstanding shares of common stock of Elements) in exchange for the issuance of a promissory note in the principal amount of Two Hundred Twenty Five Thousand Dollars ($225,000) (the Note). The Note provides for a term of five years and bears interest at a rate of three percent per annum. The transactions set forth above closed on January 10, 2023. As a result of the closing of transaction set forth above, Elements has become a subsidiary of the Company and the Company has expanded its business operations into the health and wellness sector.\nThe combined entities are referred to hereafter as the Company.\nBasis of Presentation\nThe accompanying consolidated financial statements (CFS) were prepared in conformity with accounting principles generally accepted in the United States (U.S. GAAP). Limiteds functional currency is the United States Dollars ($ or USD) and Limiteds wholly-owned subsidiary, PLCs functional currency is the Pound Sterling (GBP).\nGoing Concern\nThe accompanying CFS were prepared in conformity with U.S. GAAP, which contemplates the continuation of the Company as a going concern. The Company had a stockholders deficit of $1,612,330 at June 30, 2023 and has incurred losses from operations since inception and expects to continue to generate operating losses and negative cash flows for the foreseeable future. These factors raise substantial doubt about the Companys ability to continue as a going concern. The continued operations of the Company are dependent upon its ability to raise additional capital, obtain additional financing and/or acquire or develop a business that generates sufficient positive cash flows from operations.\nThe accompanying CFS do not include any adjustments relating to the recoverability and classification of recorded assets, or the amounts and classification of liabilities that might be necessary in the event the Company cannot continue as a going concern.\nForeign Currency Translation\nThe accounts of Limited are maintained in USD and the accounts of PLC are maintained in GBP. The accounts of PLC are translated into USD in accordance with Financial Accounting Standards Board (FASB) Accounting Standards Codification (ASC) Topic 830 Foreign Currency Transaction , with the GBP as the functional currency. According to Topic 830, all assets and liabilities are translated at the exchange rate on the balance sheet date, stockholders equity is translated at historical rates and statement of operations items are translated at the weighted average exchange rate for the period. The resulting translation adjustments are reported under other comprehensive income (loss) in accordance with ASC Topic 220, Comprehensive Income. Gains and losses resulting from the translations of foreign currency transactions and balances are reflected in the statement of operations and comprehensive income (loss). The following table details the exchange rates used for the periods.\nJune 30, 2023\nJune 30, 2022\nPeriod end: GBP to USD exchange rate\n$ 1.270841\n$ 1.210000\nAverage period: GBP to USD exchange rate\n$ N/A\n$ 1.300000\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nUse of Estimates\nThe preparation of CFS in conformity with U.S. GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the CFS and the reported amounts of revenues and expenses during the reporting period. The Company regularly evaluates estimates and assumptions. The Company bases its estimates and assumptions on current facts, historical experience and various other factors that it believes to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities and the accrual of costs and expenses that are not readily apparent from other sources. The actual results experienced by the Company may differ materially and adversely from the Companys estimates. To the extent there are material differences between the estimates and the actual results, future results of operations will be affected.\nPrinciples of Consolidation\nThe accompanying CFS include the accounts of Limited, its wholly owned subsidiary PLC and its majority owned subsidiary Elements. All significant intercompany transactions and balances were eliminated in consolidation.\nCash Equivalents\nFor the purpose of the statement of cash flows, cash equivalents include time deposits, certificate of deposits, and all highly liquid debt instruments with original maturities of three months or less.\nAccounts Receivable\nAccounts receivable are recorded, net of allowance for doubtful accounts and sales returns. Management reviews the composition of accounts receivable and analyzes historical bad debts, customer concentration, customer credit worthiness, current economic trends and changes in customer payment patterns to determine if the allowance for doubtful accounts is adequate. An estimate for doubtful accounts is made when collection of the full amount is no longer probable. Delinquent account balances are written-off after management has determined that the likelihood of collection is not probable and known bad debts are written off against the allowance for doubtful accounts when identified. As of June 30, 2023 and 2022, the allowance for uncollectible accounts receivable was zero, respectively.\nFair Value of Financial Instruments\nFor certain of the Companys financial instruments, including cash and equivalents, accounts receivable, accounts payable, trust liability and advances, the carrying amounts approximate their fair values due to their short maturities.\nFASB ASC Topic 820, Fair Value Measurements and Disclosures, requires disclosure of the fair value (FV) of financial instruments held by the Company. FASB ASC Topic 825, Financial Instruments, defines FV, and establishes a three-level valuation hierarchy for disclosures of FV measurement that enhances disclosure requirements for FV measures. The carrying amounts reported in the consolidated balance sheets for receivables and current liabilities each qualify as financial instruments and are a reasonable estimate of their FVs because of the short period of time between the origination of such instruments and their expected realization and their current market rate of interest. The three levels of valuation hierarchy are defined as follows:\n·\nLevel 1 inputs to the valuation methodology are quoted prices for identical assets or liabilities in active markets.\n·\nLevel 2 inputs to the valuation methodology include quoted prices for similar assets and liabilities in active markets, quoted prices for identical or similar assets in inactive markets, and inputs that are observable for the asset or liability, either directly or indirectly, for substantially the full term of the financial instrument.\n·\nLevel 3 inputs to the valuation methodology use one or more unobservable inputs which are significant to the FV measurement.\nThe Company analyzes all financial instruments with features of both liabilities and equity under FASB ASC Topic 480, Distinguishing Liabilities from Equity, and FASB ASC Topic 815, Derivatives and Hedging.\nThe Company uses Level 2 inputs for its valuation methodology for derivative liabilities as their fair values were determined by using the Black-Scholes-Merton pricing model based on various assumptions. The Companys derivative liabilities are adjusted to reflect FV at each period end, with any increase or decrease in the FV being recorded in the results of operations as adjustments to fair value of derivatives.\nRevenue Recognition\nASU No. 2014-09, Revenue from Contracts with Customers (Topic 606), became effective for the Company on July 1, 2018. The Companys revenue recognition disclosure reflects its updated accounting policies that are affected by this new standard. The Company applied the modified retrospective transition method for open contracts for the implementation of Topic 606. As sales are and have been primarily from advisory fees and related services, and the Company has no significant post-delivery obligations, this did not result in a material recognition of revenue on our accompanying CFS for the cumulative impact of applying this new standard. The Company made no adjustments to its previously reported total revenues, as those periods continue to be presented in accordance with its historical accounting practices under Topic 605, Revenue Recognition.\nRevenue from advisory fees and related services are recognized under Topic 606 in a manner that reasonably reflects the delivery of services to customers in return for expected consideration and includes the following elements:\n·\nexecuted contract(s) with our customer(s) that we believe is legally enforceable;\n·\nidentification of performance obligation in the respective contract;\n·\ndetermination of the transaction price for each performance obligation in the respective contract;\n·\nallocation of the transaction price to each performance obligation; and\n·\nrecognition of revenue only when the Company satisfies each performance obligation.\nThese five elements, as applied to the Companys revenue category, are summarized below:\n·\nAdvisory fees and related services - the Company charges advisory fees for a suite of one to two dozen services that include advising on where to establish a corporation, establishing the corporation (often Gibraltar or Malta), writing white paper, setting up website, making videos or animations describing the company and its business, engaging in public relations, and introducing potential investors.\n·\nNaturopathic supplements.\nIncome Taxes\nThe Company accounts for income taxes in accordance with ASC Topic 740, Income Taxes. ASC 740 requires a company to use the asset and liability method of accounting for income taxes, whereby deferred tax assets are recognized for deductible temporary differences, and deferred tax liabilities are recognized for taxable temporary differences. Temporary differences are the differences between the reported amounts of assets and liabilities and their tax bases. Deferred tax assets are reduced by a valuation allowance when, in the opinion of management, it is more likely than not that some portion, or all of, the deferred tax assets will not be realized. Deferred tax assets and liabilities are adjusted for the effects of changes in tax laws and rates on the date of enactment.\nUnder ASC 740, a tax position is recognized as a benefit only if it is more likely than not that the tax position would be sustained in a tax examination, with a tax examination being presumed to occur. The amount recognized is the largest amount of tax benefit that is greater than 50% likely of being realized on examination. For tax positions not meeting the more likely than not test, no tax benefit is recorded. The Company has no material uncertain tax positions for any of the reporting periods presented.\nBasic and Diluted Earnings (loss) Per Share\nEarnings per share is calculated in accordance with ASC Topic 260, Earnings Per Share. Basic earnings per share (EPS) is based on the weighted average number of common shares outstanding. Diluted EPS is based on the assumption that all dilutive securities are converted. Dilution is computed by applying the treasury stock method. Under this method, options and warrants are assumed to be exercised at the beginning of the period (or at the time of issuance, if later), and as if funds obtained thereby were used to purchase common stock at the average market price during the period. There were no potentially dilutive securities outstanding during any of the periods presented in these financial statements.\nForeign Currency Transactions and Comprehensive Income\nU.S. GAAP generally requires recognized revenue, expenses, gains and losses be included in net income. Certain statements, however, require entities to report specific changes in assets and liabilities, such as gain or loss on foreign currency translation, as a separate component of the equity section of the balance sheet. Such items, along with net income, are components of comprehensive income. The functional currency of the Companys subsidiary is the GBP. Translation loss of $54,481 at June 30, 2023 is classified as an item of other comprehensive income in the stockholders deficit section of the balance sheet.\nStatement of Cash Flows\nCash flows from the Companys operations are calculated based upon the local currencies using the average translation rates. As a result, amounts related to assets and liabilities reported on the statements of cash flows will not necessarily agree with changes in the corresponding balances on the balance sheets.\nRecent Accounting Pronouncements\nManagement does not believe that any recently issued, but not yet effective, accounting standards could have a material effect on the accompanying CFS. As new accounting pronouncements are issued, we will adopt those that are applicable under the circumstances.\nNOTE 3 - ACCOUNTS PAYABLE AND ACCRUED EXPENSES\nAccrued expenses payable consisted of the following at June 30, 2023 and June 30, 2022:\nJune 30, 2023\nJune 30, 2022\nAccrued professional services\n31,000\n31,000\nOther\n159,170\n70,916\nTotal Accrued Expenses\n$ 190,170\n$ 101,916\nNOTE 4 - STOCKHOLDERS EQUITY\nAs of June 30, 2023, the authorized share capital of the Company consists of 5,000,000,000 shares of common and 20,000,000 shares of preferred stock with $0.0001 par value. Each outstanding share of common stock entitles the holder to one vote per share on all matters submitted to a stockholder vote. All shares of common stock are non-assessable and non-cumulative, with no pre-emptive rights.\nNOTE 5 - RELATED PARTY TRANSACTIONS\nAmounts due to a related party are for advances made by a stockholder of the Company. The balance due of $1,520,885 and $1,258,676 as of June 30, 2023 and June 30, 2022 respectively, is presented as due to related parties in the accompanying consolidated balance sheet. The amounts due are non-interest bearing and payable upon demand.\nNOTE 6 - COMMITMENTS AND CONTINGENCIES\nThe Company is party to certain legal proceedings from time to time incidental to the conduct of its business. These proceedings could result in fines, penalties, compensatory or treble damages or non-monetary relief. The nature of legal proceedings is such that the Company cannot assure the outcome of any particular matter, and an unfavorable ruling or development could have a materially adverse effect on the Companys CFS in the period in which a ruling or settlement occurs. However, based on information available to the Companys management to date, the Companys management does not expect the outcome of any matter pending against the Company is likely to have a material effect on the Companys CFS.\nNOTE 7 - SUBSEQUENT EVENTS\nIn accordance with ASC Topic 855-10, the Company analyzed its operations subsequent to June 30, 2023 to the date these financial statements were prepared. The Company has determined there are no reportable subsequent events. Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure.\nNone. Item 9A. Controls and Procedures.\nEvaluation of Disclosure Controls and Procedures\nWe have performed an evaluation under the supervision and with the participation of our management, including our President, and our Chief Executive Officer (CEO) and Chief Financial Officer (CFO), of the effectiveness of our disclosure controls and procedures, (as defined in Rules 13a-15(e) and 15d-15(e) under the Exchange Act) as of June 30, 2023. Based on that evaluation, our management, including our Chief Executive Officer (CEO) and CFO, concluded that our disclosure controls and procedures were not effective as of June 30, 2023 to provide reasonable assurance that information required to be disclosed by us in the reports filed or submitted by us under the Exchange Act is (i) recorded, processed, summarized and reported within the time periods specified in the SECs rules and forms and (ii) accumulated and communicated to our management, including our principal executive officer, as appropriate to allow timely decisions regarding required disclosure due to the material weaknesses described below.\nBased on our evaluation under the framework described above, our management concluded that we had material weaknesses (as such term is defined below) in our control environment and financial reporting process consisting of the following as of the Evaluation Date:\n1)\nlack of a functioning audit committee resulting in ineffective oversight in the establishment and monitoring of required internal control and procedures; and\n2)\ninadequate segregation of duties consistent with control objectives.\nA material weakness is defined under SEC rules as a deficiency, or a combination of deficiencies, in internal control over financial reporting such that there is a reasonable possibility that a material misstatement of a companys annual or interim financial statements will not be prevented or detected on a timely basis by the companys internal controls.\nA system of controls, no matter how well designed and operated, cannot provide absolute assurance that the objectives of the system of controls are met, and no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, within a company have been detected.\nManagements Annual Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Exchange Act Rule 13a-15(f). Under the supervision and with the participation of our management, including our principal executive officer and principal financial officer, we conducted an evaluation of the effectiveness of our internal control over financial reporting based on criteria established in Internal Control - Integrated Framework (2013) issued by COSO. Internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles and includes those policies and procedures that (a) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the Company; (b) provide reasonable assurance that transactions are recorded as necessary to permit the preparation of financial statements in accordance with generally accepted accounting principles and that receipts and expenditures of the Company are being made only in accordance with authorizations of the our management and directors; and (c) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of the Companys assets that could have a material effect on the financial statements. Item 9B. Other Information.\nNone.\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections.\nNone.\nPART III Item 10. Directors, Executive Officers and Corporate Governance.\nThe names, positions, terms, and periods served of the Companys directors as of June 30, 2023 are set forth in the following table:\nName\nPositions\nPeriod of Service\nDavid Chen\nChairman of the Board/CEO/President/Interim CFO\n7/14/2020-Present\nPeter Yaugh Chen\nDirector/CFO\n7/14/2020-8/2/2023*\nXiangru Lin\nDirector\n7/14/2020-Present\nPeter Maddocks\nDirector\n4/10/2017-10/21/2022**\n* Peter Yaugh Chen resigned as Chief Financial Officer and Director of the Company on August 2, 2023.\n** Peter Maddocks resigned as a Director of the Company on October 21, 2023.\nThere are no agreements with respect to electing directors. The Board of Directors appoints officers annually and each executive officer serves at the discretion of the Board of Directors. The Company does not have any standing committees at this time, and due to its small size does not believe that committees are necessary at this time. The Companys entire Board fulfills the duties of an audit committee. Except as set forth below, none of the directors held any directorships during the past five years in any company with a class of securities registered pursuant to Section 12 of the Exchange Act or subject to the requirements of Section 15(d) of such act, or of any company registered as an investment company under the Investment Company Act of 1940. The Board of Directors has not adopted a Code of Ethics that applies to the registrants principal executive officer, principal financial officer, principal accounting officer or controller, or persons performing similar functions.\nDirector and Officer Biographical Information\nDavid Chen - Chairman of the Board/CEO/President/Interim Chief Financial Officer\nDavid Chen has served as Chief Operating Officer of XT Energy Group, Inc. from July 2018 to March 2020. He has served as Executive Director, President and Chief Executive Officer of ASC, since July 2017, as Executive Director of Asia Pacific at Federal Aerospace Holdings Group, a general aviation development company since September 2015, as President of Sino Tech Jiu-Ding Energy Development Co., Ltd., a shale oil technology company, since May 2016, and as President of Inner Mongolia Aero Motor Group, a low-speed electric vehicle manufacturing company, since December 2017. He previously served as President of American Franchise Development Group from May 1998 to March 2008, and as Property Claims Manager at Transtate Insurance Company, a New York State Property & Casualty Insurer from June 1991 to July 1998. Mr. Chen received a masters degree in Asian Studies from St. Johns University and an Executive degree in business administration from Tuck School of Business at Dartmouth. Mr. Chen obtained his bachelors degree in computer science from Southern Connecticut State University. Mr. Chen has received numerous awards for his business achievement, such as Minority Retailer of the Year in 2006 by U.S. Department of Commerce, Minority Business Development Agency, Overseas Chinese Model Businessman of the Year in 2006 by Republic of China (Taiwan), Businessman of the Year in 2007 by National Republican Congressional Committee Business Advisory Committee.\nXiangru Lin - Director\nXiangru Lin served as the Chief Financial Officer of Federal Aerospace Holdings Group from 2017 to 2019, and as the Comptroller of Aero Motors Group from 2017 to 2019. She is also the Chairwoman of Hainan Softbank Stem Cell Company in Boao, Hainan. Presently she is the Chief Operating Officer and a Director of ASC. Xiangru Lin attended St. Johns University in New York in 2019 (a certificate program), she graduated from Zhengzhou University in 2010.\nInvolvement in Certain Legal Proceedings\nTo the best of our knowledge, none of our directors or executive officers has, during the past ten years:\n(1) had a petition under the Federal bankruptcy laws or any state insolvency law filed by or against, or a receiver, fiscal agent or similar officer was appointed by a court for the business or property of such person, or any partnership in which he was a general partner at or within two years before the time of such filing, or any corporation or business association of which he was an executive officer at or within two years before the time of such filing;\n(2) has been convicted in a criminal proceeding or is a named subject of a pending criminal proceeding (excluding traffic violations and other minor offenses);\n(3) has been the subject of any order, judgment, or decree, not subsequently reversed, suspended or vacated, of any court of competent jurisdiction, permanently or temporarily enjoining him from, or otherwise limiting, the following activities:\n(i) Acting as a futures commission merchant, introducing broker, commodity trading advisor, commodity pool operator, floor broker, leverage transaction merchant, any other person regulated by the Commodity Futures Trading Commission, or an associated person of any of the foregoing, or as an investment adviser, underwriter, broker or dealer in securities, or as an affiliated person, director or employee of any investment company, bank, savings and loan association or insurance company, or engaging in or continuing any conduct or practice in connection with such activity;\n(ii) Engaging in any type of business practice; or\n(iii) Engaging in any activity in connection with the purchase or sale of any security or commodity or in connection with any violation of Federal or State securities laws or Federal commodities laws;\n(4) has been the subject of any order, judgment or decree, not subsequently reversed, suspended or vacated, of any Federal or State authority barring, suspending or otherwise limiting for more than 60 days the right of such person to engage in any activity described in (3)(i) above, or to be associated with persons engaged in any such activity;\n(5) has been found by a court of competent jurisdiction in a civil action or by the Commission to have violated any Federal or State securities law, and the judgment in such civil action or finding by the Commission has not been subsequently reversed, suspended, or vacated;\n(6) has been found by a court of competent jurisdiction in a civil action or by the Commodity Futures Trading Commission to have violated any Federal commodities law, and the judgment in such civil action or finding by the Commodity Futures Trading Commission has not been subsequently reversed, suspended or vacated;\n(7) has been the subject of, or a party to, any Federal or State judicial or administrative order, judgment, decree, or finding, not subsequently reversed, suspended or vacated, relating to an alleged violation of:\n(i) Any Federal or State securities or commodities law or regulation; or\n(ii) Any law or regulation respecting financial institutions or insurance companies including, but not limited to, a temporary or permanent injunction, order of disgorgement or restitution, civil money penalty or temporary or permanent cease-and-desist order, or removal or prohibition order; or\n(iii) Any law or regulation prohibiting mail or wire fraud or fraud in connection with any business entity; or\n(8) has been the subject of, or a party to, any sanction or order, not subsequently reversed, suspended or vacated, of any self-regulatory organization (as defined in Section 3(a)(26) of the Exchange Act (15 U.S.C. 78c(a)(26))), any registered entity (as defined in Section 1(a)(29) of the Commodity Exchange Act (7 U.S.C. 1(a)(29))), or any equivalent exchange, association, entity or organization that has disciplinary authority over its members or persons associated with a member.\nSection 16(a) Beneficial Ownership Reporting Compliance\nSection 16(a) of the Exchange Act requires our directors and officers, and the persons who beneficially own more than ten percent of our common stock, to file reports of ownership and changes in ownership with the Securities and Exchange Commission. Copies of all filed reports are required to be furnished to us pursuant to Rule 16a-3 promulgated under the Exchange Act. Based solely on the reports received by us and on the representations of the reporting persons, we believe that these persons have complied with all applicable filing requirements during the fiscal year ended June 30, 2023, with the exception of the following reports.\nReporting Person\nForm Type\nDavid Chen\nPeter Yaugh Chen\nXiangru Lin Item 11. Executive Compensation.\nThe following table sets forth, for the fiscal years ended June 30, 2023 and June 30, 2022, certain information regarding the compensation earned by the Companys named executive officers.\nSummary Compensation Table\nName and Principal Position\nYear\nSalary\n($)\nBonus\n($)\nStock\nAwards\n($)\nOption\nAwards\n($)\nNon-Equity\nIncentive\nPlan\nCompensation\n($)\nNon-Qualified\nDeferred\nCompensation\nEarnings\n($)\nAll Other\nCompensation\n($)\nTotal\n($)\nDavid Chen,\n$ 12,000\n-\n-\n-\n-\n-\n-\n$ 12,000\nCEO, Director (1)\n$ -\n-\n-\n-\n-\n-\n-\n$ 0\nPeter Yaugh Chen,\n$ -\n-\n-\n-\n-\n-\n$ 0\nCFO, Director (2)\n$ -\n-\n-\n-\n-\n-\n$ 0\nPeter Maddocks,\n$ -\n-\n-\n-\n-\n-\n-\n$ 0\nDirector (3)\n$ -\n-\n-\n-\n-\n-\n-\n$ 0\nXiangru Lin,\n$ 10,000\n-\n-\n-\n-\n-\n-\n$ 10,000\nDirector (4)\n$ -\n-\n-\n-\n-\n-\n-\n$ 0\n(1)\nDavid Chen was named Chairman, CEO and President July 14, 2020.\n(2)\nPeter Yaugh Chen resigned as Director and CFO on August 2, 2023.\n(3)\nPeter Maddocks was resigned as director on October 21, 2022.\n(4)\nXiangru Lin was named director July 14, 2020.\nDirector Compensation\nDirectors do not receive compensation for serving as a Director of the Company.\nEmployment Agreements\nThe Company does not have any written agreements with any of its executive officers.\nOverview of Compensation Program\nWe currently do not maintain a Compensation Committee of the Board of Directors. Until a formal committee is established, our entire Board of Directors has responsibility for establishing, implementing and continually monitoring adherence with the Companys compensation philosophy. The Board of Directors ensures that the total compensation paid to the executives is fair, reasonable, and competitive.\nCompensation Philosophy and Objectives\nThe Board of Directors believes that the most effective executive compensation program is one that is designed to reward the achievement of specific annual, long-term and strategic goals by the Company and that aligns executives interests with those of the stockholders by rewarding performance above established goals, with the ultimate objective of improving stockholder value. As a result of the size of the Company, the Board evaluates both performance and compensation on an informal basis. Upon hiring additional executives, the Board intends to establish a Compensation Committee to evaluate both performance and compensation to ensure that the Company maintains its ability to attract and retain superior employees in key positions and that compensation provided to key employees remains competitive relative.\nRole of Executive Officers In Compensation Decisions\nThe Board of Directors makes all compensation decisions for, and approves recommendations regarding equity awards to, the executive officers and directors of the Company. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nThe following table sets forth, as of June 30, 2023, certain information concerning the beneficial ownership of our capital stock, including our common stock by:\n●\neach stockholder known by us to own beneficially 5% or more of any class of our outstanding stock;\n●\neach director;\n●\neach named executive officer;\n●\nall of our executive officers and directors as a group; and\n●\neach person, or group of affiliated persons, who is known by us to beneficially own more than 5% of any class of our outstanding stock.\nAs of June 30, 2023, the Company had authorized 5,000,000,000 shares of common stock and 20,000,000 shares of Preferred Stock. There were 2,095,671,162 shares of common stock and 0 shares of Preferred Stock outstanding as of June 30, 2023.\nBeneficial ownership is determined in accordance with the rules and regulations of the SEC and includes voting or investment power with respect to our common stock. Shares of our common stock subject to options that are currently exercisable or exercisable within 60 days of June 30, 2023 are considered outstanding and beneficially owned by the person holding the options for the purpose of calculating the percentage ownership of that person but not for the purpose of calculating the percentage ownership of any other person. Except as otherwise noted, we believe the persons and entities in this table have sole voting and investing power with respect to all of the shares of our common stock beneficially owned by them, subject to community property laws, where applicable.\nSecurity Ownership of Management\nTitle of Class\nName and\nAddress of\nBeneficial\nOwner\nAmount and\nnature of\nbeneficial\nownership\nPercent of\nClass\nCommon Stock\nDavid Chen\n1,745,000,585 (1)\n83.267 %\nPeter Yaugh Chen\nXiangru Lin\nPeter Maddocks\n56,634,000 (2)\nExecutive Officers and Directors as a Group\n1,801,634,585\n86 %\n(1)\nShares are held in the name American Software Capital Inc., and entity of which David Chen is the President.\n(2)\nIncludes 52,434,000 shares of Common Stock held in Golden Square Equity Partners Limited.\nStock Option Plan and other Employee Benefits Plans\nThe Company does not maintain a Stock Option Plan or other Employee Benefit Plans. Item 13. Certain Relationships and Related Transactions, and Director Independence.\nTransactions with Related Persons\nAmounts due to a related party are for advances made by stockholders of the Company. The balance due of $1,520,885 and $1,258,676 as at June 30, 2023 and 2022, respectively, is presented as due to related parties in the accompanying consolidated balance sheet. The amounts due are non-interest bearing and payable upon demand.\nPromoters and Certain Control Persons\nNone.\nList of Parents\nNone.\nDirector Independence\nThe Company has two independent directors. Item 14. Principal Accounting Fees and Services.\nPrincipal Accounting Fees & Services\nAudit Fees\n$ 22,500\n$ 22,500\nAudit Related Fees\n-\n-\nTax Fees\n-\n-\nAll Other Fees\n9,000\n9,000\nTotal Fees\n$ 31,500\n$ 31,500\nAudit Fees\nThese amounts consisted of the aggregate fees billed for each of the last two fiscal years for professional services rendered by the principal accountant for the audit of the Companys annual financial statements and review of financial statements included in the Companys Form 10-Q or services that are normally provided by the accountant in connection with statutory and regulatory filings or engagements for those fiscal years.\nAudit-Related Fees\nThese amounts consisted of the aggregate fees billed for each of the last two fiscal years for assurance and related services that are reasonably related to the performance of the audit or review of the Companys consolidated financial statements and are not reported under Audit Fees. These fees were for professional services incurred in connection with accounting consultations and consultation regarding financial accounting and reporting standards.\nTax Fees\nThese amounts consisted of the aggregate fees billed for each of the last two fiscal years for tax services including tax compliance and the preparation of tax returns and tax consultation services. There were no such services by our principal accountant in 2023 or 2022.\nAll Other Fees\nThese amounts consisted of the aggregate fees billed in each of the last two fiscal years for products and services provided by the principal accountant, other than the services reported above. There were no such services by our principal accountant in 2023 or 2022.\nPART IV Item 15. Exhibits and Financial Schedules\n(a)(1) Index to Consolidated Financial Statements\nThe Financial Statements listed in the Index to Consolidated Financial Statements are filed as part of this Annual Report on Form 10-K. See Part II, Item 8, Financial Statement and Supplementary Data.\n(a)(2) Financial Statement Schedules\nOther financial statement schedules for the years ended June 30, 2023 and 2022 have been omitted since they are either not required, not applicable, or the information is otherwise included in the consolidated financial statements or the notes to consolidated financial statements.\n(a)(3) Exhibits\nThe Exhibits listed in the accompanying Exhibit Index are attached and incorporated herein by reference and filed as part of this report.\nItem 16. Form 10-K Summary\nNone.\nExhibit\nNumber\nName of Exhibit\n31.1\nCertification of Chief Executive Officer, pursuant to Rule 13a-14(a) of the Exchange Act, as enacted by Section 302 of the Sarbanes-Oxley Act of 2002. (1)\n31.2\nCertification of Chief Financial Officer, pursuant to Rule 13a-14(a) of the Exchange Act, as enacted by Section 302 of the Sarbanes-Oxley Act of 2002. (1)\n32.1\nCertification of Chief Executive Officer and Chief Financial Officer, pursuant to 18 United States Code Section 1350, as enacted by Section 906 of the Sarbanes-Oxley Act of 2002. (1)\n101.INS\nInline XBRL Instance Document.\n101.SCH\nInline XBRL Taxonomy Extension Schema Document.\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document.\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document.\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document.\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document.\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101).\n(1)\nFiled herewith. In accordance with Item 601(b)(32)(ii) of Regulation S-K and SEC Release No. 34-47986, the certifications furnished in Exhibits 31.1, 31.2 and 31.2 hereto are deemed to accompany this Form 10-Q and will not be deemed filed for purposes of Section 18 of the Exchange Act or deemed to be incorporated by reference into any filing under the Exchange Act or the Securities Act except to the extent that the registrant specifically incorporates it by reference.\nSIGNATURES\nIn accordance with Section 13 or 15(d) of the Exchange Act, the registrant caused this amended report on Form 10-K to be signed on its behalf by the undersigned, thereunto duly authorized.\nTOKEN COMMUNITIES LTD.\nDated: October 13, 2023\nBy:\n/s/ David Chen\nDavid Chen\nChief Executive Officer, Director\nDated: October 13, 2023\nBy:\n/s/ Xiangru Lin\nXiangru Lin\nDirector"
}