{
    "cik": "1683131",
    "company": "Forza Innovations Inc",
    "filing_type": "10-K",
    "filing_date": "2022-10-13",
    "period_of_report": "2022-06-30",
    "sic": "3442",
    "state_of_inc": "WY",
    "state_location": "CA",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1683131/0001607062-22-000621-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1683131/000160706222000621/forz063022form10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1683131/0001607062-22-000621.txt",
    "filename": "1683131_10K_2022_0001607062-22-000621.htm",
    "content": "ITEM 1. BUSINESS\nWe were incorporated on December 9, 2014 in the state of Florida. On February 17, 2021, we filed Articles of Continuance with the Secretary of State for the state of Wyoming. Accordingly, we transferred our state of formation from Florida to Wyoming and became a Wyoming entity and are now subject to the provisions of the Wyoming Business Corporation Act.\nWe are in the health-tech wearable performance business. We have acquired the ownership and rights to certain late developmental stage products, including the WarmUp product line which is comprised of the J4 Sport, J4 X and J4 Fitbelt. These products are wearable back compression devices, used to relax, warmup, loosen, or relax stiff & sore muscles. The therapeutic application of heat causes a change in temperature of the soft tissues which decreases joint stiffness and relieves inflammation.\nWe have recently successfully completed our first acquisition of Sustainable Origins which is an eco-friendly ESG company, that converts used cooking oil to reusable biodiesel. This acquisition is part of our ongoing strategic plan for future revenue and expansion. While our primary focus will always be revolving around the innovation of wearable technology, these projects will take time to market. We want to align ourselves with like-minded Entrepreneurs that will mesh well with our team and collective interest. Having the ability to acquire companies current operations to generate steady revenue streams, will also help aid in financing the production of WarmUp and other products we will develop.\nProducts and Services\nAs at June 30, 2022, we have developed the WarmUp series product line designed as WarmUp. It is a cutting edge, innovative, wearable back compression device, used to relax, WarmUp, loosen, or relax stiff & sore muscles. The therapeutic application of heat causes a change in temperature of the soft tissues which decreases joint stiffness and relieves inflammation. When combined with the strategic placement of our medical grade support ribs & ergonomic design, WarmUps Thermal Therapy is unmatched. Warmup was originally designed to help aid marquee Pro Athletes perform at their best. However, the WarmUp Series will be for everyone. Ideal for a chilly day on the links, Ski/Snowboarding, Hunter/Fishers, Outdoor work force, Medical, Military, & everything in between!\nThe product line utilizes a low-cost technology that has multi-functional use servicing all kinds of people, ranging from marquee pro athletes. WarmUp is a low cost, yet highly efficient, multi-use heating technology. WarmUp uses next gen, carbon micro fibers combined with powerful, safe rechargeable Lithium Batteries.\nThe cutting-edge, technical, innovative, and wearable back compression devices are used to warmup, loosen, or relax stiff and sore muscles. Our technology is designed to maximize the benefits of strategically applying heat to your target areas of pain, providing fast relief.\nOur WarmUp product line currently consists of the following three products:\nJ4 Core\nThe Original. Sleek ergonomic design that you can wear while playing, recovering, or performing daily activities at work, home or on the road.\nJ4 Sport\nof 1 Dual Zone Patent Pending Heating Tech. Undergoing Class 1 Medical Device Evaluation From FDA.\nIdeal for patients with Chronic Back Pain Conditions such as Arthritis, Osteoporosis, Fibromyalgia, & Ligament strains.\nJ4 X\nFitbelt is an innovative, high intensity, core toning wearable. Powered by a new EMS nano tech unfamiliar to all current products on the market. FitBelt has dual functionality, so the user can choose to target both the abdominal and lower back muscles or just one of the muscle groups.\nBuilt-in LED interface with pre-programed settings that targets specific muscle types by adjusting the frequencies, which can all be controlled via Bluetooth through your phone.\nWhether looking for a tool to boost your fitness and strength or recover from an injury quickly, electric muscle stimulation (EMS) can help you achieve your goal.\nSales & Marketing\nAs at June 30, 2022, we are actively working with current and former professional athletes who are not only using the product, but investing its future success. It is no secret that athlete endorsement is both tried and tested marketing strategy to appeal to the masses. Our athlete ambassadors and investors will actively leverage their social media profiles to promote the product Online. With tens of millions combined followers between them, the opportunities for exponential growth are pronounced.\nCustomers\nAs at June 30, 2022 we are in developmental stages and do not have any customers. However, our subsidiary Sustainable Origins has approximately 25 customers.\nCompetition\nWe face competition in the health-tech wearable performance business markets. Most of our competitors are larger and have greater financial resources. We compete on the basis of price, technological expertise, manufacturing know-how and the quality of our products.\nSome of our closest competitors are as follows: Venom by Hyperice, Powerdot 2.0, Comped Waist Trainer and SlenderTone Waist Trainer.\nWe face direct competition from companies with far greater financial, technological, manufacturing and personnel resources. Competition is primarily based on product quality, service, timely delivery, and price.\nResearch and Development; Intellectual Property\nAs at June 30, 2022, we are developing proprietary technologies that will give us an edge in competing with its competitors. We are in the process of filing patents to protect our IP. We will file utility, design, full spectrum patents on the created IP. We will also register eligible products as Medical Devices so patients with chronic pain can get the product free through insurance. We have engaged a patent attorney and are in the process of filing a provisional patent on our second generation line of WarmUp products.\nSuppliers\nAs at June 30, 2022, we currently have developed beta samples in China that have patentable IP.\nEmployees\nAs at June 30, 2022, we had 7 employees and our wholly-owned subsidiary Sustainable Origins had 2 employees.\nForeign and Domestic Operations and Export Sales\nAs at June 30, 2022, we had no operations or any significant sales in any foreign country.\nGovernment Regulation\nOur operations are subject to certain foreign, federal, state and local regulatory requirements relating to, among others, environmental, waste management, labor and health and safety matters. As at June 30, 2022, management believes that our business is operated in material compliance with all such regulations. ITEM 1A. RISK FACTORS\nNot required for smaller reporting companies. ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone ITEM 2. PROPERTIES\nAs of June 30, 2022, our office was located 406 9th Avenue, Suite 210, San Diego, California 92101. Our current office is approximately 2,365 square feet and we currently pay rent in the amount of $5,913 per month. We believe this space is adequate for our current needs. ITEM 3. LEGAL PROCEEDINGS\nNone ITEM 4. MINE SAFETY DISCLOSURES\nNot Applicable\nPART II ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED SHAREHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES.\nMARKET INFORMATION\nOur common stock is not traded on any exchange. Our common stock is quoted on the OTC Markets, under the trading symbol FORZ. The market for our stock is highly volatile. We cannot assure you that there will be a market in the future for our common stock. OTC Markets securities are not listed and traded on the floor of an organized national or regional stock exchange. Instead, they are securities transactions are conducted through a telephone and computer network connecting dealers in stocks.\nOur common stock became eligible for trading on the OTC Markets on June 19, 2017, although it did not start trading until October 17, 2019. We executed a 10 for 1 forward split of our common stock that went effective June 17, 2022. The following table shows the high and low prices of our common shares on the OTC Markets or each quarter within the two most recent fiscal years. The following quotations reflect inter-dealer prices, without retail mark-up, mark-down or commission and may not necessarily represent actual transactions:\nFiscal Year Ending June 2022 HIGH LOW\nQuarter Ending September 30, 2021 $ 0.90 $ 0.1631\nQuarter Ending December 31, 2021 $ 0.33 $ 0.05\nQuarter Ending March 31, 2022 $ 0.12 $ 0.025\nQuarter Ending June 30, 2022 $ 0.037 $ 0.0081\nFiscal Year Ending June 2021 HIGH LOW\nQuarter Ending September 30, 2020 $ 0.035 $ 0.003\nQuarter Ending December 31, 2020 $ 0.05 $ 0.003\nQuarter Ending March 31, 2021 $ 0.70 $ 0.014\nQuarter Ending June 30, 2021 $ 4.82 $ 0.11\nHOLDERS\nThe approximate number of registered stockholders of record as of June 30, 2022 is 20. The number of stockholders of record does not include beneficial owners of our common stock, whose shares are held in the names of various dealers, clearing agencies, banks, brokers and other fiduciaries.\nDIVIDEND POLICY\nWe have never paid any cash dividends on our common stock. We anticipate that we will retain funds and future earnings to support operations and to finance the growth and development of our business. Therefore, we do not expect to pay cash dividends in the foreseeable future. Any future determination to pay dividends will be at the discretion of our board of directors and will depend on our financial condition, results of operations, capital requirements and other factors that our board of directors deems relevant. In addition, the terms of any future debt or credit financings may preclude us from paying dividends.\nRECENT SALES OF UNREGISTERED SECURITIES\nNone.\nPENNY STOCK REGULATION\nShares of our common stock is subject to rules adopted the SEC that regulate broker-dealer practices in connection with transactions in penny stocks. Penny stocks are generally equity securities with a price of less than $5.00 (other than securities registered on certain national securities exchanges or quoted on the NASDAQ system, provided that current price and volume information with respect to transactions in those securities is provided by the exchange or system). The penny stock rules require a broker-dealer, prior to a transaction in a penny stock not otherwise exempt from those rules, deliver a standardized risk disclosure document prepared by the SEC, which contains the following:\na description of the nature and level of risk in the market for penny stocks in both public offerings and secondary trading;\na description of the brokers or dealers duties to the customer and of the rights and remedies available to the customer with respect to violation to such duties or other requirements of securities laws;\na brief, clear, narrative description of a dealer market, including bid and ask prices for penny stocks and the significance of the spread between the bid and ask price;\na toll-free telephone number for inquiries on disciplinary actions;\ndefinitions of significant terms in the disclosure document or in the conduct of trading in penny stocks; and\nsuch other information and is in such form (including language, type, size and format), as the SEC shall require by rule or regulation.\nPrior to effecting any transaction in penny stock, the broker-dealer also must provide the customer the following:\nthe bid and offer quotations for the penny stock;\nthe compensation of the broker-dealer and its salesperson in the transaction;\nthe number of shares to which such bid and ask prices apply, or other comparable information relating to the depth and liquidity of the market for such stock; and\nmonthly account statements showing the market value of each penny stock held in the customers account.\nIn addition, the penny stock rules require that prior to a transaction in a penny stock not otherwise exempt from those rules, the broker-dealer must make a special written determination that the penny stock is a suitable investment for the purchaser and receive the purchasers written acknowledgment of the receipt of a risk disclosure statement, a written agreement to transactions involving penny stocks, and a signed and dated copy of a written suitability statement. These disclosure requirements may have the effect of reducing the trading activity in the secondary market for a stock that becomes subject to the penny stock rules. Holders of shares of our common stock may have difficulty selling those shares because our common stock will probably be subject to the penny stock rules. ITEM 6. SELECTED FINANCIAL DATA\nNot applicable. ITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATION\nThe following discussion and analysis of our financial condition and results of operations should be read together with our financial statements and the related notes and the other financial information included elsewhere in this report. This discussion contains forward-looking statements that involve risks and uncertainties. Our actual results could differ materially from those anticipated in these forward-looking statements as a result of various factors, including those discussed below and elsewhere in this report, particularly those under \"Risk Factors. Dollars in tabular format are presented in thousands, except per share data, or otherwise indicated.\nOverview\nWe were incorporated on December 9, 2014 in the state of Florida. On February 17, 2021, we filed Articles of Continuance with the Secretary of State for the state of Wyoming. Accordingly, we transferred our state of formation from Florida to Wyoming and became a Wyoming entity and are now subject to the provisions of the Wyoming Business Corporation Act.\nWe are in the health-tech wearable performance business. We have acquired the ownership and rights to certain late developmental stage products, including the WarmUp product line which is comprised of the J4 Sport, J4 X and J4 Fitbelt. These products are wearable back compression devices, used to relax, warmup, loosen, or relax stiff & sore muscles. The therapeutic application of heat causes a change in temperature of the soft tissues which decreases joint stiffness and relieves inflammation.\nWe have recently successfully completed our first acquisition of Sustainable Origins which is an eco-friendly ESG company, that converts used cooking oil to reusable biodiesel. This acquisition is part of our ongoing strategic plan for future revenue and expansion. While our primary focus will always be revolving around the innovation of wearable technology, these projects will take time to market. We want to align ourselves with like-minded Entrepreneurs that will mesh well with our team and collective interest. Having the ability to acquire companies current operations to generate steady revenue streams, will also help aid in financing the production of WarmUp and other products we will develop.\nResults of Operation for the Year Ended June 30, 2022 Compared to the Year Ended June 30, 2021\nRevenues and Cost of Revenue\nWe earned gross revenue of $25,871 during the year ended June 30, 2022, compared to $nil for the same period in 2021. Our cost of revenue was $2,792 during the year ended June 30, 2022, compared to $nil for the same period in 2021\nOperating Expenses from Continuing Operations\nOperating expenses from continuing operations for the year ended June 30, 2022 consisted of general and administrative expenses of $152,315 (2021 - $60,165); advertising and marketing expenses of $111,527 (2021 - $nil); compensation expense of $319,857 (2021 - $nil); professional fees of $270,318 (2021 - $nil); and, stock based compensation of $1,068,731 (2021 - $nil).\nNet Loss from Continuing Operations\nOur net loss from continuing operations for the years ended June 30, 2022 was $2,700,508 compared to $3,143,140 for the year ended June 30, 2021. The large increase in our net loss in mainly due an increase in operating expenses due to our increased business activities.\nLiquidity and Capital Resources\nAs reflected in the accompanying financial statements, we had an accumulated deficit of $6,195,238 at June 30, 2022, and had a net loss from continuing operations of $2,700,508 for year ended June 30, 2022.\nFor the year ended June 30, 2022, we used net cash of $712,145 in operating activities, compared to received net cash of $66,297 for the year ended June 30, 2021.\nNet cash used in investing activities for the year ended June 30, 2022 and 2021 was $75,612 and $110,117, respectively, for the purchase of property and equipment.\nNet cash received from financing activities for the year ended June 30, 2022 was $1,069,994 compared to $57,497 provided by financing activities in the prior period.\nCritical Accounting Estimates and Policies\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and the disclosure of contingent assets and liabilities of the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Note 2 to the Financial Statements describes the significant accounting policies and methods used in the preparation of the Financial Statements. Estimates are used for, but not limited to, contingencies and taxes. Actual results could differ materially from those estimates. The following critical accounting policies are impacted significantly by judgments, assumptions, and estimates used in the preparation of the Financial Statements.\nWe are subject to various loss contingencies arising in the ordinary course of business. We consider the likelihood of loss or impairment of an asset or the incurrence of a liability, as well as our ability to reasonably estimate the amount of loss in determining loss contingencies. An estimated loss contingency is accrued when management concludes that it is probable that an asset has been impaired or a liability has been incurred and the amount of the loss can be reasonably estimated. We regularly evaluate current information available to us to determine whether such accruals should be adjusted.\nWe recognize deferred tax assets (future tax benefits) and liabilities for the expected future tax consequences of temporary differences between the book carrying amounts and the tax basis of assets and liabilities. The deferred tax assets and liabilities represent the expected future tax return consequences of those differences, which are expected to be either deductible or taxable when the assets and liabilities are recovered or settled. Future tax benefits have been fully offset by a 100% valuation allowance as management is unable to determine that it is more likely than not that this deferred tax asset will be realized.\nOff-Balance Sheet Arrangements\nWe do not have any off-balance sheet arrangements (as that term is defined in Item 303 of Regulation S-K) that are reasonably likely to have a current or future material effect on our financial condition, revenue or expenses, results of operations, liquidity, capital expenditures or capital resources.\nRecently Issued Accounting Standards\nThe Company has implemented all new accounting pronouncements that are in effect. These pronouncements did not have any material impact on the financial statements unless otherwise disclosed, and the Company does not believe that there are any other new accounting pronouncements that have been issued that might have a material impact on our financial position or results of operations. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nNot applicable. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nThe financial statements required to be included in this report appear as indexed in the appendix to this report beginning on page. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone. ITEM 9A. CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nWe maintain disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) of the Securities Exchange Act of 1934, as amended (the Exchange Act) that are designed to be effective in providing reasonable assurance that information required to be disclosed in our reports under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in the rules and forms of the SEC, and that such information is accumulated and communicated to our management to allow timely decisions regarding required disclosure.\nIn designing and evaluating disclosure controls and procedures, management recognizes that any controls and procedures, no matter how well designed and operated, can provide only reasonable, not absolute assurance of achieving the desired objectives. Also, the design of a control system must reflect the fact that there are resource constraints and the benefits of controls must be considered relative to their costs. Because of the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, have been detected. These inherent limitations include the realities that judgments in decision-making can be faulty and that breakdowns can occur because of simple error or mistake. The design of any system of controls is based, in part, upon certain assumptions about the likelihood of future events and there can be no assurance that any design will succeed in achieving its stated goals under all potential future conditions. As of the end of the period covered by this report, we carried out an evaluation, under the supervision and with the participation of management, including our chief executive officer and principal financial officer, of the effectiveness of the design and operation of our disclosure controls and procedures. Based upon that evaluation, management concluded that our disclosure controls and procedures were not effective as of June 30, 2022 to cause the information required to be disclosed by us in reports that we file or submit under the Exchange Act is recorded, processed, summarized and reported within the time periods prescribed by SEC, and that such information is accumulated and communicated to management, including our chief executive officer and principal financial officer, as appropriate, to allow timely decisions regarding required disclosure.\nManagement's Report on Internal Control Over Financial Reporting\nThis annual report does not include a report of managements assessment regarding internal control over financial reporting or an attestation report of the Companys registered public accounting firm due to a transition period established by rules of the Securities and Exchange Commission for newly public companies.\nChanges in Internal Control Over Financial Reporting\nThere were no significant changes in our internal control over financial reporting during the year ended June 30, 2022, that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. Item 9B. Other Information.\nNone\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nAll directors and officers are appointed by our board of directors and serve at the discretion of the board, subject to applicable employment agreements. The following table sets forth information regarding our executive officers and the members of our board of directors.\nName Age Position\nJohnny Forzani President, CEO, Treasurer, CFO, Secretary and Director\nTom Forzani Director\nGeoff Stanbury Director\nJohnny Forzani, is a former Professional Football Player and is an Entrepreneur and Inventor. Mr. Forzani played Division 1 NCAA Football at Washington State University, where he set an NCAA record for the longest touchdown reception. During his professional football career, playing with his hometown Calgary Stampeders, Mr. Forzani started creating his first invention. In 2017, Mr. Forzanis founded, G-Tech Apparel USA Inc. and G-Tech Apparel Canada Inc. and was issued a Utility & Design Patent from the USPTO, for G-Techs Battery Powered Thermal Handwarmer.\nMr. Forzani has been the founder of G-Tech Apparel USA Inc. and G-Tech Apparel Canada Inc since 2014. From, 2014 to 2021, Mr. Forzani acted as CEO and CTO of both companies. He has been our President, CEO, Treasurer, CFO, Secretary and a Director since January 21, 2022.\nTom Forzani, is a one of three brothers to play for the Calgary Stampeders of the CFL. Described as one of the best wide receivers to ever play at Utah State, Mr. Forzani earned honorable mention All-America honors from The Associated Press as a senior in 1972 as he led the nation with receptions, while adding 1,169 receiving yards to set then-single-season school records in both categories.\nFollowing his Utah State career, Mr. Forzani played professionally for the Calgary Stampeders from 1972-83 and was a five-time CFL All-Star. He finished his CFL career ranking second all-time in Stampeders history in receptions (553), receiving yards (8,825) and receiving touchdowns (62). Mr. Forzani was named to Utah State's All-Century Football Team in 1993.\nMr. Forzani began his business career towards the end of his football career, earning his realtors license in 1979. Mr. Forzani started Kelvion Properties in 1990, which specialized in most aspects of the Real Estate business including Land Purchase, Land Zoning, House Building, Land Sub Division, Mortgage Loaning and Renovations.\nIn 1974, Mr. Forzani was one of the Original Founders and Owners of Forzani Locker Room which became the Canadian publicly traded company The Forzani Group in 1993. The Forzani Group went from one store in 1974, to a retail empire encompassing more than 500 retail locations and over 13,000 employees. In 2011, The Forzani Group sold to Canadian conglomerate Canadian Tire Corporation for $800,000,000 (Canadian Dollars). Tom Forzani has been a Director since January 21, 2022.\nGeoff Stanbury, was born and raised in South West England and immigrated to North America at 19. In 1981 shortly after settling in Alberta, Mr. Stanbury founded his company Good Earth Environs which specializes in Land, Snow, and Erosion management. Good Earth has maintained contracts with some of Albertas largest Residential companies including Brookfeild RP, for over 20 years.\nToday, Mr. Stanbury is a seasoned Investor with a portfolio ranging in both the private and public sector. Mr. Stanbury is passionate about entrepreneurship and innovation. He looks forward to providing veteran leadership to the board, assisting in the best way possible, on the path to success. Mr. Stanbury has been a Director since January 21, 2022.\nInvolvement in Certain Legal Proceedings\nTo our knowledge, during the past ten years, none of our directors, executive officers, promoters, control persons, or nominees has:\nbeen convicted in a criminal proceeding or been subject to a pending criminal proceeding (excluding traffic violations and other minor offenses);\nhad any bankruptcy petition filed by or against the business or property of the person, or of any partnership, corporation or business association of which he was a general partner or executive officer, either at the time of the bankruptcy filing or within two years prior to that time;\nbeen subject to any order, judgment, or decree, not subsequently reversed, suspended or vacated, of any court of competent jurisdiction or federal or state authority, permanently or temporarily enjoining, barring, suspending or otherwise limiting, his involvement in any type of business, securities, futures, commodities, investment, banking, savings and loan, or insurance activities, or to be associated with persons engaged in any such activity;\nbeen found by a court of competent jurisdiction in a civil action or by the SEC or the Commodity Futures Trading Commission to have violated a federal or state securities or commodities law, and the judgment has not been reversed, suspended, or vacated;\nbeen the subject of, or a party to, any federal or state judicial or administrative order, judgment, decree, or finding, not subsequently reversed, suspended or vacated (not including any settlement of a civil proceeding among private litigants), relating to an alleged violation of any federal or state securities or commodities law or regulation, any law or regulation respecting financial institutions or insurance companies including, but not limited to, a temporary or permanent injunction, order of disgorgement or restitution, civil money penalty or temporary or permanent cease-and-desist order, or removal or prohibition order, or any law or regulation prohibiting mail or wire fraud or fraud in connection with any business entity; or\nbeen the subject of, or a party to, any sanction or order, not subsequently reversed, suspended or vacated, of any self-regulatory organization (as defined in Section 3(a)(26) of the Exchange Act), any registered entity (as defined in Section 1(a)(29) of the Commodity Exchange Act), or any equivalent exchange, association, entity or organization that has disciplinary authority over its members or persons associated with a member.\nBoard Committees\nAs at June 30, 2022, the Company did not currently maintain a board of directors that is composed of a majority of independent directors. The Company does not expect to initially appoint an audit committee, nominating committee and/or compensation committee, or to adopt charters relative to each such committees.\nCode of Business Conduct and Ethics\nWe have not adopted a Code of Business Conduct and Ethics.\nLimitation of Directors Liability and Indemnification\nWe do not have director and officer liability insurance to cover liabilities our directors and officers may incur in connection with their services to us, including matters arising under the Securities Act, although we intend to acquire such insurance. Florida law and our bylaws provide that we will indemnify our directors and officers who, by reason of the fact that he or she is one of our officers or directors, is involved in a legal proceeding of any nature.\nThere is no pending litigation or proceeding involving any of our directors, officers, employees or agents in which indemnification will be required or permitted. We are not aware of any threatened litigation or proceeding that may result in a claim for such indemnification. ITEM 11. EXECUTIVE COMPENSATION\nSummary Compensation Table\nThe following table presents information regarding the total compensation awarded to, earned by, or paid to our chief executive officer and the most highly-compensated executive officers (other than the chief executive officer) who were serving as executive officers as of June 30, 2022 for services rendered in all capacities to us for the fiscal years ended June 30, 2022, 2021 and 2019.\nName and Principal Position\nYear\nSalary\n($)\nBonus\n($)\nOption Awards\n($)\nNon-equity\nincentive plan compensation\n($)\nChange in pension value and nonqualified deferred compensation earnings\n($)\nAll Other Compensation\n($)\nTotal\n($)\nJohnny Forzani\nCEO, CFO, Director\nTom Forzani\nDirector\nGeoff Stanbury\nDirector\nEmployment and Consulting Agreements\nNone\nOutstanding Equity Awards at Fiscal Year-End Table\nThe following table summarizes, for each of the named executive officers, the number of shares of common stock underlying outstanding stock options held as of June 30, 2022.\nOption Awards\nName\nNumber of\nsecurities\nunderlying\nunexercised\noptions (#)\nexercisable\nNumber of\nsecurities\nunderlying\nunexercised\noptions (#)\nunexercisable\nOption\nexercise\nprice ($) 1\nOption\nexpiration\ndate\nJohnny Forzani\n600,000\n$ 0.05\nAugust 3, 2023\nTom Forzani\n250,000\n$ 0.05\nAugust 3, 2023\nGeoff Stanbury\n150,000\n$ 0.05\nAugust 3, 2023 ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe following table sets forth the number of shares of common stock beneficially owned as of June 30, 2022 by:\neach of our stockholders who is known by us to beneficially own 5% or more of our common stock;\neach of our executive officers;\neach of our directors; and\nall of our directors and current executive officers as a group.\nBeneficial ownership is determined based on the rules and regulations of the Commission. A person has beneficial ownership of shares if such individual has the power to vote and/or dispose of shares. This power may be sole or shared and direct or indirect. Applicable percentage ownership in the following table is based on the total of 220,009,575 shares of common stock outstanding as of June 30, 2022. In computing the number of shares beneficially owned by a person and the percentage ownership of that person, shares of common stock that are subject to options or warrants held by that person and exercisable as of, or within 60 days of, June 30, 2022. These shares, however, are not counted as outstanding for the purposes of computing the percentage ownership of any other person(s). Except as may be indicated in the footnotes to this table and pursuant to applicable community property laws, each person named in the table has sole voting and dispositive power with respect to the shares of common stock set forth opposite that persons name. Unless indicated below, the address of each individual listed below is c/o Forza Innovations, Inc. 30 Forzani Way NW, Calgary, Alberta T3Z 1L5.\nName of Beneficial Owner\nNumber of Shares Beneficially Owned\nPercentage of Shares Beneficially Owned\nJohnny Forzani\n170,600,000\n77.5 %\nTom Forzani\n250,000\n(1)\nGeoff Stanbury\n150,000\n(1)\nAll Officers and Directors\n170,950,000\n77.7 %\n(1) less than 1% ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS AND DIRECTOR INDEPENDENCE\nNone. ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES\nBF Borgers CPA PC served as our independent registered public accounting firm for the 2022 fiscal year and Michael Gillespie & Associates, PLLC served as our independent registered public accounting firm for the 2021 fiscal year. The following table shows the fees that were billed for the audit and other services provided by these firms for 2022 and 2021 fiscal years.\nAudit Fees $ ***\n$ 21,200\nAudit-Related Fees $\n$\nTax Fees $\n$\nAll Other Fees $\n$\nTotal $ ***\n$ 21,200\nAudit Fees - This category includes the audit of our annual financial statements, review of financial statements included in our Quarterly Reports on Form 10-Q and services that are normally provided by the independent registered public accounting firm in connection with engagements for those fiscal years. This category also includes advice on audit and accounting matters that arose during, or as a result of, the audit or the review of interim financial statements.\nAudit-Related Fees - This category consists of assurance and related services by the independent registered public accounting firm that are reasonably related to the performance of the audit or review of our financial statements and are not reported above under Audit Fees. The services for the fees disclosed under this category include consultation regarding our correspondence with the Securities and Exchange Commission and other accounting consulting.\nTax Fees - This category consists of professional services rendered by our independent registered public accounting firm for tax compliance and tax advice. The services for the fees disclosed under this category include tax return preparation and technical tax advice.\nAll Other Fees - This category consists of fees for other miscellaneous items.\nOur Board of Directors has adopted a procedure for pre-approval of all fees charged by our independent registered public accounting firm. Under the procedure, the Board approves the engagement letter with respect to audit, tax and review services. Other fees are subject to pre-approval by the Board, or, in the period between meetings, by a designated member of Board. Any such approval by the designated member is disclosed to the entire Board at the next meeting.\nPART IV ITEM 15. EXHIBITS, FINANCIAL STATEMENT SCHEDULES\n(a)(1) Financial Statements.\nThe response to this portion of Item 15 is set forth under Item 8 hereof.\n(a)(2) Financial Statement Schedules.\nAll schedules have been omitted because they are not required or because the required information is given in the Financial Statements or Notes thereto.\n(a)(3) Exhibits.\nThe exhibits listed below are filed as part of this Annual Report on Form 10-K.\nExhibit No. Description\n3.1 Articles of Incorporation of the Registrant (1)\n3.2 Articles of Amendment (1)\n3.3 Bylaws of the Registrant (1)\n10.1 Form of Share Lock Up Period (1)\n23.1 Consent of PCAOB registered Audit Firm\n31.1* Certification by the Chief Executive Officer and Chief Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 and Rules 13a-14 and 15d-14 under the Securities Exchange Act of 1934\n32.1* Certification by the Chief Executive Officer and Chief Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 and Rules 13a-14 and 15d-14 under the Securities Exchange Act of 1934\n101.INS* XBRL Instance Document\n101.SCH* XBRL Taxonomy Extension Schema\n101.CAL* XBRL Taxonomy Extension Calculation Linkbase\n101.DEF* XBRL Taxonomy Extension Definition Linkbase\n101.LAB* XBRL Taxonomy Extension Label Linkbase\n101.PRE* XBRL Taxonomy Extension Presentation Linkbase\n* Filed herewith\n(1) Incorporated by reference from Form S-1 filed on August 31, 2016 and as amended until December 23, 2016.\n(2) Incorporated by reference from Form 8-K filed on November 20, 2016.\n(3) Incorporated by reference from Form 8-K filed on November 22, 2016.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nForza Innovations, Inc.\nDate: October 13, 2022 By: /s/ Johnny Forzani\nJohnny Forzani\nPresident, Chief Financial Officer, Treasurer, Chief Financial Officer, Secretary\nPursuant to the requirements of the Securities Exchange Act of 1934, this report on Form 10-K has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature Title Date\n/s/ Johnny Forzani President, Chief Financial Officer, Treasurer, Chief Financial Officer, Secretary, Director October 13, 2022\nJohnny Forzani\n/s/ Tom Forzani Director October 13, 2022\nTom Forzani\n/s/ Geoff Stanbury Director October 13, 2022\nGeoff Stanbury\nFORZA INNOVATIONS INC.\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\nReport of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets as of June 30, 2022 and 2021\nConsolidated Statements of Operations for the years ended June 30, 2022 and 2021\nConsolidated Statements of Stockholders Equity (Deficit) for the year ended June 30, 2022 and 2021\nConsolidated Statements of Cash Flows for years ended June 30, 2022 and 2021\t\nNotes to the Consolidated Financial Statements \t\nReport of Independent Registered Public Accounting Firm\nTo the shareholders and the board of directors of Forza Innovations Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of Forza Innovations Inc. as of June 30, 2022 and 2021, the related statements of operations, stockholders' equity (deficit), and cash flows for the years then ended, and the related notes (collectively referred to as the \"financial statements\"). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of June 30, 2022 and 2021, and the results of its operations and its cash flows for the years then ended, in conformity with accounting principles generally accepted in the United States.\nSubstantial Doubt about the Companys Ability to Continue as a Going Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 3 to the financial statements, the Company has suffered recurring losses from operations and has a significant accumulated deficit. In addition, the Company continues to experience negative cash flows from operations. These factors raise substantial doubt about the Company's ability to continue as a going concern. Management's plans in regard to these matters are also described in Note 3. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (\"PCAOB\") and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audit provides a reasonable basis for our opinion.\nCritical Audit Matter\nCritical audit matters are matters arising from the current-period audit of the financial statements that were communicated or required to be communicated to the audit committee and that (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments.\nWe determined that there are no critical audit matters.\n/S/ BF Borgers CPA PC\nBF Borgers CPA PC (PCAOB ID 5041)\nWe have served as the Company's auditor since 2021\nLakewood, CO\nOctober 13, 2022\nFORZA INNOVATIONS INC.\nCONSOLIDATED BALANCE SHEETS\nJune 30, 2022 June 30, 2021\nASSETS\nCurrent assets:\nCash $ 295,914 $ 13,677\nPrepaid 5,130 -\nTotal current assets 301,044 13,677\nMachinery and equipment, net 155,599 108,954\nWebsite, net - 15,250\nOther assets 5,913 -\nTotal other assets 161,512 124,204\nTotal Assets $ 462,556 $ 137,881\nLIABILITIES AND STOCKHOLDERS' EQUITY (DEFICIT)\nCurrent liabilities:\nAccounts payable and accrued liabilities $ 49,972 $ 35,400\nAccrued interest 129,564 57,649\nConvertible notes payable, net of discount of $424,889 and $12,500, respectively 905,111 150,000\nDerivative liability 662,982 -\nLoan payable 22,729 122,729\nDue to related party 19,406 54,833\nTotal current liabilities 1,789,764 420,611\nTotal liabilities 1,789,764 420,611\nCommitments and contingencies - -\nStockholders' equity (deficit):\nClass B Preferred stock, $0.001 par value, 25,000,000 shares authorized, 10,000,000 issued and outstanding 10,000 10,000\nCommon stock, $0.001 par value, 700,000,000 shares authorized; 220,009,575 and 281,000,000 shares issued and outstanding, respectively 220,009 281,000\nCommon stock to be issued 26,231 -\nAdditional paid-in capital 4,611,790 2,921,000\nAccumulated deficit (6,195,238 ) (3,494,730 )\nTotal stockholders' deficit (1,327,208 ) (282,730 )\nTotal Liabilities and Stockholders' Deficit $ 462,556 $ 137,881\nThe accompanying notes are an integral part of these consolidated financial statements.\nFORZA INNOVATIONS INC.\nCONSOLIDATED STATEMENTS OF OPERATIONS\nFor the Years Ended June 30,\nRevenue $ 25,871 $ -\nCost of revenue 2,792 -\nGross margin 23,079 -\nOperating Expenses:\nGeneral & administrative expenses 152,315 60,165\nAdvertising and marketing 111,527 -\nCompensation expense 319,857 -\nProfessional fees 270,318 -\nStock based compensation 1,068,731 -\nTotal operating expenses 1,922,748 60,165\nLoss from operations (1,899,669 ) (60,165 )\nOther expense:\nInterest expense (150,351 ) (26,033 )\nLoss on issuance of convertible debt (1,165,877 ) -\nChange in fair value of derivatives 967,422 -\nDebt discount amortization (377,426 ) (12,500 )\nEarly payment penalties (41,057 ) -\nLoss on asset impairment (10,750 ) -\nImpairment expense (22,800 ) -\nLoss on asset acquisition - related party - (2,704,865 )\nLoss on disposition of assets and liabilities - (365,019 )\nTotal other expense (800,839 ) (3,108,417 )\nLoss before income taxes (2,700,508 ) (3,168,582 )\nProvision for income taxes - -\nNet loss from continuing operations (2,700,508 ) (3,168,582 )\nNet income from discontinued operations - 25,442\nNet Loss $ (2,700,508 ) $ (3,143,140 )\nNet loss per common share, basic & diluted from continuing operations $ (0.01 ) $ (0.14 )\nNet income per common share, basic & diluted from discontinued operations $ - $ 0.00\nNet loss per common Share, basic & diluted $ (0.01 ) $ (0.14 )\nWeighted common shares outstanding, basic & diluted 286,360,095 23,031,507\nThe accompanying notes are an integral part of these consolidated financial statements.\nFORZA INNOVATIONS INC.\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS' DEFICIT\nFOR THE YEARS ENDED JUNE 30, 2022 AND 2021\nCommon Shares Common Stock Preferred\nShares Preferred Stock Paid in Capital Common stock to be Issued Accumulated Deficit Total\nBalance, June 30, 2020 181,000,000 $ 181,000 10,000,000 $ 10,000 $ 221,000 $ - $ (351,590 ) $ 60,410\nStock issued for asset acquisition 100,000,000 100,000 - - 2,690,000 - - 2,800,000\nNet loss - - - - - - (3,143,140 ) (3,143,140 )\nBalance, June 30, 2021 281,000,000 281,000 10,000,000 10,000 2,921,000 - (3,494,730 ) (282,730 )\nShares issued for conversion of debt 26,608,313 26,608 - - 332,244 - - 358,852\nOptions exercised - related party 500,000 - - 23,543 - - 24,043\nFair value of options granted - - - - 854,550 - - 854,550\nShares issued for acquisition - - - - - 22,800 - 22,800\nShares issued for cash 5,000,000 5,000 - - 31,005 - - 36,005\nShares granted for services 1,201,262 1,201 - - 34,837 - - 36,038\nShares granted for financing costs 5,700,000 5,700 - - 205,050 3,431 - 214,181\nFair value of warrants granted - - - - 109,561 - - 109,561\nShares cancelled - related party (100,000,000 ) (100,000 ) - - 100,000 - - -\nNet loss - - - - - - (2,700,508 ) (2,700,508 )\nBalance, June 30, 2022 220,009,575 $ 220,009 10,000,000 $ 10,000 $ 4,611,790 $ 26,231 $ (6,195,238 ) $ (1,327,208 )\nThe accompanying notes are an integral part of these consolidated financial statements.\nFORZA INNOVATIONS INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nFor the Years Ended June 30,\nCash flows from operating activities:\nNet Loss $ (2,700,508 ) $ (3,168,582 )\nAdjustments to reconcile net loss to net cash used by operating activities:\nIncome from discontinued operations - 25,422\nDepreciation and amortization 36,021 10,931\nDebt discount amortization 377,426 12,500\nLoss on issuance of convertible debt 1,165,877 -\nChange in fair value of derivatives (967,422 ) -\nCommon stock issued for services 250,219 -\nOther stock-based compensation 964,911 -\nLoss on asset acquisition - related party - 2,704,865\nLoss on asset impairment 10,750\nLoss on disposition of assets and liabilities 22,800 365,019\nChanges in operating assets and liabilities:\nPrepaids (5,130 ) -\nOther assets (5,913 ) -\nAccounts payable 11,218 35,400\nAccrued interest 127,606 44,915\nOperating cash flow from discontinued operations - 35,827\nNet cash (used) provided by operating activities (712,145 ) 66,297\nCash flows from investing activities:\nPurchase of property and equipment (75,612 ) (40,000 )\nInvesting cash flow from discontinued operations - (70,117 )\nNet cash used in investing activities (75,612 ) (110,117 )\nCash flows from financing activities:\nAdvances from related party 27,088 54,833\nRepayment of related party loans (62,516 ) -\nProceeds from convertible debt 1,410,374 -\nRepayment of convertible debt (365,000 ) -\nProceeds from sale of common stock 36,005 -\nProceeds from the exercise of options 24,043 -\nFinancing cash flow from discontinued operations - 2,664\nNet cash provided by financing activities 1,069,994 57,497\nNet change in cash 282,237 13,677\nCash, beginning of year 13,677 -\nCash, end of year $ 295,914 $ 13,677\nSupplemental disclosure of cash flow information:\nCash paid for interest $ 22,746 $ -\nCash paid for taxes $ - $ -\nSupplemental non-cash disclosure:\nCommon stock issued for conversion of debt $ 340,691 $ -\nThe accompanying notes are an integral part of these consolidated financial statements.\nFORZA INNOVATIONS INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJUNE 30, 2022\nNOTE 1 - NATURE OF OPERATIONS\nForza Innovations Inc. (the Company) was incorporated on December 9, 2014, under the laws of the State of Florida. The Company was a diversified multi-industry manufacturer of complex metal components and products. We serve all general industrial markets such as Aerospace, Automotive, Commercial, Food Processing, Industrial, Maritime, Medical, Railroad, Oil and Gas, Packaging, Telecom, Textiles, Robotics, Space Travel, Transportation and many more. We are a vertically integrated precision CNC manufacturing and fabrication company with core emphasis on product design, engineering and precision manufacturing of complex components and products.\nOn February 5, 2018, the Company formed Genesys Industries, LLC as a wholly owned subsidiary in the state of Missouri.\nOn January 21, 2021, Shefali Vibhakar, President of the Company closed a Share Purchase Agreement (the Agreement) that she entered into with Johnny Forzani to sell all of her 170,000,000 common shares and 10,000,000 preferred shares to Johnny Forzani for cash consideration of $177,000.\nFurther, as part of the Agreement, Ms. Vibhakar agrees to spin out all of the Companys assets (except for certain machinery valued at $40,000 - which is subject to a separate purchase agreement) as well as all of the Companys liabilities (except the Companys note with Tangiers Capital, LLC). The value date of the assets and liabilities will be January 21, 2021.\nOn January 21, 2021, a change in control of the Company occurred pursuant to the Agreement. Mr. Forzani now has voting control over 93.9% of the Companys issued and outstanding common stock.\nOn January 21, 2021, the Company received the resignation of Shefali Vibhakar as the Companys President, Chief Executive Officer, Treasurer, Chief Financial Officer, Secretary and Director and appointed Johnny Forzani as its President, Chief Executive Officer, Treasurer, Chief Financial Officer and Secretary.\nEffective January 21, 2021, the Companys new address is 30 Forzani Way NW, Calgary, Alberta, Canada T3Z 1L5.\nOn February 17, 2021, the Company filed Articles of Continuance with the Secretary of State for the state of Wyoming. Accordingly, the Company transferred its state of formation from Florida to Wyoming and became a Wyoming entity.\nOn February 18, 2021, the Company filed a Certificate of Dissolution with the Secretary of State for the State of Florida, effectively dissolving the Company's existence in Florida.\nAs of June 30, 2021, Forza Innovations has moved out of the precision CNC manufacturing and fabrication business and has moved into the health-tech wearable performance business. The Company has acquired the ownership and rights to certain late developmental stage products, including the J4 Sport, J4 X and J4 Fitbelt. These products are wearable back compression devices, used to relax, warmup, loosen, or relax stiff & sore muscles. The therapeutic application of heat causes a change in temperature of the soft tissues which decreases joint stiffness and relieves inflammation.\nOn March 1, 2022, the Company entered into a Share Exchange Agreement (the Agreement) with Sustainable Origins Inc. (Sustainable), whereby the Company acquired 100% of the shares of Sustainable in exchange for 600,000 shares of the Companys common stock and a cash payment of $17,000 and the payment of certain initial expenses, thereby making Sustainable a wholly-owned subsidiary of the Company. Sustainable is in the business of used cooking oil recycling and has recently entered into an asset purchase agreement with Oil Industries, Inc. of North Carolina to acquire certain assets related to the used cooking oil business. The Company valued the shares of common stock at $0.038, the closing stock price on the effective date of the agreement, for a valuation of $22,800. At the time of acquisition Sustainable had no operations. As such the Company fully impaired the $22,800. As of June 30, 2022, the shares have not yet been issued to Sustainable.\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBasis of Presentation\nThe Companys consolidated financial statements have been prepared in accordance with accounting principles generally accepted in the United States of America (U.S. GAAP).\nUse of Estimates\nThe preparation of financial statements in conformity with generally accepted accounting principles requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Significant estimates include the estimated useful lives of property and equipment. Actual results could differ from those estimates.\nConcentrations of Credit Risk\nWe maintain our cash in bank deposit accounts, the balances of which at times may exceed federally insured limits. We continually monitor our banking relationships and consequently have not experienced any losses in our accounts. We believe we are not exposed to any significant credit risk on cash.`\nCash Equivalents\nThe Company considers all highly liquid investments with a maturity of three months or less when purchased to be cash equivalents. There were no cash equivalents for the years ended June 30, 2022 or 2021.\nPrinciples of Consolidation\nThe accompanying consolidated financial statements for year ended June 30, 2022, include the accounts of the Company and its wholly owned subsidiary, Sustainable Origins. All material inter-company transactions have been eliminated in consolidation.\nProperty, Plant and Equipment\nProperty and equipment are carried at the lower of cost or net realizable value. Major betterments that extend the useful lives of assets are also capitalized. Normal maintenance and repairs are charged to expense as incurred. When assets are sold or otherwise disposed of, the cost and accumulated depreciation are removed from the accounts and any resulting gain or loss is recognized in operations.\nReclassifications\nCertain reclassifications have been made to the prior period financial information to conform to the presentation used in the financial statements for the year ended June 30, 2022.\nDerivative Financial Instruments\nThe Company evaluates its convertible notes to determine if such instruments have derivatives or contain features that qualify as embedded derivatives. For derivative financial instruments that are accounted for as liabilities, the derivative instrument is initially recorded at its fair value and is then re-valued at each reporting date, with changes in the fair value reported in the statements of operations. For stock-based derivative financial instruments, the Company uses a weighted-average Black-Scholes-Merton option pricing model to value the derivative instruments at inception and on subsequent valuation dates. The classification of derivative instruments, including whether such instruments should be recorded as liabilities or as equity, is evaluated at the end of each reporting period.\nFair Value of Financial Instruments\nThe Company follows paragraph 825-10-50-10 of the FASB Accounting Standards Codification for disclosures about fair value of its financial instruments and paragraph 820-10-35-37 of the FASB Accounting Standards Codification (Paragraph 820-10-35-37) to measure the fair value of its financial instruments. Paragraph 820-10-35-37 establishes a framework for measuring fair value in accounting principles generally accepted in the United States of America (U.S. GAAP), and expands disclosures about fair value measurements. To increase consistency and comparability in fair value measurements and related disclosures, Paragraph 820-10-35-37 establishes a fair value hierarchy which prioritizes the inputs to valuation techniques used to measure fair value into three (3) broad levels. The fair value hierarchy gives the highest priority to quoted prices (unadjusted) in active markets for identical assets or liabilities and the lowest priority to unobservable inputs. The three (3) levels of fair value hierarchy defined by Paragraph 820-10-35-37 are described below:\nLevel 1: Quoted market prices available in active markets for identical assets or liabilities as of the reporting date.\nLevel 2: Pricing inputs other than quoted prices in active markets included in Level 1, which are either directly or indirectly observable as of the reporting date.\nLevel 3: Pricing inputs that are generally unobservable inputs and not corroborated by market data.\nThe carrying amount of the Companys financial assets and liabilities, such as cash, prepaid expenses and accrued expenses approximate their fair value because of the short maturity of those instruments. The Companys notes payable amates the fair value of such instruments as the notes bear interest rates that are consistent with current market rates.\nThe following table classifies the Companys asset measured at fair value on a recurring basis into the fair value hierarchy as of June 30, 2022:\nSchedule of fair value hierarchy\nDescription Level 1 Level 2 Level 3\nDerivative $ - $ - $ 662,982\nTotal $ - $ - $ 662,982\nIncome Taxes\nIncome taxes are provided for the tax effects of the transactions reported in the financial statements and consist of taxes currently due plus deferred taxes related primarily to tax net operating loss carryforwards. The deferred tax assets and liabilities represent the future tax return consequences of these differences, which will either be taxable or deductible when assets and liabilities are recovered or settled, as well as operating loss carryforwards. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date. A valuation allowance is established against deferred tax assets when in the judgment of management, it is more likely than not that such deferred tax assets will not become available. Because the judgment about the level of future taxable income is dependent to a great extent on matters that may, at least in part, be beyond the Companys control, it is at least reasonably possible that managements judgment about the need for a valuation allowance for deferred taxes could change in the near term.\nTax benefits are recognized only for tax positions that are more likely than not to be sustained upon examination by tax authorities. The amount recognized is measured as the largest amount of benefit that is greater than 50 percent likely to be realized upon settlement. A liability for unrecognized tax benefits is recorded for any tax benefits claimed in the Companys tax returns that do not meet these recognition and measurement standards. As of June 30, 2022, and 2021, no liability for unrecognized tax benefits was required to be reported.\nBasic and Diluted Loss Per Share\nUnder ASC 260 Earnings Per Share, the Company presents basic and diluted earnings (loss) per-share (EPS) amounts on the face of the statements of operations. Basic EPS computed by dividing income (loss) available to common stockholders (the numerator) by the weighted-average number of common shares outstanding (the denominator) during the period. Shares issued during the period and shares reacquired during the period are weighted for the portion of the period that they were outstanding. The computation of diluted EPS is similar to the computation of basic EPS except that the denominator is increased to include the number of additional common shares that would have been outstanding if the dilutive potential common shares had been issued. There were no potentially dilutive securities outstanding at June 30, 2022, and 2021. Accordingly, basic and diluted earnings (loss) per share is the same for both years.\nRecent Accounting Pronouncements\nIn August 2020, the FASB issued ASU 2020-06, Debt-Debt with Conversion and Other Options (Subtopic 470-20) and Derivatives and Hedging-Contracts in Entitys Own Equity (Subtopic 815-40)-Accounting for Convertible Instruments and Contracts in an Entitys Own Equity. ASU 2020-06 reduces the number of accounting models for convertible debt instruments and convertible preferred stock. For convertible instruments with conversion features that are not required to be accounted for as derivatives under Topic 815, Derivatives and Hedging, or that do not result in substantial premiums accounted for as paid-in capital, the embedded conversion features no longer are separated from the host contract. ASU 2020-06 also removes certain conditions that should be considered in the derivatives scope exception evaluation under Subtopic 815-40, Derivatives and Hedging-Contracts in Entitys Own Equity, and clarify the scope and certain requirements under Subtopic 815-40. In addition, ASU 2020-06 improves the guidance related to the disclosures and earnings-per-share (EPS) for convertible instruments and contract in entitys own equity. ASU 2020-06 is effective for public business entities that meet the definition of a Securities and Exchange Commission (SEC) filer, excluding entities eligible to be smaller reporting companies as defined by the SEC, for fiscal years beginning after December 15, 2021, including interim periods within those fiscal years. For all other entities, the amendments are effective for fiscal years beginning after December 15, 2023, including interim periods within those fiscal years. Early adoption is permitted, but no earlier than fiscal years beginning after December 15, 2020, including interim periods within those fiscal years. The Board specified that an entity should adopt the guidance as of the beginning of its annual fiscal year. The Company has chosen the early adoption of ASU 2020-06. The Companys convertible notes payable are convertible at a fixed conversion price, which at the time of issuance was higher than the market price of the Companys common stock, as such there was neither a derivative nor a beneficial conversion feature to account for.\nThe Company has implemented all new applicable accounting pronouncements that are in effect. These pronouncements did not have any material impact on the financial statements unless otherwise disclosed, and the Company does not believe that there are any other new accounting pronouncements that have been issued that might have a material impact on its financial position or results of operations\nNOTE 3 - GOING CONCERN\nThe accompanying consolidated financial statements have been prepared assuming that the Company will continue as a going concern, which contemplates continuity of operations, realization of assets, and liquidation of liabilities in the normal course of business. As of June 30, 2022, the Company has an accumulated deficit of $6,195,238 ($3,069,884 of which is from the FY 2021 loss on the asset acquisition and disposition of assets).\nWhile the Company is successfully executing its growth strategy, its cash position may not still be sufficient to support the Companys daily operations without additional financing. While the Company believes in the viability of its strategy to produce sales volume and in its ability to raise additional funds, there can be no assurances to that effect. The ability of the Company to continue as a going concern is dependent upon the Companys ability to further implement its business plan and generate sufficient revenues. The consolidated financial statements do not include any adjustments that might be necessary if the Company is unable to continue as a going concern. Management believes that the actions presently being taken to further implement its business plan and generate revenues provide the opportunity for the Company to continue as a going concern.\nNOTE 4 - MACHINERY AND EQUIPMENT\nLong lived assets, including property and equipment and certain intangible assets to be held and used by the Company are reviewed for impairment whenever events or changes in circumstances indicate that the carrying value of the assets may not be recoverable. Impairment losses are recognized if expected future cash flows of the related assets are less than their carrying values. Measurement of an impairment loss is based on the fair value of the asset. Long-lived assets and certain identifiable intangibles to be disposed of are reported at the lower of carrying amount or fair value less cost to sell.\nProperty and Equipment and intangible assets are first recorded at cost. Depreciation and/or amortization is computed using the straight-line method over the estimated useful lives of the various classes of assets between three and five years. Leasehold improvements are being depreciated over ten years, and the building over twenty years.\nMaintenance and repair expenses, as incurred, are charged to expense. Betterments and renewals are capitalized in plant and equipment accounts. Cost and accumulated depreciation applicable to items replaced or retired are eliminated from the related accounts with any gain or loss on the disposition included as income.\nProperty and equipment stated at cost, less accumulated depreciation for continuing operations consisted of the following:\nProperty, Plant & Equipment\nJune 30, 2022 June 30, 2021\nMachinery and Equipment $ 150,483 $ 117,072\nOffice Equipment 3,097 -\nVehicles 41,720 -\nLess: accumulated depreciation (39,701 ) (8,118 )\nProperty and equipment, net $ 155,599 $ 108,954\nDepreciation expense\nDepreciation expense for the years ended June 30, 2022 and 2021 was $36,021 and $10,931, respectively.\nOur capitalized software cost, less accumulated amortization consisted of the following:\nSoftware cost\nJune 30, 2022 June 30, 2021\nSoftware $ - $ 18,000\nLess: accumulated depreciation - (2,750 )\nSoftware, net $ - $ 15,250\nDuring the fourth quarter the Company determined that the software was no longer being used and chose to write off the asset and the associated accumulated amortization for a loss of $$10,750.\nAmortization expense\nAmortization expense for the years ended June 30, 2022 and 2021 was $4,500 and $0, respectively.\nNOTE 5 - CONVERTIBLE NOTES PAYABLE\nOn January 2, 2020, the Company executed a 10% convertible promissory note in which it agreed to borrow up to $300,000. The note is convertible at a price per share equal to the lower of (a) the Fixed Conversion Price (which is fixed at a price equal to $0.30); or (b) 80% of the lowest trading price of the Companys common stock during the 5 consecutive trading days prior to the date on which lender elects to convert all or part of the Note. The initial deposit of $125,000 was made on January 15, 2020, and included a $25,000 OID. As required by ASC 470-20-30-6 the Company recognized and measured the embedded beneficial conversion feature at the commitment date of $200,000 which was credited to paid in capital, a $150,000 debt discount and a $75,000 loss on the issuance of convertible debt. As of December 31, 2021, all of the debt discount has been amortized to interest expense. During the year ended June 30, 2022, the principal and all accrued interest were converted in full into shares of common stock per the terms of the agreement. As of June 30, 2022 and June 30, 2021, there is $0 and $150,000 and $0 and $40,250 of principal and interest, due on this loan, respectively.\nDuring the year ended June 30, 2022, the Company issued, paid and or converted the following new convertible promissory notes.\nSchedule of convertible promissory notes\nNote Holder Date Maturity Date Interest Rate Loan Amount Conversions/Payments Balance\nJune 30, 2022\nPower Up Lending Group Ltd (1) 10/1/2021 10/1/2022 10 % $ 55,000 $ (55,000 ) $ -\nFast Capital LLC (2) 10/26/2021 10/26/2022 10 % $ 65,000 $ (35,000 ) $ 30,000\nSixth Street Lending LLC (3) 11/17/2021 11/17/2022 10 % $ 55,000 $ (55,000 ) $ -\nCoventry Enterprises, LLC (4) 1/5/2022 1/5/2023 10 % $ 180,000 $ (180,000 ) $ -\nONE44 Capital LLC (5) 1/13/2022 1/13/2023 10 % $ 160,000 $ - $ 160,000\nMast Hill Fund, L.P. (6) 1/20/2022 1/20/2023 12 % $ 350,000 $ - $ 350,000\nSixth Street Lending LLC (7) 2/1/2022 2/1/2023 10 % $ 80,000 $ - $ 80,000\nONE44 Capital LLC (5) 3/22/2022 3/22/2023 10 % $ 120,000 $ - $ 120,000\nSixth Street Lending LLC (7) 4/13/2022 4/13/2023 10 % $ 55,000 $ - $ 55,000\n1800 Diagonal Lending LLC (7) 5/23/2022 5/23/2023 10 % $ 55,000 $ - $ 55,000\nCoventry Enterprises, LLC (4) 6/3/2022 6/3/2023 10 % $ 480,000 $ - $ 480,000\nTotal $ 1,655,000 $ (325,000 ) $ 1,330,000\nLess debt discount\n$ (424,889 )\n$ 905,111\nConversion Terms\n(1) 61% of the average of the three lowest trading price for 15 days prior to conversion date.\n(2) 61% of the lowest trading price for 15 days, including conversion date.\n(3) 61% of the lowest trading price for 15 days prior to conversion date.\n(4) Convertible only upon an event of default. 90% of the lowest trading price for 10 days prior to conversion date.\n(5) 60% of the lowest trading price for 20 days, including conversion date.\n(6) Convertible only upon an event of default. Conversion would then be $0.10.\n(7) 61% of the lowest trading price for 15 days prior to conversion date.\nTotal accrued interest on the above convertible notes as of June 30, 2022, is $109,769.\nA summary of the activity of the derivative liability for the notes above is as follows:\nSchedule of derivative liability\nBalance at June 30, 2021\n-\nIncrease to derivative due to new issuances 1,648,566\nDecrease to derivative due to conversion/payments (18,162 )\nDerivative gain due to mark to market adjustment (967,422 )\nBalance at June 30, 2022 $ 662,982\nA summary of quantitative information about significant unobservable inputs (Level 3 inputs) used in measuring the Companys derivative liability that are categorized within Level 3 of the fair value hierarchy as of June 30, 2022, is as follows:\nSchedule of fair value hierarchy\nInputs June 30, 2022 Initial\nValuation\nStock price $ 0.0086 $0.018 - 0.24\nConversion price $ .0049 $0.010 - 0.082\nVolatility (annual) 217.25% - 235.22% 311.48% - 35.86%\nRisk-free rate 1.72% - 2.51% 0.09% - 2.09 %\nDividend rate - -\nYears to maturity .32 - .9\nNOTE 6 - NOTE PAYABLE\nOn November 5, 2017, to fund its working capital requirements the Company obtained a Special Line of Credit (LOC) also recognized as a Blanket Secured Promissory Note for the total draw down amount of up to $500,000, from Twiga Capital Partners, LLC (TCP), an entity controlled by the Companys former sole officer and largest stockholder, Shefali Vibhakar. This Note is secured by all of the assets of the Company in accordance with the Security Agreement by and between the Company and the Holder dated as of November 5, 2017. The LO\nC bears interest at 5% per annum and is due on demand. On January 21, 2021, TCP assigned all of its rights, title and interest in the debt to Front Row Seating Inc. On September 28, 2021, $100,000 of the note was converted into 10,000,000 shares of common stock. As of June 30, 2022 and June 30, 2021, the Company owed $22,729 and $122,729 of principal and $19,796 and $17,399 of accrued interest, respectively.\nNOTE 7 - COMMON STOCK\nOn February 19, 2021, the Company filed a Definitive 14C in order to ratify the written consent received from one shareholder, holding 96.1% of our voting power to: (1) to amend the Companys Articles of Incorporation, as amended (the Articles) to change our corporate name from Genesys Industries, Inc. to Forza Innovations Inc. (the Name Change); (2) to amend the Articles to increase the number of authorized shares of Class A Common Stock we may issue from 100,000,000 to 700,000,000 (the Share Increase); and, (3) to increase the number of the Company's total issued and outstanding shares of Class A Common Stock by conducting a forward stock split at the rate of 10 shares every 1 share currently issued and outstanding (the Forward Split). All shares through these financial statements have been retroactively adjusted to reflect the forward split.\nOn October 20, 2021, the Company entered into a $3,000,000 equity line financing agreement (the Investment Agreement) with Tangiers Global, LLC (Tangiers), as well as a registration right agreement related thereto (the Registration Rights Agreement). The financing is over a maximum of 36 months. Pursuant to the Registration Rights Agreement, a maximum of 7,000,000 shares of our common stock that we may sell to Tangiers from time to time will be registered by us on Form S-1 with the Securities and Exchange Commission under the Securities Act of 1933, as amended, for this financing. We are required to use our best efforts to file the Registration Statement within 45 days of the date the Investment Agreement.\nSubject to the terms and conditions of the Investment Agreement, from time to time, the Company may, in its sole discretion, deliver a Put Notice to Tangiers which states the number of shares that the Company intends to sell to Tangiers on a closing date. The maximum amount of shares of Common Stock that the Company shall be entitled to put to Tangiers per any applicable Put Notice shall be an amount of shares up to or equal to 100% of the average of the daily trading volume of the Common Stock for the 10 consecutive Trading Days immediately prior to the applicable Put Notice Date (the Put Amount). The Put Amount has to be at least $5,000 and cannot exceed $300,000, as calculated by multiplying the Put Amount by the average daily VWAP for the 10 consecutive Trading Days immediately prior to the applicable Put Notice Date. The Purchase Price of the shares of our common stock that we may sell to Tangiers will be 80% of the lowest trading price of the Common Stock during the Pricing Period applicable to the Put Notice.\nThe Company issued Tangiers 25,000 shares of its Common Stock as a commitment fee. The shares were valued at $0.1373, the closing price on the date of grant for total non-cash expense of $3,431. As of June 30, 2022, the shares have not yet been issued by the transfer agent and are disclosed as common stock to be issued.\nDuring the year ended June 30, 2022, Tangiers converted $205,691 of principal and interest into 11,608,313 shares of common stock, converting the Note in full.\nDuring the year ended June 30, 2022, Front Row Seating Inc. converted $100,000 of principal into 10,000,000 shares of common stock (see Note 6).\nOn January 5, 2022, the Company entered into a securities purchase agreement with Coventry Enterprises, LLC (Coventry). Pursuant to the terms of the agreement, the Company issued 200,000 shares of common stock to Coventry. The shares were valued at $0.085, the closing stock price on the date of grant, for total non-cash expense of $17,000.\nOn January 20, 2022, the Company entered into a securities purchase agreement with Mast Hill Fund, L.P., (Mast Hill). Pursuant to the terms of the agreement, the Company issued 2,500,000 shares of common stock to Mast Hill for a commitment fee. The shares were valued at $0.0589, the closing stock price on the date of grant, for total non-cash expense of $147,250.\nDuring the fourth quarter Mast Hill purchased 5,000,000 shares of common stock for total cash payment of $36,005.\nDuring the fourth quarter Fast Capital. LLC converted $35,000 of their note payable into 5,000,000 shares of common stock.\nThe Company entered into a Marketing Services Agreement dated as of April 14, 2022 (the Agreement) with North Equities Corp. (North Equities) to provide marketing services to the Company. Pursuant to the terms of the Agreement, the Company issued 1,201,262 shares of common stock to North Equities. The shares were valued at $0.03, the closing stock price on the date of grant, for total non-cash expense of $36,038.\nNOTE 8 - PREFERRED STOCK\nPreferred stock includes 25,000,000 shares of authorized at a par value of $0.001. Preferred stock includes 25,000,000 shares of Class B authorized at a par value of $0.001. The Preferred Stock constitutes a convertible stock in which (1) one Preferred Share is convertible into (5) five Common Shares. The Preferred Stockholders are entitled to vote on any matters on which the common stockholders are entitled to vote.\nNOTE 9 - RELATED PARTY TRANSACTIONS\nOn January 21, 2021, the Company entered into an acquisition agreement with Mr. Forzani to acquire all of the ownership and the rights to certain late developmental stage products, including the J4 Sport, J4 X and J4 Fitbelt in exchange for the issuance of 10,000,000 common shares. The shares were valued at $0.28, the closing stock price on the date of the agreement, for a total value of $2,800,000. The assets were valued at cost of $95,135, resulting in a loss on asset acquisition of $2,704,865. As a result of this acquisition, the Company is moving out of the precision CNC manufacturing and fabrication business and moving into the health-tech wearable performance business.\nDuring the year ended June 30, 2021, Mr. Forzani advanced the Company $54,833, for general operating expenses, the advance is non-interest bearing and due on demand. During the year ended June 30, 2022, Mr. Forzani advanced the Company an additional $27,088 and was repaid $62,516, for a total due as of June 30, 2022, of $19,406.\nOn August 23, 2021, Mr. Forzani exercised 400,000 of his options for $20,000.\nOn October 26, 2021, Geoff Stanbury exercised 100,000 of his options for $4,043.\nOn June 8, 2022, Mr. Forzani agreed to cancel and return to treasury 100,000,000 shares of common stock issued in his name. The shares were cancelled in order to allow for enough shares to reserve pursuant to the terms of a the Promissory Note with Coventry Enterprises, LLC dated June 3, 2022.\nNOTE 10- STOCK OPTIONS\nOn August 3, 2021, the Company granted 1,000,000 options to Johnny Forzani, CEO, 250,000 options to Geoff Stanbury, director, and 250,000 options to Tom Forzani, Director. The options were issued pursuant the Companys 2021 Equity Award Plan. The options are exercisable at $0.05, are immediately vested and expire in two years.\nThe aggregate fair value of the 1,500,000 options, totaled $854,550 based on the Black Scholes Merton pricing model using the following estimates: exercise price of $0.05, 0.17% risk free rate, 704.9% volatility and expected life of the options of 2 years.\nA summary of the status of the Companys outstanding stock options and changes during the year ended June 30, 2022 is presented below:\nSchedule of Stock Options Outstanding\nStock Options Options Weighted Average\nExercise\nPrice Aggregate\nIntrinsic\nValue\nOptions outstanding at June 30, 2021 - $ - -\nGranted 1,500,000 0.05 -\nExercised (500,000 $ -\nExpired - $ -\nOptions outstanding at June 30, 2022 1,000,000 $ 0.05\nOptions exercisable at June 30, 2022 1,000,000 $ 0.05 $ -\nNOTE 11 - WARRANTS\nOn January 5, 2022, the Company issued warrants to purchase up to 900,000 shares of common stock to Coventry in conjunction with convertible debt. The warrants are exercisable for 5 years, with a price of $0.175. Using the fair value calculation, the relative fair value between the debt issued and the warrants was calculated to determine the warrants recorded equity amount of $63,908, accounted for in additional paid in capital.\nOn January 20, 2022, the Company issued warrants to purchase up to 700,000 and 350,000 shares of common stock to Mast Hill in conjunction with convertible debt. The warrants are exercisable for 5 years, with a price of $0.50 and $1.00, respectively. Using the fair value calculation, the relative fair value between the debt issued and the warrants was calculated to determine the warrants recorded equity amount of $45,652, accounted for in additional paid in capital.\nThe warrants were evaluated for purposes of classification between liability and equity. The warrants do not contain features that would require a liability classification and are therefore considered equity.\nThe Black Scholes pricing model was used to estimate the fair value of the warrants issued with the following inputs:\nFair value assumptions\nNumber of Warrants $ 900,000 $ 700,000 $ 350,000\nShare price $ 0.11 $ 0.05 $ 0.05\nExercise Price $ 0.175 $ 0.50 $ 1.00\nTerm 5 years 5 years 5 years\nVolatility 638.91 % 634.09 % 634.09 %\nRisk Free Interest Rate 1.43 1.62 1.62\nDividend rate - - -\nIntrinsic value\t $ - $ - $ -\nA summary of the status of the Companys outstanding stock options and changes during the year ended June 30, 2022 is presented below:\nSchedule of outstanding stock options\nWarrants Warrants Weighted Average\nExercise\nPrice Aggregate\nIntrinsic\nValue\nWarrants outstanding at June 30, 2021 - $ -\nGranted 1,950,000 $ 0.44\nExercised - $ -\nExpired - $ -\nWarrants outstanding at June 30, 2022 1,950,000 $ 0.44\nWarrants exercisable at June 30, 2022 1,950,000 $ 0.44 $ -\nNOTE 12 - INCOME TAXES\nDeferred taxes are provided on a liability method whereby deferred tax assets are recognized for deductible temporary differences and operating loss and tax credit carry forwards and deferred tax liabilities are recognized for taxable temporary differences. Temporary differences are the differences between the reported amounts of assets and liabilities and their tax bases. Deferred tax assets are reduced by a valuation allowance when, in the opinion of management, it is more likely than not that some portion or all of the deferred tax assets will not be realized. The Company has evaluated Staff Accounting Bulletin No. 118 regarding the impact of the decreased tax rates of the Tax Cuts & Jobs Act. Deferred tax assets and liabilities are adjusted for the effects of changes in tax laws and rates on the date of enactment. The U.S. federal income tax rate of 21% is being used for the fiscal year ended June 30, 2022 and 2021.\nNet deferred tax assets consist of the following components as of June 30:\nSchedule of net deferred tax assets\nDeferred Tax Assets:\nNOL Carryover $ 1,301,000 $ 732,000\nDeferred tax liabilities:\nLess valuation allowance (1,301,000 ) $ (732,000 )\nNet deferred tax assets $ - $ -\nThe income tax provision differs from the amount of income tax determined by applying the U.S. federal income tax rate to pretax income from continuing operations for the period ended June 30, due to the following:\nSchedule of income tax provision\nFederal income tax benefit attributable to:\nCurrent operations $ (567,000 ) $ (658,000 )\nLess: Valuation allowance 567,000 658,000\nNet provision for Federal income taxes $ - $ -\nAt June 30, 2022, the Company had net operating loss carry forwards of approximately $1,301,000 that may be offset against future taxable income from the year 2023 to 2041. No tax benefit has been reported in the June 30, 2022 financial statements since the potential tax benefit is offset by a valuation allowance of the same amount.\nDue to the change in ownership provisions of the Tax Reform Act of 1986, net operating loss carry forwards for Federal Income tax reporting purposes are subject to annual limitations. Should a change in ownership occur, net operating loss carry forwards may be limited as to use in future years.\nNOTE 13 - DISCONTINUED OPERATIONS\nOn January 21, 2021, Shefali Vibhakar, President of the Company closed a Share Purchase Agreement (the Agreement) that she entered into with Johnny Forzani to sell all of her 17,000,000 common shares and 10,000,000 preferred shares to Johnny Forzani for cash consideration of $177,000.\nFurther, as part of the Agreement, Ms. Vibhakar agrees to spin out all of the Companys assets (except for certain machinery valued at $40,000 - which is subject to a separate purchase agreement) as well as all of the Companys liabilities (except the Companys note with Tangiers Capital, LLC and Twiga Capital). The value date of the assets and liabilities will be January 21, 2021.\nIn accordance with the provisions of ASC 205-20, Presentation of Financial Statements, we have separately reported the assets and liabilities of the discontinued operations in the consolidated balance sheets. The income and expenses have been reflected as discontinued operations in the consolidated Statements of Operations for the year ended June 30, 2021, and consist of the following:\nDisposal Groups, Including Discontinued Operations\nFor the Year Ended June 30, 2021\nRevenue $ 381,472\nCost of revenue 269,638\nGross Margin 111,834\nOperating Expenses:\nPayroll expense 32,676\nGeneral & administrative expenses 37,882\nTotal operating expenses 70,558\nIncome from operations 41,276\nTotal other expense (15,854 )\nNet income from discontinued operations $ 25,442\nNOTE 14 - SUBSEQUENT EVENTS\nIn accordance with SFAS 165 (ASC 855-10) management has performed an evaluation of subsequent events through the date that the financial statements were available to be issued and has determined that it has no material subsequent events to disclose in these consolidated financial statements other than the following.\nEffective July 25, 2022, the Company reissued the 100,000,000 shares of common stock that were previously cancelled by its Mr. Forzani. The cancellation was reported on a Form 8-K filed June 15, 2022 (the Previous 8-K). Mr. Forzani temporarily cancelled his shares in order for the Company to complete the financing reported on the Previous 8-K.\nOn September 7, 2022, the Company filed with the Secretary of State of the State of Wyoming, an Articles of Amendment (the Amendment) designating the terms, preferences and rights of the 25,000,000 shares of the Company's previously authorized Class B Preferred Stock. Each share of Class B Preferred Stock entitles the holder thereof to ten thousand votes per share on all matters to be voted on by the holders of the Companys common stock and is convertible into shares of the Company's common stock at the same rate. With respect to rights on liquidation, dissolution or winding up, shares of Class B Preferred Stock rank on parity with the Company's common stock.\nOn September 23, 2022, the Company, closed a Securities Purchase Agreement (the Purchase Agreement) with Mast Hill Fund, L.P., a Delaware limited partnership (Mast Hill), dated as of September 19, 2022, pursuant to which the Company issued Mast Hill a convertible promissory note in the principal amount of $290,000 (the Note), a five-year warrant to purchase up to 100,000,000 shares of common stock at a price of $0.003 per share (the First Warrant) and a warrant to purchase up to 100,000,000 shares of common stock at a price of $0.003 per share (the Second Warrant), which warrants are only exercisable upon an Event of Default as defined in the Note. The Note matures on September 19, 2023, and bears interest at a rate of 12% per annum. The Note is convertible into shares of common stock at $0.0015. The Note contains an original issue discount amount of $29,000 and legal fees payable to Mast Hills legal counsel of $5,000."
}