{
    "cik": "1696195",
    "company": "KINETIC GROUP INC.",
    "filing_type": "10-K",
    "filing_date": "2022-11-14",
    "period_of_report": "2022-09-30",
    "sic": "7310",
    "state_of_inc": "NV",
    "state_location": "FL",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1696195/0001477932-22-008397-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1696195/000147793222008397/knit_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1696195/0001477932-22-008397.txt",
    "filename": "1696195_10K_2022_0001477932-22-008397.htm",
    "content": "Item 1.\nBUSINESS\nOur Business\nKinetic Group Inc., a Nevada corporation, (the Company) was formed under the laws of the State of Nevada on June 6, 2014. Kinetic Group changed business core and now is a telecommunications company focused on owning, operating and building wireless infrastructure for international mobile carriers in Latin America. The company rents, operates and builds tower/rooftop/unconventional infrastructure, fiber optic networks, DAS and telecommunication equipment for MNO's. The Company will generate revenue from acquisitions and operations in Latin America.\nOn May 18, 2022 The Company announced signed a binding Letter of Intent (\"LOI\") with GSS INFRASTRUCTURE (\"GSSI\") www.gssinfrastructure.com to acquire a 100% interest in GSSI. The Transaction remains subject to certain conditions being met until definitive completion.\nOn Aug. 18, 2022 The Company announced that it has entered into a formal agreement with International Monetary, www.intlmonetary.com, a merchant bank based in Newport Beach, CA, who will assist KNIT in identifying new business prospects and strategic partnerships, as well as source capital so the company can continue to expand. With this agreement KNIT has an additional support which serve to put the company in position to achieve its stated goals of expanding our shareholder base, raising awareness of the company in the marketplace, and uncovering interesting opportunities going forward.\nKinetic Group Inc. is a development stage company as defined by section 915-10-20 of the FASB Accounting Standards Codification. Although the Company has recognized nominal amounts of revenue, it is still devoting substantially all of its efforts on establishing its business. All losses accumulated since Inception (June 6, 2014) have been considered as part of the Companys development stage activities.\nIn June 2014, the FASB issued ASU No. 2014-10, Development Stage Entities (Topic 915): Elimination of CertainFinancial Reporting Requirements, Including an Amendment to Variable Interest Entities Guidance in Topic 810, Consolidation.\nThe amendments in this Update remove the definition of a development stage entity from the Master Glossary of the Accounting Standards Codification, thereby removing the financial reporting distinction between development stage entities and other reporting entities from U.S. GAAP. In addition, the amendments eliminate the requirements for development stage entities to (1) present inception-to-date information in the statements of income, cash flows, and shareholder equity, (2) label the financial statements as those of a development stage entity, (3) disclose a description of the development stage activities in which the entity is engaged, and (4) disclose in the first year in which the entity is no longer a development stage entity that in prior years it had been in the development stage.\nFor public business entities, those amendments are effective for annual reporting periods beginning after December 15, 2014, and interim periods therein. Kinetic Group has elected to early adopt Accounting Standards Update No. 2014-10, Development Stage Entities (Topic 915): Elimination of Certain Financial Reporting Requirements. The adoption of this ASU allows the company to remove the inception to date information and all references to development stage.\nPatent, Trademark, License and Franchise Restrictions and Contractual Obligations and Concessions\nWe do not own, either legally or beneficially, any patents or trademarks.\nResearch and Development Activities\nOther than time spent researching our proposed business we have not spent any funds on research and development activities to date. We do not currently plan to spend any funds on research and development activities in the future.\nCompliance with Environmental Laws\nWe are not aware of any environmental laws that have been enacted, nor are we aware of any such laws being contemplated for the future, that impact issues specific to our business.\nEmployees\nAs of September 30, 2022 we had two employees - Ana Maria Mendez, our President and Chairwoman and Roberto Mora, Chief Financial Officer. Our officers and directors are responsible for planning, developing and operational duties, and will continue to do so throughout the early stages of our growth.\nReports to Securities Holders\nWe provide an annual report that includes audited financial information to our shareholders. We will make our financial information equally available to any interested parties or investors through compliance with the disclosure rules for a small business issuer under the Securities Exchange Act of 1934. We are voluntarily subject to disclosure filing requirements including filing Form 10K annually and Form 10Q quarterly. In addition, we will file Form 8K and other proxy and information statements from time to time as required. The public may read and copy any materials that we file with the Securities and Exchange Commission, (SEC), at the SECs Public Reference Room at 100 F Street NE, Washington, DC 20549.\nThe public may obtain information on the operation of the Public Reference Room by calling the SEC at 1-800-SEC-0330. The SEC maintains an Internet site (http://www.sec.gov) that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC. Item 1A.\nRISK FACTORS\nKinetic Group Inc. is a Development Stage Company. The Company has elected to early adopt Accounting Standards Update No.2014-10, Development Stage Entities (Topic 915): Elimination of Certain Financial Reporting Requirements. The adoption of this ASU allows the Company to remove the inception to date information and all references to the development Stage from its financial statements.\nKinetic Group Inc. is a Development Stage Company as defined by section 915-10-20 of the FASB Accounting Standards Codification. Although the Company has recognized nominal amounts of revenue, it is still devoting substantially all of its efforts on establishing the business. All losses accumulated since Inception (June 6, 2014) have been considered as part of the Companys development Stage activities.\nIn June 2014, the FASB issued ASU No. 2014-10, Development Stage Entities (Topic 915): Elimination of Certain Financial Reporting Requirements, Including an Amendment to Variable Interest Entities Guidance in Topic 810, Consolidation.\nThe amendments in this update remove the definition of Development Stage entity from the Master Glossary of the Accounting Standards Codification, thereby removing the financial reporting distinction between Development Stage entities and other reporting entities from U.S. GAAP.\nIn addition, the amendments eliminate the requirements for Development Stage entities to (1) present inception-to-date information in the statements of income, cash flows, and shareholder equity, (2) label the financial statements as those of a Development Stage entity, (3) disclose a description of the Development Stage activities in which the entity is engaged, and (4) disclose in the first year in which the entity is no longer a Development Stage entity that in prior years it had been in the Development Stage.\nFor public business entities, those amendments are effective for annual reporting periods beginning after December 15, 2014, and interim periods therein. Kinetic Group has elected to early adopt Accounting Standards Update No. 2014-10, Development Stage Entities (Topic 915): Elimination of Certain Financial Reporting Requirements. The adoption of this ASU allows the company to remove the inception to date information and all references to Development Stage.\nKinetic Group Inc. is an emerging growth company under the Jumpstart Our Business Startups Act. We cannot be certain if the reduced reporting requirements applicable to emerging growth companies will make our shares of common stock less attractive to investors.\nKinetic Group Inc. is and will remain an emerging growth company until the earliest to occur of (a) the last day of the fiscal year during which its total annual revenues equal or exceed $1 billion (subject to adjustment for inflation), (b) the last day of the fiscal year following the fifth anniversary of its initial public offering, (c) the date on which Kinetic Group has, during the previous three-year period, issued more than $1 billion in non-convertible debt securities, or (d) the date on which Kinetic Group is deemed a large accelerated filer (with at least $700 million in public float) under the Securities and Exchange Act of 1934.\nFor so long as Kinetic Group remains an emerging growth company as defined in the JOBS Act, it may take advantage of certain exemptions from various reporting requirements that are applicable to other public companies that are not emerging growth companies as described in further detail in the risk factors below. Kinetic Group cannot predict if investors will consider its shares of common stock less attractive because our reliance on some or all of these exemptions. If some investors find Kinetic Groups shares of common stock less attractive as a result, the trading market for its shares of common stock may be less active, and its stock price may be more volatile.\nIf Kinetic Group avails itself of certain exemptions from various reporting requirements, its reduced disclosure may make it more difficult for investors and securities analysts to evaluate Kinetic Group and may result in less investor confidence.\nThe recently enacted JOBS Act is intended to reduce the regulatory burden on emerging growth companies. Kinetic Group meets the definition of an emerging growth company and so long as it qualifies as an emerging growth company, it will not be required to:\n●\nhave an auditor report on our internal controls over financial reporting pursuant to Section 404(b) of the Sarbanes-Oxley Act;\n●\ncomply with any requirement that may be adopted by the Public Company Accounting Oversight Board regarding mandatory audit firm rotation or a supplement to the auditors report providing additional information about the audit and the financial statements (i.e., an auditor discussion and analysis);\n●\nsubmit certain executive compensation matters to shareholder advisory votes, such as say-on-pay and say-on-frequency; and\n●\ndisclose certain executive compensation related items such as the correlation between executive compensation and performance and comparisons of the CEOs compensation to median employee compensation.\nIn addition, Section 107 of the JOBS Act also provides that an emerging growth company can take advantage of the extended transition period provided in Section 7(a)(2)(B) of the Securities Act for complying with new or revised accounting standards. In other words, an emerging growth company can delay the adoption of certain accounting standards until those standards would otherwise apply to private companies. However, Kinetic Group is choosing to opt out of such extended transition period, and as a result, Kinetic Group will comply with new or revised accounting standards on the relevant dates on which adoption of such standards is required for non-emerging growth companies. Section 107 of the JOBS Act provides that its decision to opt out of the extended transition period for complying with new or revised accounting standards is irrevocable.\nNotwithstanding the above, we are also currently a smaller reporting company, meaning that we are not an investment company, an asset-backed issuer, or a majority-owned subsidiary of a parent company that is not a smaller reporting company and have a public float of less than $75 million and annual revenues of less than $50 million during the most recently completed fiscal year. In the event that we are still considered a smaller reporting company, at such time are we cease being an emerging growth company, we will be required to provide additional disclosure in our SEC filings. However, similar to emerging growth companies, smaller reporting companies are able to provide simplified executive compensation disclosures in their filings; are exempt from the provisions of Section 404(b) of the Sarbanes-Oxley Act requiring that independent registered public accounting firms provide an attestation report on the effectiveness of internal control over financial reporting; are not required to conduct say-on-pay and frequency votes until annual meetings occurring on or after January 21, 2013; and have certain other decreased disclosure obligations in their SEC filings, including, among other things, only being required to provide two years of audited financial statements in annual reports.\nDecreased disclosures in our SEC filings due to our status as an emerging growth company or smaller reporting company may make it harder for investors to analyze the Companys results of operations and financial prospects.\nWe lack an operating history. There is no assurance our future operations will result in profitable revenues. If we cannot generate sufficient revenues to operate profitably, our business will fail.\nAs of September 30, 2022, we had accumulated a deficit of $-250,779. We have a limited operating history upon which an evaluation of our future success or failure can be made. Based on current plans, we expect to generate revenues in short time. However, our revenues may not be sufficient to cover our operating costs initially. We cannot guarantee that we will be successful in generating significant revenues in the future. Failure to achieve a sustainable investment and operations level will cause us to go out of business.\nIf we encounter unforeseen difficulties with our business or operations in the future that require us to obtain additional working capital, and we cannot obtain additional working capital on favorable terms, or at all, our business may suffer.\nTo date, we have relied primarily upon cash from the private sale of equity securities and operational activities and directly from our shareholders.\nWe may encounter unforeseen difficulties with our business or operations in the future that may deplete our capital resources more rapidly than anticipated. As a result, we may be required to obtain additional working capital in the future through bank credit facilities, public or private debt or equity financings, or otherwise. We have identified other sources for additional funding but we cannot be certain that additional funding will be available on acceptable terms, or at all. If we are required to raise additional working capital in the future, such financing may be unavailable to us on favorable terms, if at all, or may be dilutive to our existing stockholders. If we fail to obtain additional working capital as and when needed, such failure could have a material adverse impact on our business, results of operations and financial condition. Furthermore, such lack of funds may inhibit our ability to respond to competitive pressures or unanticipated capital needs, or may force us to reduce operating expenses, which could significantly harm the business and development of operations. Similarly, our ability to borrow any such capital may be more expensive and difficult to obtain until this going concern uncertainty is resolved.\nWe are a Nevada corporation and, as such, are subject to the jurisdiction of the State of Nevada and the United States courts for purposes of any lawsuit, action or proceeding by investors herein. An investor would have the ability to effect service of process in any action on the company within the United States.\nOur President resides outside the United States but she is an American citizen and our director, resides in the United States and he is a United States citizen. Substantially all or a portion of their assets are located in the United States. As a result, it may be possible for investors to:\n●\neffect service of process within the United States against your officers or directors;\n●\nenforce U.S. court judgments based upon the civil liability provisions of the U.S. federal securities laws against any of the above referenced persons in the United States;\n●\nenforce in courts U.S. court judgments based on the civil liability provisions of the U.S. federal securities laws against the above persons; and\n●\nAvoid bring an original action in foreign courts to enforce liabilities based upon the U.S. federal securities laws against the above foreign persons.\nWe do not have a majority of independent directors on our Board and the Company has voluntarily implemented various corporate governance measures, with which stockholders may have more protections against interested director transactions, conflicts of interest and similar matters.\nFederal legislation, including the Sarbanes-Oxley Act of 2002, has resulted in the adoption of various corporate governance measures designed to promote the integrity of the corporate management and the securities markets. Some of these measures have been adopted in response to legal requirements. Others have been adopted by companies in response to the requirements of national securities exchanges, such as the NYSE or the NASDAQ Stock Market, on which their securities are listed. Among the corporate governance measures that are required under the rules of national securities exchanges are those that address the board of directors independence, audit committee oversight, and the adoption of a code of ethics. We have not yet adopted any of these other corporate governance measures and since our securities are not yet listed on a national securities exchange, we are not required to do so.\nOur Board of Directors is comprised of one individual, who is also our executive officer. As a result, we do not have independent directors on our Board of Directors.\nWe have not adopted corporate governance measures such as an audit or other independent committee of our board of directors, as we presently do not have independent directors on our board. If we expand our board membership in future periods to include additional independent directors, we may seek to establish an audit and other committee of our board of directors. It is possible that if our Board of Directors included independent directors and if we were to adopt some or all of these corporate governance measures, stockholders would benefit from somewhat greater assurance that internal corporate decisions were being made by disinterested directors and that policies had been implemented to define responsible conduct. For example, at present in the absence of audit, nominating and compensation committees comprised of at least a majority of independent directors, decisions concerning matters such as compensation packages or employment contracts to our senior officers are made by a majority of directors or shareholders who have an interest in the outcome of the matters being decided. However, as a general rule, the board of directors, in making its decisions, determines first that the terms of such transaction are no less favorable to us that those that would be available to us with respect to such a transaction from unaffiliated third parties. The company executes the transaction between executive officers and the company once it was approved by the Board of Directors.\nProspective investors should bear in mind our current lack of corporate governance measures in formulating their investment decisions.\nNone of the members of our Board of Directors are considered audit committee financial experts. If we fail to maintain an effective system of internal control over financial reporting, we may not be able to accurately report our financial results. As a result, current and potential shareholders could lose confidence in our financial reporting, which would harm our business and the trading price of our stock.\nMembers of our Board of Directors are inexperienced with U.S. GAAP and the related internal control procedures required of U.S. public companies. Management has determined that our internal audit function is also significantly deficient due to insufficient qualified resources to perform internal audit functions. Finally, we have not established an Audit Committee of our Board of Directors.\nWe are a development stage company with limited resources. Therefore, we cannot assure investors that we will be able to maintain effective internal controls over financial reporting based on criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in Internal Control-Integrated Framework. A material weakness is a deficiency, or a combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of the companys annual or interim financial statements will not be prevented or detected on a timely basis. For these reasons, we are considering the costs and benefits associated with improving and documenting our disclosure controls and procedures and internal controls and procedures, which includes (i) hiring additional personnel with sufficient U.S. GAAP experience and (ii) implementing ongoing training in U.S. GAAP requirements for our CFO and accounting and other finance personnel.\nIf the result of these efforts are not successful, or if material weaknesses are identified in our internal control over financial reporting, our management will be unable to report favorably as to the effectiveness of our internal control over financial reporting and/or our disclosure controls and procedures, and we could be required to further implement expensive and time-consuming remedial measures and potentially lose investor confidence in the accuracy and completeness of our financial reports which could have an adverse effect on our stock price and potentially subject us to litigation.\nOur current President and director owns 39.85% of the outstanding shares of our common stock as of the date of this filing. Accordingly, they have not a significant influence in determining the outcome of all corporate transactions or other matters, including mergers, consolidations and the sale of all or substantially all of our assets. They are not able to exercise complete control over the company and have the ability to make decisions regarding, (i) whether to issue common stock and preferred stock, including decisions to issue common and preferred stock to themselves; (ii) employment decisions, including their own compensation arrangements, (iii) the appointment of all directors; and (iv) whether to enter into material transactions with related parties. The interests of our directors may differ from the interests of the other stockholders and thus result in corporate decisions that are disadvantageous to other shareholders.\nThe Company is subject to the 15(d) reporting requirements under the Securities Exchange Act of 1934 which does not require a company to file all the same reports and information as a fully reporting company.\nUntil our common stock is registered under the Exchange Act, we will not be a fully reporting company, but only subject to the reporting obligations imposed by Section 15(d) of the Securities Exchange Act of 1934.\nPursuant to Section 15(d), we are required to file periodic reports with the SEC, such as annual reports on Form 10-K, quarterly reports on Form 10-Q, and current reports on Form 8-K, once this registration statement is declared effective, including the annual report on Form 10-K for the fiscal year during which the registration statement is declared effective. Our registration statement was declared effective on March 28, 2017, during the year ended September 30, 2017. That filing obligation will generally apply even if our reporting obligations have been suspended automatically under section 15(d) of the Exchange Act prior to the due date for the Form 10-K.\nAfter that fiscal year and provided the Company has less than 300 shareholders, the Company is not required to file these reports. If the reports are not filed, the investors will have reduced visibility as to the Company and its financial condition.\nIn addition, as a filer subject to Section 15(d) of the Exchange Act, the Company is not required to prepare proxy or information statements; our common stock will not be subject to the protection of the going private regulations; the company will be subject to only limited portions of the tender offer rules; our officers, directors, and more than ten (10%) percent shareholders are not required to file beneficial ownership reports about their holdings in our company; that these persons will not be subject to the short-swing profit recovery provisions of the Exchange Act; and that more than five percent (5%) holders of classes of your equity securities will not be required to report information about their ownership positions in the securities.\nWe will not be required to evaluate our internal control over financial reporting under Section 404 of the Sarbanes-Oxley Act until the end of the second fiscal year reported upon in our second annual report on form 10-K.\nThe Sarbanes-Oxley Act of 2002 and the new rules subsequently implemented by the Securities and Exchange Commissions, the Financial Industry Regulatory Authority (FINRA) and the Public Company Accounting Oversight Board have imposed various new requirements on public companies, including requiring changes in corporate governance practices. We expect these rules and regulations to increase our legal and financial compliance costs and to make some activities more time-consuming and costly. These costs could affect profitability and our results of operations.\nWe are in the process of determining whether our existing internal controls over financial reporting systems are compliant with Section 404. We will not be required to conduct the evaluation of effectiveness of our internal controls until the end of the fiscal year reported upon in our second annual report on Form 10-K.\nIn addition, because we are a smaller reporting company, we are not required to obtain the auditor attestation of managements evaluation of internal controls over financial reporting. If we obtain and disclose such reports we could continue doing so at our discretion so long as we remain a smaller reporting company.\nThis process of internal control evaluation and attestation may divert internal resources and will take a significant amount of time, effort and expense to complete. If it is determined that we are not in compliance with Section 404, we may be required to implement new internal control procedures and re-evaluate our financial reporting. If we are unable to implement these changes effectively or efficiently, it could harm our operations, financial reporting or financial results, which could adversely affect our ability to comply with our periodic reporting obligations under the Exchange Act.\nRisks Related to our Common Stock and this Offering\nBecause we do not intend to pay any cash dividends on our common stock, our stockholders will not be able to receive a return on their shares unless they sell them.\nWe intend to retain any future earnings to finance the development and expansion of our business. We have never paid any cash dividends and currently do not intend to pay any dividends for the foreseeable future. To the extent that we require additional funding currently not provided for in our financing plan, our funding sources may likely prohibit the payment of a dividend. Because we do not intend to declare dividends, any gain on an investment in Kinetic Group Inc. will need to come through appreciation of the stocks price.\nFINRA sales practice requirements may limit a stockholders ability to buy and sell our stock.\nIn addition to the penny stock rules described below, FINRA has adopted rules that require that in recommending an investment to a customer, a broker-dealer must have reasonable grounds for believing that the investment is suitable for that customer. Prior to recommending speculative low priced securities to their non-institutional customers, broker-dealers must make reasonable efforts to obtain information about the customers financial status, tax status, investment objectives and other information. Under interpretations of these rules, FINRA believes that there is a high probability that speculative low priced securities will not be suitable for at least some customers. The FINRA requirements make it more difficult for broker-dealers to recommend that their customers buy our common stock, which may have the effect of reducing the level of trading activity in our common stock. As a result, fewer broker-dealers may be willing to make a market in our common stock, reducing a stockholders ability to resell shares of our common stock.\nOur common stock was accepted for quotation on the OTC Bulletin Board and OTC Link during the year ended September 30, 2018. As a result, the application of the Penny Stock rules could adversely affect the market price of our common shares and increase your transaction costs to sell those shares. The Securities and Exchange Commission has adopted Rule 3A51-1, which establishes the definition of a Penny Stock, for the purposes relevant to us, as any equity security that has market price of less than $5.00 per share or within an exercise price of less than $5.00 per share, subject to certain exceptions. For any transaction involving a penny stock, unless exempt, Rule 15G-9 require:\n-\nthat a broker or dealer approve a persons account for transactions in penny stocks; and\n-\nthe broker or dealer receive from the investor a written agreement to the transaction, setting forth the identity and quantity of the penny stock to be purchased.\nIn order to approve a persons account for transactions in penny stocks, the broker or dealer must:\n-\nobtain financial information and investment experience objectives of the person; and\n-\nmake a reasonable determination that the transactions in penny stocks are suitable for that person and the person has sufficient knowledge and experience in financial matters to be capable of evaluating the risks of transactions in penny stocks.\nThe broker or dealer must also deliver, prior to any transaction in a penny stock, a disclosure schedule prescribed by the SEC relating to the penny stock market, which, in highlight form:\n-\nsets forth the basis on which the broker or dealer made the suitability determination; and\n-\nthat the broker or dealer received a signed, written agreement from the investor prior to the transaction.\nGenerally, brokers may be less willing to execute transactions in securities subject to the penny stock rules. This may make it more difficult for investors to dispose of our common stock and cause a decline in the market value of our stock.\nYou may face significant restrictions on the resale of your shares due to state blue sky laws.\nEach state has its own securities laws, often called blue sky laws, which (1) limit sales of securities to a states residents unless the securities are registered in that state or qualify for an exemption from registration, and (2) govern the reporting requirements for broker-dealers doing business directly or indirectly in the state. Before a security is sold in a state, there must be a registration in place to cover the transaction, or it must be exempt from registration. The applicable broker-dealer must also be registered in that state. We do not know whether our securities will be registered or exempt from registration under the laws of any state. A determination regarding registration will be made by those broker-dealers, if any, who agree to serve as market makers for our common stock. There may be significant state blue sky law restrictions on the ability of investors to sell, and on purchasers to buy, our securities. You should therefore consider the resale market for our common stock to be limited, as you may be unable to resell your shares without the significant expense of state registration or qualification.\nYou could be diluted from our future issuance of capital stock and derivative securities.\nAs of September 30, 2022, we had 26,320,200 shares of common stock outstanding and no shares of preferred stock outstanding. We are authorized to issue up to 75,000,000 shares of common stock and no shares of preferred stock. To the extent of such authorization, our Board of Directors will have the ability, without seeking stockholder approval, to issue additional shares of common stock or preferred stock in the future for such consideration as the Board of Directors may consider sufficient. The issuance of additional common stock or preferred stock in the future may reduce your proportionate ownership and voting power.\nIf a market develops for our shares, sales of our shares relying upon Rule 144 may depress prices in that market by a material amount.\nAs of September 30, 2022, 2,007,600 of the outstanding shares of our Common Stock are ‘‘unrestricted securities within the meaning of Rule 144 under the Securities Act of 1933, as amended. As unrestricted securities, these shares may be resold under the requirements of Rule 144 or other applicable exemptions from registration under the Act and as required under applicable state securities laws.\nWe intend to sell more restricted shares or securities convertible into restricted shares as part of our efforts to finance the Companys operations. As a result of revisions to Rule 144, there is no limit on the amount of restricted securities that may be sold by a non-affiliate (i.e., a stockholder who has not been an officer, director or control person for at least 90 consecutive days) after the restricted securities have been held by the owner for a period of one year. A sale under Rule 144 or under any other exemption from the Act, if available, or pursuant to registration of shares of Common Stock of present stockholders, may have a depressive effect upon the price of the Common Stock in any market that may develop. Item 1B.\nUNRESOLVED STAFF COMMENTS\nAt September 30, 2022, none. Item 2.\nPROPERTIES\nWe do not hold ownership or leasehold interest in any property, and we do not pay our office rent or office cost for now. Item 3.\nLEGAL PROCEEDINGS\nWe are not currently a party to any legal proceedings, and we are not aware of any pending or potential legal actions. Item 4.\nMINE SAFETY DISCLOSURES\nNot applicable to our Company.\nPART II Item 5.\nMARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES.\nMarket Information\nOn August 27, 2018, our common stock was verified for trading on OTC Link ATS under the trading symbol KNIT. Prior to that time, there was no public market for our stock. The following table sets forth for the indicated periods the high and low intra-day sales price per share for our common stock on the OTC Link ATS for the year ended September 30, 2022.\n2021-2022\nHigh\nLow\nFirst Quarter\n$ 1.27\n$ 0.75\nSecond Quarter\n$ 1.45\n$ 1.27\nThird Quarter\n$ 4.25\n$ 0.54\nFourth Quarter\n$ 4.25\n$ 2.15\n*\nThere were trades 11,923 of our common stock during the relevant period.\nHolders.\nAs of September 30, 2022, there were 12 holders of 25,886,200 shares of the Companys common stock (98.35%). With the balance of the Companys common stock being trades in open market.\nDividends.\nThe Company has not paid any cash dividends to date and does not anticipate or contemplate paying dividends in the foreseeable future. It is the present intention of management to utilize all available funds for the development of the Companys business.\nSecurities Authorized for Issuance Under Equity Compensation Plans\nNone.\nRecent sales of unregistered securities.\nIn August 2022, we sold and transferred 10,000 shares in open market transactions.\nIssuer Purchases of Equity Securities\nWe did not repurchase any of our equity securities during the years ended September 30, 2022 and 2021. Item 6.\nSELECTED FINANCIAL DATA\nWe are a smaller reporting company as defined by Rule 12b-2 of the Securities Exchange Act of 1934 and are not required to provide the information under this item. Item 7.\nMANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion should be read in conjunction with our audited financial statements and notes thereto included herein. In connection with, and because we desire to take advantage of, the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, we caution readers regarding certain forward looking statements in the following discussion and elsewhere in this report and in any other statement made by, or on our behalf, whether or not in future filings with the Securities and Exchange Commission.\nForward-looking statements are statements not based on historical information and which relate to future operations, strategies, financial results or other developments. Forward looking statements are necessarily based upon estimates and assumptions that are inherently subject to significant business, economic and competitive uncertainties and contingencies, many of which are beyond our control and many of which, with respect to future business decisions, are subject to change. These uncertainties and contingencies can affect actual results and could cause actual results to differ materially from those expressed in any forward looking statements made by, or our behalf. We disclaim any obligation to update forward-looking statements.\nResults of operations for the years ended September 30, 2022 and 2021.\nRevenue\nWe do not generate revenue from operations or investments. We continue with Due Diligence about GSS Infrastructure and NTEC in Ecuador. Besides we have initiated evaluation of other business opportunities in Panama and Colombia.\nOur gross revenue for the years ended September 30, 2022 and 2021 was $0 and $0 respectively. Our cost of revenues for the year ended September 30, 2022 was $0 resulting in a gross income of $0.\nCosts and Expenses\nThe major components of our expenses for the years ended September 30, 2022 and 2021 are outlined in the table below:\nFor the Year Ended Sept. 30, 2022\nFor the Year Ended Sept. 30, 2021\nIncrease\n(Decrease)\nCompensation - officers\n$ 20,300\n$ 21,000\n$ -700\nProfessional fees\n$ 10,850\n$ 10,850\nAcquisition Fees\n$ 14,941\n$ 14,941\nGeneral and administrative\n$ 6,766\n$ 6,766\nTotal\n$ 52,857\n$ 21,000\n$ 31,857\nAccounts Payable - Related Parties\nAs of September 30, 2022 and 2021 the Company owed its shareholders-directors and officers is as following:\nFor the Year Ended Sept. 30, 2022\nFor the Year Ended Sept. 30, 2021\nIncrease\n(Decrease)\nShareholders\n$ 24,112\n$ -\n$ 24,112\nOfficers\n$ 18,000\n$ 18,000\nTotal\n$ 42,112\n$ -\n$ 42,112\nLiquidity\nOur internal liquidity is provided by our shareholders and sale of common stocks operations. During the years ended September 30, 2022 and 2021 the Company reported net loss from operations of -$52,857 and - $21,000, respectively.\nTo date we have financed our operations by cash generated from sales of shares of our common stock and cash from our shareholders. We were able to sustain our operations by closing acquisitions in Ecuador and acquisitions in Panama or Colombia, increasing the number of operations.\nTo date we have not sold shares of common stock to our officers and directors. We sold 10,000 shares at $2.00 per share in the open market to generate cash to cover expenses.\nIf not additional capital may be required to maintain ongoing operations.\nWe have explored and are continuing to explore options to provide additional financing to fund future operations as well as other possible courses of action. Such actions include, but are not limited to, securing lines of credit, sales of debt or equity securities (which may result in dilution to existing shareholders), loans and cash advances from our directors or other third parties, and other similar actions. There can be no assurance that we will be able to obtain additional funding (if needed), on acceptable terms or at all, through a sale of our common stock, loans from financial institutions, our directors, or other third parties, or any of the actions discussed above. If we cannot sustain profitable operations, and additional capital is unavailable, lack of liquidity could have a material adverse effect on our business viability, financial position, results of operations and cash flows.\nCash Flows\nThe table below, for the period indicated, provides selected cash flow information:\nCash Flow\nFor the Year Ended Sept. 30, 2022\nFor the Year Ended Sept. 30, 2021\nNet cash provided (used) by shareholders and sale common share\n$ 44,112 -\nCash used in activities\n$ 30,447 -\nNet Cash\n$ 13,665 -\nNet increase (decrease) in cash\n$ 13,665 -\nWe have not generated revenues during the years ended September 30, 2022 and 2021, respectively. In addition, we received proceeds of $20,000 and $0 from sale of our common stock during the years ended September 30, 2022 and 2021. We received $24,112 during the reporting periods from our shareholders.\nCash Flows from Investing Activities\nWe did not generate any cash from investing activities during the year ended September 30, 2022.\nCash Flows from Financing Activities\nNot applicable.\nRecent Accounting Pronouncements\nSee Note 2 to the Financial Statements.\nOff Balance Sheet Arrangements\nAs of September 30, 2022 and 2021, we did not have any significant off-balance-sheet arrangements, as defined in Item 303(a)(4)(ii) of Regulation S-K. Item 7A.\nQUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nWe are a smaller reporting company as defined by Rule 12b-2 of the Securities Exchange Act of 1934 and are not required to provide the information under this item. Item 8.\nFINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nKINETIC GROUP INC.\nIndex to the Financial Statements\nContents\nPage\nReport of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets at September 30, 2022 and 2021\nConsolidated Statements of Operations for the Years Ended September 30, 2022 and 2021\nConsolidated Statement of Changes in Stockholders Deficit for the Years Ended September 30, 2022 and 2021\nConsolidated Statements of Cash Flows for the Years Ended September 30, 2022 and 2021\nNotes to the Consolidated Financial Statements\nReport of an Independent Registered Public Accounting Firm\nTo the shareholders and the board of directors of Kinetic Group Inc\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of Kinetic Group Inc (the Company) as of September 30, 2022, the related consolidated statements of operations, changes in shareholders equity and cash flows, for each of the two years in the period ended September 30, 2022, and the related notes collectively referred to as the financial statements.\nIn our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of September 30, 2022, and 2021, and the results of its operations and its cash flows for the year ended September 30, 2022, in conformity with U.S. generally accepted accounting principles.\nGoing Concern\nThe accompanying financial statements have been prepared assuming the company will continue as a going concern as disclosed in Note 3 to the financial statement, the Company has continuously incurred a net loss of $52,857 for the year ended September 30, 2022, and an accumulated deficit of $250,779 at September 30, 2022. The continuation of the Company as a going concern through September 30, 2022, is dependent upon improving the profitability and the continuing financial support from its stockholders. Management believes the existing shareholders or external financing will provide additional cash to meet the Companys obligations as they become due.\nThese factors raise substantial doubt about the companys ability to continue as a going concern. These financial statements do not include any adjustments that might result from the outcome of the uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB. We conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion. The company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOLAYINKA OYEBOLA & CO.\n(Chartered Accountants)-PCAOB ID 5968\nWe have served as the Companys auditor since September 2020.\nNovember 8th, 2022.\nLagos Nigeria\nKINETIC GROUP INC.\nCONSOLIDATED BALANCE SHEETS\n(Audited)\nSeptember 30, 2022\nSeptember 30, 2021\nASSETS\nCurrent Assets:\nCash\n$ 13,665\n$ -\nDue from related party\n550,000\n-\nTotal Assets\n$ 563,665\n$ -\nLIABILITIES AND STOCKHOLDERS EQUITY(DEFICIT)\nCurrent Liabilities:\nAccounts payable and accrued liabilities\n$ 43,902\n$ -\nTotal Liabilities\n43,902\n-\nCommitments and Contingencies\nStockholders Equity:\nCommon stock, par value $0.001 per share, 75,000,000 shares authorized; 26,320,000 and 23,710,000 shares issued and outstanding as of September 30, 2022, and September 30, 2021\n26,320\n23,710\nAdditional paid-in capital\n744,222\n174,212\nAccumulated deficit\n(250,779 )\n(197,922 )\nTotal stockholders equity\n519,763\n-\nTotal Liabilities and Stockholders Equity\n$ 563,665\n$ -\nThe accompanying notes are an integral part of these consolidated financial statements.\nKINETIC GROUP INC.\nCONSOLIDATED STATEMENTS OF OPERATIONS\nYear Ended\nSeptember 30,\nYear Ended\nSeptember 30,\nRevenue\n$ -\n$ -\nCost of revenue\n-\n-\nGross profit\n-\n-\nOperating Expenses:\nOfficers stock-based compensation\n20,300\n21,000\nProfessional fees\n14,941\n-\nGeneral and administrative\n17,616\n-\nTotal operating expenses\n52,857\n21,000\nIncome (Loss) from Operations\n(52,857 )\n(21,000 )\nOther income-cancelation of debt\n-\n-\nIncome (loss) before income tax provision\n(52,857 )\n(21,000 )\nIncome tax provision\n-\n-\nNet Income (Loss)\n$ (52,857 )\n$ (21,000 )\nNet Loss Per Common Share:\nNet Loss per common share - Basic and Diluted\n$ (0.00 )\n$ (0.00 )\nOutstanding - Basic and Diluted\n26,320,200\n5,532,575\nThe accompanying notes are an integral part of these consolidated financial statements.\nKINETIC GROUP INC.\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS EQUITY\nCommon stock\nAdditional\nPaid-in\nAccumulated\nDescription\nShares\nAmount\nCapital\nDeficit\nTotal\nBalance - October 1, 2020\n2,710,200\n$ 2,710\n$ 174,212\n$ (176,922 )\n$ -\nOfficers stock-based compensation\n21,000,000\n21,000\n-\n-\n21,000\nNet (loss)\n-\n-\n-\n(21,000 )\n(21,000 )\nBalance - September 30, 2021\n23,710,200\n$ 23,710\n$ 174,212\n$ (197,922 )\n$ -\nBalance - October 1, 2021\n23,710,200\n$ 23,710\n$ 174,212\n$ (197,922 )\n$ -\nCommon stock issued\n2,610,000\n2,610\n-\n-\n2,610\nAdditional paid in capital\n-\n-\n570,010\n-\n570,010\nNet (loss)\n-\n-\n-\n(52,857 )\n(52,857 )\nBalance - September 30, 2022\n26,320,200\n$ 26,320\n$ 744,222\n$ (250,779 )\n$ 519,763\nThe accompanying notes are an integral part of these consolidated financial statements.\nKINETIC GROUP INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nYear Ended\nSeptember 30,\nYear Ended\nSeptember 30,\nOperating Activities:\nNet loss\n$ (52,857 )\n$ (21,000 )\nAdjustments to reconcile net loss to net cash used in operating activities:\nCancelation of debt and common shares\n-\n-\nIssuance of officers stock-based compensation\n-\n21,000\nDue from related party\n(550,000 )\nAccounts payable and accrued liabilities\n43,902\n-\nClients deposits\n-\n-\nNet Cash Provided (Used) by Operating Activities\n(558,955 )\n-\nInvesting Activities:\nAcquisition of property and equipment\n-\n-\nAcquisition of software\n-\n-\nNet Cash Used in Investing Activities\n-\n-\nFinancing Activities:\nAdditional paid in capital\n570,010\n-\nCommon stock issued\n2,610\n-\nNet Cash Provided by Financing Activities\n572,620\n-\nNet Change in Cash\n13,665\n-\nCash - Beginning of Period\n-\n-\nCash - End of Period\n$ 13,665\n$ -\nCash paid during the period for:\nInterest\n$ -\n$ -\nIncome tax paid\n$ -\n$ -\nNon-Cash Financing and Investing Activities:\nRestricted common stock canceled, and proceeds contributed to capital\n$ -\n$ -\nIssuance of 21,000,000 shares for officers compensation at par\n$ 21,000\n$ 21,000\nThe accompanying notes are an integral part of these consolidated financial statements.\nKINETIC GROUP INC.\nNOTES TO THE SEPTEMBER 30, 2022, AND 2021 CONSOLIDATED FINANCIAL STATEMENTS\nNote 1 - Organization and Operations\nKinetic Group Inc., a Nevada corporation, (the Company) was formed under the laws of the State of Nevada on June 6, 2014. Kinetic Group changed business core and now is a telecommunications company focused on owning, operating and building wireless infrastructure for international mobile carriers in Latin America. The company rents, operates and builds tower/rooftop/unconventional infrastructure, fiber optic networks, DAS and telecommunication equipment for MNO's. The Company will generate revenue from acquisitions and operations in Latin America.\nOn May 18, 2022 The Company announced signed a binding Letter of Intent (\"LOI\") with GSS INFRASTRUCTURE (\"GSSI\") www.gssinfrastructure.com to acquire a 100% interest in GSSI. The Transaction remains subject to certain conditions being met until definitive completion. transactions for the employees.\nOn Aug. 18, 2022 The Company announced that it has entered into a formal agreement with International Monetary, www.intlmonetary.com, a merchant bank based in Newport Beach, CA, who will assist KNIT in identifying new business prospects and strategic partnerships, as well as source capital so the company can continue to expand. With this agreement KNIT will has an additional support will serve to put the company in position to achieve its stated goals of expanding our shareholder base, raising awareness of the company in the marketplace, and uncovering interesting opportunities going forward\nNote 2 - Summary of Significant Accounting Policies\nBasis of Presentation\nThe Companys financial statements have been prepared in accordance with accounting principles generally accepted in the United States of America (U.S. GAAP).\nPrinciple of consolidation\nThe accompanying consolidated financial statements include all of the accounts of the Company as of September 30, 2022 and 2021. All intercompany balances and transactions have been eliminated.\nDevelopment Stage company\nKinetic Group Inc. is a development stage company as defined by section 915-10-20 of the FASB Accounting Standards Codification. Although the Company has recognized nominal amounts of revenue, it is still devoting substantially all of its efforts on establishing the business. All losses accumulated since Inception (June 4, 2014) have been considered as part of the Companys development stage activities.\nIn June 2014, the FASB issued ASU No. 2014-10, Development Stage Entities (Topic 915): Elimination of Certain Financial Reporting Requirements, Including an Amendment to Variable Interest Entities Guidance in Topic 810, Consolidation.\nThe amendments in this Update remove the definition of a development stage entity from the Master Glossary of the Accounting Standards Codification, thereby removing the financial reporting distinction between development stage entities and other reporting entities from U.S. GAAP. In addition, the amendments eliminate the requirements for development stage entities to (1) present inception-to-date information in the statements of income, cash flows, and shareholder equity, (2) label the financial statements as those of a development stage entity, (3) disclose a description of the development stage activities in which the entity is engaged, and (4) disclose in the first year in which the entity is no longer a development stage entity that in prior years it had been in the development stage.\nFor public business entities, those amendments are effective for annual reporting periods beginning after December 15, 2014, and interim periods therein. Kinetic Group has elected to early adopt Accounting Standards Update No. 2014-10, Development Stage Entities (Topic 915): Elimination of Certain Financial Reporting Requirements. The adoption of this ASU allows the company to remove the inception to date information and all references to development stage.\nUse of Estimates and Assumptions and Critical Accounting Estimates and Assumptions\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date(s) of the financial statements and the reported amounts of revenues and expenses during the reporting period(s).Critical accounting estimates are estimates for which (a) the nature of the estimate is material due to the levels of subjectivity and judgment necessary to account for highly uncertain matters or the susceptibility of such matters to change and (b) the impact of the estimate on financial condition or operating performance is material. The Companys critical accounting estimates and assumptions affecting the financial statements were:\n(i)\nAssumption as a going concern: Management assumes that the Company will continue as a going concern, which contemplates continuity of operations, realization of assets, and liquidation of liabilities in the normal course of business.\n(ii)\nAllowance for doubtful accounts: Managements estimate of the allowance for doubtful accounts is based on historical sales, historical loss levels, and an analysis of the collectability of individual accounts; and general economic conditions that may affect a clients ability to pay. The Company evaluated the key factors and assumptions used to develop the allowance in determining that it is reasonable in relation to the financial statements taken as a whole.\n(iii)\nValuation allowance for deferred tax assets: Management assumes that the realization of the Companys net deferred tax assets resulting from its net operating loss (NOL) carry-forwards for Federal income tax purposes that may be offset against future taxable income was not considered more likely than not and accordingly, the potential tax benefits of the net loss carry-forwards are offset by a full valuation allowance. Management made this assumption based on (a) the Company has incurred recurring losses, (b) general economic conditions, and (c) its ability to raise additional funds to support its daily operations by way of a public or private offering, among other factors;\nThese significant accounting estimates or assumptions bear the risk of change due to the fact that there are uncertainties attached to these estimates or assumptions, and certain estimates or assumptions are difficult to measure or value.\nManagement bases its estimates on historical experience and on various assumptions that are believed to be reasonable in relation to the financial statements taken as a whole under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Management regularly evaluates the key factors and assumptions used to develop the estimates utilizing currently available information, changes in facts and circumstances, historical experience and reasonable assumptions. After such evaluations, if deemed appropriate, those estimates are adjusted accordingly.\nActual results could differ from those estimates.\nFair Value of Financial Instruments\nThe Company follows paragraph 825-10-50-10 of the FASB Accounting Standards Codification for disclosures about fair value of its financial instruments and paragraph 820-10-35-37 of the FASB Accounting Standards Codification (Paragraph 820-10-35-37) to measure the fair value of its financial instruments. Paragraph 820-10-35-37 establishes a framework for measuring fair value in accounting principles generally accepted in the United States of America (U.S. GAAP), and expands disclosures about fair value measurements.\nTo increase consistency and comparability in fair value measurements and related disclosures, Paragraph 820-10-35-37 establishes a fair value hierarchy which prioritizes the inputs to valuation techniques used to measure fair value into three (3) broad levels. The fair value hierarchy gives the highest priority to quoted prices (unadjusted) in active markets for identical assets or liabilities and the lowest priority to unobservable inputs. The three (3) levels of fair value hierarchy defined by Paragraph 820-10-35-37 are described below:\nLevel 1\nQuoted market prices available in active markets for identical assets or liabilities as of the reporting date.\nLevel 2\nPricing inputs other than quoted prices in active markets included in Level 1, which are either directly or indirectly observable as of the reporting date.\nLevel 3\nPricing inputs that are generally observable inputs and not corroborated by market data.\nFinancial assets are considered Level 3 when their fair values are determined using pricing models, discounted cash flow methodologies or similar techniques and at least one significant model assumption or input is unobservable.\nThe fair value hierarchy gives the highest priority to quoted prices (unadjusted) in active markets for identical assets or liabilities and the lowest priority to unobservable inputs. If the inputs used to measure the financial assets and liabilities fall within more than one level described above, the categorization is based on the lowest level input that is significant to the fair value measurement of the instrument.\nThe carrying amount of the Companys financial assets and liabilities, such as cash, prepaid expenses, accounts payable and accrued expenses, approximate their fair value because of the short maturity of those instruments.\nTransactions involving related parties cannot be presumed to be carried out on an arms-length basis, as the requisite conditions of competitive, free-market dealings may not exist. Representations about transactions with related parties, if made, shall not imply that the related party transactions were consummated on terms equivalent to those that prevail in arms-length transactions unless such representations can be substantiated.\nCash Equivalents\nThe Company considers all highly liquid investments with a maturity of three months or less to be cash and cash equivalents.\nProperty and Equipment\nProperty and equipment are recorded at cost. Expenditures for major additions and betterments are capitalized. Maintenance and repairs are charged to operations as incurred. Depreciation is calculated using the straight-line method over the estimated useful lives, which range from five (5) years for computer equipment to seven (7) years for office furniture. Upon sale or retirement of office equipment, the related cost and accumulated depreciation are removed from the accounts and any gain or loss is reflected in statements of operations.\nRelated Parties\nThe Company follows subtopic 850-10 of the FASB Accounting Standards Codification for the identification of related parties and disclosure of related party transactions. Pursuant to Section 850-10-20 the related parties include: a. affiliates of the Company; b. entities for which investments in their equity securities would be required, absent the election of the fair value option under the Fair Value Option Subsection of Section 825-10-15, to be accounted for by the equity method by the investing entity; c. trusts for the benefit of employees, such as pension and profit-sharing trusts that are managed by or under the trusteeship of management; d. principal owners of the Company; e. management of the Company; f. other parties with which the Company may deal if one party controls or can significantly influence the management or operating policies of the other to an extent that one of the transacting parties might be prevented from fully pursuing its own separate interests; and g. other parties that can significantly influence the management or operating policies of the transacting parties or that have an ownership interest in one of the transacting parties and can significantly influence the other to an extent that one or more of the transacting parties might be prevented from fully pursuing its own separate interests.\nThe financial statements shall include disclosures of material related party transactions, other than compensation arrangements, expense allowances, and other similar items in the ordinary course of business. However, disclosure of transactions that are eliminated in the preparation of financial statements is not required in those statements.\nThe disclosures shall include: a. the nature of the relationship(s) involved; b. a description of the transactions, including transactions to which no amounts or nominal amounts were ascribed, for each of the periods for which income statements are presented, and such other information deemed necessary to an understanding of the effects of the transactions on the financial statements; c. the dollar amounts of transactions for each of the periods for which income statements are presented and the effects of any change in the method of establishing the terms from that used in the preceding period; and d. amounts due from or to related parties as of the date of each balance sheet presented and, if not otherwise apparent, the terms and manner of settlement.\nCommitments and Contingencies\nThe Company follows subtopic 450-20 of the FASB Accounting Standards Codification to report accounting for contingencies. Certain conditions may exist as of the date the financial statements are issued, which may result in a loss to the Company but which will only be resolved when one or more future events occur or fail to occur. The Company assesses such contingent liabilities, and such assessment inherently involves an exercise of judgment. In assessing loss contingencies related to legal proceedings that are pending against the Company or unasserted claims that may result in such proceedings, the Company evaluates the perceived merits of any legal proceedings or unasserted claims as well as the perceived merits of the amount of relief sought or expected to be sought therein.\nIf the assessment of a contingency indicates that it is probable that a material loss has been incurred and the amount of the liability can be estimated, then the estimated liability would be accrued in the Companys financial statements. If the assessment indicates that a potential material loss contingency is not probable but is reasonably possible, or is probable but cannot be estimated, then the nature of the contingent liability, and an estimate of the range of possible losses, if determinable and material, would be disclosed.\nLoss contingencies considered remote are generally not disclosed unless they involve guarantees, in which case the guarantees would be disclosed. Management does not believe, based upon information available at this time that these matters will have a material adverse effect on the Companys financial position, results of operations or cash flows. However, there is no assurance that such matters will not materially and adversely affect the Companys business, financial position, and results of operations or cash flows.\nRevenue Recognition\nThe Company applies paragraph 605-10-S99-1 of the FASB Accounting Standards Codification for revenue recognition. The Company recognizes revenue when it is realized or realizable and earned.\nThe Company considers revenue realized or realizable and earned when all of the following criteria are met: (i) persuasive evidence of an arrangement exists, (ii) the product has been shipped or the services have been rendered to the customer, (iii) the sales price is fixed or determinable, and (iv) collectability is reasonably assured.\nThe Company derives its revenues from sales contracts with its customer with revenues being generated upon rendering of services. Persuasive evidence of an arrangement is demonstrated via invoice; service is considered provided when the service is delivered to the customers; and the sales price to the customer is fixed upon acceptance of the purchase order and there is no separate sales rebate, discount, or volume incentive.\nA right of return exists for customers retainers that were received prior to commencement of services. If a customer cancels a service contract subsequent to the commencement date, the customer is entitled to a refund, except for services already provided.\nIncome Tax Provision\nThe Company accounts for income taxes under Section 740-10-30 of the FASB Accounting Standards Codification, which requires recognition of deferred tax assets and liabilities for the expected future tax consequences of events that have been included in the financial statements or tax returns.\nUnder this method, deferred tax assets and liabilities are based on the differences between the financial statement and tax bases of assets and liabilities using enacted tax rates in effect for the year in which the differences are expected to reverse. Deferred tax assets are reduced by a valuation allowance to the extent management concludes it is more likely than not that the assets will not be realized. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled.\nThe effect on deferred tax assets and liabilities of a change in tax rates is recognized in the statements of operations in the period that includes the enactment date.\nThe Company adopted the provisions of paragraph 740-10-25-13 of the FASB Accounting Standards Codification. Paragraph 740-10-25-13 addresses the determination of whether tax benefits claimed or expected to be claimed on a tax return should be recorded in the financial statements. Under paragraph 740-10-25-13, the Company may recognize the tax benefit from an uncertain tax position only if it is more likely than not that the tax position will be sustained on examination by the taxing authorities, based on the technical merits of the position.\nThe tax benefits recognized in the financial statements from such a position should be measured based on the largest benefit that has a greater than fifty percent (50%) likelihood of being realized upon ultimate settlement. Paragraph 740-10-25-13 also provides guidance on de-recognition, classification, interest and penalties on income taxes, accounting in interim periods and requires increased disclosures.\nThe estimated future tax effects of temporary differences between the tax basis of assets and liabilities are reported in the accompanying balance sheets, as well as tax credit carry-backs and carry-forwards. The Company periodically reviews the recoverability of deferred tax assets recorded on its balance sheets and provides valuation allowances as management deems necessary.\nManagement makes judgments as to the interpretation of the tax laws that might be challenged upon an audit and cause changes to previous estimates of tax liability. In addition, the Company operates within multiple taxing jurisdictions and is subject to audit in these jurisdictions. In managements opinion, adequate provisions for income taxes have been made for all years. If actual taxable income by tax jurisdiction varies from estimates, additional allowances or reversals of reserves may be necessary.\nUncertain Tax Positions\nThe Company did not take any uncertain tax positions and had no unrecognized tax liabilities or benefits in accordance with the provisions of Section 740-10-25 at September 30, 2022 and 2021.\nEarnings per Share\nEarnings Per Share is the amount of earnings attributable to each share of common stock. For convenience, the term is used to refer to either earnings or loss per share. Earnings per share (EPS) is computed pursuant to section 260-10-45 of the FASB Accounting Standards Codification. Pursuant to ASC Paragraphs 260-10-45-10 through 260-10-45-16 Basic EPS shall be computed by dividing income available to common stockholders (the numerator) by the weighted-average number of common shares outstanding (the denominator) during the period. Income available to common stockholders shall be computed by deducting both the dividends declared in the period on preferred stock (whether or not paid) and the dividends accumulated for the period on cumulative preferred stock (whether or not earned) from income from continuing operations (if that amount appears in the income statement) and also from net income. The computation of diluted EPS is similar to the computation of basic EPS except that the denominator is increased to include the number of additional common shares that would have been outstanding if the dilutive potential common shares had been issued during the period to reflect the potential dilution that could occur from common shares issuable through contingent shares issuance arrangement, stock options or warrants.\nPursuant to ASC Paragraphs 260-10-45-45-21 through 260-10-45-45-23 Diluted EPS shall be based on the most advantageous conversion rate or exercise price from the standpoint of the security holder. The dilutive effect of outstanding call options and warrants (and their equivalents) issued by the reporting entity shall be reflected in diluted EPS by application of the treasury stock method unless the provisions of paragraphs 260-10-45-35 through 45-36 and 260-10-55-8 through 55-11 require that another method be applied.\nEquivalents of options and warrants include non-vested stock granted to employees, stock purchase contracts, and partially paid stock subscriptions (see paragraph 260-10-55-23). Anti-dilutive contracts, such as purchased put options and purchased call options, shall be excluded from diluted EPS. Under the treasury stock method: a. Exercise of options and warrants shall be assumed at the beginning of the period (or at time of issuance, if later) and common shares shall be assumed to be issued. b. The proceeds from exercise shall be assumed to be used to purchase common stock at the average market price during the period. (See paragraphs 260-10-45-29 and 260-10-55-4 through 55-5.) c. The incremental shares (the difference between the number of shares assumed issued and the number of shares assumed purchased) shall be included in the denominator of the diluted EPS computation.\nThere were no potentially debt or equity instruments issued and outstanding at any time during the years ended September 30, 2022 and 2021.\nCash Flows Reporting\nThe Company adopted paragraph 230-10-45-24 of the FASB Accounting Standards Codification for cash flows reporting, classifies cash receipts and payments according to whether they stem from operating, investing, or financing activities and provides definitions of each category, and uses the indirect or reconciliation method (Indirect method) as defined by paragraph 230-10-45-25 of the FASB Accounting Standards Codification to report net cash flow from operating activities by adjusting net income to reconcile it to net cash flow from operating activities by removing the effects of (a) all deferrals of past operating cash receipts and payments and all accruals of expected future operating cash receipts and payments and (b) all items that are included in net income that do not affect operating cash receipts and payments. The Company reports the reporting currency equivalent of foreign currency cash flows, using the current exchange rate at the time of the cash flows and the effect of exchange rate changes on cash held in foreign currencies is reported as a separate item in the reconciliation of beginning and ending balances of cash and cash equivalents and separately provides information about investing and financing activities not resulting in cash receipts or payments in the period pursuant to paragraph 830-230-45-1 of the FASB Accounting Standards Codification.\nSubsequent Events\nThe Company follows the guidance in Section 855-10-50 of the FASB Accounting Standards Codification for the disclosure of subsequent events. The Company will evaluate subsequent events through the date when the financial statements were issued.\nRecently Issued Accounting Pronouncements\nManagement does not believe that any recently issued, but not yet effective accounting pronouncements, if adopted, will have a material effect on the accompanying financial statements.\nNote 3 - Going Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern, which contemplates continuity of operations, realization of assets, and liquidation of liabilities in the normal course of business.\nAs reflected in the accompanying financial statements, the Company had an accumulated deficit of $(250,779) at September 30, 2022, which raises substantial doubt about the Companys ability to continue as a going concern.\nThe Company is attempting to generate sufficient revenue; however, the Companys cash position may not be sufficient to support the Companys daily operations. Management intends to raise additional funds by way of a private or public offering. While the Company believes in the viability of its strategy to continue operations and generate sufficient revenue and in its ability to raise additional funds, there can be no assurances to that effect. The ability of the Company to continue as a going concern is dependent upon the Companys ability to further implement its business plan and generate sufficient revenue and its ability to raise additional funds by way of a public or private offering.\nThe financial statements do not include any adjustments related to the recoverability and classification of recorded asset amounts or the amounts and classification of liabilities that might be necessary if the Company is unable to continue as a going concern.\nNote 4 - Property and Equipment\nProperty and equipment at September 30, 2022 and 2021 consisted of the following:\nProperty and Equipment\nEstimated useful lives (Years)\nYear Ended 9/30/2022\nYear Ended 9/30/2021\nComputer equipment\n$ 5\n$ -\n$ 5,832\nLess accumulated depreciation\n$ -\n$ (5,832 )\nComputer equipment, net\n$ -\n$ -\nSoftware\n$ 1\n$ -\n$ 2,495\nLess accumulated amortization\n$ -\n$ (2,495 )\nSoftware, net\n$ -\n$ -\nTotal property and equipment, net\n-\n-\nDepreciation expense\nDepreciation expense for the year ended September 30, 2022 and 2021 was $0 and $0, respectively.\nNote 5 - Related Party Transactions\nConsulting services from President, Chief Executive Officer, Secretary and Treasurer and Chief Financial Officer\nConsulting services provided by the Companys officers for the years ended September 30, 2022 and 2021 were as follows:\nConsulting Services from Company's Officers\nYear Ended 9/30/2022\nYear Ended 9/30/2021\nPresident, Chief Executive Officer\n$ 2,300\n$ 21,000\nChief Financial Officer, Secretary and Treasurer\n$ 18,000\n$ 0\n$ 20,300\n$ 21,000\nDebt Settlement\nWith acquisition and new stockholders all debt from last management were canceled. On September 30, 2022, the company has debt with Shareholders for $24,112 who has supported some expenses required for initial operation after acquisition ( Ana Maria Mendez President for $10,271, Damian Gradier-Director for $11,800 and Canopi Group for $2,041)and with CFO Roberto Mora for $18,000.\nNote 6 - Stockholders Equity (Deficit)\nShares authorized\nUpon formation the total number of shares of all classes of stock which the Company is authorized to issue is seventy five million (75,000,000) shares of common stock, par value $0.001 per share. Total outstanding shares: 26,320,200\nUnregistered shares of common stock\nOn September 30, 2022, all unregistered share of common stock were canceled.\nRegistered shares of common stock\nNow all shares are registered: 98.35% in possession of new stockholders and 1.65% in open free market and new offering stocks.\nStockholder\nTotal Shares of Common Stock\nPercentage Ownership\nBrandink LLC\n2,984,825\n11.34 %\nCanopi Group S.A.\n5,969,650\n22.68 %\nPartnership CK LLV\n2,984,825\n11.34 %\nNew Gate Investments S.A\n2,505,700\n9.52 %\nAna Maria Mendez\n4,844,650\n18.41 %\nMaria Christina Mendez\n122,000\n0.46 %\nSteven Steinmetz\n3,000\n0.01 %\nTelco Acquisition Partners LLC\n5,644,650\n21.45 %\nJackeline Bullon\n325,000\n1.23 %\nBroad Waters Global Capital SA\n454,100\n1.73 %\nMichelle Santiago\n35,300\n0.13 %\nJose Benjamin Zapata\n12,500\n0.05 %\nTotal\n25,886,200\n98.4 %\nOPEN MARKET (*)\n124,000\n0.47 %\nNEW OFFERING (**)\n310,000\n1.18 %\nTOTAL OUSTANDING\n26,320,200\n100.00 %\nRegulation D Offering\nThe Company filed with the Securities and Exchange Commission a notice of an exempt offering of the Companys securities on the Form D (the Offering). The Company is offering $40,000,000 under the Offering at market price with discount. The Securities are being offered by the Company through its officers and directors on a best efforts basis, pursuant to a non-public offering exemption from the registration requirements imposed by the Securities Act of 1933, under Regulation D, Rule 506, as amended (1933 Act). The Securities are not being registered and may not be sold unless they are registered under applicable Federal and State laws. The offering will expire on May 31, 2024. (see exhibits)\nOn September 30, 2022 the company has sold 10,000 common shares at price of $2.00. This sale represents the only cash received by company in the period ended September 30, 2022. The company gave 300,000 share to International Monetary according agreement signed.\nNote 7 - Income Tax\nDeferred Tax Assets\nAt September 30, 2022 and 2021, the Company had net operating loss (NOL) carry-forwards for Federal income tax purposes respectively.\nDeferred tax assets consist primarily of the tax effect of NOL carry-forwards. The Company has provided a full valuation allowance on the deferred tax assets because of the uncertainty regarding its realizability. The valuation allowance increased approximately $0 during the year ended September 30, 2022.\nWe follow ASC 740 Accounting for Uncertainty in Income Taxes. Under ASC 740, tax benefits are recognized only for tax positions that are more likely than not to be sustained upon examination by tax authorities. The amount recognized is measured as the largest amount of benefit that is greater than fifty percent likely to be realized upon ultimate settlement. Unrecognized tax benefits are tax benefits claimed in our tax returns that do not meet these recognition and measurement standards. We had no liabilities for unrecognized tax benefits at September 30, 2022 and 2021.\nOur policy is to recognize potential interest and penalties accrued related to unrecognized tax benefits within income tax expense. For the years ended September 30, 2022 and 2021, we did not recognize any interest or penalties in our statement of operations, nor did we have any interest or penalties accrued in our balance sheet at September 30, 2022 and 2021 relating to unrecognized tax benefits.\nThe tax years 2021-2020 remain open to examination for federal income tax purposes and by the other major taxing jurisdictions to which we are subject.\nNote 8 - Subsequent Events\nIn accordance with ASC 855-10 we have analyzed our operations subsequent to September 30,2021 to September 30, 2022, date of these financial statement was issued, and have determined that we do not have any material subsequent events to disclose in these financial statements.\n(a) Departure of Directors\nOn May 24, 2022, Aitan Zacharin, the former Companys chief executive officer, sole director and CFO, resigned from all positions in connection with the transfer of his shares to the New Shareholders announced on that date.\nOn July 22. 2022, Juan Pablo Bernal the Companys chief executive officer resigned from his positions in KINETIC and kept his position as CEO of GSS Infrastructure, company which KINETIC signed a MDE for acquisition.\n(c) Appoint of Officers\nOn July 22, 2022, the Company appointed Ana Maria Mendez as its new President and Director. Ms. Méndez has over 15 years experience in financial services, working throughout Latin America, Canada and Spain. She has also been CEO of several oil and gas companies. Ana María received her MBA from Columbia University and her dual undergraduate degrees in Economics and Psychology from the University of Miami.\nAna Maria Mendez has not been a party to any transactions with any related persons of the Company at any point in time.\n(d) Appointment of Directors\nOn July 22, 2022, the Company appointed Damien Grider to its board of directors. The terms, conditions and period of Damien Griders directorship have not yet been determined.\nDamien Grider has not been a party to any transactions with any related persons of the Company at any point in time.\n(e) Appointment of Management\nOn August 3, 2022, the Company appointed Roberto Mora to its CFO (Chief Financial Officer). The terms, conditions and period of Roberto Mora has not yet been determined.\n(f) Other Events\nOn July 22, 2022, business activities of KINETIC changed to:\nKinetic Group Inc., is a telecommunications company focused on owning, operating, and building wireless infrastructure for international mobile carriers in Latin America. The company rents, operates and builds tower/rooftop/unconventional infrastructure, fiber optic networks, DAS and telecommunication equipment for MNO's. Item 9.\nCHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE.\nNone. Item 9A.\nCONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls\nWe evaluated the effectiveness of our disclosure controls and procedures as of the end of the 2022 fiscal year. This evaluation was conducted with the participation of our chief executive officer and our principal accounting officer.\nDisclosure controls are controls and other procedures that are designed to ensure that information that we are required to be disclosed in the reports we file pursuant to the Securities Exchange Act of 1934 is recorded, processed, summarized and reported.\nLimitations on the Effective of Controls\nOur management does not expect that our disclosure controls or our internal controls over financial reporting will prevent all error and fraud. A control system, no matter how well conceived and operated, can provide only reasonable, but no absolute, assurance that the objectives of a control system are met. Further, any control system reflects limitations on resources, and the benefits of a control system must be considered relative to its costs. These limitations also include the realities that judgments in decision-making can be faulty and that breakdowns can occur because of simple error or mistake. Additionally, controls can be circumvented by the individual acts of some persons, by collusion of two or more people or by management override of a control. A design of a control system is also based upon certain assumptions about potential future conditions; over time, controls may become inadequate because of changes in conditions, or the degree of compliance with the policies or procedures may deteriorate. Because of the inherent limitations in a cost-effective control system, misstatements due to error or fraud may occur and may not be detected.\nConclusions\nBased upon their evaluation of our controls, the chief executive officer and principal accounting officer have concluded that, subject to the limitations noted above, the disclosure controls are effective providing reasonable assurance that material information relating to us is made known to management on a timely basis during the period when our reports are being prepared. There were no changes in our internal controls that occurred during the year covered by this report that have materially affected, or are reasonably likely to materially affect our internal controls. Item 9B.\nOTHER INFORMATION\nAt date September 30, 2022, no other information to disclose is pending.\nItem 9C.\nDISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nAt Date, September 30, 2022, there any information to disclose about foreign jurisdictions.\nPART III Item 10.\nDIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe following table presents information with respect to our officers, directors and significant employees as of the date of this Report:\nName\nPosition\nAna Maria Mendez\nPresident and Chairwoman\nDamian Gradier\nDirector\nRoberto Mora\nChief Finance Officer\nThe Director will serve as Director until our next annual shareholder meeting or until a successor is elected who accepts the position. Directors are elected for one-year terms or until Board named a substitute. Officers hold their positions at the will of the Board of Directors, absent any employment agreement.\nAna Maria Mendez. Ms. Méndez has over 15 years experience in financial services, working throughout Latin America, Canada and Spain. She has also been CEO of several oil and gas companies. Ana María received her MBA from Columbia University and her dual undergraduate degrees in Economics and Psychology from the University of Miami\nRoberto Mora is an Industrial Engineering with MSc in Information System with more 35 year of experience in difference position in Oil Industry, Telecommunications and Consulting Companies as COO, CFO, CAO and Country Manager in Venezuela, Argentina, Mexico, Ecuador, Colombia and USA. Item 11.\nEXECUTIVE COMPENSATION\nCompensation of Officers\nThe following summary compensation table sets forth information concerning compensation for services rendered in all capacities during 2022 and 201 awarded to, earned by or paid to our executive officers.\nSummary Compensation Table\n(a)\n(b)\n(c)\n(d)\n(e)\n(f)\n(g)\n(h)\n(i)\n(j)\nChange in\nPension\nValue &\nNon-\nNon-quali-\nEquity\nfied\nIncentive\nDeferred\nAll\nPlan\nCompen-\nOther\nName and\nStock\nOption\nCompen-\nsation\nCompen-\nPrincipal*\nSalary\nBonus\nAwards\nAwards\nsation\nEarnings\nsation\nTotals\nPosition [1]\nYear\n($)*\n($)\n($)\n($)\n(S)\n($)\n($)\n($)\nAna Maria Mendez\nPresident, CEO\nNarrative Disclosure Requirement for Summary Compensation Table\nCompensation\nHistorically, the compensation for our current and former officers consisted of the payments made pursuant to the consulting agreements executed and previously filed with the Commission and incorporated herein by reference. For the years ended September 30, 2022 and 2021, the annual compensation was $0 and $0, for former President, CEO and CFO and current Ana Maria Mendez. We have not provided our named executive officers with perquisites or other personal benefits.\nRetirement, Resignation or Termination Plans\nWe sponsor no plan, whether written or verbal, that would provide compensation or benefits of any type to an executive upon retirement, or any plan that would provide payment for retirement, resignation, or termination as a result of a change in control of our company or as a result of a change in the responsibilities of an executive following a change in control of our company.\nDirectors Compensation\nThe persons who served as members of our board of directors, including executive officers, did not receive any compensation for services as directors for 2022 and 2021.\nThe Company does not maintain any qualified retirement plans or non-nonqualified deferred compensation plans for its employees or directors.\nOption Exercises and Stock Vested\nWe do not have a stock option plan in place; therefore, there were no options issued, outstanding, exercised, or stock issued or vested as compensation during the years ended September 30, 2022 and 2021.\nPension Benefits and Nonqualified Deferred Compensation\nThere are no arrangements, agreements, or understandings between non-management shareholders and management under which non-management shareholders may directly or indirectly participate in or influence the management of Kinetic Group affairs.\nExecutive Officer Outstanding Equity Awards at Fiscal Year-End\nFrom September 30, 2021 to September 30, 2022, the company does not provided to any each of our named executive officers executive or common share purchase options, stock awards or equity incentive plan awards. Item 12.\nSECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe following table sets forth certain information regarding beneficial ownership of our common stock as of September 30, 2022: (i) by each of our directors, (ii) by each of the Named Executive Officers, (iii) by all of our executive officers and directors as a group, and (iv) by each person or entity known by us to beneficially own more than five percent (5%) of any class of our outstanding shares. As of September 30, 2022 there were 26,320,200 shares of our common stock outstanding:\nTitle of Class\nName of Beneficial Owner Directors and Officers:\nAmount and Nature of Beneficial Ownership\nPercentage of Beneficial Ownership %\nCommon\nAna Maria Mendez - President\n4,844,650\n18.41 %\nCommon\nDamien Gardier - Director (1)\n5,644,650\n21.45 %\nTotal\n10,489,300\n39.85 %\n(1) Include individual shares and share as shareholder in Telco\nPercentage ownership is determined based on shares owned together with securities exercisable or convertible into shares of common stock within 60 days of September 30, 2022, for each stockholder. Beneficial ownership is determined in accordance with the rules of the SEC and generally includes voting or investment power with respect to securities. Shares of common stock subject to securities exercisable or convertible into shares of common stock that are currently exercisable or exercisable within 60 days of September 30, 2022, are deemed to be beneficially owned by the person holding such securities for the purpose of computing the percentage of ownership of such person, but are not treated as outstanding for the purpose of computing the percentage ownership of any other person. Our common stock is our only issued and outstanding class of securities eligible to vote.\nAs of September 30, 2022 there are 10.489,300 shares of common stock outstanding owned by our current officers and directors. Item 13.\nCERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nConsulting services provided by the Companys officers for the years ended September 30, 2022 and 2021 were as follows:\nYear Ended 9/30/2022\nYear Ended 9/30/2021\nPresident, Chief Executive Officer\n$ -\n$ -\nFormer President\n$ -\n$ -\nChief Financial Officer, Secretary and Treasurer\n$ 18,000\n$ -\n$ 18,000\n$ -\nDirector Independence\nUnder NASDAQ rule 4200(a)(15), a director is not considered to be independent if he or she is also an executive officer or employee of the corporation.\nOur director, Damian Gradier, is not an executive in the company. As a result, we have an independent directors on our Board of Directors. Item 14.\nPRINCIPAL ACCOUNTING FEES AND SERVICES\nDuring the years ended September 30, 2022 and 2021, we engaged as our independent accountant and independence auditor. For the years ended September 30, 2022 and 2021, we incurred fees as discussed below:\nYear Ended 9/30/2022\nYear Ended 9/30/2021\nAudit fees\n$ 4,000\n$ -\nAudit - related fees\n$ -\n$ -\nAccountant Fees\n$ 2,500\nTax fees\n$ -\nAll other fees\n$ 3,050\n$ -\nTotal\n$ 9,550\n$ -\nAudit and Accountant fees consist of fees related to professional services rendered in connection with the audit of our annual financial statements and review of our quarterly and yearly financial statements. Tax fees represent fees related to preparation of our corporation income tax returns.\nOur policy is to pre-approve all audit and permissible non-audit services performed by the independent accountants. These services may include audit services, audit-related services, tax services and other services. Under our audit committees policy, pre-approval is generally provided for particular services or categories of services, including planned services, project based services and routine consultations. In addition, the audit committee may also pre-approve particular services on a case-by-case basis. Our audit committee approved all services that our independent accountants provided to us in the past two fiscal years.\nPART IV Item 15.\nEXHIBITS, FINANCIAL STATEMENT SCHEDULE\nEXHIBIT\nNUMBER\nDESCRIPTION\n3.1\nArticles of Incorporation. Incorporated by reference to the Companys Registration Statement on Form S-1 filed with the SEC on February 14, 2017.\n3.2\nBylaws. Incorporated by reference to the Companys Registration Statement on Form S-1 filed with the SEC on February 14, 2017.\n3.3\nExhibits\\Form 8-k Filed with SEC on May 25, 2022.htm\n3.4\nExhibits\\Form D-Notice of Exempt Offering of Securities August 9, 2022.pdf\n3.5\nExhibits\\Form 8-K Filed with SEC on July 22, 2022.pdf\n31.1\nCertification of the Chief Executive Officer pursuant to Rules 13a-14(a) and 15d-14(a), as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002*\n31.2\nCertification of the Chief Financial Officer pursuant to Rules 13a-14(a) and 15d-14(a), as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.*\n32.1\nCertification of the Chief Executive Officer pursuant to 18 U.S.C Section 1350, as adopted pursuant to Section 906 of the Sarbanes- Oxley Act of 2002.*\n32.2\nCertification of the Chief Financial Officer pursuant to 18 U.S.C Section 1350, as adopted pursuant to Section 906 of the Sarbanes- Oxley Act of 2002*\n101.INS\nInline XBRL Instance Document **\n101.SCH\nInline XBRL Taxonomy Extension Schema Document **\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document **\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document **\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document **\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document **\nCover Page Interactive Data File (embedded within the Inline XBRL document)\n* Filed herewith.\n** XBRL (Extensible Business Reporting Language) information is furnished and not filed or a part of a registration statement or prospectus for purposes of Sections 11 or 12 of the Securities Act of 1933, as amended, is deemed not filed for purposes of Section 18 of the Securities Exchange Act of 1934, as amended, and otherwise is not subject to liability under these sections.\nItem 16.\nForm 10K Summary\nThe year 2022 was a year of transition for Kinetic Group Inc. The company had important changes that aligned the future development of business with an area in constant growth such as Telecommunications. The acquisition by the new shareholders of the company will boost Kinetic in an area in constant growth and where expectations look promising.\nThe new shareholders are constantly looking for new business opportunities that are expected to place Kinetic in positive generation of revenues and profits in the new period. The agreements signed with GSSI infrastructure LLC for the acquisition of NTEC in Ecuador and the recent signing of the agreement with International Monetary, will open new opportunities in the period to begin. The company's management team has the experience and knowledge to guide the company to new levels of revenue and opportunities.\nSIGNATURES\nPursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nKINETIC GROUP INC.\nDate: November 9, 2022\nBy:\n/s/ Ana Maria Mendez\nAna Maria Mendez\nPresident and Chairwoman\nIn accordance with the Exchange Act, this report has been signed below by the following persons on behalf of Kinetic Group Inc. and in the capacities and on the dates indicated.\nSIGNATURES\nTITLE\nDATE\n/s/ Ana Maria Mendez\nPresident and Chairwoman\nNovember 9, 2022\nAna Maria Mendez"
}