{
    "cik": "1700844",
    "company": "EvoAir Holdings Inc.",
    "filing_type": "10-K",
    "filing_date": "2023-12-14",
    "period_of_report": "2023-08-31",
    "sic": "3585",
    "state_of_inc": "NV",
    "state_location": "N8",
    "fiscal_year_end": "0831",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1700844/0001493152-23-044857-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1700844/000149315223044857/form10-k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1700844/0001493152-23-044857.txt",
    "filename": "1700844_10K_2023_0001493152-23-044857.htm",
    "content": "ITEM 1A. RISK FACTORS\nRisks Related to Our Business and Industry\nIf we are unable to continue to innovate, meet evolving market trends, adapt to changing customer demands and maintain our culture of innovation, our ability to sustain and grow our business may suffer.\nThe ongoing success of our business depends on our ability to continue to introduce innovative eco-friendly HVAC products to meet evolving market trends and satisfy changing customer demands. We must continue to adapt by innovating, improving our products and modifying our strategies, which could cause us to incur substantial costs. We may not be able to continue to innovate or adapt to changing market and customer needs in a timely and cost-effective manner, if at all. This could adversely impact our ability to expand our ecosystem and grow our business. Failure to develop new products to meet evolving market demands through innovation could cause us to lose current and potential customers and harm our operating results and financial condition.\nIn addition, we may not be able to maintain our culture of innovation, which has been critical to our success and has helped us create value for our shareholders, succeed as a leader in eco-friendly HVAC products, attract, retain and motivate employees and other ecosystem participants. Among other challenges, we may not be able to identify and promote people into leadership positions who share our culture and also focus on technology and innovation. Competitive pressure may also cause us to move in directions that may divert us from our mission, vision and values. If we cannot maintain our culture of innovation, our long-term business prospects could be materially and adversely affected.\n18 | Page\nWe are exposed to concentration risk of heavy reliance on our largest nano copper supplier for the supply of nano copper solution for our INCU technology, and any shortage of, or delay in, the supply may significantly impact on our business and results of operation.\nWe source INCU nano copper solution for incorporation of our INCU technology into our air purifier products for sale to our customers from our largest nano copper supplier. As such, we rely on the ability and efficiency of our largest supplier to supply products. Our purchase from our largest nano copper supplier amounted to approximately Nil and $315,627 for FYE2023 and FYE 2022, respectively, representing approximately 37% and 30% of our total purchases, respectively. Our purchases from our top largest supplier accounted for a significant portion of our total purchases for FYE2022 and FYE2021.\nAs we do not engage in manufacturing of nano copper solution, our business, financial condition and operating results for our air purifier system depends on the continuous supply of nano copper solution from our largest supplier and our continuous supplier-customer relationship with them. Our heavy reliance on our largest supplier for the supply of nano copper solution will have significant impact on our air purifier business and results of operation in the event of any shortage of, or delay in the supply. Our product supply may also be disrupted by potential labor disputes, strike action or natural disasters or other accidents affecting our largest supplier. If our largest suppliers do not supply products to us in a timely manner or in sufficient quantities, our business, financial condition and operating results may be materially and adversely affected. Any shortage of, disruption, or delay in the supply, or our inability to obtain supplies from alternative sources will have a significant impact on our business and results of operation.\nWe entered into distribution agreement with our nano copper solution supplier in September, 2020 and December 2021. As is customary in the supply or sales arrangements, the agreements with our largest supplier are terminable by either party by giving notice. We cannot guarantee that our largest suppliers will not terminate the agreements before the expiry of the agreements. In the event that our largest suppliers terminate the agreements, we will have to source products from other suppliers and we may not be able to secure a similar supply of products with the quantity and quality required to support our business or at all. Such termination may therefore have a material adverse impact on our business, financial condition and operating results if we fail to engage any other suppliers with similar standards before the termination.\nThere is no assurance that our major nano copper supplier and supplier of raw materials for our other products will continue to supply their products in the quantities and timeframes required by us to meet the demand of our customers or comply with their supply agreements with us. If our major supplier does not supply products to us in a timely manner or in sufficient quantities, our business, financial condition and operating results may be materially and adversely affected. Furthermore, in the event of any delay in delivery of the products to us, our cash flow or working capital may be materially and adversely affected as a result of the corresponding delay in delivery of our products to our customers, and hence the delay in our receipt of payment from our customers.\nFurthermore, our largest nano copper supplier may change their existing sales or marketing strategy in respect of the products supplied to us by changing its export strategy, reducing its sales or production volume or changing its selling prices. As a result, there is no assurance that our largest supplier will not appoint other agents, dealers or distributors which may compete with us in the market where we operate. Furthermore, any significant increase in the selling prices of the products which we source from our largest suppliers will increase our costs and may materially and adversely affect our profit margin if we are not able to pass the increased costs on to our customers.\nThere is no assurance that there will be no deterioration in our relationship with our largest supplier which could affect our ability to secure sufficient supply of products for our business. In the event that our largest supplier change their sales or marketing strategy or otherwise appoints other dealers or distributors who may compete with us, our business, financial condition and operating results may be materially and adversely affected.\nWe operate in a competitive industry, and if we fail to compete effectively, our business could suffer.\nThe air-conditioning and air purifying industry in Asia is highly competitive. Competition in our HVAC products includes several multinational, regional and local companies, the largest players of which include Daikin Industries, Gree Electric, Trane Technologies, Johnson Controls, Lennox International, Midea Group and Mitsubishi Electric. Sales depend on price, product availability, delivery schedule, product performance, product line breadth, brand reputation, design, technical expertise and service. In addition to established players, we face competition from new market entrants. Increased competition may lead to a loss of market share, increased difficulty in launching new service offerings, reduction in revenue or increase in loss, any one of which could harm our business, financial condition and results of operations.\nIn certain of our businesses, our contracts are typically awarded on a competitive basis. Our bids are based upon, among other factors, the cost to timely provide the products and services. To generate an acceptable return, we must accurately estimate our costs and schedule. If we fail to do so, the profitability of contracts may be materially and adversely affected - including because some of our contracts provide for liquidated damages if we do not perform on time - which could have a material adverse effect on our competitive position, results of operations, cash flows or financial condition.\n19 | Page\nIf we are unable to create brand influence, we may not be able to maintain current or attract new users and customers for our products.\nOur operational and financial performance is highly dependent on the strength of our brand. We believe brand familiarity and preference will continue to have a significant role in winning over customers. In order to further expand our customer base, we may need to substantially increase our marketing expenditures to enhance brand awareness through various online and offline means. Moreover, negative coverage in the media of our company could threaten the perception of our brand, and we cannot assure you that we will be able to defuse negative press coverage about our company to the satisfaction of our investors, customers and suppliers. If we are unable to defuse negative press coverage about our company, our brand may suffer in the marketplace, our operational and financial performance may be negatively impacted.\nCurrently, we sell our products, under our various product line brands, to domestic customers in Malaysia and to overseas customers. However, while the management does not consider the likelihood to be high, if our competitors initiate a lawsuit against us for infringing their trademarks, we may be forced to adopt a new brand name for our products. As a result, we may incur additional marketing cost to raise awareness of such new brand name. We may also be ordered to pay a significant amount of damages, and our business, results of operations and financial condition could be materially and adversely affected. We operate in a competitive environment and our profitability and competitive position depend on our ability to accurately estimate the costs and timing of providing our products and services.\nClimate change and regulations associated with climate change could adversely affect our business.\nThe effects of climate change, including extreme weather conditions, create financial risks to our business. The effects of climate change could disrupt our operations by impacting the availability and cost of materials and by increasing insurance and other operating costs. The effects of climate change also may impact our decisions to construct new facilities or maintain existing facilities in the areas most prone to physical risks, which could similarly increase our operating and material costs. We could also face indirect financial risks passed through the supply chain that could result in higher prices for our products and the resources needed to produce them.\nThere is a general consensus that greenhouse gas emissions are linked to climate change, and that these emissions must be reduced dramatically to avert its worst effects. As a result, increased public awareness and concern about climate change will likely continue to (1) generate more international, regional and/or national concerns and result in the implementation of further requirements and restrictions at international, regional and/or national level to curtail the use of high global warming potential refrigerants (which are essential to many of our products); (2) encourage increase in building energy efficiency; and (3) cause a shift away from the use of fossil fuels as an energy source. While our products are focused on being eco-friendly, these requirements may render some of the existing technology, particularly some of our products that require refrigerant use, non-compliant or obsolete. While we continue to be committed to developing eco-friendly sustainable solutions for our products, there can be no assurance that our development efforts will be successful, that our products will be accepted by the market, that proposed regulations or deregulation will not have an adverse effect on our competitive position, or that economic returns will reflect our investments in new product development.\nThe inconsistent international, regional and/or national requirements associated with climate change regulations also create economic and regulatory uncertainty. There is also regulatory and budgetary uncertainty associated with government incentives, which, if discontinued, could adversely impact the demand for energy-efficient buildings and could increase costs of compliance.\nOur business and financial performance depend on continued and substantial investments in our information technology infrastructure, which may not yield anticipated benefits and which may be vulnerable to cyber-attacks.\nThe efficient operation of our business requires continued and substantial investments in information technology (IT) infrastructure systems. The failure to design, develop and implement new IT technology infrastructure systems in an effective and timely manner or to maintain existing systems could divert managements attention and resources. Our information systems may also become obsolete because of inadequate investments, requiring an unplanned transition to a new platform that could be time consuming, costly, and damaging to our competitive position and could require additional management attention. Repeated or prolonged interruptions of service because of poor execution, inadequate investments or obsolescence could have a significant adverse impact on our reputation and our ability to sell products and services.\n20 | Page\nIn addition, our business may be impacted by disruptions to our or third-party IT infrastructure, which could result from (among other causes) cyber-attacks, infrastructure failures or compromises to our physical security. Cyber-based risks are evolving and include attacks: (i) on our IT infrastructure (ii) targeting the security, integrity and/or availability of hardware and software; (iii) on information installed, stored or transmitted in our products (including after the purchase of those products and when they are installed into third-party products); and (iv) on facilities or similar infrastructure. Such attacks could disrupt our systems (or those of third parties) and business operations, impact the ability of our products to work as intended or result in the unauthorized access, use, disclosure, modification, or destruction of information in violation of applicable law and/or contractual obligations. We have experienced cyber-based attacks and, due to the evolving threat landscape, may continue to experience them going forward, potentially with more frequency or severity. We continue to make investments and adopt measures to enhance our protection, detection, response and recovery capabilities, and to mitigate potential risks to our technology, products, services, operations and confidential data. However, depending on the nature, sophistication and scope of cyber-attacks, it is possible that potential vulnerabilities could go undetected for an extended period. As a result, we could potentially experience: (i) production downtimes; (ii) operational delays or other detrimental impacts on our operations; (iii) destruction or corruption of data; (iv) security breaches; (v) manipulation or improper use of our or third-party systems, networks or products; and (vi) financial losses from remedial actions, loss of business, liability, penalties, fines and/or damage to our reputation-any of which could have a material adverse effect on our competitive position, results of operations, cash flows or financial condition. Due to the evolving nature of such risks, the impact of any potential incident cannot be predicted. In addition, because of the global nature of our business, our internal systems and products must comply with applicable laws, regulations and standards in a number of jurisdictions, and government enforcement actions and violations of data privacy and cybersecurity laws could be costly or interrupt our business operations. Any disruption to our business arising from such issues, or an increase in our costs to cover these issues that is greater than what we have anticipated, could have an adverse effect on our competitive position, reputation, results of operations, cash flows or financial condition.\nWe depend on our intellectual property and have access to certain intellectual property and information of our customers and suppliers. Infringement of or the failure to protect that intellectual property could adversely affect our future growth and success.\nThe Companys intellectual property rights are important to our business and include numerous patents, trademarks, proprietary technology, technical data, business processes and other confidential information. Although we consider our intellectual property rights in the aggregate to be valuable, we do not believe that our business is materially dependent on a single intellectual property right or any group of them. We nonetheless rely on a combination of patents, trademarks, nondisclosure agreements, customer and supplier agreements, license agreements, information technology security systems, internal controls and compliance systems and other measures to protect our intellectual property. We also rely on nondisclosure agreements, information technology security systems and other measures to protect certain customer and supplier information and intellectual property that we have in our possession or to which we have access. Our efforts to protect such intellectual property and proprietary information may not be sufficient, however.\nWe cannot be sure that our pending patent applications will result in the issuance of patents, that patents issued to or licensed by us in the past or in the future will not be challenged or circumvented by competitors, or that these patents will found to be valid or sufficiently broad to preclude our competitors from introducing technologies similar to those covered by our patents and patent applications.\nIn addition, we may be the target of competitor or other third-party patent enforcement actions seeking substantial monetary damages or seeking to prevent the sale and marketing of certain of our products. Our competitive position also may be adversely impacted by limitations on our ability to obtain possession, ownership or necessary licenses concerning data important to the development or sale of our products or service offerings, or by limitations on our ability to restrict the use by others of data related to our products or services. Any of these events or factors could subject us to judgments, penalties and significant litigation costs or temporarily or permanently disrupt our sales and marketing of the affected products or services and could have a material adverse effect on our competitive position, results of operations, cash flows or financial condition.\n21 | Page\nWe use a variety of raw materials and supplier-provided parts in our business. Significant shortages, supplier capacity constraints or production disruptions, price increases, or tariffs could increase our operating costs and adversely impact the competitive positions of our products.\nOur reliance on suppliers and commodity markets to secure components and raw materials (such as copper and steel as well as INCU ionic copper solution), and on service providers to deliver our products, exposes us to volatility in the prices and availability of these materials and services. That potential volatility is particularly acute in certain instances where we depend upon a single source. Issues with suppliers (such as delivery or production disruptions, capacity constraints, quality issues, consolidations, closings or bankruptcies), price increases, raw material shortages, or the decreased availability of trucks and other delivery services could have a material adverse effect on our ability to meet our commitments to customers or increase our operating costs.\nWe use various strategies to lock in prices of expected purchases of certain raw materials; however, these efforts could cause us to pay higher prices for a commodity when compared with the market price at the time the commodity is actually purchased or delivered. Tariffs can also increase our costs, the impact of which is difficult to predict. However, we believe that our supply management and production practices appropriately balance the foreseeable risks and the costs of alternative practices. Nonetheless, these risks may have a material adverse effect on our competitive position, results of operations, cash flows or financial condition.\nWe design, manufacture and service products that incorporate advanced technologies. The introduction of new products and technologies involves risks, and we may not realize the degree or timing of benefits initially anticipated.\nOur future success depends on designing, developing, producing, selling and supporting innovative products that incorporate advanced technologies. The regulations applicable to our products, as well as our customers product and service needs, change from time to time. Moreover, regulatory changes may render our products and technologies non-compliant. Our ability to realize the anticipated benefits of our technological advancements or product improvements - including those associated with regulatory changes - depends on a variety of factors, including: meeting development, production, and regulatory approval schedules; meeting performance plans and expectations; the availability of raw materials and parts; our suppliers performance; the hiring, training and deployment of qualified personnel; achieving efficiencies; identifying emerging regulatory and technological trends; validating innovative technologies; the level of customer interest in new technologies and products; and the costs and customer acceptance of our new or improved products.\nFailure to achieve and maintain a high level of product and service quality could damage our reputation with customers and negatively impact our results.\nProduct and service quality issues could harm customer confidence in our company and our brands. If certain of our product offerings do not meet applicable safety standards or our customers expectations regarding safety or quality, we can experience lost sales and increased costs and we can and have been exposed to legal, financial and reputational risks. Actual, potential or perceived product safety concerns could expose us to litigation as well as government enforcement actions, which has also occurred in certain instances. In addition, when our products fail to perform as expected, we are exposed to warranty, product liability claims, personal injury and other claims.\nWe maintain strict quality controls and procedures. However, we cannot be certain that these controls and procedures will reveal defects in our products or their raw materials, which may not become apparent until after the products have been placed in use in the market. Accordingly, there is a risk that products will have defects, which could require a product recall. Product recalls can be expensive to implement, and may damage our reputation, customer relationships and market share.\nIn many jurisdictions, product liability claims are not limited to any specified amount of recovery. If any such claims or contribution requests or requirements exceed our available insurance or if there is a product recall, there could be an adverse impact on our results of operations. In addition, a recall or claim could require us to review our entire product portfolio to assess whether similar issues are present in other products, which could result in a significant disruption to our business and which could have a further adverse impact on our business, financial condition, results of operations and cash flows. There can be no assurance that we will not experience any material warranty or product liability claim losses in the future, that we will not incur significant costs to defend such claims or that we will have adequate reserves to cover any recalls, repair and replacement costs.\n22 | Page\nWe are subject to litigation, environmental, and other legal and compliance risks.\nWe are subject to a variety of litigation, legal and compliance risks. These risks relate to, among other things, personal injuries, intellectual property rights, contract-related claims, taxes, environmental matters, employee health and safety, competition laws and laws governing improper business practices. If found responsible in connection with such matters, we could be subject to significant fines, penalties, repayments and other damages (in certain cases, treble damages), and experience reputational harm.\nOn October 8, 2021, a filing (the Filing) was made with the Kuala Lumpur High Court by a reseller (the Reseller) of the Companys INCU ionic nano copper solution (the Solution) and the Resellers related party (together with the Reseller, the Plaintiffs). The Reseller was authorized by WKL Eco Earth as its sole distributor of the Solution (the WKL Distributor) to resell the Solution together with a diffuser with a capacity of not more than 1000ml through a tripartite agreement (the Tripartite Agreement) entered into between (a) the Reseller, (b) the WKL Distributor and (c) a solution packaging company (the Packaging Company). WKL Eco Earth was not a party to the Tripartite Agreement and did not directly authorize or engage the Reseller in the resale of the Solution. In the Filing, the Plaintiffs claimed against (i) WKL Eco Earth; (ii) Dr. Low; (iii) Chan Kok Wei, (iv) the Packaging Company and (v) two directors of the Packaging Company for loss and damages arising from an alleged breach of contract, defamation and tort of inducement. The Plaintiffs also alleged that pursuant to the Tripartite Agreement, WKL Eco Earth was prohibited from selling the Solution to any party other than the WKL Distributor, and that the Tripartite Agreement allowed for the resale of the Solution by the Plaintiffs without limitation, the Plaintiffs were not confined in their resale of the Solution to a product consisting of a diffuser with a capacity of not more than 1000ml. The Company believes the claims are without merit and will defend itself against the claims.\nAs a global business, we are subject to complex laws and regulations in Malaysia. and other countries in which we operate. Those laws and regulations may be interpreted in different ways. They may also change from time to time, as may related interpretations and other guidance. Changes in laws or regulations could result in higher expenses. Uncertainty relating to laws or regulations may also affect how we operate, structure our investments and enforce our rights.\nChanges in environmental and climate change related-laws could require additional investments in product designs, which may be more expensive or difficult to manufacture, qualify and sell and/or may involve additional product safety risks and could increase environmental compliance expenditures.\nAt times we are involved in disputes with private parties over environmental issues, including litigation over the allocation of cleanup costs, alleged personal injuries and property damage. Existing and future asbestos-related claims could adversely affect our financial condition, results of operations and cash flows. Personal injury lawsuits may involve individual and purported class actions alleging that contaminants originating from our current or former products or operating facilities caused or contributed to medical conditions. Property damage lawsuits may involve claims relating to environmental damage or diminution of real estate values. Even in litigation where we believe our liability is remote, there is a risk that a negative finding or decision could have a material adverse effect on our competitive position, results of operations, cash flows or financial condition, in particular with respect to environmental claims in regions where we have, or previously had, significant operations or where certain of our products have been manufactured and used.\nOur failure to comply with anti-corruption laws and regulations, or effectively manage our employees, customers and business partners, could severely damage our reputation, and materially and adversely affect our business, financial condition, results of operations and prospects.\nWe are subject to risks in relation to actions taken by us, our employees, third-party customers or third-party suppliers that constitute violations of the anti-corruption laws and regulations. While we adopt strict internal procedures and work closely with relevant government agencies to ensure compliance of our business operations with relevant laws and regulations, our efforts may not be sufficient to ensure that we comply with relevant laws and regulations at all times. If we, our employees, third-party customers or third-party suppliers violate these laws, rules or regulations, we could be subject to fines and/or other penalties. Actions by Malaysia regulatory authorities or the courts to provide an alternative interpretation of the laws and regulations or to adopt additional anti-bribery or anti-corruption related regulations could also require us to make changes to our operations. Our reputation, corporate image, and business operations may be materially and adversely affected if we fail to comply with these measures or become the target of any negative publicity as a result of actions taken by us, our employees, third-party customers or third-party suppliers.\nOur business depends on the continued contributions made by Low Wai Koon (Dr. Low), as our founder, chief executive officer, chief operating officer and chairman of the board, the loss of who may result in a severe impediment to our business, results of operation and financial condition.\nOur success is dependent upon the continued contributions made by founder, chief executive officer, chief operating officer and chairman of the board, Dr. Low. We rely on his expertise in business operations when we are developing our business. We have no Key Man insurance to cover the resulting losses in the event that Dr. Low should die or resign. In order to mitigate this risk, the Group has continued to invest in its personnel training as well as investment into its research and development department.\nHowever, if Dr. Low cannot serve the Company or is no longer willing to do so, the Company may not be able to find alternatives in a timely manner or at all. This would likely result in severe damage to our business operations and would have an adverse material impact on our financial position and operating results. To sustain our operations, the Company may have to recruit and train replacement personnel at a higher cost. In addition, if Dr. Low joins our competitors or develops similar businesses that are in competition with our Company, our business, results of operation and financial conditions may also be negatively impacted.\n23 | Page\nRisks Related to Doing Business in Malaysia\nDevelopments in the social, political, regulatory and economic environment in Malaysia may have a material adverse impact on us.\nOur business, prospects, financial condition and results of operations may be adversely affected by social, political, regulatory and economic developments in Malaysia. Such political and economic uncertainties include, but are not limited to, the risks of war, terrorism, nationalism, nullification of contract, changes in interest rates, imposition of capital controls and methods of taxation.\nAccording to Economy Outlook 2024 from Ministry of Finance Malaysia, global growth is projected to moderate in 2023 and 2024 following slow growth in advanced economies; volatile financial market due to tightening monetary policy; prolonged geopolitical tensions; and increasing climatic changes. Nevertheless, inflation continues to soften as markets head towards supply chain stabilisation. In addition, world trade is projected to moderate in 2023 in line with weaker global demand. However, global trade is expected to increase in 2024 in tandem with improved trade activity in advanced economies, and emerging market and developing economies (EMDEs). In the case of Malaysia, the economy continued to expand amid these persistent challenges in the external environment. During the first half of 2023, GDP posted a growth of 4.2% supported by resilient domestic demand, in particular private expenditure.\nDespite escalating uncertainties in the global landscape, Malaysias economy remains resilient. The GDP is forecast to expand by approximately 4% in 2023 and between 4% and 5% in 2024. The Government acknowledged the World Banks forecast that Malaysias growth will be 4.3% in 2024, which is slightly higher than its initial estimate. This is in line with Malaysias 2024 growth projection, which will be achieved through robust domestic demand, effectively offsetting the challenges posed by the moderate global growth, supported by the implementation of measures in the new National Energy Transition Roadmap (NETR), New Industrial Master Plan 2030 (NIMP 2030), and the Mid-Term Review of the Twelfth Malaysia Plan (MTR of the Twelfth Plan).\nOn March 11, 2020, the World Health Organization or WHO declared the corona virus or COVID-19 a pandemic. To help counter the transmission of COVID-19, from March 18, 2020 to April 26, 2022, the government of Malaysia initiated Movement Control Orders (MCO). The MCO had resulted in quarantines, travel restrictions, and the temporary closure of stores and facilities in Malaysia. Conditional Movement Control Orders were introduced where most business sectors were allowed to operate under strict rules and Standard Operating Procedures mandated by the government of Malaysia, followed by Recovery Movement Control Orders. At the height of the pandemic, on January 12, 2021, the Malaysian government even declared a state of emergency nationwide to combat COVID-19. On April 1, 2022, the Malaysian government announced the country had begun transitioning into the endemic phase with further easing of restrictions. We are witnessing the adverse impact on the purchasing power of consumers in Malaysia, where our products are mainly sold as a direct result of the prolonged pandemic. As such, the extent to which the coronavirus may continue to adversely impact the Malaysian economy is uncertain. In the event that the Malaysia economy suffers, demand for our products may diminish, which would in turn result in our profitability. This could in turn result in a substantial need for restructuring of our business objectives and could result in a partial or entire loss of an investment in our Company.\nWe are subject to foreign exchange control policies in Malaysia.\nThe ability of our subsidiaries to pay dividends or make other payments to us may be restricted by the foreign exchange control policies in the countries where we operate. For example, there are foreign exchange policies in Malaysia which support the monitoring of capital flows into and out of the country in order to preserve its financial and economic stability. The foreign exchange policies are administered by the Foreign Exchange Administration, an arm of Bank Negara Malaysia (BNM), the central bank of Malaysia. The foreign exchange policies monitor and regulate both residents and non-residents. Under the current Foreign Exchange Administration rules issued by BNM, non-residents are free to repatriate any amount of funds from Malaysia in foreign currency other than the currency of Israel at any time (subject to limited exceptions), including capital, divestment proceeds, profits, dividends, rental, fees and interest arising from investment in Malaysia, subject to any withholding tax. In the event BNM or any other country where we operate introduces any restrictions in the future, we may be affected in our ability to repatriate dividends or other payments from our subsidiaries in Malaysia or in such other countries. Since we are a holding company and rely principally on dividends and other payments from our subsidiaries for our cash requirements, any restrictions on such dividends or other payments could materially and adversely affect our liquidity, financial condition and results of operation.\n24 | Page\nMany of the economies in Asia, including Singapore, are experiencing substantial inflationary pressures which may prompt the governments to take action to control the growth of the economy and inflation that could lead to a significant decrease in our profitability in the future.\nWhile many of the economies in Asia have experienced rapid growth over the last two decades, they currently are experiencing inflationary pressures. As governments take steps to address the current inflationary pressures, there may be significant changes in the availability of bank credit, interest rate increases, limitations on loans, or restrictions on currency conversions and foreign investment. There also may be imposition of price controls. If prices for the products we source or if wages rise at a rate that is insufficient to compensate for the rise in these costs, it may have an adverse effect on our profitability. If these or other similar restrictions are imposed by a government to influence the economy, it may lead to a slowing of economic growth. Singapores core inflation rose to 5.3% on a year-on-year (y-o-y) basis in September 2022, compared to 5.1% in August 2022. The pickup in core inflation was on account of larger increases in the prices of food, services and retail & other goods. CPI (consumer price index)-All Items inflation was 7.5% year-over-year in September 2022, unchanged from that in August.\n(source: https://www.mas.gov.sg/-/media/MAS/EPG/CPD/2022/Inflation202209.pdf)\nWhile this inflationary trend will result in higher operational costs, we believe that this also strengthens our value proposition by emphasizing potential savings to customers through improved productivity and workflow efficiency derived from our technology solutions. To mitigate inflationary pressures, we will regularly review our pricing structure to ensure sustainable profitability.\nRisks Related to Intellectual Property\nIf we are not able to adequately protect our proprietary intellectual property and information, and protect against third party claims that we are infringing on their intellectual property rights, our results of operations could be adversely affected.\nThe value of our business depends in part on our ability to protect our intellectual property including our patents applications and trademarks, as well as our customer, employee, and customer data. Third parties may try to challenge our ownership of our intellectual property in Asia and around the world. In addition, intellectual property rights and protections in Malaysia may be insufficient to protect material intellectual property rights. Further, our business is subject to the risk of third parties counterfeiting our products or infringing on our intellectual property rights. The steps we have taken may not prevent unauthorized use of our intellectual property. We may need to resort to litigation to protect our intellectual property rights, which could result in substantial costs and diversion of resources. If we fail to protect our proprietary intellectual property and information, including with respect to any successful challenge to our ownership of intellectual property or material infringements of our intellectual property, this failure could have a significant adverse effect on our business, financial condition, and results of operations.\nIf we are unable to adequately protect our intellectual property rights, or if we are accused of infringing on the intellectual property rights of others, our competitive position could be harmed or we could be required to incur significant expenses to enforce or defend our rights.\nOur commercial success will depend in part on our success in obtaining and maintaining patents, copyrights, trademarks, trade secrets and other intellectual property rights in Malaysia and elsewhere and protecting our proprietary technology. If we do not adequately protect our intellectual property and proprietary technology, competitors may be able to use our technologies or the goodwill we have acquired in the marketplace and erode or negate any competitive advantage we may have, which could harm our business and ability to achieve profitability.\nWe cannot provide any assurances that any of our pending patent applications that mature into issued patents will include a scope sufficient to protect our products, any additional features we develop for our products or any new products. Other parties may have developed technologies that may be related or competitive to our system, may have filed or may file patent applications and may have received or may receive patents that overlap or conflict with our patent applications, either by claiming the same methods or devices or by claiming subject matter that could dominate our patent position. Our patent position may involve complex legal and factual questions, and, therefore, the scope, validity and enforceability of any patent claims that we may obtain cannot be predicted with certainty. Patents, if issued, may be challenged, deemed unenforceable, invalidated or circumvented. Proceedings challenging our patents could result in either loss of the patent or denial of the patent application or loss or reduction in the scope of one or more of the claims of the patent or patent application. In addition, such proceedings may be costly. Thus, any patents that we may own may not provide any protection against competitors. Furthermore, an adverse decision in an interference proceeding can result in a third party receiving the patent right sought by us, which in turn could affect our ability to commercialize our products.\n25 | Page\nThough an issued patent is presumed valid and enforceable, its issuance is not conclusive as to its validity or its enforceability and it may not provide us with adequate proprietary protection or competitive advantages against competitors with similar products. Competitors could purchase our products and attempt to replicate some or all of the competitive advantages we derive from our development efforts, willfully infringe our intellectual property rights, design around our patents, or develop and obtain patent protection for more effective technologies, designs or methods.\nWe may be unable to prevent the unauthorized disclosure or use of our technical knowledge or trade secrets by consultants, suppliers, vendors, former employees and current employees.\nOur ability to enforce our patent rights depends on our ability to detect infringement. It may be difficult to detect infringers who do not advertise the components that are used in their products. Moreover, it may be difficult or impossible to obtain evidence of infringement in a competitors or potential competitors product. We may not prevail in any lawsuits that we initiate and the damages or other remedies awarded if we were to prevail may not be commercially meaningful.\nIn addition, proceedings to enforce or defend our patents could put our patents at risk of being invalidated, held unenforceable or interpreted narrowly. Such proceedings could also provoke third parties to assert claims against us, including that some or all of the claims in one or more of our patents are invalid or otherwise unenforceable. If any of our patents covering our products are invalidated or found unenforceable, or if a court found that valid, enforceable patents held by third parties covered one or more of our products, our competitive position could be harmed or we could be required to incur significant expenses to enforce or defend our rights.\nThe degree of future protection for our proprietary rights is uncertain, and we cannot ensure that:\n● any of our pending patent applications, if issued, will include claims having a scope sufficient to protect our products;\n● any of our pending patent applications will be issued as patents;\n● we were the first to file patent applications for these inventions;\n● others will not develop similar or alternative technologies that do not infringe our patents; any of our patents will be found to ultimately be valid and enforceable;\n● any patents issued to us will provide a basis for an exclusive market for our commercially viable products, will provide us with any competitive advantages or will not be challenged by third parties;\n● we will develop additional proprietary technologies or products that are separately patentable; or\n● our commercial activities or products will not infringe upon the patents of others.\nWe rely, in part, upon unpatented know-how and continuing technological innovation to develop and maintain our competitive position. Further, our trade secrets could otherwise become known or be independently discovered by our competitors.\n26 | Page\nRisks Relating to Our Securities\nThere may not be sufficient liquidity in the market for our securities in order for investors to sell their securities.\nThere is currently only a limited public market for our ordinary share, which is listed on the Over-the-Counter Pink Sheets, and there can be no assurance that a trading market will develop further or be maintained in the future.\nVolatility in our shares price may subject us to securities litigation.\nThe market for our shares may have, when compared to seasoned issuers, significant price volatility and we expect that our share price may continue to be more volatile than that of a seasoned issuer for the indefinite future. In the past, plaintiffs have often initiated securities class action litigation against a company following periods of volatility in the market price of its securities. We may, in the future, be the target of similar litigation. Securities litigation could result in substantial costs and liabilities and could divert managements attention and resources.\nOur ordinary share may be considered a penny stock and may be difficult to sell.\nThe SEC has adopted regulations which generally define a penny stock to be an equity security that has a market price of less than $5.00 per share or an exercise price of less than $5.00 per share, subject to specific exemptions. The market price of our ordinary share is less than $5.00 per share and, therefore, it may be designated as a penny stock according to SEC rules. This designation requires any broker or dealer selling these securities to disclose certain information concerning the transaction, obtain a written agreement from the purchaser and determine that the purchaser is reasonably suitable to purchase the securities. These rules may restrict the ability of brokers or dealers to sell our ordinary share and may affect the ability of investors to sell their shares.\nThe market for penny stocks has experienced numerous frauds and abuses, which could adversely impact investors in our stock.\nOTC Pink Sheet securities are frequent targets of fraud or market manipulation, both because of their generally low prices and because OTC Pink Sheet reporting requirements are less stringent than those of the stock exchanges or NASDAQ.\nPatterns of fraud and abuse include:\n● Control of the market for the security by one or a few broker-dealers that are often related to the promoter or issuer;\n● Manipulation of prices through prearranged matching of purchases and sales and false and misleading press releases;\n● Boiler room practices involving high pressure sales tactics and unrealistic price projections by inexperienced sales persons;\n● Excessive and undisclosed bid-ask differentials and mark-ups by selling broker-dealers; and\n● Wholesale dumping of the same securities by promoters and broker-dealers after prices have been manipulated to a desired level, along with the inevitable collapse of those prices with consequent investor losses.\n● Our management is aware of the abuses that have occurred historically in the penny stock market.\nWe have not paid dividends in the past and do not expect to pay dividends in the foreseeable future and any return on investment may be limited to the value of our stock.\nWe have never paid any cash dividends on our ordinary share and do not anticipate paying any cash dividends on our ordinary share in the foreseeable future and any return on investment may be limited to the value of our stock. We plan to retain any future earnings to finance growth.\nWe are a smaller reporting company, and we cannot be certain if the reduced disclosure requirements applicable to smaller reporting companies will make our common stock less attractive to investors.\nWe are currently a smaller reporting company, meaning that we are not an investment company, an asset- backed issuer, or a majority-owned subsidiary of a parent company that is not a smaller reporting company and annual revenues of less than $50.0 million during the most recently completed fiscal year. In the event that we are still considered a smaller reporting company, at such time as we cease being an emerging growth company, we will be required to provide additional disclosure in our SEC filings. However, similar to an emerging growth companies, smaller reporting companies are able to provide simplified executive compensation disclosures in their filings; are exempt from the provisions of Section 404(b) of the Sarbanes-Oxley Act requiring that independent registered public accounting firms provide an attestation report on the effectiveness of internal control over financial reporting; and have certain other decreased disclosure obligations in their SEC filings, including, among other things, only being required to provide two years of audited financial statements in annual reports. Decreased disclosures in our SEC filings due to our status as a smaller reporting company may make it harder for investors to analyze our results of operations and financial prospects.\n27 | Page\nGeneral Risks\nNatural disasters, epidemics or other unexpected events may disrupt our operations, adversely affect our results of operations, financial condition and may not be fully covered by insurance.\nThe occurrence of one or more natural disasters, power outages or other unexpected events, including hurricanes, fires, earthquakes, volcanic eruptions, tsunamis, floods and other forms of severe weather, health epidemics, pandemics (including COVID-19) or other contagious outbreaks, conflicts, wars or terrorist acts, in the U.S. or in other countries in which we or our suppliers or customers operate could adversely affect our operations and financial performance. Natural disasters, power outages or other unexpected events could damage or close one or more of our facilities or disrupt our operations temporarily or long-term, such as by causing business interruptions or by affecting the availability and/or cost of materials needed for manufacturing. We have only one factory and another assembly line that can manufacture a specific product or product line. As a result, damage to or the closure of that factory may disrupt or prevent us from manufacturing certain products. Existing insurance arrangements may not cover all of the costs or lost cash flows that may arise from such events. The occurrence of any of these events could also increase our insurance and other operating costs or harm our sales.\nWe may be affected by global economic, capital market and political conditions, and conditions in the construction, transportation and infrastructure industries in particular.\nOur business, financial condition, operating results and cash flows may be adversely affected by changes in global economic conditions and geopolitical risks and conditions, including credit market conditions, levels of consumer and business confidence, fluctuations in residential, commercial and industrial construction activity, pandemic health issues (including COVID-19 and its effects), natural disasters, commodity prices, energy costs, interest rates, foreign exchange rates, levels of government spending and deficits, trade policies (including tariffs, boycotts and sanctions), regulatory changes, actual or anticipated default on sovereign debt and other challenges that could affect the global economy.\nThese economic and political conditions affect our business in a number of ways. Additionally, the tightening of credit in the capital markets could adversely affect the ability of our customers, including individual end-customers and businesses, to obtain financing for significant purchases and operations, which could result in a decrease in or cancellation of orders for our products and services. Similarly, tightening credit may adversely affect our supply base and increase the potential for one or more of our suppliers to experience financial distress or bankruptcy. Additionally, because we have a number of factories and suppliers in foreign countries, the imposition of tariffs or sanctions or unusually restrictive border crossing rules could adversely affect our supply chain, operations and overall business.\nOur business and financial performance is also adversely affected by decreases in the general level of economic activity, such as decreases in business and consumer spending and construction (both residential and commercial as well as remodelling).\nOur business success depends on attracting and retaining qualified personnel.\nOur ability to sustain and grow our business requires us to hire, retain and develop a highly skilled and diverse management team and workforce. Failure to ensure that we have leadership with the necessary skill sets and experience could impede our ability to deliver our growth objectives, execute our strategic plan and effectively transition our leadership. ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone. ITEM 2.\nPROPERTIES\nThe Companys principal executive office is located at 31-A2, Jalan 5/32A, 6 ½ Miles off Jalan Kepong, 52000 Kuala Lumpur, Malaysia. We also have an office located in Cambodia located at R01 of House No 62Z Street 274, Village 04, Sangkat Tonle Basak, Khan Chamkamorn, Phnom Pehnh, Cambodia and an office located in China at Shunde Western Ecological Industry Startup Zone D-08-01 (Foshan City, Shunde District, Xingtan Town, Depin Road no.1, Level 3). ITEM 3. LEGAL PROCEEDINGS\nOn October 8, 2021, a filing (the Filing) was made with the Kuala Lumpur High Court by a reseller (the Reseller) of the Companys INCU ionic nano copper solution (the Solution) and the Resellers related party (together with the Reseller, the Plaintiffs). The Reseller was authorized by WKL Eco Earths sole distributor of the Solution (the WKL Distributor) to resell the Solution together with a diffuser with a capacity of not more than 1000ml through a tripartite agreement (the Tripartite Agreement) entered into between (a) the Reseller, (b) the WKL Distributor and (c) a solution packaging company (the Packaging Company). WKL Eco Earth was not a party to the Tripartite Agreement and did not directly authorize or engage the Reseller in the resale of the Solution. In the Filing, the Plaintiffs claimed against (i) WKL Eco Earth; (ii) Dr. Low; (iii) Chan Kok Wei, (iv) the Packaging Company and (v) two directors of the Packaging Company for loss and damages arising from an alleged breach of contract, defamation and tort of inducement. The Plaintiffs also alleged that pursuant to the Tripartite Agreement, WKL Eco Earth was prohibited from selling the Solution to any party other than the WKL Distributor, and that the Tripartite Agreement allowed for the resale of the Solution by the Plaintiffs without limitation, the Plaintiffs were not confined in their resale of the Solution to a product consisting of a diffuser with a capacity of not more than 1000ml. The Company believes the claims are without merit and will defend itself against the claims.\nBesides the above, we are not a party to any legal proceedings that in the opinion of our management would have a material adverse effect on our business. However, from time to time we may become involved in legal proceedings or may be subject to claims arising in the ordinary course of our business. Although the results of litigation and claims cannot be predicted with certainty, we believe that the final outcome of ordinary course matters will not have a material adverse effect on our business, operating results, financial condition or cash flows.\nThe Company believes the claims are without merit and will defend itself against the claims. ITEM 4. MINE SAFETY DISCLOSURES\nNo report required.\n28 | Page\nPART II ITEM 5.\nMARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nMARKET INFORMATION\nThe registrant had 102,742,362 shares of our Common Stock par value, $0.001 issued and outstanding as of December 9, 2023. There were 268 record holders of our common stock.\nDIVIDENDS\nWe have never paid or declared any dividends on our common stock and do not anticipate paying cash dividends in the foreseeable future.\nSECURITIES AUTHORIZED FOR ISSUANCE UNDER EQUITY COMPENSATION PLANS\nWe currently do not have any equity compensation plans. ITEM 6. SELECTED FINANCIAL DATA\nNot Applicable. ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion should be read in conjunction with our financial statements, including the notes thereto, appearing elsewhere in this Annual Report. The following discussion contains forward-looking statements that reflect our plans, estimates and beliefs. Our actual results could differ materially from those discussed in the forward-looking statements. Factors that could cause or contribute to such differences include but are not limited to those discussed below and elsewhere in this Annual Report. Our audited consolidated financial statements are stated in United States Dollars and are prepared in accordance with United States Generally Accepted Accounting Principles (U.S. GAAP).\nPlan of Operation and Funding\nWe expect that working capital requirements will continue to be funded through internally generated funds and proceeds from issuances of securities. Our working capital requirements are expected to increase in line with the growth of our business.\nExisting working capital, proceeds from issuance of securities, further advances, and anticipated cash flow are expected to be adequate to fund our operations over the next twelve months. We have no lines of credit or other bank financing arrangements. Generally, we have financed operations to date through internally generated funds, advances and proceeds from issuance of securities. In connection with our business plan, management anticipates additional increases in operating expenses and capital expenditures relating to: (i) research and development, (ii) expansion of product offerings; (iii) geographical expansion; and (iv) marketing expenses. We intend to finance these expenses with further issuances of securities. Thereafter, we expect we will need to raise additional capital and generate revenues to meet long-term operating requirements. Additional issuances of equity will result in dilution to our current shareholders. Further, such securities might have rights, preferences, or privileges senior to our common stock. Additional financing may not be available upon acceptable terms, or at all. If adequate funds are not available or are not available on acceptable terms, we may not be able to take advantage of prospective new business endeavors or opportunities, which could significantly and materially restrict our business operations.\nResults of Operations\nThe following table sets forth certain selected statement of operations data for the financial year indicated in U.S. Dollars. In addition, we note that the year-to-year comparison may not be indicative of future performance.\nThe following summary of our operations should be read in conjunction with our audited financial statements for the financial years ended August 31 (FYE), 2023, and 2022, which are included herein.\nYear Ended August 31,\nChanges %\nRevenue $ 388,038 $ 1,190,616 $ (802,578 ) (67 )%\nCost of revenues 424,189 952,228 (528,039 ) (55 )%\nGross (loss)/profit (36,151 ) 238,388 (274,539 ) (115 )%\nOperating expenses 6,097,019 4,856,039 1,240,980 26 %\nLoss from operations (6,133,170 ) (4,617,651 ) (1,515,519 ) (33 )%\nOther expense (184,203 ) (938,976 ) 754,773 80 %\nNet Loss (6,317,373 ) (5,556,627 ) (760,746 ) (14 )%\nRevenue\nRevenue for FYE 2023 was $388,038 compared to revenue in FYE 2022 of $1,190,616, a decrease of $802,578 or approximately 67%. The drop in revenue is mainly due to the decrease in sales in air purifier products as a result of rollback of preventative measures taken by businesses and public from spreading infection as the World and society progresses towards living with Covid-19.\nBeing first mover in launching EvoAirTM, first-of-its-kind eco-friendly air-conditioner with granted patent or utility model/ patent or utility model pending HECS system proprietary system, the Group faced both opportunities and challenges. In the course of applying for some of the certifications, safety and performance testing, the relevant authorities/ organizations faced the challenges in assigning our products in the appropriate category under conventional air-conditioner regime. There are instances whereby some of these authorities/ organizations do not possess the relevant equipment to conduct testings. It took a lot of education, discussions, deliberations and working with the authorities/ organizations to work out solutions to resolve compliance and testing matters. On the positive note, one of the authorities advised us to apply under a new category, ‘Hybrid Air Conditioner. The duration of the application processes were longer than that of typical certifications and testing for conventional air-conditioners.\nBeing a first mover, notwithstanding many of our corporate clients who were impressed and showed keen interest in our products, EvoAirTM, many of them took a few months to conduct study on their own accord on performance and the energy savings by our products. The Company is building up its traction for the evoairTM hybrid air-conditioners for both residentials and commercial/ industrial units through distribution channels, projects, building and businesses as well as private labelling and licensing model. During the financial year, we have entered into agreements with distributors, partners, customers to build up sales pipeline.\n29 | Page\nCost of revenue\nCost of revenues was $424,189 or 109% of revenues in the FYE 2023, as compared to $952,228 or 80% of revenues in the FYE 2022. The decline in cost of revenue is in line with the drop in sales. Cost of revenues includes production costs and purchases of goods.\nGross (loss)/ profit\nGross loss was $36,151 for FYE 2023 or 9% of revenues compared gross profit $238,388 for FYE 2022 or 20% of revenues. The decline in gross profit margin was attributable to the drop in sales of air purifier products, of which the product range contributed higher gross profit margin. Besides, the decrease of gross profit is mainly due to the Companys evoairTM products with higher cost of revenue from manufacturing and related costs as well as lack of economy of scale during commercialization stage. The Company anticipates improvement of income and gross profit margin with the improvement of revenue streams from distributor and dealership model, projects as well as private labeling and licensing model.\nOperating expenses\nOperating expenses totaled $6,097,019 for FYE 2023, compared to $4,856,039 in operating expenses for FYE 2022, or an increase of $1,240,980 or 26%. The operating expenses include salary and related expenses, commissions, rental, patents and trademarks application/renewal and related fee and professional and compliance fees. The increase in operating expenses were mainly due to full year amortization of intangible assets in FYE2023 as compared to 8-month amortization of intangibles in FYE 2022 as well as payment of commission for capital raising.\nOther expense\nOther expense decreased significantly mainly due to a one-time amortization of beneficial conversion feature of convertible bonds $1,005,645 in FYE 2022. Other expense in FYE2023 primarily included $205,949 realized foreign exchange loss net with $13,276 other income received from Inland Revenue Authority of Singapore for Job Growth Incentive Payout.\nNet loss\nPremised on the factors discussed above, the Company incurred a net loss of $6,317,373 for FYE 2023, compared to a net loss of $5,556,627 for FYE 2022. The continuous net loss is attributable to the Groups focused effort in building up the traction and sales pipeline, applying necessary certifications, testings, patents and trademark and creating resources to meet the business expansion needs of the Groups as well as lack of economies of scale.\nLiquidity and Capital Resources\nWorking Capital\nYear Ended\nAugust 31,\nChanges %\nCurrent assets $ 2,071,164 $ 1,688,926 $ 382,238 23 %\nCurrent liabilities 964,642 892,004 72,638 8 %\nWorking capital 1,106,522 796,922 309,600 39 %\nAs of August 31, 2023, our companys current liabilities stood at $964,642, which included accounts payable and accruals of $170,888, other payables of $27,487, deferred revenue $440,069, current portion hire purchase creditor $9,224, amount due to shareholders $232,095, and current portion operating lease liabilities of $84,879. The increased in current liabilities was mainly attributable to amount due to shareholders.\n30 | Page\nAs of August 31, 2023, the Company recorded a positive working capital of $1,106,522 compared with the positive working capital of $796,922 as of August 31, 2022. The increase in working capital was mainly attributable to the increase in cash from issuance of common stock pursuant to capital raising activities.\nCash Flows\nYear Ended\nAugust 31,\nChanges %\nCash flows used in operating activities $ (1,674,395 ) $ (1,540,167 ) $ (134,167 ) (9 )%\nCash flows used in investing activities (14,189 ) (561,315 ) 547,126 97 %\nCash flows generated from financing activities 2,392,710 454,722 1,937,988 426 %\nNet changes in cash 704,126 (1,646,760 ) 2,350,886 143 %\nThe Companys cash and cash equivalents stood at $779,049 as of August 31, 2023. Cash used in operating activities for FYE 2023, was $1,674,395. The change was primarily due to an increase in net loss offset with an increase in amortization of intangible assets.\nCash used in investing activities arose from purchase of property, plant and equipment amounting to $14,189 for FYE 2023.\nDuring the FYE 2023, cash generated from financing activities resulted from proceeds from issuance of common stock amounting to $1,068,728, payments of hire purchase amounting to $8,587, proceeds from shares to be issued amounting to $1,066,052, and proceeds from capital contribution amounting to $266,517.\nSeasonality\nThe Companys business is not subject to seasonality.\nOff-Balance Sheet Arrangements.\nAs of the date of this Annual Report, we do not have any off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, changes in financial condition, revenue or expenses, results of operations, liquidity, capital expenditures or capital resources that are material to investors.\nCritical Accounting Policies\nRevenue recognition\nOur revenue recognition policy is in compliance with ASC 606, Revenue from Contracts with Customers whereby revenue is recognized when a customer obtains control of promised goods and is recognized in an amount that reflects the consideration that we expect to receive in exchange for those goods. In addition, the standard requires disclosure of the nature, amount, timing, and uncertainty of revenue and cash flows arising from contracts with customers. The amount of revenue that is recorded reflects the consideration that we expect to receive in exchange for those goods. We apply the following five-step model to determine this amount:\n(i) identification of the promised goods and services in the contract;\n(ii) determination of whether the promised goods and services are performance obligations, including whether they are distinct in the context of the contract;\n(iii) measurement of the transaction price, including the constraint on variable consideration;\n(iv) allocation of the transaction price to the performance obligations; and\n(v) recognition of revenue when (or as) the Company satisfies each performance obligation.\n31 | Page\nWe only apply the five-step model to contracts when it is probable that we will collect the consideration it is entitled to in exchange for the goods or services it transfers to the customer. Once a contract is determined to be within the scope of ASC 606 at contract inception, we review the contract to determine which performance obligations we must deliver and which of these performance obligations are distinct. We recognize as revenues the amount of the transaction price that is allocated to the respective performance obligation when the performance obligation is satisfied or as it is satisfied. Generally, our performance obligations are transferred to customers at a point in time, typically upon delivery for local sales and upon shipment of the products for export sale.\nFor all reporting periods, we have not disclosed the value of unsatisfied performance obligations for all product revenue contracts with an original expected length of one year or less, which is an optional exemption that is permitted under the adopted rules.\nEstimates and Assumptions\nIn preparing our consolidated financial statements, we use estimates and assumptions that affect the reported amounts and disclosures. Our estimates are often based on complex judgments, probabilities, and assumptions that we believe to be reasonable, but that are inherently uncertain and unpredictable. We are also subject to other risks and uncertainties that may cause actual results to differ from estimated amounts. Significant estimates in FYE 2023 and 2022 include the assumptions used to value tax liabilities, derivative financial instruments, estimates of the allowance for deferred tax assets, accounts receivable allowance, impairment of long-lived assets and inventory write-offs.\nGoing Concern\nThe Companys financial statements as of August 31, 2023, is prepared using U.S. GAAP applicable to a going concern, which contemplates the realization of assets and liquidation of liabilities in the normal course of business. The Company has not yet established a sustainable ongoing source of revenue sufficient to cover its operating costs and allow it to continue as a going concern.\nAs of August 31, 2023, and August 31, 2022, the Company had an accumulated deficit of $13,523,266 and $7,465,373 respectively. The Company incurred net loss of $6,057,893 and $5,231,877 for the years ended August 31, 2023, and August 31, 2022, respectively. The cash used in operating activities were $1,674,395 and $1,540,167 for FYE 2023 and 2022, respectively. It was brought to the attention of the Management to assess going concern considering all facts and circumstances about the foreseeable future of the Company as well as its assets and liabilities on the basis that it will be able to realize and discharge them in the normal course of business.\nWith the injection of a HVAC business into the Company (HVAC Business) pursuant to the Transactions (defined in Part I, Item I of this Form 10K), the Management believes that the actions to be taken by the Management to further implement the business plans for the HVAC Business including expansion in product offerings, geographical expansion, generate revenue through expansion of revenue streams and customer base (retail, commercial, industrial, projects as well as private label and licensing clientele), improvement of profitability by achieving economies of scale provide the opportunity for the Company to continue as a going concern. In addition, the Company is also working on raising additional funding to finance the operations as well as business expansion.\nThe consolidated financial statements have been prepared assuming that the Company will continue as a going concern and, accordingly financial statements do not include any adjustments related to the recoverability and classification of assets or the amounts and classification of liabilities that might be necessary should the Company be unable to continue as a going concern.\nMaterial Commitments\nWe have no material commitments as of August 31, 2023.\n32 | Page\nRecent Accounting Pronouncements\nExcept for rules and interpretive releases of the SEC under the authority of federal securities laws and a limited number of grandfathered standards, the Financial Accounting Standards Board (FASB) Accounting Standards Codification™ (ASC) is the sole source of authoritative U.S. GAAP literature recognized by the FASB and applicable to the Company. Management has reviewed the aforementioned rules and releases and believes any effect will not have a material impact on the Companys present or future financial statements.\nIn June 2016, the FASB issued ASU 2016-13, Measurement of Credit Losses on Financial Instruments. ASU 2016-13 adds the CECL impairment model to U.S. GAAP that is based on expected losses rather than incurred losses. Modified retrospective adoption is required with any cumulative-effect adjustment recorded to retained earnings as of the beginning of the period of adoption. ASU 2016-13 is effective for fiscal years beginning after December 15, 2022, including interim periods within the year of adoption. Early adoption is permitted for fiscal years beginning after December 15, 2018, including interim periods within those fiscal years. The Company does not expect the application of the CECL impairment model to have a significant impact on its allowance for uncollectible amounts for accounts receivable.\nIn October 2021, the FASB issued ASU 2021-08, Business Combinations (Topic 805): Accounting for Contract Assets and Contract Liabilities from Contracts with Customers, which requires contract assets and contract liabilities acquired in a business combination to be recognized and measured by the acquirer on the acquisition date in accordance with ASC 606, Revenue from Contracts with Customers. This ASU should be applied prospectively to acquisitions occurring on or after the effective date of December 15, 2022, and early adoption is permitted.\nThe Company has implemented all new applicable accounting pronouncements that are in effect. These pronouncements did not have any material impact on the financial statements unless otherwise disclosed, and the Company does not believe that there are any other new accounting pronouncements that have been issued that might have a material impact on its financial position or results of operations. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nNot Applicable.\n33 | Page ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Shareholders and the Board of Directors of EvoAir Holdings Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of EvoAir Holdings Inc. (the Company) as of August 31, 2023 and 2022, the related statements of operations and comprehensive loss, changes in shareholders equity, and cash flows for each of the two years ended August 31, 2023 and 2022, and the related notes to the financial statements and schedule (collectively, the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of August 31, 2023, and the results of its operations and its cash flows for the year ended August 31, 2023, in conformity with accounting principles generally accepted in the United States of America.\nGoing concern uncertainty\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As disclosed in Note 3 to the financial statements, the Company had an accumulated deficit of $13,523,266. The Company incurred net loss of $6,057,893 for year ended August 31, 2023. The cash used in operating activities were $1,674,395 for the year ended August 31, 2023. The Company has accumulated loss since inception which raise doubt about its ability to continue as a going concern. Managements plans in regard to these matters are also described in Note 3. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audit provides a reasonable basis for our opinion.\n/s/ Audit Alliance LLP\nWe have served as the Companys auditor since 2021.\nSingapore\nDecember 14, 2023\n(PCAOB ID No. 3487)\n34 | Page\nEVOAIR HOLDINGS INC.\nCONSOLIDATED BALANCE SHEETS\n(In U.S. Dollars, except share data or otherwise stated)\nAS OF AUGUST 31, 2023 AND AUGUST 31, 2022\nAugust 31, 2023 August 31, 2022\nASSETS\nCurrent assets\nCash and cash equivalents $ 779,049 $ 152,304\nAccounts receivable, net 44,130 85,960\nInventories 630,478 618,996\nDeposit, prepayments and other receivables 617,507 831,666\nTotal current assets 2,071,164 1,688,926\nNon-current assets\nProperty, plant and equipment, net 463,387 602,755\nOperating lease right-of-use assets 271,021 442,020\nTechnology-related intangible assets, net 76,218,786 80,376,175\nTotal non-current assets 76,953,194 81,420,950\nTOTAL ASSETS $ 79,024,358 $ 83,109,876\nLIABILITIES AND SHAREHOLDERS EQUITY\nCurrent liabilities\nAccounts payable and accruals $ 170,888 $ 216,830\nOther payables 27,487 31,980\nDeferred revenue 440,069 513,072\nHire purchase creditor 9,224 10,135\nAmounts due to shareholders 232,095 2,301\nOperating lease liability - current 84,879 117,686\nTotal current liabilities 964,642 892,004\nNon-current liabilities\nNon-current hire purchase creditor 10,531 18,207\nNon-current operating lease liabilities 198,163 355,186\nTotal non-current liabilities 208,694 373,393\nTOTAL LIABILITIES 1,173,336 1,265,397\nCommitments and contingencies (Note 15) - -\nShareholders equity\nCommon stock, 1,000,000,000 authorized; $0.001 par value, 102,310,933 and 101,853,397 shares issued and outstanding as at August 31, 2023 and August 31, 2022 102,311 101,854\nAdditional paid in capital 90,371,141 89,125,872\nShares to be issued 1,066,052 75,000\nAccumulated other comprehensive income (17,036 ) 65,880\nAccumulated deficit (13,523,266 ) (7,465,373 )\nNon-controlling interest (148,180 ) (58,754 )\nTotal shareholders equity 77,851,022 81,844,479\nTOTAL LIABILITIES AND SHAREHOLDERS EQUITY $ 79,024,358 $ 83,109,876\nThe accompanying footnotes are an integral part of these consolidated financial statements.\n35 | Page\nEVOAIR HOLDINGS INC.\nCONSOLIDATED STATEMENTS OF OPERATIONS AND COMPREHENSIVE LOSS\n(In U.S. Dollars, except share data or otherwise stated)\nFOR THE YEARS ENDED AUGUST 31, 2023 AND 2022\nAugust 31, 2023 August 31, 2022\nRevenue $ 388,038 $ 1,190,616\nCost of revenue 424,189 952,228\nGross (loss) / profit (36,151 ) 238,388\nOperating expenses:\nSelling and marketing expenses 33,531 41,171\nGeneral and administrative expenses 6,063,488 4,814,868\nTotal operating expenses 6,097,019 4,856,039\nLoss from operation (6,133,170 ) (4,617,651 )\nOther (expense) /income\nInterest expense (11 ) (1,005,498 )\nOther (expense)/income (184,192 ) 66,522\nTotal other expense, net (184,203 ) (938,976 )\nLoss from operation before income taxes (6,317,373 ) (5,556,627 )\nIncome tax expenses - -\nNet loss $ (6,317,373 ) $ (5,556,627 )\nLess: Net loss attributable to non-controlling interests 259,480 324,750\nNet loss attributable to equity holders of the Company (6,057,893 ) (5,231,877 )\nOther comprehensive (loss)/income:\nForeign currency translation adjustment (77,381 ) 87,731\nTotal comprehensive loss (6,135,274 ) (5,144,146 )\nLess: net comprehensive income attributable to non-controlling interests 5,535 27,547\nNet comprehensive loss attributable to equity holders of the Company (6,129,739 ) (5,116,599 )\nNet loss attributable to equity holders of the Company per common share:\nBasic and diluted (0.06 ) (0.08 )\nWeighted average number of common shares outstanding:\nBasic and diluted 102,023,515 62,181,538\nThe accompanying footnotes are an integral part of these consolidated financial statements.\n36 | Page\nEVOAIR HOLDINGS INC.\nCONSOLIDATED STATEMENT OF CHANGES IN SHAREHOLDERS EQUITY\n(In U.S. Dollars, except share data or otherwise stated)\nFOR THE YEARS ENDED AUGUST 31, 2023 AND 2022\nshares amount capital deficit income be issued interests Total\nCommon Stock Additional\npaid in\nAccumulated Accumulated other\ncomprehensive\nShares to Non-controlling\nshares amount capital deficit income be issued interests Total\nBalance at August 31, 2021 2,970,000 $ 2,970 $ 2,890,471 $ (2,233,496 ) $ 5,696 $ 861,883 $ 167,967 $ 1,695,491\nBeneficial conversion feature on financial liability -Convertible bonds - - 1,005,645 - - - - 1,005,645\nCapital contribution - - 129,363 - - - 70,482 199,845\nIssuance of common stock for convertible bonds 1,116,055 1,116 1,003,326 - - - - 1,004,442\nIssuance of common stock pursuant to share exchange agreement 102,000 (102 ) - - - - -\nIssuance of common stock for Intellectual Assets 83,147,767 83,148 83,064,619 - - - - 83,147,767\nIssuance of common stock for Cash 14,517,575 14,518 1,032,550 - - (786,883 ) - 260,185\nForeign currency translation adjustment - - - - 60,184 - 27,547 87,731\nNet loss - - - (5,231,877 ) - - (324,750 ) (5,556,627 )\nBalance at August 31, 2022 101,853,397 $ 101,854 $ 89,125,872 $ (7,465,373 ) $ 65,880 $ 75,000 $ (58,754 ) $ 81,844,479\nCapital contribution - - 101,998 -\n- 164,519 266,517\nIssuance of common stock for Cash 457,536 1,143,271 - - 991,052 - 2,134,780\nForeign currency translation adjustment - - - - (82,916 ) - 5,535 (77,381 )\nNet loss - - - (6,057,893 ) - - (259,480 ) (6,317,373 )\nBalance as of August 31, 2023 102,310,933 $ 102,311 $ 90,371,141 $ (13,523,266 ) $ (17,036 ) $ 1,066,052 $ (148,180 ) $ 77,851,022\nThe accompanying footnotes are an integral part of these consolidated financial statements.\n37 | Page\nEVOAIR HOLDINGS INC.\nCONSOLIDATED STATEMENT OF CASH FLOWS\n(In U.S. Dollars, except share data or otherwise stated)\nFOR THE YEARS ENDED AUGUST 31, 2023 AND 2022\nAugust 31, 2023 August 31, 2022\nCash flows from operating activities\nNet loss $ (6,317,373 ) (5,556,627 )\nAdjustments for non-cash income and expenses:\nDepreciation 132,170 95,158\nAmortization 4,157,389 2,854,953\nBeneficial conversion feature of convertible bonds - 1,005,645\nProperty, plant and equipment impairment and abandonments 21,387 -\nChanges in operating assets and liabilities:\nDecrease in accounts receivables 41,830 41,842\nIncrease in inventories (11,482 ) (476,477 )\nDecrease in deposit, prepayments and advances to suppliers 214,159 407,895\nDecrease/(Increase) in operating lease right-of-use assets 170,999 (525,381 )\n(Decrease)/Increase in accounts payable and accruals (45,942 ) 104,936\n(Decrease)/Increase in deferred revenue (73,003 ) 86,295\n(Decrease)/Increase in operating lease liabilities (189,830 ) 472,872\nDecrease in other payables (4,493 ) (1,098 )\nIncrease /(Decrease) in amounts due to related parties 229,794 (50,180 )\nNet cash used in operations $ (1,674,395 ) $ (1,540,167 )\nCash flows from investing activity\nPurchase of property, plant and equipment (14,189 ) (561,315 )\nNet cash used in investing activity $ (14,189 ) $ (561,315 )\nCash flows from financing activities\nPayments of hire purchase (8,587 ) (5,308 )\nProceeds from issuance of common stock 1,068,728 185,185\nProceeds from shares to be issued 1,066,052 75,000\nProceeds from capital contribution 266,517 199,845\nNet cash generated from financing activities $ 2,392,710 $ 454,722\nNet increase /(decrease) in cash and cash equivalents 704,126 (1,646,760 )\nEffect of exchange rate changes (77,381 ) 84,174\nCash and cash equivalents at start of year 152,304 1,714,890\nCash and cash equivalents at end of year 779,049 152,304\nSupplemental disclosure of non-cash investing and financing information :\nCommon stock issued for technology-related intangible assets $ - $ 83,147,767\nCommon stock issued for convertible bonds $ - $ 1,007,999\nThe accompanying footnotes are an integral part of these consolidated financial statements.\n38 | Page\nEVOAIR HOLDINGS INC.\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED AUGUST 31, 2023, AND 2022\nNOTE 1 - ORGANIZATION AND BUSINESS OPERATIONS\nEvoAir Holdings Inc. (formerly Unex Holdings Inc.) (the Company, EVOH, we, us, or our) is a corporation established under the corporation laws in the State of Nevada, United States of America (U.S) on February 17, 2017. The Company has adopted an August 31 fiscal year end.\nOn December 20, 2021, the Company and Low Wai Koon (Dr. Low) entered into a share transfer agreement, (the EvoAir International Share Transfer Agreement), pursuant to which Dr. Low agreed to sell all of his ordinary shares of EvoAir International Limited (EvoAir International) to the Company for a consideration of US$100 (EvoAir Transaction). EvoAir International, through its subsidiaries upon completion of the Transactions (defined hereunder), is engaged in the research and development (R&D), manufacturing, trading, sale of heating, ventilation and air conditioning (HVAC) products and related services in Asia.\nPursuant to the terms of a share transfer agreement dated December 20, 2021, Dr. Low, the then sole executive officer and director of the Company and the owner of 2,000,000 restricted shares of common stock, with par vaue of $0.001 per share (Common Stock) of the Company (EvoAir Shares) representing approximately 67.34% of the Companys then issued and outstanding shares, sold his entire shareholding of the Company to WKL Global Limited (WKL Global) for an aggregate consideration of $100 (Change of Control Transaction). Upon completion of the Change of Control Transaction, WKL Global owned 2,000,000 shares, or approximately 67.34% of the then issued and outstanding ordinary shares of the Company, which resulted in a change of control of the Company.\nOn December 20, 2021, several transactions took place (together, the Allotment Transactions) whereby the Company issued and allotted in aggregate 98,809,323 ordinary shares of common stock to certain parties. On completion of the Allotment Transactions, the total number of issued and outstanding shares of common stock of the Company were 101,779,323 (Then Enlarged Share Capital):\n(A) On December 20, 2021, Dr. Low and Chan Kok Wei entered into a share exchange agreement with WKL Eco Earth Holdings Pte Ltd (WKL Eco Earth Holdings), pursuant to which Dr. Low and Chan Kok Wei agreed to sell all their ordinary shares of WKL Green Energy Sdn Bhd (WKL Green Energy) to WKL Eco Earth Holdings in consideration for the allotment and issuance to WKL Global Limited and Allegro Investment (BVI) Limited (Allegro Investment), a company incorporated in the British Virgin Islands with 50% shareholdings held by Chan Kok Wei and Ong Bee Chen, respectively, of 24,000 shares and 6,000 EvoAir Shares, respectively, or approximately 0.02% and 0.01% of the Then Enlarged Share Capital, respectively.\n(B) On December 20, 2021, Dr. Low, Chan Kok Wei, Ong Bee Chen and certain sellers (WKLEE Sellers) entered into a share exchange agreement with WKL Eco Earth Holdings, pursuant to which Dr. Low, Chan Kok Wei, Ong Bee Chen and WKLEE Sellers agreed to sell all their ordinary shares of WKL Eco Earth Sdn Bhd (WKL Eco Earth) to WKL Eco Earth Holdings in consideration for the allotment and issuance to WKL Global, Allegro Investment and WKLEE Sellers of 49,320 EvoAir Shares, 8,280 EvoAir Shares and in aggregate 14,400 shares, respectively, or approximately 0.05%, 0.009% and in aggregate 0.014%, respectively, of the Then Enlarged Share Capital.\n(C) On December 20, 2021, Tan Soon Hock, Ivan Oh Joon Wern and certain relevant interest holders (Relevant Interest Holders) entered into an investment exchange agreement with WKL Eco Earth Holdings, pursuant to which Tan Soon Hock, Ivan Oh Joon Wern and the Relevant Interest Holders agreed to sell all relevant interests in the EVOH and its subsidiaries (EvoAir Group or the Group) to WKL Eco Earth Holdings in consideration for the allotment and issuance of 7,037,762 EvoAir Shares, 2,520,000 EvoAir Shares and in aggregate 6,001,794 EvoAir shares, respectively, or approximately 6.91%, 2.48% and in aggregate 5.90%, respectively, of the Then Enlarged Share Capital. The board of directors and majority shareholders of the Company have approved the transaction.\n39 | Page\n(D) On December 20, 2021, Dr. Low entered into two deeds of assignment of intellectual properties with WKL Eco Earth Holdings, in respect of Dr. Lows patents and patent applications relating to eco-friendly air-conditioner condenser (external unit), evoairTM and the trademarks and trademark applications described in the deeds of assignment thereunder, and in respect of Dr. Lows patents and patents applications relating to the portable air-conditioner, e-Cond EVOTM and the trademarks and trademark applications as described in the deeds of assignment thereunder (together, the IP Assignments). Pursuant to the IP Assignments, WKL Global, Allegro Investment and certain nominees shall be allotted and issued 63,362,756 EvoAir Shares, 14,297,259 EvoAir Shares and in aggregate 5,487,752 EvoAir Shares, respectively or approximately 62.25%, 14.05% and in aggregate 5.39%, respectively of the Then Enlarged Share Capital in consideration for the IP Assignments.\nEvoAir Transaction, Change of Control Transaction and Allotment Transactions are collectively to be referred to as the Transactions. The closing of the Transactions (the Closing) occurred on December 20, 2021 (the Closing Date).\nFrom and after the Closing Date, at which time EvoAir International transferred its HVAC business to the Company, the Companys primary operations will consist of the prior operations of EvoAir International and its subsidiaries.\nEvoAir International is a company incorporated in the British Virgin Islands (BVI) on November 17, 2021. Effective from the December 20, 2021, it wholly owns WKL Eco Earth Holdings, a company incorporated in Singapore on July 12, 2018, which in turn wholly owns (a) WKL Eco Earth, a Malaysian company incorporated on May 17, 2017, and (b) WKL Green Energy, a Malaysian company incorporated on October 24, 2017. WKL Eco Earth Holdings acquired (c) EvoAir Manufacturing (M) Sdn Bhd (EvoAir Manufacturing) on April 19, 2021, a Malaysian company incorporated on March 22, 2019, as well as acquiring (d) WKL EcoEarth Indochina Co Ltd (WKL EcoEarth Indochina), a Cambodia company incorporated on February 4, 2021, (e) WKL Guanzhe Green Technology Guangzhou Co Ltd (WKL Guanzhe), a Chinese company incorporated on April 6, 2021. EvoAir Manufacturing wholly owns (f) Evo Air Marketing (M) Sdn Bhd (Evo Air Marketing), a Malaysian company incorporated on February 2, 2021.\nOn June 15, 2022, the Company filed a Certificate of Amendment (the Amendment) to the Articles of Incorporation with Nevadas Secretary of State to change the name of the Company from Unex Holdings Inc. to EvoAir Holdings Inc. (the Name Change), and the Name Change became market effective on November 4, 2022. Effective on November 11, 2022, the Companys shares began trading under the new ticker symbol EVOH.\nRound 2 Stockholders\nThe Company entered into a series of offerings for an aggregate of up to 6,000,000 shares of Common Stock at a per share purchase price of $2.50, as follows:\n● On February 15, 2022, the Company entered into certain share subscription agreement with Ms. Ang Lee Kim Jane, who is a non-U.S. Persons as defined in Regulation S of the Securities Act of 1933, as amended (the Securities Act) pursuant to which the Company agreed to issue and sell 74,074 shares of Common Stock, at a per share purchase price of $2.50, as part of a series of offerings by the Company for an aggregate of up to 6,000,000 shares of Common Stock at a per share purchase price of $2.50. The gross proceeds were $185,185.\n● On June 3, 2022, the Company entered into certain share subscription agreement with Mr. Wong Hon Wai who is a non-U.S. Persons as defined in Regulation S of the Securities Act pursuant to which the Company agreed to issue and sell 5,000 shares of Common Stock, at a per share purchase price of $2.50, as part of a series of offerings by the Company for an aggregate of up to 6,000,000 shares of Common Stock at a per share purchase price of $2.50. The gross proceeds were $12,500.\n● On October 25, 2022, the Company entered into Regulation S share subscription agreements with eight investors, each of whom represented that it was a non-U.S. Persons as defined in Securities Act. On the same date, the Company entered into Regulation D share subscription agreements with two investors, each of whom represented that it was an Accredited Investors as defined in Regulation D of the Securities Act. Pursuant to the share subscription agreements, the Company agreed to issue and sell in aggregate, (i) 129,621 shares of Common Stock to the Regulation S investors, and (ii) 15,000 shares of Common Stock to the Regulation D investors, respectively, at a per share purchase price of $2.50, as part of a series of offerings by the Company for an aggregate of up to 6,000,000 shares of Common Stock at a per share purchase price of $2.50. The gross proceeds in aggregate were $361,553.\n40 | Page\n● On February 20, 2023, the Company entered into Regulation S share subscription agreements with eleven investors, each of whom represented that it was a non-U.S. Persons as defined in Regulation S of the Securities Act. Pursuant to the share subscription agreements, the Company agreed to issue and sell in aggregate, (i) 57,783 shares of Common Stock to the Regulation S investors, at a per share purchase price of $2.50 as part of a series of the offerings by the Company for an aggregate of up to 6,000,000 shares of Common Stock at a per share purchase price of $2.50. The gross proceeds in aggregate were $144,443.\n● On July 13, 2023, the Company entered into Regulation S share subscription agreements with 31 investors, each of whom represented that it was a non-U.S. Persons as defined in Regulation S of the Securities Act. Pursuant to the share subscription agreements, the Company agreed to issue and sell in aggregate, (i) 250,132 shares of Common Stock to the Regulation S Investors, at a per share purchase price of $2.50 as part of a series of the offerings by the Company for an aggregate of up to 6,000,000 shares of Common Stock at a per share purchase price of $2.50. The gross proceeds in aggregate were approximately $625,330.\n● On September 7, 2023, the Company entered into Regulation S share subscription agreements with 71 investors, each of whom represented that it was a non-U.S. Persons as defined in Regulation S of the Securities Act. Pursuant to the share subscription agreements, the Company agreed to issue and sell in aggregate, 365,164 shares of Common Stock to the Regulation S investors, at a per share purchase price of $2.50 as part of a series of the offerings by the Company for an aggregate of up to 6,000,000 shares of Common Stock at a per share purchase price of $2.50. The gross proceeds in aggregate were approximately $912,889.\n● On November 21, 2023, the Company entered into a Regulation S share subscription agreement with Wong Chun Shoong who represented that he was a non-U.S. Persons as defined in Regulation S of the Securities Act. Pursuant to the share subscription agreement, the Company agreed to issue and sell in aggregate, 8,658 shares of Common Stock to the Regulation S investors, at a per share purchase price of $2.50 as part of a series of the offerings by the Company for an aggregate of up to 6,000,000 shares of Common Stock at a per share purchase price of $2.50. The gross proceeds in aggregate were approximately $21,645.\nDetails of the Companys subsidiaries:\nSUMMARY OF CONSOLIDATED SUBSIDIARIES\nSubsidiaries of EVOH Attributable interest\nEvoAir International Limited (British Virgin Islands) 100 %\nSubsidiary of EvoAir International Limited\nWKL Eco Earth Holdings Pte Ltd (Singapore) 100 %\nSubsidiaries of WKL Eco Earth Holdings Pte Ltd\nWKL Eco Earth Sdn Bhd (Malaysia) 100 %\nWKL Green Energy Sdn Bhd (Malaysia) 100 %\nEvoAir Manufacturing (M) Sdn Bhd (Malaysia) 67.5 %\nWKL EcoEarth Indochina Co Ltd (Cambodia) 55 %\nWKL Guanzhe Green Technology Guangzhou Co Ltd (China) 55 %\nSubsidiary of EvoAir Manufacturing (M) Sdn Bhd\nEvo Air Marketing (M) Sdn Bhd (Malaysia) 100 %\nNOTE 2 - CHANGE OF CONTROL\nPursuant to the terms of a share transfer agreement dated December 20, 2021, Dr. Low, the then sole executive officer and director of the Company and the owner of 2,000,000 restricted shares of the Companys ordinary shares representing approximately 67.34% of the Companys then issued and outstanding shares, sold his entire shareholding of the Company to WKL Global for an aggregate consideration of $100. Upon completion of the Change of Control Transaction, WKL Global then owned 2,000,000 shares, or approximately 67.34% of the Companys then issued and outstanding shares, which resulted in a change of control of the Company.\n41 | Page\nNOTE 3 - GOING CONCERN\nThe Companys financial statements as of August 31, 2023, is prepared using generally accepted accounting principles in the United States of America (U.S. GAAP) applicable to a going concern, which contemplates the realization of assets and liquidation of liabilities in the normal course of business. The Company has not yet established a sustainable ongoing source of revenue sufficient to cover its operating costs and allow it to continue as a going concern.\nAs of August 31, 2023, and August 31, 2022, the Company had an accumulated deficit of $13,523,266 and $7,465,373 respectively. The Company incurred net loss of $6,057,893 and $5,231,877 for the years ended August 31, 2023, and August 31, 2022, respectively. The cash used in operating activities were $1,674,395 and $1,540,167 for FYE 2023 and 2022, respectively. It was brought to the attention of the Management to assess going concern considering all facts and circumstances about the foreseeable future of the Company as well as its assets and liabilities on the basis that it will be able to realize and discharge them in the normal course of business.\nWith the injection of HVAC business into the Company (HVAC Business) pursuant to the Transactions (defined in Note 1), the Management believes that the actions to be taken by the Management to further implement the business plans for the HVAC Business including expansion in product offerings, geographical expansion, generate revenue through expansion of revenue streams and customer base (retail, commercial, industrial, projects as well as private label and licensing clientele), improvement of profitability by achieving economies of scale provide the opportunity for the Company to continue as a going concern. In addition, the Company is also working on raising additional funding to finance the operations as well as business expansion.\nThe consolidated financial statements have been prepared assuming that the Company will continue as a going concern and, accordingly financial statements do not include any adjustments related to the recoverability and classification of assets or the amounts and classification of liabilities that might be necessary should the Company be unable to continue as a going concern.\nNOTE 4 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBasis of presentation and principles of consolidation:\nThe accompanying consolidated financial statements have been prepared by the Group in accordance with U.S. GAAP for financial information and pursuant to the applicable rules and regulations of the Securities and Exchange Commission (SEC).\nThe consolidated financial statements include the accounts of EvoAir International, WKL Eco Earth Holdings, WKL Eco Earth, WKL Green Energy, and its 67.5% owned EvoAir Manufacturing which included a 100% owned subsidiary Evo Air Marketing, 55% owned WKL EcoEarth Indochina, and its 55% owned WKL Guanzhe as part of the Transactions pursuant to Note 1.\nAs WKL Eco Earth and WKL Green Energy were under common control at the time of the Transactions, it is required under U.S. GAAP to account for this common control acquisition in a manner similar to the pooling of interest method of accounting. Under this method of accounting, EVOHs consolidated balance sheets as of August 31, 2023, and August 31, 2022, reflect WKL Eco Earth and WKL Green Energy on a historical carryover basis in the assets and liabilities instead of reflecting the fair market value of the assets and liabilities.\nAll intercompany accounts and transactions have been eliminated in consolidation. In the opinion of the Management, the accompanying financial statements contain all adjustments (consisting of normal and recurring accruals) necessary to present fairly all financial statements in accordance with U.S. GAAP.\nThe non-controlling interests are presented in the consolidated balance sheets, separately from equity attributable to the stockholders of the Company. Non-controlling interests in the results of the Company are presented on the face of the consolidated statements of operations and comprehensive loss as an allocation of the total loss for the year between non-controlling interest holders and the stockholders of the Company.\n42 | Page\nUse of Estimates\nThe preparation of financial statements in conformity with U.S. GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and the disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of sales and expenses during the reporting periods. Key estimates in the accompanying consolidated financial statements include, among others, revenue recognition, allowances for doubtful accounts and product returns, provisions for obsolete inventory, valuation of long-lived assets and Rights of Use (ROU) assets (including lease liabilities), and deferred income tax asset valuation allowances. Actual results could differ materially from these estimates.\nFiscal Year End\nThe Company operates on a fiscal year basis with the fiscal year ending on August 31.\nCash and Cash Equivalents\nThe Company considers all highly liquid investments with a maturity of three months or less to be cash equivalents. The Company places its cash with a high credit quality financial institution.\nWKL Guanzhe business is primarily conducted in China and substantially all of revenue are denominated in RMB. The government of Peoples Republic of China (PRC) imposes control over its foreign currency reserves in part through direct regulation of the conversion of RMB into foreign exchange and through restrictions on foreign trade.\nComprehensive Gain or Loss\nASC 220 Comprehensive Income, establishes standards for the reporting and display of comprehensive income and its components in the financial statements. As of August 31, 2023, and August 31, 2022, the Company established that there are items that represented components of comprehensive income and, therefore, has included a statement of comprehensive income in the financial statements.\nForeign Currency Translation\nThe functional currency of Chinese operations is Chinese Renminbi, (RMB). The functional currency of the Companys Singapore operations is Singapore dollars (SGD). The functional currency of the Companys Malaysia operations is Ringgit Malaysia (RM). Management has adopted ASC 830 Foreign Currency Matters for transactions that occur in foreign currencies. Monetary assets denominated in foreign currencies are translated using the exchange rate prevailing at the balance sheet date. Average monthly rates are used to translate revenues and expenses.\nTransactions denominated in currencies other than the functional currency are translated into the functional currency at the exchange rates prevailing at the dates of the transaction. Exchange gains or losses arising from foreign currency transactions are included in the determination of net income for the respective periods.\nAssets and liabilities of the Companys operations are translated into the reporting currency, United States Dollars, at the exchange rate in effect at the balance sheet dates. Revenue and expenses are translated at average rates in effect during the reporting periods. Equity transactions are recorded at the historical rate when the transaction occurred. The resulting translation adjustment is reflected as accumulated other comprehensive income, a separate component of stockholders equity in the statement of stockholders equity.\nAccounts Receivable and Allowance for Doubtful Accounts\nAccounts receivable are recorded at the net value of face amount less any allowance for doubtful accounts. The allowance for doubtful accounts is the Companys best estimate of the amount of probable credit losses in our existing accounts receivable. An allowance for doubtful accounts is recorded in the period when loss is probable based on an assessment of specific evidence indicating troubled collection, historical experience, accounts aging and other factors. The Company reviews the allowance for doubtful accounts on a regular basis, and all past due balances are reviewed individually for collectability. An account receivable is written off after all collection effort has ceased. Recoveries of receivables previously written off are recorded when received. Interest is not charged on past due accounts.\n43 | Page\nAs of August 31, 2023, and August 31, 2022, our accounts receivable amounted to $44,130 and $85,960, respectively, with no allowance for doubtful accounts for both periods.\nInventories\nInventories consist primarily of finished goods, raw materials, and work-in-process (WIP) from WKL Eco Earth, WKL EcoEarth Indochina, WKL Guanzhe, and EvoAir Manufacturing.\nWe value inventories at the lower of cost or net realizable value. We determine the costs of inventory using the standard cost method, which approximates actual cost based on a first-in, first-out method. All other costs, including administrative costs, are expensed as incurred.\nDeposit, prepayments, and other receivables\nDeposit, prepayments and other receivables are comprised of prepayments paid to vendors to initiate orders and prepaid services fees and are classified as current assets if such amounts are to be recognized within one year from the balance sheet date.\nProperty, Plant and Equipment\nProperty, plant and equipment are recorded at cost. Depreciation is computed using the straight-line method over the estimated useful lives of the related capitalized assets. Property and equipment are depreciated over 5 to 10 years.\nSUMMARY OF ESTIMATED USEFUL LIVES OF ASSETS\nUseful lives\nPlant and machineries 5 years\nOffice equipment 5 years\nVehicles 5 years\nFurniture and equipment 10 years\nRenovation 10 years\nRepair and maintenance costs are charged to expense as incurred. At the time of retirement or other disposition of property, plant and equipment, the cost and accumulated depreciation will be removed from the accounts and the resulting gain or loss, if any, will be reflected in operations.\nIntangible Assets and Other Long-Lived Assets\nThe Companys intangible assets consist of patents and trademarks related to assignments of intellectual properties by Dr. Low into WKL Eco Earth Holdings under the IP Assignments as contemplated in Note 1. The intangible assets are recorded at fair market value and are amortized using the straight-line method over an estimated life of 20 years for both patents and trademarks.\nLong-lived assets are reviewed for impairment whenever events or changes in circumstances indicate the carrying amount of an asset may not be recoverable. Recoverability of these assets is measured by comparison of their carrying amounts to future undiscounted cash flows the assets are expected to generate. If identifiable intangibles are considered to be impaired, the impairment to be recognized equals the amount by which the carrying value of the assets exceeds its fair market value.\n44 | Page\nRevenue Recognition\nRevenue is recognized when a customer obtains control of promised goods or services and is recognized in an amount that reflects the consideration that an entity expects to receive in exchange for those goods or services. In addition, the standard requires disclosure of the nature, amount, timing, and uncertainty of revenue and cash flows arising from contracts with customers. The Company does not disaggregate its revenue streams as the economic factors underlying the contracts are similar and provide no significant distinction. The amount of revenue that is recorded reflects the consideration that the Company expects to receive in exchange for those goods or services. The Company applies the following five-step model in order to determine this amount: (i) identification of the promised goods or services in the contract; (ii) determination of whether the promised goods or services are performance obligations, including whether they are distinct in the context of the contract; (iii) measurement of the transaction price, including the constraint on variable consideration; (iv) allocation of the transaction price to the performance obligations; and (v) recognition of revenue when (or as) the Company satisfies each performance obligation.\nThe Company only applies the five-step model to contracts when it is probable that the entity will collect the consideration it is entitled to in exchange for the goods or services it transfers to the customer. Once a contract is determined to be within the scope of ASC 606 at contract inception, the Company reviews the contract to determine which performance obligations the Company must deliver and which of these performance obligations are distinct. The Company recognizes as revenues the amount of the transaction price that is allocated to the respective performance obligation when (or as) the performance obligation is satisfied.\nDeferred Revenue\nThe Company collects deposits from customers in advance for some business contracts. The customer payments received in advance are recorded as deferred revenue on the balance sheet. The deferred revenue of $513,072 recorded as of August 31, 2022, with $110,134 recognized as revenue during year ended August 31, 2023. The Company recognized $440,069 deferred revenue as of August 31, 2023, with $56,806 recognized as revenue as of the report date.\nLeases\nWe have entered into operating agreements primarily for office and factory. We determine if an arrangement is a lease at inception. For all classes of underlying assets, we elect not to recognize right of use assets or lease liabilities when a lease has a lease term of 12 months or less at the commencement date and does not include an option to purchase the underlying asset that we are reasonably certain to exercise. Operating lease assets and liabilities are included on our consolidated balance sheet as of August 31, 2023.\nOperating lease assets and liabilities are recognized at the present value of the future lease payments at the lease commencement date. The interest rate used to determine the present value of the future lease payments is our incremental borrowing rate, because the interest rate implicit in most of our leases is not readily determinable. Our incremental borrowing rate is estimated to approximate the interest rate on a collateralized basis with similar terms and payments, and in the economic environments where the leased asset is located. Operating lease assets also include any prepaid lease payments and lease incentives. Our lease terms include periods under options to extend or terminate the lease when it is reasonably certain that we will exercise that option. We generally use the base, non-cancellable, lease term when determining the lease assets and liabilities. Operating lease expense is recognized on a straight-line basis over the lease term.\nOur lease agreements generally contain lease and non-lease components. Non-lease components primarily include payments for maintenance and utilities. We combine fixed payments for non-lease components with our lease payments and account for them together as a single lease component, which increases the amount of our lease assets and liabilities.\nIncome Taxes\nThe Company utilizes ASC Topic 740, Income Taxes, which requires the recognition of deferred tax assets and liabilities for the expected future tax consequences of events that have been included in the consolidated financial statements or tax returns. The Company accounts for income taxes using the asset and liability method to compute the differences between the tax basis of assets and liabilities and the related financial amounts, using currently enacted tax rates. A valuation allowance is recorded when it is more likely-than-not that a deferred tax asset will not be realized.\n45 | Page\nThe Companys practice is to recognize interest and penalties, if any, related to uncertain tax positions in income tax expense in the consolidated statements of operations.\nMeasurement of Fair Value\nThe fair value of a financial instrument is the amount that could be received upon the sale of an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. Financial assets are marked to bid prices and financial liabilities are marked to offer prices. Fair value measurements do not include transaction costs. A fair value hierarchy is used to prioritize the quality and reliability of the information used to determine fair values. Categorization within the fair value hierarchy is based on the lowest level of input that is significant to the fair value measurement. The fair value hierarchy is defined in the following three categories:\nLevel 1: Quoted market prices in active markets for identical assets or liabilities.\nLevel 2: Observable market-based inputs or inputs that are corroborated by market data.\nLevel 3: Unobservable inputs that are not corroborated by market data.\nEarnings (Loss) per Share\nThe Company computes basic and diluted earnings (loss) per share amounts in accordance with ASC Topic 260, Earnings per Share. Basic earnings (loss) per share is computed by dividing net income (loss) available to common shareholders by the weighted average number of common shares outstanding during the reporting period. Diluted earnings per share reflects the potential dilution that could occur if stock options and other commitments to issue common stock were exercised or equity awards vest resulting in the issuance of common stock that could share in the earnings of the Company. As of August 31, 2023, the Company has no potentially dilutive securities, such as options or warrants, currently issued and outstanding.\nRecently Issued Accounting Pronouncements\nExcept for rules and interpretive releases of the SEC under the authority of federal securities laws and a limited number of grandfathered standards, the FASB Accounting Standards Codification™ (ASC) is the sole source of authoritative GAAP literature recognized by the FASB and applicable to the Company. Management has reviewed the aforementioned rules and releases and believes any effect will not have a material impact on the Companys present or future financial statements.\nIn June 2016, the FASB issued ASU 2016-13, Measurement of Credit Losses on Financial Instruments. ASU 2016-13 adds a current expected credit loss (CECL) impairment model to U.S. GAAP that is based on expected losses rather than incurred losses. Modified retrospective adoption is required with any cumulative-effect adjustment recorded to retained earnings as of the beginning of the period of adoption. ASU 2016-13 is effective for fiscal years beginning after December 15, 2022, including interim periods within the year of adoption. Early adoption is permitted for fiscal years beginning after December 15, 2018, including interim periods within those fiscal years. The Company does not expect the application of the CECL impairment model to have a significant impact on its allowance for uncollectible amounts for accounts receivable.\nIn October 2021, the FASB issued ASU 2021-08, Business Combinations (Topic 805): Accounting for Contract Assets and Contract Liabilities from Contracts with Customers, which requires contract assets and contract liabilities acquired in a business combination to be recognized and measured by the acquirer on the acquisition date in accordance with ASC 606, Revenue from Contracts with Customers. This ASU should be applied prospectively to acquisitions occurring on or after the effective date of December 15, 2022, and early adoption is permitted.\nThe Company has implemented all new applicable accounting pronouncements that are in effect. These pronouncements did not have any material impact on the financial statements unless otherwise disclosed, and the Company does not believe that there are any other new accounting pronouncements that have been issued that might have a material impact on its financial position or results of operations.\n46 | Page\nNOTE 5 INVENTORIES\nInventories consist of the following:\nSUMMARY OF INVENTORIES\nAugust 31, 2023 August 31, 2022\nFinished goods $ 329,420 $ 385,102\nRaw materials and supplies 138,869 162,820\nWork in progress 162,189 71,074\nTotal inventory on hand $ 630,478 $ 618,996\nNOTE 6 DEPOSIT, PREPAYMENTS AND OTHER RECEIVABLES\nDeposit, prepayments, and other receivables consists of the following:\nSCHEDULE OF DEPOSIT PREPAYMENTS AND OTHER RECEIVABLES\nAugust 31, 2023 August 31, 2022\nDeposits and Prepayment 20,777 61,270\nOther receivables (Advances to suppliers) 596,730 770,396\nTotal 617,507 831,666\nNOTE 7 PROPERTY, PLANT AND EQUIPMENT, NET\nProperty, plant, and equipment consist of the following:\nSCHEDULE OF PROPERTY, PLANT AND EQUIPMENT\nAugust 31, 2023 August 31, 2022\nPlant and machineries $ 476,219 $ 464,019\nOffice equipment 55,848 55,587\nVehicles 77,497 71,860\nFurniture and equipment 22,285 26,577\nRenovation 113,305 134,309\nProperty plant and equipment gross 745,154 752,352\nLess: Accumulated depreciation (281,767 ) (149,597 )\nProperty, plant and equipment, net $ 463,387 $ 602,755\nDepreciation expense for the year ended August 31, 2022, was $95,158. Depreciation expense for the year ended August 31, 2023, was $132,170.\nNOTE 8 - INTANGIBLE ASSETS\nThe below table summarizes the identifiable intangible assets as of August 31, 2023, and August 31, 2022:\nSUMMARY OF INTANGIBLE ASSETS\nAugust 31, 2023 August 31, 2022\nTechnology 1-Portable Air Cooler $ 27,438,763 $ 27,438,763\nTechnology 2-Condensing Unit 55,709,004 55,709,004\nFinite- lived intangible assets, gross 83,147,767 83,147,767\nLess: Accumulated amortization (6,928,981 ) (2,771,592 )\nIntangible assets, net $ 76,218,786 $ 80,376,175\nAmortization expense for intangible assets for the year ended August 31, 2022, was $2,771,592. Amortization expense for intangible assets for the year ended August 31, 2023, was $4,157,389.\n47 | Page\nNOTE 9 ACCOUNTS PAYABLE, ACCRUALS, AND OTHER PAYABLES\nAccounts payable and accruals, and other payables consist of the following:\nSCHEDULE OF ACCOUNTS PAYABLES ACCRUALS AND OTHER PAYABLE\nAugust 31, 2023 August 31, 2022\nAccounts payable $ 40,939 $ 110,782\nAccruals 129,948 106,048\nOther payables 27,487 31,980\nTotal $ 198,375 $ 248,810\nNOTE 10 RELATED PARTY TRANSACTIONS\nAmounts due to shareholders\nAmounts due to shareholders are non-interest bearing, unsecured, have no fixed repayment term, and are not evidenced by any written agreement. The Company reported amount due to shareholders of $232,095 and $2,301 as of August 31, 2023, and August 31, 2022, respectively.\nEco Awareness Sdn Bhd\nEco Awareness Sdn Bhd is related to a common shareholder. Eco Awareness Sdn Bhd was our main distributor for E-condLife product. Eco Awareness Sdn Bhd has been re-designated as distributor in October 2021.\nThe sales generated from Eco Awareness Sdn Bhd amounted to $Nil and $22,903 during the years ended August 31, 2023, and August 31, 2022, respectively. The accounts receivable from Eco Awareness Sdn Bhd amounted to $Nil as of August 31, 2023, and August 31, 2022.\nThe purchases from Eco Awareness Sdn Bhd amounted to $Nil and $15,904 during the years ended August 31, 2023, and August 31, 2022, respectively. The accounts payable due to Eco Awareness Sdn Bhd amounted to $Nil as of August 31, 2023, and August 31, 2022.\nNOTE 11 STOCKHOLDERS EQUITY\nOn December 16, 2021, the Company has increased the authorized common stock from 75,000,000 shares with a par value of $0.001 per share to 1,000,000,000 shares with a par value of $0.001 per share.\nDuring the year ended August 31, 2022, the Company issued 1,116,055 shares of common stock in connection with the conversion of $1,004,442 in principal related to its convertible bonds.\nDuring the year ended August 31, 2022, the Company issued 83,147,767 shares of common stock in connection with Dr. Lows two deeds of assignments of intellectual properties.\n48 | Page\nDuring FYE 2022, the Company issued 14,443,501 shares of common stock pursuant to investment exchange agreements with relevant interest holders in relation to capital raising undertaken by WKL Eco Earth Holdings in prior years.\nDuring FYE 2022, the Company issued 30,000 shares of common stock pursuant to share exchange agreement with WKL Eco Earth Holdings for acquisition of WKL Green Energy and issued 72,000 shares of common stock pursuant to share exchange agreement for the acquisition of WKL Eco Earth.\nDuring FYE 2022, the Company issued 74,074 shares of common stock, par value $0.001 per share (Common Stock), at a per share purchase price of $2.50 (the Offering) for gross proceeds of $185,185, as part of a series of offerings by the Company for an aggregate of up to 6,000,000 shares of Common Stock at a per share purchase price of $2.50 (Round 2 Offering).\nDuring FYE 2022, the Company received cash proceeds of $199,845 from capital contribution. The Company also received cash proceeds of $75,000 from 30,000 shares to be issued, and those shares were issued on October 26, 2022.\nDuring the FYE 2023 the Company issued 427,536 shares of Common Stock at a per share purchase price of $2.50 as part of the Offering for gross proceeds of $1,068,728.\nDuring the FYE 2023, the Company received cash proceeds of $934,534 as part of the Offering, of which 373,822 shares of Common Stock at per share purchase price of $2.50 were issued on November 21, 2023. 500 shares of Common Stock were also issued to an individual in consideration for marketing services provided to the Company during FYE 2023, and the shares were issued on November 21, 2023.\nAs of August 31, 2023, and August 31, 2022, the Company had 102,310,933 and 101,853,397 shares of its common stock issued and outstanding, respectively.\nNOTE 12 INCOME TAXES\nThe Companys operating subsidiaries are governed by the Income Tax Law, which is concerning Foreign Investment Enterprises and Foreign Enterprises and various local income tax laws (the Income Tax Laws). We are routinely undergoing examinations in the jurisdictions in which we operate.\nThe Company has operations in Singapore, Malaysia, Cambodia, BVI, and China that are subject to taxes in the jurisdictions in which they operate, as follows:\nSingapore\nWKL Eco Earth Holdings is incorporated in Singapore, and under the current tax laws of Singapore, its standard corporate income tax rate is 17%.\nMalaysia\nWKL Eco Earth, WKL Green Energy and Evoair Manufacturing (including its 100% subsidiary Evo Air Marketing) are incorporated in Malaysia and are subject to common corporate income tax rate at 24%.\nCambodia\nWKL EcoEarth Indochina is incorporated in Cambodia, and under the current tax laws of Cambodia, its standard corporate tax rate is 20%.\nBVI\nEvoAir International is incorporated in BVI, and a BVI Business Company is exempt from the BVI income tax.\n49 | Page\nChina\nWKL Guanzhe is incorporated in China. Under the current tax law in the PRC, WKL Guanzhe is subject to the enterprise income tax rate of 25%.\nDue to the Companys net loss position, there was no provision for income taxes recorded. As a result of the Companys losses to date, there exists doubt as to the ultimate realization of the deferred tax assets. Accordingly, a valuation allowance equal to the total deferred tax assets has been recorded.\nReconciliation between the statutory tax rate to income before income taxes and the actual provision for income taxes is as follows:\nSCHEDULE OF RECONCILIATION BETWEEN THE STATUTORY TAX RATE AND THE ACTUAL PROVISION\nTwelve Months Ended\nAugust 31,\nUS Statutory rate 21 % 21 %\nEffect of reconciling items for tax purposes (21 )% (21 )%\nEffective income tax rate - % - %\nThe components of net deferred tax assets are as follows:\nSCHEDULE OF COMPONENTS ON NET DEFERRED TAX ASSET\nAugust 31, 2023 August 31, 2022\nNet operating loss carry-forward $ 13,520,000 $ 7,470,000\nLess: valuation allowance (13,520,000 ) (7,470,000 )\nNet deferred tax asset - -\nThe Company had net operating loss carry forwards for tax purposes of approximately $13,520,000 at August 31, 2023, and approximately $7,470,000 at August 31, 2022, which may be available to offset future taxable income. Utilization of the net operating loss carry forwards may be subject to substantial annual limitations due to the ownership change limitations provided by Section 381 of the Internal Revenue Code of 1986, as amended. The annual limitation may result in the expiration of net operating loss carry forwards before utilization.\nNOTE 13 ROU ASSET AND LEASES\nA lease is defined as a contract that conveys the right to control the use of identifiable tangible property for a period of time in exchange for consideration. On February 28, 2022, the Company adopted ASC Topic 842 which primarily affected the accounting treatment for operating lease agreements in which the Company is the lessee including the Companys leases of office and factory. The Company elected to not recognize ROU assets and lease liabilities arising from short-term leases with initial lease terms of twelve months or less (deemed immaterial) on the accompanying consolidated balance sheets.\nROU assets include any prepaid lease payments and exclude any lease incentives and initial direct costs incurred. Lease expense for minimum lease payments is recognized on the effective interest, the effective amortization on the lease liability. The lease terms may include options to extend or terminate the lease if it is reasonably certain that the Company will exercise that option.\nWhen measuring lease liabilities for leases that were classified as operating leases as of August 31, 2023, the Company discounted lease payments using its estimated incremental borrowing rate of 10%.\nOn March 28, 2023, the Company entered into a lease termination agreement to its Cambodia office lease at #65, 1st, 2nd and 3rd Floor, Street 123, Sangkat Toul Tumpong I, Khan Chamkarman, Phnom Penh, Cambodia (the Lease Termination). The Lease Termination terminated the Companys rights and obligations with respect to the leased premises on April 15, 2023. As such, the ROU assets and operating lease liabilities were remeasured and the Company recorded a gain of $14,890 as a component of operating expenses for the year ended August 31, 2023. No impairment of the ROU assets was deemed to have occurred.\n50 | Page\nThe following is a summary of ROU asset and operating lease liabilities:\nSUMMARY OF ROU ASSET AND OPERATING LEASE LIABILITIES\nAugust 31, 2023\nAugust 31, 2022\nAssets:\nROU asset $ 271,021 $ 442,020\nLiabilities:\nCurrent:\nOperating lease liabilities, current $ 84,879 $ 117,686\nNon-current\nOperating lease liabilities, noncurrent 198,163 355,186\nTotal lease liabilities $ 283,042 $ 472,872\nAs of August 31, 2023, remaining maturities of lease liabilities were as follows:\nSCHEDULE OF MATURITIES OF LEASE LIABILITIES\nOperating lease\n$ 84,880\n95,314\n75,035\n27,813\n2028 and thereafter -\nTotal $ 283,042\nNOTE 14 CONCENTRATIONS\nRevenues\nFor the years ended August 31, 2023, and 2022, the following customers comprised more than 10% of total sales:\nSCHEDULE OF CUSTOMERS AND VENDORS\nFor the years\nAugust 31, 2023 August 31, 2022\nCustomer #1 18 % -*\nCustomer #2 -* 27 %\nCustomer #3 - 13 %\n* Accounted for less than 10% for the year.\n51 | Page\nAccounts receivable\nAs of the years ended August 31, 2023, and 2022, the following customers comprised more than 10% of total accounts receivable:\nSCHEDULE OF CUSTOMERS AND VENDORS\nFor the year ended\nAugust 31, 2023 August 31, 2022\nCustomer #1 11 % *\nCustomer #2 10 % -*\nCustomer #3 -* 12 %\nCustomer #4 - 14 %\nCustomer #5 - 19 %\n* Accounted for less than 10% for the year end.\nPurchases\nFor the years ended August 31, 2023, and 2022, the following vendors comprised more than 10% of total purchases:\nSCHEDULE OF CUSTOMERS AND VENDORS\nFor the years\nAugust 31, 2023 August 31, 2022\nVendor #1 32 % 18 %\nVendor #2 18 % -*\nVendor #3 -* 15 %\nVendor #4 -* 15 %\nVendor #5 - 37 %\n* Accounted for less than 10% for the year.\nNOTE 15 COMMITMENTS AND CONTINGENCIES\nLitigation and Claims\nOn October 8, 2021, a filing (the Filing) was made with the Kuala Lumpur High Court by a reseller (the Reseller) of the Companys INCU ionic nano copper solution (the Solution) and the Resellers related party (together with the Reseller, the Plaintiffs).\nThe Reseller was authorized by WKL Eco Earths sole distributor of the Solution (the WKL Distributor) to resell the Solution together with a diffuser with a capacity of not more than 1000ml through a tripartite agreement (the Tripartite Agreement) entered into between (a) the Reseller, (b) the WKL Distributor and (c) a solution packaging company (the Packaging Company). WKL Eco Earth was not a party to the Tripartite Agreement and did not directly authorize or engage the Reseller in the resale of the Solution.\nIn the Filing, the Plaintiffs claimed against (i) WKL Eco Earth; (ii) Dr. Low; (iii) Chan Kok Wei, (iv) the Packaging Company and (v) two directors of the Packaging Company for loss and damages arising from an alleged breach of contract, defamation and tort of inducement. The Plaintiffs also alleged that pursuant to the Tripartite Agreement, WKL Eco Earth was prohibited from selling the Solution to any party other than the WKL Distributor and allow for the resale of the Solution by the Plaintiffs without limitation, and that the Plaintiffs were not confined in their resale of the Solution to a diffuser with a capacity of not more than 1000ml.\nThe Company believes the claims are without merit and will defend itself against the claims.\nThe Company follows subtopic 450-20 of the FASB Accounting Standards Codification to report accounting for contingencies. The outcome of the above case very much depends on the evidence produced and the weight of the Court places on the evidence. As it stands, WKL has a probability of success in its Counterclaim against the parties. Management does not believe, based upon information available at this time, that these matters will have a material adverse effect on the Companys consolidated financial position, results of operations or cash flows.\n52 | Page\nNOTE 16 SUBSEQUENT EVENTS\nIn accordance with FASB ASC 855-10 Subsequent Events, the Company has analyzed its operations subsequent to August 31, 2023, to the date these consolidated financial statements were issued, and has determined that it does not have any material subsequent events to disclose in these consolidated financial statements, except as follow:\nOn September 7, 2023, the Company entered into Regulation S share subscription agreements with 71 investors, each of whom represented that it was a non-U.S. Persons as defined in Regulation S of the Securities Act of 1933, as amended. Pursuant to the Regulation S SPAs, the Company agreed to issue and sell in aggregate, 365,164 shares of common stock, par value $0.001 per share (Common Stock) to the Regulation S Investors, at a per Share purchase price of $2.50 (the Offering) as part of a series of the private placement offerings by the Company for an aggregate of up to 6,000,000 shares of Common Stock at a per share purchase price of $2.50. The gross proceeds from the Offering in aggregate will be approximately $912,889. The SPA Shares were issued on September 15, 2023, and the Regulation S SPAs were closed on September 15, 2023.\nOn November 21, 2023, the Company entered into Regulation S share subscription with one Regulation S Investor, who represented that he was a non-U.S. Persons as defined in Regulation S of the Securities Act of 1933, as amended. Pursuant to the Regulation S SPA, the Company agreed to issue and sell in aggregate, 8,658 shares of common stock, par value $0.001 per share to the Regulation S Investor, at a per Share purchase price of $2.50 as part of a series of the private placement offerings by the Company for an aggregate of up to 6,000,000 shares of Common Stock at a per share purchase price of $2.50. The gross proceeds from the Offering in aggregate was approximately $21,645.\nOn November 21, 2023, the Company issued in aggregate, 52,107 shares of Common Stock to 15 referral agents in consideration for their referral to the Company of certain investors. Each Referral Agent is a non-US. Persons as defined in Regulation S.\nOn November 21, 2023, the Company issued in aggregate, 5,500 shares of Common Stock to two individuals in consideration for marketing services provided to the Company by Artisan Creative Studio, a marketing entity based in Malaysia. Each of the individuals is a non-US. Persons as defined in Regulation S.\nOn December 12, 2023, EvoAir Manufacturing entered into an OEM supply agreement (the Agreement) with Tadmonsori Holdings Sdn Bhd (THSB) pursuant to which the parties have agreed for THSB to purchase certain products (the Products) from EvoAir Manufacturing to resell directly under THSBs branding, trademark, graphics, packaging designs and artwork, with the insertion of the words Powered by EVOAIR inserted at the back of each Product, to THSB end user customers. The Agreement will be renewable on a three-year basis, and upon the execution of the Agreement, THSB shall have made a minimum order of 3,000 units of the Products upon signing of the Agreement, and to target a total sales turnover of 105,000,000 Malaysia Ringgit (approximately US$22,522,522, as calculated at the Foreign Exchange Rate of US$1 = 4.6620 Malaysia Ringgit on December 8, 2023, as published in H.10 statistical release of the United States Federal Reserve Board) over 3 years from January 1, 2024 to December 31, 2026.\n53 | Page ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone. ITEM 9A. CONTROLS AND PROCEDURES\nOur management is responsible for establishing and maintaining a system of disclosure controls and procedures (as defined in Rule 13a-15(e) and 15d-15(e) under the Exchange Act) that is designed to ensure that information required to be disclosed by us in the reports that we file or submit under the Exchange Act is recorded, processed, summarized and reported, within the time periods specified in the Commissions rules and forms. Disclosure controls and procedures include, without limitation, controls and procedures designed to ensure that information required to be disclosed by an issuer in the reports that it files or submits under the Exchange Act is accumulated and communicated to the issuers management, including its principal executive officer or officers and principal financial officer or officers, or persons performing similar functions, as appropriate to allow timely decisions regarding required disclosure.\nAn evaluation was conducted under the supervision and with the participation of our management of the effectiveness of the design and operation of our disclosure controls and procedures as of August 31, 2023. Based on our managements evaluation under the framework in Internal Control-Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission, our management concluded that our disclosure controls and procedures were not effective as of such date to ensure that information required to be disclosed in the reports that we file or submit under the Exchange Act, is recorded, processed, summarized and reported within the time periods specified in SEC rules and forms.\nA material weakness is a control deficiency, or combination of control deficiencies, such that there is a reasonable possibility that a material misstatement of the annual or interim financial statements will not be prevented or detected on a timely basis. In connection with the assessment described above, management identified the following control deficiencies that represent material weaknesses at August 31, 2023:\n● Due to our limited resources, we do not have enough accounting personnel with extensive experience in maintaining books and records and preparing financial statements in accordance with US GAAP which could lead to untimely identification and resolution of accounting matters inherent in our financial transactions in accordance with US GAAP.\n● The Company has insufficient written policies and procedures for accounting and financial reporting, which led to inadequate financial statement closing process.\n● The Company has a lack of segregation of duties, a lack of audit committee or independent governance/oversight.\nOur management also confirmed that there was no change in our internal control over financial reporting during the year August 31, 2023 that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting. ITEM 9B. OTHER INFORMATION\nNone.\n54 | Page\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nOur executive officers and directors and their respective ages as of the date hereof are as follows:\nName\nAge\nPositions\nLow Wai Koon\nExecutive Director/ Chairman/ Chief Executive Officer\nChan Kok Wei\nExecutive Director/ Group Managing Director\nOng Bee Chen\nExecutive Director/ Chief Financial Officer\nGoh Chuan Meng\nIndependent Non-Executive Director\nIvan Oh Joon Wern\nNon-Executive Director\nDr. Low, aged 53, is the founder and Chief Executive Officer of the EvoAir Group since 2017, where heads the research and development team of EvoAir Group, provides leadership and builds consensus, in conjunction with the Group Managing Director and oversees the day the day-to-day operations of the Group. Prior to joining the EvoAir Group, Dr. Low had over 15 years of experience in the mechanical engineering sector. He founded Proficient Auto Sdn Bhd, a chain auto service centre in Malaysia, in 2001 and acted as an executive director from 2001 to 2013 where he was in charge of day to day operation. Dr Low was the founder and Executive Director of LWK Automotive Green Technologies Sdn Bhd from 2011 to 2017 overseeing day to day operation, as well as designing producing various products focusing on green technologies, including the Hydraulic Powered Drive System (HPDS), a fully waterproof transmission technology that incorporates a normal combustion engine with a hydraulic system, with the objective to produce an environmentally friendly system that enables conventional engines and generators to run more efficiently; and multi-purpose rescue vehicle (MRV), a unique vehicle built upon the HPDS green technology for the disaster relief sector. Dr. Low is also the author of ‘The Light, a book focusing on creating awareness of environmental protection by mankind as a green activist. He was conferred a Degree of Doctor of Philosophy (Honoris Causa) with a major in Robotics Engineering Science from the American World University in 2009 and is an Honorary Fellow of the International Society of Professional Engineers, USA, since 2010.\nMr. Chan, aged 49, is an executive director of the Group. Mr. Chan is a Co-founder and Group Managing Director of EvoAir Group since 2017. He is responsible for the general management, planning of overall strategy and day-to-day operations of the Group, development of the Groups overall strategic plan, capital markets activities and corporate development initiatives. Mr. Chan has had 22 years of experience in general management, capital markets, wealth management, investment banking, corporate advisory, corporate development and investors relations experience in Asia. He is a Co-founder and Managing Director of Allegro Corporate Advisory Pte Ltd (Allegro) since 2015, an independent strategic and corporate advisory firm based in Singapore. Allegro provides advisory services relating to initial public offerings (IPOs), mergers and acquisitions (M&A), business and trade sales, strategic corporate transactions, and capital raising, which focuses on Southeast Asia and China. Mr. Chan was the Director of Corporate Development of ZingMobile Group Limited (ZingMobile) from 2012 to 2017, an Australian Securities Exchange (ASX)-listed mobile platform enabler responsible for the groups corporate finance, business and corporate development as well as investors relation and stakeholder management. Mr. Chan was also a director of ZingMobiles holding company, ZingMobile International Pte Ltd. Prior to joining ZingMobile group, he was a Vice President at BNP Paribas Wealth Management, Singapore from 2010 to 2012, and Vice President of CIMB Investment Bank, Malaysia from 2005 to 2010, providing wealth management solutions to high net worth individuals.\nMr. Chan has listed company transaction experience including spearheading the IPO of Oilfield Workforce Group Ltd (Oilfield) on ASX in 2013; reverse takeover exercise of ZingMobile involving Pixie Entertainment Group Pte Ltd in 2015. Mr. Chan and his partner were credited for unlocking the shareholders value of the then ASX-listed company, Oilfield by restructuring the group through injecting a healthy business, Jack-In-Pile (M) Sdn Bhd, a Malaysian-based piling company and divesting the ailing oil and gas business. He was the Independent Non-Executive Director, Chairman of Audit Committee and Nomination Committee of Oilfield.\nMr. Chan received a Master in Business Administration (Finance) from the Charles Sturt University, Australia in April 2003 and a Bachelor of Economics from The Australian National University, Australia in April 2000.\n55 | Page\nMs. Ong, aged 47, is an Executive Director and Group Chief Financial Officer of the Group. Ms. Ong was a Co-founder of EvoAir Group since 2017. She is responsible for the planning, implementation, managing accounting and finance activities of EvoAir Group, including business planning, budgeting, forecasting and cashflow management, working alongside with Chief Executive Officer and Group Managing Director in formulating corporate strategies for the Group as well as spearheading the corporate exercises undertaken by the Group. Ms. Ong has 22 years of experience in general management, corporate finance, private equity, investment management, strategic and advisory, internal audit in Singapore and Malaysia. She is the co-founder and Executive Director of Allegro since 2015, an independent strategic and corporate advisory firm based in Singapore. Allegro provides advisory services relating to IPO, M&A, business and trade sales, strategic corporate transactions, and capital raising, which focuses on Southeast Asia and China. Ms. Ong was an Associate Director of a Singapore-based private equity firm, where she was responsible for managing private equity investments (including origination, structuring, execution and divestments) in Emerging East Asia with China centric, which includes formulating value creation plans and bringing investee companies for listing and trade sale as part of exit strategies. During her tenure with investment banks and corporate and strategic advisory firms, she was widely involved in corporate finance transactions including cross-border mergers and acquisitions, reverse takeovers, initial public offerings and equity capital market transactions on ASX, Bursa Malaysia Securities Berhad and Stock Exchange of Hong Kong Limited. Ms Ong and her partner were credited for unlocking the shareholders value of an ASX-listed company, Oilfield by restructuring the group through injecting a healthy business, Jack-In-Pile (M) Sdn Bhd, a Malaysian-based piling company and divesting the ailing oil and gas business.\nMs. Ong graduated from The Australian National University with Bachelor of Commerce majoring in Accounting, Finance and sub-majoring in Economics in April 2000 and obtained Certified Practising Accountant status with CPA Australia since 2004.\nDr. Goh, aged 38, is an independent non-executive director of the Group. He has also served as the Technology Advisor for the EvoAir Group since 2017. Dr. Goh had over 10 years experience in engineering and teaching. Dr. Goh is an assistant professor at the Universiti Tunku Abdul Rahman, Kampar since September 2017. From July 2014 to May 2016, Dr. Goh taught as a Graduate Assistance at the Universiti Teknologi Petronas. From April 2014 to July 2014, Dr, Goh taught as a Physics Teacher at Tenby International School. From March 2013 to April 2014, Dr. Goh worked as a Senior Process Engineer at Finisar Berhad. From January 2010 to March 2013, Dr. Goh worked as an equipment engineer at Unisem (M) Berhad. From July 2009 to January 2010, Dr. Goh worked as a product engineer at Carsem (M) Berhad. Dr. Goh obtained both his doctorate degrees of Doctorate of Philosophy in Electronic and Electrical Engineering from the University of Technology Petronas, Tronoh, Perak and Doctorate Philosophy in Electronic and Image Engineering from the University of Burgundy, Dijon, France in August 2017. Dr. Goh obtained his Master of Business Administration from the Universiti Utara Malaysia, Sintok in March 2016. Dr. Goh obtained his Master of Science in Electronic System (Honors Engineering from the University of Technology Petronas, Tronoh, Perak in May 2014. Dr. Goh obtained his Bachelor of Engineering (Hons) Mechanical from the University of Industry Selangor, Batang Berjuntai, Selangor in August 2009.\n56 | Page\nMr. Oh, aged 30, is a Non-Executive Director of EvoAir Group. Mr. Oh had over 10 years of experience in business development, finance and sales. Since September 2016, Mr. Oh has been the deputy chief financial officer of Tone Group International Sdn Bhd, a telecommunications company in Malaysia. Mr. Oh is a Marketing Manager of Bread Buddy PLT, a bakery located in Malaysia since February 2020. From March 2011 to August 2011, Mr. Oh was a sales executive at Apple Inc. in Malaysia. Mr. Oh obtained a Bachelor of International Business and Entrepreneurship from the University of Essex with Honours Class II (Division 1), United Kingdom in 2016.\nAudit, Nominating and Compensation Committees\nWe do not currently have an audit, nominating or compensation committee or committees performing similar functions. The Board of Directors as a whole performs such duties.\nSIGNIFICANT EMPLOYEES\nOther than our director, we do not expect any other individuals to make a significant contribution to our business.\n57 | Page ITEM 11. EXECUTIVE COMPENSATION\nThe following tables set forth certain information about compensation paid, earned or accrued for services by our Executive Officer for FYE 2023 and 2022:\nSummary Compensation Table\nName and\nPrincipal\nPosition Financial\nPeriod Ended August 31 Salary\n($) Bonus\n($) Stock\nAwards\n($) Option\nAwards\n($) Non-Equity\nIncentive Plan\nCompensation\n($) Change in pension value and nonqualified deferred compensation earnings\n($) All Other\nCompensation\n($) Total\n($)\nLow Wai Koon 119,667 9,972 -0- -0- 129,639\nChan Kok Wei 115,056 9,588 -0- -0- 124,644\nOng Bee Chen 88,505 7,375 -0- -0- 95,880\nGoh Chuan Meng 5,319 -0- -0- -0- 5,319\nTan Soon Hock -0- -0- -0- -0-\nChan Hong Fook 1,773 -0- -0- -0- 1,773\nIvan Oh Joon Wern 5,319 -0- -0- -0- 5,319\nName and\nPrincipal\nPosition Financial\nPeriod Ended August 31, Salary\n($) Bonus\n($) Stock\nAwards\n($) Option\nAwards\n($) Non-Equity\nIncentive Plan\nCompensation\n($) Change in pension value and nonqualified deferred compensation earnings\n($) All Other\nCompensation\n($) Total\n($)\nLow Wai Koon 126,555 10,546 -0- -0- 137,101\nChan Kok Wei 114,255 9,521 -0- -0- 123,776\nOng Bee Chen 87,889 7,324 -0- -0- 95,213\nGoh Chuan Meng 5,625 -0- -0- -0- 6,094\nTan Soon Hock -0- -0- -0- -0-\nIvan Oh Joon Wern 5,625 -0- -0- -0- 5,625\nThere are no current employment agreements between the company and its officer.\nThere are no annuity, pension or retirement benefits proposed to be paid to the officer or director or employees in the event of retirement at normal retirement date pursuant to any presently existing plan provided or contributed to by the company or any of its subsidiaries, if any.\nExecutive Compensation Philosophy\nOur Board of Directors determines the compensation given to our executive officers in their sole determination. Our Board of Directors reserves the right to pay our executive or any future executives a salary, and/or issue them shares of common stock in consideration for services rendered and/or to award incentive bonuses which are linked to our performance, as well as to the individual executive officers performance. This package may also include long-term stock-based compensation to certain executives, which is intended to align the performance of our executives with our long-term business strategies. Additionally, while our Board of Directors has not granted any performance base stock options to date, the Board of Directors reserves the right to grant such options in the future, if the Board in its sole determination believes such grants would be in the best interests of the Company.\n58 | Page\nIncentive Bonus\nThe Board of Directors may grant incentive bonuses to our executive officer and/or future executive officers in its sole discretion, if the Board of Directors believes such bonuses are in the Companys best interest, after analyzing our current business objectives and growth, if any, and the amount of revenue we are able to generate each month, which revenue is a direct result of the actions and ability of such executives.\nLong-term, Stock Based Compensation\nIn order to attract, retain and motivate executive talent necessary to support the Companys long-term business strategy we may award our executive and any future executives with long-term, stock-based compensation in the future, at the sole discretion of our Board of Directors, which we do not currently have any immediate plans to award.\nPensions\nAs of December 9, 2023, besides regulatory Central Provident Fund payments for Singapore employees and regulatory employee Provident Fund Payments for Malaysia employees, we had no pension plans or compensatory plans or other arrangements which provide compensation in the event of a termination of employment or a change in our control. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe following table sets forth information as of December 9, 2023 regarding the ownership of our common stock by each shareholder known by us to be the beneficial owner of more than five percent of our outstanding shares of common stock, each director and all executive officers as a group. Except as otherwise indicated, each of the shareholders has sole voting and investment power with respect to the shares of common stock beneficially owned.\nTitle of Class Name and Address of\nBeneficial Owner\nAmount and Nature of Beneficial Ownership Percent of class\nCommon Stock WKL Global Limited 62,083,643 60.43 %\nRitter House, Wickhams Cay II, PO Box 3170, Road Town, Tortola VG1110,\nCommon Stock Allegro Investment (BVI) Limited 13,547,243 13.19 %\nRitter House, Wickhams Cay II, PO Box 3170, Road Town, Tortola VG1110,\nNamed Executive Officers, Directors\nCommon Stock Low Wai Koon 62,083,643 (1) 60.43 %\nNo 31-A2, Jalan 5/32A, 6 1/2 Miles, Off Jalan Kepong, 52000 Kuala Lumpur, Malaysia.\nCommon Stock Chan Kok Wei 13,547,243 (2) 13.19 %\nNo 31-A2, Jalan 5/32A, 6 1/2 Miles, Off Jalan Kepong, 52000 Kuala Lumpur, Malaysia.\nCommon Stock Ong Bee Chen 13,547,243 (3) 13.19 %\nNo 31-A2, Jalan 5/32A, 6 1/2 Miles, Off Jalan Kepong, 52000 Kuala Lumpur, Malaysia.\nCommon Stock Tan Soon Hock 7,037,762 6.85 %\nNo 31-A2, Jalan 5/32A, 6 1/2 Miles, Off Jalan Kepong, 52000 Kuala Lumpur, Malaysia.\nCommon Stock Ivan Oh Joon Wern 2,520,000 2.45 %\nNo 31-A2, Jalan 5/32A, 6 1/2 Miles, Off Jalan Kepong, 52000 Kuala Lumpur, Malaysia.\n(1) WKL Global Limited is wholly owned and controlled by Low Wai Koon\n(2) Chan Kok Wei beneficially holds 100% shareholding of Allegro Investment\n(3) Ong Bee Chen beneficially holds 100% shareholding Allegro Investment\nThe percent of class is based on 102,742,362 shares of common stock issued and outstanding as of December 9, 2023.\n59 | Page ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nSEC rules require us to disclose any transaction since the beginning of our last fiscal year or any currently proposed transaction in which we are a participant in which the amount involved exceeded or will exceed $120,000 and in which any related person has or will have a direct or indirect material interest. A related person is any executive officer, director, nominee for director, or holder of 5% or more of our common stock, or an immediate family member of any of those persons.\nThe Companys related party list and relationship are as follows:\nRelated parties\nRelationships\nDr. Low Wai Koon\nThe executive director, chairman and chief executive officer of the Company is also the shareholder and director of WKL Global Limited.\nChan Kok Wei\nThe executive director, and director of the Company is also the shareholder and director of Allegro Investment (BVI) Limited.\nTan Soon Hock\nOne of the shareholders of the Company and EvoAir Manufacturing (M) Sdn. Bhd.\nVincent Oh Teik Huat\nOne of the shareholders of the Company and, also one of the shareholders and directors of EvoAir Manufacturing (M) Sdn. Bhd.\nEco Awareness Sdn. Bhd.\nMr. Ewe Tuan Cheng, one of the shareholders of the Company and acted as one of the Companys distributors for E-condLife product.\nRelated party balances as of August 31, 2023 and 2022 are as per table below:\nRelated party balances\nAmount due to shareholders\nAs of\nName of Related Party Nature August 31, 2023 August 31, 2022\nDr. Low Wai Koon Shareholder loan/ Expenses paid on behalf $ 64,592 $ 2,301\nChan Kok Wei Shareholder loan 53,877 -\nTan Soon Hock Shareholder loan 80,816 -\nVincent Oh Teik Huat Shareholder loan 32,810\n-\nTotal\n$ 232,095\n$ 2,301\n60 | Page\nRelated party transactions for years ended August 31, 2023 and 2022, are as per table below:\nRelated party transactions\nSales\nFor the years ended August 31,\nName of Related Party Nature\nEco Awareness Sdn. Bhd. Sales of E-cond Life product $ - $ 172,475\nTotal\n$ - $ 172,475\nPurchases\nFor the years ended August 31,\nName of Related Party Nature\nEco Awareness Sdn. Bhd. Purchase of E-cond Life product $ - $ 71,162\nTotal\n$ - $ 71,162\nRelated party balances as of August 31, 2023 and 2022 are as per table below:\nAmount due to shareholders\nAs of\nName of Related Party Nature August 31, 2023 August 31, 2022\nDr. Low Wai Koon Expenses paid on behalf $ -\n$ 2,301\nOther shareholders Investors funds deposited - -\nTotal\n$ -\n$ 2,301\n61 | Page\nAccounts receivable - related party\nAs of August 31,\nName of Related Party Nature\nEco Awareness Sdn. Bhd. Sales of E-cond Life product $ - $ -\nTotal\n$ - $ -\nAccounts payable - related party\nAs of August 31,\nName of Related Party Nature\nEco Awareness Sdn. Bhd. Purchase of E-cond Life product $ - $ -\nTotal\n$ - $ -\nRelated party transactions for years ended August 31, 2023 and 2022, are as per table below:\nRelated party transactions\nSales\nFor the year ended August 31,\nName of Related Party Nature\nEco Awareness Sdn. Bhd. Sales of E-cond Life product $ - $ 22,903\nTotal\n$ - $ 22,903\nPurchases\nFor the year ended August 31,\nName of Related Party Nature\nEco Awareness Sdn. Bhd. Purchase of E-cond Life product $ - $ 15,904\nTotal\n$ - $ 15,904\n62 | Page ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nThe following table presents the fees for professional audit services of the Companys annual financial statements for the fiscal years ended August 31, 2023 and August 31, 2022 and fees billed for other services rendered by the auditors during those periods. All services reflected in the following fee table were pre-approved, respectively, in accordance with the policy of the Board.\nAugust 31, 2023 August 31, 2022\nAudit fees (1) $ 108,000 $ 89,500\nAudit-related fees 1,480 -\nTax fees 3,600\nAll other fees - -\nTotal Fees $ 110,260\n$ 93,100\nNotes:\n(1)Audit fees consist of audit and review services, consent and review of documents filed with the SEC. For fiscal years ended August 31, 2023 and August 31, 2022, respectively.\nIn its capacity, the Board pre-approves all audit (including audit-related) and permitted non-audit services to be performed by the independent auditors. The Board will annually approve the scope and fee estimates for the year-end audit to be performed by the Companys independent auditors for the fiscal year. With respect to other permitted services, the Board pre-approves specific engagements, projects and categories of services on a fiscal year basis, subject to the individual project and annual maximums. To date, the Company has not engaged its auditors to perform any non-audit related services. ITEM 15. EXHIBITS\nThe following exhibits are filed as part of this Annual Report.\n10.1* Share Transfer Agreement between Low Wai Koon and Unex Holdings Inc., dated December 20, 2021, incorporated by reference to Exhibit 2.1 on Form 8-K filed on December 21, 2021.\n10.2* Share Transfer Agreement between Low Wai Koon and WKL Global, dated December 20, 2021, incorporated by reference to Exhibit 2.2 on Form 8-K filed on December 21, 2021.\n10.3* Share Transfer Agreement between Low Wai Koon and Evoair International Limited, dated December 20, 2021, incorporated by reference to Exhibit 2.3 on Form 8-K filed on December 21, 2021.\n10.4* Form of Share Exchange Agreement between certain sellers and WKL Eco Earth Holdings Pte. Ltd. whereby Unex Holdings Inc. is the Issuer, dated December 20, 2021, incorporated by reference to Exhibit 2.4 on Form 8-K filed on December 21, 2021.\n10.5* Form of Share Exchange Agreement between certain sellers and WKL Eco Earth Holdings Pte. Ltd. whereby Unex Holdings Inc. is the Issuer, dated December 20, 2021, incorporated by reference to Exhibit 2.5 on Form 8-K filed on December 21, 2021.\n10.6* Form of Investment Exchange Agreement between certain Seller and WKL Eco Earth Holdings Pte. Ltd. whereby Unex Holdings Inc. is the Issuer, dated December 20, 2021, incorporated by reference to Exhibit 2.6 on Form 8-K filed on December 21, 2021.\n10.7* Form of Deed of Assignment between Low Wai Koon and WKL Eco Earth Holdings Pte Ltd, dated December 20, 2021, incorporated by reference to Exhibit 2.7 on Form 8-K filed on December 21, 2021.\n10.8* Form of Deed of Assignment between Low Wai Koon and WKL Eco Earth Holdings Pte Ltd, dated December 20, 2021, incorporated by reference to Exhibit 2.8 on Form 8-K filed on December 21, 2021.\n10.9* Form of Subscription Agreement between Ang Lee Kim Jane and Unex Holdings Inc., dated February 15, 2022\n10.10* Form of Subscription Agreement between Wong Hon Wai and Unex Holdings Inc., dated June 3, 2022\n10.11* Supplemental Agreement dated October 19, 2022, by and between Unex Holdings Inc. and Wong Hon Wai.\n10.12* Form of Subscription Agreement between Regulation S Investors and Unex Holdings Inc., dated October 25, 2022\n10.13* Form of Subscription Agreement between Regulation D Investors and Unex Holdings Inc., dated October 25, 2022\n10.14* Form of Subscription Agreement between Regulation S Investors and Unex Holdings Inc., dated February 20, 2022\n10.15* Form of Subscription Agreement between Regulation S Investors and Unex Holdings Inc., dated July 13, 2023\n10.16* Form of Subscription Agreement between Regulation S Investors and Unex Holdings Inc., dated September 7, 2023\n10.17* Form of Subscription Agreement between Regulation S Investor and EvoAir Holdings Inc., dated November 21, 2023\n10.18* OEM Supply Agreement dated December 12, 2023\n31.1 Certification of Chief Executive Officer pursuant to Securities Exchange Act of 1934 Rule 13a-14(a) or 15d-14(a)\n31.2 Certification of Chief Financial Officer pursuant to Securities Exchange Act of 1934 Rule 13a-14(a) or 15d-14(a)\n32.1 Certifications pursuant to Securities Exchange Act of 1934 Rule 13a-14(b) or 15d-14(b) and 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes- Oxley Act of 2002, executed by Chief Executive Officer\n32.2 Certifications pursuant to Securities Exchange Act of 1934 Rule 13a-14(b) or 15d-14(b) and 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes- Oxley Act of 2002, executed by Chief Financial Officer\n101. INS Inline XBRL Instance Document\n101. SCH Inline XBRL Taxonomy Extension Schema Document\n101. CAL Inline XBRL Taxonomy Extension Calculation Linkbase Document\n101. DEF Inline XBRL Taxonomy Extension Definition Document\n101. LAB Inline XBRL Taxonomy Extension Label Linkbase Document\n101. PRE Inline XBRL Taxonomy Extension Presentation Linkbase Document\nCover Page Interactive Data File (embedded within the Inline XBRL document)\n* Previously filed\n63 | Page\nSIGNATURES\nIn accordance with the requirements of the Exchange Act, the registrant caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nEVOAIR HOLDINGS INC.\nDated: December 14, 2023 By: /s/ Low Wai Koon\nLow Wai Koon, Chairman, President and Chief Executive Officer\n(Principal Executive Officer)\nDated: December 14, 2023 By: /s/ Ong Bee Chen\nOng Bee Chen\nChief Financial Officer\n64 | Page"
}