{
    "cik": "1714367",
    "company": "SigmaRenoPro, Inc.",
    "filing_type": "10-K",
    "filing_date": "2023-11-30",
    "period_of_report": "2022-06-30",
    "sic": "7200",
    "state_of_inc": "NV",
    "state_location": "FL",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1714367/0001683168-23-008545-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1714367/000168316823008545/sigmar_i10k-063022.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1714367/0001683168-23-008545.txt",
    "filename": "1714367_10K_2022_0001683168-23-008545.htm",
    "content": "ITEM 1. BUSINESS\nGeneral\nAs used in this Annual Report, references to the Company, we, our, ours and us refer SIGMARENOPRO, INC., unless otherwise indicated. In addition, references to our financial statements are to our consolidated financial statements except as the context otherwise requires.\nWe prepare our financial statements in United States dollars and in accordance with generally accepted accounting principles as applied in the United States, referred to as U.S. GAAP. In this Annual Report, references to $ and dollars are to United States dollars.\nOverview\nSigmaRenoPro, Inc. (we, or the Company) was incorporated in the State of Nevada as a for-profit Company on June 16, 2017. We are a development-stage Company which originally intended to be in the business of matching home project owners with contractors in the United States.\nThe Company underwent a change of control in June 2021, when the prior control shareholder, Omar Aamar, sold his shares of common stock to Global Marketing Services LLC, an entity controlled by Ronald Jones. NFT Trading Company LLC also acquired an additional 1,600,000 shares of common stock from several minority shareholders of the Company.\nAs a result of the change of control, Omar Aamar and Hosneih Aamar resigned from all positions with the Company and Ronald Jones was appointed the sole director and officer.\nEmployees\nThe Company currently has one employee, Ronald Jones.\nOur Corporate Information\nOur principal executive office is located at 112 North Curry Street, Carson City, NV, 89703, USA. Our telephone number is (407) 963-8877.\nOur United States and registered statutory office is located 112 North Curry Street, Carson City, NV, 89703.\nAvailable Information\nCopies of our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and other documents that we will file with or furnish to the SEC will be available free of charge by sending a written request to our Corporate Secretary at our corporate headquarters. Additionally, the documents we file with the SEC is or will be available free of charge at the SECs Public Reference Room at 100 F Street, NE, Washington D.C. 20549. Other information on the operation of the Public Reference Room is or will be available by calling the SEC at (800) SEC-0330. ITEM 1A. RISK FACTORS\nSmaller reporting companies are not required to provide the information required by this item. ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone. ITEM 2. PROPERTIES\nWe maintain our head office at 112 North Curry Street, Carson City, NV, 89703, USA. We believe that all our property has been adequately maintained, is generally in good condition, and is suitable and adequate for our business. ITEM 3. LEGAL PROCEEDINGS\nFrom time to time, we may become involved in various lawsuits and legal proceedings, which arise in the ordinary course of business. However, litigation is subject to inherent uncertainties, and an adverse result in these, or other matters, may arise from time to time that may harm our business. ITEM 4. MINE SAFETY DISCLOSURES.\nNot applicable.\nPART II ITEM 5. MARKET FOR REGISTRANT'S COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nMarket for Our Common Stock\nThere is no public market for our common stock.\nApproximate Number of Holders of Our Common Stock\nAs of June 30, 2022, the Company had approximately 5 stockholders of record and 4,500,000 shares of common stock were issued and outstanding.\nOur registrar and transfer agent for our common stock is Nevada Agency and Transfer Company. Its address is 50 West Liberty Street, Suite 880, Reno NV 89501, and their telephone number and facsimile are +1-775-322-0626 and +1-775-322-5623, respectively.\nDividend Policy\nThe Company has not declared any dividends since incorporation and does not anticipate doing so in the foreseeable future. We currently intend to retain most, if not all, of our available funds and any future earnings to operate and expand our business.\nOur board of directors has discretion on whether to pay dividends unless the distribution would render us unable to repay our debts as they become due. Even if our board of directors decides to pay dividends, the form, frequency and amount will depend upon our future operations and earnings, capital requirements and surplus, general financial condition, contractual restrictions and other factors that the board of directors may deem relevant.\nSecurities Authorized for Issuance Under Equity Compensation Plans\nThere are no outstanding equity awards.\nRecent Sales of Unregistered Securities\nThere have been no sales of unregistered securities during the fiscal year ended June 30, 2022.\nPurchases of Our Equity Securities\nNo repurchases of our common stock were made during fiscal 2022.\nDirector Compensation\nOur directors are not compensated for their services. The board has not implemented a plan to award options to our director. There are no contractual arrangements with any member of the board of directors. We have no director's service contracts. ITEM 6. SELECTED FINANCIAL DATA\nSmaller reporting companies are not required to provide the information required by this item. ITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion should be read in conjunction with our financial statements, including the notes thereto, appearing elsewhere in this annual report. The following discussion contains forward-looking statements that reflect our plans, estimates and beliefs. Our actual results could differ materially from those discussed in the forward-looking statements. Our audited financial statements are stated in United States Dollars and are prepared in accordance with United States Generally Accepted Accounting Principles.\nResults of Operations for the year ended June 30, 2022 and June 30, 2021:\nRevenue\nFor the years ended June 30, 2022 and 2021, we generated no revenue.\nOperating expenses\nOperating expense were $0.00 for the year ended June 30, 2022 as compared with $25,551 for the year ended June 30, 2021. This decrease is primarily attributable to the discontinuation of operations.\nNet Loss\nNet loss remained flat at $0.00 for the year ended June 30, 2022 as compared with $25,551 for the year ended June 30, 2021. The increase is entirely attributable to a decrease in operating expenses of approximately $0.00.\nLiquidity and Capital Resources and Cash Requirements\nAt year ended June 30, 2022, the Company had cash of $0.00. The Company had a working capital deficit of $108,270.\nDuring the year ended June 30, 2022, the Company used $0.00 of cash in operating activities due to being in a shell status with no operations.\nDuring the year ended June 30, 2022 the Company used no cash in investing activities.\nDuring the year ended June 30, 2022, the Company generated $0.00 of cash in financing activities.\nWe cannot guarantee that we will manage to sell all the shares required. We will attempt to raise the necessary funds to proceed with all phases of our plan of operation.\nAs of the date of this report, the current funds available to the Company will not be sufficient to continue maintaining a reporting status.\nOur auditors have issued a going concern opinion, meaning that there is substantial doubt we can continue as an on-going business for the next twelve months unless we obtain additional capital. Our only sources for cash at this time are investments by others in this offering, selling our paper dung products and loans from our director. We must raise cash to implement our plan and stay in business.\nManagement believes that current trends toward lower capital investment in start-up companies pose the most significant challenge to the Companys success over the next year and in future years. Additionally, the Company will have to meet all the financial disclosure and reporting requirements associated with being a publicly reporting company. The Companys management will have to spend additional time on policies and procedures to make sure it is compliant with various regulatory requirements, especially that of Section 404 of the Sarbanes-Oxley Act of 2002. This additional corporate governance time required of management could limit the amount of time management has to implement is business plan and impede the speed of its operations.\nLimited operating history; need for additional capital\nThere is no historical financial information about us upon which to base an evaluation of our performance. We are in a start-up stage of operations and have generated limited revenues since inception. We cannot guarantee that we will be successful in our business operations. Our business is subject to risks inherent in the establishment of a new business enterprise, including limited capital resources and possible cost overruns due to price and cost increases in services and products.\nOff-Balance Sheet Arrangements\nWe do not maintain any off-balance sheet arrangements, transactions, obligations or other relationships with unconsolidated entities that would be expected to have a material current or future effect upon our financial condition or results of operations.\nGoing Concern\nThe consolidated financial statements have been prepared assuming we will continue in a dormant state, which contemplates, the realization of assets and satisfaction of liabilities in the normal course of business. We incurred losses from operations of $25,551.00 and $0.00 for the years ended June 30, 2021 and 2022, respectively, and had an accumulated deficit of $108,270 at June 30, 2021, carrying forward in the same amount as June 30, 2022. In addition, we used cash from operating activities of $0.00 for the year ended June 30, 2022. These factors raise substantial doubt about our ability to continue as a going concern.\nThe Company will require additional funding to execute its future strategic business plan. Successful business operations and its transition to attaining profitability are dependent upon obtaining additional financing and achieving a level of revenue adequate to support its cost structure. These conditions raise substantial doubt about the Company's ability to continue as a going concern.\nWhile the Company is attempting to establish an ongoing source of revenues sufficient to cover its operating costs and allow it to continue as a going concern, the Companys cash position may not be adequate to support the Companys daily operations. Management intends to raise additional funds by seeking equity and/or debt financing; however there can be no assurances that it will be successful in those efforts. The ability of the Company to continue as a going concern is dependent upon the Companys ability to obtain financing, further implement its business plan, and generate revenues.\nThere are significant risks and uncertainties which could negatively affect the Companys operations. These are principally related to the existence of events of default under the Companys outstanding debt obligations, which could trigger penalties. Furthermore, if our current indebtedness is not restructured, paid or converted into equity, which is at the debt holders discretion, our current operations do not generate sufficient cash to pay interest and principal on these obligations when they become due. Accordingly, there can be no assurance that we will be able to pay these or other obligations which we may incur in the future. In the event we are unable to restructure, pay or convert into equity the balance of our outstanding indebtedness, the holders may obtain judgments against us and seek to enforce such judgments against our assets, in which event we will be required to cease our business activities and the equity of our stockholders will be effectively wiped out.\nOur only sources of additional funds to meet continuing operating expenses, fund additional research and development and fund additional working capital are through the sale of securities, and/or debt instruments. We are actively seeking additional debt or equity financing, but no assurances can be given that such financing will be obtained or what the terms thereof will be. We may need to discontinue a portion or all of our operations if we are unsuccessful in generating positive cash flow or financing for our operations through the issuance of securities.\nRecent Accounting Pronouncements\nIn October 2016, the FASB issued ASU 2016-16, Income Taxes (Topic 740): Intra-Entity Transfer of Assets Other than Inventory, which requires the recognition of the income tax consequences of an intra-entity transfer of an asset, other than inventory, when the transfer occurs. ASU 2016-16 is effective for interim and annual periods beginning after December 15, 2018, with early adoption permitted.\nIn February 2016, the FASB issued ASU 2016-02, Leases, which will amend current lease accounting to require lessees to recognize (i) a lease liability, which is a lessee's obligation to make lease payments arising from a lease, measured on a discounted basis, and (ii) a right-of-use asset, which is an asset that represents the lessee's right to use, or control the use of, a specified asset for the lease term. ASU 2016-02 does not significantly change lease accounting requirements applicable to lessors; however, certain changes were made to align, where necessary, lessor accounting with the lessee accounting model. This standard will be effective for fiscal years beginning after December 15, 2018, including interim periods within those fiscal years.\nManagement has considered all recent accounting pronouncements issued since and their potential effect on our financial statements. The Company's management believes that these recent pronouncements will not have a material effect on the Company's consolidated financial statements.\nOther recent accounting pronouncements issued by the FASB, including its Emerging Issues Task Force, the American Institute of Certified Public Accountants, and the Securities and Exchange Commission did not or are not believed by management to have a material impact on the Company's present or future financial statements. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nThe follow discussion about our market risk disclosures involves forward-looking statements. Actual results could differ from those projected in the forward-looking statements. We are exposed to market risk related to changes in interest rates and foreign currency exchange rates. We do not use derivative financial instruments for speculative or trading purposes.\nInterest Rate Sensitivity\nWe have no significant interest-bearing assets and our convertible promissory notes and short-term loans are fixed rate securities. Our current exposure to market risk for changes in interest rates relates primarily to the interest income generated by our cash deposits in banks and the fair value of our invested securities. Although we do not believe that interest rate has had a material impact on our financial position or results of operations to date, increase in interest rates in the future could increase interest cost on our new debt and could adversely impact our ability to refinance existing debt and limit our acquisition and development activities.\nForeign Currency Exchange Risk\nWe currently have no significant exposure to foreign exchange risk.\nInflation Risk\nInflationary factors such as increases in the costs to acquire advertising rights and overhead costs may adversely affect our operating results. Although we do not believe that inflation has had a material impact on our financial position or results of operations to date, a high rate of inflation in the future may have an adverse effect on our ability to maintain current levels of gross margin and selling, general and administrative expenses as a percentage of revenues if the selling prices of our services do not increase with these increased costs. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nConsolidated Financial Statements\nThe financial statements required by this item begin on page hereof. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone. ITEM 9A. CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nOur management is responsible for establishing and maintaining disclosure controls and procedures that are designed to ensure that information required to be disclosed in our reports under the Securities Exchange Act of 1934 (the Exchange Act) is recorded, processed, summarized and reported within the time periods specified in the rules and forms of the SEC, and that such information is accumulated and communicated to our management, including our Chief Executive Officer and Chief Financial Officer, as appropriate, to allow timely decisions regarding required disclosure based closely on the definition of disclosure controls and procedures as defined in Rules 13a-15(e) and 15d-15(e) under the Exchange Act. In designing and evaluating the disclosure controls and procedures, management recognized that any controls and procedures, no matter how well designed and operated, can provide only reasonable assurance of achieving the desired control objectives, and management necessarily was required to apply its judgment in evaluating the cost-benefit relationship of possible controls and procedures.\nAt the end of the period covered by this Annual Report, we conducted an evaluation, under the supervision and with the participation of our management, including our Chief Executive Officer and Chief Financial Officer, of the effectiveness of the design and operation of our disclosure controls and procedures. Based upon the foregoing, our Chief Executive Officer and Chief Financial Officer concluded that, as of June 30, 2022, the disclosure controls and procedures of our Company were not effective to ensure that the information required to be disclosed in our Exchange Act reports was recorded, processed, summarized and reported on a timely basis.\nThe Company is undertaking to improve its internal control over financial reporting and improve its disclosure controls and procedures. As of June 30, 2022, we had identified the following material weaknesses which still exist through the date of this report:\nAs of June 30, 2022 and as of the date of this report, we did not maintain effective controls over the control environment. Specifically, the Board does not currently have a director who qualifies as an audit committee financial expert as defined in Item 407(d)(5)(ii) of Regulation S-K. The Company does not have sufficient written policies and procedures for accounting and financial reporting with respect to the requirements and application of both US GAAP and SEC guidelines. Additionally, because of the size of the Companys administrative staff, controls related to the segregation of certain duties have not been developed and the Company has not been able to adhere to them. Since these entity level programs have a pervasive effect across the organization, management has determined that these circumstances constitute a material weakness.\nManagements Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Exchange Act Rule 13a-15(f). The design of any system of controls is based in part upon certain assumptions about the likelihood of future events, and there can be no assurance that any design will succeed in achieving its stated goals under all potential future conditions, regardless of how remote. All internal control systems, no matter how well designed, have inherent limitations. Because of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation.\nWe carried out an evaluation, under the supervision and with the participation of our Chief Executive Officer and Chief Financial Officer, of the effectiveness of our internal controls over financial reporting as of June 30, 2022. Based on this assessment, management believes that, as of June 30, 2022, we did not maintain effective controls over the financial reporting control environment. Specifically, the Board does not currently have a director who qualifies as an audit committee financial expert as defined in Item 407(d)(5)(ii) of Regulation S-K. Further, because of the limited size of its administrative support staff, and due to the financial constraints on the Company, management has not been able to develop or implement controls related to the segregation of duties for purposes of financial reporting. Because of these material weaknesses, management has concluded that we did not maintain effective internal control over financial reporting as of June 30, 2022, based on the criteria established in the 2013 Internal Integrated Framework issued by COSO.\nNo Attestation Report by Independent Registered Accountant\nThe effectiveness of our internal control over financial reporting as of June 30, 2022 has not been audited by our independent registered public accounting firm by virtue of our exemption from such requirement as a smaller reporting company.\nChanges in Internal Controls over Financial Reporting\nThere were no changes in internal controls over financial reporting that occurred during the quarter ended June 30, 2022, which have materially affected, or are reasonably likely to materially affect, our internal controls over financial reporting. ITEM 9B. OTHER INFORMATION\nNot applicable\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nDirectors and Executive Officers\nThe following table sets forth the names, ages and positions held with respect to each Director and Executive Officer of the Company as of the date of this Annual Report.\nName Age Position Director Since\nRonald Jones Chief Executive Officer, Chief Financial Officer, Secretary and Chairperson of the Board June, 2021\nEach Director serves until our 2023 annual stockholders meeting and until their respective successors are duly elected and qualified or earlier resignation or removal.\nRonald Jones\nMr. Jones was in the office furniture liquidation and auction for 17 years. Mr. Jones retired in 2017 and remains retired but for his investing activities, including his role as officer in two shell companies.\nIdentification of Certain Significant Employees\nWe have no employees who are not executive officers, but who are expected to make a significant contribution to our business.\nFamily Relationships\nThere are no family relationships between any directors or officers of the Company.\nInvolvement in Certain Legal Proceedings\nTo the best of our knowledge, none of our directors or executive officers has, during the past ten years:\n1. had any bankruptcy petition filed by or against any business of which such person was a general partner or executive officer either at the time of the bankruptcy or within two years prior to that time;\n2. been convicted in a criminal proceeding or is a named subject to a pending criminal (excluding traffic violations and other minor offenses);\n3. been subject to any order, judgment, or decree, not subsequently reversed, suspended or vacated, of any court of competent jurisdiction, permanently or temporarily enjoining, barring, suspending or otherwise limiting his involvement in any type of business, securities, futures, commodities or banking activities; or\n4. been found by a court of competent jurisdiction (in a civil action), the Securities and Exchange Commission or the Commodity Futures Trading Commission to have violated a federal or state securities or commodities law, and the judgment has not been reversed, suspended, or vacated.\nCompliance with Section 16(a) of the Exchange Act\nSection 16(a) of the Securities Exchange Act of 1934, as amended, requires our executive officers, directors and beneficial owner of more than 10% of a registered class of our equity securities to file with the Securities and Exchange Commission statements of ownership and changes in ownership. The same persons are required to furnish us with copies of all Section 16(a) forms they file. We believe that, during fiscal 2018, all of our executive officers, directors and beneficial owner of more than 10% of a registered class of our equity securities complied with the applicable filing requirements.\nIn making these statements, we have relied upon examination of the copies of all Section 16(a) forms provided to us and the written representations of our executive officers, directors and beneficial owner of more than 10% of a registered class of our equity securities.\nCode of Business Conduct and Ethics\nThe Board does not have a formal Code of Conduct and Ethics.\nCommittees of Board of Directors\nThere are currently no committees of the Board of Directors. Our board of directors is of the view that it is appropriate for us not to have a standing nominating or audit committee because the current size of our board of directors does not facilitate the establishment of a separate committee. Our board of directors has performed, and will perform adequately, the functions of any specific committee.\nBoard Oversight of Risk\nOur Board of Directors recognizes that, although risk management is a primary responsibility of the Company's management, the Board plays a critical role in oversight of risk. The Board, in order to more specifically carry out this responsibility, has assigned certain task focusing on reviewing different areas including strategic, operational, financial and reporting, compensation, compliance, corporate governance and other risks to the relevant Board Committees as summarized above. Each Committee then reports to the full Board ensuring the Board's full involvement in carrying out its responsibility for risk management. ITEM 11. EXECUTIVE COMPENSATION\nSummary Compensation Table\nThe following table sets forth information concerning all compensation awarded to, earned by or paid during fiscal years 2022 and 2021, to the Named Executive Officers:\nSUMMARY COMPENSATION TABLE\nName and\nPrincipal\nPosition\nYear Salary\n($)\nBonus\n($)\nStock\nAwards\n($)(3)\nOption\nAwards\n($)\nNon-Equity\nIncentive Plan Compensation\n($)\nNonqualified\nDeferred\nCompensation\nEarnings ($)\nAll Other\nCompensation ($)\nTotal\n($)\nRonald Jones 0 0\nCEO Director (1) 0 0\nOmar Aamar 0 0\nformer President and CEO (2) 0 0\nHosmich Aamar 0 0\nformer Secretary (2) 0 0\n(1) Appointed June 2021\n(2) Resigned June 2021\n(3)\nAs required by SEC rules, amounts in the column \"Stock Awards\" present the aggregate grant date fair value of awards made each year computed in accordance with Financial Accounting Standards Board (\"FASB\") Accounting Standards Codification™ 718 Compensation-Stock Compensation (\"FASB ASC 718\"). The grant date fair value of each of the executives' award is measured based on the closing price of our common stock on the date of grant.\nThese amounts do not reflect whether the recipient has actually realized or will realize a financial benefit from the awards. Under generally accepted accounting principles, compensation expense with respect to stock awards granted to our employees, executives and directors is generally recognized over the requisite services period. The SEC's disclosure rules previously required that we present stock award information based on the amount recognized during the corresponding year for financial statement reporting purposes with respect to these awards. However, the recent changes in the SEC's disclosure rules require that we now present stock award amounts using the grant date fair value of the awards granted during the corresponding year.\nCurrently, we do not provide any employees, including our named executive officers any company sponsored retirement benefits.\nEmployment Agreements\nThe Company has not entered into employment agreements with our Named Executive Officers.\nGrants of Plan-Based Awards\nNone.\nOutstanding Equity Awards at Fiscal Year-End\nNone\nDirector Compensation\nCompensation paid to the Directors of the Company in 2022 and 2021 is disclosed above.\nAll the compensation packages for each of directors are proposed by an executive and approved by the Board of Directors. Director compensation packages in 2022 may or will be adopted and will generally consist of cash compensation and long-term incentive equity compensation.\nLimitation of Liability and Indemnification of Officers and Directors\nOur bylaws provide for the indemnification of our present and prior directors and officers or any person who may have served at our request as a director or officer of another corporation in which we own shares of capital stock or of which we are a creditor, against expenses actually and necessarily incurred by them in connection with the defense of any actions, suits or proceedings in which they, or any of them, are made parties, or a party, by reason of being or having been director(s) or officer(s) of us or of such other corporation, in the absence of negligence or misconduct in the performance of their duties. This indemnification policy could result in substantial expenditure by us, which we may be unable to recoup.\nInsofar as indemnification by us for liabilities arising under the Securities Exchange Act of 1934, as amended, may be permitted to our directors, officers and controlling persons pursuant to provisions of the Articles of Incorporation and Bylaws, or otherwise, we have been advised that in the opinion of the SEC, such indemnification is against public policy and is, therefore, unenforceable. In the event that a claim for indemnification by such director, officer or controlling person of us in the successful defense of any action, suit or proceeding is asserted by such director, officer or controlling person in connection with the securities being offered, we will, unless in the opinion of our counsel the matter has been settled by controlling precedent, submit to a court of appropriate jurisdiction the question whether such indemnification by us is against public policy as expressed in the Act and will be governed by the final adjudication of such issue.\nAt the present time, there is no pending litigation or proceeding involving a director, officer, employee or other agent of ours in which indemnification would be required or permitted. We are not aware of any threatened litigation or proceeding which may result in a claim for such indemnification. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe following tables set forth information as of June 30, 2022, regarding the beneficial ownership of our common stock (a) by each stockholder who is known by the Company to own beneficially in excess of 5% of our outstanding common stock; (b) by each of the Company's officers and directors; (c) and by the Company's officers and directors as a group. Except as otherwise indicated, all persons listed below have (i) sole voting power and investment power with respect to their shares of common stock, except to the extent that authority is shared by spouses under applicable law, and (ii) record and beneficial ownership with respect to their shares of stock.\nThe address for the director and named executive officers is 112 North Curry Street, Carson City, NV, 89703.\nName and Address of Beneficial Owner\nTitle of Class\nAmount and Nature of\nBeneficial Ownership\nPercentage of Class(1)\nRonald Jones (1) (2)\nCommon Stock\n3,900,000\nDirect\n86.6%\nDirectors and Executive Officers As A Group (1 person)\nCommon Stock\n3,900,000\n86.6%\n(1) Applicable percentages are based on 4,500,000 shares outstanding, adjusted as required by rules of the SEC. Beneficial ownership is determined under the rules of the SEC and generally includes voting or investment power with respect to securities. Shares of common stock subject to options, warrants and convertible notes currently exercisable or convertible, or exercisable or convertible within 60 days are deemed outstanding for computing the percentage of the person holding such securities but are not deemed outstanding for computing the percentage of any other person. Unless otherwise indicated in the footnotes to this table, we believe that each of the shareholders named in the table has sole voting and investment power with respect to the shares of common stock indicated as beneficially owned by them.\n(2) Omar Aamar sold his shares of common stock to Global Marketing Services LLC, an entity controlled by Ronald Jones in June 2021.\nSecurities Authorized for Issuance Under Equity Compensation Plans\nNone\nChanges in Control\nThere are no arrangements known to us, including any pledge by any person of our securities, the operation of which may at a subsequent date result in a change in control of the Company. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS AND DIRECTOR INDEPENDENCE\nRelated Party Transactions\nNone\nPromoters and Certain Control Persons\nWe did not have any promoters at any time during the past five fiscal years. ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES\nBF Borgers, CPA PC 5400 West Cedar Avenue Lakewood, CO 80226, is our Principal Independent Registered Public Accountants engaged to audit our financial statements for the fiscal year ended June 30, 2021 and 2020. We currently have no active auditor engaged.\nAudit Fees\nThis category consists of fees for professional services rendered by our principal independent registered public accountant for the audit of our annual financial statements, review of financial statements included in our quarterly reports and services that are normally provided by the independent registered public accounting firms in connection with statutory and regulatory filings or engagements for those fiscal years.\nYear Ended\nJune 30, 2022\nAudit fees:(1) $ 0.00\nAudit related fees: 0.00\nTax fees: 0.00\nAll other fees: 0.00\nTotal $ 0.00\nAudit-Related Fees\nThis category consists of fees for assurance and related services by our principal independent registered public accountant that are reasonably related to the performance of the audit or review of our financial statements and are not reported above under \"Audit Fees\". The services for the fees disclosed under this category include consultations concerning financial accounting and reporting standards.\nTax Fees\nThis category consists of fees for professional services rendered by our principal independent registered public accountant for tax compliance, tax advice, and tax planning.\nAll Other Fees\nThis category consists of fees for services provided by our principal independent registered public accountant other than the services described above.\nPART IV ITEM 15. EXHIBITS, FINANCIAL STATEMENT SCHEDULES\n(a) The following consolidated financial statements are filed as a part of this Form 10-K:\n(i) Reports of Independent Registered Public Accounting Firm - N/A\n(ii) Consolidated Balance Sheets as of June 30, 2022 and 2021\n(iii) Consolidated Statements of Operations and Comprehensive Loss for the years ended June 30, 2022 and 2021\n(iv) Consolidated Statement of Stockholders' Equity for the years ended June 30, 2022 and 2021\n(v) Consolidated Statements of Cash Flows for the years ended June 30, 2022 and 2021\n(vi) Notes to Consolidated Financial Statements\n(b) The following Exhibits are filed as part of this Annual Report on Form 10-K:\nExhibit No.\nDescription\n31.1\nCertification of Chief Executive Officer pursuant to Exchange Act Rules 13a-14(a) and 15d-14(a), as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.*\n31.2\nCertification of Principal Accounting Officer pursuant to Exchange Act Rules 13a-14(a) and 15d-14(a), as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.*\n32.1\nCertification of Chief Executive Officer Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.*\n32.2\nCertification of Principal Accounting Officer Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.*\n101.INS\nXBRL Instance Document\n101.SCH\nXBRL Taxonomy Extension Schema Document\n101.CAL\nXBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF\nXBRL Taxonomy Extension Definition Linkbase Document\n101.LAB\nXBRL Taxonomy Extension Labels Linkbase Document\n101.PRE\nXBRL Taxonomy Extension Presentation Linkbase Document\n* Filed herewith\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nSIGMARENOPRO, INC.\nBy: /s/ Ronald Jones\nRonald Jones\nChief Executive Officer\n(Principal Executive Officer, Principal Financial and Accounting Officer)\nDate: November 30, 2023\nITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nSIGMARENOPRO, INC.\nJUNE 30, 2022\nPAGE\nReport of Independent Registered Public Accounting Firm - N/A\nBalance Sheets at June 30, 2022 and 2021\nStatements of Operations for the year ended June 30, 2022 and 2021\nStatements of Stockholders Deficit for the year ended June 30, 2022 and 2021\nStatements of Cash Flows for the year ended June 30, 2022 and 2021\nNotes to Financial Statements\nSigmaRenoPro, Inc.\nBALANCE SHEETS\nJune 30,\nJune 30,\nASSETS\nCurrent assets\nCash held in trust $ - $ -\nAdvances - -\nPrepaid expenses - -\nTotal current assets - -\nTotal assets $ - $ -\nLIABILITIES AND STOCKHOLDERS' EQUITY\nCurrent liabilities\nDue to related parties $ - $ -\nShort term fund - -\nAccounts payable - -\nTotal current liabilities - -\nCommitments and contingencies - -\nStockholders' equity\nCommon stock: $0.001 par value, 75,000,000 shares authorized, 4,500,000 and 4,500,000 shares issued and outstanding as of June 30, 2022 and June 30, 2021, respectively 4,500 4,500\nAdditional paid-in capital 103,770 103,770\nAccumulated deficit (108,270 ) (108,270 )\nTotal stockholders equity (deficit) - -\nTotal liabilities and stockholders equity $ - $ -\nThe accompanying notes are an integral part of these financial statements.\nSigmaRenoPro, Inc.\nSTATEMENTS OF OPERATIONS\nFor the year ended June 30,\nRevenue $ - $ -\nExpenses\nGeneral and Administrative Expenses -\nProfessional fees - 25,588\nShare transfer agent fee -\nTotal expenses - 25,551\nNet (loss) $ - $ (25,551 )\nBasic and diluted loss per common share $ (0.0000 ) $ (0.0000 )\nWeighted average number of common shares outstanding - basic and diluted 4,500,000 4,500,000\nThe accompanying notes are an integral part of these financial statements.\nSigmaRenoPro, Inc.\nSTATEMENTS OF STOCKHOLDERS' DEFICIT\nFor the years ended June 30, 2022 and 2021\nCommon Stock Additional\nPaid-in\nAccumulated Total\nStockholders'\nShares Amount Capital Deficit Equity\nBalance at June 30, 2020 4,500,000 $ 4,500 $ 68,900 $ (82,719 ) $ (9,319 )\nNet loss for the year ended June 30, 2021 - - 34,870 (25,551 ) 9,319\nBalance at June 30, 2021 4,500,000 $ 4,500 $ 103,770 $ (108,270 ) $ -\nNet loss for the year ended June 30, 2022 - - - - -\nBalance at June 30, 2022 4,500,000 $ 4,500 $ 103,770 $ (108,270 ) $ -\nThe accompanying notes are an integral part of these financial statements.\nSigmaRenoPro, Inc.\nSTATEMENT OF CASH FLOWS\nFor the years ended June 30,\nCash flows from operating activities\nNet loss\n$ -\n$ (25,551 )\nChanges in Operating Assets and Liabilities:\nIncrease (Decrease) in advances\n-\n-\n(Increase) Decrease in prepaid expenses\n-\nIncrease (Decrease) in accounts payable\n-\n(5,607 )\nIncrease (Decrease) due to related party\n-\n(6,000 )\nIncrease (Decrease) in short term fund\n-\n(4,116 )\nNet cash used in operating activities\n-\n(40,436 )\nCash flows from investing activities\nNet cash provided by investing activities\n-\n-\nCash flows from financing activities\nNet cash provided by financing activities\n-\n34,870\nNet increase in cash, cash equivalents, and restricted cash\n-\n(5,566 )\nCash, cash equivalents, and restricted cash at beginning of year\n-\n5,566\nCash, cash equivalents, and restricted cash at end of year\n$ -\n$ -\nSupplemental cash flow information:\nCash paid for interest\n$ -\n$ -\nCash paid for income taxes\n$ -\n$ -\nThe accompanying notes are an integral part of these financial statements.\nSIGMARENOPRO, INC.\nNOTES TO FINANCIAL STATEMENTS\nJUNE 30, 2022\nNOTE A - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nA summary of significant accounting policies of SigmaRenoPro, Inc. (the Company) is presented to assist in understanding the Companys financial statements. The accounting policies presented in these footnotes conform to accounting principles generally accepted in the United States of America and have been consistently applied in the preparation of the accompanying financial statements. These financial statements and notes are representations of the Companys management who are responsible for their integrity and objectivity. The Company has not realized revenues from its planned principal business purpose.\nOrganization, Nature of Business and Trade Name\nSigmaRenoPro, Inc. (the Company) was incorporated in the State of Nevada on June 16, 2017. SigmaRenoPro, Inc. intends to provide home project owners with contractor match making services in the U.S. Their customized match making service helps homeowners converge with professional contractors. They also intend to create a collection of articles intended to help homeowners with home project information, including how to outline project requirements, select the right contractor, interview contractors, draw up a project contract and settle disputes with contractors. Their service is deigned to be free for all homeowners to use and post their projects and plan to build a network of professionally-skilled contractors who provide a broad array of construction and renovation services for everything from changing light fixtures to complete kitchen renovation, and from housecleaning services to new construction.\nThe Companys principal office is at 112 North Curry Street, Carson City, NV, 89703, USA .\nThe Companys activities are subject to significant risks and uncertainties including failing to secure additional funding to operationalize the Companys website and apps before another company develops similar websites or apps.\nBasis of Presentation\nThe accompanying financial statements have been prepared in accordance with generally accepted accounting principles in the United States of America, and pursuant to the rules and regulations of the Securities and Exchange Commission (the SEC) and reflect all adjustments, consisting of normal recurring adjustments, which management believes are necessary to fairly present the financial position, results of operations and cash flows at June 30, 2022 and for the related periods presented.\nProperty and Equipment\nProperty and equipment are carried at cost. Expenditures for maintenance and repairs are charged against operations. Renewals and betterments that materially extend the life of the assets are capitalized. When assets are retired or otherwise disposed of, the cost and related accumulated depreciation are removed from the accounts, and any resulting gain or loss is reflected in income for the period.\nDepreciation is computed for financial statement purposes on a straight-line basis over estimated useful lives of the related assets. The estimated useful lives of depreciable assets are:\nEstimated Useful Lives\nOffice Equipment 5-10 years\nCopier 5-7 years\nVehicles 5-10 years\nDepreciation is computed under the modified accelerated cost recovery system. For financial statements purposes, depreciation is computed under the straight-line method.\nThe Company has been in the developmental stage since inception and has no operations to date. The Company currently does not have any property and equipment. The above accounting policies will be adopted upon the Company maintains property and equipment.\nCash and Cash Equivalents\nFor purposes of the statement of cash flows, the Company considers all short-term debt securities purchased with maturity of three months or less to be cash equivalents.\nRecent Accounting Pronouncements\nWe have reviewed all the recently issued, but not yet effective, accounting pronouncements and we do not believe any of these pronouncements will have a material impact on the Company.\nRevenue recognition\nThe Companys revenue recognition policies are in compliance with FASB ASC 605-35 Revenue Recognition. Revenue is recognized when a formal arrangement exists, the price is fixed or determinable, all obligations have been performed pursuant to the terms of the formal arrangement and collectability is reasonably assured. The Company recognizes revenues on sales of its services, based on the terms of the customer agreement. The customer agreement takes the form of either a contractor or a customer purchase order and each provides information with respect to the service being sold and the sales price. If the customer agreement does not have specific delivery or customer acceptance terms, revenue is recognized at the time the service is provided to the customer.\nFair Value of Financial Instruments\nThe Company applies fair value accounting for all financial assets and liabilities and non-financial assets and liabilities that are recognized or disclosed at fair value in the financial statements on a recurring basis. The Company defines fair value as the price that would be received from selling an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. When determining the fair value measurements for assets and liabilities, which are required to be recorded at fair value, the Company considers the principal or most advantageous market in which the Company would transact and the market-based risk measurements or assumptions that market participants would use in pricing the asset or liability, such as risks inherent in valuation techniques, transfer restrictions and credit risk. Fair value is estimated by applying the following hierarchy, which prioritizes the inputs used to measure fair value into three levels and bases the categorization within the hierarchy upon the lowest level of input that is available and significant to the fair value measurement:\nLevel 1 - Quoted prices in active markets for identical assets or liabilities.\nLevel 2 - Observable inputs other than quoted prices in active markets for identical assets and liabilities, quoted prices for identical or similar assets or liabilities in inactive markets, or other inputs that are observable or can be corroborated by observable market data for substantially the full term of the assets or liabilities.\nLevel 3 - Inputs that are generally unobservable and typically reflect managements estimate of assumptions that market participants would use in pricing the asset or liability.\nIn accordance with the fair value accounting requirements, companies may choose to measure eligible financial instruments and certain other items at fair value. The Company has not elected the fair value option for any eligible financial instruments.\nAs of June 30, 2022, the carrying value of loans that are required to be measured at fair value, approximated fair value due to the short-term nature and maturity of these instruments.\nAdvertising\nAdvertising expenses are recorded as general and administrative expenses when they are incurred.\nUse of Estimates\nThe preparation of financial statements in accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. A change in managements estimates or assumptions could have a material impact on SigmaRenoPro, Inc.s financial condition and results of operations during the period in which such changes occurred. Actual results could differ from those estimates. SigmaRenoPro, Inc.s financial statements reflect all adjustments that management believes are necessary for the fair presentation of their financial condition and results of operations for the periods presented.\nCapital Stock\nThe Company has authorized Seventy Five Million (75,000,000) shares of common stock with a par value of $0.001. Four Million Five Hundred and Thousand (4,500,000) shares of common stock were issued and outstanding as of June 30, 2022.\nIncome Taxes\nThe Company recognizes the tax effects of transactions in the year in which such transactions enter into the determination of net income, regardless of when reported for tax purposes.\nNOTE B - GOING CONCERN\nThe Company's financial statements are prepared using accounting principles generally accepted in the United States of America applicable to a going concern, which contemplates the realization of assets and liquidation of liabilities in the normal course of business. However, the Company does not have an established source of revenues sufficient to cover its operating costs and to allow it to continue as a going concern.\nUnder the going concern assumption, an entity is ordinarily viewed as continuing in business for the foreseeable future with neither the intention nor the necessity of liquidation, ceasing trading, or seeking protection from creditors pursuant to laws or regulations. Accordingly, assets and liabilities are recorded on the basis that the entity will be able to realize its assets and discharge its liabilities in the normal course of business.\nThe ability of the Company to continue as a going concern is dependent upon its ability to successfully accomplish the plan described in the Business paragraph and eventually attain profitable operations. The accompanying financial statements do not include any adjustments that may be necessary if the Company is unable to continue as a going concern.\nDuring the next year, the Companys foreseeable cash requirements will relate to continual development of the operations of its business, maintaining its good standing and making the requisite filings with the Securities and Exchange Commission, and the payment of expenses associated with app development. The Company may experience a cash shortfall and be required to raise additional capital.\nHistorically, it has mostly relied upon internally generated funds and funds from the sale of shares of stock to finance its operations and growth. Management may raise additional capital through future public or private offerings of the Companys stock or through loans from private investors, although there can be no assurance that it will be able to obtain such financing. The Companys failure to do so could have a material and adverse effect upon it and its shareholders.\nIn the past year, the Company funded operations by using cash proceeds received through the issuance of common stock. For the coming year, the Company plans to continue to fund the Company through debt and securities sales and issuances until the company generates enough revenues through the operations as stated above.\nNOTE C - COMMON STOCK\nOn June 2017, Company issued 1,150,000 Common Shares to the director of the company at $0.008 per share for cash proceeds of $9,200.\nOn June 2017, Company issued 1,150,000 common shares to the secretary of the company at $0.008 per share for cash proceeds of $9,200.\nOn April 2018, Company issued 560,000 common shares to the various shareholder of the company at $0.025 per share for cash proceeds of $14,000.\nOn May 2018, Company issued 640,000 common shares to the various shareholder of the company at $0.025 per share for cash proceeds of $16,000.\nOn June 2018, Company issued 1,000,000 common shares to the various shareholder of the company at $0.025 per share for cash proceeds of $25,000.\nThere were 4,500,000 and 4,500,000 shares of common stock issued and outstanding as of June 30, 2022 and 2021 respectively.\nNOTE D - RELATED PARTY TRANSACTIONS\nNONE\nNOTE E - TRUST ACCOUNT\nTrust account (cash equivalent) is held by a law firm which provides periodic statement and pay the bills on behalf of SigmaRenoPro. Law firm charges fees for managing the trust account\nNOTE F - PREPAID EXPENSES\nPrepaid expenses for the year ending June 30, 2022 consist of $0 towards share transfer fee expenses paid to NATCO, $0 towards registered agent fees and June 30, 2022 consists of $0 towards SEC filing charges and accounts book-keeping charges.\nPrepaid expenses as of June 30, 2022 and 2021 is $0 and $0 respectively.\nNOTE G - INCOME TAXES\nFor the period ended June 30, 2022, the Company has incurred net losses and therefore, has no tax liability. The net deferred tax asset generated by the loss carry-forward has been fully reserved. The cumulative net operating loss carry-forward is approximately $108,270 at June 30, 2022 and will expire beginning in the year 2037.\nThe provision for income taxes differs from the amounts which would be provided by applying the statutory federal income tax rate of 21% and 21% to the net loss before provision for income taxes as follows:\nFor the year ended June 30, 2022 For the year ended June 30, 2021\nIncome tax expense (benefit) at statutory rate $ (5,800 ) $ (5,800 )\nChange in valuation allowance 5,800 5,800\nIncome tax expense $ - $ -\nNet deferred tax assets consist of the following components as of June 30, 2022:\nJune 30, 2022 June 30, 2021\nGross deferred tax asset $ 17,371 $ 17,371\nValuation allowance (17,371 ) (17,371 )\nNet deferred tax asset $ - $ -\nDue to the change in ownership provisions of the Tax Reform Act of 1986, net operating loss carry forwards of approximately $108,270 for federal income tax reporting purposes could be subject to annual limitations. Should a change in ownership occur, net operating loss carry forwards may be limited as to use in future years.\nThe Company has no uncertain tax positions that require the Company to record a liability.\nThe Company had no accrued penalties and interest related to taxes as of June 30, 2022."
}