{
    "cik": "1715433",
    "company": "Leader Capital Holdings Corp.",
    "filing_type": "10-K",
    "filing_date": "2022-12-14",
    "period_of_report": "2022-08-31",
    "sic": "7371",
    "state_of_inc": "NV",
    "state_location": "F5",
    "fiscal_year_end": "0831",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1715433/0001493152-22-035440-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1715433/000149315222035440/form10-k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1715433/0001493152-22-035440.txt",
    "filename": "1715433_10K_2022_0001493152-22-035440.htm",
    "content": "Item 1. Business.\nBusiness Overview\nLeader Capital Holdings Corp. is an early stage technology company that conducts its operations through its wholly owned subsidiaries, Leader Financial Group Limited, a Seychelles corporation incorporated on March 6, 2017 (LFGL), and JFB Internet Service Limited, a Hong Kong corporation incorporated on July 6, 2017 (JFB).\nThrough LFGL, we act as the service provider for a mobile application investment platform that is owned by JFB. The platform connects investors with financial service providers in an effort to sharpen operational efficiency and seeks to address customer demands for more innovative services. It is a ready-made application created to meet the needs of financial service providers, especially trust companies and insurance companies. The platform is customizable and each financial institution can adjust the platform to better suit their clients needs.\nThe Company had an agreement with a third party whereby we authorized the third party to use our investment platform and related applications until December 31, 2020 for a fee. Both parties decided to terminate the agreement at maturity.\nThe Company has developed a new, more comprehensive mobile application, the FinMaster App (the App). The FinMaster App intends to offer one-stop solution for multi-facet financial services. Key services include real-time Taiwan stock market quotes, financial industry information and news, social media activities, on-line live broadcast, A.I. stock selection and other features. With more than 350,000 downloads of the FinMaster App, the Company continues to collect data as well as user feedback to enhance current App features and fine tune research and development (R&D) plans to optimize customer experience.\nThe key features of the FinMaster App are:\n● Real-time Taiwan stock market quotes; delayed Hong Kong and U.S., stock market quotes; and financial market news feed\n● AI Stock Selection Tools: Day Trading Analysis, Portfolio Health Check, Institutional Trading Tactics, AI Smart Screening Tools\n● Instant news feed and quotes of pre-defined stocks under Watchlist\n● Live Streaming sessions from the industry expert analysts\n● Discussion Forums for users and experts direct communication\n● In-App Messaging: chats, audio, and video calls between members\n● Token System and Point Reward Redemption Corner\nOther key features are under development, such as:\n● Online securities account-opening and online trading\n● On-line Leader FinTech Academy programs\n● AI Futures Selection and Screening Tools\n● AI Options Selection and Screening Tools\n● In-App Messaging: chats, audio, and video calls\nAcquisition of Nice Products Inc.\nOn August 17, 2020, the Company, through its wholly-owned subsidiary JFB Internet Service Limited, a company incorporated and existing under the laws of Hong Kong (the Buyer), acquired all of the issued and outstanding capital stock (the Acquisition) of Nice Products Inc., a company organized under the laws of the British Virgin Islands and the Companys software ODM developer of the FinMaster App (NPI), pursuant to the terms and conditions of that certain Stock Purchase Agreement, dated as of August 17, 2020 (the Purchase Agreement), among the Company, the Buyer, NPI, the selling shareholders of NPI identified therein (each a Seller, and, collectively, the Sellers) and the representative of the Sellers identified therein (the Sellers Representative). The aggregate purchase price for the acquisition was $4,850,000, less certain discounts, expenses and reductions for outstanding NPI debt owed to the Company and/or its affiliates. The net purchase price for the acquisition was $3,506,042, payable in 8,415,111 shares of the Companys common stock to the Sellers in accordance with their respective pro rata percentage.\nUpon the consummation of the acquisition, among other things, the Sellers: (a) resigned from their positions as directors and/or officers of NPI, (b) released NPI from any claims and (c) entered into employment agreements with the Buyer. Jun-Yuan Chen, a Seller and the Sellers Representative under the Purchase Agreement, was already an employee of the Buyer prior to the acquisition, and therefore, did not enter into an employment agreement with the Buyer at the closing of the acquisition.\nIn accordance with the terms of the Purchase Agreement, for a period of 5 years from the Closing Date, the Sellers agreed to not compete with NPIs business in the following territories: (a) Greater China (including Hong Kong, Macau and Taiwan) and (b) any other country or other territory in which NPI or the Buyer has provided services, offered or promoted services or otherwise conducted business at any time in the past 2 years. During the same 5 year period, the Sellers are also subject to customary non-solicitation and non-disparagement obligations.\nIn addition, the Sellers agreed to indemnify the Company, the Buyer, and each of their affiliates (including, after the closing, NPI), subject to certain limitations, for any Losses (as defined in the Purchase Agreement) arising out of breaches by the Sellers of their respective covenants and certain other matters specified in the Purchase Agreement. Subject to certain exclusions, such right to indemnification will be available only after the aggregate amount of indemnifiable Losses exceeds $1,000.\nAs a result of the acquisition, the Company now owns, indirectly through the Buyer, 100% of NPI. NPI, through its wholly-owned subsidiaries, LOC Weibo Co., Ltd. (LOC) and Beijing DataComm Cloud Media Technology Co., Ltd. (BJDC), companies organized under the laws of the Republic of China (ROC or Taiwan) and the laws of the Peoples Republic of China (PRC or China), respectively, engages primarily in the development of ecological-system applications, integration of big data and promotion of OTT applications. As a result of the acquisition, our FinMaster App was launched to the market in a timely and efficient manner and clients on this open platform are served more effectively and satisfactorily. Based on the successful development of our FinMaster App, LOC and BJDC jointly accumulated in-depth knowledge of FinTech App development, including the marketing expertise built up and the perfect allocation of the Companys resources. We believe LCHD, through LOC and BJDC will further conclude more customized App contracts to help the clients to incubate the avant-garde Apps to expand their businesses efficiently and effectively.\nCompetition\nOur market is competitive, and we expect competition in our market to increase as existing competitors enhance and expand their product and service offerings and as new participants enter the market. Increased competition may result in price reductions, reduced profitability and loss of market share. We cannot ensure that we will be able to compete successfully against existing or future competitors. Some of our customers and companies with which we have strategic relationships may also become competitors.\nMany of our current and potential competitors have greater financial, technical, marketing, service and other resources than we have. As a result, these companies may be able to offer lower prices, additional products or services, or other incentives that we cannot match or offer. These competitors may be in a stronger position to respond more quickly to new technologies and may be able to undertake more extensive marketing campaigns. We believe they may also pursue and adopt more aggressive pricing policies and make more attractive offers to potential customers, employees and strategic partners. In addition, competitors with greater financial resources may make strategic acquisitions to increase their ability to gain market share or improve the quality or marketability of their products. Furthermore, we face challenges in selling our product to large companies in the process industries that have internally developed their own proprietary software solutions.\nToday in Taiwans stock information App market, the competition is very keen. It is estimated that Mitake App by Mitake Information Corporation and Yahoo Kimo Stock Market by Yahoo Finance, both have more than one million downloads; other Apps like ANUE App by ANUE.COM and Inc, Mr. Investment by Yuanta Financial Holding, both have more than half a million downloads. The Company keeps fine-tuning the marketing strategy and reaping the synergy by partnership with more diversified marketing channels to bring in more downloads.\nHowever, most of our competitors only provide direct services to a single company, and users can only choose that companys App. The FinMaster App has integrated various functions such as real time stock streaming, financial news, discussion forum, and voice and video call in one application, which is different from most of its competitors. We believe that these integrated functions provide us with an advantage over our competition.\nMarketing\nThe FinMaster App is marketed mainly through word of mouth. Currently, we also employ Facebook, and YouTube as our marketing tools. During the past fiscal years 2022 and 2021, we also broadcasted commercials on various television stations in Taiwan to promote the FinMaster App. We also rely on our clients and business contacts, such as insurance brokerage houses, real estate agent firms, social network groups, and securities firms to encourage their clients to download the FinMaster App.\nIntellectual Property\nThe protection of our technology and intellectual property is an important component of our success. We rely on intellectual property laws, including trade secrets, copyright, patent and trademark laws in the U.S. and abroad. We have not patented our proprietary technology in order to keep our technology architecture, trade secrets, and engineering roadmap private. We may in the future file patent applications; however, such applications may not result in the issuance of any patents, and any issued patents may not actually provide adequate defensive protection or competitive advantages to us. Our ability to continually develop new intellectual property and deliver new functionality quickly serves to protect us against our competitors.\nEmployees\nAs of December 8, 2022, the Company had 34 employees.\nCorporate Information\nWe were incorporated in the State of Nevada on March 22, 2017. Our principal executive office is located at Room 2708-09, Metropolis Tower, 10 Metropolis Drive, Hung Hom, Hong Kong.\nGovernment Regulation and Approvals\nThe Company offers its clients a mobile application that allows their customers to review their asset portfolio(s) and communicate their investment decisions with our clients in real-time. Neither of our Apps are a trading platform, broker dealer or exchange, and therefore we do not expect to be subject to regulatory oversight by the SEC, Financial Industry Regulatory Authority (FINRA) or other financial regulatory agencies. We are not aware of any governmental regulations or approvals required for the marketing or use of the Apps or the services provided.\nEmerging Growth Company\nThe Company is an emerging growth company, as defined in the Jumpstart Our Business Startups Act of 2012 (the JOBS Act), and may take advantage of certain exemptions from various reporting requirements that are applicable to other public companies that are not emerging growth companies including, but not limited to, not being required to comply with the auditor attestation requirements of section 404(b) of the Sarbanes-Oxley Act, and exemptions from the requirements of Sections 14A(a) and (b) of the Exchange Act to hold a nonbinding advisory vote of stockholders on executive compensation and any golden parachute payments not previously approved.\nThe Company has elected to use the extended transition period for complying with new or revised accounting standards under Section 102(b)(1) of the JOBS Act. This election allows us to delay the adoption of new or revised accounting standards that have different effective dates for public and private companies until those standards apply to private companies. As a result of this election, our financial statements may not be comparable to companies that comply with public company effective dates\nWe will remain an emerging growth company until the earliest of (1) August 31, 2024, (2) the last day of the fiscal year in which we have total gross revenue of at least $1.07 billion, (3) the last day of our fiscal year in which we are deemed to be a large accelerated filer as defined in Rule 12b-2 under the Exchange Act (which would occur if the market value of our equity securities that is held by non-affiliates exceeds $700 million as of the last business day of our most recently completed second fiscal quarter), or (4) the date on which we have issued more than $1 billion in nonconvertible debt during the preceding three-year period.\nTo the extent that we continue to qualify as a smaller reporting company, as such term is defined in Rule 12b-2 under the Exchange Act, after we cease to qualify as an emerging growth company, certain of the exemptions available to us as an emerging growth company may continue to be available to us as a smaller reporting company, including: (1) not being required to comply with the auditor attestation requirements of Section 404(b) of the Sarbanes-Oxley Act; (2) scaled executive compensation disclosures; and (3) the requirement to provide only two years of audited financial statements, instead of three years. Item 1A. Risk Factors.\nRisks Related to Our Business\nCOVID-19 Pandemic Update\nOur business continues to be impacted by the COVID-19 pandemic. Significant COVID-19 related restrictions have continued and in some instances, have been significantly tightened, in markets in which we operate, especially (which has been affected more severely in the second and third quarter of 2021 than before). Border controls and travel restrictions, such as those imposed in Taiwan, Hong Kong, and the continuing uncertainty over the extent and timing of the re-opening of the border between Hong Kong and mainland China, have had and may continue to have an adverse effect on our operations. The impact of the pandemic and the measures taken by the relevant governments to contain the disease on the global economy, the economies of the markets in which we operate, and the movement of people have adversely affected, and we expect will continue to adversely affect, the roll out of our business plans and results of operations throughout the fiscal year of 2022 and into fiscal year 2023.\nThe Chinese government may intervene in or influence our operations at any time, which could result in a material change in our operations and significantly and adversely impact the value of our common stock.\nThe PRC government exerts substantial influence, discretion, oversight and control over the manner in which companies incorporated under the laws and regulations of the PRC must conduct their business activities, including activities relating to overseas offerings of securities and/or foreign investments in such companies. We are a Nevada corporation with subsidiaries located in Taiwan, Hong Kong, and mainland China; however, we cannot guarantee that the PRC government will not seek to intervene or influence any of our operations at any time. If we were to become subject to such direct influence, intervention, discretion, oversight or control, including those over overseas offerings of securities (including and/or foreign investments, it may result in a material adverse change in our operations, significantly limit or completely hinder our ability to offer or continue to offer securities to investors and cause the value of our common stock to significantly decline or be worthless, which would materially affect the interests of investors.\nChanges in the political and economic policies of the Chinese government or in relations between China and the United States may materially and adversely affect our business, financial condition, results of operations and the market price of our common stock.\nDue to our operations in China, our business, results of operations, financial condition and prospects may be influenced to a significant degree by economic, political, legal and social conditions in China or changes in government relations between China and the United States or other governments. There is significant uncertainty about the future relationship between the United States and China with respect to trade policies, treaties, government regulations and tariffs. Chinas economy differs from the economies of developed countries in many respects, including with respect to the amount of government involvement, level of development, growth rate, control of foreign exchange and allocation of resources. The Chinese government has implemented various measures to encourage economic development and guide the allocation of resources. Some of these measures may benefit the overall Chinese economy, but may have a negative effect on us. For example, our financial condition and results of operations may be adversely affected by government control over capital investments or changes in tax regulations that are currently applicable to us. In addition, in the past the Chinese government implemented certain measures, including interest rate increases, to control the pace of economic growth. These measures may cause decreased economic activity in China, which may adversely affect our business and results of operations. In July 2021, the Chinese government provided new guidance on China-based companies raising capital outside of China, including through arrangements called variable interest entities (VIEs). In light of such developments, the SEC has imposed enhanced disclosure requirements on China-based companies seeking to register securities with the SEC. Although we do not have a VIE structure, due to our operations in China, any future Chinese, U.S. or other rules and regulations that place restrictions on capital raising or other activities by companies with operations in China could adversely affect our business and results of operations. If the business environment in China deteriorates from the perspective of domestic or international investment, or if relations between China and the United States or other governments deteriorate, the Chinese government may intervene with our operations and our business in China and United States, as well as the market price of our common stock, may also be adversely affected.\nCompliance with Chinas new Data Security Law, Cybersecurity Review Measures (revised draft for public consultation), Personal Information Protection Law, regulations and guidelines relating to the multi-level protection scheme and any other future laws and regulations may entail significant expenses and could materially affect our business.\nChina has implemented new rules relating to data protection, and the new Data Security Law took effect in September 2021. The Data Security Law provides that the data processing activities must be conducted based on data classification and hierarchical protection system for the purpose of data protection and prohibits entities in China from transferring data stored in China to foreign law enforcement agencies or judicial authorities without prior approval by the Chinese government.\nAdditionally, Chinas Cyber Security Law requires companies to take certain organizational, technical and administrative measures and other necessary measures to ensure the security of their networks and data stored on their networks. Specifically, the Cyber Security Law provides that China adopt a multi-level protection scheme (MLPS), under which network operators are required to perform obligations of security protection to ensure that the network is free from interference, disruption or unauthorized access, and prevent network data from being disclosed, stolen or tampered. Under the MLPS, entities operating information systems must have a thorough assessment of the risks and the conditions of their information and network systems to determine the level to which the entitys information and network systems belong-from the lowest Level 1 to the highest Level 5 pursuant to a series of national standards on the grading and implementation of the classified protection of cyber security. The grading result will determine the set of security protection obligations that entities must comply with. Entities classified as Level 2 or above should report the grade to the relevant government authority for examination and approval.\nRecently, the Cyberspace Administration of China has taken action against several Chinese Internet companies in connection with their initial public offerings on U.S. securities exchanges, for alleged national security risks and improper collection and use of the personal information of Chinese data subjects. According to the official announcement, the action was initiated based on the National Security Law, the Cyber Security Law and the Measures on Cybersecurity Review, which are aimed at preventing national data security risks, maintaining national security and safeguarding public interests. On July 10, 2021, the Cyberspace Administration of China published a revised draft of the Cybersecurity Review Measures, expanding the cybersecurity review to data processing operators in possession of personal information of over 1 million users if the operators intend to list their securities in a foreign country.\nIt is unclear at the present time how widespread the cybersecurity review requirement and the enforcement action will be and what effect they will have on the FinTech sector generally and the Company in particular. Chinas regulators may impose penalties for non-compliance ranging from fines or suspension of operations, and this could lead to us delisting from the U.S. stock market.\nAlso, on August 20, 2021, the Standing Committee of Chinas National Peoples Congress (NPC) passed the Personal Information Protection Law (PIPL), which became effective on November 1, 2021. The Personal Information Protection Law provides a comprehensive set of data privacy and protection requirements that apply to the processing of personal information and expands data protection compliance obligations to cover the processing of personal information of persons by organizations and individuals in China, and the processing of personal information of persons in China outside of China if such processing is for purposes of providing products and services to, or analyzing and evaluating the behavior of, persons in China. The Personal Information Protection Law also provides that critical information infrastructure operators and personal information processing entities who process personal information meeting a volume threshold to be set by Chinese cyberspace regulators are also required to store in China personal information generated or collected in China, and to pass a security assessment administered by Chinese cyberspace regulators for any export of such personal information. Lastly, the Personal Information Protection Law contains proposals for significant fines for serious violations of up to RMB 50 million or 5% of annual revenues from the prior year and may also be ordered to suspend any related activity by competent authorities. We do not maintain, nor do we intend to maintain in the future, personally identifiable information of users in China.\nInterpretation, application and enforcement of these laws, rules and regulations evolve from time to time and their scope may continually change, through new legislation, amendments to existing legislation or changes in enforcement. Compliance with the Cyber Security Law and the Data Security Law could significantly increase the cost to us of providing our service offerings, require significant changes to our operations or even prevent us from providing certain service offerings in jurisdictions in which we currently operate or in which we may operate in the future. Despite our efforts to comply with applicable laws, regulations and other obligations relating to privacy, data protection and information security, it is possible that our practices, offerings or platform could fail to meet all of the requirements imposed on us by the Cyber Security Law, the Data Security Law and/or related implementing regulations. Any failure on our part to comply with such law or regulations or any other obligations relating to privacy, data protection or information security, or any compromise of security that results in unauthorized access, use or release of personally identifiable information or other data, or the perception or allegation that any of the foregoing types of failure or compromise has occurred, could damage our reputation, discourage new and existing counterparties from contracting with us or result in investigations, fines, suspension or other penalties by Chinese government authorities and private claims or litigation, any of which could materially adversely affect our business, financial condition and results of operations. Even if our practices are not subject to legal challenge, the perception of privacy concerns, whether or not valid, may harm our reputation and adversely affect our business, financial condition and results of operations. Moreover, the legal uncertainty created by the Data Security Law and the recent Chinese government actions could materially adversely affect our ability, on favorable terms, to raise capital; including engaging in follow-on offerings of our securities in the U.S. market.\nWe are a company with a limited operating history and our future profitability is uncertain. We anticipate future losses and negative cash flows, and we may never be profitable.\nWe are a company with a limited operating history and limited revenues to date. We have incurred losses since our inception and expect to experience operating losses and negative cash flows for the foreseeable future. As of August 31, 2022, we had a total accumulated deficit of $34,921,164. We anticipate our losses will continue to increase from current levels because we expect to incur additional costs and expenses related to the development of the FinMaster App, marketing and other promotional activities, the addition of personnel, if necessary, and our continued efforts to form relationships with financial service providers and insurers. We may never generate significant revenue and we may never be profitable.\nPRC regulation of loans and direct investment by offshore holding companies in PRC entities may delay or prevent us from using the proceeds of a securities offering to make loans or additional capital contributions to our PRC operating subsidiaries, which could materially and adversely affect our liquidity and our ability to fund and expand our business.\nIn the normal course of our business, we may make loans to our PRC subsidiaries or may make additional capital contributions to our PRC subsidiaries. Any loans to our wholly foreign-owned or holding subsidiaries in China, which are treated as foreign-invested enterprises (FIEs) under PRC law, are subject to PRC regulations and foreign exchange loan registrations. For example, loans by us to our FIE subsidiaries in China to finance their activities cannot exceed statutory limits and must be registered with SAFE or its local counterparts, or filed with SAFE in its information system. In addition, a foreign invested enterprise shall use its capital pursuant to the principle of authenticity and self-use within its business scope. The capital of a foreign invested enterprise shall not be used for the following purposes: (i) directly or indirectly used for payment beyond the business scope of the enterprises or the payment prohibited by relevant laws and regulations; (ii) directly or indirectly used for investment in securities or investments other than banks principal-secured products unless otherwise provided by relevant laws and regulations; (iii) granting of loans to non-affiliated enterprises, except where it is expressly permitted in the business license; and (iv) paying the expenses related to the purchase of real estate that is not for self-use (except for the foreign-invested real estate enterprises).\nSAFE promulgated the Notice of the State Administration of Foreign Exchange on Reforming the Administration of Foreign Exchange Settlement of Capital of Foreign-invested Enterprises, or SAFE Circular 19, effective June 2015, in replacement of the Circular on the Relevant Operating Issues Concerning the Improvement of the Administration of the Payment and Settlement of Foreign Currency Capital of Foreign-Invested Enterprises, the Notice from the State Administration of Foreign Exchange on Relevant Issues Concerning Strengthening the Administration of Foreign Exchange Businesses, and the Circular on Further Clarification and Regulation of the Issues Concerning the Administration of Certain Capital Account Foreign Exchange Businesses. According to SAFE Circular 19, the flow and use of the RMB capital converted from foreign currency-denominated registered capital of a foreign-invested company is regulated such that RMB capital may not be used for the issuance of RMB entrusted loans, the repayment of inter-enterprise loans or the repayment of banks loans that have been transferred to a third party. Although SAFE Circular 19 allows RMB capital converted from foreign currency-denominated registered capital of a foreign-invested enterprise to be used for equity investments within China, it also reiterates the principle that RMB converted from the foreign currency-denominated capital of a foreign-invested company may not be directly or indirectly used for purposes beyond its business scope. SAFE promulgated the Notice of the State Administration of Foreign Exchange on Reforming and Standardizing the Foreign Exchange Settlement Management Policy of Capital Account, or SAFE Circular 16, effective on June 9, 2016, which reiterates some of the rules set forth in SAFE Circular 19, but changes the prohibition against using RMB capital converted from foreign currency-denominated registered capital of a foreign-invested company to issue RMB entrusted loans to a prohibition against using such capital to issue loans to non-associated enterprises. Violations of SAFE Circular 19 and SAFE Circular 16 could result in administrative penalties. SAFE Circular 19 and SAFE Circular 16 may significantly limit our ability to transfer any foreign currency we hold, including the net proceeds from this offering, to our PRC subsidiaries, which may adversely affect our liquidity and our ability to fund and expand our business in China. On October 23, 2019, the SAFE promulgated the Notice of the State Administration of Foreign Exchange on Further Promoting the Convenience of Cross-border Trade and Investment, or the SAFE Circular 28, which, among other things, allows all foreign-invested companies to use Renminbi converted from foreign currency-denominated capital for equity investments in China, as long as the equity investment is genuine, does not violate applicable laws, and complies with the negative list on foreign investment. However, since the SAFE Circular 28 is newly promulgated, it is unclear how SAFE and competent banks will implement the relevant rules in practice.\nIn light of the various requirements imposed by PRC regulations on loans to and direct investment in PRC entities by offshore holding companies, we cannot be certain that we will be able to complete the necessary government registrations or obtain the necessary government approvals on a timely basis, if at all, with respect to future loans to our PRC subsidiaries or future capital contributions by us to our subsidiaries in China. As a result, uncertainties exist as to our ability to provide prompt funding to our PRC subsidiaries when needed. If we fail to complete such registrations or obtain such approvals, our ability to use the proceeds we expect to receive from this offering and to capitalize or otherwise fund our PRC operations may be negatively affected, which could materially and adversely affect our financial condition and operating results.\nGovernmental control of currency conversion may affect the value of your investment.\nThe PRC government imposes controls on the convertibility of the RMB into foreign currencies and, in certain cases, the remittance of currency out of China. Currently, some of our expenses are denominated in Renminbi. Shortages in the availability of foreign currency may restrict the ability of our PRC subsidiaries to remit sufficient foreign currency to pay us back, or otherwise satisfy their foreign currency denominated obligations. Under existing PRC foreign exchange regulations, payments of current account items, including profit distributions, interest payments and expenditures from trade-related transactions can be made in foreign currencies without prior approval from SAFE by complying with certain procedural requirements. However, approval from appropriate government authorities is required where RMB is to be converted into foreign currency and remitted out of China to pay capital expenses such as the repayment of loans denominated in foreign currencies. The PRC government may also at its discretion restrict access in the future to foreign currencies for current account transactions. In addition, there can be no assurance that the PRC government will not intervene or impose restrictions on our ability to transfer cash or assets within our organization or to foreign investors, which could result in an inability or prohibition on making transfers or distributions outside of PRC and may adversely affect our business, financial condition and results of operations.\nIf we do not receive additional financing when and as needed in the future, we may not be able to continue the development and commercialization of the Apps and our business may fail.\nBecause the version of the FinMaster App we plan to sell is not yet fully developed, our business requires capital investments. Our cash on hand, which at August 31, 2022 was $213,270, will not be sufficient to meet all of our future needs. Furthermore, our target customers may be slow to adopt the App. We anticipate that we will require substantial additional funds in excess of our current financial resources to complete the development of the App and to market it. Until the App generate revenues sufficient to support our operations, we plan to obtain the necessary working capital for operations through the sale of our securities or loans from related parties, but we may not be able to obtain financing in amounts sufficient to fund our business plan. If we cannot obtain additional funding when and as needed, our business might fail.\nAs the Company has working capital deficiency and accumulated deficit, there is substantial doubt about our ability to continue as a going concern.\nOur consolidated financial statements included in this report include an explanatory paragraph that indicates that they were prepared assuming that we would continue as a going concern. As discussed in Note 2 to the consolidated financial statements included with this report, we had suffered recurring losses from operations, and recorded an accumulated deficit, a working capital deficit and a net stockholders deficit of $34,921,164, $2,248,545 and $2,200,107 respectively as of August 31, 2022. These conditions raise substantial doubt about our ability to continue as a going concern. These conditions raise substantial doubt about our ability to continue as a going concern. The ability to continue as a going concern is dependent upon our profit generating operations in the future and/or obtaining the necessary financing to meet our obligations and repay our liabilities arising from normal business operations when they become due. There can be no assurance that we will be successful in our plans described above or in attracting equity or alternative financing on acceptable terms, or if at all. These consolidated financial statements do not include any adjustments to the recoverability and classification of recorded asset amounts and classification of liabilities that might be necessary should we be unable to continue as a going concern.\nWe have identified material weaknesses in our internal control over financial reporting. If we fail to remediate the material weaknesses or maintain an effective system of internal control over financial reporting, we may be unable to accurately report our financial results or prevent fraud, and investor confidence and the market price of our shares may be adversely affected.\nTo implement Section 404 of the Sarbanes-Oxley Act of 2002, or SOX 404, the SEC adopted rules requiring public companies to include a report of management on the companys internal control over financial reporting in their annual reports on Form 10-K. Under current law, we are subject to the requirement that we maintain internal controls and that management perform periodic evaluation of the effectiveness of the internal controls, assuming our filing status remains as a smaller reporting company. A report of our management is included under Item 9A of this Annual Report on Form 10-K. Our management has identified the following material weaknesses in our internal control over financial reporting:\n(1) We do not have an audit committee - While we are not obligated to have an audit committee, it is managements view that such a committee, including a financial expert member, is an utmost important entity level control over the Companys financial reporting. Currently, our Chief Executive Officer and directors act in the capacity of the audit committee, and do not include a member that is considered to be independent of management to provide the necessary oversight over managements activities.\n(2) We do not have adequate written policies and procedures - Due to lack of adequate written policies and procedures for accounting and financial reporting, we did not establish a formal process to close our books monthly and account for all transactions in a timely manner.\n(3) We did not implement appropriate information technology controls - As of August 31, 2022, we retained copies of all financial data and material agreements; however, there is no formal procedure or evidence of normal backup of our data or off-site storage of the data in the event of theft, misplacement, or loss due to unmitigated factors and we do not have sufficient control policies that prevent inappropriate and unauthorized use of the system across all layers of systems.\n(4) We do not have sufficient and skilled accounting personnel with an appropriate level of technical accounting knowledge and experience in the application of accounting principles generally accepted in the United States commensurate with our financial reporting requirements.\nA material weakness is a deficiency, or a combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of the companys annual or interim financial statements will not be prevented or detected on a timely basis. We have taken measures and plan to continue to take measures to remedy this material weakness. However, the implementation of these measures may not fully address the material weakness in our internal control over financial reporting. Our failure to address any control deficiency could result in inaccuracies in our financial statements and could also impair our ability to comply with applicable financial reporting requirements and related regulatory filings on a timely basis. Moreover, effective internal control over financial reporting is important to prevent fraud. As a result, our business, financial condition, results of operations and prospects, as well as the trading price of our shares, may be materially and adversely affected.\nMarket acceptance of the FinMaster App is difficult to predict. If the App does not achieve market acceptance, our business could fail.\nWe are continuing to develop the App. If we are unable to effectively develop and demonstrate the App in a timely fashion, gain recognition with financial service providers, insurers and their clients, and develop a critical level of successful sales, we may not be able to successfully earn sales revenue and our results of operations and financial condition would then suffer.\nFurther, we cannot predict the rate of adoption or acceptance of the Apps by potential customers and their clients. While we may be able to effectively demonstrate the usefulness of the App, this does not guarantee that financial service providers, insurers, brokerage houses and their clients will accept them, nor can we control the rate at which such acceptance may be achieved. If the App is not widely adopted and downloaded by users who are willing to pay for some of the functions available for their purchase, we may not be able to generate enough revenue and profits to support our operations, recover our development costs or become profitable and our business could fail.\nOur efforts may never demonstrate the feasibility of the App.\nOur goal is to create a platform that is easily used by the general public. Technical problems may result in delays and cause us to incur additional expenses that would increase our losses. If we cannot complete, or if we experience significant delays in completing, development of the App for use in potential commercial applications, particularly after incurring significant expenditures, our business may fail.\nWe face substantial political risks associated with doing business in Taiwan, particularly due to domestic political events and the tense relationship between the Republic of China (ROC) and the Peoples Republic of China, which could adversely affect our financial condition and results of operations.\nOur principal executive offices and substantially all of our assets are located in Hong Kong, Beijing, and Taiwan, and substantially all of our revenues are derived from LCHD but all staff for these projects are based in Hong Kong, PRC and Taiwan. Accordingly, our business, financial condition and results of operations and the market price of shares of our common stock may be affected by changes in PRC and ROC governmental policies, taxation, inflation or interest rates and by social instability and diplomatic and social developments in or affecting these locations which are outside of our control. Taiwan has a unique international political status. The PRC government asserts sovereignty over mainland China and Taiwan and does not recognize the legitimacy of the government of the ROC. The PRC government has indicated that it may use military force to gain control over Taiwan if Taiwan declares independence or if Taiwan refuses to accept the PRCs stated One China policy. In addition, on March 14, 2005, the National Peoples Congress of the PRC passed what is widely referred to as the anti-secession law, a law authorizing the PRC military to respond to efforts by Taiwan to seek formal independence. An increase in tensions between the ROC and the PRC and the possibility of instability and uncertainty could adversely affect the prices of our shares. It is unclear what effects any of the events described above may have on relations with the PRC. Relations between Taiwan and the PRC and other factors affecting Taiwans political environment could affect our business. These revenue may subject to US taxes, which may be offset by net operating loss carried forward.\nWe may not be able to obtain or renew all licenses, approvals or permits necessary for our current and future operations.\nOur current and future operations in Taiwan and other regions require a number of regulatory licenses, approvals and permits. We cannot assure you that we will be able to obtain licenses, approvals or permits necessary for our operations in these regions, or that upon the expiration of our existing licenses, approvals or permits, we will be able to successfully renew them.\nWe may fail to adequately protect our proprietary technology, which would allow our competitors to take advantage of our research and development efforts.\nWe rely upon trade secrets, proprietary know-how, and continuing technological innovation to develop new services and solutions and to remain competitive. If our competitors learn of our proprietary technology or processes, they may use this information to produce services and solutions that are equivalent or superior to our services and solutions, which could materially adversely affect our business, operations and financial position. Our employees and consultants may breach their obligations not to reveal our confidential information, and any remedies available to us may be insufficient to compensate our damages. Even in the absence of such breaches, our trade secrets and proprietary know-how may otherwise become known to our competitors, or be independently discovered by our competitors, which could adversely affect our competitive position.\nWe must adapt to changes in software technologies.\nIn order to stay competitive, we must anticipate and adapt to rapid technological changes affecting software development. Any inability to respond to technological advances and implement new technologies could render our products obsolete or less marketable. Further, the failure to pursue the development of new technology, platforms, or business models that obtain meaningful commercial success in a timely manner may negatively affect our business, resulting in increased production costs and more strenuous competition. In order to remain competitive in the market, we need to continuously develop and introduce new functions and designs for our Apps.\nWe are uncertain of our profit margins and whether such profit margins, if achieved, will be able to sustain our business, because the Apps have not yet been fully developed.\nWe have not yet fully developed the Apps or the pricing that will be associated with them. As a result, we cannot reliably predict our profit margins, if any. Our operating costs could increase significantly compared to those we currently anticipate due to unanticipated results from the development process or application of the platform. Further, we envision our pricing to be highly dependent on the benefits that our customers believe they will achieve using the Apps. Accordingly, we cannot predict whether or when we will achieve profitability, and if achieved, the amount of such profit margins.\nMany of our potential competitors have greater resources, and it may be difficult to compete against them.\nThe software application market is competitive, and we expect competition in this market to increase as existing competitors enhance and expand their product and service offerings and as new participants enter the market. Increased competition may result in price reductions, reduced profitability and loss of market share. We cannot ensure that we will be able to compete successfully against existing or future competitors. Some of our customers and companies with which we have strategic relationships may also become competitors.\nMany of our current and potential competitors have greater financial, technical, marketing, service and other resources than we have. As a result, these companies may be able to offer lower prices, additional products or services, or other incentives that we cannot match or offer. These competitors may be in a stronger position to respond more quickly to new technologies and may be able to undertake more extensive marketing campaigns. We believe they may also pursue and adopt more aggressive pricing policies and make more attractive offers to potential customers, employees and strategic partners. In addition, competitors with greater financial resources may make strategic acquisitions to increase their ability to gain market share or improve the quality or marketability of their products. Furthermore, we face challenges in selling the Apps to large companies in the process industries that have internally developed their own proprietary software solutions.\nOur success is dependent on the performance of Yi-Hsiu Lin, our Chief Executive Officer, and the cooperation, performance and retention of our key employees.\nOur business and operations are substantially dependent on the performance of Yi-Hsiu Lin, our Chief Executive Officer. We do not maintain key person life insurance on him. The loss of Mr. Lin or other key employees could seriously harm our business. We cannot assure that employees will not leave and subsequently compete against us. To mitigate such risk, we plan to require key employees to sign non-disclosure agreements when they join the Company.\nWe are also dependent on our ability to retain and motivate high quality personnel. Competition for such personnel is intense, and we may not be able to attract, assimilate or retain other highly qualified managerial, sales and technical personnel in the future. The inability to attract and retain the necessary managerial, sales and technical personnel could cause our business, operating results or financial condition to suffer.\nOur principal executive offices are located in Hong Kong and our Company has non-U.S. resident officers and directors. As such, it may be difficult to pursue legal action against our Company or directors.\nDue to the fact that our Companys executive office is located in Hong Kong and our Company has non-U.S. resident officers and directors, the enforceability of civil liability provisions of U.S. federal securities laws against our officers and directors, and our assets located in foreign jurisdictions, will be limited and may not be possible.\nDigital threats such as cyber-attacks, data protection breaches, computer viruses or malware may disrupt our mobile applications, harm our operating results and damage our reputation, and cyber-attacks or data protection breaches on our clients networks could result in liability for us, damage our reputation or otherwise harm our business.\nThe products and services we sell to clients, and our servers and data centers on which our data, and data of our clients and business partners may be stored, are vulnerable to cyber-attacks, data protection breaches, computer viruses, and similar disruptions from unauthorized tampering or human error. Any such event could compromise our networks or those of our clients, and the information stored on our networks or those of our clients could be accessed, publicly disclosed, lost or stolen, which could subject us to liability to our customers, business partners and others, and could have a material adverse effect on our business, operating results, and financial condition and may cause damage to our reputation. Efforts to limit the ability of malicious third parties to disrupt the operations of the Internet or undermine our own security efforts may be costly to implement and meet with resistance, and may not be successful. Breaches of network security in our clients networks, regardless of whether the breach is attributable to a vulnerability in our products or services, could result in liability for us, damage our reputation or otherwise harm our business.\nAny failures or interruptions in our services or systems could damage our reputation and substantially harm our business and results of operations.\nOur success depends in part on our ability to provide reliable remote services, technology integration and managed services to our clients. The operations of our mobile platforms are susceptible to damage or interruption from human error, fire, flood, power loss, telecommunications failure, terrorist attacks and similar events. We could also experience failures or interruptions of our systems and services, or other problems in connection with our operations, as a result of:\n● damage to or failure of our computer software or hardware or our connections;\n● errors in the processing of data by our systems;\n● computer viruses or software defects;\n● physical or electronic break-ins, sabotage, intentional acts of vandalism and similar events;\n● increased capacity demands or changes in systems requirements of our customers; and\n● errors by employees or third-party service providers.\nAny interruptions in our systems or services could damage our reputation and substantially harm our business and results of operations.\nWe may not be able to successfully integrate the business and operations of entities that we have acquired or may acquire in the future into our ongoing business operations, which may result in our inability to fully realize the intended benefits of these acquisitions, or may disrupt our current operations, which could have a material adverse effect on our business, financial position and/or results of operations.\nWe continue to integrate the operations of NPI and this process involves complex operational, technological and personnel-related challenges, which are time-consuming and expensive and may disrupt our ongoing business operations. Furthermore, integration involves a number of risks, including, but not limited to:\n● difficulties or complications in combining the companies operations;\n● differences in controls, procedures and policies, regulatory standards and business cultures among the combined companies;\n● the diversion of managements attention from our ongoing core business operations;\n● increased exposure to certain governmental regulations and compliance requirements;\n● the potential loss of key personnel;\n● the potential loss of key customers or suppliers who choose not to do business with the combined business;\n● difficulties or delays in consolidating NPIs technology platforms, including implementing systems designed to maintain effective disclosure controls and procedures and internal control over financial reporting for the combined company and enable the Company to continue to comply with U.S. GAAP and applicable U.S. securities laws and regulations;\n● unanticipated costs and other assumed contingent liabilities;\n● difficulty comparing financial reports due to differing financial and/or internal reporting systems;\n● making any necessary modifications to internal financial control standards to comply with the Sarbanes-Oxley Act of 2002 and the rules and regulations promulgated thereunder; and/or\n● possible tax costs or inefficiencies associated with integrating the operations of the combined company.\nThese factors could cause us to not fully realize the anticipated financial and/or strategic benefits of the acquisition, which could have a material adverse effect on our business, financial condition and/or results of operations.\nEven if we are able to successfully operate the acquired business, we may not be able to realize the revenue and other synergies and growth that we anticipated from this acquisition in the time frame that we currently expect, and the costs of achieving these benefits may be higher than what we currently expect, because of a number of risks, including, but not limited to, the possibility that the acquisition may not further our business strategy as we expected.\nAs a result of these risks, the acquisition and integration may not contribute to our earnings as expected, we may not achieve expected revenue synergies or our return on invested capital targets when expected, or at all, and we may not achieve the other anticipated strategic and financial benefits of the acquisition of NPI.\nThe risks arising with respect to the historic business and operations of NPI may be different from what we anticipate, which could significantly increase the costs and decrease the benefits of the acquisition and materially and adversely affect our operations going forward.\nAlthough we performed financial, legal, technological and business due diligence with respect to our acquisition of NPI, we may not have appreciated, understood or fully anticipated the extent of the risks associated with the acquisition. We have secured indemnification for certain matters in connection with the acquisition in order to mitigate the consequences of breaches of representations, warranties and covenants under the definitive acquisition agreement and the risks associated with historic operations, including those with respect to compliance with laws, accuracy of financial statements, financial reporting controls and procedures, tax matters and undisclosed liabilities, and certain matters known to us. We believe that the indemnification provisions of the definitive acquisition agreement will limit the economic consequences of the issues we have identified in our due diligence to acceptable levels. Notwithstanding our exercise of due diligence and risk mitigation strategies, the risks of the acquisition and the costs associated with these risks may be greater than we anticipate. We may not be able to contain or control the costs associated with unanticipated risks or liabilities, which could materially and adversely affect our business, liquidity, capital resources or results of operations.\nAny impairment charge may have a material adverse effect on our operating results.\nUnder U.S. GAAP, we are required to evaluate our investments and long-term non-financial assets, such as property, plant and equipment, intellectual properties, intangible assets, goodwill, right-of-use assets and long-term purchase agreements, for impairment whenever triggering events or changes in circumstances indicate that the asset may be impaired and carrying value may not be recoverable. If certain criteria are met, we are required to recognize an impairment charge.\nThe determination of an impairment charge at any given time is based significantly on our expected results of operations over a number of years subsequent to that time. As a result, an impairment charge is more likely to occur during a period when our operating results are otherwise already depressed. The valuation of long-term non-financial assets is subjective and requires us to make significant estimates about our future performance and cash flows, as well as other assumptions. These estimates can be affected by numerous factors, including changes in economic, industry or market conditions, changes in business operations, changes in competition or potential changes in our stock price and market capitalization. Changes in these estimates and assumptions, or changes in actual performance compared with estimates of our future performance, may affect the fair value of long-term non-financial assets, which may result in an impairment charge. See Note 2 - Summary of Significant Accounting Policies - Goodwill and impairment of goodwill in our financial statements for a discussion of how we assess if an impairment charge is required and, if so, how the amount is determined.\nThe determination of an impairment charge at any given time is mainly based on the projected results of operations over several years subsequent to that time. Consequently, an impairment charge is more likely to occur during a period when our operating results are otherwise already depressed.\nBecause our officers and directors conduct outside business activities, the attention and efforts of our officers and directors are not solely focused upon Leader Capital Holdings Corp.\nWhile our officers and directors intend to devote as much time as necessary to the success and development of the Company, Mr. Lin in particular has outside interests that require a portion of his time every week. Currently, Mr. Lin is prepared to dedicate 36 hours per week to our operations. Although we believe their time, resources, and effort to be allocated appropriately to allow for the Companys future success, there can be no guarantee that their priorities will not shift in the future. In the event that their outside interests begin to take precedence over their positions in the Company, the Company may not experience the growth and success that is anticipated.\nRisks Related to Owning Our Securities\nWe have the right to issue shares of preferred stock. If we were to issue preferred stock, it is likely to have rights, preferences and privileges that may adversely affect our common stock or other securities.\nWe are authorized to issue 200,000,000 shares of blank check preferred stock, with such rights, preferences and privileges as may be determined from time to time by our board of directors. Our board of directors is empowered, without shareholder approval, to issue preferred stock in one or more series, and to fix for any series the dividend rights, dissolution or liquidation preferences, redemption prices, conversion rights, voting rights, and other rights, preferences and privileges for the preferred stock. No shares of preferred stock are presently issued and outstanding and we have no immediate plans to issue shares of preferred stock. The issuance of shares of preferred stock, depending on the rights, preferences and privileges attributable to the preferred stock, could adversely reduce the voting rights and powers of the common stock and the portion of our assets allocated for distribution to common stock holders in a liquidation event, and could also result in dilution in the book value per share of our common stock. The preferred stock could also be utilized, under certain circumstances, as a method for raising additional capital or discouraging, delaying or preventing a change in control of the Company, to the detriment of holders of our common stock. We cannot assure you that we will not, under certain circumstances, issue shares of our preferred stock.\nWe may be required to raise additional financing by issuing new securities, which may have terms or rights superior to those of our shares of common stock, which could adversely affect the market price of our shares of common stock.\nWe will require additional financing to fund development and commercialization of the Apps and for working capital and other purposes. We may not be able to obtain financing on favorable terms, if at all. If we raise additional funds by issuing equity securities, the percentage ownership of our then-current stockholders will be reduced. Further, we may have to offer new investors in our equity securities rights that are superior to the holders of common stock, which could adversely affect the market price and the voting power of shares of our common stock. If we raise additional funds by issuing debt securities, the holders of the debt securities would similarly have rights senior to those of the holders of shares of common stock, and the terms of the debt securities could impose restrictions on operations and create a significant interest expense for us which could have a materially adverse effect on our business and results of operations.\nWe have not paid dividends on our common stock to date and do not intend to pay any dividends for the foreseeable future.\nWe have not paid any dividends on our common stock to date and do not intend to pay any dividends for the foreseeable future. The payment of dividends in the future will be made at the discretion of our board of directors, and will be contingent upon our revenues and earnings, if any, capital requirements and general financial condition. We are under no contractual obligations or restrictions to declare or pay dividends on shares of our common stock. It is the present intention of our board of directors to retain all earnings, if any, for use in our business operations and, accordingly, our board does not anticipate declaring any dividends in the foreseeable future.\nWe will incur significant costs as a result of being a public company that reports to the SEC. Furthermore, the reporting requirements may place undue strain on our personnel, systems and resources.\nAs a public company required reporting to the SEC, we expect to incur significant legal, accounting, investor relations, printing, board compensation, and other expenses that we did not incur as a private company.\nWe are currently subject to the reporting requirements of the Exchange Act and the Sarbanes-Oxley Act of 2002 as well as rules subsequently implemented by the SEC that impose significant requirements on public companies, including requiring us to establish and maintain effective disclosure and financial controls and changes in corporate governance practices. In addition, there are significant corporate governance and executive compensation-related provisions in the Dodd-Frank Wall Street Reform and Protection Act that, as we grow, could increase our legal and financial compliance costs and make some activities more difficult, time-consuming or costly. These requirements may place undue strain on our personnel, systems and resources.\nOur officers and directors lack experience in, and with, the reporting and disclosure obligations of publicly-traded companies.\nOur officers and directors lack experience in, and with, the reporting and disclosure obligations of publicly-traded companies and with serving as an officer and/or director of a publicly-traded company. This lack of experience may impair our ability to maintain effective internal controls over financial reporting and disclosure controls and procedures, which may result in material misstatements to our financial statements and an inability to provide accurate financial information to our stockholders. Consequently, our operations, future earnings and ultimate financial success could suffer irreparable harm due to the lack of experience of our officers and directors with publicly-traded companies and the reporting requirements in general.\nOur Chief Executive Officer is also our controlling shareholder. He may significantly influence matters to be voted on and his interests may differ from, or be adverse to, the interests of our other stockholders.\nOur Chief Executive Officer and director, Mr. Yi-Hsiu Lin, beneficially owns 29.2% of our common stock. Accordingly, Mr. Lin possesses significant influence over the Company on matters submitted to the stockholders for approval, including the election of directors, mergers, consolidations, the sale of all or substantially all our assets, and also the power to prevent or cause a change in control. This amount of control gives Mr. Lin a substantial ability to determine the future of our Company, and as such, he may elect to close the business, change the business plan or make any number of other major business decisions without the approval of stockholders. Mr. Lins interests may differ from the interests of our other stockholders and could therefore result in corporate decisions that are averse to other stockholders.\nThe audit reports included in this annual report have been prepared by auditors whose work was not inspected fully by the Public Company Accounting Oversight Board (PCAOB) and, as such, the Company could be delisted if it is unable to timely meet the PCAOB inspection requirements established by the Holding Foreign Companies Accountable Act.\nAs a public company with securities quoted on the OTCQB, we will be required to have our financial statements audited by an independent registered public accounting firm registered with the PCAOB. A requirement of being registered with the PCAOB is that if requested by the SEC or PCAOB, such accounting firm is required to make its audits and related audit work papers be subject to regular inspections to assess its compliance with the applicable professional standards. Since our auditor is located in Hong Kong and China, a jurisdiction where the PCAOB has been unable to conduct inspections without the approval of the Chinese authorities due to various state secrecy laws and the revised Securities Law, the PCAOB currently does not have free access to inspect the work of our auditor. This lack of the PCAOB inspections in China prevents the PCAOB from fully evaluating audits and quality control procedures of our auditor. As a result, we and investors in our ordinary shares are deprived of the benefits of such PCAOB inspections, which could cause investors in our stock to lose confidence in our audit procedures and the quality of our financial statements.\nOn December 18, 2020, the Holding Foreign Companies Accountable Act, or HFCAA, was enacted. In essence, the act requires the SEC to prohibit securities of any foreign companies from being listed on U.S. securities exchanges or traded over-the-counter if a company retains a foreign accounting firm that cannot be inspected by the PCAOB for three consecutive years, beginning in 2021. Our independent registered public accounting firm is located in and organized under the laws of Hong Kong and China, a jurisdiction where the PCAOB is currently unable to conduct inspections without the approval of the Chinese authorities, and therefore our auditors are not currently inspected by the PCAOB.\nOn March 24, 2021, the SEC adopted interim final amendments, which will become effective 30 days after publication in the Federal Register, relating to the implementation of certain disclosure and documentation requirements of the HFCAA. The interim final amendments will apply to registrants that the SEC identifies as having filed an annual report with an audit report issued by a registered public accounting firm that is located in a foreign jurisdiction and that the PCAOB has determined it is unable to inspect or investigate completely because of a position taken by an authority in that jurisdiction. Before any registrant will be required to comply with the interim final amendments, the SEC must implement a process for identifying such registrants. As of the date of this Amendment, the SEC is seeking public comment on this identification process. Consistent with the HFCAA, the amendments will require any identified registrant to submit documentation to the SEC establishing that the registrant is not owned or controlled by a government entity in that jurisdiction, and will also require, among other things, disclosure in the registrants annual report regarding the audit arrangements of, and government influence on, such registrant.\nOn June 22, 2021, the U.S. Senate passed a bill which, if passed by the U.S. House of Representatives and signed into law, would reduce the number of consecutive non-inspection years required for triggering the prohibitions under the HFCAA from three years to two.\nThe SEC may propose additional rules or guidance that could impact us if our auditor is not subject to PCAOB inspection. For example, on August 6, 2020, the Presidents Working Group on Financial Markets, or the PWG, issued the Report on Protecting United States Investors from Significant Risks from Chinese Companies to the then President of the United States. This report recommended that the SEC implement five recommendations to address companies from jurisdictions that do not provide the PCAOB with sufficient access to fulfil its statutory mandate. Some of the concepts of these recommendations were implemented with the enactment of the HFCAA. However, some of the recommendations were more stringent than the HFCAA. For example, if a company was not subject to PCAOB inspection, the report recommended that the transition period before a company would be delisted would end on January 1, 2022.\nIt is unclear when the SEC will complete its rulemaking, when such rules will become effective and what, if any, of the PWG recommendations will be adopted. The enactment of the HFCAA and the implications of any additional rulemaking efforts to increase U.S. regulatory access to audit information in China could cause investor uncertainty for affected SEC registrants, including us, and the market price of our stock could be materially adversely affected. However, PCAOB announced the signing of a Statement of Protocol with the China Securities Regulatory Commission and the Ministry of Finance of the Peoples Republic of China on August 26, 2022 for the PCAOB to inspect and investigate completely registered public accounting firms in mainland China and Hong Kong. PCAOB has sent an inspection team to Hong Kong in September 2022 to put the agreement to test and the inspection report is due some time in December 2022. Therefore, whether the PCAOB will be able to conduct inspections of our auditors in the next three years, or at all, is subject to substantial uncertainty and depends on a number of factors out of our control. If we are unable to meet the PCAOB inspection requirement in time, our stock will not be permitted for trading over-the counter either. Such a delisting would substantially impair your ability to sell or purchase our stock when you wish to do so, and the risk and uncertainty associated with delisting would have a negative impact on the price of our stock. Also, such a delisting would significantly affect our ability to raise capital on terms acceptable to us, or at all, which would have a material adverse impact on our business, financial condition and prospects.\nProceedings instituted by the SEC against five PRC-based accounting firms could result in financial statements being determined to be not in compliance with the requirements of the Securities Exchange Act of 1934.\nWe are required to have our financial statements audited by an independent registered public accounting firm registered with the PCAOB. A requirement of being registered with the PCAOB is that if requested by the SEC or PCAOB, such accounting firm is required to make its audits and related audit work papers be subject to regular inspections to assess its compliance with the applicable professional standards. Since our auditor is located in Hong Kong and PRC, a jurisdiction where the PCAOB has been unable to conduct inspections without the approval of the PRC authorities due to various state secrecy laws and the revised Securities Law, the PCAOB currently does not have free access to inspect the work of our auditor. This lack of access to the PCAOB inspection in the PRC prevents the PCAOB from fully evaluating audits and quality control procedures of our auditor based in the PRC. As a result, the investors may be deprived of the benefits of such PCAOB inspections. The inability of the PCAOB to conduct inspections of auditors in the PRC makes it more difficult to evaluate the effectiveness of these accounting firms audit procedures or quality control procedures as compared to auditors outside of the PRC that are subject to the PCAOB inspections.\nThe SEC previously instituted proceedings against mainland Chinese affiliates of the big four accounting firms, including the affiliate of our auditor, for failing to produce audit work papers under Section 106 of the Sarbanes-Oxley Act because of restrictions under PRC law. Each of the big four accounting firms in mainland China agreed to a censure and to pay a fine to the SEC to settle the dispute and stay the proceedings for four years, until the proceedings were deemed dismissed with prejudice on February 6, 2019. It remains unclear whether the SEC will commence a new administrative proceeding against the four mainland China-based accounting firms. Any such new proceedings or similar action against our audit firm for failure to provide access to audit work papers could result in the imposition of penalties, such as suspension of our auditors ability to practice before the SEC. If our independent registered public accounting firm, or its affiliate, was denied, even temporarily, the ability to practice before the SEC, and it was determined that our financial statements or audit reports were not in compliance with the requirements of the U.S. Exchange Act, we could be at risk of delisting or become subject to other penalties that would adversely affect our ability to remain listed on the U.S. stock exchanges.\nIn recent years, U.S. regulators have continued to express their concerns about challenges in their oversight of financial statement audits of United States on access to audit information, the United States enacted the Holding Foreign Companies Accountable Act (HFCA Act), in December 2020. The HFCA Act includes requirements for the SEC to identify issuers whose audit reports are prepared by auditors that the PCAOB is unable to inspect or investigate completely because of a restriction imposed by a non-U.S. authority in the auditors local jurisdiction. The HFCA Act also requires public companies on this SEC list to certify that they are not owned or controlled by a foreign government and make certain additional disclosures in their SEC filings. In addition, if the auditor of a U.S. listed companys financial statements is not subject to PCAOB inspections for three consecutive non-inspection years after the law becomes effective in 2021, the SEC is required to prohibit the securities of such issuer from being traded on a U.S. national securities exchange, such as the NYSE, or in U.S. over-the-counter markets.\nOn March 24, 2021, the SEC announced that it had adopted interim final relating to the implementation of certain disclosure and documentation requirements of the HFCA Act. The interim final amendments will apply to registrants that the SEC identifies as having filed an annual report with an audit report issued by a registered public accounting firm that is located in a foreign jurisdiction and that the PCAOB has determined it is unable to inspect or investigate completely because of a position taken by an authority in that jurisdiction. Before any registrant will be required to comply with the interim final amendments, the SEC must implement a process for identifying such registrants. Consistent with the HFCA Act, the amendments will require any identified registrant to submit documentation to the SEC establishing that the registrant is not owned or controlled by a government entity in that jurisdiction, and will also require, among other things, disclosure in the registrants annual report regarding the audit arrangements of, and government influence on, such registrant.\nFurthermore, on June 22, 2021, the U.S. Senate passed the Accelerating Holding Foreign Companies Accountable Act, which, if enacted, would amend the HFCA Act and require the SEC to prohibit an issuers securities from trading on any U.S. stock exchanges if its auditor is not subject to PCAOB inspections for two consecutive years instead of three. In the future, if we do not engage an auditor that is subject to regular inspection by the PCAOB, our common stocks may be delisted.\nOn September 22, 2021, the PCAOB adopted a final rule implementing the HFCA Act, which became effective on November 4, 2021 and provided a framework for the PCAOB to use when determining, as contemplated under the HFCA Act, whether the Board is unable to inspect or investigate completely registered public accounting firms located in a foreign jurisdiction because of a position taken by one or more authorities in that jurisdiction.\nAdditionally, on December 2, 2021, the SEC adopted amendments to finalize rules implementing the submission and disclosure requirements in the HFCA Act. The rules apply to registrants the SEC identifies as having filed an annual report with an audit report issued by a registered public accounting firm that is located in a foreign jurisdiction and that the PCAOB is unable to inspect or investigate (Commission-Identified Issuers). The final amendments require Commission-Identified Issuers to submit documentation to the SEC establishing that, if true, it is not owned or controlled by a governmental entity in the public accounting firms foreign jurisdiction. The SEC will identify Commission-Identified Issuers for fiscal years beginning after December 18, 2020. A Commission-Identified Issuer will be required to comply with the submission and disclosure requirements in the annual report for each year in which it was identified. If a registrant is identified as a Commission-Identified Issuer based on its annual report for the fiscal year ended December 31, 2021, the registrant will be required to comply with the submission or disclosure requirements in its annual report filing covering the fiscal year ended December 31, 2022.\nOn December 16, 2021, PCAOB issued a report on its determinations that PCAOB is unable to inspect or investigate completely PCAOB-registered public accounting firms headquartered in mainland China and in Hong Kong, a Special Administrative Region of the PRC, because of positions taken by PRC authorities in those jurisdictions. The PCAOB made these determinations pursuant to PCAOB Rule 6100, which provides a framework for how the PCAOB fulfills its responsibilities under the HFCAA. The report further listed in its Appendix A and Appendix B, Registered Public Accounting Firms Subject to the Mainland China Determination and Registered Public Accounting Firms Subject to the Hong Kong Determination, respectively. The audit report included in this Annual Report on Form 10-K for the years ended August 31, 2022 and 2021, was issued by Centurion ZD CPA & Co. (CZD CPA), an audit firm headquartered in Hong Kong, a jurisdiction that the PCAOB has determined that the PCAOB is unable to conduct inspections or investigate auditors. Our auditors CZD CPA is among those listed by the PCAOB Hong Kong Determination, a determination announced by the PCAOB on December 16, 2021 that the PCAOB is unable to inspect or investigate completely registered public accounting firms headquartered in Hong Kong, a Special Administrative Region and dependency of the PRC, because of a position taken by one or more authorities in Hong Kong. The lack of access to the PCAOB inspection in PRC prevents the PCAOB from fully evaluating audits and quality control procedures of the auditors based in PRC. As a result, the investors may be deprived of the benefits of such PCAOB inspections. The inability of the PCAOB to conduct inspections of auditors in PRC makes it more difficult to evaluate the effectiveness of these accounting firms audit procedures or quality control procedures as compared to auditors outside of the PRC that are subject to the PCAOB inspections. In addition, under the HFCA Act, our securities may be prohibited from trading on the U.S. stock exchanges or in the over the counter trading market in the U.S. if our auditor is not inspected by the PCAOB for three consecutive years, and this ultimately could result in our ordinary shares being delisted.\nThe enactment of the HFCA Act and the implications of any additional rulemaking efforts to increase U.S. regulatory access to audit information in PRC could cause investor uncertainty for affected SEC registrants, including us, and the market price of our common stock could be materially adversely affected. Further, whether the PCAOB will be able to conduct inspections of our auditor in the next three years, or at all, is subject to substantial uncertainty and depends on a number of factors out of our control. While we understand that there has been dialogue among the China Securities Regulatory Commission (the CSRC), the SEC and the PCAOB regarding the inspection of PCAOB-registered accounting firms in China, there can be no assurance that we will be able to comply with requirements imposed by U.S. regulators. If we are unable to meet the PCAOB inspection requirement in time, we could be subject to additional submission and disclosure requirements, delisted from the OTCQB and our common stock will not be permitted for trading over-the-counter at all. If our securities are unable to be listed on another securities exchange by then, such a delisting would substantially impair investors ability to sell or purchase our common stock when investor wish to do so, and the ongoing risk and uncertainty associated with delisting would have a negative impact on the price of our common stock. Also, such a delisting would significantly affect our ability to raise capital on terms acceptable to us, or at all, which would have a material adverse impact on our business, financial condition and prospects.\nThe trading in our shares will be regulated by the Rule 15G-9 of the Exchange Act which defines a penny stock.\nOur common stock is a penny stock, as defined in Rule 15G-9 promulgated under the Exchange Act. As discussed at Item 9 of this registration statement, the Exchange Act and the penny stock rules generally impose additional sales practice and disclosure requirements on broker-dealers who sell our securities to persons other than certain accredited investors or in transactions not recommended by the broker-dealer. For transactions covered by the penny stock rules, a broker dealer must make certain mandated disclosures in penny stock transactions, including the actual sale or purchase price and actual bid and offer quotations, the compensation to be received by the broker-dealer and certain associated persons, and must deliver certain disclosures required by the SEC. Consequently, the penny stock rules may make it difficult for you to resell any shares you may purchase.\nFINRA sales practice requirements may also limit a stockholders ability to buy and sell our stock.\nIn addition to the penny stock rules promulgated by the SEC, which are discussed in the immediately preceding risk factor, FINRA rules require that in recommending an investment to a customer, a broker-dealer must have reasonable grounds for believing that the investment is suitable for that customer. Prior to recommending speculative low priced securities to their non-institutional customers, broker-dealers must make reasonable efforts to obtain information about the customers financial status, tax status, investment objectives and other information. Under interpretations of these rules, FINRA believes that there is a high probability that speculative low priced securities will not be suitable for at least some customers. FINRA requirements make it more difficult for broker-dealers to recommend that their customers buy our common stock, which may limit the ability to buy and sell our stock and have an adverse effect on the market value for our shares. Item 1B. Unresolved Staff Comments\nAs a smaller reporting company as defined by Item 10 of Regulation S-K, the Company is not required to provide this information. Item 2. Properties\nOur principal executive office is located at Room 2708-09, Metropolis Tower, 10 Metropolis Drive, Hung Hom, Hong Kong. We have an agreement for use of office space at this location under a lease expiring on July 31, 2023. We do not own any real property. We believe that our current facilities are adequate for our present needs and suitable additional facilities will be available as needed on commercially reasonable terms. Item 3. Legal Proceedings\nThere are presently no pending legal proceedings to which the Company, LFGL, JFB or any of its property is subject, or any material proceedings to which any director, officer or affiliate of the Company, any owner of record or beneficially of more than five percent of any class of voting securities is a party or has a material interest adverse to the Company, and no such proceedings are known to the Company to be threatened or contemplated against it. Item 4. Mine Safety Disclosures\nNot applicable.\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nSince November 6, 2020, our common stock has been quoted on the OTCQB Venture Market maintained by the OTC Markets under the symbol LCHD. The OTCQB is a regulated quotation service that displays real-time quotes, last-sale prices and volume information in over-the-counter equity securities. The OTCQB securities are traded by a community of market makers that enter quotes and trade reports. This market is limited in comparison to the national stock exchanges and any prices quoted may not be a reliable indication of the value of our common stock. Any over-the-counter market quotations reflect inter-dealer prices, without retail mark-up, mark-down or commission and may not necessarily represent actual transactions.\nHolders of Record\nAs of December 8, 2022, there were 179 stockholders of record of our common stock, not including an indeterminate number of stockholders whose shares are held by brokers in street name.\nDividend Policy\nWe have not paid any dividends on our common stock to date and do not intend to pay any dividends for the foreseeable future. The payment of dividends in the future will be made at the discretion of our board of directors, and will be contingent upon our revenues and earnings, if any, capital requirements and general financial condition subsequent to completion of a business combination. We are under no contractual obligations or restrictions to declare or pay dividends on shares of our common stock. it is the present intention of our board of directors to retain all earnings, if any, for use in our business operations and, accordingly, our board does not anticipate declaring any dividends in the foreseeable future. Item 6. [Reserved] Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations.\nThe following discussion of our financial condition and results of operations should be read in conjunction with our audited consolidated financial statements and the notes to those financial statements appearing elsewhere in this Form 10-K.\nCertain statements in this Form 10-K constitute forward-looking statements. These forward-looking statements include statements, which involve risks and uncertainties, regarding, among other things, (a) our projected sales, profitability, and cash flows, (b) our growth strategy, (c) anticipated trends in our industry, (d) our future financing plans, and (e) our anticipated needs for, and use of, working capital. They are generally identifiable by use of the words may, will, should, anticipate, estimate, plan, potential, project, continuing, ongoing, expects, management believes, we believe, we intend, or the negative of these words or other variations on these words or comparable terminology. In light of these risks and uncertainties, there can be no assurance that the forward-looking statements contained in this filing will in fact occur. You should not place undue reliance on these forward-looking statements.\nThe forward-looking statements speak only as of the date on which they are made, and, except to the extent required by federal securities laws, we undertake no obligation to update any forward-looking statements to reflect events or circumstances after the date on which the statements are made or to reflect the occurrence of unanticipated events.\nOverview\nLeader Capital Holdings Corp. is an early stage technology company that conducts its operations through its wholly owned subsidiaries, Leader Financial Group Limited and JFB Internet Service Limited.\nThrough LFGL, we act as the service provider for a mobile application investment platform that is owned by JFB. The platform connects investors with financial service providers in an effort to sharpen operational efficiency and seeks to address customer demands for more innovative services. It is a ready-made application created to meet the needs of financial service providers, especially trust companies and insurance companies. The platform is customizable and each financial institution can adjust the platform to better suit their clients needs.\nUse of the JFB platform is currently free; however, we have an agreement with a third party whereby we have authorized the third party to use our investment platform and related applications until December 31, 2020 for a fee. In the future, the Company intends to generate additional revenue by developing a new, more comprehensive mobile application, with similar functions as the JFB platform, to offer to our clients for a fee.\nThe Company is currently developing a new, more comprehensive FinMaster mobile application (FinMaster App), to offer to our clients for a fee. This FinMaster App intends to offer one-stop shopping for multi financial services. Key services include real-time Taiwan stock market quotes, financial industry information and news, social media activities, on-line live broadcast, A.I. stock selection and other features. On August 17, 2020, the Company, through its wholly-owned subsidiary JFB Internet Service Limited, a company incorporated and existing under the laws of Hong Kong (the Buyer), acquired all of the issued and outstanding capital stock (the Acquisition) of Nice Products Inc., a company organized under the laws of the British Virgin Islands and the Companys software ODM developer of the FinMaster App (NPI), pursuant to the terms and conditions of that certain Stock Purchase Agreement, dated as of August 17, 2020, among the Company, the Buyer, NPI, the selling stockholders of NPI identified therein (each a Seller, and, collectively, the Sellers) and the representative of the Sellers identified therein. The aggregate purchase price for the acquisition was $4,850,000, less certain discounts, expenses and reductions for outstanding NPI debt owed to the Company and/or its affiliates. The net purchase price for the acquisition was $3,506,042, payable in 8,415,111 shares of the Companys common stock to the Sellers in accordance with their respective pro rata percentage.\nAs a result of the acquisition, the Company now owns, indirectly through the Buyer, 100% of NPI. NPI, through its wholly-owned subsidiaries, LOC Weibo Co., Ltd. and Beijing DataComm Cloud Media Technology Co., Ltd., companies organized under the laws of the Republic of China and the laws of the Peoples Republic of China, respectively, engages primarily in the development of ecological-system applications, integration of big data and promotion of OTT applications. As a result of the acquisition, we believe the FinMaster App can be launched to the market in a timely and efficient manner and clients on this open platform could be served more effectively and satisfactorily.\nWe have incurred significant operating losses. As of August 31, 2022 and 2021, our accumulated deficits were $34,921,164 and $23,001,067, respectively. We generated revenue of $339,442 and $95,166 for the fiscal years ended August 31, 2022 and 2021, respectively. Our net losses were principally attributed to general and administrative expenses.\nGoing concern\nThe accompanying consolidated financial statements have been prepared on a going concern basis, which contemplates the realization of assets and the settlement of liabilities and commitments in the normal course of business.\nWe have suffered recurring losses from operations, and recorded an accumulated deficit, a working capital deficit and a net stockholders deficit of $34,921,164, $2,248,545 and $2,200,107 respectively as of August 31, 2022. These conditions raise substantial doubt about our ability to continue as a going concern. The ability to continue as a going concern is dependent upon our profit generating operations in the future and/or obtaining the necessary financing to meet its obligations and repay our liabilities arising from normal business operations when they become due.\nWe expect to finance our operations primarily through cash flow from operations, loans from existing directors and stockholders and placements of capital stock for additional funding. In the event that we require additional funding to finance the growth of our current and expected future operations as well as to achieve our strategic objectives, a shareholder has indicated the intent and ability to provide additional financing. No assurance can be given that any future financing, if needed, will be available or, if available, that it will be on terms that are satisfactory to us. Even if we are able to obtain additional financing, if needed, it may contain undue restrictions on our operations, in the case of debt financing, or cause substantial dilution for our stockholders, in the case of equity financing.\nThe COVID-19 pandemic has created and may continue to create significant uncertainty in macroeconomic conditions, which may cause further business slowdowns or shutdowns, depress demand for our business, and adversely impact our results of operations. We expect uncertainties around our key accounting estimates to continue to evolve depending on the duration and degree of impact associated with the COVID-19 pandemic. Its estimates may change as new events occur and additional information emerges, and such changes are recognized or disclosed in its consolidated financial statements.\nThese consolidated financial statements do not include any adjustments to the recoverability and classification of recorded asset amounts and classification of liabilities that might be necessary should we be unable to continue as a going concern.\nResults of Operations\nComparison of years ended August 31, 2022 and 2021\nYear ended August 31,\nRevenue $ 339,442 $ 95,166\nResearch and development expenses (510,723 ) (602,118 )\nSales and marketing expenses (300,507 ) (203,646 )\nGeneral and administrative expenses (4,804,688 ) (9,702,342 )\nImpairment loss of intangible assets (537,866 ) (88,415 )\nImpairment loss of goodwill (1,747,945 ) (1,226,419 )\nLoss from operations (7,562,287 ) (11,727,774 )\nInterest expenses (94,684 ) (102,196 )\nLoss on change in fair value of convertible notes (3,980,908 ) (47,092 )\nOther (expense) income (407,720 ) 145,432\nLoss before income tax (12,045,599 ) (11,731,630 )\nIncome tax benefit 125,502 38,138\nNet loss $ (11,920,097 ) $ (11,693,492 )\nRevenue\nWe signed an agreement with a third party whereby we authorized the third party to use our investment platform and related applications, from January 1, 2018 to December 31, 2020, for an upfront service fee. An additional fee is charged upon the third partys sale of products on our mobile application. From September 2020, we generated additional revenue from a new, more comprehensive mobile application, which we refer to as the FinMaster App, with similar functions as the JFB platform. We also provided software maintenance services.\nWe generated revenue of $339,442 and $95,166 for the fiscal years ended August 31, 2022 and 2021, respectively. The increment of revenue was arisen from the new custom-made app project commenced in the third quarter of current fiscal year.\nResearch and Development Expenses\nResearch and development expenses for the years ended August 31, 2022 and 2021 amounted to $510,723 and $602,118, respectively which primarily represented the charges for R&D and consulting work performed by third parties and salaries and benefits for those employees engaged in research, design and development activities after our acquisition of NPI in August 2020. The reduction of expenses was mainly due to the termination of service agreement with a third party provider on December 31, 2021.\nSales and Marketing Expenses\nSales and marketing expenses were $300,507 and $203,646 for the year ended August 31, 2022 and 2021, respectively. It consists of the advertising costs and the redeemable point liability charges after our acquisition of NPI in August 2020. To promote the FinMaster App downloads, LOC allocated funding to the marketing for the year ended August 31, 2022, thus the sales and marketing expenses increased.\nGeneral and Administrative Expenses\nGeneral and administrative expenses for the year ended August 31, 2022 amounted to $4,804,688 as compared to $9,702,342 for the year ended August 31, 2021. The decrease was mainly resulted from a decrease in share-based compensation of $4,663,884 from $6,563,235 for the year ended August 31, 2021 to $1,899,351for the year ended August 31, 2022.\nImpairment loss of intangible assets\nDuring the course of our strategic review of our operations, the financial performance of NPIs technical know-hows fall below our original expectations, we assessed the recoverability of the carrying value of certain intangible assets which resulted in impairment losses of $537,866 and $88,415, respectively for the years ended August 31, 2022 and 2021.\nImpairment loss of goodwill\nOur impairment loss of goodwill was $1,747,945 and $1,226,419, respectively for the years ended August 31, 2022 and 2021. The impairment loss of goodwill was primarily attributable to the impairment related to NPI as the financial performance of the reporting unit of FinTech App development continued to fall below our original expectations.\nLoss on Change in Fair Value of Convertible Notes\nWe incurred a fair value loss of $3,980,908 and $47,092 on our convertible promissory notes for the years ended August 31, 2022 and 2021, respectively. The fair value loss is due to change of conversion price and conversion of convertible notes. We elected to measure the convertible notes in their entirety at fair value with changes in fair value recognized as non-operating income or loss at each balance sheet date or conversion date.\nOther (Expense) Income\nOther expense for the year ended August 31, 2022 amounted to $407,720 as compared to other income of $145,432 in the prior year. Other (expense) income mainly consists of the exchange difference, net which was exchange differences arose from the depreciation/appreciation of NTD and RMB against USD for inter-group remittance.\nNet Loss\nAs a result of the foregoing, our net loss was $11,920,097 for the year ended August 31, 2022, as compared to $11,693,492 for the year ended August 31, 2021. The net loss was mainly derived from general and administrative expenses, impairment on intangible assets and goodwill, and loss on change in fair value of convertible notes.\nLiquidity and Capital Resources\nWe had $213,270 in cash and cash equivalents as of August 31, 2022.\nNet cash used in operating activities for the year ended August 31, 2022 was $2,909,958, as compared to $3,620,605 for the year ended August 31, 2021. The net cash used in operating activities was mainly for payment of general and administrative expenses.\nThe net cash used in operating activities for the years ended August 31, 2022 and 2021 were mainly due to our net loss (excluding share-based compensation, depreciation and amortization, amortization of operating lease right-of-use assets, exchange difference, loss on change in fair value of convertible notes and impairment losses) of $2,779,019 for the year ended August 31, 2022, as compared to $3,478,533 for the year ended August 31, 2021.\nNet cash used in investing activities for the years ended August 31, 2022 and 2021 were $50,430 and $74,551, respectively. The net cash used in investing activities was mainly related to acquisition of plant and equipment and intangible assets.\nNet cash provided by financing activities for the year ended August 31, 2022 was $2,387,378, as compared to $4,063,386 for the year ended August 31, 2021. The net cash provided by financing activities for the year ended August 31, 2022 was mainly attributed to the issuance of shares in private placement of $2,290,000. For the year ended August 31, 2021, net cash provided by financing activities was mainly from the issuance of shares in private placement of $3,636,980 and convertible notes issuance of $800,000.\nWe may also require additional cash due to changing business conditions or other future developments, including any investments or acquisitions we may decide to pursue. We plan to renew our loans and bonds upon maturity, if required, and plan to raise additional funds through equity financing in the future to meet our daily cash demands, if required. However, there can be no assurance that we will be successful in obtaining such financing. If our existing cash and borrowings are insufficient to meet our requirements, we may seek to sell debt securities, or borrow from shareholders. We can make no assurance that financing will be available in the amounts we need or on terms acceptable to us, if at all. The incurrence of debt would divert cash for working capital and capital expenditures to service debt obligations and could result in operating and financial covenants that restrict our operations and our ability to pay dividends to our shareholders. If we are unable to obtain additional equity or debt financing as required, our business operations and prospects may suffer.\nThe following table sets forth our contractual obligations and commercial commitments as of August 31, 2022:\nPayments Due by Period\nTotal Less than 1 year 1 - 3 years\nContractual Obligations\nOther loans $ 460,709 $ 260,709 $ 200,000\nBonds payable 600,000 600,000 -\nDue to a director 973,564 973,564 -\nDue to shareholders 45,343 45,343 -\nFuture interest payment on loans 54,885 30,893 23,992\nFuture interest payment on bonds 72,000 72,000 -\nTotal $ 2,206,501 $ 1,982,509 $ 223,992\nCritical Accounting Estimates\nWe regularly evaluate the accounting policies and estimates that we use to make budgetary and financial statement assumptions. A complete summary of these policies is included in the notes to our financial statements. In general, managements estimates are based on historical experience, on information from third party professionals, and on various other assumptions that are believed to be reasonable under the facts and circumstances. Actual results could differ from those estimates made by management. The discussion of our critical accounting policies contained in Note 2 to our consolidated financial statements, Summary of Significant Accounting Policies, is incorporated herein by reference. We believe that the following critical accounting policies affect the most significant estimates and management judgments used in preparing our consolidated financial statements.\nGoodwill and impairment of goodwill\nGoodwill represents the excess of the purchase price and related costs over the fair value of the net identified tangible and intangible assets and liabilities assumed and is not amortized. The total amount of goodwill is deductible for tax purposes.\nIn accordance with ASC Topic 350, Intangibles-Goodwill and Other, goodwill is not amortized but is tested for impairment, annually or more frequently when circumstances indicate a possible impairment may exist. Impairment testing is performed at a reporting unit level. An impairment loss generally would be recognized when the carrying amount of the reporting unit exceeds its fair value.\nWe estimate fair value of the applicable reporting unit or units using a discounted cash flow methodology. This methodology represents a level 3 fair value measurement as defined under ASC 820, Fair Value Measurements and Disclosures, since the inputs are not readily observable in the marketplace. The goodwill impairment testing process involves the use of significant assumptions, estimates and judgments, including projected sales, gross margins, selling, general and administrative expenses, and capital expenditures, and the selection of an appropriate discount rate, all of which are subject to inherent uncertainties and subjectivity. When we perform goodwill impairment testing, its assumptions are based on annual business plans and other forecasted results, which it believes represent those of a market participant. We select a discount rate, which is used to reflect market-based estimates of the risks associated with the projected cash flows based on the best information available as of the date of the impairment assessment. Based on the annual impairment analysis, there is impairment of $1,747,945 and $1,226,419 on the goodwill recorded in our financial statements for the years ended August 31, 2022 and 2021, respectively. The impairment loss of goodwill was primarily attributable to the impairment related to NPI as the financial performance of the reporting unit of FinTech App development continued to fall below our original expectations.\nGiven the current macro-economic environment and the uncertainties regarding its potential impact on our business, there can be no assurance that its estimates and assumptions used in its impairment tests will prove to be accurate predictions of the future. If our assumptions regarding forecasted cash flows are not achieved, it is possible that an impairment review may be triggered and goodwill may be impaired. During the year ended August 31, 2022, we expect the reporting unit of FinTech App development not to generate profits in the near future. As a result, the goodwill was fully impaired during the year ended August 31, 2022.\nRevenue recognition\nWe adopted Accounting Standards Update (ASU) No. 2014-09, Revenue from Contracts with Customers (Topic 606), which establishes principles for reporting information about the nature, amount, timing and uncertainty of revenue and cash flows arising from the entitys contracts to provide goods or services to customers. The core principle requires an entity to recognize revenue to depict the transfer of goods or services to customers in an amount that reflects the consideration that it expects to be entitled to receive in exchange for those goods or services recognized as performance obligations are satisfied.\nWe recognized revenues following the five-step model prescribed under ASU No. 2014-09:\nStep 1: Identify the contract\nStep 2: Identify the performance obligations\nStep 3: Determine the transaction price\nStep 4: Allocate the transaction price\nStep 5: Recognize revenue\nRevenues are recognized when control of the promised goods or services is transferred to our customers, which may occur at a point in time or over time depending on the terms and conditions of the agreement, in an amount that reflects the consideration we expect to be entitled to in exchange for those goods or services.\nProvision of investment platform services\nWe signed an agreement with a third party whereby the Company authorizes the third party to use our investment platform and related applications for a period until December 31, 2020. Income from provision of investment platform services with the use of our mobile applications is recognized when the service is performed.\nFrom September, 2020, we generated additional revenue from a new, more comprehensive mobile application, which refer to as the FinMaster mobile application (the FinMaster App and together with the JFB platform, the Apps), with similar functions as the JFB platform. Income from providing investment platform services with the use of a mobile application is recognized when the service is performed.\nWe offer a self-managed points program, which can be used in the FinMaster App to redeem merchandise or services. We determine the value of each point based on estimated incremental cost. Customers and advocates have a variety of ways to obtain the points. The major accounting policy for its points program is described as follows:\nWe conclude the bonus points offered linked to the purchase transaction of the points is a material right and accordingly a separate performance obligation according to ASC 606, and should be taken into consideration when allocating the transaction price of the point sales. We also estimate the probability of points redemption when performing the allocation. The amount allocated to the bonus points as separate performance obligation is recorded as contract liability (deferred revenue) and revenue should be recognized when future goods or services are transferred. We will continue to monitor when and if forfeiture rate data becomes available and will apply and update the estimated forfeiture rate at each reporting period.\nSince historical information is limited for us to determine any potential points forfeitures and most merchandise can be redeemed without requiring a significant amount of points compared with the amount of points provided to users, we have used an estimated forfeiture rate of zero.\nProvision of software development service and maintenance service\nWe entered into several agreements with third party customers to assist the customers in the development of their mobile communications software and mobile e-commerce software. Income from provision of software development service and maintenance service are recognized when the service is performed.\nImpairment of long-lived assets (including amortizable intangible assets)\nWe review the carrying values of long-lived assets for impairment whenever events or changes in circumstances indicate that the carrying value of an asset may not be recoverable. Recoverability of assets to be held and used is measured by a comparison of the carrying amount of an asset to the undiscounted future net cash flows expected to be generated by the asset. If the assets are considered to be impaired, the impairment recognized is measured by the amount by which the carrying amount of the assets exceeds the fair value of the assets. Impairment of $537,866 and $88,415 has been recorded by us for the years ended August 31, 2022 and 2021, respectively. The impairment loss of intangible assets was primarily attributable to the financial performance of NPIs technical know-hows fall below our original expectations and they assessed the recoverability of the carrying value of certain intangible assets which resulted in impairment losses.\nRecent Accounting Pronouncements\nFor further information on recently issued accounting pronouncements, see Note 2-Summary of Significant Accounting Policies in the accompanying notes to consolidated financial statements included in Part II, Item 8, Financial Statements and Supplementary Data of this Annual Report on Form 10-K.\nOff-Balance Sheet Arrangements\nAs of August 31, 2022, we have no significant off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, changes in our financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources that are material to our stockholders.\nFiscal Year\nOur fiscal year ends on August 31. Item 7A. Quantitative and Qualitative Disclosures about Market Risk.\nAs a smaller reporting company as defined by Item 10 of Regulation S-K, the Company is not required to provide the information required by this Item. Item 8. Financial Statements and Supplementary Data.\nPlease see the financial statements beginning on page located in this Form 10-K and incorporated herein by reference. Item 9. Changes in and Disagreements With Accountants on Accounting and Financial Disclosure.\nNone. Item 9A. Controls and Procedures.\nEvaluation of Disclosure Controls and Procedures\nAs required by Rule 13a-15 under the Exchange Act, our management has carried out an evaluation, with the participation and under the supervision of our Chief Executive Officer (principal executive officer) and Treasurer (principal financial officer), of the effectiveness of the design and operation of our disclosure controls and procedures as of August 31, 2022. Disclosure controls and procedures refer to controls and other procedures designed to ensure that information required to be disclosed in the reports we file or submit under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in the rules and forms of the SEC and that such information is accumulated and communicated to our management, including our principal executive officer and chief financial officer, as appropriate, to allow timely decisions regarding required disclosure. In designing and evaluating our disclosure controls and procedures, management recognizes that any controls and procedures, no matter how well designed and operated, can provide only reasonable assurance of achieving the desired control objectives, and management is required to apply its judgment in evaluating and implementing possible controls and procedures.\nManagement conducted its evaluation of disclosure controls and procedures under the supervision of our Chief Executive Officer (principal executive officer) and Treasurer (principal financial officer). Based upon, and as of the date of this evaluation, our Chief Executive Officer (principal executive officer) and Treasurer (principal financial officer) concluded that our disclosure controls and procedures were not effective as of August 31, 2022 due to the material weaknesses in our internal control over financial reporting, which are described below.\nManagements Annual Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting for the Company. Internal control over financial reporting refers to the process designed by, or under the supervision of, our Chief Executive Officer (principal executive officer) and Treasurer (principal financial officer), and effected by our board of directors, management and other personnel, to provide reasonable assurance regarding the reliability of our financial reporting and the preparation of financial statements for external purposes in accordance with U.S. GAAP, and includes those policies and procedures that:\n(1) pertain to the maintenance of records that in reasonable detail accurately and fairly reflect the transactions and dispositions of our assets;\n(2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with U.S. GAAP, and that our receipts and expenditures are being made only in accordance with the authorization of our management and directors; and\n(3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of our assets that could have a material effect on the financial statements.\nAll internal control systems, no matter how well designed, have inherent limitations. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nOur management assessed the effectiveness of our internal control over financial reporting as of August 31, 2022. In making this assessment, management used the framework set forth in the report entitled Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission, or COSO. The COSO framework summarizes each of the components of a companys internal control system, including (i) the control environment, (ii) risk assessment, (iii) control activities, (iv) information and communication, and (v) monitoring. Based on our assessment, as a result of the material weaknesses described below, our Chief Executive Officer and principal financial officer determined that, as of August 31, 2022, our internal control over financial reporting was not effective because of the following material weaknesses in our internal control over financial reporting has been identified.\nA material weakness is a deficiency or a combination of deficiencies in internal control over financial reporting such that there is a reasonable possibility that a material misstatement of our annual financial statements will not be prevented or detected in a timely basis.\nManagement identified the following material weaknesses during its assessment of internal controls over financial reporting as of August 31, 2022.\n1. We do not have an audit committee - While we are not obligated to have an audit committee, it is managements view that such a committee, including a financial expert member, is an utmost important entity level control over the Companys financial reporting. Currently, our Chief Executive Officer and directors act in the capacity of the audit committee, and do not include a member that is considered to be independent of management to provide the necessary oversight over managements activities.\n2. We do not have adequate written policies and procedures - Due to lack of adequate written policies and procedures for accounting and financial reporting, we did not establish a formal process to close our books monthly and account for all transactions in a timely manner.\n3. We did not implement appropriate information technology controls - As at August 31, 2022, we retained copies of all financial data and material agreements; however, there is no formal procedure or evidence of normal backup of our data or off-site storage of the data in the event of theft, misplacement, or loss due to unmitigated factors and we do not have sufficient control policies that prevent inappropriate and unauthorized use of the system across all layers of systems.\n4. We do not have sufficient and skilled accounting personnel with an appropriate level of technical accounting knowledge and experience in the application of accounting principles generally accepted in the United States commensurate with our financial reporting requirements.\nNotwithstanding these material weaknesses, however, management has concluded that the consolidated financial statements included in this Annual Report present fairly, in all material respects, our financial position, results of operations and cash flows for the periods presented in conformity with U.S. GAAP.\nManagements Remediation Initiatives\nIn an effort to remediate the identified material weaknesses and enhance our internal controls, we have initiated, or plan to initiate, the following series of measures:\n1. Create a position to segregate duties consistent with control objectives and increase our personnel resources and technical accounting expertise within the accounting function when funds are available to us.\n2. Prepare written policies and procedures for accounting and financial reporting to establish a formal process to close our books monthly on an accrual basis and account for all transactions, including equity and debt transactions, in a timely manner.\n3. Add staff members to our management team to make sure that information required to be disclosed in our reports filed and submitted under the Exchange Act is recorded, processed, summarized and reported as and when required and the staff members will have segregated responsibilities with regard to these responsibilities.\n4. Plan to hire professional consultant to review and assist the company to design and implement proper information technology controls and policies on the companys operations.\nWe anticipate that these initiatives will be at least partially, if not fully, implemented by the end of fiscal year 2023.\nChanges in Internal Controls over Financial Reporting\nThere was no change in our internal controls over financial reporting that occurred during the period covered by this Form 10-K, which has materially affected, or is reasonably likely to materially affect, our internal controls over financial reporting:\nThis Form 10-K does not include an attestation report of the Companys registered independent public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by the Companys registered independent public accounting firm pursuant to rules of the Securities and Exchange Commission that permit the Company to provide only managements report in this Form 10-K. Item 9B. Other Information.\nNone.\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections.\nThe public auditor for the Company for this Form 10-K, and in respect of audit report for the financial statements included in this Form 10-K, has been identified by the Public Company Accounting Oversight Board (PCAOB) as being a registered public accounting firm that is (i) located in a foreign jurisdiction and (ii) that the PCAOB has determined that it is unable to inspect or investigate completely because of a position taken by an authority in the foreign jurisdiction. As of the date of the Form 10-K filing, the Company has not been named as a Commission Identified Issuer under the Holding Foreign Companies Accountable Act (HFCA Act).\nPART III Item 10. Directors, Executive Officers and Corporate Governance\nThe following table sets forth the names and ages of all of our current directors and executive officer(s), who are appointed by, and serve at the pleasure of, the Companys board of directors.\nName\nAge\nPosition\nYi-Hsiu Lin\nChief Executive Officer, President, Secretary, Treasurer, Director\nShui Fung Cheng\nDirector\nYi-Hsiu Lin\nMr. Lin has served as our Chief Executive Officer, President, Secretary, Treasurer and a member of our board of directors since our inception. Mr. Lin has also served as a director of First Leader Capital Ltd., JFB Internet Service LTD. and Leader Financial Asset Management Limited since 2017, 2016 and 2015, respectively. Since 2014, Mr. Lin has served as a director for Aquarius Protection Fund SPC, where he is primarily responsible for administrative management and operation planning. From 2010 to the present, Mr. Lin has served as the Chief Executive Officer and a director Leader Financial Asset Management Limited, an investment advisory and management service. Mr. Lin graduated from Overseas Chinese University in Taiwan with a Bachelors Degree in Accounting in 2004. Mr. Lins extensive experience in the financial industry provides him with the qualifications and skills to serve as a director of our Company.\nShui Fung Cheng\nMr. Cheng has served as a member of our board of directors since August of 2017. Mr. Cheng has also served as a director of Leader Financial Asset Management since 2015. From 2013 to 2018, he served as a director for HF Group, a company that provides professional services for investment, skilled migration to the European Union and oversea real estate investment. Mr. Cheng was responsible for the development of business strategies, investment decisions and he oversaw all operational activities. Mr. Chengs extensive experience in management and business development provide him with the qualifications and skills to serve as a director of our Company.\nNone of our directors is related to any other director or any officer. None of our directors has been involved in a legal proceeding that requires disclosure pursuant to Item 401(f) of Regulation S-K promulgated under the Exchange Act.\nCorporate Governance\nThe Company promotes accountability for adherence to honest and ethical conduct; endeavors to provide full, fair, accurate, timely and understandable disclosure in reports and documents that the Company files with the SEC and in other public communications made by the Company; and strives to be compliant with applicable governmental laws, rules and regulations. The Company has not formally adopted a written code of business conduct and ethics that governs the Companys employees, officers and directors as the Company is not required to do so.\nIn lieu of an audit committee, the Companys board of directors is responsible for reviewing and making recommendations concerning the selection of outside auditors, reviewing the scope, results and effectiveness of the annual audit of the Companys financial statements and other services provided by the Companys independent public accountants. The board of directors and Chief Executive Officer of the Company review the Companys internal accounting controls, practices and policies. Consequently, we do not have a board member that qualifies as an audit committee financial expert as defined in Item 407(d)(5) of Regulation S-K.\nCommittees of the Board\nOur Company currently does not have nominating, compensation, or audit committees or committees performing similar functions nor does our Company have a written nominating, compensation or audit committee charter. Our directors believe that it is not necessary to have such committees, at this time, because the directors can adequately perform the functions of such committees.\nInvolvement in Certain Legal Proceedings\nThere have been no events under any bankruptcy act, no criminal proceedings and no judgments, injunctions, orders or decrees material to the evaluation of the ability and integrity of any director, executive officer, promoter or control person of the Company during the past ten years.\nIndependence of Directors\nWe are not required to have independent members of our board of directors, and do not anticipate having independent directors until such time as we are required to do so.\nCode of Ethics\nWe have not adopted a formal code of ethics. The board of directors evaluated the business of the Company and the number of employees and determined that since the business is operated by a small number of persons, general rules of fiduciary duty and federal and state criminal, business conduct and securities laws are adequate ethical guidelines. In the event our operations, employees and/or directors expand in the future, we may take actions to adopt a formal code of ethics.\nShareholder Proposals\nOur Company does not have any defined policy or procedural requirements for stockholders to submit recommendations or nominations for directors. The board of directors believes that, given the stage of our development, a specific nominating policy would be premature and of little assistance until our business operations develop to a more advanced level. Our Company does not currently have any specific or minimum criteria for the election of nominees to the board of directors and we do not have any specific process or procedure for evaluating such nominees. The board of directors will assess all candidates, whether submitted by management or stockholders, and make recommendations for election or appointment.\nA shareholder who wishes to communicate with our board of directors may do so by directing a written request addressed to our Chief Executive Officer at the address appearing on the first page of this Form 10-K.\nDelinquent Section 16(a) Reports\nPursuant to Section 16(a) of the Securities Exchange Act of 1934, the Companys directors, officers and persons who beneficially own 10% or more of the common stock are required to file reports specifying their initial ownership of common stock and subsequent changes in that ownership to the SEC. These reports are required to be filed within specified time periods established by the SEC. Based solely on our review of reports filed with the SEC, we believe that no director, officer, or 10% shareholder failed to timely file in fiscal year ended August 31, 2022 any report required by Section 16(a), other than the following transactions:\n(i) filing by Yi-Hsiu Lin, the Companys Chief Executive Officer and a member of the Companys board of directors, with respect to one transaction dated January 21, 2022 pertaining to the award of an employee stock option for 1,000,000 shares of common stock, which was fully vested as of January 21, 2022. Such late Form 4 was filed on January 26, 2022; and\n(ii) filing by Mr. Shui Fung Cheng, a member of the Companys board of directors, with respect to one transaction dated January 21, 2022 pertaining to the award of an employee stock option for 500,000 shares of common stock, which was fully vested as of January 21, 2022. Such late Form 4 was filed on January 26, 2022. Item 11. Executive Compensation\nThe following table sets forth the cash and other compensation paid by the Company to its named executive officer and directors during the years ended August 31, 2022 and 2021.\nName and Position Year ($) Salary ($) Bonus ($) Stock Awards(1) ($) Option\nAwards ($) All Other\nCompensation ($) Total ($)\nYi-Hsiu Lin\nChief Executive Officer,\nPresident, Secretary, Treasurer and director None (2) None 250,000 None 24,895 (3) 274,895\nNone None 1,000,000 None 34,208 1,034,208\nShui Fung Cheng\nDirector None (4) None 150,000 None 20,906 (3) 170,906\nNone None 600,000 None 28,229 628,229\n(1) The amounts in the Stock Awards column do not reflect compensation actually received by our executive officers. Rather, these amounts represent the aggregate grant date fair value of all service based RSUs and the target value of the performance based RSUs granted during each fiscal year computed in accordance with FASB ASC Topic 718, Compensation - Stock Compensation.\n(2) In lieu of Mr. Lins $120,000 annual salary, the Company elected to compensate Mr. Lin with 2,500,000 shares of restricted common stock pursuant to the terms of his employment agreement.\n(3) Amount reflects a monthly allowance payable to the individual.\n(4) In lieu of Mr. Chengs $80,000 annual compensation, the Company elected to compensate Mr. Cheng with 1,500,000 shares restricted common stock pursuant to the terms of his director offer letter.\nEmployment Agreement(s)\nOn September 1, 2019, the Company entered into an employment agreement with Yi-Hsiu Lin to serve as the Chief Executive Officer of the Company for a two year term. Pursuant to the agreement, Mr. Lin will be compensated at an annual rate of $50,000 per year (the Base Compensation), prorated for any partial year. In place of Base Compensation, the Company, at its option, may pay Mr. Lin 2,500,000 shares of restricted stock, which would vest as of September 16, 2019. In addition, Mr. Lin may be entitled to bonus compensation of up to three (3) times Base Compensation based on his achievement of appropriate performance criteria to be determined by the board of directors or a committee thereof. The agreement will terminate upon death and total or permanent disability. It may also be terminated for cause, as defined in the agreement, upon three days notice if the triggering incident has not been cured in a reasonable time, but no less than 14 days. Additionally, during his employment and for a period of two years following the termination of his employment, Mr. Lin agreed not to: (a) directly solicit, encourage, or take any other action which is intended to induce any other employee of the Company to terminate his or her employment with the Company; or (b) directly interfere in any manner with the contractual or employment relationship between the Company and any such employee of the Company. Similarly, during his employment and for a period of two years following the termination of his employment, Mr. Lin agreed not to directly or indirectly, whether for his own account or for the account of any other individual or entity, solicit the business or patronage of any customers of the Company with respect to products and/or services directly related to a competitive business activity, as defined in the agreement. The agreement also contains a standard confidentiality clause.\nOn September 1, 2021, the Company renewed the employment agreement with Yi-Hsiu Lin for additional two years. Pursuant to the agreement, Mr. Lin will be compensated at an annual rate of $120,000 per year (the Base Compensation), prorated for any partial year, payable in cash or with 2,500,000 shares of restricted common stock, which would vest as of March 1, 2022 and March 1, 2023. In addition, Mr. Lin may be entitled to bonus compensation of up to three times the Base Compensation based on his achievement of appropriate performance criteria to be determined by the board of directors or a committee thereof.\nDirector Compensation\nOn September 1, 2019, the Company issued a director offer letter to Shui Fung Cheng, pursuant to which Mr. Cheng agreed to serve as a member of our board of directors for a one year term. For his service as a director, Mr. Cheng will receive annual compensation in the form of $30,000 in cash or 1,500,000 shares of restricted common stock. The offer letter contains a customary termination provision and standard confidentiality clauses; and will be automatically renewed unless the director resigned or a new offer letter is entered into.\nOn September 1, 2021, the Company issued a director offer letter to Shui Fung Cheng, pursuant to which Mr. Cheng agreed to serve as member of our board of directors for a one year term. For his service as a director, Mr. Cheng will receive annual compensation in the form of $80,000 in cash or 1,500,000 shares of restricted common stock. The offer letter contains a customary termination provision and standard confidentiality clauses; and will be automatically renewed unless the director resigned or a new offer letter is entered into. On September 1, 2022, the Company issued a director offer letter to Shui Fung Cheng with the same terms as last years.\nAs of the date of the filing of this Form 10-K, $441,737 has been paid to our directors by cash and stock compensation. In the future, the Company may decide to award the members of the board of directors cash or stock based consideration for their services to the Company, which awards, if granted shall be in the sole determination of the board of directors.\nExecutive Compensation Philosophy\nOur board of directors determines the compensation given to our executive officers in their sole discretion. Our board of directors reserves the right to pay our executive or any future executives a salary, and/or issue them shares of common stock issued in consideration for services rendered and/or to award incentive bonuses that are linked to our performance, as well as to the individual executive officers performance. This package may also include long-term stock based compensation to certain executives, which is intended to align the performance of our executives with our long-term business strategies. Additionally, while our board of directors has not granted any performance base stock options to date, the board of directors reserves the right to grant such options in the future, if they in their sole determination believes such grants would be in the best interests of the Company.\nIncentive Bonus\nThe board of directors may grant incentive bonuses to our executive officer and/or future executive officers in its sole discretion, if the board of directors believes such bonuses are in the Companys best interest, after analyzing our current business objectives and growth, if any, and the amount of revenue we are able to generate each month, which revenue is a direct result of the actions and ability of such executives.\nLong-term, Stock Based Compensation\nIn order to attract, retain and motivate executive talent necessary to support the Companys long-term business strategy we may award our executive and any future executives with long-term, stock-based compensation in the future, at the sole discretion of our board of directors, which we do not currently have any immediate plans to award. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe following table sets forth certain information as of December 8, 2022, regarding the beneficial ownership of our common stock by the following persons:\n● our Named Executive Officer;\n● each director;\n● our executive officer and director as a group; and\n● each person or entity who, to our knowledge, owns more than 5% of our common stock.\nExcept as indicated in the footnotes to the following table, subject to applicable community property laws, each stockholder named in the table has sole voting and investment power. Unless otherwise indicated, the address for each stockholder listed is c/o Leader Capital Holdings Corp., Room 2708-09, Metropolis Tower, 10 Metropolis Drive, Hung Hom, Hong Kong. Shares of common stock subject to options, warrants, or other rights currently exercisable or exercisable within 60 days of December 8, 2022, are deemed to be beneficially owned and outstanding for computing the share ownership and percentage of the stockholder holding the options, warrants or other rights, but are not deemed outstanding for computing the percentage of any other stockholder. The information provided in the following table is based on our records, information filed with the SEC, and information furnished by our stockholders.\nAs of December 8, 2022, the Company has 200,470,825 shares of common stock issued and outstanding, which number of issued and outstanding shares of common stock have been used throughout this Form 10-K.\nName and Address of Beneficial Owner Shares of\nCommon Stock\nBeneficially\nOwned Total Voting\nPercentage\nBeneficially\nOwned\nNamed Executive Officers and Directors\nYi-Hsiu Lin 58,537,778 (1) 29.2 %\nShui Fung Cheng 8,839,225 (2) 4.4 %\nAll Directors and Officers as a Group (2 individuals) 62,306,725 (3) 31.1 %\nMore than 5% Beneficial Owner\nJun- Yuan Chen(4) 12,683,023 6.3 %\nFirst Leader Capital Ltd.(5) 32,867,500 16.4 %\n(1) Consists of (i) 7,600,000 shares of common stock beneficially held by Mr. Lin, (ii) 32,867,500 shares of common stock beneficially held by First Leader Capital Ltd., over which Mr. Lin has sole voting and investment power as the sole owner of such entity, (iii) 3,000,000 shares of common stock beneficially held by CPN Investment Ltd., over which Mr. Lin has sole voting and investment power, (iv) 5,070,278 shares of common stock beneficially held by Leader Financial Asset Management Limited, a company incorporated in the Cayman Islands, over which Mr. Lin has shared voting and investment power over as a director of such entity, and (v) 10,000,000 shares of common stock beneficially held by Anzhao International Limited, over which Mr. Lin has voting and investment power given that he has the sole right to appoint the trustee of the Gratis Trust and the right to remove any such trustee with or without cause or for any reason, which trust has the right to appoint or remove the director of Anzhao International Limited.\n(2) Consists of (i) 3,768,947 shares of common stock beneficially held by Mr. Cheng and (ii) 5,070,278 shares of common stock beneficially held by Leader Financial Asset Management Limited, over which Mr. Cheng has shared voting and investment power as a director of such entity.\n(3) Consists of (i) 7,600,000 shares of common stock beneficially held by Mr. Lin, (ii) 3,768,947 shares of common stock beneficially held by Mr. Cheng, (iii) 32,867,500 shares of common stock beneficially held by First Leader Capital Ltd., over which Mr. Lin has sole voting and investment power as the sole owner of such entity, (iv) 3,000,000 shares of common stock beneficially held by CPN Investment Ltd., over which Mr. Lin has sole voting and investment power, (v) 5,070,278 shares of common stock beneficially held by Leader Financial Asset Management Limited, a company incorporated in the Cayman Islands, over which Messrs. Lin and Cheng have shared voting and investment power over as directors of such entity, and (vi) 10,000,000 shares of common stock beneficially held by Anzhao International Limited, over which Mr. Lin has voting and investment power given that he has the sole right to appoint the trustee of the Gratis Trust and the right to remove any such trustee with or without cause or for any reason, which trust has the right to appoint or remove the director of Anzhao International Limited.\n(4) All of the 12,683,023 shares of common stock beneficially held by Mr. Chen, who was the COO of JFB; and Mr. Chen has resigned from JFB as at September 30 ,2022.\n(5) Mr. Lin has sole voting and investment power over these shares of common stock as the sole owner of this entity. The mailing address of this beneficial holder is 9F-3, No.910, Sec.2, Taiwan Blvd., Xitun Dist., Taichung City 407, Taiwan (R.O.C).\nSecurities Authorized for Issuance under Equity Compensation Plans\nAs of August 31, 2022, the Company has not authorized any securities for issuance under an equity compensation plan. Item 13. Certain Relationships and Related Transactions, and Director Independence.\nRelated Party Transactions\nSEC regulations define the related person transactions that require disclosure to include any transaction, arrangement or relationship in which the amount involved exceeds the lesser of $120,000 or one percent of the average of our total assets at year-end for the last two completed fiscal years in which we were or are to be a participant and in which a related person had or will have a direct or indirect material interest. A related person is: (i) an executive officer, director or director nominee, (ii) a beneficial owner of more than 5% of our common stock, (iii) an immediate family member of an executive officer, director or director nominee or beneficial owner of more than 5% of our common stock, or (iv) any entity that is owned or controlled by any of the foregoing persons or in which any of the foregoing persons has a substantial ownership interest or control.\nFor the period from September 1, 2019, through the date of this report, described below are certain transactions or series of transactions between us and certain related persons.\nOn September 1, 2018 (before the acquisition of NPI), JFB appointed LOC to develop a mobile application in four stages for a total consideration of TWD20,000,000 ($651,466), payable in the form of common shares of the Company. As of August 31, 2019, the first and second stages of development for the basic functions of the mobile application have been completed, and the Company has issued a total of 908,678 of restricted common shares in aggregate at $0.50 per share for the work completed up to August 31, 2019. The Company has expensed $454,339 development costs for the first and second development stage in general and administrative expenses for the year ended August 31, 2019. In August 2020, the development of the mobile application has been completed, and the Company expensed $0.2 million development costs in general and administrative expenses for the year ended August 31, 2020. Further $0.6 million was incurred for additional functions developed and $0.2 million was incurred for the acquisition of the ownership of the intellectual property.\nFrom April 2019, the Company entered into multiple loan agreements with LOC and BJDC. The loans are secured by personal guarantees of certain of its ultimate stockholders, bear interest at 8% per annum, and are due on various dates through August 2021. No interests were charged for these two companies for the years ended August 31, 2022 and 2021.\nThe Company sublet its commercial office in Taipei to Greenpro LF Limited under non-cancelable operating lease at a monthly rental of HK$22,000 ($2,821), adjusted to HK$22,900 ($2,936) from November 1, 2019, with a term of 31 months until October 31, 2020. Greenpro LF Limited was also obligated to pay the Company HK$230,000 ($29,487) for leasehold improvements. The sub-letting arrangement was terminated by agreement of the parties early on February 28, 2019. The Company received $nil and $1,838 in leasehold improvements income from Greenpro LF Limited for the years ended August 31, 2022 and 2021, respectively. Our Chief Executive Officer, Mr. Yi-Hsiu Lin, is a director of Greenpro LF Limited.\nOn September 1, 2020, LOC leased an office in Taichung, Taiwan from the Companys shareholder - Yu-Cheng Tu. The lease was renewed on April 1, 2021 for additional one-year term. The monthly lease was for the amount of NTD 45,000 ($1,595), with a term of one year. During the years ended August 31, 2022 and 2021, the Company recognized rental expenses of $3,142 and $19,135, respectively that are included in general and administrative expenses.\nOn June 1, 2021, JFB leased an office in Taipei, Taiwan from the Company in which Mr. Yi-Hsiu Lin was the shareholder of its ultimate holding company. The monthly lease was for the amount of NTD 82,062 ($2,865), with a term of 16 months. During the year ended August 31, 2022 and 2021, the Company recognized rental expenses of $34,571 and $8,724, respectively that are included in general and administrative expenses.\nThe Company entered into a development agreement (the Customized App Development Agreement) providing the online and offline learning opportunities across different subjects on January 27, 2022 with DFP Holdings Limited (DFP). As of August 31, 2022, the Company and Yi-Hsiu Lin held 7.06% and 7.06%, respectively of DFPs outstanding common stock. The Company delivered an app and provided the follow-up maintenance service in August 2022. The Company recorded $301,500 as software development service income to DFP. Furthermore, the Company provided software maintenance service to DFP and recorded $2,898 during August 31, 2022.\nThe Company had entered into a bond purchase agreement (Bond Purchase Agreement) with Chin-Nan Wang (became Companys shareholder in May, 2021) on August 14, 2019, pursuant to which the Company issued and sold to the purchaser a bond at an aggregate principal amount and an aggregate purchase price of $600,000. The bond will mature in three years from August 14, 2019. Interest on the bond will be payable on semi-yearly basis at 10% per annum. The Company may exercise its right to repay this bond at any time on or before two years from the maturity date by wiring 100% of all outstanding principal and interest(s) to the Purchaser. On August 10, 2022, the bond was further extended to August 14, 2023 and 12% p.a. interest was payable quarterly. The bond was collateralized by 2,000,000 shares of DFP Holdings Limited and 1,000,000 shares of Reblood Biotech Corp. simultaneously held by Yi-Hsiu Lin. Interest of $60,000 was incurred for the years ended August 31, 2022 and 2021, respectively.\nOn February 24, 2020, the Company issued a convertible promissory note in the principal amount of $110,000, which accrues interest at the rate of 6% per annum, to a shareholder - Teh-Ling Chen. The note is due on February 24, 2022 and unsecured. On August 18, 2020, two of the Noteholders submitted conversion notices to the Company converting all of the outstanding balances of their Notes into an aggregate of 325,000 shares of the Companys common stock.\nOn February 27, 2020, the Company issued a convertible promissory note in the principal amount of $20,000, which accrues interest at the rate of 6% per annum, to a shareholder - Li-Ching Yang. The note is due on February 27, 2022 and unsecured.\nOn August 17, 2020, the Company entered into amendments to the Notes and the convertible promissory note purchase agreements with each of the Noteholders, wherein, at the sole option of the applicable Noteholder, all or part of the unpaid outstanding principal of such Noteholders Note would be convertible into shares of restricted common stock of the Company at a conversion price equal to $0.40 per share. On August 18, 2020, two of the Noteholders, Teh-Ling Chen and Li-Ching Yang submitted conversion notices to the Company converting all of the outstanding balances of their Notes into an aggregate of 325,000 shares of the Companys common stock.\nOn March 18, 2020, the Company issued an unsecured note in the principal amount of $100,000, which accrues interest at the rate of 6% per annum, to a shareholder - Jui-Chin Chen. On August 17, 2020, the Company amended the Note and the Agreement, wherein, at the sole option of the applicable noteholder, all or part of the unpaid outstanding principal of such noteholders Note would be convertible into shares of restricted common stock of the Company at a conversion price equal to $0.40 per share. On March 23, 2022, the Company further amended the Note and the Agreement with the noteholder, mutually agreed to cancel the conversion option and to repay the principal in two installments and accrued interest during that period before October 31, 2022. The balance was classified as 6% short-term loan on the same date. On May 29, 2022, the Company further amended the Note and the Agreement with the noteholder, mutually agreed to repay the principal and interests in five installments before November 30, 2022. For the year ended August 31, 2022, principal of $20,000 was repaid. On November 29, 2022, the loan and interests payable were further extended to November 30, 2023. $Nil was subsequently repaid by the Company as of December 14, 2022.\nOn November 2, 2020, the Company issued a Note in the principal amount of $100,000, which accrues interest at the rate of 6% per annum, to a shareholder - Teh-Ling Chen. The note is due on November 2, 2022 and unsecured. On May 10, 2022, the Company entered into an amendment to the Note with the shareholder, wherein, at the sole option of the applicable noteholder, all or part of the unpaid outstanding principal of such noteholders Note would be convertible into shares of restricted common stock of the Company at a conversion price equal to $0.10 per share. On May 12, 2022, the shareholder submitted conversion notice to the Company converting all of the outstanding balance of his Note into an aggregate of 1,000,000 shares of the Companys common stock. The conversion was approved by the Company on May 17, 2022 and the shares were issued on May 19, 2022.\nOn November 25, 2020, the Company issued a Note in the principal amount of $200,000, which accrues interest at the rate of 6% per annum, to a shareholder - Chin-Chiang Wang. The Note is due on November 25, 2022 and unsecured. On May 3, 2022, the Company entered into an amendment to the Note and the convertible promissory note purchase agreement with Chin-Chiang Wang, mutually agreed to extend the maturity date to November 25, 2024 and cancel the conversion option. The balance was classified as non-current 6% loan on the same date.\nOn November 25, 2020, the Company issued several Notes in the total principal amount of $400,000, which accrues interest at the rate of 6% per annum, to shareholders - Chin-Ping Wang and Chin-Nan Wang. The notes are due on November 25, 2022 and unsecured. On January 24, 2022, the Company entered into an amendment to the Notes with these two shareholders, wherein, at the sole option of the applicable noteholder, all or part of the unpaid outstanding principal of such noteholders Notes would be convertible into shares of restricted common stock of the Company at a conversion price equal to $0.25 per share. On January 26, 2022, the shareholders submitted conversion notices to the Company converting all of the outstanding balances of their Notes into an aggregate of 1,600,000 shares of the Companys common stock. The conversion was approved by the Company on January 31, 2022 and the shares were issued on March 15, 2022.\nOn January 15, 2021, the Company issued a Note in the principal amount of $100,000, which accrues interest at the rate of 6% per annum, to a shareholder - Teh-Ling Chen. The note is due on January 15, 2023 and unsecured. On May 10, 2022, the Company entered into an amendment to the Note with the shareholder, wherein, at the sole option of the applicable noteholder, all or part of the unpaid outstanding principal of such noteholders Note would be convertible into shares of restricted common stock of the Company at a conversion price equal to $0.10 per share. On May 12, 2022, the shareholder submitted conversion notice to the Company converting all of the outstanding balance of his Note into an aggregate of 1,000,000 shares of the Companys common stock. The conversion was approved by the Company on May 17, 2022 and the shares were issued on May 19, 2022.\nOn February 28, 2022, the Company obtained a loan of RMB1,000,000 ($145,159) from Chun-Shuo Huang, which accrues interest at the rate of 8% per annum. The loan was due on May 27, 2022 and further extended to December 31, 2022 and accrued interest at the rate of 2% per month. Interest of $12,366 was incurred for the year ended August 31, 2022. $Nil was subsequently repaid by the Company as of December 14, 2022.\nThe Company borrowed non-interest bearing loans in the aggregate amount of NTD4,000,000 ($131,665) from Mei-Ying Huang. The loan of NTD2,500,000 ($82,291) borrowed on November 24, 2021 was due on May 24, 2022 but further extended to December 31, 2022. During the year ended August 31, 2022, NTD1,500,000 ($49,374) was repaid. The loan of NTD1,000,000 ($32,916) borrowed on January 12, 2022 was fully repaid on July 22, 2022. NTD420,000 ($13,825) was repaid for the remaining loan of NTD500,000 ($16,458) obtained on February 9, 2022 which would be repayable based on the Companys financial ability.\nDuring the years ended August 31, 2022 and 2021, interests of $94,523 and $102,196 were incurred on the convertible notes payable, other loans and bonds payable to related parties, respectively.\nDuring the years ended August 31, 2022 and 2021, the Company recorded a fair value loss of $3,980,908 and $47,092 on the convertible promissory notes for the years ended August 31, 2022 and 2021, respectively. The fair value loss is due to change of conversion price and conversion of convertible notes. The Company elected to measure the convertible notes in their entirety at fair value with changes in fair value recognized as non-operating income or loss at each balance sheet date or conversion date.\nAs of August 31, 2022, Mr. Lin has advanced an aggregate total of $973,564 to the Company for working capital purposes. The loan is unsecured, bears no interest and is payable upon demand.\nReview, Approval and Ratification of Related Party Transactions\nGiven our small size and limited financial resources, we have not adopted formal policies and procedures for the review, approval or ratification of transactions, such as those described above, with our executive officer(s), director(s) and significant stockholders. We intend to establish formal policies and procedures in the future, once we have sufficient resources and have appointed additional directors, so that such transactions will be subject to the review, approval or ratification of our board of directors, or an appropriate committee thereof. On a moving forward basis, our directors will continue to approve any related party transaction.\nDirector Independence\nOur board of directors currently consists of two directors. None of our directors are independent as defined in Rule 5605(a)(2) of the Nasdaq listing rules. We may appoint an independent director or directors to our board of directors in the future, particularly to serve on appropriate committees should they be established. Item 14. Principal Accounting Fees and Services.\nSet forth below are approximate fees for services rendered by Centurion ZD CPA & Co., our independent registered public accounting firm, and by TAAD LLP for the fiscal year ended August 31, 2022 and 2021.\nAudit Fees $ 166,400 $ 153,500\nAudit Related Fees $ - $ 10,000\nTax Fees $ 12,000 $ 12,833\nAll Other Fees $ - $ -\nAudit Fees\nThe fees for the audit services billed and to be billed by Centurion ZD CPA & Co. for the years ended August 31, 2022 and 2021 amounted to $166,400 and $153,500, respectively.\nAudit-Related Fees\nThe fees for the audit-related services billed and to be billed by Centurion ZD CPA & Co. for the years ended August 31, 2022 and 2021 amounted to $nil and $10,000 respectively.\nTax Fees\nThere were no tax fees billed by Centurion ZD CPA & Co. for the years ended August 31, 2022 and 2021. Tax fees of $12,000 and $12,833 were billed by TAAD LLP in the fiscal years ended August 31, 2022 and 2021, respectively.\nAll Other Fees\nThere were no fees billed by Centurion ZD CPA & Co. for other products and services for the years ended August 31, 2022 and 2021.\nAudit Committees Pre-Approval Process\nThe Company does not have a standing audit committee or a committee performing similar functions.\nPART IV Item 15. Exhibits and Financial Statement Schedules\n(a) Financial Statements\nWe have filed the following documents as part of this Form 10-K:\n1. Financial Statements:\nPage No.\nReport of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets as of August 31, 2022 and 2021\nConsolidated Statements of Operations and Comprehensive Loss for the years ended August 31, 2022 and 2021\nConsolidated Statements of Changes in Stockholders Equity for the years ended August 31, 2022 and 2021\nConsolidated Statements of Cash Flows for the years ended August 31, 2022 and 2021\nNotes to the Consolidated Financial Statements\n2. Financial Statement Schedules\nAll schedules have been omitted because they are not required, not applicable, not present in amounts sufficient to require submission of the schedule, or the required information is otherwise included\n(b) Exhibits\nExhibit No.\nDescription\n2.1\nStock Purchase Agreement, dated as of August 17, 2020, among Leader Capital Holdings Corp., JFB Internet Service Limited, Nice Products Inc., the Sellers and the Sellers Representative (incorporated by reference to Exhibit 2.1 to the current report on Form 8-K of the Company, filed with the SEC on August 21, 2020).\n3.1\nArticles of Incorporation (incorporated by reference to Exhibit 3.1 to the registration statement on Form S-1 of the Company, filed with the SEC on November 14, 2017).\n3.2\nBylaws (incorporated by reference to Exhibit 3.2 to the registration statement on Form S-1 of the Company, filed with the SEC on November 14, 2017).\n4.1\nSpecimen Stock Certificate (incorporated by reference to Exhibit 4.1 to the registration statement on Form 10-12G of the Company, filed with the SEC on March 27, 2020).\n4.2\nForm of Bond (incorporated by reference to Exhibit 10.1 to the current report on Form 8-K of the Company, filed with the SEC on August 19, 2019).\n4.3*\nDescription of Registrants Securities.\n10.1\nTenancy Agreement, dated April 15, 2019, by and between JFB Internet Service Limited and Calvary Consultant Limited (incorporated by reference to Exhibit 10.1 to the annual report on Form 10-K for the year ended August 31, 2019 of the Company, filed with the SEC on November 29, 2019).\n10.2\nEmployment Agreement, dated September 1, 2019, by and between the Company and Yi-Hsiu Lin (incorporated by reference to Exhibit 10.2 to the annual report on Form 10-K for the year ended August 31, 2019 of the Company, filed with the SEC on November 29, 2019).\n10.3\nDirector Offer Letter, dated September 1, 2019, by and between the Company and Shui Fung Cheng (incorporated by reference to Exhibit 10.3 to the annual report on Form 10-K for the year ended August 31, 2019 of the Company, filed with the SEC on November 29, 2019).\n10.4\nConsulting Agreement, dated September 1, 2019, by and between the Company and Kuo-Hsun Hsu (incorporated by reference to Exhibit 10.1 to the quarterly report on Form 10-Q for the quarterly period ended November 30, 2019 of the Company, filed with the SEC on January 14, 2020).\n10.5\nConsulting Agreement, dated September 1, 2019, by and between the Company and Chien Chiao (incorporated by reference to Exhibit 10.2 to the quarterly report on Form 10-Q for the quarterly period ended November 30, 2019 of the Company, filed with the SEC on January 14, 2020).\n10.6\nForm of Bond Purchase Agreement (incorporated by reference to Exhibit 10.2 to the current report on Form 8-K of the Company, filed with the SEC on August 19, 2019).\n10.7\nStock Forfeiture Letter, dated as of June 30, 2020, by and between Leader Capital Holdings Corp. and First Leader Capital Ltd. (incorporated by reference to Exhibit 10.1 to the current report on Form 8-K of the Company, filed with the SEC on July 7, 2020).\n10.8\nForm of Convertible Promissory Notes Purchase Agreement (incorporated by reference to Exhibit 10.1 to the current report on Form 8-K of the Company, filed with the SEC on August 21, 2020).\n10.9\nForm of Amendment No. 1 to the Promissory Note and the Convertible Promissory Notes Purchase Agreement (incorporated by reference to Exhibit 10.2 to the current report on Form 8-K, filed with the SEC on August 21, 2020).\n10.10\nConsulting Agreement, dated November 1, 2020, by and between the Company and Yi-Fang Liao (incorporated by reference to Exhibit 10.1 to the quarterly report on Form 10-Q filed with the SEC on January 19, 2021).\n10.11\nConsulting Agreement, dated November 1, 2020, by and between the Company and Chia-Jung Liang (incorporated by reference to Exhibit 10.2 to the quarterly report on Form 10-Q filed with the SEC on January 19, 2021).\n10.12\nConsulting Agreement, dated March 1, 2021, by and between the Company and Raymond Kwan (incorporated by reference to Exhibit 10.1 to the quarterly report on Form 10-Q filed with the SEC on April 19, 2021).\n10.13\nForm of Securities Purchase Agreement (incorporated by reference to Exhibit 10.1 to the current report on Form 8-K, filed with the SEC on May 20, 2021).\n10.14\nStock Forfeiture Letter, dated May 17, 2021, by and between Leader Capital Holdings Corp. and First Leader Capital Ltd. (incorporated by reference to Exhibit 10.3 to the current report on Form 8-K, filed with the SEC on May 20, 2021).\n10.15\nForm of Securities Purchase Agreement (incorporated by reference to Exhibit 10.1 to the current report on Form 8-K, filed with the SEC on September 2, 2021).\n10.16\nForm of Securities Purchase Agreement (incorporated by reference to Exhibit 10.1 to the current report on Form 8-K, filed with the SEC on September 10, 2021).\n21.1*\nSubsidiaries of Leader Capital Holdings Corp.\n31.1*\nCertification of Principal Executive Officer pursuant to Section 302 of Sarbanes-Oxley Act of 2002.\n31.2*\nCertification of Principal Financial Officer pursuant to Section 302 of Sarbanes-Oxley Act of 2002.\n32.1**\nCertification of the Companys Principal Executive Officer and Principal Financial Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n101.INS*\nInline XBRL Instance Document.\n101.SCH*\nInline XBRL Taxonomy Extension Schema Document.\n101.CAL*\nInline XBRL Taxonomy Extension Calculation Linkbase Document.\n101.DEF*\nInline XBRL Taxonomy Extension Definition Linkbase Document.\n101.LAB*\nInline XBRL Taxonomy Extension Labels Linkbase Document.\n101.PRE*\nInline XBRL Taxonomy Extension Presentation Linkbase Document.\nCover Page Interactive Data File (embedded within the Inline XBRL document)\n* Filed herewith.\n** Furnished herewith.\nManagement contracts or compensation plans or arrangements in which directors or executive officers are eligible to participate.\nItem 16. Form 10-K Summary.\nNone\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nLEADER CAPITAL HOLDINGS CORP.\nDate: December 14, 2022 By: /s/ Yi-Hsiu Lin\nTitle: Yi-Hsiu Lin\nChief Executive Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nName\nTitle\nDate\nBy: /s/ Yi-Hsiu Lin\nChief Executive Officer, President, Secretary, Treasurer, and Director\nDecember 14, 2022\nYi-Hsiu Lin\n(Principal Executive Officer, Principal Financial Officer, and Principal Accounting Officer)\nBy: /s/ Shui Fung Cheng\nDirector\nDecember 14, 2022\nShui Fung Cheng\nFINANCIAL STATEMENTS AND EXHIBITS\nPage No.\nReport of Independent Registered Public Accounting Firm (PCAOB ID: 2769)\nConsolidated Balance Sheets as of August 31, 2022 and 2021\nConsolidated Statements of Operations and Comprehensive Loss for the years ended August 31, 2022 and 2021\nConsolidated Statements of Changes in Stockholders Equity for the years ended August 31, 2022 and 2021\nConsolidated Statements of Cash Flows for the years ended August 31, 2022 and 2021\nNotes to the Consolidated Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Stockholders of\nLeader Capital Holdings Corp.\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheets of Leader Capital Holdings Corp. and its subsidiaries (the Company) as of August 31, 2022 and 2021, the related consolidated statements of operations and comprehensive loss, changes in stockholders equity (deficit) and cash flows for each of the two years ended August 31, 2022, and the related notes (collectively referred to as the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of August 31, 2022, and the results of its operations and its cash flows for the two years ended August 31, 2022, in conformity with accounting principles generally accepted in the United States.\nConsideration of the Companys Ability to Continue as a Going Concern\nThe accompanying consolidated financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 2 to the consolidated financial statements, the Company has suffered recurring losses from operations, and records an accumulated deficit and a net stockholders deficit as of August 31, 2022, and currently has net working capital deficit. These conditions raise substantial doubt about the Companys ability to continue as a going concern. Managements plans in regard to these matters are also described in Note 2. These consolidated financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys consolidated financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\n/s/ Centurion ZD CPA & Co.\nCenturion ZD CPA & Co.\nWe have served as the Companys auditor since 2019.\nHong Kong, China\nDecember 14,\nPCAOB ID: 2769\nLEADER CAPITAL HOLDINGS CORP\nCONSOLIDATED BALANCE SHEETS\nAS OF AUGUST 31, 2022 AND 2021\n(In U.S. dollars except share and per share data)\nAs of August 31,\nASSETS\nCurrent assets:\nCash and cash equivalents $ 213,270 $ 787,154\nAccounts receivable, net 4,413 1,567\nPrepayments, deposits and other receivables 176,201 231,715\nInventory 8,074 1,128\nTotal current assets 401,958 1,021,564\nNon-current assets\nNon-marketable equity securities 1,500 -\nPlant and equipment, net 71,004 69,760\nIntangible assets 4,304 630,809\nGoodwill - 1,747,945\nOperating lease right-of-use assets, net 227,230 352,354\nPrepayments, deposits and other receivables 12,822 102,339\nTotal non-current assets 316,860 2,903,207\nTOTAL ASSETS $ 718,818 $ 3,924,771\nLIABILITIES AND STOCKHOLDERS EQUITY\nCurrent liabilities\nAccrued expenses and other payables $ 450,555 $ 374,269\nContract liabilities 169,951 16,225\nOperating lease liability, current 150,381 292,024\nOther loans from shareholders, current 260,709 -\nDue to shareholders 45,343 53,791\nDue to a director 973,564 1,098,374\nBonds payable to related party 600,000 600,000\nConvertible notes payable to related parties - 108,000\nTotal current liabilities 2,650,503 2,542,683\nNon-current liabilities\nOperating lease liability, non-current 68,422 60,331\nDeferred tax liabilities - 125,502\nOther loans from shareholders, non-current 200,000 -\nConvertible notes payable to related parties - 882,000\nTotal non-current liabilities 268,422 1,067,833\nTOTAL LIABILITIES $ 2,918,925 $ 3,610,516\nCOMMITMENTS AND CONTINGENCIES (Note 16) - -\nSTOCKHOLDERS EQUITY\nPreferred stock, $0.0001 par value; 200,000,000 shares authorized; None issued and outstanding - -\nCommon stock, $0.0001 par value; 600,000,000 shares authorized; 191,770,825 and 157,949,219 shares issued and outstanding as of August 31, 2022 and 2021, respectively 19,177 15,795\nAdditional paid-in capital 32,339,182 23,470,641\nAccumulated other comprehensive income (loss) 362,698 (171,114 )\nAccumulated deficits (34,921,164 ) (23,001,067 )\nTOTAL STOCKHOLDERS (DEFICIT) EQUITY $ (2,200,107 ) $ 314,255\nTOTAL LIABILITIES AND STOCKHOLDERS EQUITY (DEFICIT) $ 718,818 $ 3,924,771\nSee accompanying notes to the consolidated financial statements.\nLEADER CAPITAL HOLDINGS CORP\nCONSOLIDATED STATEMENTS OF OPERATIONS AND COMPREHENSIVE LOSS\nFOR THE YEARS ENDED AUGUST 31, 2022 AND 2021\n(In U.S. dollars except share and per share data)\nYear ended August 31,\nREVENUE $ 339,442 $ 95,166\nOPERATING EXPENSES\nResearch and development expenses (510,723 ) (602,118 )\nSales and marketing expenses (300,507 ) (203,646 )\nGeneral and administrative expenses (4,804,688 ) (9,702,342 )\nImpairment loss of intangible assets (537,866 ) (88,415 )\nImpairment loss of goodwill (1,747,945 ) (1,226,419 )\nLOSS FROM OPERATIONS (7,562,287 ) (11,727,774 )\nInterest expenses (94,684 ) (102,196 )\nLoss on change in fair value of convertible notes (3,980,908 ) (47,092 )\nOTHER (EXPENSE) INCOME\nOther income - from related parties - 1,838\nOther income - from non-related parties 93,198 1,692\nForeign exchange (loss) gain, net (500,918 ) 141,902\nTotal other (Expense) income (407,720 ) 145,432\nLOSS BEFORE INCOME TAX (12,045,599 ) (11,731,630 )\nIncome tax benefit 125,502 38,138\nNET LOSS $ (11,920,097 ) $ (11,693,492 )\nOTHER COMPREHENSIVE INCOME (LOSS)\nForeign currency translation adjustment 533,812 (171,114 )\nTOTAL COMPREHENSIVE LOSS $ (11,386,285 ) $ (11,864,606 )\nNet loss per share - Basic and diluted $ (0.07 ) $ (0.08 )\nWeighted average number of shares of common stock outstanding - Basic and diluted 177,602,306 143,714,764\nSee accompanying notes to the consolidated financial statements.\nLEADER CAPITAL HOLDINGS CORP\nCONSOLIDATED STATEMENTS OF CHANGES IN STOCKHOLDERS EQUITY (DEFICIT)\nFOR THE YEARS ENDED AUGUST 31, 2022 AND 2021\n(In U.S. dollars except for share data)\nNumber of shares Amount PAID IN CAPITAL COMPREHENSIVE LOSS ACCUMULATED DEFICITS\nEQUITY (DEFICIT)\nCOMMON STOCK ADDITIONAL OTHER\nTOTAL\nSTOCKHOLDERS\nNumber of shares Amount PAID IN CAPITAL COMPREHENSIVE LOSS ACCUMULATED DEFICITS\nEQUITY (DEFICIT)\nBalance as of September 1, 2020 135,474,219 $ 13,548 $ 13,272,673 $ - $ (11,307,575 ) $ 1,978,646\nShares issued to service providers 3,500,000 (350 ) - - -\nShares issued to employees 9,000,000 (900 ) - - -\nShares issued in private placement 33,607,500 3,360 3,633,620 - - 3,636,980\nCancellation of restricted shares issued (23,632,500 ) (2,363 ) 2,363 - - -\nShare based compensation - - 6,563,235 - - 6,563,235\nForeign currency translation adjustment - - - (171,114 ) - (171,114 )\nNet loss - - - - (11,693,492 ) (11,693,492 )\nBalance as of August 31, 2021 157,949,219 $ 15,795 $ 23,470,641 $ (171,114 ) $ (23,001,067 ) $ 314,255\nShares issued to service providers 1,000,000 (100 ) - - -\nShares issued to employees and consultants for stock award 9,550,850 (955 ) - - -\nShares issued on conversion of convertible notes 3,600,000 4,631,640 - - 4,632,000\nShares issued on settlement of loan and interests 500,756 50,522 - - 50,572\nShares issued in private placement 19,170,000 1,917 2,288,083 - - 2,290,000\nShare based compensation - - 1,899,351 - - 1,899,351\nForeign currency translation adjustment - - - 533,812 - 533,812\nNet loss - - - - (11,920,097 ) (11,920,097 )\nBalance as of August 31, 2022 191,770,825 $ 19,177 $ 32,339,182 $ 362,698 $ (34,921,164 ) $ (2,200,107 )\nSee accompanying notes to consolidated financial statements.\nLEADER CAPITAL HOLDINGS CORP\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(In U.S. dollars)\nFor the year ended August 31,\nCASH FLOWS FROM OPERATING ACTIVITIES:\nNet loss $ (11,920,097 ) $ (11,693,492 )\nAdjustments to reconcile net loss to net cash used in operating activities:\nShare-based compensation expenses 1,899,351 6,563,235\nDepreciation and amortization 134,402 139,133\nAmortization of operating lease right-of-use assets 339,688 292,567\nImpairment loss on intangible assets and goodwill 2,285,811 1,314,834\nLoss on change in fair value of convertible notes 3,980,908 47,092\nExchange difference, net 500,918 (141,902 )\nShares received from software development income (note 6) (1,500 ) -\nChanges in operating assets and liabilities:\nAccounts receivable (3,168 ) (1,536 )\nPrepayments, deposits and other receivables 131,410 (70,182 )\nInventory (7,475 ) (1,105 )\nAmount due from a director - 189,474\nDeferred tax liabilities (125,502 ) (38,138 )\nOperating lease liabilities (348,448 ) (298,670 )\nAccrued expenses and other payables 223,744 78,085\nNet cash used in operating activities (2,909,958 ) (3,620,605 )\nCASH FLOWS FROM INVESTING ACTIVITIES:\nPurchase of plant and equipment (49,033 ) (71,068 )\nAcquisition of intangible assets (1,397 ) (3,483 )\nNet cash used in investing activities (50,430 ) (74,551 )\nCASH FLOWS FROM FINANCING ACTIVITIES:\nProceeds from shares issued in private placement 2,290,000 3,636,980\nProceeds from convertible notes issuance - 800,000\nAmount due to a shareholder 2,793 -\nAdvance from a director 48,287 218,897\nRepayment to a director (176,446 ) (480,151 )\nLoan from shareholders 393,934 -\nRepayment to shareholders (170,841 ) (60,075 )\nAdvance from a shareholder 42,441 -\nRepayment to shareholders (42,790 ) (52,265 )\nLoan from a non-related party 10,475 -\nRepayment to a non-related party (10,475 ) -\nNet cash provided by financing activities 2,387,378 4,063,386\nEffects of exchange rate changes on cash and cash equivalents (874 ) (13,163 )\nNet (decrease) increase in cash and cash equivalents (573,884 ) 355,067\nCash and cash equivalents, beginning of year 787,154 432,087\nCASH AND CASH EQUIVALENTS, END OF YEAR $ 213,270 $ 787,154\nSUPPLEMENTAL DISCLOSURE OF NON-CASH FINANCING ACTIVITIES\nLease liabilities arising from obtaining right-of-use assets 201,808 395,797\nIssuance of shares from conversion of convertible notes (note 13 (b), (d) and (e)) 4,632,000 -\nModification of convertible notes to loans (note 13 (a) and (c)) 300,000 -\nIssuance of shares offset loan balance from shareholder (note 7) 50,572 -\nSUPPLEMENTAL CASH FLOWS INFORMATION\nCash paid for income taxes $ - $ -\nCash paid for interest $ 117,482 $ 66,000\nSee accompanying notes to the consolidated financial statements.\nLEADER CAPITAL HOLDINGS CORP. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFor the YEARS ended August 31, 2022 and 2021\n(In U.S. dollars)\n1. ORGANIZATION AND BUSINESS BACKGROUND\nLeader Capital Holdings Corp. (LCHD or the Company) was incorporated on March 22, 2017 under the laws of the State of Nevada.\nThe Company mainly engages in the provision of investment platform services with the use of a mobile application through the following subsidiaries:\nSCHEDULE OF SUBSIDIARIES OF COMPANY\nCompany name\nPlace/date of incorporation\nPrincipal activities\n1. Leader Financial Group Limited (LFG)\nSeychelles / March 6, 2017\nInvestment Holding\n2. JFB Internet Service Limited (JFB)\nHong Kong / July 6, 2017\nProvide an Investment platform\nOn August 17, 2020, LCHD, through JFB, acquired all of the issued and outstanding capital stock (the Acquisition) of Nice Products Inc. (NPI), pursuant to the terms and conditions of that certain Stock Purchase Agreement, dated as of the Closing Date, among the Company, JFB, NPI, the selling shareholders of NPI identified therein (each a Seller, and, collectively, the Sellers) and the representative of the Sellers identified therein. As a result of the Acquisition, the Company now owns indirectly 100% of NPI, LOC Weibo Co., Ltd. and Beijing DataComm Cloud Media Technology Co., Ltd.\nThe aggregate purchase price for the Acquisition was $4,850,000, less certain discounts, expenses and reductions for outstanding NPI debt owed to the Company and/or its affiliates, resulting in a net purchase price of $3,506,042, payable in 8,415,111 shares of the Companys common stock to the Sellers in accordance with their respective pro rata percentage.\nAfter the completion of the acquisition, NPI became a wholly owned subsidiary of the Company.\nNPI was incorporated in the British Virgin Islands on December 17, 2018.\nNPI, through its subsidiaries, mainly engages in the development of ecological-systems applications, integration of big data and promotion of OTT applications.\nCompany name\nPlace/date of incorporation\nPrincipal activities\n1. LOC Weibo Co., Ltd. (LOC)\nRepublic of China/September 29, 2017\nDevelopment of ecological-systems applications, integration of big data and promotion of OTT applications\n2. Beijing DataComm Cloud Media Technology Co., Ltd. (BJDC)\nPeoples Republic of China /April 16, 2013\nDevelopment of ecological-systems applications, integration of big data and promotion of OTT applications\nLCHD and its subsidiaries (including NPI and its subsidiaries) are hereinafter referred to as the Company.\n2. SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBasis of presentation\nThe consolidated financial statements are prepared in accordance with accounting principles generally accepted in the United States of America (US GAAP) and include the financial statements of LCHD and its wholly owned subsidiaries. Intercompany accounts and transactions have been eliminated in consolidation. The Company has adopted August 31 as its fiscal year end.\nGoing concern\nThe accompanying consolidated financial statements have been prepared on a going concern basis, which contemplates the realization of assets and the settlement of liabilities and commitments in the normal course of business.\nThe Company has suffered recurring losses from operations, and records an accumulated deficit, a working capital deficit and a net stockholders deficit of $34,921,164, $2,248,545 and $2,200,107 respectively as of August 31, 2022. These conditions raise substantial doubt about the Companys ability to continue as a going concern. The ability to continue as a going concern is dependent upon the Companys profit generating operations in the future and/or obtaining the necessary financing to meet its obligations and repay its liabilities arising from normal business operations when they become due.\nThe Company expects to finance its operations primarily through cash flows from operations, loans from existing directors and shareholders and placements of capital stock for additional funding. In the event that the Company requires additional funding to finance the growth of the Companys current and expected future operations as well as to achieve our strategic objectives, a shareholder has indicated the intent and ability to provide additional financing. No assurance can be given that any future financing, if needed, will be available or, if available, that it will be on terms that are satisfactory to the Company. Even if the Company is able to obtain additional financing, if needed, it may contain undue restrictions on its operations, in the case of debt financing, or cause substantial dilution for its stock holders, in the case of equity financing.\nIn March 2020 the World Health Organization declared coronavirus COVID-19 a global pandemic. The COVID-19 pandemic has negatively impacted the global economy, workforces, customers, and created significant volatility and disruption of financial markets. It has also disrupted the normal operations of many businesses, including the Companys businesses. This outbreak could decrease spending, adversely affect demand for the Companys services and harm its business and results of operations. It is not possible for the Company to predict the duration or magnitude of the adverse results of the outbreak and its effects on its business or results of operations at this time.\nThese consolidated financial statements do not include any adjustments to the recoverability and classification of recorded asset amounts and classification of liabilities that might be necessary should the Company be unable to continue as a going concern.\nUse of estimates\nThe preparation of these consolidated financial statements in conformity with U.S. GAAP requires management of the Company to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues, costs and expenses, and related disclosures. On an on-going basis, the Company evaluates its estimates based on historical experience and on various other assumptions that are believed to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Actual results may differ from these estimates under different assumptions or conditions.\nThe COVID-19 pandemic has created and may continue to create significant uncertainty in macroeconomic conditions, which may cause further business slowdowns or shutdowns, depress demand for the Companys business, and adversely impact its results of operations. The Company expects uncertainties around its key accounting estimates to continue to evolve depending on the duration and degree of impact associated with the COVID-19 pandemic. Its estimates may change as new events occur and additional information emerges, and such changes are recognized or disclosed in its consolidated financial statements.\nIdentified below are the accounting policies that reflect the Companys most significant estimates and judgments, and those that the Company believes are the most critical to fully understanding and evaluating its consolidated financial statements.\nBusiness combination\nThe Company accounts for its business combinations using the acquisition method of accounting in accordance with Accounting Standards Codification (ASC) 805 Business Combinations. The cost of an acquisition is measured as the aggregate of the acquisition date fair values of the assets transferred and liabilities incurred by the Company to the sellers and equity instruments issued. Transaction costs directly attributable to the acquisition are expensed as incurred. Identifiable assets and liabilities acquired or assumed are measured separately at their fair values as of the acquisition date, irrespective of the extent of any non-controlling interests. The excess of (i) the total costs of acquisition, fair value of the non-controlling interests and acquisition date fair value of any previously held equity interest in the acquiree over (ii) the fair value of the identifiable net assets of the acquiree is recorded as goodwill. If the cost of acquisition is less than the fair value of the net assets of the subsidiary acquired, the difference is recognized directly in the consolidated statements of comprehensive income. During the measurement period, which can be up to one year from the acquisition date, the Company may record adjustments to the assets acquired and liabilities assumed with the corresponding offset to goodwill. Upon the conclusion of the measurement period or final determination of the values of assets acquired or liabilities assumed, whichever comes first, any subsequent adjustments are recorded to the consolidated statements of comprehensive income.\nWhen there is a change in ownership interests that result in a loss of control of a subsidiary, the Company deconsolidates the subsidiary from the date control is lost. Any retained non-controlling investment in the former subsidiary is measured at fair value and is included in the calculation of the gain or loss upon deconsolidation of the subsidiary.\nGoodwill and impairment of goodwill\nGoodwill represents the excess of the purchase price and related costs over the fair value of the net identified tangible and intangible assets and liabilities assumed and is not amortized. The total amount of goodwill is deductible for tax purposes.\nIn accordance with ASC Topic 350, Intangibles-Goodwill and Other, goodwill is not amortized but is tested for impairment, annually or more frequently when circumstances indicate a possible impairment may exist. Impairment testing is performed at a reporting unit level. An impairment loss generally would be recognized when the carrying amount of the reporting unit exceeds its fair value.\nThe Company estimates fair value of the applicable reporting unit or units using a discounted cash flow methodology. This methodology represents a level 3 fair value measurement as defined under ASC 820, Fair Value Measurements and Disclosures, since the inputs are not readily observable in the marketplace. The goodwill impairment testing process involves the use of significant assumptions, estimates and judgments, including projected sales, gross margins, selling, general and administrative expenses, and capital expenditures, and the selection of an appropriate discount rate, all of which are subject to inherent uncertainties and subjectivity. When the Company performs goodwill impairment testing, its assumptions are based on annual business plans and other forecasted results, which it believes represent those of a market participant. The Company selects a discount rate, which is used to reflect market-based estimates of the risks associated with the projected cash flows based on the best information available as of the date of the impairment assessment. Based on the annual impairment analysis, there is impairment of $1,747,945 and $1,226,419 on the goodwill recorded in the Companys financial statements for the years ended August 31, 2022 and 2021, respectively. The impairment loss of goodwill was primarily attributable to the impairment related to NPI as the financial performance of the reporting unit of FinTech App development continued to fall below the Companys original expectations.\nGiven the current macro-economic environment and the uncertainties regarding its potential impact on the Companys business, there can be no assurance that its estimates and assumptions used in its impairment tests will prove to be accurate predictions of the future. If the Companys assumptions regarding forecasted cash flows are not achieved, it is possible that an impairment review may be triggered and goodwill may be impaired. During the year ended August 31, 2022, the Company expects the reporting unit of FinTech App development not to generate profits in the near future. As a result, the goodwill was fully impaired during the year ended August 31, 2022.\nCash and cash equivalents\nCash and cash equivalents are carried at cost and represent cash on hand, demand deposits placed with banks or other financial institutions and all highly liquid investments with an original maturity of three months or less as of the purchase date of such investments.\nSoftware development costs\nThe Company expenses software development costs, including costs to develop software products or the software component of products to be marketed to external users, before technological feasibility is reached. Technological feasibility is typically reached shortly before the release of such products and as a result, development costs that meet the criteria for capitalization were not material for the periods presented.\nThe Company capitalizes development costs related to these software applications once the preliminary project stage is complete and it is probable that the project will be completed and the software will be used to perform the function intended.\nRevenue recognition\nThe Company adopted Accounting Standards Update (ASU) No. 2014-09, Revenue from Contracts with Customers (Topic 606), which establishes principles for reporting information about the nature, amount, timing and uncertainty of revenue and cash flows arising from the entitys contracts to provide goods or services to customers. The core principle requires an entity to recognize revenue to depict the transfer of goods or services to customers in an amount that reflects the consideration that it expects to be entitled to receive in exchange for those goods or services recognized as performance obligations are satisfied.\nThe Company recognizes revenues following the five-step model prescribed under ASU No. 2014-09:\nStep 1: Identify the contract\nStep 2: Identify the performance obligations\nStep 3: Determine the transaction price\nStep 4: Allocate the transaction price\nStep 5: Recognize revenue\nRevenues are recognized when control of the promised goods or services is transferred to the Companys customers, which may occur at a point in time or over time depending on the terms and conditions of the agreement, in an amount that reflects the consideration the Company expects to be entitled to in exchange for those goods or services.\nProvision of investment platform services\nThe Company signed an agreement with a third party whereby the Company authorizes the third party to use the Companys investment platform and related applications for a period until December 31, 2020. Income from provision of investment platform services with the use of the Companys mobile applications is recognized when the service is performed.\nFrom September, 2020, the Company generated additional revenue from a new, more comprehensive mobile application, which refer to as the FinMaster mobile application (the FinMaster App and together with the JFB platform, the Apps), with similar functions as the JFB platform. Income from providing investment platform services with the use of a mobile application is recognized when the service is performed.\nThe Company offers a self-managed points program, which can be used in the FinMaster App to redeem merchandise or services. The Company determines the value of each point based on estimated incremental cost. Customers and advocates have a variety of ways to obtain the points. The major accounting policy for its points program is described as follows:\nThe Company concludes the bonus points offered linked to the purchase transaction of the points is a material right and accordingly a separate performance obligation according to ASC 606, and should be taken into consideration when allocating the transaction price of the point sales. The Company also estimates the probability of points redemption when performing the allocation. The amount allocated to the bonus points as separate performance obligation is recorded as contract liability (deferred revenue) and revenue should be recognized when future goods or services are transferred. The Company will continue to monitor when and if forfeiture rate data becomes available and will apply and update the estimated forfeiture rate at each reporting period.\nSince historical information is limited for the Company to determine any potential points forfeitures and most merchandise can be redeemed without requiring a significant amount of points compared with the amount of points provided to users, the Company has used an estimated forfeiture rate of zero.\nProvision of software development service and maintenance service\nThe Company entered into several agreements with third party customers to assist the customers in the development of their mobile communications software and mobile e-commerce software. Income from provision of software development service and maintenance service are recognized when the service is performed.\nRevenue by major product line\nSCHEDULE OF REVENUE BY MAJOR PRODUCT LINE\nYear ended August 31,\nProvision of investment platform services $ 17,930 $ 19,606\nProvision of software development service and maintenance service 321,512 75,560\nRevenue by major product line $ 339,442 $ 95,166\nRevenue by recognition over time vs point in time\nSCHEDULE OF REVENUE BY RECOGNITION OVER TIME VS POINT IN TIME\nYear ended August 31,\nRevenue by recognition over time $ 339,442 $ 95,166\nRevenue by recognition at a point in time - -\nRevenue by recognition $ 339,442 $ 95,166\nRemaining performance obligations represent contracted revenues that had not yet been recognized, and include deferred revenues; invoices that have been issued to customers but were uncollected and have not been recognized as revenues; and amounts that will be invoiced and recognized as revenues in future periods. As of August 31, 2022, the Companys remaining performance obligations were $169,951, which it expects to recognize as revenues over the next twelve months and the remainder thereafter.\nThe Company had not occurred any costs to obtain contracts.\nThe Company does not have amounts of contract assets since revenue is recognized as control of goods or services is transferred. The contract liabilities consist of advance payments from customers. The contract liabilities are reported in a net position on a customer-by-customer basis at the end of each reporting period. All contract liabilities are expected to be recognized as revenue within one year and are included in other payables and accrued liabilities in the consolidated balance sheet.\nContract balances\nThe Companys contract liabilities consist of receipts in advance for software development and FinMaster App. Below is the summary presenting the movement of the Companys contract liabilities for the years ended August 31, 2022 and 2021:\nSCHEDULE OF CONTRACT LIABILITIES\nReceipt in advance August 31, 2022 August 31, 2021\nBalance as of September 1 $ 16,225 $ 2,896\nAdvances received from customers 492,289 110,485\nRevenue recognized (336,796 ) (97,596 )\nExchange difference (1,767 )\nBalance as of August 31 $ 169,951 $ 16,225\nPractical expedients and exemption\nThe Company had not occurred any costs to obtain contracts, and do not disclose the value of unsatisfied performance obligations for contracts with an original expected length of one year or less.\nResearch and development expenses\nResearch and development (R&D) expenses are primary comprised of charges for R&D and consulting work performed by third parties; salaries and benefits for those employees engaged in research, design and development activities; costs related to design tools; and allocated costs.\nFor the year ended August 31, 2022 and 2021, the total R&D expenses were $510,723 and $602,118, respectively.\nSales and marketing expenses\nSales and marketing expenses consist primarily of marketing and promotional expenses, salaries and other compensation-related expenses to sales and marketing personnel. Advertising expenses consist primarily of costs for the promotion of corporate image and product marketing. The Company expenses all advertising costs as incurred and classifies these costs under sales and marketing expenses. For the years ended August 31, 2022 and 2021, advertising costs totaled $285,908 and $168,535 respectively.\nFrom September, 2019, customers or users of the Companys mobile application can obtain points through ways such as frequent sign-ins to the Companys mobile application, sharing articles from the application to users own social media. The Company believes these points are to encourage user engagement and generate market awareness. As a result, the Company accounts for such points as selling and marketing expenses with a corresponding liability recorded under other current liabilities of its consolidated balance sheets upon the points offering. The Company estimates liabilities under the customer loyalty program based on cost of the merchandise that can be redeemed, and its estimate of probability of redemption. At the time of redemption, the Company records a reduction of inventory and other current liabilities.\nSince historical information is limited for the Company to determine any potential points forfeiture and most merchandise can be redeemed without requiring a significant amount of points compared with the amount of points provided to users, the Company has used an estimated forfeiture rate of zero.\nFor the year ended August 31, 2022 and 2021, redeemable point liability charged as selling and marketing expenses were $14,599 and $35,111, respectively.\nAs of August 31, 2022 and 2021, liabilities recorded related to unredeemed points were $82,638 and $75,648, respectively, which were included in other payables (note 9).\nGeneral and administrative expenses\nGeneral and administrative expenses consist primarily of salaries, bonuses and benefits for employees involved in general corporate functions, depreciation and amortization of fixed assets, legal and other professional services fees, rental and other general corporate related expenses.\nInventory\nInventories are stated at the lower of cost or net realizable value. Cost is calculated on the average basis and includes all costs to acquire and other costs to bring the inventories to their present location and condition. The Company records inventory write-downs for excess or obsolete inventories based upon assumptions on current and future demand forecasts. If the inventory on hand is in excess of future demand forecast, the excess amounts are written off. The Company also reviews inventory to determine whether its carrying value exceeds the net amount realizable upon the ultimate sale of the inventory. This requires the determination of the estimated selling price of the vehicles less the estimated cost to convert inventory on hand into a finished product. Once inventory is written-down, a new, lower-cost basis for that inventory is established and subsequent changes in facts and circumstances do not result in the restoration or increase in that newly established cost basis.\nInventory as of August 31, 2022 represents merchandise inventory which can be redeemed by deducting membership rewards points of customer loyalty program.\nLeases\nThe Company determines if an arrangement is a lease or contains a lease at inception. Operating lease liabilities are recognized based on the present value of the remaining lease payments, discounted using the discount rate for the lease at the commencement date. As the rate implicit in the lease is not readily determinable for the operating lease, the Company generally uses an incremental borrowing rate based on information available at the commencement date to determine the present value of future lease payments. Operating lease right-of-use (ROU assets) assets represent the Companys right to control the use of an identified asset for the lease term and lease liabilities represent the Companys obligation to make lease payments arising from the lease. ROU assets are generally recognized based on the amount of the initial measurement of the lease liability. Lease expense is recognized on a straight-line basis over the lease term. The Company elected the package of practical expedients permitted under the transition guidance to combine the lease and non-lease components as a single lease component for operating leases associated with the Companys office space lease, and to keep leases with an initial term of 12 months or less off the balance sheet and recognize the associated lease payments in the consolidated statements of income on a straight-line basis over the lease term.\nThe operating lease is included in operating lease right-of-use assets, operating lease liabilities-current and operating lease liabilities-non-current on the Companys consolidated balance sheets.\nAccounts receivable\nAccounts receivable are stated at the original amount less an allowance for doubtful receivables, if any, based on a review of all outstanding amounts at period end. An allowance is also made when there is objective evidence that the Company will not be able to collect all amounts due according to the original terms of the receivables. The Company analyzes the aging of the customer accounts, coverage of credit insurance, customer concentrations, customer credit-worthiness, historical and current economic trends and changes in its customer payment patterns when evaluating the adequacy of the allowance for doubtful accounts.\nPlant and equipment\nPlant and equipment are stated at cost less accumulated depreciation and accumulated impairment losses, if any. Depreciation is calculated on the straight-line basis over the following expected useful lives from the date on which they become fully operational:\nSCHEDULE OF PLANT AND EQUIPMENT USEFUL LIVES\nExpected useful life\nFurniture and fixtures\nOffice equipment\nLeasehold improvements\nNon-marketable equity securities\nNon-marketable equity Securities represent the investments in a privately held company without readily determinable market value. The Company measures investments in non-marketable equity securities without a readily determinable fair value using a measurement alternative that measures these securities at the cost method minus impairment, if any, plus or minus changes resulting from observable price changes on a non-recurring basis. The fair value of non-marketable equity securities that have been remeasured due to impairment are classified within Level 3. The Company adjusts the carrying value of non-marketable equity securities which have been remeasured during the period and recognize resulting gains or losses as a component of other operating income (expense), net. The Company recognized an impairment loss of $nil on the non-marketable equity securities for the year ended August 31, 2022.\nIntangible assets\nThe Company recorded intangible assets with definite lives, including investment platform and technical know-hows. Intangible assets are recorded at cost less accumulated amortization with no residual value. Amortization of intangible assets is computed using the straight-line method over their estimated useful lives.\nThe estimated useful lives of the Companys intangible assets are listed below:\nSCHEDULE OF USEFUL LIVES OF COMPANY'S INTANGIBLE ASSETS\nInvestment platform 5 years\nTechnical know-hows 8 years\nTrademarks 10 years\nImpairment of long-lived assets (including amortizable intangible assets)\nThe Company reviews the carrying values of long-lived assets for impairment whenever events or changes in circumstances indicate that the carrying value of an asset may not be recoverable. Recoverability of assets to be held and used is measured by a comparison of the carrying amount of an asset to the undiscounted future net cash flows expected to be generated by the asset. If the assets are considered to be impaired, the impairment recognized is measured by the amount by which the carrying amount of the assets exceeds the fair value of the assets. Impairment of $537,866 and $88,415 has been recorded by the Company for the years ended August 31, 2022 and 2021, respectively. The impairment loss of intangible assets was primarily attributable to the financial performance of NPIs technical know-hows fall below the Companys original expectations and they assessed the recoverability of the carrying value of certain intangible assets which resulted in impairment losses.\nEmployee benefits\nThe Taiwan subsidiary also operates a Defined Contribution Pension Plan under the Labor Pension Act (the Act) for employees in Taiwan. The Act stipulated that the contribution rate by the employer per month shall not be less than 6% of the employees monthly salary, and the Table of Monthly Contribution Salary Classification shall be prescribed by Central Competent Authority. The highest bracket of Monthly Contribution Salary issued by Central Competent Authority is $5,237 (NTD150,000). Total amounts of such employee benefit expenses, which were expensed as incurred, were approximately $128,350 and $116,069 for the years ended August 31, 2022 and 2021, respectively.\nFull time employees of the Company in the PRC participate in a government mandated defined contribution plan, pursuant to which certain pension benefits, medical care, employee housing fund and other welfare benefits are provided to the employees. Chinese labor regulations require that the PRC subsidiary of the Company make contributions to the government for these benefits based on certain percentages of the employees salaries, up to a maximum amount specified by the local government. The Company has no legal obligation for the benefits beyond the contributions made. Total amounts of such employee benefit expenses, which were expensed as incurred, were approximately $126,568 and $87,793 for the years ended August 31, 2022 and 2021, respectively.\nThe Hong Kong subsidiary operates a Mandatory Provident Fund (MPF) scheme for all qualifying employees in Hong Kong. The MPF is a defined contribution scheme and the assets of the scheme are managed by a trustee independent of the Group. The MPF is available to all employees aged 10 to 64 with a least 60 days of service under the employment of the Group in Hong Kong. Contributions are made by the Group to a cap of HK$1,500 (equivalent to $192 per month). Total amounts of such employee benefit expenses, which were expensed as incurred, were approximately $4,291 and $4,328 for the years ended August 31, 2022 and 2021, respectively\nIncome taxes\nIncome taxes are determined using an asset and liability method in accordance with the provisions of ASC Topic 740, Income Taxes (ASC Topic 740). Under this method, deferred tax assets and liabilities are recognized for the future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax basis. Deferred tax assets and liabilities are measured using enacted income tax rates expected to apply to taxable income in the periods in which those temporary differences are expected to be recovered or settled. Any effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date.\nASC 740 prescribes a comprehensive model for how companies should recognize, measure, present, and disclose in their financial statements uncertain tax positions taken or expected to be taken on a tax return. Under ASC 740, tax positions must initially be recognized in the financial statements when it is more likely than not the position will be sustained upon examination by the tax authorities. Such tax positions must initially and subsequently be measured as the largest amount of tax benefit that has a greater than 50% likelihood of being realized upon ultimate settlement with the tax authority assuming full knowledge of the position and relevant facts. As of August 31, 2022 and 2021, the Company has no accrued interest or penalties related to uncertain tax positions.\nThe Company conducts businesses in the PRC, Taiwan and Hong Kong. The Company is subject to tax in these jurisdictions. As a result of its business activities, the Company will file tax returns that are subject to examination by the respective tax authorities.\nNet loss per share\nThe Company calculates net income/(loss) per share in accordance with ASC Topic 260, Earnings per Share. Basic income/(loss) per share is computed by dividing the net income/(loss) by the weighted-average number of shares of common stock outstanding during the period. Diluted income per share is computed similar to basic income/(loss) per share except that the denominator is increased to include the number of additional shares of common stock that would have been outstanding if the potential common stock equivalents had been issued and if the additional shares of common stock were dilutive. The following table presents a reconciliation of basic and diluted net loss per share:\nSCHEDULE OF RECONCILIATION OF BASIC AND DILUTED NET LOSS PER SHARE\nYear ended August 31,\nNet loss $ (11,920,097 ) $ (11,693,492 )\nWeighted average number of shares of common stock outstanding - Basic and diluted (Note) 177,602,306 143,714,764\nNet loss per share - Basic and diluted $ (0.07 ) $ (0.08 )\nNote: Including 6,800,000 vested shares granted as stock compensation but not yet issued for the year ended August 31, 2022; and including 1,122,668 vested shares granted as stock compensation but not yet issued for the year ended August 31, 2021 (note 15).\nAs of August 31, 2022 and 2021, the Companys convertible notes payable were excluded from the diluted loss per share calculation as they were anti-dilutive.\nStock-based compensation\nStock-based compensation is accounted for based on the requirements of the Share-Based Payment topic of ASC Topic 718 (ASC 718), which requires recognition in the financial statements of the cost of employee and director services received in exchange for an award of equity instruments over the vesting period or immediately if fully vested and non-forfeitable. The Financial Accounting Standards Board (FASB) also requires measurement of the cost of employee and director services received in exchange for an award based on the grant-date fair value of the award.\nAdditionally, ASU No. 2016-09, Improvements to Employee Share-Based Payment Accounting, permits the election of an accounting policy for forfeitures of share-based payment awards, either to recognize forfeitures as they occur or estimate forfeitures over the vesting period of the award. The Company has elected to recognize forfeitures as they occur.\nOn September 1, 2019, the Company adopted ASU No. 2018-07, Compensation-Stock Compensation (Topic 718) - Improvements to Nonemployee Share-Based Payment Accounting (ASU 2018-07). Before the adoption of this guidance, the equity-classified share-based awards held by non-employees were subject to re-measurement through each vesting date. Upon the adoption of this guidance, the Company no longer re-measures equity-classified share-based awards granted to consultants or non-employees at each reporting date through the vesting date and the accounting for these share-based awards to consultants or non-employees and employees was substantially aligned.\nCancellation of a share-based payment by the entity results in accelerated recognition of any unrecognized cost. Cancellation by the counterparty does not change recognition of the compensation cost. The termination of an employee that resulted in the forfeiture of share-based awards is not considered to be a cancellation of the awards.\nForeign currencies translation\nTransactions denominated in currencies other than the functional currency are translated into the functional currency at the exchange rates prevailing at the dates of the transaction. Monetary assets and liabilities denominated in currencies other than the functional currency are translated into the functional currency using the applicable exchange rates at the balance sheet dates. The resulting exchange differences are recorded in the statements of operations.\nThe reporting currency of the Company is United States Dollars (US$), which is also the Companys functional currency. The Companys subsidiary in Seychelles, the PRC, Taiwan and Hong Kong maintains its books and record in United States Dollars (US$), Renminbi (RMB), New Taiwanese Dollars (NT$) and United States Dollars (US$) respectively, which are the primary currencies of the economic environment in which the entities operate (the functional currencies).\nIn general, for consolidation purposes, assets and liabilities of its subsidiary whose functional currency is not the US$ are translated into US$, in accordance with ASC Topic 830-30, Translation of Financial Statement, using the exchange rate on the balance sheet date. Revenues and expenses are translated at average rates prevailing during the period. The gains and losses resulting from translation of financial statements of foreign subsidiary are recorded as a separate component of accumulated other comprehensive income as a component of shareholders equity.\nTranslation of amounts from foreign currencies into US$ has been made at the following exchange rates for the respective periods:\nSCHEDULE OF FOREIGN CURRENCY TRANSLATION\nAs of and for the\nyear ended\nAugust 31, 2022 As of and for the\nyear ended\nAugust 31, 2021\nYear-end NT$ : US$ 1 exchange rate 30.38 27.66\nYear-average NT$ : US$ 1 exchange rate 28.64 28.22\nYear-end RMB : US$ 1 exchange rate 6.89 6.46\nYear-average RMB : US$ 1 exchange rate 6.51 6.54\nRelated parties\nParties, which can be a corporation or individual, are considered to be related if the Company has the ability, directly or indirectly, to control the other party or exercise significant influence over the other party in making financial and operating decisions. Companies are also considered to be related if they are subject to common control or common significant influence.\nConvertible instruments\nThe Company accounts for hybrid contracts that feature conversion options in accordance with U.S. GAAP. ASC 815 Derivatives and Hedging Activities, (ASC 815) requires companies to bifurcate conversion options from their host instruments and account for them as free standing derivative financial instruments according to certain criteria. The criteria includes circumstances in which (a) the economic characteristics and risks of the embedded derivative instrument are not clearly and closely related to the economic characteristics and risks of the host contract, (b) the hybrid instrument that embodies both the embedded derivative instrument and the host contract is not re-measured at fair value under otherwise applicable generally accepted accounting principles with changes in fair value reported in earnings as they occur and (c) a separate instrument with the same terms as the embedded derivative instrument would be considered a derivative instrument.\nConversion options that contain variable settlement features such as provisions to adjust the conversion price upon subsequent issuances of equity or equity linked securities at exercise prices more favorable than that featured in the hybrid contract generally result in their bifurcation from the host instrument.\nThe Company accounts for convertible instruments, when the Company has determined that the embedded conversion options should not be bifurcated from their host instruments, in accordance with ASC 470-20 Debt with Conversion and Other Options (ASC 470-20). Under ASC 470-20 the Company records, when necessary, discounts to convertible notes for the intrinsic value of conversion options embedded in debt instruments based upon the differences between the fair value of the underlying common stock at the commitment date of the note transaction and the effective conversion price embedded in the note. The Company accounts for convertible instruments (when the Company has determined that the embedded conversion options should be bifurcated from their host instruments) in accordance with ASC 815. Under ASC 815, a portion of the proceeds received upon the issuance of the hybrid contract are allocated to the fair value of the derivative. The derivative is subsequently marked to market at each reporting date based on current fair value, with the changes in fair value reported in results of operations.\nFair value of financial instruments\nThe carrying value of the Companys financial instruments: cash and cash equivalents, deposits, accounts payable and accrued liabilities, balances due with directors and shareholders and bonds payable approximate at their fair values because of the short-term nature of these financial instruments or the rate of interest of these instruments approximate the market rate of interest.\nThe Company also follows the guidance of the ASC Topic 820-10, Fair Value Measurements and Disclosures (ASC 820-10), with respect to financial assets and liabilities that are measured at fair value. ASC 820-10 establishes a three-tier fair value hierarchy that prioritizes the inputs used in measuring fair value as follows:\nLevel 1: Observable inputs such as quoted prices in active markets;\nLevel 2: Inputs, other than the quoted prices in active markets, that are observable either directly or indirectly; and\nLevel 3: Unobservable inputs in which there is little or no market data, which require the reporting entity to develop its own assumptions.\nThe following table sets forth by level within the fair value hierarchy our financial assets and liabilities that were accounted for at fair value on a recurring basis:\nSCHEDULE OF FAIR VALUE HIERARCHY AND FINANCIAL ASSETS LIABILITIES\nAugust 31, 2021 Level 1 Level 2 Level 3\nCarrying\nValue at\nFair Value Measurement at\nAugust 31, 2021 August 31, 2021\nLevel 1 Level 2 Level 3\nConvertible notes measured at fair value $ 990,000 $ - $ - $ 990,000\nAugust 31, 2022 Level 1 Level 2 Level 3\nCarrying\nValue at\nFair Value Measurement at\nAugust 31, 2022 August 31, 2022\nLevel 1 Level 2 Level 3\nConvertible notes measured at fair value $ - $ - $ - $ -\nA summary of changes in financial liabilities for the year ended August 31, 2022 was as follows:\nSCHEDULE OF CHANGE IN FINANCIAL LIABILITY\nBalance at September 1, 2020 $ 104,000\nIssuance of convertible notes 800,000\nInterest expenses on convertible notes 44,908\nInterest paid (6,000 )\nChange in fair value of convertible notes 47,092\nBalance at September 1, 2021 $ 990,000\nInterest paid (48,000 )\nInterest expenses on convertible notes 29,983\nInterest waived in conversion of convertible notes (15,606 )\nModification of interest payable on convertible notes to loans (5,285 )\nModification of convertible notes to loans (300,000 )\nConversion of convertible notes (4,632,000 )\nChange in fair value of convertible notes 3,980,908\nBalance at August 31, 2022 $ -\nFair value of the convertible notes is determined using the binomial model using the following assumptions at inception and on subsequent valuation dates:\nSCHEDULE OF FAIR VALUE ASSUMPTION OF CONVERTIBLE NOTES\nConvertible notes holders Teh-Ling Chen Li-Ching Yang Jui-Chin Chen Teh-Ling Chen Chin-Ping Ching-Nan Wang Chin-Chiang Wang Wang Teh-Ling Chen\nAppraisal Date (Inception Date) February 24, 2020 February 27, 2020 March 18, 2020 November 2, 2020 November 25, 2020 January 15, 2021\nRisk-free Rate 1.25 % 1.06 % 0.54 % 0.16 % 0.16 % 0.1 %\nApplicable Closing Stock Price $ 1.25 $ 1.25 $ 1.20 $ 0.12 $ 3.00 $ 2.00\nConversion Price $ 1.00 (i) $ 1.00 (i) $ 1.00 (i) $ 0.40 $ 0.40 $ 0.40\n$ 1.50 (ii) $ 1.50 (ii) $ 1.50 (ii)\nVolatility 27.82 % 27.94 % 34.20 % 41.51 % 42.00 % 43.50 %\nDividend Yield 0.00 % 0.00 % 0.00 % 0.00 % 0.00 % 0.00 %\nCredit Spread 2.71 % 2.96 % 6.88 % 7.52 % 6.93 % 6.76 %\nLiquidity Risk Premium 42.09 % 36.26 % 51.08 % 77.62 % 78.14 % 75.73 %\nAppraisal Date\nAugust 31, 2021 August 31, 2021 August 31, 2021 August 31, 2021\nRisk-free Rate N/A N/A 0.05 % 0.09 % 0.10 % 0.12 %\nApplicable Closing Stock Price N/A N/A $ 2.01 $ 2.01 $ 2.01 $ 2.01\nConversion Price N/A N/A $ 0.40 $ 0.40 $ 0.40 $ 0.40\nVolatility N/A N/A 45.20 % 49.90 % 49.76 % 48.45 %\nDividend Yield N/A N/A 0.00 % 0.00 % 0.00 % 0.00 %\nCredit Spread N/A N/A 3.63 % 3.63 % 3.63 % 3.63 %\nLiquidity Risk Premium N/A\nN/A\n84.04 % 86.98 % 86.63 % 85.12 %\n(i) USD1.00 per share if converted on or before the one-year anniversary of the issuance date\n(ii) USD1.50 per share if converted at any time after the one-year anniversary of the issuance date\nSegment reporting\nASC Topic 280, Segment Reporting, requires use of the management approach model for segment reporting. The management approach model is based on the way a companys chief operating decision maker organizes segments within the company for making operating decisions assessing performance and allocating resources. Reportable segments are based on products and services, geography, legal structure, management structure, or any other manner in which management disaggregates a company.\nManagement determined that the Companys operations constitute a single reportable segment in accordance with ASC 280. The Company operates exclusively in one business and industry segment: the provision of investment platform services through mobile application.\nRecent accounting pronouncements\nRecently Adopted Accounting Standards\nIn December 2019, the Financial Accounting Standards Board (the FASB) issued Accounting Standards Update (ASU) 2019-12, Income Taxes (Topic 740): Simplifying the Accounting for Income Taxes (ASU 2019-12). ASU 2019-12 simplifies the accounting for income taxes by removing certain exceptions and enhances and simplifies various aspects of the income tax accounting guidance in ASC 740. The Company adopted ASU 2019-12 on September 1, 2021. The adoption of ASU 2019-12 did not have any impact on the Companys consolidated financial statement presentation or disclosures.\nIn August 2020, the FASB issued ASU 2020-06, Debt - Debt with Conversion and Other Options (Subtopic 470-20) and Derivatives and Hedging-Contracts in Entitys Own Equity (Subtopic 815-40): Accounting for Convertible Instruments and Contracts in an Entitys Own Equity (ASU 2020-06). ASU 2020-06 simplifies the accounting for convertible debt by eliminating the beneficial conversion and cash conversion accounting models. Upon adoption of ASU 2020-06, convertible debt proceeds, unless issued with a substantial premium or an embedded conversion feature that is not clearly and closely related to the host contract, will no longer be allocated between debt and equity components. This modification will reduce the issue discount and result in less non-cash interest expense in financial statements. ASU 2020-06 also updates the earnings per share calculation and requires entities to assume share settlement when the convertible debt can be settled in cash or shares. For contracts in an entitys own equity, the type of contracts primarily affected by ASU 2020-06 are freestanding and embedded features that are accounted for as derivatives under the current guidance due to a failure to meet the settlement assessment by removing the requirements to (i) consider whether the contract would be settled in registered shares, (ii) consider whether collateral is required to be posted, and (iii) assess shareholder rights. ASU 2020-06 is effective for fiscal years beginning after December 15, 2023. Early adoption is permitted, but no earlier than fiscal years beginning after December 15, 2020, and only if adopted as of the beginning of such fiscal year. The Company adopted ASU 2020-06 effective September 1, 2021. The adoption of ASU 2020-06 did not have any impact on the Companys consolidated financial statement presentation or disclosures.\nAccounting Pronouncements Issued But Not Yet Adopted\nIn June 2016, the FASB issued ASU No. 2016-13, Financial Instruments-Credit Losses (Topic 326) (ASU 2016-13), which requires entities to measure all expected credit losses for financial assets held at the reporting date based on historical experience, current conditions, and reasonable and supportable forecasts. ASU 2016-13 replaces the existing incurred loss model and is applicable to the measurement of credit losses on financial assets measured at amortized cost. ASU 2016-13 is to be adopted on a modified retrospective basis. As a smaller reporting company, ASU 2016-13 will be effective for the Company for interim and annual reporting periods beginning after December 15, 2022. The Company is currently evaluating the impact that the adoption of ASU 2016-13 will have on its consolidated financial statement presentations and disclosures.\nIn January 2017, the FASB issued ASU No. 2017-04, Intangibles - Goodwill and Other (Topic 350), Simplifying the Test for Goodwill Impairment (ASU 2017-04). ASU 2017-04 eliminates Step 2 of the two-step Goodwill impairment test, under which a goodwill impairment loss was measured by comparing the implied fair value of a reporting units Goodwill with the carrying amount of that Goodwill. ASU 2017-04 requires only a one-step quantitative impairment test, whereby a Goodwill impairment loss is measured as the excess of a reporting units carrying amount over its fair value (not to exceed the total Goodwill allocated to that reporting unit). Adoption of the ASUs is on a modified retrospective basis. As a smaller reporting company, the standard will be effective for the Company for interim and annual reporting periods beginning after December 15, 2022. The Company is currently evaluating the impact that the adoption of ASU 2017-04 will have on its consolidated financial statement presentation or disclosures.\nIn May 2021, the FASB issued ASU 2021-04, Earnings Per Share (Topic 260), Debt - Modifications and Extinguishments (Subtopic 470-50), Compensation - Stock Compensation (Topic 718), and Derivatives and Hedging - Contracts in Entitys Own Equity (Subtopic 815-40): Issuers Accounting for Certain Modifications or Exchanges of Freestanding Equity-Classified Written Call Options (ASU 2021-04). ASU 2021-04 provides guidance as to how an issuer should account for a modification of the terms or conditions or an exchange of a freestanding equity-classified written call option (i.e., a warrant) that remains classified after modification or exchange as an exchange of the original instrument for a new instrument. An issuer should measure the effect of a modification or exchange as the difference between the fair value of the modified or exchanged warrant and the fair value of that warrant immediately before modification or exchange and then apply a recognition model that comprises four categories of transactions and the corresponding accounting treatment for each category (equity issuance, debt origination, debt modification, and modifications unrelated to equity issuance and debt origination or modification). ASU 2021-04 is effective for all entities for fiscal years beginning after December 15, 2021, including interim periods within those fiscal years. An entity should apply the guidance provided in ASU 2021-04 prospectively to modifications or exchanges occurring on or after the effective date. Early adoption is permitted for all entities, including adoption in an interim period. If an entity elects to early adopt ASU 2021-04 in an interim period, the guidance should be applied as of the beginning of the fiscal year that includes that interim period. The adoption of ASU 2021-04 is not expected to have any impact on the Companys consolidated financial statement presentation or disclosures.\nIn October 2021, the FASB issued ASU 2021-08, Business Combinations (Topic 805): Accounting for Contract Assets and Contract Liabilities from Contracts with Customers, which requires the recognition and measurement of contract assets and contract liabilities acquired in a business combination in accordance with ASC 606, Revenue from Contracts with Customers. This creates an exception to the general recognition and measurement principles in ASC 805. As a smaller reporting company, ASU 2021-08 will be effective for the Company for interim and annual reporting periods beginning after December 15, 2023, with early adoption permitted. The amendments in this ASU should be applied prospectively to business combinations occurring on or after the effective date of the amendments. The Company does not anticipate that the adoption of this guidance will have a material impact on the consolidated financial statements.\nIn November 2021, the FASB issued ASU 2021-10, Government Assistance (Topic 832): Disclosures by Business Entities about Government Assistance. This update requires certain annual disclosures about transactions with a government that are accounted for by applying a grant or contribution accounting model by analogy. This update is effective for annual periods beginning after December 15, 2021, and early application is permitted. This guidance should be applied either prospectively to all transactions that are reflected in financial statements at the date of initial application and new transactions that are entered into after the date of initial application or retrospectively to those transactions. The Company does not expect the impact of this guidance to have a material impact on the Companys consolidated financial statements.\nExcept for the above-mentioned pronouncements, there are no new recent issued accounting standards that will have material impact on the consolidated financial position, statements of operations and cash flows.\n3. ACQUISITION OF SUBSIDIARIES\nOn August 17, 2020, the Company acquired all of the issued and outstanding capital stock (the Acquisition) of NPI, pursuant to the terms and conditions of that certain Stock Purchase Agreement, dated as of the Closing Date, among the Company, NPI, the selling shareholders of NPI identified therein (each a Seller, and, collectively, the Sellers) and the representative of the Sellers identified therein.\nThe aggregate purchase price for the Acquisition was $4,850,000, less certain discounts, expenses and reductions for outstanding NPI debt owed to the Company and/or its affiliates, resulting in a net purchase price of $3,506,042, payable in 8,415,111 shares of the Companys common stock to the Sellers in accordance with their respective pro rata percentage.\nAfter the completion of the Acquisition, NPI became a wholly owned subsidiary of the Company.\nThe Company completed the valuations necessary to assess the fair values of the tangible and intangible assets acquired and liabilities assumed, resulting from which the amount of goodwill was determined and recognized as of the respective acquisition date. The following table summarizes the estimated aggregate fair values of the assets acquired and liabilities assumed as of the closing date, August 31, 2020.\nSUMMARY OF FAIR VALUES OF ASSETS ACQUIRED AND LIABILITIES ASSUMED\nCash and cash equivalents $ 185,117\nPrepayments, deposits and other receivables 145,228\nDue from a shareholder 34,048\nRight-of-use operating lease assets 113,590\nPlant and equipment, net 30,365\nIntangible assets- Technical know-hows 818,200\nGoodwill 2,974,364\nOther payables and accrued liabilities (383,087 )\nContract liabilities (2,896 )\nDue to shareholders (99,730 )\nOperating lease liability (113,646 )\nTax payable (31,871 )\nDeferred tax liabilities (163,640 )\nNet purchase price $ 3,506,042\nLess: Outstanding NPI debt owed to the Company\nAccounts receivable 989,854\nNotes payable (3,066,617 )\nAggregate fair values of the assets acquired and liabilities assumed $ 1,429,279\nThe transaction resulted in a purchase price allocation of $2,974,364 to goodwill, representing the financial, strategic and operational value of the transaction to the Company. Goodwill is attributed to the premium that the Company paid to obtain the value of the business of NPI and the synergies expected from the combined operations of NPI and the Company, the assembled workforce and their knowledge and experience in provision of products and projects utilizing NPIs technical know-hows and FinTech App development. The total amount of the goodwill acquired is not deductible for tax purposes.\nThe movement of the goodwill for the years ended August 31, 2022 and 2021 are as follows:\nSCHEDULE OF MOVEMENT OF GOODWILL\nBalance as of September 1, 2020 $ 2,974,364\nImpairment of goodwill in relation to NPI (1,226,419 )\nBalance as of August 31, 2021 $ 1,747,945\nImpairment of goodwill in relation to NPI (1,747,945 )\nBalance as of August 31, 2022 $ -\nThe Company performed goodwill impairment test at the reporting unit level on an annual basis and between annual tests when an event occurs or circumstances change indicating the asset might be impaired. As of August 31, 2022, the Company performed testing on reporting unit of the Fintech App development.\nThe Company first assessed qualitative factors to determine whether it is more likely than not that the fair value of a reporting unit is less than its carrying amount. For those reporting units where it is determined that it is more likely than not that their fair values are less than the units carrying amounts, the Company will perform the first step of a two-step quantitative goodwill impairment test. After performing the assessment, if the carrying amounts of the reporting units are higher than their fair values, the Company will perform the second step of the two-step quantitative goodwill impairment test.\nIn 2022 and 2021, the Company performed qualitative assessments for FinTech App development reporting unit. Based on the requirements of ASC 350-20-35-3C through ASC 350-20-35-3G, the Company evaluated all relevant factors, weighed all factors in their totality. As the financial performance of FinTech App development reporting unit was below original expectations, fair value of this reporting unit was indicated to be lower than its carrying value. For this reporting unit, where it was determined that it was more likely than not that its fair value was less than the units carrying amount after performing the qualitative assessment, as a result, the Company performed the two-step quantitative goodwill impairment test for these two reporting units.\nFor the two-step goodwill impairment test, the Company estimated the fair value with either income approach or asset approach for specific reporting unit components. With the income approach, the Company estimates the fair value of the reporting units using discounted cash flows. Forecasts of future cash flows are based on the best estimate of future net sales and operating expenses, based primarily on expected expansion, pricing, market share, and general economic conditions. Certain estimates of discounted cash flows involve businesses with limited financial history and developing revenue models. Changes in these forecasts could significantly change the amount of impairment recorded, if any. Asset based approach is used in evaluating the fair value of some specific components which is deemed as the most prudent approach due to the unpredictability of future cash flows.\nThe result of step one impairment test for the FinTech App development reporting unit failed, with its determined fair value lower than the book value. The Company performed step two impairment test, applying the income approach, resulting an impairment loss of goodwill of $1,747,945 and $1,226,419, respectively being recorded for the years ended August 31, 2022 and 2021. The impairment loss of goodwill was primarily attributable to the impairment related to NPI as the financial performance of the reporting unit of FinTech App development continued to fall below the Companys original expectations.\n4. PLANT AND EQUIPMENT, NET\nPlant and equipment as of August 31, 2022 and 2021 are summarized below:\nSCHEDULE OF PLANT AND EQUIPMENT, NET\nAs of August 31,\nFurniture and fixtures $ 30,494 $ 64,791\nOffice equipment 89,858 32,038\nLeasehold improvements 82,969 83,883\nTotal 203,321 180,712\nLess: Accumulated depreciation (132,317 ) (110,952 )\nPlant and equipment, net $ 71,004 $ 69,760\nDepreciation expense, classified as operating expenses, was $44,326 and $36,674 for the year ended August 31, 2022 and 2021 respectively.\n5. INTANGIBLE ASSETS, NET\nIntangible assets, net, as of August 31, 2022 and 2021 consisted of the following:\nSCHEDULE OF INTANGIBLE ASSETS\nAs of August 31,\nInvestment platform $ 30,000 $ 30,000\nTechnical know-hows (Note 3) 818,200 818,200\nTrademarks 4,920 3,483\nTotal 853,120 851,683\nLess: Accumulated amortization (199,035 ) (108,959 )\nImpairment (649,781 ) (111,915 )\nIntangible assets, net $ 4,304 $ 630,809\nAmortization expense for intangible assets was $90,076 and $102,459, respectively, for the years ended August 31, 2022 and 2021.\nDuring the course of the Companys strategic review of its operations, the Company assessed the recoverability of the carrying value of the Companys intangible assets. The impairment charge, if any, represented the excess of carrying amounts of the Companys intangible assets over their fair value, using the expected future discounted cash flows. Impairment loss of $537,866 and $88,415 was recognized for the years ended August 31, 2022 and 2021, respectively. The impairment loss of intangible assets was primarily attributable to the financial performance of NPIs technical know-hows fall below the Companys original expectations and they assessed the recoverability of the carrying value of certain intangible assets which resulted in impairment losses.\nAs of August 31, 2022, amortization expenses related to intangible assets for future periods are estimated to be as follows:\nSCHEDULE OF AMORTIZATION EXPENSES RELATED TO INTANGIBLE ASSETS\n12 months ending August 31,\n$ 492\n2027 and thereafter 2,336\nTotal $ 4,304\n6. NON-MARKETABLE EQUITY SECURITIES\nOn August 5, 2022, the Company obtained an aggregate of 15,000,000 shares of common stock, par value $0.0001 per share of DFP Holdings Limited (DFP), a Nevada corporation, as return of software development service rendered (note 7), pursuant to the Software Development Agreement and Supplementary Agreement dated January 27, 2022 and June 28, 2022, respectively among DFP and LCHD.\nDFP engages in online higher education services. It is committed to promoting Asian talent education services, and cooperating with practical entrepreneurs on both sides of the strait to offer courses related to business management and business marketing, assisting Taiwans small and medium-sized corporations, entrepreneurs, and middle and high-level managers open up new ideas and improve their business vision. As of August 31, 2022, the Company held 7.06% of DFPs outstanding common stock.\n7. RELATED PARTY TRANSACTIONS AND BALANCES\nSCHEDULE OF RELATED PARTY RELATIONSHIP\nName of Entity or Individual\nRelationship with the Company\nDFP Holdings Limited (DFP)\nNote a\nGreenpro LF Limited\nNote b\nReblood Biotech Corp.\nNote c\nReblood Biotech Limited\nNote c\nYi-Hsiu Lin\nShareholder and director of the Company\nJui-Chin Chen\nShareholder of the Company\nTeh-Ling Chen\nShareholder of the Company\nCPN Investment Limited\nShareholder of the Company\nKuo-Hsun Hsu\nShareholder of the Company\nChun-Shuo Huang\nShareholder of the Company\nYu-Cheng Tu\nShareholder of the Company\nChin-Chiang Wang\nShareholder of the Company\nChing-Nan Wang\nShareholder of the Company\nChin-Ping Wang\nShareholder of the Company\nWang Ding-Yu\nShareholder of the Company\n(a) As of August 31, 2022, the Company and Yi-Hsiu Lin held 7.06% and 7.06% of DFPs outstanding common stock.\n(b) Greenpro LF Limited, a Seychelles company, owned by Mr. Yi-Hsiu Lin, a director of the Company and Mr. Lee Chong Kuang.\n(c) Reblood Biotech Corp., a Nevada company, in which Yi-Hsiu Lin was the shareholder. Reblood Biotech Limited, a Hong Kong company, which was a subsidiary of Reblood Biotech Corp.\nRelated party transactions:\nThe Company entered into the following significant related party transactions:\nSCHEDULE OF RELATED PARTY TRANSACTIONS\nYear ended August 31,\nProvision of software development service and maintenance service to DFP (a) $ 301,500 $ -\nProvision of software maintenance service to DFP 2,898 -\nRental expense to Yu-Cheng Tu (b) 3,142 19,135\nRental expense to Reblood Biotech Limited (g) 34,571 8,724\nOther income:\nOther income from Greenpro LF Limited - 1,838\nInterest expense to:\nTeh-Ling Chen ((c) and Note 13) 9,670 8,701\nCPN Investment Limited (f) -\nChun-Shuo Huang (Note 10) 12,366 -\nChing-Nan Wang (Note 12) 60,000 60,000\nJui-Chin Chen (Note 10 and 13) 6,517 6,000\nChin-Chiang Wang (Note 10 and 13) 9,165\nChin-Ping Wang (Note 13) 2,835 9,165\nChing-Nan Wang (Note 13) 2,835 9,165\n(a) The Company entered into a Customized App Development Agreement providing the online and offline learning opportunities across different subjects on January 27, 2022 with DFP. The Company delivered an app and provided the follow-up maintenance service in August 2022.\n(b) On September 1, 2020, LOC leased an office in Taichung, Taiwan from the Companys shareholder- Yu-Cheng Tu. The lease was renewed on April 1, 2021 for additional one-year term. The monthly lease was for the amount of NTD 45,000 ($1,595), with a term of one year. During the year ended August 31, 2022 and 2021, the Company recognized rental expenses of $3,142 and $19,135, respectively that are included in general and administrative expenses.\n(c) The Company entered into a loan agreement with Teh-Ling Chen for $50,000 for a period of four months from March 1, 2022 to June 30, 2022. NTD1,480,000 ($50,000) was received during March to May 2022. On June 17, 2022, 500,576 shares of the Company were subsequently issued to Teh-Ling Chen at a market value of $0.10 per share for the repayment of principal and accrued interest. Interest of $576 was incurred for the year ended August 31, 2022. No interest was accrued as of August 31, 2022 and 2021.\n(d) On April 25, 2022, the Company obtained non-interest bearing loan of NTD214,500 ($7,061) from Ding-Yu Wang. The loan was fully repaid on July 19, 2022.\n(e) A principal of NTD40,000 ($1,317) was obtained from Kuo-Hsun Hsu on May 13, 2022. The loan is non-interest bearing and was fully repaid on July 19, 2022.\n(f) The Company borrowed a principal amount of $40,000 on May 16, 2022 from a shareholder - CPN Investment Limited. The loan was 6% interest bearing payable on maturity and would be matured in one year. The loan was fully repaid on May 31, 2022. Interest of $100 was incurred for the year ended August 31, 2022.\n(g) On June 1, 2021, JFB leased an office in Taipei, Taiwan from a company which was the subsidiary of Reblood Biotech Corp.. The monthly lease was for the amount of NTD 82,062 ($2,865), with a term of 16 months. During the years ended August 31, 2022 and 2021, the Company recognized rental expenses of $34,571 and $8,724, respectively that are included in general and administrative expenses.\nRelated party balances:\nApart from the above, the Company recorded the following significant related party balances as of August 31, 2022 and 2021:\nSCHEDULE OF RELATED PARTY BALANCES\nAs of August 31,\nAccounts receivable from related parties\nReceivables from DFP $ 2,732 $ -\nUp to the date of this report, DFP had repaid $2,732 to the Company.\nAs of August 31,\nContract liabilities due to related parties\nContract liabilities due to DFP $ 150,000 $ -\nUp to the date of this report, $150,000 of the contract liabilities had been utilized.\nAs of August 31,\nAccrued interests payable to related parties\nChing-Nan Wang (note 12) $ 2,935 $ 2,935\nChun-Shuo Huang (note 10 (a)) 2,851 -\nJui-Chin Chen (note 10(b)) 3,229 -\nChin-Chiang Wang (note 10(c)) 9,165 -\nTotal $ 18,180 $ 2,935\n8. PREPAYMENTS, DEPOSITS AND OTHER RECEIVABLES\nSCHEDULE OF PREPAYMENTS, DEPOSITS AND OTHER RECEIVABLES\nAs of August 31,\nRental and management fee deposits $ 100,498 $ 120,831\nOther prepaid expenses 52,723 194,040\nOther taxes recoverable 35,802 19,183\nPrepayments, deposits and other receivables 189,023 334,054\nLess: non-current portion\nRental and management fee deposits 12,822 54,204\nOther prepaid expenses - 48,135\nPrepayments, deposits and other receivables, non-current 12,822 102,339\nPrepayments, deposits and other receivables, current $ 176,201 $ 231,715\n9. ACCRUED EXPENSES AND OTHER PAYABLES\nSCHEDULE OF ACCRUED EXPENSES AND OTHER PAYABLES\nAs of August 31,\nAccrued interests (Notes 7, 10 and 12) $ 18,180 $ 2,935\nAccrued payroll 150,932 207,864\nAccrued expenses, others 197,428 87,822\nOther taxes payable 1,377 -\nPoint liabilities 82,638 75,648\nAccrued expenses and other payables $ 450,555 $ 374,269\n10. DUE TO SHAREHOLDERS, DIRECTORS AND OTHER LOANS FROM SHAREHOLDERS\nSCHEDULE OF DUE FROM (TO) SHAREHOLDERS, DIRECTORS AND A RELATED COMPANY\nAs of August 31, As of August 31,\nOther loans from shareholders:\nJui-Chin Chen (b) 80,000 -\nChun-Shuo Huang (a) 145,159 -\nMei-Ying Huang (d) 35,550 -\nChin-Chiang Wang (c) 200,000 -\nTotal (Note 11) 460,709 -\nLess: Other loans from shareholders, non-current (200,000 ) -\n$ 260,709 $ -\nDue to a director - current:\nYi-Hsiu Lin (e) $ 973,564 $ 1,098,374\nDue to shareholders - current:\nYu-Cheng Tu (e) $ 42,472 $ 50,591\nHung-Pin Cheng (e)\nMei-Ying Huang (e)\nShih-Chu Lo (e)\nJun-Yuan Chen (e)\n$ 45,343 $ 53,791\n(a) On February 28, 2022, the Company obtained a loan of RMB1,000,000 ($145,159) from Chun-Shuo Huang, which accrues interest at the rate of 8% per annum. The loan was due on May 27, 2022 and further extended to December 31, 2022 and accrued interest at the rate of 2% per month. Interest of $12,366 was incurred for the year ended August 31, 2022. $Nil was subsequently repaid by the Company as of December 14, 2022. Interest of $2,851 was accrued as of August 31, 2022.\n(b) The loan was modified from convertible note on March 23, 2022 (note 13(a)) and the principal amount of $100,000 would be repayable by October 31, 2022. The balance was classified as 6% short-term loan on the same date (Note 10). On May 29, 2022, the Company further amended the Note and the principal and interests would be repayable in five installments before November 30, 2022 with 6% interest-bearing per annum. For the year ended August 31, 2022, principal of $20,000 was repaid and interest of $3,164 was incurred. Interest of $3,229 was accrued as of August 31, 2022. On November 29, 2022, the loan and interests payable were further extended to November 30, 2023. $Nil was subsequently repaid by the Company as of December 14, 2022.\n(c) The loan was modified from convertible note on May 3, 2022 (note 13(c)) and the principal amount of $200,000 would mature on November 25, 2024 with 6% interest-bearing per annum. For the year ended August 31, 2022, interest of $3,945 were incurred. Interest of $9,165 was accrued as of August 31, 2022.\n(d) The Company borrowed non-interest bearing loans in the aggregate amount of NTD4,000,000 ($131,665) from Mei-Ying Huang. The loan of NTD2,500,000 ($82,291) borrowed on November 24, 2021 was due on May 24, 2022 but further extended to December 31, 2022. During the year ended August 31, 2022, NTD1,500,000 ($49,374) was repaid. The loan of NTD1,000,000 ($32,916) borrowed on January 12, 2022 was fully repaid on July 22, 2022. NTD420,000 ($13,825) was repaid for the remaining loan of NTD500,000 ($16,458) obtained on February 9, 2022 which would be repayable based on the Companys financial ability.\n(e) Amounts due to other shareholders and a director are unsecured, interest-free with no fixed payment term.\n11. OTHER LOANS FROM A NON-RELATED PARTY\nOn May 20, 2022, the Company borrowed non-interest bearing loan of NTD250,000 ($8,729) from a non-related company which was owned by an employee of the Company. The loan would be repayable on December 31, 2022. Further NTD50,000 ($1,746) was borrowed on July 8, 2022. The Company fully repaid the loans on July 19, 2022.\n12. BONDS PAYABLE TO RELATED PARTY\nThe Company had entered into a Bond Purchase Agreement with Ching-Nan Wang (who became the Companys shareholder in May 2021) on August 14, 2019, pursuant to which the Company issued and sold to the purchaser a bond at an aggregate principal amount and an aggregate purchase price of $600,000. The bond will mature in three years from August 14, 2019. Interest on the bond will be payable on semi-yearly basis at 10% per annum. The Company may exercise its right to repay this bond at any time on or before two years from the maturity date by wiring 100% of all outstanding principal and interest(s) to the Purchaser. On August 10, 2022, the bond was further extended to August 14, 2023 and 12% p.a. interest was payable quarterly. The bond was collateralized by 2,000,000 shares of DFP Holdings Limited and 1,000,000 shares of Reblood Biotech Corp. held by Yi-Hsiu Lin. Interest of $60,000 was incurred in each of the years ended August 31, 2022 and 2021, respectively. Interest of $2,935 was accrued as of August 31, 2022 and 2021.\n13. CONVERTIBLE NOTES PAYABLE TO RELATED PARTIES\nThe Company entered into a series of Convertible Promissory Note Purchase Agreements (the Agreements) with certain investors between March 2020 and January, 2021. Pursuant to the Agreements, the Company issued certain Convertible Promissory Notes (the Notes) to the investors in a total principal amount of $900,000. A summary of the major terms of the Agreements are presented as follows:\nSCHEDULE OF CONVERTIBLE NOTES PAYABLE\nInvestor Principal amount Issue date Maturity date Interest rate\nJui-Chin Chen (a) $ 100,000 March 18, 2020 March 18, 2022 6 %\nTeh-Ling Chen (b) 100,000 November 2, 2020 November 2, 2022 6 %\nChin-Ping Wang (c) 200,000 November 25, 2020 November 25, 2022 6 %\nChing-Nan Wang (d) 200,000 November 25, 2020 November 25, 2022 6 %\nChin-Chiang Wang (d) 200,000 November 25, 2020 November 25, 2022 6 %\nTeh-Ling Chen (e) 100,000 January 15, 2021 January 15, 2023 6 %\n$ 900,000\n(a) On March 18, 2020, the Company issued an unsecured note in the principal amount of $100,000, which accrues interest at the rate of 6% per annum, to a shareholder - Jui-Chin Chen. On August 17, 2020, the Company amended the Note and the Agreement, wherein, at the sole option of the applicable noteholder, all or part of the unpaid outstanding principal of such noteholders Note would be convertible into shares of restricted common stock of the Company at a conversion price equal to $0.40 per share. On March 23, 2022, the Company further amended the Note and the Agreement with the noteholder, mutually agreed to cancel the conversion option and to repay the principal in two installments and accrued interest during that period before October 31, 2022. The balance was classified as 6% short-term loan on the same date (Note 10). On May 29, 2022, the Company further amended the Note and the Agreement with the noteholder, mutually agreed to repay the principal and interests in five installments before November 30, 2022. Up to the date of this report, the Company repaid $nil to Jui-Chin Chen.\n(b) On November 2, 2020, the Company issued a Note in the principal amount of $100,000, which accrues interest at the rate of 6% per annum, to a shareholder - Teh-Ling Chen. The note is due on November 2, 2022 and unsecured. On May 10, 2022, the Company entered into an amendment to the Note with the shareholder, wherein, at the sole option of the applicable noteholder, all or part of the unpaid outstanding principal of such noteholders Note would be convertible into shares of restricted common stock of the Company at a conversion price equal to $0.10 per share. On May 12, 2022, the shareholder submitted conversion notice to the Company converting all of the outstanding balance of his Note into an aggregate of 1,000,000 shares of the Companys common stock. The conversion was approved by the Company on May 17, 2022 and the shares were issued on May 19, 2022.\n(c) On November 25, 2020, the Company issued a Note in the principal amount of $200,000, which accrues interest at the rate of 6% per annum, to a shareholder - Chin-Chiang Wang. The Note is due on November 25, 2022 and unsecured. On May 3, 2022, the Company entered into an amendment to the Note and the convertible promissory note purchase agreement with Chin-Chiang Wang, mutually agreed to extend the maturity date to November 25, 2024 and cancel the conversion option. The balance was classified as non-current 6% loan on the same date (Note 10).\n(d) On November 25, 2020, the Company issued several Notes in the total principal amount of $400,000, which accrues interest at the rate of 6% per annum, to shareholders - Chin-Ping Wang and Ching-Nan Wang. The notes are due on November 25, 2022 and unsecured. On January 24, 2022, the Company entered into an amendment to the Notes with these two shareholders, wherein, at the sole option of the applicable noteholder, all or part of the unpaid outstanding principal of such noteholders Notes would be convertible into shares of restricted common stock of the Company at a conversion price equal to $0.25 per share. On January 26, 2022, the shareholders submitted conversion notices to the Company converting all of the outstanding balances of their Notes into an aggregate of 1,600,000 shares of the Companys common stock. The conversion was approved by the Company on January 31, 2022 and the shares were issued on March 15, 2022.\n(e) On January 15, 2021, the Company issued a Note in the principal amount of $100,000, which accrues interest at the rate of 6% per annum, to a shareholder - Teh-Ling Chen. The note is due on January 15, 2023 and unsecured. On May 10, 2022, the Company entered into an amendment to the Note with the shareholder, wherein, at the sole option of the applicable noteholder, all or part of the unpaid outstanding principal of such noteholders Note would be convertible into shares of restricted common stock of the Company at a conversion price equal to $0.10 per share. On May 12, 2022, the shareholder submitted conversion notice to the Company converting all of the outstanding balance of his Note into an aggregate of 1,000,000 shares of the Companys common stock. The conversion was approved by the Company on May 17, 2022 and the shares were issued on May 19, 2022.\nFor each of the Notes, the Company is entitled to a one-year extension. The outstanding principal amounts of the notes are convertible at any time at the option of the holders into common stock at a conversion price of $0.40 per share. Each of the noteholders may convert part of the principal outstanding in increments of $10,000 or multiples of $10,000 at any time. Accrued interest, if any, will be forfeited on any principal amount being converted.\nThe conversion feature is dual indexed to the Companys stock, and is considered an embedded derivative which needs to be bifurcated from the host instrument in accordance with ASC 815.\nASC 815-15-25 provides that if an entity has a hybrid financial instrument that would require bifurcation of embedded derivatives under ASC 815, the entity may irrevocably elect to initially and subsequently measure a hybrid financial instrument in its entirety at fair value with changes in fair value recognized in earnings. The fair value election can be made instrument by instrument and shall be supported by concurrent documentation or a preexisting documented policy for automatic election.\nThe Company elected to measure the Notes in their entirety at fair value with changes in fair value recognized as non-operating income or loss at each balance sheet date in accordance with ASC 815-15-25.\nDuring the years ended August 31, 2022 and 2021, interest of $14,376 and $42,196 were incurred on the Notes, respectively.\n14. INCOME TAXES\nFor the years ended August 31, 2022 and 2021, the local (United States) and foreign components of loss before income tax were comprised of the following:\nSCHEDULE OF INCOME/(LOSS) BEFORE INCOME TAXES\nYear ended August 31,\nTax jurisdictions from:\n- Local $ (6,165,700 ) $ (7,272,060 )\nState and local income tax expense (benefit), continuing operations $ (6,165,700 ) $ (7,272,060 )\n- Foreign, representing\nSeychelles - (1,610 )\nBritish Virgin Islands (2,059 ) (89,403 )\nTaiwan (4,577,208 ) (3,077,725 )\nPRC (739,876 ) (594,153 )\nHong Kong (560,756 ) (696,679 )\nTax jurisdictions from: foreign, representing (560,756) (696,679)\nLoss before income tax $ (12,045,599 ) $ (11,731,630 )\nThe components of the provision for income taxes benefits are:\nSCHEDULE OF COMPONENTS OF PROVISION BENEFIT FOR INCOME TAXES\nYear ended August 31,\nCurrent $ - $ -\nDeferred (125,502 ) (38,138 )\nTotal income tax benefits $ (125,502 ) $ (38,138 )\nThe provision for income taxes consisted of the following:\nSCHEDULE OF PROVISION FOR INCOME TAXES\nYear ended August 31,\nLoss before income taxes $ (12,045,599 ) $ (11,731,630 )\nStatutory income tax rate 21 % 21 %\nIncome tax credit computed at statutory income rate (2,529,576 ) (2,463,642 )\nReconciling items:\nNon-deductible expenses 1,447,143 406,560\nShare-based payments 398,864 1,378,279\nTax effect of tax exempt entity 19,113\nRate differential in different tax jurisdictions 18,468 29,490\nChange in unrecognized deferred tax assets - 39,667\nValuation allowance on deferred tax assets 539,167 552,395\nIncome tax benefits $ (125,502 ) $ (38,138 )\nUnited States of America\nThe Company is registered in the State of Nevada and is subject to the tax laws of the United States of America. As of August 31, 2022, the operations in the United States of America incurred $2,383,640 of cumulative net operating losses (NOLs) which can be carried forward to offset future taxable income. The NOL carryforwards begin to expire in 2037, if unutilized. As of August 31, 2022 and 2021, the Company has provided for a full valuation allowance of $500,564 and $440,622, respectively, against the deferred tax assets on the expected future tax benefits from the net operating loss carryforwards as the management believes it is more likely than not that these assets will not be realized in the future.\nSeychelles\nUnder the current laws of the Seychelles, LFG is registered as an international business company which governs by the International Business Companies Act of Seychelles and there is no income tax charged in Seychelles.\nBritish Virgin Islands\nNPI is tax exempted in the British Virgin Islands where it was incorporated.\nTaiwan\nLOC is subject to corporate income tax (CIT) in Taiwan. With effect from January 1, 2018, the CIT rate in Taiwan is 20%. However, for profit-seeking entities with less than NT$ 500,000 (approximately $16,000) in taxable income, the CIT rate is 18% in 2018, 19% in 2019, and 20% since 2020 if taxable income exceeds NT$120,000 (approximately $4,190). As of August 31, 2022, LOC had net operating loss carry-forwards in Taiwan of $3,498,858, which will expire in various years through 2027. The Company has provided for a full valuation allowance of $699,772 against the deferred tax assets on the expected future tax benefits from the net operating loss carryforwards as the management believes it is more likely than not that these assets will not be realized in the future.\nPRC\nBJDC is subject to corporate income tax (CIT) at 25% in accordance with the relevant tax laws and regulations of the PRC. As of August 31, 2022, BJDC had net operating loss carry-forwards in the PRC of $2,402,593, which will expire in various years through 2029. The Company has provided for a full valuation allowance of $600,648 against the deferred tax assets on the expected future tax benefits from the net operating loss carryforwards as the management believes it is more likely than not that these assets will not be realized in the future.\nHong Kong\nJFB is subject to Hong Kong Profits Tax, which is charged at the statutory income rate of 16.5% on its assessable income. No provision for Hong Kong profits tax has been made in the financial statements as JFB has no assessable profits for the years. As of August 31, 2022, the operations in Hong Kong incurred $nil of cumulative net operating losses (NOLs) which can be carried forward indefinitely to offset future taxable income. As of August 31, 2022 and 2021, the Company has provided for a full valuation allowance of approximately $nil against the deferred tax assets on the expected future tax benefits from the net operating loss carryforwards as the management believes it is more likely than not that these assets will not be realized in the future.\nThe tax effects of temporary differences that give rise to significant portions of the deferred tax assets and liabilities as of August 31, 2022 and 2021 are presented below:\nSCHEDULE OF DEFERRED TAX ASSETS\nAs of August 31,\nDeferred tax assets:\nNet operating loss carryforwards\n- United States of America $ (500,564 ) $ (440,622 )\n- Taiwan (699,772 ) (351,606 )\n- PRC (600,648 ) (421,733 )\n- Hong Kong - -\nLess: valuation allowance 1,800,984 1,213,961\n$ - $ -\nDeferred tax liabilities:\nIntangible assets- Technical know-hows $ - $ 125,502\n15. COMMON STOCK\nOn September 1, 2019, the Company entered into an employment agreement with Yi-Hsiu Lin to serve as the Chief Executive Officer of the Company for a two-year term. Pursuant to the agreement, Mr. Lin was compensated at an annual rate of $50,000 per year (the Base Compensation), prorated for any partial year in cash or 2,500,000 shares of restricted common stock, which vested on September 16, 2019 and September 1, 2020. In addition, Mr. Lin was be entitled to bonus compensation of up to three (3) times Base Compensation based on his achievement of appropriate performance criteria to be determined by the board of directors or a committee thereof. The fair value of the shares of restricted common stock was $1,250,000 and $1,000,000, respectively, which was calculated based on a price per share of $0.50 and $0.40, respectively and amortized over the service term. On September 1, 2021, the Company renewed the employment agreement with Yi-Hsiu Lin for additional two years. Pursuant to the agreement, Mr. Lin will be compensated at an annual rate of $120,000 per year (the Base Compensation), prorated for any partial year, payable in cash or with 2,500,000 shares of restricted common stock, which would vest as of March 1, 2022 and March 1, 2023. In addition, Mr. Lin may be entitled to bonus compensation of up to three times the Base Compensation based on his achievement of appropriate performance criteria to be determined by the board of directors or a committee thereof. The bonus compensation offer was cancelled on March 1, 2022. The fair value of the shares of restricted common stock for the first year ending August 31, 2022 was $250,000, which was calculated based on a price per share of $0.10 and amortized over the service term. During the years ended August 31, 2022 and 2021, the Company amortized $250,000 and $1,000,000, respectively, as remuneration. 2,500,000 shares were subsequently issued to Yi-Hsiu Lin on October 5, 2022.\nOn September 1, 2019, the Company issued a director offer letter to Shui Fung Cheng, pursuant to which Mr. Cheng agreed to serve as a director of the Company for a one-year term. Mr. Cheng would receive an annual compensation, prorated for any partial year, in the form of $30,000 in cash or 1,500,000 shares of restricted common stock. The offer letter provided that compensation, either in cash or shares of restricted common stock, would be paid or granted immediately on September 1, 2019. The fair value of the shares of restricted common stock was $750,000, which was calculated based on a price per share of $0.50 and amortized over the service term. The offer was renewed on September 1, 2020 and all shares were granted and vested on the same date. The fair value of the shares of restricted common stock granted on September 1, 2020 was $1,500,000, which was calculated based on a price per share of $0.40 and amortized over the service term. On September 1, 2021, the Company issued a director offer letter to Shui Fung Cheng, pursuant to which Mr. Cheng agreed to serve as a director of the Company for a one-year term. For his service as a director, Mr. Cheng would receive an annual compensation, prorated for any partial year, in the form of $80,000 in cash or 1,500,000 shares of restricted common stock. The offer letter provided that compensation, either in cash or shares of restricted common stock, would be paid or granted immediately on September 1, 2021. The fair value of the shares of restricted common stock granted on September 1, 2021 was $150,000, which was calculated based on a price per share of $0.10 and amortized over the service term. During the years ended August 31, 2022 and 2021, the Company amortized $150,000 and $600,000, respectively, as remuneration. 1,500,000 shares were subsequently issued to Shui Fung Cheng on October 5, 2022.\nOn June 30, 2020, the Company entered into a stock forfeiture letter (the Stock Forfeiture Letter) with First Leader Capital Ltd., a significant stockholder of the Company and an entity solely owned and controlled by Yi-Hsiu Lin, the Companys Chief Executive Officer and a member of the Companys board of directors. Pursuant to the Stock Forfeiture Letter, on June 30, 2020, First Leader Capital Ltd. forfeited and surrendered 5,500,000 shares (the Surrendered Shares) of the Companys common stock, par value $0.0001 per share (the Common Stock), and the Surrendered Shares were automatically cancelled and retired (the Stock Cancellation). First Leader Capital Ltd. agreed to forfeit and cancel the Surrendered Shares in exchange for the benefit from reducing the Companys outstanding Common Stock to be more in line with what management deems to be market expectations based on the Companys current valuation. 5,500,000 shares were canceled on September 21, 2020.\nOn March 1, 2020, the Company entered into a consulting agreement with a consultant to provide business advisory services to the Company for a one-year term. Pursuant to the agreement, the Company agreed to pay the consultant a fee of $60,000 and 1,000,000 shares of restricted common stock, which vested not later than June 30, 2020, prorated for any partial year. On June 30, 2020, the Companys board of directors approved additional 500,000 shares to the consultant in exchange for services rendered. On March 1, 2021, the Company renewed the consulting agreement for a one-year term. Pursuant to the agreement, the Company agreed to pay the consultant a fee of $60,000 and 1,000,000 shares of restricted common stock, which vested not later than June 30, 2021, prorated for any partial year. The fair value of the shares of restricted common stock was $750,000 and $100,000, respectively which was calculated based on a price per share of $0.50 and $0.10 respectively and amortized over the service term. During the year ended August 31, 2022 and 2021, the Company amortized $50,000 and $425,000, respectively, as consulting expenses under this agreement.\nOn June 30, 2020, the Companys board of directors agreed to grant a new employee of JFB, (i) 5,000,000 shares of restricted common stock in connection with such employees employment (the Inducement Shares) and (ii) 5,000,000 shares of restricted common stock upon the achievement of each of two milestones set forth in such employees offer letter relating to the FinMaster mobile application. As of August 31, 2020, 5,000,000 common shares of the Company had been issued to the employee. The fair value of the shares of restricted common stock issued to him was $6,000,000, which was calculated based on a price per share of $0.40. As of August 31, 2022, apart from the 5,000,000 Inducement Shares, 5,000,000 shares were vested to the employee upon achievement of the first milestone set forth in the employee offer letters, the Company amortized $139,560, $1,622,940 and $237,500, respectively as salaries under this milestone for the years ended August 2022, 2021 and 2020. However, during the year ended August 31, 2022, the company reassessed the likelihood that the employee will achieve for the second milestone and determined that the employees will not achieve the targets of the second milestone, the Company recognized a reverse to salary $348,627 under this milestone. During the year ended August 31, 2022 and 2021, the Company (reversed) amortized $(209,066) and $1,971,567 as salaries respectively. As of August 31, 2022, 10,000,000 shares were issued.\nThe Company issued 8,415,111 shares of common stock for the acquisition of NPI in August 2020 (Note 1).\nOn July 27, 2020, the Company issued an offer letter to a staff member, pursuant to which the staff member agreed to serve as an executive assistant of the Company. For the service as an executive assistant, the staff member received a monthly compensation in the form of NT$77,000 ($2,717) for the first three months (probationary period) and thereafter NT$92,500 ($3,264) in cash. In addition, the staff member would have been granted 50,000 shares of restricted common stock upon completion of the first year of service and 50,000 shares of restricted common stock if the staff member met the criteria established by the Company. The fair value of the shares of restricted common stock was $50,000, which was calculated based on a price per share of $1.00 and amortized over the service term. The Company cancelled the offer on May 1, 2021. During the years ended August 31, 2022 and 2021, the Company recognized $nil and $50,000 respectively as compensation under this arrangement.\nOn August 1, 2020, the Company entered into a one-year consulting services agreement with a company. Pursuant to the agreement, the Company agreed to pay the provider an annual compensation of $66,000, prorated for any partial year. In addition, for the services rendered by the providers employees, the provider was granted 1,000,000 shares of restricted common stock, vested on September 15, 2020. The fair value of 1,000,000 shares granted was $400,000, which was calculated based on the stock price of $0.40 per share and will be amortized over the service term. During the years ended August 31, 2022 and 2021, the Company recognized $16,666 and $383,334 respectively as compensation under these arrangements. The shares were issued on January 6, 2021.\nOn August 3, 2020, the Company issued an offer letter to a staff member, pursuant to which the staff member agreed to serve as an executive assistant of the Company. For the service as an executive assistant, the staff member received a monthly compensation in the form of NT$77,000 ($2,717) in cash. In addition, the staff would have been granted 50,000 shares of restricted common stock upon completion of the first year of service and 50,000 shares of restricted common stock if she met the criteria established by the Company. The fair value of the shares of restricted common stock was $50,000, which was calculated based on a price per share of $1.00 and amortized over the service term. The Company cancelled the offer on May 1, 2021. During the years ended August 31, 2022 and 2021, the Company recognized $nil and $50,000 respectively as compensation under this arrangement.\nOn November 1, 2020, the Company entered into one-year consulting agreements with two consultants to assist in monitoring and improving FinMaster APP. Pursuant to the agreement, the Company agreed to pay the consultants 2,500,000 shares of restricted common stock, which vested on November 1, 2020, prorated for any partial year. The fair value of the shares of restricted common stock was $2,500,000, which was calculated based on a price per share of $1.00 and amortized over the service term. During the years ended August 31, 2022 and 2021, the Company amortized $416,666 and $2,083,334 respectively as consulting expenses under these agreements.\nOn February 8, 2021, the Company and First Leader Capital Ltd. mutually agreed to forfeit and surrender further 5,000,000 shares (the Surrendered Shares) of the Companys common stock, par value $0.0001 per share (the Common Stock), and the Surrendered Shares were automatically cancelled and retired. First Leader Capital Ltd. agreed to forfeit and cancel the Surrendered Shares in exchange for the benefit from reducing the Companys outstanding Common Stock to be more in line with what management deems to be market expectations based on the Companys current valuation.\nOn May 17, 2021, the Company and First Leader Capital Ltd. mutually agreed to forfeit and surrender further 13,132,500 shares (the Surrendered Shares) of the Companys common stock, par value $0.0001 per share (the Common Stock), and the Surrendered Shares were automatically cancelled and retired. First Leader Capital Ltd. agreed to forfeit and cancel the Surrendered Shares in exchange for the benefit from reducing the Companys outstanding Common Stock to be more in line with what management deems to be market expectations based on the Companys current valuation.\nOn September 1, 2021, the Company issued an offer letter to Kuo-Hsun Hsu, pursuant to which Mr. Hsu agreed to serve as chairman of LOC for two years. Per the terms of the offer letter, Mr. Hsu will receive a monthly remuneration of NT$60,000 (equivalent to $2,157) in cash and 2,400,000 shares of restricted common stock, which shall be granted in two equal tranches and vested on March 1, 2022 and March 1, 2023. The fair value of the shares of restricted common stock for the first year ending August 31, 2022 was $120,000, which was calculated based on a price per share of $0.10 and amortized over the service term. During the year ended August 31, 2022, the Company amortized $120,000 as consulting expenses under this agreement. 1,200,000 shares were subsequently issued to Kuo-Hsun Hsu on October 5, 2022.\nOn September 1, 2021, the Company issued a Senior Vice President (SVP) offer letter to Chien Chiao, pursuant to which Mr. Chiao agreed to serve as SVP of user experience of the Company for two years. For his services, Mr. Chiao will receive a monthly remuneration of RMB 17,000 (equivalent to $2,648) in cash and 3,000,000 shares of restricted common stock, which shall be granted in two equal tranches and vested on March 1, 2022 and March 1, 2023. The fair value of the shares of restricted common stock for the first year ending August 31, 2022 was $150,000, which was calculated based on a price per share of $0.10 and amortized over the service term. During the year ended August 31, 2022, the Company amortized $150,000 as consulting expenses under this agreement. 1,500,000 shares were subsequently issued to Chien Chiao on October 5, 2022.\nOn January 26, 2022, the shareholders- Chin-Ping Wang and Ching-Nan Wang, submitted conversion notices to the Company converting all of the outstanding balances of their Convertible Notes payable (Note 13) into an aggregate of 1,600,000 shares of the Companys common stock. The conversion was approved by the Company on January 31, 2022 and the shares were issued on March 15, 2022.\nOn May 12, 2022, the shareholder- Teh-Ling Chen submitted conversion notice to the Company converting all of the outstanding balance of his Convertible Notes payable (Note 13) into an aggregate of 2,000,000 shares of the Companys common stock. The conversion was approved by the Company on May 17, 2022 and the shares were issued on May 19, 2022.\nOn June 17, 2022, 500,576 shares of the Company were issued to shareholder- Teh-Ling Chen for the repayment of loan balance and accrued interest (Note 7).\nOn December 21, 2021, pursuant to the 2021 Equity Incentive Plan, the Company granted an aggregate of 9,550,850 non-restricted share units of the Companys common stock to certain employees and consultants of the Company. In accordance with the vesting schedule of the grant, the restricted shares will vest immediately. The fair price of the non-restricted shares was $0.10 per share. The Company recognized the share-based compensation expenses over the vesting period on a graded-vesting method. The Company recorded non-cash share-based compensation of $955,085 for the year ended August 31, 2022, in respect of the non-restricted shares granted. The shares were issued on March 2, 2022. As of August 31, 2022, neither unrecognized stock-based compensation was associated with the above share units nor vested shares were to be issued.\nFrom May 2020 to August 2021, the Company entered into securities purchase agreements with several accredited investors whereby the investors purchased a total of 37,157,535 shares of the Companys common stock at an average price of $0.140 per share. The Company received aggregate gross proceeds of $5,206,994. Pursuant to the terms of the securities purchase agreements, the investors have piggyback registration rights with respect to the shares. The shares were fully issued by August 30, 2021.\nFrom September 2021 to August 2022, the Company entered into securities purchase agreements with several accredited investors whereby the investors purchased a total of 19,170,000 shares of the Companys common stock at an average price of $0.12 per share. The Company received aggregate gross proceeds of $2,290,000. Pursuant to the terms of the securities purchase agreements, the investors have piggyback registration rights with respect to the shares. The shares were fully issued by August 31, 2022.\nAs of August 31, 2022, unrecognized share-based compensation expense was $nil.\nAs of August 31, 2022, 6,800,000 shares were granted to employees and vested but not yet issued.\n16. COMMITMENTS AND CONTINGENCIES\nDuring the year ended August 31, 2022, the Company entered into agreements with independent third parties to lease office and staff quarter premises in Taiwan, Shenzhen, Beijing and Hong Kong on a monthly basis, for the operations of the Company. Rental expense those premises for the year ended August 31, 2022 and 2021 was $344,429 and $333,118, respectively.\nThe components of lease costs, lease term and discount rate with respect of leases with an initial term of at least 12 months are as follows:\nSCHEDULE OF COMPONENTS OF LEASE COSTS, LEASE TERM AND DISCOUNT RATE\nFor the year ended August 31,\nOperating lease cost - classified as general and administrative expenses $ 336,147 $ 292,567\nWeighted Average Remaining Lease Term - Operating leases 1.61 years 0.95 years\nWeighted Average Discounting Rate - Operating leases 4.90 % 4.20 %\nSupplementary cash flow information related to leases where the Company was the lessee for the year ended August 31, 2022 and 2021 was as follows:\nSCHEDULE OF SUPPLEMENTARY CASH FLOW INFORMATION RELATED TO LEASES\nFor the year ended August 31,\nOperating cash outflows from operating assets $ 344,575 $ 303,276\nThe following is a schedule, by years, of maturities of lease liabilities as of August 31, 2022:\nSCHEDULE OF MATURITIES OF LEASE LIABILITIES\nOperating\nleases\n$ 146,842\n71,875\n6,362\n-\n-\nThereafter -\nTotal undiscounted cash flows 225,079\nLess: imputed interest (6,276 )\nPresent value of lease liabilities $ 218,803\nContingencies\nThe Labor Contract Law of the Peoples Republic of China requires employers to assure the liability of the severance payments if employees are terminated due to restructuring, termination as a result of a mutual agreement or termination as a result of the expiration of a fixed-term labor contract. The Company has estimated its possible severance payments of approximately $146,000 and $129,000 as of August 31, 2022 and 2021, respectively, which have not been reflected in its consolidated financial statements, because it is more likely than not that this will not be paid or incurred.\nIn Taiwan, an employer can terminate an employment contract with notice (or with pay in lieu of notice) and with severance pay only due to stoppage of business or a transfer of ownership, business losses or curtailment of business operations, suspension of operations due to a force majeure event, or alteration of the business nature, forcing a reduction in the number of employees, and those employees cannot be reassigned to other suitable positions, or the employee is incapable of performing the tasks assigned. The Company has estimated its possible severance payments of approximately $52,000 and $69,000 as of August 31, 2022 and 2021, respectively, which have not been reflected in its consolidated financial statements, because it is more likely than not that this will not be paid or incurred.\n17. Concentrations and Credit Risk\n(a) Concentrations\nThe Company had the following customers that individually comprised 10% or more of net revenue for the years ended August 31, 2022 and 2021 as follows:\nSCHEDULE OF CONCENTRATIONS AND CREDIT RISK\nYear ended Year ended\nAugust 31, 2022 August 31, 2021\nCustomer A $ -* -* $ 31,277 33 %\nCustomer B -* -* 38,968 41 %\nCustomer C -* -* 19,606 21 %\nDFP Holdings Limited (note 7) 304,398 90 % -* -*\n* Comprised less than 10% of net revenue for the respective period.\nThe Company had the following customers that individually comprised 10% or more of net trade receivable (included VAT) as of August 31, 2022 and 2021 as follows:\nAugust 31, 2022 August 31, 2021\nDFP Holdings Limited (note 7) $ 2,732 62 % $ -* -*\n* Comprised less than 10% of net accounts receivable for the respective period.\n(b) Credit Risk\nFinancial instruments that potentially subject the Company to a significant concentration of credit risk consist primarily of cash and cash equivalents and pledged deposits. As of August 31, 2022 and 2021, substantially $135,413 and $405,528 of the Companys cash and cash equivalents were held by major financial institutions located in the PRC and Hong Kong, which management believes are of high credit quality.\nFor the credit risk related to trade accounts receivable, the Company performs ongoing credit evaluations of its customers and, if necessary, maintains reserves for potential credit losses.\n18. SUBSEQUENT EVENTS\nOn October 1, 2022, the Company entered into consultant agreement with Shou-Hung Hsu for two years. Pursuant to the agreement, Mr. Hsu will be compensated at $25,000 per year, prorated for any partial year, payable in cash or with 700,000 shares of restricted common stock, which would vest as of December 31, 2022 and September 30, 2023. The fair value of the shares of restricted common stock for the first year was $105,000, which was calculated based on a price per share of $0.30 and amortized over the service term.\nOn October 31, 2022, the Company entered into a securities purchase agreement with an individual accredited investor (the Investor), to issue and sell to the Investor 1,000,000 shares (the Shares) of the Companys restricted common stock, par value $0.0001 per share, for a purchase price of $0.30 per share. Pursuant to the terms of the securities purchase agreement, the investor will have piggyback registration rights with respect to the shares. The Company issued the Shares to the Investor on November 2, 2022, resulting in $300,000 in aggregate proceeds for the Company."
}