{
    "cik": "1721056",
    "company": "HOOPS SCOUTING USA",
    "filing_type": "10-K",
    "filing_date": "2022-10-11",
    "period_of_report": "2022-06-30",
    "sic": "7374",
    "state_of_inc": "WY",
    "state_location": "CA",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1721056/0001477932-22-007514-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1721056/000147793222007514/hosu_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1721056/0001477932-22-007514.txt",
    "filename": "1721056_10K_2022_0001477932-22-007514.htm",
    "content": "ITEM 1. BUSINESS.\nCorporate History\nHoops Scouting USA was incorporated on October 31, 2016 under the laws of the State of Wyoming. Hoops Scouting USA is a basketball scouting website www.hoopsscoutingusa.com for high school basketball players with aspirations of playing post-secondary basketball to upload stats. It is also an avenue for smaller university coaches who do not have the means to recruit larger areas of the United States and Internationally.\nWe are in the development stage, and have not realized any revenues from our operations. Jamie Oei has served as our President, Chief Executive Officer, Chief Financial Officer, Secretary and Treasurer since our inception. Our board of director is comprised of one person: Jamie Oei. Our officer and director, Jamie Oei, currently lives in Canada, and our current assets are located in the United States. We have never declared bankruptcy, have never been in receivership, and have never been involved in any legal action or proceedings. Since incorporation, we have not made any significant purchase or sale of assets. We are not a blank check registrant as that term is defined in Rule 419(a)(2) of Regulation C of the Securities Act of 1933, since we have a specific business plan or purpose. We have not had preliminary contact or discussions with, nor do we have any present plans, proposals, arrangements or understandings with any representatives of the owners of any business or company regarding the possibility of an acquisition or merger.\nFrom inception until the date of this Report, we have had limited operating activities. We have not yet commenced operations and we have primarily undertaken only organizational activities including the incorporation of our company, development of our business plan, opening a bank account, the initial equity funding by our officers and directors, and registering and launching our website. We received our initial funding of $50 through the sale of common stock from our officer and director, who purchased 500,000 shares of common stock at $0.0001 per share. During the year ended June 30, 2021, the Company received $32,000 of share subscriptions relating to a private placement of common shares at $0.10 per share. During the year ended June 30, 2022, the Company received $3,000 of share subscriptions relating to a private placement of common shares at $0.10 per share. On October 15, 2021, the Company issued 350,000 common shares at $0.10 per share relating to private placement proceeds of $35,000 that was received as of September 30, 2021.\nWe are a development stage company which is in the business of providing a website for high school basketball players with aspirations of playing post-secondary basketball. It is also an avenue for smaller university coaches who do not have the means to recruit larger areas of the United States and Internationally. Hoops Scouting USA will allow high school players to set up accounts, which include game film, schedules for high school and AAU games, stats, and high school academic marks. This will allow coaches to be able to see players and their stats and can plan their recruiting with the team schedules. This brings international recruiting to the desk of every college coach in the United States from Division 1, Division 2, Divisions 3, NAIA, and Junior College.\nTo implement our business plan, we require a minimum funding of $35,000 over the next twelve months to pay for website development and phase one of our marketing plan. After twelve months period, we may need additional financing. If we do not generate any revenue, we may need a minimum of $11,000 of additional funding to pay for legal and accounting fees, and for costs associated with being a reporting issuer under the Securities Exchange Act of 1934, as amended SEC filing requirements. Our officer and director, has agreed to loan the company funds, however, he has no firm commitment, arrangement or legal obligation to advance or loan funds to the company and there is also no guarantee that he will continue to loan the funds to the company in the future as well. We have no revenues and have incurred losses since inception.\nOur operations to date have been devoted primarily to startup and development activities, which include: (i) formation of the Company; (ii) development of our business plan; (iii) opening a bank account; (iv) the initial equity funding by our officer and director; and (v) registering and launching our website.\nOur products and products description\nHoops Scouting USA is a basketball website for high school basketball players with aspirations of playing post-secondary basketball. It is also an avenue for smaller university coaches who do not have the means to recruit larger areas of the United States and Internationally.\nHoops Scouting USA will allow high school players to set up accounts which include game film, schedules for high school and AAU games, stats, and high school academic marks. This will allow coaches to be able to see players and their stats and can plan their recruiting with the team schedules. This brings international recruiting to the desk of every college coach in the United States from Division 1, Division 2, Divisions 3, NAIA, and Junior College.\nThis also allows players from Europe, Australia, Asia, and South America to pursue opportunities in the United States to schools that would normally not be able to recruit in such a wide range. Many of the larger schools with bigger recruiting budgets are often the only ones to be able to see these international players. Often only the top players get a chance and the second and third tier players do not get a chance to be recruited. This will all change with Hoops Scouting USA.\nThe website will be the main hub but being able to upload stats and game film directly from a smart phone will allow players and coaches to get almost immediate information. Development of an app to allow this will eventually work in unison with the website.\nRevenue will be split between several revenue streams.\n1.\nPlayer Membership\na.\nPlayers sign up for full memberships which allow players to upload unlimited videos to or website and app\nb.\nPlayers sign up for partial memberships to upload one or two videos at a time.\n2.\nCoaching Membership - Coaches sign up to receive emails and check players.\n3.\nSponsorship- Website and app will have sponsors who can display their ads on videos or on the website or the app. Sponsors can receive info from the company on what pages and what videos are being viewed the most.\nA small fee for players and coaches will be invoked but sponsorship on the website and the app will be the main source of revenue.\nCurrent market trend\nA Stanford Business Article titled Five Key Trends That Are Driving the Business of Sports explains that the data are changing the way the game is played, shifting emphasis from how many total points a player scores to measures of player efficiency. It has been hard, historically, to quantify defense, said Brian Kopp, senior vice president of STATS, the company that developed SportVU player tracking. Now we have four camera views helping you do that. In addition, the data have influenced the types of shots players take on the court. All sports are at that point where, like in a lot of businesses, theyre using a lot of (data) to make better decisions.\nMarketing\nOur officer and director will promote our scouting service. We plan to market our products through the following methods: (i) our website, (ii) search engine optimization, (iii) social networking websites, (iv) printing, mailing and emailing catalogues and flyers to potential customers, (v) word of mouth, (vi), telephoning potential customers (vii) content marketing and (viii) paid ads. We hope to have repeat customers coming and buying new products online from our website.\nCompetition\nThere are many well established companies in our industry. We expect to face medium to high level of resistance, and it will be up to our marketing efforts and negotiation skills to acquire customers. Most of our competitors may have greater financial resources than we do and will be able to withstand sales or price decreases better than we are. We also expect to continue to face competition from new market entrants. We may be unable to continue to compete effectively with these existing or new competitors, which could have a material adverse effect on our financial condition and results of operations.\nInsurance\nWe do not maintain any insurance as of the date of this prospectus.\nEmployees\nWe are a development stage company and currently have no employees. Our sole officer and director manages the day-to-day operations of the Company.\nGovernment Regulation\nWe will be required to comply with all regulations, rules and directives of governmental authorities and agencies in any jurisdiction which we would conduct activities in the future. As of now there are no required government approvals present that we need approval from or any existing government regulation on our business.\nPatents, trademarks and copyrights\nWe do not own, either legally or beneficially, any patents or trademarks. We intend to protect our website with copyright laws. Beyond our trade name, we do not hold any other intellectual property.\nBankruptcy or similar proceedings\nThere has been no bankruptcy, receivership or similar proceeding.\nShell Company Status\nThe proposed business activities described herein classify us as a shell company. The Securities and Exchange Commission and certain states have enacted statutes, rules and regulations regarding the sales of securities of shell companies, as well as limitations on a shareholders ability to sell their restricted securities. Rule 144 is not available to a shareholder of a shell company unless and until the Company files a registration statement with the SEC that includes certain specific information about existing business operations of a registrant and thereafter must wait an additional one year to take advantage of that exemption from registration.\nRule 12b-2 of the 34 Act defines a shell company as a company that has:\n(1)\nNo or nominal operations; and\n(2)\nEither:\n(i)\nNo or nominal assets;\n(ii)\nAssets consisting solely of cash and cash equivalents; or\n(iii)\nAssets consisting of any amount of cash and cash equivalents and nominal other assets.\nWe will continue to file all reports required of us under the Exchange Act until we organically build our business from cash raised from investors. No assurance can be given that this will occur or, if it does, for how long. ITEM 1A. RISK FACTORS.\nWe are a smaller reporting company and not required to include this disclosure in our Form 10-K annual report. ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone. ITEM 2. PROPERTIES.\nOur executive offices are located at 63 Rocio Court, Palm Desert, CA 92260. Our telephone number is (760) 636-4353 . We currently use space in our sole officer and directors home and we believe this space is sufficient to meet our needs for the foreseeable future. We do not currently own any real estate. ITEM 3. LEGAL PROCEEDINGS.\nWe are not a party to any legal proceeding as of the date of this Report. ITEM 4. MINE SAFETY DISCLOSURES\nNot Applicable.\nPART II ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES.\nAs of the date of this Report, there is no public trading market for our common stock and no assurance that a trading market for our securities will ever develop or, if any market does develop, it may not be sustained. Our common stock is not traded on any exchange or on the over-the-counter market. ITEM 6. SELECTED FINANCIAL DATA.\nAs a smaller reporting company, we are not required to provide this information. ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS.\nThe following discussion should be read in conjunction with our audited financial statements and notes thereto included herein. In connection with, and because we desire to take advantage of, the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, we caution readers regarding certain forward-looking statements in the following discussion and elsewhere in this Report and in any other statement made by, or on our behalf, whether or not in future filings with the Securities and Exchange Commission. Forward looking statements are statements not based on historical information and which relate to future operations, strategies, financial results or other developments. Forward looking statements are necessarily based upon estimates and assumptions that are inherently subject to significant business, economic and competitive uncertainties and contingencies, many of which are beyond our control and many of which, with respect to future business decisions, are subject to change. These uncertainties and contingencies can affect actual results and could cause actual results to differ materially from those expressed in any forward-looking statements made by, or on our behalf. We disclaim any obligation to update forward looking statements.\nAccounting and audit plan\nOur independent auditor is expected to charge us approximately $6,000 to review our quarterly financial statements and approximately $5,000 to audit our annual financial statements. In the next twelve months after completion of this offering, we anticipate spending approximately $11,000 to pay for our accounting and audit requirements.\nLimited operating history\nThere is no historical financial information about us upon which to base an evaluation of our performance. We are in startup stage operations and have not generated any revenues. We cannot guarantee we will be successful in our business operations. Our business is subject to risks inherent in the establishment of a new business enterprise, including limited capital resources and possible cost overruns due to price and cost increases in services and products.\nNeed for additional capital\nWe have no assurance that future financing will be available to us on acceptable terms. If financing is not available on satisfactory terms, we may be unable to continue, develop or expand our operations. Equity financing could result in additional dilution to existing shareholders.\nOff balance sheet arrangements\nWe have no off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources.\nResults of operations\nDuring the year ended June 30, 2022, we incurred $52,443 of operating expenditures comprised of bank charges, professional fees as well as transfer agent/filing fees compared to $36,592 for the year ended June 30, 2021. The increase in operating expenses is due to increase in operating activity during the current period, including payment for legal services relating to our DTC eligibility application. Our accumulated deficit is $117,142 and we have not earned any revenues since our inception.\nSince inception, we have offered and sold (i) 500,000 shares of common stock to our officers and directors, at a purchase price of $0.0001 per share, for aggregate proceeds of $50. During the year ended June 30, 2021, the Company received $32,000 of share subscriptions relating to a private placement of common shares at $0.10 per share. During the year ended June 30, 2022, the Company received $3,000 of share subscriptions relating to a private placement of common shares at $0.10 per share. On October 15, 2021, the Company issued 350,000 common shares at $0.10 per share relating to private placement proceeds of $35,000 that was received as at September 30, 2021.\nLiquidity and Capital Resources\nAs of June 30, 2022, the Company had a cash balance and total assets of $392 compared to cash and total assets of $10,586 as at June 30, 2021. The decrease in cash and total assets was due to the proceeds received from the share subscriptions being used to pay day-to-day operating costs. As at June 30, 2022 and 2021, we had total liabilities of $82,484 and $43,235 respectively. Our working capital deficit was $66,092 as at June 30, 2022 compared to $16,649 as at June 30, 2021.\nThe available capital reserves of the company are not sufficient for the company to remain operational. As of June 30, 2022 and 2021, our officer and director, who is currently our sole shareholder, is owed $61,581 and $26,580, respectively, for paying expenses related to our operations since our inception. The amount owing is unsecured, bears no interest, and is payable on demand.\nDuring the year ended June 30, 2021, we received $16,000 in loan proceeds from two non-related investors which are unsecured, bears no interest, and is due on or before December 1, 2022.\nWe are highly dependent upon the success of the private offerings of equity or debt securities, as described herein. Therefore, the failure thereof would result in the need to seek capital from other resources such as taking loans, which would likely not even be possible for the company. At such time these funds are required, management would evaluate the terms of such debt financing. If the company cannot raise additional proceeds via a private placement of its equity or debt securities, or secure a loan, the company would be required to cease business operations. As a result, investors would lose all of their investment.\nCash Flows\nDuring the year ended June 30, 2022, we used $13,194 of cash for operating activities compared to the use of $37,562 for operating activities during the year ended June 30, 2021. The increase in the use of cash for operating activities was due to an increase in legal fees relating to our DTC eligibility.\nDuring the year ended June 30, 2022, the Company received $3,000 of share subscriptions relating to a private placement of common shares at $0.10 per share. During the year ended June 30, 2021, the Company received $32,000 of share subscriptions relating to a private placement of common shares at $0.10 per share. On October 18, 2021, the Company issued 350,000 common shares at $0.10 per share relating to private placement proceeds of $35,000 that was received as at September 30, 2021. Also during the year ended 2021, the Company received $16,000 of cash flow financing from loan proceeds. The loans payable to non-related parties are unsecured, non-interest bearing, and due on or before December 31, 2022.\nDuring the years ended June 30, 2022 and 2021, we did not have any investing activities.\nGoing concern consideration\nOur auditors have issued a going concern opinion, meaning that there is substantial doubt if we can continue as an ongoing business for the next twelve months unless we obtain additional capital. No substantial revenues are anticipated until we have completed the financing from this offering and implemented our plan of operations. Our only source for cash at this time is investments by others in this offering. We must raise cash to implement our strategy and stay in business. The amount of the offering will likely allow us to operate for at least one year and have the capital resources required to cover the material costs with becoming a publicly reporting. The company anticipates over the next 12 months the cost of being a reporting public company including legal and accounting fees will be approximately $10,000.\nSummary of significant accounting policies\nBasis of presentation\nThe financial statements of the company have been prepared in accordance with generally accepted accounting principles in the United States of America and are presented in US dollars. The Companys fiscal year end is June 30.\nIncome taxes\nThe Company accounts for income taxes using the asset and liability method in accordance with ASC 740, Income Taxes. The asset and liability method provides that deferred income tax assets and liabilities are recognized for the expected future tax consequences of temporary differences between the financial reporting and tax bases of assets and liabilities, and for operating loss and tax credit carryforwards. Deferred income tax assets and liabilities are measured using the currently enacted tax rates and laws that will be in effect when the differences are expected to reverse. The Company records a valuation allowance to reduce deferred income tax assets to the amount that is believed more likely than not to be realized.\nA valuation allowance is provided for certain deferred tax assets if it is more likely than not that the company will not realize tax assets through future operations.\nUse of estimates\nManagement uses estimates and assumption in preparing these financial statements in accordance with generally accepted accounting principles. Those estimates and assumptions affect the reported amounts of assets and liabilities, the disclosure of contingent assets and liabilities, and the reported revenues and expenses.\nFair value of financial instruments\nASC 820, Disclosures About Fair Value of Financial Instruments, requires the company to disclose, when reasonably attainable, the fair market values of its assets and liabilities which are deemed to be financial instruments. The companys financial instruments consist primarily of cash, accounts payable and accrued liabilities, amounts due to a related party, and loans payable.\nPer share information\nThe Company computes net loss per share accordance with ASC 205 Earnings per Share. ASC 205 requires presentation of both basic and diluted earnings per share (EPS) on the face of the income statement. Basic EPS is computed by dividing net loss available to common shareholders (numerator) by the weighted average number of shares outstanding (denominator) during the period. Diluted EPS gives effect to all potentially dilutive common shares outstanding during the period. Diluted EPS excludes all potentially dilutive shares if their effect is antidilutive. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nAs a smaller reporting company, we are not required to provide this information. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nThe financial statements and supplementary financial information required by this Item are set forth immediately following the signature page and are incorporated herein by reference. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE.\nNone. ITEM 9A. CONTROLS AND PROCEDURES.\nEvaluation of Disclosure Controls and Procedures\nWe carried out an evaluation, under the supervision and with the participation of our management, including our sole executive officer (who is our Principal Executive Officer, Principal Financial Officer and Principal Accounting Officer), of the effectiveness of the design of our disclosure controls and procedures (as defined by Exchange Act Rules 13a-15(e) or 15d-15(e)) as of June 30, 2022 pursuant to Exchange Act Rule 13a-15. Based upon that evaluation, our Principal Executive Officer and Principal Financial Officer concluded that our disclosure controls and procedures were not effective as of June 30, 2022 in ensuring that information required to be disclosed by us in reports that we file or submit under the Exchange Act is recorded, processed, summarized, and reported within the time periods specified in the Securities and Exchange Commissions (the SEC) rules and forms. This conclusion is based on findings that constituted material weaknesses. A material weakness is a deficiency, or a combination of control deficiencies, in internal control over financial reporting such that there is a reasonable possibility that a material misstatement of the Companys interim financial statements will not be prevented or detected on a timely basis.\nManagements Report on Internal Control Over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act. Under the supervision and with the participation of our management, which currently consists of our sole executive officer, we conducted an evaluation of the effectiveness of our internal control over financial reporting based on criteria established in the framework in Internal Control - Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO - 2013) and SEC guidance on conducting such assessments. Our management concluded, as of June 30, 2022, that our internal control over financial reporting was not effective. Management realized there were deficiencies in the design or operation of the Companys internal control that adversely affected the Companys internal controls which management considers to be material weaknesses.\nIn performing the above-referenced assessment, management had concluded that as of June 30, 2022, there were deficiencies in the design or operation of our internal control that adversely affected our internal controls which management considers to be material weaknesses including those described below:\ni)\nLack of Formal Policies and Procedures. The Company utilizes a third-party independent contractor for the preparation of its financial statements. Although the financial statements and footnotes are reviewed by our management, we do not have a formal policy to review significant accounting transactions and the accounting treatment of such transactions. The third-party independent contractor is not involved in the day-to-day operations of the Company and may not be provided information from management on a timely basis to allow for adequate reporting/consideration of certain transactions.\nii)\nAudit Committee and Financial Expert. The Company does not have a formal audit committee with a financial expert, and thus the Company lacks the board oversight role within the financial reporting process. The Company also does not have a formal financial reporting process which has resulted in the Company being delinquent in its SEC filings on a quarterly and annual basis.\nOur management feels the weaknesses identified above have not had any material effect on our financial results. However, we are currently reviewing our disclosure controls and procedures related to these material weaknesses and expect to implement changes in the near term, including identifying specific areas within our governance, accounting and financial reporting processes to add adequate resources to potentially mitigate these material weaknesses.\nOur management will continue to monitor and evaluate the effectiveness of our internal controls and procedures and our internal controls over financial reporting on an ongoing basis and is committed to taking further action and implementing additional enhancements or improvements, as necessary and as funds allow.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate. All internal control systems, no matter how well designed, have inherent limitations. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation.\nSadler, Gibb & Associates LLC, our independent auditors for fiscal 2022, have not and were not required to conduct an evaluation of the effectiveness of our internal controls over financial reporting for the year ended June 30, 2022. Saturna Group Chartered Professional Accountants LLP, our independent auditors for fiscal 2021, have not and were not required to conduct an evaluation of the effectiveness of our internal controls over financial reporting for the year ended June 30, 2021.\nChanges in Internal Control Over Financial Reporting\nThere were no changes in our internal controls over financial reporting that occurred during the year ended June 30, 2022 that have materially affected, or are reasonably likely to materially affect, our internal controls over financial reporting. We believe that a control system, no matter how well designed and operated, cannot provide absolute assurance that the objectives of the control system are met, and no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, within any company have been detected. ITEM 9B. OTHER INFORMATION\nNone.\nPART III\nDIRECTORS, EXECUTIVE OFFICERS, PROMOTERS AND CONTROL PERSONS\nIdentification of Directors and Executive Officers\nThe following table sets forth the names and ages of our current directors and executive officers. Each director of the Company serves for a term of one year and until his successor is elected and qualified at the next Annual Shareholders Meeting, or until his earlier death, resignation or removal. Each officer of the Company serves for a term of one year and until his successor is elected and qualified, or until his earlier death, resignation or removal.\nName\nAge\nPosition\nDate Appointed\nJamie Oei\nPresident, CEO, CFO, Secretary and Director\nOctober 31, 2016\nIdentification of Certain Significant Employees\nWe currently have no employees.\nFamily Relationships\nAs we only have one officer and director, there are no family relationships.\nInvolvement in Certain Legal Proceedings\nDuring the past ten years, no director, executive officer, promoter or control person of the Company has been involved in the following:\n(1)\nA petition under the Federal bankruptcy laws or any state insolvency law which was filed by or against, or a receiver, fiscal agent or similar officer was appointed by a court for the business or property of such person, or any partnership in which he was a general partner at or within two years before the time of such filing, or any corporation or business association of which he was an executive officer at or within two years before the time of such filing;\n(2)\nSuch person was convicted in a criminal proceeding or is a named subject of a pending criminal proceeding (excluding traffic violations and other minor offenses);\n(3)\nSuch person was the subject of any order, judgment, or decree, not subsequently reversed, suspended or vacated, of any court of competent jurisdiction, permanently or temporarily enjoining him from, or otherwise limiting, the following activities:\n(i)\nActing as a futures commission merchant, introducing broker, commodity trading advisor, commodity pool operator, floor broker, leverage transaction merchant, any other person regulated by the Commodity Futures Trading Commission, or an associated person of any of the foregoing, or as an investment adviser, underwriter, broker or dealer in securities, or as an affiliated person, director or employee of any investment company, bank, savings and loan association or insurance company, or engaging in or continuing any conduct or practice in connection with such activity;\n(ii)\nEngaging in any type of business practice; or\n(ii)\nEngaging in any activity in connection with the purchase or sale of any security or commodity or in connection with any violation of Federal or State securities laws or Federal commodities laws;\n(4)\nSuch person was the subject of any order, judgment or decree, not subsequently reversed, suspended or vacated, of any Federal or State authority barring, suspending or otherwise limiting for more than 60 days the right of such person to engage in any activity described in paragraph (f)(3)(i) of this section, or to be associated with persons engaged in any such activity;\n(5)\nSuch person was found by a court of competent jurisdiction in a civil action or by the Commission to have violated any Federal or State securities law, and the judgment in such civil action or finding by the Commission has not been subsequently reversed, suspended, or vacated;\n(6)\nSuch person was found by a court of competent jurisdiction in a civil action or by the Commodity Futures Trading Commission to have violated any Federal commodities law, and the judgment in such civil action or finding by the Commodity Futures Trading Commission has not been subsequently reversed, suspended or vacated;\n(7)\nSuch person was the subject of, or a party to, any Federal or State judicial or administrative order, judgment, decree, or finding, not subsequently reversed, suspended or vacated, relating to an alleged violation of:\n(i)\nAny Federal or State securities or commodities law or regulation; or\n(ii)\nAny law or regulation respecting financial institutions or insurance companies including, but not limited to, a temporary or permanent injunction, order of disgorgement or restitution, civil money penalty or temporary or permanent cease-and-desist order, or removal or prohibition order; or\n(iii)\nAny law or regulation prohibiting mail or wire fraud or fraud in connection with any business entity; or\n(8)\nSuch person was the subject of, or a party to, any sanction or order, not subsequently reversed, suspended or vacated, of any self-regulatory organization (as defined in Section 3(a)(26) of the Exchange Act (15 U.S.C. 78c(a)(26))), any registered entity (as defined in Section 1(a)(29) of the Commodity Exchange Act (7 U.S.C. 1(a)(29))), or any equivalent exchange, association, entity or organization that has disciplinary authority over its members or persons associated with a member.\nEXECUTIVE COMPENSATION\nCompensation of Executive Officers\nThe following table sets forth the compensation paid to the Companys executive officers for the past 5 years.\nName and principal position\nYear\nSalary\n($)\nBonus\n($)\nStock\nAwards\n($)\nOption\nAwards\n($)\nNon-\nEquity\nIncentive\nPlan\nCompensation\n($)\nNonqualified\nDeferred\nCompensation\nEarnings\n($)\nAll Other\nCompensation\n($)\nTotal\n($)\nMr. Jamie Oei,\nPresident, CFO\nSecretary,\nTreasurer and\nDirector (1)\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n(1) Mr. Jamie Oei was appointed as President, CEO, CFO, Secretary, Treasurer and Director on October 31, 2016.\nNarrative Disclosure to Summary Compensation Table\nThere are no current employment agreements between the Company and Mr. Oei. The compensation discussed herein addresses all compensation awarded to, earned by, or paid to our named executive officers. There are no other stock option plans, retirement, pension, or profit-sharing plans for the benefit of our officers and directors other than as described herein.\nOutstanding Equity Awards at Fiscal Year-End\nThere are no current outstanding equity awards to our executive officers.\nAudit committee and conflicts of interest\nSince we do not have an audit or compensation committee comprised of independent directors, the functions that would have been performed by such committees are performed by our directors. The board of directors has not established an audit committee and does not have an audit committee financial expert, nor has the board established a nominating committee. The board is of the opinion that such committees are not necessary since the company is an early development stage company and has only two directors, and to date, such directors have been performing the functions of such committees. Thus, there is a potential conflict of interest in that our directors have the authority to determine issues concerning management compensation, nominations, and audit issues that may affect management decisions.\nOther than as described above, we are not aware of any other conflicts of interest with any of our executive officers or directors.\nCompensation of Directors\nNone.\nSecurity Holders Recommendations to Board of Directors\nShareholders can direct communications to our Chief Executive Officer, Mr. Jamie Oei, at our executive offices. However, while we appreciate all comments from shareholders, we may not be able to individually respond to all communications. We attempt to address shareholder questions and concerns in our press releases and documents filed with the SEC so that all shareholders have access to information about us at the same time. Mr. Oei collects and evaluates all shareholder communications. All communications addressed to our directors and executive officers will be reviewed by those parties unless the communication is clearly frivolous.\nSECURITY OWNERSHIP OF CERTAIN BENEFICIAL\nOWNERS AND MANAGEMENT\nThe following table sets forth certain information concerning the number of shares of our common stock owned beneficially as of the date of this Prospectus by: (i) each of our directors; (ii) each of our executive officers; and (iii) each person or group known by us to beneficially own more than 5% of our issued and outstanding shares of common stock. Unless otherwise indicated, the shareholders listed below possess sole voting and investment power with respect to the shares they own.\nAs of the date of this filing, there are 850,000 common shares issued and outstanding.\nName and Address of Beneficial Owner\nTitle of Class\nAmount &Nature of\nBeneficial Ownership\n(1)\nPercent of Class\n(%) (2)\nMr. Jamie Oei (3)\n63 Rocio Court Palm Desert, CA 92260\nCommon\n500,000\n58.82%\nAll Officers and Directors as a Group\nCommon\n500,000\n58.82%\n(1)\nThe number and percentage of shares beneficially owned is determined under rules promulgated by the SEC and the information is not necessarily indicative of beneficial ownership for any other purpose. Under such rules, beneficial ownership includes any shares as to which the individual has sole or shared voting power or investment power and also any shares which the individual has the right to acquire within 60 days through the exercise of any stock option or other right. The persons named in the table have sole voting and investment power with respect to all shares of common stock shown that are beneficially owned by them, subject to community property laws where applicable and the information contained in the footnotes to this table.\n(2)\nBased on 850,000 common shares issued and outstanding, 0 shares issuable upon the exercise of stock purchase options within 60 days.\n(3)\nMr. Jamie Oei is the current President, CEO, Treasurer, Secretary and a Director of the Company. His beneficial ownership includes 500,000 common shares.\nChanges in Control\nThere are no present arrangements or pledges of the Companys securities, which may result in a change in control of the Company.\nCERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS\nOn October 31, 2016, pursuant to a subscription agreement, we offered and sold 500,000 shares of common stock to our officer and director, Jamie Oei, at a purchase price of $0.0001 per share, for aggregate proceeds of $50. During 2016, our officer and director, who is currently our shareholder, advanced the company $6,898 to pay expenses. During 2019, our officer and director advanced the Company $5,000 to pay expenses and, during 2020 our officer and director advanced the Company $10,602 to pay expenses. During 2021, our officer and director advanced the Company $4,080 to pay expenses. During 2022, our officer and director advanced the Company $35,001 to pay expenses. Our officer and director Jamie Oei is our promoter.\nCOMMISSION POSITION ON\nINDEMNIFICATION FOR SECURITIES ACT LIABILITIES\nOur Articles of Incorporation and Wyoming law provide that none of our officers or directors will be personally liable to the Company or its stockholders for any damages as a result of any act or failure to act in his or her capacity as an officer or director unless it is proven that:\nThe officers or directors act or failure to act constituted a breach of his or her fiduciary duties as an officer or director; and, the breach of those duties involved intentional misconduct, fraud or a knowing violation of law.\nThese provisions eliminate our rights and those of our stockholders to recover damages from an officer or director for his or her breach of a fiduciary duty unless such breach involved intentional misconduct, fraud or a knowing violation of law. The limitations summarized above, however, do not affect our ability or that of our stockholders to seek non-monetary remedies, such as an injunction or rescission, against an officer or director for his or her acts or failure to act.\nInsofar as indemnification for liabilities arising under the Securities Act may be permitted to our directors, officers and other persons pursuant to the foregoing provisions, we have been advised that in the opinion of the Securities and Exchange Commission, such indemnification is against public policy as expressed in the Securities Act and is therefore unenforceable.     ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES.\nThe following table shows the fees paid or accrued by us for the audit and other services provided by Saturna Group Chartered Professional Accountants for the fiscal periods shown.\nJune 30, 2022\nJune 30, 2021\nAudit Fees\n$ 5,000\n$ 5,000\nAudit Related Fees\n5,000\n3,750\nTax Fees\n-\n-\nAll Other Fees\n-\n-\nTotal\n$ 10,000\n$ 8,750\nAudit fees consist of fees billed for professional services rendered for the audit of our financial statements and review of the interim financial statements included in quarterly reports and services that are normally provided by the above auditors in connection with statutory and regulatory fillings or engagements\nIn the absence of a formal audit committee meeting, the full Board of Directors pre-approves all audit and non-audit services to be performed by the independent registered public accounting firm in accordance with the rules and regulations promulgated under the Securities Exchange Act of 1934, as amended.\nPART IV ITEM 15. EXHIBITS, FINANCIAL STATEMENTS SCHEDULES.\nThe following exhibits are included with this report:\n(a) (1) Index to Financial Statements:\nReport of Independent Registered Public Accounting Firm\nBalance Sheets as of June 30, 2022 and June 30, 2021\nStatements of operations and comprehensive loss for the years ended June 30, 2022 and June 30, 2021\nStatements of Stockholders Equity for the years ended June 30, 2022 and June 30, 2021\nStatements of Cash Flows for the years ended June 30, 2022 and June 30, 2021\nNotes to the Financial Statements\n(a) (3) Index to Exhibits\n3.1\nArticles of Incorporation (incorporated by reference from our Registration Statement on Form S-1 filed on October 30, 2017)\n3.2\nBylaws (incorporated by reference from our Registration Statement on Form S-1 filed on October 30, 2017)\n31.1*\nCertification by the Chief Executive Officer and Chief Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 and Rules 13a-14 and 15d-14 under the Securities Exchange Act of 1934\n31.2*\nCertification by the Chief Executive Officer and Chief Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 and Rules 13a-14 and 15d-14 under the Securities Exchange Act of 1934\n101.INS*\nXBRL Instance Document\n101.SCH*\nXBRL Taxonomy Extension Schema\n101.CAL*\nXBRL Taxonomy Extension Calculation Linkbase\n101.DEF*\nXBRL Taxonomy Extension Definition Linkbase\n101.LAB*\nXBRL Taxonomy Extension Label Linkbase\n101.PRE*\nXBRL Taxonomy Extension Presentation Linkbase\n* Filed herewith\nSIGNATURES\nPursuant to the requirements of the Securities Act of 1933, as amended, the registrant certifies that it has reasonable grounds to believe that it meets all of the requirements for filing on Form S-1 and has duly caused this registration statement to be signed on its behalf by the undersigned, thereunto duly authorized, on the 11th day of October, 2022.\nHOOPS SCOUTING USA\n/s/ Jamie Oei\nBy:\nJamie Oei\nTitle:\nChief Executive Officer and sole director,\nPrincipal Executive Officer Principal Financial Officer\nAnd Principal Accounting Officer\nIn accordance with the requirements of the Securities Act of 1933, this Registration Statement has been signed below by or on behalf of the following persons in the capacities and on the dates stated.\nSignature\nTitle\nDate\n/s/ Jamie Oei\nBy: Jamie Oei\nChief Executive Officer,\nPrincipal Executive Officer, Principal Financial Officer, Principal Accounting Officer and Sole Director\nOctober 11, 2022\nHOOPS SCOUTING USA\nFinancial Statements\nFor Years Ended June 30, 2022 and 2021\n(expressed in US dollars)\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Stockholders of Hoops Scouting USA\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of Hoops Scouting USA (the Company) as of June 30, 2021, and the related statements of operations and comprehensive loss, stockholders deficit, and cash flows for the year then ended and related notes (collectively, the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as at June 30, 2021, and the results of their operations and cash flows for the year then ended in conformity with accounting principles generally accepted in the United States of America.\nExplanatory Paragraph Regarding Going Concern\nThe accompanying financial statements have been prepared assuming the Company will continue as a going concern. As discussed in Note 1 to the financial statements, the Company has a working capital deficit of $16,649 and an accumulated deficit of $64,699 as at June 30, 2021. During the year ended June 30, 2021, the Company had no revenues and used cash of $37,562 for operating activities. These factors raise substantial doubt about the Companys ability to continue as a going concern. Managements plans in regard to these matters are also discussed in Note 1 to the financial statements. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to fraud or error. The Company is not required to have, nor were we engaged to perform, an audit of its internal controls over financial reporting. As part of our audits, we are required to obtain an understanding of the Companys internal controls over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal controls over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to fraud or error, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nCritical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (i) relate to accounts or disclosures that are material to the financial statements; and (ii) involved our especially challenging, subjective, or complex judgements. We determined that there are no critical audit matters.\n/s/ SATURNA GROUP CHARTERED PROFESSIONAL ACCOUNTANTS LLP\nSaturna Group Chartered Professional Accountants LLP\nWe have served as the Companys auditor since 2017\nVancouver, Canada\nOctober 4, 2021\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Shareholders of Hoops Scouting USA:\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheet of Hoops Scouting USA (the Company) as of June 30, 2022, the related statements of operations stockholders deficit, and cash flows for the period ended June 30, 2022 and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements referred to above present fairly, in all material respects, the financial position of the Company as of June 30, 2022, and the results of its operations and its cash flows for the year ended June 30, 2022, in conformity with accounting principles generally accepted in the United States of America.\nExplanatory Paragraph Regarding Going Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 1 to the financial statements, the Company has suffered recurring losses from operations and has a net capital deficiency that raise substantial doubt about its ability to continue as a going concern. Management's plans in regard to these matters are also described in Note 1. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audit provides a reasonable basis for our opinion.\nCritical Audit Matters\nCritical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. We determined that there were no critical audit matters.\n/s/ Sadler, Gibb & Associates, LLC\nWe have served as the Companys auditor since 2022.\nDraper, UT\nOctober 11, 2022\nFirm ID 3627\nHOOPS SCOUTING USA\nBalance sheets\n(Expressed in U.S. dollars)\nJune 30,\n$\nJune 30,\n$\nAssets\nCurrent assets\nCash\n10,586\nTotal assets\n10,586\nLiabilities and stockholders deficit\nCurrent liabilities\nAccounts payable and accrued liabilities\n4,903\nDue to related party (Note 3)\n61,581\n26,580\nTotal current liabilities\n66,484\n27,235\nNon-current liabilities\nLoans payable (Note 5)\n16,000\n16,000\nTotal liabilities\n82,484\n43,235\nStockholders deficit\nCommon stock Authorized: 1,000,000 common shares, $0.0001 par value 850,000 shares and 500,000 shares issued and outstanding, respectively\nAdditional paid-in capital\n34,965\n-\nShare subscriptions received (Note 4)\n-\n32,000\nDeficit\n(117,142 )\n(64,699 )\nTotal stockholders deficit\n(82,092 )\n(32,649 )\nTotal liabilities and stockholders deficit\n10,586\n(The accompanying notes are an integral part of these financial statements)\nHOOPS SCOUTING USA\nStatements of operations\n(Expressed in U.S. dollars)\nFor the year ended\nJune 30, 2022\nFor the year ended\nJune 30, 2021\n$\n$\nExpenses\nGeneral and administrative\n1,793\nProfessional fees\n46,700\n31,774\nTransfer agent\n5,040\n3,025\nTotal expenses\n52,443\n36,592\nNet loss\n(52,443 )\n(36,592 )\nLoss per share, basic and diluted\n(0.07 )\n(0.07 )\nWeighted average shares outstanding\n748,356\n500,000\n(The accompanying notes are an integral part of these financial statements)\nHOOPS SCOUTING USA\nStatements of stockholders deficit\n(Expressed in U.S. dollars)\nCommon stock\nAdditional\nShare\nTotal\nNumber of\npaid-in\nsubscriptions\nstockholders\nshares\nAmount\ncapital\nreceived\nDeficit\ndeficit\n$\n$\n$\n$\n$\nBalance, June 30, 2020\n500,000\n-\n-\n(28,107 )\n(28,057 )\nShare subscriptions received\n-\n-\n-\n32,000\n-\n32,000\nNet loss for the year\n-\n-\n-\n-\n(36,592 )\n(36,592 )\nBalance, June 30, 2021\n500,000\n-\n32,000\n(64,699 )\n(32,649 )\nBalance, June 30, 2021\n500,000\n-\n32,000\n(64,699 )\n(32,649 )\nShare subscriptions received\n-\n-\n-\n3,000\n-\n3,000\nStock issued against share subscriptions received\n350,000\n34,965\n(35,000 )\n-\n-\nNet loss for the year\n-\n-\n-\n-\n(52,443 )\n(52,443 )\nBalance, June 30, 2022\n850,000\n34,965\n-\n(117,142 )\n(82,092 )\n(The accompanying notes are an integral part of these financial statements)\nHOOPS SCOUTING USA\nStatements of cash flows\n(Expressed in U.S. dollars)\nFor the year ended June 30, 2022\nFor the year ended June 30, 2021\n$\n$\nOperating activities\nNet loss\n(52,443 )\n(36,592 )\nAdjustments to reconcile net loss to net cash used in operating activities:\nPrepaid expenses\n-\nAccounts payable and accrued liabilities\n4,248\n(5,050 )\nDue to related parties\n35,001\n4,080\nNet cash used in operating activities\n(13,194 )\n(37,562 )\nFinancing activities\nProceeds from loans payable\n-\n16,000\nProceeds from share subscriptions received\n3,000\n32,000\nNet cash provided by financing activities\n3,000\n48,000\nChange in cash\n(10,194 )\n10,438\nCash, beginning of period\n10,586\nCash, end of period\n10,586\nSupplemental disclosures:\nInterest paid\n-\n-\nIncome taxes paid\n-\n-\n(The accompanying notes are an integral part of these financial statements)\nHOOPS SCOUTING USA\nNotes to the financial statements\nYears ended June 30, 2022 and 2021\n(Expressed in U.S. dollars)\n1. Nature of Operations and Continuance of Business\nHoops Scouting USA (the Company) was incorporated in the State of Wyoming on October 31, 2016. The Company is in the business of scouting high school and college basketball players in Colorado.\nOn March 11, 2020, the World Health Organization declared COVID-19 a global pandemic. This contagious disease outbreak and any related adverse public health developments, has adversely affected workforces, economies, and financial markets globally, leading to an economic downturn. The impact on the Company has not been significant, but management continues to monitor the situation.\nThese financial statements have been prepared on a going concern basis, which implies the Company will continue to realize its assets and discharge its liabilities in the normal course of business. The continuation of the Company as a going concern is dependent upon the continued financial support from its shareholders, the ability of the Company to obtain necessary equity financing to continue operations, and ultimately the attainment of profitable operations. During the year ended June 30, 2022, the Company had no revenues and incurred a net loss of $52,443. As at June 30, 2022, the Company has a working capital deficit of $66,092 and an accumulated deficit of $117,142. These factors raise substantial doubt regarding the Companys ability to continue as a going concern. These condensed financial statements do not include any adjustments to the recoverability and classification of recorded asset amounts and classification of liabilities that might be necessary should the Company be unable to continue as a going concern. Management plans to promote our website and develop the Hoops Scouting USA app to run in conjunction with the website. We are looking at potential partnerships with current scouting services and college sport sponsorship consulting firms.\n2. Significant Accounting Policies\n(a) Basis of Presentation\nThese financial statements and related notes are prepared in accordance with accounting principles generally accepted in the United States and are expressed in US dollars. The Companys fiscal year-end is June 30.\n(b) Use of Estimates and Judgments\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. It also requires management to exercise its judgment in the processing of applying the Companys accounting policies. The Company regularly evaluates estimates and assumptions related to deferred income tax valuation allowances. The Company bases its estimates and assumptions on historical experience and other factors, including expectations of future events that are believed to be reasonable under the circumstances. The impacts of such estimates and judgments are pervasive throughout the financial statements, and may require accounting adjustments based on future occurrences. Revisions to accounting estimates and judgments are recognized in the period in which the estimate is revised and future periods if the revision affects both current and future periods. The actual results experienced by the Company may differ materially and adversely from the Companys estimates. To the extent there are material differences between the estimates and the actual results, future results of operations will be affected.\n(c) Cash and Cash Equivalents\nThe Company considers all highly liquid instruments with maturity of three months or less at the time of issuance to be cash equivalents.\nHOOPS SCOUTING USA\nNotes to the financial statements\nYears ended June 30, 2022 and 2021\n(Expressed in U.S. dollars)\n2. Significant Accounting Policies (continued)\n(d) Income Taxes\nThe Company accounts for income taxes using the asset and liability method in accordance with ASC 740, Income Taxes. The asset and liability method provides that deferred income tax assets and liabilities are recognized for the expected future tax consequences of temporary differences between the financial reporting and tax bases of assets and liabilities, and for operating loss and tax credit carryforwards. Deferred income tax assets and liabilities are measured using the currently enacted tax rates and laws that will be in effect when the differences are expected to reverse. The Company records a valuation allowance to reduce deferred income tax assets to the amount that is believed more likely than not to be realized.\n(e) Financial Instruments and Fair Value Measures\nASC 820, Fair Value Measurements and Disclosures, requires an entity to maximize the use of observable inputs and minimize the use of unobservable inputs when measuring fair value. ASC 820 establishes a fair value hierarchy based on the level of independent, objective evidence surrounding the inputs used to measure fair value. A financial instruments categorization within the fair value hierarchy is based upon the lowest level of input that is significant to the fair value measurement. ASC 820 prioritizes the inputs into three levels that may be used to measure fair value:\nLevel 1\nLevel 1 applies to assets or liabilities for which there are quoted prices in active markets for identical assets or liabilities.\nLevel 2\nLevel 2 applies to assets or liabilities for which there are inputs other than quoted prices that are observable for the asset or liability such as quoted prices for similar assets or liabilities in active markets; quoted prices for identical assets or liabilities in markets with insufficient volume or infrequent transactions (less active markets); or model-derived valuations in which significant inputs are observable or can be derived principally from, or corroborated by, observable market data.\nLevel 3\nLevel 3 applies to assets or liabilities for which there are unobservable inputs to the valuation methodology that are significant to the measurement of the fair value of the assets or liabilities.\nThe Companys financial instruments consist principally of cash, accounts payable and accrued liabilities, amounts due to related parties, and loans payable. Pursuant to ASC 820, the fair value of cash is determined based on Level 1 inputs, which consist of quoted prices in active markets for identical assets. The recorded values of all other financial instruments approximate their current fair values because of their nature and respective maturity dates or durations.\n(f) Loss Per Share\nThe Company computes income (loss) per share in accordance with FASB ASC 260 Earnings per Share. Basic loss per share is computed by dividing net income (loss) available to common shareholders by the weighted average number of outstanding common shares during the period. Diluted income (loss) per share gives effect to all dilutive potential common shares outstanding during the period. Dilutive loss per share excludes all potential common shares if their effect is anti-dilutive. There are no potentially issuable common shares as of June 30, 2022 and 2021.\n(g) Comprehensive Loss\nASC 220, Comprehensive Income establishes standards for the reporting and display of comprehensive income and its components in the financial statements. As at June 30, 2022 and 2021, the Company had no items that affected comprehensive loss.\nHOOPS SCOUTING USA\nNotes to the financial statements\nYears ended June 30, 2022 and 2021\n(Expressed in U.S. dollars)\n2. Significant Accounting Policies (continued)\n(h) Recent Accounting Pronouncements\nThe Company has implemented all new accounting pronouncements that are in effect and that may impact its financial statements and does not believe that there are any other new accounting pronouncements that have been issued that might have a material impact on its financial position or results of operations.\n3. Related Party Transactions\nAs at June 30, 2022, the Company owed $61,581 (June 30, 2021 - $26,580) to the President and Director of the Company, which is unsecured, non-interest bearing, and due on demand.\n4. Common Stock\nOn October 15, 2021, the Company issued 350,000 common shares at $0.10 per share for proceeds of $35,000, of which $32,000 were received during the year ended June 30, 2021.\n5. Loans Payable\nAs at June 30, 2022, the Company owed $16,000 (June 30, 2021 - $16,000) to non-related parties for loans payable. The amounts owing are unsecured, non-interest bearing, and due on or before December 31, 2022.\n6. Income Taxes\nThe Company is subject to United States federal and state income taxes at a rate of 21% per annum. The reconciliation of the provision for income taxes at the statutory rate compared to the Companys income tax expense as reported is as follows:\nFor the year ended June 30, 2022\nFor the year ended June 30, 2021\nIncome tax expense (benefit) at statutory rate\n(11,013 )\n(7,685 )\nChange in valuation allowance\n11,013\n7,685\nIncome tax expense\n-\n-\nHOOPS SCOUTING USA\nNotes to the financial statements\nYears ended June 30, 2022 and 2021\n(Expressed in U.S. dollars)\n6. Income Taxes (continued)\nThe significant components of deferred income tax assets and liabilities as at June 30, 2021 and 2020 are as follows:\nJune 30, 2022\nJune 30, 2021\nGross deferred tax asset\n24,600\n13,587\nValuation allowance\n(24,600 )\n(13,587 )\nNet deferred tax asset\n-\n-\nThe Company has net operating losses carried forward of $117,142 which may be carried forward to apply against future years taxable income, subject to the final determination by taxation authorities, expiring in the following years:\n7,923\n10,934\n8,976\n36,592\n52,443\nTotal\n117,142\n7. Subsequent Event\nThe Company evaluated all events or transactions that occurred after June 30, 2022. Company determined that it does not have any subsequent event requiring recording or disclosure in the financial statements for the period ended June 30, 2022."
}