{
    "cik": "1746214",
    "company": "BIOPLUS LIFE CORP.",
    "filing_type": "10-K",
    "filing_date": "2022-11-28",
    "period_of_report": "2021-12-31",
    "sic": "5912",
    "state_of_inc": "NV",
    "state_location": "N8",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1746214/0001493152-22-033768-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1746214/000149315222033768/form10-k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1746214/0001493152-22-033768.txt",
    "filename": "1746214_10K_2021_0001493152-22-033768.htm",
    "content": "ITEM 1. BUSINESS.\nBUSINESS DESCRIPTION\nIndustry Overview\nThis section includes market and industry data that we have developed from publicly available information; various industry publications and other published industry sources and our internal data and estimates. Although we believe the publications and reports are reliable, we have not independently verified the data. Our internal data, estimates and forecasts are based upon information obtained from trade and business organizations and other contacts in the market in which we operate and our managements understanding of industry conditions.\nAt this time, Bioplus Life Corp. mainly serves consumers in Malaysia, although the Company may evaluate and change this focus in the future and expand into other countries. Given most of the demand for our products currently originates from Malaysia, we will focus solely upon the Healthcare Industry within Malaysia.\nHowever, we believe there is significant potential for Bioplus Lifes Halal-certified beauty and personal care products with good manufacturing practice (GMP) approved by the Department of Islamic Advancement of Malaysia (JAKIM) for export to Islamic countries such as Indonesia and Middle Eastern countries. There are over two billion Muslims worldwide, making the second-largest religious following. The largest Muslim country worldwide is Indonesia, where an estimated 229 million Muslims and about 13% of the worlds population of Muslims reside. In addition, there are other potential targeted markets described below.\nSubject to the availability of unrestricted international travel, Bioplus Life executives will begin to visit and seek to appoint regional and local distributors in the targeted countries stated below:\nTargeted Export Markets. Details regarding our target markets are below.\nCountry Muslim Population 2022 Population Muslim % of Total Population Muslim % of World Population\nIndonesia 229,000,000 275501,339 87.2 % 12.7 %\nPakistan 200,400,000 235824,862 96.5 % 11.1 %\nIndia 195,000,000 1417173,173 14.2 % 10.9 %\nBangladesh 153,700,000 171186,372 90.4 % 9.2 %\nNigeria 99,000,000 218541,212 49.6 % 5.3 %\nEgypt 87,500,000 110990,103 92.35 % 4.9 %\nIran 82,500,000 88550,570 99.4 % 4.6 %\nTurkey 79,850,000 85341,241 99.2 % 4.6 %\nAlgeria 41,240,913 44903,225 99 % 2.7 %\nSudan 39,585,777 46874,204 97 % 1.9 %\nIraq 38,465,864 44,496,122 95.7 % 1.9 %\nhttps://worldpopulationreview.com/country-rankings/muslim-population-by-country\nCorporate History\nBioplus Life Corp., a Nevada corporation (Company), was incorporated under the laws of the State of Nevada on April 13, 2017. On July 10, 2017, the Company acquired 100% of the equity interests of Bioplus Life Corp., a Malaysian company. On July 19, 2017, the Company, through its Malaysian subsidiary, Bioplus Life Corp., acquired 100% of the equity interests of Bioplus Life International Holdings Ltd, a Hong Kong company. On October 27, 2017, the Company through its Hong Kong subsidiary, Bioplus Life International Holdings Ltd, acquired 100% equity interest of Bioplus Life Corp. (ShenZhen), a company incorporated in China.\nOn June 11, 2018, the Company, through its former Hong Kong subsidiary (Bioplus Life International Holdings Ltd), acquired 99.8% equity interest of Bio Life Holdings Berhad, a company incorporated in Malaysia. Bio Life Holdings Berhad owns 100% of the equity interests of Bio Life Neutraceuticals Sdn. Bhd., a company incorporated in Malaysia.\nDuring the previous financial year , the Company disposed of and de-registered two of its subsidiaries namely, Bioplus Life International Holdings Ltd, a Hong Kong company and its subsidiary, Bioplus Life Corp. (ShenZhen), a company incorporated in China.\nOur current corporate structure is depicted below:\nSpecial Note.\n(1) Bioplus Life International Holdings Ltd. was officially disposed of on August 5, 2020.\n(2) Bio Life Neutraceuticals (Shenzhen) Pty Ltd. was being officially de-registered in Shenzhen on September 4, 2020.\nOur corporate complex is located at No. 9 and No 10, Jalan P4/8B, Bandar Teknologi Kajang, 43500 Semenyih, Selangor Darul Ehsan, Malaysia, which are two adjoining commercial structures. Our corporate offices are located in the No. 9 building. Our manufacturing facilities comprise the remainder of the space in both buildings.\nOur website is http://www.bionutry.com and our phone number is +601 3 8703 2020.\nOur corporate headquarters and manufacturing facilities are depicted below:\nBusiness Information\nBioplus Life Corp., through its wholly owned subsidiaries, specializing in manufacturing and selling health and beauty care products. Our mission is to create awareness for good health and personal care to improve our customers quality of life. We seek to achieve this by offering an affordable solution to existing health food businesses through the production, information, advisory and services pertaining to our product line. Our website, http://www.bionutry.com, can be utilized to inquire about our product offerings, but we do not directly sell any products through our website. At this time, we primarily sell our products to third party wholesalers.\nOur product series, or line, includes, but is not strictly limited to, products that fall into the following categories: bone, fiber, bee-propolis, cardiovascular health, herbal, health beverages, apple stem cell, beauty care, feminine health, UT care, anti-oxidant and eye health series. These health and beauty supplies are designed to help improve the consumers metabolism rate, burn excessive fats, provide anti-aging effects and improve the overall health and physical appearance of our customers.\nThe majority of our products have been halal certified and, at the same time, awarded with a health manufacturing license by the Ministry of Health Malaysia (MOH) to accommodate the high demand for Muslims HALAL food while also meeting the expectations of the public on a safe and hygienic food supply. It is the belief, and hope, of the Company that this assurance from an esteemed regulatory body will also serve to prove our continuing commitment in supplying quality goods to our customers.\nThrough our two factories located in Semenyih, Malaysia, we are able to deliver a one stop service. This begins with the initiation of product concept, to sourcing new and potential ingredients or raw materials, we then begin development of new product formulations, and we continue to customize production until products are ready to be shipped to our customers. This ‘one-stop-shop method of operating allows us to reduce the resources and cost needed to create our products, while also decreasing the amount of time needed from inception to shipping.\nIn 2021, our products are sold through wholesalers who are supported by our sales and marketing team, and we have achieved the following:\n- Received worldwide halal certification;\n- Our products are available to consumers besides Muslim community;\n- Received professional certification ensuring safe and high-quality health products;\n- We maintaining a low cost, low capital, zero inventory and low threshold to help more wholesalers start a business easily with our platform;\n- Our current products are listed at http://www.bionutry.com\n- Developed a Wechat mode: Take your goods directly from the platform and sell them through your own network;\n- Developed an Internet model, whereby wholesalers can register for an online store, receive goods directly, change the price and sell with a profit;\n- Our WeChat + Internet models now are operated concurrently 24/7.\nResearch and Development activities have also been carried out continuously to ensure innovation and quality of the product is maintained and improved.\nOur largest customers over the last four years have been BFM Group (Asia) Sdn Bhd, GO3U Trading Sdn Bhd, 27 Marketing Sdn Bhd, and MACN Sdn Bhd, who collectively comprised between 30% to 65% of our total annual sales. Remaining sales for the past four fiscal years have been broken up into roughly eighty customers in varying quantities.\nThe heightened awareness of the public towards the importance of healthcare has helped to create vast market potential for future development. In the future, our company will be expanding its business to Thailand, India and China to improve our ability to meet the demand the Company perceives from consumers in these countries.\nKey Products\nThe following is a brief description of our key products. A full list of our products, as well as additional product details, can be found at http://www.bionutry.com.\nOur 5 top selling products in 2021 are described below.\nYear\nProducts Sales %\nFiber 828,403 31 %\nAnti-oxidant 62,004 3 %\nAnti-diabetics 25,825 1 %\nLady Health 348,012 14 %\nTelospan 89,671 4 %\nTotal 1,353,915 53 %\nFiber\nMany of us associate fiber with digestive health and bodily functions wed rather not think about. However, eating foods high in dietary fiber can do so much more than keep you regular. It can lower your risk for heart disease, stroke, and diabetes, improve the health of your skin, and help you lose weight. It may even help prevent colon cancer. Fiber, also known as roughage, is the part of plant-based foods (grains, fruits, vegetables, nuts, and beans) that the body cant break down. It passes through the body undigested, keeping your digestive system clean and healthy, easing bowel movements, and flushing cholesterol and harmful carcinogens out of the body.\nResveratrol is a natural anti-oxidant which can reduce the blood viscosity, inhibit platelet aggregation and vasodilation, promote blood circulation result in prevention of cardiovascular problem and development. Resveratrol exerts various effects through various pathways with antiallergic, antipyretic and analgesic activities. Resveratrol also inhibits chemical that promote inflammation which can lead to arthritis and other diseases.\nBitter melon is traditionally known for its medicinal properties such as antidiabetic, anticancer, anti-inflammation, antivirus, and cholesterol lowering effects. Bitter Melon Peptide contains a high dosage of ‘plant insulin and can thus effectively lower blood sugar. Insulin plays a major biochemical role in stimulating the uptake of glucose by different cells of the body for the production of energy. Since Bitter melon and its various extracts and components have been reported to exert hypoglycemic effects, therefore Bitter Melon Peptide has a hypoglycemic effect upon insulin-like biological activity and can regulate blood sugar to normal levels.\nLady Health\nLady Health, clinically proven synergistic blend of Traditionally Malaysia and Korea herbal extracts that together offer relief for uncomfortable feelings associated with menopause. Research has shown this combination to promote healthy management of hot flashes, night sweats, nervous irritability, dizzy spells, vaginal dryness, numbness and tingling, occasional emotional discontent, and occasional fatigue and sleeplessness. Unlike some common menopause formulations with ingredients that bring safety concerns, Our Lady Health formulation has a record of safety, is non-estrogenic and has a long history of use in Asia.\nTelospan\nTelospan works at cell level in the body, After taking Telospan, it can be easily absorbed by the body, enters the bloodstream，then passes to every single cell. Telospan activates telomeric gene when reaching the cells, produce telomerase and thus extend telomere. Telospan promote cell function and cell life. Scientific research has proved that human cells will divide up 50 times throughout the cell life. Cells divide once every two and half year. Telomere will be shortened in every cell division process until the end of cell life with no telomere. However, Resveratrol can activate the production of telomere in human body which lengthen the telomere by 30%. As a result, cell division can occur\nMarketing\nAs mentioned, we sell primarily through wholesalers whom we attract through word of mouth. Our current marketing strategy is to systematically promote our capabilities and our past performance to our customers. We periodically make visits to potential clients within a reasonable distance from our offices to introduce ourselves and explain why our clients prefer our services to those offered by competitors. Recently, we have fine-tuned and revamped our corporate website to better promote the list of our products offered. In addition, we also plan to pursue marketing campaigns by utilizing the internet, social media, and perhaps print media. These plans have not yet been determined in sufficient detail to outline herein and our marketing plan is currently a work in progress.\nKey Supplier\nThe raw materials contained in our products are highly dependent on our major supplier, Bio Life Solutions Sdn Bhd., an unrelated Malaysian company, located in Selangor. Bio Life Solutions Sdn Bhd has supplied 62% of the raw materials that make up our products over the past 3 fiscal years. At our current and our anticipated future operating levels, our supplier has indicated that they will have ample supply to fulfill our orders for raw materials while also fulfilling any and all orders they may receive from other customers.\nGovernment Regulations\nAll of the principal products we offer for sale are registered under Malaysias Food Act 1983 (Act 281) & Regulations. At this time, we only offer our products in Malaysia so presently this is the only pertinent government regulation, as all products require authorization from the Food and Quality Division of Ministry of Health according to the Food Act of 1983 and Food Regulations 1985 in order to be sold in Malaysia.\nCompetition\nThe industry in which we compete is highly competitive. Competition in the health and beauty care industry, with a focus on health supplements in particular, is very intense particularly in Malaysia. We face competition from various retail health supplement providers, pharmacies, and multi-level marketing company which supply health supplement products. These competitors generate significant traffic and have established brand recognition and financial resources.\nWe believe that the principal competitive factors in our market includes the quality of health supplements, the efficiency and effectiveness of the health supplements, strength and depth of relationships with clients, the ability to identify the changing needs and requirements of prospective clients, and the scope of service. Through utilizing our competitive strengths, we believe that we have a competitive edge over other competitors due to the breadth of our product offerings, one stop convenience, pricing, our service, our reputation and product safety. We are confident we can develop and enlarge our market share in Malaysia and potentially further into the overseas market.\nFuture Plans\nIn the future, subject to future funds, we intend to increase our current production capacity with the enhancement of our factory with modernized and fully automated machineries. In addition, we plan to invest heavily in research and development activities to innovate and develop new products to address the future market needs.\nWe also anticipate expanding into new geographical areas, with a particular focus, at least initially, on expanding into Thailand, India, China, Indonesia and other Muslim countries. At present, we do not have any distinct timeline in place for expansion into these countries. We also plan to expand our market coverage to include the halal market, the aging population market and the pet market as we see the underlying potential in these three market sectors. When we begin these efforts, we plan to hire more employees to support our operations in different countries. We believe that hiring fifteen to twenty employees will be sufficient in order to support our operations. We may also evaluate potential acquisitions in the future which we feel may have some synergy with our current operations.\nEmployees\nAs of December 31, 2021, we have approximately 27 full-time employees. Currently, our full-time employees devote approximately 50 hours per week to the operations of our Company. We do not presently have pension, health, annuity, insurance, stock options, profit sharing, or similar benefit plans; however, we may adopt plans in the future. There are presently no personal benefits available to our officer and/or director and our employees. We intend to hire more staff to assist in the development and execution of our business operations.\nProduct Liability\nDue to nature of the Companys business, the Company may face claims for product liability resulting from any illnesses, adverse conditions or reactions related to use of its products. Presently, the Company does not maintain any product liability insurance to cover any such claims. ITEM 1A. RISK FACTORS\nRISK FACTORS\nAn investment in our common stock involves a number of very significant risks. You should carefully consider the following known material risks and uncertainties in addition to other information in this Form 10-K in evaluating our company and its business before purchasing shares of our companys common stock. You could lose all or part of your investment due to any of these risks.\nRisk Factors Relating to Our Business\nWE HAVE LIMITED OPERATING HISTORY AND LIMITED BUSINESS GROWTH. We have been operational since April 2017; therefore, we have had limited operations which makes it difficult to evaluate our business and our prospects. In addition, to date, we have not experienced substantial growth in our business. The likelihood of our success must be considered in light of the problems, expenses, difficulties, complications and delays frequently encountered by a small operating company trying to expand its business enterprise and the highly competitive environment in which we will operate. In addition, we are confronting the negative impact of COVID-19 on our business, which has been substantial. Consequently, there can be no assurance that the business of the Company will grow in the future. Moreover, because of our limited operating history, it is difficult to extrapolate any meaningful projections about the Companys future.\nTHE CURRENT PANDEMIC OF THE NOVEL CORONAVIRUS OR COVID-19, AND THE FUTURE OUTBREAK OF OTHER HIGHLY INFECTIOUS OR CONTAGIOUS DESEASES, COULD MATERIALLY AND ADVERSELY IMPACT OR DISTUPT OUR FINANCIAL CONDITION, RESULTS OF OPERATIONS, CASH FLOWS AND PERFORMANCE. An outbreak of respiratory illness caused by COVID-19 emerged in late 2019 and has spread globally, including Malaysia. The coronavirus is considered to be highly contagious and poses a serious public health threat. The World Health Organization labeled the coronavirus a pandemic on March 11, 2020, given its treat beyond a public health emergency of international concern the organization had declared on January 30, 2020.\nOur revenues, workforce and our wholesales are concentrated in Malaysia. The epidemic has resulted in lockdown of cities, travel restrictions, and the temporary closure of stores and facilities in Malaysia for the past few months. The negative impacts of the COVID-19 outbreak on our business have included:\n● quarantines impeded our ability to sell our products and recruit new wholesalers, which has result in a dramatic reduction in sales. Travel restrictions limited other parties ability to visit and meet us in person. Although most communication may be less effective in building trust and engaging new agents and traders.\n● the operations of our wholesalers have been and could continue to be negatively impacted by the epidemic, which may in adversely impact future sales.\nAdditionally, the pandemic has affected our overall ability to react timely to mitigate the impact of this event and has substantially hampered our efforts to provide our investors with timely information and comply with our filing obligations with the Securities and Exchange Commission.\nWe FACE MARKET COMPETITION AND OUR OPERATING RESULTS WILL SUFFER IF WE FAIL TO COMPETE EFFECTIVELY. We face competition from other companies in the supplement and nutraceutical business in Malaysia and elsewhere in the Pacific Rim. Many of our competitors have stronger financial and other capacities, including research and development, than us.\nIf our competitors market products that are more effective, safer or less expensive or that reach the market sooner than our future products, if any, we may not achieve commercial success. In addition, because of our limited resources, it may be difficult for us to stay abreast of any changes in the market. If we fail to stay at the forefront of innovative products, we may be unable to compete effectively. Advances or products developed by our competitors may render our products obsolete, less competitive or not economical.\nWE MAY FACE PRODUCT LIABILITY CLAIMS. Due to the nature of our business, we may face claims for product liability. These claims may arise from the adverse conditions or reactions to the use of our products. While we feel confident in health benefits of our products, we cannot provide assurances that product liability claims will arise in the future.\nMoreover, litigation or adverse publicity resulting from these allegations could materially and adversely affect our business, regardless of whether the allegations are valid or whether we are liable. Currently we have no product liability insurance coverage, and even if there was such coverage, there would be no assurance that such coverage would be sufficient to properly protect us. Further, claims of this type, whether substantiated or not, may divert our financial and management resources from revenue generating activities and the business operation.\nPresently, we do not have insurance to cover any product liability claims. This lack of insurance may cause a material adverse impact on the Company if product liability claims arise.\nINEFFECTIVE RISK MANAGEMENT POLICIES AND PROCEDURES. The Company relies on a combination of technical and human factors to protect the Company against risks. Its policies, procedures and practices are used to identify, monitor and control a variety of risks, including risks related to human error and hardware and software errors. The Companys standard of operations has been developed internally. These risk-management methods may not adequately prevent losses and may not protect us against all risks, in which case our business, economic conditions, operations and cash flows may be materially adversely affected.\nWE WILL NEED ADDITIONAL FINANCING IN ORDER TO GROW OUR BUSINESS. We do not have sufficient assets with which to expand our business. We intend to expand our business through increased marketing efforts in Malaysia and elsewhere. These additional expenditures are intended to be funded from cash on hand and, if necessary, third party sources, including the incurring of debt and/or the sale of additional equity securities. In addition to requiring additional financing to fund expansion, the Company may require additional financing to fund working capital and operating losses in the future should the need arise. The incurrence of debt creates additional financial leverage and therefore an increase in the financial risk of the Companys operations. The sale of additional equity securities will be dilutive to the interests of current equity holders. In addition, there can be no assurance that such additional financing, whether debt or equity, will be available to the Company or that it will be available on acceptable commercial terms. Any inability to secure such additional financing on appropriate terms could have a materially adverse impact on the business, financial condition and operating results of the Company.\nWE AND OUR VENDORS ARE SUBJECT TO LAWS AND REGULATIONS THAT COULD REQUIRE US TO MODIFY OUR CURRENT BUSINESS PRACTICES AND INCUR INCREASED COSTS, WHICH COULD HAVE A MATERIAL ADVERSE EFFECT ON OUR BUSINESS, FINANCIAL CONDITION AND RESULTS OF OPERATIONS. In our industry, we are subject to numerous laws and regulations, including labor, employment and taxation laws. The formulation, manufacturing, packaging, labelling, distribution, sale and storage of our products are subject to extensive regulation by various federal agencies and regulatory bodies. If we fail to comply with those regulations, we would subject to significant penalties or claims, which would harm our business operations. In addition, the adoption of new regulations or changes in the interpretations of existing regulations may result in significant compliance costs or discontinuation of product sales and may impair the marketability of our products, resulting in significant loss of net sales. Our failure to comply with regulations may result in enforcement actions and imposition of penalties or otherwise harm the distribution and sale of our products.\nWE EXPECT OUR NET SALES AND OPERATING RESULTS TO VARY SIGNIFICANTLY FROM QUARTER TO QUARTER. A number of factors will influence our sales and results, including changes in:\n● General economic conditions;\n● The demand for our products;\n● Our ability to retain, grow our business and attract new clients;\n● Administrative costs;\n● Advertising and other marketing costs;\nAS A RESULT OF THE VARIABILITY OF THESE AND OTHER FACTORS, OUR OPERATING RESULTS IN FUTURE QUARTERS MAY BE BELOW THE EXPECTATIONS OF PUBLIC MARKET ANALYSTS AND INVESTORS. If we fail to maintain a quality service and value, our sales are likely to be negatively affected. Our success depends on the safety and hygiene product that we produce through our in house manufacturing company. Our future customers will identify our product with a certain level of quality and value. If we could not meet this perceived value or level of quality, we may be negatively affected and our operating results may suffer.\nTHE SUCCESS OF OUR BUSINESS DEPENDS ON OUR ABILITY TO MAINTAIN AND ENHANCE OUR REPUTATION AND BRAND. We believe that our reputation in the healthcare industry is of significant importance to the success of our business. A well-recognized brand is critical to increasing our customer base and, in turn, increasing our revenue. Since the healthcare industry is highly competitive, our ability to remain competitive depends to a large extent on our ability to maintain and enhance our reputation and brand, which could be difficult and expensive. To maintain and enhance our reputation and brand, we need to successfully manage many aspects of our business, such as cost- effective marketing campaigns to increase brand recognition and awareness in a highly competitive market.\nWe will continue to conduct various marketing and brand promotion activities. We cannot assure you, however, that these activities will be successful and achieve the brand promotion goals we expect. If we fail to maintain and enhance our reputation and brand, or if we incur excessive expenses in our efforts to do so, our business, financial conditions and results of operations could be adversely affected.\nBUSINESS DISRUPTIONS COULD SERIOUSLY HARM OUR FUTURE REVENUE AND FINANCIAL CONDITION AND INCREASE OUR COSTS AND EXPENSES. Our operations could be subject to power shortages, telecommunications failures, wildfires, water shortages, floods, earthquakes, hurricanes, typhoons, fires, extreme weather conditions, medical epidemics and other natural or man-made disasters or business interruptions. The occurrence of any of these business disruptions could seriously harm our operations and financial condition and increase our costs and expenses. Unfavorable global economic conditions could adversely affect our business, financial condition, or results of operations.\nWe do not carry insurance for all categories of risk that our business may encounter. Although we intend to obtain some form of business interruption insurance in the future, there can be no assurance that we will secure adequate insurance coverage or that any such insurance coverage will be sufficient to protect our operations to significant potential liability in the future. Any significant uninsured liability may require us to pay substantial amounts, which would adversely affect our financial position and results of operations.\nWE MAY INCUR SIGNIFICANT COSTS TO BE A PUBLIC COMPANY TO ENSURE COMPLIANCE WITH U.S. CORPORATE GOVERNANCE AND ACCOUNTING REQUIREMENTS AND WE MAY NOT BE ABLE TO ABSORB SUCH COSTS. We may incur significant costs associated with our public company reporting requirements, costs associated with newly applicable corporate governance requirements, including requirements under the Sarbanes-Oxley Act of 2002 and other rules implemented by the Securities and Exchange Commission. We expect these costs to approximate $50,000 per year, consisting of $25,000 in legal, $20,000 in audit and $5,000 for EDGAR filing and transfer agent fees. We expect all of these applicable rules and regulations to significantly increase our legal and financial compliance costs and to make some activities more time consuming and costly. We may not be able to cover these costs from our operations and may need to raise or borrow additional funds. We also expect that these applicable rules and regulations may make it more difficult and more expensive for us to obtain director and officer liability insurance and we may be required to accept reduced policy limits and coverage or incur substantially higher costs to obtain the same or similar coverage. As a result, it may be more difficult for us to attract and retain qualified individuals to serve on our board of directors or as executive officers. We are currently evaluating and monitoring developments with respect to these newly applicable rules, and we cannot predict or estimate the amount of additional costs we may incur or the timing of such costs. In addition, we may not be able to absorb these costs of being a public company which will negatively affect our business operations.\nOUR SOLE OFFICER AND DIRECTOR MAY HAVE A CONFLICT OF INTEREST WITH THE MINORITY SHAREHOLDERS AT SOME TIME IN THE FUTURE. Our sole officer and director beneficially owns approximately 77.18% of our outstanding common stock. The interests of our officer and director may not be, at all times, the same as that of our other shareholders. Our officer and director is not simply a passive investor but is also the sole executive of the Company, his interest as an executive may, at times be adverse to those of passive investors. Where those conflicts exist, our shareholders will be dependent upon our director exercising, in a manner fair to all of our shareholders, his fiduciary duty in such capacity. Also, our director will have the ability to control the outcome of most corporate actions requiring shareholder approval, including the sale of all or substantially all of our assets and amendments to our articles of incorporation. This concentration of ownership may also have the effect of delaying, deferring or preventing a change of control of us, which may be disadvantageous to minority shareholders.\nOUR SOLE OFFICER AND DIRECTOR MAY HAVE OTHER POTENTIAL CONFLICTS OF INTEREST. Currently our sole officer and director has been working on promoting business for the Company. A potential conflict of interest may arise in the future that may cause our business to fail, including conflicts of interest in allocating his time to our company and their other business interests. While our sole officer and director has verbally agreed to devote sufficient time and attention to the affairs of the Company, we have no written arrangement with him regarding this matter. As a result, we may face conflicts between business decisions that he may have to make regarding our operations and that of his other business interests.\nBECAUSE OUR MANAGEMENT DOES NOT HAVE PRIOR EXPERIENCE RUNNING A PUBLIC COMPANY, WE MAY HAVE TO HIRE INDIVIDUALS OR SUSPEND OR CEASE OPERATIONS. Because our management has limited prior experience in running a public company, including the preparation of reports under the Securities Act of 1934, we may have to hire additional experienced personnel to assist us with the preparation thereof. If we need the additional experienced personnel and we do not hire them, we could fail in our plan of operations and have to suspend operations or cease operations entirely.\nLACK OF INDEPENDENT AUDIT COMMITTEE. Although the common stock is not listed on any national securities exchange, for purposes of independence we use the definition of independence applied by NASDAQ. Currently, we have no independent audit committee. The full board of directors functions as audit committee and is comprised of our sole director. An independent audit committee plays a crucial role in the corporate governance process, assessing our Companys processes relating to our risks and control environment, overseeing financial reporting, and evaluating internal and independent audit processes. The lack of an independent audit committee may prevent the board of directors from being independent from management in its judgments and decisions and its ability to pursue the responsibilities of an audit committee without undue influence. We may have difficulty attracting and retaining directors with the requisite qualifications. If we are unable to attract and retain qualified, independent directors, the management of the business could be compromised. An independent audit committee is required for listing on any national securities exchange; therefore, until such time as we meet the audit committee independence requirements of a national securities exchange, we will be ineligible for listing on any national securities exchange.\nCROSS-BORDER OPERATIONS. As we plan to continue expanding our existing cross-border operations into existing and other markets, we will face risks associated with expanding into markets in which we have limited or no experience and in which our company may be less well-known. We may be unable to attract a sufficient number of customers and other participants, fail to anticipate competitive conditions or face difficulties in operating effectively in these new markets. The expansion of our cross-border business will also expose us to risks relating to staffing and managing cross-border operations, increased costs to protect intellectual property, tariffs and other trade barriers, differing and potentially adverse tax consequences, increased and conflicting regulatory compliance requirements, lack of acceptance of our service offerings, challenges caused by distance, language and cultural differences, exchange rate risk and political instability. Accordingly, any efforts we make to expand our cross-border operations may not be successful, which could limit our ability to grow our revenue, net income and profitability.\nRISKS RELATED TO DOING BUSINESS IN ASIA PACIFIC REGION. Changes in the political and economic policies of the local government may materially and adversely affect our business, financial condition and results of operations and may result in our inability to sustain our growth and expansion strategies. Accordingly, our financial condition and results of operations are affected to a significant extent by economic, political and legal developments in Asia Pacific region, primarily Malaysia.\nThe Asia Pacific economy differs from the economies of most developed countries in many respects, including the extent of government involvement, level of development, growth rate, control of foreign exchange and allocation of resources. In addition, the government continues to play a significant role in regulating industry development by imposing industrial policies. The government also exercises significant control over economic growth by allocating resources, controlling payment of foreign currency-denominated obligations, setting monetary policy, regulating financial services and institutions and providing preferential treatment to particular industries or companies.\nThe local government has implemented various measures to encourage economic growth and guide the allocation of resources. Some of these measures may benefit the overall economy, but may also have a negative effect on us. Our financial condition and results of operation could be materially and adversely affected by government control over capital investments or changes in tax regulations that are applicable to us. In addition, the government has implemented in the past certain measures, including interest rate increases, to control the pace of economic growth. These measures may cause decreased economic activity, which in turn could lead to a reduction in demand for our services and consequently have a material adverse effect on our businesses, financial condition and results of operations.\nYOU MAY EXPERIENCE DIFFICULTIES IN EFFECTING SERVICE OF LEGAL PROCESS, ENFORCING FOREIGN JUDGMENTS OR BRINGING ORIGINAL ACTIONS IN MALAYSIA BASED ON UNITED STATES OR OTHER FOREIGN LAWS AGAINST US OR OUR MANAGEMENT. Our operating subsidiary is incorporated in Malaysia and conducts substantially all of our operations in Asia Pacific. Our executive officer and director reside outside the United States and all of his assets are located outside of the United States. As a result, it may be difficult or impossible for shareholders to bring an action against us or against these individuals in Malaysia in the event that you believe that your rights have been infringed under the securities laws of the United States or otherwise. Even if you are successful in bringing an action of this kind, the laws of Malaysia may render you unable to enforce a judgment against our assets or the assets of our director and officer. There is no statutory recognition in Malaysia of judgments obtained in the United States, although the courts of Malaysia will generally recognize and enforce a non-penal judgment of a foreign court of competent jurisdiction without retrial on the merits. The rights of shareholders to take legal action against us and our directors, actions by minority shareholders and the fiduciary responsibilities of our directors are to a large extent governed by the common law of Malaysia. The common law of Malaysia is derived in part from comparatively limited judicial precedent in Malaysia as well as from English common law, which provides persuasive, but not binding, authority in a court in Malaysia. The rights of our shareholders and the fiduciary responsibilities of our directors under Malaysian law are not as clearly established as they would be under statutes or judicial precedents in the United States. In particular, Malaysia has a less developed body of securities laws than the United States and provides significantly less protection to investors. As a result, our public shareholders may have more difficulty in protecting their interests through actions against us, our management, our directors or our major shareholders than would shareholders of a corporation incorporated in a jurisdiction in the United States.\nRisks Related to Our Common Stock\nSALES OF OUR COMMON STOCK IN RELIANCE ON RULE 144 MAY REDUCE PRICES IN THAT MARKET BY A MATERIAL AMOUNT. A significant number of the outstanding shares of our common stock are restricted securities within the meaning of Rule 144 under the Securities Act. As restricted securities, those shares may be resold only pursuant to an effective registration statement or pursuant to the requirements of Rule 144 or other applicable exemptions from registration under the Securities Act and as required under applicable state securities laws. Rule 144 provides in essence that an affiliate (i.e., an officer, director or control person) who has held restricted securities for a prescribed period may, under certain conditions, sell every three months, in brokerage transactions, a number of shares that does not exceed 1.0% of the issuers outstanding common stock. The alternative limitation on the number of shares that may be sold by an affiliate, which is related to the average weekly trading volume during the four calendar weeks prior to the sale is not available to stockholders of companies whose securities are not traded on an automated quotation system; because the OTC-QB Market is not such a system, market-based volume limitations are not available for holders of our securities selling under Rule 144.\nPursuant to the provisions of Rule 144, there is no limit on the number of restricted securities that may be sold by a non-affiliate (i.e., a stockholder who has not been an officer, director or control person for at least 90 consecutive days before the date of the proposed sale) after the restricted securities have been held by the owner for a prescribed period, although there may be other limitations and/or criteria to satisfy. A sale pursuant to Rule 144 or pursuant to any other exemption from the Securities Act, if available, or pursuant to registration of shares of our common stock held by our stockholders, may reduce the price of our common stock in any market that may develop.\nYOU MAY NOT BE ABLE TO LIQUIDATE YOUR INVESTMENT SINCE THERE IS NO ASSURANCE THAT A PUBLIC MARKET WILL DEVELOP FOR OUR COMMON STOCK OR THAT OUR COMMON STOCK WILL EVER BE APPROVED FOR TRADING ON A RECOGNIZED EXCHANGE. There is no established public trading market for our securities. Although we intend to be quoted on the OTC-QB Market in the United States, our shares are not and have not been quoted on any exchange or quotation system. We cannot assure you that a market maker will agree to file the necessary documents with the FINRA, nor can there be any assurance that such an application for quotation will be approved or that a regular trading market will develop or that if developed, will be sustained. In the absence of a trading market, an investor may be unable to liquidate its investment, which will result in the loss of your investment.\nOUR COMMON STOCK IS SUBJECT TO THE PENNY STOCK RULES OF THE SEC AND THE TRADING MARKET IN OUR SECURITIES IS LIMITED, WHICH MAKES TRANSACTIONS IN OUR STOCK CUMBERSOME AND MAY REDUCE THE VALUE OF AN INVESTMENT IN OUR STOCK. Under U.S. federal securities legislation, our common stock will constitute penny stock. Penny stock is any equity security that has a market price of less than $5.00 per share, subject to certain exceptions. For any transaction involving a penny stock, unless exempt, the rules require that a broker or dealer approve a potential investors account for transactions in penny stocks, and the broker or dealer receive from the investor a written agreement to the transaction, setting forth the identity and quantity of the penny stock to be purchased. In order to approve an investors account for transactions in penny stocks, the broker or dealer must obtain financial information and investment experience objectives of the person, and make a reasonable determination that the transactions in penny stocks are suitable for that person and the person has sufficient knowledge and experience in financial matters to be capable of evaluating the risks of transactions in penny stocks. The broker or dealer must also deliver, prior to any transaction in a penny stock, a disclosure schedule prepared by the Commission relating to the penny stock market, which, in highlight form sets forth the basis on which the broker or dealer made the suitability determination. Brokers may be less willing to execute transactions in securities subject to the penny stock rules. This may make it more difficult for investors to dispose of our common stock and cause a decline in the market value of our stock. Disclosure also has to be made about the risks of investing in penny stocks in both public offerings and in secondary trading and about the commissions payable to both the broker-dealer and the registered representative, current quotations for the securities and the rights and remedies available to an investor in cases of fraud in penny stock transactions. Finally, monthly statements have to be sent disclosing recent price information for the penny stock held in the account and information on the limited market in penny stocks.\nIN THE FUTURE, WE MAY ISSUE ADDITIONAL COMMON AND PREFERRED SHARES, WHICH WOULD REDUCE INVESTORS PERCENT OF OWNERSHIP AND MAY DILUTE OUR SHARE VALUE. Our Articles of Incorporation authorize the issuance of 600,000,000 shares of common stock. As of the date of this filing, the Company had 362,905,561 shares of common stock outstanding. Accordingly. In addition, we have the right to issue 200,000,000 shares of preferred stock. The preferred stock is known as blank check as the Board of Directors is authorized to set the rights, privileges and preference of the preferred stock. The future issuance of common stock and preferred may result in substantial dilution in the percentage of our common stock held by our then existing shareholders. We may value any common stock issued in the future on an arbitrary basis. The issuance of common stock or preferred stock for future services or acquisitions or other corporate actions may have the effect of diluting the value of the shares held by our investors, and might have an adverse effect on any trading market for our common stock.\nWE ARE NOT A FULLY REPORTING COMPANY UNDER SECTION 12(G) OF THE SECURITIES EXCHANGE ACT OF 1934, RATHER WE WILL BE SUBJECT TO THE REPORTING REQUIREMENTS OF SECTION 15(D) OF THE EXCHANGE ACT WHICH IS LESS RESTRICTIVE ON US AND OUR INSIDERS. In order for us to become a fully reporting company under Section 12(g) of the Exchange Act, we will have to file a Registration Statement on Form 8-A. If we do not become subject to Section 12 of the Exchange Act, we will be subject to Section 15(d) of the Exchange Act, and as such we will not be required to comply with (i) the proxy statement requirements which means shareholders may have less notice of pending matters, and (ii) the Williams Act which requires disclosure of persons or groups that acquire 5% of a companys publicly traded stock and also regulates tender offers. In addition, our officer, director and 10% stockholder will not be required to submit reports to the SEC on their stock ownership and stock trading activity. These reports include Form 3, 4 and 5. Therefore, as a shareholder, less information and disclosure concerning these matters will be available to you.\nWE DO NOT INTEND TO PAY ANY CASH DIVIDENDS ON OUR COMMON STOCK, OUR STOCKHOLDERS WILL NOT BE ABLE TO RECEIVE A RETURN ON THEIR SHARES UNLESS THEY SELL THEM. We intend to retain any future earnings to finance the development and expansion of our business. We do not anticipate paying any cash dividends on our common stock in the foreseeable future. Unless we pay dividends, our stockholders will not be able to receive a return on their shares unless they sell them. There is no assurance that stockholders will be able to sell shares when desired.\nOUR COMMON STOCK PRICE IS LIKELY TO BE HIGHLY VOLATILE WHICH MAY SUBJECT US TO SECURITIES LITIGATION THEREBY DIVERTING OUR RESOURCES WHICH MAY AFFECT OUR PROFITABILITY AND RESULTS OF OPERATION. The market price for our common stock is likely to be highly volatile as the stock market in general and the market for Internet-related stocks.\nThe following factors will add to our common stock prices volatility:\n- fluctuations in our quarterly financial results or the quarterly financial results of companies perceived to be similar to us;\n- changes in estimates of our financial results or recommendations by securities analysts;\n- changes in market valuations of similar companies;\n- changes in our capital structure, such as future issuances of securities or the incurrence of additional debt;\n- regulatory developments in Malaysia or other countries wherein we expect to conduct business;\n- litigation involving our company, our general industry or both;\n- investors general perception of us; and\n- changes in general economic, industry and market conditions.\nMany of these factors are beyond our control. These factors may decrease the market price of our common stock, regardless of our operating performance. In the past, plaintiffs have initiated securities class action litigation against a company following periods of volatility in the market price of its securities. In the future, we may be the target of similar litigation. Securities litigation could result in substantial costs and liabilities and could divert managements attention and resources.\nREDUCED DISCLOSURE REQUIREMENTS APPLICABLE TO EMERGING GROWTH COMPANIES MAY MAKE OUR COMMON STOCK LESS ATTRACTIVE TO INVESTORS. We qualify as an emerging growth company under the JOBS Act. As a result, we are permitted to, and intend to, rely on exemptions from certain disclosure requirements. For so long as we are an emerging growth company, we will not be required to:\n● have an auditor report on our internal controls over financial reporting pursuant to Section 404(b) of the Sarbanes-Oxley Act;\n● comply with any requirement that may be adopted by the Public Company Accounting Oversight Board regarding mandatory audit firm rotation or a supplement to the auditors report providing additional information about the audit and the financial statements (i.e., an auditor discussion and analysis);\n● submit certain executive compensation matters to shareholder advisory votes, such as say-on-pay and say-on-frequency; and\n● disclose certain executive compensation related items such as the correlation between executive compensation and performance and comparisons of the CEOs compensation to median employee compensation.\nIn addition, Section 107 of the JOBS Act also provides that an emerging growth company can take advantage of the extended transition period provided in Section 7(a)(2)(B) of the Securities Act for complying with new or revised accounting standards. In other words, an emerging growth company can delay the adoption of certain accounting standards until those standards would otherwise apply to private companies. We will remain an emerging growth company for up to five full fiscal years, although if the market value of our common stock that is held by non-affiliates exceeds $700 million as of any January 31 before that time, we would cease to be an emerging growth company as of the following December 31, or if our annual revenues exceed $1 billion, we would cease to be an emerging growth company the following fiscal year, or if we issue more than $1 billion in non-convertible debt in a three-year period, we would cease to be an emerging growth company immediately.\nNotwithstanding the above, we are also currently a smaller reporting company, meaning that we are not an investment company, an asset-backed issuer, nor a majority-owned subsidiary of a parent company that is not a smaller reporting company, and has a public float of less than $75 million and annual revenues of less than $50 million during the most recently completed fiscal year. If we are still considered a smaller reporting company at such time as we cease to be an emerging growth company, we will be subject to increased disclosure requirements. However, the disclosure requirements will still be less than they would be if we were not considered either an emerging growth company or a smaller reporting company. Specifically, similar to emerging growth companies, smaller reporting companies are able to provide simplified executive compensation disclosures in their filings; are exempt from the provisions of Section 404(b) of the Sarbanes-Oxley Act requiring that independent registered public accounting firms provide an attestation report on the effectiveness of internal control over financial reporting; are not required to conduct say-on-pay and frequency votes until annual meetings occurring on or after January 21, 2015; and have certain other decreased disclosure obligations in their SEC filings, including, among other things, only being required to provide two years of audited financial statements in annual reports. Decreased disclosures in its SEC filings due to its status as an emerging growth company or smaller reporting company may make us less attractive to investors given that it will be harder for investors to analyze the Companys results of operations and financial prospects and, as a result, it may be difficult for us to raise additional capital as and when we need it. ITEM 1B. UNRESOLVED STAFF COMMENTS.\nNone. ITEM 2. PROPERTIES.\nOur properties are located at No. 9 & 10, Jalan P4/8B, Bandar Teknologi Kajang, 43500 Semenyih, Selangor Darul Ehsan, Malaysia. The property is a 3-story semi-detached facility. The property consists of a total of 18,453 square feet, of 9,053 square feet is allocated to our executive offices and the remainder is for manufacturing and distribution. The real estate is owned by our subsidiary, Bio Life Neutraceuticals Sdn Bhd. We acquired the property in June 2016. The property was pledged to Maybank Islamic Berhad for banking facilities of USD1,705,086 along with interest at Base Financing Rate + 4% per annum or 10% per annum, whichever is higher. The loan is payable by equal monthly instalment of USD$4,492 for term of 20 years. ITEM 3. LEGAL PROCEEDINGS.\nThere are presently no pending legal proceedings to which the Company or any of its property is subject, or any material proceedings to which any director, officer or affiliate of the Company, any owner of record or beneficially of more than five percent of any class of voting securities is a party or has a material interest adverse to the Company, and no such proceedings are known to the Company to be threatened or contemplated against it. ITEM 4. MINE SAFETY DISCLOSURES.\nNone.\nPART II ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES.\nMarket Information\nAs of the date of this filing, we have not applied to FINRA for the symbol for our common stock. Thus, at the moment, there is no established public market for our common stock, and a public market may never develop. In addition, there may never be substantial activity in such market. If there is substantial activity, such activity may not be maintained, and no prediction can be made as to what prices may prevail in such market.\nIf we become able to have our shares of common stock quoted on the OTC-QB tier of OTC Markets, we will then try, through a broker-dealer and its clearing firm, to become eligible with the DTC to permit our shares to be traded electronically. If an issuer is not DTC-eligible, its shares cannot be electronically transferred between brokerage accounts, which, based on the realities of the marketplace as it exists today (especially OTC Markets), means that shares of an issuer will not be able to be traded (technically the shares can be traded manually between accounts, but this may take days and is not a realistic option for issuers relying on broker-dealers for stock transactions - like all the companies on the OTC Markets). What this means is that while DTC-eligibility is not a requirement to trade on the OTC Markets, it is however a necessity to efficiently process trades on the OTC Markets if a companys stock is going to trade with any volume. There are no assurances that our shares will ever become DTC-eligible or, if they do, how long it may take.\nCapital Stock\nOur authorized capital stock consists of 600,000,000 shares of common stock, $0.0001 par value per share, and 200,000,000 shares of preferred stock, $0.0001 par value per share. As of the date of this filing, there are 362,272,347 shares of our common stock issued and outstanding that was held by 154 stockholders of record and no shares of preferred stock issued and outstanding. The shares of preferred stock are blank check meaning the Companys Board of Directors can issue shares of preferred stock in such series with such rights, privileges and preferences as determined from time to time by the Board of Directors without shareholder approval.\nDividend Policy\nThe Company has not declared or paid any cash dividends on its Common Stock and does not intend to declare or pay any cash dividend in the foreseeable future. The payment of dividends, if any, is within the discretion of the Board of Directors and will depend on the Companys earnings, if any, its capital requirements and financial condition and such other factors as the Board of Directors may consider.\nSecurities Authorized for Issuance under Equity Compensation Plans\nThe Company does not have any equity compensation plans or any individual compensation arrangements with respect to its Common Stock or Preferred Stock. The issuance of any of our Common Stock or Preferred Stock is within the discretion of our Board of Directors, which has the power to issue any or all of our authorized but unissued shares without stockholder approval.\nRecent Sales of Unregistered Securities\nNone ITEM 6. SELECTED FINANCIAL DATA.\nAs a smaller reporting company as defined by Rule 12b-2 of the Exchange Act, the Company is not required to provide this information. ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS.\nGENERAL\nOur Company was incorporated in April 2017 and operations of our Malaysian subsidiaries began operations in 2017. Consequently, the following discussion and analysis of the results of operations and financial condition of the Company is for fiscal years ended December 31, 2021 and December 31, 2020, respectively. This information should be read in conjunction with the notes to the financial statements that are included elsewhere herein. The consolidated financial statements presented herein (and to which this discussion relates) reflect the results of operations of the Company and its Malaysian subsidiaries. Our discussion includes forward-looking statements based upon current expectations that involve risks and uncertainties, such as our plans, objectives, expectations and intentions. Actual results and the timing of events could differ materially from those anticipated in these forward-looking statements as a result of a number of factors. We use words such as anticipate, estimate, plan, project, continuing, ongoing, expect, believe, intend, may, will, should, could, and similar expressions to identify forward-looking statements. We undertake no obligation to revise or update any forward-looking statements in order to reflect any event or circumstance that may arise after the date of this report, except as required by law. Readers are urged to carefully review and consider the various disclosures made throughout the entirety of this quarterly report, which are designed to advise interested parties of the risks and factors that may affect our business, financial condition, results of operations and prospects.\nCompany Overview\nOur financial statements are prepared in US Dollars and in accordance with accounting principles generally accepted in the United States. See information immediately below for information concerning the exchange rates at the Malaysian translated into US Dollars (USD) at various pertinent dates and for pertinent periods.\nTranslation of amounts from the local currency of the Malaysian company Bio Life Neutraceuticals Sdn. Bhd., a subsidiary of Bioplus Life Corp, into US$1 has been made at the following exchange rates for the respective years:\nAs of and for the years ended December 31,\nYear-end MYR : US$1 exchange rate 4.1760 4.0130\nYearly average MYR : US$1 exchange rate 4.1454 4.2016\nBioplus Life Corp., a Nevada corporation (Company), was incorporated under the laws of the State of Nevada on April 13, 2017. On July 10, 2017, the Company acquired 100% of the equity interests of Bioplus Life Corp., a Malaysian company. On July 19, 2017, the Company, through its Malaysian subsidiary, Bioplus Life Corp., acquired 100% of the equity interests of Bioplus Life International Holdings Ltd, a Hong Kong company. On October 27, 2017, the Company through its Hong Kong subsidiary, Bioplus Life International Holdings Ltd, acquired 100% equity interest of Bioplus Life Corp. (ShenZhen), a company incorporated in China.\nDuring the previous financial year , the Company disposed of and de-registered two of its subsidiaries namely, Bioplus Life International Holdings Ltd, a Hong Kong company and its subsidiary, Bioplus Life Corp. (ShenZhen), a company incorporated in China.\nOur current corporate structure is depicted below:\nSpecial Note.\n(1) Bioplus Life International Holdings Ltd. was officially disposed of on August 5, 2020.\n(2) Bio Life Neutraceuticals (Shenzhen) Pty Ltd. was being officially de-registered in Shenzhen on September 4, 2020.\nSummary of Business\nBioplus Life Corp., through its wholly owned subsidiaries, specializing in manufacturing and selling health and beauty care products. Our corporate complex is located at No 9 and No 10, Jalan P4/8B, Bandar Teknologi Kajang, 43500 Semenyih, Selangor Darul Ehsan, Malaysia, which are two adjoining commercial structures. Our corporate offices are located in the No. 9 building. Our manufacturing facilities comprise the remainder of the space in both buildings.\nOur website is http://www.bionutry.com and our phone number is +60 3 8703 2020.\nRESULTS OF OPERATIONS\nResults of Operations for the Year Ended December 31, 2021 Compared to the Year Ended December 31, 2020.\nThe following table sets forth key components of the results of operations for fiscal year ended December 31, 2021 and 2020, respectively. The discussion following the table addresses these results.\nYear ended\nDecember 31,\nREVENUE $ 2,547,216 $ 3,549,313\nCOST OF REVENUE (1,234,379 ) (2,178,491 )\nGROSS PROFIT 1,312,837 1,370,822\nOTHER INCOME 30,520 18,663\nOPERATING EXPENSES\nGeneral and operating expenses (1,022,480 ) (1,067,077 )\nFinance cost (28,378 ) (34,378 )\nTOTAL EXPENSES (1,050,858 ) (1,101,455 )\nPROFIT FROM OPERATIONS 292,499 288,030\nGain on disposal of subsidiary - 28,912\nPROFIT BEFORE INCOME TAX 292,499 316,942\nIncome tax expense (121,766 ) (102,748 )\nNET PROFIT $ 170,733 $ 214,194\nOther comprehensive (loss)/income:\nForeign currency translation (loss)/gain (71,233 ) 42,531\nCOMPREHENSIVE INCOME $ 99,500 $ 256,725\nEarning per shares $ 0.0005 $ 0.0005\nWeighted average number of shares outstanding\n- Basic and diluted $ 362,888,888 $ 362,610,479\nRevenues. For the annual period ended December 31, 2021, we had revenues of $2,547,216 as compared to revenues of $3,549,313 for the annual period ended December 31, 2020, a decrease from the prior annual period. The decrease in revenues was a result of decrease in demand and the economy slows down. When times are hard, people try to save money to spend on food supplements.\nCost of revenues. For the annual period ended December 31, 2021, we had cost of revenues of $1,234,379, as compared to cost of revenues of $2,178,491 for the annual period ended December 31, 2020, a decrease from the prior annual period. The decrease corresponds to the decrease in product sales for the current period. Cost of revenue includes raw materials, packaging materials and lab tests.\nOther Income. For the annual period ended December 31, 2021, we had other income of $30,520, as compared $18,663 for the annual period ended December 31, 2020.\nOperating Expenses. For the annual period ended December 31, 2021, we had total operating expenses of $1,050,858 as compared to total operating expenses of $1,101,455 for the annual period ended December 31, 2020, a decrease from the prior annual period. Operating expenses consists of general and operating expenses which includes depreciation of fixed assets, employee compensation and benefits, professional fees and marketing and travel expenses. Operating expenses also includes finance costs on the Companys term loan, which was relatively flat for both annual periods. The decrease in general and operating expenses for the current year reflects decrease in commissions paid due to decreased revenues as well as decrease in staff and directors bonuses .\nProfit from operations . We had a profit from operations of $292,499 for the annual period ended December 31, 2021 compared with a profit from operations of $288,030 for the annual period ended December 31, 2020 for the reasons discussed above.\nProfit Before Income Tax. During the current fiscal year, we did not have a gain on a subsidiary disposal which contributed to our Profit Before Income Tax. We had a gain on a subsidiary disposal of $28,912 for the prior fiscal period.\nTax expense. For the year ended December 31, 2021, we had income tax expense of $121,766 compared with income tax expense of $102,748 for the prior annual fiscal year. The increase in this expense for the current year end period was due to increase in net profit from operations.\nForeign currency translation gain/loss. For the annual period ended December 31, 2021, we had foreign currency translation loss of $71,233 compared with foreign currency translation gain $42,531 for the prior annual period. Foreign currency translation gain/loss represents the movement of the US Dollar against the Malaysian Ringgit.\nLIQUIDITY AND CAPITAL RESOURCES\nAs of December 31, 2021, we had working capital of $326,215 compared with working capital of $308,495 as of December 31, 2020. The increase in working capital is due to decrease in trade and other payables, both of which are attributable to decrease in cost of revenues and operating expenses for the current period.\nOur primary uses of cash have been for operations. The main sources of cash have been from operational revenues and the private placement of our common stock. The following trends are reasonably likely to result in a material decrease in our liquidity over the near to long term:\n● Addition of administrative and marketing personnel as the business grows,\n● Development of a Company website,\n● Increases in advertising and marketing in order to attempt to generate more revenues, and\n● The cost of being a public company.\nChong Khooi You, President/CEO, a major shareholder of the Company, has undertaken to financially support the company so that the Company will be sufficient to sustain its current level of operation for at least the next 12 months of operations. In this respect, Company has the ability to continue as a going concern, if the Company is unable to obtain adequate capital. The accompanying financial statements do not include any adjustments to reflect the recoverability and classification of recorded asset amounts and classification of liabilities that might be necessary should the Company be unable to continue as a going concern.\nSummary of Cash Flows\nThe following is a summary of the Companys cash flows from operating and financing activities for the years ended December 31, 2021 and 2020:\nFor the year ended December 31,\nCash and cash equivalents beginning of year $ 398,974 $ 69,220\nNet cash flow provided by/(used in):\nOperating activities 193,336 564,580 )\nInvesting activities (78,519 ) (200,885 )\nFinancing activities (241,470 ) (60,113 )\nForeign currency translation adjustment (4,063 ) 14,241\nNet cash increase (decrease) for the year (130,716 ) 315,513\nCash and cash equivalents, end of the year $ 268,258 $ 398,974\nOperating Activities\nDuring the year ended December 31, 2021, the Company incurred a net profit of $170,733 which, after adjusting for depreciation, amortization , bad debts written off and interest expense, and changes in operating assets and liabilities, resulted in net cash of $193,336 being generated from operating activities during the year. By comparison, during the year ended December 31, 2020, the Company incurred a net profit of $214,914 which, after adjusting for gain on disposal of subsidiary, depreciation, amortization, bad debts written off and interest expense, and changes in operating assets and liabilities, resulted in net cash of $564,580 in operating activities during the period.\nInvesting Activities\nDuring the year ended December 31, 2021, cash flow used in investing activities consists of purchase of the property, plant and equipment of $91,100 compared with similar purchases of $206,458 for the prior year end period.\nFinancing Activities\nFor the year ended December 31, 2021, the cash used in financing activities primarily consists of $26,368 in interest expense, $16,612 in repayment of loans, $19,157 in drawdown of finance lease, The increase during the current period is due to reduction in additional paid in capital of $197,369. For the year ended December 31, 2020, the cash used in financing activities primarily consisted of the receipt of proceed from issued shares $360, offset by $33,471 in interest expense, $2,907 in repayment of loans and $12,164 in repayment of finance lease.\nOur financial statements reflect the fact that we have sufficient revenue to cover our operating expenses for the next 12 months, although at present time, we are under-capitalized. The Company intends to continue with capital investment or other financing to fund its marketing/ promotional campaigns and the expansion of production capacity for 2022 and beyond for a 50% to 60% increase in revenues in Malaysia, China, India, Middle Eastern and African markets. If continued funding and capital resources are unavailable at reasonable terms, the Company may not be able to implement its expansion plan.\nSummary of Significant Accounting Policies.\n● Basis of presentation\nThese accompanying financial statements have been prepared in accordance with generally accepted accounting principles in the United States of America (US GAAP).\n● Basis of consolidation\nIn the Annual Report, the Company, us or we refer to the consolidated entity, including its subsidiaries and affiliates. Furthermore, in which the company has a variable interest have been consolidated where the Company is the primary beneficiary. All intercompany transactions and balances have been eliminated in consolidation.\n● Use of estimates\nIn preparing these financial statements, management makes estimates and assumptions that affect the reported amounts of assets and liabilities in the balance sheets and revenues and expenses during the years reported. Actual results may differ from these estimates.\n● Cash and cash equivalents\nCash and cash equivalents represent cash on hand, demand deposits placed with banks or other financial institutions and all highly liquid investments with an original maturity of three months or less as of the purchase date of such investments.\n● Property, plant and equipment\nProperty and plant and equipment are stated at cost less accumulated depreciation and accumulated impairment losses, if any. Depreciation is calculated on the straight-line basis to write off the cost over the following expected useful lives of the assets concerned. The principal annual rates used are as follows:\nCategories\nPrincipal Annual Rates/Expected Useful Life\nComputer hardware\n20%\nFurniture & fittings\n10%\nHandphone\n20%\nLandscape\n20%\nLeasehold land and building\n99 years\nMachinery\n10%\nMotor vehicle\n20%\nOffice equipment\n10%\nRenovation\n20%\nSignboard\n10%\nTools and equipment\n10%\nKitchen utensils\n10%\nFully depreciated plant and equipment are retained in the financial statements until they are no longer in use.\n● Intangible assets\nIntangible assets are stated at cost less accumulated amortization. Intangible assets represented the registration costs of trademarks, which are amortized on a straight-line basis over a useful life.\nThe Company follows ASC Topic 350 in accounting for intangible assets, which requires impairment losses to be recorded when indicators of impairment are present and the undiscounted cash flows estimated to be generated by the assets are less than the assets carrying amounts. There was no impairment losses recorded on intangible assets for the year ended December 31, 2021.\n● Inventories\nInventories consisting of products available for sell, are stated at the lower of cost or market value. Cost of inventory is determined using the first-in, first-out (FIFO) method. Inventory reserve is recorded to write down the cost of inventory to the estimated market value due to slow-moving merchandise and damaged goods, which is dependent upon factors such as historical and forecasted consumer demand, and promotional environment. The Company takes ownership, risks and rewards of the products purchased. Write downs are recorded in cost of revenues in the Condensed Statements of Operations and Comprehensive Income.\n● Revenue recognition\nRevenues are recognized when control of the promised goods or services are transferred to a customer, in an amount that reflects the consideration that the Company expects to receive in exchange for those goods or services. The Company applies the following five steps in order to determine the appropriate amount of revenue to be recognized as it fulfills its obligations under each of its agreements:\n● identify the contract with a customer;\n● identify the performance obligations in the contract;\n● determine the transaction price;\n● allocate the transaction price to performance obligations in the contract; and\n● recognize revenue as the performance obligation is satisfied.\n● Cost of revenues\nCost of revenue includes the purchase cost of retail goods for re-sale to customers and packing materials (such as boxes). It excludes purchasing and receiving costs, inspection costs, warehousing costs, internal transfer costs and other costs of distribution network in cost of revenues.\n● Shipping and handling fees\nShipping and handling fees, if billed to customers, are included in revenue. Shipping and handling fees associated with inbound and outbound freight are expensed as incurred and included in selling and distribution expenses.\n● Comprehensive income\nASC Topic 220, Comprehensive Income establishes standards for reporting and display of comprehensive income, its components and accumulated balances. Comprehensive income as defined includes all changes in equity during a period from non-owner sources. Accumulated other comprehensive income, as presented in the accompanying statements of stockholders equity consists of changes in unrealized gains and losses on foreign currency translation and cumulative net change in the fair value of available-for-sale investments held at the balance sheet date. This comprehensive income is not included in the computation of income tax expense or benefit.\n● Income tax expense\nIncome taxes are determined in accordance with the provisions of ASC Topic 740, Income Taxes (ASC Topic 740). Under this method, deferred tax assets and liabilities are recognized for the future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax basis. Deferred tax assets and liabilities are measured using enacted income tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. Any effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date.\nASC 740 prescribes a comprehensive model for how companies should recognize, measure, present, and disclosed in their financial statements uncertain tax positions taken or expected to be taken on a tax return. Under ASC 740, tax positions must initially be recognized in the financial statements when it is more likely than not the position will be sustained upon examination by the tax authorities. Such tax positions must initially and subsequently be measured as the largest amount of tax benefit that has a greater than 50% likelihood of being realized upon ultimate settlement with the tax authority assuming full knowledge of the position and relevant facts.\nThe Company conducts major businesses in Malaysia and is subject to tax in their own jurisdictions. As a result of its business activities, the Company will file separate tax returns that are subject to examination by the foreign tax authorities.\n● Foreign currencies translation\nTransactions denominated in currencies other than the functional currency are translated into the functional currency at the exchange rates prevailing at the dates of the transaction. Monetary assets and liabilities denominated in currencies other than the functional currency are translated into the functional currency using the applicable exchange rates at the balance sheet dates. The resulting exchange differences are recorded in the statement of operations.\nThe functional currency of the Company is the United States Dollars (US$) and the accompanying financial statements have been expressed in US$. In addition, the Company maintains its books and record in a local currency, Malaysian Ringgit (MYR or RM), which is functional currency as being the primary currency of the economic environment in which the entity operates.\nIn general, for consolidation purposes, assets and liabilities of its subsidiaries whose functional currency is not US$ are translated into US$, in accordance with ASC Topic 830-30, Translation of Financial Statement, using the exchange rate on the balance sheet date. Revenues and expenses are translated at average rates prevailing during the period. The gains and losses resulting from translation of financial statements of foreign subsidiary are recorded as a separate component of accumulated other comprehensive income.\nTranslation of amounts from the local currency of the Company into US$1 has been made at the following exchange rates for the respective years:\nAs of and for the year ended\nDecember 31,\nYear-end MYR: US$1 exchange rate 4.1760 4.0130\nYearly average MYR: US$1 exchange rate 4.1454 4.2016\nYear-end US$1: RMB exchange rate 0.1569 0.1533\nYearly average US$1: RMB exchange rate 0.1550 0.1450\n● Related parties\nParties, which can be a corporation or individual, are considered to be related if the Company has the ability, directly or indirectly, to control the other party or exercise significant influence over the other party in making financial and operating decisions. Companies are also considered to be related if they are subject to common control or common significant influence.\n● Fair value of financial instruments\nThe carrying value of the Companys financial instruments: cash and cash equivalents, trade receivable, deposits and other receivables, amount due to related parties and other payables approximate at their fair values because of the short-term nature of these financial instruments.\nThe Company also follows the guidance of the ASC Topic 820-10, Fair Value Measurements and Disclosures (ASC 820-10), with respect to financial assets and liabilities that are measured at fair value. ASC 820-10 establishes a three-tier fair value hierarchy that prioritizes the inputs used in measuring fair value as follows:\n● Level 1 : Observable inputs such as quoted prices in active markets;\n● Level 2 : Inputs, other than the quoted prices in active markets, that are observable either directly or indirectly; and\n● Level 3 : Unobservable inputs in which there is little or no market data, which require the reporting entity to develop its own assumptions\nAs of December 31, 2021, and 2020, the Company did not have any non-financial assets and liabilities that are recognized or disclosed at fair value in the financial statements, at least annually, on a recurring basis, nor did the Company have any assets or liabilities measured at fair value on a non-recurring basis.\n● Lease\nThe Company adopted the ASU No. 2016-02, on August 7, 2020. The Company recognizes lease payments on a straight-line basis over the lease term.\nAs of December 31, 2021, the Company has one operating lease of which lease liability is initially and subsequently measured at the present value of the unpaid lease payments at the lease commencement date. The right-of-use asset is initially measured at cost, which comprises the initial amount of the lease liability adjusted for lease payments made at or before the lease commencement date, plus any initial direct costs incurred less any lease incentives received. Costs associated with operating lease assets are recognized on a straight-line basis within operating expenses over the term of the lease.\nIn determining the present value of the unpaid lease payments, ASC 842 requires a lessee to discount its unpaid lease payments using the interest rate implicit in the lease or, if that rate cannot be readily determined, its incremental borrowing rate. As the Companys lease does not provide an implicit rate, the Company uses its incremental borrowing rate as the discount rate for the lease. The Company incremental borrowing rate is estimated to approximate the interest rate on a collateralized basis with similar terms and payments.\n● Recent accounting pronouncements\nRecent accounting pronouncements issued by the FASB, including its Emerging Issues Task Force, the American Institute of Certified Public Accountants, and the Securities and Exchange Commission did not or are not believed by management to have a material impact on the Companys present or future financial statements . ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK.\nNot applicable to smaller reporting companies. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA.\nOur financial statements are contained in pages through, which appear at the end of this Form 10-K Annual Report. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE.\nNone. ITEM 9A. CONTROLS AND PROCEDURES.\nEvaluation of Disclosure Controls and Procedures\nIn connection with the preparation of this annual report, an evaluation was carried out by the Companys management, with the participation of the principal executive officer and the principal financial officer, of the effectiveness of the Companys disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) under the Exchange Act (Exchange Act) as of December 31, 2021. Disclosure controls and procedures are designed to ensure that information required to be disclosed in reports filed or submitted under the Exchange Act is recorded, processed, summarized, and reported within the time periods specified in the Commissions rules and forms, and that such information is accumulated and communicated to management, including the principal executive officer and the principal financial officer, to allow timely decisions regarding required disclosures.\nBased on that evaluation, the Companys management concluded, as of the end of the period covered by this report, that the Companys disclosure controls and procedures were not effective in recording, processing, summarizing, and reporting information required to be disclosed, within the time periods specified in the Commissions rules and forms, and that such information was not accumulated and communicated to management, including the principal executive officer and the principal financial officer, to allow timely decisions regarding required disclosures.\nManagements Report on Internal Control over Financial Reporting\nThe management of the Company is responsible for establishing and maintaining adequate internal control over financial reporting. The Companys internal control over financial reporting is a process, under the supervision of the principal executive officer and the principal financial officer, designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of the Companys financial statements for external purposes in accordance with United States generally accepted accounting principles (GAAP). Internal control over financial reporting includes those policies and procedures that:\n● Pertain to the maintenance of records that in reasonable detail accurately and fairly reflect the transactions and dispositions of the Companys assets;\n● Provide reasonable assurance that transactions are recorded as necessary to permit preparation of the financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures are being made only in accordance with authorizations of management and the board of directors; and\n● Provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the Companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions or that the degree of compliance with the policies or procedures may deteriorate.\nThe Companys management conducted an assessment of the effectiveness of our internal control over financial reporting as of December 31, 2021, based on criteria established in Internal Control - Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013) as set forth in its Internal Control - Integrated Framework. This assessment identified material weaknesses in internal control over financial reporting. A material weakness is a control deficiency, or a combination of deficiencies in internal control over financial reporting that creates a reasonable possibility that a material misstatement in annual or interim financial statements will not be prevented or detected on a timely basis. Since the assessment of the effectiveness of our internal control over financial reporting did identify a material weakness, management considers its internal control over financial reporting to be ineffective.\nManagement has concluded that our internal control over financial reporting had the following material deficiencies:\n● We were unable to maintain segregation of duties within our business operations due to our reliance on a single individual fulfilling the role of sole officer and director.\n● Lack of a functioning audit committee due to a lack of a majority of independent members and a lack of a majority of outside directors on our Board of Directors, resulting in ineffective oversight in the establishment and monitoring of required internal control and procedures.\nThese control deficiencies to our 2021 interim or annual financial statements could have resulted in a material misstatement that might have been prevented or detected by a segregation of duties. Accordingly, we have determined that this control deficiency constitutes a material weakness.\nTo the extent reasonably possible, given our limited resources, our goal is, upon consummation of a merger with a private operating company, to separate the responsibilities of principal executive officer and principal financial officer, intending to rely on two or more individuals. We will also seek to expand our current board of directors to include additional individuals willing to perform directorial functions. Since the recited remedial actions will require that we hire or engage additional personnel, this material weakness may not be overcome in the near term due to our limited financial resources. Until such remedial actions can be realized, we will continue to rely on the advice of outside professionals and consultants.\nThis annual report does not include an attestation report of our registered public accounting firm regarding our internal controls over financial reporting. Managements report was not subject to attestation by our registered public accounting firm pursuant to Section 404(c) of the Sarbanes-Oxley Act that permit us to provide only managements report in this annual report.\nChanges in Internal Controls over Financial Reporting\nDuring the year ended December 31, 2021, other than the change in ownership, there has been no change in internal control over financial reporting that has materially affected or is reasonably likely to materially affect our internal control over financial reporting. ITEM 9B. OTHER INFORMATION.\nNone\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE.\nThe following table sets forth the name, age, and position of sole executive officer and director. Executive officers are elected annually by our Board of Directors. Each executive officer holds his office until he resigns, is removed by the Board, or his successor is elected and qualified. Directors are elected annually by our stockholders at the annual meeting. Each director holds his office until his successor is elected and qualified or his earlier resignation or removal.\nNAME\nAGE\nPOSITION\nChong Khooi You\nChief Executive Officer, Chief Financial (Accounting) Officer, President and Secretary and Director\nChong Khooi You. Mr. Chong has been engaged in the healthcare industry for over 20 years. Since 1990, he has been involved in the healthcare industry working independently as a consultant for many network marketing companies. His responsibilities primarily focus on building the right business partnerships globally, implementing business plans for product development and communicating on behalf of the company to shareholders, employees, government authorities, other stakeholders and the public.\nIn 2015, Mr. Chong was awarded with the ASEAN Outstanding Business Award for his contribution to the health care industry market.\nMr. Chongs experience in corporate management and business development has led the Board of directors to reach the conclusion that he should serve as President, Chief Executive Officer and Director of the Company.\nFamily Relationships\nExcept as stated herein above, there are no family relationships among our directors or officers.\nInvolvement in Legal Proceedings\nTo the best of our knowledge, none of our directors or executive officers, during the past ten years, has been convicted in a criminal proceeding, excluding traffic violations or similar misdemeanors, or has been a party to any judicial or administrative proceeding during the past five years that resulted in a judgment, decree or final order enjoining the person from future violations of, or prohibiting activities subject to, federal or state securities laws, or a finding of any violation of federal or state securities laws, except for matters that were dismissed without sanction or settlement. Except as set forth in our discussion below in Certain Relationships and Related Transactions, none of our directors, director nominees or executive officers has been involved in any transactions with us or any of our directors, executive officers, affiliates or associates which are required to be disclosed pursuant to the rules and regulations of the Securities and Exchange Commission.\nDirector Independence\nOur Board of Directors is currently composed of one member, who does not qualify as an independent director in accordance with the published listing requirements of the NASDAQ Global Market (the Company has no plans to list on the NASDAQ Global Market). The NASDAQ independence definition includes a series of objective tests, such as that the directors are not, and have not been for at least three years, one of our employees and that neither the Director, nor any of their family members have engaged in various types of business dealings with us. In addition, our board of directors has not made a subjective determination as to our director that no relationship exist which, in the opinion of our board of directors, would interfere with the exercise of independent judgment in carrying out the responsibilities of a director, though such subjective determination is required by the NASDAQ rules. Had our board of directors made these determinations, our board of directors would have reviewed and discussed information provided by our director and us with regard to our directors business and personal activities and relationships as they may relate to us and our management.\nCode of Ethics\nWe currently do not have a code of ethics that applies to our officers, employees and directors, including our Chief Executive Officer and Chief Financial Officer; however, we intend to adopt one in the near future.\nConflicts of Interest\nSince we do not have an audit or compensation committee comprised of independent directors, the functions that would have been performed by such committees are performed by our directors. The Board of Directors has not established an audit committee and does not have an audit committee financial expert, nor has the Board established a nominating committee. The Board is of the opinion that such committees are not necessary since the Company is an early-stage company, and to date, such directors have been performing the functions of such committees. Thus, there is a potential conflict of interest in that our sole director and officer has the authority to determine issues concerning management compensation, nominations, and audit issues that may affect management decisions.\nIn addition, our officer has committed to spend a sufficient amount of time and attention to the affairs of the Company to fulfill their respective officer responsibilities. In this regard, generally, our officer spends between 15 to 40 hours per week on the affairs of the Company, depending on the circumstances. Therefore, we may face conflicts of interest between the time and attention our officer devotes to the Company and that of his other business interests.\nOther than as described above, we are not aware of any other conflicts of interest of our executive officer and director.\nInvolvement in Certain Legal Proceedings\nThere are no legal proceedings that have occurred since our incorporation concerning our Director, or control persons which involved a criminal conviction, a criminal proceeding, an administrative or civil proceeding limiting ones participation in the securities or banking industries, or a finding of securities or commodities law violations. ITEM 11. EXECUTIVE COMPENSATION.\nSummary Executive Compensation Table\nThe following table reflects the Summary Compensation for our named executive officer for fiscal years ended December 31, 2021, and 2020, respectively. For such periods, there were no bonus, non-equity plan compensation, nonqualified compensation earnings or other compensation other than as stated below for the named executive officer. Further, we have not entered into an employment agreement with our officer, director or any other persons and no such agreements are anticipated in the immediate future.\nStock Other\nAward Compensation Total\nName and Position Year Salary $ $ $\nChong Khooi You 78,750 78,750\nSole Officer 115,791 115,791\n(1). Mr. You received allowance of $326 for fiscal year 2021.\nEmployment Agreements\nThe Company does not have any employment or other compensation agreement with its executive officer. Moreover, there are no agreements or understandings for our executive officer or director to resign at the request of another person and no officer or director is acting on behalf of nor will any of them act at the direction of any other person.\nGrants of Plan-Based Awards\nExcept as stated above, no plan-based awards were granted to any of our named executive officer during the fiscal year ended December 31, 2021.\nOutstanding Equity Awards at Interim Fiscal Year End\nThe equity awards reflected in the Summary Compensation Table above represents all restricted stock awards issued to our executive officer at December 31, 2021 No other stock or stock option awards were granted to any other officer of the Company as at December 31, 2021.\nOption Exercises and Stock Vested\nNo option to purchase our capital stock was exercised by any of our named executive officer, nor was any restricted stock held by such executive officer vested during the fiscal period ended December 31, 2021.\nPension Benefits\nNo named executive officer received or held pension benefits during the fiscal year ended December 31, 2021. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT\nSecurity Ownership Of Certain Beneficial Owners And Management\nThe following table sets forth certain information, as of the date hereof, with respect to the beneficial ownership of the outstanding common stock by (i) any holder of more than five percent (5%); (ii) our executive officer and director; and (iii) our director and executive officer as a group. Except as otherwise indicated, each of the stockholders listed below has sole voting and investment power over the shares beneficially owned. The information is based on 362,272,347 shares of common stock issued and outstanding as of this date.\nName and Address of Amount and Nature of Percent of\nBeneficial Owner Beneficial Ownership (1) Class\nOfficers and Directors\nChong Khooi You\nChief Executive Officer,\nChief Financial (Accounting Officer),\nPresident And Secretary. 280,100,000 77.35 %\nAll officers and directors as a group (1 person) 280,100,000 77.35 %\n5% or greater shareholders\nHarmony HealthLifeStyle (HHL) Global Sdn Bhd 35,000,000 9.67 %\n(1) Beneficial Ownership is determined in accordance with the rules of the SEC and generally includes voting or investment power with respect to securities. Each of the beneficial owners listed above has ownership of and voting power and investment power with respect to our Common stock or Preferred Shares. For each beneficial owner above, any options exercisable within 60 days have been included in the denominator.\n(2) The natural person who has voting or investment control over the shares held by Harmony HealthLifeStyle (HHL) Global Sdn. Bhd. is Liew Kit Seng. The address of the shareholder is No. 26, Jalan Desa Mewah 12, Taman Desa Mewah, 43500 Semenyih, Selangor, Malaysia. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE.\nOn April 13, 2017, Chong Khooi You was appointed as President, Secretary, Treasurer, Chief Executive Officer, and a member of our Board of Directors. Additionally, on April 13, 2017, the Company issued 100,000 shares of restricted common stock, each with a par value of $0.0001 per share, to Mr. Chong Khooi You for initial working capital of $10.\nOn July 10, 2017, the Company acquired 100% of the equity interests of Bioplus Life Corp., a company incorporated in Labuan, Malaysia. Bioplus Life Corp, a Malaysian Company, was, previous to our acquisition of it, owned and controlled by Chong Khooi You, who is currently our sole officer and director. The consideration paid to Mr. Chong Khooi You in exchange for the equity interests of Bioplus Life Corp, a Malaysian Company, was $100.\nOn July 19, 2017, the Company through its subsidiary in Labuan, Bioplus Life Corp., acquired 100% of the equity interests of Bioplus Life International Holdings Ltd, a company incorporated in Hong Kong. Previous to the aforementioned acquisition, Bioplus Life International Holdings Ltd. was owned and controlled by Mr. Lee Chong Kuang. Total consideration exchanged per the aforementioned acquisition was $0.13.\nOn July 20, 2017, the Company issued 280,000,000 shares of restricted common stock to Mr. Chong Khooi You, each with a par value of $0.0001 per share, for additional working capital of $28,000.\nOn August 17, 2017, the Company issued 35,000,000 and 17,500,000 shares of restricted common stock to Greenpro Asia Strategic SPC and respectively, each with a par value of $0.0001 per share, for additional working capital of $5,250. On August 21, 2017, the Company issued 17,500,000 shares of restricted common stock to Bio Life Distribution Sdn Bhd, each with a par value of $0.0001 per share, for additional working capital of $1,750.\nOn February 27, 2018 Bio Life Holdings Berhad, acquired 100% of the equity interests of Bio Life Neutraceuticals Sdn. Bhd., a company incorporated in Malaysia. Prior to the acquisition, Bio Life Neutraceuticals Sdn. Bhd., a Malaysia Company, was owned and controlled by Mr. Chong Khooi You and his spouse Datin Phang Lai. Total consideration exchanged per the aforementioned acquisition was $1,371,429.\nOn June 11, 2018, the Company through its subsidiary in Hong Kong, Bioplus Life International Holdings Ltd, acquired 99.8% equity interest of Bio Life Holdings Berhad, a company incorporated in Malaysia. Prior to the acquisition, Bio Life Holdings Berhad, a company incorporated in Malaysia, was owned and controlled (99.8%) by Chong Khooi You. Total consideration exchanged per the aforementioned acquisition was $0.25. ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES.\nJP Centurion & Partners PLT is the Companys current independent registered public accounting firm replacing Total Asia Associates PLT on January 8, 2021.\n(1) Audit Fees\nThe aggregate fees billed for each of the last two fiscal years for professional services rendered by the principal accountant for our audit of annual financial statements and review of financial statements included in our quarterly reports or services that are normally provided by the accountant in connection with statutory and regulatory filings or engagements for those fiscal years were:\n$ 19,000\n$ 19,000\n(2) Audit-Related Fees\nThe aggregate fees billed in each of the last two fiscal years for assurance and related services by the principal accountants that are reasonably related to the performance of the audit or review of our financial statements and are not reported in the preceding paragraph:\n$ 15,000\n$ 15,000\n(3) Tax Fees\nThe aggregate fees billed in each of the last two fiscal years for professional services rendered by the principal accountant for tax compliance, tax advice, and tax planning were:\n$ 0\n$ 0\n(4) All Other Fees\nThe aggregate fees billed in each of the last two fiscal years for the products and services provided by the principal accountant, other than the services reported in paragraphs (1), (2), and (3) were:\n$ 0\n$ 0\nThe percentage of hours expended on the principal accountants engagement to audit our financial statements for the most recent fiscal year that were attributed to work performed by persons other than the principal accountants full time, permanent employees was 0%.\nAudit Committees Pre-Approval Process\nThe Board of Directors acts as the audit committee of the Company, and accordingly, all services are approved by all the members of the Board of Directors.\nPART IV. ITEM 15. EXHIBITS, FINANCIAL STATEMENT SCHEDULES.\nEXHIBIT INDEX\nExhibit\nDescription\n3.1(a)\nArticles of Incorporation of Registrant(1)\n3.2\nBylaws of the Registrant(1)\n10.2\nBanking Agreement with Maybank Islamic Berhad (1) (2)\nSubsidiaries*\n31.1\nCertification of the Companys Principal Executive Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002*\n32.1\nCertification of the Companys Principal Executive Officer and Principal Financial Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002+\n101.INS\nInline XBRL INSTANCE DOCUMENT*\n101.SCH\nInline XBRL TAXONOMY EXTENSION SCHEMA DOCUMENT*\n101.CAL\nInline XBRL TAXONOMY CALCULATION LINKBASE DOCUMENT*\n101.DEF\nInline XBRL TAXONOMY DEFINITION LINKBASE DOCUMENT*\n101.LAB\nInline XBRL TAXONOMY LABEL LINKBASE DOCUMENT*\n101.PRE\nInline XBRL TAXONOMY PRESENTATION LINKBASE DOCUMENT*\nCover Page Interactive Data File (embedded within the Inline XBRL document)\n(1) Previously filed as an exhibit to the Companys Form S-1 Registration Statement filed on June 28, 2019.\n(2) Exhibit 10.1 is a redacted copy of the original document. The document originally included personal information such as, but not limited to, passport and personal identification numbers, which have been removed entirely from exhibit 10.1 and replaced with the phrase redacted in each instance.\n* Filed herewith\n+ In accordance with SEC Release 33-8238, Exhibits 32.1 is being furnished and not filed.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nBioPlus Life Corp.\n(Registrant)\n/s/ Chong Khooi You\nChong Khooi You Dated: November 28, 2022\nChief Executive Officer (Principal Executive Officer)\nChief Financial Officer (Principal Financial and Accounting Officer)\nAnd Sole Director\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\n/s/ Chong Khooi You\nChong Khooi You Dated: November 28, 2022\nChief Executive Officer (Principal Executive Officer)\nChief Financial Officer (Principal Financial and Accounting Officer)\nAnd Sole Director\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Shareholders and Board of Directors of Bioplus Life Corp.\nNo. 9 & 10, Jalan P4/8B\nBandar Teknologi Kajang\nSemenyih\nSelangor D.E, Malaysia\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Bioplus Life Corp. (the ‘Company) as of December 31, 2021 and 2020, and the related consolidated statements of operations and comprehensive income, stockholders equity, and cash flows for the years ended of December 31, 2021 and 2020, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2021 and 2020, and the results of its operations and its cash flows for the years ended December 31, 2021 and 2020, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nCritical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the Board of Directors (Those Charged with Governance) that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgements. We determined that there are no critical matters.\n/s/ JP CENTURION & PARTNERS PLT\nJP CENTURION & PARTNERS PLT\nWe have served as the Companys auditor since 2020.\nKuala Lumpur, Malaysia\nNovember 28, 2022\nPCAOB ID: 6723\nBIOPLUS LIFE CORP.\nCONSOLIDATED BALANCE SHEET\n(Amount expressed in United States Dollars (US$), except for number of shares)\nNote\nAs of December 31,\nNote\nASSETS\n(Audited) (Audited)\nCurrent assets:\nCash and bank balances\n$ 268,258 $ 398,974\nAccount receivables\n337,221 552,616\nAmount due from related parties 34,415 28,724\nInventories 450,297 374,330\nOther receivables, deposits and prepayments 64,345 41,680\nTotal current assets\n1,154,536 1,396,324\nNon-current assets:\nProperty, plant and equipment, net 2,190,764 2,331,335\nOperating lease right of use assets, net 34,718 41,527\nIntangible assets -\nTotal non-current assets\n2,226,164 2,372,862\nTOTAL ASSETS\n$ 3,380,700 $ 3,769,186\nLIABILITIES AND STOCKHOLDERS EQUITY\nCurrent liabilities:\nAccount payables\n$ 231,900 $ 364,324\nObligation under finance lease 37,025 33,817\nBank borrowings 52,167 54,567\nOperating lease liability 5,476 5,399\nOther payables and accrued liabilities 476,855 587,923\nProvision for taxation\n22,022 38,675\nAmount due to directors 2,876 3,124\nTotal current liabilities\n828,321 1,087,829\nNon-current liabilities:\nObligation under finance lease 73,208 81,981\nBank borrowings 522,948 561,195\nOperating lease liability 29,242 36,128\nDeferred taxation\n31,600 20,657\nTotal non-current liabilities\n656,998 699,961\nTOTAL LIABILITIES\n$ 1,485,319 $ 1,787,790\nStockholders equity:\nCommon stock, par value $0.0001: 362,144,847 and 362,905,561 shares issued and outstanding as of December 31, 2021, and December 31, 2020, respectively $ 36,215 $ 36,291\nAdditional paid in capital\n1,801,500 1,986,939\nAccumulated profit/(loss)\n168,377 (2,356 )\nAccumulated other comprehensive loss\n(110,711 ) (39,478 )\nTotal stockholders equity\n1,895,381 1,981,396\nTOTAL LIABILITIES AND STOCKHOLDERS EQUITY\n$ 3,380,700 $ 3,769,186\nThe accompanying notes are an integral part of these financial statements.\nBIOPLUS LIFE CORP.\nCONSOLIDATED STATEMENTS OF OPERATIONS AND COMPREHENSIVE PROFIT\n(Amount expressed in United States Dollars (US$), except for number of shares)\nNote\nYears ended December 31,\nNote\nRevenues, net\n$ 2,547,216 $ 3,549,313\nCost of revenues\n(1,234,379 ) (2,178,491 )\nGross profit\n1,312,837 1,370,822\nOther income 30,520 18,663\nOperating expenses:\nGeneral and operating expenses\n(1,022,480 ) (1,067,077 )\nFinance cost\n(28,378 ) (34,378 )\nTotal expenses\n(1,050,858 ) (1,101,455 )\nProfit from operations\n292,499 288,030\nGain on disposal of subsidiary\n- 28,912\nProfit before income tax\n292,499 316,942\nIncome tax expense (121,766 ) (102,748 )\nNET PROFIT\n$ 170,733 $ 214,194\nOther comprehensive (loss)/income:\n- Foreign currency translation (loss)/gain\n(71,233 ) 42,531\nCOMPREHENSIVE INCOME\n$ 99,500 $ 256,725\nEarnings per share\n$ 0.0005 $ 0.0005\nWeighted average number of common shares outstanding\n-Basic and diluted\n362,888,888 362,610,479\nThe accompanying notes are an integral part of these financial statements.\nBIOPLUS LIFE CORP.\nCONSOLIDATED STATEMENTS OF CHANGES IN STOCKHOLDERS EQUITY\n(Amount expressed in United States Dollars (US$), except for number of shares)\nNumber of shares Amount paid in\ncapital\nAccumulated\nloss comprehensive\nloss Total equity\nCommon stock Additional\nAccumulated\nother\nNumber of shares Amount paid in\ncapital\nAccumulated\nloss comprehensive\nloss Total equity\nBalance as of January 1, 2020 359,305,561 35,931 1,998,870 (216,550 ) (82,009 ) 1,736,242\nCommon stock issued 3,600,000 - - -\nTransaction with owners - - (11,931 ) - - (11,931 )\nNet profit for the year - - - 214,194 - 214,194\nForeign currency translation gain - - - - 42,531 42,531\nBalance as of December 31, 2020 362,905,561 36,291 1,986,939 (2,356 ) (39,478 ) 1,981,396\nBalance 362,905,561 36,291 1,986,939 (2,356 ) (39,478 ) 1,981,396\nCancellation of shares (760,714 ) (76 ) (185,439 ) - - (197,446 )\nNet profit for the year - - - 170,733 - 170,733\nForeign currency translation loss - - - - (71,233 ) (71,233 )\nBalance as of December 31, 2021 362,144,847 36,215 1,801,500 168,377 (110,711 ) 1,895,381\nBalance 362,144,847 36,215 1,801,500 168,377 (110,711 ) 1,895,381\nThe accompanying notes are an integral part of these financial statements.\nBIOPLUS LIFE CORP.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(Amount expressed in United States Dollars (US$))\nYears ended December 31,\nCash flows from operating activities:\nNet profit $ 170,733 $ 214,194\nAdjustments to reconcile net profit to net cash generated from operating activities:\nGain on disposal of subsidiary - (28,912 )\nInterest income (21 ) -\nGain on disposal of property, plant and equipment (714 ) -\nBad debt written off 2,663 6,307\nAmortisation of right of use assets 5,227 2,068\nInterest expenses 28,378 34,378\nDepreciation of property, plant and equipment 140,426 129,443\nOperating profit before working capital changes 346,692 357,478\nChanges in operating assets and liabilities:\nInventories (90,578 ) (64,355 )\nAccount receivables 191,181 (234,721 )\nOther receivables, deposits and prepayments (24,260 ) 93,185\nAmount due from related parties (6,813 ) (8,561 )\nAmount due from directors (126 ) (1,858 )\nAccount payable (118,204 ) 315,069\nOther payables and accrued liabilities (93,900 ) 88,698\nProvision for taxation (3,419 ) 22,620\nChange in lease liabilities (7,237 ) (2,975 )\nNet cash generated from operating activities 193,336 564,580\nCash flows from investing activities:\nProceed from disposal of subsidiary - 17,504\nProceed from disposal of property, plant and equipment 1,317 -\nInterest received -\nPurchase of intangible assets (688 ) -\nProceeds from disposal of investment 11,931 (11,931 )\nPurchase of property, plant and equipment (91,100 ) (206,458 )\nNet cash used in investing activities (78,519 ) (200,885 )\nCash flows from financing activities:\nProceeds from issued shares -\nCancellation of shares (197,445 ) -\nInterest expenses (26,368 ) (33,471 )\nRepayment of term loan borrowing (16,612 ) (2,907 )\nDrawdown of finance lease 19,157 -\nRepayment of finance lease (20,202 ) (12,164 )\nNet cash used in financing activities (241,470 ) (48,182 )\nForeign currency translation adjustment (4,063 ) 14,241\nNET CHANGE IN CASH AND CASH EQUIVALENTS (130,716 ) 329,754\nCASH AND CASH EQUIVALENTS, BEGINNING OF FINANCIAL YEAR\n398,974 69,220\nCASH AND CASH EQUIVALENTS, END OF FINANCIAL YEAR 268,258 398,974\nCASH AND CASH EQUIVALENTS INFORMATION:\nCash and bank balance $ 268,258 $ 398,974\nCash and cash equivalents, end of financial year 268,258 398,974\nSUPPLEMENTAL CASH FLOWS INFORMATION\nIncome tax paid $ (140,993 ) $ (80,128 )\nThe accompanying notes are an integral part of these financial statements.\nBIOPLUS LIFE CORP.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENT\nDECEMBER 31, 2021\nNOTE 1 - ORGANIZATION AND BUSINESS BACKGROUND\nBioplus Life Corp., a Nevada corporation (the Company) was incorporated under the laws of the State of Nevada on April 13, 2017. For purposes of financial statements presentation, Bioplus Life Corp. and its subsidiaries are herein referred to as the Company or We.\nWe have historically conducted our business through Bio Life Neutraceuticals Sdn Bhd, a private limited liability company, incorporated in Malaysia. Bioplus Life Corp. (US), incorporated in United State of Nevada, is an investment holding company with 100% equity interest in Bioplus Life Corp. (Labuan), a company incorporated in Labuan, which subsequent hold 100% equity interest in Bioplus Life International Holdings Limited, a company incorporated in Hong Kong, which subsequent hold 99.8% equity interest in Bio Life Holdings Berhad, a company incorporated in Malaysia, which subsequent hold 100% equity interest in Bio Life Neutraceuticals Sdn Bhd. On December 31, 2017, Bioplus Life Corp was organized to be holding company parent to, and succeed to the operations of, Bioplus Life Corp. (Labuan), Bioplus Life International Holdings Ltd, Bio Life Holdings Berhad and Bio Life Neutraceuticals Sdn Bhd.\nDuring the previous financial year, the group disposed off and de-registered its subsidiaries namely Bioplus Life International Holdings Ltd. and Bio Life Neutraceuticals (Shenzhen) Pty Ltd. on August 5, 2020 and September 4, 2020, respectively.\nThe Company, through its subsidiaries mainly an investment holding and supplies high quality health products. Details of the Companys subsidiaries:\nSCHEDULE OF SUBSIDIARIES DETAILS\nNo Company Name Place/Date of Incorporation Particulars of Issued Capital Principal Activities\nBioplus Life Corp. (Labuan) Malaysia, Labuan\nMay 19, 2017\nshares of\nordinary shares of US$1 each\nInvestment Holding\nBioplus Life International Holdings Ltd. (1) Hong Kong\nJune 20, 2017\nshares of ordinary shares\nof HK$1 each\nInvestment Holding\nBio Life Holdings Berhad Malaysia\nMay 19, 2016\n107,992 shares of ordinary shares of RM1 each\nInvestment Holding\nBio Life Neutraceuticals Sdn Bhd Malaysia, Selangor\nAugust 27, 2009\n5,456,207 shares of ordinary shares of RM1 each Trading of Consumer Products\nBio Life Neutraceuticals (Shenzhen) Pty Ltd. (2) Shenzhen\nOctober 10, 2017\n500,000 shares of ordinary shares of RMB1 each Trading of Healthy Supplement and Cosmetic Products\n(1) Bioplus Life International Holdings Ltd. was officially disposed off by the Group on August 5, 2020 at a consideration of USD 17,504. The restructuring results in gain on disposal of subsidiary as disclosed in Consolidated Statements of Operations and Comprehensive Income.\n(2) Bio Life Neutraceuticals (Shenzhen) Pty Ltd. was being officially de-registered in Shenzhen on September 4, 2020.\n2. SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\n● Basis of presentation\nThese accompanying financial statements have been prepared in accordance with generally accepted accounting principles in the United States of America (US GAAP).\n● Basis of consolidation\nIn this Annual Report, the Company, us or we refer to the consolidated entity, including its subsidiaries and affiliates. The terms refer only to the publicly held holding company, The Bioplus Life Corporation, excluding its subsidiaries and affiliates. Furthermore, in which the Company has a variable interest have been consolidated where the Company is the primary beneficiary. All intercompany transactions and balances have been eliminated in consolidation.\n● Use of estimates\nIn preparing these financial statements, management makes estimates and assumptions that affect the reported amounts of assets and liabilities in the balance sheets and revenues and expenses during the years reported. Actual results may differ from these estimates.\n● Cash and cash equivalents\nCash and cash equivalents represent cash on hand, demand deposits placed with banks or other financial institutions and all highly liquid investments with an original maturity of three months or less as of the purchase date of such investments.\n● Property, plant and equipment\nProperty and plant and equipment are stated at cost less accumulated depreciation and accumulated impairment losses, if any. Depreciation is calculated on the straight-line basis to write off the cost over the following expected useful lives of the assets concerned. The principal annual rates used are as follows:\nSCHEDULE OF PROPERTY PLANT AND EQUIPMENT USEFUL LIVES OF THE ASSETS\nCategories Principal Annual Rates/Expected Useful Life\nComputer hardware 20%\nFurniture and fittings 10%\nHandphone 20%\nLandscape 20%\nLeasehold land and building 99 years\nMachinery 10%\nMotor vehicle 20%\nOffice equipment 10%\nRenovation 20%\nSignboard 10%\nTools and equipment 10%\nKitchen utensils 10%\nProperty and equipment principal annual rates 10%\nFully depreciated plant and equipment are retained in the financial statements until they are no longer in use.\n● Intangible assets\nIntangible assets are stated at cost less accumulated amortization. Intangible assets represented the registration costs of trademarks, which are amortized on a straight-line basis over a useful life.\nThe Company follows ASC Topic 350 in accounting for intangible assets, which requires impairment losses to be recorded when indicators of impairment are present and the undiscounted cash flows estimated to be generated by the assets are less than the assets carrying amounts. There was no impairment losses recorded on intangible assets for the year ended December 31, 2021.\n● Inventories\nInventories consisting of products available for sell, are stated at the lower of cost or market value. Cost of inventory is determined using the first-in, first-out (FIFO) method. Inventory reserve is recorded to write down the cost of inventory to the estimated market value due to slow-moving merchandise and damaged goods, which is dependent upon factors such as historical and forecasted consumer demand, and promotional environment. The Company takes ownership, risks and rewards of the products purchased. Write downs are recorded in cost of revenues in the Condensed Statements of Operations and Comprehensive Income.\n● Revenue recognition\nRevenues are recognized when control of the promised goods or services are transferred to a customer, in an amount that reflects the consideration that the Company expects to receive in exchange for those goods or services. The Company applies the following five steps in order to determine the appropriate amount of revenue to be recognized as it fulfills its obligations under each of its agreements:\n● identify the contract with a customer;\n● identify the performance obligations in the contract;\n● determine the transaction price;\n● allocate the transaction price to performance obligations in the contract; and\n● recognize revenue as the performance obligation is satisfied.\n● Cost of revenues\nCost of revenue includes the purchase cost of retail goods for re-sale to customers and packing materials (such as boxes). It excludes purchasing and receiving costs, inspection costs, warehousing costs, internal transfer costs and other costs of distribution network in cost of revenues.\n● Shipping and handling fees\nShipping and handling fees, if billed to customers, are included in revenue. Shipping and handling fees associated with inbound and outbound freight are expensed as incurred and included in selling and distribution expenses.\n● Comprehensive income\nASC Topic 220, Comprehensive Income establishes standards for reporting and display of comprehensive income, its components and accumulated balances. Comprehensive income as defined includes all changes in equity during a period from non-owner sources. Accumulated other comprehensive income, as presented in the accompanying statements of stockholders equity consists of changes in unrealized gains and losses on foreign currency translation and cumulative net change in the fair value of available-for-sale investments held at the balance sheet date. This comprehensive income is not included in the computation of income tax expense or benefit.\n● Income tax expense\nIncome taxes are determined in accordance with the provisions of ASC Topic 740, Income Taxes (ASC Topic 740). Under this method, deferred tax assets and liabilities are recognized for the future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax basis. Deferred tax assets and liabilities are measured using enacted income tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. Any effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date.\nASC 740 prescribes a comprehensive model for how companies should recognize, measure, present, and disclosed in their financial statements uncertain tax positions taken or expected to be taken on a tax return. Under ASC 740, tax positions must initially be recognized in the financial statements when it is more likely than not the position will be sustained upon examination by the tax authorities. Such tax positions must initially and subsequently be measured as the largest amount of tax benefit that has a greater than 50% likelihood of being realized upon ultimate settlement with the tax authority assuming full knowledge of the position and relevant facts.\nThe Company conducts major businesses in Malaysia and is subject to tax in their own jurisdictions. As a result of its business activities, the Company will file separate tax returns that are subject to examination by the foreign tax authorities.\n● Foreign currencies translation\nTransactions denominated in currencies other than the functional currency are translated into the functional currency at the exchange rates prevailing at the dates of the transaction. Monetary assets and liabilities denominated in currencies other than the functional currency are translated into the functional currency using the applicable exchange rates at the balance sheet dates. The resulting exchange differences are recorded in the statement of operations.\nThe functional currency of the Company is the United States Dollars (US$) and the accompanying financial statements have been expressed in US$. In addition, the subsidiaries maintain its books and records in a local currency, Malaysian Ringgit (MYR or RM), Hong Kong Dollars (HKD) and Renminbi (RMB), which are functional currencies as being the primary currencies of the economic environment in which respective entity operates.\n● Foreign currencies translation (continued)\nIn general, for consolidation purposes, assets and liabilities of its subsidiaries whose functional currency is not US$ are translated into US$, in accordance with ASC Topic 830-30, Translation of Financial Statement, using the exchange rate on the balance sheet date. Revenues and expenses are translated at average rates prevailing during the period. The gains and losses resulting from translation of financial statements of foreign subsidiary are recorded as a separate component of accumulated other comprehensive income.\nTranslation of amounts from the local currency of the Company into US$1 has been made at the following exchange rates for the respective years:\nSCHEDULE OF EXCHANGE RATES\nAs of and for the year ended\nDecember 31,\nYear-end MYR : US$1 exchange rate 4.1760 4.0130\nYearly average MYR : US$1 exchange rate 4.1454 4.2016\nYear-end US$1 : RMB exchange rate 0.1569 0.1533\nYearly average US$1 : RMB exchange rate 0.1550 0.1450\nExchange rate\n● Related parties\nParties, which can be a corporation or individual, are considered to be related if the Company has the ability, directly or indirectly, to control the other party or exercise significant influence over the other party in making financial and operating decisions. Companies are also considered to be related if they are subject to common control or common significant influence.\n● Fair value of financial instruments\nThe carrying value of the Companys financial instruments: cash and cash equivalents, trade receivable, deposits and other receivables, amount due to related parties and other payables approximate at their fair values because of the short-term nature of these financial instruments.\nThe Company also follows the guidance of the ASC Topic 820-10, Fair Value Measurements and Disclosures (ASC 820-10), with respect to financial assets and liabilities that are measured at fair value. ASC 820-10 establishes a three-tier fair value hierarchy that prioritizes the inputs used in measuring fair value as follows:\n● Level 1 : Observable inputs such as quoted prices in active markets;\n● Level 2 : Inputs, other than the quoted prices in active markets, that are observable either directly or indirectly; and\n● Level 3 : Unobservable inputs in which there is little or no market data, which require the reporting entity to develop its own assumptions\nAs of December 31, 2021, and December 31, 2020, the Company did not have any non financial assets and liabilities that are recognized or disclosed at fair value in the financial statements, at least annually, on a recurring basis, nor did the Company have any assets or liabilities measured at fair value on a non-recurring basis.\n● Lease\nThe Company adopted the ASU No. 2016-02, on August 7, 2020. The Company recognizes lease payments on a straight-line basis over the lease term.\nAs of December 31, 2021, the Company has one operating lease of which lease liability is initially and subsequently measured at the present value of the unpaid lease payments at the lease commencement date. The right-of-use asset is initially measured at cost, which comprises the initial amount of the lease liability adjusted for lease payments made at or before the lease commencement date, plus any initial direct costs incurred less any lease incentives received. Costs associated with operating lease assets are recognized on a straight-line basis within operating expenses over the term of the lease.\nIn determining the present value of the unpaid lease payments, ASC 842 requires a lessee to discount its unpaid lease payments using the interest rate implicit in the lease or, if that rate cannot be readily determined, its incremental borrowing rate. As the Companys lease does not provide an implicit rate, the Company uses its incremental borrowing rate as the discount rate for the lease. The Company incremental borrowing rate is estimated to approximate the interest rate on a collateralized basis with similar terms and payments.\n● Recent accounting pronouncements\nOther recent accounting pronouncements issued by the FASB, including its Emerging Issues Task Force, the American Institute of Certified Public Accountants, and the Securities and Exchange Commission did not or are not believed by management to have a material impact on the Companys present or future financial statements.\n3. AMOUNT DUE FROM RELATED PARTIES\nThe amounts are unsecured, bear no interest and are payable on demand.\n4. INVENTORIES\nSCHEDULE OF INVENTORIES\nAs of December 31,\nRaw materials $ 317,928 $ 239,057\nPacking materials 77,946 85,562\nFinished goods 54,423 49,711\nTotal inventories 450,297 374,330\n5. OTHER RECEIVABLES, DEPOSITS AND PREPAYMENTS\nSUMMARY OF OTHER RECEIVABLES, DEPOSITS AND PREPAYMENTS\nAs of December 31,\nOther receivables\n$ 21,242 $ 22,950\nDeposits 5.1 30,475 8,041\nPrepayments\n12,628 10,689\nTotal other receivables, deposits and prepayments\n64,345 41,680\n5.1 Included in deposits is an amount of $7,155 (2020: $ 1,557) representing deposits paid for rental of hostels and various utilities and $10,729 (2020: NIL) representing deposits aid for the installation of solar PV system.\n6. PROPERTY, PLANT AND EQUIPMENT, NET\nProperty, plant and equipment consisted of the following:\nSCHEDULE OF PROPERTY, PLANT AND EQUIPMENT\nAs of December 31,\nComputer hardware $ 45,109 $ 42,430\nFurniture and fittings 131,501 117,343\nHandphone 6,578 5,070\nLandscape 3,691 3,691\nLeasehold land and building 1,875,962 1,875,962\nMachinery 222,105 206,544\nMotor vehicle 286,455 243,630\nOffice equipment 60,596 60,011\nRenovation 170,156 159,013\nSignboard 7,757 5,470\nTools and equipment 17,225 15,794\nKitchen utensils 2,004 2,004\nProperty, plant and equipment, gross $ 2,829,139 $ 2,736,962\n(Less): Accumulated depreciation (588,118 ) (448,829 )\nAdd/(Less): Foreign translation difference (50,257 ) 43,202\nProperty, plant and equipment, net $ 2,190,764 $ 2,331,335\nDepreciation expense for the year ended December 31, 2021 and December 31, 2020 were $140,426 and $129,443, respectively.\nAs of December 31, 2021, and December 31, 2020 the motor vehicles under finance leases with carrying value of $75,981 and $85,974, respectively.\nThe leasehold land and building with carrying amount of $1,763,432 (2020: $1,817,013) have been charged to licensed bank to secure banking facilities granted to the Company.\n7. INTANGIBLE ASSETS, NET\nIntangible assets consisted of the following:\nSCHEDULE OF INTANGIBLE ASSETS\nDecember 31, 2021 December 31, 2020\nTrademark $ 682 $ -\n8. OBLIGATION UNDER FINANCE LEASE\nThe Company purchased motor vehicles under finance lease agreements with the effective interest rate of 4.26% - 5.36% per annum (2020: 4.40% - 5.28% per annum), with principal and interest payable monthly. The obligation under the finance leases are as follows:\nSCHEDULE OF OBLIGATION UNDER FINANCE LEASE\nAs of December 31,\nPresent value of finance liabilities: $ $\nNot later than one year 37,025 33,817\nLater than one year but not later than two years 36,687 35,535\nLater than two years but not later than five years 36,521 46,446\nPresent value of finance liabilities 110,233 115,798\nAnalyzed as: $ $\nCurrent portion 37,025 33,817\nNon-current portion 73,208 81,981\nLease liability 110,233 115,798\n9. BANK BORROWINGS\nSCHEDULE OF BANK BORROWINGS\nAs of December 31,\nSecured: - $ $\nTerm loan 575,115 615,762\nBank borrowings 575,115 615,762\nAnalyzed as: $ $\nCurrent portion 52,167 54,567\nNon-current portion 522,948 561,195\nBank borrowings 575,115 615,762\nThe term loan of the Company is secured by way of the following:\na. A Facilities Agreement for US$1,705,086;\nb. Master Facility Agreement.\nc. Joint and Several Guarantee to be executed by the subsidiary directors of Bio Life Neutraceuticals Sdn Bhd.\nd. Leasehold land and building of the subsidiary (Note 6)\nThe term loan is payable by 240 monthly installments of US$4,492 each including interest, commencing from October 10, 2016 and subject to interest at Base Financing Rate + 4% per annum or 10% per annum, whichever is higher.\n10. LEASE RIGHT-OF-USE ASSET AND LEASE LIABILITIES\nThe Company officially adopted ASC 842 for the period on and after January 1, 2020 as permitted by ASU 2016-02. ASC 842 originally required all entities to use a modified retrospective transition approach that is intended to maximize comparability and be less complex than a full retrospective approach. On July 30, 2018, the FASB issued ASU 2018-11 to provide entities with relief from the costs of implementing certain aspects of the new leasing standard, ASU 2016-02 of which permits entities may elect not to recast the comparative periods presented when transitioning to ASC 842. As permitted by ASU 2018-11, the Company elect not to recast comparative periods, thusly.\nAs of August 7, 2020, the Company recognized approximately US$43,692, lease liability as well as right-of-use asset for all leases (with the exception of short-term leases) at the commencement date. Initial lease liabilities are measured at present value of the sum of remaining rental payments as of August 1, 2020, with discounted rate of 5.40% adopted from Malayan Banking (Maybank) Berhads base lending rate as a reference for discount rate, as this bank is the largest bank and national bank of Malaysia.\nA single lease cost is recognized over the lease term on a generally straight-line basis. All cash payments of operating lease cost are classified within operating activities in the statement of cash flows.\nThe initial recognition of operating lease right and lease liability as follow:\nSCHEDULE OF OPERATING LEASE RIGHT AND LEASE LIABILITY\nGross lease payable $ 52,330\nLess: imputed interest (8,638 )\nInitial recognition as of August 7, 2020 43,692\nAdditional lease during the year -\nGross lease payable as of December 31, 2020 43,692\nAs of December 31, 2021, operating lease right of use asset as follows:\nGross lease payables as of January 1, 2021 $ 41,527\nAmortisation for the year (5,227 )\nForeign translation difference (1,582 )\nBalance as at December 31, 2021 34,718\nAs of December 31, 2021, operating lease liabilities as follow:\nGross lease as of January 1, 2021 $ 41,527\nLess: Gross repayment for the year ended December 31, 2021 (7,237 )\nAdd: Imputed interest for the year ended December 31, 2021 2,010\nForeign translation difference (1,582 )\nBalance as of December 31, 2021 34,718\nLess: Lease liability current portion (5,476 )\nLease liability non-current portion 29,242\nFor the year ended December 31, 2021, the amortisation of the operating lease right of use assets amounted $5,227.\nMaturities of operating lease obligation as follow:\nSCHEDULE OF MATURITIES OF OPERATING LEASE OBLIGATION\nYear ending\nDecember 31, 2022 $ 5,476\nDecember 31, 2023 5,778\nDecember 31, 2024 6,098\nDecember 31, 2025 6,437\nDecember 31, 2026 6,793\nDecember 31, 2027 4,136\nTotal 34,718\n10. LEASE RIGHT-OF-USE ASSET AND LEASE LIABILITIES\nSCHEDULE OF MEASUREMENT OF LEASE LIABILITIES\nCash paid for amounts included in the measurement of lease liabilities:\nOperating cash flow to operating lease $ 7,237\nRight-of-use assets obtained in exchange for operating lease 43,692\nRemaining lease term for operating lease (years) 5.6\nWeighted average discount rate for operating lease 5.40 %\n11. OTHER PAYABLES AND ACCRUED LIABILITIES\nSCHEDULE OF OTHER PAYABLES AND ACCRUED LIABILITIES\nAs of December 31,\nOther payables generated from: $ $\nLocal 35,286\nForeign, representing:\nMalaysia\nCommon outstanding from non-trade payable 28,142 99,524\nCommon outstanding from third parties -\nOther payables 28,425 135,721\nAccrued other expenses\nLocal 37,000 1,750\nForeign, representing:\nMalaysia\nPayroll 28,196 63,763\nPayroll deduction 11,261 32,044\nProfessional Fee 5,034 3,243\nCommission 8,823 5,137\nExpenses 2,763 5,772\nAccrued other expenses 56,077 109,959\nDeposit received from customers 253,353 230,493\nShare subscription receipts in advance 102,000 110,000\nTotal 476,855 587,923\n12. AMOUNT DUE TO DIRECTORS\nThe amounts are unsecured, bear no interest and are payable on demand.\n13. INCOME TAXES\nSCHEDULE OF PROFIT OR LOSS BEFORE INCOME TAX\nFor the years ended December 31,\nTax jurisdictions from:\nLocal $ (114,063 ) $ (129,862 )\nForeign, representing:\nMalaysia 406,562 465,650\nHong Kong - (17,775 )\nChina - (1,071 )\nProfit before income tax $ 292,499 $ 316,942\nThe provision for income taxes consisted of the following:\nSCHEDULE OF PROVISION FOR INCOME TAX\nFor the years ended December 31,\nTax expense - Current\nForeign, representing:\nMalaysia 118,425 124,542\nTax expense - Prior year\nForeign, representing:\nMalaysia (8,495 ) -\nDeferred\nForeign, representing:\nMalaysia 11,836 (21,794 )\nIncome tax (expenses) $ 121,766 $ 102,748\nThe effective tax rate in the periods presented is the result of the mix of income earned in various tax jurisdictions that apply a broad range of income tax rates. The Company has subsidiaries that operate in various countries: United States, Hong Kong and Malaysia that are subject to taxes in the jurisdictions in which they operate, as follows:\nUnited States of America\nThe Company is registered in the State of Nevada and is subject to the tax laws of the United States of America. As of December 31, 2021, the operations in the United States of America incurred $646,899 (2020: $532,836) of cumulative net operating losses which can be carried forward to offset future taxable income. The net operating loss carry forwards begin to expire in 2041 (2020: 2040), if unutilized. The Company has provided for a full valuation allowance of $135,849 (2020: $111,896) against the deferred tax assets on the expected future tax benefits from the net operating loss carry forwards as the management believes it is more likely than not that these assets will not be realized in the future.\nMalaysia\nBio Life Holdings Berhad (BLHB) and Bio Life Neutraceuticals Sdn Bhd (BLNSB) are subject to the Malaysia Corporate Tax Laws at a tax rate of 24% on the assessable income for its tax year. A reconciliation of income (loss) before income taxes to the effective tax rate as follows:\nSCHEDULE OF RECONCILIATION OF INCOME (LOSS)\nFor the years ended December 31,\nProfit before taxation 406,562 465,650\nTax at applicable tax rate of 24% (2020: 24%) 97,575 111,756\nExpenses not deductible for tax purposes 18,825 16,099\nDeferred tax assets not recognised 2,025 -\nOver provision of current taxation in respect of prior year (8,495 ) -\nUnder/(Over) provision of deferred taxation in respect of prior year 11,836 (25,107 )\nIncome tax expenses 121,766 102,748\nHong Kong\nBioplus Life International Holdings Ltd is subject to Hong Kong Profits Tax, which is charged at the statutory income tax rate of 16.5% on its assessable income. During the previous financial year, the Group disposed off this subsidiary on August 5, 2020, hence it was consolidated up to period then ended.\nChina\nThe Company is registered in the Shen Zhen and is subject to the China Corporate Tax, which is charged at the statutory income tax rate of 25% on its assessable income. During the previous financial year, the Group de-registered this subsidiary on September 4, 2020, hence it was consolidated up to period then ended.\nThe following table sets forth the significant components of the aggregate deferred tax assets/(liabilities) of the Company as of December 31, 2021 and December 31, 2020:\nSCHEDULE OF DEFERRED TAX ASSETS\nAs of\nDecember 31, 2021 December 31, 2020\nDeferred tax assets/(liabilities): $ $\nNet operating loss carry forwards\nLocal 135,849 111,896\nForeign\n- Malaysia (31,600 ) (20,657 )\n- China - -\n- Hong Kong - -\n- Foreign - -\nTotal 104,249 91,239\nLess: valuation allowance (135,849 ) (111,896 )\nDeferred tax liabilities $ (31,600 ) $ (20,657 )\n14. STOCKHOLDERS EQUITY\nDuring the fiscal year, the Company cancelled 760,714 units of common stock in line with the reduction of $76 and $185,439 in common stock and additional paid in capital, respectively.\nDuring the previous financial year ended December 31, 2020, the Company issued additional 3,600,000 units of common stock representing 0.992% of enlarged issued and outstanding common stock of the Company for working capital purposes.\nAs of December 31, 2021, Bioplus Life Corp had an issued and outstanding share of common stock of 362,144,847.\n15. CONCENTRATION OF RISK\n(a) Major Customers\nFor the year ended December 31, 2021 and 2020, the customers who accounted for 10% or more of the Companys revenues are presented as follows:\nSCHEDULE OF CONCENTRATION RISK BY MAJOR CUSTOMER AND MAJOR SUPPLIERS\nRevenues Percentage of revenues Account Receivable, Trade\n2020\nCustomer A $ - $ 363,940 - 10 % $ - $ 75,233\nCustomer B - 658,288 - 19 % - 286,079\nCustomer C - 938,216 - 26 % - -\n$ - $ 1,960,444 - 55 % $ - $ 361,312\n(b) Major Suppliers\nFor the year ended December 31, 2021 and 2020, the suppliers who accounted for 10% or more of the Companys purchases are presented as follows:\nPurchases Percentage of purchases Account Payable, Trade\n2020\nSupplier A $ 720,982 $ 978,216 77 % 62 % $ 105,411 $ 167,351\nSupplier B - 303,034 - 19 % - -\n$ 720,982 $ 1,281,250 77 % 81 % $ 105,411 $ 167,351\n16. OTHER INCOME\nSCHEDULE OF OTHER INCOME\nFor the years ended December 31,\nOther income 12,304 7,153\nRental income 15,921 -\nRealized gain on foreign exchange 1,581 11,510\nGain on disposal of motor vehicle $ 714 $ -\nTotal 30,520 18,663\n17. RELATED PARTIES TRANSACTIONS\nSCHEDULE OF RELATED PARTIES TRANSACTIONS\nFor the years ended December 31,\nTransactions with company in which a shareholder has substantial financial interest:\nRental income from: $ $\nFusion Nutri Sdn. Bhd. 10,131 -\nTotal Life Renew (M) Sdn. Bhd 5,790 -\nRental Income 15,921 -\nChong Khooi You, our sole officer and director and controlling shareholder is a director or controlling equity owner of the above companies.\nSCHEDULE OF RELATED PARTIES TRANSACTIONS RENTAL EXPENSES\nRental expenses: $ $\nPhang Lai Sim 7,237 2,975\nRental expenses 7,237 2,975\nPhang Lai Sim is the spouse of Chong Khooi You, our sole office and director.\n18. FOREIGN CURRENCY EXCHANGE RATE\nThe Company cannot guarantee that the current exchange rate will remain stable, therefore there is a possibility that the Company could post the same amount of income for two comparable periods and because of the fluctuating exchange rate post higher or lower income depending on exchange rate converted into US$ at the end of the financial year. The exchange rate could fluctuate depending on changes in political and economic environments without notice.\n19. SUBSEQUENT EVENTS\nIn accordance with ASC Topic 855, Subsequent Events, which establishes general standards of accounting for and disclosure of events that occur after the balance sheet date but before financial statements are issued, the Company has evaluated all events or transactions that occurred after December 31, 2021 up through the date November 28, 2022 was the Company presented these audited consolidated financial statements. During the period, the Company did not have any material recognizable subsequent events except for subsequent to balance sheet date, the Company issued additional 127,500 units of common stock representing 0.035% of enlarged issued and outstanding common stock of the Company.\n20. SIGNIFICANT EVENTS\n(i) During the fiscal year, the Company cancelled 760,714 units of common stock in line with the reduction of $76 and $185,439 in common stock and additional paid in capital, respectively.\n(ii) During the fiscal year, the World Health Organization (WHO) declared the Coronavirus (COVID-19) outbreak to be a pandemic, which has caused severe global social and economic disruptions and uncertainties, including markets where the Company operates.\nThe Company considers this outbreak as non-adjusting-events. The consequences brought about by COVID-19 continue to evolve and whilst the Company actively monitoring and managing its operations to respond to these changes, the Company does not consider it practicable to provide any quantitative estimate on the potential impact it may have on the Company.\n21. SEGMENTED INFORMATION\nASC 280, Segment Reporting establishes standards for reporting information about operating segments on a basis consistent with the Companys internal organization structure as well as information about services categories, business segments and major customers in financial statements. In accordance with the Segment Reporting Topic of the ASC, the Companys chief operating decision maker has been identified as the Chief Executive Officer and President, who reviews operating results to make decisions about allocating resources and assessing performance for the entire Company. Existing guidance, which is based on a management approach to segment reporting, establishes requirements to report selected segment information quarterly and to report annually entity-wide disclosures about products and services, major customers, and the countries in which the entity holds material assets and reports revenue. All material operating units qualify for aggregation under Segment Reporting due to their similar customer base and similarities in economic characteristics; nature of products and services; and procurement, manufacturing and distribution processes.\nThe Company had no inter-segment sales for the periods presented. Summarized financial information concerning the Companys reportable segments is shown as below:\nSCHEDULE OF SEGMENT REPORTING INFORMATION\nBy Geography*:\nFor the year ended December 31, 2021\nUnited States Hong Kong Shenzhen Malaysia Total\nRevenues $ - $ - $ - $ 2,547,216 $ 2,547,216\nCost of revenues - - - (1,234,379 ) (1,234,379 )\nDepreciation and amortization - - - (145,653 ) (145,653 )\nNet profit before taxation (114,063 ) - - 406,562 292,499\nTotal assets $ - $ - $ - $ 3,380,700 $ 3,380,700\nFor the year ended December 31, 2020\nUnited States Hong Kong Shenzhen Malaysia Total\nRevenues $ - $ - $ - $ 3,549,313 $ 3,549,313\nCost of revenues - - - (2,178,491 ) (2,178,491 )\nDepreciation and amortization - - - (131,511 ) (131,511 )\nNet profit before taxation (129,862 ) (17,775 ) (1,071 ) 465,650 316,942\nTotal assets $ - $ - $ - $ 3,769,186 $ 3,769,186"
}