{
    "cik": "1746119",
    "company": "MU GLOBAL HOLDING Ltd",
    "filing_type": "10-K",
    "filing_date": "2022-10-31",
    "period_of_report": "2022-07-31",
    "sic": "7200",
    "state_of_inc": "NV",
    "state_location": "F5",
    "fiscal_year_end": "0731",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1746119/0001493152-22-029911-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1746119/000149315222029911/form10-k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1746119/0001493152-22-029911.txt",
    "filename": "1746119_10K_2022_0001493152-22-029911.htm",
    "content": "ITEM 1. BUSINESS\nCorporate History\nMU Global Holding Limited, a Nevada corporation (the company) was incorporated under the laws of the State of Nevada on June 4, 2018.\nMU Global Holding Limited, the US Company, operates through its wholly owned subsidiary, MU Worldwide Group Limited, a Seychelles Company; which operates through its wholly owned subsidiary, MU Global Holding Limited, a Hong Kong Company; which operates through its wholly owned subsidiary, MU Global Health Management (Shanghai) Limited, a Shanghai Company.\nMU Global Holding Limited is an early-stage wellness and beauty supply services company, which intends to offer customers a wide range of trusted non-surgical spa services and quality spa care products. All of the previous entities share the same exact business plan with the goal of developing and providing wellness and beauty services to our future clients. We aim to promote improved overall health and beauty in our clients through a holistic detoxification method.\nThe Company, through its subsidiaries, mainly supplies high quality spa services and spa care products. Details of the Companys subsidiaries:\nCompany name Place and date\nof incorporation\nParticulars of issued capital Principal activities Proportional of ownership interest and voting power held\n1. MU Worldwide Group Limited Seychelles,\nJune 7, 2018 100 shares of ordinary share of US$1 each Investment holding 100 %\n2. MU Global Holding Limited Hong Kong,\nJanuary 30, 2018 1 share of ordinary share of HK$1 each Providing SPA and Wellness service in Hong Kong 100 %\n3. MU Global Health Management Shanghai,\nAugust 16, 2018 RMB 7,400,300 Providing SPA and Wellness service in China 100 %\nBusiness Overview\nMU Global is a beauty and wellness company, providing SPA and wellness service and also SPA related products to the customers. The services provided are designed to improve the overall health system and body function.\nSince our establishment, the Company has been focusing to expand in the Chinese market, with other country also under consideration as target destinations. As an emerging industry in China, the beauty and wellness industry is still in the early stage there is a huge potential for the industry to growth significantly.\nIn year 2020, COVID-19 crisis has resulted the sales of the global beauty and wellness industry weak due to consumers have had limited access to retail outlets and supply chain bottlenecks have reduced product availability. In China, the industrys sales fell up to 80 percent compared with 2019. Nevertheless, based on Mckinsey and Company research report on April 8, 2021, shows that consumers care deeply about wellness-and that their interest is growing and the global wellness market is estimated at more than US$1.5 trillion, with annual growth of 5 to 10 percent. A rise in both consumer interest and purchasing power presents tremendous opportunities for companies, particularly as spending on personal wellness rebounds after stagnating or even declining during the COVID-19 crisis\nChina has large territory, population, diverse ethnicity and cultural background. As such, it has resulted in different consumer orientations in different cities and townships across the country, therefore, it is particularly challenging to tackle the consumer market with a single business model.\nThe advance in technological development and rise in use of technology in marketing has also intensified the competition, probing the Company to develop the business models that allow quick penetration and huge coverage of different markets, and also being able to cope with the swift changes in the consumer market. Thus, the Company is focusing on three key areas as part of the Companys early development in the Chinese market.\nThe first and most key focus is to enter the regional market through the adoption of franchisee and agent model, which the other parties are familiar and have deep understanding in the local market, hence its operating strategy is effective and best suited the targeted region.\nSecond, the key strategy is to ensure rapid development of the Omni channel marketing plan which targets to lease out at least ten thousand Stone Spa Bed (Hot Stone Bath equipment), reducing the time cost for the development of project, and most importantly, working on to spur sales and revenue growth.\nLastly, the essential requirement for business success in the Chinese market is to ensure and maintain a clear and transparent business model, which would result in effective collaboration between the company and its agent/franchisee, and consequently leads to efficient market operation and a win-win situation between the two parties.\nCurrently, the Company operates in the Chinese market with three business models:\n1. Tripartite co-operation and profit sharing model (deployment of stone spa bed & franchise)\n2. Large-scale chain agent model (deployment of stone spa bed)\n3.\nDirect- service store model\nOur Service\nDAY MORE STONE THERAPHY\n1. Bedrock Bathing/ Hot Stone Bath\nBedrock Bathing is a method of keeping the body in shape that involves bathers lying down on a heated slab of rocks embedded on a spa treatment bed without using hot water wearing indoor clothing. The original name for this hot stone bathing is ‘Ganbanyoku, and it is originated from Japan as the term for a popular form of hot stone or bedrock spa. It is also referred to as stone-bathing, but there is no actual bathing or water involved.\nIt is our belief that the effects of bedrock bathing are numerous and both aesthetic and metabolic. Furthermore, the rocks selected for this treatment are believed to provide many health benefits when they are heated. The five stones we intend to use are: Black Silica Stone, Radium Stone, Far Infrared Stone, Negative Ion Stone and Beitou Stone. The average time taken for each therapy is approximately 30 minutes.\nThe Company believes that bedrock bathing treatments will assist in the elimination of suboptimal health conditions caused by polluted environments, unhealthy dietary intake, and unhealthy lifestyles. The detoxification process will improve general bodily function and immune system, promote blood circulation, and yield visible skin improvement. The treatment is also believed to improve basal metabolism, resulting in more efficient energy utilization within the body, hence sustainable weight loss to a desirable level. Prolonged proper treatments have also been linked to miscellaneous anti-aging benefits.\nOur pricing strategy offers great flexibility to our customers to opt for the service they desire which is also within their budget. In order to ensure flexibility, the Company has divided the service into three different tiers, each with different pricing strategy: Flagship, Luxury and Refined. Under the three tiers model, Flagship branch and will be the top tier and will target high-end segment with premium pricing packages. Luxury branch is designed to attract middle class individuals. Refined branch on the other side, will aim to attract customer with lower budget, but would still like to enjoy the service.\nThe Company started offering bedrock bathing services in the Shanghai outlet in January 2019. Different service packages are designed for each tier of service, which include option for subscription-based treatments, and pay per services. The packages offer customers either the option of purchasing our treatments at a discounted price if they purchase in bundle, or they can pay for the service every time they use at normal price. The bundle comprises of 3 different number of visits per bundle i.e., 10 times visit package, 20 times visit package, and 30 times visit package. We have also implemented a member database for our bedrock bathing centre. Customers can join our membership at an attracting fee to enjoy the services provided at member price. In addition to that, the Company also allows customers to purchase the services package via online and WeChat.\n2. Quartz Therapy\nChakras is within and parts of the human body that connects with the environment. If chakra is blocked or overactive, we lose balance of our physical and mental balance and in turn, it affects the physical and mental well-being.\nQuarts have the therapeutic effect of enabling Chakras to regain its balance. Thus, the therapy has the benefit of body cleansing, restoring good health and also spirit.\nOur Product\nNVB Scent Diffuser\nThe negative oxygen ions essential oil diffuser distributes cold-sprayed essential oil particle to balance oxygen and negative ions in the air. The negative ions eliminate particles, and its called the vitamin in the air. The essential oil diffuser can purify air quality, and provide a natural aroma that relax the body. The essential oil diffuser has integrated the technology of Never BAC anti-bacterial that provides the effect of purification, anti-bacterial, second-hand smoke elimination, and deodorization.\nMini Water Purifier\nThe mini water purifier integrates advanced pressurization technology and filtering materials, which allow instant purification of water and the removal of excess chlorine in water. The multi-layer filtration process of the purifier ensures water conservation and also stabilizes water pressure at the same time. Most importantly, the purifier can effectively remove heavy metals and impurity associated with old pipelines.\nTrademarks\nThe Company owned several trademarks registered under its subsidiaries in respective jurisdictions of which the subsidiaries operate in. Currently, the Company is also applying for trademarks in other jurisdictions it intends to expand its operation into.\nCategory\nRegistration Number\nTrade Marks Logo\nOwnership\nCountry\nEffective Date and Duration\nTrademark\n[Class 35]\nMU Global Holding Limited\nHong Kong\nJuly 12, 2019\nFor\nYears\nTrademark\n[Class 11,44]\nMU Global Holding Limited\nHong Kong\nJune 20, 2019\nFor 10 Years\nTrademark\nMU Global Health Management\nChina\nMay 14, 2015\nFor 10 Years\n[Class 3]\nTrademark\nMU Global Health Management\nChina\nMay 14, 2015\nFor 10 Years\n[Class 3]\nTrademark\nMU Global Health Management\nChina\nJuly 14, 2019\nFor 10 Years\n[Class 32]\nTrademark\nMU Global Health Management\nChina\nJuly 28, 2019\nFor 10 Years\n[Class 35]\nTrademark\nMU Global Health Management\nChina\nJuly 21, 2019\nFor 10 Years\n[Class 35]\nTrademark\nMU Global Health Management\nChina\nJuly 14, 2019\nFor 10 Years\n[Class 44]\nTrademark\nMU Global Health Management\nChina\nJuly 21, 2019\nFor 10 Years\n[Class 10]\nTrademark\nMU Global Health Management\nChina\nFebruary 7, 2020\nFor 10 Years\n[Class 10]\nTrademark\nMU Global Health Management\nChina\nJanuary 14, 2020\nFor 10 years\n[Class 20]\nTrademark\nMU Global Health Management\nChina\nJanuary 14, 2020\nFor 10 years\n[Class 20]\nTrademark\nMU Global Health Management\nChina\nFebruary 21, 2020\nFor 10 years\n[Class 35]\nTrademark\nMU Global Health Management\nChina\nJanuary 14, 2020\nFor 10 years\n[Class 44]\nTrademark\nMU Global Health Management\nChina\nJanuary 14, 2020\nFor 10 years\n[Class 03]\nTrademark\n40201907290T\nMU Global Holding Limited\nSingapore\nApril 4, 2019\nFor 10 years\n[Class 03]\nTrademark\nMU Global Holding Limited\nSaudi Arabia\nJuly 31, 2019 to April 11, 2029\n[Class 44]\nTrademark\nMU Global Holding Limited\nSaudi Arabia\nJuly 30, 2019 to April 10, 2029\n[Class 11]\nTrademark\nMU Global Holding Limited\nSaudi Arabia\nJuly 30, 2019 to April 10, 2029\n[Class 03]\nTrademark\nMU Global Holding Limited\nUnited Arab Emirates\nJuly 25, 2019\nFor 10 years\n[Class 44]\nTrademark\nMU Global Holding Limited\nUnited Arab Emirates\nJuly 25, 2019\nFor 10 years\n[Class 11]\nTrademark\nMU Global Holding Limited\nUnited Arab Emirates\nJuly 25, 2019\nFor 10 years\n[Class 35]\nTrademark\nMU Global Holding Limited\nHong Kong\nDecember 14, 2018\nFor 10 years\nPatent\nOn September 4, 2019, our subsidiary, MU Global Health Management (Shanghai) Limited made 5 patent applications to China National Intellectual Property Administration (CNIPA) in regards to stone spa bed thermostatic control setting. On May 5, 2020, CNIPA officially granted one patent to MU Global Health Management (Shanghai) Limited for a duration period of 10 years, with an effective date from September 4, 2019. In the year ended July 31, 2021, CNIPA officially granted another four patents to MU Global Health Management (Shanghai) Limited for a duration period of 10 years, with an effective date from September 4, 2019. On June 22 2021, Intellectual Property Office of Singapore officially granted one invention patent to MU Global Holding Limited (HK) for a duration period of 20 years, with an effective date from September 11, 2019.\nCategory\nRegistration Number\nThermostatic Control Setting Plan\nOwnership\nCountry\nEffective Date and Duration\nPatent\nZL 2019 2 1458259.5\nMU Global Health Management\nChina\nMay 5, 2020\nFor\nYears\nPatent\nZL 2019 2 1474367.1\nMU Global Health Management\nChina\nAugust 21, 2020\nFor\nYears\nPatent\nZL 2019 2 1462066. 7\nMU Global Health Management\nChina\nAugust 28, 2020\nFor\nYears\nPatent\nZL 2019 2 1458272.0\nMU Global Health Management\nChina\nSeptember 29, 2020\nFor\nYears\nPatent\nZL 2019 2 1458071.0\nMU Global Health Management\nChina\nDecember 15, 2020\nFor\nYears\nPatent\n10201908402Q\nMU Global Holding Limited (HK)\nSingapore\nJune 22, 2021\nFor\nYears (from September 11, 2019)\nThe setting displays a concept of thermostatic control for a stone spa bed, which includes a bed, a bed heating element, an energy part, a cover cabin, cover cabins opening/closing assembly, a thermostatic control device, and a thermostatic temperature adjustment device. Once the thermostatic temperature adjustment device sets the default temperature, the user can activate the bed heating element after lying down on the stone spa bed. Following the closure of the cover cabin, the bed heating element will start heating from the default temperature to the users ideal degree of temperature. Once the session completes, the thermostatic control device will reduce the heating efficiency to the default temperature in order to maintain the heat for the next session, which can largely reduce the heating time and electricity cost-saving.\nFuture Plan\nMarketing Campaign and Publicity Enhancement\nUnder the groups marketing development plan, the Company will implement actively the major projects launched by the group, including Omni channel marketing project and nationwide franchised program, which the Company aims to attract at least 1,000 franchised stores.\nSince the opening of outlet shop in Shanghai, the shop has initiated the Omni-channel marketing projects, aiming to penetrate the market, and it has built a stronghold with the franchised stores and agents in multiple provinces across the country, including Shanghai, Zhejiang, Jiangsu, Sichuan, Shandong, Shanxi, Henan and Guangdong province. The initial expansion of operation is based on the business model of profit sharing, and through this model, the Company has managed to expand the Hot Stone Bath therapy service into different health and wellness service provider outlets in different cities. The outlets span across different sub-segment of the health and wellness industry, which include beauty centre, post-maternity care centre, as well as high-end beauty salon. The Company targets to achieve the Omni-channel marketing projects by 2021, and the nationwide franchised program is expected to be achieved by 2023.\nIntelligent Marketing\nThe IT team in China has recently completed the development of Intelligent Health Evaluation Application System to provide support for the operation of Hot Stone Bath Therapy. Customers are now able to compare their health indicator through the mobile application and body fat measure device. The Company aims to build its own health indicator, recommend a personalized Hot Stone Bath therapy to the customers through the use of big data computation and analysis. By providing personalized service package, the Company believes it can effectively lead the consumers in making consuming decision, and consequently, the system will be upgraded to be a community marketing tool aiming to increase new customers flow and also retain existing customers.\nProduct Research and Development\nWhile the Company is seeking to expand the access to the China market, it is also actively promoting the research and development of products and technology. In addition to the introduction of new products, under the ongoing smart technology trend led by China, the business model of beauty and health industry has also experienced rapid changes in the emerging environment. Responding to changes in the business model in this industry, the information and intelligent technology has thus become the core competency in successfully managing large-scale change industries\nIn MU Global, the Company has numerous experts in information technology, thus equipping the company with the capability to support the business technology required in this fast-changing business environment, providing the essential tool to manage a large-scale chain remotely, and also lay the foundation for the success of the Omni-channel marketing project. As such, the Company will continuously strengthen the capability of information and intelligent technology as it will be the top priority of the Companys future development plan.\nInternational Expansion\nCurrently, we are actively engaging and negotiating with different parties in the Gulf countries (UAE, Bahrain, Saudi Arabia, Oman, Qatar, and Kuwait). The Company plans to enter the Middle-East market through the model of national agency and establish a long-term partnership with the local counterpart to develop and promote the Omni channel marketing project. At the same time, the Company has already established the national agency network in Malaysia and Singapore, and we are aiming to further expand to other countries in the Association of Southeast Asian Nations (ASEAN).\nHuman Resources and Talent Development\nTaking into consideration of aforementioned development, the Company is well aware that with existing man power is far from sufficient to materialization of future plan, thus investment in human resources and talent development is inevitable, including but it will not be limited to internal administrative and operation personnel, but also sales and marketing, accounting and finance, as well as top management personnel.\nCompetition\nThe beauty and wellness industry are highly competitive and fragmented, we might be in disadvantage competing with competitor who has greater reserve or has higher access to capital than the Company do to deploy in operations, capital expenditure, and marketing activities. We hope to maintain a competitive advantage by utilizing the knowledge and expertise of the Company in the industry and our beyond satisfactory customer service.\nCustomers\nFor the year ended July 31, 2022, the Company has generated revenue amounted to $46,702 from customers under the ordinary course of business. The revenue mainly represented direct sales to outlet shop customers, sales of products, and profit sharing amongst agents and franchised stores.\nEmployees\nAs of July 31, 2022, the Company has a total 4 employees. At the moment, the Company has adopted accountability system, hence management personnel have flexible working hours.\nOur sole director and Chief Executive Officer, Niu Yen-Yen and Chief Financial Officer currently work full-time and fully committed to the operation of the company.\nWe do not presently have pension, health, annuity, insurance, stock options, profit sharing, or similar benefit plans; however, we may adopt plans in the future. There are presently no personal benefits available to our Officers, Directors or employees.\nGovernment Regulation\nAt present, we are subject to the laws and regulations of the jurisdictions in which we operate, which may include business licensing requirements, income taxes and payroll taxes. In general, the development and operation of our business is not subject to special regulatory and supervisory requirements. ITEM 1A. RISK FACTORS\nWe are a smaller reporting company as defined by Rule 12b-2 of the Securities Exchange Act of 1934 and are not required to provide the information under this item. ITEM 1B. UNRESOLVED STAFF COMMENTS\nWe are a smaller reporting company as defined by Rule 12b-2 of the Securities Exchange Act of 1934 and are not required to provide the information under this item. ITEM 2. PROPERTIES\nWe had a physical office in Shanghai with address of Room 1510, Building 5, Ark Times Square, 3148 Chengliu Middle Road, Jiading District, Shanghai. This location has been rented by MU Global Health Management (Shanghai) Limited for a 12-month period from November 6, 2021 to November 5, 2022, for an initial deposit of RMB 7,000 and additional tri-monthly payments in the amount of RMB 3,500 per month over the course of the lease. The Company has an option to renew after the end of the agreement. On October 18, 2022, the Company has renewed the tenancy agreement for 12 months with tri-monthly payments in the amount of RMB 3,500 per month over the course of the lease from November 6, 2022 to November 5, 2023. ITEM 3. LEGAL PROCEEDINGS\nFrom time to time, we may become involved in various lawsuits and legal proceedings which arise in the ordinary course of business. Litigation is subject to inherent uncertainties, and an adverse result in these or other matters may arise from time to time that may harm our business. There are currently no pending legal proceedings or claims that we believe will have a material adverse effect on our business, financial condition or operating results. None of our directors, officers or affiliates is involved in a proceeding adverse to our business or has a material interest adverse to our business. ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\nPART II ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nHolders\nAs of July 31, 2022, we had 59,434,838 shares of our Common Stock par value, $.0001 issued and outstanding. There were 159 beneficial owners of our Common Stock.\nTransfer Agent and Registrar\nThe transfer agent for our capital stock is VStock Transfer, LLC, with an address at 18, Lafayette Place, Woodmere, New York 11598 and telephone number is +1 (212) 828-8436.\nPenny Stock Regulations\nThe Securities and Exchange Commission has adopted regulations which generally define penny stock to be an equity security that has a market price of less than $5.00 per share. Our Common Stock, when and if a trading market develops, may fall within the definition of penny stock and be subject to rules that impose additional sales practice requirements on broker-dealers who sell such securities to persons other than established customers and accredited investors (generally those with assets in excess of $1,000,000, or annual incomes exceeding $200,000 individually, or $300,000, together with their spouse).\nFor transactions covered by these rules, the broker-dealer must make a special suitability determination for the purchase of such securities and have received the purchasers prior written consent to the transaction. Additionally, for any transaction, other than exempt transactions, involving a penny stock, the rules require the delivery, prior to the transaction, of a risk disclosure document mandated by the Securities and Exchange Commission relating to the penny stock market. The broker-dealer also must disclose the commissions payable to both the broker-dealer and the registered representative, current quotations for the securities and, if the broker-dealer is the sole market-maker, the broker-dealer must disclose this fact and the broker-dealers presumed control over the market. Finally, monthly statements must be sent disclosing recent price information for the penny stock held in the account and information on the limited market in penny stocks. Consequently, the penny stock rules may restrict the ability of broker-dealers to sell our Common Stock and may affect the ability of investors to sell their Common Stock in the secondary market.\nIn addition to the penny stock rules promulgated by the Securities and Exchange Commission, the Financial Industry Regulatory Authority (FINRA) has adopted rules that require that in recommending an investment to a customer, a broker-dealer must have reasonable grounds for believing that the investment is suitable for that customer. Prior to recommending speculative low-priced securities to their non-institutional customers, broker-dealers must make reasonable efforts to obtain information about the customers financial status, tax status, investment objectives and other information. Under interpretations of these rules, FINRA believes that there is a high probability that speculative low-priced securities will not be suitable for at least some customers. The FINRA requirements make it more difficult for broker-dealers to recommend that their customers buy our common stock, which may limit the investors ability to buy and sell our stock.\nDividend Policy\nAny future determination as to the declaration and payment of dividends on shares of our Common Stock will be made at the discretion of our board of directors out of funds legally available for such purpose. We are under no obligations or restrictions to declare or pay dividends on our shares of Common Stock. In addition, we currently have no plans to pay such dividends. Our board of directors currently intends to retain all earnings for use in the business for the foreseeable future.\nEquity Compensation Plan Information\nCurrently, there is no equity compensation plan in place.\nUnregistered Sales of Equity Securities\nCurrently, there is no unregistered sales of equity securities.\nPurchases of Equity Securities by the Registrant and Affiliated Purchasers\nWe have not repurchased any shares of our common stock during the fiscal year ended July 31, 2022. ITEM 6. SELECTED FINANCIAL DATA\nWe are a smaller reporting company as defined by Rule 12b-2 of the Securities Exchange Act of 1934 and are not required to provide the information under this item. ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion of our financial condition and results of operations should be read in conjunction with our audited consolidated financial statements and the notes to those financial statements appearing elsewhere in this Report.\nCertain statements in this Report constitute forward-looking statements. These forward-looking statements include statements, which involve risks and uncertainties, regarding, among other things, (a) our projected sales, profitability, and cash flows, (b) our growth strategy, (c) anticipated trends in our industry, (d) our future financing plans, and (e) our anticipated needs for, and use of, working capital. They are generally identifiable by use of the words may, will, should, anticipate, estimate, plan, potential, project, continuing, ongoing, expects, management believes, we believe, we intend, or the negative of these words or other variations on these words or comparable terminology. In light of these risks and uncertainties, there can be no assurance that the forward-looking statements contained in this filing will in fact occur. You should not place undue reliance on these forward-looking statements.\nThe forward-looking statements speak only as of the date on which they are made, and, except to the extent required by federal securities laws, we undertake no obligation to update any forward-looking statements to reflect events or circumstances after the date on which the statements are made or to reflect the occurrence of unanticipated events.\nOverview\nMU Global Holding Limited, the US Company, operates through its wholly owned subsidiary, MU Worldwide Group Limited, a Seychelles Company; which operates through its wholly owned subsidiary, MU Global Holding Limited, a Hong Kong Company; which operates through its wholly owned subsidiary, MU Global Health Management (Shanghai) Limited, a Shanghai Company. The US, Seychelles and Hong Kong Companies act solely for holding purposes whereas all current and future operations in China are planned to be carried out via MU Global Health Management (Shanghai) Limited, the Shanghai Company. The purpose of the Hong Kong Company is to function as the current regional hub of the Company.\nAt present, we have a physical office in Shanghai with address of Room 1510, Building 5, Ark Times Square, 3148 Chengliu Middle Road, Jiading District, Shanghai. In the future, we do not have definitive plans for which markets intend to expand to, but we base our operations in Shanghai, as we prepare for future unidentified expansion efforts.\nAll of the previous entities share the same exact business plan with the goal of developing and providing wellness and beauty services to our future clients. We aim to promote improved overall health and beauty in our clients through a holistic detoxification method. We will, at least initially, primarily focus our efforts on attracting customers in China. We have intentions, but no definitive plans or timelines, to expand to Singapore, Malaysia, Hong Kong, and Middle Eastern countries in the coming years, and subsequently we intend to make efforts to expand throughout Asia. We anticipate spending a substantial amount in marketing and advertising in the coming year.\nResults of Operations\nRevenue\nThe Company generated revenue of $46,702 and $64,951 for the year ended July 31, 2022 and 2021. The revenue represented income from wellness and beauty services provided to customers and sales of products via Shanghai outlets.\nCost of Revenue and Gross Margin\nFor the year ended July 31, 2022 and 2021, cost incurred in providing wellness and beauty services amounted to $21,891 and $17,218 respectively. The Company generated gross profit of $24,811 and $47,733 for the year ended July 31, 2022 and 2021.\nSelling and Marketing Expenses\nSelling and distribution expenses for the year ended July 31, 2022 and 2021 amounted to $3,470 and $7,180 respectively, comprising advertisement expenses on WeChat, mobile apps and market public research.\nGeneral and Administrative Expenses\nGeneral and administrative expenses for the year ended July 31, 2022 and 2021 amounted to $428,710 and $463,641 respectively, comprising salary, allowances, professional fees, consultancy fee for IT and system management, office and outlet operation expenses and depreciation.\nOther Income\nThe Company recorded an amount of $50,036 and $36,144 as other income for the year ended July 31, 2022 and 2021 respectively, being interest income, foreign exchange gain, gain on disposal and gain on remeasurement of long term liabilities.\nNet Loss\nNet loss for the year ended July 31, 2022 and 2021 amounted to $357,333 and $386,944 respectively. The decrease in net loss of $29,611 due to management have carried out strict control in expenses to reduce the general and administrative expenses incurred during the year ended July 31, 2022.\nLiquidity and Capital Resources\nAs of July 31, 2022 and 2021, we had working capital of shortage of $339,398 and $170,303, consisting of cash and cash equivalents of $2,909 and $20,231 respectively. During the year ended July 31, 2022 and 2021, we had negative operating cash flows due to revenue is insufficient to cover the general and administrative expenses as the Company still in the development stage of commercialize its services and products and also the impact of impact of COVID-19 outbreak in China, which further slowdown the business development of the company.\nWe depend substantially on financing activities to provide us with the liquidity and capital resources we need to meet our working capital requirements and to make capital investments in connection with ongoing operations. During the year ended July 31, 2022, the Company had met these requirements primarily from the financial support from director and related company.\nCash Used in Operating Activities\nFor the year ended July 31, 2022 and 2021, net cash used in operating activities was $4,169 and $156,580 respectively. The cash used in operating activities was mainly for payment of general and administrative expenses.\nCash (Used) in /Provided by Financing Activities\nFor the year ended July 31, 2022 and 2021, net cash used in and provided by financing activities was $14,961 and $157,363 respectively. The financing cash flow performance primarily reflects loan from director, related company and third party.\nCash (Used) in /Provided by Investing Activities\nFor the year ended July 31, 2022 and 2021, net cash used in and provided by investing activities was $ 312 and $6,795 respectively. The investing cash flow performance primarily reflects the purchase of plant, equipment and trademarks and the disposal of plant and equipment.\nCredit Facilities\nWe do not have any credit facilities or other access to bank credit.\nCritical Accounting Policies and Estimates\nUse of estimates\nManagement uses estimates and assumptions in preparing these financial statements in accordance with US GAAP. Those estimates and assumptions affect the reported amounts of assets and liabilities, the disclosure of contingent assets and liabilities in the balance sheets, and the reported revenue and expenses during the periods reported. Actual results may differ from these estimates.\nCash and cash equivalents\nCash and cash equivalents are carried at cost and represent cash on hand, demand deposits placed with banks or other financial institutions and all highly liquid investments with an original maturity of three months or less as of the purchase date of such investments.\nRevenue recognition\nFinancial Accounting Standards Board, or FASB, issued ASC 606. The standard is a comprehensive new revenue recognition model that requires revenue to be recognized in a manner to depict the transfer of goods or services to a customer at an amount that reflects the consideration expected to be received in exchange for those goods or services.\nRevenue is measured at the fair value of the consideration received or receivable, net of discounts and taxes applicable to the revenue. The Company derives its revenue from provision of wellness and beauty services to customers via Company owned outlets, franchised outlets or distribution of our product to third party wellness and beauty salon.\nCost of revenues\nCost of revenue includes the cost of services and product incurred to provide wellness and beauty services and purchase of products.\nCash and cash equivalents\nCash and cash equivalents are carried at cost and represent cash on hand, demand deposits placed with banks or other financial institutions and all highly liquid investments with an original maturity of three months or less as of the purchase date of such investments.\nInventories\nInventories consisting of products available for sell, are stated at the lower of cost or market value. Cost of inventory is determined using the first-in, first-out (FIFO) method. Inventory reserve is recorded to write down the cost of inventory to the estimated market value due to slow-moving merchandise and damaged goods, which is dependent upon factors such as historical and forecasted consumer demand, and promotional environment. The Company takes ownership, risks and rewards of the products purchased. Write downs are recorded in cost of revenues in the Consolidated Statements of Operations and Comprehensive Loss.\nProperty, plant and equipment\nProperty, plant and equipment are stated at cost less accumulated depreciation and accumulated impairment losses, if any. Depreciation is calculated on the straight-line basis over the following expected useful lives from the date on which they become fully operational:\nClassification\nEstimated useful life\nLeasable equipment\nyears\nComputer hardware and software\nyears\nOffice equipment\nyears\nOutlet design fee and equipment\n3 years\nApplication development fee\n3 years\nExpenditures for maintenance and repairs are expensed as incurred. The gain or loss on the disposal of property, plant and equipment is the difference between the net sale proceeds and the carrying amount of the relevant assets and is recognized in the Consolidated Statements of Operations and Comprehensive Loss.\nImpairment of long-live assets\nLong-lived assets primarily include trademark of the Company. In accordance with the provision of ASC Topic 360, Impairment or Disposal of Long-Lived Assets, the Company generally conducts its annual impairment evaluation to its long-lived assets, usually in the fourth quarter of each fiscal year, or more frequently if indicators of impairment exist, such as significant sustained change in the business climate. The recoverability of long-lived assets is measured at the lowest level group. If the total of the expected undiscounted future net cash flows is less than the carrying amount of the asset, a loss is recognized for the difference between the fair value and carrying amount of the asset.\nLeases\nThe Company recognizes lease payments for its short-term lease on a straight-line basis over the lease term in accordance with ASC 842.\nThe right-of-use asset is initially measured at cost, which comprises the initial amount of the lease liability adjusted for lease payments made at or before the lease commencement date, plus any initial direct costs incurred less any lease incentives received. Costs associated with operating lease assets are recognized on a straight-line basis within operating expenses over the term of the lease.\nIn determining the present value of the unpaid lease payments, ASC 842 requires a lessee to discount its unpaid lease payments using the interest rate implicit in the lease or, if that rate cannot be readily determined, its incremental borrowing rate. As most of the Company leases do not provide an implicit rate, the Company uses its incremental borrowing rate as the discount rate for the lease. The Company incremental borrowing rate is estimated to approximate the interest rate on a collateralized basis with similar terms and payments.\nIncome taxes\nIncome taxes are determined in accordance with the provisions of ASC Topic 740, Income Taxes (ASC Topic 740). Under this method, deferred tax assets and liabilities are recognized for the future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax basis. Deferred tax assets and liabilities are measured using enacted income tax rates expected to apply to taxable income in the periods in which those temporary differences are expected to be recovered or settled. Any effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date.\nASC 740 prescribes a comprehensive model for how companies should recognize, measure, present, and disclose in their financial statements uncertain tax positions taken or expected to be taken on a tax return. Under ASC 740, tax positions must initially be recognized in the financial statements when it is more likely than not the position will be sustained upon examination by the tax authorities. Such tax positions must initially and subsequently be measured as the largest amount of tax benefit that has a greater than 50% likelihood of being realized upon ultimate settlement with the tax authority assuming full knowledge of the position and relevant facts.\nThe Company conducts major businesses in China and is subject to tax in this jurisdiction. As a result of its business activities, the Company will file tax returns that are subject to examination by the foreign tax authority.\nGoing concern\nThe accompanying financial statements have been prepared using the going concern basis of accounting, which contemplates the realization of assets and the satisfaction of liabilities in the normal course of business.\nFor the year ended July 31, 2022, the Company has generated revenue of $46,702 and continuously incurred a net loss of $357,333. As of July 31, 2022, the Company suffered an accumulated deficit of $2,389,181, capital deficiency of $533,364 and negative operating cash flow of $4,169. The Companys ability to continue as a going concern is dependent upon improving the profitability and the continuing financial support from its shareholders and director. Management believes the existing shareholders, director or external financing will provide the additional cash to meet the Companys obligations as they become due.\nThese and other factors raise substantial doubt about the Companys ability to continue as a going concern. These financial statements do not include any adjustments to reflect the possible future effects on the recoverability and classification of assets or the amounts and classification of liabilities that may result in the Company not being able to continue as a going concern\nNet loss per share\nThe Company calculates net loss per share in accordance with ASC Topic 260 Earnings Per Share. Basic loss per share is computed by dividing the net loss by the weighted average number of common shares outstanding during the period. Diluted loss per share is computed similar to basic loss per share except that the denominator is increased to include the number of additional common shares that would have been outstanding if the potential common stock equivalents had been issued and if the additional common shares were dilutive.\nForeign currencies translation\nTransactions denominated in currencies other than the functional currency are translated into the functional currency at the exchange rates prevailing at the dates of the transaction. Monetary assets and liabilities denominated in currencies other than the functional currency are translated into the functional currency using the applicable exchange rates at the balance sheet dates. The resulting exchange differences are recorded in the Consolidated Statements of Operations and Comprehensive Loss.\nThe reporting currency of the Company and its subsidiary is United States Dollars (US$) and the accompanying financial statements have been expressed in US$.\nIn general, for consolidation purposes, assets and liabilities of its subsidiary whose functional currency is not US$ are translated into US$, in accordance with ASC Topic 830-30, Translation of Financial Statement, using the exchange rate on the balance sheet date. Revenues and expenses are translated at average rates prevailing during the period. The gains and losses resulting from translation of financial statements of foreign subsidiary are recorded as a separate component of accumulated other comprehensive loss within the statements of shareholders equity.\nTranslation of amounts from RMB, TWD and HK$ into US$1 has been made at the following exchange rates for the respective periods:\nAs of and for the year ended July 31,\nYear-end RMB : US$1 exchange rate\n6.744\n6.461\nYear-average RMB : US$1 exchange rate\n6.476\n6.578\nYear-end HK$ : US$1 exchange rate\n7.850\n7.772\nYear-average HK$ : US$1 exchange rate\n7.811\n7.758\nYear-end TWD : US$1 exchange rate\n30.044\n27.972\nYear-average TWD : US$1 exchange rate\n28.500\n28.340\nRelated parties\nParties, which can be a corporation or individual, are considered to be related if the Company has the ability, directly or indirectly, to control the other party or exercise significant influence over the other party in making financial and operating decisions. Companies are also considered to be related if they are subject to common control or common significant influence.\nFair value of financial instruments:\nThe carrying value of the Companys financial instruments: cash and cash equivalents, accounts payable and accrued liabilities, and amount due to a director approximate at their fair values because of the short-term nature of these financial instruments.\nThe Company also follows the guidance of the ASC Topic 820-10, Fair Value Measurements and Disclosures (ASC 820-10), with respect to financial assets and liabilities that are measured at fair value. ASC 820-10 establishes a three-tier fair value hierarchy that prioritizes the inputs used in measuring fair value as follows:\nLevel 1: Observable inputs such as quoted prices in active markets;\nLevel 2: Inputs, other than the quoted prices in active markets, that are observable either directly or indirectly; and\nLevel 3: Unobservable inputs in which there is little or no market data, which require the reporting entity to develop its own assumptions.\nRecent accounting pronouncements\nThe Company has reviewed all recently issued, but not yet effective, accounting pronouncements and do not believe the future adoption of any such pronouncements may be expected to cause a material impact on its financial condition or the results of its operations.\nIn February 2016, the FASB issued ASU 2016-02, Leases (Topic 842), to increase transparency and comparability among organizations by recognizing lease assets and lease liabilities on the balance sheet and disclosing key information about leasing arrangements. Most prominent among the amendments is the recognition of assets and liabilities by lessees for those leases classified as operating leases under current U.S. GAAP. ASU 2016-02 is effective for fiscal years beginning after December 15, 2018, including interim periods within those fiscal years. As required by the standard, the Company will adopt the provisions of the new standard effective November 1, 2019, using the required modified retrospective approach. We believe the adoption will not have a material impact on our financial statements.\nOff-Balance Sheet Arrangements\nThe Company has no off-balance sheet arrangements ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nWe are a smaller reporting company as defined by Rule 12b-2 of the Securities Exchange Act of 1934 and are not required to provide the information under this item. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nThe financial statements required by this item are located in PART IV of this Annual Report. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone. ITEM 9A. CONTROLS AND PROCEDURES\nDisclosures Control and Procedures\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting. Internal control over financial reporting is defined in Rule 13a-15(f) or 15d-15(f) promulgated under the Exchange Act as a process designed by, or under the supervision of, the companys principal executive and principal financial officers and effected by the companys board of directors, management and other personnel, to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with accounting principles generally accepted in the United States of America and includes those policies and procedures that:\n● Pertain to the maintenance of records that in reasonable detail accurately and fairly reflect the transactions and dispositions of the assets of the company;\n● Provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with accounting principles generally accepted in the United States of America and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and\n● Provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of the companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate. All internal control systems, no matter how well designed, have inherent limitations. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation. Because of the inherent limitations of internal control, there is a risk that material misstatements may not be prevented or detected on a timely basis by internal control over financial reporting. However, these inherent limitations are known features of the financial reporting process. Therefore, it is possible to design into the process safeguards to reduce, though not eliminate, this risk.\nAs of July 31, 2022, the management assessed the effectiveness of our internal control over financial reporting based on the criteria for effective internal control over financial reporting established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) and SEC guidance on conducting such assessments. Based on such evaluation, the management concluded that during the year covered by this Report, internal controls and procedures overall were not effective. This was due to the deficiencies existed in the design or operation of our internal controls over financial reporting that adversely affected our internal controls and that may be considered to be material weaknesses.\nIdentified Material Weakness\nA material weakness in internal control over financial reporting is a control deficiency, or combination of control deficiencies, that results in more than a remote likelihood that a material misstatement of the financial statements will not be prevented or detected.\nManagement identified the following material weakness during its assessment of internal controls over financial reporting as of July 31, 2022.\nWe do not have adequate segregation of duties and effective risk assessment - Lack of segregation of duties and effective risk assessment may cause the Company to face the likelihood of fraud or theft, due to poor oversight, governance and review to detect errors.\nAccordingly, the Company concluded that these control deficiencies resulted in a reasonable possibility that a material misstatement of the annual or interim financial statements will not be prevented or detected on a timely basis by the companys internal controls.\nAs a result of the material weaknesses described above, the management has concluded that the Company did not maintain effective internal control over financial reporting as of July 31, 2022 based on the criteria established in Internal Control-Integrated Framework issued by COSO.\nManagements Remediation Initiatives\nIn an effort to remediate the identified material weaknesses and other deficiencies and enhance our internal controls, we have initiated, or plan to initiate, the following series of measures:\n1. We plan to create a position to segregate duties consistent with control objectives and will increase our personnel resources and technical accounting expertise within the accounting function. The accounting personnel is responsible for reviewing the financing activities, facilitating the approval of the financing, recording the information regarding the financing, and submitting SEC filing related documents to our legal counsel in order to comply with the filing requirements of SEC.\n2. We intend to add staff members to our management team to make sure that information required to be disclosed in our reports filed and submitted under the Exchange Act is recorded, processed, summarized and reported as and when required and will the staff members will have segregated responsibilities with regard to these responsibilities.\nWe anticipate that these initiatives will be at least partially, if not fully, implemented by the end of fiscal year 2022.\nChanges in internal controls over financial reporting\nThere was no change in our internal controls over financial reporting that occurred during the year covered by this Report, which has materially affected, or is reasonably likely to materially affect, our internal controls over financial reporting:\nThis annual report does not include an attestation report of the Companys registered independent public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by the Companys registered independent public accounting firm pursuant to rules of the Securities and Exchange Commission that permit the Company to provide only managements report in this Annual Report on Form 10-K. ITEM 9B. OTHER INFORMATION\nNone.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nOur executive officers and directors and their respective ages as of the date hereof are as follows:\nNAME\nAGE\nPOSITION\nNiu Yen-Yen\nChief Executive Officer, President, Secretary, Treasurer, Director\nHsieh Chang-Chung\nChief Financial Officer\nSet forth below is a brief description of the background and business experience of our executive officer and director for the past five years.\nNiu Yen-Yen - President, Chief Executive Officer, Chief Financial Officer, Secretary, Treasurer, Director\nIn 2014, Ms. Niu Yen-Yen received Master of Business Administration program from Aalto University Executive Education, Taiwan. From 1997 to 2006, Ms. Niu Yen-Yen served as the Business Development Director at Serax International Limited in Hong Kong, a multilevel marketing business.\nMs. Niu serves as Chief Executive Officer of Yu Qing International Co., Ltd. in Taiwan since 2006 and continues to hold this position at present. In 2006, when she first started this company, she became an agent to perfume brands such as, Calvin Klein, Clive Christian, Dior, Versace, Chanel, Hermes, Kenzo, Bvlgari, Jimmy Choo etc. In 2010, Ms. Niu has held over 500 sales events all over famous shopping malls and hotels. In 2012, she developed a retail brand called Idol Beauty. It provides various beauty care, organic skin care and cosmetic products. In 2013, she set up Day More as the first stone spa brand in Taiwan. In the same year, she worked with Horien Biochemical Technology Co., Ltd. to develop and apply patent beauty care products such as Antirincle and Biofresh.\nIn 2016, Ms. Niu opened a new business called Mu Chuan International Company Limited, a multilevel marketing business. In 2017, Ms. Niu established a cross-border e-commerce business, https://www.magicgo99.com, in order to reach consumers globally.\nMs. Niu Yen-Yens experience in corporate management and business development has led the Board of Directors to reach the conclusion that she should serve as President, Chief Executive Officer and Director of the Company.\nHsieh Chang-Chung- Chief Financial Officer\nIn 1985, Mr. Hsieh Chang-Chung received Master of Business Administration from Chung Yuan Christian University, Taiwan. From 1989 to 1992, Mr. Hsieh worked as the Special Assistant to the Chairman of Fu-I Industrial Group, a listed company in Taipei Stock Exchange. He served as the Co-Founder and Executive Vice President of Quanton Optronics Inc. from November 1992 to December 1993. Mr. Hsieh had also served as the Controller of UTC Co., Ltd from 1994 to 1995. From 1995 to 1998, Mr. Hsieh served as the Chief Staff of the CEO Office in EMI. Ltd., which is a listed company in Taipei Stock Exchange. He also served as the Vice President of Far Eastern VC Investment Co., Ltd from 1997 to 2006.\nFrom 1999 to 2008, Mr. Hsieh served as the Chief Financial Officer and Senior Vice President of Eastern Multimedia Co., Ltd. (which was renamed to Kbro Co., Ltd. in 2006) in Taiwan. He then served as the Vice President and Chief Investment Officer of Head Office in Eastern Media International Group (EMI) from 2008 to 2016. From 2016 to 2019, Mr. Hsieh has served as the Senior Consultant of Eastern Media International Group (EMI) in Taiwan.\nMr. Hsieh Chang-Chungs corporate and financial experience has led the Board of Directors to reach the conclusion that he should serve as the Chief Financial Officer of the Company.\nCorporate Governance\nThe Company promotes accountability for adherence to honest and ethical conduct; endeavors to provide full, fair, accurate, timely and understandable disclosure in reports and documents that the Company files with the Securities and Exchange Commission (the SEC) and in other public communications made by the Company; and strives to be compliant with applicable governmental laws, rules and regulations. The Company has not formally adopted a written code of business conduct and ethics that governs the Companys employees, officers and Directors as the Company is not required to do so.\nIn lieu of an Audit Committee, the Companys Board of Directors is responsible for reviewing and making recommendations concerning the selection of external auditors, reviewing the scope, results and effectiveness of the annual audit of the Companys financial statements and other services provided by the Companys independent public accountants. The Board of Directors, Chief Executive Officer and Chief Financial Officer of the Company review the Companys internal accounting controls, practices and policies.\nCommittees of the Board\nOur Company currently does not have nominating, compensation, or audit committees or committees performing similar functions nor does our Company have a written nominating, compensation or audit committee charter. Our Director(s) believes that it is not necessary to have such committees, at this time, because the Director(s) can adequately perform the functions of such committees.\nAudit Committee Financial Expert\nOur Board of Directors has determined that we do not have a board member that qualifies as an audit committee financial expert as defined in Item 407(D)(5) of Regulation S-K, nor do we have a Board member that qualifies as independent as the term is used in Item 7(d)(3)(iv)(B) of Schedule 14A under the Securities Exchange Act of 1934, as amended, and as defined by Rule 4200(a)(14) of the FINRA Rules.\nWe believe that our Director(s) are capable of analyzing and evaluating our financial statements and understanding internal controls and procedures for financial reporting. The Director(s) of our Company does not believe that it is necessary to have an audit committee because management believes that the Board of Directors can adequately perform the functions of an audit committee. In addition, we believe that retaining an independent Director who would qualify as an audit committee financial expert would be overly costly and burdensome and is not warranted in our circumstances given the stage of our development and the fact that we have not generated any positive cash flows from operations to date.\nInvolvement in Certain Legal Proceedings\nOur Directors and our Executive officers have not been involved in any of the following events during the past ten years:\n1. bankruptcy petition filed by or against any business of which such person was a general partner or executive officer either at the time of the bankruptcy or within two years prior to that time;\n2. any conviction in a criminal proceeding or being subject to a pending criminal proceeding (excluding traffic violations and other minor offenses);\n3. being subject to any order, judgment, or decree, not subsequently reversed, suspended or vacated, of any court of competent jurisdiction, permanently or temporarily enjoining, barring, suspending or otherwise limiting his/her involvement in any type of business, securities or banking activities; or\n4. being found by a court of competent jurisdiction (in a civil action), the Commission or the Commodity Futures Trading Commission to have violated a federal or state securities or commodities law, and the judgment has not been reversed, suspended, or vacated.\n5. Such person was found by a court of competent jurisdiction in a civil action or by the Commission to have violated any Federal or State securities law, and the judgment in such civil action or finding by the Commission has not been subsequently reversed, suspended, or vacated;\n6. Such person was found by a court of competent jurisdiction in a civil action or by the Commodity Futures Trading Commission to have violated any Federal commodities law, and the judgment in such civil action or finding by the Commodity Futures Trading Commission has not been subsequently reversed, suspended or vacated;\n7. Such person was the subject of, or a party to, any Federal or State judicial or administrative order, judgment, decree, or finding, not subsequently reversed, suspended or vacated, relating to an alleged violation of:(i) Any Federal or State securities or commodities law or regulation; or(ii) Any law or regulation respecting financial institutions or insurance companies including, but not limited to, a temporary or permanent injunction, order of disgorgement or restitution, civil money penalty or temporary or permanent cease-and-desist order, or removal or prohibition order; or(iii) Any law or regulation prohibiting mail or wire fraud or fraud in connection with any business entity; or\n8. Such person was the subject of, or a party to, any sanction or order, not subsequently reversed, suspended or vacated, of any self-regulatory organization (as defined in Section 3(a)(26) of the Exchange Act (15 U.S.C. 78c(a)(26))), any registered entity (as defined in Section 1(a)(29) of the Commodity Exchange Act (7 U.S.C. 1(a)(29))), or any equivalent exchange, association, entity or organization that has disciplinary authority over its members or persons associated with a member.\nIndependence of Directors\nWe are not required to have independent members of our Board of Directors, and do not anticipate having independent Directors until such time as we are required to do so.\nCode of Ethics\nWe have not adopted a formal Code of Ethics. The Board of Directors has evaluated the business of the Company and the number of employees and determined that since the business is operated by a small number of persons, general rules of fiduciary duty and federal and state criminal, business conduct and securities laws are adequate ethical guidelines. In the event our operations, employees and/or Directors expand in the future, we may take actions to adopt a formal Code of Ethics.\nShareholder Proposals\nOur Company does not have any defined policy or procedural requirements for shareholders to submit recommendations or nominations for Directors. The Board of Directors believes that, given the stage of our development, a specific nominating policy would be premature and of little assistance until our business operations develop to a more advanced level. Our Company does not currently have any specific or minimum criteria for the election of nominees to the Board of Directors and we do not have any specific process or procedure for evaluating such nominees. The Board of Directors will assess all candidates, whether submitted by management or shareholders, and make recommendations for election or appointment.\nA shareholder who wishes to communicate with our Board of Directors may do so by directing a written request addressed to our President, at the address appearing on the first page of this Information Statement. ITEM 11. EXECUTIVE COMPENSATION\nThe following table sets forth information concerning the compensation of our Chief Executive Officer, and the executive officers who served at the end of the year July 31, 2022, for services rendered in all capacities to us.\nSummary Compensation Table:\nName and Principal Position\nYear\nSalary\n($)\nBonus\n($)\nStock Awards\n($)\nOption Awards\n($)\nNon-Equity Incentive Plan Compensation\n($)\nNonqualified Deferred Compensation Earnings\n($)\nAll Other Compensation\n($)\nTotal\n($)\nNiu Yen Yen, Chief Executive Officer,\nFor the year ended July 31, 2022\n-\n-\n-\n-\n-\n-\n-\n-\nPresident, Secretary, Treasurer, Director\nFor the year ended July 31, 2021\n-\n-\n-\n-\n-\n-\n-\n-\nHsieh Chang- Chung,\nFor the year ended July 31, 2022\n32,400\n-\n-\n-\n-\n-\n-\n32,400\nChief Financial Officer\nFor the year ended July 31, 2021\n32,600\n-\n-\n-\n-\n-\n-\n32,600\nNarrative Disclosure to Summary Compensation Table\nThere are no arrangements or plans in which we provide pension, retirement or similar benefits for directors or executive officers. Our directors and executive officers may receive stock options at the discretion of our board of directors in the future. We do not have any material bonus or profit sharing plans pursuant to which cash or non-cash compensation is or may be paid to our directors or executive officers, except that stock options may be granted at the discretion of our board of directors from time to time. We have no plans or arrangements in respect of remuneration received or that may be received by our executive officers to compensate such officers in the event of termination of employment (as a result of resignation, retirement, change of control) or a change of responsibilities following a change of control.\nStock Option Grants\nWe have not granted any stock options to our executive officers since our incorporation.\nEmployment Agreements\nWe have entered into an employment agreement with the Mr. Hsieh Chang-Chung, our Chief Financial Officer on June 5, 2018. The agreement will be effective for 5 years and will expire in 2023. Based on the employment contract, Mr. Hsieh will be in charge of the financial control, capital financing, and merger and acquisition of the Company.\nCompensation Discussion and Analysis\nDirector Compensation\nOur Board of Directors does not currently receive any consideration for their services as members of the Board of Directors. The Board of Directors reserves the right in the future to award the members of the Board of Directors cash or stock-based consideration for their services to the Company, which awards, if granted shall be in the sole determination of the Board of Directors.\nExecutive Compensation Philosophy\nOur Board of Directors determines the compensation given to our executive officers in their sole determination. Our Board of Directors reserves the right to pay our executives or any future executives a salary, and/or issue them shares of common stock in consideration for services rendered and/or to award incentive bonuses which are linked to our performance, as well as to the individual executive officers performance. This package may also include long-term stock-based compensation to certain executives, which is intended to align the performance of our executives with our long-term business strategies. Additionally, while our Board of Directors has not granted any performance base stock options to date, the Board of Directors reserves the right to grant such options in the future, if the Board in its sole determination believes such grants would be in the best interests of the Company.\nIncentive Bonus\nThe Board of Directors may grant incentive bonuses to our executive officer and/or future executive officers in its sole discretion, if the Board of Directors believes such bonuses are in the Companys best interest, after analyzing our current business objectives and growth, if any, and the amount of revenue we are able to generate each month, which revenue is a direct result of the actions and ability of such executives.\nLong-term, Stock Based Compensation\nIn order to attract, retain and motivate executive talent necessary to support the Companys long-term business strategy we may award our executive and any future executives with long-term, stock-based compensation in the future, at the sole discretion of our Board of Directors, which we do not currently have any immediate plans to award. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nAs of July 31, 2022, the Company has 59,434,838 shares of common stock issued and outstanding, which number of issued and outstanding shares of common stock have been used throughout this report.\nThe following table sets forth, as of July 31, 2022 certain information with regard to the record and beneficial ownership of the Companys common stock by (i) each person known to the Company to be the record or beneficial owner of more than 5% of the Companys common stock, (ii) each director of the Company, (iii) each of the named executive officers, and (iv) all executive officers and directors of the Company as a group:\nName and Address of Beneficial Owner Shares of Common Stock Beneficially Owned Common Stock Voting Percentage Beneficially Owned Total Voting Percentage Beneficially Owned\nExecutive Officers and Directors\nNiu Yen-Yen,\nChief Executive Officer (Principal Executive Officer), President, Secretary, Treasurer and Director 12,124,970 20.4 % 20.4 %\nServer Intl Co., Ltd1 10,550,000 17.75 % 17.75 %\nHsieh Chang-Chung,\nChief Financial Officer (Principal Financial Officer and Principal Accounting Officer) 700,000 1.18 % 1.18 %\nAll of executive officers and director as a group 23,374,970 39.33 % 39.33 %\n5% or greater shareholders (excluding officers/directors)\n- - -\nServer Intl Co., Ltd is owned and controlled entirely by our Chief Executive Officer, Ms. Niu Yen-Yen.\nBeneficial ownership has been determined in accordance with Rule 13d-3 under the Exchange Act. Under this rule, certain shares may be deemed to be beneficially owned by more than one person (if, for example, persons share the power to vote or the power to dispose of the shares). In addition, shares are deemed to be beneficially owned by a person if the person has the right to acquire shares (for example, upon exercise of an option or warrant) within 60 days of the date as of which the information is provided. In computing the percentage ownership of any person, the amount of shares is deemed to include the amount of shares beneficially owned by such person by reason of such acquisition rights. As a result, the percentage of outstanding shares of any person as shown in the following table does not necessarily reflect the persons actual voting power at any particular date.\n(1) Beneficial ownership is determined in accordance with the rules of the Securities and Exchange Commission and generally includes voting or investment power with respect to securities. Beneficial ownership also includes shares of stock subject to options and warrants currently exercisable or exercisable within 60 days of the date of this table. In determining the percent of common stock owned by a person or entity as of the date of this Report, (a) the numerator is the number of shares of the class beneficially owned by such person or entity, including shares which may be acquired within 60 days on exercise of warrants or options and conversion of convertible securities, and (b) the denominator is the sum of (i) the total shares of common stock outstanding on as of the date of this Annual Report (59,434,838 shares), and (ii) the total number of shares that the beneficial owner may acquire upon exercise of the derivative securities. Unless otherwise stated, each beneficial owner has sole power to vote and dispose of its shares.\n(2) Based on the total issued and outstanding shares of 59,434,838 as of the date of this Annual Report. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, DIRECTOR INDEPENDENCE\nOn June 4, 2018, Ms. Niu Yen-Yen was appointed Chief Executive Officer, President, Secretary, Treasurer and sole member of our Board of Directors.\nOn June 4, 2018, our Chief Executive Officer, Ms. Niu Yen-Yen subscribed 100,000 shares of restricted common stock of the Company at par value of $0.0001 per share. The monies from this transaction, which totaled $10, went to the Company to be used as initial working capital.\nOn June 5, 2018, Mr. Hsieh Chang-Chung was appointed Chief Financial Officer.\nOn June 29, 2018, we, the Company acquired MU Worldwide Group Limited (herein referred as the Seychelles Company), a company incorporated in the Republic of Seychelles. MU Worldwide Group Limited, the Seychelles Company, operates through its subsidiary MU Global Holding Limited (herein referred as the Hong Kong Company), a company incorporated in Hong Kong.\nMU Global Holding Limited, the Hong Kong Company, operates through its wholly owned subsidiary, MU Global Health Management (Shanghai) Limited, (herein referred as the Shanghai Company), a company incorporated in Shanghai, People Republic China.\nOn July 6, 2018, Ms. Niu Yen-Yen and Server Intl Co., Ltd. subscribed 25,000,000 and 11,000,000 restricted shares of common stock, respectively, of the Company, at par value of $0.0001 per share. The monies from these transactions, which totaled $3,600, went to the Company to be used as initial working capital. Server Intl Co., Ltd. is controlled entirely by Ms. Niu Yen-Yen.\nOn July 7, 2018, Chang Chun-Ying and Chang Su-Fen subscribed 4,300,000 and 5,000,000 restricted shares of common stock, respectively, of the Company, at par value of $0.0001 per share. The monies from these transactions, which totaled $930, went to the Company to be used as initial working capital.\nOn July 9, 2018, GreenPro Asia Strategic SPC and GreenPro Venture Capital Limited, subscribed 2,835,000 and 2,165,000 restricted shares of common stock of the Company, respectively, at par value of $0.0001 per share. The monies from these transactions, which totaled $500, went to the Company to be used as initial working capital.\nGreenpro Asia Strategic SPC is controlled and managed by GC Investment Management Limited.\nGreenpro Venture Capital Limited is owned by Greenpro Capital Corp. The controlling shareholders of Greenpro Capital Corp. are Lee Chong Kuang and Loke Che Chan.\nOn July 10, 2018, Server Intl Co., Ltd., which is owned and controlled by our CEO, Ms. Niu Yen-Yen, sold 200,000 shares of restricted common stock at par value of $0.0001 per share to our Chief Financial Officer, Hsieh Chang-Chung.\nFrom August 1, 2018 to December 13, 2018, Ms. Niu Yen-Yen, the sole director and CEO of the Company has transferred 1,557,800 shares of common stock to 16 non-US residents.\nFrom August 1, 2020 to July 31, 2021, Ms. Niu Yen-Yen had 395,000 common stocks transferred in and had sold 3,364,921 shares of common stock.\nFrom August 1, 2021 to July 31, 2022, Ms. Niu Yen-Yen had 55,522 shares of common stocks transferred in and had sold 6,800,000 shares of common stock.\nDuring the year ended July 31, 2022 and July 31, 2021, the Company paid $ 16,580 to Asia UBS Global Limited and $26,460 to Greenpro Financial Consulting Limited for professional services respectively.\nRelated Party Transactions\nRelated party transactions as of July 31, 2022 and 2021 are as per table below:\nYear ended\nJuly 31, 2022 Year ended\nJuly 31, 2021\n(Audited) (Audited)\nProfessional fee paid:\n- Related party A $ 16,580 $ 26,460\nConsultation fee paid:\n- Related party B $ 32,400 $ 21,800\n- Related party C $ - $ 10,500\nTotal $ 48,980 $ 58,760\nRelated party A is the fellow subsidiaries of a corporate shareholder of the Company. Related party B and C are the shareholders of the Company.\nFor the year ended July 31, 2022, the Company incurred professional fees of $16,580 due to related party A. Related party B and C are consultant of the Company and have provided consultancy service for business operation.\nThe related party transactions are generally transacted in an arm-length basis at the current market value in the normal course of business.\nReview, Approval and Ratification of Related Party Transactions\nGiven our small size and limited financial resources, we have not adopted formal policies and procedures for the review, approval or ratification of transactions, such as those described above, with our executive officer(s), Director(s) and significant stockholders. We intend to establish formal policies and procedures in the future, once we have sufficient resources and have appointed additional Directors, so that such transactions will be subject to the review, approval or ratification of our Board of Directors, or an appropriate committee thereof. On a moving forward basis, our Director(s) will continue to approve any related party transaction. ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES\nBelow is the aggregate amount of fees billed for professional services rendered by our principal accountants with respect to our last two fiscal years.\nYear ended\nJuly 31, 2022\nYear ended\nJuly 31, 2021\nAudit fees\n$ 15,000\n$ 14,000\nAudit related fees\n10,850\n10,650\nTax fees\n-\n-\nAll other fees\n-\n-\nTotal\n$ 25,850\n$ 24,650\nThe category of Audit fees includes fees for our annual audit, quarterly reviews and services rendered in connection with regulatory filings with the SEC, such as the issuance of comfort letters and consents.\nThe category of Audit-related fees includes employee benefit plan audits, internal control reviews and accounting consultation.\nAll of the professional services rendered by principal accountants for the audit of our annual financial statements that are normally provided by the accountant in connection with statutory and regulatory filings or engagements for last two fiscal years were approved by our Board of Directors.\nPART IV ITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n(a) Financial Statements\nThe following are filed as part of this report:\nFinancial Statements\nThe following financial statements of MU Global Holding Limited and Report of Independent Registered Public Accounting Firm are presented in the F pages of this Report:\nPage\nIndex\nReport of Independent Registered Public Accounting Firm\nFinancial Statements\nConsolidated Balance Sheets\nConsolidated Statements of Operations and Comprehensive Loss\nConsolidated Statements of Changes in Stockholders Equity\nConsolidated Statements of Cash Flows\nNotes to Consolidated Financial Statements -\n(b) Exhibits\nThe following exhibits are filed or furnished herewith:\n3.1 Articles of Incorporation**\n3.2 Bylaws**\n31.1 Rule 13(a)-14(a)/15(d)-14(a) Certification of principal executive officer*\n32.1 Section 1350 Certification of principal executive officer*\n* Filed herewith.\n** As filed in the Registrants Registration Statement on Form S-1 Amendment No.3 (File No. 333-228847) on April 30, 2019.\nSIGNATURES\nPursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nMU GLOBAL HOLDING LIMITED.\n(Name of Registrant)\nDate: October 31, 2022 By: /s/ NIU YEN YEN\nTitle: Chief Executive Officer,\nPresident, Director, Secretary and Treasurer\n(Principal Executive Officer)\nDate: October 31, 2022 By: /s/ HSIEH CHANG CHUNG\nTitle: Chief Financial Officer\n(Principal Financial Officer, Principal Accounting Officer)\nPage\nFinancial Statements\nReport of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets\nConsolidated Statements of Operations and Comprehensive Loss\nConsolidated Statements of Changes in Stockholders Equity\nConsolidated Statements of Cash Flows\nNotes to Consolidated Financial Statements -\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nThe Board of Directors and Stockholders of\nMU Global Holding Limited\nRm. 5, 7F., No. 296, Sec. 4,\nXinyi Rd., Daan Dist.,\nTaipei City 106427,\nTaiwan (R.O.C.)\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of MU Global Holding Limited and subsidiaries (the ‘Company) as of July 31, 2022 and 2021, and the related consolidated statements of operations and comprehensive income, stockholders equity, and cash flows for the each of two years in the year ended of July 31, 2022 and 2021, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of July 31, 2022 and 2021, and the results of its operations and its cash flows for the each of two years in the year ended July 31, 2022 and 2021, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\nGoing Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 2 to the financial statements, for the financial year ended July 31, 2022, the Companys losses from operations, accumulated deficit, capital deficiency and negative operating cash flows raise substantial doubt about its ability to continue as a going concern. Managements plans regarding those matters also are described in Note 2. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nCritical Audit Matters\nThe critical audit matters below are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to those charged with governance and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgements. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nImpairment of property, plant and equipment and intangible assets\nThe Group has fully impaired its property, plant and equipment amounting to USD149,552 and its intangible assets amounting to USD25,392 as at July 31, 2022.\nThe Group carries out an impairment test by comparing the recoverable amount of cash generating unit (CGU) based on value in use method and the carrying amounts.\nThe impairment test was significant to our audit due to complexity of the assessment process involving significant judgements and estimation uncertainty in making key assumptions about future market and economic conditions growth rates, profit margins, discount rate, etc. for value in use of CGU based on the future discounted cash flows.\nOur procedures in relation to managements impairment assessments included, amongst others:\n(a) Examining managements cash flows forecast that support the impairment assessment;\n(b) Assessing the reliability of managements forecast through the review of past trends of actual financial performance against previous forecast results;\n(c) Evaluating the reasonableness and consistency of key assumptions and inputs used in cash flow projection to available external industry sources of data;\n(d) Performing sensitivity analysis to stress test the key assumptions and inputs used in the impairment assessment; and\n(e) Assessing the adequacy and reasonableness of the disclosures in the financial statements.\n/s/ JP CENTURION & PARTNERS PLT\nJP CENTURION & PARTNERS PLT (ID: 6723)\nWe have served as the Companys auditor since 2021.\nKuala Lumpur, Malaysia\nOctober 31, 2022\nMU GLOBAL HOLDING LIMITED\nCONSOLIDATED BALANCE SHEETS\nAS OF JULY 31, 2022 and 2021\n(Currency expressed in United States Dollars (US$), except for number of shares)\n(Audited)\nAs of July 31,\nASSETS\nNON-CURRENT ASSETS\nProperty, plant and equipment $ - $ 219,669\nLeased asset - Right of use 6,267 12,966\nTotal non-current assets, excluding intangible assets 6,267 232,635\nINTANGIBLE ASSET\nPatent and trademark $ - $ 24,116\nNON-CURRENT ASSETS 6,267 256,751\nCURRENT ASSETS\nPrepayments and deposits $ 45,094 $ 101,688\nAmount due from related party 11,295 10,425\nInventories 16,483 38,374\nCash and cash equivalents 2,909 20,231\nTotal current assets 75,781 170,718\nTOTAL ASSETS $ 82,048 $ 427,469\nLIABILITIES AND STOCKHOLDERS EQUITY\nNON-CURRENT LIABILITIES\nLeased liabilities $ 517 $ 2,647\nLoan from related party - 52,620\nLoan from director 122,652 136,193\nLoan from third party 77,064 85,895\nTotal Non-Current Liability $ 200,233 $ 277,355\nCURRENT LIABILITIES\nOther payables and accrued liabilities 65,865 22,092\nAmount due to related parties 85,076 95,453\nDeposit from franchisees 29,286 33,701\nDeposit from customers 39,296 41,013\nLoan from director 146,439 138,443\nLoan from related party 43,175 -\nLeased liabilities 6,042 10,319\nTotal current liabilities 415,179 341,021\nTOTAL LIABILITIES $ 615,412 $ 618,376\nSTOCKHOLDERS EQUITY\nPreferred stock, $0.0001 par value, 200,000,000 shares authorized, None issued and outstanding $ - $ -\nCommon stock, $0.0001 par value, 600,000,000 shares authorized, 59,434,838 shares issued and outstanding as of July 31, 2022 and July 31, 2021 respectively 5,943 5,943\nAdditional paid-in capital 1,830,300 1,830,300\nForeign currency adjustment 19,574 4,698\nAccumulated deficit (2,389,181 ) (2,031,848 )\nTotal stockholders equity (533,364 ) (190,907 )\nTOTAL LIABILITIES AND STOCKHOLDERS EQUITY $ 82,048 $ 427,469\nSee accompanying notes to consolidated financial statements.\nMU GLOBAL HOLDING LIMITED\nCONSOLIDATED STATEMENTS OF OPERATIONS AND COMPREHENSIVE LOSS\nFOR THE YEARS ENDED JULY 31, 2022 AND 2021\n(Currency expressed in United States Dollars (US$), except for number of shares)\n(Audited)\nFor the year\nended\nJuly 31, 2022 For the year\nended\nJuly 31, 2021\nREVENUE $ 46,702 $ 64,951\nCOST OF REVENUE (21,891 ) (17,218 )\nGROSS PROFIT 24,811 47,733\nOTHER INCOME 50,036 36,144\nSELLING AND MARKETING EXPENSES (3,470 ) (7,180 )\nGENERAL AND ADMINISTRATIVE EXPENSES (428,710 ) (463,641 )\nLOSS BEFORE INCOME TAX $ (357,333 ) $ (386,944 )\nINCOME TAXES PROVISION - -\nNET LOSS (357,333 ) (386,944 )\nOther comprehensive loss:\n- Foreign exchange translation gain 14,876 8,059\nTOTAL COMPREHENSIVE LOSS $ (342,457 ) $ (378,885 )\nNet loss per share - Basic and diluted (0.006 ) (0.006 )\nWeighted average number of common shares outstanding - Basic and diluted 59,434,838 59,434,838\nSee accompanying notes to consolidated financial statements.\nMU GLOBAL HOLDING LIMITED\nCONSOLIDATED STATEMENTS OF CHANGES IN STOCKHOLDERS EQUITY\nFOR THE YEARS ENDED JULY 31, 2022 AND 2021\n(Currency expressed in United States Dollars (US$), except for number of shares)\n(Audited)\nNumber of Shares Amount\nCOMMON\nSHARES ADDITIONAL PAID-IN CAPITAL ACCUMULATED OTHER COMPREHENSIVE INCOME ACCUMULATED\nDEFICIT\nTOTAL EQUITY\nNumber of Shares Amount\nBalance as of July 31, 2020 59,434,838 $ 5,943 $ 1,830,300 $ (3,361 ) $ (1,644,904 ) $ 187,978\nNet loss for the year - - - - (386,944 ) (386,944 )\nForeign currency translation adjustment - - - 8,059 - 8,059\nBalance as of July 31, 2021 59,434,838 $ 5,943 $ 1,830,300 $ 4,698 $ (2,031,848 ) $ (190,907 )\nNet loss for the year -\n-\n-\n-\n(357,333 ) (357,333 )\nForeign currency translation adjustment - - - 14,876 - 14,876\nBalance as of July 31, 2022 59,434,838 $ 5,943 $ 1,830,300 $ 19,574 $ (2,389,181 ) $ (533,364 )\nSee accompanying notes to consolidated financial statements\nMU GLOBAL HOLDING LIMITED\nCONSOLIDATED STATEMENT OF CASH FLOWS\nFOR THE YEARS ENDED JULY 31, 2022 AND 2021\n(Currency expressed in United States Dollars (US$))\n(Audited)\nFor the year\nended\nJuly 31, 2022 For the year\nended\nJuly 31, 2021\nCASH FLOWS FROM OPERATING ACTIVITIES:\nNet loss $ (357,333 ) $ (386,944 )\nAdjustments to reconcile net loss to net cash used in operating activities:\nDepreciation and amortization 102,904 193,447\nImpairment of fixed assets 174,973 -\nAsset written-off 75,029\nReversal on termination of leased asset - (6,471 )\nGain on disposal (27,539 ) (16,695 )\nInterest expense 2,641 -\nChanges in operating assets and liabilities:\nTrade receivables -\nPrepayments and deposits 54,782 16,416\nAmount due from related parties (868 ) 2,495\nInventories 20,284 17,549\nOther payables and accrued liabilities 3,485 (14,405 )\nAmount due to related parties 31,800 -\nLeased liabilities (6,185 ) (25,733 )\nDeposit from franchisees (3,213 ) (3,366 )\nDeposit from customers - (8,095 )\nNet cash used in operating activities $ (4,169 ) $ (156,580 )\nCASH FLOWS FROM INVESTING ACTIVITIES:\nProceed on disposal of property, plant and equipment 44,340 28,046\nPurchase of trademark $ (2,841 ) $ (1,286 )\nPurchase of property, plant and equipment (41,811 ) (19,965 )\nNet cash (used in)/generated from investing activities $ (312 ) $ 6,795\nCASH FLOWS FROM FINANCING ACTIVITIES:\nLoan from director $ (1,222 ) $ 88,492\nLoan from related party (8,018 ) 68,871\nLoan from third party (5,721 ) -\nNet cash (used in)/generated from financing activities $ (14,961 ) $ 157,363\nEffect of exchange rate changes on cash and cash equivalents 2,120\nNet change in cash and cash equivalents (17,322 ) 8,561\nCash and cash equivalents, beginning of year $ 20,231 $ 11,670\nCASH AND CASH EQUIVALENTS, END OF YEAR $ 2,909 $ 20,231\nSee accompanying notes to consolidated financial statements.\nMU GLOBAL HOLDING LIMITED\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED JULY 31, 2022 AND 2021\n(Currency expressed in United States Dollars (US$), except for number of shares)\n1. ORGANIZATION AND BUSINESS BACKGROUND\nMU Global Holding Limited is organized as a Nevada limited liability company, incorporated on June 4, 2018. For purposes of consolidated financial statement presentation, MU Global Holding Limited and its subsidiary are herein referred to as the Company or we. The Company business of which planned principal operations are to provide wellness and beauty services to customers via Company owned outlets, franchised outlets or distribution of our product to third party wellness and beauty salon.\nOn June 29, 2018, the Company acquired 100% interest in MU Worldwide Group Limited, a private limited liability company incorporated in Seychelles and its subsidiary MU Global Holding Limited, a private limited liability company incorporated in Hong Kong. On August 16, 2018, MU Global Holding Limited incorporated a wholly-owned subsidiary in Shanghai, People Republic of China under the name of MU Global Health Management (Shanghai) Limited.\nThe accompanying financial statements have been prepared on a going concern basis, which contemplates the realization of assets and the settlement of liabilities and commitments in the normal course of business. As reflected in the accompanying financial statements, for the year ended July 31, 2022, the Company incurred a net loss of $357,333, as of that date, the Companys current liabilities exceeded its current assets by $339,398, had an accumulated deficit of $2,389,181, capital deficiency of $533,364 and net operating cash flows of $4,169 which raise substantial doubt about the Companys ability to continue as a going concern within one year of the date that the financial statements are issued. The financial statements do not include any adjustments that might be necessary if the Company is unable to continue as a going concern.\nDetails of the Companys subsidiary:\nSCHEDULE OF COMPANY'S SUBSIDIARY\nCompany name Place and\ndate of\nincorporation\nParticulars of issued capital Principal\nactivities Proportional\nof ownership\ninterest and\nvoting power\nheld\n1. MU Worldwide Group Limited Seychelles, June 7, 2018 100 shares of ordinary share of US$1 each Investment holding 100 %\n2. MU Global Holding Limited Hong Kong, January 30, 2018 1 share of ordinary share of HK$1 each Providing SPA and wellness service in Hong Kong 100 %\n3. MU Global Health Management (Shanghai) Limited Shanghai, August 16, 2018 RMB 7,400,300 Providing SPA and wellness service in China 100 %\nBusiness Overview\nMU Global is a beauty and wellness company, providing SPA and wellness service and also SPA related products to the customers. The services provided are designed to improve the overall health system and body function.\nSince the establishment, the Company has been focusing to expand in the Chinese market, with other country also under consideration as target destinations. As an emerging industry in China, the beauty and wellness industry are still in the early stage as there is a huge potential for the industry to growth significantly. According to a report published by the Chinese State Department, the beauty and wellness industry of the country is expected reach the market value of China 8 trillion Chinese Yuan by 2020, accounting for 6.5% of the country Gross Domestic Product (GDP).\nIn year 2020, COVID-19 crisis has resulted the sales of the global beauty and wellness industry weak due to consumers have had limited access to retail outlets and supply chain bottlenecks have reduced product availability. In China, the industrys February sales fell up to 80 percent compared with 2019. Nevertheless, based on Mckinsey and Company research report on April 8, 2021, shows that consumers care deeply about wellness-and that their interest is growing and estimate the global wellness market at more than US$1.5 trillion, with annual growth of 5 to 10 percent. A rise in both consumer interest and purchasing power presents tremendous opportunities for companies, particularly as spending on personal wellness rebounds after stagnating or even declining during the COVID-19 crisis\nChina has large territory, population, diverse ethnicity and cultural background. As such, it has resulted in different consumer orientations in different cities and townships across the country, which is particularly challenging to tackle the consumer market with a single business model.\nThe advance in technological development and rise in use of technology in marketing has also intensified the competition, probing the Company to develop the business models that allow quick penetration and huge coverage of different markets, and also being able to cope with the swift changes in the consumer market. Thus, the Company is focusing on three key areas as part of the Companys early development in the Chinese market.\nThe first and most key focus is to enter the regional market through the adoption of franchisee and agent model, which the other parties are familiar and have deep understanding in the local market, hence its operating strategy is effective and best suited the targeted region.\nSecond, the key strategy is to ensure rapid development of the Omni channel marketing plan which targets to lease out at least ten thousand Stone Spa Bed (Hot Stone Bath equipment), reducing the time cost for the development of project, and most importantly, working on to spur sales and revenue growth.\nLastly, the essential requirement for business success in the Chinese market is to ensure and maintain a clear and transparent business model, which would result in effective collaboration between the company and its agent/franchisee, and consequently leads to efficient market operation and a win-win situation between the two parties.\nCurrently, the Company operates in the Chinese market with two business models:\n1. Tripartite co-operation and profit sharing model.\n2. Large-scale chain agent model\n3.\nDirect- service store model\n2. SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nThe accompanying consolidated financial statements reflect the application of certain significant accounting policies as described in this note and elsewhere in the accompanying consolidated financial statements and notes.\nBasis of presentation\nThese accompanying consolidated financial statements have been prepared in accordance with generally accepted accounting principles in the United States of America (US GAAP).\nThe Company has adopted its fiscal year-end to be July 31.\nBasis of consolidation\nThe consolidated financial statements include the accounts of the Company and its subsidiaries. All inter-company accounts and transactions have been eliminated upon consolidation.\nUse of estimates\nManagement uses estimates and assumptions in preparing these financial statements in accordance with US GAAP. Those estimates and assumptions affect the reported amounts of assets and liabilities, the disclosure of contingent assets and liabilities in the balance sheets, and the reported revenue and expenses during the periods reported. Actual results may differ from these estimates.\nRevenue recognition\nFinancial Accounting Standards Board, or FASB, issued ASC 606. The standard is a comprehensive new revenue recognition model that requires revenue to be recognized in a manner to depict the transfer of goods or services to a customer at an amount that reflects the consideration expected to be received in exchange for those goods or services.\nRevenue is measured at the fair value of the consideration received or receivable, net of discounts and taxes applicable to the revenue. The Company derives its revenue from provision of wellness and beauty services to customers via Company owned outlets, franchised outlets or distribution of our product to third party wellness and beauty salon.\nCost of revenue\nCost of revenue includes the cost of services and product incurred to provide wellness and beauty services and purchase of products.\nCash and cash equivalents\nCash and cash equivalents are carried at cost and represent cash on hand, demand deposits placed with banks or other financial institutions and all highly liquid investments with an original maturity of three months or less as of the purchase date of such investments.\nProperty, plant and equipment\nProperty, plant and equipment are stated at cost less accumulated depreciation and accumulated impairment losses, if any. Depreciation is calculated on the straight-line basis over the following expected useful lives from the date on which they become fully operational:\nSCHEDULE OF PROPERTY, PLANT AND EQUIPMENT ESTIMATED LIFE\nClassification\nEstimated useful life\nLeasable equipment\nyears\nComputer hardware and software\nyears\nOffice equipment\nyears\nOutlet design fee and equipment\n3 years\nApplication development fee\n3 years\nExpenditures for maintenance and repairs are expensed as incurred. The gain or loss on the disposal of property, plant and equipment is the difference between the net sales proceeds and the carrying amount of the relevant assets and is recognized in the Consolidated Statements of Operations and Comprehensive Loss.\nImpairment of long-live assets\nLong-lived assets primarily include trademark of the Company. In accordance with the provision of ASC Topic 360, Impairment or Disposal of Long-Lived Assets, the Company generally conducts its annual impairment evaluation to its long-lived assets, usually in the fourth quarter of each fiscal year, or more frequently if indicators of impairment exist, such as significant sustained change in the business climate. The recoverability of long-lived assets is measured at the lowest level group. If the total of the expected undiscounted future net cash flows is less than the carrying amount of the asset, a loss is recognized for the difference between the fair value and carrying amount of the asset.\nLeases\nThe Company recognizes lease payments for its short-term lease on a straight-line basis over the lease term in accordance with ASC 842.\nThe right-of-use asset is initially measured at cost, which comprises the initial amount of the lease liability adjusted for lease payments made at or before the lease commencement date, plus any initial direct costs incurred less any lease incentives received. Costs associated with operating lease assets are recognized on a straight-line basis within operating expenses over the term of the lease.\nIn determining the present value of the unpaid lease payments, ASC 842 requires a lessee to discount its unpaid lease payments using the interest rate implicit in the lease or, if that rate cannot be readily determined, its incremental borrowing rate. As most of the Company leases do not provide an implicit rate, the Company uses its incremental borrowing rate as the discount rate for the lease. The Company incremental borrowing rate is estimated to approximate the interest rate on a collateralized basis with similar terms and payments.\nInventories\nInventories consisting of products available for sell, are stated at the lower of cost or market value. Cost of inventory is determined using the first-in, first-out (FIFO) method. Inventory reserve is recorded to write down the cost of inventory to the estimated market value due to slow-moving merchandise and damaged goods, which is dependent upon factors such as historical and forecasted consumer demand, and promotional environment. The Company takes ownership, risks and rewards of the products purchased. Write downs are recorded in cost of revenues in the Consolidated Statements of Operations and Comprehensive Loss.\nIncome taxes\nIncome taxes are determined in accordance with the provisions of ASC Topic 740, Income Taxes (ASC 740). Under this method, deferred tax assets and liabilities are recognized for the future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax basis. Deferred tax assets and liabilities are measured using enacted income tax rates expected to apply to taxable income in the periods in which those temporary differences are expected to be recovered or settled. Any effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date.\nASC 740 prescribes a comprehensive model for how companies should recognize, measure, present, and disclose in their financial statements uncertain tax positions taken or expected to be taken on a tax return. Under ASC 740, tax positions must initially be recognized in the financial statements when it is more likely than not the position will be sustained upon examination by the tax authorities. Such tax positions must initially and subsequently be measured as the largest amount of tax benefit that has a greater than 50% likelihood of being realized upon ultimate settlement with the tax authority assuming full knowledge of the position and relevant facts.\nThe Company conducts major businesses in China and is subject to tax in this jurisdiction. As a result of its business activities, the Company will file tax returns that are subject to examination by the foreign tax authority.\nGoing concern\nThe accompanying financial statements have been prepared using the going concern basis of accounting, which contemplates the realization of assets and the satisfaction of liabilities in the normal course of business.\nFor the year ended July 31, 2022, the Company has generated revenue of $46,702 and continuously incurred a net loss of $357,333. As of July 31, 2022, the Company suffered an accumulated deficit of $2,389,181, capital deficiency of $533,364 and negative operating cash flows of $4,169. The Companys ability to continue as a going concern is dependent upon improving the profitability and the continuing financial support from its shareholders and director. Management believes the existing shareholders, director or external financing will provide the additional cash to meet the Companys obligations as they become due.\nThese and other factors raise substantial doubt about the Companys ability to continue as a going concern. These financial statements do not include any adjustments to reflect the possible future effects on the recoverability and classification of assets or the amounts and classification of liabilities that may result in the Company not being able to continue as a going concern.\nMU GLOBAL HOLDING LIMITED\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED JULY 31, 2022 AND 2021\n(Currency expressed in United States Dollars (US$), except for number of shares)\nNet loss per share\nThe Company calculates net loss per share in accordance with ASC Topic 260 Earnings Per Share. Basic loss per share is computed by dividing the net loss by the weighted average number of common shares outstanding during the period. Diluted loss per share is computed similar to basic loss per share except that the denominator is increased to include the number of additional common shares that would have been outstanding if the potential common stock equivalents had been issued and if the additional common shares were dilutive.\nForeign currencies translation\nTransactions denominated in currencies other than the functional currency are translated into the functional currency at the exchange rates prevailing at the dates of the transaction. Monetary assets and liabilities denominated in currencies other than the functional currency are translated into the functional currency using the applicable exchange rates at the balance sheet dates. The resulting exchange differences are recorded in the Consolidated Statements of Operations and Comprehensive loss.\nThe functional currency of the parent Company is United States dollar and the functional currency of the subsidiaries MU Worldwide Group Limited (Seychelles) and MU Global Holding Limited (Hong Kong) is United States dollar. MU Global Health Management (Shanghai) Limited is in Renminbi.\nThe reporting currency of the Company and its subsidiary is United States Dollars (US$) and the accompanying financial statements have been expressed in US$.\nIn general, for consolidation purposes, assets and liabilities of its subsidiaries whose functional currency is not US$ are translated into US$, in accordance with ASC Topic 830-30, Translation of Financial Statement, using the exchange rate on the balance sheet date. Revenues and expenses are translated at average rates prevailing during the period. The gains and losses resulting from translation of financial statements of foreign subsidiary are recorded as a separate component of accumulated other comprehensive loss within the statements of stockholders equity.\nTranslation of amounts from RMB, TWD and HK$ into US$1 has been made at the following exchange rates for the respective periods:\nSCHEDULE OF FOREIGN EXCHANGE RATES TRANSLATION\nAs of and for the year ended July 31,\nYear-end RMB : US$1 exchange rate\n6.744\n6.461\nYear-average RMB : US$1 exchange rate\n6.476\n6.578\nYear-end HK$ : US$1 exchange rate\n7.850\n7.772\nYear-average HK$ : US$1 exchange rate\n7.811\n7.758\nYear-end TWD : US$1 exchange rate\n30.044\n27.972\nYear-average TWD : US$1 exchange rate\n28.500\n28.340\nRelated parties\nParties, which can be a corporation or individual, are considered to be related if the Company has the ability, directly or indirectly, to control the other party or exercise significant influence over the other party in making financial and operating decisions. Companies are also considered to be related if they are subject to common control or common significant influence.\nMU GLOBAL HOLDING LIMITED\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED JULY 31, 2022 AND 2021\n(Currency expressed in United States Dollars (US$), except for number of shares)\nFair value of financial instruments:\nThe carrying value of the Companys financial instruments: cash and cash equivalents, subscription receivables, prepayment and deposits, accounts payable, and other payables and accrued liabilities approximate at their fair values because of the short-term nature of these financial instruments.\nThe Company also follows the guidance of the ASC Topic 820-10, Fair Value Measurements and Disclosures (ASC 820-10), with respect to financial assets and liabilities that are measured at fair value. ASC 820-10 establishes a three-tier fair value hierarchy that prioritizes the inputs used in measuring fair value as follows:\nLevel 1: Observable inputs such as quoted prices in active markets;\nLevel 2: Inputs, other than the quoted prices in active markets, that are observable either directly or indirectly; and\nLevel 3: Unobservable inputs in which there is little or no market data, which require the reporting entity to develop its own assumptions.\nRecent accounting pronouncements\nThe Company has reviewed all recently issued, but not yet effective, accounting pronouncements and do not believe the future adoption of any such pronouncements may be expected to cause a material impact on its financial condition or the results of its operations.\nMU GLOBAL HOLDING LIMITED\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED JULY 31, 2022 AND 2021\n(Currency expressed in United States Dollars (US$), except for number of shares)\n3. COMMON STOCK\nOn June 4, 2018, our Chief Executive Officer, Ms. Niu Yen-Yen subscribed 100,000 shares of restricted common stock of the Company at par value of $0.0001 per share. The monies from this transaction, which totalled $10, went to the Company to be used as initial working capital.\nOn July 6, 2018, Ms. Niu Yen-Yen and Server Intl Co., Ltd. subscribed 25,000,000 and 11,000,000 restricted shares of common stock, respectively, of the Company, at par value of $0.0001 per share. The monies from these transactions, which totalled $3,600, went to the Company to be used as initial working capital. Server Intl Co., Ltd. is controlled entirely by Ms. Niu Yen-Yen.\nOn July 7, 2018, Chang Chun-Ying and Chang Su-Fen subscribed 4,300,000 and 5,000,000 restricted shares of common stock, respectively, of the Company, at par value of $0.0001 per share. The monies from these transactions, which totalled $930, went to the Company to be used as initial working capital.\nOn July 9, 2018, GreenPro Asia Strategic SPC and GreenPro Venture Capital Limited subscribed 2,835,000 and 2,165,000 restricted shares of common stock of the Company, respectively, at par value of $0.0001 per share. The monies from these transactions, which totalled $500, went to the Company to be used as initial working capital.\nFrom July 9, 2018 to July 10, 2018 the Company issued a total of 2,150,000 shares of restricted common stock to three non-US residents. Shares were sold at par value, $0.0001 per share. Total proceeds from these shares totalled $215 and went to the Company to be used as initial working capital.\nOn July 10, 2018, Server Intl Co., Ltd, a Company solely controlled and owned by the CEO, transferred 1,500,000 shares of common stock to 8 non-US residents.\nOn July 11, 2018 the Company issued a total of 710,000 shares of restricted common stock to two non-US residents at a price of $0.03 per share. Total proceeds from these sales of shares totalled $21,300 and went to the Company to be used as initial working capital.\nOn July 25, 2018 the Company issued a total of 995,000 shares of restricted common stock to ten non-US residents at a price of $0.03 per share. Total proceeds from these sales of shares totalled $29,850 and went to the Company to be used as initial working capital.\nOn July 26, 2018 the Company issued 250,000 shares of restricted common stock to one non-US resident at a price of $0.20 per share. Total proceeds from these sales of shares totalled $50,000 and went to the Company to be used as initial working capital.\nOn July 31, 2018 Dezign Format Pte Ltd and Cheng Young-Chien each subscribed 2,000,000 restricted shares of common stock of the Company, at $0.20 per share, for total consideration of $800,000. Proceeds went to the Company to be used as initial working capital.\nFrom August 1, 2018 to December 13, 2018, Ms. Niu Yen-Yen, the CEO of the Company, transferred 1,557,800 shares of common stock to 16 non-US residents.\nOn May 7, 2019, the convertible promissory note issued by the Company amounted $779,125 to 45 accredited investors who reside in Taiwan with the conversion price of $1 per share have been converted to 779,125 shares of common stock of the company after the S-1 registration statement was declared effective on May 6, 2019.\nFrom May 14, 2019 to July 31, 2019, the Company issued 150,317 shares of common stock at a price of $1.00 per share through the Initial Public Offering (IPO) to 36 non-US residents.\nFrom August 1, 2020 to July 31, 2021, Ms. Niu Yen-Yen, the CEO of the Company, had 395,000 shares of common stock transferred from 3 non-US residents and had sold 3,364,921 shares of common stock to 20 non-US residents.\nFrom August 1, 2021 to July 31, 2022, Ms. Niu Yen-Yen, the CEO of the Company, had 55,522 shares of common stock transferred from 2 non-US residents and had sold 6,800,000 shares of common stock to 3 non-US residents.\nAs of July 31, 2022, the Company has an issued and outstanding common share of 59,434,838.\nMU GLOBAL HOLDING LIMITED\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED JULY 31, 2022 AND 2021\n(Currency expressed in United States Dollars (US$), except for number of shares)\n4. PROPERTY, PLANT AND EQUIPMENT\nSCHEDULE OF PROPERTY, PLANT AND EQUIPMENT\nAs of\nJuly 31, 2022 As of\nJuly 31, 2021\n(Audited) (Audited)\nComputer hardware and software $ 129,301 $ 129,301\nOffice equipment 120,569 120,651\nLeasable equipment1 229,405 216,924\nOutlet design fee and equipment 16,763 16,763\nApplication development fee 37,413 37,413\nTotal 533,451 521,052\nAccumulated depreciation2 (401,797 ) (307,197 )\nImpairment (149,552 ) -\nForeign currency translation adjustment 17,898 5,814\nProperty, plant and equipment, net $ - 219,669\n1 For the year ended July 31, 2022, $27,726 of equipment was disposed.\n2 Depreciation expense for the year ended July 31, 2022 and July 31, 2021 was $94,600 and $167,873 respectively.\nWRITE OFF OF PROPERTY, PLANT AND EQUIPMENT\nSCHEDULE OF WRITE OFF OF PROPERTY, PLANT AND EQUIPMENT\nAs of\nJuly 31, 2022\n(audited)\nAs of\nJuly 31, 2021\n(audited)\nWrite off of property and equipment $ 1,686 $ 148,982\nAccumulated depreciation (1,624 ) (80,677 )\nForeign currency translation adjustment 6,153\nTotal write off of property and equipment $ 100 $ 74,458\nDISPOSAL OF PROPERTY, PLANT AND EQUIPMENT\nSCHEDULE OF DISPOSAL OF PROPERTY, PLANT AND EQUIPMENT\nAs of\nJuly 31, 2022\n(audited)\nAs of\nJuly 31, 2021\n(audited)\nProceed from disposal of property, plant and equipment $ 44,340 $ 28,046\nDisposal of equipment at cost (27,726 ) (16,141 )\nAccumulated depreciation 10,965 4,771\nForeign currency translation adjustment (40 )\nTotal gain on disposal $ 27,539 $ 16,695\n5. LEASE\nAs of November 1, 2020, the Company recognized approximately US$19,724 lease liability as well as right-of-use asset for all leases (with the exception of short-term leases) at the commencement date. Lease liabilities are measured at present value of the sum of remaining rental payments as of November 1, 2020, with discounted rate of 4.15% adopted from Peoples Bank of China as a reference for discount rate. As of November 5, 2021, the Company had terminated the leased asset which has been recognized on November 1, 2020. Thereafter as of November 6, 2021, the Company recognized approximately US$11,581 lease liability as well as right-of-use asset for all leases at the commencement date. Lease liabilities are measured at present value of the sum of remaining rental payments as of November 6, 2021, with discounted rate of 4.35% adopted from Zhao Shang bank of China as a reference for discount rate.\nA single lease cost is recognized over the lease term on a generally straight-line basis. All cash payments of operating lease cost are classified within operating activities in the statement of cash flows.\nThe initial recognition of operating lease right and lease liability as follow:\nSCHEDULE OF RECOGNITION OF OPERATING LEASE RIGHT AND LEASE LIABILITY\nAs of\nJuly 31, 2022 As of\nJuly 31, 2021\n(Audited) (Audited)\nGross lease payable $ 12,048 $ 21,370\nLess: imputed interest (467 ) (826 )\nInitial recognition $ 11,581 $ 20,544\nAs July 31, 2022 and July 31, 2021 operating lease right of use asset as follow:\nSCHEDULE OF OPERATING LEASE RIGHT OF USE ASSET\nAs of\nJuly 31, 2022\n(Audited)\nAs of\nJuly 31, 2021\n(Audited)\nInitial recognition\n$ 20,544\n$ 250,100\nAdd: New lease addition\n11,581\n20,544\nLess: Remeasurement of existing lease\n(843 )\nLess: Termination of lease\n(20,544 )\n(250,100 )\nBalance as of July 31\n10,738\n20,544\nForeign exchange translation loss\n(564 )\n(247 )\nAccumulated amortization\n(3,907 )\n(7,331 )\nBalance end of the year\n$ 6,267\n$ 12,966\nAs July 31, 2022 and July 31, 2021 operating lease liability as follow:\nSCHEDULE OF OPERATING LEASE LIABILITY\nAs of\nJuly 31, 2022\n(Audited)\nAs of\nJuly 31, 2021\n(Audited)\nInitial recognition\n$ 20,544\n$ 250,100\nAdd: New operating lease liability\n11,581\n20,544\nLess: Remeasurement of existing lease\n(843 )\n-\nLess: Termination of lease\n(20,544 )\n(250,100 )\nLess: Foreign exchange translation gain\n(565 )\n(247 )\nLess: gross repayment\n(3,892 )\n(7,828 )\nAdd: imputed interest\nBalance as of July 31\n6,559\n12,966\nLess: lease liability current portion\n(6,042 )\n(10,319 )\nLease liability non-current portion\n$\n$ 2,647\nFor the year ended July 31, 2022, the amortization of the operating lease right of use asset was $6,745 while for year ended July 31, 2021, the amortization of the operating lease right of use asset was $7,331.\nMaturities of operating lease obligation as follow:\nSCHEDULE OF MATURITIES OF OPERATING LEASE OBLIGATION\nYear ending\nJuly 31, 2023 (12 months) 6,042\nOctober 31, 2023 (3 months)\nTotal $ 6,559\nOther information:\nSCHEDULE OF OTHER INFORMATION\nYear ended\nYear ended\nJuly 31, 2022\nJuly 31, 2021\n(Audited)\n(Audited)\nCash paid for amounts included in the measurement of lease liabilities:\nOperating cash flow from operating lease\n$ 6,185\n$ 25,733\nRight-of-use assets obtained in exchange for operating lease liabilities\n$ 6,267\n$ 12,966\nRemaining lease term for operating lease (years)\n1.25\n1.25\nWeighted average discount rate for operating lease\n4.35 %\n4.15 %\nLease expenses were $411 and $2,656 during the year ended July 31, 2022 and July 31, 2021 respectively.\n6. PATENT AND TRADEMARK\nSCHEDULE OF TRADEMARK\nAs of As of\nJuly 31, 2022 July 31, 2021\n(Audited) (Audited)\nPatent and trademark1 $ 32,404 $ 29,563\nAccumulated amortization (6,986 ) (5,425 )\nImpairment (25,392 ) -\nForeign currency translation adjustment (26 ) (22 )\nTrademark, net $ - $ 24,116\n1 The trademarks are held under the Companys subsidiaries in Hong Kong and Shanghai, China.\nAmortization expense for the year ended July 31, 2022 and July 31, 2021 was $1,561 and $3,066 respectively.\n7. PREPAYMENTS AND DEPOSITS\nSCHEDULE OF PREPAYMENTS AND DEPOSITS\nAs of As of\nJuly 31, 2022 July 31, 2021\n(Audited) (Audited)\nPrepayments $ 40,382 $ 41,501\nDeposits 4,712 60,187\nTotal prepayments and deposits $ 45,094 $ 101,688\n8. AMOUNT DUE FROM RELATED PARTY\nSCHEDULE OF DUE FROM RELATED PARTY\nAs of As of\nJuly 31, 2022 July 31, 2021\n(Audited) (Audited)\nTien Mu International Co., Ltd1 $ 11,295 $ 10,425\nTotal amount due from related party $ 11,295 $ 10,425\n1 Tien Mu International Co., Ltd is owned by Ms. Niu Yen-Yen, the Director and Chief Executive Officer of the Company. Tien Mu International Co., Ltd is an operating agent of the Companys operation in Taiwan, which collects deposits from franchisees on behalf of the Company.\n9. INVENTORIES\nSCHEDULE OF INVENTORIES\nAs of As of\nJuly 31, 2022 July 31, 2021\n(Audited) (Audited)\nFinished goods, at cost $ 16,483 $ 38,374\nTotal inventories $ 16,483 $ 38,374\n10. LOAN FROM RELATED PARTY\nSCHEDULE OF LOAN FROM RELATED PARTY\nAs of\nJuly 31, 2022\nAs of\nJuly 31, 2021\n(Audited) (Audited)\nHong Ting Network Technology (Xiamen) Limited1\nCurrent $ 43,175 $ -\nNon-current - 52,620\nTotal loan from related party $ 43,175 $ 52,620\nHong Ting Network Technology (Xiamen) Limited is wholly-owned by Ms. Niu Yen-Yen, who is also the Director and Chief Executive Officer of the Company. The loan is unsecured, interest-free and repayable on May 31,2021 and further extended to May 31, 2023 with a loan agreement entered on September 2, 2021.\n11. LOAN FROM THIRD PARTY\nSCHEDULE OF LOAN FROM THIRD PARTY\nAs of\nJuly 31, 2022\nAs of\nJuly 31, 2021\n(Audited) (Audited)\nShang Hai Shi Ba Enterprise Management Centre $ 77,064 $ 85,895\nTotal loan from third party $ 77,064 $ 85,895\nThe loan is unsecured, interest-free and repayable in year 2024 and year 2025.\n12. LOAN FROM DIRECTOR\nSCHEDULE OF LOAN FROM DIRECTOR\nAs of\nJuly 31, 2022\nAs of\nJuly 31, 2021\n(Audited)\n(Audited)\nCurrent $ 146,439 $ 138,443\nNon-current 122,652 136,193\nTotal loan from director $ 269,091 $ 274,636\nThe loan provided by director Niu Yen-Yen is unsecured, interest-free and repayable in year 2024, for working capital purpose.\n13. OTHER PAYABLES AND ACCRUED LIABILITIES\nSCHEDULE OF OTHER PAYABLES AND ACCRUED LIABILITIES\nAs of As of\nJuly 31, 2022 July 31, 2021\n(Audited) (Audited)\nOther payables1 $ 45,865 $ 2,942\nAccrued audit fees 15,000 14,000\nAccrued professional fees 5,000 5,150\nTotal other payables and accrued liabilities $ 65,865 $ 22,092\n1 As of July 31, 2022, other payables include the amount due to Wu, Chun-Teh, who was a shareholder and staff of the Company as of July 31, 2021.\nMU GLOBAL HOLDING LIMITED.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED JULY 31, 2022 AND 2021\n(Currency expressed in United States Dollars (US$), except for number of shares)\n14. AMOUNT DUE TO RELATED PARTIES\nSCHEDULE OF DUE TO RELATED PARTIES\nAs of\nJuly 31, 2022\nAs of\nJuly 31, 2021\n(Audited) (Audited)\nWu, Chun-Teh1 $ - $ 42,177\nHsieh, Chang-Chung2 85,076 53,276\n$ 85,076 $ 95,453\nAs of July 31, 2022, the balance $85,076 represented an outstanding payable to related parties.\n1 As of July 31, 2021, Wu, Chun-Teh was a shareholder of the Company, at the same time providing consultation services to the Company and also staff of the Company, has paid operational expenses such as renovation cost, rental and staff salaries on behalf of the Company. As of July 31, 2022, Wu, Chun-Teh sold entire of his shares in the Company and was no longer being staff of the Company.\n2 Hsieh, Chang-Chung is the Chief Financial Officer (Principal Financial Officer, Principal Accounting Officer) of the Company, and the amount represents the salary expense accrued.\nThe amounts due to related parties are unsecured, interest-free with no fixed repayment term and for working capital purpose.\n15. INCOME TAXES\nFor the year ended July 31, 2022 and July 31, 2021, the local (United States) and foreign components of loss before income taxes were comprised of the following:\nSCHEDULE OF LOSS BEFORE INCOME TAX\nYear ended\nJuly 31, 2022 Year ended\nJuly 31, 2021\n(Audited) (Audited)\nTax jurisdictions from:\n- Local $ (52,675 ) $ (51,144 )\n- Foreign, representing\nSeychelles (2,101 ) (1,000 )\nHong Kong (97,033 ) (66,837 )\nPeoples Republic of China (PRC) (205,524 ) (267,963 )\nLoss before income tax $ (357,333 ) $ (386,944 )\nThe provision for income taxes consisted of the following:\nSCHEDULE OF PROVISION FOR INCOME TAXES\nYear ended\nJuly 31, 2022 Year ended\nJuly 31, 2021\n(Audited) (Audited)\nCurrent:\n- Local $ - $ -\n- Foreign - -\nDeferred:\n- Local - -\n- Foreign - -\nIncome tax expense $ - $ -\nThe effective tax rate in the periods presented is the result of the mix of income earned in various tax jurisdictions that apply a broad range of income tax rates. The Company and its subsidiary that operate in various countries: United States, Seychelles, Hong Kong, and PRC that are subject to taxes in the jurisdictions in which they operate, as follows:\nUnited States of America\nThe Company is registered in the State of Nevada and is subject to the tax laws of the United States of America. As of July 31, 2022, the operations in the United States of America incurred $439,584 of cumulative net operating losses which can be carried forward indefinitely to offset a maximum of 80% future taxable income. The Company has provided for a full valuation allowance of $351,667 against the deferred tax assets on the expected future tax benefits from the net operating loss carryforwards as the management believes it is more likely than not that these assets will not be realized in the future.\nSeychelles\nUnder the current laws of the Seychelles, MU Worldwide Group Limited is registered as an international business company and governed by the International Business Companies Act of Seychelles. There is no income tax charged in Seychelles.\nHong Kong\nMU Global Holding Limited is subjected to Hong Kong Profits Tax, which is charged at the statutory income tax rate of 16.5% on its assessable income.\nShanghai\nMU Global Health Management (Shanghai) Limited operates in the PRC and is subjected to the Corporate Income Tax governed by the Income Tax Law of the PRC with a unified statutory income tax rate of 25%.\nMU GLOBAL HOLDING LIMITED\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED JULY 31, 2022 AND 2021\n(Currency expressed in United States Dollars (US$), except for number of shares)\n16. CONCENTRATIONS OF RISKS\n(a) Major customers\nFor the year ended July 31, 2022, and 2021, the customers who accounted for 10% or more of the Companys revenues and its accounts receivable balance at period-end are presented as follows:\nSCHEDULES OF CONCENTRATION OF RISK\n2021\nRevenues Percentage of\nrevenues Accounts\nreceivable, trade\n(Audited) (Audited) (Audited)\nCustomer A $ - $ 10,642 - % 16 % $ - $ -\nCustomer B - 13,302 - % 20 % - -\nCustomer C 37,062 18,243 79 % 28 % - -\n$ 37,062 $ 42,187 79 % 64 % $ - $ -\n(b) Major suppliers\nFor the year ended July 31, 2022, there are no vendors who accounted for 10% or more of the Companys purchase and the accounts payable balances at period-end.\n(c) Major suppliers for property, plant and equipment\nFor the year ended July 31, 2022, the Company purchased property, plant and equipment from Rongzi Co., which accounted for 100% the total purchases of property, plant and equipment during the year.\n(d) Exchange rate risk\nThe operation of the Companys subsidiaries in international markets results in exposure to movements in currency exchange rates. We have experienced foreign currency gains and losses due to the strengthening and weakening of the U.S. dollar. The potential of volatile foreign exchange rate fluctuations in the future could have a significant effect on our results of operations. The Company has not historically used financial instruments to hedge its foreign currency exchange rate risks.\nThe currencies that create a majority of the Companys exchange rate exposure are RMB, HK$, and TWD. The Company translates all assets and liabilities at the rate of exchange in effect at the balance sheet date and income and expense activity at the approximate rate of exchange at the transaction date.\n17. COMMITMENTS AND CONTINGENCIES\nOn November 6, 2021, the Company entered into a contract rental agreement to rent the office in Shanghai for a period of one year commencing on November 6, 2021 with tri-monthly payments in the amount of RMB 3,500 per month over the course of the lease and an entitlement of 1 month rent free period as relief upon rented the premise for full 11 months. The Company has an option to renew after the end of the agreement. On October 18, 2022, the Company has renewed the tenancy agreement for 12 months with tri-monthly payments in the amount of RMB 3,500 per month over the course of the lease from November 6, 2022 to November 5, 2023 and is entitled for 1 month rent free period as relief upon rented the premise for full 11 months.\nAs of July 31, 2022, the Company has the aggregate minimal rent payments due in the next two years as follows:\nSCHEDULE OF AGGREGATE MINIMAL RENT PAYMENTS\nYear ending July 31\n$ 5,709\n1,038\nTotal $ 6,747\n18. RELATED PARTY TRANSACTIONS\nFor the year ended July 31, 2022 and 2021, the Company has following transactions with related parties:\nSCHEDULE OF OUTSTANDING PAYABLE TO RELATED PARTY\nYear ended\nJuly 31, 2022 Year ended\nJuly 31, 2021\n(Audited) (Audited)\nProfessional fee paid:\n- Related party A $ 16,580 $ 26,460\nConsultation fee paid:\n- Related party B $ 32,400 $ 21,800\n- Related party C $ - $ 10,500\nTotal $ 48,980 $ 58,760\nRelated party A is the fellow subsidiaries of a corporate shareholder of the Company. Related party B and C are the shareholders of the Company.\nFor the year ended July 31, 2022, the Company incurred professional fees of $16,580 due to related party A. Related party B and C are consultant of the Company and have provided consultancy service for business operation.\n19. SEGMENT INFORMATION\nASC 280, Segment Reporting establishes standards for reporting information about operating segments on a basis consistent with the Companys internal organization structure as well as information about services categories, business segments and major customers in financial statements. In accordance with the Segment Reporting Topic of the ASC, the Companys chief operating decision maker has been identified as the Chief Executive Officer and President, who reviews operating results to make decisions about allocating resources and assessing performance for the entire Company. Existing guidance, which is based on a management approach to segment reporting, establishes requirements to report selected segment information quarterly and to report annually entity-wide disclosures about products and services, major customers, and the countries in which the entity holds material assets and reports revenue. All material operating units qualify for aggregation under Segment Reporting due to their similar customer base and similarities in economic characteristics; nature of products and services; and procurement, manufacturing and distribution processes.\nThe Company had no inter-segment sales for the years presented. Summarized financial information concerning the Companys reportable segments is shown as below:\nSCHEDULE OF SEGMENT REPORTING INFORMATION\nBy Geography:\nFor the year ended July 31, 2022\nNevada Seychelles Hong Kong China Total\nRevenue $ - $ - $ - $ 46,702 $ 46,702\nCost of revenue - - - (21,891 ) (21,891 )\nOther income - - 27,781\n22,255\n50,036\nSelling and marketing expenses - (13 ) (103\n) (3,354\n) (3,470\n)\nGeneral and administrative expenses (52,675\n) (2,088\n) (124,711\n) (249,236\n) (428,710\n)\nNet loss before taxation (52,675 ) (2,101 ) (97,033 ) (205,524 ) (357,333 )\nTotal assets $ 3,075 $ 1 $ 15,551 $ 63,421 $ 82,048\nFor the year ended July 31, 2021\nNevada Seychelles Hong Kong China Total\nRevenue $ - $ - $ 196 $ 64,755 $ 64,951\nCost of revenue - - - (17,218 ) (17,218 )\nOther income - - 15,639\n20,505\n36,144\nSelling and marketing expenses - - - (7,180\n) (7,180\n)\nGeneral and administrative expenses (51,144\n) (1,000\n) (82,672\n) (328,825\n) (463,641\n)\nNet loss before taxation (51,144 ) (1,000 ) (66,837 ) (267,963 ) (386,944 )\nTotal assets $ - $ - $ 130,602 $ 296,867 $ 427,469\n20. SIGNIFICANT EVENTS\nOn January 30, 2020, the World Health Organization (WHO) announced a global health emergency because of a new strain of coronavirus originating in Wuhan, China (the COVID-19 outbreak) and the risks to the international community as the virus spreads globally beyond its point of origin. In March 2020, the WHO classified the COVID-19 outbreak as a pandemic, based on the rapid increase in exposure globally.\nThe full impact of the COVID-19 outbreak continues to evolve as of the date of this report. As such, it is uncertain as to the full magnitude that the pandemic will have on our financial condition, liquidity, and future results of operations. Management is actively monitoring the impact of the global situation on our financial condition, liquidity, operations, suppliers, industry, and workforce. Given the daily evolution of the COVID-19 outbreak and the global responses to curb its spread, we are not able to estimate the effects of the COVID-19 outbreak on our results of operations, financial condition, or liquidity for the year ended July 31, 2022.\nThe Management had considered the impact of COVID-19 outbreak in China, which would have affected the financial position, performance and cash flow of the Company for the financial year ended July 31, 2021. It was concluded that the impact of non-adjusting events arising from COVID-19 outbreak has not significantly affected the fair value of the financial assets or liabilities and non-financial assets of the Company, including the classification of non-current and current items that were presented on the reporting date.\n21. SUBSEQUENT EVENTS\nIn accordance with ASC Topic 855, Subsequent Events, which establishes general standards of accounting for and disclosure of events that occur after the balance sheet date but before financial statements are issued, the Company has evaluated all subsequent events through the filing date of this Form 10-K with the SEC, to ensure that this filing includes appropriate disclosure of events both recognized in the financial statements as of July 31, 2022, and events which occurred subsequently but were not recognized in the financial statements. During the year, there was no subsequent event that required recognition or disclosure."
}