{
    "cik": "1750777",
    "company": "Hawkeye Systems, Inc.",
    "filing_type": "10-K",
    "filing_date": "2022-12-14",
    "period_of_report": "2022-06-30",
    "sic": "3861",
    "state_of_inc": "NV",
    "state_location": "GA",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1750777/0001477932-22-009275-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1750777/000147793222009275/hwke_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1750777/0001477932-22-009275.txt",
    "filename": "1750777_10K_2022_0001477932-22-009275.htm",
    "content": "Item 1. Description of Business\nGeneral\nWe were incorporated on May 15, 2018 in the State of Nevada. We are a technology holding company, our previous focus was on pandemic management products and services. We are currently seeking other opportunities, while actively trying to liquidate mask inventory and wind-up existing deals. The Company looks to license and acquire technology that improves life and to work with partners to develop cutting edge, smart products for a variety of markets. From inception until the date of this filing our activities have primarily consisted of (i) the incorporation of our company, (ii) the development of our business plan and the evaluation of strategic investment and business development strategies, (iii), recruiting and adding additional consultants and employees, and (iv) liquidating our stock of personal protective equipment (PPE) products through numerous sources.\nOur business office is located at 6605 Abercorn, Suite 204, Savannah, GA 31405. Our telephone number is 912-388-6720 and our website is www.hawkeyesystemsinc.com.\nBusiness Description\nIn July 2021, the Companys management determined to cease the Companys operations as a seller of PPE, deeming that continuing operations in that sector was not a productive use of the Companys resources.\nOur current business plan is to serve as a vehicle for the acquisition of or merger or consolidation with another company (a target business). We intend to use capital stock, debt or a combination of these to effect a business combination with a target business which we believe has significant growth potential. The business combination may be with a financially stable, mature company or a company that is in its early stages of development or growth, which could include companies seeking to obtain capital and to improve their financial stability.\nWe will not restrict our search for target businesses to any particular industry. Rather, we may investigate businesses of essentially any kind or nature and participate in any type of industry that may, in our managements opinion, meet our business objectives as described in this annual report. We emphasize that the description in this report of our business objectives is extremely general and is not meant to restrict the discretion of our management to search for and enter potential business opportunities. We have not chosen the industry or business in which we will engage and have not conducted any market studies with respect to any business or industry for you to evaluate the possible merits or risks of the target business or the industry in which we may ultimately operate. To the extent we enter into a business combination with a financially unstable company or an entity in its early stage of development or growth, including entities without established records of sales or earnings, we will become subject to numerous risks inherent in the business and operations of financially unstable and early stage or potential emerging growth companies. In addition, to the extent that we effect a business combination with an entity in an industry characterized by a high level of risk, we will become subject to the currently unascertainable risks of that industry. An extremely high level of risk frequently characterizes certain industries that experience rapid growth. In addition, although we will endeavor to evaluate the risks inherent in a particular industry or target business, we cannot assure you that we will properly ascertain or assess all significant risk factors.\nSources of target businesses\nWe anticipate that target business candidates will be brought to our attention from various unaffiliated sources, including securities broker-dealers, investment bankers, venture capitalists, bankers, and other members of the financial community, who may present solicited or unsolicited proposals. Our officers and directors and their affiliates may also bring to our attention target business candidates. While we do not presently anticipate engaging the services of professional firms that specialize in business acquisitions on any formal basis, we may engage such firms in the future, in which event, we may pay a finders fee or other compensation for such introductions if they result in consummated transactions. These fees are customarily between 5% and 25% of the size of the overall transaction, based upon a sliding scale of the amount involved and a variety of other factors.\nSelection of a target business and structuring of a business combination\nOur management will have significant flexibility in identifying and selecting a prospective target business. In evaluating a prospective target business, our management will consider, among other factors, the following:\n·\nthe financial condition and results of operation of the target;\n·\nthe growth potential of the target and that of the industry in which the target operates;\n·\nthe experience and skill of the targets management and availability of additional personnel;\n·\nthe capital requirements of the target;\n·\nthe competitive position of the target;\n·\nthe stage of development that the targets products, processes, or services are at;\n·\nthe degree of current or potential market acceptance of the targets products, processes, or services;\n·\nproprietary features and the degree of intellectual property or other protection of the targets products, processes, or services\n·\nthe regulatory environment of the industry in which the target operates;\n·\nthe prospective equity interest in, and opportunity for control of, the target; and\n·\nthe costs associated with effecting the business combination.\nThese criteria are not intended to be exhaustive. Any evaluation relating to the merits of a particular business combination will be based, to the extent relevant, on the above factors as well as other considerations deemed relevant by our management in connection with effecting a business combination consistent with our business objective. In connection with our evaluation of a prospective target business, we anticipate that we will conduct an extensive due diligence review that will encompass, among other things, meetings with incumbent management and inspection of facilities, as well as a review of financial or other information that will be made available to us.\nWe will endeavor to structure a business combination to achieve the most favorable tax treatment to us, the target business and both companies stockholders. We cannot assure you, however, that the Internal Revenue Service or appropriate state tax authority will agree with our tax treatment of the business combination.\nUntil we are presented with a specific opportunity for a business combination, we are unable to ascertain with any degree of certainty the time and costs required to select and evaluate a target business and to structure and complete the business combination. We have two full-time employees devoting their time to our affairs. Any costs incurred in connection with the identification and evaluation of a prospective target business with which a business combination is not ultimately completed will result in a loss to us and reduce the amount of capital otherwise available to complete a business combination.\nLimited ability to evaluate the target business management\nAlthough we intend to scrutinize the management of a prospective target business before effecting a business combination, we cannot assure you that our assessment of the targets management will prove to be correct, especially considering the possible inexperience of our officers and directors in evaluating certain types of businesses. In addition, we cannot assure you that the targets future management will have the necessary skills, qualifications, or abilities to manage a public company. Furthermore, the future role of our officers and directors, if any, in the target business cannot presently be stated with any certainty. While it is possible that one or more of our officers and directors will remain associated in some capacity with us following a business combination, it is unlikely that any of them will devote their full efforts to our affairs after a business combination. Moreover, we cannot assure you that our officers and directors will have significant experience or knowledge relating to the operations of the target business.\nWe may seek to recruit additional managers to supplement the incumbent management of the target business. We cannot assure you, however, that we will be able to recruit additional managers who have the requisite skills, knowledge, or experience necessary to enhance the incumbent management.\nInvestment Company Act\nThe Investment Company Act of 1940 (the Investment Company Act) defines an investment company as any issuer which is or holds itself out as being engaged primarily, or proposes to engage primarily, in the business of investing, reinvesting, or trading in securities. We may participate in a business or opportunity by purchasing, trading, or selling the securities of a business. However, as we do not intend to engage primarily in these activities, we believe that we do not fall under the Investment Company Acts definition of investment company, and we do not intend to register the Company as an investment company under the Investment Company Act. We do not believe that registration under the Investment Company Act is required based upon our proposed activities. We intend to conduct our activities so as to avoid being classified as an investment company and avoid application of the costly and restrictive registration and other provisions of the Investment Company Act and its regulations.\nThe Investment Company Act may, however, also be deemed to be applicable to a company that does not intend to be characterized as an investment company but that, nevertheless, engages in activities that may be deemed to be within the definition and scope of certain provisions of the Investment Company Act. While we do not believe that our anticipated principal activities will subject us to regulation under the Investment Company Act, we cannot assure you that we will not be deemed to be an investment company, especially during the period prior to a business combination. In the event we are deemed to be an investment company, we may become subject to certain restrictions relating to our activities and regulatory burdens, including:\n·\nrestrictions on the nature of our investments; and\n·\nthe issuance of securities,\nand have imposed upon us certain requirements, including:\n·\nregistration as an investment company;\n·\nadoption of a specific form of corporate structure; and\n·\ncompliance with certain burdensome reporting, recordkeeping, voting, proxy and disclosure requirements and other rules and regulations.\nIn the event we are characterized as an investment company, we would be required to comply with these additional regulatory burdens, which would require additional expense.\nIntellectual Property\nThe Company currently does not own any intellectual property, and directly acquiring the intellectual property of a third party is not part of our current strategy.\nRegulation\nIn our current business we are subject to local, state, federal and foreign governmental laws and regulations. Upon completion of an acquisition, we will have significant additional regulation based on the nature of the business.\nInvestment in HIE LLC\nOn July 17, 2020, the Company entered into a membership agreement with Eagle Equities LLC (Eagle) and Ikon Supplies (Ikon) for the purpose of procuring, funding the purchase of and sale of PPE (the Membership Agreement). To pursue this objective, the parties agreed to form a Nevada limited liability company, HIE, LLC (HIE). According to the terms and conditions of the Membership Agreement, HIE would be terminated and dissolved upon the earliest to occur of: (i) the sale of HIEs interest in the procurement, financing, transportation, sale and disposition of PPE; (ii) the refusal or inability of any party to comply with the requirements, obligations or stipulations of the Membership Agreement; (iii) the unanimous agreement of the parties; or (iv) the order of a court of competent jurisdiction. Eagle, Ikon and the Company would participate each in 33% of any net profits generated by HIE. Eagle contributed to HIE by providing and arranging to procure a loan (the Origination Loan), sufficient to cover all capital needed for each PPE purchase (a Deal); and additional funds, as needed, to cover additional expenses towards the costs of goods (Additional Contribution). The Company contributed by assigning its agreement to purchase gloves and agreed to issue convertible promissory notes to Eagle to secure the Origination Loan and any Additional Contribution. The parties agreed to pay an equal portion of all administrative expenses incurred by HIE. In the event of a loss of capital, all parties shall contribute to repay the Origination Loan and Additional Contribution with each paying 33.3% of the loss.\nThe proceeds of each Deal shall be first distributed to Eagle, as repayment for any Additional Contribution. The next proceeds will be allocated to the repayment of the Origination Loan. After the Origination Loan is repaid, net proceeds will be distributed as follows: (i) Eagle shall receive the greater of $0.25 per box of gloves or 33.3% of the net proceeds. If net proceeds are more than $0.25, but less than $0.75 per box, once the first $0.25 is paid to Eagle, the Company and Ikon will share in the remaining profits equally. If the net profits are more than $0.75 per box, all the parties will receive 33.3% of the net profits. Net losses shall be allocated between the parties which each being allocated 33.3%.\nHIE will be managed by a manager appointed by the parties in accordance with a policy established by the policy committee. Each of the Company and Ikon will have 25 votes in the policy committee and Eagle will have 50 votes.\nIn October 2022, HIE provided the Company with its financial statements. HIE incurred a net gain of $59,208 between July 01, 2021 and June 30, 2022, and a net loss of 1,385,962 between July 01, 2020 to June 30, 2021, of which the Company has recorded a gain on investment of $19,736, and a loss on investment of $461,987, in fiscal year end of June 30, 2022, and 2021, respectively.\nCompany Policies\nThe Company has adopted the following policies: (i) code of conduct policy; (ii) information security policy; and (iii) public company communication policy.\nEmployees\nThe Company currently has two full time employees.\nLegal Proceedings\nThe Company is not currently a party to any material legal proceedings and is not aware of any material threatened litigation.\nOffices\nOur current executive offices are provided by management of the Company. We do not pay any rent, and there is no agreement to pay any rent in the future. Item 1A. Risk Factors.\nWe are a smaller reporting company as defined in Rule 12b-2 of the Exchange Act and are not required to provide the information required under this item. Item 1B. Unresolved Staff Comments\nWe are a smaller reporting company as defined in Rule 12b-2 of the Exchange Act and are not required to provide the information required under this item. Item 2. Properties.\nWe own no properties related to our operations. We operate from business offices provided by our executive officers. Item 3. Legal Proceedings.\nOn September 19, 2019, the Company entered into a Stock Purchase Agreement with Radiant Images, Inc., a California corporation (Radiant), as well as Radiants shareholder Gianna Wolfe (Wolfe) and key employee, Michael Mansouri (Mansouri), pursuant to which the Company would acquire 100% of the shares of common stock (the Shares) of Radiant from Wolfe, resulting in the acquisition of Radiant. In April 2020, the Company received notice from Radiant of their intent to terminate the Companys acquisition agreement. Although the Company believes that the termination is not legally valid, the Company ceased further discussions with respect to the acquisition and engaged counsel to pursue litigation for repayment of amounts due by Radiant. The Companys investment in Radiant was structured as a revolving note has been classified as a Note Receivable from Radiant due with accrued but unpaid interest. Pursuant to the terms of the revolving note, Radiant is required to repay the money already invested to Hawkeye with interest. The note receivable was issued on April 26, 2019, is due upon demand of the Company at any time commencing April 26, 2020. The interest rate on the note is 12% and accrues daily on the outstanding balance. At June 30, 2020 interest income of $154,042 had been accrued on the note. Under accounting treatment, this note and interest are impaired on our balance sheet while we resolve this dispute. We had filed a complaint against Radiant and its principals and intended to vigorously pursue this matter and litigation. The dispute was amicably resolved by the parties by means of a Settlement Agreement and Release of All Claims dated November 17, 2021, whereby the Company as plaintiff and cross-defendant released, and was in turned released, by Radiant, Gianna Wolfe and Michael Mansouri from any and all claims in connection with the stock purchase agreement and revolving note. No payment was due to or made by the Company in connection with the settlement and release of this action.\nOn November 13, 2019, 5W Public Relations LLC (5W) filed a complaint against Hawkeye Systems, Inc. relating to payments allegedly due under a contract for public relations services. Hawkeye vigorously disputed the allegations in the complaint as 5W Public Relations provided virtually no services to Hawkeye during the term of this arrangement but was paid a substantial amount of funds. Hawkeye engaged counsel to provide counterclaims for failure of consideration, fraud in the inducement, general fraud, and other causes of action. This proceeding was resolved by a Stipulation of Settlement dated May 19, 2022, filed with the Supreme Court of the State of New York. The Company settled all of 5Ws claims for the sum of $30,000.\nOther than the foregoing, we are not aware of any legal proceedings contemplated by any governmental authority or any other party involving us or our properties. As of the date of this report, no director, officer, or affiliate is (i) a party adverse to us in any legal proceeding, or (ii) has an adverse interest to us in any legal proceedings. We are not aware of any other legal proceedings pending or that have been threatened against us or our properties.\nFrom time to time the Company may be named in claims arising in the ordinary course of business. Currently, no legal proceedings or claims, other than those disclosed above, are pending against or involve the Company that, in the opinion of management, could reasonably be expected to have a material adverse effect on its business and financial condition. Item 4. Mine Safety Disclosures.\nNot applicable\nPART II Item 5. Market for Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities.\nOur common stock is quoted on the OTC Bulletin Board under the symbol HWKE. On June 12, 2019, the Company obtained clearance to trade on OTC Markets and on September 12, 2019 the Companys stock began trading on the OTCQB market maintained by OTC Markets. Quotations reflect inter-dealer prices, without retail mark-up, mark-down or commission, and may not represent actual transactions. The closing sale price of our common stock on December 14, 2022 was $0.018 per share.\nBelow is a table indicating the range of high and low closing price information for the common stock as reported by the OTC Markets Group for the periods listed. These prices do not necessarily reflect actual transactions.\nHigh\nLow\nJune 30, 2022 to date\n$ 0.02\n$ 0.01\nQuarter ended June 30, 2022\n$ 0.05\n$ 0.02\nQuarter ended March 31, 2022\n$ 0.06\n$ 0.04\nQuarter ended December 31, 2021\n$ 0.13\n$ 0.02\nQuarter ended September 30, 2021\n$ 0.14\n$ 0.06\nQuarter ended June 30, 2021\n$ 0.13\n$ 0.06\nQuarter ended March 31, 2021\n$ 0.55\n$ 0.13\nHolders\nAs of December 14, 2022, there were approximately 983 record holders of our common stock. This does not include the holders of our common stock who held their shares in street name as of that date.\nDividends\nWe have never paid or declared any cash dividends on our common stock and do not anticipate paying cash dividends in the foreseeable future but rather intend to retain future earnings, if any, for reinvestment in our future business. Any future determination to pay cash dividends will be in compliance with our contractual obligations and otherwise at the discretion of the board of directors and based upon our financial condition, results of operations, capital requirements and such other factors as the board of directors deems relevant.\nTransfer Agent\nOur registrar and transfer agent is VStock Transfer, LLC.\nRecent Sales of Unregistered Securities\nConvertible Promissory Note 1\nOn April 6, 2020, the Company and Steve Hall (the Lender), an investor who holds 75% of the Companys shares of common stock, entered into a convertible promissory note agreement for the principal amount of $250,000 with simple interest accruing at 10% per annum, if repaid within 90 days, and simple interest accruing at 20% per annum if repaid thereafter. The convertible note was extended to April 6, 2022. At the option of holder, the note is convertible into shares of common stock of the Company at any time, during the six months following the date of issuance until the one-year anniversary of the date of issuance at a conversion price of $0.25 per share.\nOn September 1, 2021, the Company authorized the issuance of 8,829,910 shares of common stock at $0.036 per share to convert the principal balance of the convertible notes equivalent to $250,000, plus accrued interest of $64,880. The aggregate total of $314,880 was recorded as stock payable as of June 30, 2022. The shares were issued on July 28, 2022.\nIn consideration for the loan of $250,000, the Company also granted to the Lender 100,000 stock options exercisable at $0.25 for a two-year term. The options vested upon issuance of the note, and eventually exercised into 80,000 shares of common stock at purchase price of $0.04 per share on November 02, 2021.\nConvertible Promissory Note 2\nOn December 15, 2020, the Company and Steve Hall (the Lender), an investor who holds 75% of the Companys shares of common stock, entered into a convertible promissory note agreement for the principal amount of $250,000 with simple interest accruing at 10% per annum, if repaid within 90 days, and simple interest accruing at 20% per annum if repaid thereafter. The convertible note was due on December 15, 2021. At the option of holder, this note is convertible to shares of the Companys common stock, at any time during the six months following the date of issuance until the one-year anniversary of issuance date at a conversion price of $0.25 per share.\nIn consideration for the $250,000 loan, the company also granted the lender 100,000 stock options, exercisable at $0.25, for a period of two years. These options vested upon the issuance of the notes and eventually exercised for 80,000 common shares at a purchase price of $0.04 each on November 2, 2021.\nEffective September 1, 2021, the company authorized the issuance of 7,836,757 common shares to be converted into the principal amount of the convertible note, equivalent to $250,000, plus accrued interest of $29,644. The aggregate total of $279,464 was recorded as stock payable as of June 30, 2022. The shares were issued on July 28, 2022.\nRestricted Common Stocks - Richard Cutler\nOn May 23, 2022, the Company granted 500,000 shares of restricted common stock as compensation to Richard Cutler, a director. The shares where appraised at $20,000 and were granted in lieu of cash compensation, contingent upon completion of an acquisition or reverse takeover. The shares are still in the process of issuing.\nRestricted Common Stocks - Christopher Mulgrew\nOn May 23, 2022, the Company granted 250,000 shares of restricted common stock as compensation to Christopher Mulgrew, the Companys Chief Finance Officer. The shares where appraised at $10,000 and were granted in lieu of cash compensation, contingent upon completion of an acquisition or reverse takeover. The stocks are still in the process of issuing. Item 6. Selected Financial Data.\nNot applicable. Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations.\nThe following discussion relates to the historical operations and financial statements of Hawkeye Systems, Inc. for the fiscal year ended June 30, 2022.\nForward-Looking Statements\nThe following Managements Discussion and Analysis should be read in conjunction with our financial statements and the related notes thereto included elsewhere in this annual report. The Managements Discussion and Analysis contains forward-looking statements that involve risks and uncertainties, such as statements of our plans, objectives, expectations and intentions. Any statements that are not statements of historical fact are forward-looking statements. When used, the words believe, plan, intend, anticipate, target, estimate, expect, and the like, and/or future-tense or conditional constructions (will, may, could, should, etc.), or similar expressions, identify certain of these forward-looking statements. These forward-looking statements are subject to risks and uncertainties that could cause actual results or events to differ materially from those expressed or implied by the forward-looking statements in this annual report. Our actual results and the timing of events could differ materially from those anticipated in these forward-looking statements. Factors that could cause or contribute to such differences in results and outcomes include, without limitation, those specifically addressed under the heading \"Risks Factors\" in our various filings with the Securities and Exchange Commission. We do not undertake any obligation to update forward-looking statements to reflect events or circumstances occurring after the date of this annual report.\nFinancial Condition and Results of Operations\nWe have incurred recurring losses to date. Our financial statements have been prepared assuming that we will continue as a going concern and, accordingly, do not include adjustments relating to the recoverability and realization of assets and classification of liabilities that might be necessary should we be unable to continue our operations.\nWe expect we will require additional capital to develop our business plan. We expect to raise additional capital through, among other things, the sale of equity or debt securities.\nResults of Operations\nFiscal Years Ended June 30, 2022 and 2021\nthe Company had $0 operating revenues during fiscal year 2022 as the Company ceased operations of its PPE business since July 2021. In our fiscal year ended June 30, 2021, we had operating revenues of $2,556,942. Cost of sales was $2,576,875 resulting in gross loss of $19,933, or (0.8%). These revenues are from the sale of PPE products.\nTotal operating expenses in the year ended June 30, 2022 were $1,230,468 compared to $2,583,100 for the same period in 2021. The decrease in operating expenses is primarily a result of company downsizing. The Companys net loss was $1,288,802 for the fiscal year ended June 30, 2022 compared to $5,203,820 for the fiscal year ended June 30, 2021. The net loss for the fiscal year 2022 is primarily a result of operating expenses, and interest expense.\nDuring our fiscal year 2021, total operating expenses were $2,583,100 compared to $2,217,981 for the same period in 2020. The increase in operating expenses is primarily a result of increased write down of inventory. The Companys net loss was $5,203,820 for the fiscal year ended June 30, 2021 compared to $2,600,468 for the fiscal year ended June 30, 2020. The net loss for the fiscal 2021 is primarily a result of operating expenses, financing expense, loss on settlement of debt and, loss on investment in HIE.\nLiquidity and Capital Resources\nOur cash balance at June 30, 2022 was $325 compared to $282,131 at June 30, 2021. We do not believe these cash reserves are sufficient to cover our expenses for our operations for fiscal year ending June 30, 2022. We will require additional funding for our ongoing operations.\nDuring our fiscal year ended June 30, 2022, the Company issued common stock valued at $30,000 in connection with a settlement of accounts payable. In addition, the Company issued common stock valued $477,000 associated with stock payables settlements by related parties.\nAs of our fiscal year ended June 30, 2021, we raised approximately $20,000 from private offerings of our common stock and an additional $67,500 from exercise of warrants. We raised additional funds of $500,000, net from a related party, which is included in inventory financing payable and $250,000 from convertible notes related party.\nIn addition, we intend to raise funds through the sale of equity and the exercise of warrants issued in private placements. Although to date we have had some warrant exercises for cash, there can be no assurance that we will be able to raise money through offerings or through the exercise of warrants. If we cannot raise any additional financing prior to the expiration of the first quarter of 2023, we believe we will be able to obtain loans from management in the future, if necessary, but have no agreement in writing.\nWe are a smaller reporting company and have accumulated losses to date. Under a limited operations scenario to maintain our corporate existence, we believe we will require additional funds over the next 12 months to complete our regulatory reporting and filings. However, we will require maximum participation through private placements, warrant exercises or alternative financings to implement our business plan.\nThere are no assurances that we will be able to obtain further funds required for our continued operations. Even if additional financing is available, it may not be available on terms we find favorable. Failure to secure the needed additional financing will have an adverse effect on our ability to remain in business.\nPlan of Operation and Funding\nWe expect that working capital requirements will continue to be funded through equity offerings, warrant exercises, and related party advances in the near future. We have no guarantees or firm commitments that the related party advances will continue in the near future.\nExisting working capital, further advances, together with anticipated capital raises are expected to be adequate to fund our operations over the next twelve months, but there is no guarantee that we will be successful in raising enough capital, or that we will receive the cash flow required to fund our operations. We have no lines of credit with banking institutions or other bank financing arrangements, we do have a line a credit form a related party (see Note 7 to the Financial Statements). Generally, we have financed operations to date through proceeds from the sale of our common stock, warrant exercises and convertible loans.\nManagement anticipates additional increases in operating expenses relating to: (i) developmental expenses; and (ii) legal and accounting fees, required to complete our filings with the SEC. We intend to finance these expenses with issuances of securities and through the exercise of outstanding warrants.\nAdditional issuances of equity or convertible debt securities will result in dilution to our current shareholders. Further, such securities might have rights, preferences, or privileges senior to our common stock. Additional financing may not be available upon acceptable terms, or at all. If adequate funds are not available or are not available on acceptable terms, we may not be able to continue our operations.\nMaterial Commitments\nAs of the date of this annual report, we do not have any material commitments.\nPurchase of Significant Equipment\nWe do not intend to purchase any significant equipment during the next twelve months.\nOff-Balance Sheet Arrangements\nAs of the date of this annual report, we do not have any off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources that are material to investors.\nGoing Concern\nAs reflected in the accompanying financial statements, the Company had an accumulated deficit of approximately $10,882,176 at June 30, 2022 and net loss from operations of $1,288,802.\nThe Company does not yet have a history of financial stability. Historically, the principal source of liquidity has been the issuance of equity securities and related party advances. In addition, the Company is in the development stage and has accumulated losses since inception. These factors raise substantial doubt about the Companys ability to continue as a going concern.\nThe ability of the Company to continue operations is dependent on the success of Managements plans and raising of capital through the issuance of equity securities, until such time that funds provided by operations are sufficient to fund working capital requirements.\nThe Company will require additional funding to finance its operations as well as to identify, negotiate and materialize a business combination with a target business. The Company believes its current available cash may be insufficient to meet its cash needs for the near future. There can be no assurance that financing will be available in amounts or terms acceptable to the Company, if at all.\nThe accompanying financial statements have been prepared on a going concern basis, which contemplates the realization of assets and the satisfaction of liabilities in the normal course of business. These financial statements do not include any adjustments relating to the recovery of the recorded assets or the classification of the liabilities that might be necessary should the Company be unable to continue as a going concern.\nCritical Accounting Policies and Estimates\nFor a discussion of our accounting policies and related items, please see the Notes to the Financial Statements, included in Item 8. Item 7A. Quantitative and Qualitative Disclosure About Market Risk.\nNot applicable. Item 8. Financial Statements and Supplementary Data.\nContents\nPart 1\nFINANCIAL INFORMATION\nReport of Independent Registered Public Accounting Firm (PCAOB ID: 5081)\nBalance Sheets as of June 30, 2022 and 2021\nStatements of Operations for the years ended June 30, 2022 and 2021\nStatements of Changes in Stockholders Equity (Deficit) for the years ended June 30, 2022 and 2021\nStatements of Cash Flows for the years ended June 30, 2022 and 2021\nNotes to Financial Statements\nReport of Independent Registered Public Accounting Firm\nTo the shareholders and the board of directors of Hawkeye Systems, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Hawkeye Systems, Inc. (the \"Company\") as of June 30, 2022 and 2021, the related statement of operations, stockholders' equity (deficit), and cash flows for the years then ended, and the related notes (collectively referred to as the \"financial statements\"). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of June 30, 2022 and 2021, and the results of its operations and its cash flows for the years then ended, in conformity with accounting principles generally accepted in the United States.\nRestatement of June 30, 2021 Financial Statements\nAs discussed in Note 4 to the financial statements, the financial statements have been restated to correct certain misstatements.\nSubstantial Doubt about the Companys Ability to Continue as a Going Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 3 to the financial statements, the Companys significant operating losses raise substantial doubt about its ability to continue as a going concern. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (\"PCAOB\") and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud.\nOur audit included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audit provides a reasonable basis for our opinion.\n/s/ BF Borgers CPA PC\nBF Borgers CPA PC\nServed as Auditor since 2018\nLakewood, CO\nDecember 14, 2022\nHAWKEYE SYSTEMS, INC.\nCONSOLIDATED BALANCE SHEETS\nJune 30,\nJune 30,\n2021 (Restated)\nASSETS\nCurrent assets:\nCash\n$ 325\n$ 282,131\nPrepaid expenses\n1,333\n3,000\nTotal current assets\n1,658\n285,131\nInvestment in HIE\n-\n245,667\nTotal assets\n$ 1,658\n$ 530,798\nLIABILITIES AND STOCKHOLDERS EQUITY (DEFICIT)\nCurrent liabilities:\nAccounts payable and accrued liabilities\n$ 273,592\n$ 133,088\nConvertible note payable, net of discount - related party\n500,000\n450,933\nLine of credit - related party\n265,000\n-\nInventory financing payable - related party\n-\n500,000\nCommon stock payable\n-\n200,000\nCommon stock payable - related party\n624,344\n277,000\nTotal current liabilities\n1,662,936\n1,561,021\nLong-term liabilities:\nLoan payable to Eagle - JV partner\n442,251\n707,654\nPPP loan\n-\n16,983\nTotal liabilities\n2,105,187\n2,285,658\nCommitments and contingencies (Notes 16)\nStockholders equity (deficit):\nPreferred stock, $0.0001 par value, 50,000,000 shares authorized; no shares issued or outstanding\n-\n-\nCommon stock, $0.0001 par value, 400,000,000 shares authorized; 25,604,148 and 17,921,148 shares issued and outstanding, respectively\n2,560\n1,792\nAdditional paid-in capital\n8,776,087\n7,957,009\nAccumulated deficit\n(10,882,176 )\n(9,713,661 )\nTotal stockholders equity (deficit)\n(2,103,529 )\n(1,754,860 )\nTotal liabilities and stockholders equity (deficit)\n$ 1,658\n$ 530,798\nThe accompanying notes are an integral part of these consolidated financial statements.\nHAWKEYE SYSTEMS, INC.\nCONSOLIDATED STATEMENTS OF OPERATIONS\nYears Ended\nJune 30,\n2021 (Restated)\nSales\n$ -\n$ 2,556,942\nCost of sales\n-\n2,576,875\nGross profit (loss)\n-\n(19,933 )\nOperating expenses:\nGeneral and administrative\n284,751\n166,713\nManagement compensation\n799,593\n897,651\nProfessional fees\n78,811\n173,226\nProfessional fees - related party\n61,500\n367,228\nMarketing\n5,813\n94,809\nWrite-down of inventory\n-\n883,473\nTotal operating expenses\n1,230,468\n2,583,100\nLoss from operations\n(1,230,468 )\n(2,603,033 )\nOther income and (expense):\nInterest expense\n-\n(14,613 )\nInterest expense - related party\n(95,363 )\n(180,305 )\nFinancing expense\n-\n(65,402 )\nFinancing expense - related party\n-\n(1,508,211 )\nPPP loan forgiveness\n17,293\n-\nGain (loss) on investment in HIE\n19,736\n(461,987 )\nLoss on settlement of debt\n-\n(370,269 )\nTotal other expense\n(58,334 )\n(2,600,787 )\nNet loss\n$ (1,288,802 )\n$ (5,203,820 )\nNet loss per common share - basic and diluted\n$ (0.06 )\n$ (0.31 )\nWeighted average common shares outstanding - basic and diluted\n23,123,336\n16,784,557\nThe accompanying notes are an integral part of these consolidated financial statements.\nHAWKEYE SYSTEMS, INC.\nCONSOLIDATED STATEMENTS OF CHANGES IN STOCKHOLDERS EQUITY\nAdditional\nCommon\nCommon Stock\nPaid-in\nStock\nAccumulated\nStockholders\nShares\nAmount\nCapital\nTo Be Issued\nDeficit\nEquity (Deficit)\nBalance, June 30, 2020\n14,828,036\n$ 1,483\n$ 4,527,925\n$ 139,500\n$ (4,509,841 )\n$ 159,067\nCommon shares issues for stock to be issued\n425,000\n139,457\n(139,500 )\n-\n-\nCommon shares issued for conversion of debt\n469,623\n525,931\n-\n525,978\nCommon stock and warrants issued for cash\n100,000\n19,990\n-\n-\n20,000\nCommon stock and warrants issued for services - related parties\n740,000\n146,486\n-\n-\n146,560\nStock based compensation - options\n-\n-\n485,455\n-\n-\n485,455\nStock based compensation - warrants\n-\n-\n1,563,708\n-\n-\n1,563,708\nDebt forgiveness\n-\n-\n20,932\n-\n-\n20,932\nWarrants exercised for cash\n175,000\n67,483\n-\n-\n67,500\nCommon stock issued for settlement of debt\n515,000\n179,949\n-\n-\n180,000\nCommon stock issued for common stock payable\n668,489\n161,933\n-\n-\n162,000\nBeneficial conversion feature\n-\n-\n117,760\n-\n-\n117,760\nNet loss\n-\n-\n-\n-\n(5,203,820 )\n(5,203,820 )\nBalance, June 30, 2021 (Restated)\n17,921,148\n$ 1,792\n$ 7,957,009\n$ -\n$ (9,713,661 )\n$ (1,754,860 )\nCumulative-effect adjustment from adoption of ASU 2020-06\n-\n-\n(169,354 )\n-\n120,287\n(49,067 )\nCommon stock issued for settlement of account payable\n300,000\n29,970\n-\n-\n30,000\nStock based compensation - options\n-\n-\n482,200\n-\n-\n482,200\nStock option cashless exercised\n6,275,000\n(627 )\n-\n-\n-\nCommon stock issued for common stock payable\n1,108,000\n476,889\n-\n-\n477,000\nNet loss\n-\n-\n-\n-\n(1,288,802 )\n(1,288,802 )\nBalance, June 30, 2022\n25,604,148\n$ 2,560\n$ 8,776,087\n$ -\n$ (10,882,176 )\n$ (2,103,529 )\nThe accompanying notes are an integral part of these consolidated financial statements.\nHAWKEYE SYSTEMS, INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nYears Ended\nJune 30,\n2021 (Restated)\nCash flows from operating activities:\nNet loss\n$ (1,288,802 )\n$ (5,203,820 )\nAdjustments to reconcile net loss to net cash used in operating activities:\nDepreciation\n-\nPPP loan forgiveness\n(17,293 )\n-\nBad debt\n-\n79,000\nWrite-down of inventory\n-\n883,473\nLoss on settlement of debt\n-\n370,269\nAmortization of debt discount\n-\n119,763\nStock based compensation - options and warrant\n482,200\n2,049,163\nCommon stock issued and warrants issued for services\n-\n146,560\nChange in operating assets and liabilities:\nAccounts receivable\n-\n(31,344 )\nInventory\n-\n(373,956 )\nPrepaid expense\n3,667\nAccounts payable and accrued liabilities\n296,284\n7,402\nCommon stock payable\n-\n3,000\nNet cash used in operating activities\n(527,070 )\n(1,946,086 )\nCash flows from investing activities:\n(Gain) loss on investment in HIE\n(19,736 )\n461,987\nNet cash used in investing activities\n(19,736 )\n461,987\nCash flows from financing activities:\nSales of common stock and warrants, net of issuance costs\n-\n20,000\nIssuances of notes payable, net of financing costs\n-\n16,983\nNet proceeds from notes payable - related party\n-\n1,000,000\nRepayment of notes payable - related party\n-\n(500,000 )\nNet proceeds from line of credit\n265,000\n-\nNet proceeds from convertible note - related party\n-\n250,000\nProceeds from exercise of warrants\n-\n67,500\nNet cash provided by financing activities\n389,344\n854,483\nNet change in cash\n(281,806 )\n(629,616 )\nCash beginning of period\n282,131\n911,747\nCash end of period\n$ 325\n$ 282,131\nSupplemental cash flow information\nCash paid for interest\n$ -\n$ -\nCash paid for taxes\n$ -\n$ -\nNon-cash investing and financing activities:\nCommon stock issued on conversion of note payable\n$ -\n$ 535,978\nCommon stock issued for settlement of accounts payable\n$ 30,000\nCommon stock issued exchanged for common stock payable\n$ 477,000\n$ 162,000\nCommon stock issued for accrued salary\n$ -\n$ 180,000\nReplacement of Inventory financing payable to convertible note\n$ 500,000\nBeneficial conversion feature\n$ -\n$ 117,760\nReclassification from note payable related party to stock payable\n$ -\n$ 200,000\nReclassification from common stock to be issued to common stock\n$ -\n$ 109,500\nDebt forgiveness\n$ 17,293\n$ 20,932\nStock option cashless exercised\n$ 627\n-\nThe accompanying notes are an integral part of these consolidated financial statements.\nHAWKEYE SYSTEMS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFor the Years Ended June 30, 2022 and 2021\nNote 1 - Organization\nHawkeye Systems, Inc. (the Company), a Nevada corporation incorporated in May 15, 2018, is a technology holding company until 2022 we focused on pandemic management products and services. We have decided to wind down our PPE business and we are currently looking for opportunities to license and/or acquire interests in a target business with significant growth potential. We will not restrict our search for target businesses to any particular industry. Rather, we may investigate businesses of essentially any kind or nature and participate in any type of industry that may, in our managements opinion, meet the business objectives determined by our management team.\nNote 2 - Summary of Significant Accounting Policies\nBasis of presentation\nThe accompanying financial statements were prepared in conformity with accounting principles generally accepted in the United States of America (U.S. GAAP).\nUse of estimates\nThe preparation of consolidated financial statements in conformity with U.S. GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the consolidated financial statements and the reported amounts of revenues and expenses during the reporting period. The Company regularly evaluates estimates and assumptions. The Company bases its estimates and assumptions on current facts, historical experience, and various other factors that it believes to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities and the accrual of costs and expenses that are not readily apparent from other sources. To the extent there are material differences between the estimates and the actual results, future results of operations will be affected. The actual results experienced by the Company may differ materially and adversely from the Companys estimates. Significant estimates in the accompanying financial statements include useful lives of property and equipment, fair value assumptions used for stock-based compensation, and the valuation allowance on deferred tax assets.\nCash\nThe Company considers cash in banks and other deposits with an original maturity of three months or less when purchased to be cash and cash equivalents. There were no cash equivalents as of June 30, 2022 and 2021.\nFinancial instruments\nFor certain of the Companys financial instruments, including cash, and convertible note payable, related party, the carrying amounts approximate their fair values due to their short maturities.\nAccounts receivable and allowance for doubtful accounts\nTrade accounts receivable are recorded at the invoiced amount and do not bear interest. The allowance for doubtful accounts is the Companys best estimate of the amount of probable credit losses in its existing accounts receivable. The Company maintains allowances for doubtful accounts for estimated losses resulting from the inability of its customers to make required payments for services or goods. Accounts with known financial issues are first reviewed and specific estimates are recorded. The remaining accounts receivable balances are then grouped in categories by the number of days the balance is past due, and the estimated loss is calculated as a percentage of the total category based upon past history. Account balances are charged against the allowance when it is probable that the receivable will not be recovered.\nThe Company had no balance on accounts receivable and allowance for doubtful accounts at June 30, 2022 or 2021.\nInventory\nInventories, consisting of finished goods and goods in transit, are primarily accounted for using the first-in-first-out (FIFO) method of accounting. Inventories are measured at the lower of cost and net realizable value. The Company estimates the net realizable value of inventories based on an assessment of expected sales prices.\nThe Company has no inventory as of June 30, 2022, and 2021, respectively.\nFair value measurements\nWhen required to measure assets or liabilities at fair value, the Company uses a fair value hierarchy based on the level of independent, objective evidence surrounding the inputs used. The Company determines the level within the fair value hierarchy in which the fair value measurements in their entirety fall. The categorization within the fair value hierarchy is based upon the lowest level of input that is significant to the fair value measurement. Level 1 uses quoted prices in active markets for identical assets or liabilities, Level 2 uses significant other observable inputs, and Level 3 uses significant unobservable inputs. The amount of the total gains or losses for the period are included in earnings that are attributable to the change in unrealized gains or losses relating to those assets and liabilities still held at the reporting date. The Company has no assets or liabilities that are adjusted to fair value on a recurring basis.\nConvertible financial instruments\nThe Company bifurcates conversion options from their host instruments and accounts for them as free-standing derivative financial instruments if certain criteria are met. The criteria include circumstances in which (a) the economic characteristics and risks of the embedded derivative instrument are not clearly and closely related to the economic characteristics and risks of the host contract, (b) the hybrid instrument that embodies both the embedded derivative instrument and the host contract is not remeasured at fair value under otherwise applicable generally accepted accounting principles with changes in fair value reported in earnings as they occur, and (c) a separate instrument with the same terms as the embedded derivative instrument would be considered a derivative instrument. An exception to this rule is when the host instrument is deemed to be conventional, as that term is described under applicable U.S. GAAP.\nWhen the Company has determined that the embedded conversion options should not be bifurcated from their host instruments, discounts are recorded for the intrinsic value of conversion options embedded in the instruments based upon the differences between the fair value of the underlying common stock at the commitment date of the transaction and the effective conversion price embedded in the instrument.\nCommon stock purchase warrants and derivative financial instruments\nCommon stock purchase warrants and other derivative financial instruments are classified as equity if the contracts (1) require physical settlement or net-share settlement, or (2) give the Company a choice of net-cash settlement or settlement in its own shares (physical settlement or net-share settlement). Contracts which (1) require net-cash settlement (including a requirement to net cash settle the contract if an event occurs and if that event is outside the control of the Company), (2) give the counterparty a choice of net-cash settlement or settlement in shares (physical settlement or net-share settlement), or (3) that contain reset provisions that do not qualify for the scope exception; are classified as liabilities. The Company assesses classification of its common stock purchase warrants and other derivatives at each reporting date to determine whether a change in classification between equity and liabilities is required.\nBeneficial conversion feature\nThe issuance of the convertible debt generated a beneficial conversion feature (BCF), which arises when a debt or equity security is issued with an embedded conversion option that is beneficial to the investor or in the money at inception because the conversion option has an effective strike price that is less than the market price of the underlying stock at the commitment date. The Company recognized the BCF by allocating the intrinsic value of the conversion option, which is the number of shares of common stock available upon conversion multiplied by the difference between the effective conversion price per share and the fair value of common stock per share on the commitment date, resulting in a discount on the convertible debt (recorded as a component of additional paid-in capital). The discount is amortized to interest expense over the term of the convertible debt.\nIncome taxes\nThe Company uses the asset and liability method of accounting for income taxes, whereby deferred tax assets are recognized for deductible temporary differences, and deferred tax liabilities are recognized for taxable temporary differences. Temporary differences are the differences between the reported amounts of assets and liabilities and their tax bases. Deferred tax assets are reduced by a valuation allowance when, in the opinion of management, the Company does not foresee generating taxable income in the near future and utilizing its deferred tax asset, therefore, it is more likely than not that some portion, or all of, the deferred tax assets will not be realized. Deferred tax assets and liabilities are adjusted for the effects of changes in tax laws and rates on the date of enactment.\nA tax position is recognized as a benefit only if it is more likely than not that the tax position would be sustained in a tax examination, with a tax examination being presumed to occur. The amount recognized is the largest amount of tax benefit that is greater than 50% likely of being realized on examination. For tax positions not meeting the more likely than not test, no tax benefit is recorded. The Company has no material uncertain tax positions for any of the reporting periods presented.\nRevenue recognition\nRevenue is recorded in accordance with Accounting Standards Update (ASU) No. 2014-09, Revenue from Contracts with Customers (Topic 606). Revenue is recognized from product sales when goods are shipped, title and risk of loss have transferred to the purchaser, there are no significant vendor obligations, the fees are fixed or determinable, and collection is reasonably assured. Amounts billed to customers for shipping and handling are included in net sales. Costs associated with shipping and handling are included in cost of goods sold. The Company recognizes sales on a gross basis when it is considered the primary obligor in the transaction and on a net basis when it is considered to be acting as an agent. We record estimates for cash discounts, product returns, and other discounts in the period of the sale. This provision is recorded as a reduction from gross sales and the reserves are shown as a reduction of accounts receivable.\nCost of sales\nCost of sales includes inventory costs and shipping and freight expenses.\nRelated parties\nThe Company follows ASC 850, Related Party Disclosures, for the identification of related parties and disclosure of related party transactions.\nCommitments and contingencies\nThe Company follows ASC 450-20, Loss Contingencies, to report accounting for contingencies. Liabilities for loss contingencies arising from claims, assessments, litigation, fines and penalties and other sources are recorded when it is probable that a liability has been incurred and the amount of the assessment can be reasonably estimated.\nBasic and diluted earnings per share\nBasic earnings per share is calculated by dividing net income (loss) by the weighted average number of common shares outstanding during the period. Diluted earnings per share is calculated based on the weighted average number of common shares outstanding during the period plus the effect of potentially dilutive common stock equivalents, including stock options, warrants to purchase the Company's common stock, and convertible note payable. For the years ended June 30, 2022 and 2021, potentially dilutive common stock equivalents not included in the calculation of diluted earnings per share because they were anti-dilutive are as follows:\nJune 30,\nJune 30,\nWarrants\n2,493,996\n3,069,329\nOptions\n4,256,000\n7,280,000\nConvertible notes\n42,247,315\n2,000,000\nTotal possible dilutive shares\n48,997,311\n12,349,329\nStock-based compensation\nStock-based compensation to employees and non-employees consist of stock options grants, warrants to purchase common stock, and restricted shares that are recognized in the statement of operations based on their fair values at the date of grant. The fair value of share of common stock is based on the trading price of the Companys share.\nThe Company calculates the fair value of option and warrant grants utilizing the Black-Scholes pricing model. Assumptions used by the Company in using the Black-Scholes pricing model include:\n1)\nvolatility based on the Companys average volatility rate,\n2)\nrisk free interest rate based on the U.S. Treasury yield for a term consistent with the expected life of the awards in effect at the time of the grant,\n3)\nthe expected life of the option or warrants, and\n4)\nexpected cash dividend rate on shares of common stock.\nDuring the year ending June 30, 2022, volatility was based on average rates for trading price of the Companys share, while at the year ending June 30, 2021, volatility was based on average rates for similar publicly traded companies.\nThe amount of stock-based compensation recognized during a period is based on the value of the portion of the awards that are ultimately expected to vest. The resulting stock-based compensation expense for employee awards is generally recognized on a straight- line basis over the vesting period of the award.\nReclassifications\nCertain prior period amounts have been reclassified to conform with the current year presentation.\nRecent accounting pronouncements\nManagement has considered all recent accounting pronouncements issued and their potential effect on our financial statements.\nIn August 2020, the FASB issued ASU 2020-06, ASC Subtopic 470-20 Debt-Debt with Conversion and Other Options and ASC subtopic 815-40 Hedging-Contracts in Entitys Own Equity. The standard reduced the number of accounting models for convertible debt instruments and convertible preferred stock. Convertible instruments that continue to be subject to separation models are (1) those with embedded conversion features that are not clearly and closely related to the host contract, that meet the definition of a derivative, and that do not qualify for a scope exception from derivative accounting; and (2) convertible debt instruments issued with substantial premiums for which the premiums are recorded as paid-in capital. The amendments in this update are effective for fiscal years beginning after December 15, 2021, including interim periods within those fiscal years. Early adoption is permitted, but no earlier than fiscal years beginning after December 15, 2020, including interim periods within those fiscal years.\nThe Company early adopted this standard effective July 1, 2021 using the modified retrospective approach transition method. Therefore, the condensed financial statements for the year ended June 30, 2022 are presented under the new standard, while the comparative period presented is not adjusted and continues to be reported in accordance with the Companys historical accounting policy.\nNote 3 - Going Concern\nThe Companys financial statements are prepared using U.S. GAAP, applicable to a going concern which contemplates the realization of assets and liquidation of liabilities in the normal course of business. During the year ended June 30, 2022, the Company had a net loss of $1,288,802. As of June 30, 2022, the Company had an accumulated deficit of $10,882,176. The Company has not established sufficient revenue to cover its operating costs and will require additional capital to continue its operating plan. The ability of the Company to continue as a going concern is dependent on the Company obtaining adequate capital to fund operating losses until it becomes profitable. If the Company is unable to obtain adequate capital, it could be forced to cease operations. These factors raise substantial doubt about its ability to continue as a going concern.\nIn order to continue as a going concern, the Company will need, among other things, additional capital resources. Managements plan to obtain such resources for the Company includes: sales of equity instruments; traditional financing, such as loans; and obtaining capital from management and significant stockholders sufficient to meet its minimum operating expenses. However, management cannot provide any assurance that the Company will be successful in accomplishing this plan.\nThere is no assurance that the Company will be able to obtain sufficient additional funds when needed or that such funds, if available, will be obtainable on terms satisfactory to the Company. In addition, profitability will ultimately depend upon the level of revenues received from business operations. However, there is no assurance that the Company will attain profitability. The accompanying financial statements do not include any adjustments that might be necessary if the Company is unable to continue as a going concern.\nNote 4 - Restatement of Financial Statements for the Year End June 30, 2021\nOn July 17, 2020, the Company entered into a membership agreement with Eagle Equities LLC (Eagle) and Ikon Supplies (Ikon) to form a Nevada Limited Liability Company, HIE, LLC (HIE) for the purpose of procuring, funding the purchase of and sale of PPE (the Membership Agreement). Subject to the provision of the Agreement, the interest of any net profits shall be shares 33.3% among each member. In an event that there is a loss in some or all of the capital, all members of HIE shall be responsible to contribute capital to repay the loan, and additional contribution, with each party being responsible for 33.3% of the loss.\nRestatement Effect on Financial Statements\nThe Company did not receive any updates of fiscal year 2021 financial statements from HIE until October 2022. For the fiscal year ended June 30, 2021, HIE has obtained a loan of $2,122,963 secured by Eagle as initial funding, of which the Company has recognized 1/3 of its portion of $707,654 as a guarantee of loan payable to Eagle - JV partner, the same amount as investment in HIE, as stipulated in the Membership Agreement. In addition, HIE incurred an operating loss of $1,385,962, which resulted in the Company recording 1/3 of its loss of $461,987 under other expenses on the statement of income to offset the investment in HIE as under equity method in accordance with FASB ASC 323.\nAs of June 30, 2021, the balance of investment in HIE was $245,667 and the balance of loan due to Eagle - JV partner was $707,654.\nEffects on the previously issued year 2021 balance sheet referencing the restatement of liability and equity are as follows:\nBalance Sheet at June 30, 2021:\nOriginally\nReported\nRestatement\nAdjustment\nAs\nRestated\nASSETS\nCurrent assets:\nCash\n$ 282,131\n$ -\n$ 282,131\nPrepaid expenses\n3,000\n3,000\nTotal current assets\n285,131\n-\n285,131\nInvestment in HIE\n-\n245,667\n245,667\nTotal assets\n$ 285,131\n$ 245,667\n$ 530,798\nLIABILITIES AND STOCKHOLDERS DEFICIT\nCurrent liabilities:\nAccounts payable and accrued liabilities\n$ 133,088\n$ -\n$ 133,088\nConvertible note payable, net of discount - related party\n450,933\n-\n450,933\nInventory financing payable - related party\n500,000\n-\n500,000\nCommon stock payable\n200,000\n200,000\nCommon stock payable - related party\n277,000\n-\n277,000\nTotal current liabilities\n1,561,021\n-\n1,561,021\nLong-term liabilities:\nLoan payable to Eagle - JV partner\n-\n707,654\n707,654\nPPP loan\n16,983\n16,983\nTotal liabilities\n1,578,004\n707,654\n2,285,658\nStockholders deficit:\nPreferred stock, $0.0001 par value, 50,000,000 shares authorized; no shares issued or outstanding\n-\n-\n-\nCommon stock, $0.0001 par value, 400,000,000 shares authorized; 25,604,148 and 17,921,148 shares issued and outstanding, respectively\n1,792\n-\n1,792\nAdditional paid-in capital\n7,957,009\n-\n7,957,009\nAccumulated deficit\n(9,251,674 )\n(461,987 )\n(9,713,661 )\nTotal stockholders equity deficit\n(1,292,873 )\n(461,987 )\n(1,754,860 )\nTotal liabilities and stockholders deficit\n$ 285,131\n$ (461,987 )\n$ 530,798\nEffects on the previously issued year 2021 Statement of Operations referencing the restatement of other expenses and net loss are as follows:\nStatements of Operations from 07/01/2020 to 06/30/2021\nOriginally\nReported\nRestatement Adjustment\nAs\nRestated\nSales\n$ 2,556,942\n$ -\n$ 2,556,942\nCost of sales\n2,576,875\n-\n2,576,875\nGross profit\n(19,933 )\n-\n(19,933 )\nOperating expenses:\nGeneral and administrative\n166,713\n-\n166,713\nManagement compensation\n897,651\n-\n897,651\nProfessional fees\n173,226\n-\n173,226\nProfessional fees - related party\n367,228\n-\n367,228\nMarketing\n94,809\n-\n94,809\nWrite-down of inventory\n883,473\n-\n883,473\nTotal operating expenses\n2,583,100\n-\n2,583,100\nLoss from operations\n(2,603,033 )\n-\n(2,603,033 )\nOther expense:\nInterest expense\n(14,613 )\n-\n(14,613 )\nInterest expense - related party\n(180,305 )\n-\n(180,305 )\nFinancing expense\n(65,402 )\n-\n(65,402 )\nFinancing expense - related party\n(1,508,211 )\n-\n(1,508,211 )\nLoss on investment in HIE\n-\n(461,987 )\n(461,987 )\nLoss on settlement of debt\n(370,269 )\n-\n(370,269 )\nTotal other expense\n(2,138,800 )\n(461,987 )\n(2,600,787 )\nNet loss\n$ (4,741,833 )\n$ (461,987 )\n$ (5,203,820 )\nNet loss per common share - basic and diluted\n$ (0.28 )\n$ -\n$ (0.31 )\nWeighted average common shares outstanding - basic and diluted\n16,784,557\n-\n16,784,557\nNote 5 - Accounts Payable Converted to Common Stock\nOn August 1, 2019, the Company entered into an agreement with Stratcon Advisory and Tysadco Partners. Pursuant to the agreement, the Company will pay $6,000 per month for twelve months for corporate development, investment advisory, and investor relations services, payable $3,000 in restricted common stock and $3,000 in cash.\nOn September 24, 2021, the Company issued 300,000 shares of common stock at $0.10 per share to settle accounts payable of $30,000.\nAs of June 30, 2022 and 2021, the Company had a balance of $0 and $30,000 in accounts payable, respectively.\nNote 6 - Inventory Financing Payable - related party\nOn February 19, 2021, Steve Hall, an investor who holds approximately 53% of the Companys common stock advanced $1 million to the Company. The purpose of the advance was to purchase inventory to satisfy customer orders. The advance will be repaid upon cash being received from the end customer. In addition to the principal amount of the advance, the related party will be entitled to 1/3 of the gross profit earned on the transaction. The terms of the agreement are non-interest bearing. The investor is 100% at risk as this is a non-recourse funding vehicle.\nIn June 2021 the company cancelled the contemplated purchase of inventory and returned $500,000 to Mr. Hall. Mr. Hall has agreed to allow the Company to retain the balance to fund future purchases and general operating expenses.\nOn October 1 2021, the Company and Steve Hall entered into an agreement to replace the inventory financing payable with a convertible note. Further discussion on Note 7 - Convertible Notes Payable - related party, convertible promissory notes 7.3.\nNote 7 - Convertible Notes Payable - related party\nConvertible Promissory Note 7.1\nOn April 6, 2020, the Company and Steve Hall, entered into a convertible promissory note agreement for the principal amount of $250,000, accruing simple interest at a rate of 10% per annum if repaid within 90 days, and 20% per annum if repaid thereafter. The convertible note was due on April 6, 2021. At the option of the noteholder, the note would convert, at any time, starting six months from the date of issuance through to the one-year anniversary of the date of issuance at a conversion price of $0.25 per share.\nThe Company recorded a discount on the convertible note due to a beneficial conversion feature of $51,594, which was being amortized over the term of the note.\nIn consideration for the loan of $250,000, the Company also granted to Mr. Hall 100,000 stock options exercisable at $0.25 for a two-year term. The options vested upon issuance of the note. The fair value of the options was $13,297 and was recognized as debt discount as a part of beneficial conversion feature in the year ended June 30, 2020.\nAs of June 30, 2022, and 2021, the outstanding principal amount is $0, and 250,000, respectively.\nConvertible Promissory Note 7.2\nOn December 15, 2020, the Company and Steve Hall, entered into a convertible promissory note agreement for the principal amount of $250,000, accruing simple interest at a rate of 10% per annum, if repaid within 90 days, and 20% per annum if repaid thereafter. The convertible note was due on December 15, 2021. At the option of the noteholder, the note would convert at any time beginning six months after the date of issuance and ending on the date, which is one year from the date of issuance, at a conversion price of $0.25 per share.\nThe Company recorded a discount on the convertible note due to a beneficial conversion feature of $117,760, which is being amortized over the term of the note.\nIn consideration for the loan of $250,000, the Company also granted to Mr. Hall 100,000 stock options exercisable at $0.25 for a two-year term. The options vested upon issuance of the note. The fair value of the options was $46,380 and was recognized as debt discount as a part of beneficial conversion feature in the year ended June 30, 2021.\nAs of June 30, 2022, and 2021, the outstanding principal amount is $0, and 200,933 of which included amortization on debt discount of $0, and $49,067, respectively.\nAdoption of ASU 2020-06 for Convertible Promissory Note 7.1, and Convertible Promissory Note 7.2\nIn connection with the adoption of ASU 2020-06, the Company reclassified the aggregate amount of $169,354, previously allocated to the conversion feature of the Convertible Promissory Note 7.1, and Convertible Promissory Note 7.2 of $51,594, and $117,760 from additional paid-in capital to convertible notes on our balance sheet as of September 1, 2021, respectively. The reclassification was recorded to combine the two legacy units of account into a single instrument classified as a liability. The Company also recognized an aggregate cumulative effect adjustment of $120,287 to the Convertible Promissory Note 7.1, and Convertible Promissory Note 7.2 of $51,594, and $68,693 to accumulated deficit on our balance sheet as of September 1, 2021, respectively. The cumulative effect adjustment was primarily driven by the derecognition of interest expense related to the accretion of the Debt Discount as required under the legacy accounting guidance. Under ASU 2020-06, we would no longer incur non-cash interest expense related to the accretion of the debt discount associated with the embedded conversion option.\nAs a result of the adoption of ASU 2020-06, at the years ended June 30, 2022 and 2021, amortization of $0 and $119,763 of debt discount feature was recognized as interest expense for the above two notes, respectively.\nConversion of Convertible Promissory Note 7.1 and Convertible Promissory Note 7.2\nOn September 1, 2021, the Company had converted the convertible promissory note 7.1 and convertible promissory note 7.2 in the aggregate total of $500,000 and the related accrued interest of $94,344 into 16,666,667 shares of common stock with conversion value of $0.035661 per share. As of June 30, 2022, the entire amount of $594,344 is recorded as common stock payable. Subsequently, the shares are registered on July 28, 2022. On November 2, 2021, the Company issued 160,000 shares of common stock for cashless exercise in exchanged for the related 200,000 shares of stock options.\nAs of June 30, 2022 and 2021, the aggregate balance of the two notes is $0 and $500,000 less unamortized debt discount of $0 and $49,067 or $0 and $450,933, respectively. Interest expense of $21,427 and $72,917 was recognized during the years ended June 30, 2022 and 2021, respectively.\nExercised of the stock options on Convertible Promissory Note 7.1 and Convertible Promissory Note 7.2\nOn November 2, 2021, the Company issued 160,000 shares of common stock for cashless exercise in exchange for the related 200,000 shares for the exercise of the stock options as mentioned on the convertible promissory note 7.1 and convertible promissory note 7.2.\nConvertible Promissory Note 7.3\nOn October 1, 2021, the inventory financing payable of $500,000 with Steve Hall as mentioned on Note 6 - Inventory Financing Payable - related party, was converted into a convertible promissory note accruing simple interest at a rate of 12% for the first 90 days and simple interest rate of 20% thereafter, with a due date on September 30, 2022. At the option of the noteholder, this note is convertible at any time into shares of common stock at a conversion price of $0.02 per share.\nThe maturity date of this note was extended to September 30, 2023.\nAs of June 30, 2022, the accrued interest was $64,932, and the principal balance was $500,000.\nNote 8 - Line of Credit - related party\nOn October 1, 2021, Steve Hall agreed to provide a line of credit of up to $1,000,000 to the Company accruing simple interest at 12% for the first 90 days, and 20% thereafter. The principal and interest payable shall be added to the principal amount of the agreement and payable pursuant to the same terms. The line of credit shall expire on October 1, 2022 unless renewed and/or extended by the parties. Over the fiscal year 2022 in multiple transactions dates, the Company has withdrawn a total of $265,000. In connection with the line of credit, the Company has accrued interest of $15,015 in year ended June 30, 2022.\nThe line of credit has renewed and has been extended with same term and an expiration date of October 1, 2023.\nNote 9 - Common stock payable\nAs a result of reclassification of $200,000 to Common stock payable - related party during fiscal year 2022, the ending balances of Common stock payable are $0, and $200,000 as of June 30, 2022, and 2021, respectively.\nNote 10 - Common stock payable - related party\nOn June 1, 2020, Steve Hall provided $477,000 for the purchase of PPE, with an agreement of converting such amount into 1,108,000 shares of common stock at $0.25 per share. The stocks were issued in fiscal year 2022.\nAs of June 30, 2022 and 2021, the Company reported common stock payable-related party of $624,344 and $477,000, which represents 17,416,667 and 1,108,000 shares of common stock to be issued, respectively. See further discussion on Note 11- Stockholders Equity.\nNote 11 - Stockholders Equity\nCommon Stock\n2022 Stock Issuances\n·\nIssued 300,000 shares of common stock valued at $30,000 associated with the settlement of Accounts Payable of $30,000.\n·\nIssued 1,108,000 shares of common stock valued $477,000 for stock payable.\n·\nIssued 6,275,000 shares of common stock for cashless exercise of 7,900,000 stock options.\n2022 Stocks to be issued\n·\nOn September 1, 2021, Steve Hall converted a note with a principal amount of $500,000 and the associated accrued interest of $94,344 into16,666,667 shares of common stock at $0.03566 per share. The transaction was being classified as common stock payable-related party as of June 30, 2022. The shares were registered on July 28, 2022.\n·\nOn May 23, 2022, the board of directors granted two related parties 500,000 and 250,000 shares of restricted common stock, respectively with conversion value of $0.04 per share. The shares were granted as consideration for services granted. All shares are restricted until an acquisition or reverse takeover of the Company.\n2021 Stock Issuances\nDuring the year ended June 30, 2021, the Company had the following common stock transactions:\n·\nIssued 469,623 shares of common stock in exchange for conversion of debt and accrued interest of $525,978.\n·\nIssued 175,000 shares of common stock associated with the exercise of warrants for $67,500.\n·\nIssued 425,000 shares of common stock for stock subscriptions of $139,500 received prior to June 30, 2020.\n·\nIssued 515,000 shares of common stock in exchange for settlement of $180,000 in accrued salary to our CEO.\n·\nIssued 100,000 units consisting of: (i) 100,000 shares of common stock, and (ii) 100,000 options that are exercisable for 2 years for an exercise price of $0.25 per share. The purchase was at $0.20 per unit, for a total purchase price of $20,000.\n·\nIssued 668,489 shares of common stock for common stock payable of $162,000.\n·\nIssued 740,000 shares of common stock for service of $146,560 to related parties.\nStock Purchase Warrants\nTransactions in stock purchase warrants for the years ended June 30, 2022 and 2021 are as follows:\nNumber of\nWeighted Average\nWarrants\nExercise Price\nBalance at June 30, 2020\n7,047,135\n$ 1.52\nGranted\n2,278,996\n1.06\nExercised - shares issued\n(175,000 )\n0.39\nExpired\n(6,081,802 )\n1.60\nBalance at June 30, 2021\n3,069,329\n2.27\nGranted\n-\n-\nExercised - shares issued\n-\n-\nExpired\n(575,333 )\n0.96\nBalance at June 30, 2022\n2,493,996\n$ 1.78\nAs of the years ended June 30, 2022 and 2021, the Company issued 0, and 2,278,996 warrants to purchase common stock, respectively.\nThe composition of the Companys warrants outstanding at June 30, 2022 are as follows:\nExercise Price\nNumber of Warrants\nWeighted Average Remaining Life (in years)\n$ 0.20\n100,000\n0.43\n$ 0.30\n349,998\n1.84\n$ 0.50\n666,666\n1.84\n$ 1.00\n708,666\n1.84\n$ 2.00\n668,666\n1.84\n2,493,996\n1.78\nThe intrinsic value of the warrants as of June 30, 2022 and 2021 was $0.\nStock Options\nDuring 2019, the Companys board of directors approved the 2019 Directors, Officers, Employees and Consultants Stock Option Plan (Option Plan) which authorized the issuance of options to purchase up to 2,500,000 shares of common stock to its employees, directors, and consultants.\nFiscal Year 2022\nOn October 1, 2021, pursuant the Companys Option Plan, the Company granted 1,876,000 stock options with exercise prices of a range from $0.10 to $0.50 and a term of five years. All of 20 20 . The fair value of these shares was $132,210 of which $127,051 was recognized in the fiscal year ended June 30, 2022.\nOn May 23, 2022, the Company had granted 3,250,000 stock options, of which 2,000,000 were to related parties. These options vested immediately upon issuance with exercise prices of a range from $0.05 to $0.075 and a term of five years with a fair value of $113,163.\nAs of the date of this annual report, the Company has issued 2,500,000 stock options under the 2019 Option Plan of which all are fully vested and exercised before the fiscal yearend of 2022. There are 4,182,800 shares of stock option exercisable, of which all are granted as non-statutory stock options, outside of the Option Plan.\nOn June 30, 2022, compensation cost for non-vested options of $5,159 will be recognized over the next year.\nAdditionally, the Company also granted two related parties 500,000 and 250,000 shares of restricted common stock for service with conversion value of $0.04 per share on May 23, 2022, respectively. All shares are restricted until an acquisition or reverse takeover of the Company.\nFiscal Year 2021\nDuring the year ended June 30, 2021, pursuant the Companys Option Plan, the Company granted 2,125,000 stock options with exercise prices ranging from $0.10 to $0.30 and a term of two or five years. These options vested immediately or 20% immediately upon issuance of this option and an additional 20% every three months thereafter. The fair value of these shares was $369,979 of which $127,993 was recognized in the year ended June 30, 2021.\nThe fair value of the newly granted options was determined using the Black-Scholes option pricing model with the following assumptions:\nJune 30,\nTrading price\n$ 0.02 - 0.13\n$ 0.15 - 0.55\nExercise price\n$ 0.00\n$ 0.10 - 0.30\nExpected term (in years)\n5.00\n1.0 to 2.50\nRisk-free rate\n0.71%-2.84\n%\n0.09%-0.27\n%\nVolatility\n229%-255\n%\n235%-539\n%\nDividend yield\n-\n-\nFor options issued in the year ended June 30, 2022 and 2021, the volatility rate is based on the Companys volatility. The risk-free interest rate is based on the U.S. Treasury yield for a term consistent with the expected life of the awards in effect at the time of grant. The Company has no history or expectation of paying cash dividends on its common stock.\nTransactions in stock options for the years ended June 30, 2022 and 2021 are as follows:\nWeighted average\nNumber of\nWeighted average\nremaining life\noptions\nexercise price\n(in years)\nOutstanding, June 30, 2020\n5,255,000\n$ 0.25\n4.28\nGranted\n2,125,000\n0.16\n4.86\nExpired or Forfeited\n(100,000 )\n-\n-\nExercised\n-\n-\n-\nOutstanding, June 30, 2021\n7,280,000\n0.23\n3.76\nGranted\n5,126,000\n0.11\n4.66\nExpired or Forfeited\n(250,000 )\n0.50\n1.59\nExercised\n(7,900,000 )\n0.19\n3.14\nOutstanding, June 30, 2022\n4,256,000\n0.41\n4.41\nExercisable, June 30, 2022\n4,182,800\n$ 0.14\n4.41\nDuring fiscal year 2022, the Company amortized expenses of $482,200, of which $372,008 was with related parties. As of June 30, 2022, the expenses of $5,159 remains unamortized.\nOn November 2, 2021, the Company issued 6,275,000 shares of common stock for cashless exercise of 7,900,000 shares of stock option.\nAt the fiscal years ended of June 30, 2022, and 2021, the intrinsic value of the outstanding options was $0, and 60,500, respectively.\nNote 12 - Paycheck Protection Program Loan\nOn February 02, 2021, the Company received a Paycheck Protection Program Loan (PPP) of $16,983 from Small Business Administration (SBA). Given the purpose and the underlying conditions of the loan, the Company has recorded the amount received under PPP loan as liability and accrued interest as incurred under FASB ASC 470, Debt. On October 05, 2021, the Company has received a letter from SBA notifying us the entire loan and the interest have been forgiven. Accordingly, the Company has recorded a PPP loan forgiveness in the amount of $16,983, and the accrued interest of $310 as other income on the Statement of income.\nNote 13 - Joint Venture Investment in HIE LLC\nIn connection with the discussion in note 4, - Restatement of Financial Statements for the Year End June 30, 2021, the joint venture investment in HIE LLC is accounted for by the Company using the equity method in accordance with FASB ASC 323. HIE has generated a gain of $59,208 and a loss of $1,385,962 during fiscal year 2022, and 2021, respectively, of which the Company recorded 33.33% of such gain and loss in the amounts of $19,736 and ($461,987), respectively.\nNote 14 - Income Taxes\nThe Company did not recognize a provision (benefit) for income taxes for the years ended June 30, 2022 and 2021.\nAt December 31, 2021 and 2020, the Company had net deferred tax assets principally arising from the net operating loss carryforward for income tax purposes multiplied by an expected federal rate of 21%.\nAs management of the Company cannot determine that it is more likely than not that the Company will realize the benefit of the deferred tax assets, a valuation allowance equal to 100% of the net deferred tax asset existed at June 30, 2022 and 2021.\nA reconciliation of the federal statutory income tax to our effective income tax is depicted below:\nJune 30,\nJune 30,\nFederal statutory rates\n$ (270,648 )\n$ (1,092,802 )\nIncome tax adjustment\nStock based compensation\n101,262\n104,886\nPermanent difference\nValuation allowance against net deferred tax assets\n169,098\n987,573\nEffective rate\n$ -\n$ -\nOn June 30, 2022, the Company had federal net operating loss carry forwards of approximately $1,715,118. This loss will never expire but its utilization is limited to 80% of taxable income in any future year.\nNet deferred tax assets consist of the following components as of:\nJune 30,\nJune 30,\nOperating loss carry forward\n$ 1,715,118\n$ 1,546,020\nValuation allowance\n(1,715,118 )\n(1,546,020 )\nNet deferred income tax asset\n$ -\n$ -\nThe Company is open to examination of our income tax filings in the United States and state jurisdictions for the 2018 through 2021 tax years. Tax attributes from years prior to that can be adjusted as a result of examinations. In the event that the Company is assessed penalties and or interest, penalties will be charged to other operating expense and interest will be charged to interest expense.\nNote 15 - Related Party Transactions\nRelated party transactions are described in detail in Note 6, Note 7, Note 8, and Note 10.\nNote 16 - Commitments and Contingencies\nOn July 17, 2020, the Company entered into a Membership Agreement (See Investment in HIE LLC in Item 1. Description of Business). Under the terms and conditions of the Membership Agreement, in the event of a loss of capital of HIE, the Company shall contribute to repay 33.3% of the Origination Loan and Additional Contribution and of any losses of HIE.\nIn addition, the Company is obliged to repay 1/3 of the loan contributed by Eagle or 1/3 of the capital paid by Eagle according to the membership agreement. As of June 30, 2022, and 2021, the balances of loan due to Eagle - JV partner totaled $442,251, and $707,654, respectively.\nNote 17 - Subsequent Events\nOn August 19, 2022, M. Richard Cutler resigned from the Board of Directors of Hawkeye Systems, Inc for personal reason.\nOn September 1, 2021, Steve Hall converted two promissory notes with an aggregate principal amount of $500,000 and the associated accrued interest of $94,344 into 16,666,667 shares of common stock at $0.03566 per share. The transaction was being recorded as common stock payable-related party as of June 30, 2022 and reclassed to equity when the shares were registered on July 28, 2022. Item 9. Change in and Disagreement with Accountants on Accounting and Financial Disclosure\nNone. Item 9A. Controls and Procedures\nManagements Annual Report on Internal Control over Financial Reporting.\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rule 13a-15(f) under the Exchange Act). Our internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes of accounting principles generally accepted in the United States. In our review, we sought to find potential for material weaknesses in our financial controls, which is defined as a deficiency, or combination of deficiencies, in our accounting such that there is a reasonable possibility that a material misstatement of the Companys annual or interim financial statements will not be prevented or detected on a timely basis.\nBecause of its inherent limitations, which include a process that involves human diligence and compliance and is subject to lapses in judgment and breakdowns resulting from human failures, internal control over financial reporting may not prevent or detect misstatement, whether unintentional errors or fraud. Therefore, even those systems determined to be effective can provide only reasonable assurance of achieving their control objectives.\nOur management, consisting of Corby Marshall as Chief Executive Officer and Christopher Mulgrew as Chief Financial Officer, reviewed and evaluated the effectiveness of the Companys internal control over disclosure controls and procedures (as such term is defined in Rules 13a-15(3) and 15d-15(e) under the Securities Exchange Act of 1934, as amended (the Exchange Act)) and financial reporting as of June 30, 2021. In making this assessment, our management used the criteria described in Internal Control-Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO), as well as the guidance provided in SEC Release 33-8809. In such evaluation, Mr. Marshall and Mr. Mulgrew assessed daily interaction, self-assessment and other on going monitoring activities as evidence in the evaluation. Furthermore we sought to identify financial reporting risks, identify controls that adequately address financial reporting risks, considered entity level controls, reviewed the role of technology in our controls and reviewed the evidence available to support the assessment.\nBased on this evaluation, our management concluded that, as of June 30, 2022, our disclosure controls and our internal controls over financial reporting were not effective in recording, processing, summarizing and report on a timely basis information required to be disclosed in the reports that we file or submit under the Exchange Act and were not effective in assuring that information required to be disclosed in the reports we file or submit under the Exchange Act due to material weaknesses including (i) the Company having only two officers handling all financial transactions, (ii) lack of appropriate operational controls and consistency in providing our accounting personnel with financial information, (iii) incomplete financial statements on a daily basis and resulting errors in our underlying accounting system, (iv) lack of proper documentation of our assessment and evaluation, and (v) our determination that internal controls were ineffective due to the limited segregation of duties because of the limited management structure.\nIn response to that assessment we have made a determination that all accounting and financial reporting services should be outsourced to a qualified consulting firm, and we immediately engaged a new financial services provider. We subsequently replaced that provider with an internal accounting contractor.\nWe have also made the determination that we need to dedicate more of the Companys current and future financial resources to this function and engaged a permanent Chief Financial Officer.\nThis annual report does not include an attestation report of our registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by our registered public accounting firm pursuant to rules of the SEC that permits us to provide only managements report in this annual report.\nChanges in Internal Control over Financial Reporting.\nOther than engaging a new financial services firm to provide financial statements, there were no changes in our internal control over financial reporting that occurred during the fourth quarter of the year ended June 30, 2022 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. Item 9B. Other Information\nNone.\nPART III Item 10. Directors, Executive Officers and Corporate Governance\nThe following persons are our executive officers and directors, and hold the offices set forth opposite their names.\nName\nAge\nPosition\nCorby Marshall\nChief Executive Officer and Director\nChristopher Mulgrew\nChief Financial Officer and Director\nM. Richard Cutler1\nDirector\nOur Board of Directors consists of two members. All directors may be reimbursed their expenses, if any, for attendance at meetings of the Board of Directors.\nM. Richard Cutler resigned from the Board of Directors of Hawkeye Systems, Inc., on August 19, 2022.\nThe following is a brief account of the business experience during the past five years of each of our directors and executive officers:\nCorby Marshall, Chief Executive Officer, and Director\nCorby Marshall is the founder, chief executive officer and director of Hawkeye Systems, Inc. since August 2019. Before that, Mr. Marshall was the Chief Executive Officer of Hilltop Cybersecurity Inc. (CSE: CYBX) starting in March 2017. Previously, Mr. Marshall was Senior Vice President of Alliances and Partnerships for AppOrbit; where he developed and led the go-to-market programs for all consulting, reseller, and solution partners. He previously led sales, consulting, marketing, and operations for several companies, including Metastorm (OpenText), Mercator (IBM), Niku and LabCorp. Corby is an expert at developing new programs and leading through transformational change; skills he honed during his service as an Airborne-qualified, Field Artillery Officer in the United States Army. Mr. Marshall also speaks Portuguese.\nMr. Marshall is a distinguished graduate of the U.S. Military Academy at West Point. Mr. Marshalls military career included time in Kuwait, Somalia and various other deployment areas as a Field Artillery Officer specializing in 155mm self-propelled artillery units.\nChristopher Mulgrew, Chief Financial Officer and Director\nMr. Christopher Mulgrew has been our chief financial offer since January 2021 and was elected as a member of our board of directors in May of 2022. Prior to joining Hawkeye Systems, Inc., Mr. Mulgrew performed contract CFO, mergers, and acquisitions consulting for Gimmal, Inc., a private equity backed SaaS company. In 2019 and 2020 he was Chief Financial Officer for Panther Fluids Management, LLC, a Houston-based engineering, and drilling fluids company. Prior to that Mr. Mulgrew ended his tenure at award-winning JEMSU, LLC in 2018 as Chief Executive Officer where he had served as Chief Financial Officer 2011-2017. He helped build JEMSU via multiple acquisitions and an aggressive organic growth strategy.\n________________\n1Resigned after June 30, 2022\nIn 2009 and 2010 Mr. Mulgrew was the Global Controller for the Shell Technology Ventures Fund (STV), a $1.4 billion venture capital fund focused on upstream oil and gas technology companies. While at STV he served on the board of several portfolio companies including Prometheus Energy Group, Inc., ThruBit BV (acquired by Schlumberger), and Smartpipe Technologies.\nDuring 2009-2010 Mr. Mulgrew was Chief Operating Officer of Pacific Western Brewing Ltd., Canada's largest independent brewery and beverage company. Previously he led the IPO via reverse merger of Acro Energy Technologies Corp as Chief Financial Officer. Mr. Mulgrew earned an MBA from the top-ranked Jones Graduate School of Business at Rice University and holds a BBA in Accounting from Simon Fraser University in Canada. Christopher is also qualified as a Chartered Public Accountant in Canada and a Certified Public Accountant in the US and has completed executive programs at the London School of Business.\nRichard Cutler\nMr. Cutler was appointed as a director of the Company in September 2019. Mr. Cutler founded Cutler Law Group in 1996. Mr. Cutler has practiced in the general corporate and securities area and international business transactions since his graduation from law school. Mr. Cutler is a graduate of Brigham Young University (B.A., magna cum laude, 1981); and Columbia University School of Law (J.D. 1984). While at Columbia, Mr. Cutler was honored as a Harlan Fiske Stone Scholar, was Managing Editor of the Columbia Journal of Law and Social Problems, received a Recognition of Achievement with Honors in Foreign and International Law, Parker School of Foreign and Comparative Law and was honored for best senior writing for \"United States v. Ross: A Solution to the Automobile Container Dilemma?\" published in the Columbia Journal of Law & Social Problems in 1983.\nMr. Cutler was admitted to the State Bar of Texas in 1984 and the State Bar of California in 1990. After law school, Mr. Cutler joined Jones, Day, Reavis & Pogue where he practiced in the corporate, securities and mergers and acquisitions departments. Mr. Cutler subsequently spent five years in the corporate and securities department in the Dallas office of Akin, Gump, Strauss, Hauer & Feld. After moving to the west coast, Mr. Cutler was with the Los Angeles office of Kaye, Scholer, Fierman, Hayes & Handler, a New York based law firm, where he continued his corporate securities practice.\nIn 1991, Mr. Cutler founded the law firm of Horwitz, Cutler & Beam in Anaheim California, a general practice firm, where he managed the corporate and securities practice for five years. In 1996, Mr. Cutler formed Cutler Law Group in Newport Beach, California, a firm which specializes only in general business, corporate and securities law, as well as international business transactions. Cutler Law Group moved to Augusta, Georgia in September 2002, where he continued to practice law and operated The Club at Raes Creek, a first-class swim, tennis and fitness club while continuing his legal practice in Augusta.\nFrom 2008 until 2010, Mr. Cutler was President and Chief Executive Officer of Sustainable Power Corp., a company in Baytown, Texas specializing in green energy technologies. Cutler Law Group moved to Houston, Texas in June 2009. Mr. Cutler has been admitted to the U.S. Federal District Courts, Central and Northern Districts of California, U.S. Federal District Court, Southern District of Texas, as well as the U.S. Court of Appeals, Ninth Circuit. Mr. Cutler is the author of \"Comparative Conflicts of Law: Effectiveness of Contractual Choice of Forum,\" published in the Texas International Law Journal. Mr. Cutler is a Director of Nymox Pharmaceutical, Inc.\nMr. Cutler resigned from his office as a member of the Companys board of directors for personal reasons on August 19, 2022.\nCommittees of the Board\nDecisions of the Board of Directors are generally taken by unanimous written consents. The current board comprises two members and is intending to hold regularly scheduled meetings. The entire board provides the functions of Audit, Compensation and Governance committees until such time as charters for these committees can be adopted and they can be populated by independent directors.\nCode of Ethics\nThe Company has adopted a Code of Ethics that applies to our principal executive officer, principal financial officer, principal accounting officer or controller, or persons performing similar functions. Until recently we have had a sole officer and director conducting all operations.\nFamily Relationships\nNo family relationships exist between any of our present directors and officers.\nCompliance with Section 16(A) of The Exchange Act\nSection 16(a) of the Securities Exchange Act of 1934, as amended, requires that our directors and executive officers and persons who beneficially own more than 10% of our common stock (referred to herein as the reporting persons) file with the SEC various reports as to their ownership of and activities relating to our common stock. Such reporting persons are required by the SEC regulations to furnish us with copies of all Section 16(a) reports they file. Based solely upon a review of copies of Section 16(a) reports and representations received by us from reporting persons, and without conducting any independent investigation of our own during the fiscal year ended June 30, 2021, all forms required, if any, were filed with the SEC by such reporting persons.\nChanges in Nominating Procedures\nNone Item 11. Executive Compensation\nThe following table sets forth information concerning the total compensation paid or accrued by us during the fiscal year ended June 30, 2022 and the fiscal year ended June 30, 2021 to:\n·\nall individuals who served as our chief executive officer, chief financial officer or acted in a similar capacity for us at any time during such periods, and\n·\nall individuals who served as executive officers of ours at any time during such periods and received annual compensation in excess of $100,000.\nSummary Compensation Table\n(a)\n(b)\n(c)\n(d)\n(e)\n(f)\n(g)\n(h)\n(i)\n(j)\nName and Principal\nSalary\nBonus\nStock Awards\nOption Awards\nNon-Equity Incentive Plan Compensation\nChange in Pension Value & Non-qualified Deferred Compensation Earnings\nAll Other\nCompensation\nTotals\nPosition\nYear\n($)*\n($)\n($)\n($)\n(S)\n($)\n($)\n($)\nCorby Marshall, Chief Executive Officer\n243,597\n66,511\n310,108\nCorby Marshall, Chief Executive Officer\n250,000\n100,000\n37,497\n387,497\nChristopher Mulgrew, Chief Financial Officer & Director\n195,000\n10,000\n17,415\n222,415\nChristopher Mulgrew, Chief Financial Officer & Director\n80,000\n182,493\n262,493\nRichard Cutlet, Director (Resigned on August 19, 2022)\n20,000\n31,716\n51,716\nRichard Cutlet, Director (Resigned on August 19, 2022)\n37,497\n37,497\nNarrative Disclosure Requirements for Summary Compensation Table\nCompensation\nOn June 11, 2020, the Company entered into an employment agreement with Corby Marshall, the Companys chairman of the board of directors, president, and chief executive officer (the Employment Agreement). The term of the Employment Agreement is three years. The Employment Agreement will automatically extend for successive three-year terms, unless either party gives written notice of termination 30 days prior to the end of the then current term. Pursuant to the terms of the Employment Agreement, Mr. Marshall shall receive a base salary from the Company of $250,000 per year. If the Company is unable to pay this amount in cash, Mr. Marshall may defer cash compensation and receive like kind compensation in shares of the Companys common stock. Mr. Marshall shall be reimbursed for business expenses, receive a car allowance and health benefits from the Company. As part of his compensation, Mr. Marshall is entitled to receive a target bonus of up to 100% of his base salary, based on the Companys and his individual performance. If Mr. Marshalls employment is terminated by the Company without cause, he will be entitled to receive severance benefits. The severance benefits include (i) the continuation of payment of his base salary in effect immediately prior to termination for no less than twelve months (the Severance Benefit Period); and (ii) the continuation of all employment benefits for the Severance Benefit Period. If Mr. Marshall is terminated without cause and in conjunction with a change in control, he will be entitled to receive change in control benefits, which includes (i) continuation of payment of his base compensation for a period equal to twice the amount of the Severance Benefit Period (the Change in Control Benefit Period), and (ii) the continuation of his employment benefits for the Change in Control Benefit Period.\nOn January 15, 2021, the Company entered into a consulting agreement with Christopher Mulgrew, the Companys chief financial officer (the Consulting Agreement). The Consulting Agreement was amended and restated on March 1st, 2021 (the Restated Agreement). Pursuant to the terms of the Restated Agreement, the Company shall pay Mr. Mulgrew a consultant fee of US$195,000 per annum and issue options to acquire 500,000 shares of the Companys Common Stock at $0.30 per shares, with 20% of the options vesting immediately upon issuance of the option, and an additional 20% every three months thereafter. The agreement also included healthcare premiums and automobile allowance.\nAs of the date of this report, no other officer or director has formally entered into any compensation arrangement for services provided under consulting agreements or employment agreements.\nRetirement, Resignation or Termination Plans\nWe sponsor no plan, whether written or verbal, that would provide compensation or benefits of any type to an executive upon retirement, or any plan that would provide payment for retirement, resignation, or termination as a result of a change in control of our company or as a result of a change in the responsibilities of an executive following a change in control of our company.\nDirectors Compensation\nThe persons who served as members of our Board of Directors, including executive officers, did not receive any cash compensation for services as directors in 2021 or 2022. We may reimburse our directors for expenses incurred in connection with attending board meetings.\nOption Exercises and Stock Vested\nDuring fiscal year 2022, the Company has issued 2,400,000 stock options that are fully vested on the grant date to the officers and directors. The exercise prices of these options ranged from $0.05 to $0.11. The term of all options is five years. The aggregate fair value of these stock options total $115,642 and was recognized fully as of June 30, 2022. 900,000 options were exercised by the Companys officers and directors during the fiscal year ended 2022.\nIn fiscal year 2021, the Company granted 1,275,000 stock options to its officers and directors. The exercise price of these options ranged from $0.11 to $0.30, and their term was five years. These options vested 20% immediately upon issuance of the options, with an additional 20% vesting every three months thereafter. The fair value of these option was $257,487 of which $97,995 was recognized in year ended June 30, 2021, and $159,495 recognized in year ended June 30, 2022. All stock options have been exercised as of June 30, 2022.\nIn 2019, the board of directors adopted the 2019 Directors, Officers, Employees and Consultants Stock Option Plan (Option Plan) whereby the Company reserved for issuance 2,500,000 shares of common stock and agreed that such shares shall, when issued and paid for in accordance with the provisions of the Option Plan, constitute validly issued, fully paid and non-assessable shares of common stock.\nThe Company has granted the aggregate total of 5,325,000 stock options issued to the directors, and officers, of which 1,150,000 stock options were granted under the Option Plan, and 4,175,000 options, were granted as non-statutory stock options, outside of the Option Plan. As of the day of this annual report, 3,825,000 shares are exercised on November 2, 202, and 1,500,000 stock options are exercisable.\nDirector and Executive Officer Outstanding Equity Awards at Fiscal Year-End\nThe following table provides certain information concerning any common share purchase options, stock awards or equity incentive plan awards held by each of our named executive officers that were outstanding as of June 30, 2022.\nOption Awards\nStock Awards\nNumber of\nSecurities\nUnderlying\nUnexercised\nOptions (#)\nNumber of\nSecurities\nUnderlying\nUnexercised\nOptions (#)\nEquity\nIncentive Plan\nAwards:\nNumber of\nSecurities\nUnderlying\nUnexercised\nUnearned\nOption\nExercise Price\nOption\nExpiration\nNumber of\nShares or\nUnits of\nStock That\nHave Not\nVested\nMarket\nValue of\nShares or\nUnits of\nStock That\nHave Not\nEquity\nIncentive\nPlan\nAwards:\nNumber\nof\nUnearned\nShares,\nUnits or\nOther\nRights\nThat Have\nNot\nEquity\nIncentive Plan\nAwards:\nMarket or\nPayout Value of\nUnearned\nShares, Units or\nOther Rights\nThat Have Not\nName\nExercisable\nUn-exercisable\nOptions (#)\n($)\nDate\n(#)\nVested\nVested\nVested\nCorby Marshall, Chief Executive Officer\n1,000,000\n$ 0.02\n05/22/2027\nChristopher Mulgrew, Chief Financial Officer & Director\n500,000\n$ 0.01\n05/22/2027\nRichard Cutlet, Director Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe following table sets forth, as of December 14, 2022, the beneficial ownership of Hawkeye Systems, Inc. common stock by each of our directors and named executive officers, each person known to us to beneficially own more than 5% of our common stock, and by the officers and directors of the Company as a group. Except as otherwise indicated, all shares are owned directly. Unless otherwise indicated in the footnotes to the following table, each person named in the table has sole voting and investment power (subject to applicable community property laws) and that persons address that of the Company. Shares of Common Stock subject to options, warrants, or convertible notes currently exercisable or convertible or exercisable or convertible within 60 days after December 14, 2022 are deemed outstanding for computing the share ownership and percentage of the person holding such options, warrants, or convertible notes but are not deemed outstanding for computing the percentage of any other person. As of December 14, 2022, there were 42,270,815 shares of our common stock outstanding:\nTitle of Class\nName and Address of Beneficial Owner\nNumber of Shares Owned Beneficially\nPercent of\nClass Owned\nCommon Stock\nCorby Marshall (1)\n1,000,000\n2.19 %\nCommon Stock\nM. Richard Cutler (2)\n500,000\n1.09 %\nCommon Stock\nChristopher Mulgrew (3)\n750,000\n1.64 %\nCommon Stock\nSteve Hall (4)\n40,643,996\n88.98 %\nAll Executive Officers and Directors as a Group (3 persons)\n2,250,000\n5.25 %\n_____________\n(1)\nc/o Hawkeye Systems, Inc. Consists of 1,000,000 shares held by Mr. Marshall pursuant to options.\n(2)\nc/o Cutler Law Group, P.C., 6575 West Loop South, Suite 500, Bellaire, TX 77401. Consists of 500,000 shares held by Mr. Cutler to be issued which are restricted until acquisition or reverse takeover of the company.\n(3)\nc/o Hawkeye Systems, Inc. Consists of 1,250,000 shares of stock held by Mr. Mulgrew Christopher, of which options to purchase 500,000 shares of common stock, and 250,000 shares of stock to be issued which are restricted until acquisition or reverse takeover of the company.\n(4)\nc/o Hawkeye Systems, Inc. Consists of 29,060,663 shares of stock held by Mr. Hall Steve, of which included 2,393,996 shares of warrants, 25,000,000 shares from convertible note, and 16,666,667 shares of stock to be issued.\nNote: Beneficial Ownership of Securities: Pursuant to Rule 13d-3 under the Securities Exchange Act of 1934, involving the determination of beneficial owners of securities, a beneficial owner of securities is a person who directly or indirectly, through any contract, arrangement, understanding, relationship or otherwise has, or shares, voting power and/or investment power with respect to the securities, and any person who has the right to acquire beneficial ownership of the security within sixty days through means including the exercise of any option, warrant or conversion of a security. Item 13. Certain Relationships and Related Transaction, and Director Independence\nIn addition to the cash and equity compensation arrangements of our directors and executive officers discussed above under Director Compensation and Executive Compensation, the following is a description of transactions to which we have been a party in which the amount involved exceeded or will exceed $120,000 and in which any of our directors, executive officers, beneficial holders of more than 5% of our capital stock, or entities affiliated with them, had or will have a direct or indirect material interest.\nAs of the date of this annual report, other than as disclosed below and in this annual report, none of our directors, officers or principal stockholders, nor any associate or affiliate of the foregoing, have any interest, direct or indirect, in any transaction or in any proposed transactions, which has materially affected or will materially affect us.\nM. Richard Cutler is President and sole shareholder of Cutler Law Group, P.C. Cutler Law Group, P.C. acted as our corporate and securities counsel until 2022. M. Richard Cutler has resigned from the Board of Directors of Hawkeye Systems, Inc., on August 19, 2022.\nOn April 6, 2020, and December 15, 2020, the Company issued two convertible notes payable of $250,000 each to Steve Hall. Both notes have one year term with simple interest at 10% per annum if repaid within 90 days, and simple interest at 20% per annum thereafter. At the option of holder, this note is convertible at any time which is six months from the date of issuance through that date which is one year from the date of issuance at a conversion price of $0.25 per share. In consideration for the loans, the Company also granted to the Lender 200,000 stock options exercisable at $0.25 for a two-year term. The options vested upon issuance. Both notes and the accrued interests totaled $594,344 have converted on September 1, 2021 for the aggregate total of 16,666,667 shares of common stock. On November 2, 2021, the Company issued 160,000 shares of common stock for cashless exercise of 200,000 shares of stock option.\nOn October 1, 2021, the inventory financing payable with Steve Hall was converted into a convertible note for the principal amount of $500,000, with annual simple interest rate of 12% for the first 90 days and 20% thereafter. The maturity date of this note was September 30, 2022. At the option of holder, this note is convertible at any time into shares of common stock at a conversion price of $0.02 per share. As of June 30, 2022, the accrued interest was $64,932.\nOn October 1, 2021, Steve Hall agreed to provide a Line of Credit of up to $1,000,000 to the Company with simple interest at 12% for the first 90 days, and simple interest at 20% per annum thereafter. The principal and interest payable shall be added to the principal amount of the agreement and payable pursuant to the same terms. The Line of Credit shall expire on the due date on October 1, 2022 unless renewed and/or extended by lender and borrower. Over the fiscal year 2022 in multiple transactions dates, the Company has withdrawn a total of $265,000. In connection with the Line of Credit, the Company has accrued interest of $15,015 in year 2022.\nDirector Independence\nOur directors are not independent, as defined by SEC rules adopted pursuant to the requirements of the Sarbanes-Oxley Act of 2002. Although our stock is not listed for trading on the Nasdaq Stock Market at this time, we are required to determine the independence of our directors by reference to the rules of a national securities exchange or of a national securities association (such as the Nasdaq Stock Market). In accordance with these requirements, we have determined that none of our directors are independent directors, as determined in accordance with Rule 4200(a)(15) of the Marketplace Rules of the Nasdaq Stock Market, Inc. Subsequent to June 30, 2022, our board of directors is comprised of Corby Marshall and Chris Mulgrew, none of which are independent directors.\nDirector Independence\nOur directors are not independent, as defined by SEC rules adopted pursuant to the requirements of the Sarbanes-Oxley Act of 2002. Although our stock is not listed for trading on the Nasdaq Stock Market at this time, we are required to determine the independence of our directors by reference to the rules of a national securities exchange or of a national securities association (such as the Nasdaq Stock Market). In accordance with these requirements, we have determined that none of our directors are independent directors, as determined in accordance with Rule 4200(a)(15) of the Marketplace Rules of the Nasdaq Stock Market, Inc. Subsequent to June 30, 2022, our board of directors is comprised of Corby Marshall and Chris Mulgrew, none of which are independent directors. Item 14. Principal Accounting Fees and Services\nAudit Fees\nThe aggregate fees billed for the fiscal year ended June 30, 2022 and the fiscal year ended June 30, 2021 for professional services rendered by the principal accountants for the audit of the registrant's annual financial statements and review of financial statements included in the registrant's Form 10-K or services that are normally provided by the accountant in connection with statutory and regulatory filings or engagements were: $52,340 and $45,060, respectively.\nAudit-Related Fees\nNo aggregate fees were billed in either the fiscal year ended June 30, 2022 and the fiscal year ended June 30, 2021 for assurance and related services by the principal accountant that are reasonably related to the performance of the audit or review of the registrants financial statements.\nTax Fees\nNo aggregate fees were billed for professional services rendered by the principal accountant for tax compliance, tax advice, and tax planning.\nAll Other Fees\nOther fees billed for professional services provided by the principal accountant, other than the services reported above, for the fiscal year ended June 30, 2022 and the fiscal year ended June 30, 2021 were $0 and $0.\nAudit Committee Pre-Approval Policies\nOur Board of Directors performing as the Audit Committee has approved the principal accountants performance of services for the audit of the registrants annual financial statements and review of financial statements included in our Form 10-K for services that are normally provided by the accountant in connection with statutory and regulatory filings or engagements for the fiscal year ending June 30, 2022. Audit-related fees, tax fees, and all other fees, if any, were approved by the Board of Directors. Item 15. Exhibits, Financial Statement Schedules\nThe following exhibits are filed as part of this registration statement.\nExhibit\nDescription\n3.1\nArticles of Incorporation of Registrant*\n3.2\nBylaws of Registrant*\n3.3\n2019 Employees, Directors and Consultants Stock Option Plan\n10.1\nJoint Venture Agreement dated May 9, 2018*\n10.2\nJoint Venture Operating Agreement for Optical Flow, LLC dated August 1, 2018*\n10.3\nExclusive License Agreement between Insight Engineering LLC and Optical Flow, LLC dated as of August 1, 2018*\n10.4\nForm of Subscription Agreement*\n10.5\nForm of Series A Warrant for $.15 stock issuance*\n10.6\nForm of Series B Warrant for $.15 stock issuance*\n10.7\nForm of Series C Warrant for $.15 stock issuance*\n10.8\nForm of Series D Warrant for $.15 stock issuance*\n10.9\nForm of Series A Warrant for $.50 stock issuance*\n10.10\nForm of Series B Warrant for $.50 stock issuance*\n10.11\nCorporate Development, Investor Relations and Advisory Agreement, dated as of August 1, 2019 between the Registrant and Stratcon Advisory and Tysadco Partners. *\n10.12\nStock Purchase Agreement dated as of September 19, 2019 among the Registrant, Radiant Images, Inc., Gianna Wolfe and Michael Mansouri *\n10.13\nSecured Revolving Promissory Note dated April 26, 2019 from Radiant Images, Inc. in favor of Optical Flow, LLC *\n10.14\nSecurity Agreement dated as of April 26, 2019 between Radiant Images, Inc. and Optical Flow, LLC. *\n10.15\nConvertible Note dated January 22, 2019 between the Registrant and Jon Bakshi. *\n10.16\nSecurities Purchase Agreement dated as of March 17, 2020 by and between the Registrant and Eagle Equities, LLC *\n10,17\n10% Convertible Redeemable Note dated as of March 17, 2020 due March 17, 2021 from the Registrant to Eagle Equities, LLC *\n10.18\nJoint Venture Agreement dated as of May 20, 2020 among the Registrant, Eagle Equities LLC and Ikon Supplies. *\n10.19\nJoint Venture Agreement dated as of June 1, 2020 between the Registrant and Steve Hall *\n10.20\nSecurity Agreement dated as of July 17, 2020 among the Registrant, HIE LLC and Eagle Equities, LLC. *\n10.21\nProfit Sharing Agreement dated as of September 10, 2020 among the Registrant and Ikon Supplies *\n10.22\nConsulting Agreement dated as of January 15, 2021 among the Registrant and Christopher Mulgrew *\nList of Subsidiaries. *\n31.1\nCertification of Chief Executive Officer pursuant to Rule 13a-14 of the Securities Exchange Act of 1934\n31.2\nCertification of Chief Financial Officer pursuant to Rule 13a-14 of the Securities Exchange Act of 1934\n32.1\nCertification of Chief Executive Officer pursuant to Section 1350\n32.2\nCertification of Chief Financial Officer pursuant to Section 1350\n101.INS\nInline XBRL Instance Document (the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document).\n101.SCH\nInline XBRL Taxonomy Extension Schema Document.\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document.\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document.\n101.LAB\nInline XBRL Taxonomy Extension Labels Linkbase Document.\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document.\nCover Page Interactive Data File (formatted as inline XBRL and contained in Exhibit 101).\n___________\n* Previously filed\nSIGNATURES\nPursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this amendment No. 1 to the report to be signed on its behalf by the undersigned, thereunto duly authorized.\nHawkeye Systems, Inc.\nDecember 14, 2022\nBy:\n/s/ Corby Marshall\nCorby Marshall\nChief Executive Officer\n(Principal Executive Officer)\nDecember 14, 2022\nBy:\n/s/ Christopher Mulgrew\nChristopher Mulgrew\nChief Financial Officer\n(Principal Financial Officer)\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nDate: December 14, 2022\n/s/ Corby Marshall\nCorby Marshall, Director\nand Principal Executive Officer\nDate: December 14, 2022\n/s/ M. Richard Cutler\nM. Richard Cutler, Director"
}