{
    "cik": "1753931",
    "company": "Shengda Network Technology, Inc.",
    "filing_type": "10-K",
    "filing_date": "2022-10-28",
    "period_of_report": "2022-06-30",
    "sic": "7371",
    "state_of_inc": "NV",
    "state_location": "F4",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1753931/0001493152-22-029892-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1753931/000149315222029892/form10-k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1753931/0001493152-22-029892.txt",
    "filename": "1753931_10K_2022_0001493152-22-029892.htm",
    "content": "ITEM 1. BUSINESS.\nBackground\nShengda Network Technology, Inc. (the Company) was incorporated on March 14, 2018 in the State of Nevada under the name Soltrest, Inc. On March 30, 2020, we filed an amendment to its Articles of Incorporation changing our name to Shengda Network Technology, Inc.\nOn April 20, 2020, we purchased 100% of the shares of Peaker International Trade Group Limited (Hong Kong) (Peaker) for a total purchase price of US$1,330. This purchase was made through our wholly owned subsidiary Jingmao Webmall, Inc., incorporated in the Cayman Islands on August 11, 2020. Peaker presently owns 100% of Zhejiang Jingmai Electronic Commerce Ltd., which is located in Zhejiang province, China. Thereafter, on May 15, 2020, Peaker incorporated in China a 100%-owned subsidiary, Zhejiang Jingmai Electronic Commerce Ltd. (China) (Jingmai Electronic) which is intended to serve as an operating company in China for our activities in China.\nJingmai Electronic has begun to supply goods to various social e-commerce platforms and merchants. Social e-commerce refers to the process of engaging customers at every point of their buying journey. Jingmai Electronic is designed to provide high-quality supply chain resources and is quicky moving into live broadcast management services in order to provide sustainable development for the Company. Jingmai Electronic, and its subsidiaries, also intend to provide comprehensive services, such as supply chain management and live broadcasting resources to TikTok and other social e-commerce platforms.\nRecent Developments\nOn April 22, 2022, the Company obtained 99% ownership of the following subsidiaries:\n● Yiwu Tianqi Enterprise Management Co., Ltd.;\n● Zhejiang Jingmai e-commerce Co., Ltd.;\n● Zhejiang Jingtao Supply Chain Co., Ltd., and\nThe interest in all of these subsidiaries was acquired for no consideration.\nOn June 28, 2022, the board of directors (the Board) of the Company dismissed SS Accounting & Auditing, Inc., as the Companys independent registered public accounting firm, and engaged Paris Kreit & Chiu CPA LLP, (Paris Kreit), as the Companys new independent registered public accounting firm.\nOn August 15, 2022, the size of the Board was increased to five members. Mr. Yizhong Chen, Mr. Hanguo Li, Mr. Manu Ohri and Mr. Yanfeng Wang were appointed as independent directors of the Board, effective the same date. In addition, effective the same date, the Board created an Audit Committee, a Nominating Committee and a Compensation Committee and also adopted a Code of Business Conduct and Ethics. The Company also adopted amended and restated bylaws.\nCovid-19 Pandemic\nOn March 11, 2020, the World Health Organization characterized COVID-19 as a pandemic. The Company is currently monitoring the outbreak of COVID-19 and the related business and travel restrictions and changes to behavior intended to reduce its spread.\nWhile the Companys operations are principally located outside the United States, we utilize various consultants located in the United States, we participate in a global supply chain, and the existence of a worldwide pandemic, the fear associated with COVID-19, or any, pandemic, and the reactions of governments around the world in response to COVID-19, or any, pandemic, to regulate the flow of labor and products and impede the travel of personnel, may impact our ability to conduct normal business operations, which could adversely affect our results of operations and liquidity. Disruptions to our supply chain and business operations, or to our suppliers or customers supply chains and business operations, could include disruptions from the closure of supplier and manufacturer facilities, interruptions in the supply of raw materials and components, personnel absences, or restrictions on the shipment of our or our suppliers or customers products, any of which could have adverse ripple effects on our manufacturing output and delivery schedule. Any of these uncertainties could have a material adverse effect on our business, financial condition or results of operations.\nDescription of Product or Services\nWe provide portals (similar to Amazon, Inc.) for the sale of products offered by reliable manufacturers and merchants at competitive prices. Products run the gamut from electronics to daily consumable products, food and clothing. We purchase goods according to market demand, directly from manufacturers that we have standing relationships with. The goods we source include, but are not limited to, electronic products, daily consumer goods such as shampoo and toothpaste, and various other items.\nWe then sell the goods we purchase, as well as products from other reliable merchants, to our various customers. Our Company is similar to a wholesaler in that our customers purchase goods from us bulk. We aim to effectively organize suppliers, manufacturers and distributors in order to minimize the costs of the whole supply chain system and offer competitive prices. Our Company does not warehouse or store any of the good we purchase. If the manufacturer we purchase from is not able to ship the goods directly to our customers, then our Company manages the logistics and arranges for a third-party shipping company.\nOur Company actively cooperates with other listed or state-owned enterprises. On May 23, 2022, we entered into a commodity purchase contract, through Yiwu Tianqi Enterprise Management Co., Ltd., with Kunming Pharmaceutical Group, a state-owned enterprise. We also engage with companies whose products we feel are of good quality and that also need new channels, specifically social e-commerce. We cooperate with these companies so that they can expand their sales and supplies by offering our products and services on their sites\nTarget Market and Clients/Potential Clients\nOur current target market is China, where we engage in e-commerce services. In recent years, with the rapid rise of social e-commerce, the Company began to diversify. Our sales channels have gradually changed from offline to online and from a single product sales business into a more comprehensive business of supply chain management.\nThe products supplied through our channels are high-quality and readily available products offered by a significant number of registered companies to members on our sales portals. At this date, we have over 500,000 registered and active members. We also do online market promotion through our online shopping malls and membership networks, word of mouth and social media such as WeChat. We also intend to offer products through offline stores and customer service centers. It is our goal to build the strongest Internet shopping channel in China.\nDuring the initial phase of our development, our main target clients were individual users that browse internet on a daily basis. Beginning in January 2022, our second and current phase of business development is focusing on growth through providing services and products to small companies. If we succeed with these smaller companies, we intend to offer our products and services to medium sized corporations.\nSources of Revenue\nOur revenue is generated in three main areas: traditional trade sales, which are sales to physical, offline stores; online wholesale sales, which are sales to online sellers; and sales of services which provide enterprises with marketing and promotion related services such as providing live broadcasting resources, technical services, and promotional services, among others.\nWe have identified three main marketing client groups associated with the various streams of revenue: individual users of personal computers and other internet enabled devices, and medium sized companies.\nWe are marketing to personal computing and other internet enabled device users with our WebMall sales and service. As of 2021, there were 340 million sales of personal computers and internet enabled devices, and several billion are expected over the next three to five years. Capturing a small sector of this user population could allow us to sell our products and services at a very attractive and affordable prices.\nGrowth Strategy\nWithin the next six months, we will provide services to a variety of locales in China. Zhejiang is the center of China, and we have estimated that 80% of our members are in Hubei, Jiangxi, Shanxi, Hebei, Anhui, Fujian and other provinces. Our members include users who register with us through email. The services we intend to provide are traditional trade sales, which are sales to physical, offline stores; online wholesale sales, which are sales to online sellers; and sales of services which provide enterprises with marketing and promotion related services such as providing live broadcasting resources, technical services, and promotional services, among others.\nOnce we have a core of business in China, we plan to expand to Southeast Asia, Europe and Latin America in over the next five to six years.\nCompetition\nCurrently, our competitive position within the industry is negligible in light of the fact that we have just recently started our operations. There are currently in the market larger and better-financed companies providing similar services.\nThe online sales industry is highly competitive. We compete with other numerous other firms, including larger regional, national and international firms that may have financial, operational, technical and marketing resources that exceed our own. Among these competitors are Amazon, Inc., Alibaba, Jingdong, and PinDuoDuo. Competitive factors include the level of technical expertise and experience, industry reputation, quality of work, price, geographic presence, dependability, availability of skilled personnel and financial stability. Our management believes that we can compete favorably with our competitors on the basis of these factors. There can be no assurance that our competitors will not develop the expertise, experience and resources to provide services that are superior in both price and quality to our services, or that we will be able to maintain or enhance our competitive position.\nCompetitive Advantages\nWe believe that our business model provides certain competitive advantages:\n● Offering free membership to consumers who utilize our services, including preferential shipping;\n● Offering a sharing of the economic benefits by offering discounts and rebates to regular customers; and\n● Providing superior customer services through all sales portals and physical locations.\nEmployees\nAs of October 28, 2022, we had 50 employees, all of whom were full-time.\nUncertainties Facing the Company\nAs an early-stage company, the Company expects to experience losses in the near term. The Company needs to generate additional revenue or locate additional financing in order to continue its developmental plans. There is no guarantee that the Company will be able to identify sufficient numbers of customers to generate enough revenues to continue operations or proceed with developing its business in accordance with its business plan.\nOne of the biggest challenges facing the Company will be in securing adequate capital to fund to keep operation, including securing adequate capital to pay for operations and hiring service providers. Secondarily, a major challenge will be implementing effective sales and marketing strategies to reach the intended end customers. The Company has considered and devised its initial sales, marketing and advertising strategy; however, the Company will need to skillfully implement this strategy in order to achieve success in its business.\nIn December 2019, an outbreak of a novel strain of coronavirus (COVID-19). On March 11, 2020, the World Health Organization characterized COVID-19 as a pandemic. In addition, as of the time of the filing of this Report, many states in the United States are still experiencing high rates of infection and many countries around the world, including the United States and China, have taken steps to restrict travel. The existence of a worldwide pandemic, the fear associated with COVID-19, or any, pandemic, and the reactions of governments in response to COVID-19, or any, pandemic, to regulate the flow of labor and products and impede the travel of personnel, may impact our ability to conduct normal business operations, which could adversely affect our results of operations and liquidity. Global health concerns, such as COVID-19, could also result in social, economic, and labor instability in the markets in which we operate. Any of these uncertainties could have a material adverse effect on our business, financial condition or results of operations. ITEM 1A. RISK FACTORS.\nAs a smaller reporting company, we are not required to provide the information required by this Item. ITEM 1B. UNRESOLVED STAFF COMMENTS.\nNone. ITEM 2. PROPERTIES.\nOn January 5, 2021, Zhejiang Jingmai Electronic Commerce Ltd. leased an office on the 4th floor of Block 3A, Lugang E-commerce Town, Yiwu City, in Zhejiang, China. The lease term of the office is from January 5, 2021 to April 5, 2022. There was a rent-free period January 5, 2021 to April 5, 2021. The monthly rent is $388. On March 20, 2022, Zhejian Jingmai Electronic Commerce Ltd. leased an office in Zhejiang, China. The lease term of the office is from April 1, 2022 to March 30, 2023. The monthly rent is $373. ITEM 3. LEGAL PROCEEDINGS.\nWe are currently not aware of any such legal proceedings or claims that we believe will have, individually or in the aggregate, a material adverse effect on our business, financial condition or operating results. From time to time, we may become involved in various lawsuits and legal proceedings, which arise in the ordinary course of business. However, litigation is subject to inherent uncertainties, and an adverse result in these or other matters may arise from time to time that may harm our business. ITEM 4. MINE SAFETY DISCLOSURES.\nNot applicable.\nPART II ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY; RELATED STOCKHOLDER MATTERS AND SMALL BUSINESS ISSUER PURCHASES OF EQUITY SECURITIES.\nMarket Information\nCommon Stock\nOur common stock is quoted on the OTC Pink under the symbol SDWL. On October 12, 2022, the closing price of our stock was $7.70.\nOur common stock is considered to be penny stock under rules promulgated by the SEC. Under these rules, broker-dealers participating in transactions in these securities must first deliver a risk disclosure document which describes risks associated with these stocks, broker-dealers duties, customers rights and remedies, market and other information, and make suitability determinations approving the customers for these stock transactions based on financial situation, investment experience and objectives. Broker-dealers must also disclose these restrictions in writing, provide monthly account statements to customers, and obtain specific written consent of each customer. With these restrictions, the likely effect of designation as a penny stock is to decrease the willingness of broker-dealers to make a market for the stock, to decrease the liquidity of the stock and increase the transaction cost of sales and purchases of these stocks compared to other securities.\nPreferred Stock\nSeries A Preferred Stock\nOn November 10, 2020, the Board designated 1,000,000 shares as Series A Preferred Stock. The original issue price of each share of Series A Preferred Stock was $1.00. The terms and rights of the Series A Preferred Stock as set forth below.\nLiquidation Preference\nIn the event of any liquidation, dissolution, or winding up of the corporation, either voluntary or involuntary, the holders of Series A Preferred Stock shall be entitled to receive, prior and in preference to any distribution of any of the assets or surplus funds of the Company to the holders of all other shares of stock but after distribution of such assets among, or payment thereof to holders of any preferred stock designated senior to the Series A Preferred Stock, an amount equal to $1.00, the Series A original issue price for each share of Series A Preferred Stock, plus an amount equal to all declared but unpaid dividends on Series A Preferred Stock (the Series A Liquidation Preference).\nAfter the payment of the full Series A Liquidation Preference, the remaining assets of the Company legally available for distribution, if any, shall be distributed ratably to the holders of the Common Stock in an amount equal to the Series A Liquidation Preference; after such distribution to the holders of the Common Stock, the remaining assets of the corporation legally available for distribution, if any, shall be distributed ratably among the Series A Preferred Stock and the Common Stock. If the assets and funds legally available for distribution among the holders of Series A Preferred Stock shall be insufficient to permit the payment to the holders of the full Series A Liquidation Preference, then the assets and funds shall be distributed ratably among holders of Series A Preferred Stock in proportion to the number of shares of Series A Preferred Stock owned by each holder.\nVoting Rights\nExcept as otherwise provided in the Certificate of Designation or required by law, the holders of the Series A Preferred Stock shall be entitled to vote, in the same manner and with the same effect as the holders of Common Stock, voting together with the holders of Common Stock as a single class. As to any matter on which the holders of Series A Preferred Stock shall be entitled to vote, the holders of the outstanding Series A Preferred Stock shall have voting rights equal to an aggregate of seventy-five percent (75%) of the total shares entitled to vote by both (i) the holders of all of the then outstanding shares of Common Stock (whether or not such holders vote) and (ii) the holders of all of the then outstanding shares of voting shares of the Company.\nRedemption\nThe Company shall have the right to redeem the Series A Preferred Stock, plus any accrued and unpaid dividends, in whole but not in part, at any time or from time to time, at a cash redemption price equal to the aggregate Series A original issue price the Series A Preferred Stock being redeemed (the Redemption Amount) plus an amount equal to the amount of the accrued and unpaid dividend thereon.\nHolders\nAs of the close of business on October 12, 2022, we had approximately 450 holders of our common stock. The number of record holders was determined from the records of our transfer agent and does not include beneficial owners of common stock whose shares are held in the names of various security brokers, dealers, and registered clearing agencies. Our transfer agent is Equity Stock Transfer LLC, 237 W 37th St Suite 602, New York, NY 10018, (212) 575-5757, www.equitystock.com. The transfer agent is registered under the Securities Exchange Act of 1934, as amended (the Exchange Act), and operates under the regulatory authority of the SEC and FINRA. In addition, we have one holder of 50,000 shares of Preferred Stock as of the close of business on October 12, 2022.\nDividends\nWe have not paid any dividends to date and have no plans to do so in the immediate future.\nOptions and Warrants\nWe do not have any outstanding options or warrants.\nSecurities Authorized for Issuance under Equity Compensation Plans\nAs of June 30, 2022, we had no securities authorized for issuance under equity compensation plans either approved or not approved by our shareholders.\nRecent Sales of Unregistered Securities\nOn July 15, 2020, the Company sold 723,500 shares of Common Stock to 72 investors for aggregate gross proceeds of $1,447,000.\nOn July 20, 2020, the Company sold 499,328 shares of Common Stock to 49 investors for aggregate gross proceeds of $998,656.\nOn July 28, 2020, the Company sold 606,928 shares of Common Stock to 52 investors for aggregate gross proceeds of $1,213,856.\nOn August 31, 2020, the Company sold 803,500 shares of Common Stock to 92 investors for aggregate gross proceeds of $1,607,000.\nOn October 15, 2020, the Company sold 531,856 shares of Common Stock to 98 investors for aggregate gross proceeds of $963,713. In addition, the Company issued 33,333 shares of common stock to a related party for a cash consideration of $2,000.\nOn November 2, 2020, the Company sold 3,551,500 shares of common stock to investors for $3,972,500.\nOn November 2, 2020, the Company sold 3,165,112 shares of common stock to 436 investors for a cash consideration of $6,230,225. at the sale price of $2.00 per share. In addition, the Company issued 333,333 shares of common stock to a related party for cash proceeds of $302,000.\nOn November 20, 2020, the Company issued 50,000 shares of Series A Preferred Stock in settlement of advances payable to an officer of $2,000.\nNone of the foregoing transactions involved any underwriters, underwriting discounts or commissions, or any public offering. Unless otherwise stated, the sales of the above securities were deemed to be exempt from registration under the Securities Act in reliance on Section 4(a)(2) of the Securities Act (and Regulation D or Regulation S promulgated thereunder) as transactions by an issuer not involving any public offering. The recipients of the securities in each of these transactions represented their intentions to acquire the securities for investment only and not with a view to or for sale in connection with any distribution thereof, and appropriate legends were placed on the share certificates issued in these transactions. All recipients had adequate access, through their relationships with us, to information about us. The sales of these securities were made without any general solicitation or advertising. ITEM 6. [RESERVED]. ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS.\nThe following discussion and analysis of our financial condition and results of operations should be read together with our financial statements and the related notes and other financial information included elsewhere in this Annual Report. Some of the information contained in this discussion and analysis or set forth elsewhere in this Annual Report, including information with respect to our plans and strategy for our business, includes forward-looking statements that involve risks and uncertainties. See Cautionary Note Regarding Forward-Looking Statements.\nCautionary Note Concerning Factors That May Affect Future Results\nThis Annual Report, including Managements Discussion and Analysis of Financial Condition and Results of Operations contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. The Company may also make forward-looking statements in other reports filed with the Securities and Exchange Commission, in materials delivered to shareholders and in press releases. In addition, the Companys representatives may from time to time make oral forward-looking statements.\nForward-looking statements relate to future events and typically address the Companys expected future business and financial performance. Words such as plan, expect, aim, believe, project, target, anticipate, intend, estimate, should, could, forecast and other words and terms of similar meaning, typically identify such forward-looking statements. In particular, these include, among others, statements relating to:\n● the Companys strategy for growth, future revenues, earnings, cash flow, uses of cash and other measures of financial performance, and market position,\n● worldwide economic, political, and capital markets conditions, such as interest rates, foreign currency exchange rates, financial conditions of our suppliers and customers, and natural and other disasters or climate change affecting the operations of the Company or our suppliers and customers,\n● new business opportunities, product development, and future performance or results of current or anticipated products,\n● the scope, nature or impact of acquisition, strategic alliance and divestiture activities,\n● the outcome of contingencies, such as legal and regulatory proceedings,\n● future levels of indebtedness, common stock repurchases and capital spending,\n● future availability of and access to credit markets,\n● asset impairments,\n● tax liabilities,\n● information technology security, and\n● the effects of changes in tax (including the newly enacted Tax Cuts and Jobs Act), environmental and other laws and regulations in the United States and other countries in which we operate.\nOverview\nWe were incorporated on March 14, 2018, in the State of Nevada. On March 30, 2020, we filed an amendment to our Articles of Incorporation changing our name to Shengda Network Technology, Inc.\nOn April 20, 2020, we purchased 100% of the shares of Peaker International Trade Group Limited (Hong Kong) (Peaker) for a total purchase price of US$1,330. This purchase was made through our wholly owned subsidiary Jingmao Webmall, Inc., incorporated in the Cayman Islands on August 11, 2020. Peaker presently owns 100% of Zhejiang Jingmai Electronic Commerce Ltd., which is located in Zhejiang province, China. Thereafter, on May 15, 2020, Peaker incorporated in China a 100%-owned subsidiary, Zhejiang Jingmai Electronic Commerce Ltd. (China) (Jingmai Electronic) which is intended to serve as an operating company in China for our activities in China.\nJingmai Electronic has begun to supply goods to various social e-commerce platforms and merchants. Social e-commerce refers to the process of engaging customers at every point of their buying journey. Jingmai Electronic is designed to provide high-quality supply chain resources and is quicky moving into live broadcast management services in order to provide sustainable development for the Company. Jingmai Electronic, and its subsidiaries, also intend to provide comprehensive services, such as supply chain management and live broadcasting resources to TikTok and other social e-commerce platforms.\nOn April 22, 2022, the Company obtained 99% ownership of the following subsidiaries:\n● Yiwu Tianqi Enterprise Management Co., Ltd.;\n● Zhejiang Jingmai e-commerce Co., Ltd.;\n● Zhejiang Jingtao Supply Chain Co., Ltd., and\nThe interest in all of these subsidiaries was acquired for no consideration.\nDescription of Our Business\nThe Companys principal business, through Jingmai Electronic, is providing an e-commerce portal (similar to Amazon or Wish) for the sale of products. We purchase goods according to market demand, directly from manufacturers that we have standing relationships with. The goods we source include, but are not limited to, electronic products, daily consumer goods such as shampoo and toothpaste, and various other items.\nWe then sell the goods we purchase, as well as products from other reliable merchants, to our various customers. Our Company is similar to a wholesaler in that our customers purchase goods from us bulk. We aim to effectively organize suppliers, manufacturers and distributors in order to minimize the costs of the whole supply chain system and offer competitive prices. Our Company does not warehouse or store any of the good we purchase. If the manufacturer we purchase from is not able to ship the goods directly to our customers, then our Company manages the logistics and arranges for a third-party shipping company.\nOur Company actively cooperates with other listed or state-owned enterprises. We currently have a commodity purchase contract with Kunming Pharmaceutical Group. We also engage with companies whose products we feel are of good quality and that also need new channels, specifically social e-commerce. We cooperate with these companies so that they can expand their sales and supplies by offering our products and services on their sites.\nRestatement of Correction of an Error\nAs of and for the years ended June 30, 2021, the Company had sales, accounts receivable and loan balances with a customer. In preparing the financial statements, management failed to identify and disclose the fact that the customer being a related party to the Company within the definition of ASC 850. The Company also failed to disclose this fact to the auditors of the Company.\nManagement has identified a material weakness in understanding and knowledge of US GAAP.\nThis Amendment No. 1 (Amendment No. 1) to the Annual Report on Form 10-K/A amends the Annual Report on Form 10-K of Shengda Network Technology, Inc. for the fiscal year ended June 30, 2021, as filed with the Securities and Exchange Commission (SEC) on September 28, 2021 (the Original Filing). In the Original Filing, Management concluded that Statements for the periods beginning with the first quarter of 2021 through the third quarter of 2022 (collectively, the Affected Periods) should be restated due to the missing disclosure of the related party transactions.\nResults of Operations\nFiscal Year Ended June 30, 2022 Compared to June 30, 2021\nThe following table summarizes the results of our operations during the fiscal years ended June 30, 2022 and 2021, respectively, and provides information regarding the dollar and percentage increase or decrease from the current 12-month period to the prior 12-month period:\nLine Item 6/30/2022 6/30/2021 Increase\n(Decrease)\nPercentage\nIncrease\n(Decrease)\n(Restated)\nRevenue $ 3,957,283 $ 9,489,187 $ (5,531,904 ) (58.3 )%\nOperating expenses 458,211 4,020,368 (3,562,157 ) (88.6 )%\nOther income, net 4,621,153 20,049 4,601,104 22949.3 %\nNet income (loss) 4,324,608 (2,716,347 ) 7,040,955 259.2 %\nBasic and Diluted Net Income (Loss) per common share 0.31 (0.23 ) 0.54 31.8 %\nDuring the year ended June 30, 2022, we had revenues of $3,957,283, compared to revenues of $9,489,187 for the year ended June 30, 2021, a decrease of $5,531,904 (58.3%) due to the Companys transformation and the continued impact of the global Covid-19 pandemic as well as the return of bad debt provisions.\nOperating expenses totaled $458,211 for the year ended June 30, 2022, compared to $4,020,368 for the year ended June 30, 2021, a decrease of $3,562,157 (88.6%). This decrease was attributable to the Companys profits from business activities and the receivable recovered. Other income, net totaled $4,324,608 for the year ended June 30, 2022, compared to $20,049 for the year ended June 30, 2021, an increase of $4,601,104, or 22949.3%. This increase was attributable to increased interest income and recovery of uncollectible accounts.\nWe recorded net income of $4,324,608 for the fiscal year ended June 30, 2022 as compared to a net loss of $2,716,347 for the fiscal year ended June 30, 2021. This increase was due to interest income and recovery of uncollectible accounts.\nLiquidity and Capital Resources\nLiquidity and Capital Resources for the year ended June 30, 2022 compared to the year ended June 30, 2021\nFor the Years Ended June 30\nSummary of Cash Flows:\nNet cash provided by (used in) provided by operating activities $ (8,066,026 ) $ (2,562,524 )\nNet cash provided by (used in) investing activities 8,365,090 (8,443,822 )\nNet cash provided by financing activities - 6,232,225\nForeign exchange rate fluctuations gain (loss) (37,211 ) 646,728\nNet increase (decrease) in cash 261,853 (4,127,393 )\nCash - Beginning of Year 143,933 4,271,326\nCash - End of Year $ 405,786 $ 143,933\nTo the extent we raise additional capital through the sale of equity or convertible debt securities, the issuance of such securities may result in dilution to existing stockholders. If additional funds are raised through the issuance of debt securities, these securities may have rights, preferences, and privileges senior to holders of common stock and the terms of such debt could impose restrictions on our operations. Regardless of whether our cash assets prove to be inadequate to meet our operational needs, we may seek to compensate providers of services by issuance of stock in lieu of cash, which may also result in dilution to existing shareholders. Even if we are able to raise the funds required, it is possible that we could incur unexpected costs and expenses, fail to collect significant amounts owed to us, or experience unexpected cash requirements that would force us to seek alternative financing.\nNo assurance can be given that sources of financing will be available to us and/or that demand for our equity/debt instruments will be sufficient to meet our capital needs, or that financing will be available on terms favorable to us. If funding is insufficient at any time in the future, we may not be able to take advantage of business opportunities or respond to competitive pressures or may be required to reduce the scope of our planned service development and marketing efforts, any of which could have a negative impact on our business and operating results. In addition, insufficient funding may have a material adverse effect on our financial condition, which could require us to:\n● Curtail our operations significantly, or\n● Seek arrangements with strategic partners or other parties that may require us to relinquish significant rights to technology platform and correlated services, or\n● Explore other strategic alternatives including a merger or sale of our Company.\nOperating Activities\nFor the year ended June 30, 2022, net cash used in operating activities of $8,066,026 was primarily a result of income of $4,324,608, depreciation and amortization of $19,165, provision for uncollectible receivables of $12,780, and an increase in operating assets and liabilities of $2,444,313 due to a decrease in accounts receivable of $1,709,284, no increase or decrease in prepaid expenses, a decrease in accounts payable of $389,562, a decrease in advance to suppliers of approximately $10 million, an increase in accrued expenses and other payables of $213,551, and a decrease in advances and deposits of $30,982.\nFor the year ended June 30, 2021, net cash used in operating activities of $2,562,524 was primarily a result of a loss of $2,716,347, depreciation and amortization of $12,871, provision for uncollectible receivables of $3,749,348, and an increase in operating assets and liabilities of $3,608,396 due to an increase in accounts receivable of $4,177,743, a decrease in prepaid expense of $4,325, an increase in accounts payable of $467,573, an increase in accrued expenses and other payables of $68,577, an increase in advances and deposits of $30,202, and a decrease in other payables to a related party of $1,330.\nInvesting Activities\nNet cash provided by investing activities for the year ended June 30, 2022, of $8,365,090, resulted from proceeds from collection of loan receivable from related party of $8,365,090.\nNet cash used in investing activities for the year ended June 30, 2021, of $8,443,822, resulted from cash advanced to a customer as loan receivable of $8,365,926, and cash paid for purchase of a vehicle of $77,896.\nFinancing Activities\nNet cash provided by financing activities for the year ended June 30, 2022, was $0.\nNet cash provided by financing activities for the year ended June 30, 2021, was $6,232,225, which consisted of cash received of $2,000 from proceeds from the sale of preferred stock to a related party and 6,230,225 from proceeds from the sale of our common stock.\nFuture Capital Requirements\nOur current available cash and equivalents are sufficient to satisfy our liquidity requirements. Our capital requirements for the fiscal year ending June 30, 2023, will depend on numerous factors, including managements evaluation of the timing of projects to pursue. Subject to our ability to generate revenues and cash flow from operations and our ability to raise additional capital (including through possible joint ventures and/or partnerships), we expect to incur substantial expenditures to carry out our business plan, as well as costs associated with our capital raising efforts and being a public company.\nOur plans to finance our operations include seeking equity and debt financing, alliances or other partnership agreements, or other business transactions, that would generate sufficient resources to ensure continuation of our operations.\nThe sale of additional equity or debt securities may result in additional dilution to our shareholders. If we raise additional funds through the issuance of debt securities or preferred stock, these securities could have rights senior to those of our common stock and could contain covenants that would restrict our operations. Any such required additional capital may not be available on reasonable terms, if at all. If we were unable to obtain additional financing, we may be required to reduce the scope of, delay or eliminate some or all of our planned activities and limit our operations which could have a material adverse effect on our business, financial condition and results of operations.\nInflation\nThe amounts presented in our financial statements do not provide for the effect of inflation on our operations or financial position. The net operating losses shown would be greater than reported if the effects of inflation were reflected either by charging operations with amounts that represent replacement costs or by using other inflation adjustments.\nGoing Concern\nThe accompanying financial statements were prepared on a going concern basis. The Company recorded a net income of $4,324,608 for the year ended June 30, 2022; excluding the recovery of bad debt from net income during the year ended June 30, 2022, the Company had a net income from operations of $491,068. The Company had cash flows from operating activities of negative $8,066,026 for the year ended June 30, 2022. These matters raise substantial doubt about our ability to continue as a going concern for a period of one year from the date of this filing. Our ability to continue as a going concern is dependent upon our ability to obtain the necessary financing to meet our obligations and repay our liabilities arising from normal business operations when they come due, to fund possible future acquisitions, and to generate profitable operations in the future. Our management plans to provide for our capital requirements by continuing to issue additional equity and debt securities. The outcome of these matters cannot be predicted at this time and there are no assurances that, if achieved, we will have sufficient funds to execute our business plan or generate positive operating results. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nManagement believes the Companys cash on hand will be sufficient to fund all of our obligations and commitments for the next twelve months. Historically, we have depended on equity and debt capital raises to provide us with working capital as required. There is no guarantee, however, that such funding will be available in the future and there can be no assurance that our stockholders, or any of them, will continue making loans or advances to us in the future.\nOff Balance Sheet Arrangements\nWe do not have any off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity or capital expenditures or capital resources that is material to an investor in our securities.\nSeasonality\nOur operating results are not affected by seasonality.\nInflation\nOur business and operating results as reported have not been affected in any material way by inflation. However, the Company is aware that global inflation is increasing, and it expects that inflation will affect the Company during fiscal year ending June 2023, though it cannot predict at this point in what ways.\nCritical Accounting Policies\nThe SEC issued Financial Reporting Release No. 60, Cautionary Advice Regarding Disclosure About Critical Accounting Policies suggesting that companies provide additional disclosure and commentary on their most critical accounting policies. In Financial Reporting Release No. 60, the SEC has defined the most critical accounting policies as the ones that are most important to the portrayal of a companys financial condition and operating results and require management to make its most difficult and subjective judgments, often as a result of the need to make estimates of matters that are inherently uncertain. The nature of our business generally does not call for the preparation or use of estimates. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK.\nAs a smaller reporting company as defined by Item 10 of Regulation S-K, the Company is not required to provide information required by this Item. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA.\nSHENGDA NETWORK TECHNOLOGY, INC. AND SUBSIDIARIES\nCONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED\nJUNE 30, 2022 AND 2021\nReport of Independent Registered Certified Public Accounting Firms\nConsolidated Balance Sheets as of June 30, 2022 and 2021 (Restated)\nConsolidated Statements of Operations and Comprehensive (Loss) Income for the Years Ended June 30, 2022 and 2021 (Restated)\nConsolidated Statements of Cash Flows for the Years Ended June 30, 2022 and 2021\nConsolidated Statements of Stockholders Equity for the Years Ended June 30, 2022 and 2021\nNotes to Consolidated Financial Statements for the years ended June 30, 2022 and 2021\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nOpinion on the Financial Statements\nTo the Board of Directors and Stockholders of Shengda Network Technology, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of Shengda Network Technology, Inc. (the Company) as of June 30, 2021, and 2020, and the related statements of operations, stockholders equity, and cash flows for each of the two years in the period ended June 30, 2021, and the related notes and schedules (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of June 30, 2021, and 2020, and the results of its operations and its cash flows for each of the two years in the period ended June 30, 2021, in conformity with accounting principles generally accepted in the United States of America.\nGoing Concern\nThe Companys financial statements are prepared using the generally accepted accounting principles applicable to a going concern. As described in Note 1 to the financial statements, the Company recorded a net loss for the year ended June 30, 2021, used net cash flows in operating activities, and has a net decrease in cash for the year ended June 30, 2021. These factors, among others, raise a substantial doubt regarding the Companys ability to continue as a going concern. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nRestatement of 2021 Financial Statements\nAs discussed in Note 2 to the consolidated financial statements, the 2021 consolidated financial statements have been restated to correct a misstatement.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. We determined that there are no critical audit matters.\n/s/ SS Accounting & Auditing, Inc.\nWe have served as the Companys auditor from 2020 to 2022.\nPlano, Texas\nSeptember 28, 2021, except for Note 2, as to which the date is October 28, 2022.\nPCAOB Firm ID : 6717\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Shareholders\nShengda Network Technology, Inc.\nOpinion on the Financial Statements\nWe audited the accompanying consolidated balance sheet of Shengda Network Technology, Inc. (the Company) as of June 30, 2022, and the related consolidated statements of operations and comprehensive (loss) income, changes in shareholders equity, cash flows for the year then ended, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the company as of June 30, 2022, and the results of its operations and its cash flows for the year then ended in conformity with accounting principles generally accepted in the United States of America.\nGoing Concern\nAs discussed in Note [1] to the consolidated financial statements, the Company has suffered recurring losses from operations that raises substantial doubt about its ability to continue as a going concern. Managements plans in regard to this matter are also described in Note [1]. The consolidated financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the entitys management. Our responsibility is to express an opinion on these financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audit, we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the entitys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audit provides a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nCollectability of Advances to Supplier\nAs stated in Note 4 to the financial statements, on February 2, 2022, the Company entered into a purchase agreement with its major supplier and agreed to purchase $26,873,292 (RMB 180,000,000) inventory over the next three years. As of June 30, 2022, the Company made advance payment of $8,216,644 (RMB 55,035,906) to the supplier, of which $5,922,077 (RMB 39,666,667) is recorded as advance to supplier - non-current. Management expects no collectability issue with the advances to supplier and recorded $0 reserve to the advances.\nWe identified such advance as a significant risk during our audit. Our procedures related to managements collectability of advances to the supplier include the following: (1) We inquired management of the business purpose of the advances to the supplier. (2) We reviewed managements due diligence procedures performed on the suppliers financial information. (3) We vouched the payments made to the supplier. (4) We examined subsequent inventory activities and estimated total inventory purchase from the supplier in the next three fiscal years. (5) We confirmed outstanding advance balance with the supplier. (6) We performed background check to the supplier and interviewed with suppliers owner. (7) We performed economic analysis on products purchased from the supplier by the Company.\n/s/ Paris, Kreit & Chiu CPA LLP\nWe have served as the Companys auditor since 2022.\nNew York, New York\nOctober 28, 2022\nPCAOB Firm ID: 6651\nSHENGDA NETWORK TECHNOLOGY, INC. AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\nJune 30, 2022 June 30, 2021\n(Restated)\nASSETS\nCurrent Assets\nCash and cash equivalents $ 405,786 $ 143,933\nAccount receivable, net 2,191,278 961,613\nAccount receivable - related parties, net 279,395\n1,640,779\nInventories 98,831 -\nAdvance to suppliers - current 3,725,143 -\nOther receivable from related party 209,014 -\nLoan receivable from related party, net - 6,417,350\nTotal Current Assets 6,909,447 9,163,675\nAdvance to supplier - non-current 5,922,077 -\nRight of use asset - operating 3,359 2,813\nEquipment, net 51,405 68,508\nTotal Assets $ 12,886,288 $ 9,234,996\nLIABILITIES AND STOCKHOLDERS EQUITY (DEFICIT)\nCurrent Liabilities\nAccounts payable $ 137,418 $ 526,722\nRelated party loans - 19,974\nAccrued expenses and other payables 303,553 98,354\nAdvance from customers - related party 20,371 -\nAdvances and deposits - 30,976\nOperating lease liabilities - 4,746\nTotal Current Liabilities 461,342 680,772\nTotal Liabilities 461,342 680,772\nCommitments and Contingencies - -\nStockholders Equity (Deficit)\nPreferred Stock, $0.001 par value, 20,000,000 shares authorized; 50,000 shares issued and outstanding\nCommon Stock, $0.001 par value, 1,000,000,000 shares authorized; 14,009,945 issued and outstanding 14,010 14,010\nAdditional paid-in capital 10,535,909 10,515,935\nRetained earnings (Accumulated deficit) 1,527,422 (2,796,477 )\nAccumulated other comprehensive income 346,846 820,706\nTotal Shengda Stockholders Equity 12,424,237 8,554,224\nNon-controlling interests -\nTotal Stockholders Equity 12,424,946 8,554,224\nTotal Liabilities and Stockholders Equity $ 12,886,288 $ 9,234,996\nThe accompanying notes are an integral part of these consolidated financial statements.\nSHENGDA NETWORK TECHNOLOGY, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF OPERATIONS AND COMPREHENSIVE (LOSS) INCOME\nFor the Years Ended June 30,\n(Restated)\nRevenue $ 3,037,673 $ 4,210,817\nRevenue - Related Party 919,610 5,278,370\nTotal Revenue 3,957,283 9,489,187\nCost of Revenue 3,578,995 7,828,750\nGross Profit 378,288 1,660,437\nOperating Expenses\nProfessional fees 236,822 125,989\nGeneral and administrative 221,389 3,894,379\nTotal Operating Expenses 458,211 4,020,368\nLoss from Operations (79,923 ) (2,359,931 )\nOther Income (Expense)\nInterest expense (60 ) (114 )\nInterest income 764,655 21,077\nOther income 23,783 (33 )\nRecovery of uncollectible accounts 3,833,540 -\nBank charges (765 ) (881 )\nTotal Other Income 4,621,153 20,049\nIncome (Loss) before Income Taxes 4,541,230 (2,339,882 )\nIncome Tax Expense 216,622 376,465\nNet Income (Loss) after Tax 4,324,608 (2,716,347 )\nLess: Net Income after Tax attributable to non-controlling interests -\nNet Income (Loss) after Tax attributable to Shengda Network Technology, Inc 4,323,899 (2,716,347 )\nOther comprehensive income\nForeign currency translation gain (loss) (473,860 ) 860,222\nComprehensive Income (loss) 3,850,748 (1,856,125 )\nLess: Comprehensive Income after Tax attributable to non-controlling interests (26 ) -\nTotal Comprehensive Income (Loss) attributable to Shengda Network Technology, Inc $ 3,850,774 $ (1,856,125 )\nBasic and Diluted Net Income (Loss) per Common Share $ 0.31 $ (0.23 )\nWeighted-average Number of Common Shares Outstanding 14,009,945 11,595,580\nThe accompanying notes are an integral part of consolidated financial statements.\nSHENGDA NETWORK TECHNOLOGY, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nFor the Years Ended June 30,\n(Restated)\nCASH FLOWS FROM OPERATING ACTIVITIES\nNet Income (Loss) $ 4,324,608 $ (2,716,347 )\nAdjustments to Reconcile Net Cash (Used in) Provided by Operating Activities\nDepreciation and amortization 19,165 12,871\nRecovery of uncollectible accounts (3,833,540 ) -\nProvision for uncollectible accounts 12,780 3,749,348\nChanges in Operating Assets and Liabilities:\nAccount receivable (18,914,211 ) (1,019,617 )\nAccount receivable - related parties 20,623,495\n(3,158,126\n)\nInventories (102,546 ) -\nAdvance to suppliers - current (3,865,195 ) -\nAdvance to supplier - non-current (6,144,726\n) -\nPrepaid expenses - 4,325\nAccounts payable (389,562 ) 467,573\nAccrued expenses and other payables 213,551 68,577\nAdvance from customers - related party 21,137 -\nAdvances and deposits (30,982 ) 30,202\nOther payable - related party - (1,330 )\nNet Cash Used in Operating Activities (8,066,026 ) (2,562,524 )\nCASH FLOWS FROM INVESTING ACTIVITIES\nProceeds from collection of loan receivable from related party 8,365,090 (8,365,926 )\nAcquisition of equipment - (77,896 )\nNet Cash Provided by (Used in) Investing Activities 8,365,090 (8,443,822 )\nCASH FLOWS FROM FINANCING ACTIVITIES\nProceeds from sale of preferred stock to a related party - 2,000\nProceeds from sale of common stock - 6,230,225\nNet Cash Provided by Financing Activities - 6,232,225\nEffect of Exchange Rate Fluctuation on Cash and Cash Equivalents (37,211 ) 646,728\nNet Increase (Decrease) in Cash and Cash Equivalents 261,853 (4,127,393 )\nCash - Beginning of Year 143,933 4,271,326\nCash - End of Year $ 405,786 $ 143,933\nSUPPLEMENTAL DISCLOSURES OF CASH FLOW INFORMATION:\nCash paid during the year for:\nIncome tax $ 21,561 $ 376,465\nSUPPLEMENTAL SCHEDULE OF NON-CASH ACTIVITIES\nForgiveness of debt $ 19,974 $ -\nConversion of cash advances from related party into common stock $ - $ 302,000\nConversion of cash advances received into common stock $ - $ 3,972,500\nThe accompanying notes are an integral part of these consolidated financial statements.\nSHENGDA NETWORK TECHNOLOGY, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS EQUITY (DEFICIT)\nYear Ended\nPreferred Stock Common Stock Additional\nPaid-in\nRetained\nEarnings\nAccumulated\nOther\nComprehensive\nTotal\nShengda\nStockholders\nNon-controlling Total\nStockholders\nJune 30, 2022 Shares Amount Shares Amount Capital (Deficit) Income Equity Interests Equity\nBalance - June 30, 2021 50,000 $ 50 14,009,945 $ 14,010 $ 10,515,935 $ (2,796,477 ) $ 820,706 $ 8,554,224 $ - $ 8,554,224\nForgiveness of debt - - - - 19,974 - - 19,974 - 19,974\nNet income - - - - - 4,323,899 - 4,323,899 4,324,608\nForeign currency translation adjustment - - - - - - (473,860 ) (473,860 ) - (473,860 )\nBalance - June 30, 2022 50,000 $ 50 14,009,945 $ 14,010 $ 10,535,909 $ 1,527,422 $ 346,846 $ 12,424,237 $ 709 $ 12,424,946\nYear Ended\nPreferred Stock Common Stock Additional\nPaid-in\nRetained\nEarnings\nAccumulated\nOther\nComprehensive\nTotal\nShengda\nStockholders\nEquity\nNon-controlling Total\nStockholders\nEquity\nJune 30, 2021 Shares Amount Shares Amount Capital (Deficit) Income (Loss) (Deficit) Interest (Deficit)\nBalance - June 30, 2020 - $ - 6,960,000 $ 6,960 $ 16,310 $ (80,130 ) $ (39,516 ) $ (96,376 ) $ - $ (96,376 )\nBalance, value - $ - 6,960,000 $ 6,960 $ 16,310 $ (80,130 ) $ (39,516 ) $ (96,376 ) $ - $ (96,376 )\nIssuance of common shares for cash - - 3,165,112 3,165 6,227,060 - - 6,230,225 - 6,230,225\nIssuance of common stock upon conversion of advances - - 3,551,500 3,552 3,968,948 - - 3,972,500 - 3,972,500\nIssuance of common stock to related party - - 333,333 301,667 - - 302,000 - 302,000\nIssuance of preferred shares for cash to a related party 50,000 - - 1,950 - - 2,000 - 2,000\nNet loss - - - - - (2,716,347 ) - (2,716,347 ) - (2,716,347 )\nNet Income (loss) - - - - - (2,716,347 ) - (2,716,347 ) - (2,716,347 )\nForeign currency translation adjustment - - - - - - 860,222 860,222 - 860,222\nBalance - June 30, 2021 50,000 $ 50 14,009,945 $ 14,010 $ 10,515,935 $ (2,796,477 ) $ 820,706 $ 8,554,224 $ - $ 8,554,224\nBalance, value 50,000 $ 50 14,009,945 $ 14,010 $ 10,515,935 $ (2,796,477 ) $ 820,706 $ 8,554,224 $ - $ 8,554,224\nThe accompanying notes are an integral part of consolidated financial statements.\nSHENGDA NETWORK TECHNOLOGY, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nAS OF AND FOR THE YEAR ENDED JUNE 30, 2022 AND 2021\nNote 1 - Organization and Operations, and Going Concern\nIn these notes, the terms us, we, it, its, Shengda, the Company or our refer to Shengda Network Technology, Inc. and its subsidiaries. Shengda was incorporated under the laws of the State of Nevada on March 14, 2018 under the name Soltrest, Inc. and changed its name to Shengda Network Technology Inc on October 16, 2020.\nThe Companys principal business is to provide a portal for the sale of products offered by reliable manufacturers and merchants at competitive prices. Products run the gamut from electronics to daily consumable products, food and clothing.\nOn April 20, 2020, the Company purchased 10,000 shares of common stock of Peaker International Trade Group Limited (Peaker) for $1,330. These shares comprised of 100% of the then issued and outstanding shares of common stock of Peaker. Peaker was formed in 2018 in Hong Kong. On May 15, 2020, Peaker formed a Company in China called Zhejiang Jingmai Electronic Commerce Ltd., of which Peaker is the sole shareholder.\nOn August 28, 2020, Zhejiang Jingmai Electronic Commerce Ltd set up a 99% owned subsidiary Zhejiang Xiaojing e-commerce Co., Ltd. On April 22, 2022, Zhejiang Jingmai Electronic Commerce Ltd received transfer of 99% ownership of Yiwu Tianqi Enterprise Management Co., Ltd which was incorporated on November 23, 2020 for no consideration. On April 22, 2022, Zhejiang Jingmai Electronic Commerce Ltd received transfer 99% ownership of Zhejiang Jingmai e-commerce Co., Ltd which was incorporated on November 25, 2020 for no consideration. On April 22, 2022, Zhejiang Jingmai Electronic Commerce Ltd received transfer of 99% ownership of Zhejiang Jingtao Supply Chain Co., Ltd which was incorporated on November 24, 2020 for no consideration. These companies plan to develop business in the following fields: wholesale and retail of wide range of products, management, import and export, network integration and IT service, and more fields.\nRisk and Uncertainty Concerning COVID-19 Pandemic\nSince the occurrence of COVID-19 in January 2020, it has posed great impacts in China. However, the COVID-19 outbreak has limited impact on our businesses and operation. The Company mainly operates in Zhejiang Province China, that had few cases since January 2020. None of our staff was infected with COVID-19. Therefore, the Company did not encounter a shortage of labor. As of the date of this report, the Companys is able to fulfill customers needs.\nThere might be outbreaks of COVID-19 in various cities in China in the future, and the Chinese government may take measures to keep COVID-19 in control. If there is not a material recovery in the COVID-19 situation, or the situation further deteriorates in China, our business, results of operations and financial condition could be materially and adversely affected. While the potential downturn brought by and the duration of the COVID-19 outbreak is difficult to assess or predict and the full impact of the virus on our operations will depend on many factors beyond our control. Our business, results of operations, financial condition and prospects could be materially adversely affected to the extent that COVID-19 persists in China or harms the Chinese and global economy in general.\nAnhui Province found more local COVID-19 cases in 2021. Since Anhui Province has been successful on its efforts containing the spread of the virus, we havent observed significant impacts concerning the matters relating to logistics, suppliers, and price of raw materials.\nGoing Concern\nThe Company demonstrates adverse conditions that raise substantial doubt about the Companys ability to continue as a going concern. The continuation of the Company as a going concern is dependent upon the continued financial support from its shareholders, the ability of the Company to sell its stock to the investing community and obtain necessary financing to continue operations, and the attainment of profitable operations. The Company recorded a net income of $4,324,608 for the year ended June 30, 2022; excluding the recovery of bad debt from net income during the year ended June 30, 2022, the Company had a net income from operations of $491,068. The Company had cash flows from operating activities of negative $8,066,026 for the year ended June 30, 2022. These factors, among others, raise a substantial doubt regarding the Companys ability to continue as a going concern. If the Company is unable to obtain adequate capital, it could be forced to cease operations. The consolidated financial statements do not include any adjustments to reflect the recoverability and classification of recorded asset amounts and classification of liabilities that might be necessary should the Company be unable to continue as a going concern.\nNote 2 - Restatement for Correction of an Error\nDuring the year end June 30, 2021, the Company had sales amounting to $5,278,370 with a customer that accounted for 56% of the total revenue for the year ended June 30, 2021. For the year ended June 30, 2020, the Company had sales with that customer amounting to $253,803 that accounted for 100% of the total revenue for the year ended June 30, 2020. The Company also had an accounts receivable balance in the amount of $1,640,779 as of June 30, 2021, with that customer. The management subsequently discovered that the customer is a related party within the definition ASC 850.\nOn October 25, 2020, the Company signed an agreement with a related party, which is also the Companys major customer. The Company agreed to loan the related party $8,957,764 (RMB60,000,000) at an annual interest rate of 7.2%. The loan is guaranteed by a Companys supplier which is also an important partner of the Companys major customer and due on October 25, 2021. The borrower is required to pay all the principal and the relevant interest in full amount on the due date. The total loan receivable, net of allowance $0 and $6,417,350 as of June 30, 2022 and 2021, respectively. The principal and the relevant interest in full have been paid off in February 2022. As of June 30, 2021, the Company recognized $2,163,419 allowance of bad debt against the loan receivable from related party. During the year ended June 30, 2022, the Company reversed the $2,163,419 allowance and recognized the entire amount as other income in the accompany consolidated statement of operations and comprehensive income (loss). During the year ended June 30, 2022, the Company recognized the interest income of $764,421 and wrote off the interest income of $66,905. The management subsequently discovered that the customer is a related party within the definition ASC 850.\nIn the Companys annual reports on Form 10-K for the years ended June 30, 2020 and June 30, 2021 and related quarterly reports (collectively, the Affected Reports), the Company is correcting the disclosure by reporting the above as related party transactions and balances.\nThe following is a comparison of restated financial statements to financial statements as previously reported:\nConsolidated Statement of Operations Year ended June 30, 2020\nAs Previously Reported Restatement Adjustment As Restated\nRevenue $ 253,803 $ (253,803 ) $ -\nRevenue - Related Party - 253,803 253,803\nTotal Revenue 253,803 - 253,803\nConsolidated Balance Sheets As of June 30, 2021\nAs Previously Reported Restatement Adjustment As Restated\nCurrent Assets:\nAccount receivable, net $ 2,602,392 $ (1,640,779 ) $ 961,613\nAccount receivable - related party, net - 1,640,779 1,640,779\nLoan receivable, net 6,417,350 (6,417,350 ) -\nLoan receivable - related party, net - 6,417,350 6,417,350\nTotal Current Assets 9,163,675 - 9,163,675\nConsolidated Statement of Operations Year ended June 30, 2021\nAs Previously Reported Restatement Adjustment As Restated\nRevenue $ 9,489,187 $ (5,278,370 ) $ 4,210,817\nRevenue - Related Party - 5,278,370 5,278,370\nTotal Revenue 9,489,187 - 9,489,187\nConsolidated Statements of Cash Flows Year ended June 30, 2021\nAs Previously Reported Restatement Adjustment As Restated\n(Increase) in account receivable $ (4,177,743 ) $ 3,158,126 $ (1,019,617 )\n(Increase) in account receivable - related party - (3,158,126 ) (3,158,126 )\nNet Cash Used in Operating Activities (2,562,524 ) - (2,562,524 )\nLoan receivable 8,365,926 (8,365,926 ) -\nLoan receivable - related party - 8,365,926 8,365,926\nNet Cash Used in Investing Activities (8,443,822 ) - (8,443,822 )\nNet Cash Provided by Financing Activities 6,232,225 - 6,232,225\nUnaudited Condensed Consolidated Balance Sheets As of March 31, 2021\nAs Previously Reported Restatement Adjustment As Restated\nCurrent Assets:\nAccount receivable, $ 3,537,706 $ (3,192,013 ) $ 345,693\nAccount receivable - related party - 3,192,013 3,192,013\nLoan receivable 8,242,010 (8,242,010 ) -\nLoan receivable - related party - 8,242,010 8,242,010\nTotal Current Assets 12,731,834 - 12,731,834\nUnaudited Condensed Consolidated Statement of Operations Three Months ended March 31, 2021\nAs Previously Reported Restatement Adjustment As Restated\nRevenue $ 765,616 $ (145,293 ) $ 620,323\nRevenue - Related Party - 145,293 145,293\nTotal Revenue 765,616 - 765,616\nUnaudited Condensed Consolidated Statement of Operations\nNine Months ended March 31, 2021\nAs Previously Reported\nRestatement Adjustment\nAs Restated\nRevenue\n$ 8,499,788\n$ (5,233,559 )\n$ 3,266,229\nRevenue - Related Party\n-\n5,233,559\n5,233,559\nTotal Revenue\n8,499,788\n-\n8,499,788\nUnaudited Condensed Consolidated Statements of Cash Flows\nNine Months ended March 31, 2021\nAs Previously Reported\nRestatement Adjustment\nAs Restated\nAccount receivable\n$ (3,470,436 )\n$ 3,131,315\n$ (339,121 )\nAccount receivable - related party\n-\n(3,131,315 )\n(3,131,315 )\nNet Cash Used in Operating Activities\n(2,578,186 )\n-\n(2,578,186 )\nLoan receivable\n8,085,285\n(8,085,285 )\n-\nLoan receivable - related party\n-\n8,085,285\n8,085,285\nNet Cash Used in Investing Activities\n(8,162,519 )\n-\n(8,162,519 )\nNet Cash Provided by Financing Activities\n6,232,225\n-\n6,232,225\nUnaudited Condensed Consolidated Balance Sheets\nAs of December 31, 2020\nAs Previously Reported\nRestatement Adjustment\nAs Restated\nCurrent Assets:\nAccount receivable\n$ 3,121,049\n$ (3,121,049 )\n$ -\nAccount receivable - related party\n-\n3,121,049\n3,121,049\nLoan receivable\n8,275,862\n(8,275,862 )\n-\nLoan receivable - related party\n-\n8,275,862\n8,275,862\nTotal Current Assets\n13,414,168\n-\n13,414,168\nUnaudited Condensed Consolidated Statement of Operations\nThree Months ended December 31, 2020\nAs Previously Reported\nRestatement Adjustment\nAs Restated\nRevenue\n$ 2,590,594\n$ (1,472,062 )\n$ 1,118,532\nRevenue - Related Party\n-\n1,472,062\n1,472,062\nTotal Revenue\n2,590,594\n-\n2,590,594\nUnaudited Condensed Consolidated Statement of Operations\nSix Months ended December 31, 2020\nAs Previously Reported\nRestatement Adjustment\nAs Restated\nRevenue\n$ 7,734,172\n$ (5,088,266 )\n$ 2,645,906\nRevenue - Related Party\n-\n5,088,266\n5,088,266\nTotal Revenue\n7,734,172\n-\n7,734,172\nUnaudited Condensed Consolidated Statements of Cash Flows\nSix Months ended December 31, 2020\nAs Previously Reported\nRestatement Adjustment\nAs Restated\nAccount receivable\n$ (3,006,281 )\n$ 3,006,281\n$ -\nAccount receivable - related party\n-\n(3,006,281 )\n(3,006,281 )\nNet Cash Used in Operating Activities\n(2,151,847 )\n-\n(2,151,847 )\nLoan receivable\n7,971,539\n(7,971,539 )\n-\nLoan receivable - related party\n-\n7,971,539\n7,971,539\nNet Cash Used in Investing Activities\n(8,047,686 )\n-\n(8,047,686 )\nNet Cash Provided by Financing Activities\n6,232,225\n-\n6,232,225\nUnaudited Condensed Consolidated Balance Sheets\nAs of September 30, 2020\nAs Previously Reported\nRestatement Adjustment\nAs Restated\nCurrent Assets:\nAccount receivable\n$ 1,439,494\n$ (1,424,766 )\n$ 14,728\nAccount receivable - related party\n-\n1,424,766\n1,424,766\nTotal Current Assets\n12,966,548\n-\n12,966,548\nUnaudited Condensed Consolidated Statement of Operations\nThree Months ended September 30, 2020\nAs Previously Reported\nRestatement Adjustment\nAs Restated\nRevenue\n$ 5,143,578\n$ (3,616,204 )\n$ 1,527,374\nRevenue - Related Party\n-\n3,616,204\n3,616,204\nTotal Revenue\n5,143,578\n-\n5,143,578\nUnaudited Condensed Consolidated Statements of Cash Flows\nThree Months ended September 30, 2020\nAs Previously Reported\nRestatement Adjustment\nAs Restated\nAccount receivable\n$ (1,413,328 )\n$ 1,398,868\n$ (14,460 )\nAccount receivable - related party\n-\n(1,398,868 )\n(1,398,868 )\nNet Cash Used in Operating Activities\n(1,456,401 )\n-\n(1,456,401 )\nNet Cash Used in Investing Activities\n(74,593 )\n-\n(74,593 )\nNet Cash Provided by Financing Activities\n6,232,225\n-\n6,232,225\nAs a result of the restatement in 2020 and 2021, there is no change in the total balances of assets, liabilities, net loss or loss per share.\nNote 3 - Basis of Presentation and Summary of Significant Accounting Policies\nBasis of Presentation\nThe accompanying consolidated financial statements were prepared in accordance with accounting principles generally accepted in the United States of America (GAAP). The consolidated financial statements and accompanying notes are the representations of the Companys management, which is responsible for their integrity and objectivity. In the opinion of the Companys management, the consolidated financial statements reflect all adjustments, which are normal and recurring in nature, necessary for fair financial statement presentation.\nPrinciples of Consolidation\nThe accompanying consolidated financial statements include the accounts of the Company and its wholly-owned subsidiary Peaker International Trade Group Limited or Peaker, Peakers wholly owned subsidiary Jiangxi Zansheng Information Industry Co., Ltd, Peakers wholly owned subsidiary Zhejiang Jingmai Electronic Commerce Ltd or Jingmai Electronic, and Jingmai Electronics five 99% owned subsidiary Zhejiang Xiaojing e-commerce Co., Ltd, Yiwu Tianqi Enterprise Management Co., Ltd, Zhejiang Jingtao Supply Chain Co., Ltd, Zhejiang Jingmai e-commerce Co., Ltd and Zhejiang Shubei Supply Chain Co., Ltd, in China. All significant inter-company accounts and transactions have been eliminated in consolidation.\nNon-Controlling Interest\nNon-controlling interest represents the portion of equity that is not attributable to the Company. The net income (loss) attributable to non-controlling interests are separately presented in the accompanying statements of income and other comprehensive income (loss). Losses attributable to non-controlling interests in a subsidiary may exceed the interest in the subsidiarys equity. The related non-controlling interest continues to be attributed its share of losses even if that attribution results in a deficit of the non-controlling interest balance.\nUse of Estimates\nThe preparation of consolidated financial statements in conformity with GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the dates of the consolidated financial statements and the reported amounts of revenues and expenses during the reporting periods. Management bases its estimates on historical experience and on various assumptions that are believed to be reasonable in relation to the consolidated financial statements taken as a whole under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Management regularly evaluates the key factors and assumptions used to develop the estimates utilizing currently available information, changes in facts and circumstances, historical experience and reasonable assumptions. After such evaluations, if deemed appropriate, those estimates are adjusted accordingly. The actual results experienced by the Company may differ materially and adversely from the Companys estimates. To the extent there are material differences between the estimates and the actual results, future results of operations will be affected.\nCash and Cash Equivalents\nThe Company considers all highly liquid instruments with maturity of three months or less at the time of issuance to be cash and cash equivalents.\nAccounts Receivable, net\nAccounts receivable are generated primarily through sales to customers and are stated at invoiced amount, net of an allowance for doubtful accounts, and bear no interest. A provision for doubtful accounts is determined based on a specific review of outstanding customer balances and historical customer write-off amounts and is charged to operations at the time management determines these accounts may become uncollectible.\nThe Company establishes a credit and collection policy based on age of receivables. The collection period usually ranges from three months to twelve months. The Company grants extended payment terms only when the Company believes that the payment will be collectible at the end of the term. The Company grants extended payment terms to customers based on the following factors: (a) whether or not the Company views a real need, from the customers perspective for the extension, and (b) the Companys relationship with the customer, and the Companys long-term business prospects.\nThe Company reviews the accounts receivable on a periodic basis and based on its reviews, the Company recorded an allowance for doubtful accounts of $12,317 and $1,682,437 as of June 30, 2022 and 2021, respectively.\nInventories\nInventories are valued at the lower of cost or market. Inventories consist of finished goods. The Company reviews its inventories regularly for possible obsolete goods and establishes reserves when determined necessary. As of June 30, 2022 and 2021, the Company had no reserve for obsolete goods.\nEquipment\nEquipment is stated at cost. The straight-line depreciation method is used to compute depreciation over the estimated useful lives of the assets, as follows:\nSchedule of Estimated Useful Lives Of Assets\nItems\nUseful life\nVehicles\n5 years\nExpenditures for maintenance and repairs, which do not materially extend the useful lives of the assets, are expense as incurred. Expenditures for major renewals and betterments which substantially extend the useful life of assets are capitalized. The cost and related accumulated depreciation of assets retired or sold are removed from the respective accounts, and any gain or loss is recognized in the statement of income in other income and expenses.\nLong-lived Assets\nThe Company tests long-lived assets or asset groups for recoverability when events or changes in circumstances indicate that their carrying amount may not be recoverable. Circumstances which could trigger a review include, but are not limited to: significant decreases in the market price of the asset; significant adverse changes in the business climate or legal factors; accumulation of costs significantly in excess of the amount originally expected for the acquisition or construction of the asset; current period cash flow or operating losses combined with a history of losses or a forecast of continuing losses associated with the use of the asset; and current expectation that the asset will more likely than not be sold or disposed of significantly before the end of its estimated useful life. Recoverability is assessed based on the carrying amount of the asset compared to the estimated future undiscounted cash flows expected to result from the use and the eventual disposal of the asset, as well as specific appraisal in certain instances. An impairment loss equal to the excess of the carrying value over the assets fair market value is recognized when the carrying amount exceeds the undiscounted cash flows. The impairment loss is recorded as an expense and a direct write-down of the asset. No impairment loss was recorded for the years ended June 30, 2022 and 2021, respectively.\nLeases\nThe Company determines if an arrangement is a lease or contains a lease at inception. Operating lease right-of-use assets and lease liabilities are recognized at commencement based on the present value of lease payments over the lease term. As the implicit rate is typically not readily determinable in the Companys lease agreements, the Company uses its incremental borrowing rate as of the lease commencement date to determine the present value of the lease payments. The incremental borrowing rate is based on the Companys specific rate of interest to borrow on a collateralized basis, over a similar term and in a similar economic environment as the lease. Lease expense is recognized on a straight-line basis over the lease term. Additionally, the Company accounts for lease and non-lease components as a single lease component for its identified asset classes. As of June 30, 2022, the Company did not have any finance lease.\nSimilar to other long-lived assets, right-of-use assets are tested for impairment when events or conditions indicate that the carrying value of an asset may not be fully recoverable from future cash flows. See Note 8, Leases, for additional information.\nRevenue Recognition\nThe Company generates revenue through online networking sales. Shengda Network Technology is not involved in production. The Company mainly sells products through a significant number of registered companies to members of its sales portal. The Company offers products through offline stores and customer service centers. When the customer receives the product, the control of the products is transferred to the customer.\nThe Company recognizes revenues when control of the promised goods or services is transferred to the customer, in an amount that reflects the consideration the Company expects to be entitled for those goods or services. In that determination, under ASC 606, Revenue From Contracts With Customers, the Company follows a five-step model that includes: (1) determination of whether a contract, an agreement between two or more parties that creates legally enforceable rights and obligations, exists; (2) identification of the performance obligations in the contract; (3) determination of the transaction price; (4) allocation of the transaction price to the performance obligations in the contract; and (5) recognition of revenue when (or as) the performance obligation is satisfied. The Company records the revenue once all the above steps are completed.\nFair Value Measurements\nThe Company has established a fair value hierarchy based on the level of independent, objective evidence surrounding the inputs used to measure fair value. A financial instruments categorization within the fair value hierarchy is based upon the lowest level of input that is significant to the fair value measurement. ASC 820 Fair Value Measurement, prioritizes the inputs into three levels that may be used to measure fair value:\n● Level 1 - inputs are based upon unadjusted quoted prices for identical instruments in active markets.\n● Level 2 applies to assets or liabilities for which there are inputs other than quoted prices that are observable for the asset or liability such as quoted prices for similar assets or liabilities in active markets; quoted prices for identical assets or liabilities in markets with insufficient volume or infrequent transactions (less active markets); or model-derived valuations in which significant inputs are observable or can be derived principally from, or corroborated by, observable market data. If the asset or liability has a specified (contractual) term, the Level 2 input must be observable for substantially the full term of the asset or liability.\n● Level 3 - inputs are generally unobservable and typically reflect managements estimates of assumptions that market participants would use in pricing the asset or liability.\nThe Companys other current financial assets and current financial liabilities have fair values that approximate their carrying values.\nConcentration of Credit Risk\nFinancial instruments that potentially subject the Company to concentrations of credit risk consist of cash deposited with banks. Substantially all of the Companys cash is held in bank accounts in the Peoples Republic of China (PRC) and is not protected by Federal Deposit Insurance Corporation (FDIC) insurance or any other similar insurance.\nThe Companys bank account in the United States is protected by FDIC insurance. As of June 30, 2022 and 2021, the Companys bank account in the United States had no balances exceeding FDIC insurance of $250,000.\nThe Companys bank account in Peoples Republic of China (PRC) is protected by the Peoples Bank of China Financial Stability Bureau (FSD) insurance. As of June 30, 2022 and 2021, the Companys bank account in PRC had $247,930 and $140,277, balances exceeding FSD insurance of RMB 500,000.\nMajor Customers\nThe Company has five customers Company A - Related party, Company B, Company C, Company D, and Company E that accounted for 23%, 19%, 12%, 11% and 11% of revenues for the year ended June 30, 2022, respectively. The Company has one major customer Company F- Related party that accounted for 56% of revenues for the year ended June 30, 2021. The five major customers for the year ended June 30, 2022 does not include the major customer for the year ended June 30, 2021.\nMajor Vendors\nThe Company has four vendors Company A, Company B, Company C, and Company D that accounted for 36%, 30%, 14% and 11% of purchases for the year ended June 30, 2022. The Company has two vendors Company E and Company A that accounted for 71% and 29% of purchases for the year ended June 30, 2021.\nCommitment and Contingencies\nThe Company agreed to purchase $26,873,292 (RMB 180 million) from a supplier over the next three years. As of June 30, 2022, the Company has made advance payment of $8,216,644 (RMB 55 million) to the supplier, of which $5,922,077 (RMB 39,666,667) are recorded as advance to supplier - non-current. The advance is interest free and without collateral. The reasons for making such advance are that the Company started to provide products to clients who are in the internet live broadcasting business. The Company carries minimal inventory, and the supplier directly delivers the goods to customers according to purchase orders with the supplier. The advances are fully refundable and there is no penalty for the Company if it does not purchase the entire RMB 180 million of inventory.\nThe Company had fully paid for the operating lease and expects $0 lease payment during the next 12 months.\nThere are no legal proceedings and claims.\nEvents or operations that are uncertain may also result in a cash outflow or inflow for the Company are known as contingencies. Contingencies are not guaranteed, and they heavily rely on the occurrence or lack thereof, of uncertain future events.\nValue Added Tax (VAT)\nThe Company is subject to VAT, which is levied on a majority of the products, at a rate ranging from 9% to 13% on the invoiced value of sales depending on the type of products sold. The output VAT is borne by customers in addition to the invoiced value of sales and input VAT is borne by the Company in addition to the invoiced value of purchases.\nThe VAT may be offset by VAT paid by the Company on raw materials and other materials included in the cost of producing or acquiring its finished products. Further, when exporting goods, the exporter is entitled to some or all of the refund of the VAT paid or assessed.\nVAT returns of the Company are subject to examination by the tax authorities for five years from the date of filing.\nIncome Tax\nIncome tax returns are filed in federal, state, local and foreign jurisdictions as applicable. Provisions for current income taxes are calculated and accrued on income and expense amounts expected to be included in the income tax returns for the current year. Income taxes reported in earnings also include deferred income tax provisions and provisions for uncertain tax positions.\nDeferred income tax assets and liabilities are computed on differences between the consolidated financial statement bases and tax bases of assets and liabilities at the enacted tax rates. Changes in deferred income tax assets and liabilities associated with components of other comprehensive income are charged or credited directly to other comprehensive income. Otherwise, changes in deferred income tax assets and liabilities are included as a component of income tax expense. The effect on deferred income tax assets and liabilities attributable to changes in enacted tax rates are charged or credited to income tax expense in the period of enactment. Valuation allowances are established for certain deferred tax assets when realization is less than more likely than not.\nLiabilities are established for uncertain tax positions taken or positions expected to be taken in income tax returns when such positions, in our judgment, do not meet a more-likely-than-not threshold based on the technical merits of the positions. Additionally, liabilities may be established for uncertain tax positions when, in our judgment, the more-likely-than-not threshold is met, but the position does not rise to the level of certain based upon the technical merits of the position. The Company did not incur any interest and penalties related to potential underpaid income tax expenses for the years ended June 30, 2022 and 2021, respectively, and also did not anticipate any significant increases or decreases in unrecognized tax benefits in the next 12 months from June 30, 2022.\nForeign Currency Translation\nThe assets and liabilities of the Companys subsidiaries outside the U.S. are translated into U.S. dollars at the rates of exchange in effect at the balance sheet dates, primarily from RMB. Income and expense items are translated at the average exchange rates prevailing during the period. Gains and losses resulting from currency transactions are recognized currently in income and those resulting from translation of consolidated financial statements are included in accumulated other comprehensive income (loss).\nThe value of RMB against US$ fluctuates. Any significant revaluation of RMB may materially affect the Companys financial condition in terms of US$ reporting. The following table outlines the currency exchange rates used in creating the CFS in this report:\nSchedule of Foreign Currencies Translation\nJune 30,\nJune 30,\nPeriod-end spot rate US $1=RMB 6.6981 US $1=RMB 6.4566\nYear Ended\nJune 30,\nYear Ended\nJune 30,\nAverage rate US $1=RMB 6.4554 US $1=RMB 6.6221\nEarnings (Loss) Per Share\nThe Company computes net earnings (loss) per share in accordance with ASC 260, Earnings per Share. ASC 260 requires presentation of both basic and diluted net earnings per share (EPS) on the face of the statement of operations. Basic EPS is computed by dividing earnings (loss) available to common shareholders (numerator) by the weighted average number of shares outstanding (denominator) during the period. Diluted EPS gives effect to all dilutive potential common shares outstanding during the period using the treasury stock method and convertible preferred stock using the if-converted method. Diluted EPS excludes all dilutive potential shares if their effect is anti-dilutive.\nRecent Accounting Pronouncements\nIn December 2019, the Financial Accounting Standards Board (FASB) issued Accounting Standards Update (ASU), ASU 2019-12, Simplifying the Accounting for Income Taxes. ASU 2019-12 eliminates certain exceptions within ASC 740, Income Taxes, and clarifies certain aspects of ASC 740 to promote consistency among reporting entities. ASU 2019-12 is effective for interim and annual reporting periods beginning after December 15, 2020, with early adoption permitted. Most amendments within the standard are required to be applied on a prospective basis, while certain amendments must be applied on a retrospective or modified retrospective basis. The Company adopted ASU 2019-12, and it did not have any impact on its consolidated financial statements.\nIn March 2022, the FASB issued ASU 2022-02, Financial Instruments-Credit Losses (Topic 326): Troubled Debt Restructurings and Vintage Disclosures. The amendments in this Update eliminate the accounting guidance for TDRs by creditors in Subtopic 310-40, Receivables-Troubled Debt Restructurings by Creditors, while enhancing disclosure requirements for certain loan refinancings and restructurings by creditors when a borrower is experiencing financial difficulty. Specifically, rather than applying the re cognition and measurement guidance for TDRs, an entity must apply the loan refinancing and restructuring guidance in paragraphs 310-20-35-9 through 35-11 to determine whether a modification results in a new loan or a continuation of an existing loan. For public business entities, the amendments in this Update require that an entity disclose current-period gross write offs by year of origination for financing receivables and net investments in leases within the scope of Subtopic 326-20, Financial Instruments-Credit Losses-Measured at Amortized Cost. For entities that have adopted the amendments in Update 2016-13, the amendments in this Update are effective for fiscal years beginning after December 15, 2022, including interim periods within those fiscal years. For entities that have not yet adopted the amendments in Update 2016-13, the effective dates for the amendments in this Update are the same as the effective dates in Update 2016-13. The amendments in this Update should be applied prospectively, except as provided in the next sentence. For the transition method related to the recognition and measurement of TDRs, an entity has the option to apply a modified retrospective transition method, resulting in a cumulative-effect adjustment to retained earnings in the period of adoption. Early adoption of the amendments in this Update is permitted if an entity has adopted the amendments in Update 2016-13, including adoption in an interim period. If an entity elects to early adopt the amendments in this Update in an interim period, the guidance should be applied as of the beginning of the fiscal year that includes the interim period. An entity may elect to early adopt the amendments about TDRs and related disclosure enhancements separately from the amendments related to vintage disclosures. The Company evaluated the impact of the adoption of ASU 2022-02, and it did not have any impact on its consolidated financial statements. The Company will adopt ASU 2022-02 effective for fiscal years beginning after December 15, 2022.\nNote 4 - Advance to Suppliers\nOn February 2, 2022, the Company entered into a purchase agreement with an unrelated party, which is the Companys major supplier. The Company agreed to purchase $26,873,292 (RMB 180 million) from this supplier over the next three years. As of June 30, 2022, the Company had made advance payment of $8,216,644 (RMB 55 million) to this supplier, of which $5,922,077 (RMB 39,666,667) is recorded as advance to suppliers - non-current. The payment is interest free and without collateral. The reasons for making such advance are that the Company started to provide products to clients which are in the internet live broadcasting business. The Company has no inventory, and the supplier directly delivers the goods to customers according to the order. The advances are fully refundable and there is no penalty for the Company if it does not purchase the entire RMB 180 million of inventory\nWith advances to all suppliers, advance to suppliers - current was $3,725,143 and $0 as of June 30, 2022 and 2021, respectively; and advance to supplier - non-current was $5,922,077 and $0 as of June 30, 2022 and 2021, respectively.\nNote 5 - Loan Receivable from Related Party\nOn October 25, 2020, the Company signed an agreement with a related party, which is also the Companys major customer. The Company agreed to loan the related party $8,957,764 (RMB60,000,000) at an annual interest rate of 7.2%. The loan is guaranteed by a Companys supplier which is also an important partner of the Companys major customer and due on October 25, 2021. The borrower is required to pay all the principal and the relevant interest in full amount on the due date. The total loan receivable, net of allowance $0 and $6,417,350 as of June 30, 2022 and 2021, respectively. The principal and the relevant interest in full have been paid off in February 2022. As of June 30, 2021, the Company recognized $2,163,419 allowance of bad debt against the loan receivable from related party. During the year ended June 30, 2022, the Company reversed the $2,163,419 allowance and recognized the entire amount as other income in the accompany consolidated statement of operations and comprehensive income (loss). During the year ended June 30, 2022, the Company recognized the interest income of $764,421 and wrote off the interest income of $66,905.\nThe Company assessed the implication on ASC 606, Revenue from Contracts with Customers, and determined the terms of the loan are at the fair market value and not impact the revenue recognition of the Company.\nNote 6 - Account Receivable, net and Account Receivable - Related Parties, net\nThe Company reviews the accounts receivable and accounts receivable from related parties on a periodic basis and based on its reviews, the Company recorded an allowance for doubtful accounts of $12,317 and $1,682,437 as of June 30, 2022 and 2021, respectively.\nAs of June 30, 2022 and 2021, accounts receivable and accounts receivable from related parties consisted of the following:\nSchedule of Accounts Receivable\nJune 30,\nJune 30,\nAccounts receivable and accounts receivable - related parties $ 2,482,990 $ 4,284,829\nLess: Allowance for doubtful accounts (12,317 ) (1,682,437 )\nAccounts receivable, net and accounts receivable - related parties, net $ 2,470,673 $ 2,602,392\nNote 7 - Transfer of Business Ownership\nOn April 22, 2022, Zhejiang Jingmai Electronic Commerce Ltd received transfer of 99% ownership of Yiwu Tianqi Enterprise Management Co., Ltd which was incorporated on November 23, 2020 for no consideration.\nOn April 22, 2022, Zhejiang Jingmai Electronic Commerce Ltd received transfer of 99% ownership of Zhejiang Jingmai e-commerce Co., Ltd which was incorporated on November 25, 2020 for no consideration.\nOn April 22, 2022, Zhejiang Jingmai Electronic Commerce Ltd received transfer of 99% ownership of Zhejiang Jingtao Supply Chain Co., Ltd which was incorporated on November 24, 2020 for no consideration.\nThese transferred entities had no operation or accounting record since its inception until the Company received the 99% ownership. These entities are used to develop business in the following fields: wholesale and retail of wide range of products, management, import and export, network integration and IT service, and more fields.\nNote 8 - Equipment\nEquipment consisted of a vehicle. As of June 30, 2022 and 2021, equipment was $77,012 and $79,892, and accumulated depreciation of $25,606 and $11,384, respectively. For the years ended June 30, 2022 and 2021, depreciation expense including amortization of right of use assets was to $19,127 and $12,871, respectively.\nNote 9 - Right-Of-Use Assets And Operating Lease Liabilities\nThe Company has an operating lease for office space. Rent expense for the operating lease was to $0 and $3,398 for years ended June 30, 2022 and 2021, respectively. The lease term was from May 11, 2020 and expired on December 10, 2020.\nOn January 5, 2021, Jingmai Electronic leased an office in Zhejiang, China from January 5, 2021 to April 5, 2022. There is rent-free period from January 5, 2021 to April 5, 2021. The monthly rent is $388.\nOn March 20, 2022, Zhejiang Jingmai Electronic Commerce Ltd. leased an office in Zhejiang, China. The lease term of the office is from April 1, 2022 to March 30, 2023. The monthly rent is $373. As of June 30, 2022, the Company had paid rent up until March 30, 2023.\nThe operating lease is listed as a separate line item on the Companys consolidated financial statements. The operating lease represents the Companys right to use the underlying asset for the lease term. The Companys obligation to make lease payments are also listed as a separate line item on the Companys consolidated financial statements.\nOperating lease right-of-use assets and liabilities commencing after January 1, 2021 are recognized at commencement date based on the present value of lease payments over the lease term. For the years ended June 30, 2022 and 2021, the Company recorded $3,983 and $1,885 in total lease operating costs, respectively.\nBecause the rate implicit in each lease is not readily determinable, the Company uses its incremental borrowing rate to determine the present value of the lease payments.\nInformation related to the Companys operating right of use assets and related lease liabilities are as follows:\nSchedule of Operating ROU Assets and Lease liability\nYear ended\nJune 30, 2022\nCash paid for operating lease liabilities $ 9,480\nWeighted-average remaining lease term 0.75\nWeighted-average discount rate 5 %\nMinimum future lease payments $ -\nNote 10 - Other Receivable from Related Party\nOther receivable from related party was $209,014 and $0 as of June 30, 2022 and 2021, respectively. Other receivable is money due from a related party which company was controlled by management or affiliate. The receivable is without collateral, interest free, and due on demand.\nNote 11 - Advances and Deposits\nAdvances and deposits were to $0 and $30,976 as of June 30, 2022 and 2021, respectively. Advances are received from customers for the sale of products in the normal course of business and adjusted against the payments due from them.\nNote 12 - Accrued Expenses and Other Payables\nAccrued expense and other payables consists of the following:\nSchedule of Accrued Expense and Other Payables\nAs of As of\nJune 30,\nJune 30,\nPayroll payable $ 8,085 $ 3,910\nTax payable 198,992 12,780\nOther payable 96,476 81,664\nTotal accrued expense and other payables $ 303,553 $ 98,354\nAs of June 30, 2022 and 2021, accrued expenses and other payables were $303,553 and $98,354, respectively. The accrued expenses and other payable are mainly payroll payable, taxes payable and money borrowed from unrelated parties for operating purpose. These payables are without collateral, interest free, and due on demand.\nNote 13 - Stockholders Equity\nCommon Stock\nOn July 1, 2021, the former President and Director of the Company forgave the working capital advance of $19,974 given to the Company as a loan on March 20, 2020 (Note 10). The forgiveness of loan was credited to additional paid in capital as of June 30, 2022.\nPreferred Stock\nOn November 10, 2020, the Company adopted a resolution to designate 1,000,000 shares as Series A Preferred Stock. The original issue price of each share of Series A preferred Stock shall be $1.00.\nRight to Receive Dividends\nThe holders of Series A Preferred Stock shall be entitled to receive dividends when, as and if declared by the Board of Directors of the Company. The right to dividends on shares of Series A Preferred Stock shall be non-cumulative and no right shall accrue to holders of Series A Preferred Stock by reason of the fact that dividends on said shares are not declared in any prior period.\nLiquidation Preference\nIn the event of any liquidation, dissolution, or winding up of the corporation, either voluntary or involuntary, the holders of Series A Preferred Stock shall be entitled to receive, prior and in preference to any distribution of any of the assets or surplus funds of the Corporation to the holders of Junior Securities but after distribution of such assets among, or payment thereof to holders of any Senior Preferred Stock, an amount equal to the Series A original issue price for each share of Series A Preferred Stock plus an amount equal to all declared but unpaid dividends on Series A Preferred Stock (the Series A Liquidation Preference).\nAfter the payment of the full Series A Liquidation Preference, the remaining assets of the corporation legally available for distribution, if any, shall be distributed ratably to the holders of the Common Stock in an amount equal to the Series A Liquidation Preference; after such distribution to the holders of the Common Stock, the remaining assets of the corporation legally available for distribution, if any, shall be distributed ratably among the Series A Preferred Stock and the Common Stock. If the assets and funds legally available for distribution among the holders of Series A Preferred Stock shall be insufficient to permit the payment to the holders of the full Series A Liquidation Preference, then the assets and funds shall be distributed ratably among holders of Series A Preferred Stock in proportion to the number of shares of Series A Preferred Stock owned by each holder.\nVoting Rights\nExcept as otherwise provided in the Certificate of Designation or required by law, the holders of the Series A Preferred Stock shall be entitled to vote, in the same manner and with the same effect as the holders of Common Stock, voting together with the holders of Common Stock as a single class. For this purpose, the holders of Series A Preferred Stock shall be given notice of any meeting of stockholders as to which the holders of Common Stock are given notice in accordance with the bylaws of the Corporation. As to any matter on which the holders of Series A Preferred Stock shall be entitled to vote, the holders of the outstanding Series A Preferred Stock shall have voting rights equal to an aggregate of seventy-five percent (75%) of the total shares entitled to vote by both (i) the holders of all of the then outstanding shares of Common Stock (whether or not such holders vote) and (ii) the holders of all of the then outstanding shares of voting shares of the Company.\nRedemption\nThe Company shall have the right to redeem the Series A Preferred Stock, plus any accrued and unpaid dividends, in whole but not in part, at any time or from time to time (the Redemption), at a cash redemption price equal to the aggregate Series A original issue price the Series A Preferred Stock being redeemed (the Redemption Amount) plus an amount equal to the amount of the accrued and unpaid dividend thereon.\nNote 14 - Related Party Transactions\nRelated parties with whom the Company had transactions are:\nSchedule Of Related Party Transaction\nRelated Parties\nRelationship\nHangJin Chen\nPresident/CEO/CFO/Secretary/Director\nYoucheng Chen\nFather of CEO HangJin Chen\nLi Weiwei\nPresident/CEO/CFO/Secretary/Director (Former)\nShengda Network Technology Co., Ltd Company controlled by management or affiliate\nChengdu Tiantian Aixiu Culture Media Co., Ltd Company controlled by management or affiliate\nZhejiang Malai Electronic Commerce Co., Ltd Company controlled by management or affiliate\nRelated party loans represent working capital advances to the Company by former President and Director in the amount of $0 and $19,974 as of June 30, 2022 and 2021, respectively. The loan is unsecured, non-interest bearing and due on demand. The Company has not recorded any imputed interest expense for the years ended June 30, 2022 and 2021. On July 1, 2021, the former President and Director agreed to forgive the working capital advance of $19,974 given to the Company on March 20, 2020 (Note 12).\nOn October 25, 2020, the Company signed an agreement with Zhejiang Malai Electronic Commerce Co., Ltd., which is also the Companys major customer. The Company agreed to loan the customer $8,957,764 (RMB60,000,000) at an annual interest rate of 7.2%. The loan was guaranteed by a Companys supplier which is also an important partner of the Companys major customer and due on October 25, 2021. The borrower is required to pay all the principal and the relevant interest in full amount on the due date. The total loan receivable, net of allowance was $0 and $6,417,350 as of June 30, 2022 and 2021, respectively. The principal and the relevant interest in full were paid off in February 2022. $2,163,419 allowance of bad debt of loan receivable is reversed and is recognized as other income during the year ended June 30, 2022.\nOther receivable from Shengda Network Technology Co., Ltd. was $209,014 and $0 as of June 30, 2022 and 2021, respectively. The receivable was without collateral, interest free, and due on demand; the Company made vendor payments on behalf of Shengda Netwoek Technology Co., Ltd.\nPurchases were $408,588 and $0 from Shengda Network Technology Co., Ltd for the years ended June 30, 2022 and 2021, respectively. Due from Shengda Network Technology Co., Ltd was $3,156 as of June 30, 2022.\nSales were $919,610 and $0 to Chengdu Tiantian Aixiu Culture Media Co., Ltd for the years ended June 30, 2022 and 2021, respectively. Due from Chengdu Tiantian Aixiu Culture Media Co., Ltd amounted $259,018 as of June 30, 2022.\nSales were $0 and $5,278,370 to Zhejiang Malai Electronic Commerce Co., Ltd for the years ended June 30, 2022 and 2021, respectively. Due from Zhejiang Malai Electronic Commerce Co., Ltd was $6 as of June 30, 2022.\nNote 15 - Taxes Payable\nTaxes payable consists of the following:\nSchedule of Taxes Payable\nAs of As of\nJune 30,\nJune 30,\nVAT $ 843 $ 5,499\nIncome tax payable 198,140 10,566\nOther taxes payable (3,285 )\nTaxes Payable $ 198,992 $ 12,780\nUnited States\nThe Company is incorporated in United States, and is subject to corporate income tax at 21%.\nThe Peoples Republic of China (PRC)\nUnder the Provisional Regulations of the Peoples Republic of China Concerning Income Tax on Enterprises promulgated by the PRC, which took effect on January 1, 2008, domestic and foreign companies pay a unified corporate income tax of 25%.\nHong Kong\nPeaker is incorporated in the Hong Kong and subject to the Enterprise Income Tax Law (the EIT Law). Under the EIT Law, when the net income is less than $254,868 (HKD 2,000,000), the income tax is calculated at 8.25%. When the income exceeds $254,868 (HKD 2,000,000), the income tax is calculated at 16.5% for the excess.\nFor financial reporting purposes, net income (loss) showing domestic and foreign sources was as follows:\nSchedule of Income Tax Domestic and Foreign\nYear Ended June 30,\nDomestic $ (236,892 ) $ (127,996 )\nForeign 4,778,122 (2,211,886 )\nNet income (loss) $ 4,541,230 $ (2,339,882 )\nProvision for income taxes\nThe effective income tax rate was 4.8% and (16.1)% for the years ended June 30, 2022 and 2021, respectively. A reconciliation of the income tax (benefit) computed at federal statutory income tax rate and the effective income tax rate as a percentage of income (loss) before income taxes for the years ended June 30, 2022 and 2021 is as follows:\nSchedule of Reconciliation Income Tax Benefit\nJune 30,\nNet income (loss) before income tax $ 4,541,230 $ (2,339,882 )\nComputed tax expense (benefit) at statutory rate 953,658 (491,375 )\nTaxes in foreign jurisdictions with rates different than US 191,125 (88,475 )\nEffect of income tax holiday of PRC entities (16,366 ) -\nUtilization of net operating loss of PRC entities (961,542 ) -\nValuation allowance of PRC entities - 929,436\nValuation allowance of US parent company 49,747 26,879\nIncome tax expense $ 216,622 $ 376,465\nDeferred tax assets\nNet deferred tax assets of continuing operations consisted of the following:\nSchedule of Deferred Tax Assets\nJune 30,\nDeferred tax assets:\nAccumulated net operating loss carry forward $ 95,600 $ 45,859\nBad debt allowance for loan receivable - 527,202\nBad debt allowance for accounts receivable 3,195 410,097\nLess: valuation allowance (98,795 ) (983,158 )\nNet deferred tax assets $ - $ -\nAt June 30, 2022, the Companys US parent company had approximately $0.46 million of U.S. federal net operating loss (NOL) carry forward for federal income tax purposes, the NOL arising in tax years beginning after 2017 may only reduce 80% of a taxpayers taxable income, and may be carried forward indefinitely; However, the coronavirus Aid, Relief and Economic Security Act (the CARES Act) issued in March 2020, provides tax relief to both corporate and noncorporate taxpayers by adding a five-year carryback period and temporarily repealing the 80% limitation for NOLs arising in 2018, 2019 and 2020. No tax benefit was reported with respect to these NOL carry-forwards in the accompanying consolidated financial statements because the Company believes the realization of the Companys net deferred tax assets for the NOL of approximately $0.10 million as of June 30, 2022, was not considered more likely than not and accordingly, the potential tax benefits of the net loss carry-forwards are fully offset by a full valuation allowance.\nAt June 30, 2022, the Companys PRC entities had $0 of China NOL carryforward. The China NOL carryforward have expiration dates through 2027.\nNote 16 - Subsequent Events\nIn accordance with ASC 855-10, the Company has analyzed its operations subsequent to June 30, 2022 to the date these consolidated financial statements were available to be issued and has determined that the following subsequent events or transactions that would require recognition or disclosure in the consolidated financial statements.\nOn August 15, 2022, the size of the Board was increased to five members. Mr. Yizhong Chen, Mr. Hanguo Li, Mr. Manu Ohri and Mr. Yanfeng Wang were appointed as independent directors of the Board, effective the same date. In addition, effective the same date, the Board created an Audit Committee, a Nominating Committee and a Compensation Committee and also adopted a Code of Business Conduct and Ethics. The Company also adopted amended and restated bylaws. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE.\n(a) Dismissal of independent registered accounting firm\nOn June 28, 2022, the board of directors of the Company dismissed SS Accounting & Auditing, Inc. (SS Accounting), as the Companys independent registered public accounting firm, effective immediately.\nThe reports of SS Accounting on the Companys financial statement as of and for the years ended June 30, 2021, and June 30, 2020, contained no adverse opinion or disclaimer of opinion nor were any such reports qualified or modified as to uncertainty, audit scope or accounting principle.\nDuring the recent fiscal years ending June 30, 2021 and June 30, 2020 and through the date of this current report, there have been no (i) disagreements with SS Accounting on any matter or accounting principles or practices, financial statement disclosure, or auditing scope or procedure, which connects with its reports; or (ii) reportable events as defined in Item 304(a)(1)(v) of Regulation S-K.\nThe Company has provided SS Accounting with a copy of the above disclosures and requested that SS Accounting furnish the Company with a letter addressed to the Securities and Exchange Commission (SEC) stating whether or not it agrees with the above statement. A copy of SS Accountings letter dated July 28, 2022 is filed as exhibit 16.1 to the Companys Form 8-K dated July 28, 2022.\n(b) Engagement of new independent registered public accounting firm\nOn June 28, 2022, the Company engaged Paris Kreit & Chiu CPA LLP, (Paris Kreit), as the Companys new independent registered public accounting firm.\nDuring the recent fiscal years ending June 30, 2022 and June 30, 2021, neither the Company, nor any on its behalf, consulted with Paris Kreit regarding (i) the application of accounting principles to any specified transaction, either completed or proposed, (ii) the type of audit opinion that might be rendered on the Companys financial statements, or (iii) any matter that was either the subject of a disagreement (as defined in Item 304(a)(1)(iv)) or a reportable event (as defined in Item 304(a)(1)(v). ITEM 9A. CONTROLS AND PROCEDURES.\nEvaluation of Disclosure Controls and Procedures\nThe Companys management is responsible for establishing and maintaining a system of disclosure controls and procedures (as defined in Rule 13a-15(e) under the Exchange Act) that is designed to ensure that information required to be disclosed by the Company in the reports that the Company files or submits under the Exchange Act is recorded, processed, summarized and reported, within the time periods specified in the SECs rules and forms. Disclosure controls and procedure include, without limitations, controls and procedures designed to ensure that information required to be disclosed by an issuer in the reports that it files or submits under the Exchange Act is accumulated and communicated to the issuers management, including its principal executive officer or officers and principal financial officer or officers, or persons performing similar functions, as appropriate to allow timely decisions regarding required disclosure.\nIn accordance with Exchange Act Rules 13a-15 and 15d-15, an evaluation was completed by the Companys Chief Executive Officer and Chief Financial Officer, of the effectiveness of the design and operation of the Companys disclosure controls and procedures as of the end of the period covered by this Annual Report. Based on that evaluation, the Companys sole officer concluded that the Companys disclosure controls and procedures were not effective in providing reasonable assurance that the information required to be disclosed in the Companys reports filed or submitted under the Exchange Act was recorded, processed, summarized, and reported within the time periods specified in the SECs rules and forms.\nManagements Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting. Internal control over financial reporting is defined in Rule 13a-15(f) or 15d-15(f) promulgated under the Exchange Act as a process designed by, or under the supervision of, the companys principal executive and principal financial officers and effected by the companys board of directors, management and other personnel, to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with accounting principles generally accepted in the United States of America and includes those policies and procedures that:\n● Pertain to the maintenance of records that in reasonable detail accurately and fairly reflect the transactions and dispositions of the assets of the Company;\n● Provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with accounting principles generally accepted in the United States of America and that receipts and expenditures of the Company are being made only in accordance with authorizations of management and directors of the Company; and\n● Provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of the Companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate. All internal control systems, no matter how well designed, have inherent limitations. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation. Because of the inherent limitations of internal control, there is a risk that material misstatements may not be prevented or detected on a timely basis by internal control over financial reporting. However, these inherent limitations are known features of the financial reporting process. Therefore, it is possible to design into the process safeguards to reduce, though not eliminate, this risk.\nAs of June 30, 2022, management assessed the effectiveness of our internal control over financial reporting based on the criteria for effective internal control over financial reporting established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) and SEC guidance on conducting such assessments. Based on that evaluation, they concluded that, during the period covered by this report, such internal controls and procedures were not effective to detect the inappropriate application of US GAAP rules as more fully described below. This was due to deficiencies that existed in the design or operation of our internal controls over financial reporting that adversely affected our internal controls and that may be considered to be material weaknesses.\nThe matters involving internal controls and procedures that our management considered to be material weaknesses under the standards of the Public Company Accounting Oversight Board were: (1) lack of a functioning audit committee, resulting in ineffective oversight in the establishment and monitoring of required internal controls and procedures; (2) inadequate segregation of duties consistent with control objectives; (3) ineffective controls over period end financial disclosure and reporting processes; and (4) ineffective controls over idenfification of related party relationships and proper disclosure of related parties transactions and balances. The aforementioned material weaknesses were identified by our management in connection with the review of our financial statements for the year ended June 30, 2022.\nManagement believes that the material weaknesses set forth in items (2) and (3) above did not have an effect on our financial results. However, management believes that the lack of a functioning audit committee and the lack of a majority of outside directors on our board of directors results in ineffective oversight in the establishment and monitoring of required internal controls and procedures, which could result in a material misstatement in our financial statements in future periods.\nThis Report does not include an attestation report of our registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by our registered public accounting firm pursuant to temporary rules of the SEC that permit us to provide only the managements report in this annual report.\nManagements Remediation Initiatives\nOn August 15, 2022, the Board established an Audit Committee, a Nominating Committee, and a Compensation Committee, and it further adopted Code of Business Conduct and Ethics.\nChanges in Internal Control over Financial Reporting.\nDuring the last quarter of our fiscal year ended June 30, 2022, there were no changes in our internal control over financial reporting during the period covered by this Report that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nLimitations on the Effectiveness of Controls.\nA control system, no matter how well conceived and operated, can provide only reasonable, not absolute, assurance that the objectives of the control system are met. Because of the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues, if any, within a company have been detected. ITEM 9B. OTHER INFORMATION.\nOn October 25, 2020, the Company signed an agreement with a related party, which is also the Companys major customer. The Company agreed to loan the related party $8,957,764 (RMB 60,000,000) at an annual interest rate of 7.2%. The loan is guaranteed by a Companys supplier which is also an important partner of the Companys major customer and due on October 25, 2021. The borrower is required to pay all the principal and the relevant interest in full amount on the due date. The total loan receivable, net of allowance $0 and $6,417,350 as of June 30, 2022 and 2021, respectively. The principal and the relevant interest in full have been paid off in February 2022. As of June 30, 2021, the Company recognized $2,163,419 allowance of bad debt against the loan receivable from related party. During the year ended June 30, 2022, the Company reversed the $2,163,419 allowance and recognized the entire amount as other income in the accompany consolidated statement of operations and comprehensive income (loss). During the year ended June 30, 2022, the Company recognized the interest income of $764,421 and wrote off the interest income of $66,905.\nThe Company assessed the implication on ASC 606, Revenue from Contracts with Customers, and determined that the terms of the loan are at the fair market value and does not impact the revenue recognition of the Company.\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS.\nNot applicable.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE.\nSet forth below are the names of our directors and executive officers, their respective ages, all positions and offices that they held with us, the period during which he has served as such, and his business experience during at least the last five years.\nName\nAge\nPositions Held\nHangJin Chen\nCEO, President, CFO, Treasurer, Secretary, and Director since 2020\nYizhong Chen\nDirector\nHanguo Li\nDirector\nManu Ohri\nDirector\nYanfeng Wang\nDirector\nHangJin Chen (33) has served as President, Secretary, Chief Executive Officer, Chief Financial Officer and a Director of the Company since March 2020. Commencing in May 2016, he became the President of Zejiang Chuangbu Network Technology Co., Ltd. He was also the founder and President of Hubei Chuangbu Commodity Trading Service Co., Ltd. in December 2017, which has annual sales of more than RMB 50 million. In June 2019, he founded the Daqing Valley project and Panan Dongchuan tourism development project. His other activities included Zhejiang Shenmiao Technology Co., Ltd., which was established in July 2019 where he served as General Manager and ShengDa Network Technology Co., Ltd., which was founded in October 2019, where he served as its chairman. He also led a technology development team to create Whale Buy Mall, which was expected to launch by the end of March 2020. Mr. Chen attended Zhejiang University from 2017 to 2019 and received an EMBA (Senior Management MBA Masters Degree Courses). On August 15, 2022, Mr. Chen was appointed as the Chairman of the Companys Board of Directors.\nYizhong Chen (59) was appointed as a director on August 15, 2022. He currently serves as chief accountant, chairman and general manager of Zhejiang Panan Ankang Native Products Co., Ltd., in which he previously has served in various roles since October 1996. Earlier, Mr. Chen worked for Panan County Deputy Food Company, Panan County Supply and Marketing Co., Ltd. and Dongyang Jianshan Supply and Marketing Co., Ltd. Currently a farmer and president of the Federation of Cooperatives in Panan County, the Peoples Republic of China (the PRC), and previously director and officer of various food, edible fungus and fruit civic associations in the PRC. Mr. Chen received an undergraduate degree in commercial enterprise management from Zhejiang University of Economics and Business (formerly Zhejiang Supply and Marketing Staff College) in July 1988 and subsequently studied at Zhejiang University City College of Business Administration EMBA. In 2014, he obtained a diploma in traditional Chinese medicine from Zhejiang Pharmaceutical College.\nHanguo Li (66) was appointed as a director on August 15, 2022. He has served as Professor of Finance and Director of Securities and Futures Research at the Center of Jiangxi University of Finance and Economics since December 2007. Mr. Li has been engaged as a counselor to Nanchang Municipal Peoples Government since December 2009; external supervisor of Nanchang Bank since April 2015; consultant of the Nanchang Cultural Property Rights Trading Center since May 2015; consultant of the Jiangxi Provincial Development and Reform Association since June 2018; and doctoral supervisor of Sirawa University, Thailand since August 2019. Mr. Li has also served as an independent director of each of Huazhang Chinese Media Co and Jiangxi Sanchuan Wisdom Co., Ltd. since April 2019. He previously served as an independent director of Jiangxi Guotai Group Co., Ltd. and Jiangxi Zhengbang Technology Co., Ltd. The author of books on finance audits and recipient of multiple awards in the PRC, Mr. Li received a bachelors degree from at Jiangxi University of Finance and Economics in July 1982 and a degree in accounting from Xiamen University in July 1983. He subsequently received a Master of Economics from Zhongnan University of Finance and Economics in June 1996 and a PhD in finance from American World University in May 2003.\nManu Ohri (67) was appointed as a director on August 15, 2022. He has provided management consulting and business advisory services through Anarjay Concepts, Inc. from 2020 through the present. From 2015 to 2019, Mr. Ohri served as the Chief Financial Officer of ToughBuilt Industries, Inc. Mr. Ohri joins the Company with more than 25 years of hands-on experience in financial management and business leadership and working with boards of directors and financial institutions. Mr. Ohri has assisted several public companies in the areas of compliance with U.S. and international financial accounting and reporting standards, investor relations, mergers and acquisitions, strategic planning, team building and project management. Mr. Ohri is a certified public accountant and chartered global management accountant with over seven years of previous experience with Deloitte, LLP and PriceWaterhouseCoopers, LLP. Mr. Ohri received a business degree in communications from the University of Delhi in 1975 and a masters degree in business administration from the University of Detroit in December 1979.\nMr. Yanfeng Wang (36) was appointed as a director on August 15, 2022. He has been employed by Zhejiang Jingmai E-commerce Co., LTD. since 2020. From 2015 to 2016, Mr. Wang was the chief analyst at Engu Capital. Previously, Mr. Wang served as the chief lecturer and analyst of East China in JingZhuan Software Development Co., Ltd. from 2012 to 2013. Mr. Wang earned a degree in logistics management from the East China Institute of Technology in 2012 and received a certificate in fund practice in 2016.\nFamily Relationships\nThere are no family relationships among any of our officers or director. None of the directors are party to any arrangement or understanding with any person pursuant to which they were appointed as directors, nor are they party to any transactions required to be disclosed under Item 404(a) of Regulation S-K involving the Company.\nLegal Proceedings\nDuring the past ten years there have been no events under any bankruptcy act, no criminal proceedings and no judgments, injunctions, orders or decrees material to the evaluation of the ability and integrity of any of our directors or executive officers, and none of these persons has been involved in any judicial or administrative proceedings resulting from involvement in mail or wire fraud or fraud in connection with any business entity, any judicial or administrative proceedings based on violations of federal or state securities, commodities, banking or insurance laws or regulations, or any disciplinary sanctions or orders imposed by a stock, commodities or derivatives exchange or other self-regulatory organization.\nDirector Independence\nWe are not currently subject to listing requirements of any national securities exchange or inter-dealer quotation system which has requirements that a majority of the board of directors be independent and, therefore we are not at this time required to have our Board of Directors comprised of a majority of independent directors. However, on August 15, 2022, the Board appointed Mr. Yizhong Chen, Mr. Hanguo Li, Mr. Manu Ohri and Mr. Yanfeng Wang as independent directors of the Board.\nConcurrent with the expansion of the Board of Directors to include the new independent directors, the Board established the Audit Committee, the Nominating Committee, and the Compensation Committee, each of which is described below.\nAudit Committee\nOn August 15, 2022, the Board established an audit committee (the Audit Committee) and adopted the audit committee charter. Effective on the same date, Mr. Ohri, Mr. Chen and Mr. Li were appointed to the Audit Committee, with Mr. Ohri serving as chair of the Audit Committee.\nThe Audit Committee is responsible for assisting the Board in its oversight responsibilities regarding the Companys accounting and financial reporting processes, the audits of the Companys financial statements and the independent auditors qualifications and independence.\nThe Board has determined that all of the members of the Audit Committee are independent, as defined under the rules of the Nasdaq Capital Market. In addition, all members of the Audit Committee meet the independence requirements contemplated by Rule 10A-3 under the Securities Exchange Act of 1934, as amended (the Exchange Act). Further, all members of the Audit Committee meet the requirements for financial literacy under the applicable rules and regulations of the Securities and Exchange Commission (SEC) and the Nasdaq Capital Market. The Board has determined that Mr. Li is an audit committee financial expert as defined by applicable SEC rules and has the requisite financial sophistication as defined under the applicable Nasdaq rules and regulations.\nNominating Committee\nOn August 15, 2022, the Board established a nominating committee (the Nominating Committee) and adopted the nominating committee charter. Effective August 15, 2022, Mr. Chen, Mr. Ohri and Mr. Li were appointed to the Nominating Committee, with Mr. Chen serving as chair of the Nominating Committee.\nThe Nominating Committee is responsible for, among other things, identifying qualified board candidates and nominees, and corporate officers of the Company and other matters with respect to governance of the Company.\nCompensation Committee\nOn August 15, 2022, the Board established a compensation committee (the Compensation Committee) and adopted the compensation committee charter. Effective August 15, 2022, Mr. Li and Mr. Ohri were appointed to the Compensation Committee, with Mr. Li serving as chair of the Compensation Committee.\nThe Compensation Committee is responsible for the approval and implementation of the executive compensation for officers and other key executives of the Company.\nCode of Ethics\nOn August 15, 2022, the Company adopted a Code of Business Conduct and Ethics (Code of Ethics) for its directors, executive officers and employees that complies with the regulations of the SEC. ITEM 11. EXECUTIVE COMPENSATION.\nNo past officer or director of the Company has received any compensation, and none is due or payable. Our sole current officer and the Chairman of the Board of Directors, HangJin Chen, does not receive any compensation for the services he renders to the Company, has not received compensation in the past, and is not accruing any compensation pursuant to any agreement with the Company. We currently have no formal written salary arrangement with Mr. Chen. Mr. Chen may receive a salary or other compensation for services that he provides to us in the future. No retirement, pension, profit sharing, stock option or insurance programs or other similar programs have been adopted by us for the benefit of our employees. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS.\nThe following table sets forth certain information regarding beneficial stock ownership as of September 26, 2022 of (i) all persons known to us to be beneficial owners of more than 5% of our outstanding common stock; (ii) named executive officers; (iii) each director of our company and our executive officers, and (iv) all of our officers and directors as a group. Each of the persons in the table below has sole voting power and sole dispositive power as to all of the shares shown as beneficially owned by them, except as otherwise indicated.\nName Number of\nShares\nBeneficially\nOwned(1)\nPercent of\nOutstanding\nShares(1)\nHangJin Chen 5,000,000 (2) 35.69 %\nFloor 6, Building\nLuGang WebMall Town, ChouJiang, YiWu, China\nYizhong Chen - 35.69 %\nHanguo Li -\nManu Ohri -\nYanfeng Wang 35,000 0.25 %\n(1) For the purposes of this table, a person is deemed to have beneficial ownership of any shares of capital stock that such person has the right to acquire within 60 days of October 28, 2022. All percentages for common stock are calculated based upon a total of 14,009,945 shares outstanding as of October 28, 2022, plus, in the case of the person for whom the calculation is made, that number of shares of common stock that such person has the right to acquire within 60 days of October 28, 2022.\nYizhong Chen, Hanguo Li, Manu Ohri, and Yanfeng Wang, all of whom were appointed to the Board on August 15, 2022, are included together with HangJin Chen as a management group. Among this group, only HangJin Chen and Yangeng Wang hold common stock in the Company, at 5,000,000 (35.69%) and 35,000 (0.25%), respectively.\n(2) On November 20, 2020, the Company issued 50,000 shares of Series A Preferred Stock in settlement of advances payable to Mr. HangJin Chen of $2,000. Mr. Chen is the sole holder of all 50,000 shares of outstanding Series A Preferred Stock. Holders of the Series A Preferred Stock are entitled to vote, in the same manner and with the same effect as the holders of Common Stock, voting together with the holders of Common Stock as a single class. As to any matter on which the holders of Series A Preferred Stock shall be entitled to vote, the holders of the outstanding Series A Preferred Stock shall have voting rights equal to an aggregate of seventy-five percent (75%) of the total shares entitled to vote by both (i) the holders of all of the then outstanding shares of Common Stock (whether or not such holders vote) and (ii) the holders of all of the then outstanding shares of voting shares of the Company. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS AND DIRECTOR INDEPENDENCE.\nCertain Relationships and Related Transactions\nDuring the year end June 30, 2021, the Company had sales amounting to $5,278,370 with a customer that accounted for 56% of the total revenue for the year ended June 30, 2021. For the year ended June 30, 2020, the Company had sales with that customer amounting $253,803 that accounted for 100% of the total revenue for the year ended June 30, 2020. The Company also had a net accounts receivable balance in the amount of $1,640,779 as of June 30, 2021, with that customer. The management subsequently discovered that the customer is a Related Party within the definition ASC 850.\nOn October 25, 2020, the Company signed an agreement with that Companys major customer. The Company agreed to loan the customer the $8,957,764 (RMB60,000,000) at an annual interest rate of 7.2%. The actual loan amount shall prevail within the total amount. The loan is guaranteed by a Companys supplier and due on October 25, 2021. The Company has recorded an allowance for uncollectible amount of $2,163,419 as of June 30, 2021. The total loan receivable, net of allowance amounted $6,417,350 and $0 as of June 30, 2021 and 2020, respectively. The management subsequently discovered that the customer is a Related Party within the definition ASC 850.\nIn the Affected Reports, the Company corrected the disclosure by reporting the above as Related Party transactions and balances.\nConsequently, Management has identified a material weakness in understanding and knowledge of US GAAP. ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES.\nAudit Fees\nDuring fiscal years ended June 30, 2022 and June 30, 2021, we incurred $141,500 and $43,000, respectively, in fees to our principal independent accountants for professional services rendered in connection with the audit and review of our financial statements and tax advisory services.\nAudit-Related Fees\nDuring the last two fiscal years, no fees were billed or incurred for assurance or related services by either of our auditors that were reasonably related to the audit or review of financial statements reported above.\nTax Fees\nThere were no tax preparation fees billed for the fiscal years ended June 30, 2022 or 2021.\nAll Other Fees\nDuring the last two fiscal years, no other fees were billed or incurred for services by our auditors other than the fees noted above. Our board, acting as an audit committee, deemed the fees charged to be compatible with maintenance of the independence of our auditors.\nBoard of Directors Pre-Approval Policies\nPrior to August 15, 2022, we did not have an Audit Committee. Therefore, the Board of Directors considered whether the non-audit services provided by our auditors to us are compatible with maintaining the independence of our auditors and concluded that the independence of our auditors is not compromised by the provision of such services. Our Board of Directors pre-approved all auditing services and permitted non-audit services, including the fees and terms of those services, to be performed for us by our independent auditor prior to engagement.\nThe board approved all fees described above.\nPART IV ITEM 15. EXHIBIT AND FINANCIAL STATEMENT SCHEDULES.\nThe following documents are filed as part of this Report:\nFinancial Statements\nThe following documents are filed in Part II, Item 8 of this Report:\n● Report of Paris Kreit, Independent Registered Certified Public Accounting Firm for the fiscal year ended June 30, 2022\n● Consolidated Balance Sheets as of June 30, 2022 and 2021 (audited)\n● Consolidated Statements of Operations and Comprehensive (Loss) Income for the years ended June 30, 2022 and 2021 (audited)\n● Consolidated Statements of Stockholders Equity (Deficit) for the period from July 1, 2022 to June 30, 2021 (audited)\n● Consolidated Statements of Cash Flows for the years ended June 30, 2022 and 2021(audited)\n● Notes to Consolidated Financial Statements\nExhibits\nThe exhibits listed below are filed as part of or incorporated by reference in this Report.\nIncorporated by Reference\nExhibit\nNumber\nExhibit Description\nForm\nFile No.\nExhibit\nFiling Date\nFiled\nHerewith\n3.1\nArticles of Incorporation\nS-1\n333-227526\n3.1\n9/26/18\n3.2\nAmendment to Articles of Incorporation Filed March 30, 2020\n10-K\n333-227526\n3.2\n9/28/21\n3.3\nCertificate of Designation for Series A Preferred Stock filed November 16, 2020\n10-K\n333-227526\n3.3\n9/28/21\n3.4\nAmended and Restated Bylaws of Shengda Network Technology, Inc.\n8-K\n333-227526\n3.4\n8/15/22\n3.5\nAudit Committee Charter\n8-K\n333-227526\n3.1\n8/15/22\n3.6\nNominating Committee Charter\n8-K\n333-227526\n3.2\n8/15/22\n3.7\nCompensation Committee Charter\n8-K\n333-227526\n3.3\n8/15/22\n3.8\nCode of Ethics\n8-K\n333-227526\n14.1\n8/15/22\n21.1\nList of Subsidiaries\nX\n31.1\nCertification of Principal Executive Officer pursuant to Exchange Act Rules 13a-14(a) and 15d-14(a), as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\nX\n31.2\nCertification of Principal Financial and accounting Officer pursuant to Exchange Act Rules 13a-14(a) and 15d-14(a), as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\nX\n32.1\nCertification of Chief Executive Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\nX\n32.2\nCertification of Chief Financial Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\nX\n101.INS\nInline XBRL Instance Document\nX\n101.SCH\nInline XBRL Taxonomy Extension Schema Document\nX\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document\nX\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document\nX\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document\nX\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document\nX\nCover Page Interactive Data File (embedded within the Inline XBRL document)\nITEM 16. FORM 10-K SUMMARY.\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nShengda Network Technology, Inc.\n(Registrant)\nBy /s/ HangJin Chen\nHangJin Chen\nChief Executive Officer, President, and Chief Financial Officer\nDate: October 28, 2022\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following person on behalf of the registrant and in the capacity and on the date indicated.\nBy /s/ HangJin Chen\nHangJin Chen\nChairman of the Board of Directors, Chief Executive Officer, President, and Chief Financial Officer\nDate: October 28, 2022\nBy /s/ Yizhong Chen\nYizhong Chen\nDirector\nDate: October 28, 2022\nBy /s/ Hanguo Li\nHanguo Li\nDirector\nDate: October 28, 2022\nBy /s/ Manu Ohri\nManu Ohri\nDirector\nDate: October 28, 2022\nBy /s/ Yanfeng Wang\nYanfeng Wang\nDirector"
}