{
    "cik": "1755101",
    "company": "APPlife Digital Solutions Inc",
    "filing_type": "10-K",
    "filing_date": "2023-10-02",
    "period_of_report": "2023-06-30",
    "sic": "7374",
    "state_of_inc": "NV",
    "state_location": "CA",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1755101/0001096906-23-001883-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1755101/000109690623001883/alds-20230630.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1755101/0001096906-23-001883.txt",
    "filename": "1755101_10K_2023_0001096906-23-001883.htm",
    "content": "ITEM 1. Business\nNature of Operations and Going Concern\nAPPlife Digital Solutions, Inc. (the Company) was formed March 5, 2018, in Nevada and has offices in San Francisco, California and Shanghai, China. Our office in San Francisco, California allows us to take advantage of the marketing opportunities available in the United States as well as keeping close proximity to sources of capital whether it is debt or equity. Our offices in Shanghai, China allows us to take advantage of a high concentration of skilled tech coders and developers at lower capital costs than in more developed countries such as the United States or Europe. The Companys mission is using digital technology to create APPs and websites that make life, business and living easier, more efficient and just smarter.\nWe are a development stage company with a limited operating history, operations, and revenues and we will need to raise capital to implement our planned operations. If we are unable to do so, an entire investment in our stock could be lost.\nThe Company anticipates that it would need a minimum of approximately $1,500,000 over the next 12 months to continue as a going concern and bring the Companys ecommerce and/or cloud-based businesses to market and generate revenue within that time frame. Specifically, in order for the Company to fully implement its plans to create apps and spend the necessary marketing expenditures for them we will need: (1) $750,000 for marketing expenses, (2) $500,000 for general administration and overhead expenses, (3) $180,000 for legal and accounting expenses, and (3) $70,000 for developers and engineers and app and server maintenance expenses. If we are not able to raise enough funds, we may be forced to look for capital through debt or equity, which would dilute our common stockholders.\nProducts\nAs of the period from inception, through todays date, we have generated limited revenue and incurred expenses and operating losses, as part of our developmental stage activities in developing three apps, B2BCHX, ROOSTER and Office Hop. B2BCHX is our first fully developed app/mobile website that was available in iTunes App Store and Google Play and a formerly functioning ecommerce website. B2BCHX allows business owners around the world to order three levels of background checks on Chinese companies to prevent fraudulent business transactions. The retail price for each report is $79, $399 and $1,299. The model is not currently marketing for new customers as the laws in China that allowed the attorney partnership, we have in place to record information about Chinese companies and distribute overseas, has been suspended temporarily.\nROOSTER ESSENTIALS ecommerce website, mobile website. After creating a reactive mobile web-based platform, the value of the apps for this model disappeared and we cut o our losses quickly by removing the apps. The website developed and launched BETA operations in the third quarter of fiscal year 2020 and launched its full commercial operations in the second quarter of 2022. ROOSTER ESSENTIALS is an online mens grooming supply store, and it allows men to fully customize which products they receive and set up an auto-delivery schedule for each product for automatic recurring delivery. ROOSTER ESSENTIALS currently carries over 200 products from over 80 brands. We anticipate the sources of revenue will come from product purchases, advertising, and sponsorships.\nOFFICE HOP entered beta testing in the fourth quarter of 2021 and is now fully functional as of January 2022. We believe OFFICE HOP fits perfectly into the needs of the post Covid working world, where short-term offices and meeting rooms will be in high demand. The OFFICE HOP model is like Airbnb for short term shared or private office space and meeting rooms. Those offices that have an extra office, shared desk, an empty meeting room or conference room may list the space and act as a host for a user. Those users in need of a short-term shared desk, meeting room or private office may locate one on our platform and rent it out for use as needed by the hour, half day, full day, week or month. We will also offer access to creative spaces such as photo studios and pop-up art galleries and will offer restaurants with private rooms a way to rent out the space with a menu included for group or lunch meetings. The revenue is expected to come from the 10-15% service fee charged to Users for finding and making a transaction with one of our listed properties. The platform is global. We will begin operations in North America and Europe and then\neventually operate in South America and Asia. This launch was delayed due to capital needs, but the model is operational and can be taken to market quickly upon financing from our effective equity line of credit.\nGlobal Hemp Services LLC is a low risk and low-cost participation in the fast-growing Hemp and CBD market space. We have licensed out our fully functional ecommerce platform in exchange for a 15% equity position and 2.5% revenue share, with exclusive rights to purchase an additional 36% of the equity (for a total of 51%) upon reaching revenue benchmarks. Global Hemp Services LLC distributes Hemp and CBD products globally, including Hemp based building materials, textiles, plastics, paper, personal care items and various CBD products. They will distribute wholesale to shops and stores and retail directly to consumers. The model is starting to form a marketplace and as the interest in Hemp and Hemp products escalates, the website is seeing more activity. We expect good things in the fiscal year 2024 from GHS.\nLollipop NFT will have a new name and will now be known as Valida. We have changed the model initially presented for Lollipop. Formerly an online marketplace, consignment store, creator platform, and wallet, it is now intended to be what we call a super wallet. It is non-custodial and will be able to be connected through API directly to various marketplaces of the users choice. We will focus on storing and sharing of NFTs that represent practical use. For example, we will focus on Drivers licenses, Diplomas, Real Estate escrow documents and title. The storage and ability to reference these valuable NFT documents as well as collections of NFT for storage will be available as the core model. The wallet will be a digital wallet, with cold storage for security. Once completed the system code will be audited by a third-party auditor and there will be multiple security daemons to monitor account login and asset transfers to protect the user. We have completed the design and preliminary development phase of this project, but have not yet begun writing the code. We plan to use the Polygon blockchain to create the wallet and have also lined up tech support with Polygon. We anticipate having a cold wallet system that allows the users to transfer between storage and active modes and plan to include 2FA, fingerprint and/or facial recognition technology. We plan to have multiple additional security daemons that review account holdings and prevent unauthorized transfers and withdrawals, however we may be liable for any cybersecurity breach resulting in the loss of customer assets. We plan to have multiple additional security daemons that review account holdings and prevent unauthorized transfers and withdrawals. The main focus of our user base will be practical use NFTs. We believe this is the future best use scenario for NFTs. This is what we believe will set us apart from those systems designed to buy and sell digital art and items that may be considered securities. We expect users to store their important documents and certifications in files. An example is we will allow universities to bulk upload diplomas into the system that will be an image of the certificate with the graduates name in place. The Meta Data will show in a border area that discloses the name of the University, the degree, date of issue and an official University stamp. The User will have the option of receiving the NFT version by registering and then using a code provided by the school to download the diploma NFT into the wallet. This would also apply to Drivers licenses issued by State DMVs, Real Estate Broker licenses, Wills and other important legal documents, Escrow or Title paperwork. We are not intending on blocking people from storing other types of NFTs, but our format and storage UI is not appealing to those collecting digital art. Our interface will resemble a windows filing system. It is tailored to cater to file storage for the practical use type.\nOur DRINX project is in early stage of development, and we believe the beta version will be ready by the fourth quarter of fiscal year 2024. DRINX app allows anyone to purchase a virtual drink ticket anywhere and at any time for friends and colleagues. We anticipate the sources of revenue will come from advertising and sponsorships from alcohol companies promoting products on the app, user fee of $0.99 to send each drink and discounts provided by the bars and restaurants for purchases made by the app.\nCompetition\nAlthough there are countless app and website developers and companies out there, we believe we have advantages over competitors. First our dual location of offices. Our business, management and marketing based in the U.S and our development team is located in Shanghai. Our creative team works in both places. Access to talent at a much more reasonable cost in Shanghai allows flexibility and that allows creativity to be explored more freely and makes completing projects with new or unique features much more likely. We can also finish faster and for less money and then focus dollars on marketing and obtaining customers. Second, our planned access to investment capital and filing to trade as a public company will allow us to not only build and develop our own concepts and ideas like any other app development company, but we will also be able to explore opportunities to invest in and participate in the growth\nand development of other companies that are not our own in-house projects, which will hopefully give us the advantage of accelerated growth.\nMarketing Strategy\nOur marketing strategy is carefully built and tailored for each of our individual projects. Multiple projects in varying industries allows us to cast a wide net in attracting customers from different marketplaces globally.\nOur completed project B2BCHX will be marketed as an anti-fraud or fraud prevention service when doing business with a Chinese company. The Company believes that globally, clients of Chinese businesses have no way to verify information or do a background check in a cost-effective way. B2BCHX helps prevent fraud by providing customers with a background check in an inexpensive, easy to read, one-page report. They can use the information for confidence when sending money, to verify what they have been told by the company staff or to try to track down a company that has not fulfilled the obligations to the customer.\nThe variations on the types of businesses we can develop allows our product to be sold across multiple market spaces. We are not limited to a single market or model.\nThe strategic partnerships with each of our individual in house projects are invaluable. For our Drinx app, which we plan to launch its Alpha version in the fall of 2023, Beta by winter 2024, and commercial launch in Spring 2024, we have collaborated with a well-known, long term New York City restaurateur and club owner, Lesly Bernard. His knowledge and market experience will allow New York City to be our base city in the Drinx service and expand from there. Bernard will consult and advise on the development of the look and feel of the app and will participate in the launch of the app in each city. He will lead project management and will be active in the marketing of the service. In exchange for his time and efforts, Bernard has agreed to take a minority equity position in the Drinx app. We are negotiating to bring in additional brand ambassadors and influencers including Natalia Bruschi.\nWe have also engaged an IR/PR team to help create marketing campaigns and create editorial content for each of our businesses as we launch. And soon OfficeHop and have paused the marketing campaign for B2BCHX to allow global factory orders to re-establish themselves post pandemic. We are currently in a soft launch of Rooster using with a well-timed and placed marketing campaign and plan to re-ignite the B2BCHX model and launch OfficeHop this fall.\nEmployees\nWe currently have one full time employee who does have a formal employment agreement. Matt Reid is technically the only employee of the Company, and he resides in Shanghai, China, in order to manage the independent contractor teams of developers the Company hires. We have an attorney in Shanghai engaged to help us with the contracts and negotiations with developers and other similar items. We have multiple independent contractor team members for the Company that live and work in the US who make up our business management and executive teams. They do not operate in China, and we generate no revenue in China. Our independent contractors fill positions such as Chief Legal Officer, Executive Project Director, Accountant and Investor relations manager and are all located in New York. Our Director of Marketing, PR agent and multiple lower-level independent contractors reside and work in California. None of the operating business models we have are generating any revenue from Chinese based businesses. Currently 100% of our revenue comes from an ecommerce platform servicing US customers and there are no current plans to buy or develop any new Chinese based business models. ITEM 1A. Risk Factors.\nWe are a smaller reporting company as defined by Rule 12b-2 of the Securities Exchange Act of 1934 and are not required to provide the information under this item.  ITEM 2. Unregistered Sale of Equity Securities and use of proceeds.\nNone. ITEM 3. DEFAULTS UPON SENIOR SECURITIES.\nNone. ITEM 4. MINE SAFETY DISCLOSURES.\nNot Applicable. ITEM 5. OTHER INFORMATION.\nNone.\nPART III\nITEM 10. Directors, Executive Officers and Corporate Governance\nDirectors and Executive Officers\nSet forth below are the names, ages and positions of our current directors and executive officers. Unless otherwise indicated, the address of each person listed is c/o APPlife Digital Solutions, Inc. 50 California St., Suite 1500, San Francisco, CA 94111.\nName and Address\nAge\nPosition\nMatthew Reid\nCEO, CFO, President, Secretary and Director\nDon Savant\nDirector\nTracy Gray\nDirector\nSid Ganis\nDirector\nRichard Walden\nDirector\nMatthew Reid, 49, CEO, CFO, President, Secretary and Director. Matthew Reid is an experienced founder who has worked in the venture capital and private equity industry for the past 15 years where he has focused on sales, management, marketing and business development. He has owned and operated several successful businesses ranging from a commercial real estate mortgage company to a media investment group. During the last five years Mr. Reid has been working for himself developing apps and projects that eventually lead to the creation of the Company and has not worked at any other companies. Mr. Reid holds a Bachelor of Arts degree from New York University.\nDon Savant, 57, Director. Don Savant was the President of Global Sales IMAX Corp. for three years starting in January 2016. Savant was a Managing Director at Asia Pacific IMAX Corp. for fifteen years before becoming President of Sales, Development and Film Distribution for IMAX China for four years starting in June 2011.\nTracy Gray, 56, Director. Tracy Gray is a former Systems Engineer on the Space Shuttle program. Gray also worked in the Office of the Mayor of Los Angeles and was a Managing Director of The 22 Fund. Gray has been a member of the Board of Directors of Exergy Systems and Isidore Recycling which was acquired by Homeboy Recycling.\nSid Ganis, 80, Director. Sid Ganis is the founder of Out of the Blue Entertainment and former President of Paramount Pictures. Ganis was Chairman of Columbia Tristar and President of the Academy of Motion Picture Arts and Sciences. Ganis is currently a member of the Board of Directors of Academy of Motion Picture Arts and Sciences and Immersion Corp IMMR. Ganis has previously been a member of the Board of Directors of Marvel Entertainments and The Void.\nRichard Walden, 74, Director. Mr. Walden is currently President, CEO and Founder of Operation USA, a Los Angeles-based non-governmental organization specializing in disaster relief as well as international and domestic health care and economic development projects. Walden guided Operation USA to share the 1997 Nobel Peace Prize Walden also coordinated Operation USAs work with UNESCO, NASAs Jet Propulsion Laboratory, and with the Lawrence Livermore and Los Alamos National Laboratories. Richard is also an active California-licensed attorney and, earlier in his career, served as Commissioner of the California Health Facilities Commission.\nBoard Composition\nOur By-Laws provide that the Board of Directors which shall constitute the whole board shall not be less than one (1) nor more than seven (7) or such other maximum number of directors as permitted by the Nevada General Corporation Law. The maximum or minimum number of directors cannot be changed, nor can a fixed number be substituted for the maximum and minimum numbers, except by a duly adopted amendment to the articles of incorporation or by an amendment to this bylaw.\nNo Committees of the Board of Directors; No Financial Expert\nWe do not presently have a separately constituted audit committee, compensation committee, nominating committee, executive committee or any other committees of our Board of Directors. Nor do we have an audit committee or financial expert. Management has decided not to establish an audit committee at present because our limited resources and limited operating activities do not warrant the formation of an audit committee or the expense of doing so. As such, our entire Board of Directors acts as our audit committee. We do not have a financial expert serving on the Board of Directors or employed as an officer based on managements belief that the cost of obtaining the services of a person who meets the criteria for a financial expert under Section 407 of the Sarbanes-Oxley Act of 2002 and Item 407(d) of Regulation S-K is beyond our limited financial resources and the financial skills of such an expert are simply not required or necessary for us to maintain effective internal controls and procedures for financial reporting in light of the limited scope and simplicity of accounting issues raised in our financial statements at this stage of our development.\nAuditors\nOur principal registered independent auditor is RBSM LLP\nCode of Ethics\nThe Company does not have a written code of ethics that applies to the Companys officers.\nPotential Conflicts of Interest\nSince we do not have an audit or compensation committee comprised of independent directors, the functions that would have been performed by such committees are performed by our directors. Thus, there is a potential conflict of interest in that our directors and officers have the authority to determine issues concerning management compensation and audit issues that may affect management decisions. We are not aware of any other conflicts of interest with any of our executives or directors.\nDirector Independence\nOur board of directors has undertaken a review of the independence of each director and considered whether any director has a material relationship with us that could compromise his ability to exercise independent judgment in carrying out his responsibilities. As a result of this review, our board of directors determined that Don Savant, Tracy Gray and Sid Ganis are independent directors.\nInvolvement in Legal Proceedings\nNone of our officers or directors has filed a personal bankruptcy petition, had a bankruptcy petition filed against any business of which they were a general partner or officer at the time of bankruptcy or within two years prior to that time, or has been convicted of or been the subject of any criminal proceedings or the subject of any order, judgment or decree involving the violation of any state or federal securities laws within the past ten (10) years.\nCompliance with Section 16(a) Of the Exchange Act\nSection 16(a) of that act requires our executive officers and directors, and persons who beneficially own more than 10% of a registered class of our equity securities to file with the Securities and Exchange Commission initial statements of beneficial ownership, reports of changes in ownership and annual reports concerning their ownership of our common shares and other equity securities, on Forms 3, 4 and 5 respectively. Executive officers, directors and greater than 10% shareholders are required by the Securities and Exchange Commission regulations to furnish us with copies of all Section 16(a) reports they file.\nITEM 11. Executive Compensation\nSummary Compensation\nOur sole officer and director does not currently take any formal salary for his services to the Company. He was issued 12,239,209 founders shares at inception, and on September 27, 2018, he was issued 90,000,000 shares for his services to be rendered over the next four years.\nOutstanding Equity Awards\nOur directors and officers do not have unexercised options, stock that has not vested, or equity incentive plan awards.\nCompensation of Directors\nOur directors do not receive compensation for their services as directors.\nEmployment Contracts, Termination of Employment, Change-in-Control Arrangements\nThere are no formal employment contracts, or other contracts with our officers or directors. There are no compensation plans or arrangements, including payments to be made by us, with respect to our officers, directors or consultants that would result from the resignation, retirement or any other termination of such directors, officers or consultants from us. There are no arrangements for directors, officers, employees or consultants that would result from a change-in-control.\nITEM 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nSecurity Ownership of Certain Beneficial Owners\nThe following table lists, as of October 2, 2023, the number of shares of common stock of our Company that are beneficially owned by (i) each person or entity known to our Company to be the beneficial owner of more than 5% of the outstanding common stock; (ii) each officer and director of our Company; and (iii) all officers and directors as a group. Information relating to beneficial ownership of common stock by our principal shareholders and management is based upon information furnished by each person using beneficial ownership concepts under the rules of the Securities and Exchange Commission. Under these rules, a person is deemed to be a beneficial owner of a security if that person has or shares voting power, which includes the power to vote or direct the voting of the security, or investment power, which includes the power to vote or direct the voting of the security. The person is also deemed to be a beneficial owner of any security of which that person has a right to acquire beneficial ownership within 60 days. Under the Securities and Exchange Commission rules, more than one person may be deemed to be a beneficial owner of the same securities, and a person may be deemed to be a beneficial owner of securities as to which he or she may not have any pecuniary beneficial interest. Except as noted below, each person has sole voting and investment power.\nThe percentages below are calculated based on 150,543,635 shares of our common stock issued and outstanding as of October 2, 2023. Unless otherwise indicated, the address of each officer and director listed below is c/o APPlife Digital Solutions, Inc., 50 California St, #1500, San Francisco, CA 94111.\nName of Beneficial Owner\nTitle of Class\nAmount and Nature of Beneficial Ownership\nPercent of Class\nMatt Reid, Sole Officer and Director\nCommon\n102,239,109 Shares\n67.91%\nDon Savant, Director\nCommon\n381,579\n0.25%\nTracy Gray, Director\nCommon\n381,579\n0.25%\nSid Ganis, Director\nCommon\n375,000\n0.25%\nAll Officers and Directors\nCommon\n103,377,267 Shares\n68.67%\nStephen Solarsh\nCommon\n11,900,327 Shares\n7.90%\nRELATED PARTY TRANSACTIONS\nDue to Officer\nDuring the year ending June 30, 2023, the Company received advances from its officer to pay for certain operating expenses. The balance due to the officer at June 30, 2023 and 2022 was $1,000 and $0, respectively. There are no definitive repayment terms and no interest is accruing on these advances.\nITEM 13. Certain Relationships and Related Transactions, and Director Independence\nDirector Independence\nOur securities are not listed on a national securities exchange or on any inter-dealer quotation system which has a requirement that a majority of directors be independent. Our board of directors has undertaken a review of the independence of each director by the standards for director independence set forth in the NASDAQ Marketplace Rules. Under these rules, an independent director is one who is not an executive officer or an employee of the company and who does not have a relationship that, in the opinion of the board of directors, would interfere with exercising independent judgment in carrying out a directors responsibilities. Our board of directors has determined that three of our directors qualify as independent directors.\nITEM 14. Principal Accountant Fees and Services\nAudit Fees\nThe Company engaged RBSM LLP (RBSM) as our independent registered public accounting firm since April 15, 2019. The audit fees to RBSM for the year ended June 30, 2023 and 2022 were approximately $30,000 and $25,000, respectively.\nAudit-Related Fees\nThe aggregate fees billed in each of the last three fiscal quarters for assurance and related services by RBSM that are reasonably related to the performance of the audit or review of our consolidated financial statements including our quarterly interim reviews on Form 10-Q amounted to $18,000 each quarter.\nTax Fees\nRBSM did not charge us any tax fees for the year ended June 30, 2023 and 2022, respectively.\nAll Other Fees\nRBSM billed $5,000 during the year ended June 30, 2023 for their procedures related to issuance of consent and S-1 filing.\nPART IV\nITEM 15. Exhibits, Financial Statement Schedules.\nExhibits\nSee the Exhibit Index following the signature page of this Registration Statement, which Exhibit Index is incorporated herein by reference.\nExhibit Number\nDescription of Exhibit\nFiling\n31.1\nCertification of Principal Executive Officer Pursuant to Rule 13a-14\nFiled herewith.\n31.2\nCertification of Principal Financial Officer Pursuant to Rule 13a-14\nFiled herewith.\n32.1\nCEO Certification Pursuant to Section 906 of the Sarbanes-Oxley Act\nFiled herewith.\n101.INS*\nXBRL Instance Document\nFiled herewith.\n101.SCH*\nXBRL Taxonomy Extension Schema Document\nFiled herewith.\n101.CAL*\nXBRL Taxonomy Extension Calculation Linkbase Document\nFiled herewith.\n101.LAB*\nXBRL Taxonomy Extension Labels Linkbase Document\nFiled herewith.\n101.PRE*\nXBRL Taxonomy Extension Presentation Linkbase Document\nFiled herewith.\n101.DEF*\nXBRL Taxonomy Extension Definition Linkbase Document\nFiled herewith.\n*Pursuant to Regulation S-T, this interactive data file is deemed not filed or part of a registration statement or prospectus for purposes of Sections 11 or 12 of the Securities Act of 1933, is deemed not filed for purposes of Section 18 of the Securities Exchange Act of 1934, and otherwise is not subject to liability under these sections.\nSIGNATURES\nPursuant to the requirements of the Securities Exchange Act of 1934, the registrant caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nAPPLIFE DIGITAL SOLUTIONS, INC.\nDated: October 2, 2023\n/s/ Matt Reid\nMatt Reid, Principal Executive Officer,\nPrincipal Accounting Officer and Director\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated.\nName\nTitle\nDate\n/s/ Matt Reid\nPrincipal Executive Officer, Principal Financial Officer, and Director\nOctober 2, 2023\nMatt Reid        ITEM 10. Directors, Executive Officers and Corporate Governance\nDirectors and Executive Officers\nSet forth below are the names, ages and positions of our current directors and executive officers. Unless otherwise indicated, the address of each person listed is c/o APPlife Digital Solutions, Inc. 50 California St., Suite 1500, San Francisco, CA 94111.\nName and Address\nAge\nPosition\nMatthew Reid\nCEO, CFO, President, Secretary and Director\nDon Savant\nDirector\nTracy Gray\nDirector\nSid Ganis\nDirector\nRichard Walden\nDirector\nMatthew Reid, 49, CEO, CFO, President, Secretary and Director. Matthew Reid is an experienced founder who has worked in the venture capital and private equity industry for the past 15 years where he has focused on sales, management, marketing and business development. He has owned and operated several successful businesses ranging from a commercial real estate mortgage company to a media investment group. During the last five years Mr. Reid has been working for himself developing apps and projects that eventually lead to the creation of the Company and has not worked at any other companies. Mr. Reid holds a Bachelor of Arts degree from New York University.\nDon Savant, 57, Director. Don Savant was the President of Global Sales IMAX Corp. for three years starting in January 2016. Savant was a Managing Director at Asia Pacific IMAX Corp. for fifteen years before becoming President of Sales, Development and Film Distribution for IMAX China for four years starting in June 2011.\nTracy Gray, 56, Director. Tracy Gray is a former Systems Engineer on the Space Shuttle program. Gray also worked in the Office of the Mayor of Los Angeles and was a Managing Director of The 22 Fund. Gray has been a member of the Board of Directors of Exergy Systems and Isidore Recycling which was acquired by Homeboy Recycling.\nSid Ganis, 80, Director. Sid Ganis is the founder of Out of the Blue Entertainment and former President of Paramount Pictures. Ganis was Chairman of Columbia Tristar and President of the Academy of Motion Picture Arts and Sciences. Ganis is currently a member of the Board of Directors of Academy of Motion Picture Arts and Sciences and Immersion Corp IMMR. Ganis has previously been a member of the Board of Directors of Marvel Entertainments and The Void.\nRichard Walden, 74, Director. Mr. Walden is currently President, CEO and Founder of Operation USA, a Los Angeles-based non-governmental organization specializing in disaster relief as well as international and domestic health care and economic development projects. Walden guided Operation USA to share the 1997 Nobel Peace Prize Walden also coordinated Operation USAs work with UNESCO, NASAs Jet Propulsion Laboratory, and with the Lawrence Livermore and Los Alamos National Laboratories. Richard is also an active California-licensed attorney and, earlier in his career, served as Commissioner of the California Health Facilities Commission.\nBoard Composition\nOur By-Laws provide that the Board of Directors which shall constitute the whole board shall not be less than one (1) nor more than seven (7) or such other maximum number of directors as permitted by the Nevada General Corporation Law. The maximum or minimum number of directors cannot be changed, nor can a fixed number be substituted for the maximum and minimum numbers, except by a duly adopted amendment to the articles of incorporation or by an amendment to this bylaw.\nNo Committees of the Board of Directors; No Financial Expert\nWe do not presently have a separately constituted audit committee, compensation committee, nominating committee, executive committee or any other committees of our Board of Directors. Nor do we have an audit committee or financial expert. Management has decided not to establish an audit committee at present because our limited resources and limited operating activities do not warrant the formation of an audit committee or the expense of doing so. As such, our entire Board of Directors acts as our audit committee. We do not have a financial expert serving on the Board of Directors or employed as an officer based on managements belief that the cost of obtaining the services of a person who meets the criteria for a financial expert under Section 407 of the Sarbanes-Oxley Act of 2002 and Item 407(d) of Regulation S-K is beyond our limited financial resources and the financial skills of such an expert are simply not required or necessary for us to maintain effective internal controls and procedures for financial reporting in light of the limited scope and simplicity of accounting issues raised in our financial statements at this stage of our development.\nAuditors\nOur principal registered independent auditor is RBSM LLP\nCode of Ethics\nThe Company does not have a written code of ethics that applies to the Companys officers.\nPotential Conflicts of Interest\nSince we do not have an audit or compensation committee comprised of independent directors, the functions that would have been performed by such committees are performed by our directors. Thus, there is a potential conflict of interest in that our directors and officers have the authority to determine issues concerning management compensation and audit issues that may affect management decisions. We are not aware of any other conflicts of interest with any of our executives or directors.\nDirector Independence\nOur board of directors has undertaken a review of the independence of each director and considered whether any director has a material relationship with us that could compromise his ability to exercise independent judgment in carrying out his responsibilities. As a result of this review, our board of directors determined that Don Savant, Tracy Gray and Sid Ganis are independent directors.\nInvolvement in Legal Proceedings\nNone of our officers or directors has filed a personal bankruptcy petition, had a bankruptcy petition filed against any business of which they were a general partner or officer at the time of bankruptcy or within two years prior to that time, or has been convicted of or been the subject of any criminal proceedings or the subject of any order, judgment or decree involving the violation of any state or federal securities laws within the past ten (10) years.\nCompliance with Section 16(a) Of the Exchange Act\nSection 16(a) of that act requires our executive officers and directors, and persons who beneficially own more than 10% of a registered class of our equity securities to file with the Securities and Exchange Commission initial statements of beneficial ownership, reports of changes in ownership and annual reports concerning their ownership of our common shares and other equity securities, on Forms 3, 4 and 5 respectively. Executive officers, directors and greater than 10% shareholders are required by the Securities and Exchange Commission regulations to furnish us with copies of all Section 16(a) reports they file. ITEM 11. Executive Compensation\nSummary Compensation\nOur sole officer and director does not currently take any formal salary for his services to the Company. He was issued 12,239,209 founders shares at inception, and on September 27, 2018, he was issued 90,000,000 shares for his services to be rendered over the next four years.\nOutstanding Equity Awards\nOur directors and officers do not have unexercised options, stock that has not vested, or equity incentive plan awards.\nCompensation of Directors\nOur directors do not receive compensation for their services as directors.\nEmployment Contracts, Termination of Employment, Change-in-Control Arrangements\nThere are no formal employment contracts, or other contracts with our officers or directors. There are no compensation plans or arrangements, including payments to be made by us, with respect to our officers, directors or consultants that would result from the resignation, retirement or any other termination of such directors, officers or consultants from us. There are no arrangements for directors, officers, employees or consultants that would result from a change-in-control. ITEM 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nSecurity Ownership of Certain Beneficial Owners\nThe following table lists, as of October 2, 2023, the number of shares of common stock of our Company that are beneficially owned by (i) each person or entity known to our Company to be the beneficial owner of more than 5% of the outstanding common stock; (ii) each officer and director of our Company; and (iii) all officers and directors as a group. Information relating to beneficial ownership of common stock by our principal shareholders and management is based upon information furnished by each person using beneficial ownership concepts under the rules of the Securities and Exchange Commission. Under these rules, a person is deemed to be a beneficial owner of a security if that person has or shares voting power, which includes the power to vote or direct the voting of the security, or investment power, which includes the power to vote or direct the voting of the security. The person is also deemed to be a beneficial owner of any security of which that person has a right to acquire beneficial ownership within 60 days. Under the Securities and Exchange Commission rules, more than one person may be deemed to be a beneficial owner of the same securities, and a person may be deemed to be a beneficial owner of securities as to which he or she may not have any pecuniary beneficial interest. Except as noted below, each person has sole voting and investment power.\nThe percentages below are calculated based on 150,543,635 shares of our common stock issued and outstanding as of October 2, 2023. Unless otherwise indicated, the address of each officer and director listed below is c/o APPlife Digital Solutions, Inc., 50 California St, #1500, San Francisco, CA 94111.\nName of Beneficial Owner\nTitle of Class\nAmount and Nature of Beneficial Ownership\nPercent of Class\nMatt Reid, Sole Officer and Director\nCommon\n102,239,109 Shares\n67.91%\nDon Savant, Director\nCommon\n381,579\n0.25%\nTracy Gray, Director\nCommon\n381,579\n0.25%\nSid Ganis, Director\nCommon\n375,000\n0.25%\nAll Officers and Directors\nCommon\n103,377,267 Shares\n68.67%\nStephen Solarsh\nCommon\n11,900,327 Shares\n7.90%\nRELATED PARTY TRANSACTIONS\nDue to Officer\nDuring the year ending June 30, 2023, the Company received advances from its officer to pay for certain operating expenses. The balance due to the officer at June 30, 2023 and 2022 was $1,000 and $0, respectively. There are no definitive repayment terms and no interest is accruing on these advances. ITEM 13. Certain Relationships and Related Transactions, and Director Independence\nDirector Independence\nOur securities are not listed on a national securities exchange or on any inter-dealer quotation system which has a requirement that a majority of directors be independent. Our board of directors has undertaken a review of the independence of each director by the standards for director independence set forth in the NASDAQ Marketplace Rules. Under these rules, an independent director is one who is not an executive officer or an employee of the company and who does not have a relationship that, in the opinion of the board of directors, would interfere with exercising independent judgment in carrying out a directors responsibilities. Our board of directors has determined that three of our directors qualify as independent directors. ITEM 14. Principal Accountant Fees and Services\nAudit Fees\nThe Company engaged RBSM LLP (RBSM) as our independent registered public accounting firm since April 15, 2019. The audit fees to RBSM for the year ended June 30, 2023 and 2022 were approximately $30,000 and $25,000, respectively.\nAudit-Related Fees\nThe aggregate fees billed in each of the last three fiscal quarters for assurance and related services by RBSM that are reasonably related to the performance of the audit or review of our consolidated financial statements including our quarterly interim reviews on Form 10-Q amounted to $18,000 each quarter.\nTax Fees\nRBSM did not charge us any tax fees for the year ended June 30, 2023 and 2022, respectively.\nAll Other Fees\nRBSM billed $5,000 during the year ended June 30, 2023 for their procedures related to issuance of consent and S-1 filing.\nPART IV ITEM 15. Exhibits, Financial Statement Schedules.\nExhibits\nSee the Exhibit Index following the signature page of this Registration Statement, which Exhibit Index is incorporated herein by reference.\nExhibit Number\nDescription of Exhibit\nFiling\n31.1\nCertification of Principal Executive Officer Pursuant to Rule 13a-14\nFiled herewith.\n31.2\nCertification of Principal Financial Officer Pursuant to Rule 13a-14\nFiled herewith.\n32.1\nCEO Certification Pursuant to Section 906 of the Sarbanes-Oxley Act\nFiled herewith.\n101.INS*\nXBRL Instance Document\nFiled herewith.\n101.SCH*\nXBRL Taxonomy Extension Schema Document\nFiled herewith.\n101.CAL*\nXBRL Taxonomy Extension Calculation Linkbase Document\nFiled herewith.\n101.LAB*\nXBRL Taxonomy Extension Labels Linkbase Document\nFiled herewith.\n101.PRE*\nXBRL Taxonomy Extension Presentation Linkbase Document\nFiled herewith.\n101.DEF*\nXBRL Taxonomy Extension Definition Linkbase Document\nFiled herewith.\n*Pursuant to Regulation S-T, this interactive data file is deemed not filed or part of a registration statement or prospectus for purposes of Sections 11 or 12 of the Securities Act of 1933, is deemed not filed for purposes of Section 18 of the Securities Exchange Act of 1934, and otherwise is not subject to liability under these sections.\nSIGNATURES\nPursuant to the requirements of the Securities Exchange Act of 1934, the registrant caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nAPPLIFE DIGITAL SOLUTIONS, INC.\nDated: October 2, 2023\n/s/ Matt Reid\nMatt Reid, Principal Executive Officer,\nPrincipal Accounting Officer and Director\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated.\nName\nTitle\nDate\n/s/ Matt Reid\nPrincipal Executive Officer, Principal Financial Officer, and Director\nOctober 2, 2023\nMatt Reid"
}