{
    "cik": "1763925",
    "company": "CoJax Oil & Gas Corp",
    "filing_type": "10-K",
    "filing_date": "2023-11-20",
    "period_of_report": "2022-12-31",
    "sic": "1311",
    "state_of_inc": "VA",
    "state_location": "VA",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1763925/0001763925-23-000006-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1763925/000176392523000006/cojax_2022_10k_11-17-23.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1763925/0001763925-23-000006.txt",
    "filename": "1763925_10K_2022_0001763925-23-000006.htm",
    "content": "ITEM 1. BUSINESS\nWe are an early-stage development oil and gas company seeking to become an independent energy company focused on the acquisition and subsequent exploitation and development of crude oil in the Gulf States Drill Region, including acquisition of hydrocarbon revenues and underlying oil and gas exploration and production rights. We believe that we can establish a profitable niche in crude oil production due to the quality of the light sweet crude oil produced from the Gulf States Region, which is cheaper to refine than crude oil from other regions of the U.S. and Canada.\nThe Company was incorporated in the Commonwealth of Virginia on November 13, 2017, and started its operations on November 17, 2020, upon an acquisition (the Barrister Acquisition) of all outstanding capital of Barrister, including all of Barristers crude oil and natural gas exploration and production leases and rights owned or controlled by Barrister. In consideration for the Barrister Acquisition, the Company issued 3,650,000 shares of the Companys common stock, $0.01 par value per share (the Common Stock) to the members of Barrister and the assumption of Barristers debt obligations to Central Operating, LLC (COP) in principal amount of $2,700,000 (the Assumed Debt) under the Purchase and Sale Agreement and the related secured promissory note (the Note), each dated as of June 1, 2019. On November 16, 2021, the Company and COP entered into a debt exchange agreement (the Debt Exchange Agreement), pursuant to which, COP fully discharged the Company from the obligation to repay the Assumed Debt in exchange for the issuance of 1,350,000 shares of Common Stock to COP. Currently we are producing very limited crude oil production from limited oil drilling operations as a result of the Barrister Acquisition. It is insufficient to cover our operating expenses or to fund establishing new oil drilling rigs or increased drilling.\nRecent Developments\nOn September 27, 2022, the Company dismissed Haynie & Company PC (Haynie) as the independent registered public accounting firm engaged to audit the Companys financial statements. Haynie had served as the Companys independent auditor since January 2019. Haynies dismissal was approved by the Companys board of directors as of such date. Effective as of September 30, 2022, the Company engaged Sadler, Gibb & Associates, LLC (Sadler Gibb), as the Companys independent registered public accounting firm, to audit the Companys financial statements for the fiscal year ending December 31, 2022, in accordance with the U.S. federal securities laws and the applicable SEC rules and regulations and the Public Company Accounting Oversight Board (PCAOB).\nOn November 8, 2022, the Company, through Barrister, its wholly-owned subsidiary, acquired from Taxodium Energy, LLC, a Mississippi limited liability company (Taxodium), 100% ownership, right, title and interest in certain properties located in Mississippi and Alabama, including all oil and gas leases, interests, royalties, overriding royalties, subleases, fee estates, net profits interest, and carried interests (collectively NONOP Assets) pursuant to the Assignment, Bill of Sale and Conveyance, dated October 31, 2022, executed by Taxodium (the NONOP Assignment). In consideration of the acquisition of NONOP Assets, the Company issued 1,600,000 shares of the Companys Common Stock to all members of Taxodium in proportion to their interest in Taxodium. This transaction became effective on October 1, 2022, for accounting purposes, based on when the Company obtained control of the acquired assets. A copy of the NONOP Assignment is attached to this Annual Report as Exhibit 10.2.\nOn December 2, 2022, the Company, through Barrister, acquired from Taxodium a 100% ownership, right, title and interests in additional properties located in Mississippi, including certain wells, facilities, the oil gas and mineral leases, together with all surface and subsurface and all operating rights, working interest, and net revenue interest arising out such leases and rights (collectively Buckley Assets) pursuant to the to the Assignment, Bill of Sale and Conveyance, dated December 2, 2022, executed by Taxodium and Barrister (the Buckley Assignment). In consideration of the acquisition of Buckley Assets, the Company issued to members of Taxodium an aggregate of 1,500,000 shares of its Common Stock, valued at $2.00 per share, in proportion of their ownership interest in Taxodium. The Buckley Assignment became effective on October 15, 2022, for accounting purposes, based on when\nthe Company obtained control of the acquired assets. A copy of the Buckley Assignment is attached to this Annual Report as Exhibit 10.3.\nWhile the Company acquired these new properties, including drilling wells, currently, these wells have very limited productions, not sufficient to for the Company to become profitable.\nOur Growth Strategy\nThe Company is seeking underexploited oil leases and rights in the Gulf States Drilling Region with reserve reports and one or more drilling rigs, even if exploratory or not deep drilling rigs, which taken together indicate that the oil leases and rights have potential, substantial oil production capability - substantial for a small independent oil production company. Our long-term goal is to create shareholder value by identifying and assembling a portfolio of low-risk assets with attractive economic profiles. Our ability to implement our business plan is subject, in part, on our ability to timely raise adequate and affordable funding from investors or lenders for establishing deep drilling rigs. Our first acquisition was Barrister, followed by the acquisition of NONOP Assets and Buckley Assets in the fourth quarter of 2022. Now we need to raise sufficient working capital to establish deep drilling rigs in these acquired oil and gas leases and rights.\nGenerally, the oil fields in the southern part of the Gulf States Drilling Region are less expensive to drill due to the nature of rock strata and the depth of the oil reserves. The Company will seek acquisitions that can be obtained for stock or other securities or under an earn-out arrangement and prefers acquiring companies that hold oil leases and rights rather than acquiring individual oil leases and rights, preferable the targets with several oil leases and rights as opposed to acquiring individual oil leases and rights. The acquisition of a company has the perceived advantages of acquiring several oil leases and rights and existing drilling operations with in-place management in a single transaction along with possibly reduced due diligence costs and more expeditious closing of the transaction.\nOur teaming approach is also designed to facilitate rapid growth by bringing necessary expertise into operations from available contractors. Our ability to realize profitability from oil production also depends on the success of deep drill wells, engaging necessary operations expertise, and market price for crude oil remaining at attractive per-barrel levels, which we believe is $60 or more per barrel. If we have adequate funding and/or sufficient cash flow, then we may seek to drill for oil in other assignee or leasehold interests or, alternatively, in oil and gas assignee or leasehold interests or properties owned by our potential affiliates or teaming partners. Through established networks of contacts, the Company markets its crude oil production, whether current or future, on a month-to-month basis.\nIf the production of oil increases from the properties in which the Company obtain its oil rights, the Company will have to expand the marketing efforts by engaging a person or firm to seek out new customers for the oil production in case the current customer base is unable or unwilling to purchase increased oil production. The cost means and extent of any enhanced future marketing effort will depend on the amount of increased oil production, the then-current market for oil, and the potential customer base for the oil production. If the existing customer base will not purchase increased oil production, then the engagement of a dedicated marketing person who engages in direct marketing, by telephone and internet, of potential customers for oil production may be required for the sale of any future increase of oil production.\nCompetitive Strengths\nUse of Contractors\nThe Company utilizes experienced contractors, including former members of Barrister, with significant prior experience in oil and gas production in the Gulf States Drilling Region in the initial phases of implementing the business plan. The Company believes that the use of these contractors is the most efficient and cost-effective means of operations for a small independent oil and gas production company and is designed to allow the Company to use\nexperienced oil drilling and production personnel without the high overhead costs of hiring personnel as employees of the Company. Currently, we engage COP and Taxodium as our contractors to operate the limited oil and gas production drilling and storage operations for the Company Oil Rights and to manage the Companys drilling operations. They have extensive experience with operations and administration in an independent oil and gas production company and rely on contract operators to provide experienced personnel to handle all essential crude oil production on a day-to-day basis for the Company. With adequate funding, the Company intends to employ this teaming model strategy to help attract and retain experienced oil industry engineering and production personnel to identify drill sites and then efficiently operate those wells to produce oil at an above-average industry rate of efficiency in the Gulf States region.\nCompetition\nThe Company competes with many large, medium, and small-sized competitors in the Gulf States Drilling Region (including off-shore drilling in the Gulf of Mexico) and adjacent areas which have extensive operational histories, experienced oil and gas industry management, established market share, profitable operations, and extensive potential oil and gas fields or leases to exploit and the cash or funding resources to explore new oil and gas fields as well as acquire mature fields. [There is also an established oil and gas production industry in northern Alaska and in North Dakota and western Canada (where fracking has made available significant oil and gas reserves in shale formations).\nThe Company has a very limited history of its business operation and is not able to match the resources, whether financial, technical, manpower, size of proven crude oil reserves, and distribution channels, of its competition in the Gulf States Drilling Region or elsewhere. The Companys current oil production is not sufficient to concern or attract the attention of competitors, which allows Barrister to operate as a small provider of oil without competitive pressures. If we significantly increase oil production, we will face increasing competition from other small independent oil producers selling limited amounts of oil. Any increase in competitive pressures will require investment in a full-time marketing effort by the Company.\nCompany Oil Rights\nDescription of Barrister Oil Properties and Oil Production Operations. The Companys current oil and gas assets consist primarily of non-operated interest. However, production from these assets has significantly improved the Companys operating ability.\nAs shown in the tables below, production has significantly improved due to the asset acquisitions in Q4. However, the Company will not be able to increase production until sufficient financial resources are obtained through potential debt and equity financing. Additionally, the Company may need to impair some of these assets if production cannot be restored.\nThe Smackover Trend. The Smackover trend is a belt of carbonate, evaporite, and clastic rocks of the Late Jurassic age that rims the Gulf Coast of the United States from Texas, up to Arkansas, throughout Louisiana, Mississippi, Southwest Alabama, and all the way to the Florida panhandle. Stratigraphic and geochemical data indicate that the oil and gas were generated from algae-rich lime mudstones. It was named after the Smackover oil field, which was discovered in Union County, Arkansas, in 1937.\nCurrent Barrister Energy Properties. We own interests in 32 wells as of the end of 2022. In Q4 2022, we acquired interest in 29 of those wells.\nThe annual net production of wells for the fiscal years 2020, 2021, and 2022 are summarized in the table below, with the 29 acquisition wells shown only in the 2022 total.\nCONSOLIDATED PRODUCTION\nYear\nTotal Oil Produced (bbl)\nTotal Gas Produced (mcf)\n-\n-\n4,132\n4,106\nTOTAL\n4,442\n4,106\nOil and Gas Production, Production Prices, and Production Costs\nOil and Gas Production\nThe table below summarizes production by final product sold and by geographic area for the last four years.\n(Net barrels of oil produced at year-end)\nCrude oil and natural gas liquids production\nCrude Oil\nNGL\nCrude Oil\nNGL\nCrude Oil\nNGL\nCrude Oil\nNGL\nConsolidated Subsidiaries\nUnited States\n4,132\n-\n-\n-\n1,397\n-\nTotal Consolidated Subsidiaries\n4,132\n-\n-\n-\n1,397\n-\nTotal crude oil & natural gas liquids production\nBitumen production\nConsolidated Subsidiaries\nUnited States\n-\n-\n-\n-\n-\n-\n-\n-\nSynthetic oil production\nConsolidated Subsidiaries\nUnited States\n-\n-\n-\n-\n-\n-\n-\n-\nTotal liquids production\n-\n-\n-\n-\n-\n-\n-\n-\nNatural gas production available for sale\nConsolidated Subsidiaries\nUnited States\n4,106\n-\n-\n-\n-\n-\n-\n-\nTotal Consolidated Subsidiaries\n4,106\n-\n-\n-\n-\n-\n-\nTotal natural gas production available for sale\n4,106\n-\n-\n-\n-\n-\n-\n-\n(thousands of oil-equivalent barrels at year-end)\nOil-equivalent production\n-\n-\n-\n-\n-\n-\n-\n-\nProduction Prices and Production Costs. The table below summarizes average production prices and average production costs by geographic area and by product type for the last three years.\nUnited States\nTotal\nDuring 2022\nConsolidated Subsidiaries\nAverage production prices\nCrude oil, per barrel\n88.85\n88.85\nNGL, per barrel\n-\n-\nNatural gas, per thousand cubic feet\n7.60\n7.60\nBitumen, per barrel\n-\n-\nSynthetic oil, per barrel\n-\n-\nAverage production costs, per oil-equivalent barrel - total\n4.77\n4.77\nAverage production costs, per barrel - bitumen\n-\n-\nAverage production costs, per barrel - synthetic oil\n-\n-\nDuring 2021\nConsolidated Subsidiaries\nAverage production prices\nCrude oil, per barrel\n64.25\n64.25\nNGL, per barrel\n-\n-\nNatural gas, per thousand cubic feet\n-\n-\nBitumen, per barrel\n-\n-\nSynthetic oil, per barrel\n-\n-\nAverage production costs, per oil-equivalent barrel - total\n251.32\n251.32\nAverage production costs, per barrel - bitumen\n-\n-\nAverage production costs, per barrel - synthetic oil\n-\n-\nDuring 2020\nConsolidated Subsidiaries\nAverage production prices\nCrude oil, per barrel\n58.88\n58.88\nNGL, per barrel\n-\n-\nNatural gas, per thousand cubic feet\n-\n-\nBitumen, per barrel\n-\n-\nSynthetic oil, per barrel\n-\n-\nAverage production costs, per oil-equivalent barrel - total\n32.13\n32.13\nAverage production costs, per barrel - bitumen\n-\n-\nAverage production costs, per barrel - synthetic oil\n-\n-\nAverage production prices have been calculated by using sales quantities from Barristers production as the divisor. Average production costs have been computed by using net production quantities for the\ndivisor. The volumes of crude oil and natural gas liquids (NGL) production used for this computation are shown in the oil and gas production table. The volumes of natural gas used in the calculation are the production volumes of natural gas available for sale and are also shown. Gas is converted to an oil-equivalent basis at six million cubic feet per one thousand barrels.\nOil and Gas Properties, Wells, Operations, and Acreage\nGross and Net Productive Wells\nYear-End 2022\nYear-End 2021\nYear-End 2020\nOil\nGas\nOil\nGas\nOil\nGas\nGross\nNet\nGross\nNet\nGross\nNet\nGross\nNet\nGross\nNet\nGross\nNet\nGross and Net Productive Wells\nConsolidated Subsidiaries\nUnited States\n-\n-\n3.0\n1.8\n-\n-\n3.0\n1.8\n-\n-\nTotal Consolidated Subsidiaries\n-\n-\n3.0\n1.8\n-\n-\n3.0\n1.8\n-\n-\nTotal gross and net productive wells\n-\n-\n3.0\n1.8\n-\n-\n3.0\n1.8\n-\n-\nThere were 32 gross, and 7 net wells as of December 31, 2022.\nGross and Net Developed Acreage\nYear-End 2022\nYear-End 2021\nYear-End 2020\nGross\nNet\nGross\nNet\nGross\nNet\n(acres)\nGross and Net Developed Acreage\nConsolidated Subsidiaries\nUnited States\n6,208\nTotal Consolidated Subsidiaries\n6,208\nTotal gross and net developed acreage\n6,208\nSeparate acreage data for oil and gas are not maintained because, in many instances, both are produced from the same acreage.\nGross and Net Undeveloped Acreage\nYear-End 2022\nYear-End 2021\nYear-End 2020\nGross\nNet\nGross\nNet\nGross\nNet\n(acres)\nGross and Net Undeveloped Acreage\nConsolidated Subsidiaries\nUnited States\n2,600\n2,992\n2,244\nTotal Consolidated Subsidiaries\n2,600\n2,992\n2,244\nTotal gross and net undeveloped acreage\n2,600\n2,992\n2,244\nSeparate acreage data for oil and gas are not maintained because, in many instances, both are produced from the same acreage.\nOur investment in developed and undeveloped acreage is comprised of numerous leases. The List of Leases is included as Exhibit 99.2 to this Annual Report. The terms and conditions under which the Company maintains exploration and production rights to the acreage are property-specific, contractually defined, and vary significantly from property to property. Work programs are designed to ensure that the exploration potential of any property is thoroughly evaluated before expiration. In some instances, we may elect to relinquish acreage in advance of the contractual expiration date if the evaluation process is complete and there is not a business basis for the extension. In cases where additional time may be required to evaluate acreage fully, the Company has generally been successful in obtaining extensions. The scheduled expiration of leases and concessions for undeveloped acreage over the next three years is not expected to have a material adverse effect on the Company.\nGovernment Regulation\nOil and natural gas operations such as ours are subject to various types of legislation, regulation, and other legal requirements enacted by governmental authorities. This legislation and regulation affecting the oil and natural gas industry are under constant review for amendment or expansion. Some of these requirements carry substantial penalties for failure to comply. The regulatory burden on the oil and natural gas industry increases our cost of doing business and, consequently, can affect our profitability.\nRegulation of Drilling and Production\nThe production of oil and natural gas is subject to regulation under a wide range of local, state, and federal statutes, rules, orders, and regulations. Federal, state, and local statutes and regulations require permits for drilling operations, drilling bonds, and reports concerning operations. The trend in oil and natural gas regulation has been to increase regulatory restrictions and limitations on such activities. Any changes in, or more stringent enforcement of, these laws and regulations may result in delays or restrictions in permitting or development of projects or more stringent or costly construction, drilling, water management or completion activities or waste handling, storage, transport, remediation, or disposal emission or discharge requirements which could have a material adverse effect on the Company. For example, on January 20, 2021, the Biden Administration placed a 60-day moratorium on new oil and gas leasing and drilling permits on federal land, and on January 27, 2021, the Department of Interior, acting pursuant to a Presidential Executive Order suspended the federal oil and gas leasing program indefinitely. President Biden also announced that his administration would continue to pause all offshore and onshore leasing pending a full review of the federal leasing and permitting program. In response to a challenge filed by Louisiana and other states, a federal court in the Western District of Louisiana issued a preliminary injunction blocking the Biden administrations leasing moratorium. The Biden administration appealed this decision but has continued to hold lease sales pending appeal. While we do not have a significant federal land acreage position at 240 net acres, these actions could have a material adverse effect on the Company and our industry.\nCurrently, all our properties and operations are in Alabama, which has regulations governing conservation matters, such as the unitization or pooling of oil and natural gas properties, the establishment of maximum allowable rates of production from oil and natural gas wells, the regulation of well spacing, and plugging and abandonment of wells. The effect of these regulations is to limit the amount of oil and natural gas that we can produce from our wells and to limit the number of wells or the locations at which we can drill, although we can apply for exceptions to such regulations or to have reductions in well spacing. Moreover, Alabama imposes a production or severance tax with respect to the production and\nsale of oil, natural gas, and natural gas liquids within their jurisdictions. Failure to comply with these rules and regulations can result in substantial penalties. Our competitors in the oil and natural gas industry are subject to the same regulatory requirements and restrictions that affect our operations.\nRegulation of Transportation of Oil\nSales of crude oil, condensate, and natural gas liquids are not currently regulated and are made at negotiated prices; however, Congress could reenact price controls in the future.\nOur sales of crude oil are affected by the availability, terms, and cost of transportation. The transportation of oil in common carrier pipelines is also subject to rate regulation. The Federal Energy Regulatory Commission, or the FERC, regulates interstate oil pipeline transportation rates under the Interstate Commerce Act. Intrastate oil pipeline transportation rates are subject to regulation by state regulatory commissions. The basis for intrastate oil pipeline regulation, and the degree of regulatory oversight and scrutiny given to intrastate oil pipeline rates, varies from state to state. Insofar as effective interstate and intrastate rates are equally applicable to all comparable shippers, we believe that the regulation of oil transportation rates will not affect our operations in any way that is of material difference from those of our competitors. Further, interstate and intrastate common carrier oil pipelines must provide service on a non-discriminatory basis. Under this open access standard, common carriers must offer service to all shippers requesting service on the same terms and under the same rates. When oil pipelines operate at full capacity, access is governed by pro-rationing provisions set forth in the pipelines published tariffs. Accordingly, we believe that access to oil pipeline transportation services generally will be available to us to the same extent as to our competitors.\nRegulation of Transportation and Sale of Natural Gas\nHistorically, the transportation and sale for resale of natural gas in interstate commerce have been regulated pursuant to the Natural Gas Act of 1938, the Natural Gas Policy Act of 1978, and regulations issued under those Acts by the FERC. In the past, the federal government has regulated the prices at which natural gas could be sold. While sales by producers of natural gas can currently be made at uncontrolled market prices, Congress could reenact price controls in the future.\nSince 1985, the FERC has endeavored to make natural gas transportation more accessible to natural gas buyers and sellers on an open and non-discriminatory basis. The FERC has stated that open access policies are necessary to improve the competitive structure of the interstate natural gas pipeline industry and to create a regulatory framework that will put natural gas sellers into more direct contractual relations with natural gas buyers by, among other things, unbundling the sale of natural gas from the sale of transportation and storage services. Although the FERCs orders do not directly regulate natural gas producers, they are intended to foster increased competition within all phases of the natural gas industry. We cannot accurately predict whether the FERCs actions will achieve the goal of increasing competition in markets in which our natural gas is sold. Therefore, we cannot provide any assurance that the less stringent regulatory approach established by the FERC will continue. However, we do not believe that any action taken will affect us in a way that materially differs from the way it affects other natural gas producers.\nIntrastate natural gas transportation is subject to regulation by state regulatory agencies. The basis for intrastate regulation of natural gas transportation and the degree of regulatory oversight and scrutiny\ngiven to intrastate natural gas pipeline rates and services varies from state to state. Insofar as such regulation within a particular state will generally affect all intrastate natural gas shippers within the state on a comparable basis, we believe that the regulation of similarly situated intrastate natural gas transportation in any states in which we operate and ship natural gas on an intrastate basis will not affect our operations in any way that is of material difference from those of our competitors.\nPrincipal Executive Offices\nOur principal executive office is located at 3033 Wilson Boulevard, Suite E-605, Arlington, Virginia 22201, in Arlington County outside of Washington, D.C., and our telephone number is (703) 479-8538. We rent our principal executive offices under a month-to-month lease for a monthly rental of $50. The Company website is www.cojaxoilandgas.com.\nEmployees\nWe have two full-time employees: Jeffrey J. Guzy, our Chief Executive Officer, and a director, and Wm. Barrett Wellman, our Chief Financial Officer. The officers devote the number of hours necessary to perform their duties, and each officer, in his sole discretion, determines the extent of the time commitment. ITEM 1A. RISK FACTORS\nRISK FACTORS\nAn investment in our common stock involves a high degree of risk. You should carefully consider the risks and uncertainties described below before making a decision to invest in our common stock. The risks and uncertainties discussed below are not the only ones we face. Risks could also harm our business, operating results, financial condition, or prospects, and uncertainties not currently known to us or that we currently do not believe are material, and these risks and uncertainties could result in a complete loss of your investment. Prior to the Barrister Acquisition, we did not have revenue-generating operations that will fund our operating overhead. While we began to generate revenue following the Barrister Acquisition, our business, operating results, financial condition, or prospects could be materially and adversely affected by any of these risks and uncertainties. In assessing the risks and uncertainties described below, you should also refer to the other information contained herein, including our consolidated financial statements, pro forma financial statements, and the related notes thereto.\nRISKS RELATED TO OUR BUSINESS\nRisks Related to the Oil & Natural Gas Industry\nOil and natural gas prices are volatile, and any sustained decline in oil market prices could adversely affect the Companys business, financial condition, results of operations, and its ability to meet capital expenditure obligations and financial commitments.\nOur success is highly dependent on prices for oil and natural gas, which have in recent years been, and we expect will continue to be, extremely volatile. Oil is a commodity, and its price may fluctuate widely in response to relatively minor changes in the supply of and demand for oil and market uncertainty. Historically, oil prices have been volatile due to sensitivity to political and economic developments or crises. The prices we receive for oil production, and the levels of oil production, depend on numerous factors beyond our control, which include worldwide and regional economic conditions affecting the global supply and demand for oil, such as:\n·levels of production, domestic and worldwide inventories;\n·the capacity of U.S. and international refiners to use U.S. supplies of oil, natural gas and NGLs\n·the price and quantity of foreign imports of oil and their effect on U.S. oil producers;\n·relative price and availability of alternative forms of energy;\n·political and economic conditions in or affecting other oil-producing regions or countries, including the Middle East, Africa, South America, current invasion of Ukraine by Russia, which significantly affects global oil market price\n·actions of the OPEC, its members, and other state-controlled oil companies relating to oil price and production controls, especially production disputes between Saudi Arabia and Russia, who often have different goals\n·the level of global exploration, development, and production of oil\n·the proximity, capacity, cost, and availability of oil gathering and transportation facilities; ·\n·localized and global oil supply and demand fundamentals and transportation availability\n·the cost of exploring for, developing, producing, and transporting oil which cost may go up due to oil storage surpluses created by COVID-19 pandemic\n·weather conditions and other natural disasters, and storms in the Gulf States Drilling Region appear to increase in intensity due to global warming and in the past five years\n·technological advances affecting oil consumption, especially the growing production of electric-powered cars, trucks, and buses\n·the price and availability and consumer demand for alternative fuels to oil and reduction in the use of products that are made from oil, especially certain plastics, which demand is fueled by environmental concerns\n·climate control legislation that increases the cost and lowers the demand for oil by providing incentives and tax benefits for use of non-oil fuels, and\n·effect of existing U.S. federal, state, and local, and non-U.S. governmental regulation and taxes.\nThese factors make it extremely difficult to predict future oil, natural gas and NGLs price movements with any certainty. During the three years ended December 31, 2022, NYMEX WTI prices ranged from a high of $123.64 per barrel on March 8, 2022 to a low of -$36.98 per barrel on April 20, 2020, and NYMEX Henry Hub prices ranged from a high of $23.86 per MMBtu on February 17, 2021 to a low of $1.33 per MMBtu on September 21, 2020. Prices were particularly volatile in 2020 and 2021, with five-year highs occurring in 2021 and five-year lows occurring in 2020, as a result of multiple significant factors impacting supply and demand in the global oil and natural gas markets, including those relating to the COVID-19 global pandemic. We make price assumptions that are used for planning purposes, and a significant portion of our cash outlays, are largely fixed in nature. Accordingly, if commodity prices are below the expectations on which these commitments were based, our financial results are likely to be adversely and disproportionately affected because these cash outlays are not variable in the short term and cannot be quickly reduced to respond to unanticipated decreases in commodity prices. Specifically, prices of oil, and NGLs may adversely affect our revenues, cash flows, earnings and returns; our ability to attract capital to finance our operations and the cost of the capital; the profit or loss we incur in exploring for and developing our reserves; and the value of our oil and natural gas properties.\nA substantial or extended decline in commodity prices may also reduce the amount of oil and natural gas that we can produce economically and cause a significant portion of our development projects to become uneconomic. This may result in our having to make significant downward adjustments to our estimated proved reserves. A reduction in production could also result in a shortfall in expected cash flows and require us to reduce capital spending, which could negatively affect our ability to replace our production and our future rate of growth, or require us to borrow funds to cover any such shortfall, which we may be unable to obtain at such time on satisfactory terms. Additionally, if we are required to curtail our drilling program, we may be unable to continue to hold leases that are scheduled to expire, which may further reduce our reserves. As a result, if oil and/or NGL prices experience a sustained period of weakness, our future business, financial condition, results of operations, liquidity, and ability to finance planned capital expenditures may be materially and adversely affected.\nOur business is subject to climate-related transition risks, including evolving climate change legislation, fuel conservation measures, technological advances and negative shift in market perception towards the oil and natural gas industry, which could result in increased operating expenses and capital costs, financial risks and potential reduction in demand for oil and natural gas.\nRecently, these is an increasing attention from governmental and regulatory bodies, investors, consumers, industry and other stakeholders on combating climate change, together with changes in consumer and industrial/commercial behavior, societal expectations on companies to address climate change, investor and societal expectations regarding voluntary climate-related disclosures, preferences and attitudes with respect to the generation and consumption of energy, the use of hydrocarbons, and the use of products manufactured with, or powered by, hydrocarbons. This attention results in the enactment of climate change-related regulations, policies and initiatives, including alternative energy requirements, new fuel consumption standards, energy conservation and emissions reductions measures and responsible energy development; technological advances with respect to the generation, transmission, storage and consumption of energy, increased availability of, and increased demand from consumers and industry for, energy sources other than oil and natural gas (including wind, solar, nuclear, and geothermal sources as well as electric vehicles); and development of, and increased demand from consumers and industry for, lower-emission products and services (including electric vehicles and renewable residential and commercial power supplies) as well as more efficient products and services.\nThese developments may in the future adversely affect the demand for products manufactured with, or powered by, petroleum products, as well as the demand for, and in turn the prices of, oil and natural gas products. Such developments may also adversely impact, among other things, our stock price and access to capital markets, and\nthe availability to us of necessary third-party services and facilities that we rely on, which may increase our operational costs and adversely affect our ability to successfully carry out our business strategy. Climate change-related developments may also impact the market prices of or our access to raw materials such as energy and water and therefore result in increased costs to our business.\nMore broadly, the enactment of climate change-related regulations, policies and initiatives across the market at the government, corporate, and/or investor community levels may in the future result in increases in our compliance costs and other operating costs and have other adverse effects (e.g., greater potential for governmental investigations or litigation).\nSeismic studies do not guarantee that oil or hydrocarbons are present or, if present, will produce in economic quantities.\nOil exploration and production companies, like we are, rely on seismic studies to assist in assessing prospective drilling opportunities on oil and gas properties, as well as on properties that a company may acquire. Such seismic studies are merely an interpretive tool and do not necessarily guarantee that hydrocarbons are present or, if present, will produce in economic or profitable quantities.\nRestrictions on our ability to obtain, recycle and dispose of water may impact our ability to execute our drilling and development plans in a timely or cost-effective manner.\nWater is an essential component of both the drilling and hydraulic fracturing processes. If drought conditions were to occur or demand for water were to outpace supply, our ability to obtain water could be impacted and in turn, our ability to perform hydraulic fracturing operations could be restricted or made more costly. Along with the risks of other extreme weather events, drought risk, in particular, is likely increased by climate change. If we are unable to obtain water to use in our operations from local sources, we may be unable to economically produce oil and natural gas, which could have an adverse effect on our financial condition, results of operations and cash flows. In addition, significant amounts of water are produced in our operations. Inadequate access to or availability of water recycling or water disposal facilities could adversely affect our production volumes or significantly increase the cost of our operations.\nParticipants in the oil and gas industry are subject to numerous laws that can affect the cost, manner, or feasibility of doing business.\nExploration and production activities in the oil and gas industry are subject to various laws and regulations. Any oil and gas exploration and production operated by the Company are or may become subject to numerous environmental and occupational health and safety laws and regulations that may be imposed domestically at the federal, regional, state, and local levels. The more significant of these environmental and occupational health and safety laws and regulations include the following:\n·The U.S. Clean Air Act, which restricts the emission of air pollutants from many sources and imposes various pre-construction, operational, monitoring, and reporting requirements, and that the Environmental Protection Agency or EPA has relied upon as authority for adopting climate change regulatory initiatives relating to Green House Gases or GHG emissions.\n·The U.S. Federal Water Pollution Control Act, also known as the federal Clean Water Act, which regulates discharges of pollutants from facilities to state and federal waters and establishes the extent to which waterways are subject to federal jurisdiction and rulemaking as protected waters of the United States\n·The U.S. Oil Pollution Act of 1990, which subjects owners and operators of vessels, onshore facilities, and pipelines, as well as lessees or permittees of areas in which offshore facilities are located, to liability for removal costs and damages arising from an oil spill in waters of the United States\n·The U.S. Comprehensive Environmental Response, Compensation and Liability Act of 1980, which imposes liability on generators, transporters, and arrangers of hazardous substances at sites where hazardous substance releases have occurred or are threatening to occur\n·The U.S. Resource Conservation and Recovery Act, which governs the generation, treatment, storage, transport, and disposal of solid wastes, including hazardous wastes\n·The U.S. Safe Drinking Water Act (SDWA), which ensures the quality of the nations public drinking water through the adoption of drinking water standards and control over the injection of waste fluids into below-ground formations that may adversely affect drinking water sources\n·The U.S. Emergency Planning and Community Right-to-Know Act, requires facilities to implement a safety hazard communication program and disseminate information to employees, local emergency planning committees, and response departments on toxic chemical uses and inventories\n·The U.S. Occupational Safety and Health Act, which establishes workplace standards for the protection of the health and safety of employees, including the implementation of hazard communications programs designed to inform employees about hazardous substances in the workplace, potentially harmful effects of these substances, and appropriate control measures\n·The U.S. Endangered Species Act, restricts activities that may affect federally identified endangered and threatened species or their habitats through the implementation of operating restrictions or a temporary, seasonal, or permanent ban in affected areas\n·The U.S. National Environmental Policy Act, requires federal agencies, including the Department of the Interior, to evaluate significant agency actions having the potential to affect the environment and that may require the preparation of environmental assessments and more detailed environmental impact statements that may be made available for public review and comment\n·U.S. Department of Transportation regulations, which relate to advancing the safe transportation of energy and hazardous materials and emergency response preparedness.\nThese environmental and occupational health and safety laws and regulations, including new or amended legal requirements, are expected to have a considerable effect on any expanded Companys operations in terms of compliance costs.\nIn addition, regional, state, and local jurisdictions in the United States where the Company operates or may operate also have, or are developing or considering developing, similar environmental and occupational health and safety laws and regulations governing many of these same types of activities. The State of Alabama has extensive operation and licensing laws for oil drilling. The State Oil and Gas Board of Alabama is a regulatory agency of the State of Alabama with the statutory charge of regulating oil exploration and production, including preventing waste and promoting the conservation of oil and gas while ensuring the protection of both the environment and the correlative rights of owners. This board is granted broad authority in Alabama oil and gas conservation statutes to promulgate and enforce rules and regulations to ensure the conservation and proper development of Alabama's petroleum resources. We will rely on consultants and local legal counsel for compliance with the state regulatory regime.\nFailure to comply with these laws and regulations may result in the suspension or termination of our operations and subject us to administrative, civil, and criminal penalties. Moreover, new laws and regulations may be enacted, and current laws and regulations could change, or their interpretations could change, in ways that could substantially increase our costs. The occurrence of any of these factors, or the continuation thereof, could have a material adverse effect on our business, financial position, or future results of operations.\nOur operations are subject to operating hazards inherent to our industry that may adversely impact our ability to conduct business, and we may not be fully insured against all such operating risks.\nThe operating hazards in exploring for and producing oil and natural gas include: encountering unexpected subsurface conditions that cause damage to equipment or personal injury, including loss of life; equipment failures that curtail or stop production or cause severe damage to or destruction of property, natural resources or other equipment; blowouts or other damages to the productive formations of our reserves that require a well to be re-\ndrilled or other corrective action to be taken; and storms and other extreme weather conditions that cause damages to our production facilities or wells. Because of these or other events, we could experience environmental hazards, including release of oil and natural gas from spills, natural gas leaks, accidental leakage of toxic or hazardous materials, such as petroleum liquids, drilling fluids or fracturing fluids, including chemical additives, underground migration, and ruptures. If we experience any of these problems, we could incur substantial losses in excess of our insurance coverage. The occurrence of a significant event or claim, not fully insured or indemnified against, could have a material adverse effect on our financial condition and operations. In accordance with industry practice, we maintain insurance against some of the operating risks to which our business is exposed. Also, no assurance can be given that we will be able to maintain insurance in the future at rates we consider reasonable to cover our possible losses from operating hazards and we may elect no or minimal insurance coverage.\nThis regulatory scheme also poses the risk of government civil and criminal actions and private citizen civil lawsuits against the Company\nUnder these and other laws and regulations, we could be liable for personal injuries, property damage and other types of damages. There are environmental laws that provide for citizen suits, which allow private entities to act in the place of the government and sue operators for alleged violations of environmental law. Currently, we do not have insurance covering environmental and occupational health and safety risks, and any insurance may not cover penalties or fines that may be issued by a governmental authority. The Company lack insurance to cover potential violations and resulting liabilities for environmental and occupational health and safety laws and regulations as well as claims for damages to property or persons or imposition of penalties resulting from our operations.\nNegative public perception of the oil and gas industry could have a material and adverse effect on us.\nOpposition toward oil and natural gas drilling and development activity has been growing globally and is particularly pronounced in the United States. Negative public perception regarding us and/or our industry resulting from, among other things, concerns raised by advocacy groups about climate change may lead to increased reputational and litigation risk and regulatory, legislative and judicial scrutiny, which may, in turn, lead to new state and federal safety and environmental laws, regulations, guidelines and enforcement interpretations. Companies in the oil and natural gas industry are often the target of activist efforts from both individuals and non-governmental organizations regarding safety, human rights, climate change, environmental matters, sustainability, and business practices. The foregoing factors may cause operational delays or restrictions, increased operating costs, additional regulatory burdens and increased risk of litigation. Negative perceptions regarding our industry and reputational risks may also in the future adversely affect our ability to successfully carry out our business strategy by adversely affecting our access to capital. Certain segments of the investor community have developed negative sentiment towards investing in our industry.\nFurther, certain investment banks and asset managers based both domestically and internationally have announced that they are adopting climate change guidelines for their banking and investing activities. Certain other stakeholders have also pressured commercial and investment banks to stop financing oil and gas production and related infrastructure projects. Institutional lenders who provide financing to companies in the energy sector have also become more attentive to sustainable lending practices, and some may elect not to provide traditional energy producers or companies that support such producers with funding. Such developments aimed at limiting climate change and reducing air pollution, could result in downward pressure on the stock prices of oil and gas companies, including ours. This may also potentially result in a reduction of available capital funding for potential development projects, impacting our future financial results.\nTerrorist attacks aimed at energy operations could adversely affect our future oil exploration and production business.\nThe continued threat of terrorism and the effect of military and other government action have led and may lead to further increased volatility in prices for oil and natural gas and could affect these commodity markets or the financial markets. The U.S. government has issued warnings that energy assets may be a future target of terrorist organizations. These developments have subjected our oil and natural gas operations to increased risks. Any future terrorist attack on facilities used by Barrister or other future oil exploration and production operations, those of such operations customers, the infrastructure used for transportation of oil, and, in some cases, those of other energy companies, could have a material adverse effect on the Company.\nOperational Risks\nWe have a limited history of owning and operating oil and gas exploration and production operations.\nPrior to the Barrister Acquisition in November 2020, we have not generated any revenue. Although we acquired Barristers business pursuant to the Barrister Acquisition, these drilling operations are minimal and commenced less than three years ago. In addition, the history of obtaining oil rights by Barrister was minimal in terms of production and does not reveal the potential oil production and profitability of the Company Oil Rights. Subsequently, in the fourth quarter of 2022, we acquired additional oil rights and interests by purchasing NONOP Assets and Buckley Assets, and now we need to obtain sufficient funds to develop reserves related to these properties. However, the lack of a more extensive operating history may discourage lenders or funding sources from providing working capital to the Company. There is no assurance that the Company Oil Rights, including rights acquired in the Barrister Acquisition and oil rights with respect to acquisition of NONOP Assets and Buckley Assets will produce oil on a profitable basis, even with deep drilling rigs. Investors should carefully consider the lack of operating history of the Company and the lack of any significant oil production from the Company Oil Rights prior to making an investment decision to invest in the Company. If the Company is unable to obtain needed capital or financing on satisfactory terms, its ability to develop future reserves will be adversely affected. If drilling operations are curtailed, then the Company may be unable to continue to hold leases and drilling rights that are scheduled to expire, which may further reduce oil reserves, which will materially and adversely affect future business, financial condition, results of operations, liquidity, and ability to finance planned capital expenditures.\nWe have entered a highly competitive and highly capital-intensive industry, and any oil production may be insufficient to fund, sustain, or expand revenue-generating operations.\nThe oil drilling exploration and production business are capital intensive due to the cost of experienced personnel; equipment and other assets required to drill, produce and store oil; regulatory compliance costs; potential liability exposures and financial effects; and the risk of unpredictable volatility in oil market prices and predatory pricing by competitors. Drilling requires an upfront payment of operational costs with no guarantee that actual oil production will cover such expenses. Dry holes for the first and/or second oil wells could deplete any available funding raised by the Company and render the Company insolvent. The actual amount and timing of our future capital expenditures may differ materially from our estimates as a result of, among other things, market oil prices, actual drilling results, the availability of drilling rigs and other services and equipment, and regulatory, technological, and competitive developments. The Company does not have cash flow or cash reserves sufficient to fund more extensive and deep drilling on Company Oil Rights. While we will seek such funding, there can be assurances that we can obtain funding that will be sufficient to fund deep drill wells, which are needed to produce any significant levels of oil production. Future cash flow from our operations and access to capital are subject to a number of variables, including, but not limited to: (i) the market prices at which our oil production is sold; (ii) our proved reserves; (iii) the level of hydrocarbons we can produce from any future oil wells; (iv) our ability to acquire, locate and produce new oil reserves; (v) the levels of our operating expenses; (vi) reduction in the U.S. and global demand for oil.\nOur acquisitions of oil and gas properties and subsequent exploration and development drilling efforts and the operation of our wells may not be profitable or achieve our targeted returns.\nExploration, development, drilling and production activities are subject to many risks. Acquiring oil and natural gas exploration and production rights and leases requires us to assess reservoir and infrastructure characteristics,\nincluding recoverable reserves, development and operating costs, and potential environmental and other liabilities. We may invest in property, including undeveloped leasehold acreage, which we believe will result in projects that will add value over time. However, we cannot guarantee that any leasehold acreage acquired will be profitably developed, that new wells drilled will be productive or that we will recover all or any portion of our investment in such leasehold acreage or wells. Drilling for oil and natural gas may involve unprofitable efforts, including wells that are productive but do not produce sufficient net reserves to return a profit after deducting operating and other costs.\nIn addition, we may not be successful in controlling our drilling and production costs to improve our overall return and wells that are profitable may not achieve our targeted rate of return. Wells may have production decline rates that are greater than anticipated. Future drilling and completion efforts may impact production from existing wells, and parent-child effects may impact future well productivity as a result of timing, spacing proximity or other factors. We may be required to assume the risk of the physical condition of the properties in addition to the risk that the properties may not perform in accordance with our expectations. These risks could render unprofitable our drilling operations and significantly affect the overall financial performance and condition of the Company. Failure to conduct our oil and gas operations in a profitable manner may result in impairments of our proved reserves quantities, impairment of our oil and gas properties, and a write-down in the carrying value of our unproved properties, and over time may adversely affect our growth, revenues and cash flows.\nDue to our contractor model of operations, we will be vulnerable to any inability to engage or retain qualified operational personnel for new or existing drilling operations.\nOur operation plan depends on a teaming/contractor approach to operate oil rigs. We may be unable to locate or retain a sufficient number of qualified independent contractors to operate new or existing oil rigs. Finding and engaging qualified independent contractors will be essential to commencing, expanding, and sustaining drilling operations. Since we will, in all likelihood, depend on one or two new oil rigs at the start of operations after raising sufficient working capital, any inability to engage or retain qualified independent contractors would be potentially fatal to our efforts to establish increased revenue-generating operations. The use of independent contractors also poses the risk of such personnel leaving for more lucrative opportunities with competitors or other oil producers. Many of our competitors can afford more lucrative compensation packages for qualified personnel. We lack the resources to effectively compete against larger competitors for operational personnel, especially against competitors with liquid public markets for their capital stock and the ability to offer attractive stock-based incentive compensation.\nLoss of key operational personnel could cause suspension of any expanded drilling operations.\nThe Company does not have key-man insurance or the available cash to easily employ or engage experienced, full-time outside senior management personnel. The loss of key personnel, including operational personnel of COP used to manage Barristers oil production business, or COPs refusal to continue to manage Barrister oil drilling and production could undermine the Companys ability to manage operations and implement the Companys business plan.\nWith any expanded oil exploration and drilling, we will eventually need to replace existing oil reserves with new oil reserves and develop those oil reserves. Failing that, oil reserves and production will decline, which would adversely affect future cash flows and results of operations.\nOnce we increase oil production, then producing oil reservoirs generally will be characterized by declining production rates that vary depending upon oil reservoir characteristics and other factors. Unless the Company conducts successful ongoing exploration and development activities or continually acquires properties containing proved reserves, proved reserves would decline as those reserves are produced. Future reserves and production, and therefore future cash flow and results of operations, are highly dependent on the success in efficiently developing current reserves and economically finding or acquiring additional recoverable oil reserves. We may not be able to\ndevelop, find, or acquire sufficient additional reserves to replace our current and future production. If we are unable to replace current and future oil production, the value of existing reserves will decrease, and business, financial condition, and results of operations would be materially and adversely affected.\nThe potential lack of availability of, or cost of, drilling rigs, equipment, supplies, personnel, and crude oil field services could adversely affect our ability to execute on a timely basis exploration and development plans within any budget.\nWe may encounter an increase in the cost of securing needed drilling rigs, equipment, and supplies. Larger producers may be more likely to secure access to such equipment by offering more lucrative terms. If we are unable to acquire access to such resources or can obtain access only at higher prices, its ability to convert oil reserves into cash flow could be delayed, and the cost of producing from those oil reserves could increase significantly, which would adversely affect results of operations and financial condition. Our current drilling operations are limited, and the availability of essential drilling assets may not become a risk factor until such time as we increase drilling operations.\nWe have a limited customer base for its oil production due to its limited oil production and operating history. The cost of and difficulty in expanding the customer base for increased production from the Company Oil Rights is unknown.\nWe can only determine the cost and difficulty of expanding our customer base based on actual oil production and then-current market conditions and demand for oil. As such, we cannot predict the cost and ease or difficulty of selling increased oil production from the Company Oil Rights. This unknown factor in commercially exploiting any increased oil production from the Company Oil Rights increases the risk of investing in the shares of the Company because it renders uncertain a key factor in future profitability of the Company.\nRisk related to the Third-Party Transportation of Oil Production.\nThe marketability of oil production will depend upon the availability, proximity, and capacity of transportation facilities owned by third parties. Any oil production will be transported from the wellhead to gathering systems. The oil is then transported by the purchaser by truck or other means to a transportation facility. We will not be able to control most of these third-party transportation means and facilities, and access to them may be limited or denied. If in the future, the Company is unable, for any sustained period, to implement acceptable delivery or transportation arrangements or encounter production-related difficulties, it may be required to shut in or curtail production. Any such shut-in or curtailment, or an inability to obtain favorable terms for delivery of the oil produced, would materially and adversely affect our efforts to attain or sustain revenues from operations and improved future financial condition and results of operations.\nRisks Related to Our Financial Condition and Capital Requirements\nOur independent registered public accounting firm has included an explanatory paragraph relating to our ability to continue as a going concern in its report on our audited financial statements.\nOn a consolidated basis, the Company has incurred significant operating losses since inception and has a working capital deficit. The Companys financial statements do not include any adjustments that might result from the outcome of this uncertainty. Because the Company does not expect that existing operational cash flow will be sufficient to fund presently anticipated operations, this raises substantial doubt about the Companys ability to continue as a going concern. Therefore, the Company will need to raise additional funds and is currently exploring alternative sources of financing. Historically, the Company has raised capital through an officer loan as an interim measure to finance working capital needs and will continue to raise additional capital through the sale of common stock or other securities. The Company will be required to continue to do so until its consolidated operations become profitable. Our past efforts to raise working capital have been unsuccessful.\nAlthough our initial public offering was declared effective by the Commission in August 2019, we were unable to sell any shares and terminated said offering. We also failed to raise sufficient working capital In a second public offering pursuant to the registration statement on a Form S-1 which was declared effective by the Commission on October 9, 2020 (we raised only $53,000 in that public offering, which was closed on May 31, 2021). The impact of COVID-19 pandemic and volatility of market price for oil in 2020 and 2021 further hampered efforts to raise additional working capital by creating economic uncertainty and heightened risks in lending or investing in oil production. These factors, among others, raise substantial doubt about the Companys ability to continue as a going concern. If we are unable to obtain sufficient funding, our business, prospects, financial condition, and results of operations will be materially and adversely affected, and we may be unable to continue as a going concern. If we cannot continue as a viable entity, you would lose all or most of your investment in the Company.\nWe do not have directors and officers liability insurance due to the cost.\nThe lack of directors and officers liability insurance hinders our ability to attract directors and officers. We intend to seek to purchase directors and officers liability insurance if we have sufficient cash reserves from the net proceeds of this Offering or future funding efforts. Typically, such insurance costs $100,000 or more per annum, if available. Further, directors and officers insurance require that the insured company cover the first $300,000 or more of costs prior to insurance coverage occurring. This high deductible can be beyond the financial means of a small company and effectively denies the insured company of the benefits of the insurance. If we do not have sufficient cash to purchase directors and officers liability insurance, our ability to attract and retain qualified officers and directors will suffer, especially considering the lack of a public market for the common stock and resulting inability to offer incentive compensation to directors and officers. We may be unable to find an insurer willing to provide directors and officers liability insurance since we are an early-stage development company with limited operating history and no revenue-generating operations.\nRisks Relating to Our Common Stock\nOur common stock is currently quoted on Expert Market of OTC Markets. We do not have an active, liquid trading market for our common stock and may never develop it.\nIn October 2021, our Common Stock became eligible for quotations on OTC Markets. Between October 2021 and July 2023, our stock has been quoted on OTC Pink marketplace, which publishes brokerage quotations; however our stock is currently quoted on Expert Market marketplace because of delinquent filings of this Annual Report and subsequent reports with the SEC. As a result, our stock is currently not eligible for proprietary broker-dealer quotations, and all quotes in our common stock reflect unsolicited customer orders. This creates a higher risk of wider spreads, increased volatility, and price dislocations. In order to be eligible for public brokerage quotations provide continuous market making, a broker dealer needs to submit a new application under SEC Rule15c2-11 which needs to be approved by FINRA. Even if our stock becomes eligible for proprietary quotations, trading on OTC Pink marketplace is often thin and characterized by wide fluctuations in trading prices, due to many factors that may have little to do with our operations or business prospects. The securities market has from time-to-time experienced significant price and volume fluctuations that are not related to the operating performance of particular companies. These market fluctuations may also materially and adversely affect the market price of shares of our common stock.\nIn the absence of an active trading market investors may have difficulty buying and selling or obtaining market quotations, market visibility for shares of our common stock may be limited, and a lack of visibility for shares of our common stock may have a depressive effect on the market price for shares of our common stock. The lack of an active market impairs the ability of our stockholders to sell their shares at a price that they consider reasonable and may also reduce the fair market value of the shares. Moreover, OTC Markets is not a securities exchange, and trading of securities is often more sporadic than the trading of securities listed on a quotation system like Nasdaq or any other national stock exchange. Accordingly, stockholders may have difficulty reselling any shares of common stock.\nThere is no assurance that we will be able to pay dividends to our stockholders which means that you could receive little or no return on your investment.\nPayment of dividends from our earnings and profits may be made at the sole discretion of our board of directors. There is no assurance that we will generate any distributable cash from operations. Our board may elect to retain cash for operating purposes, debt retirement, or some other purpose. Consequently, you may receive little or no return on your investment.\nPenny Stock rules may make buying or selling our Common Stock difficult. Limitations upon Broker-Dealers Effecting Transactions in Penny Stocks\nTrading in our Common Stock is subject to material limitations as a consequence of regulations that limit the activities of broker-dealers effecting transactions in penny stocks. Pursuant to Rule 3a51-1 under the Exchange Act, our Common Stock is a penny stock because it (i) is not listed on any national securities exchange (ii) has a market price of less than $5.00 per share, and (iii) its issuer (the Company) has net tangible assets less than $2,000,000 (if the issuer has been in business for at least three (3) years) or $5,000,000 (if the issuer has been in business for less than three (3) years). Rule 15g-9 promulgated under the Exchange Act imposes limitations upon trading activities on penny stocks, which makes selling our Common Stock more difficult compared to selling securities that are not penny stocks. Rule 15a-9 restricts the solicitation of sales of penny stocks by broker-dealers unless the broker first (i) obtains from the purchaser information concerning his financial situation, investment experience, and investment objectives, (ii) reasonably determines that the purchaser has sufficient knowledge and experience in financial matters that the person is capable of evaluating the risks of investing in penny stocks, and (iii) delivers and receives back from the purchaser a manually signed written statement acknowledging the purchasers investment experience and financial sophistication.\nRules 15g-2 through 15g-6 promulgated under the Exchange Act require broker-dealers who engage in transactions in penny stocks first to provide their customers with a series of disclosures and documents, including (i) a standardized risk disclosure document identifying the risks inherent in investing in penny stocks, (ii) all compensation received by the broker-dealer in connection with the transaction, (iii) current quotation prices and other relevant market data, and (iv) monthly account statements reflecting the fair market value of the securities.\nThere can be no assurance that any broker-dealer which initiates quotations for the Common Stock will continue to do so, and the loss of any such broker-dealer likely would have a material adverse effect on the market price of our Common Stock.\nFINRA sales practice requirements may also limit a stockholders ability to buy and sell our stock.\nIn addition to the penny stock rules described below, FINRA has adopted rules that require that in recommending an investment to a customer, a broker-dealer must have reasonable grounds for believing that the investment is suitable for that customer. Prior to recommending speculative low-priced securities to their non-institutional customers, broker-dealers must make reasonable efforts to obtain information about the customers financial status, tax status, investment objectives, and other information. Under interpretations of these rules, FINRA believes that there is a high probability that speculative low-priced securities will not be suitable for at least some customers. The FINRA requirements make it more difficult for broker-dealers to recommend that their customers buy our Common Stock, which may limit your ability to buy and sell our stock and have an adverse effect on the market for our shares.\nBecause our Common Stock is deemed a low-priced penny stock, it will be cumbersome for brokers and dealers to trade in our Common Stock, making the market for our Common Stock less liquid and negatively affecting the price of our stock. We will be subject to certain provisions of the Exchange Act, commonly referred to as the penny stock rules as defined in Rule 3a51-1. A penny stock is generally defined to be any equity security that has a market price less than $5.00 per share, subject to certain exceptions. Since our stock is deemed to be a penny stock, trading is subject to additional sales practice requirements of broker-dealers. These require a broker-dealer to:\n·Deliver to the customer, and obtain a written receipt for, a disclosure document;\n·Disclose certain price information about the stock;\n·Disclose the amount of compensation received by the broker-dealer or any associated person of the broker-dealer;\n·Send monthly statements to customers with market and price information about the penny stock; and\n·In some circumstances, approve the purchasers account under certain standards and deliver written statements to the customer with the information specified in the rules.\nConsequently, penny stock rules and FINRA rules may restrict the ability or willingness of broker-dealers to trade and/or maintain a market in our Common Stock. Also, prospective investors may not want to get involved with the additional administrative requirements, which may have a material adverse effect on the trading of our shares.\nWe are an emerging growth company under the JOBS Act of 2012 and a smaller reporting company and, as a result of the reduced disclosure and governance requirements applicable to emerging growth companies and smaller reporting companies, our Common Stock may be less attractive to investors.\nWe are an emerging growth company, as defined in the JOBS Act, and we may take advantage of certain exemptions from various reporting requirements that are applicable to other public companies that are not emerging growth companies including, but not limited to, not being required to comply with the auditor attestation requirements of section 404 of the Sarbanes-Oxley Act, reduced disclosure obligations regarding executive compensation in our periodic reports and proxy statements, and exemptions from the requirements of holding a nonbinding advisory vote on executive compensation and shareholder approval of any golden parachute payments not previously approved. We cannot predict if investors will find our Common Stock less attractive because we may rely on these exemptions. If some investors find our Common Stock less attractive as a result, there may be a less active trading market for our Common Stock and our stock price may be more volatile.\nIn addition, Section 107 of the JOBS Act also provides that an emerging growth company can take advantage of the extended transition period provided in Section 7(a)(2)(B) of the Securities Act for complying with new or revised accounting standards. In other words, an emerging growth company can delay the adoption of certain accounting standards until those standards would otherwise apply to private companies. We are choosing to take advantage of the extended transition period for complying with new or revised accounting standards.\nWe will remain an emerging growth company until the earlier of (i) the last day of the year following the fifth anniversary of the date of the completion of our initial public offering, (ii) the last day of the year in which we have total annual gross revenue of at least $1.07 billion, (iii) the last day of the year in which we are deemed to be a large accelerated filer as defined in Rule 12b-2 under the Exchange Act, which would occur if the market value of our Common Stock held by non-affiliates exceeded $700.0 million as of the last business day of the second fiscal quarter of such year, or (iv) the date on which we have issued more than $1.0 billion in non-convertible debt securities during the prior three-year period.\nEven after we no longer qualify as an emerging growth company, we may still qualify as a smaller reporting company, which would allow us to continue to take advantage of many of the same exemptions from disclosure requirements, including, among other things, not being required to comply with the auditor attestation requirements of Section 404 of the Sarbanes-Oxley Act, presenting only the two most recent fiscal years of audited financial statements in our Annual Report on Form 10-K and reduced disclosure obligations regarding executive compensation in this Report and our periodic reports and proxy statements.\nOur status as an emerging growth company under the JOBS Act may make it more difficult to raise capital as and when we need it.\nBecause of the exemptions from various reporting requirements provided to us as an emerging growth company and because we will have an extended transition period for complying with new or revised financial accounting standards, we may be less attractive to investors and it may be difficult for us to raise additional capital as and when we need it. Investors may be unable to compare our business with other companies in our industry if they believe that our financial accounting is not as transparent as other companies in our industry. If we are unable to raise additional capital as and when we need it, our financial condition and results of operations may be materially and adversely affected.\nFuture capital raises may dilute our existing stockholders ownership, the value of their equity securities and/or have other adverse effects on our operations.\nIf we raise additional capital by issuing equity securities by acquisition of by equity financings, our existing shareholder percentage ownership may decrease, and these stockholders may experience substantial dilution. If we raise additional funds by issuing debt instruments, these debt instruments could impose significant restrictions on our operations, including liens on our assets. If we raise additional funds through collaborations and licensing arrangements, we may be required to relinquish some rights to our technologies or products, or to grant licenses on terms that are not favorable to us or could diminish the rights of our stockholders. Furthermore, if we offer to sell our shares of common stock in subsequent offerings for the purchase price that is less than the purchase price of shares of common stock offered pursuant to this prospectus, this may affect the value of equity securities of the stockholders that are purchasing our shares of common stock in the offering pursuant to this prospectus. In addition, the issuance of such additional shares may affect the ability of any investor to sell their shares once such shares are eligible for sale. ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone. ITEM 2. PROPERTIES\nWe do not own any real property. We rent our principal executive offices at 3033 Wilson Boulevard, Suite E-605, Arlington, Virginia 22201, under a month-to-month lease and for a monthly rental of $50. This office space is deemed adequate for the current needs of our executive management and corporate headquarters. We have no other offices. We believe that this property is sufficient for our current and proposed business. ITEM 3. LEGAL PROCEEDINGS\nThere are no pending legal proceedings to which we are a party or in which any director, officer or affiliate of ours, any owner of record or beneficially of more than 5% of any class of our voting securities, or security holder is a party adverse to us or has a material interest adverse to us. ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\nPART II ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS, AND ISSUER PURCHASES OF EQUITY SECURITIES\nOur Common Stock is currently quoted on the Expert Market marketplace of OTC Markets Group, Inc., an inter-dealer quotation system, under the symbol CJAX. Our stock has been previously quoted on OTC Pink marketplace. Quotations in Expert Market securities, however, are restricted from public viewing. However, there is currently only a very limited trading market for our Common Stock and there is no assurance that a regular trading market will ever develop.\nAs of November 6, 2023, there were 54 stockholders of record of our Common Stock.\nDividends\nWe have never declared or paid any cash dividends on our common stock. We currently intend to retain future earnings, if any, for working capital purposes and do not anticipate paying any cash dividends in the foreseeable future.\nRecent Issuances of Unregistered Securities\nThere were no other sales of equity securities during the period covered by this Annual Report that was not registered under the Securities Act or reported on a Current Report on Form 8-K filed by the Company.\nSecurities Authorized for Issuance Under Equity Compensation Plan\nThe Company adopted the 2018 Equity Incentive Plan on December 31, 2018. No awards were granted under the 2018 Equity Incentive Plan as of the date of this Annual Report.\nRecent Issuances of Unregistered Securities\nThere were no other sales of equity securities during the period covered by this Annual Report that was not registered under the Securities Act and were not previously reported in a Quarterly Report on Form 10-Q or on a Current Report on Form 8-K filed by the Company. ITEM 6. SELECTED FINANCIAL DATA\nAs a smaller reporting company, we are not required to provide the information required by this Item. ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nForward-Looking Statements\nThe following discussion and analysis should be read in conjunction with our financial statements and the related notes thereto. The management's discussion and analysis contain forward-looking statements, such as statements of our plans, objectives, expectations, and intentions. Any statements that are not statements of historical fact are forward-looking statements. When used, the words \"believe,\" \"plan,\" \"intend,\" \"anticipate,\" \"target,\" \"estimate,\" \"expect,\" and the like, and/or future tense or conditional\nconstructions (\"will,\" \"may,\" \"could,\" \"should,\" etc.), or similar expressions, identify certain of these forward-looking statements. These statements are only predictions and involve known and unknown risks, uncertainties, and other factors that may cause our or our industrys actual results, levels of activity, or performance to be materially different from any future results, levels of activity, or performance expressed or implied by these forward-looking statements.\nAlthough we believe that the expectations reflected in the forward-looking statements are reasonable, we cannot guarantee future results, levels of activity, or performance. You should not place undue reliance on these statements, which speak only as of the date of this Annual Report. These cautionary statements should be considered with any written or oral forward-looking statements that we may issue in the future. You should read this Annual Report on Form 10-K with the understanding that our actual future results may be materially different from what we expect. All forward-looking statements speak only as of the date on which they are made. We undertake no obligation to update such statements to reflect events that occur or circumstances that exist after the date on which they are made, except as required by applicable law.\nManagements discussion and analysis of our financial condition and results of operations are based upon our consolidated financial statements which have been prepared in accordance with accounting principles generally accepted in the United States of America (GAAP). The following discussion and analysis of financial condition and results of operations of the Company is based upon and should be read in conjunction with the audited consolidated financial statements and related notes elsewhere in this Annual Report on Form 10-K.\nOverview\nWe were incorporated on November 13, 2017, under the laws of the Commonwealth of Virginia, to acquire, fund, and operate oil exploration and production from assets in the Gulf States Drill Region. We are an early-stage corporation seeking to become an independent energy company focused on the acquisition and subsequent exploitation and development of crude oil in the Gulf States Drill Region.\nSince our inception, we have incurred operating losses. Prior to the Acquisitions, we had not generated positive cash flows from operations, and while after the Acquisitions, we started to generate revenue, there are no assurances that we will be successful in obtaining an adequate level of financing for the development and commercialization of our proposed oil exploration and production business. These factors raise substantial doubt about our ability to continue as a going concern. We expect to incur expenses and operating losses for the foreseeable future as we seek to implement our business plan. Due to its limited revenues, the Acquisitions do not remedy substantial doubts about our ability as a going concern. The Company has been unable to raise additional capital as of the date of this Annual Report, other than personal loans by Jeffrey J. Guzy, CoJaxs Chief Executive Officer and Chairman of the Board of Directors, and $53,000 raised in the public offering.\nReserve engineering is a process of estimating underground accumulations of oil that cannot be measured in an exact way. The accuracy of any reserve estimate depends on the quality of available data, the interpretation of such data, and price and cost assumptions made by reserve engineers. In addition, the results of drilling, testing, and production activities may justify revisions of estimates that were made previously. If significant, such revisions would change the schedule of any further production and development drilling. Accordingly, reserve estimates may differ significantly from the quantities of oil that are ultimately recovered. When we acquire oil exploration and production leases and rights, we will use\noil reserve reports as one factor in deciding whether to drill in the property of a specific oil lease or right. Reserve estimates depend on many assumptions that may turn out to be inaccurate. Any material inaccuracies in reserve estimates or underlying assumptions will materially affect the quantities and present value of oil from a drilling site.\nRisks and Uncertainties\nSince March 2020, and throughout the last two years, global markets and commodity prices have been extremely volatile due to the impacts from the COVID-19 pandemic, with further impacts on volatility caused by the war in Ukraine that began in February 2022. Commodity prices remained steady during the fourth quarter of 2022 as demand has continued to outpace relative supply. While recessionary concerns have placed some downward pressure on commodity prices, causing oil and gas prices to decline in the first quarter of 2023 from their earlier highs in 2022, worldwide commodity demand continues to exceed pre COVID-19 pandemic levels. Although supply has increased and we have seen continued recovery in commodity prices since the beginning of the pandemic, there is still an element of volatility and uncertainty that we expect to continue at least for the near-term and possibly longer, in part by the impact of the Russian-Ukrainian military conflict on global commodity and financial markets, and the associated effect of trade sanctions on imports of oil and natural gas from Russia. This volatility could negatively impact future prices for oil, natural gas, petroleum products and industrial products.\nRecent Developments\nOn November 8, 2022, the Company, through Barrister, acquired from Taxodium 100% ownership, right, title and interest in certain properties located in Mississippi and Alabama, including all oil and gas leases, interests, royalties, overriding royalties, subleases, fee estates, net profits interest, and carried interests (collectively, known as NONOP Assets) pursuant to the NONOP Assignment. In consideration of the acquisition of NONOP Assets, the Company issued 1,600,000 shares of the Companys Common Stock to all members of Taxodium in proportion to their interest in Taxodium. This transaction became effective on October 1, 2022, for accounting purposes.\nOn December 2, 2022, the Company, through Barrister, acquired from Taxodium 100% ownership, right, title and interests in additional properties located in Mississippi, including certain wells, facilities, the oil gas and mineral leases, together with all surface and subsurface and all operating rights, working interest, and net revenue interest arising out of such leases and rights (collectively known as Buckley Assets) pursuant to the to the Buckley Assignment. In consideration of the acquisition of Buckley Assets, the Company issued to members of Taxodium an aggregate of 1,500,000 shares of its Common Stock, valued at $2.00 per share, in proportion of their ownership interest in Taxodium. The Buckley Assignment became effective on October 15, 2022 for accounting purposes.\nResults of Operations\nYear Ended December 31, 2022 Compared to Year Ended December 31, 2021\nFor the Year Ended December 31,\nChange\nChange\nAmount\n%\nRevenues\n$106,554\n$8,160\n$98,394\n*\nLease operating expenses\n321,103\n31,918\n289,185\n906%\nGeneral & administrative expenses\n2,111,761\n1,461,534\n650,227\n44.5%\nDepletion and accretion on discounted liabilities\n42,321\n2,416\n39,905\n*\nImpairment expense\n3,909,700\n-\n3,909,700\n100%\nLoss from operations\n(6,278,331)\n(1,487,708)\n(4,790,623)\n322.0%\nOther income (expense)\n40,716\n(2,488)\n43,204\n*\nNet loss\n$(6,237,615)\n$(1,490,196)\n$(4,747,419)\n318.6%\n* In excess of 1,000%\nRevenues\nRevenues were $106,554 for the year ended December 31, 2022, and $8,160 for the year ended December 31, 2021. The Company is an early-stage company, having just begun to acquire assignments of hydrocarbon revenues and underlying oil and gas exploration and production rights, and therefore has just begun producing significant revenue in 2023.\nGeneral and Administrative Expenses\nGeneral and administrative expenses consisted primarily of accounting and audit fees, legal and professional services fees, and payroll-related expenses. General and administrative expenses were $2,111,761 for the year ended December 31, 2022, compared to $1,461,534 in the same period in 2021, representing an increase of 5.9% or $85,227. The increase was primarily driven by an increase in share-based compensation expense.\nLease Operating Expenses\nLease operating expenses were $321,103 for the year ended December 31, 2022, compared to $31,918 in the same period in 2021. The increase was due to additional operating expenses resulting from acquisitions of oil and gas properties during 2022.\nLoss from Operations\nTotal operating loss was $6,278,331 for the year ended December 31, 2022, and $1,487,708 for the year ended December 31, 2021. The loss was primarily driven by the $3,909,700 impairment loss on oil and gas properties in addition to the increase in general and administrative expenses.\nOther Income (Expense)\nOther income was $40,716 for the year ended December 31, 2022, compared to other expense of $2,488 in the same period in 2021. The increase was primarily due to an increase in interest income of $41,660.\nNet Loss\nAs a result of the above factors, there was a net loss of $6,237,615 for the year ended December 31, 2022, compared to a net loss of $1,490,196 in the same period of last year.\nLiquidity and Capital Resources\nSources of Liquidity\nThe Company had cash and cash equivalents of $37,750 at December 31, 2022. The Company has incurred net operating losses and operating cash flow deficits since inception, continuing through the years ended December 31, 2022, and December 31, 2021. Since inception, the primary sources of financing have been a combination of loans or contributions of Jeffrey J. Guzy, an officer and director of the Company, and $53,000 raised in the public offering. This limited funding has been inadequate as of the date of this Annual Report to fund our business strategy. The Company has not attained profitable operations and its ability to pursue any future plan of operation is dependent upon our ability to obtain additional financing.\nFunding Requirements\nThe Company believes that its working capital on hand, as of the date of this report, will not be sufficient to fund its plan of operations over the next 12 months. Until such time, if ever, as the Company can generate substantial revenues, it expects to continue relying on a combination of equity offerings and debt financings to fund ongoing operations. To the extent that the Company raises additional capital through the sale of equity or debt securities, the ownership interest of the Company may be materially diluted, and the terms of such securities could include liquidation or other preferences that adversely affect the rights of the Companys existing stockholders. There is no assurance that the Company will be able to complete any additional sales of equity securities or that it will be able to arrange for other financing to fund its planned business activities.\nDebt or equity financing arrangements may not be available to us or may be available only on unfavorable terms. Based on prior experience in seeking funding for drilling on properties without any significant oil production, funding for drilling is challenging to obtain at all or on affordable terms. Our ability to obtain additional financing may be impaired by many factors outside of our control, including the capital markets (both generally and in the crude oil industry in particular), our lack of operating history, the location of our proposed or future crude oil properties and prices of crude oil on the commodities markets (which will influence the amount of asset-based financing available to us) and other factors. Further, if oil prices on the commodities markets decline, our revenues from any exploitation of the Company Oil Rights will likely decrease, and such decreased revenues may increase our requirements for capital. The Company may continue to incur substantial costs in the future in connection with raising capital to fund our business, including investment banking fees, legal fees, accounting fees, securities law compliance fees, printing and distribution expenses, and other costs. The Company may also be required to recognize non-cash expenses in connection with certain securities we may issue, which may adversely affect our financial condition.\nIf the Company is unable to raise additional funds through equity or debt financings or other arrangements sufficient to satisfy its long-term capital requirements, together with its revenues from any acquired operations, it may be required to reduce operating costs, which are already minimal and delay, reduce or eliminate its acquisition and development activities. That reduction could jeopardize the Companys future strategic initiatives and business plans. The Company may be required to sell some or all of its acquired properties (which could be on unfavorable terms), seek joint ventures with one or more strategic partners, strategic acquisitions, and other strategic alternatives, cease our operations, sell or merge our business, or file a petition for bankruptcy (either liquidation or reorganization under the U.S. Bankruptcy Code). Any of these actions could result in investors in the common stock losing their investment or failing to realize any appreciation in the common stock from the purchase price.\nWorking Capital (Deficit)\nThe following table summarizes our total current assets, total current liabilities, and working capital (deficit) as of December 31, 2022, and December 31, 2021:\nAs of\nAs of\nDecember 31, 2022\nDecember 31, 2021\nCurrent assets\n$89,800\n$103,765\nCurrent liabilities\n2,105,308\n794,376\nWorking capital deficit\n$(2,015,508)\n$(690,611)\nCash Flows\nChanges in the net cash provided by and (used in) operating, investing, and financing activities for the years ended December 31, 2022, and December 31, 2021, are set forth in the following table:\nYear Ended\nYear Ended\nDecember 31, 2022\nDecember 31, 2021\nNet cash used in operating activities\n$(78,323)\n$(108,618)\nNet cash used in investing activities\n-\n-\nNet cash provided by financing activities\n103,975\n76,665\nCash at beginning of period\n12,098\n44,051\nNet increase (decrease) in cash\n$25,652\n$(31,953)\nNet cash from operating activities is derived from net loss from operations adjusted for non-cash items, changes in the balances of accounts receivables, prepaid expenses, accounts payables, and accrued expenses. For the period ended December 31, 2022, net cash used in operating activities was $78,323 compared to net cash used in operating activities of $108,618 for the period ended December 31, 2021.\nNet cash used in investing activities was $0 for the periods ended December 31, 2022, and December 31, 2021.\nTotal net cash provided by financing activities was $103,975 and $76,665 for the periods ended December 31, 2022, and December 31, 2021, respectively. The net decrease was primarily due to the decrease in SBA PPP loans.\nGoing Concern\nThe accompanying consolidated financial statements have been prepared assuming we will continue as a going concern, which contemplates the realization of assets and the satisfaction of liabilities in the normal course of business for the twelve-month period following the date of these financial statements. On a consolidated basis, we have incurred significant operating losses since inception. Because we do not expect that existing operational cash flow will be sufficient to fund presently anticipated operations, this raises substantial doubt about our ability to continue as a going concern. Therefore, we will need to raise additional funds and are currently exploring sources of financing. Historically, we have raised capital through private offerings of debt and equity and officer loans to finance working capital needs. There can be no assurances that we will be able to continue to raise additional capital through the sale of common stock or other securities or obtain short-term loans.\nOff-Balance Sheet Arrangements\nWe have no off-balance sheet arrangements.\nCritical Accounting Policies and Estimates\nOur discussion of financial condition and results of operations is based upon the information reported in our financial statements. The preparation of these statements requires us to make assumptions and estimates that affect the reported amounts of assets, liabilities, revenues, and expenses as well as the disclosure of contingent assets and liabilities at the date of our financial statements. We base our assumptions and estimates on historical experience and other sources that we believe to be reasonable at the time. Actual results may vary from our estimates due to changes in circumstances, weather, politics, global economics, mechanical problems, general business conditions, and other factors. Our significant accounting policies are detailed in Note 1 to our financial statements included in this Annual Report. We have outlined below certain of these policies as being of particular importance to the portrayal of our financial position and results of operations and which require the application of significant judgment by our management.\nOn May 9, 2022, the Board of directors of the Company, after discussion with management, determined that the Companys previously issued financial statements included in the Original Form 10-K need to be restated, to among other things, amend the statements used in the Original Form 10-K regarding the method of accounting it uses. On May 31, 2022, the Company filed an amendment to the Original Form 10-K in which it modified and restated certain statements, including that the Company uses the successful efforts method of accounting for oil and gas activities. Under this method, the costs of productive exploratory wells, all development wells, related asset retirement obligation assets and productive leases are capitalized and amortized, principally by field, on a units-of-production basis over the life of the remaining proved reserves. Exploration costs, including personnel costs, geological and geophysical expenses and delay rentals for oil and gas leases are charged to expense as incurred. Exploratory drilling costs are initially capitalized but charged to expense if and when the well is determined not to have found reserves in commercial quantities. All of our properties are located within the continental United States.\nRevenue Recognition. In January 2018, the Company adopted Financial Accounting Standards Board (FASB) Codification Revenues from Contracts with Customers (Topic 606). The timing of recognizing revenue from the sale of produced crude oil and natural gas was not changed as a result of adopting ASC 606. The Company predominantly derives its revenue from the sale of produced crude oil and natural gas.\nThe contractual performance obligation is satisfied when the product is delivered to the purchaser. Revenue is recorded in the month the product is delivered to the purchaser. The Company receives payment within one month after pickup. The transaction price includes variable consideration as product pricing is based on published market prices and reduced for contract-specified differentials. The new guidance regarding ASC 606 does not require that the transaction price be fixed or stated in the contract. Estimating the variable consideration does not require significant judgment. Revenue is recognized net of royalties due to third parties in an amount that reflects the consideration the Company expects to receive in exchange for those products. See Note 2 of our financial statements for additional information.\nSuccessful Efforts Method of Accounting. We account for oil and natural gas properties in accordance with the successful efforts method. Under this method, all acquisition costs of proved properties are capitalized and amortized on a unit-of-production basis over the remaining life of the proved reserves. All development costs of proved properties are capitalized and amortized on a unit-of-production basis over the remaining life of the proved developed reserves. Costs of retired, sold, or abandoned properties that constitute a part of an amortization base are charged or credited, net of proceeds, to accumulated depreciation, depletion and amortization unless doing so significantly affects the unit-of-production amortization rate, in which case a gain or loss is recognized in the current period. Gains or losses from the disposal of other properties are recognized in the current period. For assets acquired, we base the capitalized cost on the fair value at the acquisition date. We expense expenditures for maintenance and repairs necessary to maintain properties in operating condition, as well as annual lease rentals, as they are incurred. Estimated dismantlement and abandonment costs are capitalized at their estimated net present value and amortized over the remaining lives of the related assets. Interest is capitalized only during the periods in which these assets are brought to their intended use. We only capitalize the interest on borrowed funds related to our share of costs associated with qualifying capital expenditures.\nImpairment of Oil and Natural Gas Properties. We evaluate the impairment of our proved oil and natural gas properties generally on a field-by-field basis or at the lowest level for which cash flows are identifiable, whenever events or changes in circumstance indicate that the carrying value may not be recoverable. We reduce the carrying values of proved properties to fair value when the expected undiscounted future cash flows are less than the net book value. We measure the fair values of proved properties using valuation techniques consistent with the income approach, converting future cash flows to a single discounted amount. Significant inputs used to determine the fair values of proved properties include estimates of (i) reserves; (ii) future operating and development costs; (iii) future commodity prices; and (iv) a risk-adjusted discount rate. These inputs require significant judgments and estimates by our management at the time of the valuation. The most significant financial statement effect from a change in our oil and gas reserves or impairment of its proved properties would be the DD&A rate.\nAn impairment may not be reversed in future periods even though higher oil and natural gas prices may subsequently increase the ceiling.\nOur estimates of reserves and future cash flow as of December 31, 2022, and 2021 were prepared using an average price equal to the unweighted arithmetic average of the first day of the month price for each month within the 12-month periods ended December 31, 2022, and 2021, respectively, in accordance with SEC guidelines. As of December 31, 2022, our reserves are based on an SEC average price of $92.01 per Bbl of WTI oil posted and $6.957 per MCF natural gas. As of December 31, 2021, our reserves are based on an SEC average price of $45.66 per Bbl of WTI oil posted and $2.51 per MCF natural gas. Prices are adjusted by local field and lease level differentials and are held constant for the life of reserves in accordance with SEC guidelines.\nIncome Taxes. Deferred income taxes are provided for the difference between the tax basis of assets and liabilities and the carrying amount in our financial statements. This difference will result in taxable income or deductions in future years when the reported amount of the asset or liability is settled. Since our tax returns are filed after the financial statements are prepared, estimates are required in valuing tax assets and liabilities. We record adjustments to the actual values in the period we file our tax returns.\nIn January 2018, the Company adopted ASC 718, Compensation - Stock Compensation.\nRecent Accounting Pronouncements\nSee Note 4 in the notes to our consolidated financial statements for further discussion regarding recently issued accounting standards. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISKS\nAs a smaller reporting company, we are not required to provide the information required by this Item. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nCONTENTS\nPAGE\nReports of Independent Registered Public Accounting Firms\nF 39 - F 40\nFinancial Statements:\nConsolidated Balance Sheets as of December 31, 2022, and December 31, 2021\nF 41\nConsolidated Statements of Operations for the years ended December 31, 2022, and December 31, 2021\nF 42\nConsolidated Statements of Stockholders Deficit for the years ended December 31, 2022, and 2021\nF 43\nConsolidated Statements of Cash Flows for the years ended December 31, 2022, and December 31, 2021\nF 44\nNotes to Consolidated Financial Statements\nF 45 - F 60\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Shareholders of CoJax Oil and Gas Corporation:\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheet of CoJax Oil and Gas Corporation (\"the Company\") as of December 31, 2022, the related consolidated statements of operations, stockholders' equity, and cash flows for the year ended December 31, 2022 and the related notes (collectively referred to as the \"financial statements\"). In our opinion, the financial statements referred to above present fairly, in all material respects, the financial position of the Company as of December 31, 2022, and the results of its operations and its cash flows for the year ended December 31, 2022, in conformity with accounting principles generally accepted in the United States of America.\nExplanatory Paragraph Regarding Going Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 2 to the financial statements, the Company has suffered recurring losses from operations and has a net capital deficiency which raise substantial doubt about its ability to continue as a going concern. Management's plans in regard to these matters are also described in Note 2. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (\"PCAOB\") and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Company's internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audit provides a reasonable basis for our opinion.\n/s/ Sadler, Gibb & Associates, LLC\nWe have served as the Company's auditor since 2022.\nDraper, UT\nNovember 17, 2023\nPCAOB ID: 3627\nF 39\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and\nStockholders of CoJax Oil & Gas Corporation\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of CoJax Oil & Gas Corporation (the Company) as of December 31, 2021, and the related consolidated statements of operations, stockholders deficit, and cash flows for the year ended December 31, 2021, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2021, and the results of its operations and its cash flows for the year ended December 31, 2021, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\n/s/ Haynie & Company\nSalt Lake City, Utah\nNovember 17, 2023\nPCAOB ID: 457\nWe began serving as the Companys auditor in 2019. In 2022, we became the predecessor auditor.\nF 40\nCoJax Oil and Gas Corporation\nConsolidated Balance Sheets\nAs of\nAs of\nDecember 31, 2022\nDecember 31, 2021\nASSETS\nCurrent assets:\nCash\n$37,750\n$12,098\nAccounts receivable\n52,050\n-\nPrepaid expenses\n-\n91,667\nTotal current assets\n89,800\n103,765\nProperty and Equipment:\nOil and gas properties at cost\n5,385,080\n2,779,802\nLess: Accumulated depletion\n(39,623)\n-\nTotal property and equipment - net\n5,345,457\n2,779,802\nTotal assets\n$5,435,257\n$2,883,567\nLIABILITIES and STOCKHOLDERS EQUITY\nCurrent liabilities:\nAccounts payable\n$105,057\n$46,261\nWorkover expense payable\n234,396\n-\nAccrued salaries and payroll taxes\n1,642,612\n696,452\nCurrent portion of notes payable\n10,242\n51,663\nNotes payable - related party\n113,001\n-\nTotal current liabilities\n2,105,308\n794,376\nLong-term liabilities:\nAsset retirement obligations\n92,241\n84,566\nNotes payable, net of current portion\n30,724\n39,994\nTotal long-term liabilities\n122,965\n124,560\nTotal liabilities\n2,228,273\n918,936\nStockholders equity:\nPreferred stock, $0.10 par value, 50,000,000 current shares authorized, 55,000 and 30,000 Series A shares, $0.01 par value issued and outstanding at December 31, 2022 and 2021, respectively.\nCommon stock, $0.01 par value, 300,000,000 current shares authorized, 9,114,446 and 5,780,577 shares issued and outstanding at December 31, 2022 and 2021, respectively.\n91,144\n57,806\nAdditional paid-in capital\n12,249,429\n4,803,049\nAccumulated deficit\n(9,134,139)\n(2,896,524)\nTotal stockholders equity\n3,206,984\n1,964,631\nTotal liabilities and stockholders equity\n$5,435,257\n$2,883,567\nSee accompanying notes to consolidated financial statements.\nF 41\nCoJax Oil and Gas Corporation\nConsolidated Statements of Operations\nFor the Year Ended\nFor the Year Ended\nDecember 31, 2022\nDecember 31, 2021\nRevenues\n$106,554\n$8,160\nOperating costs and expenses:\nLease operating expenses\n321,103\n31,918\nGeneral and administrative expenses\n2,111,761\n1,461,534\nDepletion and accretion on discounted liabilities\n42,321\n2,416\nImpairment expense\n3,909,700\n-\nTotal operating costs and expenses\n6,384,885\n1,495,868\nLoss from operations\n(6,278,331)\n(1,487,708)\nOther income (expense):\nGain on forgiveness of debt\n41,665\n-\nOther income and expense\n(33)\nInterest expense\n(956)\n(2,455)\nTotal other income (expense)\n40,716\n(2,488)\nNet loss\n$(6,237,615)\n$(1,490,196)\nNet loss per common share - basic and diluted\n$(0.93)\n$(0.35)\nWeighted average number of common shares outstanding during the period - basic and diluted\n6,683,773\n4,269,524\nSee accompanying notes to consolidated financial statements.\nF 42\nCoJax Oil and Gas Corporation\nConsolidated Statements of Stockholders Equity\nFor the years ending December 31, 2022, and December 31, 2021\nAdditional\nTotal\nPreferred stock\nCommon stock\npaid-in\nAccumulated\nStockholders\nShares\nAmount\nShares\nAmount\ncapital\ndeficit\ndeficit\nBalance, December 31, 2020\n-\n$-\n3,659,001\n$36,590\n$(18,588)\n$(1,406,328)\n$(1,388,326)\nSale of common stock for cash\n-\n-\n17,500\n34,825\n-\n35,000\nShare-based vendor payments and compensation\n-\n-\n677,836\n6,779\n1,348,894\n-\n1,355,673\nPreferred shares issued for accrued compensation\n30,000\n-\n-\n599,700\n-\n600,000\nShare-based compensation\n-\n-\n10,000\n19,900\n-\n20,000\nShares issued - note payable debt exchange\n-\n-\n1,350,000\n13,500\n2,686,500\n-\n2,700,000\nShares issued - note payable debt exchange - related party\n66,240\n131,818\n-\n132,480\nNet loss for the year ending December 31, 2021\n-\n-\n-\n-\n-\n$(1,490,196)\n$(1,490,196)\nBalance, December 31, 2021\n30,000\n$300\n5,780,577\n$57,806\n$4,803,049\n$(2,896,524)\n$1,964,631\nCommon stock issued for services\n-\n-\n233,869\n2,338\n467,630\n-\n469,968\nPreferred stock issued for accrued officer compensation\n25,000\n-\n-\n499,750\n-\n500,000\nShares issued for acquisitions\n-\n-\n3,100,000\n31,000\n6,479,000\n-\n6,510,000\nNet loss for the year ending December 31, 2022\n-\n-\n-\n-\n-\n(6,237,615)\n(6,237,615)\nBalance, December 31, 2022\n55,000\n$550\n9,114,446\n$91,144\n$12,249,429\n$(9,134,139)\n$3,206,984\nSee accompanying notes to consolidated financial statements.\nF 43\nCoJax Oil and Gas Corporation\nConsolidated Statements of Cash Flows\nFor the\nYear Ended\nFor the\nYear Ended\nDecember 31, 2022\nDecember 31, 2021\nOperating Activities:\nNet loss\n$(6,237,615)\n$(1,490,196)\nAdjustments to reconcile net loss to net cash used in operating activities:\nImpairment loss on oil and gas properties\n3,909,700\n-\nDepletion expense\n39,623\n-\nGain on forgiveness of debt\n(41,665)\n-\nAccretion of asset retirement obligations\n2,698\n2,416\nCommon stock issued for services and salaries\n469,969\n755,173\nChanges in operating assets and liabilities:\nAccounts receivable\n(52,050)\n-\nPrepaid expense\n91,667\n(91,667)\nAccounts payable and accrued liabilities\n1,739,350\n715,756\nNet cash used in operating activities\n(78,323)\n(108,618)\nInvesting Activities:\nNet cash used in investment activities\n-\n-\nFinancing Activities:\nProceeds from loans payable - related party\n113,001\n-\nProceeds from loans payable - SBA PPP loan\n-\n41,665\nPayments of loans payable - SBA PPP Loan\n(9,026)\n-\nProceeds from the issuance of common stock\n-\n35,000\nNet cash provided by financing activities\n103,975\n76,665\nNet change in cash\n25,652\n(31,953)\nCash - beginning of period\n12,098\n44,051\nCash - end of period\n$37,750\n$12,098\nSupplemental disclosure of non-cash investing and financing activities:\nCommon stock issued for acquisitions\n$6,510,000\n$-\nCommon stock issued for note payable debt exchange\n$-\n$2,700,000\nCommon stock issued for related party notes payable and interest\n$-\n$132,480\nCommon stock issued for accrued expenses\n$-\n$620,500\nPreferred stock issued for accrued compensation\n$500,000\n$600,000\nSee accompanying notes to consolidated financial statements.\nF 44\nCoJax Oil and Gas Corporation\nNotes to Consolidated Financial Statements\nDecember 31, 2022\nNOTE 1 - ORGANIZATION, NATURE OF OPERATIONS AND BASIS OF PRESENTATION\nOrganization\nCoJax Oil & Gas Corporation, a Virginia corporation (Company), was incorporated on November 13, 2017. The Company is based in Arlington Virgina, with a wholly owned subsidiary, Barrister Energy LLC (‘Barrister Energy), registered in Mississippi and based in Laurel, Mississippi.\nNature of Operations\nThe Company is a growing U.S. energy company, engaged in the acquisition and development of lower risk onshore oil and gas producing properties within the Southeastern U.S. The Companys focused growth strategy relies primarily on leveraging managements expertise to acquire both operated and non-operated interests in producing properties with the goal of assembling a large oil and gas portfolio. Through this strategy of acquisition of operated and non-operated properties, the Company has the unique ability to benefit from the technical and scientific expertise of world-class exploration and production (E&P) companies operating in the area.\nSince the companys inception, it has been engaged in organizational activities and had no revenue-generating operations until the periods covered by this current report. The company has begun to acquire assignments of hydrocarbon revenues and underlying oil and gas exploration and production rights as covered by this current report. The company runs all operations of its current acquisitions through Barrister Energy LLC, the operational subsidiary.\nThe Company focuses on the acquisition of and exploitation of upstream energy assets, specifically targeting select oil and gas mineral interests. These acquisitions are structured primarily as acquisitions of leases, working interests, real property interests and mineral rights and royalties and are generally not regarded as the acquisition of securities, but rather real property interests. As an owner, the Company has the right to receive a portion of the production from the leased acreage (or of the proceeds of the sale thereof). As an owner, the Company also has and obligation for its share of lease operating costs.\nOn March 11, 2020, the World Health Organization declared COVID-19 a global pandemic. This contagious disease outbreak and any related adverse public health developments, has adversely affected workforces, economies, and financial markets globally, leading to an economic downturn. The impact on the Company has not been significant but management continues to monitor the situation.\nBasis of Presentation\nThe accompanying financial statements have been prepared in conformity with accounting principles generally accepted in the United States of America (US GAAP) which contemplate the continuation of the Company as a going concern.\nNOTE 2 - GOING CONCERN DISCLOSURE\nThe Companys consolidated financial statements are prepared in accordance with U.S. GAAP applicable to a going concern that contemplates the realization of assets and liquidation of liabilities in the normal\nF 45\ncourse of business. There can be no assurance that the Company will be able to achieve its business plan, raise any additional capital, or secure the additional financing necessary to implement its current operating plan. The accompanying consolidated financial statements do not include any adjustments that might be necessary if the Company is unable to continue as a going concern.\nThe Company has yet to achieve profitable operations, expects to incur further losses in the development of its business, has negative cash flows from operating activities, and is dependent upon future issuances of equity or other financings to fund ongoing operations, all of which raises substantial doubt about the Companys ability to continue as a going concern for a period of twelve months from the issuance of these financial statements. The Companys ability to continue as a going concern is dependent upon its ability to generate future profitable operations and/or to obtain the necessary financing from stockholders or other sources to meet its obligations and repay its liabilities arising from normal business operations when they come due. Management has no formal plan in place to address this concern but considers that the Company will be able to obtain additional funds by equity financing and/or related party advances, however, there is no assurance of additional funding being available or on acceptable terms, if at all.\nNOTE 3 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nPrinciples of consolidation\nThe accompanying condensed consolidated financial statements include the accounts of the Company and of its wholly-owned subsidiaries. All significant intercompany accounts and transactions have been eliminated in consolidation.\nUse of Estimates\nThe preparation of financial statements in conformity U.S. GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, the disclosures of contingent assets and liabilities at the date of the financial statements, and the reported amounts of revenues and expenses during the reporting period. Significant areas of estimate include the impairment of assets and rates for amortization, accrued liabilities, future income tax obligations, and the inputs used in calculating stock-based compensation. Actual results could differ from those estimates and would affect future results of operations and cash flows.\nReclassifications\nCertain prior period amounts have been reclassified to conform with the current year presentation. Reclassifications include combining or further disaggregation of certain line items in the consolidated balance sheets, consolidated statements of operations, and consolidated statements of cash flows. Such reclassifications had no significant impact on our reported net loss, current assets, total assets, current liabilities, total liabilities, shareholders equity or cash flows.\nCash and Cash Equivalents\nThe Company considers all highly liquid temporary cash investments with an original maturity of three months or less to be cash equivalents. At December 31, 2022, and December 31, 2021, the Company had no cash equivalents.\nF 46\nAccounts Receivable and Allowance for Doubtful Accounts\nAccounts receivable consists of oil and gas sales, net of a valuation allowance for doubtful accounts. As of December 31, 2022 and 2021, the allowance for doubtful accounts was $0 and $0, respectively.\nOil and Gas Producing Activities\nThe Company uses the successful efforts method of accounting for oil and gas activities. Under this method, the costs of productive exploratory wells, all development wells, related asset retirement obligation assets, and productive leases are capitalized and amortized, principally by field, on a units-of-production basis over the life of the remaining proved reserves. Exploration costs, including personnel costs, geological and geophysical expenses, and delay rentals for oil and gas leases are charged to expense as incurred. Exploratory drilling costs are initially capitalized but charged to expense if and when the well is determined not to have found reserves in commercial quantities.\nEstimates of oil and gas reserves, as determined by independent petroleum engineers, are continually subject to revision based on price, production history and other factors. Depletion expense, which is computed based on the units of production method, could be significantly impacted by changes in such estimates. Additionally, US GAAP requires that if the expected future undiscounted cash flows from an asset are less than its carrying cost, that asset must be written down to its fair market value. As the fair market value of an oil and gas property will usually be significantly less than the total undiscounted future net revenues expected from that asset, slight changes in the estimates used to determine future net revenues from an asset could lead to the necessity of recording a significant impairment of that asset.\nUnproved oil and gas properties will be assessed annually to determine whether they have been impaired by the drilling of dry holes on or near the related acreage or other circumstances, which may indicate a decline in value. When impairment occurs, a loss will be recognized. When leases for unproved properties expire, the costs thereof, net of any related allowance for impairment, will be removed from the accounts and charged to expense.\nThe Company will review its proved oil and natural gas properties for impairment whenever events and circumstances indicate that a decline in the recoverability of its carrying value may have occurred. It estimates the undiscounted future net cash flows of its oil and natural gas properties and compares such undiscounted future cash flows to the carrying amount of the oil and natural gas properties to determine if the carrying amount is recoverable. If the carrying amount exceeds the estimated undiscounted future cash flows, the Company will adjust the carrying amount of the oil and natural gas properties to fair value.\nDuring the year ended December 31, 2022, the Company recorded impairments of $3,909,700 on oil and gas properties. There were no impairments recorded during the year ended December 31, 2021.\nLong-Lived Assets\nThe Company accounts for the impairment or disposal of long-lived assets according to the Financial Accounting Standards Boards (FASB) Accounting Standards Codification (ASC) 360 Property, Plant and Equipment. ASC 360 clarifies the accounting for the impairment of long-lived assets and for long-lived assets to be disposed of, including the disposal of business segments and major lines of business. Long-lived assets are reviewed when facts and circumstances indicate that the carrying value of the asset may not be recoverable. When necessary, impaired assets are written down to estimated fair value based\nF 47\non the best information available. Estimated fair value is generally based on either appraised value or measured by discounting estimated future cash flows. Considerable management judgment is necessary to estimate discounted future cash flows. Accordingly, actual results could vary significantly from such estimates. The Company did not recognize any impairment losses on long-lived assets during the years ended December 31, 2022 or 2021.\nFair Value of Financial Instruments\nThe Company had no financial instruments for the year ending December 31, 2022, or for the year ending December 31, 2021.\nASC 820 Fair Value Measurements and Disclosures defines fair value as the exchange price that would be received for an asset or paid to transfer a liability (an exit price) in the principal or most advantageous market for the asset or liability in an orderly transaction between market participants on the measurement date. ASC 820 also establishes a fair value hierarchy that distinguishes between (1) market participant assumptions developed based on market data obtained from independent sources (observable inputs) and (2) a reporting entitys own assumptions about market participant assumptions developed based on the best information available in the circumstances (unobservable inputs). The fair value hierarchy consists of three broad levels, which give the highest priority to unadjusted quoted prices in active markets for identical assets or liabilities (Level 1) and the lowest priority to unobservable inputs (Level 3). The three levels of the fair value hierarchy are described below:\nLevel 1 - Unadjusted quoted prices in active markets that are accessible at the measurement date for identical, unrestricted assets or liabilities;\nLevel 2 - Inputs other than quoted prices included within Level 1 that are observable for the asset or liability, either directly or indirectly, including quoted prices for similar assets or liabilities in active markets; quoted prices for identical or similar assets or liabilities in markets that are not active; inputs other than quoted prices that are observable for the asset or liability (e.g., interest rates); and inputs that are derived principally from or corroborated by observable market data by correlation or other means; and\nLevel 3 - Fair value measurements are those derived from valuation techniques that include inputs for the asset or liability that are not based on observable market data (unobservable inputs).\nFair value estimates discussed herein are based upon certain market assumptions and pertinent information available to management as of December 31, 2022 and 2021. The respective carrying values of certain on-balance-sheet financial instruments approximated their fair values due to the short-term nature of these instruments.\nRevenue Recognition\nOn January 1, 2018, the Company adopted ASC 606, Revenue from Contracts with Customers. As the Company had no sales at the time of adoption, the adoption did not require an adjustment to opening retained earnings for the cumulative effect adjustment and did not affect the Companys previously reported results of operations, nor its ongoing consolidated balance sheets, statements of cash flow, or statements of changes in equity.\nF 48\nUnder ASC 606, oil and natural gas sales revenues are recognized when control of the product is transferred to the customer, the performance obligations under the terms of the contracts with customers are satisfied and collectability is reasonably assured. All the Companys oil and natural gas sales are made under contracts with customers. The performance obligations for the Companys contracts with customers are satisfied at a point in time through the delivery of oil and natural gas to its customers. Accordingly, the Companys contracts do not give rise to contract assets or liabilities. The Company typically receives payment within 30 days of the month of delivery. The Companys contracts for oil and natural gas sales are standard industry contracts that include variable consideration based on the monthly index price and adjustments that may include counterparty-specific provisions related to volumes, price differentials, discounts, and other adjustments and deductions.\nRevenues consist of the following:\nYear ended\nDecember 31, 2022\nYear ended\nDecember 31, 2021\nCrude oil revenues\n$99,612\n$8,160\nGas revenues\n6,942\n-\nTotal revenues\n$106,554\n$8,160\nStock-Based Compensation\nThe Company accounts for Stock-Based Compensation under ASC 718 Compensation - Stock Compensation, which addresses the accounting for transactions in which an entity exchanges its equity instruments for goods or services, with a primary focus on transactions in which an entity obtains employee services in share-based payment transactions. Generally accepted accounting principles require measurement of the cost of employee services received in exchange for an award of equity instruments based on the grant-date fair value of the award. Incremental compensation costs arising from subsequent modifications of awards after the grant date must be recognized.\nThe Company issues stock to consultants for various services. The costs for these transactions are measured at the fair value of the consideration received or the fair value of the equity instruments issued, whichever is more reliably measurable. The value of the common stock is measured at the earlier of (i) the date at which a firm commitment for performance by the counterparty to earn the equity instruments is reached or (ii) the date at which the counterparty's performance is complete. The Company recognized consulting expense and a corresponding increase to additional paid-in-capital related to stock issued for services.\nIncome Taxes\nIncome taxes are accounted for under ASC 740, using the liability method of accounting for income taxes. Under the liability method, future tax liabilities and assets are recognized for the estimated future tax consequences attributable to differences between the amounts reported in the financial statement carrying amounts of assets and liabilities and their respective tax bases. Future tax assets and liabilities are measured using enacted or substantially enacted income tax rates expected to apply when the asset is realized, or the liability settled. The effect of a change in income tax rates on future income tax liabilities\nF 49\nand assets is recognized in income in the period that the change occurs. Future income tax assets are recognized to the extent that they are considered more likely than not to be realized.\nASC 740 clarifies the accounting for uncertainty in income taxes recognized in an enterprises financial statements. This standard requires a company to determine whether it is more likely than not that a tax position will be sustained upon examination based on the technical merits of the position. If the more-likely-than-not threshold is met, a company must measure the tax position to determine the amount to recognize in the financial statements.\nBecause of the implementation of this standard, the Company performed a review of its material tax positions in accordance with recognition and measurement standards established by ASC 740 and concluded that it had no uncertain tax positions as of December 31, 2022, or as of December 31, 2021.\nBasic and Diluted Income per Share\nThe Company computes income per share in accordance with ASC 260, \"Earnings per Share\", which requires the presentation of both basic and diluted earnings per share (EPS) on the face of the consolidated statement of operations. Basic EPS is computed by dividing income available to common stockholders by the weighted average number of shares outstanding during the period. Diluted EPS gives effect to all dilutive potential shares of common stock outstanding during the period using the treasury stock method and convertible preferred stock using the if-converted method. In computing diluted EPS, the average stock price for the period is used in determining the number of shares assumed to be purchased from the exercise of stock options or warrants. Diluted EPS excludes all dilutive potential shares if their effect is anti-dilutive. As of December 31, 2022 and 2021, the Company had 550,000 and 300,000 potentially dilutive common shares outstanding, respectively.\nAsset Retirement Obligations\nThe Company records the estimated fair value of obligations associated with the retirement of tangible, long-lived assets in the period in which they are incurred. When a liability is initially recorded, the Company capitalizes the cost by increasing the carrying amount of the related long-lived asset. Over time, the liability is accreted to its present value, and the capitalized cost is depleted over the useful life of the related asset.\nRevisions to estimated asset retirement obligations will result in an adjustment to the related capitalized asset and corresponding liability. Upon settlement of the liability, the Company either settles the obligation for its recorded amount or incurs a gain or loss. The Companys asset retirement obligation relates to the plugging, dismantling, removal, site reclamation, and similar activities of its oil and gas properties.\nAsset retirement obligations are estimated at the present value of expected future net cash flows and are discounted using the Companys credit adjusted risk free rate. The Company uses unobservable inputs in the estimation of asset retirement obligations that include, but are not limited to: costs of labor, costs of materials, profits on costs of labor and materials, the effect of inflation on estimated costs, and discount rate. Due to the subjectivity of assumptions and the relative long lives of the Companys leases, the costs to ultimately retire the Companys obligations may vary significantly from prior estimates. Assumptions used in determining estimates are reviewed annually.\nF 50\nConcentration of Credit Risk\nOur revenue can be materially affected by current economic conditions and the price of oil and natural gas. However, based on the current demand for crude oil and natural gas and the fact that alternative purchasers are readily available, we believe that the loss of our marketing agents and/or any of the purchasers identified by our marketing agents would not have a long-term material adverse effect on our financial position or results of international operations. The continued economic disruption resulting from Russias invasion of Ukraine, a potential global recession, and other varying macroeconomic conditions could materially impact the Company's business in future periods. Any potential disruption will depend on the duration and intensity of these events, which are highly uncertain and cannot be predicted at this time.\nNOTE 4 - RECENT ACCOUNTING PRONOUNCEMENTS\nManagement does not believe any recently issued but not yet effective accounting pronouncements if adopted, would have a material effect on the Companys present or future financial statements.\nNOTE 5 -ROYALTY INTERESTS IN OIL AND GAS PROPERTIES\n2022 Transactions\nOn November 8, 2022, the Company approved and authorized, by unanimous written consent, the issuance of 1,600,000 shares of common stock, $0.01 par value per share, valued at $2.10 per share, to Taxodium Energy LLC, a Mississippi limited liability company (Taxodium), in consideration for the sale and assignment of various mineral and oil and gas royalty interests in and to certain properties located in Mississippi and Alabama to Barrister Energy LLC, a wholly-owned subsidiary of the Company organized under the laws of Mississippi. This acquisition was effective as of October 1, 2022.\nDuring the year ended December 31, 2022, this property was impaired by $2,085,100.\nOn December 2, 2022, the Company approved and authorized, by unanimous written consent, the issuance of 1,500,000 shares of common stock, $0.01 par value per share, valued at $2.10 per share, to Taxodium. At the request and the instructions of Taxodium, the Company issued the Shares to all members of Taxodium on the pro rata basis of their ownership interest in Taxodium.\nThe Shares were issued by the Company in consideration of the sale and assignment of the wells, facilities, and all of the Assignors title, rights, and interest in and to certain properties located in Mississippi, collectively known as Buckley, to Barrister Energy LLC, a wholly-owned subsidiary of the Company organized under the laws of Mississippi. The Assignment was completed on December 2, 2022, with an effective date of October 15, 2022, for accounting purposes.\n2020 Transactions\nOn November 17, 2020, the Company completed the acquisition of Barrister Energy, LLC and the oil and gas properties of Barrister Energy, LLC, (the Acquisition). The acquired properties consist of 700 gross acres and include a 95% average working interest and a 79% average net revenue interest.\nThe Acquisition was recognized as an asset acquisition whereby CoJax recorded the assets acquired and the liabilities assumed at the historical cost to Barrister as of November 17, 2020. Revenues and related\nF 51\nexpenses for the Acquisition are included in our consolidated statement of operations beginning June 16, 2020, which is the date the Company obtained control of the properties.\nThe $2.7 million, zero interest, long-term note was payable to Central Operating, LLC at the signing of the Purchase and Sale Agreement on June 16, 2020. The note payable was settled through a debt exchange agreement on November 19, 2021, with the issuance of 1,350,000 shares of common stock. The Acquisition payable was settled at the closing on November 17, 2020, through the issuance of 3,650,000 shares of common stock. The Company incurred $620,500 in non-capitalizable acquisition-related costs, which were recognized in general and administrative expense during the year ended December 31, 2020.\nDuring the year ended December 31, 2022, this property was impaired by $1,824,600.\nAt December 31, 2022, and December 31, 2021, through the Companys acquisition of Barrister Energy, LLC had leased oil and gas properties assets valued at $5,505,457 and $2,779,802, respectively.\nAs of December 31, 2022\nAs of December 31, 2021\nBeginning balance\n$2,779,802\n$2,779,802\nAdditions to proved reserves\n6,556,187\n-\nRevisions of prior year ARO estimates\n(41,209)\nDepletion expense\n(39,623)\n-\nImpairment expense\n(3,909,700)\n-\nEnding Balance\n$5,345,457\n$2,779,802\nWe recorded depletion expense of $0.04 million and $0.0 million for the years ended December 31, 2022, and 2021, respectively.\nIn connection with fair value assessments for oil and gas proved properties, we recorded long-lived asset impairments of $3.9 million in our consolidated statement of operations.\nNOTE 6 - NOTES PAYABLE\nDecember 31,\nDecember 31,\nOn May 7, 2020, the Company applied for a Small Business Association (SBA) loan under the Paycheck Protection Program (PPP). The Company met all the necessary qualifications to apply for a $49,992 loan. On June 10, 2020, the SBA PPP loan was approved and transferred to the Company to be used for payment of accrued payroll and related payroll taxes. On November 29, 2021, the Company was notified that the request for forgiveness was denied. The note has been converted to a five-year loan at 1% interest beginning on January 1, 2022.\n$40,966\n$49,992\nOn May 4, 2021, the Company applied for a Small Business Association (SBA) loan under the Paycheck Protection Program (PPP). The Company met all the necessary qualifications to apply for a $41,665 loan. On May 9, 2021, the SBA PPP loan was approved and transferred to the Company to be used for payment of accrued payroll and related payroll taxes. We do not expect to be required to repay any portion of the loan. 100% of the funds were disbursed for salaries and payroll taxes in 2021.\n$-\n$41,665\nF 52\nNotes payable\n$40,966\n$91,657\nLess: current portion\n(10,242)\n(51,663)\nNotes payable net of current portion\n$30,724\n$39,994\nRelated Party\nThe Company was a party to several loans with related parties. The note holder is the CEO and Executive Chairman of the Company. At December 31, 2022, and 2021, notes payable consisted of the following:\nDecember 31,\nDecember 31,\nOn January 24, 2022, the Company's Executive Chairman loaned $20,000 to the Company, and the Company issued a promissory note for such amount. The promissory note is unsecured and bears interest at 2% per annum principal and accrued interest matures on January 24, 2023.\n$20,000\n$-\nOn April 21, 2022, the Company's Executive Chairman loaned $18,000 to the Company, and the Company issued a promissory note for such amount. The promissory note is unsecured and bears interest at 2% per annum principal and accrued interest matures on April 21, 2023.\n$18,000\n$-\nOn August 23, 2022, the Company's Executive Chairman loaned $20,000 to the Company, and the Company issued a promissory note for such amount. The promissory note is unsecured and bears interest at 2% per annum principal and accrued interest matures on August 23, 2023.\n$20,000\n$-\nOn September 15, 2022, the Company's Executive Chairman loaned $15,000 to the Company, and the Company issued a promissory note for such amount. The promissory note is unsecured and bears interest at 2% per annum principal and accrued interest matures on September 16, 2023.\n$15,000\n$-\nOn October 25, 2022, the Company's Executive Chairman loaned $20,000 to the Company, and the Company issued a promissory note for such amount. The promissory note is unsecured and bears interest at 2% per annum principal and accrued interest matures on October 25, 2023.\n$20,000\n$-\nOn December 8, 2022, the Company's Executive Chairman loaned $20,000 to the Company, and the Company issued a promissory note for such amount. The promissory note is unsecured and bears interest at 2% per annum principal and accrued interest matures on December 8, 2023.\n$20,001\n$-\nNotes payable - related party\n$113,001\n$-\nOn October 10, 2023, all outstanding notes with the Companys CEO and Executive Chairman were extended to have a maturity date of May 13, 2024.\nDuring the years ended December 31, 2022 and 2021 the Company recorded interest expense of $956 and $2,455, respectively.\nF 53\nNOTE 7 - RELATED PARTY TRANSACTIONS\nFor the year ending December 31, 2022, there were six related party transactions (see NOTE 6) between the Companys Executive Chairman and the Company. There were no other related party transactions between any of the Companys directors or executive officers or any person nominated or chosen by the Company to become a director or executive officer.\nFor the year ending December 31, 2021, there were no related party transactions (see NOTE 6) between the Companys Executive Chairman and the Company. There were no other related party transactions between any of the Companys directors or executive officers or any person nominated or chosen by the Company to become a director or executive officer.\nOn January 4, 2022, the Company issued 12,500 shares of Series A convertible preferred stock to Jeffrey J. Guzy, the Companys CEO, and 12,500 shares of Series A convertible stock to Wm. Barrett Wellman, the Companys CFO. Each share is convertible at the option of the holder to ten (10) shares of common stock. Since these shares were not issued until 2022 the fair value of $500,000 ($20 per share) has been recorded as part of accrued salaries and payroll taxes. The fair value was based on the value assigned to common stock ($2 per share) multiplied by 10.\nOn January 4, 2021, the Company issued 20,000 shares of Series A convertible preferred stock to Jeffrey J. Guzy, the Companys CEO, and 10,000 shares of Series A convertible stock to Wm. Barrett Wellman, the Companys CFO. Each share is convertible at the option of the holder to ten (10) shares of common stock. Since these shares were not issued until 2021 the fair value of $600,000 ($20 per share) has been recorded as part of accrued salaries and payroll taxes. The fair value was based on the value assigned to common stock ($2 per share) multiplied by 10.\nNOTE 8 - STOCKHOLDERS EQUITY\nAuthorized Capital\nThe Company has 300,000,000 authorized shares of Common Stock at $0.01 par value and 50,000,000 authorized shares of Preferred Stock at a par value of $0.10, and Series A convertible shares at a par value of $0.01. The Company had 9,114,446 and 5,780,576 shares of Common Stock issued and outstanding as of December 31, 2022 and 2021, respectively. The Company had 55,000 and 30,000 shares of Preferred Stock issued and outstanding as of December 31, 2022 and 2021, respectively.\nPreferred Stock\nThe holders of Preferred Stock are entitled to receive dividends equal to the amount of the dividend or distribution per share of common stock payable multiplied by the number of shares of common stock the shares of Series A preferred shares held by such holder are convertible into. Each Series A preferred shares is convertible into ten common shares.\nDuring the year ending December 31, 2022, the Company issued 25,000 shares of Series A convertible preferred stock to its officers for accrued compensation (see NOTE 7).\nDuring the year ending December 31, 2021, the Company issued 30,000 shares of Series A convertible preferred stock to its officers for accrued compensation (see NOTE 7).\nF 54\nCommon Stock\nOn October 1, 2022, the Company issued 1,600,000 shares as part of the NONOP acquisition. On October 15, 2022, the Company issued 1,500,000 shares as part of the Buckley acquisition.\nAdditionally during the year ended December 31, 2022, the Company issued 180,000 shares, 31,554 shares, and 22,315 shares for vendor payments at share prices of $2.00 per share, $2.12 per share, and $2.10 per share, respectively.\nDuring the year ending December 31, 2021, the Company issued 1,350,000 at $2.00 per share in a debt exchange.\nAdditionally, the Company issued 677,836 shares for vendor payments, 10,000 shares for stock-based compensation, and 66,240 shares for related party note payable debt exchange, all at $2.00 per share.\nThe above shares of capital stock are restricted securities under Rule 144 and were issued in reliance on an exemption from the registration requirements of the Securities Act.\nDuring the year ended December 31, 2021, the Company issued 17,500 shares at a share price of $2.00 for cash proceeds of $35,000.\nNOTE 9 - INCOME TAXES\nThe Company provides for income taxes using the liability method in accordance with ASC 740 Income Taxes. Deferred income taxes arise from the differences in the recognition of income and expenses for tax purposes. There were no deferred tax assets or liabilities at December 31, 2022 and 2021.\nManagement has reviewed the provisions regarding the assessment of their valuation allowance on deferred tax assets and based on those criteria determined that it would not have sufficient taxable income to realize those assets. Therefore, management has assessed the realization of the deferred tax assets and has determined that it is more likely than not that they will not be realized and has provided a full valuation allowance against the deferred tax asset.\nThe Company recognizes the financial statement effect of a tax position only after determining that the relevant tax authority would more likely than not sustain the position following an audit. For tax positions meeting the more-likely-than-not threshold, the amount recognized in the consolidated financial statements is the largest benefit that has a greater than 50 percent likelihood of being realized upon ultimate settlement with the relevant tax authority.\nThe Company is subject to income taxes in the U.S. federal jurisdiction and the state of Virginia. The tax regulations within each jurisdiction are subject to the interpretation of related tax laws and regulations and require significant judgment to apply. The Company is not presently undergoing any tax audits. As of December 31, 2022, the tax years that remain subject to examination are 2021, 2020, 2019, 2018, and 2017 for Federal and 2021, 2020, 2019, 2018, and 2017 for the state.\nThe Company will apply the federal and state net operating loss (NOL) carry-forward in FY 2022 and later years.\nF 55\nIncome Taxes\nOn December 22, 2017, the United States Government passed new tax legislation that, among other provisions, will lower the corporate tax rate from 35% to 21%. In addition to applying the new lower corporate tax rate in 2018 and thereafter to any taxable income we may have, the legislation affects the way we can use and carry forward net operating losses previously accumulated and results in a revaluation of deferred tax assets recorded on our balance sheet. Given that the deferred tax assets are offset by a full valuation allowance, these changes have no net effect on the Companys financial position and net loss. However, when we become profitable, we will receive a reduced benefit from such deferred tax assets.\nA reconciliation of the income tax provision computed at statutory rates to the reported tax provision is as follows:\nYear ended December 31, 2022\nYear ended December 31, 2021\nFederal income tax rate\n21.0%\n21.0%\nLoss before income taxes\n$(6,237,615)\n$(1,490,196)\nNon-deductible expenses\n-\n-\nTaxable loss\n$(6,237,615)\n$(1,490,196)\nExpected approximate tax recovery on net loss\n$(1,309,899)\n$(312,941)\nChanges in valuation allowance\n1,309,899\n312,941\nIncome tax\n$-\n$-\nThe component of the Companys deferred tax asset is as follows:\nAs of December 31, 2022\nAs of December 31, 2021\nDeferred income tax assets:\nNet operating losses carried forward\n$966,814\n$482,269\nImpairments\n821,037\n-\nOther\n19,370\n-\nTotal gross deferred income tax assets\n$1,807,222\n$482,269\nLess: valuation allowance\n(1,807,222)\n(482,269)\nNet deferred tax asset\n$-\n$-\nThe Company has a valuation allowance against the full amount of its net deferred tax assets due to the uncertainty of the realization of the deferred tax assets.\nAt December 31, 2022, and December 31, 2021, the Company has incurred accumulated net operating losses in the United States of America totaling $4,603,877 and $2,896,524 respectively which are available to reduce taxable income in future taxation years.\nF 56\nNOTE 10 - COMMITMENTS AND CONTINGENCIES\nOperating Lease Commitments\nThe Company has no lease obligations at December 31, 2022 and 2021. The Company has a month-to-month rental agreement for an office share in Arlington, Virginia beginning on April 1, 2018, for $50 per month. Additionally, the Company has no known contingencies as of December 31, 2022, and December 31, 2021.\nPurchase Commitments\nThe Company has no purchase obligations at December 31, 2022 and 2021.\nSignificant Risks and Uncertainties\nConcentration of Credit Risk - Cash - The Company maintains cash and cash equivalent balances at a single financial institution that are insured by the Federal Deposit Insurance Corporation (FDIC) up to $250,000. At December 31, 2022, and December 31, 2021, the Company had no exposure in excess of insurance.\nConcentration of Credit Risk - Accounts Receivable - All of the Companys outstanding accounts receivable was with one party, Taxodium Energy, LLC.\nLegal Matters\nDuring the course of business, litigation commonly occurs. From time to time, the Company may be a party to litigation matters involving claims against the Company. The Company operates in a highly regulated industry and employs personnel, which may inherently lend itself to legal matters. Management is aware that litigation has associated costs and that results of adverse litigation verdicts could have a material effect on the Company's financial position or results of operations.\nThere are no known legal proceedings against the Company or its officers and directors in their capacity as officers and directors of the Company.\nNOTE 11 - ASSET RETIREMENT OBLIGATION\nChanges in the asset retirement obligation were as follows:\nAs of December 31, 2022\nAs of December 31, 2021\nBeginning balance\n$84,566\n$82,149\nLiabilities acquired\n-\n-\nLiabilities incurred\n46,397\n-\nLiabilities settled\n-\n-\nAccretion expense\n2,698\n2,416\nRevisions\n(41,420)\n-\nEnding Balance\n$92,241\n$84,566\nF 57\nNOTE 12 - RESERVE AND RELATED FINANCIAL DATA - UNAUDITED\nDisclosure of Reserves\nThe table below summarizes our estimated net proved reserves, as of December 31, 2022, based on a reserve report prepared by Netherland Sewell & Associates, Inc. (NSAI), our third-party independent reserve engineers. In preparing its report, NSAI evaluated properties representing all of our proved reserves at December 31, 2022 in accordance with the rules and regulations of the SEC applicable to companies involved in oil and natural gas producing activities. Our estimated net proved reserves in the table below do not include probable or possible reserves and do not in any way include or reflect our commodity derivatives.\nAs of December 31, 2022\nProved Reserves\nDeveloped\nNatural Gas (Mmcf)\nOil (Mbbl)\nUndeveloped\nNatural Gas (Mmcf)\n-\nOil (Mbbl)\n-\nTotal Proved Reserves (BOE)\nThe table above values oil and natural gas reserve quantities as of December 31, 2022, assuming constant realized prices of $92.01 per barrel of oil and $6.957 per Mcf of natural gas. Under SEC guidelines, these prices represent the average prices per barrel of oil and per Mcf of natural gas at the beginning of each month in the 12-month period prior to the end of the reporting period, after adjustment to reflect applicable transportation and quality differentials.\nStandardized Measure\nThe standardized measure of discounted future net cash flows and changes in such cash flows are prepared using assumptions required by the Financial Accounting Standards Board. Such assumptions include using 12-month average prices for oil and gas, based on the first-day-of-the-month price for each month in the period, and year-end costs for estimated future development and production expenditures to produce year-end estimated proved reserves.\nDiscounted future net cash flows are calculated using a 10% rate. Estimated future income taxes are calculated by applying year-end statutory rates to future pre-tax net cash flows, less the tax basis of related assets and applicable tax credits.\nThe estimated well abandonment costs are deducted from the standardized measure using year-end costs and discounted at 10%. Such abandonment costs are recorded as a liability on the consolidated balance sheet, using estimated values as the projected abandonment date and discounted using a risk-adjusted rate when the well is drilled or acquired.\nF 58\nThe standardized measure does not represent managements estimate of the Companys future cash flows or the value of proved oil and gas reserves. Probable and possible reserves, which may become proved in the future, are excluded from the calculations. Furthermore, prices used to determine the standardized measure are influenced by supply and demand as affected by recent economic conditions and other factors and may not be the most representative in estimating future revenues or reserve data.\nThe table below reflects the standardized measure of discounted future net cash flows related to the Companys interest in proved reserves.\nYear Ended December 31, 2022\n(in thousands)\nFuture cash inflows\n$17,680\nFuture production costs\n3,192\nFuture development and abandonment costs\nFuture tax expense\n2,941\nFuture net cash flows\n11,062\n10% annual discount for estimated timing of cash flows\n4,305\nStandardized measure of discounted future net cash flows\n$6,757\nThe principal changes in the standardized measure of discounted future net cash flows attributable to the Company's proved reserves are as follows:\nYear Ended December 31, 2022\n(in thousands)\nBalance at December 31, 2021\n$-\nPurchase of minerals in place\n6,002\nNet change due to extensions, discoveries and improved recovery\nBalance at December 31, 2022\n$6,757\nNOTE 13 - SUBSEQUENT EVENTS\nThe Company has evaluated all events that occurred after the balance sheet date through the date when the financial statements were issued to determine if they must be reported. The management of the Company determined that there were no reportable subsequent events to be disclosed beyond the following:\nIssuance of Preferred Stock\nOn January 25, 2023, the Company issued 25,000 shares of its Series A convertible preferred stock to Jeffrey J. Guzy, the Companys CEO, and 25,000 shares of Series A convertible stock to Wm. Barrett Wellman, the Companys CFO. Each share is convertible at the option of the holder to ten (10) shares of common stock. Since these shares were not issued until 2023 the total fair value of $1,064,500 ($21.30\nF 59\nper share) has been recorded as part of accrued salaries and payroll taxes. The fair value was based on the value assigned to common stock ($2.13 per share) multiplied by 10.\nIssuance of Common Stock\nOn January 31, 2023, the Company issued 20,642 shares for vendor payments at $2.13 per share.\nOn February 1, 2023, the Company issued 120,000 shares for consulting fees at $2.13 per share.\nOn March 1, 2023, the Company issued 5,000 shares of common stock at $2.00 per share.\nOn June 1, 2023, the Company issued 14,217 shares for vendor payments at $2.20 per share.\nOn June 12, 2023, the Company issued 35,000 shares for payment to William R. Downs at $2.00 per share.\nOn July 23, 2023, the Company issued 7,107 shares for vendor payments at $2.20 per share.\nOn August 20, 2023, the Company issued 4,409 shares for vendor payments at $1.00 per share.\nRelated Party Notes Payable\nOn October 10, 2023, all outstanding notes with the Companys CEO and Executive Chairman were extended to have a maturity date of May 13, 2024.\nF 60 ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone. ITEM 9A. CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nWe maintain disclosure controls and procedures (as that term is defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934, as amended (the Exchange Act)) that are designed to ensure that information required to be disclosed in our reports under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in the SECs rules and forms, and that such information is accumulated and communicated to our management, including our principal executive officer and principal financial officer, as appropriate, to allow timely decisions regarding required disclosures. In designing disclosure controls and procedures, our management necessarily was required to apply its judgment in evaluating the cost-benefit relationship of possible disclosure controls and procedures. The design of any disclosure controls and procedures also is based in part upon certain assumptions about the likelihood of future events, and there can be no assurance that any design will succeed in achieving its stated goals under all potential future conditions. Any controls and procedures, no matter how well designed and operated, can provide only reasonable, not absolute, assurance of achieving the desired control objectives.\nOur management, with the participation of our principal executive officer and principal financial officer, has evaluated the effectiveness of the design and operation of our disclosure controls and procedures as of the end of the period covered by this report. Based upon that evaluation and subject to the foregoing, our principal executive officer and principal financial officer concluded that, our disclosure controls and procedures were not effective as of December 31, 2022, due to the material weaknesses in internal control over financial reporting described below.\nManagements Report on Internal Control Over Financial Reporting\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting. The Companys internal control over financial reporting is a process designed under the supervision of its principal executive and principal financial officer to provide reasonable assurance regarding the reliability of financial reporting and the preparation of its consolidated financial statements for external reporting purposes in accordance with GAAP.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. In addition, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions or that the degree of compliance with the policies or procedures may deteriorate.\nMaterial Weaknesses in Internal Control over Financial Reporting\nManagement assessed the effectiveness of the Companys internal control over financial reporting as of December 31, 2022, based on the framework established in Internal Control-Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission.\nF 61\nBased on this assessment, management has determined that the Companys internal control over financial reporting as of December 31, 2022, was not effective.\nA material weakness, as defined in the standards established by the Sarbanes-Oxley Act of 2002 (the Sarbanes-Oxley Act), is a deficiency, or a combination of deficiencies, in internal control over financial reporting such that there is a reasonable possibility that a material misstatement of our annual or interim consolidated financial statements will not be prevented or detected on a timely basis.\nThe ineffectiveness of the Companys internal control over financial reporting was due to the following material weaknesses:\n·Inadequate segregation of duties consistent with control objectives;\n·Lack of formal policies and procedures;\n·Lack of a functioning audit committee and independent directors on the Companys board of directors to oversee financial reporting responsibilities; and\n·Lack of risk assessment procedures on internal controls to detect financial reporting risks on a timely manner.\nManagements Plan to Remediate the Material Weakness\nManagement has been implementing and continues to implement measures designed to ensure that control deficiencies contributing to the material weakness are remediated, such that these controls are designed, implemented, and operating effectively. The remediation actions planned include:\n·Continue to search for and evaluate qualified independent outside directors;\n·Identify gaps in our skills base and the expertise of our staff required to meet the financial reporting requirements of a public company; and\n·Continue to develop policies and procedures on internal control over financial reporting and monitor the effectiveness of operations on existing controls and procedures.\nWe are committed to maintaining a strong internal control environment and believe that these remediation efforts will deliver improvements in our control environment. Our management will continue to monitor and evaluate the relevance of our risk-based approach and the effectiveness of our internal controls and procedures over financial reporting on an ongoing basis and is committed to taking further action and implementing additional enhancements or improvements, as necessary and as funds allow.\nThis Annual Report does not include an attestation report of the Companys independent registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by the Companys independent registered public accounting firm pursuant to temporary rules of the Securities and Exchange Commission that permit the Company to provide only managements report in this Annual Report, which may increase the risk that weaknesses or deficiencies in our internal control over financial reporting go undetected.\nChanges in Internal Control Over Financial Reporting\nThere were no changes in our internal control over financial reporting that occurred during our fourth fiscal quarter that have materially affected, or that are reasonably likely to materially affect, our internal control over financial reporting. ITEM 9B. OTHER INFORMATION\nNone.\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNone.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS, AND CORPORATE GOVERNANCE\nExecutive Officers and Directors\nThe following table sets forth information regarding our current directors and executive officers:\nName\nAge\nPosition\nJeffrey J. Guzy\nChief Executive Officer, Director\nWm. Barrett Wellman\nChief Financial Officer\nWilliam Allan Bradley\nDirector\nOur directors hold office until the next annual meeting of stockholders of the Company and until their successors have been elected and qualified. Our officers are elected by the Board and serve at the discretion of the Board.\nBiographies\nMr. Guzy, age 72, has been our Chief Executive Officer since January 22, 2020, and a director since November 17, 2017. He served as our Chief Financial Officer from November 17, 2017, through March 16, 2020.\nMr. Guzy has served as an outside director of Leatt Corp. (OTC Trading Symbol: LEAT), since April 2007. Mr. Guzy also served, from October 2007 to August 2010, as Leatt Corps President. Mr. Guzy has served as an executive manager or consultant for business development, sales, customer service, and management in the telecommunications industry, specifically, with IBM Corp., Sprint International, Bell Atlantic Video Services, Loral CyberStar, and FaciliCom International. Mr. Guzy has also started his own telecommunications company providing Internet services in Western Africa. He serves as an independent director and chairman of the audit committee of Capstone Companies, Inc. (OTC Trading Symbol: CAPC), Since 2020, he has also served as an independent director of Brownies Marine Group, Inc. (OTC Trading Symbol: BWMG). Mr. Guzy has an MBA in Strategic Planning and Management from The Wharton School of the University of Pennsylvania, an M.S. in Systems Engineering from the University of Pennsylvania; a B.S. in Electrical Engineering from Penn State University; and a Certificate in Theology from Georgetown University. Mr. Guzys management and extensive experience led to the conclusion that he should serve as a director.\nMr. Wellman, age 75, has been our Chief Financial Officer since March 16, 2020. Mr. Wellman has over 30 years of business experience as an accountant, controller, chief financial officer, chief information officer, and senior executive for various companies and two large accounting firms. Since 2006, Mr. Wellman has maintained a financial consulting business in Arlington, Virginia. He has an MBA from Marshall University and a B.S. in Accounting from the University of Charleston.\nMr. Bradley, age 56, has served as our director since March 7, 2022. Mr. Bradley has over fifteen years of leadership, business consulting, financial, and management experience for publicly traded and private companies. Since June 2011, Mr. Bradley served as M&A/Business Consulting Managing Director and Chief Financial Officer at Global Advisors Inc. where he provided business consulting services,\nreviewed clients financial positions and managed relationships, conducted financial reviews, including the PCAOB or IFRS audit process, and provided his consulting business advice on restructuring and potential mergers and acquisitions. Since September 2018 he has served as the Chairman of the Board of Magagram Social Media Inc., a Toronto-based private company, from December 2006 to June 2011 as Chief Executive Officer of Ocean to Ocean Inc., and from January 2002 until November 2006, as Vice President of Gourmet Foods International. Mr. Bradley graduated from York University in 1998 in Finance and Economics and received his undergraduate degree with honors in 1991 in Business Finance from Sandford College.\nBoard Committees\nWe currently do not have any committees of our Board of Directors.\nFamily Relationships\nThere are no family relationships among any of our officers or directors.\nCode of Ethics\nWe have adopted a Code of Business Conduct and Ethics that applies to our principal executive, financial and accounting officers (or persons performing similar functions).\nInvolvement in Certain Legal Proceedings\nTo our knowledge, our directors and executive officers have not been involved in any of the following events during the past ten years:\n1.any bankruptcy petition filed by or against such person or any business of which such person was a general partner or executive officer either at the time of the bankruptcy or within two years prior to that time;\n2.any conviction in a criminal proceeding or being subject to a pending criminal proceeding (excluding traffic violations and other minor offenses);\n3.being subject to any order, judgment, or decree, not subsequently reversed, suspended or vacated, of any court of competent jurisdiction, permanently or temporarily enjoining him from or otherwise limiting his involvement in any type of business, securities or banking activities or to be associated with any person practicing in banking or securities activities;\n4.being found by a court of competent jurisdiction in a civil action, the SEC or the Commodity Futures Trading Commission to have violated a Federal or State securities or commodities law, and the judgment has not been reversed, suspended, or vacated;\n5.being subject of, or a party to, any Federal or State judicial or administrative order, judgment decree, or finding, not subsequently reversed, suspended, or vacated, relating to an alleged violation of any Federal or state securities or commodities law or regulation, any law or regulation respecting financial institutions or insurance companies, or any law or regulation prohibiting mail or wire fraud or fraud in connection with any business entity; or\n6.being subject of or party to any sanction or order, not subsequently reversed, suspended, or vacated, of any self-regulatory organization, any registered entity, or any equivalent exchange, association, entity or organization that has disciplinary authority over its members or persons associated with a member.\nCompensation of Directors\n2022 Director Compensation Table\nName\nFees\nEarned\nor Paid\nin Cash\nStock\nAwards\nOption Awards\nNon-Equity\nIncentive Plan\nCompensation\nNonqualified\nDeferred\nCompensation Earnings\nAll Other\nCompensation\nTotal\nJeffrey J. Guzy\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\nWilliam A. Bradley\n10,000\n-\n-\n-\n-\n-\nFor the years ended December 31, 2022, and 2021, no compensation has been paid to our directors in consideration for their services rendered in their capacities as directors.\nOutstanding Equity Awards at Fiscal Year-End\nThere are no current outstanding equity awards to our executive officers as of December 31, 2022.\nLong-Term Incentive Plans\nThere are no arrangements or plans in which we provide pension, retirement, or similar benefits for directors or executive officers. ITEM 11. EXECUTIVE COMPENSATION\nThe following table sets forth information concerning all cash and non-cash compensation awarded to, earned by or paid to our Chief Executive Officer and the other executive officer with compensation exceeding $100,000 during 2022 and 2021 (each a Named Executive Officer).\nSUMMARY COMPENSATION TABLE\nName and Principal Position\nYear\nSalary\n($)\nBonus\n($)\nOption Awards\n($)(2)\nAll Other\nCompensation ($)\nTotal\n($)\nJeffrey J. Guzy(1)\n$120,000\n$-\n$-\n$-\n$-\n$120,000\n$-\n$-\n$-\n$-\nWm. Barrett Wellman (2)\n$100,000\n$-\n$-\n$-\n$-\n$100,000\n$-\n$-\n$-\n$-\n(1) Mr. Guzy was appointed Chief Executive Officer on January 22, 2020. Jeffrey Guzy has a base annual salary of $120,000, payable on a semi-monthly basis in equal installments, but the base salary is deferred until the Company has sufficient cash flow to pay the base salary. Further, the base salary can either be paid in total when Company is adequately funded, or the accrued unpaid base salary can be converted into shares of the CoJax Common Stock at the lower conversion price of the initial public offering price of $2.00 or current market price at the time of conversion by Mr. Guzy.\n(2) Mr. Wellman was appointed Chief Financial Officer on March 16, 2020. Mr. Wellmans base salary is $100,000, payable semi-monthly in equal installments, but the base salary is deferred until the Company has sufficient cash flow to pay the base\nsalary. Alternatively, the accrued unpaid base salary can be converted into shares of the CoJax Common Stock at the lower conversion price of the initial public offering price of $2.00 or current market price at the time of conversion by Mr. Wellman.\nEmployment Agreements with Key Executives\nJeffrey Guzys employment agreement dated January 24, 2020, provides, in part, for:\n(1)the term of the employment agreement is three years;\n(2)a base annual salary of $120,000 payable semi-monthly in equal installments, but the base salary is deferred and only will be paid when the Company is adequately funded, or the accrued unpaid base salary can be converted into shares of the CoJax Common Stock at the lower conversion price of the initial public offering price of $2.00 or current market price at the time of conversion by Mr. Guzy;\n(3)Mr. Guzy is eligible for an ad hoc performance bonus if and in an amount approved by the disinterested directors when and if CoJax appoints disinterested directors;\n(4)Mr. Guzy may participate in any incentive compensation and other benefit plans to the extent that he is eligible to do so;\n(5)continuation of Mr. Guzys under the Companys health insurance and other benefit plans for 24 months after any termination of his employment for a good reason (as defined in the employment agreement);\n(6)imposes confidentiality and non-recruitment of Company employees obligations on Mr. Guzy for one year after the end of employment;\n(7)the employment agreement provides that the Company can terminate Mr. Guzys employment for cause (as defined in the employment agreement) and for Mr. Guzy to terminate the employment agreement for good reason (as defined in the employment agreement); and\n(8)If Mr. Guzy terminates the employment for a good reason, then he would be entitled to: A cash payment, payable in equal installments over a six (6) month period after Mr. Guzy terminates employment, equal to the sum of the following:\nBase Annual Salary. Subject to the payment of the following sums not causing the insolvency of the Company, the equivalent of the greater of (i) twenty-four (24) months of Mr. Guzys then-current base salary or (ii) the remainder of the term of the employment agreement (the \"Severance Period\"); plus\nEarned but Unpaid Amounts. Any previously earned but unpaid salary through Mr. Guzys final date of employment, being Mr. Guzys termination of employment.\nFurther, the employment agreement also provides the following indemnification to Mr. Guzy: CoJax shall indemnify and save harmless Mr. Guzy for any liability incurred by reason of any act or omission performed by Mr. Guzy while acting in good faith on behalf of the Company. Within the scope of the authority of his pursuant to the employment agreement and the fullest extent provided under the CoJax Bylaws, the CoJax Amended and Restated Articles of Incorporation and the Virginia Stock Corporation Act, except that Mr. Guzy must have in good faith believed that such action was in, or not opposed to, the best interests of CoJax, and, with respect to any criminal action or proceeding, had no reasonable cause to believe that such conduct was unlawful. No indemnification barred by regulations or policies of the SEC or in clear violation of public policy will be permitted under the employment agreement.\nOn February 14, 2023, the Company entered into a new employment agreement with Mr. Guzy (the Guzy 2023 Employment Agreement), pursuant to which Mr. Guzy will continue serving the Company as Chief Executive Officer, President and Chairman of the Company. The Guzy 2023 Employment Agreement has a 3-year term through February 14, 2026, unless terminated earlier pursuant to the terms of the Guzy\n2023 Employment Agreement. Pursuant to the Guzy 2023 Employment Agreement, Mr. Guzy will be paid a base salary of $120,000 per annum, which salary will accrue and can either be paid in total when the Company is adequately funded or, alternatively, the accrued unpaid base salary can be converted into shares of the Companys common stock at the lower conversion price of the initial public offering price of $2.00 or current market price at the time of conversion by Mr. Guzy. Pursuant to the Guzy 2023 Employment Agreement, Mr. Guzy may participate in any incentive compensation and other benefit plans may be granted bonus performance bonus payments to be paid in cash, stock, or both. In addition, the Guzy 2023 Employment Agreement includes provisions for paid vacation time and expense reimbursement.\nThe Guzy 2023 Employment Agreement may be terminated (i) immediately upon Mr. Guzys death or Disability; (ii) by the Company for Cause; (iii) by Mr. Guzy for Good Reason (as these terms are defined in the Guzy 2023 Employment Agreement or (iv) other than for Cause or Good Reason, by Mr. Guzy or the Company upon not less than sixty (60) days prior written notice of termination. If Mr. Guzy terminates the employment for a Good Reason, then he would be entitled to: a cash payment, payable in equal installments over a six (6) month period after Mr. Guzy terminates employment, equal to the sum of the following: (a) subject to the payment of the following sums not causing the insolvency of the Company, the equivalent of the greater of (i) twenty-four (24) months of Mr. Guzys then-current base salary or (ii) the remainder of the term of the Guzy 2023 Employment Agreement; plus (b) any previously earned but unpaid salary through Mr. Guzys final date of employment, being Mr. Guzys termination of employment.\nWm. Barrett Wellmans employment agreement, dated March 16, 2020, provides for:\nCoJax signed an employment agreement for Mr. Wellman's services as Chief Financial Officer on March 16, 2020. Under the employment agreement:\n(1)the term of the employment agreement is 3 years;\n(2)a base annual salary of $100,000 payable semi-monthly in equal installments, but the base salary can either be paid in total when CoJax is adequately funded or, alternatively, the accrued unpaid base salary can be converted into shares of the CoJax common stock at the lower conversion price of the initial public offering price of $2.00 or current market price at the time of conversion by Mr. Wellman;\n(3)Mr. Wellman is eligible for an ad hoc performance bonus if and in an amount approved by the disinterested directors;\n(4)Mr. Wellman may participate in any incentive compensation and other benefit plans to the extent that he is eligible to do so;\n(5)continuation of Mr. Wellmans benefits under CoJaxs health insurance and other benefit plans for 24 months after any termination of his employment for good reason (as defined in the employment agreement);\n(6)imposes confidentiality and non-recruitment of Company employees obligations on Mr. Wellman for one year after end of employment, and\n(7)the employment agreement provides for CoJax to terminate Mr. Wellmans employment for cause (as defined in the employment agreement) and for Mr. Wellman to terminate the employment agreement for good reason (as defined in the employment agreement).\nMr. Wellmans unpaid base salary is deferred if unpaid at the time due.\nIf Mr. Wellman terminates the employment for a good reason, then he would be entitled to: A cash payment, payable in equal installments over a six (6) month period after Mr. Wellman terminates employment, equal to the sum of the following:\nBase Annual Salary. Subject to the payment of the following sums subject to not causing the insolvency of the Company, the equivalent of the greater of (i) twenty-four (24) months of Mr. Wellmans then-current base salary or (ii) the remainder of the term of the employment agreement (the \"Severance Period\"); plus\nEarned but Unpaid Amounts. Any previously earned but unpaid salary through Mr. Wellmans final date of employment, Mr. Wellmans termination of employment.\nThe employment agreement also provides the following indemnification to Mr. Wellman: The Company shall indemnify and save harmless Mr. Wellman for any liability incurred by reason of any act or omission performed by Mr. Wellman while acting in good faith on behalf of the Company. Within the scope of the authority of his pursuant to the employment agreement and the fullest extent provided under the CoJax Bylaws, the CoJax Amended and Restated Articles of Incorporation and the Virginia Stock Corporation Act, except that Mr. Wellman must have in good faith believed that such action was in, or not opposed to, the best interests of the Company, and, with respect to any criminal action or proceeding, had no reasonable cause to believe that such conduct was unlawful. No indemnification barred by regulations or policies of the SEC or in clear violation of public policy will be permitted under the employment agreement.\nMr. Wellmans Employment Agreement has been extended to a termination date of August 16, 2024.\nDirector Compensation\nJeffrey Guzy did not receive any cash compensation for his role as a director for the year ended December 31, 2022. See ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe following table lists, as of November 16, 2023 the number of shares of common stock beneficially owned by (i) each person, entity or group (as that term is used in Section 13(d)(3) of the Securities Exchange Act of 1934) known to the Company to be the beneficial owner of more than 5% of the outstanding common stock; (ii) each of our directors (iii) each of our Named Executive Officers and (iv) all executive officers and directors as a group. Information relating to beneficial ownership of common stock by our principal stockholders and management is based upon information furnished by each person using beneficial ownership concepts under the rules of the SEC. Under these rules, a person is deemed to be a beneficial owner of a security if that person directly or indirectly has or shares voting power, which includes the power to vote or direct the voting of the security, or investment power, which includes the power to dispose or direct the disposition of the security. The person is also deemed to be a beneficial owner of any security of which that person has a right to acquire beneficial ownership within 60 days. Under the SEC rules, more than one person may be deemed to be a beneficial owner of the same securities, and a person may be deemed to be a beneficial owner of securities as to which he or she may not have any pecuniary interest. Except as noted below, each person has sole voting and investment power with respect to the shares beneficially owned and each stockholders address is c/o CoJax Oil and Gas Corporation, 3033 Wilson Boulevard, Suite E-605, Arlington, Virginia 22201. The percentages below are calculated based on 9,315,902 shares of common stock issued and outstanding as of November xx, 2023.\nName of Beneficial Owner\nShares\nPercentage\nExecutive Officers and Directors:\nJeffrey J. Guzy (1)\n646,241\n4.25%\nWm. Barrett Wellman (2)\n480,000\n2.47%\nWilliam Allan Bradley\n10,000\n0.11%\nTotal (3 persons)\n1,136,241\n6.83%\nRoger Allums McLeod\n2,920,000\n31.34%\nRosswood Capital LLC(3)\n1,350,000\n14.49%\nStone Creek Properties, LLC (4)\n889,559\n9.55%\nStonefield Fund LLC (5)\n755,000\n8.10%\nQuantoleum Holdings LLC (6)\n552,274\n5.93%\nKhaki Investments LLC (7)\n575,000\n6.17%\n1) Includes 575,000 shares of common stock issuable upon conversion of 57,500 shares of Series A Convertible Preferred Stock that can be converted at any time. Each share of the Series A Convertible Preferred Stock is convertible at the option of the holder thereof to ten (10) shares of common stock.\n(2) Includes 47,500 shares of common stock issuable upon conversion of 22,500 shares of Series A Convertible Preferred Stock. Each share of the Series A Convertible Preferred Stock is convertible at the option of the holder thereof to ten (10) shares of common stock.\n(3) Peter Biglane is the Manager of Rosswood Capital LLC and has sole voting and dispositive power over the shares held by Rosswood Capital LLC.\n(4) David Sullivan is the Manager of Stone Creek Properties LLC and has sole voting and dispositive power over the shares held by Stone Creek Properties LLC.\n(5) Alfonso Rivera Revilla is the Manager of Stonefield Fund LLC and has sole voting and dispositive power over the shares held by Stonefield Fund LLC.\n(6) Andrew Cardwell is the Manager of Quantoleum Holdings LLC and has sole voting and dispositive power over the shares held by Quantoleum Holdings LLC.\n(7) Sophie Biglane is the Manager of Khaki Investments LLC and has sole voting and dispositive power over the shares held by Khaki Investments LLC.\nChanges in Control Agreements.\nAs of December 31, 2022, we are not aware of any arrangements that may result in changes in control, as that term is defined by the provisions of Item 403(c) of Regulation S-K. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nIn addition to the executive officer compensation arrangements discussed in Executive Compensation, below we describe transactions since incorporation, in which we have been a participant, in which the amount involved in the transaction is material to our Company, and in which any of the following is a party:\n(a)enterprises that directly or indirectly through one or more intermediaries, control or are controlled by, or are under common control with, our Company;\n(b)associates;\n(c)individuals owning, directly or indirectly, an interest in the voting power of our Company that gives them significant influence over our Company, and close members of any such individuals family;\n(d)key management personnel, that is, those persons having authority and responsibility for planning, directing, and controlling the activities of our Company, including directors and senior management of companies and close members of such individuals families; and\n(e)enterprises in which a substantial interest in the voting power is owned, directly or indirectly, by any person described in (c) or (d) or over which such a person is able to exercise significant influence.\nReview, Approval, and Ratification of Related Party Transactions\nGiven our small size and limited financial resources, we have not adopted formal policies and procedures for the review, approval, or ratification of transactions, such as those described above, with our executive officer(s), Director(s), and significant stockholders. We intend to establish formal policies and procedures in the future, once we have sufficient resources and have appointed additional Directors, so that such transactions will be subject to the review, approval, or ratification of our Board of Directors, or an appropriate committee thereof. On a moving forward basis, our Directors will continue to approve any related party transaction.\nLegal Proceedings\nWe know of no material, active, pending, or threatened to proceed against us or our subsidiaries, nor are we, or any subsidiary, involved as a plaintiff or defendant in any material proceeding or pending litigation. ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES\nAudit and Accounting Fees\nThe Board of the Company has appointed Sadler, Gibb & Associates, LLC (S|G) as our independent registered public accounting firm for the fiscal year ended December 31, 2022. Haynie & Company CPAs PC (Haynie) was our independent registered public accounting firm for the fiscal year ended December 31, 2021. The following table sets forth the fees billed to the Company for professional services rendered by S|G and Haynie for each of the years ended December 31, 2022, and 2021, respectively:\nServices\nAudit fees\n$41,000\n$21,000\nAudit related fees\n-\n-\nTax fees\n-\n-\nAll other fees\n-\n-\nTotal fees\n$41,000\n$21,000\nAudit Fees\nThe aggregate audit fees billed and unbilled for the fiscal years ended December 31, 2022, and 2021 were for professional services rendered by Haynie for the audits of our annual consolidated financial statements, the audit of our consolidated financial statements included in our registration statement on Form S-1 and the Form 10-K.\nTax Fees\nThe Company did not incur any aggregate tax fees billed and unbilled for the fiscal years ended December 31, 2022, and 2021.\nOther Fees\nThe Company did not incur any other fees related to services rendered by our principal accountant for the fiscal years ended December 31, 2022, and 2021.\nEffective May 6, 2003, the Securities and Exchange Commission adopted rules that require that before our auditor is engaged by us to render any auditing or permitted non-audit related service, the engagement be:\n·approved by our audit committee; or\n·entered into pursuant to pre-approval policies and procedures established by the audit committee, provided that the policies and procedures are detailed as to the particular service, the audit committee is informed of each service, and such policies and procedures do not include delegation of the audit committees responsibilities to management.\nWe do not have an audit committee. Our entire board of directors pre-approves all services provided by our independent auditors.\nAll of the above services and fees were reviewed and approved by the entire board of directors before the respective services were rendered.\nPART IV ITEM 15. EXHIBITS, FINANCIAL STATEMENT SCHEDULES\nThe following exhibits are included with this Annual Report:\nExhibit No.\nDescription\n3.1\nArticles of Incorporation of CoJax Oil and Gas Corporation (incorporated by reference to Exhibit 3.1 to the Form S-1 Registration Statement filed with the Commission on July 26, 2019)\n3.2\nAmended and Restated Articles of Incorporation of CoJax Oil and Gas Corporation (incorporated by reference to Exhibit 3.1.1 to the Form S-1 Registration Statement filed with the Commission on July 26, 2019)\n3.3\nAmendment to Amended and Restated Articles of Incorporation of CoJax Oil and Gas Corporation with the Designation of Series A Convertible Preferred Stock, $0.01 par value per share, dated January 23, 2020 (incorporated by reference to Exhibit 3.1 to the Current Report on Form 8-K filed with the Commission on January 31, 2020)\n3.4\nAmendment to Amended and Restated Articles of Incorporation of CoJax Oil and Gas Corporation dated June 12, 2020 (incorporated by reference to Exhibit 3.1.2 to the Form S-1 Registration Statement filed with the Commission on September 25, 2020)\n3.5\nBy-Laws (incorporated by reference to Exhibit 3.2 to the Form S-1 Registration Statement filed with the Commission on July 26, 2019)\n4.1\nSpecimen Common Stock Certificate (incorporated by reference to Exhibit 4.1 to the Form S-1 Registration Statement filed with the Commission on July 26, 2019)\n4.2\nDescription of Securities (incorporated by reference to Exhibit 4.1 to the Form S-1 Registration Statement filed with the Commission on July 26, 2019)\n10.1\nEmployment Agreement between CoJax Oil and Gas Corporation and Jeffrey J. Guzy (incorporated by reference to Exhibit 10.1 to the Form 8-K filed with the Commission on January 22, 2020)\n10.2\nEmployment Agreement by CoJax Oil and Gas Corporation and Jeffrey Delancey dated May 15, 2018 (incorporated by reference to Exhibit 10.3 to the Form S-1 Registration Statement filed with the Commission on July 26, 2019)\n10.3\nAcquisition Agreement, dated June 16, 2020, by and among CoJax Oil and Gas Corporation, Barrister Energy, LLC., and all of the Members of Barrister Energy, LLC (incorporated by reference to Exhibit 2.1 to the Form 8-K filed with the Commission on June 22, 2020)\n10.4\n2018 Equity Incentive Plan (incorporated by reference to Exhibit 10.5 to the Form S-1 Registration Statement filed with the Commission on July 26, 2019)\n10.5\nInvestment Banking/Corp Advisory Agreement by Newbridge Securities Corporation and CoJax Oil and Gas Corporation, dated March 14, 2019 (incorporated by reference to Exhibit 10.7 to the Form S-1 Registration Statement filed with the Commission on July 26, 2019)\n10.6\nEmployment Agreement by CoJax Oil and Gas Corp. and Wm. Barrett Wellman, dated March 16, 2020 (incorporated by reference to Exhibit 10.1 to Form 8-K filed with Commission on March 23, 2020)\n10.9\nAssignment and Assumption of Promissory Note, dated June 16, 2020, by CoJax Oil and Gas Corporation and Barrister Energy, LLC (incorporated by reference to Exhibit 2.4 to the Form 8-K filed with the Commission on June 22, 2020)\n10.10\nDebt Exchange Agreement, dated November 16, 2021, by and between the Company and Central Operating, LLC (incorporated by reference to Exhibit 10.1 to the Form 8-K filed with the Commission on November 19, 2021)\n10.11\nRestricted Stock Grant Agreement dated January 4, 2021, by CoJax Oil and Gas Corporation and Jeffrey Guzy (incorporated by reference to Exhibit 10.1 to the Form 8-K filed with the Commission on January 7, 2021)\n10.12\nRestricted Stock Grant Agreement dated January 4, 2021, by CoJax Oil and Gas Corporation and Wm. Barrett Wellman (incorporated by reference to Exhibit 10.2 to the Form 8-K filed with the Commission on January 7, 2021)\n10.13\nRestricted Stock Grant Agreement dated January 4, 2022, by CoJax Oil and Gas Corporation and Jeffrey Guzy (incorporated by reference to Exhibit 10.1 to the Form 8-K filed with the Commission on January 4, 2022)\n10.14\nRestricted Stock Grant Agreement dated January 4, 2022, by CoJax Oil and Gas Corporation and Wm. Barrett Wellman (incorporated by reference to Exhibit 10.2 to the Form 8-K filed with the Commission on January 4, 2022)\n10.15*\nNONOP purchase and sale agreement dated November 8, 2022\n10.16*\nBUCKLEY purchase and sale agreement dated October 15, 2022\nCode of Ethics (incorporated by reference to Exhibit 14 to the Form S-1 Registration Statement filed with the Commission on July 26, 2019)\n21.1\nSubsidiaries of CoJax Oil and Gas Corporation (incorporated by reference to Exhibit 21.1 to the Amendment No. 4 to Form S-1 Registration Statement filed with the Commission on September 14, 2021)\n23.1\nConsent of Netherland, Sewell & Associates, Inc.\n31.1*\nCertification of Jeffrey J. Guzy, Chief Executive Officer and President of CoJax Oil and Gas Corporation, pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n31.2*\nCertification of Wm. Barrett Wellman, Chief Financial Officer of CoJax Oil and Gas Corporation, pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n32.1*\nCertification of Jeffrey J. Guzy, Chief Executive Officer and President of CoJax Oil and Gas Corporation, pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n32.2*\nCertification of Wm. Barrett Wellman, Chief Financial Officer of CoJax Oil and Gas Corporation, pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n99.2\nBarrister Energy, LLC Oil Leases (incorporated by reference to Exhibit 99.2 to the Companys Annual Report on Form 10-K, filed with the Commission on May 14, 2021)\n99.3*\nReserve Report, Netherland, Sewell & Associates, Inc, Texas Registered Engineering Firm\n* Filed Herewith\nITEM 16. FORM 10-K SUMMARY\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nCOJAX OIL AND GAS CORPORATION\nBy: /s/ Jeffrey J. Guzy\nJeffrey J. Guzy\nChief Executive Officer and President\n(Principal Executive Officer)\nDate: November 17, 2023\nBy: /s/ Wm. Barrett Wellman\nWm. Barrett Wellman\nChief Financial Officer\n(Principal Financial and Accounting Officer)\nDate: November 17, 2023\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated.\nBy: /s/ Jeffrey J. Guzy\nJeffrey J. Guzy\nChief Executive Officer and President\n(Principal Executive Officer)\nDate: November 17, 2023\nBy: /s/ Wm. Barrett Wellman\nWm. Barrett Wellman\nChief Financial Officer\n(Principal Financial and Accounting Officer)\nDate: November 17, 2023"
}