{
    "cik": "1765651",
    "company": "Pacific Sports Exchange Inc.",
    "filing_type": "10-K",
    "filing_date": "2023-11-28",
    "period_of_report": "2023-08-31",
    "sic": "5940",
    "state_of_inc": "DE",
    "state_location": "FL",
    "fiscal_year_end": "0831",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1765651/0001640334-23-002246-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1765651/000164033423002246/pse_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1765651/0001640334-23-002246.txt",
    "filename": "1765651_10K_2023_0001640334-23-002246.htm",
    "content": "Item 1. Business.\nOverview\nWe were incorporated in Delaware on July 2, 2018, to engage in the business of reselling new and used tennis and golf equipment. We have since added used golf carts to our resale inventory and have begun engaging in consignment sales of tennis rackets. The concept is to source top-quality, in-demand equipment, and resell it to both domestic and international customers. Our Company has identified popular brands and models that retain value, in new and used condition, across the various markets in which we plan to sell.\nWe operate as a sports equipment vendor, specializing in tennis and golf. The Company sources high value new and used equipment and sells it online. The target market is an avid domestic or international customer that is serious about his/her golf or tennis game and will return to the Company for future purchases.\nTo date, the Companys activities have included building out its business operations and marketing, acquiring inventory, generating revenue via www.ebay.com, as well as developing supplier and business contacts and services.\nOn January 15, 2019, we issued 3,100,000 shares of Common Stock to 14 individuals pursuant to the provisions of Section 4(a)(2) of the Securities Act of 1933 (the Act) and Rule 506(b) of Regulation D promulgated by the Securities and Exchange Commission (SEC).\nOn June 19, 2020, we issued 1,000,000 shares of Common Stock for $20,000 to 7 individuals pursuant to our S-1 Registration Statement declared effective on September 30, 2019.\nOn September 6, 2020, pursuant to our S-1 Registration Statement declared effective on September 30, 2019, the Company issued 275,000 shares of Common Stock to 10 individuals, for total proceeds of $5,500.\nOur principal executive office is located at 2149 Rio De Janeiro Ave., Punta Gorda, FL 33983, and our telephone number is (877) 571-5562. Our corporate website is www.pacificsportsexchange.com.\nWe have not been subject to any bankruptcy, receivership, or similar proceeding. We do not have any subsidiaries.\nDescription of Business\nWe specialize in the reselling of new and used tennis and golf equipment, including reselling used golf carts and engaging in consignment sales of tennis rackets. The concept is to source top-quality, in-demand equipment and resell it to both domestic and international customers. We have identified popular brands and models that retain their value in new and used conditions.\nTo source in-demand equipment, our Company has established relationships with local Southwest Florida sports retailers to purchase their surplus end-of-season inventory and trade-ins. The Company also attends golf and tennis trade shows and monitors re-seller equipment events to pin-point trends in high-demand used equipment. Both Florida and California have been identified as premium geographic locations to search for and secure the desired supply of top-end equipment.\nWe currently operate as an online-only entity and utilize eBay as our primary marketing channel. We will also optimize our own website for ‘global search terms and internally vend equipment to a worldwide market. Because the Company relies on third-party websites such as eBay to make its sales, such reliance on any third-party platform to generate revenues carries with it certain risks including but not necessarily limited to: the Company could violate the terms of service and lose its selling privileges, or the sites themselves could experience technical issues and/or fail. The Company will always strive to abide by the policies of any third-party platform and will endeavor to provide superior customer service. The Company will also look to improve the marketing and functionality of its own website, to act as a hedge against the risk of relying on third-party partners.\nThe principals of our Company have experience in both the sports of tennis and golf, and through this experience have identified high-value, high-margin equipment that resells profitably to both international and domestic customers. The goal is to create a unique supply chain that targets niche, valued products and their buyers. Serious golfers and tennis players are very particular about their equipment and will go to considerable lengths to secure what they are looking for in a quest to improve their game; this customer is our prime target market, and our marketing approach will be to create a relationship (wherever possible) with this customer and become their ongoing equipment supplier through social media and electronic outreach.\nDistribution Methods\nPotential customers can find our equipment promoted through websites such as eBay and eventually through our own pacificsportsexchange.com website. eBay makes it relatively easy to ship goods to international destinations, and eBay also services the domestic US market. Through eBay, our Company can ship tennis racquets anywhere within the continental U.S.A. for an average flat rate of $8 per item. In addition to utilizing third-party websites such as eBay, our Company is developing a robust website of our own and will undertake a key-word optimization effort to globally rank the site for tennis and golf related keywords. While eBay allows for start-up companies such as ours to instantly reach a global audience, our longer-term strategy is to have customers interact and purchase equipment directly from our website. Not only will this help with the margin-per-transaction, but also gives us an opportunity to create a long-term relationship and database with each customer. However, it must be cautioned that as website optimization occurs, especially on a global scale, this will take time and resources to accomplish, and initially eBay is our key marketing channel.\nCompetitive Business Conditions and Strategy; Position in the Industry\nOur Company competes with other vendors of golf and tennis equipment. We compete with a wide assortment of vendors from small local golf and tennis shops to larger established vendors such as Dicks Sporting Goods and Amazon. There is also an assortment of successful online vendors such as Tennis Warehouse, Midwest Sports, Holabird Sports, and Puetz Golf, among others. At first glance the retail industry appears challenging, especially factoring in direct sales from the equipment manufacturers themselves; however, a competitive advantage lies in the specialized nature of both our target customer and our targeted products. While we sell to local domestic customers, our primary target market is foreign buyers from Asia and Europe that have a penchant for specific brands and product models not available in their local markets. We have identified select new and classic equipment that is in high demand to foreign buyers, and we have identified a reliable method to source the desired equipment. Our source of in-demand equipment comes from a network of local tennis and golf shops. Located throughout Southwest Florida, these local shops and their owners are embedded within their communities and have great relationships with the local playing public; season in and season out they receive a steady supply of trade-in equipment. Our Company has found that these vendors are happy to sell this old equipment to us at a discount. Hence, our niche strategy within the larger mass market is to service the specialized and under-served international demand with a supply of equipment sourced from a network of local Florida sport shops. Our Company believes this sourcing strategy can be duplicated on the East Coast of Florida and in other warm weather states such as California and Arizona.\nTalent Sources and Names of Principal Suppliers\nThe key to our success is in the quality of our leadership, and their ability to share industry knowledge and secure a reliable supply chain. Our Company is headed by Timothy Conte, a retired educator and life-long tennis and golf enthusiast. Mr. Conte is passionate about each sport and carries a Florida United States Tennis Association (USTA) tennis ranking, as well as a 9.2 United States Golf Association (USGA) golf handicap. At both a professional and volunteer level, Mr. Conte has made key Florida vendor/industry contacts and is thoroughly versed on the latest equipment technology. He is also aware and appreciative of classic tennis and golf equipment that stands the test of time and is still widely sought-after today. Mr. Conte is well traveled and has played both tennis and golf in Europe and in Asia. Mr. Conte is currently devoting 20 hours per week to our Company.\nOur Company also benefits from the services of Jennifer Whitesides. Mrs. Whitesides is also a golf and tennis enthusiast and is involved in Florida USTA tennis instruction and carries a USGA golf handicap. Mrs. Whitesides main responsibility is to secure a reliable supply chain. Golf and tennis shops, trade shows, and reseller events of South Florida will be the initial source of equipment, followed by a structured buying campaign in California. Mrs. Whitesides works side-by-side with Mr. Conte, leverage her existing industry contacts and ensure that the supply of equipment meets any pending demand. Mrs. Whitesides works a total of 8 hours per week for our Company.\nBoth officers also monitor eBay for underpriced listings of tennis and golf equipment. These listings do appear from time to time and offer upside resell opportunity.\nResearch and Development\nSince inception, no funds have been spent on research and development. There are no extra research or development costs as the principals are donating their time and energy in this start-up phase.\nEmployees\nWe have no employees. Our officers and directors furnish their time to the development of our Company at no cost. We do not foresee hiring any employees in the near future. We will engage independent contractors to help design and develop our website and marketing efforts as may be required.\nGovernment Regulation\nThere are no industry specific governmental controls or licensing requirements needed to do business.\nAvailable Information\nWe make available, free of charge, or through our Internet website, at www.pacificsportsexchange.com, our Annual Reports on Form 10-K, our Quarterly Reports on Form 10-Q and our Current Reports on Form 8-K and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Exchange Act. Our Internet website and the information contained therein or connected thereto are not intended to be, and are not, incorporated into this Annual Report.\nOur reports, registration statements and other information can be inspected on the SECs website at www.sec.gov.\nImplications of Being an Emerging Growth Company\nWe qualify as an emerging growth company as defined in the Jumpstart Our Business Startups Act, or JOBS Act, enacted in April 2012. An emerging growth company may take advantage of reduced reporting requirements that are otherwise applicable to public companies. These provisions include, but are not limited to:\nWe can take advantage of these provisions through November 30, 2023. If certain events occur prior to November 30, 2023, including if we become a large accelerated filer, our annual gross revenues exceed $1 billion or we issue more than $1 billion of non-convertible debt in any three-year period, we would cease to be an emerging growth company prior to November 30, 2023.\nWe may choose to take advantage of some but not all of these reduced burdens. We have taken advantage of certain of the reduced disclosure obligations regarding executive compensation in this Annual Report and may elect to take advantage of other reduced burdens in future filings.\nUnder the JOBS Act, emerging growth companies can delay adopting new or revised accounting standards until such time as those standards apply to private companies. However, we have irrevocably elected not to avail ourselves of this extended transition period for complying with new or revised accounting standards and, therefore, we will be subject to the same new or revised accounting standards as other public companies that are not emerging growth companies.\nWe are also a smaller reporting company as defined in Rule 12b-2 of the Securities Exchange Act of 1934, as amended, or the Exchange Act, and have elected to take advantage of certain of the scaled disclosure available to smaller reporting companies. Item 1A. Risk Factors.\nSmaller reporting companies are not required to provide the information required by this item. Item 1B. Unresolved Staff Comments.\nNone. Item 2. Properties.\nOur principal executive office is located at 2149 Rio De Janeiro Ave., Punta Gorda, FL 33983. This property is provided to our Company by our President/CEO, free of charge. Item 3. Legal Proceedings.\nFrom time to time we may become involved in various legal proceedings that arise in the ordinary course of business, including actions related to our intellectual property. Although the outcomes of these legal proceedings cannot be predicted with certainty, we are currently not aware of any such legal proceedings or claims that we believe, either individually or in the aggregate, will have a material adverse effect on our business, financial condition or results of operations. Item 4. Mine Safety Disclosures.\nNot applicable.\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities.\nOur Common Stock is not yet quoted on any market or exchange.\nSecurities Transfer Corporation at 2901 N Dallas Parkway, Suite 380, Plano, Texas 75093, is the registrar and transfer agent for our Common shares.\nAs of the date of this report there were 34 holders of record of our Common Stock.\nDividend Policy\nWe have never declared or paid dividends on our capital stock. We currently intend to retain all available funds and any future earnings to fund the development and growth of our business. We do not anticipate paying any dividends on our capital stock in the foreseeable future. Investors should not purchase our securities with the expectation of receiving cash dividends. Any future determination related to our dividend policy will be made at the discretion of our Board of Directors (the Board), subject to limitations imposed by Delaware law regarding the ability of corporations to pay dividends, and will depend upon, among other factors, our results of operations, financial condition, capital requirements, contractual restrictions, business prospects and other factors our Board of Directors may deem relevant.\nEquity Compensation Plan Information\nWe do not have any equity compensation plans.\nRecent Sales of Unregistered Securities; Use of Proceeds from Registered Securities\nNone\nPurchase of Equity Securities by the Issuer and Affiliated Purchasers\nWe did not purchase any of our shares of Common Stock or other securities during the fourth quarter of our fiscal year ended August 31, 2023. Item 6. [Reserved] Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations.\nResults of Operations\nThe following summary of our results of operations should be read in conjunction with our financial statements for the years ended August 31,2023, and 2022, which are included herein.\nOur operating results for the years ended August 31,2023 and 2022, and the changes between those periods for the respective items are summarized as follows:\nYears Ended\nAugust 31,\nChange\nRevenue\n$ 18,794\n$ 45,169\n$ (26,375 )\nCost of goods sold\n15,289\n26,589\n(11,300 )\nGross profit\n3,505\n18,580\n(15,075 )\nOperating expenses\n29,538\n31,979\n(2,441 )\nNet loss\n$ (26,033 )\n$ (13,399 )\n$ (12,634 )\nNet loss was $26,033 for the year ended August 31, 2023, and $13,399 for the year ended August 31, 2022. The increase in net loss was primarily due to a decrease in revenue and offset by a decrease in operating expenses.\nCost of goods sold for the years ended August 31, 2023 and 2022 was $15,289 and $26,589, respectively. Operating expenses for the years ended August 31,2023 and 2022 were $29,538 and $31,979, respectively. Operating expenses during the years ended August 31,2023 and 2022 were primarily attributed to general and administration expenses of $1,471 and $2,310 and professional fees of $28,067 and $29,669, respectively. The decrease in general and administration expenses during the year ended August 31, 2023, is primarily due to a decrease in sales commission.\nLiquidity and Capital\nAs of August 31, 2023, we had $2,151 in cash, $2,420 in total assets, $91,503 in liabilities and $89,083 in working capital deficit.\nOur financial statements have been prepared on a going concern basis, which contemplates the realization of assets and settlement of liabilities and commitments in the normal course of business for the foreseeable future. There are no assurances that the Company will be able to either (1) achieve a level of revenues adequate to generate sufficient cash flow from operations; or (2) obtain additional financing through either private placement, public offerings and/or bank financing necessary to support its working capital requirements. To the extent that funds generated from operations and any private placements, public offerings and/or bank financing are insufficient, our Company will have to raise additional working capital. No assurance can be given that additional financing will be available, or if available, will be on terms acceptable to our Company. If adequate working capital is not available to our Company, it may be required to curtail or cease its operations.\nWorking Capital\nThe following table presents our working capital (deficit) position as at August 31,2023 and August 31, 2022:\nAugust 31,\nAugust 31,\nCurrent Assets\n$ 2,420\n$ 8,436\nCurrent Liabilities\n91,503\n71,486\nWorking Capital (Deficiency)\n$ (89,083 )\n$ (63,050 )\nAs of August 31,2023, we had a working capital deficiency of $89,083 compared to a working capital deficiency of $63,050 as of August 31,2022. As of August 31,2023, we had current assets of $2,420 (August 31,2022 - $8,436) and current liabilities of $91,503 (August 31, 2022 - $71,486). The increase in working capital deficiency is primarily due to an increase in due to related party of $3,700, accounts payable and accrued liabilities of $16,317 and a decrease in cash of $5,748, inventory of $268.\nCash Flow\nWe fund our operations with cash generated from sales, capital contributions, debt, and issuances of Common Stock.\nThe following table presents our cash flow for the years ended August 31,2023 and 2022:\nYears Ended\nAugust 31,\nCash used in operating activities\n$ (9,448 )\n$ (16,308 )\nCash provided by financing activities\n3,700\n13,700\nNet Change in Cash for the period\n$ (5,748 )\n$ (2,608 )\nCash Flows from Operating Activities\nFor the year ended August 31,2023, net cash used in operating activities was $9,448 compared to $16,308 during the year ended August 31,2022. For the year ended August 31,2023, we had a net loss of $26,033, which was decreased by a change in working capital of $16,585. For the year ended August 31, 2022, we had a net loss of $13,399, which was increased by a change in working capital of $2,909.\nCash Flows from Investing Activities\nDuring the years ended August 31, 2023, and 2022, we had no cash used in investing activities.\nCash Flows from Financing Activities\nFor the years ended August 31,2023 and 2022, we received $3,700 and $13,700 from financing activities, respectively.\nDuring the years ended August 31,2023, and 2022, we received $3,700 and $13,700 advance from related party, respectively.\nContractual Obligations\nAs a smaller reporting company, we are not required to provide tabular disclosure obligations.\nCritical Accounting Policies\nWe prepare our financial statements in conformity with Generally Accepted Accounting Principles (GAAP) of the United States, which requires management to make certain estimates and apply judgments. We base our estimates and judgments on historical experience, current trends and other factors that management believes to be important at the time the financial statements are prepared. On a regular basis, we review our accounting policies and how they are applied and disclosed in our financial statements.\nWhile we believe that the historical experience, current trends and other factors considered support the preparation of our financial statements in conformity with GAAP, actual results could differ from our estimates and such differences could be material.\nOff-Balance Sheet Arrangements\nWe have no off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources that is material to stockholders.\nInventory\nAll inventory is finished goods. Inventories are stated at the lower of cost or net realizable value. Our Company utilizes first-in first-out for inventory items held. We periodically review inventories for obsolescence and any inventories identified as obsolete are written down. Although we believe that the assumptions used to estimate inventory write-downs are reasonable, future changes in these assumptions could provide a significantly different result.\nRevenue recognition\nRevenue is earned from the reselling of new and used sports equipment. The Company applies the following five steps in order to determine the appropriate amount of revenue to be recognized as it fulfils its obligations pursuant to each of its equipment sales transactions:\n·\nidentify the contract with a customer;\n·\nidentify the performance obligations in the contract;\n·\ndetermine the transaction price;\n·\nallocate the transaction price to performance obligations in the contract; and\n·\nrecognize revenue as the performance obligation is satisfied.\nThe Company operates as an online-only retailer and utilizes eBay as its prime marketing channel. The Company currently relies on eBay, a third-party marketplace, to facilitate its sales. Such reliance on any third-party platform to generate revenues carries with it certain risks, including but not necessarily limited to: the Company could violate the terms of service and lose its selling privileges, or the sites themselves could experience technical issues and/or fail. The Company always strives to abide by the policies of any third-party platform and endeavors to provide superior customer service.\nTypical sales transactions are usually fulfilled within twenty-four (24) hours of completing the transaction online. Contracts stating the transaction price and our performance obligation to deliver the ordered products are deemed to be entered into on eBay at the time the customer submits payment, which is conducted through the PayPal payment platform. Due to the instantaneous nature of a customer submitting an order online at a stated price and the same (or next)-day shipment of product, the Company does not anticipate that variable consideration or contract assets or liabilities will arise in the normal course of business.\nRevenues are recognized based on the sales contract price, net of sales taxes, when control of the promised goods are transferred to a customer, in an amount that reflects the consideration that the Company expects to receive in exchange for those goods. Our contracted prices primarily include cost of inventory, shipping and handling, eBay commission fee and our margin, which varies depending on each item. We may provide incentives to our customers from time-to-time, including discounts, coupons and rewards, which are treated as a reduction in revenue. The Company does not accept returns and clearly indicates this in our listings. However, if a customer receives an item that is not as described in the eBay listing, we must follow the eBay money-back guarantee policy which obligates us to issue a full refund within three (3) business days. We do not provide an estimate for returns as we do not anticipate any returns in the normal course of business.\nConsignment Sales\nThe Company, as a consignee, provides a service to sell tennis racquets through its online marketplace with eBay. The Company retains a percentage of the proceeds received as payment for its consignment items, which the Company refers to as its take rate. The Company recognizes consignment revenue upon shipment of the consigned good to a customer as its performance obligation of providing consignment services to the consignor is satisfied at that point. The Company reports consignment revenue on a net basis as an agent and not the gross amount collected from a customer. Title to the consigned goods remain with the consignor until transferred to a customer subsequent to purchase of the consigned goods. In any event of damage or loss of consignment items, the Company will recognize an expense and will pay all related disbursements. The Company does not take title of consigned goods at any time.\nOther Sales\nThe Company purchases used golf carts as their own inventory for resale. The Company reports revenue on a gross basis from amounts collected from the customer upon transferring the product to the buyer. Item 7A. Quantitative and Qualitative Disclosures About Market Risk.\nAs a smaller reporting company, we are not required to provide the information required by this Item. Item 8. Financial Statements and Supplementary Data.\nThe financial statements and Report of Independent Registered Public Accounting Firm are listed in the Index to Financial Statements on page and included on pages through. Item 9. Changes in and Disagreements With Accountants on Accounting and Financial Disclosure.\nNone. Item 9A. Controls and Procedures.\nEvaluation of Disclosure Controls and Procedures\nWe maintain disclosure controls and procedures (as defined in Rule 13a-15(e) under the Exchange Act) that are designed to ensure that information required to be disclosed by us in reports that we file under the Exchange Act is recorded, processed, summarized and reported as specified in the SECs rules and forms and that such information required to be disclosed by us in reports that we file under the Exchange Act is accumulated and communicated to our management, including our Treasurer Mrs. Whitesides, and Mr. Conte, our Chief Executive Officer and Chief Financial Officer, to allow timely decisions regarding required disclosure. Management, with the participation of our Chief Executive Officer and Chief Financial Officer, performed an evaluation of the effectiveness of our disclosure controls and procedures as of August 31, 2023. Based on that evaluation, our management, including our Chief Executive Officer and Chief Financial Officer, concluded that our disclosure controls and procedures were not effective as of August 31, 2023, due to the material weaknesses and significant deficiencies discussed below.\nManagements Annual Report on Internal Control over Financial Reporting\nManagement is responsible for the preparation of our financial statements and related information. Management uses its best judgment to ensure that the financial statements present fairly, in material respects, our financial position and results of operations in conformity with generally accepted accounting principles.\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting as defined in the Exchange Act. These internal controls are designed to provide reasonable assurance that the reported financial information is presented fairly, that disclosures are adequate and that the judgments inherent in the preparation of financial statements are reasonable. There are inherent limitations in the effectiveness of any system of internal controls including the possibility of human error and overriding of controls. Consequently, an ineffective internal control system can only provide reasonable, not absolute, assurance with respect to reporting financial information.\nOur internal control over financial reporting includes policies and procedures that: (i) pertain to maintaining records that, in reasonable detail, accurately and fairly reflect our transactions; (ii) provide reasonable assurance that transactions are recorded as necessary for preparation of our financial statements in accordance with generally accepted accounting principles and that the receipts and expenditures of Company assets are made in accordance with our management and directors authorization; and (iii) provide reasonable assurance regarding the prevention of or timely detection of unauthorized acquisition, use or disposition of assets that could have a material effect on our financial statements.\nUnder the supervision of management, including our Principal Executive Officer and Principal Accounting Officer, we conducted an evaluation of the effectiveness of our internal control over financial reporting based on the framework in Internal Control - Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) and subsequent guidance prepared by the Commission specifically for smaller public companies as of August 31, 2023. Based on that evaluation, our management concluded that our internal control over financial reporting was not effective as of August 31,2023 because it identified the following material weakness and significant deficiencies:\nA material weakness is a deficiency or a combination of deficiencies in internal control over financial reporting such that there is a reasonable possibility that a material misstatement of the annual or interim financial statements will not be prevented or detected on a timely basis.\nWe expect to be materially dependent upon third parties to provide us with accounting consulting services for the foreseeable future which we believe mitigates the impact of the material weaknesses discussed above. Until such time as we have a chief financial officer with the requisite expertise in U.S. GAAP and establish an audit committee and implement internal controls and procedures, there are no assurances that the material weaknesses and significant deficiencies in our disclosure controls and procedures will not result in errors in our financial statements which could lead to a restatement of those financial statements.\nOur management, including our principal executive officer and principal accounting officer, does not expect that our disclosure controls and procedures or our internal controls will prevent all error and all fraud. A control system, no matter how well conceived and operated, can provide only reasonable, not absolute, assurance that the objectives of the control system are met. Further, the design of a control system must reflect the fact that there are resource constraints and the benefits of controls must be considered relative to their costs. Due to the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, within our Company have been detected.\nThis Annual Report does not include an attestation report of our registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by the Companys registered public accounting firm pursuant to SEC rules that permit us to provide only managements report on internal control over financial reporting in this Annual Report on Form 10-K.\nChanges in Internal Controls over Financial Reporting\nThere have been no changes in our internal controls over financial reporting identified in connection with the evaluation required by paragraph (d) of Securities Exchange Act Rule 13a-15 or Rule 15d-15 that occurred during the year ended August 31, 2023, that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. Item 9B. Other Information.\nNone.\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNone.\nPART III Item 10. Directors, Executive Officers and Corporate Governance.\nExecutive Officers and Directors\nThe following table sets forth the name, age and position of each of our executive officers and directors as of the date of this Prospectus.\nName\nAge\nPosition\nTimothy Conte\nPresident, Chief Executive Officer, Chief Financial Officer and Director\nJennifer Whitesides\nSecretary, Treasurer and Director\nEach director serves for a term of one year or until their successor is duly elected and qualified. Our executive officers are appointed by our Board of Directors. There are no family relationships between our current Directors and officers.\nBackground of Executive Officers and Directors\nThe following is a brief summary of the background of each of our executive officers and Directors:\nTimothy Conte - Mr. Conte has a diverse background of experience. He graduated in 1967 from Bucks County Community College with a degree in business. In 1969, he completed a BS business and marketing degree from Rider University, and in 1977, he completed a business and education masters degree from New Jersey College. In the intervening years between 1969 and 1976, Mr. Conte was a General Manager for Amaco. From 1978 until 1984, Mr, Conte owned and operated his own Auto Damage Appraising company. In 1985, Mr. Conte began teaching, and worked in the Charlotte County School Board (Florida) until his retirement in 2016. Mr. Conte specialized in teaching business and math. Mr. Conte was also active in athletics at the school board, helping to coach both the mens golf and tennis teams.\nOur Board of Directors believes that Mr. Conte is qualified to serve as a member of our Board because of the perspective and experience he brings in business management and from his athletic expertise.\nJennifer Whitesides - Mrs. Whitesides graduated with a bachelors degree in psychology from BYU in 2003, and in 2015, achieved a masters degree in social work from Ohio State University. Mrs. Whitesides worked for Columbus Ohio Social Services from 2005 - 2007, and from 2007 - 2010 worked at LDS Social Services. In 2012, Mrs. Whitesides, became Vice President of Marketing and Operations at Whitesides Orthodontics, a local business run by her husband Dr. Joseph Whitesides. Mrs. Whitesides is engaged in the community and assists in the coaching of young tennis players/prospects. Mrs. Whitesides works with local professionals to help youngsters develop the proper psychological mindset or mental approach to tennis and golf.\nOur Board of Directors believes that Ms. Whitesides is qualified to serve as a member of our Board because of the perspective and experience she brings in the sports community.\nCode of Ethics\nWe have not adopted a formal Code of Ethics. Our Board evaluated the business of our Company and the number of employees and determined that since the business is operated by a small number of persons, general rules of fiduciary duty and federal and state criminal, business conduct and securities laws are adequate ethical guidelines. In the event our operations, employees and/or our directors expand in the future, we may take actions to adopt a formal Code of Ethics.\nBoard of Directors, Committees and Director Independence\nOur Board of Directors currently consists of two (2) members. Neither of our Directors is considered to be an independent director because they each serve our Company as executive officers. We have not established any committees of our Board, nor are either of our Directors audit committee financial experts within the meaning of the rules of the SEC.\nCommittees of the Board\nOur Company does not have a nominating, compensation, or audit committee, or committees performing similar functions nor does our Company have a written nominating, compensation or audit committee charter. Our Directors believe that it is not necessary to have such committees at this time because our directors can adequately perform the functions of such committees.\nAudit Committee Financial Expert\nOur Board of Directors has determined that we do not have a board member that qualifies as an audit committee financial expert as defined in Item 407(D)(5) of Regulation S-K, nor do we have a board member that qualifies as independent as that term is used in Item 7(d)(3)(iv)(B) of Schedule 14A under the Exchange Act, and as defined by Rule 4200(a)(14) of the FINRA Rules.\nInvolvement in Certain Legal Proceedings\nOur Directors and executive officers have not been involved in any of the following events during the past ten years:\n1.\nbankruptcy petition filed by or against any business of which such person was a general partner or executive officer either at the time of the bankruptcy or within two years prior to that time;\n2.\nany conviction in a criminal proceeding or being subject to a pending criminal proceeding (excluding traffic violations and other minor offenses);\n3.\nbeing subject to any order, judgment, or decree, not subsequently reversed, suspended or vacated of any court of competent jurisdiction, permanently or temporarily enjoining, barring, suspending or otherwise limiting his/her involvement in any type of business, securities or banking activities;\n4.\nbeing found by a court of competent jurisdiction (in a civil action), the Commission or the Commodity Futures Trading Commission to have violated a federal or state securities or commodities law, and the judgment has not been reversed suspended, or vacated;\n5.\nsuch person was found by a court of competent jurisdiction in a civil action or by the Commission to have violated any Federal or State securities law, and the judgment in such civil action or finding by the Commission has not been subsequently reversed, suspended or vacated;\n6.\nsuch person was found by a court of competent jurisdiction in a civil action or by the Commodity Futures Trading Commission to have violated any Federal commodities law, and the judgment in such civil action or finding by the Commodity Futures Trading Commission has not been subsequently reversed, suspended or vacated;\n7.\nsuch person was the subject of, or a party to, any Federal or State judicial or administrative order, judgment, decree, or finding, not subsequently reversed, suspended or vacated, relating to an alleged violation of: (i) any Federal or State securities or commodities law or regulation; or (ii) any law or regulation respecting financial institutions or insurance companies including, but not limited to, a temporary or permanent injunction, order of disgorgement or restitution, civil money penalty or temporary or permanent cease-and-desist order, or removal or prohibition order; or (iii) any law or regulation prohibiting mail or wire fraud or fraud in connection with any business entity; or\n8.\nsuch person was the subject of, or a party to, any sanction or order, not subsequently reversed, suspended or vacated, of any self-regulatory organization (as defined in Section 3(a)(26) of the Exchange Act (15 U.S.C. 78c(a)(26)), any registered entity (as defined in Section 1(a)(29) of the Commodity Exchange Act (7 U.S.C. 1(a)(29)), or any equivalent exchange, association, entity or organization that has disciplinary authority over its members or persons associated with a member. Item 11. Executive Compensation.\nSummary Compensation Table\nThe table below summarizes all compensation awarded to, earned by, or paid to our named executive officers for all services rendered in all capacities to us for the fiscal year ended August 31,2023 and 2022.\nName\nand Principal\nPosition\nYear\nSalary\n($)\nBonus\n($)\nStock Awards ($)\nOption\nAwards ($)\nNon-Equity\nIncentive Plan\nCompensation ($)\nNonqualified\nDeferred\nCompensation\nEarnings\n($)\nAll Other\nCompensation ($)\nTotal\n($)\nTimothy Conte\n-\n-\n-\n-\n-\n-\n-\n-\nPresident, CEO, CFO and Director\n-\n-\n-\n-\n-\n-\n-\n-\nJennifer Whitesides\n-\n-\n-\n-\n-\n-\n-\n-\nSecretary, Treasurer and Director\n-\n-\n-\n-\n-\n-\n-\n-\nOur Board of Directors determines the compensation given to our executive officers in their sole determination. Our Board of Directors reserves the right to pay our executive or any future executives a salary, and/or issue them shares of our Common Stock in consideration for services rendered and/or to award incentive bonuses which are linked to our performance, as well as to the individual executive officers performance. This may also include long-term stock-based compensation to certain executives, which is intended to align the performance of our executives with our long-term business strategies. Additionally, while our Board of Directors has not granted any performance-based stock options to date, our Board reserves the right to grant such options in the future, if our Board, in its sole determination believes such grants would be in the best interest of our Company.\nEmployment Agreements\nWe do not have any employment or consulting agreement with any directors or officers.\nStock Options\nWe have not granted any stock options to our executive officers since inception.\nDirector Compensation\nOur Board of Directors does not currently receive any consideration for their services as members of our Board. Our Board reserves the right in the future to award the members of our Board cash and/or stock-based consideration for their services to our Company, which awards, if granted shall be in the sole determination of our Board.\nRetirement Plans\nOur Company currently maintains no plans for its executive officers or employees that provide for payments or other benefits at, following or in connection with retirement. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nThe following table sets forth certain information regarding beneficial ownership of our Common Stock as of November 13, 2023 (a) by each person known by us to own beneficially 5% or more of our Common Stock, (b) by each of our named executive officers and each of our directors and (c) by all executive officers and directors of the Company as a group. As of November 13,2023, there were 14,375,000 shares of our Common Stock issued and outstanding. Unless otherwise noted, we believe that all persons named in the table have sole voting and investment power with respect to all the shares beneficially owned by them.\nName and Address of Beneficial Owner\nCommon Shares\nBeneficially Owned\nPercentage of\nCommon\nShares\nBeneficially\nOwned\nTimothy Conte\n2149 Rio De Janeiro Ave., Punta Gorda, FL 33983\n5,000,000 shares\nof Common Stock\n34.78\n%\nJennifer Whitesides\n2149 Rio De Janeiro Ave., Punta Gorda, FL 33983\n5,000,000 shares\nof Common Stock\n34.78\n%\nDirectors and Executive Officers as a Group\n10,000,000 shares\nof Common Stock\n69.57\n% Item 13. Certain Relationships and Related Transactions, and Director Independence.\nThe Company does not own or lease property or lease office space. The office space used by the Company was arranged by the officer of the Company to use at no charge.\nThere have been no additional transactions since the beginning of the Companys last fiscal year, nor any proposed transactions in which the Company was or is to be a participant that are required to be disclosed under Item 404 of Regulation S-K.\nDuring the years ended August 31, 2023 and 2022, the Company received a loan of $3,700 and $13,700 from the Companys CEO and Director, respectively. The amount is unsecured, non-interest bearing, due on demand and has not been formalized by a promissory note. As of August 31, 2023, and 2022, the Company owned $17,400 and $13,700 to the Companys officer, respectively. Item 14. Principal Accounting Fees and Services.\nThe following table shows the fees that were billed for the audit and other services provided by our independent auditors for the fiscal years ended August 31, 2023 and 2022, respectively.\nAudit Fees\n$ 11,000\n$ 11,000\nAudit-Related Fees\n-\n-\nTax Fees\n-\n-\nAll Other Fees\n-\n-\nTotal\n$ 11,000\n$ 11,000\nAudit Fees - This category includes the audit of our annual financial statements, review of financial statements included in our Quarterly Reports on Form 10-Q and services that are normally provided by the independent registered public accounting firm in connection with engagements for those fiscal years. This category also includes advice on audit and accounting matters that arose during, or as a result of, the audit or the review of interim financial statements.\nAudit-Related Fees - This category consists of assurance and related services by the independent registered public accounting firm that are reasonably related to the performance of the audit or review of our financial statements and are not reported above under Audit Fees. The services for the fees that would normally be disclosed under this category include consultation regarding our correspondence with the SEC and other accounting consulting.\nTax Fees - This category consists of professional services rendered by our independent registered public accounting firm for tax compliance, tax advice and tax planning. The services for the fees that would normally be disclosed under this category include tax return preparation and technical tax advice.\nAll Other Fees - This category consists of fees for other miscellaneous items.\nAudit Committee Pre-Approval of Audit and Permissible Non-Audit Services of Independent Auditors\nGiven the small size of our Board as well as the limited activities of our Company, our Board acts as our Audit Committee. Our Board pre-approves all audit and permissible non-audit services. These services may include audit services, audit-related services, tax services, and other services. Our Board approves these services on a case-by-case basis.\nPART IV Item 15. Exhibits, Financial Statement Schedules.\nThe following exhibits are filed herewith or incorporated by reference to exhibits previously filed with the SEC.\nExhibit\nIncorporated by Reference\nNumber\nExhibit Description\nForm\nExhibit\nFiling Date\n3.1\nArticles of Incorporation\nS-1/A\n3.1\n9/30/2019\n3.2\nBylaws\nS-1/A\n3.2\n9/30/2019\n3.3\nAmended and Restated Certificate of Incorporation\nPOS AM\n3.3\n12/11/2019\n3.4\nAmended and Restated Bylaws\nPOS AM\n3.4\n12/11/2019\n31.1 /31.2*\nCertification of the Principal Executive Officer and Principal Financial Officer required by Rule 13a-14(a) or Rule 15d-14(a) under the Securities Exchange Act of 1934, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n32.1/32.2**\nCertification of the Chief Executive Officer and Chief Financial Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002 (18 U.S.C. Section 1350).\n101*\nInline XBRL Document Set for the financial statements and accompanying notes in Part II, Item 8, Financial Statements and Supplementary Data of this Annual Report on Form 10-K.\n104*\nInline XBRL for the cover page of this Annual Report on Form 10-K, included in the Exhibit 101 Inline XBRL Document Set.\n___________\n*\nFiled herewith\n**\nFurnished herewith\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nPacific Sports Exchange Inc.\n(Registrant)\nDated: November 28, 2023\n/s/ Timothy Conte\nTimothy Conte\nChief Executive Officer, President,\nand Director\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nPage\nReports of Independent Registered Public Accounting Firms (PCAOB ID: 2851)\nBalance Sheets as of August 31,2023 and 2022\nStatements of Operations for the years ended August 31,2023 and 2022\nStatements of Changes in Stockholders Deficit for the years ended August 31,2023 and 2022\nStatements of Cash Flows for the years ended August 31,2023 and 2022\nNotes to Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Stockholders of\nPacific Sports Exchange, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of Pacific Sports Exchange, Inc. (the Company) as of August 31, 2023 and 2022, the related statements of operations, changes in stockholders deficit, and cash flows for the years then ended, and the related notes (collectively referred to as the \"financial statements\"). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company at August 31, 2023 and 2022, and the results of its operations and its cash flows for the years ended August 31, 2023 and 2022, in conformity with the U.S. generally accepted accounting principles in the United States of America.\nGoing Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As described in Note 1 to the financial statements, the Company has incurred recurring losses from operations, has minimal operations, and is in need of additional capital to grow its operations so that it can become profitable. These factors raise substantial doubt about the Companys ability to continue as a going concern. Managements plans with regard to these matters are described in Note 1. The accompanying financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nCritical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. We determined that there are no critical audit matters.\n/s/ KCCW Accountancy Corp.\nWe have served as the Companys auditor since 2021.\nDiamond Bar, California\nNovember 28, 2023\nPACIFIC SPORTS EXCHANGE INC.\nBALANCE SHEETS\nAs of\nAs of\nAugust 31,\nAugust 31,\nAssets\nCurrent Assets\nCash\n$ 2,151\n$ 7,899\nInventory\nTotal Current Assets\n2,420\n8,436\nTotal Assets\n$ 2,420\n$ 8,436\nLiabilities and Stockholders' Deficit\nCurrent Liabilities\nAccounts payable and accrued liabilities\n$ 74,103\n$ 57,786\nDue to related parties\n17,400\n13,700\nTotal Current Liabilities\n91,503\n71,486\nStockholders' Deficit\nPreferred stock: 20,000,000 shares authorized; $0.001 par value; no shares issued and outstanding\n-\n-\nCommon stock: 200,000,000 shares authorized; $0.001 par value; 14,375,000 shares issued and outstanding, respectively.\n14,375\n14,375\nAdditional paid-in capital\n62,691\n62,691\nAccumulated deficit\n(166,149 )\n(140,116 )\nTotal Stockholders' Deficit\n(89,083 )\n(63,050 )\nTotal Liabilities and Stockholders' Deficit\n$ 2,420\n$ 8,436\nThe accompanying notes are an integral part of these financial statements.\nPACIFIC SPORTS EXCHANGE INC.\nSTATEMENTS OF OPERATIONS\nYears Ended\nAugust 31,\nRevenues\n$ 18,794\n$ 45,169\nCost of goods sold\n(15,289 )\n(26,589 )\nGross profit\n3,505\n18,580\nOperating Expenses\nGeneral and administrative\n1,471\n2,310\nProfessional fees\n28,067\n29,669\nTotal operating expenses\n29,538\n31,979\nLoss from operations\n(26,033 )\n(13,399 )\nLoss before income taxes\n(26,033 )\n(13,399 )\nProvision for income taxes\n-\n-\nNet loss\n$ (26,033 )\n$ (13,399 )\nBasic and diluted loss per common share\n$ (0.00 )\n$ (0.00 )\nBasic and diluted weighted average common shares outstanding\n14,375,000\n14,375,000\nThe accompanying notes are an integral part of these financial statements.\nPACIFIC SPORTS EXCHANGE INC.\nSTATEMENT OF CHANGES IN STOCKHOLDERS DEFICIT\nAdditional\nCommon Stock\nPaid in\nAccumulated\nShares\nAmount\nCapital\nDeficit\nTotal\nBalance - August 31, 2021\n14,375,000\n$ 14,375\n$ 62,691\n$ (126,717 )\n$ (49,651 )\nNet loss\n-\n-\n-\n(13,399 )\n(13,399 )\nBalance - August 31, 2022\n14,375,000\n14,375\n62,691\n(140,116 )\n(63,050 )\nNet loss\n-\n-\n-\n(26,033 )\n(26,033 )\nBalance - August 31, 2023\n14,375,000\n$ 14,375\n$ 62,691\n$ (166,149 )\n$ (89,083 )\nThe accompanying notes are an integral part of these financial statements.\nPACIFIC SPORTS EXCHANGE INC.\nSTATEMENTS OF CASH FLOWS\nYears Ended\nAugust 31,\nCash Flows from Operating Activities\nNet loss\n$ (26,033 )\n$ (13,399 )\nChanges in operating assets and liabilities:\nInventory\n1,087\nAccounts payable and accrued liabilities\n16,317\n(3,996 )\nNet cash used in operating activities\n(9,448 )\n(16,308 )\nCash Flows from Financing Activities\nProceeds from related party\n3,700\n13,700\nNet cash provided by financing activities\n3,700\n13,700\nNet change in cash for the period\n(5,748 )\n(2,608 )\nCash at beginning of period\n7,899\n10,507\nCash at end of period\n$ 2,151\n$ 7,899\nSupplemental Cash Flow Information:\nCash paid for income taxes\n$ -\n$ -\nCash paid for interest\n$ -\n$ -\nThe accompanying notes are an integral part of these financial statements.\nPACIFIC SPORTS EXCHANGE INC.\nNOTES TO FINANCIAL STATEMENTS\nNOTE 1 - ORGANIZATION, DESCRIPTION OF BUSINESS AND GOING CONCERN\nPacific Sports Exchange Inc., (Pacific Sports the Company, we or us) was incorporated in the state of Delaware on July 2, 2018. It is based in Punta Gorda, Florida. The accounting and reporting policies of the Company conform to accounting principles generally accepted in the United States of America, and the Companys fiscal year end is August 31.\nThe Company operates as a sports equipment vendor, specializing in tennis and golf. The Company sources high value new and used equipment and sells it online. The target market is an avid domestic or international customer that is serious about his/her golf or tennis game and will return to the Company for future purchases.\nTo date, the Companys activities have been limited to generating revenue via www.ebay.com, as well as developing initial business contacts and services.\nGoing Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern, which contemplates the realization of assets and the liquidation of liabilities in the normal course of business. As of August 31, 2023, the Company has an accumulated deficit and has earned nominal operating revenues.\nThe ability of the Company to obtain profitability is dependent upon, among other things, obtaining additional financing to continue operations, and development of its business plan. In response to these problems, management intends to raise additional operating funds through equity and/or debt financing. However, there can be no assurance management will be successful in its endeavors.\nThere are no assurances that the Company will be able to either 1) achieve a level of revenues adequate to generate sufficient cash flow from operations; or 2) obtain additional financing through either private placement, public offerings and/or bank financing necessary to support its working capital requirements. To the extent that funds generated from operations and any private placements, public offerings and/or bank financing are insufficient, the Company will have to raise additional working capital. No assurance can be given that additional financing will be available, or if available, will be on terms acceptable to the Company. If adequate working capital is not available to the Company, it may be required to curtail or cease its operations.\nThese factors, among others, raise substantial doubt about the Companys ability to continue as a going concern. The accompanying financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBasis of Presentation\nThe financial statements and related disclosures have been prepared pursuant to the rules and regulations of the Securities and Exchange Commission (SEC). The financial statements have been prepared using the accrual basis of accounting in accordance with Generally Accepted Accounting Principles (GAAP) of the United States.\nUse of Estimates and Assumptions\nThe preparation of financial statements in conformity with GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements. The estimates and judgments will also affect the reported amounts for certain revenues and expenses during the reporting period. Actual results could differ from these good faith estimates and judgments.\nCash and Cash Equivalents\nCash and cash equivalents include cash in banks, money market funds, and certificates of term deposits with maturities of less than three months from inception, which are readily convertible to known amounts of cash and which, in the opinion of management, are subject to an insignificant risk of loss in value. The Company had $2,151 and $7,899 in cash as of August 31, 2023 and 2022, respectively.\nAccounts Receivable and Allowance for Uncollectible Accounts\nTrade accounts receivable are recorded at the invoiced amount and do not bear interest. The allowance for doubtful accounts is the Companys best estimate of the amount of probable credit losses in its existing accounts receivable. The Company maintains allowances for doubtful accounts for estimated losses resulting from the inability of its customers to make the required payments for services. Accounts with known financial issues are first reviewed and specific estimates are recorded. The remaining accounts receivable balances are then grouped in categories by the number of days the balance is past due, and the estimated loss is calculated as a percentage of the total category based upon past history. Account balances are charged against the allowance when it is probable that the receivable will not be recovered. The Company had no accounts receivable or allowance for doubtful accounts at August 31, 2023 or 2022.\nInventory\nThe Companys inventory consists of tennis equipment and golf carts. All inventory is finished goods. Inventories are stated at the lower of cost or net realizable value. The inventory is stored on-site at the Florida office of the Company. The Company utilizes first-in first-out for inventory items held. We periodically review inventories for obsolescence and any inventories identified as obsolete are written down. Although we believe that the assumptions we use to estimate inventory write-downs are reasonable, future changes in these assumptions could provide a significantly different result.\nRevenue Recognition\nRevenue is earned from the reselling of new and used sports equipment. The Company applies the following five steps in order to determine the appropriate amount of revenue to be recognized as it fulfills its obligations pursuant to each of its equipment sales transactions:\n·\nidentify the contract with a customer;\n·\nidentify the performance obligations in the contract;\n·\ndetermine the transaction price;\n·\nallocate the transaction price to performance obligations in the contract; and\n·\nrecognize revenue as the performance obligation is satisfied.\nThe Company operates as an online-only retailer and utilizes eBay Inc. (eBay) as its prime marketing channel. The Company currently relies on eBay, a third-party marketplace, to facilitate its sales. Such reliance on any third-party platform to generate revenues carries with it certain risks, including but not necessarily limited to: the Company could violate the terms of service and lose its selling privileges, or the sites themselves could experience technical issues and/or fail. The Company always strives to abide by the policies of any third-party platform and endeavors to provide superior customer service.\nTypical sales transactions are usually fulfilled within twenty-four (24) hours of completing the transaction online. Contracts stating the transaction price and our performance obligation to deliver the ordered products are deemed to be entered into via eBay at the time the customer submits payment, which is conducted through the PayPal payment platform. Due to the instantaneous nature of a customer submitting an order online at a stated price and the same or next business day shipment of product, the Company does not anticipate that variable consideration or contract assets or liabilities will arise in the normal course of business.\nRevenues are recognized based on the sales contract price, net of sales taxes, when control of the promised goods are transferred to a customer, in an amount that reflects the consideration that the Company expects to receive in exchange for those goods. Our contracted prices primarily include cost of inventory, shipping and handling, eBay commission fee and our margin, which varies depending on each item. We may provide incentives to our customers from time to time, including discounts, coupons and rewards, which are treated as a reduction in revenue. We may provide sales under a consignment for a client. When acting as an agent, where we do not take delivery of the inventory, we record all costs of sales as a reduction in revenue. The Company does not accept returns and clearly indicates this in our listings. However, if a customer receives an item that is not as described in the eBay listing, we must follow the eBay moneyback guarantee policy which obligates us to issue a full refund within three (3) business days. We do not provide an estimate for returns as we do not anticipate any returns in the normal course of business.\nConsignment Sales\nThe Company, as a consignee, provides a service to sell tennis racquets through its online marketplace with eBay. The Company retains a percentage of the proceeds received as payment for its consignment items, which the Company refers to as its take rate. The Company recognizes consignment revenue upon shipment of the consigned good to a customer as its performance obligation of providing consignment services to the consignor is satisfied at that point. The Company reports consignment revenue on a net basis as an agent and not the gross amount collected from a customer. Title to the consigned goods remain with the consignor until transferred to a customer subsequent to purchase of the consigned goods. In any event of damage or loss of consignment items, the Company will recognize an expense and will pay all related disbursements. The Company does not take title of consigned goods at any time.\nOther Sales\nThe Company purchases used golf carts as their own inventory for resale. The Company reports revenue on a gross basis from amounts collected from the customer upon transferring the product to the buyer.\nCost of Goods Sold\nCost of goods sold includes the following expenses: inventory costs and expenses related to eBay fees, repair, fuel and shipping services.\nNet Loss Per Share of Common Stock\nThe Company has adopted ASC Topic 260, Earnings per Share, (EPS) which requires presentation of basic and diluted EPS on the face of the statement of operations for all entities with complex capital structures and requires a reconciliation of the numerator and denominator of the EPS computation. In the accompanying financial statements, basic earnings (loss) per share is computed by dividing net loss by the weighted average number of shares of Common Stock outstanding during the period. Potentially dilutive securities (such as warrants, options, convertible Preferred Stock, and convertible debt) are excluded from the computation of dilutive earnings (loss) per share when their effect would be anti-dilutive. The Company has no potentially dilutive securities currently issued and outstanding, so basic and dilutive loss per share is the same.\nConcentrations of Credit Risk\nThe Companys financial instruments that are exposed to concentrations of credit risk primarily consist of its cash and cash equivalents and related party payables that it will likely incur in the near future. The Company places its cash and cash equivalents with financial institutions of high credit worthiness. At times, its cash and cash equivalents with a particular financial institution may exceed any applicable government insurance limits. The Companys management plans to assess the financial strength and credit worthiness of any parties to which it extends funds, and as such, it believes that any associated credit risk exposures are limited.\nRelated Parties\nThe Company follows ASC 850, Related Party Disclosures, for the identification of related parties and disclosure of related party transactions.\nFinancial Instruments and Fair Value Measurements\nThe Company follows ASC 820, Fair Value Measurements and Disclosures, which defines fair value as the exchange price that would be received for an asset or paid to transfer a liability (an exit price) in the principal or most advantageous market for the asset or liability in an orderly transaction between market participants on the measurement date.\nFair value estimates discussed herein are based upon certain market assumptions and pertinent information available to management as of August 31, 2023 and 2022. The carrying values of our financial instruments, including cash and cash equivalents, prepaid expenses, and accounts payable, approximate their fair values due to the short-term maturities of these financial instruments.\nIncome Taxes\nThe Company uses the liability method of accounting for income taxes. Under the liability method, deferred tax assets and liabilities are determined based on differences between financial reporting and the tax basis of assets, liabilities, the carry forward of operating losses and tax credits, and are measured using the enacted tax rates and laws that will be in effect when the differences are expected to reverse. An allowance against deferred tax assets is recorded when it is more likely than not that such tax benefits will not be realized.\nConcentrations\nDuring the years ended August 31, 2023 and 2022, revenue was comprised of two sales channels, over the Internet (ebay.com) and direct resale, to unrelated third parties. These sales channels represented 100% of the revenues of the Company for the years ended August 31,2023 and 2022.\nRecent Accounting Pronouncements\nThe Company adopts new pronouncements relating to generally accepted accounting principles applicable to the Company as they are issued, which may be in advance of their effective date. Management does not believe that any recently issued, but not yet effective accounting standards, if currently adopted, would have a material effect on the accompanying financial statements.\nNOTE 3 - RELATED PARTY TRANSACTIONS\nIn support of the Companys efforts and cash requirements, it may rely on advances from related parties until such a time that the Company can support its operations or attain adequate financing through sales of its equity or traditional debt financing. There is no formal written commitment for continued support by shareholders.\nDuring the years ended August 31, 2023 and 2022, the Company received a loan of $3,700 and $13,700 from the Companys CEO and Director, respectively. The amount is unsecured, non-interest bearing, due on demand and has not been formalized by a promissory note. As of August 31, 2023, and 2022, the Company owned $17,400 and $13,700 to the Companys officer, respectively.\nNOTE 4 - EQUITY\nPreferred Stock\nThe Company has authorized 20,000,000 shares of Preferred Stock with a par value of $0.001 per share. No preferred stock was issued or outstanding as of August 31, 2023 and 2022.\nCommon Stock\nThe Company has authorized 200,000,000 shares of Common Stock with a par value of $0.001 per share. Each Common share entitles the holder to one vote, in person or proxy, on any matter on which action of the stockholders of the corporation is sought.\nAs of August 31, 2023, and 2022, the Company had 14,375,000 shares of Common Stock issued and outstanding.\nNOTE 5 - PROVISION FOR INCOME TAXES\nThe Company provides for income taxes under ASC 740, Income Taxes. Under the asset and liability method of ASC 740, deferred tax assets and liabilities are recorded based on the differences between the financial statement and tax basis of assets and liabilities and the tax rates in effect when these differences are expected to reverse. A valuation allowance is provided for certain deferred tax assets if it is more likely than not that the Company will not realize tax assets through future operations.\nThe provision for income taxes differs from the amounts which would be provided by applying the statutory federal income tax rate of 21% to the net loss before provision for income taxes for the following reasons:\nYears Ended\nAugust 31,\nAugust 31,\nIncome tax (benefit) at statutory rate\n$ (5,467 )\n$ (2,814 )\nValuation allowance\n5,467\n2,814\nProvision for income taxes\n$ -\n$ -\nNet deferred tax assets consist of the following components as of:\nAugust 31,\nAugust 31,\nNet Operating Losses Carryover\n$ 34,892\n$ 29,425\nValuation allowance\n(34,892 )\n(29,425 )\nNet deferred tax asset\n$ -\n$ -\nAs of August 31, 2023, the Company had approximately $166,149 of net operating losses (NOL) carried forward to offset taxable income in future years which expire commencing in fiscal 2038. NOLs generated in tax years prior to August 31, 2018, can be carried forward for twenty (20) years and NOLs generated after August 31, 2018, can be carried forward indefinitely. NOL carry forwards may be subject to an annual limitation due to ownership change limitations that may have occurred or that could occur in the future, as required by Section 382 of the Internal Revenue Code of 1986, as amended (the Code). These ownership changes may limit the amount of the NOL carry forwards that can be utilized annually to offset future taxable income and tax, respectively. In general, an ownership change as defined by Section 382 of the Code results from a transaction or series of transactions over a three-year period resulting in an ownership change of more than 50 percentage points of the outstanding stock of a company by certain stockholders.\nTax returns for the years ended 2018, 2019, 2020, 2021, 2022, and 2023 are subject to review by the tax authorities. The Company has no liabilities related to uncertain tax positions or unrecognized benefits as of the year ended August 31, 2023. The Company has not accrued interest or penalties associated with unrecognized tax liabilities.\nNOTE 6 - CONCENTRATION\nFor the years ended August 31, 2023 and 2022, customer and supplier concentrations (more than 10%) were as follows:\nRevenue\nDuring the year ended August 31, 2023, 7 customers represented 86% of our revenue compared to nil customer accounted for more than 10 % of our revenue for the year ended August 31, 2022.\nPurchases\nDuring the year ended August 31, 2023, 7 suppliers represented 87% of our purchase compared to 3 suppliers representing 33% of our purchase for the year ended August 31, 2022.\nNOTE 7 - SUBSEQUENT EVENTS\nThe Company has evaluated events occurring subsequent to August 31, 2023, through the issuance of the financial statements and determined that there are no additional events requiring disclosure."
}