{
    "cik": "1772016",
    "company": "BELLRING BRANDS, INC.",
    "filing_type": "10-K",
    "filing_date": "2023-11-21",
    "period_of_report": "2023-09-30",
    "sic": "2000",
    "state_of_inc": null,
    "state_location": "MO",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1772016/0001772016-23-000091-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1772016/000177201623000091/brbr-20230930.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1772016/0001772016-23-000091.txt",
    "filename": "1772016_10K_2023_0001772016-23-000091.htm",
    "content": "ITEM 1. BUSINESS\nGeneral\nBellRing Brands, Inc. (formerly known as BellRing Distribution, LLC) (BellRing) was formed in the State of Delaware on October 20, 2021 as a wholly-owned subsidiary of Post Holdings, Inc. (Post) for the purpose of effecting the separation of BellRing Intermediate Holdings, Inc. (formerly known as BellRing Brands, Inc.) (Old BellRing) from Post. Under a transaction agreement and plan of merger (the Transaction Agreement) that we entered into on October 26, 2021 and amended as of February 28, 2022, with Post, Old BellRing and our subsidiary BellRing Merger Sub Corporation (Merger Sub), Post distributed approximately 80.1% of its interest in us to Posts shareholders and Merger Sub merged with and into Old BellRing, with Old BellRing surviving and becoming our subsidiary. On March 10, 2022, as a result of the completion of the transactions provided for under the Transaction Agreement (including the Separation and Distribution, each defined below), we became a new public holding company and the successor registrant to Old BellRing. In this report, we refer to the transactions undertaken pursuant to the Transaction Agreement as the Spin-off. The Spin-off is described in more detail below.\nOur Company\nWe are a leader in the global convenient nutrition category, aiming to enhance the lives of our consumers by providing them with nutritious, great-tasting products they can enjoy throughout the day. Our primary brands, Premier Protein and Dymatize, target a broad range of consumers and compete in all major product forms, including ready-to-drink (RTD) protein shakes, other RTD beverages and powders. Our products are distributed across a diverse network of channels including club, food, drug and mass (FDM), eCommerce, specialty and convenience.\nWe have organically grown our net sales from $1,247.1 million in our year ended September 30, 2021 to $1,666.8 million in our year ended September 30, 2023. Over the same period, net earnings including redeemable noncontrolling interest increased from $114.4 million in our year ended September 30, 2021 to $165.5 million in our year ended September 30, 2023.\nThe Spin-off\nPursuant to the Transaction Agreement and in connection with a series of corporate separation transactions, on March 9, 2022, Post contributed to us (i) all of its nonvoting common units of BellRing Brands, LLC (BellRing LLC) and its sole outstanding share of Old BellRings Class B common stock, $0.01 par value per share (the Old BellRing Class B Common Stock and with Old BellRings Class A common stock, $0.01 par value per share (the Old BellRing Class A Common Stock), collectively, the Old BellRing Common Stock)) and (ii) $550.4 million in cash, in exchange for Posts right to receive $840.0 million in aggregate principal amount of our 7.00% Senior Notes due 2030 and limited liability company interests in us (prior to our conversion to a Delaware corporation, as described below).\nOn March 10, 2022, we converted into a Delaware corporation and changed our name to BellRing Brands, Inc., and Post distributed an aggregate of 78.1 million, or 80.1%, of its shares of our common stock, $0.01 par value per share (the BellRing Common Stock) to its shareholders in a pro-rata distribution (the Distribution). Post shareholders received 1.267788 shares of BellRing Common Stock for every one share of Post common stock held as of the record date for the Distribution. No fractional shares of BellRing Common Stock were issued, and instead, cash in lieu of any fractional shares was paid to Post shareholders.\nAlso on March 10, 2022, upon completion of the Distribution, Merger Sub merged with and into Old BellRing (the Merger), with Old BellRing continuing as the surviving corporation and becoming our wholly-owned subsidiary. Under the Merger, each outstanding share of Old BellRing Class A Common Stock was converted into one share of BellRing Common Stock and $2.97 in cash, resulting in $115.5 million in total consideration paid to Old BellRing Class A common stockholders pursuant to the Merger.\nAs a result of the Spin-off, we became the new public parent company of, and successor issuer to, Old BellRing, and shares of our BellRing Common Stock were deemed to be registered under Section 12(b) of the Exchange Act, pursuant to Rule 12g-3(a) promulgated thereunder.\nImmediately following the Spin-off, Post owned approximately 14.2% of BellRing Common Stock and the former holders of Old BellRing Class A Common Stock owned approximately 28.5% of BellRing Common Stock. As a result of the Spin-off, the dual class voting structure of Old BellRing was eliminated. As of September 30, 2023, Post had no ownership of BellRing Common Stock.\nUnless otherwise indicated or the context otherwise requires, all references in this report to BellRing, we, our, us, the Company and our Company refer to (1) Old BellRing and its consolidated subsidiaries during the periods prior to the\ncompletion of the Spin-off, including BellRing LLC, Premier Nutrition Company, LLC (Premier Nutrition), Dymatize Enterprises, LLC (Dymatize), Supreme Protein, LLC (Supreme Protein), the PowerBar brand and Active Nutrition International GmbH (Active Nutrition International) and (2) us and our consolidated subsidiaries during the periods subsequent to the Spin-off, including, BellRing LLC, Premier Nutrition, Dymatize, Supreme Protein, Active Nutrition International and Premier Nutrition Canada, Inc., in each case, unless otherwise stated or the context otherwise indicates.\nOur History prior to the Spin-off\nPrior to completion of the Spin-off, and subsequent to Old BellRings initial public offering (the Old BellRing IPO), which was completed in October 2019, our subsidiary BellRing LLC was the holder of Posts active nutrition business, which had been comprised of Premier Nutrition, Dymatize, the PowerBar brand and Active Nutrition International. The members of BellRing LLC were Post and Old BellRing. Old BellRing held the voting membership unit of BellRing LLC (which represented the power to appoint and remove the members of the board of managers of BellRing LLC and no economic interest). Post held one share of the Old BellRing Class B Common Stock, which represented 67% of the voting power of the common stock of Old BellRing, with the holders of Old BellRing Class A Common Stock holding 33% of the voting power. Immediately prior to completion of the Spin-off, Post owned 71.5% of the economic interests in BellRing LLC, and Old BellRing (and, indirectly, the holders of the Old BellRing Class A Common Stock) owned 28.5% of the economic interests in BellRing LLC. Old BellRing, as a holding company, had no material assets other than its ownership of BellRing LLC units and its indirect interests in the subsidiaries of BellRing LLC.\nPost had acquired the businesses that comprised its active nutrition business in a series of transactions during 2013, 2014 and 2015. In its fiscal year ended September 30, 2013, Post acquired Premier Nutrition Corporation, which, at the time, was a marketer and distributor of high-quality protein shakes and nutrition bars under the Premier Protein brand and nutritional supplements under the Joint Juice brand. Effective September 30, 2019, Premier Nutrition Corporation converted to a limited liability company and changed its corporate name to Premier Nutrition Company, LLC.\nIn its fiscal year ended September 30, 2014, Post acquired Dymatize, which, at the time, was a manufacturer and marketer of high-quality protein powders and nutritional supplements under the Dymatize brand and nutrition bars under the Supreme Protein brand.\nIn its fiscal year ended September 30, 2015, Post acquired the PowerBar brand and Active Nutrition International (then known as Powerbar Europe GmbH). The PowerBar brand was founded in 1986.\nOur Organizational Structure\nAs a result of the Spin-off:\nWe became the new public parent company of, and successor issuer to, Old BellRing, and shares of our BellRing Common Stock were deemed to be registered under Section 12(b) of the Exchange Act, pursuant to Rule 12g-3(a) promulgated thereunder.\nOld BellRing is our wholly-owned subsidiary.\nAll of our membership interests in BellRing LLC were contributed to Old BellRing and Old BellRing is the sole equity member of BellRing LLC.\nImmediately following the Spin-off, Post owned 19,397,339 shares, or approximately 14.2%, of BellRing Common Stock. On August 11, 2022, Post disposed of 14,800,000 shares of BellRing Common Stock, which resulted in Post owning 4,597,339 shares, or approximately 3.4%, of BellRing Common Stock as of September 30, 2022. On November 25, 2022, Post disposed of its remaining shares of BellRing Common Stock, which resulted in Post having no ownership of BellRing Common Stock as of September 30, 2023.\nSee Risk Factors included in ITEM 1A. RISK FACTORS\nIn addition to the information discussed elsewhere in this report, the following risks and uncertainties, some of which have occurred and any of which may occur in the future, could have a material adverse effect on our business, financial condition, results of operations and cash flows. Although the risks below are organized by heading, and each risk is described separately, many of the risks are interrelated. Additional risks and uncertainties not presently known to us or that we currently deem immaterial also may impair our business, financial condition, results of operations and cash flows.\nIndustry and Operating Risks\nA substantial amount of our net sales comes from our RTD protein shakes, and a decrease in sales of our RTD protein shakes would adversely affect our business, financial condition, results of operations and cash flows.\nA substantial amount of our net sales is derived from our RTD protein shakes. Sales of our RTD protein shakes represented approximately 79.6% of our net sales in our year ended September 30, 2023. We believe that sales of our RTD protein shakes will continue to constitute a substantial amount of our net sales for the foreseeable future. Our business, financial condition, results of operations and cash flows would be harmed by a decline in the market for our RTD protein shakes, increased competition in the market for those products, disruptions in our ability to produce those products, whether due to manufacturer inability, supply chain failures or otherwise, or our failure or inability to provide sufficient investment to support and market those products as needed to maintain or grow their competitive position or to achieve more widespread market acceptance.\nWe operate in a category with strong competition.\nThe convenient nutrition category in which we operate is highly competitive. We compete with other brands in the convenient nutrition category and with many nutritional food and beverage players, as well as manufacturers of private label and store brand products. Many of our competitors offer products similar to our products, or a wider range of products than we offer, and may offer their products at more competitive prices than we do. Competition in our industry is based on, among other things, product quality, taste, functional benefits, nutritional value and ingredients, convenience, brand loyalty and positioning, product variety, product packaging, shelf space, price, promotional activities and the ability to identify and satisfy dynamic, emerging consumer preferences. Some of our principal competitors have substantially more financial, marketing and other resources than we have. A strong competitive response from one or more of our competitors to our marketplace efforts, or a shift in consumer preferences to competitors products, could result in us reducing pricing, increasing marketing or other expenditures or losing market share. Competitive pressures also may restrict our ability to increase our prices, including in response to cost increases. Our profits could decrease if a reduction in prices or increased costs are not counterbalanced with increased sales volume. In addition, our competitors are increasingly using social media networks to advertise products. If we are unable to use social media effectively to advertise our products, it could adversely affect our business, financial condition, results of operations and cash flows.\nDisruption of our supply chain and changes in weather conditions could have an adverse effect on our business, financial condition, results of operations and cash flows.\nOur ability to make, move and sell products in coordination with our suppliers, third-party contract manufacturers and distributors is critical to our success. Damage or disruption to our collective supply, manufacturing or distribution capabilities resulting from weather, freight carrier availability, any potential effects of climate change, natural disaster, pandemics or other outbreaks of contagious diseases, governmental restrictions or mandates, labor shortages, border closures, freight carrier availability, agricultural diseases, fires or evacuations related thereto, explosions, cyber incidents, terrorism, strikes or other labor unrest, repairs or enhancements at facilities manufacturing or delivering our products or other reasons could impair our ability to source inputs or manufacture, sell or timely deliver our products. During fiscal 2021 and 2022, the COVID-19 pandemic impacted our operations, including causing disruptions in our supply chain.\nChanges in weather conditions and natural disasters, such as fires, floods, droughts, frosts, hurricanes, earthquakes, tornadoes, insect infestations and plant disease, also may affect the cost and supply of commodities used as raw materials, including milk-based, whey-based and soy-based proteins, protein blends, sweeteners and vitamin and mineral blends. Further, as we rely on a limited number of third-party suppliers to provide certain ingredients and packaging materials, and one supplier for the majority of our milk-based protein, adverse events affecting such suppliers may limit our ability to obtain such raw materials, or alternatives for these raw materials, at competitive prices, or at all. For example, for our year ended September 30, 2023, approximately 53.8% of our Premier Protein RTD shake supply came from our largest third-party contract manufacturer, with approximately 31.9% of our Premier Protein RTD shake supply manufactured at its Joplin, Missouri facility. In addition, production of the RTD protein shakes in the 11 ounce size by our third-party contract manufacturers requires packaging that we currently are sourcing from only one supplier, and equipment that our third-party contract manufacturers are currently sourcing from the same supplier. Our supply of packaging for our 11 ounce RTD protein shakes from this supplier comes primarily from three of its locations. Competitors can be affected differently by weather conditions and natural disasters depending on the location of their suppliers and operations.\nWe are currently dependent on a limited number of third-party contract manufacturers for the manufacturing of most of our products, including one manufacturer for the majority of our RTD protein shakes. Our business could suffer if we do not continue to contract with key third-party manufacturers or as a result of a third-party contract manufacturers inability to produce our products for us in the quantities required, on time or to our specifications.\nAll of our RTD protein shakes and most of our other products are manufactured by a limited number of independent third-party contract manufacturers. For our year ended September 30, 2023, approximately 53.8% of our Premier Protein RTD shake supply came from a single manufacturer and approximately 31.9% from a single facility of that manufacturer. Although we have added additional third-party contract manufacturers of our Premier Protein RTD shakes to our third-party contract manufacturing network, our number of third-party contract manufacturers is still limited and if one or more of our third-party contract manufacturers is unable to meet our supply requirements, it could have a material adverse impact on our business, financial condition, results of operations and cash flows. In fiscal 2019, a former third-party contract manufacturer that we had expected to produce less than 10% of our RTD protein shakes for that year did not produce as we expected, which resulted in our termination of our agreement with it. Also, if we experience significant increases in demand for our products, as we did beginning in the second quarter of fiscal 2021 through fiscal 2023, we and these third-party contract manufacturers may not be able to obtain in a timely manner the equipment, ingredients or packaging materials required to manufacture our products and allocate sufficient capacity to us in order to meet our requirements, fill our orders in a timely manner or meet our quality standards. Further, as we did in fiscal 2022 and 2023, we may experience operational difficulties with any of these third-party contract manufacturers, such as limitations on production capacity, failure to meet our quantity requirements, including as a result of pandemics or other outbreaks of contagious diseases, increases in manufacturing costs, errors in complying with product specifications, insufficient quality control and failure to meet production deadlines. We have had to limit our stock-keeping units (SKUs) and place one or more of our products on allocation. In addition, we rely in part on our third-party contract manufacturers to maintain the quality of our products. The failure or inability of our third-party contract manufacturers to comply with the specifications and requirements of our products could result in product withdrawal or recall, which could materially and adversely affect our reputation and subject us to significant liability should the consumption of any of our products cause or be claimed to cause illness or physical harm. For example, in fiscal 2022, a third-party manufacturer that produced less than 2% of our Premier Protein RTD protein shakes initiated a recall of all products manufactured in one of its facilities, including our Premier Protein RTD protein shakes. The inability of third-party contract manufacturers to ship orders in a timely manner, in desirable quantities or to meet our safety, quality and social compliance standards or regulatory requirements could have a material adverse impact on our business, financial condition, results of operations and cash flows. Additionally, our business could be adversely affected if any of these third parties fail to comply with governmental regulations applicable to the manufacturing of our products or if any of these third parties cease doing business with us or go out of business.\nCertain of our relationships with these third parties are subject to minimum volume commitments, whereby the third-party contract manufacturer has committed to produce, and we have committed to purchase, a minimum quantity of product, and we or the contract manufacturer may alternatively pay the other a mostly fixed amount rather than produce or purchase the minimum quantities. Despite the minimum volume commitments, we may nonetheless experience situations where such manufacturers are unable to fulfill their minimum volume obligations under our agreements or cannot produce sufficient amounts of product to meet consumer demand. For example, due to (i) better than expected volume growth for our Premier Protein RTD shakes and Dymatize powders in the second half of fiscal 2021 and in fiscal 2022 and, as to Premier Protein RTD shakes in fiscal 2023, (ii) delays in production and planned incremental production capacity by our third-party contract manufacturer network and (iii) in the case of Dymatize powders, whey protein availability, our customer demand exceeded our available capacity and resulted in Premier Protein RTD shakes and Dymatize powders inventories below acceptable levels during fiscal 2021 and Premier Protein RTD shakes inventories below acceptable levels in fiscal 2022 and into fiscal 2023. If we need to replace an existing third-party contract manufacturer, our products may not be available when required on acceptable terms, or at all. Also, if demand for our products is significantly below our expectations, we may be obligated to pay penalties to our third-party contract manufacturers for failing to purchase contracted minimum purchase quantities.\nOur reliance on a limited number of suppliers for certain equipment, ingredients and packaging materials, the price and availability of ingredients and packaging materials, higher freight costs and higher energy costs could negatively impact our business, financial condition, results of operations and cash flows.\nWe rely on a limited number of third-party suppliers to provide certain equipment, ingredients and packaging materials used in our business. The primary ingredients used in our business include milk-based, whey-based and soy-based proteins, protein blends, sweeteners and vitamin and mineral blends, and one supplier provides the majority of our milk-based protein. The supply and price of these ingredients are subject to market conditions and are influenced by many factors beyond our control, including labor shortages, pandemics or other outbreaks of contagious diseases, animal feed costs, weather patterns affecting ingredient production, governmental programs and regulations, insects, plant diseases and inflation. Our milk-based protein costs have increased and may continue to increase due to factors such as labor shortages, pandemics or other outbreaks\nof contagious diseases, animal feed costs, weather patterns affecting ingredient production, governmental programs and regulations, insects, plant diseases and inflation. Our primary packaging materials include aseptic foil and plastic lined cardboard cartons, flexible and rigid plastic film and containers, beverage packaging and corrugate. We utilize a sole supplier for the aseptic packaging for, and our third-party contract manufacturers use equipment from the same sole supplier to manufacture, our Premier Protein RTD shakes in the 11 ounce size. Although we maintain relationships with suppliers with the objective of ensuring that we have adequate sources for the supply of such ingredients and packaging materials, increases in demand for such items, both within our industry and in general, can result in shortages and higher costs. Our suppliers may not be able to meet our delivery schedules, we may lose a significant or sole supplier, a supplier may not be able to meet performance and quality specifications and we may not be able to purchase such items at a competitive cost. Further, the supply and price of these inputs are subject to market conditions and are impacted by many factors beyond our control, including labor shortages, pandemics and other outbreaks of contagious diseases weather conditions, natural disasters, governmental programs, regulations and trade and tariff policies, insects, plant diseases, inflation and increased demand. Our freight costs may increase due to factors such as labor shortages, increased fuel costs, limited carrier availability, increased compliance costs associated with new or changing government regulations, pandemics or other outbreaks of contagious diseases and inflation. Higher prices for natural gas, propane, electricity and fuel also may increase our ingredient, production and delivery costs. Historically, the prices of certain of our raw materials, energy and other supplies used in our business have fluctuated widely. In addition, we have experienced shortages of certain of our raw materials, which result in us paying increased costs for such inputs and impact our ability to produce our products.\nThe prices charged for our products may not reflect changes in our input costs at the time they occur, or at all. Accordingly, changes in input costs may limit our ability to maintain existing margins and may have a material adverse effect on our business, financial condition, results of operations and cash flows. While we try to manage the impact of increases in certain of these costs by locking in prices on quantities required to meet our anticipated production requirements, if we fail, or are unable, to hedge and prices subsequently increase, or if we institute a hedge and prices subsequently decrease, our costs may be greater than anticipated or greater than our competitors costs, and our business, financial condition, results of operations and cash flows could be adversely affected.\nWe must identify changing consumer and customer preferences and behaviors and develop and offer products to meet these preferences.\nConsumer and customer preferences and behaviors evolve over time due to a variety of factors. The success of our business depends on our ability to identify these changing preferences and behaviors, to distinguish between short-term trends and long-term changes in such preferences and behaviors, and to continue to develop and offer products that appeal to consumers and customers through the sales channels that they prefer. Consumer preference and behavior changes include dietary trends, attention to different nutritional aspects of foods and beverages, acceptance and the use of weight management medication, consumer in-home and on-the-go consumption patterns, preferences for certain sales channels, concerns regarding the health effects of certain foods and beverages, attention to sourcing practices relating to ingredients, animal welfare concerns, environmental concerns regarding packaging and attention to other social and governance aspects of our Company and operations. Several of our customers have announced goals to transition to recyclable, compostable or reusable packaging. These changing preferences and requirements could require us to use specially sourced ingredients and packaging types that may be more difficult to source or entail a higher cost or incremental capital investment which we may not be able to pass on to customers.\nConsumers are increasingly shopping through eCommerce websites and mobile commerce applications and this trend is significantly altering the retail landscape in our category. If we are unable to effectively compete in the expanding eCommerce market or develop the data analytics capabilities needed to generate actionable commercial insights, our business performance may be impacted, which may negatively impact our financial condition, results of operations and cash flows.\nEmerging science and theories regarding health are constantly evolving, and products or methods of eating once considered healthy may over time become disfavored by consumers or no longer be perceived as healthy. Approaches regarding healthy lifestyles also are the subject of numerous studies and publications, often with differing views and opinions, some of which may be adverse to us. The growing acceptance and use of medication to manage weight could negatively affect the demand for many types of food in general, including our products. In order to respond to new and evolving consumer and customer demands, achieve market acceptance and keep pace with new nutritional, technological and other developments, we must constantly introduce new and innovative products into the market. We may not be successful in developing, introducing on a timely basis or marketing any new or enhanced products, and specifically, the initial sales volumes for new or enhanced products may not reach anticipated levels, we may be required to engage in extensive marketing efforts to promote such products, the costs of developing and promoting such products may exceed our expectations and such products may not perform as expected. Further, certain ingredients used in our products may become negatively perceived by consumers, resulting in decreased demand for our products or reformulation of existing products to remove such ingredients, which may negatively affect taste or other qualities.\nProlonged negative perceptions concerning the health implications of certain food and beverage products could influence consumer preferences and acceptance of some of our products and marketing programs.\nAlthough we strive to respond to consumer or customer preferences and social expectations, we may not be successful in these efforts. Any significant changes in consumer or customer preferences or our inability to anticipate or react, or effectively introduce new products in response, to such changes could result in reduced demand for our products, which could negatively impact our business, financial condition, results of operations and cash flows.\nOur results may be adversely impacted if consumers do not maintain favorable perceptions of our brands.\nMaintaining and continually enhancing the value of our brands is critical to the success of our business. Brand value is based in large part on consumer perceptions. Brand value could diminish significantly due to a number of factors, including our products becoming unavailable to consumers, our failure to maintain the quality of our products, the failure of our products to deliver consistently positive consumer experiences, adverse publicity about our or our suppliers or third-party contract manufacturers business practices, our products, packaging or ingredients, concerns about food safety, real or perceived health concerns regarding our products or consumer perception that we have acted in an irresponsible manner. Consumer demand for our products also may be impacted by changes in the level of advertising or promotional support. We may need to increase our marketing and advertising spending in order to maintain and increase customer and consumer awareness, protect and grow our existing market share or to promote new products, which could impact our business, financial condition, results of operations and cash flows. However, an increase in our marketing and advertising efforts may not maintain our current reputation or lead to an increase in brand awareness. Negative perceptions of the food and beverage industry as a whole, or the convenient nutrition category, may heighten attention from consumers, third parties, the media, governments, stockholders and other stakeholders to such factors and could adversely affect our brand image. The growing use of social and digital media by consumers, us and third parties increases the speed and extent that information or misinformation and opinions can be shared. Negative posts or comments about us, our brands, products or packaging or the food and beverage industry generally on social or digital media (whether factual or not) or security breaches related to use of our social media could seriously damage our brands and reputation. If we do not maintain favorable perceptions of our products and our brands, or if we experience a loss of consumer confidence in our brands, our business, financial condition, results of operations and cash flows could be adversely impacted.\nIn addition, our success in maintaining and enhancing our brand image depends on our ability to anticipate change and adapt to a rapidly changing marketing and media environment, including our increasing reliance on social media and online, digital and mobile dissemination of marketing and advertising campaigns and the increasing accessibility and speed of dissemination of information. Furthermore, third parties may sell counterfeit or imitation versions of our products that are inferior or pose safety risks. If consumers confuse these counterfeit products for our products or have a bad experience with the counterfeit brand, they might refrain from purchasing our brands in the future, which could harm our brand image and sales. If we do not successfully maintain and enhance our reputation and brand health, then our brands, product sales, financial condition and results of operations could be materially and adversely affected.\nConsolidation in our distribution channels, and competitive, economic and other pressures facing our customers, may hurt our profit margins.\nOver the past several years, our channels have undergone significant consolidations and mass merchandisers and non-traditional retailers are gaining market share. As this trend continues and such customers grow larger, they may seek to use their position to improve their profitability through improved efficiency, lower pricing, increased reliance on their own brand name products, increased emphasis on generic and other value brands and increased promotional programs. If we are unable to respond to these requirements, our profitability or volume growth could be negatively impacted. Additionally, if any of our customers are consolidated with another entity and the surviving entity of any such consolidation is not a customer or decides to discontinue purchasing our products, we may lose significant amounts of our preexisting business with the acquired customer. Further, the economic and competitive landscape for our customers is constantly changing, such as the emergence of new sales channels like eCommerce, and our customers responses to those changes could impact our business. Consolidation in our channels also increases the risk that adverse changes to our customers business operations or financial performance would have a material adverse effect on us.\nOur sales and profit growth are dependent upon our ability to expand existing market penetration and enter into new markets.\nSuccessful growth depends on our ability to add new customers, enter into new markets, expand the number of products sold through existing customers and enhance our product portfolio. This growth would include expanding the number of our products retailers offer for sale, our product placement and our ability to secure additional shelf or retail space for our products, as well as increased access to online platforms to sell our products. The expansion of our business depends on our ability to obtain new, or expand our business with existing, customers, such as club, FDM, eCommerce, convenience and specialty\ncustomers. Our failure to successfully add new customers, enter into new markets, expand the number of products sold through existing customers and enhance our product portfolio could have a material adverse effect on our business, financial condition, results of operations and cash flows.\nIf our products become contaminated or adulterated, or if they are misbranded or mislabeled, we might need to recall or withdraw those items and we may experience product liability claims.\nSelling food products, beverages and nutritional supplements involves a number of legal and other risks, including contamination, spoilage, degradation, tampering, mislabeling or other adulteration. Additionally, many of the raw materials used to make certain of our products, particularly milk-based protein, are vulnerable to spoilage and contamination by naturally occurring molds and pathogens, such as salmonella, and pests. These pathogens may survive in our products as a result of improper handling by customers or consumers. We do not have control over handling procedures once our products have been shipped for distribution. We may need to recall or withdraw some or all of our products if they become damaged, contaminated, adulterated, mislabeled or misbranded, whether caused by us or someone in our manufacturing or supply chain. For example, in fiscal 2022, a third-party manufacturer that produced less than 2% of our Premier Protein RTD protein shakes initiated a recall of all products manufactured in one of its facilities, including our Premier Protein RTD protein shakes. A recall or withdrawal could result in destruction of product ingredients and inventory, negative publicity, temporary plant closings for us or our third-party contract manufacturers, supply chain interruption, substantial costs of compliance or remediation, fines and increased scrutiny by federal, state and foreign regulatory agencies. New scientific discoveries regarding microbes and food manufacturing may bring additional risks and latent liability. Should consumption of any product cause injury, we may be liable for monetary damages as a result of a judgment against us. In addition, adverse publicity, including claims, whether or not valid, that our products or ingredients are unsafe or of poor quality, may discourage consumers from buying our products or cause production and delivery disruptions. Although we have various insurance programs in place and may have rights to indemnification in certain situations, any of these events or a loss of consumer confidence could have an adverse effect on our business, financial condition, results of operations and cash flows.\nLoss of, a significant reduction of purchases by or bankruptcy of a major customer may adversely affect our business, financial condition, results of operations and cash flows.\nA limited number of customer accounts represents a large percentage of our combined net sales. Our largest customers, Costco, Walmart and its affiliates (which includes Sams Club) and Amazon, accounted for approximately 75.3% of our net sales in our year ended September 30, 2023.\nThe success of our business depends, in part, on our ability to maintain our level of sales and product distribution through the club, FDM, eCommerce, specialty and convenience channels. The competition to supply products to these high-volume stores is intense. Currently, we do not have material long-term supply agreements with our customers, and our customers frequently reevaluate the products they carry. A decision by our major customers to decrease the amount of product purchased from us, including in response to shifts in consumer purchasing or traffic trends, sell another brand on an exclusive or priority basis or change the manner of doing business with us could reduce our revenues and materially adversely affect our business, financial condition, results of operations and cash flows. Our customers also may offer branded and private label products that compete directly with our products for retail shelf space and consumer purchases. Accordingly, there is a risk that our customers may give higher priority to their own products or to the products of our competitors. In the event of a loss of any of our large customers, a significant reduction of purchases by any of our large customers or the bankruptcy or serious financial difficulty of any of our large customers, our business, financial condition, results of operations and cash flows may be adversely affected.\nFluctuations in our business due to changes in our promotional activities and seasonality may have an adverse impact on our financial condition, results of operations and cash flows.\nWe periodically offer a variety of sales and promotional incentives to our customers and consumers. Our net sales and profitability are impacted by the introduction and discontinuance of such sales and promotion incentives. In addition, we have experienced and expect to continue to experience fluctuations in our quarterly results of operations due to the seasonal nature of our business. Seasonality could cause our results of operations for an interim financial period to fluctuate and not be indicative of our full year results. Seasonality also impacts relative revenue and profitability of each quarter of the year, both on a quarter-to-quarter and year-over-year basis. If we fail to effectively manage our inventories, fluctuations in business as a result of promotional activities and seasonality may have an adverse impact on our financial condition, results of operations and cash flows.\nOur international operations subject us to additional risks.\nWe are subject to a number of risks related to doing business internationally, any of which could significantly harm our financial and operational performance. These risks include:\nrestrictions on the transfer of funds to and from foreign countries, including potentially negative tax consequences;\nunfavorable changes in tariffs, quotas, trade barriers or other export or import restrictions;\nunfavorable changes in local regulatory requirements that impact our ability to sell our products in that country;\nunfavorable foreign exchange controls and currency exchange rates;\nchallenges associated with cross-border product distribution;\nan outbreak of a contagious disease, which may cause us or our distributors, third-party contract manufacturers, vendors or customers to temporarily suspend our or their respective operations in the affected city or country;\nincreased exposure to general market and economic conditions, political and economic uncertainty and volatility and other events, including social unrest, government shutdowns, terrorist activity, acts of war and travel restrictions, outside of the U.S.;\ncompliance with U.S. laws and regulations affecting operations outside of the U.S., including anti-corruption regulations (such as the U.S. Foreign Corrupt Practices Act), and changes to such laws and regulations;\ncompliance with treaties, antitrust and competition laws, data privacy laws (including the E.U.s General Data Protection Regulation), anti-corruption laws (including the U.K. Bribery Act), food safety and marketing laws and other regulatory requirements and a variety of other local, national and multi-national regulations and laws in multiple jurisdictions and changes to such laws and regulations;\nunfavorable changes in foreign tax treaties and policies, changes in the mix of earnings in countries with differing statutory tax rates, changes in the valuation of deferred tax assets and liabilities, changes in tax laws or their interpretations or tax audit implications;\nthe difficulty and costs of maintaining effective data security;\nthe potential difficulty of enforcing intellectual property and contractual rights;\nincreased risk of uncollectible accounts and longer collection cycles;\nunfavorable changes in labor conditions and difficulties in staffing our operations; and\nthe difficulty and costs of designing and implementing an effective control environment across geographic regions.\nOur financial performance on a U.S. dollar denominated basis is subject to fluctuations in currency exchange rates. Because we have operations and assets in foreign jurisdictions, as well as a portion of our contracts and revenues denominated in foreign currencies, and our consolidated financial statements are presented in U.S. dollars, we must translate our foreign assets, liabilities, revenues and expenses into U.S. dollars at applicable exchange rates. Consequently, fluctuations in the value of foreign currencies relative to the U.S. dollar may negatively affect the value of these items in our consolidated financial statements. Our principal currency exposures are to the Canadian dollar and the Euro. To the extent we fail to manage our foreign currency exposure adequately, we may suffer losses in value of our net foreign currency investment, and our business, financial condition, results of operations and cash flows may be negatively affected.\nOur market size and related estimates may prove to be inaccurate.\nData for the convenient nutrition category is collected for most, but not all, channels, and as a result, it is difficult to estimate the size of the market and predict the rate at which the market for our products will grow. We estimate the market size of the convenient nutrition category, including by geography, product form and consumer need state, based, in part, upon forecasts and information obtained from independent trade associations, industry publications and surveys and other independent sources, proprietary research studies and managements knowledge of the industry. While these estimates are made in good faith and are based on assumptions and estimates we believe to be reasonable, they may not be accurate.\nOur intellectual property rights are valuable and any inability to protect them, or termination of our material intellectual property licenses, could reduce the value of our products and brands and have a material adverse effect on our business.\nWe consider our intellectual property rights, particularly our trademarks, but also our patents, trade secrets, know-how and copyrights, to be a significant and valuable asset of our business. We attempt to protect our intellectual property rights through a combination of patent, trademark, copyright and trade secret laws, as well as third-party nondisclosure, confidentiality and assignment agreements and confidentiality provisions in third-party agreements and the policing of third party misuses of our\nintellectual property. Our failure or inability to obtain or maintain adequate protection of our intellectual property rights, or any change in law or other changes that serve to lessen or remove the current legal protections of intellectual property, may diminish our competitiveness and could materially harm our business. We also are subject to risks associated with protection of our trademarks and other intellectual property licensed to distributors of our products and of our trade secrets to our third-party contract manufacturers. If our licensed distributors or third-party contract manufacturers fail to protect our trademarks, trade secrets and other intellectual property, either intentionally or unintentionally, our business, financial condition, results of operations and cash flows may be adversely affected.\nWe market certain of our products pursuant to intellectual property license agreements. These licenses give us the right to use certain names, characters and logos in connection with our products and to sell the products. If we were to breach any material term of these license agreements and not timely cure the breach, the licensor could terminate the agreement. If the licensor were to terminate our rights to use the names, characters and logos for this reason or any other reason, or if a licensor decided not to renew a license agreement upon the expiration of the license term, the loss of such rights could have a material adverse effect on our business.\nWe may not be able to effectively manage our growth, which could materially harm our business, financial condition, results of operations and cash flows.\nOur growth has placed, and we expect that our continued growth may place, a significant demand on our management, personnel, systems and resources. Our continued growth will require an increased investment by us in our third-party manufacturing relationships, personnel, technology, facilities and financial and management systems and controls, including monitoring and assuring our compliance with applicable regulations. We will need to integrate, train and manage a growing employee base. Unless our growth results in an increase in our revenues that is proportionate to the increase in our costs associated with this growth, our operating margins and profitability will be adversely affected. If we fail to effectively manage our growth, our business, financial condition, results of operations and cash flows could be materially harmed.\nTechnology failures, cybersecurity incidents and corruption of our data privacy protections could disrupt our operations and negatively impact our business.\nWe rely on information technology networks and systems to process, transmit and store operating and financial information, to manage and support a variety of business processes and activities and to comply with regulatory, legal and tax requirements. We also depend upon our information technology infrastructure for digital marketing activities and for electronic communications among our locations, personnel, customers, third-party contract manufacturers and suppliers. The importance of such networks and systems has increased as a greater number of our employees work remotely all or part of the time. Our and our third-party manufacturing and distribution facilities and inventory management utilize information technology to increase efficiencies and control costs. Our and our third-party vendors information technology systems may be vulnerable to a variety of invasions, interruptions or malfunctions due to events beyond our or their control, including, but not limited to, natural disasters, terrorist attacks, telecommunications failures, power outages, computer viruses, ransomware and malware, hardware or software failures, cybersecurity incidents, hackers and other causes. Such invasions, interruptions or malfunctions could negatively impact our business.\nIf we do not allocate and effectively manage the resources necessary to build and sustain the proper technology infrastructure and to maintain and protect the related automated and manual control processes, or if one of our third-party service providers fails to provide the services we require, we could be subject to billing and collection errors, business disruptions or damage resulting from such events, particularly material security breaches and cybersecurity incidents. Cyberattacks and other cyber incidents are occurring more frequently, are constantly evolving in nature, are becoming more sophisticated and are being made by groups and individuals (including criminal hackers, hacktivists, state-sponsored institutions, terrorist organizations and individuals or groups participating in organized crime) with a wide range of expertise and motives (including monetization of corporate, payment or other internal or personal data, theft of trade secrets and intellectual property for competitive advantage and leverage for political, social, economic and environmental reasons).\nIf any of our significant information technology systems suffers severe damage, disruption or shutdown, including by malicious or unintentional actions of contractors or employees or by cyber or ransomware attacks, and our business continuity plans do not effectively resolve the issues in a timely manner, our product sales, financial condition, results of operations and cash flows may be materially and adversely affected, and we could experience delays in reporting our financial results. In addition, there is a risk of business interruption, litigation and reputational damage from leaks of confidential or personal information. While we have insurance programs in place related to these matters, the potential liabilities associated with such events, or those that could arise in the future, could be excluded from coverage or, if covered, could exceed the coverage provided by such programs. Although we have not detected a material security breach or cybersecurity incident to date, we have been the target of events of this nature and expect them to continue.\nWe also are subject to an evolving body of federal, state and foreign laws, regulations, guidelines and principles regarding data privacy, data protection and data security. Several states as well as foreign governments have laws and regulations regulating how businesses collect, use and protect personal information obtained from their data subjects, including the General Data Protection Regulation, the E.U.s retained version of General Data Protection Regulation, and the California Consumer Privacy Act, as amended by the California Privacy Rights Act, and we could incur substantial fines, other penalties or litigation related to violations of such laws and regulations.\nClimate change, or legal or market measures to address climate change, may negatively affect our business, reputation and operations.\nThere is growing concern that carbon dioxide and other greenhouse gases in the atmosphere may have an adverse impact on global temperatures, weather patterns and the frequency and severity of extreme weather and natural disasters. If any of these climate changes has a negative effect on agricultural productivity, we may be subject to decreased availability or less favorable pricing for certain commodities that are necessary for our products, such as milk-based, whey-based and soy-based proteins, protein blends, sweeteners and vitamin and mineral blends. In addition, increases in the frequency and severity of extreme weather and natural disasters may result in damage and disruptions to our manufacturing operations and distribution channels or our third-party contract manufacturers operations, particularly where a product is primarily sourced from a single location. Also, the impacts of these climate changes may cause unpredictable water availability or exacerbate water scarcity. Water is critical to our business, and the lack of available water of acceptable quality may lead to, among other things, adverse effects on our operations. The increasing concern over climate change and related environmental sustainability matters also may result in more federal, state, local and foreign legal requirements to reduce or mitigate the effects of greenhouse gases or conserve and replenish water. If such laws are enacted, we may experience significant increases in our costs of operation and delivery. Further, our business could be adversely affected if we are unable to effectively address increased concerns from the media, stockholders and other stakeholders on climate change and related environmental sustainability and governance matters. In addition, any failure to achieve goals we may set with respect to reducing our impact on the environment or perception of a failure to act responsibly with respect to the environment can lead to adverse publicity, which could damage our reputation. As a result, climate change could negatively affect our business, financial condition, results of operations and cash flows.\nIf we pursue acquisitions or other strategic transactions, we may not be able to successfully consummate favorable transactions or successfully integrate acquired businesses.\nFrom time to time, we may evaluate potential acquisitions or other strategic transactions. Evaluating potential transactions, including divestitures, requires additional expenditures (including legal, accounting and due diligence expenses, higher administrative costs to support the acquired entities and information technology, personnel and other integration expenses) and may divert the attention of our management from day-to-day operating matters. Companies or operations we acquire or joint ventures we enter into may not be profitable or may not achieve the anticipated profitability that justify our investments.\nWith respect to acquisitions, we may not be able to identify suitable candidates, consummate a transaction on terms that are favorable to us or achieve expected returns and other benefits as a result of integration challenges. The successful integration of acquisitions is complex and depends on our ability to manage the operations and personnel of the acquired businesses. Potential difficulties we may encounter as part of the integration process include, but are not limited to, the following: employees may voluntarily or involuntarily separate from employment with us or the acquired businesses because of the acquisitions; our management may have its attention diverted while trying to integrate the acquired businesses; we may encounter obstacles when incorporating the acquired businesses into our operations and management; we may be required to recognize impairment charges; and integration may be more costly or more time consuming and complex or less effective than anticipated. With respect to proposed divestitures of assets or businesses, we may encounter difficulty in finding acquirers or alternative exit strategies on terms that are favorable to us, which could delay the accomplishment of our strategic objectives, or our divestiture activities may require us to recognize impairment charges.\nOur corporate development activities may present financial and operational risks and may have adverse effects on existing business relationships with suppliers and customers. Future acquisitions also could result in potentially dilutive issuances of equity securities, the incurrence of debt, contingent liabilities and depreciation and amortization expenses related to certain tangible and intangible assets and increased operating expenses, all of which could, individually or collectively, adversely affect our business, financial condition, results of operations and cash flows.\nFinancial and Economic Risks\nWe have substantial debt, which could have a negative impact on our financing options and liquidity position and which could adversely affect our business.\nWe have a significant amount of debt. As of September 30, 2023, we had $865.0 million in aggregate principal amount of total debt. Additionally, our secured revolving credit facility has a remaining borrowing capacity of $225.0 million as of September 30, 2023 (all of which would be secured when drawn).\nOur overall leverage and the terms of our financing arrangements could:\nlimit our ability to obtain additional financing in the future for working capital, capital expenditures or acquisitions, to fund growth or for general corporate purposes, even when necessary to maintain adequate liquidity, particularly if any ratings assigned to our debt securities by ratings organizations were revised downward;\nmake it more difficult for us to satisfy the terms of our obligations under the terms of our financing arrangements;\nlimit our ability to refinance our indebtedness on terms acceptable to us, or at all;\nlimit our flexibility to plan for and to adjust to changing business and market conditions in the industries in which we operate and increase our vulnerability to general adverse economic and industry conditions;\nrequire us to dedicate a substantial portion of our cash flow from operations to make interest and principal payments on our debt, thereby limiting the availability of our cash flow to fund future investments, capital expenditures, working capital, business activities and other general corporate requirements;\nincrease our vulnerability to adverse economic or industry conditions; and\nsubject us to higher levels of indebtedness than our competitors, which may cause a competitive disadvantage and may reduce our flexibility in responding to increased competition.\nOur ability to meet expenses and debt service obligations will depend on our future performance, which will be affected by financial, business, economic and other factors, including the impact of pandemics and other outbreaks of contagious diseases, potential changes in consumer and customer preferences and behaviors, the success of product and marketing innovation and pressure from competitors. If we do not generate enough cash to pay our debt service obligations, we may be required to refinance all or part of our existing debt, sell assets, borrow more money or issue additional equity.\nDespite our level of indebtedness, we may be able to incur substantially more debt, which could further exacerbate the risks related to our debt leverage, and we may in any event be required to maintain a minimum level of indebtedness.\nWe may be able to incur significant additional indebtedness in the future. Although the financing arrangements governing our indebtedness contain restrictions on our ability to incur additional indebtedness, these restrictions are subject to a number of qualifications and exceptions, and the additional indebtedness that may be incurred in compliance with these restrictions could be substantial. These restrictions also may not prevent us from incurring certain obligations that may not constitute indebtedness under the documents governing our indebtedness.\nThe agreements governing our debt contain various covenants that limit our ability to take certain actions and also require us to meet financial maintenance tests, and failure to comply with these covenants could have a material adverse effect on us.\nOur financing arrangements contain restrictions, covenants and events of default that, among other things, require us to satisfy certain financial tests and maintain certain financial ratios and restrict our ability to incur additional indebtedness and to refinance our existing indebtedness. Financing arrangements which we enter into in the future could contain similar restrictions and additionally could require us to comply with similar, new or additional financial tests or to maintain similar, new or additional financial ratios. The terms of our financing arrangements, financing arrangements which we enter into in the future and any future indebtedness may impose various restrictions and covenants on us that could limit our ability to respond to market conditions, provide for capital investment needs or take advantage of business opportunities by limiting the amount of additional borrowings we may incur. These restrictions include compliance with, or maintenance of, certain financial tests and ratios and may limit or prohibit our ability to, among other things: borrow money or guarantee debt; create liens; pay dividends on or redeem or repurchase stock or other securities; make investments and acquisitions; enter into, or permit to exist, contractual limits on the ability of our subsidiaries to pay dividends to us; enter into new lines of business; enter into transactions with affiliates; and sell assets or merge with other companies.\nVarious risks, uncertainties and events beyond our control, including the impact of pandemics and other outbreaks of contagious diseases, could affect our ability to comply with these restrictions and covenants. Failure to comply with any of the restrictions and covenants in our existing or future financing arrangements could result in a default under those arrangements and under other arrangements that may contain cross-default provisions. Our credit agreement contains a covenant that requires us to maintain a total net leverage ratio (as defined in our credit agreement) not to exceed 6.00:1.00, as measured as of the last day of each fiscal quarter. A default would permit lenders to accelerate the maturity of the debt under these arrangements and to foreclose upon any collateral securing the debt. Under these circumstances, we might not have sufficient funds or other resources to satisfy all of our obligations. In addition, the limitations imposed by financing agreements on our ability to incur additional debt and to take other actions might significantly impair our ability to obtain other financing.\nTo service indebtedness and fund other cash needs, we will require a significant amount of cash. Our ability to generate cash depends on many factors beyond our control.\nOur ability to pay principal and interest on our debt obligations and to fund any planned capital expenditures and other cash needs will depend in part upon the future financial and operating performance of our subsidiaries and upon our ability to renew or refinance borrowings. Prevailing economic conditions and financial, business, our future financial and operating performance, competitive, legislative, regulatory and other factors, many of which are beyond our control, including the impact of pandemics and other outbreaks of contagious diseases, will affect our ability to make these payments.\nIf we are unable to make payments, refinance our debt or obtain new financing under these circumstances, we may consider other options, including: sales of assets; sale of equity; reductions or delays of capital expenditures, strategic acquisitions, investments and alliances; or negotiations with our lenders to restructure the applicable debt.\nOur business may not generate sufficient cash flow from operations, and future borrowings may not be available to us in an amount sufficient, to enable us to pay our indebtedness or to fund our other liquidity needs. We may need to refinance all or a portion of our indebtedness on or before maturity. We may not be able to refinance any of our debt on commercially reasonable terms, or at all.\nUncertain or unfavorable economic conditions, including during periods of high inflation, recessions or other economic disruption, could limit consumer and customer demand for our products, increase our costs or otherwise adversely affect us.\nThe willingness of consumers to purchase our products depends in part on general or local economic conditions and consumers discretionary spending habits. For instance in fiscal 2022 and fiscal 2023, the U.S. experienced significantly heightened inflationary pressures. In periods of adverse or uncertain economic conditions, including during periods of high inflation or recession concerns, consumers may purchase less of our products, purchase more value or private label products or may forgo certain purchases altogether. In addition, our customers may seek to reduce their inventories in response to those economic conditions. In those circumstances, we could experience a reduction in sales. Further, during economic downturns, it may be more difficult to convince consumers to switch to, or continue to use, our brands or convince new users to choose our brands without expensive sampling programs and price promotions. Also, as a result of economic conditions, we may be unable to raise our prices sufficiently to protect profit margins. We experienced inflationary headwinds across our business during fiscal 2022 and fiscal 2023, and we expect certain inflationary pressures to continue into fiscal 2024. This trend could have a materially adverse impact in the future if inflation rates were to significantly exceed our ability to achieve price increases or cost savings. Further, uncertain or unfavorable economic conditions, has and could continue to negatively impact the financial stability of our customers or suppliers, which could lead to increased uncollectible receivables or non-performance. Current global geopolitical tensions, including related to Ukraine and Israel and the Middle East, may exacerbate any economic downturn and inflation. Any of these events could have an adverse effect on our business, financial condition, results of operations and cash flows.\nIncreases in interest rates may negatively affect our earnings.\nAs of September 30, 2023, the aggregate principal amount of our debt instruments with exposure to interest rate risk was $25.0 million. Higher interest rates will increase the cost of servicing our financial instruments with exposure to interest rate risk and could materially reduce our profitability and cash flows.\nIn addition, the discontinuation, replacement or reform of the London Interbank Offered Rate (LIBOR) could affect interest rates and financing costs. LIBOR was discontinued effective June 2023. Our credit agreement provides for relatively new benchmarks or references for determining interest rates, including the Secured Overnight Financing Rate (SOFR) and the Sterling Overnight Index Average (SONIA). It is unclear, however, if alternative rates or benchmarks, such as SOFR and SONIA, will be widely adopted, and this uncertainty may impact the liquidity of the SOFR and SONIA loan markets. The new rates may not be as favorable to us as those in effect prior to the discontinuation of LIBOR, and these new rates may be more volatile. Also, there may be uncertainty as to the nature of alternative reference rates or as to the calculation of the applicable interest rate or payment amounts under the terms of an agreement or instrument that utilizes such rate or benchmark. While we do not expect the transition from LIBOR and the risks related thereto to have a material adverse effect on us, it remains uncertain at this time.\nOur borrowing costs and access to capital and credit markets could be adversely affected by a downgrade or potential downgrade of our credit ratings.\nRating agencies routinely evaluate us, and their ratings of our long-term and short-term debt are based upon a number of factors, including our cash generating capability, levels of indebtedness, policies with respect to stockholder distributions and financial strength generally, as well as factors beyond our control, such as the then-current state of the economy and our industry generally. Any downgrade of our credit ratings by a credit rating agency, whether as a result of our actions or factors which are beyond our control, can increase our future borrowing costs, impair our ability to access capital and credit markets on\nterms commercially acceptable to us or at all and result in a reduction in our liquidity. Our borrowing costs and access to capital markets also can be adversely affected if a credit rating agency announces that our ratings are under review for a potential downgrade. An increase in our borrowing costs, limitations on our ability to access the global capital and credit markets or a reduction in our liquidity can adversely affect our financial condition, results of operations and cash flows.\nU.S. and global capital and credit market issues, including those that have arisen as a result of heightened inflation and recession or other economic concerns, could negatively affect our liquidity, increase our costs of borrowing and disrupt the operations of our suppliers and customers.\nU.S. and global credit markets have, from time to time, experienced significant dislocations and liquidity disruptions which caused the spreads on prospective debt financings to widen considerably. These circumstances materially impacted liquidity in the debt markets, making financing terms for borrowers less attractive and in certain cases resulted in the unavailability of certain types of debt financing. In fiscal 2023, the U.S. experienced significantly heightened inflationary pressures and we expect certain inflationary pressures to continue into fiscal 2024. This and other events affecting the credit markets also have had, and may in the future have, an adverse effect on other financial markets in the U.S., which may make it more difficult or costly for us to raise capital through the issuance of common stock or other equity securities or refinance our existing debt, sell our assets or borrow money, if necessary. Our business also could be negatively impacted if our suppliers or customers experience disruptions resulting from tighter capital and credit markets or a slowdown in the general economy. Any of these risks could impair our ability to fund our operations or limit our ability to expand our business or increase our interest expense, which could have a material adverse effect on our business, financial condition, results of operations and cash flows.\nImpairment in the carrying value of intangible assets could negatively impact our financial condition and results of operations. If our goodwill or other intangible assets become impaired, we will be required to record impairment charges, which may be significant.\nOur balance sheet includes intangible assets, including goodwill, trademarks, trade names, customer relationships and other acquired intangibles. Goodwill is expected to contribute indefinitely to our cash flows and is not amortized. Our management reviews it for impairment on an annual basis or whenever events or changes in circumstances indicate that its carrying value may be impaired. Impairments to intangible assets may be caused by factors outside of our control, such as increasing competitive pricing pressures, lower than expected revenue and profit growth rates, changes in industry earnings before interest, taxes, depreciation and amortization (EBITDA) and revenue multiples, changes in discount rates based on changes in cost of capital (interest rates, etc.) or the loss or bankruptcy of a significant customer. These factors, along with other internal and external factors, could have a significant negative impact on our fair value determination, which could then result in a material impairment charge recorded in our results of operations. No impairments were recorded in the years ended September 30, 2023, 2022 and 2021. However, we could have impairments in the future.\nUnsuccessful implementation of business strategies to reduce costs, or unintended consequences of the implementation of such strategies, may adversely affect our business, financial condition, results of operations and cash flows.\nMany of our costs, such as freight, raw materials and energy, are outside of our control. Therefore, we must seek to reduce costs in other areas, such as through operating efficiency. If we are not able to complete projects designed to reduce costs and increase operating efficiency on time or within budget, or if the implementation of these projects results in unintended consequences, such as business disruptions, distraction of management and employees or reduced productivity, our business, financial condition, results of operations and cash flows may be adversely impacted. In addition, if the cost-saving initiatives we have implemented, or any future cost-saving initiatives, do not generate the expected cost savings and synergies, our business, financial condition, results of operations and cash flows may be adversely affected.\nWe have incurred, and we will continue to incur, additional fees, costs and expenses to create and maintain the corporate infrastructure to operate as a public company, and we have and we will continue to experience increased ongoing costs and expenses in connection with being a public company.\nPrior to our IPO, our business had historically used some of Posts corporate infrastructure and services to support our business functions. The expenses related to establishing and maintaining this infrastructure had been spread across all of Posts businesses and charged to us on a cost-allocation basis. The services historically provided to us by Post included, but were not limited to, finance, information technology, legal, human resources, quality, supply chain and purchasing functions. Following our IPO, we continued to receive some of these services pursuant to a master services agreement with Post, and in connection with the Spin-off, we, Post, Old BellRing and BellRing LLC entered into an amended and restated master services agreement, which was further amended in fiscal 2023. Under the amended and restated master services agreement, Post continues to provide certain of the above described services, and, in general, the services to be provided by Post will continue for the periods specified in the amended and restated master services agreement, but not past March 2026, subject to any subsequent extension or earlier termination as agreed to by the parties. There can be no assurance that all of the functions provided to us by Post under the amended and restated master services agreement will be successfully executed by Post or that we will not have to\nexpend significant efforts or costs materially in excess of those estimated in the master services agreement. Any interruption in these services could have a material adverse effect on our business, financial condition, results of operations and cash flows. In addition, upon termination of the amended and restated master services agreement, we will need to perform these functions ourselves or hire third parties to perform these functions on our behalf.\nActual operating results may differ significantly from our guidance and our forward-looking statements.\nFrom time to time, we release guidance regarding our future performance. This guidance, which consists of forward-looking statements, is prepared by our management and is qualified by, and subject to, the assumptions and the other information contained or referred to in such release and the factors described under Cautionary Statement on Forward-Looking Statements in our current and periodic reports filed with the SEC. Our guidance is not prepared with a view toward compliance with published guidelines of the American Institute of Certified Public Accountants, and neither our independent registered public accounting firm nor any other independent expert or outside party has audited, reviewed, examined, compiled or applied agreed upon procedures with respect to the guidance and, accordingly, no such person expresses any opinion or any other form of assurance with respect thereto. The independent registered public accounting firm report included in this document relates to our historical financial statements. It does not extend to any guidance and should not be read to do so.\nGuidance is based upon a number of assumptions and estimates that, although presented with numerical specificity, are inherently subject to business, economic and competitive uncertainties and contingencies, many of which are beyond our control and are based upon specific assumptions with respect to future business decisions, some of which will change. We generally state possible outcomes as high and low ranges which are intended to provide a sensitivity analysis as variables are changed but are not intended to represent that actual results could not fall outside of the suggested ranges. The principal reason that we release this data is to provide a basis for our management to discuss our business outlook with analysts and investors. We do not accept any responsibility for any projections or reports published by any such persons.\nGuidance is necessarily speculative in nature, and it can be expected that some or all of the assumptions of the guidance furnished by us will not materialize or will vary significantly from actual results. Accordingly, our guidance is only an estimate of what management believes is realizable as of the date of release. Actual results will vary from the guidance. Investors also should recognize that the reliability of any forecasted financial data diminishes the farther in the future that the data is forecast. In light of the foregoing, investors are urged to put the guidance in context and not to place undue reliance on it.\nAny failure to successfully implement our operating strategy or the occurrence of any of the risks or uncertainties set forth in this report could result in actual operating results being different than the guidance, and such differences may be adverse and material.\nRisks Related to Our Relationship with Post\nWe have overlapping directors and management with Post, which may lead to conflicting interests or the appearance of conflicting interests.\nCertain of our officers and directors, including Robert V. Vitale, who serves as Executive Chairman of our Board of Directors, also serve as officers or directors of Post. Our officers and members of our Board of Directors have fiduciary duties to our stockholders. Likewise, any such persons who serve in similar capacities at Post have fiduciary duties to Posts shareholders. Therefore, such persons may have conflicts of interest or the appearance of conflicts of interest with respect to matters involving or affecting us and Post. In addition, some of our officers or members of our Board of Directors may own equity or options to purchase equity in Post. Such ownership interests may create, or appear to create, conflicts of interest when the applicable individuals are faced with decisions that could have different implications for us and Post. The appearance of conflicts of interest created by such overlapping relationships also could impair the confidence of our investors.\nOur certificate of incorporation could prevent us from benefiting from corporate opportunities that might otherwise have been available to us.\nOur certificate of incorporation includes certain provisions regulating and defining the conduct of our affairs to the extent that they may involve Post and its directors, officers, employees, agents and affiliates and our rights, powers, duties and liabilities and those of our directors, officers, managers, employees and agents in connection with our relationship with Post. In general, and except as may be set forth in any agreement between us and Post, these provisions provide that Post and its affiliates may carry on and conduct any business of any kind, nature or description, whether or not such business is competitive with or in the same or similar lines of business as us; Post and its affiliates may do business with any of our customers, vendors and lessors; and Post and its affiliates may make investments in any kind of property in which we may make investments. In addition, these provisions provide that we renounce any interest or expectancy to participate in any business of Post or its affiliates.\nMoreover, our certificate of incorporation provides that we renounce any interests or expectancy in corporate opportunities which become known to (i) any of our directors, officers, managers, employees or agents who also are directors, officers,\nemployees, agents or affiliates of Post or its affiliates (except that we and our subsidiaries are not deemed affiliates of Post or its affiliates for the purposes of the provision) or (ii) Post or its affiliates. Generally, neither Post nor our directors, officers, managers, employees or agents who also are directors, officers, employees, agents or affiliates of Post or its affiliates will be liable to us or our stockholders for breach of any fiduciary duty solely by reason of the fact that any such person pursues or acquires any corporate opportunity for the account of Post or its affiliates, directs, recommends or transfers such corporate opportunity to Post or its affiliates or does not offer or communicate information regarding such corporate opportunity to us because such person has directed or intends to direct such opportunity to Post or one of its affiliates. This renunciation does not extend to corporate opportunities expressly offered to one of our directors, officers, managers, employees or agents, solely in his or her capacity as a director, officer, manager, employee or agent of us.\nThese provisions in our certificate of incorporation will cease to apply at such time as none of the directors, officers, employees, agents or affiliates of Post serve as our directors, officers, managers, employees or agents. The corporate opportunity provision may exacerbate conflicts of interest between Post and us because the provision effectively permits one of our directors, officers, managers, employees or agents who also serves as a director, officer, employee, agent or affiliate of Post or its affiliates to choose to direct a corporate opportunity to Post or its affiliates instead of to us.\nWe may be unable to take certain actions because such actions could jeopardize the tax-free status of the Spin-off, and such restrictions could be significant.\nTo preserve the tax-free treatment of the Spin-off, for the initial two-year period following the Spin-off, we are prohibited, except in limited circumstances, from taking or failing to take certain actions that would prevent the Spin-off and related transactions from being tax-free, including: (i) issuing any equity securities or securities that could possibly be converted into our equity securities, including as acquisition currency for a merger or acquisition (but excluding certain equity compensation for employees); (ii) redeeming or repurchasing our equity securities or our debt or (iii) entering into any transaction pursuant to which our stock would be acquired, whether by merger or otherwise. These restrictions will not apply if we deliver an unqualified will-level tax opinion of a nationally recognized accounting firm or law firm (BellRing Tax Counsel) or a ruling from the U.S. Internal Revenue Service (the IRS) that the action will not cause such Spin-off to fail to qualify for its intended tax treatment.\nWe may be responsible for U.S. federal income tax liabilities that relate to the Spin-off.\nThe completion of the Spin-off by Post was conditioned on the receipt by Post of an opinion of a nationally recognized accounting firm or law firm (the distribution tax counsel and, together with BellRing tax counsel, tax counsel) to the effect that the Separation, together with certain contributions made by Post to us, should qualify as a tax-free reorganization within the meaning of Sections 368(a) and 355 of the Internal Revenue Code (the Code) and the Distribution should qualify as a tax-free distribution eligible for nonrecognition within the meaning of Sections 355 and 361 of the Code. The completion of the Spin-off was also conditioned on the receipt by us of an opinion of BellRing Tax Counsel to the effect that the merger of Merger Sub with and into Old BellRing qualified as a reorganization within the meaning of Section 368(a) of the Code or, alternatively, as a transaction qualifying for nonrecognition of gain and loss under Section 351 of the Code. An opinion of tax counsel is not binding on the IRS. Accordingly, the IRS may reach conclusions with respect to the distribution that are different from the conclusions reached in the opinions, and any such differing conclusions may result in U.S. federal income tax liability. The opinions will be based on certain factual statements and representations, which, if incomplete or untrue in any material respect, could alter tax counsels conclusions. We are not aware of any facts or circumstances that would cause any such factual statements or the opinion of tax counsel to be incomplete or untrue.\nIf all or a portion of the Spin-off does not qualify as a tax-free transaction for any reason, including because any of the factual statements or representations in the legal opinions are incomplete or untrue, Post may recognize a substantial gain for U.S. federal income tax purposes, and we may incur indemnification or other liabilities to Post as a result.\nEven if the Distribution otherwise qualifies as a tax-free transaction for U.S. federal income tax purposes, the Distribution will be taxable to Post (but not to Post shareholders) pursuant to Section 355(e) of the Code if there are (or have been) one or more acquisitions (including issuances), directly or indirectly (including through acquisitions of such stock after the completion of the Transactions), of our stock or the stock of Post, representing 50 percent or more, measured by vote or value, of the stock of any such corporation and the acquisition or acquisitions are deemed to be part of a plan or series of related transactions that include the Distribution. The process for determining whether an acquisition is part of a plan under these rules is complex, inherently factual in nature, and subject to a comprehensive analysis of the facts and circumstances of the particular case. In general, any acquisition of our common stock within two years before or after the Distribution (with exceptions, including public trading by less-than-5 percent stockholders and certain compensatory stock issuances) generally will be presumed to be part of such a plan unless that presumption is rebutted. The resulting tax liability would be substantial.\nWe have agreed not to enter into certain transactions that could cause any portion of the Distribution to be taxable to Post, including under Section 355(e) of the Code. Pursuant to a tax matters agreement with Post, we have also agreed to indemnify\nPost for any tax liabilities resulting from such transactions or other actions we take, and Post has agreed to indemnify us for any tax liabilities resulting from transactions entered into by Post. These obligations may discourage, delay or prevent a change of control of us.\nIn addition, pursuant to the tax matters agreement, if and to the extent the distribution does not qualify as a tax-free transaction, such failure to qualify as a tax-free transaction gives rise to adjustments to the tax basis of assets held by us and our subsidiaries, and we are not required to indemnify Post for any tax liabilities resulting from such failure to qualify as a tax-free transaction, then Post will be entitled to periodic payments from us equal to 85% of the tax savings arising from the aggregate increase to the tax basis of assets held by us and our subsidiaries resulting from such failure and Post and we will negotiate in good faith the terms of a tax receivable agreement to govern the calculation of such payments applying the principles of, and adhering as closely as practicable to, the existing tax receivable agreement between Post and BellRing. Payments under such tax receivable agreement may be substantial, and in certain cases may be accelerated or significantly exceed the actual benefits we realize in respect of the tax attributes subject to the tax receivable agreement.\nLegal and Regulatory Risks\nViolations of laws or regulations by us or our third-party contract manufacturers, as well as new laws or regulations or changes to existing laws or regulations, could adversely affect our business.\nOur business is subject to a variety of laws and regulations administered by federal, state and local government authorities in the U.S., as well as government authorities outside of the U.S., including requirements related to food safety, quality, manufacturing, processing, storage, marketing, advertising, labeling, distribution and worker health and workplace safety. Our activities, both inside and outside of the U.S., are subject to extensive regulation. In the U.S., we are regulated by, and our activities are affected by, among other federal, state and local authorities and regulations, the FDA, the USDA, the Federal Trade Commission, the Occupational Safety and Health Administration and Proposition 65. In Europe, we are regulated by, among other authorities, the U.K.s Food Standards Agency, Health and Safety Executive, Environment Agency, Environmental Health, the Information Commissioners Office and the Trading Standards Office and their equivalents in E.U. member states. We also are regulated by similar authorities elsewhere in the world where our products are distributed.\nGovernmental regulations also affect taxes and levies, tariffs, import and export restrictions, healthcare costs, energy usage, data privacy and immigration and labor issues, any or all of which may have a direct or indirect effect on our business or the businesses of our customers, suppliers or third-party contract manufacturers. In addition, we could be the target of claims relating to alleged false or deceptive advertising under federal, state and foreign laws and regulations. We also may be impacted by changes to administrative policies, such as business restrictions, tariffs and trade agreements, in markets in which we manufacture, sell or distribute our products.\nThe impact of current laws and regulations, changes in, or changes in interpretations of, these laws or regulations or the introduction of new laws or regulations could increase the costs of doing business for us or our customers or suppliers or third-party contract manufacturers, causing our business, financial condition, results of operations and cash flows to be adversely affected. Further, if we are found to be out of compliance with applicable laws and regulations in these areas, we could be subject to civil remedies, including fines, revocations of required licenses, detention, seizure, injunctions or recalls, as well as potential criminal sanctions, any or all of which could have a material adverse effect on our business, financial condition, results of operations and cash flows.\nIt also is possible that federal, state, local or foreign enforcement authorities might take regulatory or enforcement action, which could result in significant fines or penalties, revocations of required licenses or injunctions, as well as potential criminal sanctions. If we are found to be significantly out of compliance, an enforcement authority could issue a warning letter and/or institute enforcement actions that could result in additional costs, substantial delays in production or even a temporary shutdown in manufacturing and product sales. Also, we may have to recall product or otherwise remove product from the market, and temporarily cease its manufacture and distribution, which would increase our costs and reduce our revenues. Any product liability claims resulting from the failure to comply with applicable laws and regulations would be expensive to defend and could result in substantial damage awards against us or harm our reputation. Any of these events would negatively impact our revenues and costs of operations.\nWe also may be impacted by changes to administrative policies, such as business restrictions, tariffs and trade agreements, in markets in which we or our third-party contract manufacturers manufacture, sell or distribute our products.\nCertain of our products are subject to a higher level of regulatory scrutiny, resulting in increased costs of operations and the potential for delays in product sales.\nCertain of our products are regulated by the FDA as dietary supplements, which are subject to FDA regulations and levels of regulatory scrutiny different from those applicable to conventional food. Internationally, the convenient nutrition category is regulated as food and dietary supplements. Such heightened regulatory scrutiny results in increased costs of operations and the\npotential for delays in product sales. In addition, there is some risk that product classifications could be changed by the regulators, which could result in significant fines, penalties, discontinued distribution and relabeling costs. Any of these events would negatively impact our revenues and costs of operations.\nPending and future litigation and claims may impair our reputation or lead us to incur significant costs.\nWe are, or may become, party to various lawsuits and claims arising in the normal course of business, which may include lawsuits or claims relating to contracts, third-party contract manufacturers, intellectual property infringement, product recalls, product liability, false or deceptive advertising, employment matters, environmental matters or other aspects of our business. There has been a recent increase in lawsuits filed against food and beverage companies alleging deceptive advertising and labeling. In addition, actions we have taken or may take, or decisions we have made or may make, may result in legal claims or litigation against us. Negative publicity resulting from allegations made in lawsuits or claims asserted against us, whether or not valid, may adversely affect our reputation. In addition, we may be required to pay damage awards or settlements, become subject to injunctions or other equitable remedies, be required to modify our business processes, practices or products or be required to stop selling certain of our products. For instance, one of our operating subsidiaries, Premier Nutrition, LLC, is a defendant in several class action lawsuits related to its Joint Juice product, which it discontinued in the first quarter of fiscal 2023. At September 30, 2023, we had accrued $21.0 million related to these matters. In addition, intellectual property infringement litigation or claims could cause us to cease making, licensing or using products that incorporate the challenged intellectual property, require us to redesign or rebrand our products or packaging, if feasible, or require us to enter into royalty or licensing agreements in order to obtain the right to use a third partys intellectual property. Any or all of these consequences could have a material adverse effect on our financial condition, results of operations and cash flows. The outcome of litigation is often difficult to predict, and the outcome of pending or future litigation may have a material adverse effect on our business, financial condition, results of operations and cash flows.\nAlthough we have various insurance programs in place, the potential liabilities associated with lawsuits and claims could be excluded from coverage or, if covered, could exceed the coverage provided by such programs. In addition, insurance carriers may seek to rescind or deny coverage with respect to pending or future claims or lawsuits. If we do not have sufficient coverage under our policies, or if coverage is denied, we may be required to make material payments to settle litigation or satisfy any judgment. Any of these consequences could have a material adverse effect on our business, financial condition, results of operations and cash flows.\nWe are subject to environmental laws and regulations that can impose significant costs and expose us to potential financial liabilities.\nWe and our contract manufacturers and other vendors and suppliers are subject to extensive federal, state, local and foreign laws and regulations relating to the protection of human health and the environment, including those limiting the discharge and release of pollutants into the environment and those regulating the transport, storage, disposal and remediation of, and exposure to, solid and hazardous wastes. Certain environmental laws and regulations can impose joint and several liability without regard to fault on responsible parties, including past and present owners and operators of sites, related to cleaning up sites at which hazardous materials were disposed of or released. Failure to comply with environmental laws and regulations could result in severe fines and penalties by governments or courts of law. In addition, future laws may more stringently regulate the emission of greenhouse gases, particularly carbon dioxide and methane.\nFuture events, such as new or more stringent environmental laws and regulations, new environmental claims, the discovery of currently unknown environmental conditions requiring responsive action or more vigorous interpretations or enforcement of existing environmental laws and regulations, might require us to incur additional costs that could have a material adverse effect on our business, financial condition, results of operations and cash flows.\nRisks Related to Ownership of Our Common Stock\nThe market price and trading volume of our common stock may be volatile.\nThe market price of our common stock could fluctuate significantly for many reasons, including in response to the risk factors listed in this report or for reasons unrelated to our specific performance, such as reports by industry analysts, our failure to meet analysts earnings estimates, investor perceptions, or negative developments relating to our customers, competitors or suppliers, as well as general economic and industry conditions. Furthermore, the stock markets have experienced price and volume fluctuations that have affected and continue to affect the market prices of equity securities of many companies. These fluctuations often have been unrelated or disproportionate to the operating performance of those companies.\nWe may not declare or pay any dividends on our common stock for the foreseeable future.\nWe may retain future earnings, if any, for future operations, expansion and debt repayment. We have not paid cash dividends to date and have no current plans to pay any cash dividends for the foreseeable future. Consequently, our stockholders must rely on sales of their shares of our common stock after price appreciation, which may never occur, as the\nonly way to realize any future gains on their investment. Any future determination to pay dividends, including timing and amount, will be at the discretion of our Board of Directors and subject to, among other things, our compliance with applicable law, and depend on, among other things, our results of operations, financial condition, level of indebtedness, capital requirements, contractual restrictions, restrictions in our debt agreements, business prospects and other factors that our Board of Directors may deem relevant. Our ability to pay dividends depends on our receipt of cash dividends from our operating subsidiaries and our ability to pay dividends may be further restricted as a result of the laws of our subsidiaries jurisdictions of organization or their agreements, including agreements governing indebtedness.\nOur certificate of incorporation and bylaws and provisions of Delaware law may discourage or prevent strategic transactions, including a takeover of the Company, even if such a transaction would be beneficial to our stockholders.\nProvisions contained in our certificate of incorporation and bylaws and provisions of the General Corporation Law of the State of Delaware (the DGCL) could delay or prevent a third party from entering into a strategic transaction with us, as applicable, even if such transaction would benefit our stockholders. For example, our certificate of incorporation and bylaws:\ndivide the members of the Board of Directors into three classes with staggered three-year terms, which may delay or prevent a change of our management or a change on control;\nauthorize the issuance of blank-check preferred stock that could be issued by us upon approval of the Board of Directors to increase the number of outstanding shares of capital stock, making a takeover more difficult and expensive;\nprovide that directors may be removed from office only for cause and that any vacancy or newly created directorships on the Board of Directors may only be filled by a majority of directors then in office, which may make it difficult for other stockholders to reconstitute the Board of Directors;\nprovide that special meetings of the stockholders may be called only upon the request of a majority of the Board of Directors or by the chairman of the Board of Directors or the chief executive officer;\nprohibit stockholder action by written consent and require that any action to be taken by stockholders be taken at an annual or special meeting of stockholders; and\nrequire advance notice to be given by stockholders for any stockholder proposals or director nominees.\nThese restrictions and provisions could keep us from pursuing relationships with strategic partners and from raising additional capital, which could impede our ability to expand our business and strengthen our competitive position. These restrictions could also limit stockholder value by impeding a sale of the Company.\nOur certificate of incorporation provides that the Court of Chancery of the State of Delaware (the Court of Chancery) (or, if the Court of Chancery does not have subject matter jurisdiction, the federal district court for the State of Delaware) is the exclusive forum for the following types of actions or proceedings under Delaware statutory or common law:\nany derivative action or proceeding brought on our behalf;\nany action asserting a breach of fiduciary duty;\nany action asserting a claim against us arising pursuant to the DGCL; and\nany action asserting a claim against us that is governed by the internal affairs doctrine.\nThis provision would not apply to suits brought to enforce a duty or liability created by the Exchange Act, for which the U.S. federal courts have exclusive jurisdiction. Section 22 of the Securities Act creates concurrent jurisdiction for federal and state courts over all Securities Act actions. Accordingly, both state and federal courts have jurisdiction to entertain such claims. However, our certificate of incorporation also provides that U.S. federal courts will, to the fullest extent permitted by law, be the sole and exclusive forum for the resolution of any complaint asserting a cause of action or proceeding arising under the Securities Act. While the Delaware courts have determined that choice of forum provisions are facially valid, a stockholder may nevertheless seek to bring a claim in a venue other than that designated in the Companys exclusive forum provision. Although our certificate of incorporation contains the exclusive forum provision described above, it is possible that a court could find that such a provision is inapplicable for a particular claim or action or that such provision is unenforceable. The exclusive forum provision shall not relieve us of our duties to comply with the federal securities laws and the rules and regulations thereunder, and our stockholders will not be deemed to have waived our compliance with these laws, rules and regulations.\nThis choice of forum provision may limit a stockholders ability to bring a claim in a judicial forum that it finds favorable for disputes with the Company or its directors, officers, or other employees and may discourage these types of lawsuits. Alternatively, if a court were to find the choice of forum provision contained in our certificate of incorporation to be\ninapplicable or unenforceable in an action, we may incur additional costs associated with resolving such action in other jurisdictions.\nGeneral Risks\nChanges in tax laws may adversely affect us, and the IRS or a court may disagree with our tax positions, which may result in adverse effects on our business, financial condition, results of operations and cash flows.\nThere can be no assurance that future tax law changes will not increase the rate of the corporate income tax significantly; impose new limitations on deductions, credits or other tax benefits; or make other changes that may adversely affect the performance of an investment in our stock. Furthermore, there is no assurance that the IRS or a court will agree with the positions taken by us, in which case tax penalties and interest may be imposed that could adversely affect our business, financial condition, results of operations and cash flows.\nWe may not be able to operate successfully if we are unable to recruit, hire, retain and develop key personnel and a qualified and diverse workforce. In addition, temporary workforce disruptions or the inability of our employees to safely perform their jobs for any reason, including as a result of illness, could adversely impact our business, financial condition, results of operations and cash flows.\nWe depend upon the skills, working relationships and continued services of key personnel, including our senior management team. In addition, our ability to achieve our operating goals depends upon our ability to recruit, hire, retain and develop qualified and diverse personnel to operate and expand our business. We compete with other companies both within and outside of our industry for talented personnel. If we lose key personnel, or one or more members of our senior management team, and we fail to develop adequate succession plans, or if we fail to hire, retain and develop a sufficient number of qualified and diverse employees to operate and expand our business, our business, financial condition, results of operations and cash flows could be harmed.\nOur business is dependent upon our employees being able to safely perform their jobs. If we experience workforce disruptions or periods where our employees are unable to safely perform their jobs for any reason, including as a result of illness or restrictions put in place by governmental authorities, our business, financial condition, results of operations and cash flows could be adversely affected.\nIncreases in labor-related costs, including costs of medical and other employee health and welfare benefits, may reduce our profitability.\nInflationary pressures and shortages in the labor market have increased, and could continue to increase, our labor costs, which could negatively impact our profitability. With approximately 420 employees as of November 1, 2023, our profitability may be substantially affected by costs of medical and other health and welfare benefits for these employees. Although we try to control these costs, they can vary because of changes in healthcare laws and claims experience, which have the potential to increase the cost of providing medical and other employee health and welfare benefits. Any substantial increase could negatively affect our profitability.\nIf we are unable to continue to satisfy the requirements of Section 404 of the Sarbanes-Oxley Act, or our internal control over financial reporting is not effective, the reliability of our financial statements may be questioned, and the price of our common stock could suffer.\nSection 404 of the Sarbanes-Oxley Act of 2002 (SOX) requires any company subject to the reporting requirements of the U.S. securities laws to do a comprehensive evaluation of its and its consolidated subsidiaries internal control over financial reporting. To comply with this statute, we are required to document and test our internal control procedures, our management is required to assess and issue a report concerning our internal control over financial reporting and our independent registered public accounting firm is required to issue an opinion on its audit of our internal control over financial reporting.\nThe rules governing the standards that must be met for management to assess our internal control over financial reporting are complex and require significant documentation, testing and possible remediation to meet the detailed standards under the rules. During the course of its testing, our management may identify material weaknesses or significant deficiencies which may not be remedied in time to meet the deadlines imposed by SOX and SEC rules. If our management cannot favorably assess the effectiveness of our internal control over financial reporting or our independent registered public accounting firm identifies material weaknesses in our internal controls, investor confidence in our financial results may weaken and the price of our common stock may suffer. In addition, in the event we do not maintain effective internal control over financial reporting, we might fail to timely prevent or detect potential financial misstatements. As of September 30, 2023, management determined that our internal control over financial reporting was effective.\nActions of stockholders could cause us to incur substantial costs, divert managements attention and resources and have an adverse effect on our business.\nWe may, from time to time, be subject to proposals and other requests from stockholders urging us to take certain corporate actions, including proposals seeking to influence our corporate policies or effect a change in our management. In the event of such stockholder proposals, particularly with respect to matters which our management and Board of Directors, in exercising their fiduciary duties, disagree with or have determined not to pursue, our business could be adversely affected because responding to actions and requests of stockholders can be costly and time-consuming, disrupting our operations and diverting the attention of management and our employees. Additionally, perceived uncertainties as to our future direction may result in the loss of potential business opportunities and may make it more difficult to attract and retain qualified personnel, business partners and customers. ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone.\nITEM 1C. CYBERSECURITY\nNot applicable. ITEM 2. PROPERTIES\nPost provides us space for our principal executive offices in St. Louis, Missouri pursuant to the MSA among BellRing Inc., BellRing LLC, BellRing Intermediate Holdings, Inc. and Post. Our other administrative offices, as well as the warehousing, distribution and research and development facilities of our principal operations, are described below. While our products are primarily manufactured by third-party contract manufacturers, we also own one manufacturing facility. For additional information regarding our third party manufacturing network, see Business - Supply Chain in Item 1 of this report.\nWe lease a research and development facility and administrative office in Emeryville, California. We also lease administrative offices in Dallas, Texas; Rogers, Arkansas; Munich, Germany and Worb, Switzerland. Through third-party logistics firms, we lease warehouse space in Tagelswangen, Switzerland and a distribution center with warehouse space in Kleve, Germany. We also manufacture protein and energy bars and gels and conduct research and development through an owned facility in Voerde, Germany. Management believes our facilities generally are in good operating condition. In conjunction with our arrangements with third-party contract manufacturers, management believes, taken as a whole, our facilities generally are suitable, adequate and of sufficient capacity for our current operations. See Risk Factors included in Item 1A of this report for more information about our supply chain. ITEM 3. LEGAL PROCEEDINGS\nThe information required under this Item 3 is set forth in Note 14 within Notes to Consolidated Financial Statements included in Part II, Item 8 of this report and is incorporated herein by this reference. For disclosure of environmental proceedings with a governmental entity as a party pursuant to Item 103(c)(3)(iii) of Regulation S-K, the Company has elected to disclose matters where the Company reasonably believes such proceeding would result in monetary sanctions, exclusive of interest and costs, of $1.0 million or more. Applying this threshold, there are no such environmental proceedings pending as of the filing date of this report or that were resolved during the three months ended September 30, 2023. ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\nPART II ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nMarket for Common Stock\nPrior to March 10, 2022, our Class A common stock, $0.01 par value per share (Old BellRing Class A Common Stock) was traded on the New York Stock Exchange (the NYSE) under the trading symbol BRBR. On March 10, 2022, the outstanding shares of our Old BellRing Class A Common Stock were converted into BellRing common stock, $0.01 par value per share (BellRing Common Stock) and continued to trade on the NYSE under the trading symbol BRBR. For additional information, refer to Note 1 within Notes to Consolidated Financial Statements in Item 8 of this report. There were approximately 4,131 stockholders of record of our BellRing Common Stock as of November 14, 2023.\nDividends\nWe may not pay cash dividends on our BellRing Common Stock for the foreseeable future. Any future determination to pay dividends, and the amount and timing of any such payment, will be at the discretion of our Board of Directors and subject to, among other things, our compliance with applicable law, and depending on, among other things, our results of operations, financial condition, level of indebtedness, capital requirements, contractual restrictions, restrictions in our debt agreements, business prospects, our cash flow and liquidity position and other factors that our Board of Directors may deem relevant.\nEquity Compensation Plan Information\nThe information required under this Item 5 concerning equity compensation plan information is set out below under Item 12 of this report and is incorporated herein by this reference.\nIssuer Purchases of Equity Securities\nThe following table sets forth information with respect to repurchases of shares of our BellRing Common Stock during the three months ended September 30, 2023 and our BellRing Common Stock repurchase authorization.\nPeriod Total Number of Shares Purchased Average Price Paid per Share (a) Total Number of Shares Purchased as Part of Publicly Announced Plans or Programs (b) Approximate Dollar Value of Shares that May Yet be Purchased Under the Plans or Programs (b)\nJuly 1, 2023 - July 31, 2023\n- $ - - $31,000,428\nAugust 1, 2023 - August 31, 2023\n133,487 $ 38.58 133,487 $25,850,718\nSeptember 1, 2023 - September 30, 2023\n67,543 $ 40.42 67,543 $23,120,318\nTotal 201,030 $ 39.20 201,030 $23,120,318\n(a)Does not include brokers commissions or accrued excise tax.\n(b)On May 3, 2023, the Companys Board of Directors approved an $80,000,000 repurchase authorization (the Authorization) with respect to shares of BellRing Common Stock effective May 3, 2023. The Authorization expires on May 3, 2025. Repurchases may be made from time to time in the open market, private purchases, through forward, derivative, alternative, accelerated repurchase or automatic purchase transactions, or otherwise.\nPerformance Graph\nThe following performance graph compares the changes for the period beginning October 17, 2019, the first day our common stock began trading on the NYSE, through September 29, 2023 in the cumulative total value of $100 hypothetically invested in each of (i) our publically traded common stock (which included Old BellRing Class A Common Stock prior to March 10, 2022 and BellRing Common Stock subsequent to March 10, 2022); (ii) the Russell 2000 index; and (iii) the S&P 1500 Packaged Foods & Meats Index.\n* $100 invested on October 17, 2019 in stock or index. The cumulative total return of our publicly traded common stock includes the reinvestment of $2.97 in cash paid to holders of our Old BellRing Class A Common Stock in addition to each share of Old BellRing Class A Common Stock converted into BellRing Common Stock on March 10, 2022. For additional information, refer to Note 1 within Notes to Consolidated Financial Statements in Item 8 of this report.\nPerformance Graph Data\nBellRing Brands, Inc. ($) Russell 2000 Index ($) S&P 1500 Packaged Foods & Meats Index ($)\n10/17/2019 100.00 100.00 100.00\n9/30/2020 125.70 99.13 106.21\n9/30/2021 186.36 146.36 112.18\n9/30/2022 139.27 111.93 118.20\n9/29/2023 278.62 121.86 121.02\nThe stock price performance included in this graph is not necessarily indicative of future stock price performance.\nThis performance graph shall not be deemed filed for purposes of Section 18 of the Securities Exchange Act of 1934, as amended (the Exchange Act), or incorporated by reference into any of our filings under the Securities Act of 1933, as amended, or the Exchange Act, except as shall be expressly set forth by specific reference in such filing. ITEM 6. [RESERVED] ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion summarizes the significant factors affecting the consolidated operating results, financial condition, liquidity and capital resources of BellRing Brands, Inc. (formerly known as BellRing Distribution, LLC) (BellRing) and its consolidated subsidiaries. This discussion should be read in conjunction with the financial statements under Item 8 of this report and the Cautionary Statement on Forward-Looking Statements on page 1.\nThe following should be read in conjunction with the discussion and analysis of our fiscal 2022 results compared to our fiscal 2021 results, including any related discussion of fiscal 2021 results and activity, which can be found in Item 7 of Part II under the title Managements Discussion and Analysis of Financial Condition and Results of Operations in our Annual Report on Form 10-K for the year ended September 30, 2022, and such discussion and analysis is incorporated by reference herein.\nOVERVIEW\nOn October 21, 2019, BellRing Intermediate Holdings, Inc. (formerly known as BellRing Brands, Inc.) (Old BellRing) closed its initial public offering (the IPO) of 39.4 million shares of its Class A common stock, $0.01 par value per share (Old BellRing Class A Common Stock) and contributed the net proceeds from the IPO to BellRing Brands, LLC, a Delaware limited liability company and subsidiary of Old BellRing (BellRing LLC), in exchange for 39.4 million BellRing LLC non-voting membership units (the BellRing LLC units). As a result of the IPO and certain other transactions completed in connection with the IPO (the formation transactions), BellRing LLC became the holding company for the active nutrition business of Post Holdings, Inc. (Post). Old BellRing, as a holding company, had no material assets other than its ownership of BellRing LLC units and its indirect interests in the subsidiaries of BellRing LLC and had no independent means of generating revenue or cash flow. The members of BellRing LLC were Post and Old BellRing.\nDuring the second quarter of fiscal 2022, Post completed its distribution of 80.1% of its ownership interest in BellRing to Posts shareholders. On March 9, 2022, pursuant to the Transaction Agreement and Plan of Merger, dated as of October 26, 2021 (as amended by Amendment No. 1 to the Transaction Agreement and Plan of Merger, dated as of February 28, 2022, the Transaction Agreement), by and among Post, Old BellRing, BellRing and BellRing Merger Sub Corporation, a wholly-owned subsidiary of BellRing (BellRing Merger Sub), Post contributed its share of Old BellRing Class B common stock, $0.01 par value per share (Old BellRing Class B Common Stock), all of its BellRing LLC units and $550.4 million of cash to BellRing (collectively, the Contribution) in exchange for certain limited liability company interests of BellRing (prior to the conversion of BellRing into a Delaware corporation) and the right to receive $840.0 million in aggregate principal amount of BellRings 7.00% senior notes maturing in 2030 (the 7.00% Senior Notes).\nOn March 10, 2022, BellRing converted into a Delaware corporation and changed its name to BellRing Brands, Inc., and Post distributed an aggregate of 78.1 million, or 80.1%, of its shares of BellRing common stock, $0.01 par value per share (BellRing Common Stock) to Post shareholders in a pro-rata distribution (the Distribution).\nUpon completion of the Distribution, BellRing Merger Sub merged with and into Old BellRing (the Merger), with Old BellRing continuing as the surviving corporation and becoming a wholly-owned subsidiary of BellRing. Pursuant to the Merger, each outstanding share of Old BellRing Class A Common Stock was converted into one share of BellRing Common Stock plus $2.97 in cash, or $115.5 million total consideration paid to Old BellRing Class A common stockholders pursuant to the Merger. As a result of the transactions described above (collectively, the Spin-off), BellRing became the new public parent company of, and successor issuer to, Old BellRing, and shares of BellRing Common Stock were deemed to be registered under Section 12(b) of the Securities Exchange Act of 1934, as amended (the Exchange Act), pursuant to Rule 12g-3(a) promulgated thereunder.\nImmediately prior to the Spin-off, Post held 97.5 million BellRing LLC units, equal to 71.5% of the economic interest in BellRing LLC, and one share of Old BellRing Class B Common Stock, which represented 67% of the combined voting power of the common stock of Old BellRing.\nImmediately following the Spin-off, Post owned 19.4 million shares, or 14.2%, of BellRing Common Stock, which did not represent a controlling interest in BellRing. As a result of the Spin-off, the dual class voting structure in the BellRing business was eliminated.\nOn August 11, 2022, Post transferred 14.8 million shares of its BellRing Common Stock to certain financial institutions in satisfaction of term loan obligations of Post, which reduced Posts ownership of BellRing Common Stock to 3.4% as of September 30, 2022. In connection with this transaction, BellRing repurchased 0.8 million of the transferred shares from certain of the financial institutions.\nOn November 25, 2022, Post transferred its remaining 4.6 million shares of BellRing Common Stock to certain financial institutions in satisfaction of term loan obligations of Post. In connection with this transaction, BellRing repurchased 0.9 million of the transferred shares from certain of the financial institutions. Post had no ownership of BellRing Common Stock as of September 30, 2023.\nBellRing incurred separation-related expenses in connection with its separation from Post of $0.7 million and $14.5 million during the years ended September 30, 2023 and 2022, respectively. These expenses generally included third-party costs for advisory services, fees charged by other service providers and government filing fees and were included in Selling, general and administrative expenses in the Consolidated Statements of Operations.\nThe terms BellRing, we, our, us, the Company or our Company generally refer to Old BellRing and its consolidated subsidiaries during the periods prior to the Spin-off and to us and our consolidated subsidiaries during the periods subsequent to the Spin-off unless otherwise stated or context otherwise indicates. The term Common Stock generally refers to Old BellRing Class A Common Stock and Old BellRing Class B Common Stock during the periods prior to the Spin-off and to BellRing Common Stock during the periods subsequent to the Spin-off. The term Net earnings available to common stockholders generally refers to net earnings available to Old BellRing Class A common stockholders during the periods prior to the Spin-off and to net earnings available to BellRing common stockholders during the periods subsequent to the Spin-off.\nWe are a consumer products holding company operating in the global convenient nutrition category and are a provider of ready-to-drink (RTD) protein shakes, other RTD beverages and powders. We have a single operating and reportable segment, with our principal products being protein-based consumer goods. Our primary brands are Premier Protein and Dymatize.\nIndustry & Company Trends\nThe success of companies in the convenient nutrition category is driven by how well such companies can grow, develop and differentiate their brands. We expect the convergence of several factors to support the continued growth of the convenient nutrition category, including:\nconsumers increasingly dedicated pursuit of active lifestyles and growing interest in nutrition and wellness;\ngrowing awareness of the numerous health benefits of protein, including sustained energy, muscle recovery and satiety; and\na rise in snacking and the desire for products that can be consumed on-the-go as nutritious snacks or meal replacements.\nNonetheless, the consumer food and beverage industry faces a number of challenges and uncertainties, including:\nthe highly competitive nature of the industry, which involves competition from a host of nutritional food and beverage companies, including manufacturers of other branded food and beverage products as well as manufacturers of private label and store brand products;\nchanging consumer preferences which require food manufacturers to identify changing preferences and to offer products that appeal to consumers;\nsupply chain challenges, including labor shortages and equipment delays, which have delayed capacity expansion across the broader third-party aseptic processing contract manufacturer network and are expected to continue into fiscal 2024; and\ninflationary pressures (see Market Trends below for information).\nSeasonality\nWe have experienced in the past, and expect to continue to experience, seasonal fluctuations in our sales and operating profit margins because of customer spending patterns and timing of our key retailers promotional activity. Historically, our first fiscal quarter is seasonally low for all brands driven by a slowdown of consumption of our products during the holiday season. Sales are typically higher throughout the remainder of the fiscal year as a result of promotional activity at key retailers as well as organic growth of the business.\nMarket Trends\nDuring fiscal 2023 and 2022, input cost inflation, including raw material, packaging and manufacturing costs, impacted our supply chain and put downward pressure on profit margins. As a result, we have taken pricing actions on nearly all products. We expect inflationary pressures on protein costs to ease in fiscal 2024, while other costs, such as packaging and manufacturing, to continue to face inflationary pressures in fiscal 2024. Inflation could have a materially adverse impact on our business in the future if inflation rates were to significantly exceed our ability to achieve price increases or cost savings or if such price increases impact demand for our products.\nFor additional discussion, refer to Liquidity and Capital Resources within this section, as well as Cautionary Statement on Forward-Looking Statementson page 1 of this report and Risk Factors in Part I of this report.\nItems Affecting Comparability\nDuring the years ended September 30, 2023 and 2022, net sales and/or operating profit were impacted by the following items:\naccelerated amortization expense of $7.1 million for the year ended September 30, 2023 related to the discontinuance of the PowerBar business in North America;\nseparation-related expenses in connection with our separation from Post of $0.7 million and $14.5 million for the years ended September 30, 2023 and 2022, respectively; and\n$5.0 million and $8.0 million of expense for the years ended September 30, 2023 and 2022, respectively, related to provisions for legal matters. For additional information, refer to Note 14 within Notes to Consolidated Financial Statements in Item 8 of this report.\nFor further discussion, refer to Results of Operations within this section.\nRESULTS OF OPERATIONS\nYear Ended\nSeptember 30, Change in\ndollars in millions 2023 2022 Dollars\nPercentage\nNet Sales\n$ 1,666.8 $ 1,371.5 $ 295.3 22 %\nOperating Profit\n$ 287.3 $ 212.4 $ 74.9 35 %\nInterest expense, net\n66.9 49.2 17.7 36 %\nLoss on extinguishment and refinancing of debt, net - 17.6 (17.6) (100) %\nIncome tax expense 54.9 29.6 25.3 85 %\nLess: Net earnings attributable to redeemable noncontrolling interest - 33.7 (33.7) (100) %\nNet Earnings Available to Common Stockholders $ 165.5 $ 82.3 $ 83.2 101 %\nNet Sales\nNet sales increased $295.3 million, or 22%, during the year ended September 30, 2023 compared to the prior year. Sales of Premier Protein products were up $275.7 million, or 25%, on 11% higher volumes. Average net selling prices increased in the year ended September 30, 2023 due to targeted price increases taken to mitigate inflation. Volumes increased due to higher production, distribution gains and the reintroduction of certain RTD shake flavors. Sales of Dymatize products were up $22.8 million, or 11%, primarily driven by higher average net selling prices. Average net selling prices increased in the year ended September 30, 2023 due to targeted price increases, partially offset by increased promotional spending. In addition, Dymatize volumes increased 4% primarily driven by distribution gains. Sales of all other products were down $3.2 million.\nOperating Profit\nOperating profit increased $74.9 million, or 35%, during the year ended September 30, 2023 compared to the prior year. This increase was primarily driven by higher net sales, as previously discussed, and $13.8 million of lower costs related to the separation from Post. These positive impacts were partially offset by higher net product costs of $87.3 million primarily driven by unfavorable raw material and manufacturing costs, slightly offset by lower freight costs. In addition, we incurred the following higher expenses; (i) advertising expenses of $18.3 million, (ii) employee-related expenses of $9.2 million, (iii) professional fees of $8.3 million, and (iv) accelerated amortization expense of $7.1 million related to the discontinuance of the PowerBar business in North America.\nInterest Expense, Net\nInterest expense, net increased $17.7 million during the year ended September 30, 2023 compared to the prior year. This increase was primarily due to higher average outstanding principal amounts of debt, primarily resulting from the Spin-off, and a higher weighted-average interest rate compared to the prior year. The weighted-average interest rate on our total outstanding debt increased to 7.2% for the year ended September 30, 2023 from 6.2% for the year ended September 30, 2022, primarily driven by the issuance of our 7.00% Senior Notes during the second quarter of fiscal 2022. See Note 13 within Notes to Consolidated Financial Statements for additional information on our debt.\nLoss on Extinguishment and Refinancing of Debt, Net\nDuring the year ended September 30, 2022, we recognized a $17.6 million loss related to the termination of our Old Credit Agreement (as defined in Liquidity and Capital Resources). This loss included (i) a $6.9 million write-off of unamortized discounts and debt extinguishment fees, (ii) a $6.1 million write-off of unamortized net hedging losses recorded within accumulated other comprehensive income or loss related to the Term B Facility (as defined in Liquidity and Capital Resources) and (iii) a $4.6 million write-off of debt issuance costs and deferred financing fees. See Note 13 within Notes to Consolidated Financial Statements for additional information on our debt.\nIncome Tax Expense\nOur effective income tax rate for fiscal 2023 was 24.9% compared to 20.3% for fiscal 2022. The following table presents the reconciliation of income tax expense with amounts computed at the United States (U.S.) federal statutory tax rate.\nYear Ended September 30,\ndollars in millions 2023 2022\nComputed tax at federal statutory rate (21%) $ 46.3 $ 30.6\nIncome tax expense attributable to redeemable noncontrolling interest - (7.6)\nState income taxes, net of effect on federal tax 8.4 4.7\nTransaction costs - 2.0\nOther, net (none in excess of 5% of computed tax) 0.2 (0.1)\nIncome tax expense $ 54.9 $ 29.6\nThe increase in our effective income tax rate for fiscal 2023 compared to the prior year was primarily due to us reporting 100% of the income, gain, loss and deduction of BellRing LLC in the periods subsequent to the Spin-off, partially offset by higher separation-related expenses incurred in connection with the Spin-off in the prior year that were treated as non-deductible.\nLIQUIDITY AND CAPITAL RESOURCES\nOn March 10, 2022, in connection with the Transaction Agreement, we issued the 7.00% Senior Notes to Post as partial non-cash consideration for the Contribution in connection with the Distribution. Post subsequently delivered the 7.00% Senior Notes to certain financial institutions in satisfaction of term loan obligations of Post in an equal principal amount.\nOn March 10, 2022, in connection with the Transaction Agreement, we entered into a credit agreement (as amended, the Credit Agreement), which provides for a revolving credit facility in an aggregate principal amount of $250.0 million (the Revolving Credit Facility), with commitments to be made available to us in U.S. Dollars, Euros and United Kingdom Pounds Sterling. The outstanding amounts under the Credit Agreement must be repaid on or before March 10, 2027.\nPrior to the Transaction Agreement, BellRing LLC had entered into a credit agreement on October 21, 2019 (as subsequently amended, the Old Credit Agreement) which provided for debt facilities consisting of a $700.0 million term B loan facility (the Term B Facility) and a $200.0 million revolving credit facility (the Old Revolving Credit Facility). On March 10, 2022, with certain of the proceeds from the debt financing transactions described above, BellRing LLC repaid the aggregate outstanding principal balance of $519.8 million on the Term B Facility and terminated all obligations and commitments under the Old Credit Agreement.\nDuring the years ended September 30, 2023 and 2022, we borrowed $115.0 million and $164.0 million, respectively, under the Revolving Credit Facility and repaid $189.0 million and $65.0 million, respectively, under the Revolving Credit Facility. We had $225.0 million and $151.0 million of borrowing capacity as of September 30, 2023 and 2022, respectively. There were no outstanding letters of credit under the Revolving Credit Facility as of September 30, 2023 or 2022. Subsequent to September 30, 2023, we repaid an additional $25.0 million under the Revolving Credit Facility, which reduced the outstanding borrowings under the Revolving Credit Facility to zero.\nLetters of credit are available under the Revolving Credit Facility in an aggregate amount of up to $20.0 million. The Credit Agreement provides for potential incremental revolving and term facilities at the Companys request and at the discretion of the lenders or other persons providing such incremental facilities, in each case on terms to be determined, and also permits the Company to incur other secured or unsecured debt, in all cases subject to conditions and limitations on the amount as specified in the Credit Agreement.\nDuring the year ended September 30, 2023, we repurchased 4.2 million shares of BellRing Common Stock at an average share price of $29.56 per share and at a total cost, including accrued excise tax and brokers commissions, of $126.3 million.\nDuring the year ended September 30, 2022, prior to the Spin-Off, we repurchased 0.8 million shares of Old BellRing Class A Common Stock at an average share price of $23.34 per share and at a total cost, including brokers commissions, of $18.1 million. In connection with the Spin-off, 0.8 million shares of Old BellRing Class A Common Stock held in treasury stock immediately prior to the Merger effective time were cancelled pursuant to the Transaction Agreement. During the year ended September 30, 2022, subsequent to the Spin-off, we repurchased 1.1 million shares of BellRing Common Stock at an average share price of $23.17 per share and at a total cost, including brokers commissions, of $24.7 million.\nFor additional information on the Spin-off, Credit Agreement and share repurchases, see Notes 1, 13 and 16 within Notes to Consolidated Financial Statements.\nSources and Uses of Cash\nWe expect to generate positive cash flows from operations and believe our cash on hand, cash flows from operations and possible future credit facilities will be sufficient to satisfy our future working capital requirements, purchase commitments, research and development activities, debt repayments (including interest payments), share repurchases and other financing requirements for the foreseeable future. We are currently not aware of any trends or demands, commitments, events or uncertainties that will result in, or that are reasonably likely to result in, our liquidity increasing or decreasing in any material way that will impact meeting our capital needs during or beyond the next twelve months. Our ability to generate positive cash flows from operations is dependent on general economic conditions, competitive pressures and other business risk factors. We believe that we have sufficient liquidity and cash on hand to satisfy our cash needs. If we are unable to generate sufficient cash flows from operations, or otherwise to comply with the terms of our credit facilities, we may be required to seek additional financing alternatives.\nShort-term financing needs primarily consist of working capital requirements and interest payments on our 7.00% Senior Notes and Revolving Credit Facility. Long-term financing needs include the repayment of our 7.00% Senior Notes and Revolving Credit Facility. Additional long-term financing needs will depend largely on potential growth opportunities, including acquisition activity and other strategic transactions. Our asset-light business model requires modest capital expenditures, with annual capital expenditures over the last three fiscal years averaging less than 1% of net sales. No significant capital expenditures are planned for fiscal 2024. Additionally, we may seek to repurchase shares of our Common Stock. Such repurchases, if any, will depend on prevailing market conditions, our liquidity requirements, contractual restrictions and other factors. The amounts involved may be material.\nCash Requirements\nOur cash requirements under our various contractual obligations and commitments include:\nDebt Obligations and Interest Payments - See Note 13 within Notes to Consolidated Financial Statements for additional information on our debt and the timing of expected future principal and interest payments.\nOperating Leases - See Note 11 within Notes to Consolidated Financial Statements for additional information on our operating leases and the timing of expected future payments.\nPurchase Obligations - Purchase obligations are legally binding agreements to purchase goods, services or equipment that specify all significant terms, including: fixed or minimum quantities to be purchased and/or penalties imposed for failing to meet contracted minimum purchase quantities (such as take-or-pay contracts); fixed, minimum or variable price provisions; and the approximate timing of the transaction. As of September 30, 2023, the Company had total purchase commitments of $1,487.7 million (with $459.6 million due in fiscal 2024) which extend through fiscal 2033.\nOther liabilities - Other liabilities include obligations associated with certain employee benefit programs, provisions for legal matters, unrecognized tax benefits and various other long-term liabilities, all of which have some inherent uncertainty as to the amount and timing of payments and were reflected on our Consolidated Balance Sheets as of September 30, 2023.\nThe following table presents select cash flow data, which is discussed below.\nYear Ended September 30,\ndollars in millions 2023 2022\nCash provided by (used in):\nOperating activities\n$ 215.6 $ 21.0\nInvesting activities\n(1.8) (1.8)\nFinancing activities\n(201.7) (135.0)\nEffect of exchange rate changes on cash and cash equivalents\n0.5 (1.0)\nNet increase (decrease) in cash and cash equivalents $ 12.6 $ (116.8)\nOperating Activities\nCash provided by operating activities for the year ended September 30, 2023 increased $194.6 million compared to the prior year. The increase was primarily due to lapping larger cash outflows in the prior year related to the rebuild of powder finished goods from previous supply-constrained levels, partially offset by input cost inflation. The increase was incrementally driven by higher net earnings and favorable changes related to fluctuations in the timing of sales and collections of trade receivables. These positive impacts were partially offset by increased tax payments (net of refunds) of $26.3 million and increased interest payments of $21.6 million.\nInvesting Activities\nCash used in investing activities for both the years ended September 30, 2023 and 2022 was $1.8 million and related to capital expenditures in each year.\nFinancing Activities\nFiscal 2023\nCash used in financing activities for the year ended September 30, 2023 was $201.7 million. We paid $125.5 million, including brokers commissions, for the repurchase of Common Stock and borrowed and repaid $115.0 million and $189.0 million, respectively, under the Revolving Credit Facility.\nFiscal 2022\nCash used in financing activities for the year ended September 30, 2022 was $135.0 million. We repaid the outstanding principal balance of the Term B Facility of $609.9 million, repaid $65.0 million under the Revolving Credit Facility and paid $115.5 million to Old BellRing Class A common stockholders pursuant to the Merger. In addition, we paid $11.9 million of debt issuance costs, debt extinguishment costs and deferred financing fees related to the issuance of the 7.00% Senior Notes and the Revolving Credit Facility, and we paid $42.8 million, including brokers commissions, for the repurchase of Common Stock. We received $550.4 million of cash from Post in connection with the Spin-off, which was partially offset by cash distributions to Post of $3.2 million related to quarterly tax distributions pursuant to BellRing LLCs amended and restated limited liability company agreement prior to the Spin-off. Additionally, we borrowed $164.0 million under the Revolving Credit Facility.\nDebt Covenants\nThe Credit Agreement contains affirmative and negative covenants applicable to us and our restricted subsidiaries customary for agreements of this type, including delivery of financial and other information; compliance with laws; maintenance of property; existence; insurance; books and records; inspection rights; obligation to provide collateral and guarantees by certain new subsidiaries; delivery of environmental reports; participation in an annual meeting with the agent and the lenders; further assurances; and limitations with respect to indebtedness, liens, fundamental changes, restrictive agreements, use of proceeds, amendments of organization documents, prepayments and amendments of certain indebtedness, dispositions of assets, acquisitions and other investments, sale leaseback transactions, changes in the nature of business, transactions with affiliates and dividends and redemptions or repurchases of stock. Under the terms of the Credit Agreement, we are also required to comply with a financial covenant requiring us to maintain a total net leverage ratio (as defined in the Credit Agreement) not to exceed 6.00:1.00, measured as of the last day of each fiscal quarter. We were in compliance with the financial covenant as of September 30, 2023, and we do not believe non-compliance is reasonably likely in the foreseeable future.\nThe Credit Agreement provides for potential incremental revolving and term facilities at our request and at the discretion of the lenders or other persons providing such incremental facilities, in each case on terms to be determined, and also permits us to incur other secured or unsecured debt, in all cases subject to conditions and limitations on the amount as specified in the Credit Agreement.\nIn addition, the indenture governing the 7.00% Senior Notes contains negative covenants customary for this type of agreement that limit our ability and the ability of our restricted subsidiaries to, among other things: borrow money or guarantee debt; create liens; pay dividends on, or redeem or repurchase, stock; make specified types of investments and acquisitions; enter into or permit to exist contractual limits on the ability of our subsidiaries to pay dividends to us; enter into transactions with affiliates; and sell assets or merge with other companies. Certain of these covenants are subject to suspension when and if the 7.00% Senior Notes receive investment grade ratings.\nCOMMODITY TRENDS\nWe are exposed to price fluctuations primarily from purchases of ingredients and packaging materials, energy and other inputs. Our principal ingredients are milk-based, whey-based and soy-based proteins, protein blends, sweeteners and vitamin and mineral blends. Our principal packaging materials consist of aseptic foil and plastic lined cardboard cartons, flexible and rigid plastic film and containers, beverage packaging and corrugate. These costs have been volatile in recent years, and future changes in such costs may cause our results of operations and our operating margins to fluctuate significantly. We manage the impact of cost increases, wherever possible, on commercially reasonable terms, by locking in prices on the quantities through purchase commitments required to meet our production requirements. In addition, we may attempt to offset the effect of increased costs by raising prices to our customers. However, for competitive reasons, we may not be able to pass along the full effect of increases in raw materials and other input costs as we incur them. See Market Trends section above for additional information regarding inflationary pressures on our commodity purchases.\nCURRENCY\nCertain sales and costs of our foreign operations are denominated in Euros. Consequently, profits from these operations are impacted by fluctuations in the value of this currency relative to the U.S. Dollar. We incur gains and losses within our stockholders equity due to the translation of our financial statements from foreign currencies into U.S. Dollars. Our income statement trends may be impacted by the translation of the income statements of our foreign operations into U.S. Dollars. The exchange rates used to translate our foreign sales into U.S. Dollars positively affected net sales by less than 1% during the year ended September 30, 2023, and did not have a material impact on our operating profit or net earnings during the year ended September 30, 2023.\nCRITICAL ACCOUNTING ESTIMATES\nThe preparation of financial statements in accordance with accounting principles generally accepted in the United States of America (GAAP) requires the use of judgment, estimates and assumptions. We make these subjective determinations after considering our historical performance, managements experience, current economic trends and events and information from outside sources. Inherent in this process is the possibility that actual results could differ from these estimates and assumptions for any particular period.\nOur significant accounting policies are described in Note 2 within Notes to Consolidated Financial Statements. Our critical accounting estimates are those that involve a significant amount of estimation uncertainty and have a meaningful impact on the reporting of our financial condition and results of operations.\nRevenue Recognition, Allowance for Trade Promotions - The recognition of certain variable trade promotions, which are treated as a reduction of revenue, requires significant management judgment regarding estimated purchase volumes and program participation. Estimates are based on contractual provisions, redemption rate assumptions and our assessment of current market provisions. Redemption rate assumptions are based on historical results of similar promotions on a deal-by-deal basis, adjusted for current expectations of promotion performance based on the current market. We review and update estimates of variable consideration quarterly. Uncertainties related to the estimates of variable consideration are resolved in a short time frame and do not require any additional constraint on variable consideration. Less than 1% of our annual net sales represent variable consideration that will be resolved in the subsequent period. Based on historical experience, we do not believe that there will be significant changes to our estimates of variable consideration when any uncertainties are resolved with customers. However, significant changes in our estimates could have a material impact on our results of operations.\nRECENTLY ISSUED AND ADOPTED ACCOUNTING STANDARDS\nWe considered all new accounting pronouncements and have concluded there are no new pronouncements that had or will have a material impact on our results of operations, comprehensive income, financial condition, cash flows, shareholders equity or related disclosures based on current information. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nThe Company is exposed to market risk from commodity prices, foreign currency exchange rates and interest rates, among others. For additional discussion of these risks, refer to Cautionary Statement on Forward-Looking Statements on page 1 and Risk Factors in Item 1A of Part I of this report.\nCommodity Price Risk\nIn the ordinary course of business, the Company is exposed to commodity price risks relating to the purchases of raw materials. The Company manages the impact of cost increases, wherever possible, on commercially reasonable terms, by locking in prices on the quantities through purchase commitments required to meet production requirements. In addition, the Company may attempt to offset the effect of increased costs by raising prices to customers. However, for competitive reasons, the Company may not be able to pass along the full effect of increases in raw materials and other input costs as they are incurred.\nForeign Currency Risk\nRelated to Active Nutrition International GmbH, whose functional currency is the Euro, the Company is exposed to risks of fluctuations in future cash flows and earnings due to changes in exchange rates.\nInterest Rate Risk\nAs of both September 30, 2023 and 2022, the Company had outstanding principal value indebtedness of $840.0 million related to its 7.00% Senior Notes. Additionally, the Company had an aggregate principal amount of $25.0 million and $99.0 million outstanding under its Revolving Credit Facility as of September 30, 2023 and 2022, respectively. Borrowings under the Revolving Credit Facility bear interest at variable rates.\nAs of September 30, 2023 and 2022, the fair value of the Companys debt, excluding any borrowings under its Revolving Credit Facility, was $830.0 million and $767.4 million, respectively. Changes in interest rates impact fixed and variable rate debt differently. For fixed rate debt, a change in interest rates will only impact the fair value of the debt, whereas a change in the interest rates on variable rate debt will impact interest expense and cash flows. A hypothetical 10% decrease in interest rates would have increased the fair value of the fixed rate debt by approximately $19 million and $17 million as of September 30, 2023 and 2022, respectively. A hypothetical 10% increase in interest rates would have had an immaterial impact on both interest expense and interest paid during both the years ended September 30, 2023 and 2022. For additional information regarding the Companys debt, see Note 13 within Notes to Consolidated Financial Statements. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nAudited Consolidated Financial Statements\nReport of Independent Registered Public Accounting Firm (PCAOB ID 238)\nConsolidated Statements of Operations for the Fiscal Years Ended September 30, 2023, 2022 and 2021\nConsolidated Statements of Comprehensive Income for the Fiscal Years Ended September 30, 2023, 2022 and 2021\nConsolidated Balance Sheets as of September 30, 2023 and 2022\nConsolidated Statements of Cash Flows for the Fiscal Years Ended September 30, 2023, 2022 and 2021\nConsolidated Statements of Stockholders Deficit for the Fiscal Years Ended September 30, 2023, 2022 and 2021\nNotes to Consolidated Financial Statements 49\nReport of Independent Registered Public Accounting Firm\nTo the Board of Directors and Stockholders of BellRing Brands, Inc.\nOpinions on the Financial Statements and Internal Control over Financial Reporting\nWe have audited the accompanying consolidated balance sheets of BellRing Brands, Inc. and its subsidiaries (the Company) as of September 30, 2023 and 2022, and the related consolidated statements of operations, of comprehensive income, of stockholders' deficit and of cash flows for each of the three years in the period ended September 30, 2023, including the related notes (collectively referred to as the consolidated financial statements). We also have audited the Company's internal control over financial reporting as of September 30, 2023, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).\nIn our opinion, the consolidated financial statements referred to above present fairly, in all material respects, the financial position of the Company as of September 30, 2023 and 2022, and the results of its operations and its cash flows for each of the three years in the period ended September 30, 2023 in conformity with accounting principles generally accepted in the United States of America. Also in our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of September 30, 2023, based on criteria established in Internal Control - Integrated Framework (2013) issued by the COSO.\nBasis for Opinions\nThe Company's management is responsible for these consolidated financial statements, for maintaining effective internal control over financial reporting, and for its assessment of the effectiveness of internal control over financial reporting, included in Managements Report on Internal Control over Financial Reporting appearing under Item 9A. Our responsibility is to express opinions on the Companys consolidated financial statements and on the Company's internal control over financial reporting based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud, and whether effective internal control over financial reporting was maintained in all material respects.\nOur audits of the consolidated financial statements included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. Our audit of internal control over financial reporting included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, and testing and evaluating the design and operating effectiveness of internal control based on the assessed risk. Our audits also included performing such other procedures as we considered necessary in the circumstances. We believe that our audits provide a reasonable basis for our opinions.\nDefinition and Limitations of Internal Control over Financial Reporting\nA companys internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A companys internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nCritical Audit Matters\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that (i) relates to accounts or disclosures that are material to the consolidated financial statements and (ii) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nReceivables, net- Allowance for Trade Promotions\nAs described in Note 2 to the consolidated financial statements, many of the Company's contracts with customers include some form of variable or fixed consideration. The most common forms of variable and fixed consideration are trade promotions, rebates and discount programs. These programs resulted in an allowance for trade promotions of $15.8 million which is reflected as a reduction of Receivables, net as of September 30, 2023. Variable consideration is treated as a reduction of revenue at the time product revenue is recognized. Methodologies for determining these provisions are dependent on specific customer pricing and promotional practices, which range from contractually fixed percentage price reductions to reimbursement based on actual occurrence or performance. The Company reviews and updates estimates of variable consideration each period. Uncertainties related to the estimates of variable consideration are resolved in a short time frame and do not require any additional constraint on variable consideration.\nThe principal consideration for our determination that performing procedures relating to receivables, net - allowance for trade promotions is a critical audit matter is the matter involved significant audit effort in performing procedures related to managements allowance for trade promotions.\nAddressing the matter involved performing procedures and evaluating audit evidence in connection with forming our overall opinion on the consolidated financial statements. These procedures included testing the effectiveness of controls relating to the accuracy and valuation of the allowance for trade promotions. These procedures also included, among others (i) testing managements process for determining the allowance for trade promotions; (ii) evaluating the appropriateness of the methodology; and (iii) testing the accuracy and relevance of underlying data used to determine the allowance for trade promotions by examining customer agreements and sales data on a test basis.\n/s/ PricewaterhouseCoopers LLP\nSt. Louis, Missouri\nNovember 21, 2023\nWe have served as the Company's auditor since 2019.\nBELLRING BRANDS, INC.\nCONSOLIDATED STATEMENTS OF OPERATIONS\n(in millions, except per share data)\nYear Ended September 30,\n2023 2022 2021\nNet Sales $ 1,666.8 $ 1,371.5 $ 1,247.1\nCost of goods sold 1,136.6 949.7 860.9\nGross Profit 530.2 421.8 386.2\nSelling, general and administrative expenses 216.3 189.7 167.1\nAmortization of intangible assets 26.6 19.7 51.2\nOther operating income, net - - (0.1)\nOperating Profit 287.3 212.4 168.0\nInterest expense, net 66.9 49.2 43.2\nLoss on extinguishment and refinancing of debt, net - 17.6 1.6\nEarnings before Income Taxes 220.4 145.6 123.2\nIncome tax expense 54.9 29.6 8.8\nNet Earnings Including Redeemable Noncontrolling Interest 165.5 116.0 114.4\nLess: Net earnings attributable to redeemable noncontrolling interest - 33.7 86.8\nNet Earnings Available to Common Stockholders $ 165.5 $ 82.3 $ 27.6\nEarnings per share of Common Stock:\nBasic $ 1.24 $ 0.88 $ 0.70\nDiluted $ 1.23 $ 0.88 $ 0.70\nWeighted-Average shares of Common Stock Outstanding:\nBasic 133.0 93.5 39.5\nDiluted 134.1 93.8 39.7\nSee accompanying Notes to Consolidated Financial Statements.\nBELLRING BRANDS, INC.\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\n(in millions)\nYear Ended September 30,\n2023 2022 2021\nNet Earnings Including Redeemable Noncontrolling Interest $ 165.5 $ 116.0 $ 114.4\nHedging adjustments:\nReclassifications to net earnings - 7.1 2.3\nForeign currency translation adjustments:\nUnrealized foreign currency translation adjustments 1.2 (2.9) (0.2)\nTax expense on other comprehensive income (loss):\nReclassifications to net earnings - (0.4) (0.2)\nTotal Other Comprehensive Income Including Redeemable Noncontrolling Interest 1.2 3.8 1.9\nLess: Comprehensive income attributable to redeemable noncontrolling interest - 38.3 88.2\nTotal Comprehensive Income Available to Common Stockholders $ 166.7 $ 81.5 $ 28.1\nSee accompanying Notes to Consolidated Financial Statements.\nBELLRING BRANDS, INC.\nCONSOLIDATED BALANCE SHEETS\n(in millions, except share data)\nSeptember 30,\n2023 2022\nASSETS\nCurrent Assets\nCash and cash equivalents $ 48.4 $ 35.8\nReceivables, net 168.2 173.3\nInventories 194.3 199.8\nPrepaid expenses and other current assets 13.3 12.4\nTotal Current Assets 424.2 421.3\nProperty, net 8.5 8.0\nGoodwill 65.9 65.9\nIntangible assets, net 176.8 203.3\nDeferred income taxes 4.2 -\nOther assets 12.0 8.7\nTotal Assets $ 691.6 $ 707.2\nLIABILITIES AND STOCKHOLDERS DEFICIT\nCurrent Liabilities\nAccounts payable $ 89.0 $ 93.8\nOther current liabilities 61.2 49.7\nTotal Current Liabilities 150.2 143.5\nLong-term debt 856.8 929.5\nDeferred income taxes 0.4 2.2\nOther liabilities 7.7 8.2\nTotal Liabilities 1,015.1 1,083.4\nCommitments and Contingencies (See Note 14)\nStockholders Deficit\nPreferred stock, $0.01 par value; 50,000,000 shares authorized, zero shares issued and outstanding in each year\n- -\nCommon stock; $0.01 par value; 500,000,000 shares authorized in each year, 136,553,891 and 136,362,928 shares issued, respectively; 131,245,350 and 135,295,583 shares outstanding, respectively\n1.4 1.4\nAdditional paid-in capital 19.3 7.0\nAccumulated deficit (190.1) (355.6)\nAccumulated other comprehensive loss (3.1) (4.3)\nTreasury stock, at cost, 5,308,541 and 1,067,345 shares, respectively\n(151.0) (24.7)\nTotal Stockholders Deficit (323.5) (376.2)\nTotal Liabilities and Stockholders Deficit $ 691.6 $ 707.2\nSee accompanying Notes to Consolidated Financial Statements.\nBELLRING BRANDS, INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(in millions)\nYear Ended September 30,\n2023 2022 2021\nCash Flows from Operating Activities\nNet earnings including redeemable noncontrolling interest $ 165.5 $ 116.0 $ 114.4\nAdjustments to reconcile net earnings including redeemable noncontrolling interest to net cash provided by operating activities:\nDepreciation and amortization 28.3 21.3 53.7\nLoss on extinguishment and refinancing of debt, net - 17.6 1.6\nNon-cash stock-based compensation expense 14.2 9.8 4.6\nDeferred income taxes (6.0) (4.0) (1.5)\nOther, net 1.2 1.4 3.0\nOther changes in operating assets and liabilities:\nDecrease (increase) in receivables 5.5 (70.7) (21.0)\nDecrease (increase) in inventories 6.4 (83.9) 32.4\n(Increase) decrease in prepaid expenses and other current assets (0.8) 1.1 (5.7)\n(Increase) decrease in other assets (1.8) 2.3 2.5\nIncrease in accounts payable and other current liabilities 3.1 10.3 42.1\nDecrease in non-current liabilities - (0.2) -\nNet Cash Provided by Operating Activities 215.6 21.0 226.1\nCash Flows from Investing Activities\nAdditions to property (1.8) (1.8) (1.6)\nNet Cash Used in Investing Activities (1.8) (1.8) (1.6)\nCash Flows from Financing Activities\nProceeds from issuance of long-term debt 115.0 164.0 20.0\nRepayments of long-term debt (189.0) (674.9) (113.8)\nPayment of merger consideration - (115.5) -\nPurchases of treasury stock (125.5) (42.8) -\nPayments of debt issuance, extinguishment and refinancing costs and deferred financing fees - (11.9) (1.6)\nDistributions from (to) Post Holdings, Inc., net - 547.2 (24.6)\nOther, net (2.2) (1.1) (0.9)\nNet Cash Used in Financing Activities (201.7) (135.0) (120.9)\nEffect of Exchange Rate Changes on Cash and Cash Equivalents 0.5 (1.0) 0.3\nNet Increase (Decrease) in Cash and Cash Equivalents 12.6 (116.8) 103.9\nCash and Cash Equivalents, Beginning of Year 35.8 152.6 48.7\nCash and Cash Equivalents, End of Year $ 48.4 $ 35.8 $ 152.6\nSupplemental noncash information:\nDebt issued to Post Holdings, Inc. in connection with Spin-off $ - $ 840.0 $ -\nSee accompanying Notes to Consolidated Financial Statements.\nBELLRING BRANDS, INC.\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS DEFICIT\n(in millions)\nAs of and for the Year Ended September 30,\n2023 2022 2021\nPreferred Stock\nBeginning and end of year $ - $ - $ -\nCommon Stock\nBeginning of year 1.4 0.4 0.4\nImpact of Spin-off - 1.0 -\nEnd of year 1.4 1.4 0.4\nAdditional Paid-in Capital\nBeginning of year 7.0 - -\nActivity under stock and deferred compensation plans (1.9) (0.9) (0.8)\nNon-cash stock-based compensation expense 14.2 9.8 4.6\nRedemption value adjustment to redeemable noncontrolling interest - (1.9) (3.8)\nEnd of year 19.3 7.0 -\nAccumulated Deficit\nBeginning of year (355.6) (3,059.7) (2,179.0)\nNet earnings available to common stockholders 165.5 82.3 27.6\nDistributions to Post Holdings, Inc. - (3.2) (24.6)\nRedemption value adjustment to redeemable noncontrolling interest - 372.4 (883.7)\nImpact of Spin-off - 2,252.6 -\nEnd of year (190.1) (355.6) (3,059.7)\nAccumulated Other Comprehensive Loss\nHedging Adjustments, net of tax\nBeginning of year - (1.6) (2.1)\nNet change in hedges, net of tax - 1.6 0.5\nEnd of year - - (1.6)\nForeign Currency Translation Adjustments\nBeginning of year (4.3) (1.9) (1.9)\nForeign currency translation adjustments 1.2 (2.4) -\nEnd of year (3.1) (4.3) (1.9)\nTreasury Stock\nBeginning of year (24.7) - -\nPurchases of treasury stock (126.3) (42.8) -\nImpact of Spin-off - 18.1 -\nEnd of year (151.0) (24.7) -\nTotal Stockholders Deficit $ (323.5) $ (376.2) $ (3,062.8)\nPreferred Stock, shares\nBeginning and end of year - - -\nCommon Stock, shares\nBeginning of year 135.3 39.5 39.4\nActivity under stock and deferred compensation plans 0.1 0.2 0.1\nImpact of Spin-off - 97.5 -\nPurchases of treasury stock (4.2) (1.9) -\nEnd of year 131.2 135.3 39.5\nSee accompanying Notes to Consolidated Financial Statements.\nBELLRING BRANDS, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n($ in millions, except per share information or where indicated otherwise)\nNOTE 1 - BACKGROUND\nOn October 21, 2019, BellRing Intermediate Holdings, Inc. (formerly known as BellRing Brands, Inc.) (Old BellRing) closed its initial public offering (the IPO) of 39.4 million shares of its Class A common stock, $0.01 par value per share (Old BellRing Class A Common Stock), and contributed the net proceeds from the IPO to BellRing Brands, LLC, a Delaware limited liability company and subsidiary of Old BellRing (BellRing LLC), in exchange for 39.4 million BellRing LLC non-voting membership units (the BellRing LLC units). As a result of the IPO and certain other transactions completed in connection with the IPO (the formation transactions), BellRing LLC became the holder of the active nutrition business of Post Holdings, Inc. (Post). Old BellRing, as a holding company, had no material assets other than its ownership of BellRing LLC units and its indirect interests in the subsidiaries of BellRing LLC and had no independent means of generating revenue or cash flow. The members of BellRing LLC were Post and Old BellRing.\nDuring the second quarter of fiscal 2022, Post completed its distribution of 80.1% of its ownership interest in BellRing Brands, Inc. (formerly known as BellRing Distribution, LLC) (BellRing) to Posts shareholders. On March 9, 2022, pursuant to the Transaction Agreement and Plan of Merger, dated as of October 26, 2021 (as amended by Amendment No.1 to the Transaction Agreement and Plan of Merger, dated as of February 28, 2022, the Transaction Agreement), by and among Post, Old BellRing, BellRing and BellRing Merger Sub Corporation, a wholly-owned subsidiary of BellRing (BellRing Merger Sub), Post contributed its share of Old BellRing Class B common stock, $0.01 par value per share (Old BellRing Class B Common Stock), all of its BellRing LLC units and $550.4 of cash to BellRing (collectively, the Contribution) in exchange for certain limited liability company interests of BellRing (prior to the conversion of BellRing into a Delaware corporation) and the right to receive $840.0 in aggregate principal amount of BellRings 7.00% Senior Notes (as defined in Note 13).\nOn March 10, 2022, BellRing converted into a Delaware corporation and changed its name to BellRing Brands, Inc., and Post distributed an aggregate of 78.1 million, or 80.1%, of its shares of BellRing common stock, $0.01 par value per share (BellRing Common Stock) to Post shareholders in a pro-rata distribution (the Distribution).\nUpon completion of the Distribution, BellRing Merger Sub merged with and into Old BellRing (the Merger), with Old BellRing continuing as the surviving corporation and becoming a wholly-owned subsidiary of BellRing. Pursuant to the Merger, each outstanding share of Old BellRing Class A Common Stock was converted into one share of BellRing Common Stock and $2.97 in cash, or $115.5 total consideration paid to Old BellRing Class A common stockholders pursuant to the Merger. As a result of the transactions described above (collectively, the Spin-off), BellRing became the new public parent company of, and successor issuer to, Old BellRing, and shares of BellRing Common Stock were deemed to be registered under Section 12(b) of the Securities Exchange Act of 1934, as amended, pursuant to Rule 12g-3(a) promulgated thereunder.\nImmediately prior to the Spin-off, Post held 97.5 million BellRing LLC units, equal to 71.5% of the economic interest in BellRing LLC, and one share of Old BellRing Class B Common Stock, which represented 67% of the combined voting power of the common stock of Old BellRing. Immediately following the Spin-off, Post owned 19.4 million shares, or 14.2%, of BellRing Common Stock, which did not represent a controlling interest in BellRing. As a result of the Spin-off, the dual class voting structure in the BellRing business was eliminated.\nOn August 11, 2022, Post transferred 14.8 million shares of its BellRing Common Stock to certain financial institutions in satisfaction of term loan obligations of Post, which reduced Posts ownership of BellRing Common Stock to 3.4% as of September 30, 2022. In connection with this transaction, BellRing repurchased 0.8 million of the transferred shares from certain of the financial institutions.\nOn November 25, 2022, Post transferred its remaining 4.6 million shares of BellRing Common Stock to certain financial institutions in satisfaction of term loan obligations of Post. In connection with this transaction, BellRing repurchased 0.9 million of the transferred shares from certain of the financial institutions. Post had no ownership of BellRing Common Stock as of September 30, 2023.\nThe Company incurred separation-related expenses of $0.7, $14.5 and $0.2 during the years ended September 30, 2023, 2022 and 2021, respectively, in connection with its separation from Post. These expenses generally included third-party costs for advisory services, fees charged by other service providers and government filing fees and were included in Selling, general and administrative expenses in the Consolidated Statements of Operations.\nThe term Company generally refers to Old BellRing and its consolidated subsidiaries during the periods prior to the Spin-off and to BellRing and its consolidated subsidiaries during the periods subsequent to the Spin-off, unless otherwise stated or context otherwise indicates. The term Common Stock generally refers to Old BellRing Class A Common Stock and Old BellRing Class B Common Stock during the periods prior to the Spin-off and to BellRing Common Stock during the periods\nsubsequent to the Spin-off. The term Net earnings available to common stockholders generally refers to net earnings available to Old BellRing Class A common stockholders during the periods prior to the Spin-off and to net earnings available to BellRing common stockholders during the periods subsequent to the Spin-off.\nThe Company is a consumer products holding company operating in the global convenient nutrition category and is a provider of ready-to-drink (RTD) protein shakes, other RTD beverages and powders. The Company has a single operating and reportable segment, with its principal products being protein-based consumer goods. The Companys primary brands are Premier Protein and Dymatize.\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nPrinciples of Consolidation - Prior to the Spin-off, the financial results of BellRing LLC and its subsidiaries were consolidated with Old BellRing, and a portion of the consolidated net earnings of BellRing LLC was allocated to the redeemable noncontrolling interest (the NCI). The calculation of the NCI was based on Posts ownership percentage of BellRing LLC units during each period prior to the Spin-off and reflected the entitlement of Post to a portion of the consolidated net earnings of BellRing LLC prior to the Spin-off.\nFor the periods subsequent to the Spin-off, any remaining ownership of BellRing by Post no longer represented a NCI to the Company (see Note 6). All intercompany balances and transactions have been eliminated. See Note 5 for further information on transactions with Post included in these financial statements. Certain reclassifications have been made to previously reported financial information to conform to the current year presentation.\nUse of Estimates and Allocations - The consolidated financial statements of the Company are prepared in conformity with accounting principles generally accepted in the United States of America (GAAP), which require certain elections as to accounting policy, estimates and assumptions that affect the reported amounts of assets and liabilities, the disclosure of contingent liabilities at the dates of the financial statements and the reported amount of net revenues and expenses during the reporting periods. Significant accounting policy elections, estimates and assumptions include, among others, allowance for trade promotions. Actual results could differ from those estimates.\nCash Equivalents - Cash equivalents include all highly liquid investments with original maturities of less than three months. At September 30, 2023 and 2022, the Company had $48.4 and $35.8, respectively, in available cash, of which 3.6% and 20.9%, respectively, was outside of the United States (the U.S.). The Companys intention is to reinvest these funds indefinitely.\nReceivables - Receivables are reported at net realizable value. This value includes appropriate allowances for credit losses, cash discounts and other amounts which the Company does not ultimately expect to collect. To calculate the allowance for credit losses, the Company estimates uncollectible amounts based on a review of past due balances, historical loss information and an evaluation of customer accounts for potential future losses. A receivable is considered past due if payments have not been received within the agreed upon invoice terms. Receivables are written off against the allowance when deemed to be uncollectible based upon the Companys evaluation of the customers solvency. As of September 30, 2023 and 2022, the Company did not have off-balance sheet credit exposure related to its customers.\nInventories - Inventories are generally valued at the lower of cost (determined on a first-in, first-out basis) or net realizable value. Reported amounts have been reduced by an allowance for obsolete product and packaging materials based on a review of inventories on hand compared to estimated future usage and sales.\nRestructuring Expenses - Restructuring charges principally consist of severance and other employee separation costs. The Company recognizes restructuring obligations and liabilities for exit and disposal activities at fair value in the period the liability is incurred. Employee severance costs are expensed when they become probable and reasonably estimable under established severance plans. Restructuring charges were included in Selling, general and administrative expenses in the Consolidated Statements of Operations. The Company incurred restructuring charges of $4.7 during the year ended September 30, 2021. No restructuring charges were incurred during the years ended September 30, 2023 or 2022.\nProperty - Property is recorded at cost, and depreciation expense is generally provided on a straight-line basis over the estimated useful life of the property. Estimated useful lives range from 3 to 10 years for machinery and equipment; 1 to 33 years for buildings, building improvements and leasehold improvements; and 1 to 5 years for software. Total depreciation expense was $1.7, $1.6 and $2.5 in fiscal 2023, 2022 and 2021, respectively. Any gains and losses incurred on the sale or disposal of assets are included in Other operating income, net in the Consolidated Statements of Operations. Ordinary repair and maintenance costs are accounted for under the direct expensing method. Property consisted of:\nSeptember 30,\n2023 2022\nLand and land improvements $ 0.7 $ 0.7\nBuildings and leasehold improvements 5.6 5.4\nMachinery and equipment 14.1 12.6\nSoftware 2.4 2.3\nConstruction in progress 1.2 0.5\n24.0 21.5\nAccumulated depreciation (15.5) (13.5)\nProperty, net $ 8.5 $ 8.0\nAs of both September 30, 2023 and 2022, the majority of the Companys tangible long-lived assets were located in Europe and had a net carrying value of $7.1 and $6.0, respectively; the remainder were located in the U.S.\nGoodwill - Goodwill represents the excess of the cost of acquired businesses over the fair market value of their identifiable net assets. The Company conducts a goodwill impairment assessment during the fourth quarter of each fiscal year following the annual forecasting process, or more frequently if facts and circumstances indicate that goodwill may be impaired. The goodwill impairment assessment performed may be either qualitative or quantitative; however, if adverse qualitative trends are identified that could negatively impact the fair value of the business, a quantitative goodwill impairment test is performed. The goodwill impairment qualitative assessment requires an analysis to determine if it is more likely than not that the fair value of a reporting unit is less than its carrying amount.\nThe qualitative goodwill impairment test requires an entity to evaluate various events, circumstances and factors, such as macroeconomic conditions, sensitivity of valuation inputs utilized in the Companys most recent quantitative goodwill impairment test, industry trends and results of operations of the entity, to determine whether it is more likely than not that the fair value of a reporting unit is less than its carrying amount. Metrics such as the gross domestic product growth rate and inflation rate, the discount rate and the terminal growth rate utilized in previous quantitative goodwill impairment tests, peer multiples and category trends and actual results compared to forecast are evaluated by management to identify adverse trends that could negatively impact the fair value of the reporting unit.\nIf adverse qualitative trends are identified that could negatively impact the fair value of a reporting unit, a quantitative goodwill impairment test is performed. The quantitative goodwill impairment test requires an entity to compare the fair value of each reporting unit with its carrying amount. The estimated fair value is determined using a combined income and market approach with a greater weighting on the income approach. The income approach is based on discounted future cash flows and requires significant assumptions, including estimates regarding future revenue, profitability, capital requirements and discount rate. The market approach is based on a market multiple (revenue and EBITDA, which stands for earnings before interest, income taxes, depreciation and amortization) and requires an estimate of appropriate multiples based on market data.\nThe Company has two reporting units, which have been identified at a level below the operating segment level; however, only one reporting unit had a goodwill balance as of September 30, 2023, 2022 and 2021. In fiscal 2023, 2022 and 2021, the Company performed a qualitative impairment test and determined there were no indicators, including adverse trends in the business, that would indicate it was more likely than not that the fair value of the reporting unit was less than its carrying amount. The Company last performed a quantitative impairment test in fiscal 2019. The Company did not record a goodwill impairment charge during the years ended September 30, 2023, 2022 or 2021, as the reporting unit with goodwill passed the qualitative impairment test.\nThe components of Goodwill on the Consolidated Balance Sheets at both the beginning and end of the years ended September 30, 2023 and 2022 are presented in the following table.\nGoodwill, gross $ 180.7\nAccumulated impairment losses (114.8)\nGoodwill $ 65.9\nIntangible Assets - Intangible assets consist primarily of definite-lived customer relationships, trademarks and brands. Amortization expense related to definite-lived intangible assets, which is provided on a straight-line basis (as it approximates the economic benefit) over the estimated useful lives of the assets, was $26.6, $19.7 and $51.2 in fiscal 2023, 2022 and 2021, respectively. For the definite-lived intangible assets recorded as of September 30, 2023, amortization expense is expected to be $35.0 in fiscal 2024 and $17.0 per year for fiscal 2025 through fiscal 2028. Intangible assets consisted of:\nSeptember 30, 2023 September 30, 2022\nCarrying\nAmount Accumulated\nAmortization Net\nAmount Carrying\nAmount Accumulated\nAmortization Net\nAmount\nCustomer relationships $ 178.4 $ (97.2) $ 81.2 $ 178.3 $ (84.9) $ 93.4\nTrademarks and brands 194.0 (98.4) 95.6 195.1 (85.2) 109.9\nOther intangible assets 3.1 (3.1) - 3.1 (3.1) -\nIntangible assets, net $ 375.5 $ (198.7) $ 176.8 $ 376.5 $ (173.2) $ 203.3\nIn August 2023, the Company approved a plan to discontinue the PowerBar business in North America. In connection with the discontinuance, the Company updated the useful lives of the customer relationships and trademark associated with the PowerBar business in North America to reflect the remaining period in which the Company expects to sell existing PowerBar product inventory in North America. Accelerated amortization of $7.1 was recorded during the year ended September 30, 2023 resulting from the updated useful lives of the customer relationships and trademark associated with the PowerBar business in North America. The net carrying value of the customer relationships and trademark associated with the PowerBar business in North America were $6.4 and $11.6, respectively, which are expected to be fully amortized by December 31, 2023.\nIn December 2020, the Company finalized its plan to discontinue the Supreme Protein brand and related sales of Supreme Protein products. In connection with the discontinuance, the Company updated the useful lives of the customer relationships and trademark associated with the Supreme Protein brand to reflect the remaining period in which the Company continued to sell existing Supreme Protein product inventory. Accelerated amortization of $29.9 was recorded during the year ended September 30, 2021 resulting from the updated useful lives of the customer relationships and trademark associated with the Supreme Protein brand, which were fully amortized and written off as of September 30, 2021.\nRecoverability of Assets - The Company continually evaluates whether events or circumstances have occurred which might impair the recoverability of the carrying value of its assets, including property, identifiable intangibles, goodwill and right-of-use (ROU) assets. Definite-lived assets (groups) are tested for recoverability whenever events or changes in circumstances indicate that the carrying amount of an asset (group) may not be recoverable or the estimated useful life is no longer appropriate. The Company groups assets at the lowest level for which cash flows are separately identifiable. If circumstances require that a definite-lived asset (group) be tested for possible impairment, the Company will compare the undiscounted cash flows expected to be generated by the asset (group) to the carrying amount of the asset (group). If the carrying amount of the asset (group) is not recoverable on an undiscounted cash flow basis, an impairment is recognized to the extent that the carrying amount of the asset (group) exceeds its fair value. There were no impairments recorded on the Companys definite-lived assets (groups) in fiscal 2023, 2022 or 2021.\nDerivative Financial Instruments - In the ordinary course of business, the Company is exposed to commodity price risks relating to the purchase of raw materials and supplies, interest rate risks relating to variable rate debt and foreign currency exchange rate risks. The Company may utilize derivative instruments, including futures contracts, option contracts and swaps to manage certain of these exposures by hedging when it is practical to do so. The Company does not hold or issue financial instruments for speculative or trading purposes.\nThe Companys derivative programs may include strategies that qualify and strategies that do not qualify for hedge accounting treatment. To qualify for hedge accounting, the hedging relationship, both at inception of the hedge and on an ongoing basis, is expected to be highly effective in achieving offsetting changes in the fair value of the hedged risk during the period that the hedge is designated. All derivatives are recognized on the balance sheet at fair value. For derivatives that qualify for hedge accounting, the derivative is designated as a hedge on the date in which the derivative contract is entered. Derivatives could be designated as a hedge of the variability of cash flows to be received or paid related to a recognized asset or liability (cash flow hedge). Derivatives may also be considered natural hedging instruments, where changes in their fair values act as\neconomic offsets to changes in fair values of the underlying hedged items and are not designated for hedge accounting. The Company does not have any derivatives currently designated as hedging instruments under Accounting Standards Codification (ASC) Topic 815, Derivatives and Hedging.\nFor previous cash flow hedges that were designated for hedge accounting, gains and losses were recorded in other comprehensive income (OCI) and were reclassified to the Consolidated Statements of Operations in conjunction with the recognition of the underlying hedged item. Changes in the fair value of derivatives that are not designated for hedge accounting are recognized immediately in the Consolidated Statements of Operations. Cash flows from derivatives that were designated as hedges and cash flows from derivatives that are not designated as hedges are classified in the same category on the Consolidated Statements of Cash Flows as the items being hedged or on a basis consistent with the nature of the instruments. The Company held no material derivative financial instruments as of September 30, 2023 or 2022.\nLeases - The Company leases office space, certain warehouses and equipment primarily through operating lease agreements. The Company has no material finance lease agreements. The Company determines if an arrangement is a lease at its inception. When the arrangements include lease and non-lease components, the Company accounts for them as a single lease component. Leases with an initial term of less than 12 months are not reported on the balance sheet, but rather are recognized as lease expense on a straight-line basis over the lease term. Arrangements may include options to extend or terminate the lease arrangement. These options are included in the lease term used to establish ROU assets and lease liabilities when it is reasonably certain they will be exercised. The Company will reassess expected lease terms based on changes in circumstances that indicate options may be more or less likely to be exercised.\nThe Company has certain lease arrangements that include variable rental payments. The future variability of these payments and adjustments are unknown and therefore are not included in minimum rental payments used to determine ROU assets and lease liabilities. The Company has lease arrangements where it makes separate payments to the lessor based on the lessor's common area maintenance expenses, property and casualty insurance costs, property taxes assessed on the property and other variable expenses. As the Company has elected the practical expedient not to separate lease and non-lease components, these variable amounts are captured in operating lease expense in the period in which they are incurred. Variable rental payments are recognized in the period in which the associated obligation is incurred.\nFor lease arrangements that do not provide an implicit interest rate, an incremental borrowing rate (IBR) is applied in determining the present value of future payments. The Companys IBR is selected based upon information available at the lease commencement date.\nROU assets are recorded as Other assets, and lease liabilities are recorded as Other current liabilities and Other liabilities on the Consolidated Balance Sheets. Operating lease expense is recognized on a straight-line basis over the lease term and is included in Selling, general and administrative expenses in the Consolidated Statements of Operations. Costs associated with finance leases and lease income do not have a material impact on the Companys financial statements.\nRevenue - The Company recognizes revenue when performance obligations have been satisfied by transferring control of the goods to customers. Control is generally transferred upon delivery of the goods to the customer. At the time of delivery, the customer is invoiced using previously agreed-upon credit terms. Shipping and/or handling costs that occur before the customer obtains control of the goods are deemed fulfillment activities and are accounted for as fulfillment costs. The Companys contracts with customers generally contain one performance obligation.\nMany of the Companys contracts with customers include some form of variable or fixed consideration. The most common forms of variable and fixed consideration are trade promotions, rebates and discount programs. As of September 30, 2023 and 2022, these programs resulted in an allowance for trade promotions of $15.8 and $12.6, respectively, which were recorded as a reduction of Receivables, net on the Consolidated Balance Sheets. Variable consideration is treated as a reduction of revenue at the time product revenue is recognized. Methodologies for determining these provisions are dependent on specific customer pricing and promotional practices, which range from contractually fixed percentage price reductions to reimbursement based on actual occurrence or performance. The Company does not believe that there will be significant changes to its estimates of variable consideration when any uncertainties are resolved with customers. The Company reviews and updates estimates of variable consideration each period. Uncertainties related to the estimates of variable consideration are resolved in a short time frame and do not require any additional constraint on variable consideration. The majority of trade promotions are redeemed in the form of invoice credits against trade receivables.\nThe Companys products are sold with no right of return, except in the case of goods which do not meet product specifications or are damaged. No services beyond this assurance-type warranty are provided to customers. Customer remedies include either a cash refund or an exchange of the product. As a result, the right of return and related refund liability is estimated and recorded as a reduction of revenue based on historical sales return experience.\nCost of Goods Sold - Cost of goods sold includes, among other things, inbound and outbound freight costs and depreciation expense related to assets used in production, while storage and other warehousing costs are included in Selling,\ngeneral and administrative expenses in the Consolidated Statements of Operations. Storage and other warehousing costs totaled $20.1, $16.6 and $17.0 in fiscal 2023, 2022 and 2021, respectively.\nAdvertising - Advertising costs are expensed as incurred, except for costs of producing media advertising such as television commercials or magazine and online advertisements, which are deferred until the first time the advertising takes place and amortized over the period the advertising runs. The amounts reported as assets on the Consolidated Balance Sheets as Prepaid expenses and other current assets were immaterial as of both September 30, 2023 and 2022.\nStock-based Compensation - The Company recognizes the cost of employee services received in exchange for awards of equity instruments based on the grant-date fair value of the equity award. The cost for an equity award is recognized ratably over the period during which an employee is required to provide service in exchange for the award - the requisite service period (usually the vesting period). Any forfeitures of stock-based awards are recorded as they occur. See Note 15 for disclosures related to stock-based compensation.\nIncome Tax Expense - Income tax expense is estimated based on income taxes in each jurisdiction and includes the effects of both current tax exposures and the temporary differences resulting from differing treatment of items for tax and financial reporting purposes. These temporary differences result in deferred tax assets and liabilities. A valuation allowance is established against the related deferred tax assets to the extent that it is not more likely than not that the future benefits will be realized. Reserves are recorded for estimated exposures associated with the Companys tax filing positions, which are subject to periodic audits by governmental taxing authorities. Interest incurred due to an underpayment of income taxes is classified as income tax expense.\nImmediately prior to the Spin-off, Old BellRing held 28.5% of the economic interest in BellRing LLC (see Note 1), which, as a result of the IPO and formation transactions, was treated as a partnership for U.S. federal income tax purposes. As a partnership, BellRing LLC was itself generally not subject to U.S. federal income tax under current U.S. tax laws. Old BellRing was subject to U.S. federal income taxes, in addition to state and local income taxes, with respect to its 28.5% distributive share of the items of income, gain, loss and deduction of BellRing LLC. Old BellRing was also subject to taxes in foreign jurisdictions. Subsequent to the Spin-off, the Company reported 100% of the income, gain, loss and deduction of BellRing LLC for U.S. federal, state, and local income tax purposes. See Note 7 for disclosures related to income taxes.\nNOTE 3 - RECENTLY ISSUED AND ADOPTED ACCOUNTING STANDARDS\nThe Company has considered all new accounting pronouncements and has concluded there are no new pronouncements that had or will have a material impact on the Companys results of operations, comprehensive income, financial condition, cash flows, stockholders equity or disclosures based on current information.\nNOTE 4 - REVENUE\nThe following table presents net sales by product.\nYear Ended September 30,\n2023 2022 2021\nShakes and other beverages $ 1,327.0 $ 1,084.0 $ 1,014.2\nPowders 289.7 242.2 178.6\nOther 50.1 45.3 54.3\nNet Sales $ 1,666.8 $ 1,371.5 $ 1,247.1\nThe Companys revenues were primarily generated by sales within the U.S.; foreign sales were 10.5%, 11.3% and 11.7% of total fiscal 2023, 2022 and 2021 net sales, respectively. The largest concentration of foreign sales in fiscal 2023 and 2022 was within Canada, which accounted for 40.8% and 35.4% of total foreign sales, respectively. The largest concentration of foreign sales in fiscal 2021 was within Europe (with no individual countries within Europe accounting for a significant portion of total foreign sales), which accounted for 34.1% of total foreign net sales. Sales are attributed to individual countries based on the address to which the product is shipped.\nThree customers individually accounted for more than 10% of total net sales in the year ended September 30, 2023 and two customers individually accounted for more than 10% of total net sales in each of the years ended September 30, 2022 and 2021. One customer accounted for 33.9%, 31.9% and 31.5% of total net sales in the years ended September 30, 2023, 2022 and 2021, respectively. A second customer accounted for 30.0%, 31.6% and 33.8% of total net sales in the years ended September 30, 2023, 2022 and 2021, respectively. A third customer accounted for 11.4% of total net sales in the year ended September 30, 2023 but did not account for more than 10% of total net sales in the years ended September 30, 2022 or 2021.\nNOTE 5 - RELATED PARTY TRANSACTIONS\nBoth prior to and subsequent to the Spin-off, transactions with Post were considered related party transactions as certain of the Companys directors continue to serve as officers or directors of Post.\nThe Company has a series of agreements with Post which are intended to govern the ongoing relationship between the Company and Post. Prior to the Spin-off, these agreements included the amended and restated limited liability company agreement of BellRing LLC (the BellRing LLC Agreement), an employee matters agreement, an investor rights agreement, a tax matters agreement, a tax receivable agreement and a master service agreement, among others. In connection with the Spin-off, the Company and Post amended and restated the master services agreement (the MSA) and the employee matters agreement and entered into a new tax matters agreement (the Tax Matters Agreement). The previous investor rights agreement between the Company and Post was terminated, and the Company and Post entered into a new registration rights agreement. Additionally, the Company entered into a Co-Packing Agreement (as defined below) with a wholly-owned subsidiary of Post in fiscal 2022.\nThe MSA and other related party transactions\nThe Company uses certain functions and services performed by Post under the MSA. These functions and services include finance, internal audit, treasury, information technology support, insurance and tax matters, the use of office and/or data center space, payroll processing services and tax compliance services. Prior to the Spin-off, Post also provided legal services to the Company. The MSA was amended and restated upon completion of the Spin-off to provide for similar services following the Spin-off and such other services as BellRing and Post may agree. The MSA was further amended on August 4, 2023 to modify the scope and pricing, and extended the term of certain services provided under it, none of which modifications are expected to materially increase the aggregate fees payable under the MSA. During the years ended September 30, 2023, 2022 and 2021, MSA fees were $4.0, $4.6 and $2.2, respectively. MSA fees were reported in Selling, general and administrative expenses in the Consolidated Statements of Operations.\nThe Company sells certain products to, purchases certain products from and licenses certain intellectual property to and from Post and its subsidiaries based upon prices governed by agreements between the Company and Post and its subsidiaries, consistent with prices of similar arm's-length transactions. During each of the years ended September 30, 2023, 2022 and 2021, net sales to, purchases from and royalties paid to and received from Post and its subsidiaries were immaterial.\nThe Company had immaterial receivables, payables and other current liabilities with Post at both September 30, 2023 and 2022 related to sales, royalty income, purchases, MSA fees and royalty expense with Post and its subsidiaries.\nCo-Packaging Agreement\nOn September 30, 2022, Premier Nutrition Company, LLC (Premier Nutrition), a subsidiary of the Company, entered into a co-packing agreement with Comet Processing, Inc. (Comet), a wholly-owned subsidiary of Post (the Co-Packing Agreement). Under the Co-Packing Agreement, Comet will manufacture for Premier Nutrition, and Premier Nutrition will purchase from Comet, certain RTD shakes. During the year ended September 30, 2023, Premier Nutrition incurred $2.5 related to reimbursable start-up costs pursuant to the Co-Packing Agreement. As of September 30, 2023, these costs had not yet been paid and were included in Accounts payable on the Consolidated Balance Sheets. There were no purchases of RTD shakes from Comet during the year ended September 30, 2023.\nTax Agreements\nPrior to the Spin-off, BellRing LLC made payments to Post related to quarterly tax distributions and state corporate tax withholdings made pursuant to the terms of the BellRing LLC Agreement. During the years ended September 30, 2022 and 2021, BellRing LLC paid $3.2 and $20.4, respectively, to Post related to quarterly tax distributions and zero and $4.2, respectively, for state corporate tax withholdings on behalf of Post.\nIn connection with and upon completion of the Spin-off, the Company entered into the Tax Matters Agreement by and among Post, BellRing and Old BellRing. The Tax Matters Agreement (i) governs the parties respective rights, responsibilities and obligations with respect to taxes, including taxes arising in the ordinary course of business and taxes, if any, that may be incurred if the Distribution fails to qualify for its intended tax treatment, (ii) addresses U.S. federal, state, local and non-U.S. tax matters and (iii) sets forth the respective obligations of the parties with respect to the filing of tax returns, the administration of tax contests and assistance and cooperation on tax matters.\nPursuant to the Tax Matters Agreement, BellRing is expected to indemnify Post for (i) all taxes for which BellRing is responsible (as described in the Tax Matters Agreement) and (ii) all taxes incurred by reason of certain actions or events, or by reason of any breach by BellRing or any of its subsidiaries of any of their respective representations, warranties or covenants under the Tax Matters Agreement that, in each case, affect the intended tax-free treatment of the Spin-off. Additionally, Post is expected to indemnify BellRing for the (i) taxes for which Post is responsible (as described in the Tax Matters Agreement) and\n(ii) taxes attributable to a failure of the Spin-off to qualify as tax-free, to the extent incurred by any action or failure to take any action within the control of Post. There were no amounts incurred by BellRing or Post under the Tax Matters Agreement during the years ended September 30, 2023 or 2022.\nStock Based Compensation\nPrior to the IPO, the Companys employees participated in various Post long-term incentive plans which issued awards connected to Post common stock (Post Equity Awards). Subsequent to the IPO, BellRing employees were no longer eligible to receive new issuances of Post Equity Awards; however, BellRing employees continued to vest in any issued and outstanding Post Equity Awards, pursuant to the terms of the awards, and the Company incurred pass-through charges from Post relating to these awards. During each of the years ended September 30, 2023, 2022 and 2021, total compensation cost related to the Post Equity Awards recognized by the Company was immaterial, and all Post Equity Awards had vested as of September 30, 2023.\nNOTE 6 - REDEEMABLE NONCONTROLLING INTEREST\nImmediately prior to the Spin-off, Post held 97.5 million BellRing LLC units equal to 71.5% of the economic interest in BellRing LLC. Prior to the Spin-off, Post had the right to redeem BellRing LLC units for, at BellRing LLCs option (as determined by its Board of Managers), (i) shares of Old BellRing Class A Common Stock, at an initial redemption rate of one share of Old BellRing Class A Common Stock for one BellRing LLC unit, subject to customary redemption rate adjustments for stock splits, stock dividends and reclassification or (ii) cash (based on the market price of the shares of Old BellRing Class A Common Stock).\nPosts ownership of BellRing LLC units prior to the Spin-off represented a NCI to the Company, which was classified outside of permanent stockholders equity as the BellRing LLC units were redeemable at the option of Post, through Posts ownership of Old BellRing Class B Common Stock (see Note 1). The carrying amount of the NCI was the greater of: (i) the initial carrying amount, increased or decreased for the NCIs share of net income or loss, other comprehensive income or loss and distributions or dividends or (ii) the redemption value. Changes in the redemption value of the NCI were recorded to Additional paid-in capital, to the extent available, and Accumulated deficit on the Consolidated Balance Sheets.\nImmediately prior to the Spin-off, Old BellRing owned 28.5% of the outstanding BellRing LLC units. Prior to the Spin-off, the financial results of BellRing LLC and its subsidiaries were consolidated with Old BellRing, and the portion of the consolidated net earnings of BellRing LLC to which Post was entitled was allocated to the NCI during each period.\nImmediately following the Spin-off, Post owned 14.2% of the BellRing Common Stock, which did not represent a controlling interest in the Company. As a result of the Spin-off, the carrying amount of the NCI was reduced to zero immediately following the Spin-off.\nThe following table summarizes the changes to the Companys NCI prior to the Spin-off. There were no changes to the Companys NCI for the year ended September 30, 2023 as the carrying amount of the NCI was reduced to zero immediately following the Spin-off.\nAs of and for the\nYear Ended September 30,\n2022 2021\nBeginning of year $ 2,997.3 $ 2,021.6\nNet earnings attributable to NCI\n33.7 86.8\nNet change in hedges, net of tax 5.1 1.6\nForeign currency translation adjustments (0.5) (0.2)\nRedemption value adjustment to NCI (370.5) 887.5\nImpact of Spin-off (2,665.1) -\nEnd of year $ - $ 2,997.3\nThe following table summarizes the effects of changes in NCI on the Companys equity prior to the Spin-off. There were no transfers to or from NCI for the year ended September 30, 2023 as the carrying amount of the NCI was reduced to zero immediately following the Spin-off.\nAs of and for the\nYear Ended September 30,\n2022 2021\nNet earnings available to common stockholders $ 82.3 $ 27.6\nTransfers (from) to NCI:\nChanges in equity as a result of redemption value adjustment to NCI (370.5) 887.5\nIncrease in equity as a result of the Spin-off (2,665.1) -\nChanges from net earnings available to common stockholders and transfers (from) to NCI $ (2,953.3) $ 915.1\nNOTE 7 - INCOME TAXES\nPrior to the Spin-off, Old BellRing held an economic interest in BellRing LLC (see Note 1) which, as a result of the IPO and formation transactions, was treated as a partnership for U.S. federal income tax purposes. As a partnership, BellRing LLC was itself generally not subject to U.S. federal income tax under current U.S. tax laws. Generally, items of taxable income, gain, loss and deduction of BellRing LLC were passed through to its members, Old BellRing and Post. Old BellRing was responsible for its share of taxable income or loss of BellRing LLC allocated to it in accordance with the BellRing LLC Agreement and partnership tax rules and regulations.\nSubsequent to the Spin-off, the Company reported 100% of the income, gain, loss and deduction of BellRing LLC for U.S. federal, state and local income tax purposes.\nThe expense (benefit) for income taxes consisted of the following:\nYear Ended September 30,\n2023 2022 2021\nCurrent:\nFederal $ 49.1 $ 28.0 $ 9.2\nState 10.9 5.2 1.7\nForeign 0.9 0.4 (0.6)\n60.9 33.6 10.3\nDeferred:\nFederal (4.9) (3.4) (1.3)\nState (1.1) (0.6) (0.2)\nForeign - - -\n(6.0) (4.0) (1.5)\nIncome tax expense $ 54.9 $ 29.6 $ 8.8\nThe effective income tax rate for fiscal 2023 was 24.9% compared to 20.3% for fiscal 2022 and 7.1% for fiscal 2021. The increase in the effective income tax rate compared to fiscal 2022 and 2021 was primarily due to the change in tax expense allocation related to the Spin-off. After the Spin-off, the Company reported 100% of the income, gain, loss and deduction of BellRing LLC for U.S. federal, state, and local income tax purposes, whereas, prior to the Spin-off in the second quarter of fiscal 2022, the Company reported Old BellRings share of such activity. This increase was partially offset by higher separation-related expenses incurred in connection with the Spin-off in fiscal 2022 that were treated as non-deductible.\nThe following table presents the reconciliation of income tax expense with amounts computed at the federal statutory tax rate.\nYear Ended September 30,\n2023 2022 2021\nComputed tax at federal statutory rate (21%)\n$ 46.3 $ 30.6 $ 25.9\nIncome tax expense attributable to NCI - (7.6) (19.5)\nState income taxes, net of effect on federal tax 8.4 4.7 4.0\nTransaction costs - 2.0 -\nOther, net (none in excess of 5% of computed tax) 0.2 (0.1) (1.6)\nIncome tax expense $ 54.9 $ 29.6 $ 8.8\nDeferred income taxes reflect the net tax effects of temporary differences between the carrying amounts of assets and liabilities for financial reporting purposes and the amounts used for income tax purposes. Deferred tax non-current assets (liabilities) were as follows:\nSeptember 30, 2023 September 30, 2022\nAssets Liabilities Net Assets Liabilities Net\nStock-based compensation awards $ 2.2 $ - $ 2.2 $ 1.6 $ - $ 1.6\nAccrued vacation, incentive and severance 3.1 - 3.1 2.6 - 2.6\nInventory 4.4 - 4.4 4.1 - 4.1\nAccrued liabilities 6.0 - 6.0 4.7 - 4.7\nROU assets - (1.4) (1.4) - (1.7) (1.7)\nLease liabilities 1.4 - 1.4 1.7 - 1.7\nProperty - (0.3) (0.3) - (0.4) (0.4)\nIntangible assets - (13.9) (13.9) - (14.8) (14.8)\nCapitalized research and development\n2.3 - 2.3 - - -\nTotal deferred income taxes\n$ 19.4 $ (15.6) $ 3.8 $ 14.7 $ (16.9) $ (2.2)\nNo provision has been made for income taxes on undistributed earnings of consolidated foreign subsidiaries of $2.8 and $1.7 at September 30, 2023 and 2022, respectively, as it is the Companys intention to indefinitely reinvest undistributed earnings of its foreign subsidiaries. It is not practicable to estimate the additional income taxes and applicable foreign withholdings that would be payable on the remittance of such undistributed earnings.\nFor fiscal 2023, 2022 and 2021, foreign income (loss) before income taxes was $2.0, $1.1 and $(1.9), respectively.\nUnrecognized Tax Benefits\nThe Company recognizes the tax benefit from uncertain tax positions only if it is more likely than not that the tax position will be sustained on examination by the taxing authorities. The tax benefits recognized from such positions are measured based on the largest benefit that has a greater than 50% likelihood of being realized upon ultimate settlement. To the extent the Companys assessment of such tax positions changes, the change in estimate will be recorded in the period in which the determination is made.\nAt both September 30, 2023 and 2022, the Company had net unrecognized tax benefits of $1.5. There was no unrecognized tax benefits activity during the years ended September 30, 2023, 2022 or 2021. The amount of the net unrecognized tax benefits that, if recognized, would directly affect the effective tax rate was $1.5 at September 30, 2023. No material changes to unrecognized tax benefits at September 30, 2023 are expected to be recognized within the next twelve months.\nThe Company computes tax-related interest and penalties as the difference between the tax position recognized for financial reporting purposes and the amount previously taken on the Companys tax returns and classifies these amounts as components of income tax (benefit) expense. During each of the years ended September 30, 2023, 2022 and 2021, expenses recorded related to interest and penalties were immaterial, and the Company had immaterial interest and penalty accruals at both September 30, 2023 and 2022.\nU.S. federal, U.S. state and German income tax returns for the tax years ended September 30, 2020 through September 30, 2022 are generally open and subject to examination by the tax authorities in each respective jurisdiction.\nNOTE 8 - EARNINGS PER SHARE\nPrior to the Spin-off, basic earnings per share was based on the average number of shares of Old BellRing Class A Common Stock outstanding during the year. Diluted earnings per share was based on the average number of shares of Old BellRing Class A Common Stock used for the basic earnings per share calculation, adjusted for the dilutive effect of stock options and restricted stock units using the treasury stock method. In addition, Net earnings available to common stockholders for diluted earnings per share in the table below was adjusted for diluted net earnings per share of Old BellRing Class A Common Stock attributable to NCI, to the extent it was dilutive.\nSubsequent to the Spin-off, basic earnings per share is based on the average number of shares of BellRing Common Stock outstanding during the year. Diluted earnings per share is based on the average number of shares of BellRing Common Stock used for the basic earnings per share calculation, adjusted for the dilutive effect of stock options and restricted stock units using the treasury stock method.\nPrior to the Spin-off, the share of Old BellRing Class B Common Stock did not have economic rights, including rights to dividends or distributions upon liquidation, and was therefore not a participating security. Subsequent to the Spin-off, the share of Old BellRing Class B Common Stock was no longer outstanding. As such, separate presentation of basic and diluted earnings per share of Old BellRing Class B Common Stock under the two-class method has not been presented for any years.\nThe following table sets forth the computation of basic and diluted earnings per share.\nYear Ended September 30,\n2023 2022 2021\nNet earnings available to common stockholders for basic earnings per share $ 165.5 $ 82.3 $ 27.6\nDilutive impact of net earnings attributable to NCI - - 0.2\nNet earnings available to common stockholders for diluted earnings per share $ 165.5 $ 82.3 $ 27.8\nshares in millions\nWeighted-average shares for basic earnings per share 133.0 93.5 39.5\nEffect of dilutive securities:\nStock options 0.1 0.1 -\nRestricted stock units 0.3 0.2 0.2\nPerformance-based restricted stock units 0.7 - -\nWeighted-average shares for diluted earnings per share 134.1 93.8 39.7\nBasic earnings per share of Common Stock $ 1.24 $ 0.88 $ 0.70\nDiluted earnings per share of Common Stock $ 1.23 $ 0.88 $ 0.70\nThe following table details the securities that have been excluded from the calculation of weighted-average shares for diluted earnings per share as they were anti-dilutive.\nYear Ended September 30,\nshares in millions 2023 2022 2021\nStock options - - 0.2\nRestricted stock units 0.1 0.1 -\nPerformance-based restricted stock units 0.1 0.1 -\nNOTE 9 - SUPPLEMENTAL OPERATIONS STATEMENT AND CASH FLOW INFORMATION\nYear Ended September 30,\n2023 2022 2021\nAdvertising expenses $ 40.9 $ 22.6 $ 39.1\nResearch and development expenses 12.0 11.4 11.2\nInterest paid 66.6 45.0 35.7\nIncome taxes paid (a) 60.9 34.6 12.0\n(a)Subsequent to the Spin-off, the Company reported 100% of the income, gain, loss and deduction of BellRing LLC. See Note 7 for additional information on the Companys income taxes.\nNOTE 10 - SUPPLEMENTAL BALANCE SHEET INFORMATION\nSeptember 30,\n2023 2022\nReceivables, net\nTrade $ 147.3 $ 151.7\nOther 21.2 21.8\n168.5 173.5\nAllowance for credit losses (0.3) (0.2)\n$ 168.2 $ 173.3\nInventories\nRaw materials and supplies $ 60.4 $ 58.3\nWork in process 0.1 0.1\nFinished products 133.8 141.4\n$ 194.3 $ 199.8\nAccounts Payable\nTrade $ 85.0 $ 91.4\nOther 4.0 2.4\n$ 89.0 $ 93.8\nOther Current Liabilities\nAccrued legal matters $ 21.0 $ 16.0\nAccrued compensation 14.8 13.5\nAdvertising and promotion 5.4 4.8\nOther 20.0 15.4\n$ 61.2 $ 49.7\nNOTE 11 - LEASES\nThe Company leases office space, certain warehouses and equipment primarily through operating lease agreements. The Company has no material finance lease agreements. Leases have remaining terms which range from less than 1 year to 10 years and most leases provide the Company with the option to exercise one or more renewal terms.\nThe following table presents the balance sheet location of the Companys operating leases.\nSeptember 30,\n2023 2022\nROU assets:\nOther assets $ 7.4 $ 7.5\nLease liabilities:\nOther current liabilities $ 2.1 $ 1.9\nOther liabilities 6.1 6.6\nTotal liabilities $ 8.2 $ 8.5\nFuture minimum payments of the Companys operating lease liabilities as of September 30, 2023 are presented in the following table.\nFiscal 2024 $ 2.4\nFiscal 2025 2.3\nFiscal 2026 2.3\nFiscal 2027 0.9\nFiscal 2028 0.2\nThereafter 1.0\nTotal future minimum payments 9.1\nLess: Implied interest (0.9)\nTotal lease liabilities $ 8.2\nThe following table presents supplemental information related to the Companys operating leases.\nYear Ended September 30,\n2023 2022 2021\nTotal operating lease expense\n$3.1 $3.8 $3.7\nVariable lease expense 0.9 0.9 0.7\nWeighted-average remaining lease term\n4 years 4 years 5 years\nWeighted-average incremental borrowing rate\n4.8% 4.6% 4.3%\nOperating cash flows for amounts included in the measurement of the Companys operating lease liabilities for the years ended September 30, 2023, 2022 and 2021 were $2.4, $2.2 and $3.0, respectively. Short-term lease expense for the years ended September 30, 2023, 2022 and 2021 was immaterial. ROU assets obtained in exchange for operating lease liabilities during the years ended September 30, 2023, 2022 and 2021 were immaterial.\nNOTE 12 - FAIR VALUE MEASUREMENTS\nThe Companys financial assets and liabilities include cash and cash equivalents, receivables and accounts payable for which the carrying value approximates fair value due to their short maturities (less than 12 months). The Company does not record its current portion of long-term debt and long-term debt at fair value on the Consolidated Balance Sheets. The fair value of any outstanding borrowings under the Revolving Credit Facility (as defined in Note 13) as of September 30, 2023 and 2022 approximated its carrying value. Based on market rates, the fair value (Level 2) of the Companys debt, excluding any borrowings under the Revolving Credit Facility, was $830.0 and $767.4 as of September 30, 2023 and 2022, respectively.\nCertain assets and liabilities, including property, goodwill and other intangible assets, are measured at fair value on a non-recurring basis. No impairment charges were recorded for property, goodwill or other intangible assets during the years ended September 30, 2023, 2022 or 2021.\nNOTE 13 - LONG-TERM DEBT\nThe components of Long-term debt on the Consolidated Balance Sheets are presented in the following table.\nSeptember 30,\n2023 2022\n7.00% Senior Notes maturing in March 2030 $ 840.0 $ 840.0\nRevolving Credit Facility 25.0 99.0\nTotal principal amount of debt 865.0 939.0\nLess: Debt issuance costs, net 8.2 9.5\nLong-term debt $ 856.8 $ 929.5\nSenior Notes\nOn March 10, 2022, pursuant to the Transaction Agreement, the Company issued $840.0 aggregate principal amount of 7.00% senior notes maturing in March 2030 (the 7.00% Senior Notes) to Post as partial consideration for the Contribution in connection with the Distribution. Post subsequently delivered the 7.00% Senior Notes to certain financial institutions in satisfaction of term loan obligations of Post in an equal principal amount.\nThe 7.00% Senior Notes were issued at par, and the Company incurred debt issuance costs of $10.2, which were deferred and are being amortized to interest expense over the term of the 7.00% Senior Notes. Interest payments are due semi-annually each March 15 and September 15, and began on September 15, 2022. The 7.00% Senior Notes are senior unsecured obligations of BellRing and are guaranteed by BellRings existing and subsequently acquired or organized direct and indirect wholly-owned domestic subsidiaries (other than immaterial subsidiaries, certain excluded subsidiaries and subsidiaries the Company designates as unrestricted subsidiaries). The maturity date of the 7.00% Senior Notes is March 15, 2030.\nCredit Agreement\nOn March 10, 2022, pursuant to the Transaction Agreement, the Company entered into a credit agreement (as amended, the Credit Agreement), which provides for a revolving credit facility in an aggregate principal amount of $250.0 (the Revolving Credit Facility), with commitments made available to the Company in U.S. Dollars, Euros and United Kingdom (U.K.) Pounds Sterling. Letters of credit are available under the Credit Agreement in an aggregate amount of up to $20.0. Any outstanding amounts under the Credit Agreement must be repaid on or before March 10, 2027.\nBorrowings under the Revolving Credit Facility bear interest at an annual rate equal to: (i) in the case of loans denominated in U.S. Dollars, at the Companys option, the base rate (as defined in the Credit Agreement) plus a margin which will range from 2.00% to 2.75% depending on the Companys secured net leverage ratio (as defined in the Credit Agreement), or the adjusted term SOFR rate (as defined in the Credit Agreement) for the applicable interest period plus a margin which will range from 3.00% to 3.75% depending on the Companys secured net leverage ratio; (ii) in the case of loans denominated in Euros, the adjusted Eurodollar rate (as defined in the Credit Agreement) for the applicable interest period plus a margin which will range from 3.00% to 3.75% depending on the Companys secured net leverage ratio; and (iii) in the case of loans denominated in U.K. Pounds Sterling, the adjusted daily simple RFR (as defined in the Credit Agreement) plus a margin which will range from 3.00% to 3.75% depending on the Companys secured net leverage ratio. Facility fees on the daily unused amount of commitments under the Revolving Credit Facility will accrue at rates ranging from 0.25% to 0.375% per annum, depending on the Companys secured net leverage ratio.\nThe Company incurred $1.5 of financing fees in connection with the Revolving Credit Facility, which were deferred and are being amortized to interest expense over the term of the Revolving Credit Facility. During the years ended September 30, 2023 and 2022, the Company borrowed $115.0 and $164.0 under the Revolving Credit Facility, respectively, and repaid $189.0 and $65.0 under the Revolving Credit Facility, respectively. The interest rate on the utilized portion of the Revolving Credit Facility was 8.42% as of September 30, 2023 and ranged from 5.95% to 8.25% as of September 30, 2022. The available borrowing capacity under the Revolving Credit Facility was $225.0 and $151.0 as of September 30, 2023 and 2022, respectively. There were no outstanding letters of credit as of September 30, 2023 or 2022.\nUnder the terms of the Credit Agreement, BellRing is required to maintain a total net leverage ratio (as defined in the Credit Agreement) not to exceed 6.00:1.00, measured as of the last day of each fiscal quarter. The total net leverage ratio of the Company did not exceed this threshold as of September 30, 2023.\nThe Credit Agreement provides for potential incremental revolving and term facilities at the Companys request and at the discretion of the lenders or other persons providing such incremental facilities, in each case on terms to be determined, and also permits the Company to incur other secured or unsecured debt, in all cases subject to conditions and limitations as specified in the Credit Agreement.\nFurthermore, the Credit Agreement provides for customary events of default. Upon the occurrence and during the continuance of an event of default, the maturity of the loans under the Credit Agreement may accelerate and the administrative agent and lenders under the Credit Agreement may exercise other rights and remedies available at law or under the loan documents, including with respect to the collateral securing, and guarantees of, the Companys obligations under the Credit Agreement.\nThe Companys obligations under the Credit Agreement are unconditionally guaranteed by its existing and subsequently acquired or organized direct and indirect subsidiaries (other than immaterial subsidiaries, certain excluded subsidiaries and subsidiaries the Company designates as unrestricted subsidiaries) and are secured by security interests in substantially all of the Companys assets and the assets of its subsidiary guarantors, but excluding, in each case, real property.\nOld Credit Agreement\nOn October 21, 2019, BellRing LLC entered into a credit agreement (as subsequently amended, the Old Credit Agreement) which provided for a term B loan facility in an aggregate original principal amount of $700.0 (the Term B Facility) and a revolving credit facility in an aggregate principal amount of up to $200.0 (the Old Revolving Credit Facility), with the commitments under the Old Revolving Credit Facility to be made available to BellRing LLC in U.S. Dollars, Euros and U.K. Pounds Sterling. Letters of credit were available under the Old Credit Agreement in an aggregate amount of up to $20.0.\nOn February 26, 2021, BellRing LLC entered into a second amendment to the Old Credit Agreement (the Amendment). In connection with the Amendment, BellRing LLC paid debt refinancing fees of $1.6 in the year ended September 30, 2021, which were included in Loss on extinguishment and refinancing of debt, net in the Consolidated Statements of Operations.\nOn March 10, 2022, with certain of the proceeds from the transactions related to the Spin-off, BellRing LLC repaid the aggregate outstanding principal balance of $519.8 on its Term B Facility and terminated all obligations and commitments under the Old Credit Agreement. The Company recorded a loss of $17.6 in the year ended September 30, 2022, which was included in Loss on extinguishment and refinancing of debt, net in the Consolidated Statements of Operations. This loss included (i) a $6.9 write-off of unamortized discounts and debt extinguishment fees, (ii) a $6.1 write-off of unamortized net hedging losses recorded within accumulated OCI related to the Term B Facility and (iii) a $4.6 write-off of debt issuance costs and deferred financing fees. Following the termination of the Old Credit Agreement, BellRing LLC and the guarantors had no further obligations under the Old Credit Agreement and the related guarantees other than customary indemnification obligations which continue.\nThe Term B Facility required quarterly scheduled amortization payments of $8.75 which began on March 31, 2020. Interest was paid on each Interest Payment Date (as defined in the Old Credit Agreement) during each of the periods prior to the termination of the Old Credit Agreement. The Term B Facility contained customary mandatory payment provisions, and during the year ended September 30, 2022 and prior to the termination of the Old Credit Agreement, the Company repaid $81.4 on its Term B Facility as a mandatory prepayment from fiscal 2021 excess cash flow (as defined in the Old Credit Agreement), which was in addition to the scheduled amortization payments. During the year ended September 30, 2021, the Company repaid $28.8 on its Term B Facility as a mandatory prepayment from fiscal 2020 excess cash flow (as defined in the Old Credit Agreement), which was in addition to the scheduled amortization payments.\nDuring the year ended September 30, 2021, BellRing LLC borrowed $20.0 under the Old Revolving Credit Facility and repaid $50.0 under the Old Revolving Credit Facility. There were no borrowings under or repayments on the Old Revolving Credit Facility during the year ended September 30, 2022, prior to the facility being terminated.\nAs of September 30, 2023, expected principal payments on the Companys debt for the next five fiscal years were:\nFiscal 2024 $ -\nFiscal 2025 -\nFiscal 2026 -\nFiscal 2027 25.0\nFiscal 2028 -\nEstimated future interest payments on the Companys debt through fiscal 2028 are expected to be $303.2 (with $61.5 expected in fiscal 2024) based on the interest rates at September 30, 2023.\nNOTE 14 - COMMITMENTS AND CONTINGENCIES\nLegal Proceedings\nJoint Juice Litigation\nIn March 2013, a complaint was filed on behalf of a putative, nationwide class of consumers against Premier Nutrition in the U.S. District Court for the Northern District of California seeking monetary damages and injunctive relief. The case asserted that some of Premier Nutritions advertising claims regarding its Joint Juice line of glucosamine and chondroitin dietary supplement beverages, which it discontinued in the first quarter of fiscal 2023, were false and misleading. In April 2016, the district court certified a California-only class of consumers in this lawsuit (this lawsuit is hereinafter referred to as the California Federal Class Lawsuit).\nIn 2016 and 2017, the lead plaintiffs counsel in the California Federal Class Lawsuit filed ten additional class action complaints in the U.S. District Court for the Northern District of California on behalf of putative classes of consumers under the laws of Connecticut, Florida, Illinois, New Jersey, New Mexico, New York, Maryland, Massachusetts, Michigan and Pennsylvania (the Related Federal Actions). These complaints contain factual allegations similar to the California Federal Class Lawsuit, also seeking monetary damages and injunctive relief. The action on behalf of New Jersey consumers was voluntarily dismissed. Trial in the action on behalf of New York consumers was held beginning in May 2022, and the jury delivered its verdict in favor of plaintiff in June 2022. In August 2022, the Court entered a judgment in that case in favor of plaintiff in the amount of $12.9, which includes statutory damages and prejudgment interest. In October 2022, each plaintiff and Premier Nutrition filed Notices of Appeal to the Ninth Circuit, which appeals are pending. The other eight Related Federal Actions remain pending, and the court has certified individual state classes in each of those cases (except New Mexico).\nIn April 2018, the district court dismissed the California Federal Class Lawsuit with prejudice. This dismissal was upheld on appeal by the U.S. Court of Appeals for the Ninth Circuit in 2020, and plaintiffs petition for an en banc rehearing by the Ninth Circuit was denied.\nIn September 2020, the same lead counsel re-filed the California Federal Class Lawsuit against Premier Nutrition in California Superior Court for the County of Alameda, alleging identical claims and seeking restitution and injunctive relief on behalf of the same putative class of California consumers as the California Federal Class Lawsuit. Following the federal district courts denial of Premier Nutritions motion to permanently enjoin the Alameda action under the doctrine of res judicata, Premier Nutrition appealed to the Ninth Circuit, which affirmed the district court decision. In March 2023, the Alameda Superior Court granted in part and denied in part Premier Nutritions motion for judgment based on res judicata and in May 2023, the Court reaffirmed its ruling. In July 2023, Premier Nutrition filed a petition for writ of mandamus in the California Court of Appeal, which writ is pending. In July 2023, Plaintiff moved to certify the case as a class action, which remains pending. This case was previously set for trial in September 2023, together with Alameda County case set forth in the immediately succeeding paragraph, but the court separated them. Trial is anticipated in calendar year 2024.\nIn January 2019, the same lead counsel filed an additional class action complaint against Premier Nutrition in California Superior Court for the County of Alameda, alleging claims similar to the above actions and seeking monetary damages and injunctive relief on behalf of a putative class of California consumers, beginning after the California Federal Class Lawsuit class period. In July 2020, the court issued an order certifying a statewide class. Premier Nutrition moved for summary judgment on July 7, 2023, which motion remains pending. This case was set for trial in September 2023, but has been rescheduled to begin on December 15, 2023.\nThe Company continues to vigorously defend these cases and intends to appeal any adverse judgements and awards of damages. The Company does not believe that the ultimate resolution of these cases will have a material adverse effect on its consolidated financial condition, results of operations or cash flows.\nDuring the years ended September 30, 2023 and 2022, the Company expensed $5.0 and $7.5, respectively, related to the legal matter and plaintiff legal fees in connection with the Joint Juice litigation, which was included in Selling, general and administrative expenses on the Consolidated Statements of Operations. Other than legal fees, no expense related to this litigation was incurred during the year ended September 30, 2021. At September 30, 2023 and 2022, the Company had an estimated liability of $21.0 and $16.0, respectively, related to these matters that was included in Other current liabilities on the Consolidated Balance Sheets.\nProtein Products Class Litigation\nIn June 2023, a complaint was filed on behalf of a putative, nationwide class of consumers against the Company and Premier Nutrition in the U.S. District Court for the Northern District of California. The complaint alleges that Premier Nutrition engages in fraud and false advertising (via alleged affirmative representations and omissions) regarding its RTD protein shakes and protein powders by marketing the products as good sources of nutrition and protein when the products contain (or have a material risk of containing) high levels of undisclosed lead (this lawsuit is hereinafter referred to as the Protein Products Class\nLawsuit). Plaintiffs seek monetary remedies for economic injury (products are allegedly worth less than what was paid for them), as well as injunctive relief. The Protein Products Class Lawsuit alleges that high levels of lead pose serious safety risks, but does not allege that any plaintiff or putative class member suffered personal injuries and does not seek any remedies for personal injuries.\nThe Company filed its motion to dismiss this case in August 2023. The Court has set a hearing for December 1, 2023 on this motion. The Company intends to vigorously defend the case, including appealing any adverse judgement or award. The Company does not believe that the ultimate resolution of the Protein Products Class Lawsuit will have a material adverse effect on its consolidated financial condition, results of operations or cash flows.\nOther than legal fees, no expense related to the Protein Products Class Lawsuit was incurred during the years ended September 30, 2023, 2022 or 2021.\nCalifornia Proposition 65 Notice re Lead in Protein Products\nOn June 7, 2023, the Fitzgerald Joseph LLP law firm (the same firm that filed the Protein Products Class Litigation) issued a 60-Day Notice of Intent to Sue under Californias Safe Water and Toxic Enforcement Act (Proposition 65) for alleged violation of Proposition 65 with respect to lead levels in Premier Nutritions RTD protein shakes and protein powders (this matter is hereinafter referred to as the Protein Products Prop 65 Notice).\nPremier Nutrition intends to vigorously defend against the Protein Products Prop 65 Notice. The Company does not believe that the ultimate resolution of the Protein Products Prop 65 Notice will have a material adverse effect on its consolidated financial condition, results of operations or cash flows.\nOther than legal fees, no expense related to the Protein Products Prop 65 Notice was incurred during the years ended September 30, 2023, 2022 or 2021.\nOther\nIn the fourth quarter of fiscal 2022, a voluntary product recall was initiated by one of the Companys contract manufacturers which produces RTD shakes for Premier Nutrition. The recall covered the Companys products produced from December 8, 2021 through July 9, 2022 at one of the contract manufacturers facilities. The recall did not have a material impact on the Companys consolidated financial condition, results of operations or cash flow.\nThe Company is subject to various other legal proceedings and actions arising in the normal course of business. In the opinion of management, based upon the information presently known, the ultimate liability, if any, arising from such pending legal proceedings, as well as from asserted legal claims and known potential legal claims which are likely to be asserted, taking into account established accruals for estimated liabilities (if any), are not expected to be material individually or in the aggregate to the consolidated financial condition, results of operations or cash flows of the Company. In addition, although it is difficult to estimate the potential financial impact of actions regarding expenditures for compliance with regulatory matters, in the opinion of management, based upon the information currently available, the ultimate liability arising from such compliance matters is not expected to be material to the consolidated financial condition, results of operations or cash flows of the Company.\nNOTE 15 - STOCK-BASED COMPENSATION\nThe Companys employees participate in the BellRing Brands, Inc. Long-Term Incentive Plan (the BellRing Long-Term Incentive Plan). Awards issued under the BellRing Long-Term Incentive Plan have a maximum term of 10 years, provided, however, that the Corporate Governance and Compensation Committee of BellRings Board of Directors may, in its discretion, grant awards with a longer term to participants who are located outside of the U.S. At September 30, 2023 there were 1.4 million shares available to be issued for stock-based compensation awards under the BellRing Long-Term Incentive Plan.\nIn connection with the Spin-off and the related Merger, all outstanding unexercised and unexpired options to purchase shares of Old BellRing Class A Common Stock, outstanding restricted stock units with respect to shares of Old BellRing Class A Common Stock and other equity awards with respect to shares of Old BellRing Class A Common Stock outstanding under the BellRing Long-Term Incentive Plan (the Equity Awards), whether or not exercisable or vested, were assumed by BellRing based on the terms and subject to the conditions set forth in the Transaction Agreement. Additionally, the Board of Directors of BellRing approved adjustments to the terms of the outstanding Equity Awards to preserve the intrinsic value of the awards. The adjustments to the Equity Awards were based on the volume weighted average price of Old BellRing Class A Common Stock during the five trading day period prior to and including March 10, 2022 and the volume weighted average price of BellRing Common Stock during the five trading day period immediately following March 10, 2022. The Equity Award adjustments made in connection with the Spin-off had an immaterial impact on the Companys Consolidated Statements of Operations for the years ended September 30, 2023 and 2022.\nDuring the years ended September 30, 2023, 2022 and 2021, total compensation cost for BellRings non-cash stock-based compensation awards recognized was $14.2, $9.8 and $4.6, respectively, and the related recognized deferred tax benefit was $1.6, $1.2 and $0.3, respectively. See Note 7 for discussion related to income taxes. As of September 30, 2023, the total compensation cost related to BellRings non-vested awards not yet recognized was $19.5, which is expected to be recognized over a weighted-average period of 1.3 years.\nStock Options\nInformation about stock options is summarized in the following table.\nin millions, except options or where otherwise indicated Stock Options\nWeighted-\nAverage\nExercise\nPrice Per\nShare\nWeighted-\nAverage\nRemaining\nContractual\nTerm in Years Aggregate\nIntrinsic\nValue\nOutstanding at September 30, 2022 258,987 $ 17.74\nGranted - -\nExercised - -\nForfeited - -\nExpired - -\nOutstanding at September 30, 2023 258,987 17.74 6.80 $ 6.1\nVested and expected to vest as of September 30, 2023 258,987 17.74 6.80 6.1\nExercisable at September 30, 2023 195,562 17.67 6.69 4.6\nThe fair value of each stock option was estimated on the date of grant using the Black-Scholes Model. The Company used the simplified method for estimating a stock option term as it did not have sufficient historical stock options exercise experience upon which to estimate an expected term. The expected term is estimated based on the awards vesting period and contractual term. Expected volatilities are based on historical volatility trends and other factors. The risk-free rate is the interpolated U.S. Treasury rate for a term equal to the expected term. The weighted-average assumptions and fair values for stock options granted during the year ended September 30, 2021 are summarized in the table below. There were no stock options granted during the years ended September 30, 2023 or 2022.\nExpected term (in years) 6.5\nExpected stock price volatility 38.5%\nRisk-free interest rate 0.6%\nExpected dividends -%\nFair value (per option) $7.79\nThe total intrinsic value of stock options exercised was $0.1 in the year ended September 30, 2022, and the Company received proceeds from the exercise of stock options of $0.5 during the year ended September 30, 2022. There were no stock options exercised during the years ended September 30, 2023 or 2021.\nRestricted Stock Units (RSUs)\nInformation about RSUs is summarized in the following table.\nRSUs\nWeighted-\nAverage\nGrant Date Fair Value Per\nShare\nNonvested at September 30, 2022 579,969 $ 21.23\nGranted 207,224 26.10\nVested (302,887) 20.09\nForfeited (19,075) 23.13\nNonvested at September 30, 2023 465,231 24.06\nThe grant date fair value of each RSU was determined based upon the closing price of the Companys common stock on the date of grant. The weighted-average grant date fair value of nonvested RSUs was $24.06, $21.23 and $19.85 at September\n30, 2023, 2022 and 2021, respectively. The total vest date fair value of RSUs that vested during fiscal 2023, 2022 and 2021 was $7.8, $5.2 and $3.0, respectively.\nPerformance Restricted Stock Units (PRSUs)\nInformation about PRSUs is summarized in the following table.\nPRSUs\nWeighted-\nAverage\nGrant Date Fair Value Per\nShare\nNonvested at September 30, 2022 375,219 $ 41.44\nGranted 176,062 45.26\nVested - -\nForfeited - -\nNonvested at September 30, 2023 551,281 42.66\nDuring the years ended September 30, 2023 and 2022, the Company granted PRSUs to certain employees and directors. These awards will be earned by comparing BellRings total shareholder return (TSR) during a period of approximately three years to the respective TSRs of companies in a performance peer group. Based upon BellRings ranking in its performance peer group when comparing TSRs, a recipient of the PRSU grant may earn a total award ranging from 0% to 260% of the target award. The fair value of each PRSU was estimated on the grant date using a Monte Carlo simulation.\nThe weighted-average assumptions for PRSUs granted during the years ended September 30, 2023 and 2022 are summarized in the table below. There were no PRSUs granted during the year ended September 30, 2021.\n2023 2022\nExpected term (in years) 3.0 2.9\nExpected stock price volatility 46.8% 49.6%\nRisk-free interest rate 4.1% 2.3%\nExpected dividends -% -%\nFair value (per PRSU)\n$45.26 $42.33\nNOTE 16 - STOCKHOLDERS DEFICIT\nThe following table summarizes the Companys repurchases of BellRing Common Stock subsequent to the Spin-off.\nYear Ended September 30,\n2023 2022\nShares repurchased (in millions)\n4.2 1.1\nAverage price per share (a) $ 29.56 $ 23.17\nTotal share repurchase cost (b)\n$ 126.3 $ 24.7\n.\n(a)Average price per share excludes accrued excise tax and brokers commissions, which are included in Total share repurchase cost within this table.\n(b)Purchases of treasury stock in the Consolidated Statements of Cash Flows for the year ended September 30, 2023 excluded $0.8 of accrued excise tax that had not been paid as of September 30, 2023 and was included in Other current liabilities on the Consolidated Balance Sheets at September 30, 2023.\nThe following table summarizes the Companys repurchases of Old BellRing Class A Common Stock during the year ended September 30, 2022 prior to the Spin-off. There were no repurchases of Old BellRing Class A Common Stock by the Company during the year ended September 30, 2021.\nShares repurchased (in millions)\n0.8\nAverage price per share (a) $ 23.34\nTotal share repurchase costs $ 18.1\n(a)Average price per share excludes brokers commissions, which are included in Total share repurchase cost within this table.\nIn connection with the Spin-off, 0.8 million shares of Old BellRing Class A Common Stock held in treasury stock immediately prior to the Merger effective time were cancelled pursuant to the Transaction Agreement. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNot applicable. ITEM 9A. CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nOur management, with the Executive Chairman, Chief Executive Officer (CEO) and Chief Financial Officer (CFO) of the Company, has evaluated the effectiveness of our disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934, as amended (the Exchange Act)) as of September 30, 2023. Based on that evaluation, our Executive Chairman, CEO and CFO concluded that, as of September 30, 2023, the Company's disclosure controls and procedures were effective to provide reasonable assurance of achieving the desired control objectives.\nManagement's Report on Internal Control Over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting as such term is defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act. Our internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles.\nAs of September 30, 2023, management conducted an assessment of the effectiveness of the Companys internal control over financial reporting based upon the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in Internal Control - Integrated Framework (2013). Based on managements assessment utilizing these criteria, our management concluded that, as of September 30, 2023, our internal control over financial reporting was effective.\nThe effectiveness of our internal control over financial reporting as of September 30, 2023 has been audited by PricewaterhouseCoopers LLP, an independent registered public accounting firm, as stated in its report, which appears herein.\nChanges in Internal Control Over Financial Reporting\nBased on managements evaluation, there were no changes in our internal control over financial reporting that occurred during the quarter ended September 30, 2023 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. ITEM 9B. OTHER INFORMATION\nRule 10b5-1 and Non-Rule 10b5-1 Trading Arrangements\nDuring the three months ended September 30, 2023, no director or officer, as defined in Rule 16a-1(f) under the Securities Exchange Act of 1934, as amended, of the Company adopted or terminated a Rule 10b5-1 trading arrangement or non-Rule 10b5-1 trading arrangement, as each term is defined in Item 408 of Regulation S-K.\nFonterra (USA) Inc. Agreements\nPremier Nutrition Company, LLC (Premier Nutrition), a subsidiary of the Company, executed a master purchase commitment (Master Purchase Commitment), effective as of July 1, 2023, with Fonterra (USA) Inc. (Fonterra), pursuant to an Amended and Restated Master Supply Agreement between Premier Nutrition and Fonterra dated as of July 1, 2023 (Master Supply Agreement).\nUnder the Master Purchase Commitment, Fonterra will supply milk protein concentrate (Product) to Premier Nutrition, and Premier Nutrition is required to purchase, pursuant to purchase orders, a minimum amount of Product every six months. Premier Nutrition has the right (but not the obligation) to order quantities in excess of such amount on a spot basis as agreed by the parties, and the Master Purchase Commitment also contains provisions describing the determination of the prices for the Product. The Master Supply Agreement contains provisions regarding the product specifications and quality standards for the Product, the rights of a party in the event the other party does not comply with its obligations under the Master Supply Agreement or the Master Purchase Commitment (or other purchase orders between the parties) and other customary contractual terms and conditions.\nThe Master Purchase Commitment runs for an initial term of five years, with subsequent renewals for periods of a minimum of two years upon the mutual agreement of the parties at least twelve months in advance of the expiration of the then-current term. The Master Supply Agreement runs for an initial term of five years and will automatically renew for additional periods of five years unless a party determines not to renew upon at least twelve months prior notice.\nThe foregoing description of the Master Supply Agreement and Master Purchase Commitment does not purport to be complete and is qualified in its entirety by reference to such agreements, which are included as Exhibit 10.21 and Exhibit 10.22, respectively, to this Annual Report. Certain portions of these documents that constitute confidential information have been redacted in accordance with Regulation S-K, Item 601(b)(10)\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nInformation under the headings Election of Directors, Corporate Governance - Board Meetings and Committees, Corporate Governance - Nomination Process for Election of Directors, and Security Ownership of Certain Stockholders - Delinquent Section 16(a) Reports in our Proxy Statement for the 2024 Annual Meeting of Stockholders to be filed with the Securities and Exchange Commission within 120 days of the year ended September 30, 2023 (the 2024 Proxy Statement) is hereby incorporated by reference.\nInformation regarding executive officers of the Company is included in the Information about our Executive Officers section under Business in Item 1 of this report.\nThe Company has adopted a code of ethics, our Code of Conduct, applicable to our directors, officers and employees, which sets forth the Companys expectations for the conduct of business by our directors, officers and employees. The Code of Conduct is available on the Companys website at www.bellring.com. In the event the Company amends the Code of Conduct or waivers of compliance are granted and it is determined that such amendments or waivers are subject to the disclosure provisions of Item 5.05 of Form 8-K, the Company will post such amendments or waivers on its website or in a report on Form 8-K. ITEM 11. EXECUTIVE COMPENSATION\nThe information required by this Item, appearing under the headings Compensation of Officers and Directors, Compensation Committee Interlocks and Insider Participation and Corporate Governance and Compensation Committee Report in the 2024 Proxy Statement, is hereby incorporated by reference. The information contained in Corporate Governance and Compensation Committee Report in the 2024 Proxy Statement shall not be deemed to be filed with the Securities and Exchange Commission or subject to the liabilities of the Securities Exchange Act of 1934, as amended (the Exchange Act), except to the extent that the Company specifically incorporates such information into a document filed under the Securities Act of 1933, as amended, or the Exchange Act. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe information required by this Item, appearing under the headings Security Ownership of Certain Stockholders and Compensation of Officers and Directors - Equity Compensation Plan Information in the 2024 Proxy Statement, is hereby incorporated by reference. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThe information required by this Item, appearing under the headings Certain Relationships and Related Transactions and Corporate Governance - Director Independence and Role of the Independent Lead Director in the 2024 Proxy Statement, is hereby incorporated by reference. ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nThe information required by this Item, appearing under the heading Ratification of Appointment of Independent Registered Public Accounting Firm in the 2024 Proxy Statement, is hereby incorporated by reference.\nPART IV ITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\nDocuments filed as a part of this report:\n1.Financial Statements. The following are filed as a part of this document under Item 8.\nReport of Independent Registered Public Accounting Firm\nConsolidated Statements of Operations for the years ended September 30, 2023, 2022 and 2021\nConsolidated Statements of Comprehensive Income for the years ended September 30, 2023, 2022 and 2021\nConsolidated Balance Sheets at September 30, 2023 and 2022\nConsolidated Statements of Cash Flows for the years ended September 30, 2023, 2022 and 2021\nConsolidated Statements of Stockholders Deficit for the years ended September 30, 2023, 2022 and 2021\nNotes to Consolidated Financial Statements\n2.Financial Statement Schedules. None. Schedules not included have been omitted because they are not applicable or not material or the required information is shown in the financial statements or notes thereto.\n3.Exhibits. See the following Exhibit Index.\nExhibit No Description\n*2.1 Transaction Agreement and Plan of Merger, dated as of October 26, 2021, by and among Post Holdings, Inc., BellRing Brands, Inc., BellRing Distribution, LLC and BellRing Merger Sub Corporation (Incorporated by reference to Exhibit 2.1 to the Companys Form 8-K filed on October 27, 2021)\n2.2 Amendment No. 1 to Transaction Agreement and Plan of Merger, dated as of February 28, 2022, by and among Post Holdings, Inc., BellRing Brands, Inc., BellRing Distribution, LLC and BellRing Merger Sub Corporation (Incorporated by reference to Exhibit 2.1 to the Companys Form 8-K filed on February 28, 2022)\n3.1 BellRing Brands, Inc. Certificate of Incorporation (Incorporated by reference to Exhibit 3.1 to the Companys Second Form 8-K filed on March 10, 2022)\n3.2 BellRing Brands, Inc. Bylaws (Incorporated by reference to Exhibit 3.2 to the Companys Second Form 8-K filed on March 10, 2022)\n*4.1 Indenture, dated March 10, 2022, by and among BellRing Brands, Inc. (formerly BellRing Distribution, LLC) and Computershare Trust Company, N.A., as trustee (Incorporated by reference to Exhibit 4.1 to the Companys Second Form 8-K filed on March 10, 2022)\n4.2 Form of Note (Incorporated by reference to Exhibit A to Exhibit 4.1 to the Companys Second Form 8-K filed on March 10, 2022)\n4.3 Description of Companys Registered Securities\n10.1 Amended BellRing Brands, Inc. 2019 Long-Term Incentive Plan (Incorporated by referenced to Exhibit 10.1 to the Companys Form 10-Q filed on February 7, 2023)\n10.2 Form of Omnibus Amendment to Restricted Stock Unit Agreement (Incorporated by referenced to Exhibit 10.2 to the Companys Form 10-Q filed on May 6, 2022)\n10.3 Form of Omnibus Amendment to Performance Restricted Stock Unit Agreement (Incorporated by referenced to Exhibit 10.3 to the Companys Form 10-Q filed on May 6, 2022)\n10.4 Form of Omnibus Amendment to Non-Qualified Stock Option Agreement (Incorporated by referenced to Exhibit 10.4 to the Companys Form 10-Q filed on May 6, 2022)\n10.5 Form of BellRing Brands, Inc. Executive Chairman Restricted Stock Unit Agreement (Incorporated by referenced to Exhibit 10.5 to the Companys Form 10-Q filed on May 6, 2022)\n10.6 Form of BellRing Brands, Inc. Executive Chairman Performance Restricted Stock Unit Agreement (Incorporated by referenced to Exhibit 10.6 to the Companys Form 10-Q filed on May 6, 2022)\n10.7 Amended and Restated Lock-Up Agreement, dated as of May 5, 2022, by and between BellRing Brands, Inc. and Robert V. Vitale (Incorporated by referenced to Exhibit 10.7 to the Companys Form 10-Q filed on May 6, 2022)\n10.8\nAmended BellRing Brands, Inc. Deferred Compensation Plan For Directors (Incorporated by referenced to Exhibit 10.8 to the Companys Form 10-Q filed on May 6, 2022)\n10.9 Form of Severance and Change in Control Agreement (Incorporated by referenced to Exhibit 10.9 to the Companys Form 10-Q filed on May 6, 2022)\n10.10 Form of Indemnification Agreement\n10.11 BellRing Brands, Inc. Senior Management Bonus Program (Incorporated by reference to Exhibit 10.1 to the Companys Form 8-K filed on November 22, 2019)\n10.12 Form of Non-Qualified Stock Option Agreement (Incorporated by reference to Exhibit 10.3 to the Companys Form 8-K filed on November 22, 2019)\n10.13 Form of Director Restricted Stock Unit Agreement (Incorporated by reference to Exhibit 10.4 to the Companys Form 8-K filed on November 22, 2019)\n*10.14 Amended and Restated Master Services Agreement, dated March 10, 2022, by and among Post Holdings, Inc., BellRing Intermediate Holdings, Inc., BellRing Brands, Inc. and BellRing Brands, LLC (Incorporated by reference to Exhibit 10.1 to the Companys Second Form 8-K filed on March 10, 2022)\n*10.15\nAmendment to Amended and Restated Master Services Agreement, dated August 4, 2023, by and among Post Holdings, Inc., BellRing Intermediate Holdings, Inc., BellRing Brands, Inc. and BellRing Brands, LLC (Incorporated by reference to Exhibit 10.23 to the Companys Form 10-Q filed on August 8, 2023)\nExhibit No Description\n10.16\nRegistration Rights Agreement, dated March 10, 2022, by and among BellRing Brands, Inc. (formerly known as BellRing Distribution, LLC), Post Holdings, Inc. and the other stockholders party thereto from time to time (Incorporated by reference to Exhibit 10.2 to the Companys Second Form 8-K filed on March 10, 2022)\n*10.17\nAmended and Restated Employee Matters Agreement, dated March 10, 2022, by and among Post Holdings, Inc., BellRing Intermediate Holdings, Inc. (formerly known as BellRing Brands, Inc.), BellRing Brands, LLC and BellRing Brands, Inc. (formerly known as BellRing Distribution, LLC) (Incorporated by reference to Exhibit 10.3 to the Companys Second Form 8-K filed on March 10, 2022)\n*10.18\nTax Matters Agreement, dated March 10, 2022, by and among BellRing Brands, Inc., Post Holdings, Inc. and BellRing Intermediate Holdings, Inc. (Incorporated by reference to Exhibit 10.4 to the Companys Second Form 8-K filed on March 10, 2022)\n10.19\nTax Receivable Agreement, dated October 21, 2019, by and among BellRing Brands, Inc., BellRing Brands, LLC and Post Holdings, Inc. (Incorporated by reference to Exhibit 10.5 to the Companys Form 8-K filed on October 21, 2019)\n*10.20\nCredit Agreement, dated March 10, 2022, by and among BellRing Brands, Inc., JPMorgan Chase Bank, N.A., as administrative agent and collateral agent, and each lender from time to time party thereto (Incorporated by reference to Exhibit 10.5 to the Companys Second Form 8-K filed on March 10, 2022)\n‡10.21\nAmended and Restated Master Supply Agreement, dated as of July 1, 2023, by and between Premier Nutrition Company, LLC and Fonterra (USA) Inc. (Incorporated by reference to Exhibit 10.24 to the Companys Form 10-Q filed on August 8, 2023)\n‡10.22\nMPC Purchase Commitment, dated as of July 1, 2023 by and between Premier Nutrition Company, LLC and Fonterra (USA) Inc. (Incorporated by reference to Exhibit 10.25 to the Companys Form 10-Q filed on August 8, 2023)\n‡10.23\nStremick Heritage Foods, LLC, Jasper Products, LLC and Premier Nutrition Company Manufacturing Agreement, dated as of December 14, 2022 (Incorporated by reference to Exhibit 10.22 to the Companys Form 10-Q filed on February 7, 2023)\n21.1 Subsidiaries of BellRing Brands, Inc.\n23.1 Consent of PricewaterhouseCoopers LLP\n24.1 Power of Attorney (Included under Signatures)\n31.1\nCertification of Darcy H. Davenport pursuant to Rule 13a-14(a), as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002, dated November 21, 2023\n31.2\nCertification of Paul A. Rode pursuant to Rule 13a-14(a), as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002, dated November 21, 2023\n32.1 Certification of Darcy H. Davenport and Paul A. Rode, pursuant to 18 U.S.C. Section 1350 as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002, dated November 21, 2023\n101 Interactive Data File (Form 10-K for the year ended September 30, 2023 filed in iXBRL (Inline eXtensible Business Reporting Language)). The financial information contained in the iXBRL-related documents is unaudited and unreviewed.\n104 The cover page from the Companys Form 10-K for the year ended September 30, 2023, formatted in iXBRL (Inline eXtensible Business Reporting Language) and contained in Exhibit 101\n* Exhibits and schedules have been omitted pursuant to Item 601(b)(2) of Regulation S-K. The Company agrees to furnish supplementally to the Securities and Exchange Commission (the SEC) a copy of any omitted exhibit or schedule upon request by the SEC.\nThese exhibits constitute management contracts, compensatory plans and arrangements.\n‡ Certain portions of this document that constitute confidential information have been redacted in accordance with Regulation S-K, Item 601(b)(10).\nITEM 16. FORM 10-K SUMMARY\nNone.\nSIGNATURES\nPursuant to the requirements of the Securities Exchange Act of 1934, as amended, BellRing Brands, Inc. has duly caused this report to be signed on its behalf by the undersigned thereunto duly authorized.\nBELLRING BRANDS, INC.\nDate: November 21, 2023 By: /s/ Darcy H. Davenport\nDarcy H. Davenport\nPresident and Chief Executive Officer\nKNOW ALL PERSONS BY THESE PRESENTS, that each person whose signature appears below constitutes and appoints Paul A. Rode and Craig L. Rosenthal, and each of them, as his or her true and lawful attorney-in-fact and agent, with full power of substitution and resubstitution, for him or her and in his or her name, place, and stead, in any and all capacities, to sign any and all amendments to this report, and to file the same, with all exhibits thereto, and other documents in connection therewith, with the Securities and Exchange Commission, granting unto said attorneys-in-fact and agents full power and authority to do and perform each and every act and thing requisite and necessary to be done in and about the premises, as fully to all intents and purposes as he or she might or could do in person, hereby ratifying and confirming all that said attorneys-in-fact and agents or their substitute or substitutes may lawfully do or cause to be done by virtue hereof.\nPursuant to the requirements of the Securities Exchange Act of 1934, as amended, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature Title Date\n/s/ Darcy H. Davenport President and Chief Executive Officer and Director\n(Principal Executive Officer)\nNovember 21, 2023\nDarcy H. Davenport\n/s/ Paul A. Rode Chief Financial Officer and Treasurer\n(Principal Financial and Accounting Officer) November 21, 2023\nPaul A. Rode\n/s/ Robert V. Vitale Executive Chairman of the Board of Directors\nNovember 21, 2023\nRobert V. Vitale\n/s/ Shawn W. Conway\nDirector November 21, 2023\nShawn W. Conway\n/s/ Thomas P. Erickson Director November 21, 2023\nThomas P. Erickson\n/s/ Jennifer Kuperman Johnson Director November 21, 2023\nJennifer Kuperman Johnson\n/s/ Chonda J. Nwamu Director November 21, 2023\nChonda J. Nwamu\n/s/ Elliot H. Stein, Jr. Director November 21, 2023\nElliot H. Stein, Jr."
}