{
    "cik": "1772177",
    "company": "KURA SUSHI USA, INC.",
    "filing_type": "10-K",
    "filing_date": "2023-11-09",
    "period_of_report": "2023-08-31",
    "sic": "5812",
    "state_of_inc": "DE",
    "state_location": "CA",
    "fiscal_year_end": "0831",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1772177/0000950170-23-061336-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1772177/000095017023061336/krus-20230831.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1772177/0000950170-23-061336.txt",
    "filename": "1772177_10K_2023_0000950170-23-061336.htm",
    "content": "Item 1. Business\nCompany Overview\nKura Sushi USA, Inc. (Kura Sushi) is a technology-enabled Japanese restaurant concept that provides guests with a distinctive dining experience by serving authentic Japanese cuisine through an engaging revolving sushi service model, which we refer to as the Kura Experience. We encourage healthy lifestyles by serving freshly prepared Japanese cuisine using high-quality ingredients that are free from artificial seasonings, sweeteners, colorings, and preservatives. We aim to make quality Japanese cuisine accessible to our guests across the United States through affordable prices and an inviting atmosphere.\nKura Sushi is headquartered in Irvine, California and was established in 2008 as a subsidiary of Kura Sushi, Inc. (Kura Japan), a Japan-based revolving sushi chain with over 500 restaurants and 40 years of brand history. Kura Sushi opened its first restaurant in Irvine, California in 2009, and currently operates 54 restaurants across fifteen states and Washington, DC.\nKura Japan owns 4,126,500 shares of our Class A common stock and all of our 1,000,050 Class B common stock. Kura Japans combined ownership of Class A common stock and Class B common stock represents 70% of the combined voting power of our equity interests. As a result, we are a controlled company within the meaning of the corporate governance rules of the Nasdaq Stock Market, and Kura Japan can exert significant voting influence over fundamental and significant corporate matters and transactions and may have interests that differ from yours. See Item 1A. Risk Factors\nSummary Risk Factors\nOur Company is subject to several risks that if realized could materially affect our business, prospects, financial condition, results of operations, cash flows and access to liquidity. Our business is subject to uncertainties and risks including:\nInflationary Conditions. We have experienced and continue to experience inflationary conditions with respect to the cost for food, ingredients, labor, construction and utilities, and may not be able to increase prices or implement operational improvements sufficient to fully offset inflationary pressures on such costs, which may adversely impact our revenues and results of operations.\nAbility to Execute Our Growth Strategy and Grow Sales and Profitability of Our Restaurants. Our long-term success is highly dependent on our ability to successfully implement our growth strategy and to grow sales and profitability of our restaurants, which is subject to various risks including whether we may be able to identify and secure appropriate sites and timely develop and expand our operations in existing and new markets.\nGeographical Concentration. Our restaurants are concentrated in California and Texas and in retail centers and shopping malls and could be negatively affected by conditions specific to these states and locations.\nReliance on Kura Japan. We rely on our majority stockholder, Kura Japan, in strategic, operational and financial respects. Such reliance could subject us to risks including difficulty replacing certain services, supplies and financial assistance provided by Kura Japan.\nReliance on Certain Vendors and Suppliers. We rely significantly on certain vendors and suppliers. Their failure to provide deliveries or services at the quantity, quality or cost level acceptable to us could harm our business, financial position and results of operations.\nCompetition. We face significant competition from a variety of restaurants offering both Asian and non-Asian cuisine, as well as takeout offerings from grocery stores and other outlets where Asian food is sold.\nChanges in Macro Economic and Societal Conditions. As ours is a consumer-based business, certain changes in macroeconomic and societal conditions including an economic slowdown, changing consumer preferences, food safety and foodborne illness concerns as well as outbreaks of flu, viruses or other diseases transmitted by human contact could adversely affect our business, financial position and results of operations.\nUse of Technologies. We use revolving and express conveyor belts, other automated equipment and other technologies including information technology in our operations. Failure of such technologies could prevent us from effectively operating our business.\nMarketing and Public Relations. Our business depends on customer goodwill. If we fail to conduct successful marketing programs and effectively manage our public image, our business will suffer.\nLease Management. We are subject to all of the risks associated with leasing space subject to long-term non-cancelable leases.\nCapital Needs. We may need capital in the future, and we may not be able to raise that capital on favorable terms.\nHuman Capital Management. We depend on our senior management team and other key employees. In addition, we need to recruit and retain sufficient qualified employees for our restaurants at reasonable costs. Loss of management members and key employees, labor shortages, increased labor costs,\nunionization activities or labor disputes could adversely affect our business, financial position and results of operations.\nCompliance with Laws and Regulations. Our business is subject to a myriad of laws and regulations at the federal, state, and local levels, including requirements to obtain certain licenses and permits. Our failure to comply with applicable laws could harm our reputation and business and changes in current laws could significantly increase our operational costs.\nLitigation. We could be party to litigation that could adversely affect us by distracting management, increasing our expenses or subjecting us to material money damages and other remedies. Our current insurance may not provide adequate levels of coverage against claims.\nLoss Carryforwards. Our ability to use our net operating loss carryforwards and certain other tax attributes to offset U.S. federal and state taxable income may be subject to limitations.\nYour ownership of our Class A common stock is subject to risks including:\nDual-Class Stock Structure. The disparate voting rights of our Class A common stock and our Class B common stock could adversely affect the value and liquidity of our Class A common stock.\nOur Quarterly Operating Results and Broad Market Fluctuations. Our quarterly operating results may fluctuate significantly and other factors outside our control may cause broad fluctuations in the stock market, which could cause the market price of our common stock to fluctuate.\nFuture Sales of Our Class A Common Stock. Future sales of our common stock, or the perception that such sales may occur, could depress our common stock price.\nDividend Policy. We do not intend to pay dividends for the foreseeable future, which could reduce your chance of receiving any return on an investment in our common stock.\nCertain Provisions in Our Charter Documents. Our charter documents contain certain provisions which make it more difficult for a third party to acquire control of us without Board approval and for a stockholder to bring claims in a judicial forum that it finds favorable for disputes with us.\nOur Status Being an Emerging Growth Company. We are an emerging growth company, and we cannot be certain if the reduced reporting and disclosure requirements applicable to emerging growth companies will make our common stock less attractive to investors.\nYour interest as an investor in our Company is also subject to risks relating to our organizational structure including:\nOur Status Being a Controlled Company. As a controlled company, we may rely on exemptions from certain corporate governance requirements required under the Nasdaq listing standards and you will not have the same protections afforded to stockholders of companies that are subject to such requirements.\nPotential Conflicts of Interest. We are controlled by Kura Japan whose interests may conflict with ours or yours. Future sales of our shares by Kura Japan could also depress our Class A common stock price.\nRisk Factors\nThe following are the material risk factors that affect our Company and our stock price. Any one or more of these could have a material adverse impact on our business, prospects, financial condition, results of operations, or cash flows, in addition to presenting other possible adverse consequences, many of which are described below.\nThese risk factors and other risks we may face are also discussed further in other sections of this Annual Report on Form 10-K.\nRisks Related to Our Operations and Growth Strategy\nWe have experienced and continue to experience inflationary conditions with respect to the cost for food, ingredients, labor, construction and utilities, and we may not be able to increase prices or implement operational improvements sufficient to fully offset inflationary pressures on such costs, which may adversely impact our revenues and results of operations.\nThe strength of our revenues and results of operations are dependent upon, among other things, the price and availability of food, ingredients, labor, construction and utilities. In fiscal year 2021, 2022 and 2023, the costs of commodities, labor, energy and other inputs necessary to operate our restaurants significantly increased. Fluctuations in economic conditions, weather, demand and other factors also affect the cost of the ingredients and products that we buy. Our inability to anticipate and respond effectively to one or more adverse changes in any of these factors could have a significant adverse effect on our results of operations. We expect the inflationary pressures and other fluctuations impacting the cost of these items to continue to impact our business in fiscal year 2024. Our attempts to offset cost pressures, such as through menu price increases and operational improvements, may not be successful. We seek to provide a moderately priced product, and, as a result, we may not seek to or be able to pass along price increases to our customers sufficient to completely offset cost increases. Traffic may also be negatively impacted with menu price increases as consumers may be less willing to pay our menu prices and may increasingly visit lower-priced competitors, may reduce the frequency of their visits, or may forgo some purchases altogether. To the extent that price increases are not sufficient to offset higher costs adequately or in a timely manner, and/or if they result in significant decreases in revenue volume, our revenues and results of operations may be adversely affected.\nOur long-term success is highly dependent on our ability to successfully identify and secure appropriate sites and timely develop and expand our operations in existing and new markets.\nOne of the key means of achieving our growth strategies will be through opening and operating new restaurants on a profitable basis for the foreseeable future. We identify target markets where we can enter or expand, taking into account numerous factors such as the locations of our current restaurants, demographics, traffic patterns and information gathered from various sources. We may not be able to open our planned new restaurants within budget or on a timely basis, if at all, given the uncertainty of these factors, which could adversely affect our business, financial condition and results of operations. As we operate more restaurants, our rate of expansion relative to the size of our restaurant base will eventually decline.\nThe number and timing of new restaurants opened during any given period may be negatively impacted by a number of factors including, without limitation:\nidentification and availability of locations with the appropriate size, traffic patterns, local retail and business attractions and infrastructure that will drive high levels of guest traffic and sales per unit;\ncompetition in existing and new markets, including competition for restaurant sites;\nthe ability to negotiate suitable lease terms;\nthe lack of development and overall decrease in commercial real estate due to a macroeconomic downturn;\nrecruitment and training of qualified personnel in the local market;\nour ability to obtain all required governmental permits, including zoning approvals, on a timely basis;\nour ability to control construction and development costs of new restaurants;\nlandlord delays;\nthe proximity of potential sites to an existing restaurant, and the impact of cannibalization on future growth;\nanticipated commercial, residential and infrastructure development near our new restaurants; and\nthe cost and availability of capital to fund construction costs and pre-opening costs.\nAccordingly, we cannot assure you that we will be able to successfully expand as we may not correctly analyze the suitability of a location or anticipate all of the challenges imposed by expanding our operations. Our growth strategy, and the substantial investment associated with the development of each new restaurant, may cause our operating results to fluctuate and be unpredictable or adversely affect our business, financial condition or results of operations. If we are unable to expand in existing markets or penetrate new markets, our ability to increase our sales and profitability may be materially harmed or we may face losses.\nOur expansion into new markets may present increased risks due in part to our unfamiliarity with the areas and also due to consumer unfamiliarity with our revolving sushi bar concept and may make our future results unpredictable and the increases in average restaurant sales and comparable restaurant sales that we have experienced in the past may not be indicative of future results.\nWe may in the future open restaurants in markets where we have little or no operating experience. This growth strategy and the substantial investment associated with the development of each new restaurant may cause our operating results to fluctuate and be unpredictable or adversely affect our business, financial condition or results of operations. Restaurants we open in new markets may take longer to reach expected sales and profit levels on a consistent basis and may have higher construction, occupancy or operating costs than restaurants we open in existing markets, thereby affecting our overall profitability. New markets may have competitive conditions, consumer tastes and discretionary spending patterns that are more difficult to predict or satisfy than our existing markets. We may need to make greater investments than we originally planned in advertising and promotional activity in new markets to build brand awareness. We also may find it more difficult in new markets to hire, motivate and keep qualified employees who share our vision, passion and business culture. If we do not successfully execute our plans to enter new markets, our business, financial condition or results of operations could be materially adversely affected.\nOur new restaurants have historically opened with above-average volumes, which then decline after the initial sales surge that comes with interest in a new restaurant opening. New restaurants may not be profitable and their sales performance may not follow historical patterns as expected, which could adversely affect our business, financial condition or results of operations. In addition, our average restaurant sales and comparable restaurant sales may not increase at the rates achieved over the past several years. Our ability to operate new restaurants profitably and increase average restaurant sales and comparable restaurant sales will depend on many factors, some of which are beyond our control, including: consumer awareness and understanding of our brand and our revolving sushi bar concept; general economic conditions, which can affect restaurant traffic, local labor costs and prices we pay for the food products and other supplies we use; changes in consumer preferences and discretionary spending; competition, either from our competitors in the restaurant industry or our own restaurants; temporary and permanent site characteristics of new restaurants; and changes in government regulation.\nOpening new restaurants in existing markets may negatively affect sales at our existing restaurants.\nThe opening of a new restaurant in or near markets in which we already have restaurants could adversely affect the sales of these existing restaurants. Existing restaurants could also make it more difficult to build our consumer base for a new restaurant in the same market. Our core business strategy does not entail opening new restaurants that we believe will materially affect sales at our existing restaurants, but we may selectively open new restaurants in and around areas of existing restaurants that are operating at or near capacity to effectively serve our guests. Sales cannibalization between our restaurants may become significant in the future as we continue to expand our operations and could affect our sales growth, which could, in turn, materially adversely affect our business, financial condition or results of operations.\nOur sales and profit growth could be adversely affected if comparable restaurant sales are less than we expect.\nThe level of comparable restaurant sales growth, which represents the change in year-over-year sales for restaurants open for at least 18 months, could affect our sales growth. Our ability to increase comparable restaurant sales depends in part on our ability to successfully implement our initiatives to build sales. It is possible such initiatives will not be successful, that we will not achieve our target comparable restaurant sales growth or that the change in comparable restaurant sales could be negative, which may cause a decrease in our profitability and would\nmaterially adversely affect our business, financial condition or results of operations. See Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations-Comparable Restaurant Sales Growth.\nOur failure to manage our growth effectively could harm our business and operating results.\nOur growth plan includes opening new restaurants. Our existing restaurant management systems, financial and management controls and information systems may be inadequate to support our planned expansion. Managing our growth effectively will require us to continue to enhance these systems, procedures and controls and to hire, train and retain managers and team members. We may not respond quickly enough to the changing demands that our expansion will impose on our management, restaurant teams and existing infrastructure, which could harm our business, financial condition or results of operations.\nOur limited number of restaurants, the significant expense associated with opening new restaurants, and the unit volumes of our new restaurants makes us susceptible to significant fluctuations in our results of operations.\nThe capital resources required to develop each new restaurant are significant. On average, our restaurants opened during fiscal year 2023 required a cash build-out cost of approximately $2.56 million per restaurant, net of landlord tenant improvement allowances and assuming that we do not purchase the underlying real estate. Actual costs may vary significantly depending upon a variety of factors, including the site and size of the restaurant and conditions in the local real estate and labor markets. The combination of our relatively small number of existing restaurants, the significant investment associated with each new restaurant, variance in the operating results in any one restaurant, or a delay or cancellation in the planned opening of a restaurant could materially affect our business, financial condition or results of operations.\nOur restaurant base is geographically concentrated in California and Texas, and we could be negatively affected by conditions specific to these states.\nApproximately 54% of our restaurants are located in California and Texas. Adverse changes in demographic, unemployment, economic, regulatory or weather conditions in California and Texas have had, and may continue to have, material adverse effects on our business, financial condition or results of operations. As a result of our concentration in these markets, we have been, and in the future may be, disproportionately affected by adverse conditions in either of these markets compared to other chain restaurants with a broader national footprint.\nA decline in visitors to any of the retail centers, shopping malls, lifestyle centers, or entertainment centers where our restaurants are located could negatively affect our restaurant sales.\nOur restaurants are primarily located in high-activity areas such as retail centers, shopping malls, lifestyle centers, and entertainment centers. We depend on high visitor rates at these centers to attract guests to our restaurants. Factors that may result in declining visitor rates include public health pandemics, economic or political conditions, anchor tenants closing in retail centers or shopping malls in which we operate, changes in consumer preferences or shopping patterns, changes in discretionary consumer spending, increasing petroleum prices, or other factors, which may adversely affect our business, financial condition or results of operations.\nRisks Related to Our Relationships with Kura Japan and Other Key Suppliers\nWe have historically received strategic, operational and financial support from Kura Japan, and as we increase our independence from Kura Japan, we may face difficulties replacing certain services, supplies and financial assistance Kura Japan has provided to us.\nWe have been a subsidiary of Kura Japan since 2008 and have benefited from our relationship as a consolidated and wholly-owned subsidiary. We are a majority owned subsidiary of Kura Japan and we utilize Kura Japan for certain strategic, operational and financial support. Our future results depend on various factors, including those identified in these risk factors.\nKura Japan provides us from time to time with employees from its operations in Japan to assist us with meeting our workforce requirements and opening new restaurants. We also benefit from the intellectual property that we license from Kura Japan in the operation of our business. Future sales of our shares by Kura Japan could depress our Class A common stock price. If Kura Japans ownership interest in our company declines significantly in the future, this may affect our ongoing relationship. We have a shared services agreement and an amended and restated exclusive license agreement with Kura Japan, which memorialize our existing business relationship. Although we expect Kura Japan to continue providing services to us, Kura Japan does not have any contractual obligation to provide strategic, operational or other support to us except as required under our shared services agreement and amended and restated exclusive license agreement with them. See Note 5 - Related Party Transactions to our audited financial statements included in Item 8. Financial Statements and Supplementary Data in this Annual Report on Form 10-K for additional information.\nFrom time to time, we purchase certain supplies, parts and equipment for use in our restaurants from Kura Japan. We believe that Kura Japan obtains these supplies, parts and equipment at a discounted price due to Kura Japans higher purchasing power with suppliers. If Kura Japans ownership interest in our company declines significantly in the future, this may also affect their provision of supplies, parts and equipment to us. Kura Japan has no contractual obligation to continue providing us with such supplies, parts and equipment except as required under our shared services agreement with them. See Note 5 - Related Party Transactions to our audited financial statements included in Item 8. Financial Statements and Supplementary Data in this Annual Report on Form 10-K for additional information.\nOur indebtedness to Kura Japan may limit our ability to be acquired by a third party or acquire a third party.\nOur Revolving Credit Agreement (Credit Facility) with Kura Japan dated April 10, 2020 and amended on September 2, 2020 and April 9, 2021, provides for a $45.0 million revolving credit line. As of August 31, 2023 and 2022, we had no outstanding balance and $45.0 million available under our Credit Facility, respectively. In the future, we may, from time to time, incur additional indebtedness under our Credit Facility. Our Credit Facility places certain limitations on, among other items, our ability to merge or consolidate with or into or acquire any other business organization or sell substantially all of our assets. Failure to comply with certain covenants could result in the acceleration of our obligations under the Credit Facility, which would have an adverse effect on our liquidity, capital resources and results of operations.\nAny events or circumstances that result in the termination or limitation of our rights under our agreement between us and Kura Japan of our intellectual property could have a material adverse effect on our business, financial condition or results of operations.\nThe intellectual property that is critical to our business has been licensed to us by Kura Japan. Any termination or limitation of, or loss of exclusivity under, our exclusive license agreement with Kura Japan would have a material adverse effect on our business, financial condition or results of operations. We have entered into an amended and restated exclusive license agreement with regard to the intellectual property we license from Kura Japan. See Note 5 - Related Party Transactions to our audited financial statements included in Item 8. Financial Statements and Supplementary Data in this Annual Report on Form 10-K for additional information.\nWe may become involved in lawsuits involving Kura Japan as the owner of intellectual property, or us as a licensee of intellectual property from Kura Japan, to protect or enforce intellectual property rights, which could be expensive, time consuming, and unsuccessful.\nThird parties may sue Kura Japan or us for alleged infringement of their proprietary rights. The party claiming infringement might have greater resources than we do to pursue its claims, and we could be forced to incur substantial costs and devote significant management resources to defend against such litigation, even if the claims are meritless and even if we ultimately prevail. If the party claiming infringement were to prevail, we could be forced to pay significant damages, or enter into expensive royalty or licensing arrangements with the prevailing party. In addition, any payments we are required to make, and any injunction we are required to comply with as a result of such infringement, could harm our reputation and our business, financial condition or results of operations.\nInfringements on Kura Japans intellectual property rights, including Kura Japans service marks and trade secrets, could result in additional expense and could devalue our brand equity, as well as substantially affect our business, financial condition or results of operations.\nOther parties may infringe on our intellectual property rights, including those which we develop or otherwise license to use, and may thereby dilute our brand in the marketplace. Any such infringement of our intellectual property rights would also likely result in a commitment of our time and resources to protect these rights through litigation or otherwise.\nOur business prospects depend in part on our ability to develop favorable consumer recognition of the Kura Sushi name. Although Kura Sushi and Kura Revolving Sushi Bar are federally registered service marks owned by Kura Japan, such marks could be imitated in ways that we or Kura Japan cannot prevent. Alternatively, third parties may attempt to cause us to change our name or not operate in a certain geographic region if our name is confusingly similar to their name. In addition, we rely on trade secrets, proprietary know-how, concepts, and recipes, some of which we license from Kura Japan. Our methods or Kura Japans methods of protecting this information may not be adequate. Moreover, we or Kura Japan may face claims of misappropriation or infringement of third parties rights that could interfere with our use of this information. Defending these claims may be costly and, if unsuccessful, may prevent us from continuing to use this proprietary information in the future, and may result in a judgment or monetary damages. We do not maintain confidentiality and non-competition agreements with all of our executives, key personnel, or suppliers. If competitors independently develop or otherwise obtain access to the trade secrets, proprietary know-how, concepts, or recipes we rely upon to operate our restaurants, some of which we license from Kura Japan, the appeal of our restaurants could be significantly reduced and our business, financial condition or results of operations could be adversely affected.\nWe rely significantly on certain vendors and suppliers, which could adversely affect our business, financial condition or results of operations.\nOur ability to maintain consistent price and quality throughout our restaurants depends in part upon our ability to acquire specified food products and supplies in sufficient quantities from third-party vendors and suppliers at a reasonable cost. In addition, we are dependent upon a few suppliers for certain specialized equipment utilized in our restaurants, such as our conveyor belts and other parts of our proprietary system. We rely on JFC as one of our primary suppliers. JFC provided us with food products and supplies equaling 49% and 52%, and 58% of our total food and beverage costs in fiscal years 2023, 2022, and 2021 respectively. We also rely on Wismettac which provided us with food products and supplies equaling 20%, 25% and 27% of our total food and beverage costs in fiscal year 2023, 2022 and 2021, respectively. In fiscal year 2024, we expect our two major suppliers to be JFC and Mutual Trading Co., Inc. We do not control the businesses of our vendors and suppliers and our efforts to specify and monitor the standards under which they perform may not be successful. Furthermore, certain food items are perishable, and we have limited control over whether these items will be delivered to us in appropriate condition for use in our restaurants. If any of our vendors or other suppliers are unable to fulfill their obligations to our standards, or if we are unable to find replacement providers in the event of a supply or service disruption, we could encounter supply shortages and incur higher costs to secure adequate supplies, which could materially adversely affect our business, financial condition or results of operations.\nIn addition, we use various third-party vendors to provide, support and maintain most of our management information systems. We also outsource certain accounting, payroll and human resource functions to business process service providers. The failure of such vendors to fulfill their obligations could disrupt our operations. Additionally, any changes we may make to the services we obtain from our vendors, or new vendors we employ, may disrupt our operations. These disruptions could materially adversely affect our business, financial condition or results of operations.\nChanges in food and supply costs and/or availability of products could adversely affect our business, financial condition or results of operations.\nOur profitability depends in part on our ability to anticipate and react to changes in food and supply costs and/or the availability of products necessary to operate our business, including, but not limited to, rice vinegar from Kura Japan, which owns the recipe and is our sole supplier of such rice vinegar. Shortages or interruptions in the availability of certain supplies caused by unanticipated demand, problems in production or distribution, food contamination, inclement weather, natural disasters, or other conditions could adversely affect the availability, quality and cost of our ingredients, which could harm our operations. Any increase in the prices of the food products most critical to our menu, such as rice, fish and other seafood, as well as fresh vegetables, could adversely affect our business, financial condition or results from operations. Although we try to manage the impact that these fluctuations have on our operating results, we remain susceptible to increases in food costs and loss of supply as a\nresult of factors beyond our control, such as general economic conditions, inflationary pressures, seasonal fluctuations, weather conditions, demand, food safety concerns, generalized infectious diseases, product recalls and government regulations.\nIf any of our distributors or suppliers performs inadequately, or our distribution or supply relationships are disrupted for any reason, our business, financial condition, results of operations or cash flows could be adversely affected. If we cannot replace or engage distributors or suppliers who meet our specifications in a short period of time, that could increase our expenses and cause shortages of food and other items at our restaurants, which could cause a restaurant to remove items from its menu. If that were to happen, affected restaurants could experience significant reductions in sales during the shortage or thereafter, if guests change their dining habits as a result. In addition, because we provide moderately priced food, we may choose not to, or may be unable to, pass along commodity price increases to consumers. These potential changes in food and supply costs could materially adversely affect our business, financial condition or results of operations.\nOther Commercial, Operational, Financial and Regulatory Risks\nOperating results at our restaurants could be significantly affected by competition in the restaurant industry in general and, in particular, within the dining segments of the restaurant industry in which we compete.\nWe face significant competition from a variety of restaurants offering both Asian and non-Asian cuisine, as well as takeout offerings from grocery stores and other outlets where Asian food is sold. These segments are highly competitive with respect to, among other things, product quality, dining experience, ambience, location, convenience, value perception, and price. Any of these competitive factors may materially adversely affect our business, financial condition or results of operations. Our competition continues to intensify as competitors increase the breadth and depth of their product offerings and open new locations. These competitors may have, among other things, chefs who are widely known to the public that may generate more notoriety for those competitors as compared to our brand. We also compete with many restaurant and retail establishments for site locations and restaurant-level employees.\nChanges in economic conditions could materially affect our ability to maintain or increase sales at our restaurants or open new restaurants.\nThe restaurant industry depends on consumer discretionary spending. The United States in general or the specific markets in which we operate may suffer from depressed economic activity, recessionary economic cycles, higher fuel or energy costs, low consumer confidence, high levels of unemployment, reduced home values, increases in home foreclosures, investment losses, personal bankruptcies, reduced access to credit or other economic factors that may affect consumers discretionary spending. Sales in our restaurants could decline if consumers choose to dine out less frequently or reduce the amount they spend on meals while dining out. Negative economic conditions might cause consumers to make long-term changes to their discretionary spending behavior, including dining out less frequently on a permanent basis. If restaurant sales decrease, our profitability could decline as we spread fixed costs across a lower level of sales. Reductions in staff levels, asset impairment charges and potential restaurant closures could result from prolonged negative restaurant sales, which could materially adversely affect our business, financial condition or results of operations.\nFood safety and foodborne illness concerns as well as outbreaks of flu, viruses or other diseases could have an adverse effect on our business, financial condition or results of operations.\nWe cannot guarantee that our internal controls and training will be fully effective in preventing all food safety issues at our restaurants, including any occurrences of foodborne illnesses such as salmonella, E. coli and hepatitis A. In addition, there is no guarantee that our restaurant locations will maintain the high levels of internal controls and training we require at our restaurants. Furthermore, we rely on third-party vendors, making it difficult to monitor food safety compliance and increasing the risk that foodborne illness would affect multiple locations rather than a single restaurant. Some foodborne illness incidents could be caused by third-party vendors and transporters outside of our control. New illnesses resistant to our current precautions may develop in the future, or diseases with long incubation periods could arise, that could give rise to claims or allegations on a retroactive basis. One or more instances of foodborne illness in any of our restaurants or markets or related to food products we sell could negatively affect our restaurant sales nationwide if highly publicized on national media outlets or through social media. This risk exists even if it were later determined that the illness was wrongly attributed to us or one of our\nrestaurants. A number of other restaurant chains have experienced incidents related to foodborne illnesses that have had a material adverse effect on their operations. The occurrence of a similar incident at one or more of our restaurants, or negative publicity or public speculation about an incident, could materially adversely affect our business, financial condition or results of operations.\nIf a virus is transmitted by human contact or respiratory transmission, our employees or guests could become infected, or could choose, or be advised, to avoid gathering in public places, any of which could adversely affect our restaurant guest traffic and our ability to adequately staff our restaurants, receive deliveries on a timely basis or perform functions at the corporate level. Additionally, jurisdictions in which we have restaurants may impose mandatory closures, seek voluntary closures or impose restrictions on operations. Even if such measures are not implemented and a virus or other disease does not spread significantly, the perceived risk of infection or significant health risk may cause guests to choose other alternatives to dining out in our restaurants which may adversely affect our business.\nNew information or attitudes regarding diet and health could result in changes in regulations and consumer consumption habits that could adversely affect our business, financial condition or results of operations.\nChanges in attitudes regarding diet and health or new information regarding the adverse health effects of consuming certain foods could result in changes in government regulation and consumer eating habits that may impact our business, financial condition or results of operations. These changes have resulted in, and may continue to result in, laws and regulations requiring us to disclose the nutritional content of our food offerings, and they have resulted in, and may continue to result in, laws and regulations affecting permissible ingredients and menu offerings. For example, a number of jurisdictions have enacted menu labeling laws requiring multi-unit restaurant operators to disclose to consumers certain nutritional information, or have enacted legislation restricting the use of certain types of ingredients in restaurants. These requirements may be different or inconsistent with requirements we are subject to under the Patient Protection and Affordable Care Act of 2010, as amended by the Health Care and Education Reconciliation Act, collectively, the ACA, which establishes a uniform, federal requirement for certain restaurants to post nutritional information on their menus. See Item 1. Business-Government Regulation and Environmental Matters for additional information. Compliance with current and future laws and regulations regarding the ingredients and nutritional content of our menu items may be costly and time-consuming. We cannot predict the impact of any new nutrition labeling requirements. The risks and costs associated with nutritional disclosures on our menus could also impact our operations, particularly given differences among applicable legal requirements and practices within the restaurant industry with respect to testing and disclosure, ordinary variations in food preparation among our own restaurants, and the need to rely on the accuracy and completeness of nutritional information obtained from third-party suppliers.\nUnfavorable publicity about, or guests reactions to, our menu ingredients, the size of our portions or the nutritional content of our menu items could negatively influence the demand for our offerings, thereby adversely affecting our business, financial condition or results of operations. Additionally, if consumer health regulations or consumer eating habits and health perceptions change significantly, we may be required to modify or discontinue certain menu items, and we may experience higher costs associated with the implementation of those changes, as well as adversely affect the attractiveness of our restaurants to new or returning guests. The imposition of menu labeling laws and an inability to keep up with consumer eating habits could materially adversely affect our business, financial condition or results of operations, as well as our position within the restaurant industry in general.\nWe rely significantly on the operation of our revolving and express conveyor belts, sushi robots and other automated equipment, and any mechanical failure could prevent us from effectively operating our restaurants.\nThe operation of our restaurants relies on technology and equipment such as our revolving and express conveyor belts, the Bikkura-Pon rewards machines and touch screen menus. In our kitchens, we use automated equipment and systems such as sushi robots, RFID and QR Code readers, robotic arms, vinegar mixing machines, rice washers and dishwashers. Our ability to safely, efficiently and effectively manage our restaurants depends significantly on the reliability and capacity of these systems. Mechanical failures and our inability to service such equipment in a timely manner could result in delays in customer service and reduce efficiency of our restaurant operations, including a loss of sales. Remediation of such problems could result in significant, unplanned capital investments and any equipment failure may have an adverse effect on our business, financial condition or results of operations due to our reliance on such equipment.\nWe rely significantly on information technology and cybersecurity, and any material failure, weakness, interruption or breach of security could prevent us from effectively operating our business.\nWe rely significantly on information and cybersecurity systems, many of which are controlled by third-party providers, including point-of-sale processing in our restaurants for management of our supply chain, payment of obligations, collection of cash, credit and debit card transactions and other processes and procedures. We also operate tableside access to touch screen ordering systems to allow guests to place special orders. Our ability to efficiently and effectively manage our business depends significantly on the reliability and capacity of these systems. Failures of these systems to operate effectively, maintenance problems, upgrading or transitioning to new platforms, or a breach in security of these systems as a result of a cyber-attack, phishing attack, ransomware attack or any other failure to maintain a continuous and secure cyber network could result in substantial harm or inconvenience to our Company, our team members or guests. Some of these essential business processes that are dependent on technology are outsourced to third parties. While we make efforts to ensure that our providers are observing proper standards and controls, we cannot guarantee that breaches or failures caused by these outsourced providers will not occur.\nAny such failures or disruptions may cause delays in customer service and reduce efficiency in our operations. Remediation of such problems could result in significant, unplanned capital investments. We could also be subjected to litigation, regulatory investigations or the imposition of penalties. As information security laws and regulations change and cyber risks evolve, we may incur additional costs to ensure we remain in compliance and protect guest, employee and Company information.\nA breach of security of confidential consumer information related to our electronic processing of credit and debit card transactions, as well as a breach of security of our employee information, could substantially affect our reputation, business, financial condition or results of operations.\nThe majority of our restaurant sales are by credit or debit cards. Other restaurants and retailers have experienced security breaches in which credit and debit card information has been stolen. Improper access to our systems or databases or the systems or databases of outsourced third-party providers could result in the theft, publication, deletion or modification of confidential customer information and/or card data, including theft of funds on the card or counterfeit reproduction of the cards. If the security of such third-party providers is compromised, then we may be subject to unplanned losses, expenses, fines or penalties. We may in the future become subject to claims for purportedly fraudulent transactions arising out of the actual or alleged theft of credit or debit card information, and we may also be subject to lawsuits or other proceedings relating to these types of incidents. We may ultimately be held liable for the unauthorized use of a cardholders card number in an illegal activity and be required by card issuers to pay charge-back fees. In addition, most states have enacted legislation requiring notification of security breaches involving personal information, including credit and debit card information. Any such claim or proceeding could cause us to incur significant unplanned expenses, which could have an adverse impact on our business, financial condition or results of operations. Further, adverse publicity resulting from these allegations may have a material adverse effect on us and could substantially affect our reputation and business, financial condition or results of operations.\nIn addition, our business requires the collection, transmission and retention of large volumes of guest and employee data, including personally identifiable information, in various information technology systems that we maintain and in those maintained by third parties with whom we contract to provide services. The collection and use of such information is regulated at the federal and state levels, as well as at the international level, in which regulatory requirements have been increasing. As our environment continues to evolve in the digital age and reliance upon new technologies becomes more prevalent, it is imperative we secure the privacy and sensitive information we collect. Failure to do so, whether through fault of our own information systems or those of outsourced third-party providers, could not only cause us to fail to comply with these laws and regulations, but also could cause us to face litigation and penalties that could adversely affect our business, financial condition or results of operations. Our brands reputation and image as an employer could also be harmed by these types of security breaches or regulatory violations.\nOur marketing programs may not be successful, and our new menu items, advertising campaigns and restaurant designs and remodels may not generate increased sales or profits.\nWe incur costs and expend other resources in our marketing efforts on new menu items, advertising campaigns and restaurant designs and remodels to raise brand awareness and attract and retain guests. These initiatives may not be successful, resulting in expenses incurred without the benefit of higher sales. Additionally, some of our competitors have greater financial resources, which enable them to spend significantly more on marketing and advertising and other initiatives than we are able to. Should our competitors increase spending on marketing and advertising and other initiatives or our marketing funds decrease for any reason, or should our advertising, promotions, new menu items and restaurant designs and remodels be less effective than our competitors, there could be a material adverse effect on our business, financial condition or results of operations.\nOur inability or failure to recognize, respond to and effectively manage the accelerated impact of social media could materially adversely impact our business, financial condition or results of operations.\nOur marketing efforts rely heavily on the use of social media. In recent years, there has been a marked increase in the use of social media platforms, including weblogs (blogs), mini-blogs, chat platforms, social media websites, and other forms of Internet-based communications which allow individuals access to a broad audience of consumers and other interested persons. Many of our competitors are expanding their use of social media, and new social media platforms are rapidly being developed, potentially making more traditional social media platforms obsolete. As a result, we need to continuously innovate and develop our social media strategies in order to maintain broad appeal with guests and brand relevance. We also continue to invest in other digital marketing initiatives that allow us to reach our guests across multiple digital channels and build their awareness of, engagement with, and loyalty to our brand. These initiatives may not be successful, resulting in expenses incurred without the benefit of higher sales or increased brand recognition.\nNegative publicity relating to one of our restaurants could reduce sales at some or all of our other restaurants.\nOur success is dependent in part upon our ability to maintain and enhance the value of our brand and consumers connection to our brand. We may, from time to time, be faced with negative publicity relating to food quality, restaurant facilities, guest complaints or litigation alleging illness or injury, health inspection scores, integrity of our or our suppliers food processing, employee relationships or other matters, regardless of whether the allegations are valid or whether we are held to be responsible. The negative impact of adverse publicity relating to one restaurant may extend far beyond the restaurant involved to affect some or all of our other restaurants, thereby causing an adverse effect on our business, financial condition or results of operations. A similar risk exists with respect to unrelated food service businesses, if consumers associate those businesses with our own operations.\nThe considerable expansion in the use of social media over recent years can further amplify any negative publicity that could be generated by such incidents. Many social media platforms immediately publish the content their subscribers and participants post, often without filters or checks on accuracy of the content posted. Information posted on such platforms may be adverse to our interests and/or may be inaccurate. The dissemination of inaccurate or irresponsible information online could harm our business, reputation, prospects, financial condition, or results of operations, regardless of the informations accuracy. The damage may be immediate without affording us an opportunity for redress or correction.\nAdditionally, employee claims against us based on, among other things, wage and hour violations, discrimination, harassment or wrongful termination may also create negative publicity that could adversely affect us and divert our financial and management resources that would otherwise be used to benefit the future performance of our operations. A significant increase in the number of these claims or an increase in the number of successful claims could materially adversely affect our business, financial condition or results of operations. Consumer demand for our restaurants and our brands value could diminish significantly if any such incidents or other matters create negative publicity or otherwise erode consumer confidence in us or our restaurants, which would likely result in lower sales and could materially adversely affect our business, financial condition or results of operations.\nWe are subject to all of the risks associated with leasing space subject to long-term non-cancelable leases.\nWe do not own any real property. Payments under our operating leases account for a significant portion of our operating expenses and we expect the new restaurants we open in the future will be similarly leased. The majority of our operating leases have lease terms of twenty years, inclusive of customary extensions which are at the option of the Company. Most of our leases require a fixed annual rent which generally increases each year, and some require\nthe payment of additional rent if restaurant sales exceed a negotiated amount. Generally, our leases are net leases, which require us to pay all of the cost of insurance, taxes, maintenance and utilities. We generally cannot cancel these leases. Additional sites that we lease are likely to be subject to similar long-term non-cancelable leases. If an existing or future restaurant is not profitable, and we decide to close it, we may nonetheless be committed to perform our obligations under the applicable lease including, among other things, paying the base rent for the balance of the lease term. In addition, as each of our leases expire, we may fail to negotiate renewals, either on commercially acceptable terms or at all, which could cause us to pay increased occupancy costs or to close restaurants in desirable locations. If we fail to negotiate renewals, we may have to dispose of assets at such restaurant locations and incur closure costs and additional costs associated with moving transferable furniture, fixtures and equipment, as well as incur impairment of property and equipment. Such potential increased costs and closures of restaurants could materially adversely affect our business, financial condition or results of operations.\nMacroeconomic conditions, including economic downturns, may cause landlords of our leases to be unable to obtain financing or remain in good standing under their existing financing arrangements, resulting in failures to pay required tenant improvement allowances or satisfy other lease covenants to us. In addition, tenants at shopping centers in which we are located or have executed leases, or to which our locations are near, may fail to open or may cease operations. Decreases in total tenant occupancy in shopping centers in which we are located, or to which our locations are near, may affect traffic at our restaurants. All of these factors could have a material adverse impact on our business, financial condition or results of operations.\nWe may need capital in the future, and we may not be able to raise that capital on favorable terms.\nDeveloping our business will require significant capital in the future. In fiscal year 2021 Kura Japan purchased 126,500 shares of our Class A common stock as part of a secondary underwritten public offering of 1,265,000 shares of our Class A common stock. There is no guarantee that if we need to raise any additional capital, we will receive additional capital contributions from Kura Japan. To meet our capital needs, we expect to rely on our cash flows from operations, borrowings under our existing Credit Facility, future offerings and other third-party financing. Third-party financing in the future may not, however, be available on terms favorable to us, or at all. Our ability to obtain additional funding will be subject to various factors, including market conditions, our operating performance, lender sentiment and our ability to incur additional debt in compliance with other contractual restrictions under our Credit Facility, term loans or other debt documents we may enter into. These factors may make the timing, amount, or terms and conditions of additional financings unattractive. Our inability to raise capital could impede our growth and could materially adversely affect our business, financial condition or results of operations.\nWe depend on our senior management team and other key employees, and the loss of one or more key personnel or an inability to attract, hire, integrate and retain highly skilled personnel could have an adverse effect on our business, financial condition or results of operations.\nOur success depends largely upon the continued services of our key employees. We also rely on our leadership team in setting our strategic direction, operating our business, identifying, recruiting and training key personnel, identifying expansion opportunities, arranging necessary financing, and for general and administrative functions. From time to time, there may be changes in our executive management team resulting from the hiring or departure of executives, which could disrupt our business. In addition, a small portion of our workforce is Japanese expatriates whose services we have secured from Kura Japan. The loss or replacement of one or more of our executive officers or other key employees could have a material adverse effect on our business, financial condition or results of operations.\nIf we face labor shortages, increased labor costs or unionization activities, our growth, business, financial condition and operating results could be adversely affected.\nLabor is a primary component in the cost of operating our restaurants. If we face labor shortages or increased labor costs because of increased competition for employees, higher employee turnover rates, increases in federal, state or local minimum wage rates, workers' compensation cost increases or other employee benefits costs (including costs associated with health insurance coverage), our operating expenses could increase and our growth could be adversely affected. In addition, our success depends in part upon our ability to attract, motivate and retain a sufficient number of well-qualified restaurant operators and management personnel, as well as a sufficient number of other qualified employees, to keep pace with our expansion schedule. Qualified individuals needed to fill these\npositions are in short supply in some geographic areas. In addition, restaurants have traditionally experienced relatively high employee turnover rates. Our failure to recruit and retain such individuals may delay the planned openings of new restaurants or result in higher employee turnover in existing restaurants, which could have a material adverse effect on our business, financial condition or results of operations.\nWe may be unable to increase our menu prices in order to pass increased labor costs on to consumers, in which case our margins would be negatively affected, which could materially adversely affect our business, financial condition or results of operations.\nAlthough none of our employees are currently covered under collective bargaining agreements, our employees may elect to be represented by labor unions in the future. If a significant number of our employees were to become unionized and collective bargaining agreement terms were significantly different from our current compensation arrangements, it could adversely affect our business, financial condition or results of operations.\nOur business could be adversely affected by a failure to obtain visas or work permits or to properly verify the employment eligibility of our employees.\nSome of our corporate employees ability to work in the United States depends on obtaining and maintaining necessary visas and work permits. On certain occasions we have been, and in the future we may be, unable to obtain visas or work permits to bring necessary employees to the United States for any number of reasons including, among others, limits set by the U.S. Department of Homeland Security or the U.S. Department of State.\nAlthough we require all workers to provide us with government-specified documentation evidencing their employment eligibility, some of our employees may, without our knowledge, be unauthorized workers. We currently participate in the E-Verify program, an Internet-based, free program run by the U.S. government to verify employment eligibility, in states in which participation is required, and we plan to introduce its use across all our restaurants. However, use of the E-Verify program does not guarantee that we will properly identify all applicants who are ineligible for employment. Unauthorized workers are subject to deportation and may subject us to fines or penalties, and if any of our workers are found to be unauthorized, we could experience adverse publicity that may negatively impact our brand and may make it more difficult to hire and keep qualified employees. Termination of a significant number of employees who are unauthorized employees may disrupt our operations, cause temporary increases in our labor costs as we train new employees and result in adverse publicity. We could also become subject to fines, penalties and other costs related to claims that we did not fully comply with all recordkeeping obligations of federal and state immigration compliance laws. These factors could materially adversely affect our business, financial condition or results of operations.\nLabor disputes may disrupt our operations and affect our profitability, thereby causing a material adverse effect on our business, financial condition or results of operations.\nAs an employer, we are presently, and may in the future be, subject to various employment-related claims, such as individual or class actions or government enforcement actions relating to alleged employment discrimination, employee classification and related withholding, wage-hour, labor standards or healthcare and benefit issues. See Note 11 - Commitments and Contingencies to the financial statements included in this Annual Report on Form 10-K. Any future actions, if brought against us and successful in whole or in part, may affect our ability to compete or could materially adversely affect our business, financial condition or results of operations.\nThe minimum wage, particularly in California, continues to increase and is subject to factors outside of our control.\nWe have a substantial number of hourly employees who are paid wage rates based on the applicable federal, state or local minimum wage. Any of federally-mandated, state-mandated or municipality-mandated minimum wages may be raised in the future which would increase our labor costs and could have a materially adverse effect on our business, financial condition or results of operations. If menu prices are increased by us to cover increased labor costs, the higher prices could adversely affect sales and thereby reduce our margins and adversely affect our business, financial condition or results of operations.\nChanges in employment laws may adversely affect our business, financial condition, or results of operations.\nVarious federal and state labor laws govern the relationship with our employees and affect operating costs. These laws include employee classification as exempt/non-exempt for overtime and other purposes, minimum wage requirements, tips and gratuity payments, unemployment tax rates, workers compensation rates, immigration status and other wage and benefit requirements. Significant additional government-imposed increases in the following areas could materially affect our business, financial condition or operating results: minimum wages; tips and gratuities; mandatory health benefits; vacation accruals; paid leaves of absence, including paid sick leave; and tax reporting.\nGovernmental regulation may adversely affect our ability to open new restaurants or otherwise adversely affect our business, financial condition or results of operations.\nWe are subject to various federal, state and local regulations. Our restaurants are subject to state and local licensing and regulation by health, alcoholic beverage, sanitation, food and occupational safety and other agencies. We may experience material difficulties or failures in obtaining or renewing the necessary licenses, approvals or permits for our restaurants, which could delay planned restaurant openings or affect the operations at our existing restaurants. In addition, stringent and varied requirements of local regulators with respect to zoning, land use and environmental factors could delay or prevent development of new restaurants in particular locations.\nWe are subject to the U.S. Americans with Disabilities Act and similar state laws that give civil rights protections to individuals with disabilities in the context of employment, public accommodations and other areas, including our restaurants. We may in the future have to modify restaurants, for example, by adding access ramps or redesigning certain architectural fixtures, to provide service to or make reasonable accommodations for disabled persons. The expenses associated with these modifications could be material.\nOur operations are also subject to the U.S. Occupational Safety and Health Act, which governs worker health and safety, the U.S. Fair Labor Standards Act, which governs such matters as minimum wages and overtime, and a variety of similar federal, state and local laws that govern these and other employment law matters. In addition, federal, state and local proposals related to paid sick leave or similar matters could, if implemented, materially adversely affect our business, financial condition or results of operations.\nWe could be party to litigation that could adversely affect us by distracting management, increasing our expenses or subjecting us to material money damages and other remedies.\nOur guests may file complaints or lawsuits against us alleging we caused an illness or injury they suffered at or after a visit to our restaurants, or that we have problems with food quality or operations. We are also subject to a variety of other claims arising in the ordinary course of our business, including personal injury claims, contract claims and claims alleging violations of federal and state law regarding workplace and employment matters, equal opportunity, discrimination and similar matters, and we are presently subject to class action and other lawsuits with regard to certain of these matters and could become subject to additional class action or other lawsuits related to these or different matters in the future. Regardless of whether any claims against us are valid, or whether we are ultimately held liable, claims may be expensive to defend and may divert time and money away from our operations and hurt our performance. A judgment in excess of our insurance coverage for any claims could materially and adversely affect our business, financial condition or results of operations. Any adverse publicity resulting from these allegations may also materially and adversely affect our reputation or prospects, which in turn could materially adversely affect our business, financial condition or results of operations.\nWe are subject to state and local dram shop statutes, which may subject us to uninsured liabilities. These statutes generally allow a person injured by an intoxicated person to recover damages from an establishment that wrongfully served alcoholic beverages to the intoxicated person. Because a plaintiff may seek punitive damages, which may not be fully covered by insurance, this type of action could have an adverse impact on our business, financial condition or results of operations. A judgment in such an action significantly in excess of, or not covered by, our insurance coverage could adversely affect our business, financial condition or results of operations. Further, adverse publicity resulting from any such allegations may adversely affect our business, financial condition or results of operations.\nOur current insurance may not provide adequate levels of coverage against claims.\nThere are types of losses we may incur that cannot be insured against or that we believe are not economically reasonable to insure, such as losses due to natural disasters, acts of terrorism or the declaration of war. Such losses could have a material adverse effect on our business, financial condition or results of operations. In addition, our current insurance policies may not be adequate to protect us from liabilities that we incur in our business in areas such as workers compensation, general liability, auto and property. In the future, our insurance premiums may increase, and we may not be able to obtain similar levels of insurance on reasonable terms, or at all. Any substantial inadequacy of, or inability to obtain, insurance coverage could materially adversely affect our business, financial condition and results of operations. Failure to maintain adequate directors and officers insurance would likely adversely affect our ability to attract and retain qualified officers and directors.\nChanges to accounting rules or regulations may adversely affect our business, financial condition or results of operations.\nChanges to existing accounting rules or regulations may impact our business, financial condition or results of operations. The introduction of new accounting rules or regulations and varying interpretations of existing accounting rules or regulations have occurred and may occur in the future. Future changes to accounting rules or regulations could materially adversely affect our business, financial condition or results of operations.\nOur ability to use our net operating loss carryforwards and certain other tax attributes may be limited.\nAs of August 31, 2023, we had federal net operating loss carryforwards of approximately $31.0 million and federal tax credit carryover of approximately $6.1 million. We recorded a full valuation allowance against these current net operating loss carryforwards as there can be no assurance that the benefit of such net operating loss carryforwards will be fully utilized. In addition, under Sections 382 and 383 of the Internal Revenue Code of 1986, as amended (the Code), if a corporation undergoes an ownership change, generally defined as a greater than 50% change (by value) in ownership by 5 percent shareholders over a rolling three-year period, the corporations ability to use its pre-change net operating loss carryforwards and other pre-change tax attributes to offset its post-change income may be limited. Similar rules may apply under state tax laws. We may have experienced an ownership change in the past and may experience ownership changes in the future as a result of future transactions in our stock, some of which may be outside our control. As a result, if we earn net taxable income, our ability to use our pre-change net operating loss carryforwards, or other pre-change tax attributes, to offset U.S. federal and state taxable income may be subject to significant limitations.\nChanges in tax laws and unanticipated tax liabilities could adversely affect our financial results.\nWe are subject to income and other taxes in the United States. Any significant changes in U.S. laws and related authoritative interpretations could affect our tax expense and profitability. We are also impacted by the outcome of tax audits, which could have a material effect on our results of operations and cash flows in the period or periods for which that determination is made. In addition, our effective income tax rate and our results may be impacted by our ability to realize deferred tax benefits and any increases or decreases of our valuation allowance applied to our deferred tax assets.\nFailure to establish and maintain effective internal controls in accordance with Section 404 of the Sarbanes-Oxley Act could have a material adverse effect on our business and stock price.\nAs a publicly traded company, we are required to comply with the SECs rules implementing Sections 302 and 404 of the Sarbanes-Oxley Act, which requires management to certify financial and other information in our quarterly and annual reports and provide an annual management report on the effectiveness of internal controls over financial reporting. Pursuant to the JOBS Act, our independent registered public accounting firm will not be required to attest to the effectiveness of our internal control over financial reporting until the date we are no longer an emerging growth company, which may be up to five full fiscal years following our IPO.\nTo comply with the requirements of being a public company, we may need to undertake various actions, such as implementing new internal controls and procedures and hiring additional accounting or internal audit staff. In addition, we may identify material weaknesses in our internal control over financial reporting that we may not be able to remediate in time to meet the applicable deadline imposed upon us for compliance with the requirements of Section 404.\nIf we identify weaknesses in our internal control over financial reporting, are unable to comply with the requirements of Section 404 in a timely manner or to assert that our internal control over financial reporting is effective, or if our independent registered public accounting firm is unable to express an opinion as to the effectiveness of our internal control over financial reporting, investors may lose confidence in the accuracy and completeness of our financial reports and the market price of our common stock could be negatively affected, and we could become subject to investigations by the SEC or other regulatory authorities, which could require additional financial and management resources.\nRisks Related to Ownership of Our Class A Common Stock\nThere may be an adverse effect on the value and liquidity of our Class A common stock due to the disparate voting rights of our Class A common stock and our Class B common stock.\nWith the exception of voting rights and certain conversion rights for the Class B common stock, holders of our Class A common stock and Class B common stock have identical rights. On all matters to be voted on by stockholders, holders of our Class A common stock are entitled to one vote per share while holders of our Class B common stock are entitled to 10 votes per share. The difference in the voting rights of our Class A common stock and Class B common stock could adversely affect the value of the Class A common stock to the extent that any investor or potential future purchaser of our Class A common stock ascribes value to the superior voting rights of our Class B common stock. The existence of two separate classes of common stock could result in less liquidity for our Class A common stock than if there were only one class of our common stock. In addition, if we issue additional shares of Class B common stock in the future, there will be further dilution to investors or potential future purchasers of our Class A common stock.\nOur quarterly operating results may fluctuate significantly and could fall below the expectations of securities analysts and investors due to seasonality and other factors, some of which are beyond our control, resulting in a decline in our stock price.\nOur quarterly operating results may fluctuate significantly because of several factors, including: recent and ongoing inflationary trends impacting our cost of food, labor and other costs: the timing of new restaurant openings and related expense; restaurant operating costs for our newly-opened restaurants, which are often materially greater during the first several months of operation than thereafter; labor availability and costs for hourly and management personnel; profitability of our restaurants, especially in new markets; changes in interest rates; increases and decreases in AUVs and comparable restaurant sales; impairment of long-lived assets and any loss on restaurant closures; macroeconomic conditions, both nationally and locally; negative publicity relating to the consumption of seafood or other food products we serve; changes in consumer preferences and competitive conditions; expansion in existing and new markets; increases in infrastructure costs; and fluctuations in commodity prices.\nSeasonal factors and the timing of holidays also cause our sales to fluctuate from quarter to quarter. As a result of these factors, our quarterly and annual operating results and comparable restaurant sales may fluctuate significantly. Accordingly, results for any one quarter are not necessarily indicative of results to be expected for any other quarter or for any year and comparable restaurant sales for any particular future period may decrease. In addition, as we expand by opening more restaurants in cold weather climates, the seasonality of our business may be amplified. In the future, operating results may fall below the expectations of securities analysts and investors. In that event, the price of our common stock could be adversely impacted.\nThe price of our common stock may be volatile and you may lose all or part of your investment.\nThe market price of our common stock could fluctuate significantly, and you may not be able to resell your shares at or above the purchase price. Those fluctuations could be based on various factors in addition to those otherwise described in this report, including those described under -Risks Related to Our Business and Industry and the following: our operating performance and the performance of our competitors or restaurant companies in general; the publics reaction to our press releases, our other public announcements and our filings with the SEC; changes in earnings estimates or recommendations by research analysts who follow us or other companies in our industry; global, national or local economic, legal and regulatory factors unrelated to our performance; future sales\nof our common stock or our equity interests by our officers, directors and significant stockholders; the arrival or departure of key personnel; and other developments affecting us, our industry or our competitors.\nFor example, the U.S. stock market has experienced significant price and volume fluctuations due to the COVID-19 pandemic and the recessionary cycle affecting the U.S. economy. These broad market fluctuations have affected the market price of our common stock and could adversely impact our common stock price.\nFuture sales of our common stock, or the perception that such sales may occur, could depress our common stock price.\nSales of a substantial number of shares of our common stock in the public market, or the perception that such sales may occur, could depress the market price of our common stock. This would include sales by Kura Japan, as detailed below under -Risks Related to Our Organizational Structure-Future sales of our shares by Kura Japan could depress our Class A common stock price.\nOur amended and restated certificate of incorporation authorize us to issue up to 50,000,000 shares of Class A common stock and 10,000,100 shares of Class B common stock, of which, as of August 31, 2023, 10,147,126 shares of Class A common stock and 1,000,050 shares of Class B common stock are outstanding, and 653,395 shares of Class A common stock will be issuable upon the exercise of outstanding stock options. The shares of Class A common stock offered are freely tradable without restriction under the Securities Act, except for any shares of our common stock that are held by our directors, executive officers and other affiliates, as that term is defined in the Securities Act, which will be restricted securities under the Securities Act. Restricted securities may not be sold in the public market unless the sale is registered under the Securities Act or an exemption from registration is available.\nShares of our Class A common stock and Class B common stock held by our affiliates are subject to the volume and other restrictions of Rule 144 under the Securities Act.\nIn addition, we filed registration statements on Form S-8 under the Securities Act whereby 1,350,000 shares of Class A common stock are reserved for issuance under our 2018 Incentive Compensation Plan.\nIn the future, we may also issue common stock or other securities. The number of new shares of our common stock issued in connection with raising additional capital could constitute a material portion of the then outstanding shares of our common stock and dilute our current stockholders.\nAdditionally, our board of directors is authorized to issue up to 1,000,000 shares of preferred stock in one or more series, without any action on the part of holders of our Class A common stock. Holders of our Class A common stock are subject to the prior dividend and liquidation rights of any holders of our preferred stock or depositary shares representing such preferred stock then outstanding. Any future issuance of our preferred stock could cause the stock price of our common stock to decline.\nIf securities or industry analysts do not publish research or publish inaccurate or unfavorable research about our business, our stock price and trading volume could decline.\nThe trading market for our common stock will depend in part on the research and reports that securities or industry analysts publish about us or our business. If one or more of the analysts who cover us downgrades our common stock or publishes inaccurate or unfavorable research about our business, our stock price would likely decline. If one or more of these analysts ceases coverage of us or fails to publish reports on us regularly, demand for our common stock could decrease, which could cause our stock price and trading volume to decline.\nWe do not intend to pay dividends for the foreseeable future.\nWe may retain future earnings, if any, for future operations, expansion and debt repayment and have no current plans to pay any cash dividends for the foreseeable future. Any future determination to declare and pay cash dividends will be at the discretion of our board of directors and will depend on, among other things, our financial condition, results of operations, cash requirements, contractual restrictions and such other factors as our board of directors deems relevant. Our ability to pay dividends may also be limited by covenants under our Credit Facility, terms loans or of any future outstanding indebtedness we, our subsidiaries or affiliates (including Kura Japan) incur.\nAs a result, you may not receive any return on an investment in our common stock unless you sell our common stock for a price greater than that which you paid for it.\nProvisions in our charter documents and Delaware law may delay or prevent our acquisition by a third party.\nOur amended and restated certificate of incorporation and amended and restated bylaws, and Delaware law, contain several provisions that may make it more difficult for a third party to acquire control of us without the approval of our board of directors. These provisions also may delay, prevent or deter a merger, acquisition, tender offer, proxy contest or other transaction that might otherwise result in our stockholders receiving a premium over the market price for their common stock.\nOur amended and restated certificate of incorporation authorizes our board of directors to issue new series of preferred stock without stockholder approval. Depending on the rights and terms of any new series created, and the reaction of the market to the series, the rights and value associated with our Class A common stock could be negatively affected. The ability of our board of directors to issue new series of preferred stock could also prevent or delay a third party from acquiring us, even if doing so would be beneficial to our stockholders.\nOur amended and restated certificate of incorporation and amended and restated bylaws each contain an exclusive forum provision, which could limit a stockholders ability to obtain a favorable judicial forum for disputes with us or our directors, officers or other employees.\nOur amended and restated certificate of incorporation and amended and restated bylaws each contain an exclusive forum provision providing that the Court of Chancery of the State of Delaware will be the sole and exclusive forum for: (i) any derivative action or proceeding brought on our behalf, (ii) any action asserting a claim of breach of a fiduciary duty owed by, or other wrongdoing by, any of our directors, officers, employees, agents or stockholders, (iii) any action asserting a claim arising pursuant to any provision of the Delaware General Corporation Law, our amended and restated certificate of incorporation or our amended and restated bylaws, or (iv) any action asserting a claim that is governed by the internal affairs doctrine. However, Section 27 of the Exchange Act creates exclusive federal jurisdiction over all suits brought to enforce any duty or liability created by the Exchange Act or the rules and regulations thereunder. As a result, the exclusive forum provision will not apply to suits brought to enforce any duty or liability created by the Exchange Act or any other claim for which the federal courts have exclusive jurisdiction. In addition, Section 22 of the Securities Act creates concurrent jurisdiction for federal and state courts over all suits brought to enforce any duty or liability created by the Securities Act or the rules and regulations thereunder. As a result, the exclusive forum provisions will not apply to suits brought to enforce any duty or liability created by the Securities Act or any other claim for which the federal and state courts have concurrent jurisdiction, and our stockholders will not be deemed to have waived our compliance with the federal securities laws and the rules and regulations thereunder.\nAny person purchasing or otherwise acquiring any interest in any shares of our capital stock shall be deemed to have notice of and to have consented to these provisions of our amended and restated certificate of incorporation and our amended and restated bylaws. The exclusive forum provisions, if enforced, may limit a stockholders ability to bring a claim in a judicial forum that it finds favorable for disputes with us or our directors, officers or other employees, which may discourage such lawsuits. Alternatively, if a court were to find the exclusive forum provisions to be inapplicable or unenforceable in an action, we may incur additional costs associated with resolving such action in other jurisdictions, which could have a material adverse effect on our business, financial condition, results of operations and growth prospects. For example, the Court of Chancery of the State of Delaware recently determined that a provision stating that U.S. federal district courts are the exclusive forum for resolving any complaint asserting a cause of action arising under the Securities Act is not enforceable.\nRisks Related to Our Organizational Structure\nWe are controlled by Kura Japan, whose interests may differ from those of our other stockholders.\nAs of the date of this report, Kura Japan controls 70% of the combined voting power of our equity interests through their ownership of both Class A common stock and Class B common stock, and effectively controls the outcome of matters submitted to stockholders that require a majority vote based on our outstanding equity interests. Kura Japan will, for the foreseeable future, have significant influence over corporate management and affairs, and will be able to control virtually all matters requiring stockholder approval so long as Kura Japan owns a majority of the combined voting power of our outstanding equity interests. Kura Japan is able to, subject to applicable law, elect a majority of the members of our board of directors and control actions to be taken by us and our board of directors, including amendments to our certificate of incorporation and bylaws and approval of significant corporate transactions, including, among other matters, mergers and sales of substantially all of our assets, as well as incurrence of indebtedness by us. The directors so elected will have the authority, subject to the terms of our indebtedness and applicable rules and regulations, to issue additional stock, implement stock repurchase programs, declare dividends and make other decisions. It is possible that the interests of Kura Japan may in some circumstances conflict with our interests and the interests of our other stockholders, including you. For example, Kura Japan may have different tax positions from us that could influence their decisions regarding the structuring of future transactions, whether and when to dispose of assets, or whether and when to incur new or refinance existing indebtedness. Such indebtedness could contain covenants that prevent us from declaring dividends to stockholders. For additional information about our relationships with Kura Japan, you should read the information under Note 5 - Related Party Transactions to our audited financial statements included in Item 8. Financial Statements and Supplementary Data in this Annual Report on Form 10-K for additional information.\nWe are a controlled company within the meaning of the Nasdaq listing standards and, as a result, will qualify for, and may rely on, exemptions from certain corporate governance requirements. You will not have the same protections afforded to stockholders of companies that are subject to such requirements.\nBecause of the voting power of Kura Japan, we are considered a controlled company for the purposes of the Nasdaq Stock Market. As such, we are exempt from certain corporate governance requirements of the Nasdaq Stock Market so long as we are considered a controlled company, including: that we have a majority of independent directors on our board of directors, an entirely independent compensation committee and an independent nominating function. Accordingly, you will not have the same protections afforded to stockholders of companies that are subject to all of the corporate governance requirements of the Nasdaq Stock Market. We currently have a board composed of a majority of independent directors and our Compensation Committee is composed entirely of independent directors, but we do not have a Nominating and Corporate Governance Committee.\nThe interests of Kura Japan may conflict with ours or yours in the future.\nVarious conflicts of interest between Kura Japan and us could arise. Ownership interests of directors or officers of Kura Japan in our common stock, or a persons service as either a director or officer of both companies, could create or appear to create potential conflicts of interest when those directors and officers are faced with decisions that could have different implications for Kura Japan and us. These decisions could, for example, relate to: disagreement over corporate opportunities; management stock ownership; employee retention or recruiting; our dividend policy; and the services and arrangements from which we benefit as a result of our relationship with Kura Japan.\nPotential conflicts of interest could also arise if we enter into any new commercial arrangements with Kura Japan in the future. Our directors and officers who have interests in both Kura Japan and us may also face conflicts of interest with regard to the allocation of their time between Kura Japan and us.\nThe corporate opportunity provisions in our amended and restated certificate of incorporation could enable Kura Japan to benefit from corporate opportunities that might otherwise be available to us.\nOur amended and restated certificate of incorporation contains provisions related to corporate opportunities that may be of interest to both Kura Japan and us. It provides that if a corporate opportunity is offered to:\none of our officers or employees who is also a director (but not an officer or employee) of Kura Japan, that opportunity will belong to us unless expressly offered to that person primarily in his or her capacity as a director of Kura Japan, in which case it will belong to Kura Japan;\none of our directors who is also an officer or employee of Kura Japan, that opportunity will belong to Kura Japan unless expressly offered to that person primarily in his or her capacity as our director, in which case it will belong to us; and\nany person who is either (1) an officer or employee of both us and Kura Japan or (2) a director of both us and Kura Japan (but not an officer or employee of either one), that opportunity will belong to Kura Japan unless expressly offered to that person primarily in his or her capacity as our director, in which case such opportunity shall belong to us.\nNone of our officers or directors are also an officer, employee or director of Kura Japan. A very small number of our non-officer employees are both employees of our company and Kura Japan. Accordingly, none of our officers fit the description bullets above.\nIn following these procedures, any person who is offered a corporate opportunity will have satisfied his or her fiduciary duties to our stockholders and us. In addition, our amended and restated certificate of incorporation provides that any corporate opportunity that belongs to Kura Japan or to us, as the case may be, may not be pursued by the other, unless and until the party to whom the opportunity belongs determines not to pursue the opportunity and so informs the other party. Furthermore, so long as the material facts of any transaction between us and Kura Japan have been disclosed to or are known by our board of directors or relevant board committee, and the board or such committee (which may, for quorum purposes, include directors who are directors or officers of Kura Japan) authorizes the transaction by an affirmative vote of a majority of the disinterested directors, then Kura Japan will have satisfied its fiduciary duties and will not be liable to us or our stockholders for any breach of fiduciary duty or duty of loyalty relating to that transaction. These provisions create the possibility that a corporate opportunity that may be pertinent to us may be used for the benefit of Kura Japan.\nFuture sales of our shares by Kura Japan could depress our Class A common stock price.\nKura Japan may sell all or a portion of the shares of our Class A common stock and Class B common stock that it owns (which shares of Class B common stock would be converted automatically into Class A shares in connection with any sale). Sales by Kura Japan in the public market could depress our Class A common stock price. Kura Japan is not subject to any contractual obligation to maintain its ownership position in our shares. Item 1B. Unresolved Staff Comments\nNone. Item 2. Properties\nAs of August 31, 2023, we operate 50 restaurants in fifteen states and Washington, D.C. We operate a variety of restaurant formats, including in-line and end-cap restaurants located in retail centers of varying sizes. Our restaurants range in size from 1,600 to 7,920 square feet, with an average of approximately 3,400 square feet. We lease the property for our corporate office located in Irvine, California and all of the properties on which we operate our restaurants.\nThe table below shows the locations of our restaurants as of August 31, 2023:\nCity\nState\nOpened\nCity\nState\nOpened\nIrvine\nCalifornia\nSep-2009\nFort Lee\nNew Jersey\nSep-2020\nLos Angeles (Little Tokyo)\nCalifornia\nJan-2012\nWashington, D.C.\nWashington, D.C.\nNov-2020\nTorrance\nCalifornia\nApr-2012\nLos Angeles (Koreatown)\nCalifornia\nNov-2020\nBrea\nCalifornia\nMay-2012\nAventura\nFlorida\nJan-2021\nRancho Cucamonga\nCalifornia\nAug-2012\nTroy\nMichigan\nFeb-2021\nLos Angeles (Sawtelle)\nCalifornia\nAug-2013\nSherman Oaks\nCalifornia\nApr-2021\nSan Diego\nCalifornia\nMar-2015\nBellevue\nWashington\nJun-2021\nCupertino\nCalifornia\nFeb-2016\nStonestown\nCalifornia\nOct-2021\nPlano\nTexas\nMay-2016\nCamelback\nArizona\nDec-2021\nCarrollton\nTexas\nJul-2016\nChandler\nArizona\nDec-2021\nAustin\nTexas\nMay-2017\nSan Antonio\nTexas\nFeb-2022\nDoraville\nGeorgia\nJul-2017\nWatertown\nMassachusetts\nMar-2022\nHouston (Westchase)\nTexas\nAug-2017\nNovi\nMichigan\nJul-2022\nSugar Land\nTexas\nJan-2018\nOrlando\nFlorida\nAug-2022\nHouston (Midtown)\nTexas\nMar-2018\nTysons\nVirginia\nAug-2022\nPleasanton\nCalifornia\nApr-2018\nBloomington\nMinnesota\nNov-2022\nFrisco\nTexas\nMay-2018\nJersey City\nNew Jersey\nNov-2022\nCerritos\nCalifornia\nOct-2018\nPhiladelphia\nPennsylvania\nDec-2022\nSchaumburg\nIllinois\nNov-2018\nEdison\nNew Jersey\nFeb-2023\nCypress\nCalifornia\nJan-2019\nOak Brook\nIllinois\nFeb-2023\nSacramento\nCalifornia\nMar-2019\nBuford\nGeorgia\nMay-2023\nLas Vegas\nNevada\nJul-2019\nFramingham\nMassachusetts\nJun-2023\nGarden Grove\nCalifornia\nAug-2019\nCarle Place\nNew York\nJul-2023\nKaty\nTexas\nDec-2019\nSan Jose\nCalifornia\nJul-2023\nGlendale\nCalifornia\nFeb-2020\nDorchester\nMassachusetts\nAug-2033\nWe are obligated under non-cancelable leases for the majority of our restaurants, as well as our corporate offices. The majority of our restaurant leases have lease terms of twenty years, inclusive of customary extensions which are at our option. Our restaurant leases generally require us to pay a proportionate share of real estate taxes, insurance, common area maintenance charges, and other operating costs. Some restaurant leases provide for contingent rental payments based on sales thresholds, although we generally do not expect to pay significant rent on these properties based on the thresholds in those leases. Item 3. Legal Proceedings\nFor a description of our legal proceedings, see Part II, Item 8, Note 11 - Commitments and Contingencies, of the Notes to Financial Statements of this Annual Report on Form 10-K, which is incorporated herein by reference. Item 4. Mine Safety Disclosures\nNot applicable.\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nMarket Information for Common Stock\nOur common stock has traded on the Nasdaq Global Market under the symbol KRUS since it began trading on August 1, 2019. Before then, there was no public market for our common stock.\nHolders of Record\nAs of November 2, 2023, we had three holders of record of our Class A common stock and one holder of our Class B common stock. The number of holders of record is based upon the actual number of holders registered as of such date and does not include holders of shares in street name accounts through brokers, or persons, partnerships, associates, corporations or other entities in security position listings maintained by depositories.\nDividends\nWe have not declared, and currently do not plan to declare in the foreseeable future, dividends on our common stock. Instead, we anticipate that all our earnings in the foreseeable future, if any, will be used for the operation and growth of our business. Any future determination to pay dividends on our common stock will be at the discretion of our board of directors and will depend upon many factors, including our financial condition, our results of operations, our liquidity, legal requirements, restrictions that may be imposed by the terms of current and future financing instruments and other factors deemed relevant by our board of directors.\nStock Performance Graph\nThe following graph presents a comparison from August 1, 2019 through August 31, 2023 of the cumulative return of our common stock, the Nasdaq Composite Index and the S&P 600 Restaurants Index. The graph assumes investment of $100 on August 1, 2019 in our common stock and in each of the two indices and the reinvestment of dividends. This graph is furnished and not filed with the SEC or soliciting material under the Exchange Act and shall not be incorporated by reference into any such filings, irrespective of any general incorporation contained in such filing.\nTotal Return Analysis\n8/1/2019\n8/31/2019\n8/31/2020\n8/31/2021\n8/31/2022\n8/31/2023\nKura Sushi USA, Inc.\n$\n100.00\n$\n127.84\n$\n62.32\n$\n259.10\n$\n381.23\n$\n445.54\nNasdaq Composite\n$\n100.00\n$\n98.17\n$\n145.18\n$\n188.13\n$\n145.68\n$\n173.03\nS&P 600 Restaurants Index\n$\n100.00\n$\n106.77\n$\n103.04\n$\n142.99\n$\n95.81\n$\n107.77\nRecent Sales of Unregistered Securities\nDuring fiscal year 2023, we did not sell any securities without registration under the Securities Act of 1933.\nIssuer Purchases of Equity Securities\nWe did not repurchase any of our equity securities during fiscal year 2023.\nEquity Compensation Plan Information\nFor equity compensation plan information, refer to Part III, Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters of this Annual Report on Form 10-K. Item 6. [Reserved] Item 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nYou should read the following discussion and analysis of our financial condition and results of operations together with the Selected Financial Data and our financial statements and the related notes and other financial information included elsewhere in this report. Some of the information contained in this discussion and analysis or set forth elsewhere in this report, including information with respect to our plans and strategy for our business, includes forward-looking statements that involve risks and uncertainties. You should review the Special Note Regarding Forward-Looking Statements and Risk Factors sections of this report for a discussion of important factors that could cause actual results to differ materially from the results described in or implied by the forward-looking statements contained in the following discussion and analysis.\nThe following MD&A includes a discussion comparing our results in fiscal year 2023 to fiscal year 2022. For a discussion of our results of operations comparing fiscal year 2022 to fiscal year 2021 and a discussion of our cash flows for fiscal year 2021, refer to Part II, Item 7, Managements Discussion and Analysis of Financial Condition and Results of Operations, included in our Annual Report on Form 10-K for the fiscal year ended August 31, 2022, filed with the SEC on November 10, 2022.\nOverview\nKura Sushi USA, Inc. is a technology-enabled Japanese restaurant concept that provides guests with a distinctive dining experience by serving authentic Japanese cuisine through an engaging revolving sushi service model, which we refer to as the Kura Experience. We encourage healthy lifestyles by serving freshly prepared Japanese cuisine using high-quality ingredients that are free from artificial seasonings, sweeteners, colorings, and preservatives. We aim to make quality Japanese cuisine accessible to our guests across the United States through affordable prices and an inviting atmosphere.\nBusiness Trends\nDuring fiscal year 2023, we opened ten restaurants and expanded our restaurant base to 50 restaurants in fifteen states and Washington, DC as of the end of fiscal year 2023. We expect to open 11 to 13 new restaurants in fiscal year 2024 and therefore, we expect our revenue and restaurant operating costs to increase in fiscal year 2024. We also expect our general and administrative expenses to increase in fiscal 2024 to support the growth of the company and the compliance requirements of no longer being an emerging growth company.\nWe have experienced inflationary pressures affecting our operations in certain areas such as food and beverage costs, labor costs, construction costs and energy costs. We have been able to offset to some extent these inflationary and other cost pressures through various actions, such as increasing menu prices, productivity improvements, and supply chain initiatives, however, we expect these inflationary and other cost pressures to level out in fiscal year 2024.\nKey Financial Definitions\nSales. Sales represent sales of food and beverages in restaurants. Restaurant sales in a given period are directly impacted by the number of restaurants we operate and comparable restaurant sales growth.\nFood and beverage costs. Food and beverage costs are variable in nature, change with sales volume and are influenced by menu mix and subject to increases or decreases based on fluctuations in commodity costs. Other important factors causing fluctuations in food and beverage costs include seasonality and restaurant-level management of food waste. Food and beverage costs are a substantial expense and are expected to grow proportionally as our sales grow.\nLabor and related expenses. Labor and related expenses include all restaurant-level management and hourly labor costs, including wages, employee benefits and payroll taxes. Similar to the food and beverage costs that we incur, labor and related expenses are expected to grow proportionally as our sales grows. Factors that influence\nfluctuations in our labor and related expenses include minimum wage and payroll tax legislation, the frequency and severity of workers compensation claims, healthcare costs and the performance of our restaurants.\nOccupancy and related expenses. Occupancy and related expenses include rent for all restaurant locations and related taxes.\nDepreciation and amortization expenses. Depreciation and amortization expenses are periodic non-cash charges that consist of depreciation of fixed assets, including equipment and capitalized leasehold improvements. Depreciation is determined using the straight-line method over the assets estimated useful lives, ranging from three to 20 years.\nOther costs. Other costs include utilities, repairs and maintenance, credit card fees, royalty payments to Kura Japan, stock-based compensation expenses for restaurant-level employees and other restaurant-level expenses.\nGeneral and administrative expenses. General and administrative expenses include expenses associated with corporate and regional supervision functions that support the operations of existing restaurants and the development of new restaurants, including compensation and benefits, travel expenses, stock-based compensation expenses for corporate-level employees, legal and professional fees, marketing costs, information systems, corporate office rent and other related corporate costs. General and administrative expenses are expected to grow as our unit base grows, including incremental legal, accounting, insurance and other expenses.\nInterest expense. Interest expense includes cash and non-cash charges related to our line of credit and finance lease obligations.\nInterest income. Interest income includes income earned on our investments.\nIncome tax expense (benefit). Provision for income taxes represents federal, state and local current and deferred income tax expense.\nResults of Operations\nThe following table presents selected comparative results of operations from our audited financial statements for the fiscal year ended August 31, 2023 compared to the fiscal year ended August 31, 2022. Our financial results for these periods are not necessarily indicative of the financial results that we will achieve in future periods. Certain percentage totals for the table below may not sum due to rounding.\nFiscal Years Ended August 31,\n$ Change\n% Change\n(dollar amounts in thousands)\nSales\n$\n187,429\n$\n141,089\n$\n46,340\n32.8\n%\nRestaurant operating costs:\nFood and beverage costs\n56,631\n42,510\n14,121\n33.2\nLabor and related costs\n56,547\n43,997\n12,550\n28.5\nOccupancy and related expenses\n13,141\n9,917\n3,224\n32.5\nDepreciation and amortization expenses\n7,422\n5,258\n2,164\n41.2\nOther costs\n24,911\n17,517\n7,394\n42.2\nTotal restaurant operating costs\n158,652\n119,199\n39,453\n33.1\nGeneral and administrative expenses\n28,035\n22,289\n5,746\n25.8\nDepreciation and amortization expenses\n15.5\nTotal operating expenses\n187,097\n141,843\n45,254\n31.9\nOperating income (loss)\n(754\n)\n1,086\n(144.0\n)\nOther expense (income):\nInterest expense\n(18\n)\n(20.7\n)\nInterest income\n(1,472\n)\n(151\n)\n(1,321\n)\n874.8\nIncome (loss) before income taxes\n1,735\n(690\n)\n2,425\n(351.4\n)\nIncome tax expense\n214.9\nNet income (loss)\n$\n1,502\n$\n(764\n)\n$\n2,266\n(296.6\n)\n%\nFiscal Years Ended August 31,\n(as a percentage of sales)\nSales\n100.0\n%\n100.0\n%\nRestaurant operating costs\nFood and beverage costs\n30.2\n30.1\nLabor and related costs\n30.2\n31.2\nOccupancy and related expenses\n7.0\n7.0\nDepreciation and amortization expenses\n4.0\n3.7\nOther costs\n13.3\n12.4\nTotal restaurant operating costs\n84.6\n84.5\nGeneral and administrative expenses\n15.0\n15.8\nDepreciation and amortization expenses\n0.2\n0.3\nTotal operating expenses\n99.8\n100.5\nOperating income (loss)\n0.2\n(0.5\n)\nOther expense (income):\nInterest expense\n0.0\n0.1\nInterest income\n(0.8\n)\n(0.1\n)\nIncome (loss) before income taxes\n0.9\n(0.5\n)\nIncome tax expense\n0.1\n0.1\nNet income (loss)\n0.8\n%\n(0.5\n)\n%\nFiscal Year Ended August 31, 2023 Compared to Fiscal Year Ended August 31, 2022\nSales. Sales were $187.4 million for fiscal year 2023 compared to $141.1 million for fiscal year 2022, representing an increase of $46.3 million, or 32.8%. Comparable restaurant sales increased 9.5% for fiscal year 2023 as compared to fiscal year 2022. AUV was $4.3 million for fiscal year 2023 compared to $3.8 million for fiscal year 2022. The increase in sales was primarily driven by the sales resulting from ten new restaurants opened during fiscal year 2023, as well as increases in menu prices during the same period.\nFood and beverage costs. Food and beverage costs were $56.6 million for fiscal year 2023 compared to $42.5 million for fiscal year 2022, representing an increase of $14.1 million, or 33.2%. This increase was primarily driven by costs associated with sales from ten new restaurants opened during fiscal year 2023. As a percentage of sales, food and beverage costs remained consistent at 30.2% in fiscal year 2023, as compared to 30.1% in fiscal year 2022.\nLabor and related costs. Labor and related costs were $56.5 million for fiscal year 2023 compared to $44.0 million for fiscal year 2022, representing an increase of $12.5 million, or 28.5%. This increase in labor and related costs was primarily driven by additional labor costs incurred from ten new restaurants opened during fiscal year 2023. As a percentage of sales, labor and related costs decreased to 30.2% in fiscal year 2023, compared to 31.2% in fiscal year 2022. The decrease in cost as a percentage of sales was primarily due to increases in menu prices and technological initiatives, partially offset by increases in wage rates.\nOccupancy and related expenses. Occupancy and related expenses were $13.1 million for fiscal year 2023 compared to $9.9 million for fiscal year 2022, representing an increase of $3.2 million, or 32.5%. This increase was primarily a result of additional lease expense incurred with respect to ten new restaurants that opened during fiscal year 2023. As a percentage of sales, occupancy and other operating expenses remained consistent at 7.0% in fiscal year 2023 and fiscal year 2022.\nDepreciation and amortization expenses. Depreciation and amortization expenses incurred as part of restaurant operating costs were $7.4 million for fiscal year 2023 compared to $5.3 million for fiscal year 2022, representing an increase of $2.1 million or 41.2%. This increase was primarily due to the depreciation of property and equipment related to the opening of ten new restaurants in fiscal year 2023. As a percentage of sales, depreciation and amortization expenses at the restaurant-level increased to 4.0% in fiscal year 2023 as compared to 3.7% in fiscal year 2022. Depreciation and amortization expenses incurred at the corporate level were $0.4 million for fiscal year 2023 as compared to $0.3 million for fiscal year 2022, and as a percentage of sales were 0.2% and 0.3%, respectively.\nOther costs. Other costs were $24.9 million for fiscal year 2023 compared to $17.5 million for fiscal year 2022, representing an increase of $7.4 million, or 42.2%. The increase was primarily driven by an increase in costs related to ten new restaurants opened in fiscal year 2023. As a percentage of sales, other costs increased to 13.3% in fiscal year 2023 from 12.4% in fiscal year 2022, primarily driven by general inflationary pressures on advertising costs, repair and maintenance fees, utilities and restaurant supplies.\nGeneral and administrative expenses. General and administrative expenses were $28.0 million for fiscal year 2023 compared to $22.3 million for fiscal year 2022, representing an increase of $5.7 million, or 25.8%. This increase was primarily due to increases in compensation related costs of $4.9 million due to additional headcount, $0.5 million in travel expenses and $0.3 million in professional fees. As a percentage of sales, general and administrative expenses decreased to 15.0% in fiscal year 2023 from 15.8% in fiscal year 2022, primarily driven by leverage benefits from the increase in sales.\nInterest expense. Interest expense was $69 thousand for fiscal year 2023 and $87 thousand for fiscal year 2022.\nInterest income. Interest income was $1.5 million for fiscal year 2023 and $0.2 million for fiscal year 2022. The increase was primarily driven by investing our net cash proceeds from our $64.3 million follow-on offering completed in April 2023 into cash and cash equivalents and short-term investments.\nIncome tax expense. Income tax expense was $0.2 million for fiscal year 2023 and $0.1 million for fiscal year 2022. For further discussion of our income taxes, see Note 12 - Income Taxes.\nKey Performance Indicators\nIn assessing the performance of our business, we consider a variety of financial and performance measures. The key measures for determining how our business is performing include sales, EBITDA, Adjusted EBITDA, Restaurant-level Operating Profit, Restaurant-level Operating Profit margin, Average Unit Volumes (AUVs), comparable restaurant sales performance, and the number of restaurant openings.\nSales\nSales represents sales of food and beverages in restaurants, as shown on our statements of operations and comprehensive income (loss). Several factors affect our restaurant sales in any given period including the number of restaurants in operation, guest traffic and average check.\nEBITDA and Adjusted EBITDA\nEBITDA is defined as net income (loss) before interest, income taxes and depreciation and amortization. Adjusted EBITDA is defined as EBITDA plus stock-based compensation expense, non-cash lease expense and asset disposals, closure costs and restaurant impairments, as well as certain items, such as employee retention credit, litigation accrual, and certain executive transition costs, that we believe are not indicative of our core operating results. Adjusted EBITDA margin is defined as Adjusted EBITDA divided by sales. EBITDA, Adjusted EBITDA and Adjusted EBITDA margin are non-GAAP measures which are intended as supplemental measures of our performance and are neither required by, nor presented in accordance with, GAAP. We believe that EBITDA, Adjusted EBITDA and Adjusted EBITDA margin provide useful information to management and investors regarding certain financial and business trends relating to our financial condition and operating results. However, these measures may not provide a complete understanding of the operating results of the Company as a whole and such measures should be reviewed in conjunction with our GAAP financial results.\nWe believe that the use of EBITDA, Adjusted EBITDA and Adjusted EBITDA margin provides an additional tool for investors to use in evaluating ongoing operating results and trends and in comparing our financial measures with those of comparable companies, which may present similar non-GAAP financial measures to investors. However, you should be aware when evaluating EBITDA, Adjusted EBITDA and Adjusted EBITDA margin that in the future we may incur expenses similar to those excluded when calculating these measures. In addition, our presentation of these measures should not be construed as an inference that our future results will be unaffected by unusual or non-recurring items. Our computation of Adjusted EBITDA and Adjusted EBITDA margin may not be comparable to other similarly titled measures computed by other companies, because all companies may not calculate Adjusted EBITDA and Adjusted EBITDA margin in the same fashion.\nBecause of these limitations, EBITDA, Adjusted EBITDA and Adjusted EBITDA margin should not be considered in isolation or as a substitute for performance measures calculated in accordance with GAAP. We compensate for these limitations by relying primarily on our GAAP results and using EBITDA, Adjusted EBITDA and Adjusted EBITDA margin on a supplemental basis. You should review the reconciliation of net (loss) income to EBITDA, Adjusted EBITDA and Adjusted EBITDA margin below and not rely on any single financial measure to evaluate our business.\nThe following table reconciles net income (loss) to EBITDA, Adjusted EBITDA and Adjusted EBITDA margin for the fiscal years ended August 31, 2023 and August 31, 2022:\nFiscal Years Ended August 31,\n(amounts in thousands)\nNet income (loss)\n$\n1,502\n$\n(764\n)\nInterest (income) expense, net\n(1,403\n)\n(64\n)\nTaxes\nDepreciation and amortization\n7,832\n5,613\nEBITDA\n8,164\n4,859\nStock-based compensation expense(a)\n3,550\n2,409\nNon-cash lease expense(b)\n2,628\n1,712\nExecutive transition costs(c)\n-\nAdjusted EBITDA\n14,342\n9,155\nAdjusted EBITDA margin\n7.7\n%\n6.5\n%\n_______________\n(a)Stock-based compensation expense includes non-cash stock-based compensation, which is comprised of restaurant-level stock-based compensation included in other costs in the statements of operations and comprehensive income (loss) and of corporate-level stock-based compensation included in general and administrative expenses in the statements of operations and comprehensive income (loss), see Note 6 - Stock-based Compensation to the financial statements in this Annual Report on Form 10-K.\n(b)Non-cash lease expense includes lease expense from the date of possession of our restaurants that did not require cash outlay in the respective periods.\n(c)Executive transition costs include severance and search fees associated with the transition of our Chief Financial Officer.\nRestaurant-level Operating Profit (Loss) and Restaurant-level Operating Profit (Loss) Margin\nRestaurant-level Operating Profit (Loss) is defined as operating income (loss) plus depreciation and amortization; stock-based compensation expense; pre-opening costs and general and administrative expenses which are considered normal, recurring, cash operating expenses and are essential to support the development and operations of our restaurants; non-cash lease expense; asset disposals, closure costs and restaurant impairments; less corporate-level stock-based compensation expense and employee retention credit recognized within general and administrative expenses. Restaurant-level Operating Profit (Loss) margin is defined as Restaurant-level Operating Profit (Loss) divided by sales. Restaurant-level Operating Profit (Loss) and Restaurant-level Operating Profit (Loss) margin are intended as supplemental measures of our performance and are neither required by, nor presented in accordance with, GAAP. We believe that Restaurant-level Operating Profit (Loss) and Restaurant-level Operating Profit (Loss) margin provide useful information to management and investors regarding certain financial and business trends relating to our financial condition and operating results, as this measure depicts normal, recurring cash operating expenses essential to supporting the development and operations of our restaurants. However, these measures may not provide a complete understanding of the operating results of the Company as a whole and such measures should be reviewed in conjunction with our GAAP financial results. We expect Restaurant-level Operating Profit (Loss) to increase in proportion to the number of new restaurants we open and our comparable restaurant sales growth.\nWe present Restaurant-level Operating Profit (Loss) because it excludes the impact of general and administrative expenses, which are not incurred at the restaurant-level. We also use Restaurant-level Operating Profit (Loss) to measure operating performance and returns from opening new restaurants. Restaurant-level Operating Profit (Loss) margin allows us to evaluate the level of Restaurant-level Operating Profit (Loss) generated from sales.\nHowever, you should be aware that Restaurant-level Operating Profit (Loss) and Restaurant-level Operating Profit (Loss) margin are financial measures which are not indicative of overall results for the Company, and\nRestaurant-level Operating Profit (Loss) and Restaurant-level Operating Profit (Loss) margin do not accrue directly to the benefit of stockholders because of corporate-level expenses excluded from such measures.\nIn addition, when evaluating Restaurant-level Operating Profit (Loss) and Restaurant-level Operating Profit (Loss) margin, you should be aware that in the future we may incur expenses similar to those excluded when calculating these measures. Our presentation of these measures should not be construed as an inference that our future results will be unaffected by unusual or non-recurring items. Our computation of Restaurant-level Operating Profit (Loss) and Restaurant-level Operating Profit (Loss) margin may not be comparable to other similarly titled measures computed by other companies, because all companies may not calculate Restaurant-level Operating Profit (Loss) and Restaurant-level Operating Profit (Loss) margin in the same fashion. Restaurant-level Operating Profit (Loss) and Restaurant-level Operating Profit (Loss) margin have limitations as analytical tools, and you should not consider them in isolation or as substitutes for analysis of our results as reported under GAAP.\nThe following table reconciles operating income (loss) to Restaurant-level Operating Profit (Loss) and Restaurant-level Operating Profit (Loss) margin for the fiscal years ended August 31, 2023 and August 31, 2022:\nFiscal Years Ended August 31,\n(amounts in thousands)\nOperating income (loss)\n$\n$\n(754\n)\nDepreciation and amortization\n7,832\n5,613\nStock-based compensation expense(a)\n3,550\n2,409\nPre-opening costs(b)\n1,730\nNon-cash lease expense(c)\n2,628\n1,712\nGeneral and administrative expenses\n28,035\n22,289\nCorporate-level stock-based compensation included in general and administrative expenses\n(3,044\n)\n(2,112\n)\nRestaurant-level operating profit\n41,063\n29,941\nOperating income (loss) margin\n0.2\n%\n(0.5\n)%\nRestaurant-level operating profit margin\n21.9\n%\n21.2\n%\n_______________\n(a)Stock-based compensation expense includes non-cash stock-based compensation, which is comprised of restaurant-level stock-based compensation included in other costs in the statements of operations and comprehensive income (loss) and of corporate-level stock-based compensation included in general and administrative expenses in the statements of operations and comprehensive income (loss), see Note 6 - Stock-based Compensation to the financial statements in this Annual Report on Form 10-K.\n(b)Pre-opening costs consist of labor costs and travel expenses for new employees and trainers during the training period, recruitment fees, legal fees, cash-based lease expenses incurred between the date of possession and opening day of our restaurants, and other related pre-opening costs.\n(c)Non-cash lease expense includes lease expense from the date of possession of our restaurants that did not require cash outlay in the respective periods\nAverage Unit Volumes (AUVs)\nAverage Unit Volumes or AUVs consist of the average annual sales of all restaurants that have been open for 18 months or longer at the end of the fiscal year presented due to new restaurants experiencing a period of higher sales upon opening. AUVs are calculated by dividing (x) annual sales for the fiscal year presented for all such restaurants by (y) the total number of restaurants in that base. We make fractional adjustments to sales for restaurants that were not open for the entire fiscal year presented (such as a restaurant closed for renovation) to annualize sales for such period. This measurement allows management to assess changes in consumer spending patterns at our restaurants and the overall performance of our restaurant base.\nThe following table shows the AUVs for the fiscal years ended August 31, 2023 and August 31, 2022:\nFiscal Years Ended August 31,\n(in thousands)\nAverage Unit Volumes\n$\n4,281\n$\n3,825\nComparable Restaurant Sales Performance\nComparable restaurant sales performance refers to the change in year-over-year sales for the comparable restaurant base. We include restaurants in the comparable restaurant base that have been in operation for at least 18 months prior to the start of the accounting period presented due to new restaurants experiencing a period of higher sales upon opening, including those temporarily closed for renovations during the year. For restaurants that were temporarily closed for renovations during the year, we make fractional adjustments to sales such that sales are annualized in the associated period.\nMeasuring our comparable restaurant sales performance allows us to evaluate the performance of our existing restaurant base. Various factors impact comparable restaurant sales, including:\nconsumer recognition of our brand and our ability to respond to changing consumer preferences;\noverall economic trends, particularly those related to consumer spending;\nour ability to operate restaurants effectively and efficiently to meet consumer expectations;\npricing;\nguest traffic;\nper-guest spend and average check;\nmarketing and promotional efforts;\nlocal competition; and\nopening of new restaurants in the vicinity of existing locations.\nSince opening new restaurants will be a significant component of our sales growth, comparable restaurant sales performance is only one measure of how we evaluate our performance. The following table shows the comparable restaurant sales performance for the fiscal years ended August 31, 2023 and August 31, 2022:\nFiscal Years Ended August 31,\nComparable restaurant sales performance (%)\n9.5\n%\n81.9\n%\nComparable restaurant base\nNumber of Restaurant Openings\nThe number of restaurant openings reflects the number of restaurants opened during a particular reporting period. Before we open new restaurants, we incur pre-opening costs. New restaurants may not be profitable, and their sales performance may not follow historical patterns. The number and timing of restaurant openings has had, and is expected to continue to have, an impact on our results of operations. The following table shows the growth in our restaurant base for the fiscal years ended August 31, 2023 and August 31, 2022:\nFiscal Years Ended August 31,\nRestaurant activity:\nBeginning of period\nOpenings\nEnd of period\nLiquidity and Capital Resources\nOur primary uses of cash are for operational expenditures and capital investments, including new restaurants, costs incurred for restaurant remodels and restaurant fixtures.\nOn April 13, 2023, we completed an underwritten public offering of common stock pursuant to our universal shelf registration statement on Form S-3, selling an aggregate of 1,265,000 shares of Class A common stock, including the exercise in full of the underwriters option to purchase 165,000 additional shares, at the price of $54.00 per share less an underwriting discount of $2.70 per share. We received aggregate net proceeds of $64.3 million after deducting the underwriting discounts and commissions and offering expenses payable by us. The proceeds are to be used for general corporate purposes, including capital expenditures, working capital, and other business purposes. No payments were made by us to directors, officers or persons owning 10% or more of our common stock or to their associates, or to our affiliates.\nAs of August 31, 2023, we had no outstanding borrowings under the Revolving Credit Agreement and have $45.0 million of availability remaining. As of August 31, 2023, we did not have any material off-balance sheet arrangements.\nThe significant components of our working capital are liquid assets such as cash and cash equivalents, receivables and short-term investments reduced by accounts payable and accrued expenses. Our working capital position benefits from the fact that we generally collect cash from sales to guests the same day or, in the case of credit or debit card transactions, within several days of the related sale, while we typically have longer payment terms with our vendors.\nWe believe that cash provided by operating activities, cash on hand, short-term investments and availability under our existing line of credit will be sufficient to fund our lease obligations, capital expenditures and working capital needs for at least the next 12 months.\nSummary of Cash Flows\nOur primary sources of liquidity and cash flows are operating cash flows, cash on hand and short-term investments. We use this to fund investing expenditures for new restaurant openings, reinvest in our existing restaurants, and increase our working capital. Our working capital position benefits from the fact that we generally collect cash from sales to guests the same day, or in the case of credit or debit card transactions, within several days of the related sale, and we typically have at least 30 days to pay our vendors.\nThe following table summarizes our cash flows for the periods presented:\nFiscal Years Ended August 31,\n(amounts in thousands)\nStatement of Cash Flow Data:\nNet cash provided by operating activities\n$\n18,064\n$\n23,694\nNet cash used in investing activities\n(49,903\n)\n(28,172\n)\nNet cash provided by (used in) financing activities\n65,754\n(170\n)\nCash Flows Provided by Operating Activities\nNet cash provided by operating activities during the fiscal year 2023 was $18.1 million, which primarily results from net income of $1.5 million, non-cash charges of $7.8 million for depreciation and amortization, $3.6 million for stock-based compensation, $3.7 million in noncash lease expense, and net cash inflows of $1.3 million from changes in operating assets and liabilities. The net cash inflows from changes in operating assets and liabilities were primarily the result of increases of $1.7 million of accounts payable and $1.6 million for salary and wages payable, $0.3 million in sales tax payable offset by decreases of $1.2 million in prepaid expenses and other current assets, $0.6 million of inventory, $0.3 million in accrued expenses and other current liabilities and $0.4 million of accounts and other receivables.\nNet cash provided by operating activities during the fiscal year 2022 was $23.7 million, which results from net loss of $0.8 million, non-cash charges of $5.6 million for depreciation and amortization, $2.4 million for stock-based compensation, $3.2 million in noncash lease expense, and net cash inflows of $13.2 million from changes in operating assets and liabilities. The net cash inflows from changes in operating assets and liabilities were primarily the result of increases of $0.9 million for accrued expenses and other current liabilities and $1.3 million for salary and wages payable, as well as an increase of $11.5 million in prepaid expenses and other current assets. The increase in the above-mentioned items was primarily due to the timing of cash payments. The increase in cash inflows from prepaid expenses and other current assets was primarily due to employee retention credit refunds received under the CARES Act.\nCash Flows Used in Investing Activities\nNet cash used in investing activities during the fiscal year 2023 was $49.9 million, primarily due to $9.3 million in purchases of short-term investments, $39.1 million in purchases of property and equipment and $1.7 million in purchases of liquor licenses offset by $0.8 million of redemption of short-term investments. The increase in purchases of property and equipment in fiscal year 2023 is primarily related to capital expenditures for current and future restaurant openings and renovations, maintaining our existing restaurants and other projects.\nNet cash used in investing activities during the fiscal year 2022 was $28.2 million, primarily due to purchases of property and equipment. The increase in purchases of property and equipment in fiscal year 2022 is primarily related to capital expenditures for current and future restaurant openings, maintaining our existing restaurants and other projects.\nCash Flows Provided by (Used in) Financing Activities\nNet cash provided by financing activities during fiscal year 2023 was $65.8 million, primarily due to aggregate net proceeds of $64.3 million after deducting the underwriting discounts and commissions and offering expenses payable, and $2.0 million of proceeds from exercise of stock options offset by $0.5 million in repayments of principal on finance leases.\nNet cash used in financing activities during fiscal year 2022 was $0.2 million, primarily due to $1.0 million repayment of principal on financing leases of equipment, $0.2 million taxes paid on vested restricted stock awards, partially offset by $1.0 million proceeds from stock option exercises.\nMaterial Cash Requirements\nAs of August 31, 2023, we had $9.8 million in contractual obligations relating to the construction of new restaurants and purchase commitments for goods related to restaurant operations. All contractual obligations are expected to be paid during the next 12 months utilizing cash and cash equivalents on hand and provided by operations. For operating and finance lease obligations, see Note 4 - Leases to the financial statements included in this Annual Report on Form 10-K.\nCritical Accounting Policies and Estimates\nOur discussion and analysis of operating results and financial condition are based upon our financial statements. The preparation of our financial statements in accordance with GAAP requires us to make estimates and assumptions that affect the reported amounts of assets, liabilities, sales, expenses and related disclosures of contingent assets and liabilities. We base our estimates on past experience and other assumptions that we believe are reasonable under the circumstances, and we evaluate these estimates on an ongoing basis.\nOur critical accounting policies are those that materially affect our financial statements. Our critical accounting estimates are those that involve subjective or complex judgments by management. Although these estimates are based on managements best knowledge of current events and actions that may impact us in the future, actual results may be materially different from the estimates. We believe the following impairment of long-lived assets estimate is affected by significant judgments and estimates used in the preparation of our financial statements and that the judgments and estimates are reasonable.\nOperating Leases\nWe currently lease all of our restaurant locations and our corporate office. At the commencement of a lease, we determine the appropriate classification as an operating lease or a finance lease. All of our restaurant and office leases are classified as operating leases.\nOur office leases provide for fixed minimum rent payments. Most of our restaurants provide for fixed minimum rent payments and some require additional contingent rent payments based upon sales in excess of specified thresholds. When such sales thresholds are deemed probable, contingent rent is accrued in proportion to the sales recognized in the period. We recognize rent expense based on the straight-line method for operating leases that include free-rent periods and rent escalation clauses. For the purpose of calculating rent expenses under the straight-line method, the lease term commences on the date we obtain control of the property. Lease incentives used to fund leasehold improvements are recognized when probable of being earned upon signing the lease and reduce the operating right-of-use asset related to the lease. These incentives are amortized through the operating right-of-use asset as reductions of expense over the lease term. Restaurant lease expense is included in the occupancy and related expenses financial statement line item, while office lease expense is included in general and administrative expenses financial statement line item, on the accompanying financial statements.\nImpairment of Long-Lived Assets\nWe assess potential impairments of our long-lived assets, which includes property and equipment and operating lease right-of-use assets, in accordance with the provisions of Financial Accounting Standards Board (FASB) Accounting Standards Codification (ASC) 360-Property, Plant and Equipment. An impairment test is performed on an annual basis or whenever events or changes in circumstances indicate that the carrying value of the assets may not be recoverable. In determining the recoverability of the asset value, an analysis is performed at the individual restaurant level. Assets are grouped at the individual restaurant level for purposes of the impairment assessment because a restaurant represents the lowest level for which identifiable cash flows are largely independent of the cash flows of other assets and liabilities. Recoverability of an asset group is measured by a comparison of the carrying amount of an asset group to its estimated undiscounted forecasted restaurant cash flows expected to be generated by the asset group. Factors considered by us in estimating future cash flows include but are not limited to: significant underperformance relative to expected historical or projected future operating results; significant changes in the manner of use of the acquired assets; and significant negative industry or economic trends. The estimated undiscounted forecasted cash flows include assumptions made by management regarding certain items such as revenue, food and beverage costs, labor costs, occupancy costs, and other restaurant operating costs and therefore are subject to uncertainty as our actual results may differ from our estimates. If the carrying amount of the asset group exceeds its estimated undiscounted future cash flows, an impairment charge is recognized as the amount by which the carrying amount of the asset exceeds the fair value of the asset.\nThere were no impairment tests performed for the fiscal years ended August 31, 2023 or August 31, 2022 and no impairment loss was recognized during fiscal years ended August 31, 2023 and August 31, 2022.\nJumpstart Our Business Startups Act of 2012\nWe qualify as an emerging growth company as defined in Section 2(a)(19) of the Securities Act, as modified by the JOBS Act. Section 107 of the JOBS Act provides that an emerging growth company can take advantage of the extended transition period provided in Section 7(a)(2)(B) of the Securities Act for complying with new or revised accounting standards. In other words, an emerging growth company can delay the adoption of certain accounting standards until those standards would otherwise apply to private companies. We have irrevocably elected not to avail ourselves of this extended transition period and, as a result, we will adopt new or revised accounting standards on the relevant dates on which adoption of such standards is required for other public companies.\nSubject to certain conditions set forth in the JOBS Act, we are also eligible for and intend to take advantage of certain exemptions from various reporting requirements applicable to other public companies that are not emerging growth companies, including (i) the exemption from the auditor attestation requirements with respect to internal control over financial reporting under Section 404 of the Sarbanes-Oxley Act, (ii) the exemptions from say-on-pay, say-on-frequency and say-on-golden parachute voting requirements and (iii) reduced disclosure obligations regarding executive compensation in our periodic reports and proxy statements. We may take advantage of these exemptions until we are no longer an emerging growth company. We will continue to be an emerging growth company until the earliest to occur of (i) the last day of the fiscal year in which the market value of our Class A common stock that is held by non-affiliates exceeds $700 million as of June 30 of that fiscal year, (ii) the last day of the fiscal year in which our annual gross revenues exceed $1.235 billion during such fiscal year (as indexed for inflation), (iii) the date on which we have issued more than $1 billion in non-convertible debt in the prior three-year period or (iv) the last day of the fiscal year following the fifth anniversary of the date of the completion of our IPO, or August 31, 2024. Item 7A. Quantitative and Qualitative Disclosure of Market Risks\nCommodity and Food Price Risks\nOur profitability is dependent on, among other things, our ability to anticipate and react to changes in the costs of key operating resources, including food and beverages and other commodities. We have been able to partially offset cost increases resulting from a number of factors, including market conditions, shortages or interruptions in supply due to weather or other conditions beyond our control, governmental regulations, and inflation, by increasing our menu prices, as well as making other operational adjustments that increase productivity. However, substantial increases in costs and expenses could impact our operating results to the extent that menu prices increase or operational adjustments cannot offset such increases.\nInflation Risk\nThe primary inflationary factors affecting our operations are food and beverage costs, labor costs, construction costs and energy costs. Our restaurant operations are subject to federal and state minimum wage and other laws governing working conditions, overtime and tip credits. Significant numbers of our restaurant personnel are paid at rates related to the federal and/or state minimum wage and, accordingly, increases in the minimum wage increase our labor costs. To the extent permitted by competition and the economy, we have mitigated increased costs by increasing menu prices and may continue to do so if deemed necessary in future years. Substantial increases in costs and expenses could impact our operating results to the extent such increases cannot be passed through to our guests. Historically, inflation has not had a material effect on our results of operations, although inflationary pressures have increased across our business, including with respect to food and beverage costs, due in part to supply chain impacts of overall economic conditions in the markets in which we operate. Severe increases in inflation, however, could affect the global and U.S. economies and could have an adverse impact on our business, financial condition or results of operations.\nWhile we have been able to partially offset inflation and other changes in the costs of core operating resources by gradually increasing menu prices, coupled with more efficient purchasing practices, productivity improvements and greater economies of scale, there can be no assurance that we will be able to continue to do so in the future. From time to time, competitive conditions could limit our menu pricing flexibility. In addition, macroeconomic conditions could make additional menu price increases imprudent. There can be no assurance that increased menu prices can offset future cost increases or that our guests will fully absorb increased menu prices without any resulting change to their visit frequencies or purchasing patterns. In addition, there can be no assurance that we will generate the same sales growth in an amount sufficient to offset inflationary or other cost pressures. Item 8.\tFinancial Statements and Supplementary Data\nPage\nReport of Independent Registered Public Accounting Firm\nBalance Sheets\nStatements of Operations and Comprehensive Income (Loss)\nStatements of Stockholders Equity\nStatements of Cash Flows\nNotes to Financial Statements\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and Board of Directors\nKura Sushi USA, Inc.:\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of Kura Sushi USA, Inc. (the Company) as of August 31, 2023 and 2022, the related statements of operations and comprehensive income (loss), stockholders equity, and cash flows for each of the years in the three-year period ended August 31, 2023, and the related notes (collectively, the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of August 31, 2023 and 2022, and the results of its operations and its cash flows for each of the years in the three-year period ended August 31, 2023, in conformity with U.S. generally accepted accounting principles.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on these financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\n/s/ KPMG LLP\nWe have served as the Companys auditor since 2020.\nIrvine, California\nNovember 8, 2023\nKura Sushi USA, Inc.\nBalance Sheets\n(amounts in thousands, except par value)\nAs of August 31,\nAssets\nCurrent assets:\nCash and cash equivalents\n$\n69,697\n$\n35,782\nShort-term investments\n8,542\n-\nAccounts and other receivables\n5,048\n2,486\nInventories\n1,747\n1,120\nDue from affiliate\nPrepaid expenses and other current assets\n4,233\n2,852\nTotal current assets\n89,371\n42,396\nNon-current assets:\nProperty and equipment - net\n106,427\n75,590\nOperating lease right-of-use assets\n103,884\n79,990\nDeposits and other assets\n4,977\n3,380\nTotal assets\n$\n304,659\n$\n201,356\nLiabilities and stockholders' equity\nCurrent liabilities:\nAccounts payable\n$\n7,248\n$\n5,559\nAccrued expenses and other current liabilities\n2,751\n3,731\nSalaries and wages payable\n7,595\n5,955\nFinance leases - current\nOperating lease liabilities - current\n9,225\n7,992\nDue to affiliate\nSales tax payable\n1,694\n1,240\nTotal current liabilities\n29,138\n25,269\nNon-current liabilities:\nFinance leases - non-current\nOperating lease liabilities - non-current\n110,234\n82,280\nOther liabilities\nTotal liabilities\n140,018\n108,062\nCommitments and contingencies (Note 11)\nStockholders' equity:\nPreferred stock, $0.001 par value; 1,000 shares authorized, no shares\nissued or outstanding\n-\n-\nClass A common stock, $0.001 par value; 50,000 authorized, 10,147 and\n8,788 issued and outstanding as of August 31, 2023 and August 31,\n2022, respectively\nClass B common stock, $0.001 par value; 10,000 authorized, 1,000 issued\nand outstanding as of August 31, 2023 and August 31, 2022\nAdditional paid-in capital\n188,771\n118,970\nAccumulated deficit\n(24,184\n)\n(25,686\n)\nAccumulated other comprehensive income\n-\nTotal stockholders' equity\n164,641\n93,294\nTotal liabilities and stockholders' equity\n$\n304,659\n$\n201,356\nSee accompanying notes to financial statements\nKura Sushi USA, Inc.\nStatements of Operations and Comprehensive Income (Loss)\n(amounts in thousands, except income (loss) per share data)\nFiscal Years Ended August 31,\nSales\n$\n187,429\n$\n141,089\n$\n64,891\nRestaurant operating costs:\nFood and beverage costs\n56,631\n42,510\n20,686\nLabor and related costs\n56,547\n43,997\n16,430\nOccupancy and related expenses\n13,141\n9,917\n7,093\nDepreciation and amortization expenses\n7,422\n5,258\n4,126\nOther costs\n24,911\n17,517\n10,448\nTotal restaurant operating costs\n158,652\n119,199\n58,783\nGeneral and administrative expenses\n28,035\n22,289\n15,701\nDepreciation and amortization expenses\nTotal operating expenses\n187,097\n141,843\n74,880\nOperating income (loss)\n(754\n)\n(9,989\n)\nOther expense (income):\nInterest expense\nInterest income\n(1,472\n)\n(151\n)\n(20\n)\nIncome (loss) before income taxes\n1,735\n(690\n)\n(10,189\n)\nIncome tax expense\nNet income (loss)\n$\n1,502\n$\n(764\n)\n$\n(10,295\n)\nNet income (loss) per Class A and Class B shares\nBasic\n$\n0.15\n$\n(0.08\n)\n$\n(1.21\n)\nDiluted\n$\n0.14\n$\n(0.08\n)\n$\n(1.21\n)\nWeighted average Class A and Class B shares\nBasic\n10,305\n9,719\n8,528\nDiluted\n10,640\n9,719\n8,528\nOther comprehensive income:\nUnrealized gain on short-term investments\n$\n-\n$\n-\nComprehensive income (loss)\n$\n1,545\n$\n(764\n)\n$\n(10,295\n)\nSee accompanying notes to financial statements\nKura Sushi USA, Inc.\nStatements of Stockholders Equity\n(amounts in thousands)\nCommon Stock\nAdditional\nAccumulated\nTotal\nClass A\nClass B\nPaid-in\n(Accumulated\nOther\nComprehensive\nStockholders'\nShares\nAmount\nShares\nAmount\nCapital\nDeficit)\nIncome\nEquity\nBalances as of August 31, 2020\n7,342\n$\n1,000\n$\n$\n60,332\n$\n(14,627\n)\n$\n-\n$\n45,713\nStock-based compensation\n-\n-\n-\n-\n1,409\n-\n-\n1,409\nExercise of stock options\n-\n-\n-\n-\n-\nIssuance of common stock in connection with follow-on public offering, net of underwriter discounts and issuance costs\n1,265\n-\n-\n53,500\n-\n-\n53,502\nNet loss\n-\n-\n-\n-\n-\n(10,295\n)\n-\n(10,295\n)\nBalances as of August 31, 2021\n8,700\n$\n1,000\n$\n$\n115,756\n$\n(24,922\n)\n$\n-\n$\n90,844\nStock-based compensation\n2,409\n-\n2,409\nEmployee stock plan\n-\n-\n-\n-\n-\nTaxes paid on vested restricted stock awards\n-\n-\n-\n-\n(154\n)\n-\n-\n(154\n)\nNet loss\n-\n-\n-\n-\n-\n(764\n)\n-\n(764\n)\nBalances as of August 31, 2022\n8,788\n$\n1,000\n$\n$\n118,970\n$\n(25,686\n)\n$\n-\n$\n93,294\nStock-based compensation\n-\n-\n-\n-\n3,550\n-\n3,550\nEmployee stock plan\n-\n-\n1,957\n-\n1,957\nIssuance of common stock in connection with follow-on public offering, net of underwriter discounts and issuance costs\n1,265\n-\n-\n64,294\n-\n64,295\nNet income\n-\n-\n-\n-\n-\n1,502\n-\n1,502\nOther comprehensive income\n-\n-\n-\n-\n-\n-\nBalances as of August 31, 2023\n10,147\n$\n1,000\n$\n$\n188,771\n$\n(24,184\n)\n$\n$\n164,641\nSee accompanying notes to financial statements\nKura Sushi USA, Inc.\nStatements of Cash Flows\n(amounts in thousands)\nFiscal Years Ended August 31,\nCash flows from operating activities\nNet income (loss)\n$\n1,502\n$\n(764\n)\n$\n(10,295\n)\nAdjustments to reconcile net income (loss) to net cash provided by\n(used in) operating activities\nDepreciation and amortization\n7,832\n5,613\n4,522\nStock-based compensation\n3,550\n2,409\n1,409\nGain on short-term investments\n-\n-\nLoss on disposal of property and equipment\nNoncash lease expense\n3,748\n3,192\n2,663\nChanges in operating assets and liabilities:\nAccounts and other receivables\n(353\n)\n(131\n)\n(264\n)\nInventories\n(627\n)\n(387\n)\n(366\n)\nDue from affiliate\n(317\n)\nPrepaid expenses and other current assets\n(1,151\n)\n11,496\n(10,946\n)\nDeposits and other assets\n(326\n)\n(61\n)\nAccounts payable\n1,678\n(172\n)\nAccrued expenses and other current liabilities\n(336\n)\n2,312\nSalary and wages payable\n1,640\n1,343\n2,827\nOperating lease liabilities\n(113\n)\n(61\n)\n(411\n)\nDue to affiliate\nSales tax payable\nNet cash provided by (used in) operating activities\n18,064\n23,694\n(7,146\n)\nCash flows from investing activities\nPayments for property and equipment\n(39,068\n)\n(26,766\n)\n(14,076\n)\nPayments for initial direct costs\n(550\n)\n(510\n)\n(436\n)\nPayments for purchases of liquor licenses\n(1,743\n)\n(896\n)\n(156\n)\nPurchases of short-term investments\n(9,292\n)\n-\n-\nRedemption of short- term investments\n-\n-\nNet cash used in investing activities\n(49,903\n)\n(28,172\n)\n(14,668\n)\nCash flows from financing activities\nRepayment of principal on finance leases\n(498\n)\n(975\n)\n(1,032\n)\nTaxes paid on vested restricted stock awards\n-\n(154\n)\n-\nProceeds from stock option exercises\n1,957\nProceeds from loan from affiliate\n-\n-\n17,000\nRepayment of loan from affiliate\n-\n-\n(17,000\n)\nProceeds from follow-on public offering, net of discounts\nand commissions\n64,895\n-\n54,108\nPayments of costs related to the follow-on offering\n(600\n)\n-\n(606\n)\nNet cash (used in) provided by financing activities\n65,754\n(170\n)\n52,985\n(Decrease) increase in cash and cash equivalents\n33,915\n(4,648\n)\n31,171\nCash and cash equivalents, beginning of year\n35,782\n40,430\n9,259\nCash and cash equivalents, end of year\n$\n69,697\n$\n35,782\n$\n40,430\nSupplemental disclosures of cash flow information\nCash paid for interest\n-\n-\n$\nCash paid for income taxes (net of refunds)\n$\n$\n$\nNoncash investing activities\nAcquisition of finance leases\n$\n$\n$\nAmounts unpaid for purchases of property and equipment\n$\n1,621\n$\n1,933\n$\n1,094\nSee accompanying notes to financial statements\nKura Sushi USA, Inc.\nNotes to Financial Statements\nNote 1-Organization and Description of Business\nKura Sushi USA, Inc. (the Company) is a technology-enabled Japanese restaurant concept that provides guests with a distinctive dining experience by serving authentic Japanese cuisine through an engaging revolving sushi service model, which the Company refers to as the Kura Experience. Kura Sushi encourages healthy lifestyles by serving freshly prepared Japanese cuisine using high-quality ingredients that are free from artificial seasonings, sweeteners, colorings, and preservatives. Kura Sushi aims to make quality Japanese cuisine accessible to its guests across the United States through affordable prices and an inviting atmosphere. Kura Sushi USA, Kura Sushi, Kura, and the Company refer to Kura Sushi USA, Inc. unless expressly indicated or the context otherwise requires.\nFollow-On Offering\nOn April 13, 2023, the Company completed an underwritten public offering of common stock pursuant to the Companys universal shelf registration statement on Form S-3, selling an aggregate of 1,265,000 shares of Class A common stock, including the exercise in full of the underwriters option to purchase 165,000 additional shares, at the price of $54.00 per share less an underwriting discount of $2.70 per share. The Company received aggregate net proceeds of $64.3 million after deducting the underwriting discounts and commissions and offering expenses payable by the Company. The proceeds are to be used for general corporate purposes, including capital expenditures, working capital, and other business purposes. No payments were made by the Company to directors, officers or persons owning 10% or more of the Companys common stock or to their associates, or to the Companys affiliates.\nNote 2-Basis of Presentation and Summary of Significant Accounting Policies\nBasis of Presentation\nThe accompanying financial statements have been prepared in accordance with generally accepted accounting principles in the United States (GAAP). The Companys fiscal year begins on September 1 and ends on August 31 and references made to fiscal year 2023, fiscal year 2022 and fiscal year 2021 refer to the Companys fiscal years ended August 31, 2023, August 31, 2022 and August 31, 2021, respectively.\nUse of Estimates\nThe preparation of financial statements in conformity with GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting periods presented.\nSignificant items subject to such estimates include asset retirement obligations, short-term investments, stock-based compensation, the useful lives of assets, the assessment of the recoverability of long-lived assets, and income taxes. The Company evaluates its estimates and assumptions on an ongoing basis using historical experience and other factors and adjusts those estimates and assumptions when facts and circumstances dictate. Actual results could differ materially from those estimates and assumptions.\nConcentration of Credit Risk\nFinancial instruments that potentially subject the Company to concentration of credit risk consist principally of cash and cash equivalents. The Company maintains its cash and cash equivalents with financial institutions and, at times, the balance may exceed the Federal Deposit Insurance Corporation federally insured limits. The Company has never experienced any losses related to these balances.\nConcentration of Significant Suppliers\nThe Company relies on third parties for specified food products and supplies. In instances where these parties fail to perform their obligations, the Company may be unable to find alternative suppliers. The Company is subject to supplier concentration risk as JFC International Inc., a subsidiary of Kikkoman Corporation and the Companys largest supplier, accounted for 49%, 52%, and 58% of total food and beverage costs for fiscal years 2023, 2022 and 2021, respectively. The Companys spend with Wismettac Asian Foods, Inc. was 20%, 25% and 27% of total food and beverage cost for fiscal years 2023, 2022 and 2021.\nSegment Information\nManagement has determined that the Company has one operating segment and therefore one reportable segment. The Companys chief operating decision maker, its Chief Executive Officer, reviews financial performance and allocates resources. All of the Companys sales are derived in the United States of America.\nCash and Cash Equivalents\nCash and cash equivalents consist primarily of cash on hand, deposits with banks, money market funds, certificates of deposits and term deposits. As of August 31, 2023 and August 31, 2022, cash and cash equivalents were $69.7 million and $35.8 million, respectively. Due to the short-term maturities and their relatively low interest rates, the carrying value of the money market funds approximates their fair value. Cash and cash equivalents are maintained at financial institutions with strong credit ratings. The Company considers all highly liquid investments with an original maturity at the date of purchase of three months or less to be cash equivalents.\nShort-Term Investments\nShort-term investments consist of certificates of deposits and Treasury bills. The Company considers all highly liquid investments with an original maturity date greater than three months but less than one year as short-term investments. The carrying value of the short-term investments is equivalent to their amortized cost basis. As of August 31, 2023 and August 31, 2022, short-term investments were $8.5 million and none, respectively. The certificates of deposits are deposited at Federal Deposit Insurance Corporation (FDIC) insured banks. The certificates of deposits are in amounts of $250,000 in multiple banks so that the entire deposit balance is eligible for FDIC insurance. Certificates of deposits and Treasury bills are classified as available-for-sale debt securities which are measured at fair value with unrealized gains or losses recorded in other comprehensive income (loss). As of August 31, 2023, the Company recorded $43 thousand in unrealized gains on short-term investments in comprehensive loss, which consisted of $48 thousand in unrealized gains on Treasury bills and $5 thousand in unrealized losses on certificates of deposits. The Company reclassified $16 thousand out of accumulated other comprehensive income into earnings for the period related to maturities of certificates of deposits. The Company determines realized gains or losses on the available-for-sale debt securities on a specific identification method. Based on the evaluation of credit risk factors, the Company has concluded that an allowance for credit losses is unnecessary for its short-term investments.\nAccounts and Other Receivables\nAccounts and other receivables consist primarily of receivables from landlords for tenant allowances and credit card receivables. The Company does not extend credit to guests and thus does not have credit risk from guests. Accounts and other receivables balances are stated at the amounts management expects to collect from balances outstanding at fiscal year-end, and no allowance for doubtful accounts is recorded as of August 31, 2023 and August 31, 2022.\nInventories\nInventories consist of food and beverages and are stated at the lower of cost or net realizable value, with cost determined on an average cost basis.\nProperty and Equipment\nProperty and equipment consists of computer equipment, vehicles, software, furniture and fixtures, equipment, leasehold improvements and leased assets. Property and equipment are carried at cost, less accumulated depreciation and amortization. Depreciation and amortization on property and equipment is calculated using the straight-line method over the estimated useful lives of the respective assets. Leasehold improvements are amortized on a straight-line basis over the shorter of the remaining lease term or estimated life of the improvements. The following table represents the various types of property and equipment and their respective useful lives:\nProperty and Equipment\nUseful Life\nComputer equipment\n3 - 5 years\nVehicles\n5 years\nSoftware\n5 years\nFurniture, fixtures and equipment\n5 - 10 years\nLeasehold improvements\nShorter of useful life or remaining lease term\nLease assets\nFixed lease term\nLong-lived assets to be held and used are reviewed for impairment whenever events or changes in circumstances indicate that the related carrying amount may be impaired. If an impairment loss has occurred, a charge is recorded to reduce the carrying amount of the asset to its estimated fair value.\nLiquor Licenses\nLiquor licenses are deemed to have indefinite useful lives and are subject to annual impairment testing. Liquor licenses are included in deposits and other assets in the accompanying balance sheets.\nAsset Retirement Obligations\nAsset retirement obligations (ARO) represents the estimated present value of future expenses the Company expects to incur at the end of a lease to restore the location to its original condition. The ARO is recorded as a liability at its estimated present value at inception with an offsetting increase in the carrying amount of the related property and equipment in the accompanying balance sheet. Periodic accretion of the discount of the estimated liability is recorded as interest expense in the accompanying statements of operations and comprehensive income (loss). Asset retirement obligations are amortized on a straight-line basis over the shorter of the remaining lease term or estimated life of the leasehold improvements. The Companys ARO liability is $0.6 million and $0.5 million as of August 31, 2023 and August 31, 2022, respectively and is included in other liabilities in the accompanying balance sheets.\nImpairment of Long-lived Assets\nThe Company assesses potential impairments of its long-lived assets, which includes property and equipment and operating lease right-of-use assets, in accordance with the provisions of Financial Accounting Standards Board (FASB) Accounting Standards Codification (ASC) 360-Property, Plant and Equipment. An impairment test is performed on an annual basis or whenever events or changes in circumstances indicate that the carrying value of the assets may not be recoverable. In determining the recoverability of the asset value, an analysis is performed at the individual restaurant level. Assets are grouped at the individual restaurant level for purposes of the impairment assessment because a restaurant represents the lowest level for which identifiable cash flows are largely independent of the cash flows of other assets and liabilities. Recoverability of an asset group is measured by a comparison of the carrying amount of an asset group to its estimated undiscounted forecasted restaurant cash flows expected to be generated by the asset group. Factors considered by the Company in estimating future cash flows include but are not limited to: significant underperformance relative to expected historical or projected future operating results; significant changes in the manner of use of the acquired assets; and significant negative industry or economic trends. The estimated undiscounted forecasted cash flows include assumptions made by management regarding certain items such as revenue, food and beverage costs, labor costs, occupancy costs, and other restaurant operating costs and therefore are subject to uncertainty as the Companys actual results may differ from its estimates. If the carrying\namount of the asset group exceeds its estimated undiscounted future cash flows, an impairment charge is recognized as the amount by which the carrying amount of the asset exceeds the fair value of the asset.\nThere were no impairment tests performed for the fiscal years ended August 31, 2023 or August 31, 2022 and no impairment loss was recognized during fiscal years ended August 31, 2023, August 31, 2022, and August 31, 2021.\nIncome Taxes\nThe provision for income taxes, income taxes payable, and deferred income taxes are determined using the asset and liability method. Deferred income tax assets and liabilities are determined based on temporary differences between the financial carrying amounts and tax bases of assets and liabilities that will result in taxable or deductible amounts in the future. Such deferred income tax asset and liability computations are based on enacted tax laws and rates applicable to periods in which the differences are expected to reverse. The Company establishes a valuation allowance to the extent that it is more likely than not that deferred tax assets will not be recoverable against future taxable income. Income tax expense or benefit is the income tax payable or refundable for the period, plus or minus the change during the period to deferred income tax assets and liabilities.\nThe Company regularly evaluates the likelihood of realizing the benefit for income tax positions it has taken in federal and state filings by considering all facts, circumstances, and information available. For those benefits that the Company believes it is more likely than not will be sustained, it recognizes the largest amount it believes is cumulatively greater than 50% likely to be realized.\nRevenue Recognition\nRevenue from sales is recognized when food and beverages are sold to customers. Sales are presented net of discounts and sales taxes collected from customers.\nSales Taxes\nSales taxes are imposed by state, county, and city governmental authorities, collected from customers and remitted to the appropriate governmental agency. The Companys policy is to record the sales taxes collected as a liability on the books and then remove the liability when the sales tax is remitted. There is no impact on the statements of operations and comprehensive income (loss) as restaurant sales are recorded net of sales tax.\nOperating and Finance Leases\nAt inception of a contract, the Company assesses whether the contract is a lease based on whether the contract conveys the right to control the use of an identified asset for a period of time in exchange for consideration. Lease classification, measurement, and recognition are determined at lease commencement, which is the date the underlying asset is available for use by the Company. The accounting classification of a lease is based on whether the arrangement is effectively a financed purchase of the underlying asset (finance lease) or not (operating lease). The Company has operating and finance leases for its corporate office, restaurant locations, office equipment, kitchen equipment and automobiles. The leases have remaining lease terms of less than 1 year to 20 years, some of which include options to extend the leases. For leases with renewal periods at the Companys option, the Company determines the expected lease period based on whether the renewal of any options is reasonably assured at the inception of the lease.\nOperating leases are accounted for on the balance sheet with the right-of-use (ROU) assets and lease liabilities recognized in Operating lease right-of-use assets, Operating lease liabilities - current and Operating lease liabilities - noncurrent on the balance sheet, respectively. Finance leases are accounted for on the balance\nsheet with ROU assets and lease liabilities recognized in Property and equipment - net, Finance lease - current and Finance lease - noncurrent on the balance sheet, respectively.\nLease assets and liabilities are recognized at the lease commencement date. All lease liabilities are measured at the present value of the lease payments not yet paid. To determine the present value of lease payments not yet paid, the Company estimates incremental borrowing rates corresponding to the maturities of the leases. As the Company has no outstanding debt, it estimates this rate based on prevailing financial market conditions, a synthetic credit rating, credit analysis, and management judgment. ROU assets, for both operating and finance leases, are initially measured based on the lease liability, adjusted for initial direct costs, prepaid or deferred rent, and lease incentives. The operating lease ROU assets are subsequently measured at the carrying amount of the lease liability adjusted for initial direct costs, prepaid or accrued lease payments, and lease incentives. Depreciation of the finance lease ROU assets are subsequently calculated using the straight-line method over the shorter of the estimated useful lives or the expected lease terms and recorded in Depreciation and amortization expense on the statement of operations.\nThe Company accounts for lease and non-lease components as a single component for its entire population of operating lease assets. The Company recognizes the short-term lease exemption for all applicable classes of underlying assets. Short-term disclosures include only those leases with a term greater than one month and twelve months or less, and expense is recognized on a straight-line basis over the lease term. Leases with an initial term of twelve months or less, that do not include an option to purchase the underlying asset that the Company is reasonably certain to exercise, are not recorded on the balance sheet.\nThe Company recognizes expense for these leases on a straight-line basis over the lease term. In addition to the fixed minimum payments required under the lease arrangements, certain leases require variable lease payments, such as common area maintenance, insurance and real estate taxes, which are recognized when the associated activity occurs. Additionally, contingent rental payments based on sales thresholds for certain of its restaurants are accrued based on estimated sales.\nOther Costs\nOther costs in restaurant operating costs in the accompanying statements of operations and comprehensive income (loss) include utilities, repairs and maintenance, credit card fees, royalty payments, stock-based compensation for restaurant-level employees, advertising costs and other restaurant-level expenses. The Company incurred $24.9 million, $17.5 million and $10.4 million in other costs for the fiscal years ended August 31, 2023, August 31, 2022 and August 31, 2021, respectively.\nAdvertising Costs\nAdvertising costs are expensed as incurred and are included in other costs in the accompanying statements of operations and comprehensive income (loss). The Company incurred $2.7 million, $1.3 million and $0.6 million in advertising expenses for the fiscal years ended August 31, 2023, August 31, 2022 and August 31, 2021, respectively.\nFair Value Measurements\nThe Company defines fair value as the exchange price that would be received from the sale of an asset or paid to transfer a liability in the principal or most advantageous market for the asset or liability in an orderly transaction between market participants on the measurement date. Valuation techniques used to measure fair value must maximize the use of observable inputs and minimize the use of unobservable inputs. The fair value measurement accounting guidance creates a fair value hierarchy to prioritize the inputs used to measure fair value into three categories. A financial instruments level within the fair value hierarchy is based on the lowest level of input significant to the fair value measurement, where Level 1 is the highest and Level 3 is the lowest. The three levels are defined as follows:\nLevel 1 - Observable inputs that reflect unadjusted quoted prices for identical assets or liabilities in active markets. Active markets are those in which transactions for the asset or liability occur with sufficient frequency and volume to provide pricing information on an ongoing basis.\nLevel 2 - Observable inputs other than Level 1 prices, such as unadjusted quoted prices for similar assets or liabilities in active markets, unadjusted quoted prices for identical or similar assets or liabilities in markets that are not active, or other inputs that are observable or can be corroborated by observable market data for substantially the full term of the assets or liabilities; and\nLevel 3 - Unobservable inputs that are supported by little or no market activity and that are significant to the fair value of the assets or liabilities. These inputs are based on the Companys own assumptions used to measure assets and liabilities at fair value and require significant management judgment or estimation.\nThe Companys financial statements include cash and cash equivalents, short-term investments (Treasury bills), accounts and other receivables, accounts payable, accrued expenses and other current liabilities, and salaries and wages payable for which the carrying amounts approximate fair value due to their short-term maturity. The fair value of our short-term investments, specifically certificates of deposits are considered Level 2 inputs of the fair value hierarchy. The fair value of payments due to or from Kura Japan is not determinable due to its related-party nature.\nStock-based Compensation\nStock-based compensation consists of stock options and restricted stock units (RSUs) issued to employees and non-employees. The Company measures and recognizes stock-based compensation based on the grant date fair value of the award. The fair value of stock options is estimated using the Black-Scholes option-pricing model and is impacted by the fair value of the Companys common stock, as well as changes in assumptions regarding certain subjective variables. These variables include, but are not limited to, the expected common stock price volatility over the term of the stock option awards, the expected term of the awards, risk-free interest rates and the expected dividend yield. The fair value of restricted stock awards is based on the closing market price of the Companys stock on the date of grant. Forfeitures are recognized as they occur.\nFor stock options that are based on a service requirement, the cost is recognized on a straight-line basis over the requisite service period, which is typically the vesting period. Stock options granted in fiscal years 2023, 2022 and 2021 have vesting periods ranging from 12 months to 48 months. The majority of stock options granted in fiscal year 2020 have a vesting period ranging from 9 months to 46 months. Each award expires on such date as shall be determined at the date of grant; however, the maximum contractual term of options to acquire common stock is ten years after the initial date of the award. Vested RSUs do not expire. For RSUs, all unvested awards shall be forfeited immediately upon termination.\nComprehensive Income (Loss)\nComprehensive income (loss) is defined as the change in equity of a business enterprise during a period from transactions and other events and circumstances from non-owner sources. The Companys short-term investments consist of certificates of deposits and Treasury bills that are classified as available-for-sale debt securities which are measured at fair value with unrealized gains or losses recorded in other comprehensive income (loss).\nIncome (Loss) Per Share\nIncome (loss) per share is calculated by dividing net income (loss) by the weighted average shares outstanding during the period, without consideration of common stock equivalents. Diluted income (loss) per share assumes the conversion, exercise or issuance of all potential dilutive common stock equivalents outstanding for the period. For the purposes of this calculation, options and restricted stock units are considered to be common stock equivalents and are only included in the calculation of diluted earnings per share when their effect is dilutive. Diluted income (loss) per share is calculated by adjusting weighted average shares outstanding for the dilutive effect of common stock equivalents outstanding for the period, determined using the treasury-stock method.\nNote 3-Balance Sheet Components\nAccounts and Other Receivables\nAccounts and other receivables as of August 31, 2023 and August 31, 2022 consists of the following:\nAs of August 31,\n(amounts in thousands)\nLease receivables\n$\n3,973\n$\n1,767\nCredit card and other receivables\n1,075\nTotal accounts and other receivables\n$\n5,048\n$\n2,486\nInventories\nInventories as of August 31, 2023 and August 31, 2022 consists of the following:\nAs of August 31,\n(amounts in thousands)\nFood\n$\n1,575\n$\n1,003\nBeverages\nTotal inventories\n$\n1,747\n$\n1,120\nPrepaid Expenses and Other Current Assets\nPrepaid expenses and other current assets as of August 31, 2023 and August 31, 2022 consists of the following:\nAs of August 31,\n(amounts in thousands)\nPrepaid expenses\n$\n3,697\n$\n2,588\nOther current assets\nEmployee retention credit\n-\nTotal prepaid expenses and other current assets\n$\n4,233\n$\n2,852\nProperty and Equipment, net\nProperty and equipment, net as of August 31, 2023 and August 31, 2022 consists of the following:\nAs of August 31,\n(amounts in thousands)\nLeasehold improvements\n$\n75,472\n$\n56,668\nLease assets\n6,247\n6,166\nFurniture, fixtures and equipment\n34,213\n21,759\nComputer equipment\n2,792\n1,307\nVehicles\nSoftware\n1,016\nConstruction in progress\n14,369\n8,666\nProperty and equipment - gross\n134,329\n95,646\nLess: accumulated depreciation and\namortization\n(27,902\n)\n(20,056\n)\nTotal property and equipment - net\n$\n106,427\n$\n75,590\nDepreciation and amortization expense for property and equipment was $7.8 million, $5.6 million and $4.5 million for the fiscal years ended August 31, 2023, August 31, 2022, and August 31, 2021, respectively. For amortization expense related to leased assets for the fiscal years ended August 31, 2023 and August 31, 2022, please see Note 4 - Leases.\nDeposits and Other Assets\nDeposits and other assets, as of August 31, 2023 and August 31, 2022 consists of the following:\nAs of August 31,\n(amounts in thousands)\nDeposits\n$\n1,486\n$\n1,632\nLiquor license\n3,491\n1,748\nTotal deposits and other assets\n$\n4,977\n$\n3,380\nNote 4-Leases\nLease related costs recognized in the statements of operations and comprehensive income (loss) for fiscal years 2023 and 2022 are as follows:\nFiscal Years Ended August 31,\n(amounts in thousands)\nFinance lease cost\nClassification\nAmortization of right-of-use assets\nDepreciation and amortization expense\n$\n$\nInterest on lease liabilities\nInterest expense\nTotal finance lease cost\n$\n$\nFiscal Years Ended August 31,\n(amounts in thousands)\nOperating lease cost\nClassification\nOperating lease cost\nOccupancy and related expenses, other costs and general and administrative expenses\n$\n10,203\n$\n7,859\nVariable lease cost\nOccupancy and related expenses, and general and administrative expenses\n3,176\n2,181\nTotal operating lease cost\n$\n13,379\n$\n10,040\nSupplemental balance sheet information related to leases is as follows:\nOperating Leases\nAs of August 31,\n(amounts in thousands)\nRight-of-use assets\n$\n103,884\n$\n79,990\nLease liabilities - current\n$\n9,225\n$\n7,992\nLease liabilities - non-current\n110,234\n82,280\nTotal lease liabilities\n$\n119,459\n$\n90,272\nFinance Lease Assets, net\nAs of August 31,\n(amounts in thousands)\nProperty and equipment\n$\n6,247\n$\n6,166\nAccumulated depreciation\n(3,945\n)\n(3,348\n)\nTotal property and equipment - net\n$\n2,302\n$\n2,818\nFinance Leases Liabilities\nAs of August 31,\n(amounts in thousands)\nFinance lease - current\n$\n$\nFinance lease - non-current\nTotal finance lease liabilities\n$\n$\nAs of August 31,\nWeighted Average Remaining Lease Term (Years)\nOperating leases\n16.1\n16.1\nFinance leases\n1.4\n0.8\nWeighted Average Discount Rate\nOperating leases\n7.0\n%\n6.5\n%\nFinance leases\n4.1\n%\n4.7\n%\nSupplemental disclosures of cash flow information related to leases are as follows:\nFiscal Years Ended August 31,\n(amounts in thousands)\nOperating cash flows paid for operating lease liabilities\n$\n7,935\n$\n6,484\nOperating right-of-use assets obtained in exchange\nfor new operating lease liabilities\n$\n27,062\n$\n20,296\nAs of August 31, 2023, the Company has additional operating leases related to restaurants of which the Company has not yet taken possession of $48.2 million. Subsequent to August 31, 2023, the Company entered into an additional operating lease related to a restaurant for which the Company has not yet taken possession. The lease liability associated with the lease after August 31, 2023 is $6.4 million. The operating lease is expected to commence in fiscal year 2024 with a lease terms of 21 years.\nLease expense was $13.3 million and $10.0 million, including contingent rent expenses of $0.7 million and $0.4 million for the fiscal years ended August 31, 2023 and August 31, 2022, respectively.\nMaturities of lease liabilities are as follows as of August 31, 2023:\nOperating Leases\nFinance Leases\n(amounts in thousands)\n$\n6,912\n$\n8,866\n11,189\n11,218\n-\n10,823\n-\nThereafter\n147,053\n-\nTotal lease payments\n196,061\nLess: imputed interest\n(76,602\n)\n(2\n)\nPresent value of lease liabilities\n$\n119,459\n$\nNote 5-Related Party Transactions\nKura Sushi, Inc. (Kura Japan) is the majority stockholder of the Company and is incorporated and headquartered in Japan. In August 2019, the Company entered into a Shared Services Agreement with Kura Japan, pursuant to which Kura Japan provides the Company with certain strategic, operational and other support services, including assigning certain employees to work for the Company as expatriates to provide support to the Companys operations, sending its employees to the Company on a short-term basis to provide support for the opening of new restaurants or renovation of existing restaurants, and providing the Company with certain supplies, parts and equipment for use in the Companys restaurants. In addition, the Company has agreed to continue to provide Kura Japan with certain translational support services, and market research. In exchange for such services, supplies, parts and equipment, the parties pay fees to each other as set forth under the Shared Services Agreement. A right of setoff is not required; however, from time to time, either party will net settle transactions as needed. Purchases of administrative supplies, expatriate salaries and travel and other administrative expenses payable to Kura Japan are included in general and administrative expenses in the accompanying statement of operations. Purchases of equipment from Kura Japan are included in property and equipment in the accompanying balance sheets.\nIn August 2019, the Company entered into an Amended and Restated Exclusive License Agreement (the License Agreement) with Kura Japan. Pursuant to the License Agreement, the Company pays Kura Japan a royalty fee of 0.5% of the Companys net sales in exchange for an exclusive, royalty-bearing license for use of certain of Kura Japans intellectual property rights, including, but not limited to, Kura Japans trademarks Kura Sushi, Mr. Fresh and Kura Revolving Sushi Bar, and patents for a food management system and the Mr. Fresh protective dome, among other intellectual property rights necessary to continue operation of the Companys restaurants. Royalty payments to Kura Japan are included in other costs at the restaurant-level in the accompanying statements of operations and comprehensive income (loss).\nOn April 10, 2020, the Company and Kura Japan entered into a Revolving Credit Agreement, which was subsequently amended on September 2, 2020 and April 9, 2021, to provide the Company a line of credit of $45.0 million. For additional information, see Note 9 - Debt.\nBalances with Kura Japan as of August 31, 2023 and August 31, 2022 are as follows:\nAs of August 31,\n(amounts in thousands)\nDue from affiliate\n$\n$\nDue to affiliate\n$\n$\nReimbursements and other payments by the Company to Kura Japan for fiscal years ended August 31, 2023, August 31, 2022, and August 31, 2021 are as follows:\nFiscal Years Ended August 31,\n(amounts in thousands)\nRelated party transactions:\nPurchases of administrative supplies\n$\n-\n$\n-\n$\nExpatriate salaries expense\nRoyalty payments\nTravel and other administrative expenses\nPurchases of equipment\n3,327\n1,449\n1,173\nInterest expense\n-\n-\nTotal related party transactions\n$\n4,420\n$\n2,317\n$\n1,882\nReimbursements by Kura Japan to the Company were $0.2 million, $0.2 million, and $0.3 million for fiscal years ended August 31, 2023, August 31, 2022, and August 31, 2021, respectively. The reimbursements were primarily for professional fees, travel and other administrative expenses.\nNote 6-Stock-based Compensation\nThe Company has a 2018 Incentive Compensation Plan (the Stock Incentive Plan), as amended. Under the Stock Incentive Plan, the Company may grant stock options, stock appreciation rights, restricted stock, restricted stock units, and performance awards in the form of shares and cash. Stock options granted under the Stock Incentive Plan include both incentive stock options and non-qualified stock options. This plan authorizes 1,350,000 shares to be granted.\nActivity under the Stock Incentive Plan is as follows:\nOptions Outstanding\nNumber of\nshares\nunderlying\noutstanding\noptions\nWeighted\nAverage\nExercise\nPrice Per\nShare\nWeighted\nAverage\nRemaining\nContractual\nTerm (Years)\nAggregate\nIntrinsic\nValue\n(amounts in\nthousands)\nOutstanding-August 31, 2020\n531,747\n$\n9.51\n8.3\n$\n1,441\nOptions granted\n221,260\n29.60\nOptions exercised\n(93,378\n)\n5.52\nOptions canceled/forfeited\n(34,251\n)\n10.99\nOutstanding-August 31, 2021\n625,378\n$\n17.13\n4.9\n$\n21,060\nOptions granted\n227,596\n51.24\nOptions exercised\n(81,742\n)\n11.74\nOptions canceled/forfeited\n(95,290\n)\n32.41\nOutstanding-August 31, 2022\n675,942\n$\n27.12\n7.7\n$\n32,290\nOptions granted\n141,202\n$\n68.19\nOptions exercised\n(93,915\n)\n$\n20.84\nOptions canceled/forfeited\n(69,834\n)\n$\n51.90\nOutstanding-August 31, 2023\n653,395\n$\n34.25\n7.2\n$\n34,766\nOptions exercisable\n400,891\n$\n19.89\n6.2\n$\n27,053\nStock-based compensation related to the stock options issued under the Stock Incentive Plan was $3.6 million, $2.4 million, and $1.4 million for the fiscal years ended August 31, 2023, August 31, 2022, and August 31, 2021 respectively, and is included in restaurant operating costs and general and administrative expenses on the accompanying statements of operations and comprehensive income (loss). The total intrinsic value of stock options exercised during fiscal year 2023 was $5.5 million.\nThe total fair value of options vested was $3.1 million, $1.7 million, and $0.7 million for the fiscal years ended August 31, 2023, August 31, 2022, and August 31, 2021, respectively. As of August 31, 2023, unrecognized stock-based compensation of $7.4 million related to unvested stock options is expected to be recognized on a straight-line basis over a weighted average period of 2.5 years.\nThe following table summarizes the restricted stock unit (RSU) activity under the Stock Incentive Plan:\nRSU Outstanding\nNumber of Shares\nUnderlying\nOutstanding RSU\nWeighted Average\nGrant Date\nFair Value\nOutstanding - August 31, 2022\n-\n-\nRSUs granted\n32,733\n$\n69.49\nRSUs canceled/forfeited\n(1,628\n)\n$\n62.14\nOutstanding - August 31, 2023\n31,105\n$\n69.88\nAs of August 31, 2023, unrecognized stock-based compensation of $1.8 million related to unvested RSUs is expected to be recognized on a straight-line basis over a weighted average period of 2.9 years.\nStock-based Compensation Expense\nStock-based compensation for restaurant-level employees is included in other costs and stock-based compensation for corporate-level employees is included in general and administrative expenses in the statements of operations and comprehensive income (loss). The total stock-based compensation recognized under the Stock Incentive Plan in the statements of operations and comprehensive income (loss) is as follows:\nFiscal Years Ended August 31,\n(amounts in thousands)\nOther costs\n$\n$\n$\nGeneral and administrative expenses\n3,044\n2,112\n1,291\nTotal stock-based compensation\n$\n3,550\n$\n2,409\n$\n1,409\nDetermination of Fair Value\nFor the fiscal years ended August 31, 2023, August 31, 2022, and August 31, 2021, the fair value of stock options was estimated on the grant date using the Black-Scholes valuation model with the following assumptions:\nFiscal Years Ended August 31,\nExpected term (in years)\n6.11\n5.50 - 6.11\n5.50 - 6.11\nExpected volatility\n58.6-64.0%\n62.3%-63.7%\n61.7% - 62.7%\nRisk-free interest rate\n2.96%-4.15%\n1.23%-3.19%\n0.47% - 1.16%\nDividend rate\n-\n-\n-\nWeighted average grant date fair value\n$\n45.79\n$\n29.54\n$\n16.66\nExpected Term - The expected term represents the period that the Companys stock-based awards are expected to be outstanding. For option grants that are considered to be plain vanilla, the Company determines the expected term using the simplified method. The simplified method deems the term to be the average of the time-to-vesting and the contractual life of the options.\nExpected Volatility - Since the Company does not have a trading history of its common stock equivalent to the expected term of the stock option grants, the expected volatility is derived from the average historical stock volatilities of several unrelated public companies within the Companys industry that the Company considers to be comparable to its business over a period equivalent to the expected term of the stock option grants.\nRisk-Free Interest Rate - The risk-free interest rate is based on the U.S. Treasury yield curve in effect at the time of grant for zero-coupon U.S. Treasury notes with maturities approximately equal to the options expected term.\nDividend Rate - The expected dividend is assumed to be zero as the Company has never paid dividends and has no current plans to do so.\nFair Value of Common Stock - The fair value of common stock is based on the closing price of the Companys common stock, as reported on The Nasdaq Global Market.\nNote 7-Fair Value Measurements\nThe following table sets forth the Companys assets measured at fair value on a recurring basis as of August 31, 2023. The Company did not have any assets and liabilities measured at fair value on a recurring basis as of August 31, 2022.\nLevel 1\nLevel 2\nLevel 3\nTotal\n(amounts in thousands)\nAssets:\nCertificates of deposits\n$\n-\n$\n4,495\n$\n-\n$\n4,495\nTreasury bills\n4,047\n-\n-\n4,047\nTotal assets at fair value\n$\n4,047\n$\n4,495\n$\n-\n$\n8,542\nThe Companys cash and cash equivalents include cash on hand, deposits in banks, certificates of deposits and money market funds. Due to their short-term nature, the carrying amounts reported in the accompanying balance sheets approximate the fair value of cash and cash equivalents. The fair value of our certificates of deposits are considered using Level 2 inputs of the fair value hierarchy. Level 2 inputs are based on market data that include factors such as interest rates, market and pricing activity and other market-based valuation techniques. The Company determines realized gains or losses on the available-for-sale debt securities on a specific identification method.\nNote 8-Kura Sushi USA, Inc. 401(k) Plan\nThe Company maintains the Kura Sushi USA, Inc. 401(k) Plan (the Plan). The Plan covers all employees, subject to certain eligibility requirements. Starting in fiscal year 2022, the Company makes safe harbor matching contributions which vest immediately, equal to 100% of each eligible participants salary deferrals that do not exceed 3% of compensation, plus 50% of each eligible participants salary deferrals between 3% and 5% of compensation. For fiscal year 2023, the Company made matching Plan contributions of $386 thousand.\nNote 9-Debt\nOn April 10, 2020, the Company and Kura Japan entered into a Revolving Credit Agreement, as amended, establishing a $45.0 million revolving credit line for the Company. The maturity date for each advance is 60 months from the date of disbursement and the last day of the period of availability for advances is April 10, 2025. The Revolving Credit Note under the Revolving Credit Agreement has an interest rate for advances fixed at 130% of the Annual Compounding Long-Term Applicable Federal Rate (AFR) on the date such advance is made. The AFR as of August 31, 2023 was 5.26%. There are no financial covenants under the Revolving Credit Agreement with which the Company must comply.\nDuring fiscal years 2023 and 2022, the Company had no borrowings under the revolving credit line. As of August 31, 2023, the Company had no outstanding balance on the revolving credit line and had $45.0 million of availability remaining under the Revolving Credit Agreement.\nNote 10-Income (Loss) Per Share\nThe net income (loss) per share attributable to common stockholders is allocated based on the contractual participation rights of the Class A common stock and Class B common stock as if the income for the year has been distributed. As the liquidation and dividend rights for Class A and Class B common stock are identical, the net loss attributable to all common stockholders is allocated on a proportionate basis.\nThe following table sets forth the computation of the Companys basic and diluted net income (loss) per share:\nFiscal Years Ended August 31,\nClass A\nClass B\nClass A\nClass B\nClass A\nClass B\n(amounts in thousands, except per share data)\nNet income (loss) attributable to common stockholders - basic\n$\n1,356\n$\n$\n(685\n)\n$\n(79\n)\n$\n(9,088\n)\n$\n(1,207\n)\nNet income (loss) attributable to common stockholders - diluted\n$\n1,361\n$\n$\n(685\n)\n$\n(79\n)\n$\n(9,088\n)\n$\n(1,207\n)\nWeighted average common shares outstanding - basic\n9,305\n1,000\n8,719\n1,000\n7,528\n1,000\nDilutive effect of stock-based awards\n-\n-\n-\n-\n-\nWeighted average common shares outstanding - diluted\n9,640\n1,000\n8,719\n1,000\n7,528\n1,000\nNet income (loss) per share attributable to common stockholders - basic\n$\n0.15\n$\n0.15\n$\n(0.08\n)\n$\n(0.08\n)\n$\n(1.21\n)\n$\n(1.21\n)\nNet income (loss) per share attributable to common stockholders - diluted\n$\n0.14\n$\n0.14\n$\n(0.08\n)\n$\n(0.08\n)\n$\n(1.21\n)\n$\n(1.21\n)\nThe Company computes basic income (loss) per common share using net income (loss) and the weighted average number of common shares outstanding during the period, and computes diluted income (loss) per common share using net income (loss) and the weighted average number of common shares and potentially dilutive common shares outstanding during the period. Potentially dilutive common shares include dilutive outstanding employee stock options and restricted stock units.\nFor the fiscal years ended August 31, 2023, August 31, 2022 and August 31, 2021, there were 685 thousand, 677 thousand and 625 thousand shares of common stock, respectively, subject to outstanding employee stock options and RSUs that were excluded from the calculation of diluted income per share because their inclusion would have been anti-dilutive.\nNote 11-Commitments and Contingencies\nOn May 31, 2019, a putative class action complaint was filed by a former employee, Brandy Gomes, in Los Angeles County Superior Court, alleging violations of California wage and hour laws. On July 9, 2020, plaintiffs counsel filed a first amended class action complaint to add Jamar Spencer, another former employee, as a plaintiff to this action. In addition, the first amended class action complaint added new causes of action alleging violations of California wage and hour laws including a cause of action brought under the California Private Attorney General Act. On August 7, 2020, the Company filed its answer to the first amended complaint, generally denying the allegations in the complaint. In May 2021, a joint stipulation was filed requesting a delay in the class certification hearing date to March 3, 2022, and a mediation was scheduled for September 24, 2021. During the mediation, a settlement was agreed upon in the amount of $1.75 million. The Company recorded an accrued liability of $1.78 million, including an estimated $30 thousand in employer payroll taxes, related to this settlement within general and administrative expenses in the statements of operations and comprehensive income (loss) during the fiscal year ended August 31, 2021. The court granted final approval of the settlement on November 18, 2022. In December 2022, pursuant to the courts order granting final approval of the settlement, the Company deposited $1.78 million into an account controlled by a settlement administrator for disbursement to class participants and other parties to the litigation. A final report regarding the distribution of settlement funds was filed on July 6, 2023. The parties are awaiting the court to sign the amended judgment, which was filed on August 16, 2023.\nThe Company is involved from time to time in various legal proceedings that arise in the ordinary course of business, including but not limited to commercial disputes, environmental matters, employee related claims,\nintellectual property disputes and litigation in connection with transactions including acquisitions and divestitures. In the opinion of management, the Company does not believe that such litigation, claims, and administrative proceedings, excluding the putative class action matter referenced above, will have a material adverse effect on its business, financial position, results of operations or cash flows. However, a significant increase in the number of these claims or an increase in amounts owing under successful claims, including the putative class action referenced above, could materially and adversely affect its business, financial condition, results of operations or cash flows. The Company records a liability when a loss is considered probable, and the amount can be reasonably estimated.\nNote 12-Income Taxes\nThe components of loss before provision for income taxes are as follows:\nFiscal Years Ended August 31,\n(amounts in thousands)\nUS\n$\n1,735\n$\n(690\n)\n$\n(10,189\n)\nTotal\n$\n1,735\n$\n(690\n)\n$\n(10,189\n)\nThe components of the provision for income taxes are as follows:\nFiscal Years Ended August 31,\n(amounts in thousands)\nCurrent:\nFederal\n$\n-\n$\n-\n$\n-\nState\nTotal current\nDeferred:\nFederal\n-\n-\n-\nState\n-\n-\n-\nTotal deferred\n-\n-\n-\nTotal\n$\n$\n$\nThe Company had an effective tax rate of 13.4%, (10.7)% and (1.0)% for the fiscal years ended August 31, 2023, August 31, 2022, and August 31, 2021, respectively. The reconciliation of the statutory federal income tax rate to the Companys effective tax rate was as follows:\nFiscal Years Ended August 31,\nTax at federal statutory rate\n21.0\n%\n21.0\n%\n21.0\n%\nEmployer tip credit\n(121.3\n)\n125.8\n3.8\nStock-based compensation\n2.6\n29.7\n(0.2\n)\nChange in valuation allowance\n96.8\n(186.1\n)\n(24.7\n)\nOther items\n3.6\n3.7\n(0.1\n)\nState tax, net of federal benefit\n10.7\n(4.8\n)\n(0.8\n)\nEffective tax rate\n13.4\n%\n(10.7\n)%\n(1.0\n)%\nThe Company recorded an income tax provision for the years ended August 31, 2023, 2022 and 2021 of $233 thousand, $74 thousand, and $106 thousand, respectively. The primary difference between the effective tax rate and the federal statutory tax rate relates to the recognition of valuation allowance against deferred tax assets, federal tax liabilities offset by employer tip credits, and non-deductible stock-based compensation.\nThe deferred income taxes reflect the tax effects of the temporary differences between the carrying amounts of assets and liabilities for financial reporting purposes and amounts used for income tax purposes.\nThe tax effects of temporary differences that give rise to significant portions of deferred tax assets and liabilities are as follows:\nAs of August 31,\n(amounts in thousands)\nDeferred tax assets:\nNOL carryover\n$\n7,394\n$\n7,047\nGeneral business credit\n6,087\n3,595\nLease liabilities\n32,080\n24,095\nState tax deduction\n-\nOther\n1,751\n1,127\nGross deferred tax assets\n47,312\n35,889\nDeferred tax liabilities:\nBasis difference on fixed assets\n(7,911\n)\n(4,810\n)\nRight-of-use assets\n(27,885\n)\n(21,353\n)\nGross deferred tax liabilities\n(35,796\n)\n(26,163\n)\nValuation allowance\n(11,516\n)\n(9,726\n)\nNet deferred tax\n$\n-\n$\n-\nAs of August 31, 2023, the Company has U.S. federal net operating loss (NOL) carryover of approximately $31.0 million, various state NOL carryover of approximately $10.4 million, and federal tax credit carryover of approximately $6.1 million. If not utilized, $28.9 million of the federal NOL can be carried forward indefinitely, and the remainder will begin to expire in the fiscal year ending August 31, 2026. The federal tax credit will begin to expire in the fiscal year ending August 31, 2035. Utilization of the Companys NOL and federal tax credit carryover may be subject to a substantial annual limitation due to ownership change limitations that may have occurred or that could occur in the future, as required by Sections 382 and 383 of the Internal Revenue Code of 1986, as amended.\nThe Company has not recorded any unrecognized tax benefits as of August 31, 2023. Tax benefits of uncertain tax positions are recognized only if it is more likely than not that the Company will be able to sustain a position taken on an income tax return. The Company has no liability for uncertain positions. Interest and penalties, if any, related to unrecognized tax benefits would be recognized as income tax expense.\nThe Company evaluates the realizability of its deferred tax assets on a quarterly basis and establishes a valuation allowance when it is more likely than not that all or a portion of a deferred tax asset may not be realized. The Company assesses the available positive and negative evidence to estimate whether sufficient future taxable income will be generated to permit use of the existing deferred tax assets. A significant piece of objective negative evidence evaluated was the cumulative loss incurred over the three-year period ended August 31, 2023, as well significant deferred tax asset in excess of deferred tax liabilities. As a result, the Company determined that it is not more likely than not that it will generate sufficient future U.S. taxable income to realize its deferred tax assets and, therefore, recorded valuation allowances against the net deferred tax assets. The total amount of the valuation allowance was approximately $11.5 million. The net change for the valuation allowance was $1.8 million as of August 31, 2023.\nOn December 27, 2020, Congress passed, and the President signed into law, the Consolidated Appropriations Act, 2021 (the Act), which includes certain business tax provisions. The Act did not have a material impact on the Companys effective tax rate or income tax expense for the fiscal year ended August 31, 2021.\nOn March 11, 2021, Congress passed, and the President signed into law, the American Rescue Plan Act, 2021 (the ARP), which includes certain business tax provisions. The ARP did not have a material impact on the Companys effective tax rate or income tax expense for the fiscal year ended August 31, 2021.\nOn August 16, 2022, Congress passed, and the President signed into law, the Inflation Reduction Act (the IRA), which includes certain business tax provisions. The IRA did not have a material impact on the Companys effective tax rate or income tax expense for the fiscal year ended August 31, 2022. Item 9.\tChanges in and Disagreements with Accountant on Accounting and Financial Disclosure\nNone. Item 9A. Controls and Procedures\nDisclosure Controls and Procedures\nOur management carried out an evaluation, under the supervision and with the participation of our principal executive officer and principal financial officer, of the effectiveness of the design and operation of our disclosure controls and procedures (as defined in Rule 13a-15(e) of the Exchange Act) as of the end of the period covered by this report.\nBased on this evaluation, our principal executive officer and principal financial officer concluded that our disclosure controls and procedures were effective as of the end of the period covered by this report.\nManagements Report on Internal Control Over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rule 13a-15(f) and 15d-15(f) under the Exchange Act). Our internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. Our internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of our assets; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that our receipts and expenditures are being made only in accordance with authorizations of our management and directors; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of our assets that could have a material effect on our financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions or that the degree of compliance with the policies or procedures may deteriorate.\nOur management assessed the effectiveness of our internal control over financial reporting using the criteria established by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in Internal Control-Integrated Framework (2013). Based on this assessment, management has concluded that our internal control over financial reporting was effective as of the end of the period covered by this report.\nChanges in Internal Control over Financial Reporting\nThere have been no changes in our internal control over financial reporting that occurred during our most recent fiscal quarter that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.       Item 15. Exhibits and Financial Statement Schedules\n(a)(1). Financial Statements. See Table of Contents on page 51.\n(a)(2). Financial Statement Schedules.\nAll schedules are omitted because they are not required or applicable, or the required information is included in the Companys financial statements or related notes.\n(a)(3). Exhibits. See Index to Exhibits.\nINDEX TO EXHIBITS\nExhibit\nNumber\nDescription\n3.1\nAmended and Restated Certificate of Incorporation (incorporated by reference to our current report on Form 8-K filed with the SEC on August 5, 2019 as Exhibit 3.1)\n3.2\nAmended and Restated Bylaws (incorporated by reference to our current report on Form 8-K filed with the SEC on August 5, 2019 as Exhibit 3.2)\n4.1\nSpecimen Stock Certificate (incorporated by reference to our registration statement on Form S-1/A (File No. 333-232551) filed with the SEC on July 22, 2019 as Exhibit 4.1)\n4.2\nDescription of the Registrants Capital Stock (incorporated by reference to our annual report on Form 10-K filed with the SEC on November 18, 2020 as Exhibit 4.2)\n10.1\u0086#\nKura Sushi USA, Inc. 2018 Incentive Compensation Plan (as amended and restated as of January 29, 2021)\n10.2\u0086\nEmployment Agreement between Kura Sushi USA, Inc. and Hajime Uba (incorporated by reference to our current report on Form 8-K filed with the SEC on August 5, 2019 as Exhibit 10.3)\n10.3\u0086\nEmployment Agreement between Kura Sushi USA, Inc. and Steven H. Benrubi (incorporated by reference to our current report on Form 8-K filed with the SEC on November 30, 2020 as Exhibit 10.1)\n10.4\u0086\nEmployment Agreement between Kura Sushi USA, Inc. and Shahin Allameh (incorporated by reference to our current report on Form 8-K filed with the SEC on July 13, 2021 as Exhibit 10.1)\n10.5\u0086\nEmployment Agreement, dated August 1, 2022, between Kura Sushi USA, Inc. and Brent Takao (incorporated by reference to our current report on Form 8-K filed with the SEC on August 1, 2022 as Exhibit 10.1)\n10.6\u0086\nEmployment Agreement, dated September 30, 2022, between Kura Sushi USA, Inc. and Jeffrey J. Uttz (incorporated by reference to our current report on Form 8-K filed with the SEC on October 3, 2022 as Exhibit 10.1)\n10.7\u0086\nForm of Restricted Stock Award Notice and Award Agreement (incorporated by reference to our current report on Form 8-K filed with the SEC on November 30, 2020 as Exhibit 10.2)\n10.8\u0086\nForm of Restricted Stock Unit Award Notice and Award Agreement (incorporated by reference to our current report on Form 8-K filed with the SEC on October 3, 2022 as Exhibit 10.2)\n10.9\nForm of Indemnification Agreement between Kura Sushi USA, Inc. and each of its directors and executive officers (incorporated by reference to our registration statement on Form S-1/A (File No. 333-232551) filed with the SEC on July 16, 2019 as Exhibit 10.5)\n10.10\nAmended and Restated Exclusive License Agreement between Kura Sushi USA, Inc. and Kura Sushi, Inc. (incorporated by reference to our current report on Form 8-K filed with the SEC on August 5, 2019 as Exhibit 10.2)\n10.11\nShared Services Agreement between Kura Sushi USA, Inc. and Kura Sushi, Inc. (incorporated by reference to our current report on Form 8-K filed with the SEC on August 5, 2019 as Exhibit 10.1)\n10.12\nRevolving Credit Agreement, dated April 10, 2020, between Kura Sushi USA, Inc. and Kura Sushi, Inc. (incorporated by reference to our current report on Form 8-K filed with the SEC on April 14, 2020 as Exhibit 10.1)\n10.13\nFirst Amendment to Revolving Credit Agreement, dated September 2, 2020, between Kura Sushi USA, Inc. and Kura Sushi, Inc. (incorporated by reference to our current report on Form 8-K filed with the SEC on September 3, 2020 as Exhibit 10.1)\n10.14\nSecond Amendment to Revolving Credit Agreement, dated April 9, 2021, between Kura Sushi USA, Inc. and Kura Sushi, Inc. (incorporated by reference to our current report on Form 8-K filed with the SEC on April 13, 2021 as Exhibit 10.1)\n10.15\u0086\nForm of Incentive Stock Option Agreement (incorporated by reference to our annual report on Form 10-K filed with the SEC on November 26, 2019 as Exhibit 10.17)\n10.16\u0086\nForm of Nonqualified Stock Option Agreement (incorporated by reference to our annual report on Form 10-K filed with the SEC on November 26, 2019 as Exhibit 10.18)\n23.1#\nConsent of KPMG LLP\n24.1#\nPower of Attorney (included on signature page of this report)\n31.1#\nCertification of Principal Executive Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n31.2#\nCertification of Principal Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n32.1#\nCertification of Chief Executive Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n32.2#\nCertification of Chief Financial Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n101.INS#\nInline XBRL Instance Document (the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document)\n101.SCH#\nInline XBRL Taxonomy Extension Schema Document\n101.CAL#\nInline XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF#\nInline XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB#\nInline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE#\nInline XBRL Taxonomy Extension Presentation Linkbase Document\nCover Page Interactive Data File (embedded within the Inline XBRL document and contained in Exhibit 101)\n\u0086 Management contract or compensatory plan.\n# Filed herewith.\nItem 16. Form 10-K Summary\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned thereunto duly authorized.\nDate: November 8, 2023\nKURA SUSHI USA, INC.\nBy:\n/s/ Jeffrey Uttz\nName:\nJeffrey Uttz\nTitle:\nChief Financial Officer\n(Principal Financial Officer)\nPOWER OF ATTORNEY\nKNOW ALL PERSONS BY THESE PRESENTS, that each person whose signature appears below constitutes and appoints Hajime Uba and Jeffrey Uttz, and each of them, as his or her true and lawful attorneys-in-fact and agents, with full power of substitution and resubstitution, for him or her and in his or her name, place and stead, in any and all capacities, to sign any and all amendments to this Annual Report on Form 10-K, and to file the same, with all exhibits thereto, and other documents in connection therewith, with the Securities and Exchange Commission, granting unto said attorneys-in-fact and agents, and each of them, full power and authority to do and perform each and every act and thing requisite and necessary to be done in connection therewith, as fully to all intents and purposes as he or she might or could do in person, hereby ratifying and confirming that all said attorneys-in-fact and agents, or any of them or their or his or her substitute or substitutes, may lawfully do or cause to be done by virtue hereof.\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons in their indicated capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/ Hajime Uba\nChairman, President, Chief Executive Officer and Director (Principal Executive Officer)\nNovember 8, 2023\nHajime Uba\n/s/ Jeffrey Uttz\nChief Financial Officer (Principal Financial Officer)\nNovember 8, 2023\nJeffrey Uttz\n/s/ Brent Takao\nChief Accounting Officer, Treasurer and Secretary (Principal Accounting Officer)\nNovember 8, 2023\nBrent Takao\n/s/ Shintaro Asako\nDirector\nNovember 8, 2023\nShintaro Asako\n/s/ Kim Ellis\nDirector\nNovember 8, 2023\nKim Ellis\n/s/ Seitaro Ishii\nDirector\nNovember 8, 2023\nSeitaro Ishii\n/s/ Carin Stutz\nDirector\nNovember 8, 2023\nCarin Stutz"
}