{
    "cik": "1775194",
    "company": "UPEXI, INC.",
    "filing_type": "10-K",
    "filing_date": "2023-10-03",
    "period_of_report": "2023-06-30",
    "sic": "2833",
    "state_of_inc": "NV",
    "state_location": "FL",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1775194/0001477932-23-007307-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1775194/000147793223007307/upxi_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1775194/0001477932-23-007307.txt",
    "filename": "1775194_10K_2023_0001477932-23-007307.htm",
    "content": "Item 1. Business\nGeneral Overview\nAs used in this current report and unless otherwise indicated, the terms we, us and our mean Upexi, Inc., unless otherwise indicated.\nOn August 17, 2022, the Company changed its name from Grove, Inc. to Upexi, Inc. to better reflect the evolution of the business from a single focus to the overall product distribution of product brands owned by the Company and other select brands that align with our overall product distribution strategy.\nUpexi, Inc. (the Company) is a Nevada corporation with fifteen active subsidiaries. The Companys fifteen active subsidiaries are as follows:\n☐\nHAVZ, LLC, d/b/a/ Steam Wholesale, a California limited liability company\no\nSWCH, LLC, a Delaware limited liability company\no\nCresco Management, LLC, a California limited liability company\n☐\nTrunano Labs, Inc., a Nevada corporation\n☐\nMW Products, Inc., a Nevada corporation\n☐\nUpexi Holding, LLC, a Delaware limited liability company\no\nUpexi Pet Products, LLC, a Delaware limited liability company\n☐\nVitaMedica, Inc, a Nevada corporation\n☐\nUpexi Enterprise, LLC, a Delaware limited liability company\no\nUpexi Property & Assets, LLC, a Delaware limited liability company\n■\nUpexi 17129 Florida, LLC, a Delaware limited liability company\no\nE-Core Technology, Inc. a Florida corporation\no\nUpexi Distribution Management LLC, a Delaware limited liability company\n☐\nInteractive Offers, LLC (Interactive), a Delaware limited liability company\n☐\nCygnet Online, LLC (Cygnet), a Delaware limited liability company, 55% owned (100% owned as of September 1, 2023)\nBusiness Acquisitions\nOn August 1, 2021, the Company completed an asset purchase agreement with Grove Acquisition Subsidiary, Inc., a Nevada corporation and wholly owned subsidiary of the Company, and the members of VitaMedica Corporation, a California corporation, to purchase all the assets and assume certain liabilities of VitaMedica. VitaMedica is a leading online seller of supplements for surgery, recovery, skin, beauty, health, and wellness.\nOn October 1, 2021, the Company entered into an equity interest purchase agreement with Gyprock Holdings LLC, a Delaware limited liability company, MFA Holdings Corp., a Florida corporation, and Sherwood Ventures, LLC, a Texas limited liability company, to acquire all of the outstanding membership interest of Interactive Offers, LLC, a Delaware limited liability company.\nOn April 1, 2022, the Company entered into a securities purchase agreement with the single investor to purchase 55% of the equity interest in Cygnet Online, LLC, a Delaware limited liability company, and agreements to enable the Company to purchase the remaining 45% over the following two years.\nOn September 1, 2023, the Company purchased the remaining 45% of Cygnet Online, LLC for $500,000 cash, 90,909 shares of the Companys common stock and a $300,000 cash payment due on September 1, 2024.\nOn August 12, 2022, the Company completed an asset purchase agreement with GA Solutions, LLC, a Delaware limited liability company (LuckyTail), pursuant to which the Company acquired substantially all assets of LuckyTail. LuckyTail sells pet nail grinders and other pet products through various sales channels including some international sales channels.\nOn October 31, 2022, the Company and its wholly owned subsidiary Upexi Enterprise, LLC, completed a securities purchase agreement to purchase the outstanding stock of E-Core Technology, Inc. d/b/a New England Technology, Inc. (E-Core), a Florida corporation. E-Core distributes non-owned branded products to national retail distributors and has branded products in the toy industry that E-Core sells direct to consumers through online sales channels and to national retail distributors.\nBusiness Divested\nOn October 26, 2022, the Company executed a membership interest purchase agreement to sell 100% of the membership interests of Infusionz LLC, a Colorado limited liability company (Infusionz), included in the sale was all rights to Infusionz brands and the manufacturing of certain private label business. Infusionz was originally purchased by the Company in July of 2020. The divestiture of Infusionz and related private label manufacturing represents a strategic shift in our operations and will allow us to become a predominantly product distribution focused company for both our Company owned brands and non-owned brands. Accordingly, the results of the business were classified as discontinued operations in our condensed statements of operations and excluded from both continuing operations and segment results for all periods presented.\nThe Company has transferred Infusionz LLC corporate ownership and the information necessary to operate the business. On June 30, 2023, operations were still not transitioned, and the Buyer still had not cured the defaults dating back to December of 2022. The Company has notified the Buyer of the defaults and has notified the Buyer that all obligations and undertakings to the Buyer are terminated.\nOn August 31, 2023, Upexi, Inc. (the Company) entered into an Equity Interest Purchase Agreement (EIPA) pursuant to which the Company sold one hundred percent (100%) of the issued and outstanding equity (the Interests) of its wholly owned subsidiary Interactive Offers, LLC (Interactive) to Amplifyir Inc. (the Buyer). The purchase price for the Interests was One Million Two Hundred Fifty Thousand Dollars ($1,250,000), subject to certain customary post-closing adjustments. In addition, the Buyer is obligated to pay the Company two-and one-half percent (2.5%) of certain advertising revenues of Interactive for a two-year period post-closing. Accordingly, the results of the business were classified as discontinued operations in our statements of operations and excluded from both continuing operations and segment results for all periods presented.\nEmerging Growth Company Status\nWe are an emerging growth company under the Jumpstart our Business Startups (JOBS) Act of 2012. We shall continue to be deemed an emerging growth company until the earliest of:\n1.\nThe last day of our fiscal year during which our total annual gross revenues exceed $1,235,000,000 (as such amount is indexed for inflation every 5 years by the Commission to reflect the change in the Consumer Price Index for All Urban Consumers published by the Bureau of Labor Statistics);\n2.\nThe last day of our fiscal year in which the fifth anniversary of the first sale of our common equity securities pursuant to an effective IPO registration statement occurred;\n3.\nThe date on which the Company has, during the previous 3-year period, issued more than $1,000,000,000 in non-convertible debt; or\n4.\nThe date on which the Company qualifies as a ‘large accelerated filer, as defined in section 240.12b-2(2) of title 46, Code of Federal Regulations, or any successor thereto.\nAs an emerging growth company, we are exempt from Section 404(b) of the Sarbanes-Oxley Act of 2002. Section 404(a) requires issuers to publish information in their annual reports concerning the scope and adequacy of the internal control structure and procedures for financial reporting. This statement shall also assess the effectiveness of such internal controls and procedures. Section 404(b) requires that the registered accounting firm shall, in the same report, attest to and report on the assessment and the effectiveness of the internal control structure and procedures for financial reporting.\nAs an emerging growth company, we are also exempt from Section 14A and B of the Securities Exchange Act of 1934, which require the shareholder approval of executive compensation and golden parachutes. These exemptions are also available to us as a smaller reporting company that qualifies as a non-accelerated filer.\nDESCRIPTION OF BUSINESS\nOur Company\nUpexi is a multi-faceted brand owner with established brands in the health, wellness, pet, beauty and other growing markets. We operate in emerging industries with high growth trends and look to drive organic growth of our current brands. We focus on direct to consumer and Amazon brands that are scalable and have anticipated, high industry growth trends. Our goal is to continue to accumulate consumer data and build out a significant customer database across all industries we sell into. The growth of our current customer database has been key to the year-over-year gains in sales and cash flow. To drive additional growth, we have and will continue to acquire profitable Amazon and eCommerce businesses that can scale quickly and reduce costs through corporate synergies. We utilize our in-house SaaS programmatic ad technology to help achieve a lower cost per acquisition and accumulate consumer data for increased cross-selling between our growing portfolio of brands.\nUpexi, Inc. (the Company) is a Nevada corporation and operates through fifteen active subsidiaries in the digital first brand business, Amazon and wholesale distribution, and customer insights businesses.\nUpexi specializes in acquiring, building, and growing digital first, omnichannel brands in high growth, high margin sectors such as health, wellness, pet, and beauty. Leveraging our in-house expertise and technology, we scale our brands with a consumer centric approach, tapping into our in-house core capabilities and market insights across our portfolio to foster innovation and accessibility. Our growing consumer database has been key to the year-over-year gains in sales and profits. Further bolstering growth, we have and will continue to acquire profitable Amazon and eCommerce businesses that can be scaled quickly and profitably while reducing costs through corporate synergies.\nUpexis Enterprise LLC operates two wholly subsidiaries; Cygnet and E-Core. Cygnet primarily sells products through Amazon with a focus on the wellness industry, while E-Core has historically focused on product liquidation of consumer electronics and luxury goods.\nOur Brands\nTytan Tiles is a growing brand in the childrens STEM toy category. The Brand is available in Walmarts 3,900 stores, Sams Club, BJs, Target, and other select box retail locations. The brand also holds a Disney License for new children sets being sold into Amazon and DTC year end 2023.\nVitaMedicas mission is to empower wellness journeys through science-based holistic natural health solutions. Through The Science of Natural Health® we believe in a world where everyone can take ownership of their health, happiness, and vitality.\nFor over 25 years, VitaMedica clinician-originated nutraceuticals and cosmeceuticals have been recommended by thousands of doctors to serve millions of patients.\nVitaMedicas sales model includes wholesale distribution through surgeons and med spas and direct to consumers through eCommerce and marketplaces.\nLuckyTail, where at-home care meets innovation. We connect pet owners with the products they need to simplify and improve at-home wellness and grooming care for their beloved pets, empowering pet parents to provide their cherished furry companions with the pampering they deserve in the comfort of their own space.\nLucky tails products consist of its flagship nail grinder and healthy all-natural pet supplements.\nAt Cure Mushrooms, we have harnessed the extraordinary benefits of natures most powerful superfood: functional mushrooms. Our suite of premium mushroom extracts are meticulously crafted to elevate overall well-being, offering a wide spectrum of health benefits and a holistic approach to everyday wellness. From fortifying your immune system, to sharpening cognition, to combating the rigors of daily stress, our products are designed to deliver full-body wellness and convenience with every serving.\nMoonwlkr Health is on a mission to elevate wellness through flavorful innovation. We are committed to providing innovative and nutritious gummy supplements that effortlessly integrate into your daily routine. Our formulations boast quality ingredients you can trust, paired with flavors that delight and inspire. With Moonwlkr Health, nourishing your body has never been so simple, delicious, and enjoyable. Join us in embracing a lifestyle of vitality, where wellness meets indulgence.\nThe Companys fifteen active subsidiaries are as follows:\n☐\nHAVZ, LLC, d/b/a/ Steam Wholesale, a California limited liability company\no\nSWCH, LLC, a Delaware limited liability company\no\nCresco Management, LLC, a California limited liability company\n☐\nTrunano Labs, Inc., a Nevada corporation\n☐\nMW Products, Inc., a Nevada corporation\n☐\nUpexi Holding, LLC, a Delaware limited liability company\no\nUpexi Pet Products, LLC, a Delaware limited liability company\n☐\nVitaMedica, Inc, a Nevada corporation\n☐\nUpexi Enterprise, LLC, a Delaware limited liability company\no\nUpexi Property & Assets, LLC, a Delaware limited liability company\n■\nUpexi 17129 Florida, LLC, a Delaware limited liability company\no\nE-Core Technology, Inc. a Florida corporation\no\nUpexi Distribution Management LLC, a Delaware limited liability company\n☐\nInteractive Offers, LLC (Interactive), a Delaware limited liability company\n☐\nCygnet Online, LLC, a Delaware limited liability company, 55% owned (100% owned as of September 1, 2023)\nIn addition, the Company has four wholly owned subsidiaries that had no activity during the year ended June 30, 2023.\n·\nSteam Distribution, LLC, a California limited liability company\n·\nOne Hit Wonder, Inc., a California corporation\n·\nOne Hit Wonder Holdings, LLC, a California limited liability company\n·\nVape Estate, Inc., a Nevada Corporation\nHAVZ, LLC, d/b/a/ Steam Wholesale operates manufacturing and/or distribution centers in Las Vegas, Nevada supporting our health and wellness products, including those products manufactured with hemp ingredients and our overall distribution operations. We have continued to manage these operations with our corporate focus moving towards other larger opportunities and investments for the future.\nIn the United States, hemp products that are manufactured by Upexi are regulated by the U.S. Food and Drug Administration, the Federal Trade Commission, the United States Department of Agriculture (USDA), and various state agencies within the individual States. As an initial matter, the hemp products manufactured and distributed by Upexi must meet the requirements of the Agricultural Improvement Act of 2018 (the Farm Bill). Under the Farm Bill, all hemp products must contain no more than 0.3% of 9-delta-tetraydrocannabidiols (9-delta) on a dry weight basis. To ensure compliance with this provision, Upexi requires all hemp products it manufactures and distributes to contain no more than 0.3% of all tetraydrocannabidiols not simply 9-delta. The Farm Bill also requires that Upexi only use hemp [manufacturers/producers] that are duly licensed under state law or pursuant to the regulations issued by the USDA. Consequently, the Company processes, develops, manufactures, and sells its products pursuant to the Farm Bill. CBD products manufactured and distributed by Upexi Inc. must also meet the requirements of the federal Food, Drug, and Cosmetic Act (FDCA) and the federal Food and Drug Administrations (the FDA) regulations implementing the FDCA. While neither the FDCA nor FDA has specific provisions that relate to the marketing of hemp products, the products are subject to the general adulteration and labeling provisions of the FDCA and FDAs regulations depending on whether the product is marketed as a cosmetic, dietary supplement or food. The permissibility of hemp products containing cannabinoids remains in a state of flux. The FDA has issued guidance titled FDA Regulation of Cannabis and Cannabis-Derived Products, Including Cannabidiol (CBD) pursuant to which the FDA has taken the position that cannabidiol (CBD) is prohibited from use as an ingredient in a food or beverage or as a dietary ingredient in or as a dietary supplement based on several provisions of the FDCA. In the definition of dietary supplement found in the FDCA at Section 201(ff), an article authorized for investigation as a new drug, antibiotic, or biological for which substantial clinical investigations have been instituted and for which the existence of such investigations has been made public, is excluded from the definition of dietary supplement. A similar provision in the FDCA at 301(ll) makes it a prohibited act to introduce or deliver into commerce any food with a substance that was investigated as a new drug prior to being included in a food. There are no similar exclusions for the use of CBD in non-drug topical products, as long as such products otherwise comply with applicable laws. The FDA created a task force to address the further regulation of CBD and other cannabis-derived products and is currently evaluating the applicable science and pathways for regulating CBD and other cannabis-derived ingredients. Additionally, various states have enacted state-specific laws pertaining to the handling, manufacturing, labeling, and sale of CBD and other hemp products. Compliance with state-specific laws and regulations could impact our operations in those specific states. It is important to note that FDA has not taken any specific positions regarding the regulatory status of other cannabinoids, for example CBDA, CBDG, and CBDN. Finally, the Federal Trade Commission is the agency that is vested with ensuring that all marketing claims for hemp products are truthful and non-misleading.\nOur Products\nUpexi is a multi-faceted brand owner with established brands in the health, wellness, pet, beauty and other growing markets. We operate in emerging industries with high growth trends and look to drive organic growth of our current brands. We focus on direct to consumer and Amazon brands that are scalable and have anticipated, high industry growth trends. Our goal is to continue to accumulate consumer data and build out a significant customer database across all industries we sell into. The growth of our current customer database has been key to the year-over-year gains in sales and profits. To drive additional growth, we have and will continue to acquire profitable Amazon and eCommerce businesses that can scale quickly and reduce costs through corporate synergies. We utilize our in-house SaaS programmatic ad technology to help achieve a lower cost per acquisition and accumulate consumer data for increased cross-selling between our growing portfolio of brands.\nThe global ecommerce growth rate for 2022 is forecast at 12.2 percent, bringing global eCommerce sales worldwide to $5.542 trillion. Online shopping trends are expected to grow 50 percent in the U.S. in the next few years. eCommerce sales are forecast to increase by a whopping 50 percent from $907.9 billion in 2022 to $1.4 trillion in 2025. The industry saw exponential growth during the pandemic, as consumers were more apt to buy online than go into stores, but while the CAGR has dipped from 2020, the industry continues to grow steadily.\nThe market, customers and distribution methods for eCommerce products are large and diverse. While Amazon remains the largest eCommerce channel, others are carving out a big chunk of the market, including Walmart, eBay, and Etsy. More opportunities are popping up for sellers as well. Being able to navigate multiple marketplaces is a key to our success and helps reach different demographics and consumers with specific buying behaviors.\nEach of our brands creates new opportunities for us to target additional markets and consumers. Our goal through this diverse portfolio is to create products that can be cross-sold between brands to help take advantage of our growing list of consumer data.\nOur target customers are first and foremost end consumers via internet sales; however, we see growth opportunities in direct-to-consumer retail stores, cooperatives, affiliate sales and master distributors. As we continue to develop our business, these markets may change, be re-prioritized or eliminated as management responds to consumer and regulatory developments.\nOur Competitive Strengths\nWe attribute our success to our diverse portfolio of consumer products.\nDiversification of Product Offerings. As an aggregator, our research and development team carefully tracks the growth rates for various consumer products, which serves as the first means of identifying profitable brands that have significant opportunities for scale. While many companies continue to spend on growth at all costs, we have spent to increase our profitability and build a foundation for profits in the toughest of times. We remained patient when other aggregators were over-extending their means which has provided us for better opportunities at more favorable valuations.\nAdvertising Technology. We understand that advertising and consumer data is the key to growth when it comes to any eCommerce business. Our investment in such technology helps lower our advertising costs, while providing a revenue stream from others who we outsource this programmatic SAAS to. This ownership of data allows us to help cross-sell any brand we acquire or launch.\nLogistical Expertise. Our executive team comes from a background in logistics, with CEO, Allan Marshall, the founder of XPO Logistics (formerly known as Segmentz, Inc.). With increased shipping costs affecting online retailers, our strength is understanding this and finding ways to lower our costs and overhead, thus increasing profit margins on all of our products.\nLiquidation Markets. Resellers on and off Amazon represent a significant part of our business, which allows us to use our capital to buy in bulk with quick resale opportunities, whether it be direct Amazon listings or through partnerships with the likes of Walmart, BJs, Costco, Sams Club, etc. As a result, we are able to expand our network, build new relationships, and sell branded products without the added cost of advertising.\nRetail Partnerships. While eCommerce is our direct line of business, we have grown and continue to expand our relationships with big box retailers in order to sell branded products as resellers or to place our in-house brands in those stores. With longstanding accounts that we have taken ownership of through acquisitions, we have grown our network and have untapped additional revenue streams.\nProfessionalism and Entrepreneurial Culture. Our professionalism and entrepreneurial culture fosters highly dedicated employees who provide our customers with unsurpassed customer service. We continue to invest in our talent by providing every employee with an extensive and ongoing education and have successfully developed programs that provide comprehensive product knowledge and the tools needed to have a unique understanding of our customers personalities and decision-making processes.\nExperienced and Proven Management Team Driving Growth through Organic and Accretive Acquisition Opportunities. We believe our management team has extensive experience in the industry. Our senior management team brings experience in accounting, mergers and acquisitions, financial services, consumer packaged goods, retail operations and third-party logistics.\nOur Growth Strategy\nOur growth will focus on the expansion of our brand portfolio through organic growth and strategic acquisitions.\nDirect-to-Consumer expansion. Our direct-to-consumer business is expected to be our growth driver for the next several years, driven by acquisitions of profitable Amazon and eCommerce businesses. This allows us to tap into multiple markets and helps us acquire proven brands that are at a stage in their lifecycle when they lack the resources (capital and personnel) to grow rapidly on their own. Our model helps inject those resources into the business in hopes to scale the business efficiently.\nResellers & liquidators. While direct-to-consumer brands represent a major part of our growth, our company has realized the potential of acquiring profitable resellers who sell on/to Amazon, Walmart, Costco, BJs, Sams Club, and more. Our first acquisition in the space, Cygnet Online, sells branded OTC products on Amazon. A letter of intent was signed on August 2, 2022 for the acquisition of E-Core, Inc. and its subsidiaries to further expand this segment of our business. We believe this is a lucrative industry that also helps establish strong, big box retail partnerships.\nTalent acquisition. A large part of our acquisition process is to not only evaluate the brand/product offerings, but to understand the team that has been responsible for its success. In a tough market for hiring, this has proven to be a strategic method for bringing on talent. We not only get a great brand, but look to retain the personnel, often the heartbeat of said brand, give them resources, and even utilize them for other brands that we have launched internally or acquired. We strongly believe that continued success relies on a growing team of experts across various industries.\nAdvertising technology. With online sales increasing, so has the cost of advertising. Our in-house, programmatic advertising technology, Interactive Offers, not only acts as a revenue stream for our business, but provides us with endless research, consumer data, and allows us to achieve lower advertising costs for our brands. The business has a growing list of publishers and advertisers who also utilize our technology to monetize their data, achieve better CPMs, and even increase their average order values.\nInternational expansion. Our primary focus has been on the U.S. eCommerce market which, as mentioned, is forecasted to grow stronger than others. However, with recently acquired brands and their presence in international markets, we expect nearly all of our products to be offered worldwide over the next few years.\nAcquiring aggregators. The aggregation craze took off in 2019 to 2020, but many found themselves overpaying for brands and not being able to support the growth they had forecasted. Recently, these aggregators have been looking for funding and/or selling their assets. We seek to take advantage of this opportunity to bring on additional brands and talent that, for better or worse, were overwhelmed and unprepared.\nCompetition\nThere is heavy competition in the aggregation market, but each company seems to be trying to carve their own niche in the space. We compete against several national and international companies, most of which have substantially greater resources than we do. Our principal competitors consist of large, well-known and funded, private companies. Our goal is never to compete against these aggregators, but to do our own research, focus on profitability, and grow efficiently, rather than overextend ourselves and pay up for valuations that dont make sense.\nGovernment Regulation\nWe are subject to laws and regulations affecting our operations in a number of areas. These laws and regulations affect the Companys activities in areas, including, but not limited to, the hemp business in the United States, the consumer products and nutritional supplement markets in the United States, consumer protection, labor, intellectual property ownership and infringement, import and export requirements, federal and state healthcare, environmental and safety. The successful execution of our business objectives will be contingent upon our compliance with all applicable laws and regulations and obtaining all necessary regulatory approvals, permits and registrations, which may be onerous and expensive. Any such costs, which may rise in the future as a result of changes in such applicable laws and regulations and the expansion of the Companys business, could make our products less attractive to our customers, delay the introduction of new products, and require the Company to implement policies and procedures designed to ensure compliance with applicable laws and regulations.\nWe operate our business in markets that are both highly regulated and rapidly evolving. We are subject to numerous federal and state laws and regulations affecting the manufacturing, packaging, labeling and sale of food, beverages, dietary supplements, and personal care products/cosmetics, as well as the use of hemp and hemp-derived ingredients like CBD in such products. The FDA regulates hemp and hemp-derived ingredients in FDA-regulated products pursuant to the provisions of the FDCA and regulations promulgated pursuant to it, in particular those related to adulteration and labeling of cosmetic, food, and dietary supplements. The FDA has issued guidance on the subject and issued letters to companies regarding claims made for products and the use of such ingredients in various products. The FDA also initiated a task force to evaluate pathways for further regulation of hemp and hemp-derived ingredients. At various times, bills pertaining to the regulation of hemp and hemp-derived ingredients have been introduced in both the U.S. Senate and the U.S. House of Representatives, and additional proposed legislation is expected to be introduced in the future to clarify the regulatory status of cannabinoids from hemp generally and CBD generally. Future legislation approved by Congress and signed by the President, or rulemaking promulgated by the FDA, could either positively or adversely impact the future sale of products by the Company.\nWe are currently not subject to any foreign regulations as we do not currently distribute or export any products, including hemp or CBD related products outside the U.S. Additionally, we are not aware of any foreign regulations that we had to comply with in regard to the sale of our flavoring products to one end user customer in the U.S. who distributed such products to Europe where it had operations. The responsibility for compliance with any European regulations would be on such customer.\nAdditionally, numerous states have passed forms of hemp legislation governing the cultivation of hemp, as well as the further processing and sale of hemp and products with hemp or hemp-derived ingredients. Those states that have not yet enacted laws or issued regulations pertaining to hemp and hemp-derived ingredients may do so in the near future. Unless Congress specifically enacts laws preempting the state regulations of hemp products, we will continue to be subject not only to federal law but various state laws. Presently, Upexi and only distributes hemp-products in states that it is legal to do so. Changes in the state laws and regulations could again either positively or adversely affect our ability to sell products in those states.\nEmployees\nThe Company has 95 full-time employees working out of its headquarters in Tampa Florida, its Henderson, Nevada, manufacturing facility, its offices and distribution warehouses in Southern Florida or individuals home-based offices.\nWHERE YOU CAN FIND MORE INFORMATION\nYou are advised to read this Form 10-K in conjunction with other reports and documents that we file from time to time with the SEC. You may obtain copies of these reports directly from us or from the SEC at the SECs Public Reference Room at 100 F. Street, N.E. Washington, D.C. 20549, and you may obtain information about obtaining access to the Reference Room by calling the SEC at 1-800-SEC-0330. In addition, the SEC maintains information for electronic filers at its website http://www.sec.gov. Item 1A. Risk Factors\nInvesting in our common stock involves a high degree of risk. You should consider carefully the risks, uncertainties and other factors described below, in addition to the other information set forth in this Form 10-K, before making an investment decision. Any of these risks, uncertainties and other factors could materially and adversely affect our business, financial condition, results of operations, cash flows or prospects. In that case, the market price of our common stock could decline, and you may lose all or part of your investment in our common stock. See also Cautionary Statement Regarding Forward-Looking Statements.\nRisks Relating to Our Company\nOur limited operating history makes it difficult for potential investors to evaluate our business prospects and management.\nThe Company was incorporated on September 5, 2018 and only commenced operations thereafter. Accordingly, we have a limited operating history upon which to base an evaluation of our business and prospects. Operating results for future periods are subject to numerous uncertainties, and we cannot assure you that the Company will achieve or sustain profitability in the future.\nThe Companys prospects must be considered in light of the risks encountered by companies in the early stage of development, particularly companies in new and rapidly evolving markets. Future operating results will depend upon many factors, including our success in attracting and retaining motivated and qualified personnel, our ability to establish short term credit lines or obtain financing from other sources, such as this Offering, our ability to develop and market new products, our ability to control costs, and general economic conditions. We cannot assure you that the Company will successfully address any of these risks. There can be no assurance that our efforts will be successful or that we will ultimately be able to attain profitability.\nIf we are unable to protect our intellectual property rights, our competitive position could be harmed.\nOur commercial success will depend in part on our ability to obtain and maintain appropriate intellectual property protection in the United States and foreign countries with respect to our proprietary formulations and products. Our ability to successfully implement our business plan depends on our ability to build and maintain brand recognition using trademarks, service marks, trade dress and other intellectual property. We may rely on trade secret, trademark, patent and copyright laws, and confidentiality and other agreements with employees and third parties, all of which offer only limited protection. The steps we have taken and the steps we will take to protect our proprietary rights may not be adequate to preclude misappropriation of our proprietary information or infringement of our intellectual property rights. If our efforts to protect our intellectual property are unsuccessful or inadequate, or if any third party misappropriates or infringes on our intellectual property, the value of our brands may be harmed, which could have a material adverse effect on the Companys business and prevent our brands from achieving or maintaining market acceptance. Protecting against unauthorized use of our trademarks and other intellectual property rights may be expensive, difficult and in some cases not possible. In some cases, it may be difficult or impossible to detect third-party infringement or misappropriation of our intellectual property rights and proving any such infringement may be even more difficult.\nWe may not be able to effectively manage growth.\nAs we continue to grow our business and develop products, we expect to need additional research, development, managerial, operational, sales, marketing, financial, accounting, legal and other resources. The Company expects its growth to place a substantial strain on its managerial, operational and financial resources. The Company cannot assure that it will be able to effectively manage the expansion of its operations, or that its facilities, systems, procedures or controls will be adequate to support its operations. The Companys inability to manage future growth effectively would have a material adverse effect on its business, financial condition and results of operations.\nOur management may not be able to control costs in an effective or timely manner.\nThe Companys management has made reasonable efforts to assess, predict and control costs and expenses. However, the Company only has a brief operating history upon which to base those efforts. Implementing our business plan may require more employees, capital equipment, supplies or other expenditure items than management has predicted. Likewise, the cost of compensating employees and consultants or other operating costs may be higher than managements estimates, which could lead to sustained losses.\nWe expect our quarterly financial results to fluctuate.\nWe expect our net sales and operating results to vary significantly from quarter to quarter due to a number of factors, including changes in:\n·\nDemand for our products;\n·\nOur ability to obtain and retain existing customers or encourage repeat purchases;\n·\nOur ability to manage our product inventory;\n·\nGeneral economic conditions, both domestically and in foreign markets;\n·\nAdvertising and other marketing costs; and\n·\nCosts of creating and expanding product lines.\nAs a result of the variability of these and other factors, our operating results in future quarters may be below the expectations of our stockholders.\nWe are subject to the reporting requirements of U.S. federal securities laws, which can be expensive.\nWe will be subject to the information and reporting requirements of the Exchange Act and other federal securities laws, including compliance with the Sarbanes-Oxley Act. The costs of preparing and filing annual and quarterly reports, proxy statements and other information with the SEC and furnishing audited financial statements to stockholders will cause our expenses to be higher than they would be if we had remained privately held. In addition, it may be time consuming, difficult and costly for us to develop and implement the internal controls and reporting procedures required by the Sarbanes-Oxley Act. We may need to hire additional financial reporting, internal controls and other finance personnel in order to develop and implement appropriate internal controls and reporting procedures.\nCybersecurity breaches of our IT systems could degrade our ability to conduct our business operations and deliver products and services to our customers, delay our ability to recognize revenue, compromise the integrity of our software products, result in significant data losses and the theft of our intellectual property, damage our reputation, expose us to liability to third parties and require us to incur significant additional costs to maintain the security of our networks and data.\nWe increasingly depend upon our IT systems to conduct virtually all of our business operations, ranging from our internal operations and product development activities to our marketing and sales efforts and communications with our customers and business partners. Computer programmers may attempt to penetrate our network security, or that of our website, and misappropriate our proprietary information or cause interruptions of our service. Because the techniques used by such computer programmers to access or sabotage networks change frequently and may not be recognized until launched against a target, we may be unable to anticipate these techniques. In addition, sophisticated hardware and operating system software and applications that we produce or procure from third parties may contain defects in design or manufacture, including bugs and other problems that could unexpectedly interfere with the operation of the system. We have also outsourced a number of our business functions to third-party contractors, including our manufacturers and logistics providers, and our business operations also depend, in part, on the success of our contractors own cybersecurity measures. Similarly, we rely upon distributors, resellers and system integrators to sell our products and our sales operations depend, in part, on the reliability of their cybersecurity measures. Additionally, we depend upon our employees to appropriately handle confidential data and deploy our IT resources in safe and secure fashion that does not expose our network systems to security breaches and the loss of data. Accordingly, if our cybersecurity systems and those of our contractors fail to protect against unauthorized access, sophisticated cyberattacks and the mishandling of data by our employees and contractors, our ability to conduct our business effectively could be damaged in a number of ways, including:\nWe may incur significant costs and require significant management resources to evaluate our internal control over financial reporting as required under Section 404 of the Sarbanes-Oxley Act, and any failure to comply or any adverse result from such evaluation may have an adverse effect on our stock price.\nAs a smaller reporting company, as defined in Rule 12b-2 under the Exchange Act, we will be required to evaluate our internal control over financial reporting under Section 404 of the Sarbanes-Oxley Act of 2002 (Section 404) and to include an internal control report beginning with the Annual Report on Form 10-K for the fiscal year ending June 30, 2022. This report must include managements assessment of the effectiveness of our internal control over financial reporting as of the end of the fiscal year. This report must also include disclosure of any material weaknesses in internal control over financial reporting that we have identified. Failure to comply, or any adverse results from such evaluation could result in a loss of investor confidence in our financial reports and have an adverse effect on the trading price of our equity securities.\nIncreases in costs, disruption of supply or shortage of raw materials could harm our business.\nWe may experience increases in the cost or a sustained interruption in the supply or shortage of raw materials. Any such an increase or supply interruption could materially negatively impact our business, prospects, financial condition and operating results. We use various raw materials in our business including aluminum. The prices for these raw materials fluctuate depending on market conditions and global demand for these materials and could adversely affect our business and operating results. Substantial increases in the prices for our raw materials increase our operating costs and could reduce our margins if we cannot recoup the increased costs through increased prices for our products.\nOur failure to meet the continuing listing requirements of the NASDAQ Capital Market could result in a de-listing of our securities.\nIf, after this offering, we fail to satisfy the continuing listing requirements of NASDAQ, such as the corporate governance, stockholders equity or minimum closing bid price requirements, NASDAQ may take steps to delist our Common Stock. Such a delisting would likely have a negative effect on the price of our Common Stock and would impair your ability to sell or purchase our Common Stock when you wish to do so. In the event of a delisting, we would likely take actions to restore our compliance with NASDAQs listing requirements, but we can provide no assurance that any such action taken by us would allow our Common Stock to become listed again, stabilize the market price or improve the liquidity of our securities, prevent our Common Stock from dropping below the NASDAQ minimum bid price requirement or prevent future non-compliance with NASDAQs listing requirements.\nWe will incur increased costs and demands upon management as a result of complying with the laws and regulations affecting public companies, which could adversely affect our operating results.\nAs a public company, we will incur significant legal, accounting and other expenses that we did not incur as a private company, including costs associated with public company reporting and corporate governance requirements. These requirements include compliance with Section 404 and other provisions of the Sarbanes-Oxley Act, as well as rules implemented by the Securities and Exchange Commission, or SEC, and the NASDAQ. In addition, our management team will also have to adapt to the requirements of being a public company. We expect complying with these rules and regulations will substantially increase our legal and financial compliance costs and to make some activities more time-consuming and costly.\nThe increased costs associated with operating as a public company will decrease our net income or increase our net loss and may require us to reduce costs in other areas of our business or increase the prices of our products. Additionally, if these requirements divert our managements attention from other business concerns, they could have a material adverse effect on our business, financial condition and operating results.\nAs a public company, we also expect that it may be more difficult and more expensive for us to obtain director and officer liability insurance, and we may be required to accept reduced policy limits and coverage or incur substantially higher costs to obtain the same or similar coverage. As a result, it may be more difficult for us to attract and retain qualified individuals to serve on our board of directors or as our executive officers.\nWe are eligible to be treated as an emerging growth company, as defined in the JOBS Act, and a smaller reporting company within the meaning of the Securities Act, and we cannot be certain if the reduced disclosure requirements applicable to emerging growth companies or smaller reporting companies will make our Common Stock less attractive to investors.\nWe are an emerging growth company, as defined in the JOBS Act. For as long as we continue to be an emerging growth company, we may take advantage of exemptions from various reporting requirements that are applicable to other public companies that are not emerging growth companies, including (1) not being required to comply with the auditor attestation requirements of Section 404 of the Sarbanes-Oxley Act, (2) reduced disclosure obligations regarding executive compensation in this annual report and our periodic reports and proxy statements and (3) exemptions from the requirements of holding a nonbinding advisory vote on executive compensation and stockholder approval of any golden parachute payments not previously approved. In addition, as an emerging growth company, we are only required to provide two years of audited financial statements and two years of selected financial data in this annual report. We could be an emerging growth company for up to five years, although circumstances could cause us to lose that status earlier, including if the market value of our Common Stock held by non-affiliates exceeds $700.0 million as of any December 31 before that time or if we have total annual gross revenue of $1.0 billion or more during any fiscal year before that time, after which, in each case, we would no longer be an emerging growth company as of the following December 31 or, if we issue more than $1.0 billion in non-convertible debt during any three-year period before that time, we would cease to be an emerging growth company immediately.\nAdditionally, we are a smaller reporting company as defined in Item 10(f)(1) of Regulation S-K. Smaller reporting companies may take advantage of certain reduced disclosure obligations, including, among other things, providing only two years of audited financial statements. We will remain a smaller reporting company until the last day of the fiscal year in which (1) the market value of our shares of Common Stock held by non-affiliates exceeds $250 million as of the prior the end of our second fiscal quarter ending December 31 of each year, or (2) our annual revenues exceeded $100 million during such completed fiscal year and the market value of our ordinary shares held by non-affiliates exceeds $700 million as of the prior to the end of our second fiscal quarter ending December 31 of each year. To the extent we take advantage of such reduced disclosure obligations, it may also make comparison of our financial statements with other public companies difficult or impossible.\nAfter we are no longer an emerging growth company, we expect to incur additional management time and cost to comply with the more stringent reporting requirements applicable to companies that are deemed accelerated filers or large accelerated filers, including complying with the auditor attestation requirements of Section 404 of the Sarbanes-Oxley Act. We cannot predict or estimate the amount of additional costs we may incur or the timing of such costs.\nRisks Relating to Our Business and Industry\nWe operate in a highly competitive environment, and if we are unable to compete with our competitors, our business, financial condition, results of operations, cash flows and prospects could be materially adversely affected.\nWe operate in a highly competitive environment. Our competition includes all other companies that are in the business of producing or distributing hemp-based products for personal use or consumption. Many of our competitors have greater resources that may enable them to compete more effectively than us in the CBD industry. Some of our competitors have a longer operating history and greater capital resources, facilities and product line diversity, which may enable them to compete more effectively in this market. Our competitors may devote their resources to developing and marketing products that will directly compete with our product lines. The Company expects to face additional competition from existing competitors and new market entrants. If a significant number of new entrants enters the market in the near term, the Company may experience increased competition for market share and may experience downward pricing pressure on the Companys products as new entrants increase production. Such competition may cause us to encounter difficulties in generating revenues and market share, and in positioning our products in the market. If we are unable to successfully compete with existing companies and new entrants to the market, our lack of competitive advantage will have a negative impact on our business and financial condition.\nUnfavorable publicity or consumer perception of our products or similar products developed and distributed by other companies could have a material adverse effect on our reputation, which could result in decreased sales and fluctuations in our business, financial condition and results of operations.\nWe depend on consumer perception regarding the safety and quality of our products, as well as similar products marketed and distributed by other companies. Consumer perception of hemp-based products can be significantly influenced by adverse publicity in the form of published scientific research, national media attention or other publicity, which may associate consumption of our products or other similar products with adverse effects or question the benefits and/or effectiveness of our products or similar products. A new product may initially be received favorably, resulting in high sales of that product, but that level of sales may not be sustainable as consumer preferences change over time. Future scientific research or publicity could be unfavorable to our industry or any of our particular products and may not be consistent with earlier favorable research or publicity. Unfavorable research or publicity could have a material adverse effect on our ability to generate sales.\nOur failure to appropriately and timely respond to changing consumer preferences and demand for new products could significantly harm our customer relationships and have a material adverse effect on our business, financial condition and results of operations.\nOur business is subject to changing consumer trends and preferences. Our failure to accurately predict or react to these trends could negatively impact consumer opinion of us as a source for the latest products, which in turn could harm our customer relationships and cause us to lose market share. The success of our product offerings depends upon a number of factors, including our ability to:\n·\nAnticipate customer needs;\n·\nInnovate and develop new products;\n·\nSuccessfully introduce new products in a timely manner;\n·\nPrice our products competitively with retail and online competitors;\n·\nDeliver our products in sufficient volumes and in a timely manner; and\n·\nDifferentiate our product offerings from those of our competitors.\nIf we do not introduce new products or make enhancements to meet the changing needs of our customers in a timely manner, some of our products could be rendered obsolete, which could have a material adverse effect on our financial condition and results of operations.\nFuture acquisitions or strategic investments and partnerships could be difficult to identify and integrate with our business, disrupt our business, and adversely affect our financial condition and results of operations.\nWe may seek to acquire or invest in businesses and product lines that we believe could complement or expand our product offerings, or otherwise offer growth opportunities. The pursuit of potential acquisitions may divert the attention of management and cause us to incur various expenses in identifying, investigating, and pursuing suitable acquisitions, whether or not the acquisitions are completed. Future acquisitions could also result in dilutive issuances of equity securities or the incurrence of debt, which could adversely affect our financial position and results of operations. In addition, if an acquired business or product line fails to meet our expectations, our business, financial condition, and results of operations may be adversely affected.\nFailure to successfully integrate acquired businesses and their products and other assets into our Company, or if integrated, failure to further our business strategy, may result in our inability to realize any benefit from such acquisition.\nWe expect to grow by acquiring relevant businesses, including other cannabis-related businesses. The consummation and integration of any acquired business, product or other assets into our Company may be complex and time consuming and, if such businesses and assets are not successfully integrated, we may not achieve the anticipated benefits, cost-savings or growth opportunities. Furthermore, these acquisitions and other arrangements, even if successfully integrated, may fail to further our business strategy as anticipated, expose our Company to increased competition or other challenges with respect to our products or geographic markets, and expose us to additional liabilities associated with an acquired business, technology or other asset or arrangement.\nThe failure to attract and retain key employees could hurt our business.\nOur success also depends upon our ability to attract and retain numerous highly qualified employees. The loss of one or more members of our management team or other key employees or consultants could materially harm our business, financial condition, results of operations and prospects. We face competition for personnel and consultants from other companies, universities, public and private research institutions, government entities and other organizations. Our failure to attract and retain skilled management and employees may prevent or delay us from pursuing certain opportunities. If we fail to successfully fill many management roles, fail to fully integrate new members of our management team, lose the services of key personnel, or fail to attract additional qualified personnel, it will be significantly more difficult for us to achieve our growth strategies and success.\nWe have limited supply sources, and price increases or supply shortages of key raw materials could materially and adversely affect our business, financial condition and results of operations.\nOur products are composed of certain key raw materials. If the prices of such raw materials increase significantly, it could result in a significant increase in our product development costs. If raw material prices increase in the future, we may not be able to pass on such price increases to our customers. A significant increase in the price of raw materials that cannot be passed on to customers could have a material adverse effect on our business, financial condition and results of operations.\nThe Company believes that its continued success will depend upon the availability of raw materials that permit the Company to meet its labeling claims and quality control standards. The supply of our industrial hemp is subject to the same risks normally associated with agricultural production, such as climactic conditions, insect infestations and availability of manual labor or equipment for harvesting. Any significant delay in or disruption of the supply of raw materials could substantially increase the cost of such materials, could require product reformulations, the qualification of new suppliers and repackaging and could result in a substantial reduction or termination by the Company of its sales of certain products, any of which could have a material adverse effect upon the Company. Accordingly, there can be no assurance that the disruption of the Companys supply sources will not have a material adverse effect on the Company.\nLoss of key contracts with our suppliers, renegotiation of such agreements on less favorable terms or other actions these third parties may take could harm our business.\nMost of our agreements with suppliers of our industrial hemp, including our key supplier contract, are short term. The loss of these agreements, or the renegotiation of these agreements on less favorable economic or other terms, could limit our ability to procure raw material to manufacture our products. This could negatively affect our ability to meet consumer demand for our products. Upon expiration or termination of these agreements, our competitors may be able to secure industrial hemp from our existing suppliers which will put the company at a competitive disadvantage in the market.\nLoss of key customers could harm our business.\nFor the year ended June 30, 2021, a significant portion of our sales were to two large customers, but we do not have contracts for future purchases in place with either of these customers. As such, we do not have any purchase commitments from these customers, and there can be no assurance that they will continue to purchase our products. If these customers do not purchase our products in the future, and we are not able to generate a similar volume of sales from other customers, it could have a material effect on our total sales and result in a material adverse effect on our financial condition and business.\nThere is limited availability of clinical studies.\nAlthough hemp plants have a long history of human consumption, there is little long-term experience with human consumption of certain of these innovative product ingredients or combinations thereof in concentrated form. Although the Company performs research and/or tests the formulation and production of its products, there is limited clinical data regarding the safety and benefits of ingesting industrial hemp-based products. Any instance of illness or negative side effects of ingesting industrial hemp-based products would have a material adverse effect on our business and operations.\nWe face substantial risk of product liability claims and potential adverse product publicity.\nLike any other retailer, distributor or manufacturer of products that are designed to be ingested, we face an inherent risk of exposure to product liability claims, regulatory action and litigation if our products are alleged to have caused loss or injury. In the event we do not have adequate insurance or contractual indemnification, product liability claims could have a material adverse effect on the Company. The Company is not currently a named defendant in any product liability lawsuit; however, other manufacturers and distributors of hemp-based products currently are or have been named as defendants in such lawsuits. The successful assertion or settlement of any uninsured claim, a significant number of insured claims, or a claim exceeding the Companys insurance coverage could have a material adverse effect on the Company.\nWe may be unable to attract and retain independent distributors for our products.\nAs a direct selling company, our revenue depends in part upon the number and productivity of our independent distributors. Like most direct selling companies, we experience high levels of turnover among our independent distributors from year to year, who may terminate their service at any time. Generally, we need to increase the productivity of our independent distributors and/or retain existing independent distributors and attract additional independent distributors to maintain and/or increase product sales. Many factors affect our ability to attract and retain independent distributors, including the following:\n·\npublicity regarding our Company, our products, our distribution channels and our competitors;\n·\npublic perceptions regarding the value and efficacy of our products;\n·\nongoing motivation of our independent distributors;\n·\ngovernment regulations;\n·\ngeneral economic conditions;\n·\nour compensation arrangements, training and support for our independent distributors; and\n·\ncompetition in the market.\nOur results of operations and financial condition could be materially and adversely affected if our independent distributors are unable to maintain their current levels of productivity, or if we are unable to retain existing distributors and attract new distributors in sufficient numbers to maintain present sales levels and sustain future growth.\nWe could incur obligations resulting from the activities of our independent distributors.\nWe sell our products through a network of independent distributors. Independent distributors are independent contractors who operate their own business separate and apart from the Company. We may not be able to control certain aspects of our distributors activities that may impact our business. If local laws and regulations, or the interpretation thereof, change and require us to treat our independent distributors as employees, or if our independent distributors are deemed by local regulatory authorities in one or more of the jurisdictions in which we operate to be our employees rather than independent contractors under existing laws and interpretations, we may be held responsible for a variety of obligations that are imposed upon employers relating to their employees, including employment-related taxes and penalties, which could have a material adverse effect on our financial condition and results of operations. In addition, there is the possibility that some jurisdictions may seek to hold us responsible for false product or earnings-related claims due to the actions of our independent distributors. Liability for any of these issues could have a material adverse effect on our business, financial condition and results of operations.\nIf our independent distributors failure to comply with applicable advertising laws and regulations could adversely affect our financial conditions and results of operations.\nThe advertisement of our products is subject to extensive regulations in the markets in which we do business. Our independent distributors may fail to comply with such regulations governing the advertising of our products. We cannot ensure that all marketing materials used by our independent distributors comply with applicable regulations, including bans on false or misleading product and earnings-related claims. If our independent distributors fail to comply with applicable regulations, we could be subjected to claims of false advertising, misrepresentation, significant financial penalties, and/or costly mandatory product recalls and relabeling requirements with respect to our products, any of which could have a material adverse effect on our business, reputation, financial condition and results of operations.\nRisks Related to the CBD Industry\nLaws and regulations affecting the CBD industry are evolving under the Farm Bill, and changes to applicable regulations may materially affect our future operations in the CBD market.\nThe CBD used by the Company is derived from hemp as defined in the Agriculture Improvement Act of 2018 (United States) (the Farm Bill ) and codified at 7 USC 1639o means the plant Cannabis sativa L. and any part of that plant, including the seeds thereof and all derivatives, extracts, cannabinoids, isomers, acids, salts, and salts of isomers, whether growing or not, with a delta-9 tetrahydrocannabinol concentration of not more than 0.3 percent on a dry weight basis. The Cannabis sativa plant and its derivatives may also be deemed marijuana, depending on certain factors. Marijuana is a Schedule I controlled substance and is defined in the Federal Controlled Substances Act at 21 USC Section 802(16) as all parts of the plant Cannabis sativa L., whether growing or not; the seeds thereof; the resin extracted from any part of such plant; and every compound, manufacture, salt, derivative, mixture, or preparation of such plant, its seeds or resin. Exemptions to that definition provided in 21 USC Section 802(16) include the mature stalks of such plant, fiber produced from such stalks, oil or cake made from the seeds of such plant, any other compound, manufacture, salt, derivative, mixture, or preparation of such mature stalks (except the resin extracted therefrom), fiber, oil, or cake, or the sterilized seed of such plant which is incapable of germination or hemp as defined in 7 USC 1639o.\nSubstances meeting the definition of hemp in the Farm Bill and 7 USC 1639o may be used in clinical studies and research through an Investigational New Drug (IND) application with the Food and Drug Administration (the FDA). Substances scheduled as controlled substances, like marijuana, require more rigorous regulation, including interaction with several agencies including the FDA, the DEA, and the NIDA within the National Institutes of Health (NIH).\nAccordingly, if the CBD used by the Company is deemed marijuana and, therefore, a Schedule I controlled substance, the Company could be subject to significant additional regulation, as well as enforcement actions and penalties pertaining to the Federal Controlled Substances Act, and any resulting liability could require the Company to modify or cease its operations.\nFurthermore, in conjunction with the Farm Bill, the FDA released a statement about the status of CBD use in food and dietary supplements, noting that the Farm Bill explicitly preserved the FDAs authority to regulate products containing cannabis or cannabis-derived compounds under the Federal Food, Drug, and Cosmetic Act (the FDCA) and Section 351 of the Public Health Service Act. Any difficulties we experience in complying with existing and/or new government regulation could increase our operating costs and adversely impact our results of operations in future periods. The FDA has issued guidance titled FDA Regulation of Cannabis and Cannabis-Derived Products, Including Cannabidiol (CBD) pursuant to which the FDA has taken the position that CBD is prohibited from use as an ingredient in a food or beverage or as a dietary ingredient in or as a dietary supplement based on several provisions of the FDCA. In the definition of dietary supplement found in the FDCA at 201(ff), an article authorized for investigation as a new drug, antibiotic, or biological for which substantial clinical investigations have been instituted and for which the existence of such investigations has been made public, is excluded from the definition of dietary supplement. A similar provision in the FDCA 301(ll) makes it a prohibited act to introduce or deliver into commerce any food with a substance that was investigated as a new drug prior to being included in a food. There are no similar exclusions for the use of CBD in non-drug topical products, as long as such products otherwise comply with applicable laws. The FDA created a task force to address the further regulation of CBD and other cannabis-derived products and is currently evaluating the applicable science and pathways for regulating CBD and other cannabis-derived ingredients.\nAs a result of the Farm Bills recent passage, we expect that there will be a constant evolution of laws and regulations affecting the CBD industry which could affect the Companys plan of operations. Local, state and federal hemp laws and regulations may be broad in scope and subject to changing interpretations. These changes may require us to incur substantial costs associated with legal compliance and may ultimately require us to alter our business plan. Furthermore, violations of these laws, or alleged violations, could disrupt our business and result in a material adverse effect on our operations. We cannot predict the nature of any future laws, regulations, interpretations or applications, and it is possible that regulations may be enacted in the future that will be directly applicable to our business.\nChanges to state laws pertaining to industrial hemp could slow the use of industrial hemp, which could impact our revenues in future periods. Approximately 40 states have authorized industrial hemp programs pursuant to the Farm Bill. Additionally, various states have enacted state-specific laws pertaining to the handling, manufacturing, labeling, and sale of CBD and other hemp products. Compliance with state-specific laws and regulations could impact our operations in those specific states. Continued development of the industrial hemp industry will be dependent upon new legislative authorization of industrial hemp at the state level, and further amendment or supplementation of legislation at the federal level. Any number of events or occurrences could slow or halt progress all together in this space. While progress within the industrial hemp industry is currently encouraging, growth is not assured, and while there appears to be ample public support for favorable legislative action, numerous factors may impact or negatively affect the legislative process(es) within the various states where we have business interests.\nUnfavorable interpretations of laws governing hemp processing activities could subject us to enforcement or other legal proceedings and limit our business and prospects.\nThere are no express protections in the United States under applicable federal or state law for possessing or processing hemp biomass derived from lawful hemp not exceeding 0.3% THC on a dry weight basis and intended for use in finished product, but that may temporarily exceed 0.3% THC during the interim processing stages. While it is a common occurrence for hemp biomass to have variance in THC content during interim processing stages after cultivation but prior to use in finished products, there is risk that state or federal regulators or law enforcement could take the position that such hemp biomass is a Schedule I controlled substance in violation of the CSA and similar state laws. In the event that the Companys operations are deemed to violate any laws, the Company could be subject to enforcement actions and penalties, and any resulting liability could cause the Company to modify or cease its operations.\nCosts associated with compliance with various laws and regulations could negatively impact our financial results.\nThe manufacture, labeling and distribution of CBD products is regulated by various federal, state and local agencies. These governmental authorities may commence regulatory or legal proceedings, which could restrict our ability to market CBD-based products in the future. The FDA regulates our products to ensure that the products are not adulterated or misbranded. We may also be subject to regulation by other federal, state and local agencies with respect to our CBD-based products. Our advertising activities are subject to regulation by the FTC under the Federal Trade Commission Act. In recent years, the FTC and state attorneys general have initiated numerous investigations of dietary and nutritional supplement companies and products. Any actions or investigations initiated against the Company by governmental authorities or private litigants could have a material adverse effect on our business, financial condition and results of operations. Any actions or investigations initiated against the Company by governmental authorities or private litigants could have a material adverse effect on our business, financial condition and results of operations.\nThe shifting regulatory environment necessitates building and maintaining of robust systems to achieve and maintain compliance in multiple jurisdictions and increases the possibility that we may violate one or more of the legal requirements applicable to our business and products. If our operations are found to be in violation of any applicable laws or regulations, we may be subject to penalties, including, without limitation, civil and criminal penalties, damages, fines, the curtailment or restructuring of our operations, injunctions, or product withdrawals, recalls or seizures, any of which could adversely affect our ability to operate our business, our financial condition and results of operations.\nUncertainty caused by potential changes to legal regulations could impact the use and acceptance of CBD products.\nThere is substantial uncertainty and differing interpretations and opinions among federal, state and local regulatory agencies, legislators, academics and businesses as to the scope of operation of Farm Bill-compliant hemp programs relative to the emerging regulation of cannabinoids and the Controlled Substances Act. These different opinions include, but are not limited to, the regulation of cannabinoids by the DEA and/or the FDA, and the extent to which manufacturers of products containing Farm Bill-compliant cultivators and processors may engage in interstate commerce. The existing uncertainties in the CBD regulatory landscape in the United States cannot be resolved without further federal, and perhaps state-level, legislation and regulation or a definitive judicial interpretation of existing laws and regulations. If these uncertainties are not resolved in the near future or are resolved in the manner inconsistent with our business plan, such uncertainties may have an adverse effect upon our plan of operations and the introduction of our CBD-based products in different markets.\nIf we fail to obtain necessary permits, licenses and approvals under applicable laws and regulations, our business and plan of operations may be adversely impacted.\nWe may be required to obtain and maintain certain permits, licenses and regulatory approvals in the jurisdictions where we sell or plan to sell our products. There can be no assurance that we will be able to obtain or maintain any necessary licenses, permits or approvals. Any material delay in obtaining, or inability to obtain, such licenses, permits and approvals is likely to delay and/or inhibit our ability to carry out our plan of operations and could have a material adverse effect on our business, financial condition and results of operations.\nPotential future international expansion of our business could expose us to additional regulatory risks and compliance costs.\nAlthough we have no plans to expand internationally for at least two or more years, if the Company intends to expand internationally or engage in the international sale of its products, it will become subject to the laws and regulations of the foreign jurisdictions in which it operates, or in which it imports or exports products or materials, including, but not limited to, customs regulations in the importing and exporting countries. The varying laws and rapidly changing regulations may impact the Companys operations and ability to ensure compliance. In addition, the Company may avail itself of proposed legislative changes in certain jurisdictions to expand its product portfolio, which expansion may include unknown business and regulatory compliance risks. Failure by the Company to comply with the evolving regulatory framework in any jurisdiction could have a material adverse effect on the Companys business, financial condition and results of operations.\nThe market for health and wellness products is highly competitive. If we are unable to compete effectively in the market, our business and operating results could be materially and adversely affected.\nThe market for CBD products is a competitive and rapidly evolving market. There are numerous competitors in the industry, some of whom are more well-established with longer operating histories and greater financial resources than the Company. We expect competition to continue to intensify following the recent passage of the Farm Bill. We believe the Company will be able to compete effectively because of the quality of our products and customer service. However, there can be no assurance that the Company will effectively compete with existing or future competitors. Increased competition may also drive the prices of our products down, which may have a material adverse effect on our results of operations in future periods.\nGiven the rapid changes affecting the global, national and regional economies generally, the Company may experience difficulties in establishing and maintaining a competitive advantage in the marketplace. The Companys success will depend on our ability to keep pace with any changes in such markets, especially legal and regulatory changes. Our success will depend on our ability to respond to, among other things, changes in the economy, market conditions and competitive pressures. Any failure to anticipate or respond adequately to such changes could have a material adverse effect on the Companys business, financial condition and results of operations. Item 1B. Unresolved Staff Comments\nNone. Item 2. Properties\nOur executive and corporate offices are located at 3030 North Rocky Point Drive, Suite 420, Tampa, Florida 33607. We also maintain a warehouse located at 17129 US Highway North, Clearwater, FL 33764, which is owned by the Company, a warehouse located at 1710 Whitney Mesa Drive, Henderson, NV 89014 under a month-to-month agreement, a warehouse at 1051 Mary Crest Rd. Suite G, Henderson NV, 89074 under a three-year lease that will expire on April 30, 2024, a warehouse at 15000 S. Avalon Blvd., Gardena, CA 90248 under a three year lease that will expire on September 30, 2024 that is no longer in use, a warehouse at 601 North Congress Ave, Suite 209 and 210, Delray Beach, FL 33445 under a five year lease that will expire September 30, 2026 and office space at 327 Plaza Real, Suite 2319, Boca Raton, FL 33432 under a three year, two month lease that will expire September 30, 2024, which has been transferred in the sale of Interactive Offers as of September 1, 2023. Item 3. Legal Proceedings\nFrom time to time, the Company may become involved in litigation relating to claims arising out of its operations in the normal course of business. The Company is not involved in any pending legal proceeding or litigation, and, to the best of its knowledge, no governmental authority is contemplating any proceeding to which we are a party or to which any of our properties are subject, which would reasonably be likely to have a material adverse effect on the Company. Item 4. Mine Safety Disclosures\nNot applicable. Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nMarket Information\nThe Companys common stock is listed on the NASDAQ Stock Market LLC and is traded under the symbol UPXI. The following table sets forth the quarterly high and low sales prices per share of the Companys common stock on the consolidated market for each quarter within the last two fiscal years. The Company started trading on June 24, 2021.\nFourth\nQuarter\nThird\nQuarter\nSecond\nQuarter\nFirst\nQuarter\nFiscal 2023:\nHigh\n$ 4.55\n$ 4.94\n$ 5.70\n$ 6.08\nLow\n2.04\n2.53\n2.70\n3.68\nFiscal 2022:\nHigh\n$ 5.99\n$ 5.17\n$ 9.36\n$ 7.40\nLow\n3.90\n3.93\n3.84\n3.86\nWe consider our common stock to be thinly traded and, accordingly, reported sales prices or quotations may not be a true market-based valuation of our common stock.\nHolders of Record\nThere were approximately 4,152 holders of record of the Companys common stock on June 30, 2023.\nDividend Policy\nWe currently intend to retain our future earnings, if any, to finance the development and expansion of our businesses and, therefore, do not intend to pay cash dividends on our Common Stock for the foreseeable future. Any future determination to pay dividends will be at the discretion of our board of directors and will depend on our financial condition, results of operations, capital requirements, restrictions contained in any financing instruments, and such other factors as our board of directors deems relevant in its sole discretion. Accordingly, you may need to sell your shares of our Common Stock to realize a return on your investment; however, you may not be able to sell your shares at or above the price you paid for them.\nSecurities Authorized for Issuance under Equity Compensation Plans\nThe Company has established a Company an incentive plan, 2019 Equity Incentive Plan, as amended (the 2019 Plan). The plan grants incentives to select persons who can make, are making and continue to make substantial contributions to the growth and success of the Company, to attract and retain the employment and services of such persons and to encourage and reward such contributions by providing these individuals with an opportunity to acquire or increase stock ownership in the Company through either the grant of options or restructured stock. The 2019 Plan is administered by the Compensation Committee or such other committee as is appointed by the Board of Directors pursuant to the 2019 Plan (the Committee). The Committee has full authority to administer and interpret the provisions of the 2019 Plan including, but not limited to, the authority to make all determinations with regard to the terms and conditions of an award made under the 2019 Plan. The Shareholders consented, and the Board of Directors approved amendment of the Stock Option Plan to increase the maximum number of Shares that may be issued thereunder to 10,000,000 Shares.\nThe Board of Directors of the Company may from time to time, in its discretion grant to directors, officers, consultants and employees of the Company, non-transferable options to purchase common shares. The options are exercisable for a period of up to 10 years from the date of the grant.\nPlan category\nNumber of securities to be issued upon exercise of outstanding options, warrants and rights\nWeighted-average exercise price of outstanding options, warrants and rights\nNumber of securities\nremaining available for future issuance under equity compensation plans (excluding securities reflected in first column)\nEquity compensation plans approved by security holders\n10,000,000\n$ 3.31\n4,648,624\nTotal\n10,000,000\n$ 3.31\n4,648,624\nRecent Sales of Unregistered Securities; Use of Proceeds from Registered Securities\nIn July of 2021, the Company issued 35,000 shares of common stock for a consulting agreement. The shares were valued at $175,000 or $5.00 per share, based on the price of the services to be rendered. The shares were issued for services from a consultant pursuant to a consulting agreement.\nIn August of 2021, the Company issued 100,000 shares of common stock for the acquisition of VitaMedica and 7,000 shares of common stock as a finders fee for the completion of the transaction. The shares were valued at $515,740 or $4.82 per share, as this was the closing price of the stock on August 4, 2021.\nIn September of 2021, the Company issued 306,945 shares of common stock for the acquisition of Infusionz. The shares were valued at $1,764,876 or $5.75 per share, as this was the remaining acquisition liability for the Infusionz purchase.\nIn October of 2021, the Company issued 666,667 shares of common stock for the acquisition of Interactive, the shares were valued at $4,000,000 of $6.00 per share. Subsequently the Company clawed back 106,497 shares of common stock related to the working capital deficit at the time of the acquisition, the shares were valued at $638,982 or $6.00 per share.\nIn January of 2022, the Company issued 467,765 shares of common stock to employees and a consultant for services, valued at $649,230 or $4.02 per share.\nIn March of 2022, the Company issued 36,582 shares of common stock for the cashless exercise of an option, valued at $163,887 or $4.48 per share.\nIn April of 2022, the Company issued 555,489 shares of common stock for the acquisition of Cygnet Online, LLC valued at $2,550,000 or $4.59 per share.\nIn May of 2022, the Company issued 36,238 shares of common stock for the cashless exercise of an option, valued at $159,447 or $4.40 per share.\nIn May of 2022, the Company issued 119,792 shares of common stock for the cashless exercise of a warrant, valued at $651,668 or $5.44 per share. The warrant was issued for services from a consultant pursuant to a consulting agreement.\nIn October of 2022, the Company issued 1,247,403 shares of common stock for the acquisition of E-Core Technologies Inc. a Florida corporation, valued at $6,000,000 or 4.81 per common share.\nIn February of 2023, the Company issued 134,000 shares of common stock for prepayment of interest on a note payable. The shares were valued at $607,020 or $4.52 per common share and recorded as prepaid interest as the shares were issued at that time.\nIn September of 2023, the Company issued 90,909 shares of common stock for the purchase of the remaining 45% of Cygnet Online, LLC. The shares were valued at $162,727 or $1.79 per common share.\nAll of the securities issued by the Company as described above were issued pursuant to the exemption for transactions by an issuer not involved in any public offering under Section 4(a)(2) of the Securities Act and Rule 506 of Regulation D promulgated thereunder and corresponding state securities laws. Item 6. [Reserved] Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion and analysis of our financial condition, results of operations and cash flows should be read in conjunction with the consolidated financial statements and the related notes thereto included elsewhere in this Annual Report on Form 10-K. The last day of our fiscal year is June 30. Our fiscal quarters end on September 30, December 31, March 31 and June 30. This discussion contains forward-looking statements based upon current expectations that involve risks and uncertainties. Our actual results may differ materially from those anticipated in these forward-looking statements as a result of various factors, including those set forth under Risk Factors or in other parts of this Annual Report on Form 10-K. See also Cautionary Note Regarding Forward-Looking Statements above.\nOverview\nThe Companys consolidated financial statements are prepared in accordance with accounting principles generally accepted in the United States of America (GAAP). The consolidated financial statements include the accounts of all subsidiaries in which the Company holds a controlling financial interest as of the financial statement date.\nFor the year ended June 30, 2022, the consolidated financial statements of Upexi, Inc. include the accounts of the Company and its wholly-owned subsidiaries; Trunano Labs, Inc.; a Nevada corporation, Steam Distribution, LLC, a California limited liability company; MW Products Inc. a Nevada corporation, One Hit Wonder, Inc., a California corporation; One Hit Wonder Holdings, LLC a California corporation; SWCH LLC, a Delaware limited liability company; Cresco Management LLC, a California limited liability company; VitaMedica d/b/a/ Grove Acquisition Subsidiary, Inc. a Nevada corporation as of August 1, 2021; and 55% Cygnet Online, LLC a Delaware limited liability corporation, as of April 1, 2022.\nFor the year ended June 30, 2023, the consolidated financial statements of Upexi, Inc. include all of the subsidiary accounts included in the consolidated financial statements for the year ended June 30, 2022, and include the subsidiaries in which the Company holds a controlling financial interest as of June 30, 2023, which include E-Core Technology, Inc. d/b/a New England Technology, Inc. as of October 21, 2022.\nInfusionz LLC, a Colorado limited liability company, along with select CBD asset; and Interactive Offers, LLC a Delaware limited liability corporation have been classified as discontinued operations for the years ended June 30, 2023 and 2022, respectively and the assets and liabilities have been classified as current assets and liabilities of discontinued operations and assets held for sale on the balance sheets for June 30, 2023 and 2022.\nAll intercompany accounts and transactions have been eliminated as a result of the consolidation.\nKey Factors Affecting Operating Results\nCyclicality and Seasonality\nOur business can be affected by seasonality, which historically has resulted in higher sales volume during our second quarter, which ends December 31.\nOperating Segments\nThe Companys financial reporting is organized into two segments: Branded Products and Recommerce. Other sources of revenue and related costs are aggregated and viewed by management as immaterial or have similar economic characteristics, products, production, distribution processes and regulatory environment as the other product sales.\nResults of Operations\nYear Ended June 30, 2023, as compared to June 30, 2022:\nThe following summary of our results of operations should be read in conjunction with our consolidated financial statements for the years ended June 30, 2023, and 2022, which are included herein.\nJune,\nChange\nRevenue\n$ 80,676,509\n$ 23,065,344\n$ 57,611,165\nCost of revenue\n$ 47,118,189\n$ 8,195,734\n$ 38,922,455\nSales and marketing expenses\n$ 10,376,003\n$ 5,116,868\n$ 5,259,135\nDistribution costs\n$ 12,369,903\n$ 2,214,322\n$ 10,155,581\nGeneral and administrative expenses\n$ 9,546,188\n$ 9,141,667\n$ 404,521\nOther operating expenses\n$ 8,818,233\n$ 4,885,883\n$ 3,932,350\nOther (expense) income\n$ (10,919,488 )\n$ 101,082\n$ (11,020,570 )\nNet (loss) income attributable to non-controlling interest\n$ 559,967\n$ (54,820 )\n$ 614,787\nDiscontinued operations\n$ (2,068,054 )\n$ 3,823,621\n$ (5,891,675 )\nNet loss attributable to Upexi, Inc.\n$ (16,930,289 )\n$ (2,100,850 )\n$ (14,182,442 )\nRevenues increased by $57,611,165 or 250% for the fiscal year ended June 30, 2023, compared with the fiscal year ended June 30, 2022. $41,041,341 or 71% of the increase was related to the acquisitions of the LuckyTail brand and E-Core Technology, Inc. (2023 acquisitions) during 2023 and $18,848,230 or 33% was related to the acquisitions of Cygnet Online, LLC and VitaMedica, Inc. (2022 acquisitions) compared to the prior year period. This was offset by a decline in other businesses of $2,278,475 or 4%. Our primary brands of VitaMedica, LuckyTail and newly acquired Tytan Tiles all had significant growth year over year and management will continue to focus on these high margin and growth potential business in 2024 and beyond. The recommerce businesses, E-Core Technology, Inc. and Cygnet Online, LLC, continue to represent a significant portion of the overall revenue of the Company, although we did see lower than expected sales volume from our Amazon sales channels. Management expects revenue to continue to increase in the 2024 fiscal year with a primary focus on growing our branded products.\nCost of revenue increased by $38,922,455 or 475% compared with the fiscal year ended June 30, 2022. $31,144,149 or 80% of the increase was related to the 2023 acquisitions and $8,640,033 or 22% was related to the 2022 acquisitions. The gross profit increased by $18,688,710. The gross profit margin declined by 22% to 42% compared to 64% in the prior year. The decline in gross profit margin was primarily related to the sales from the recommerce business versus the sales of our branded products. Management expects the gross margin to improve as the branded products segment continues to grow as a percentage of the overall sales and as we continue to gain economies of scale in our purchasing of products.\nSales and marketing expenses increased by $5,259,135 or 103% compared with the same period last year. $2,396,876 or 46% of the increase was related to the 2023 acquisitions and $1,373,733 or 26% was related to the 2022 acquisitions. There was an increase of $1,488,526 or 28% related to the other business. The increase in sales and marketing expenses was primarily related to the acquisitions and increased expenditures for brand and company awareness, however management has aligned the marketing expenditures with the expected growth strategy to decrease the overall percentage of sales and marketing costs to sales. We anticipate our advertising expenses will continue to fluctuate in the following quarters as we fully implement our overall brand marketing strategy.\nDistribution costs increased $10,155,581 or 459% compared with the same period last year. $1,850,306 or 18% of the increase was related to the 2023 acquisitions and $7,306,309 or 72% of the increase was related to the 2022 acquisitions and the rest of the business. There continue to be increases in transportation costs and third-party provider rates. Management has implemented a strategy to change promotions, increase prices and adjust packaging to decrease the overall percentage of distribution costs to sales and is in process of consolidating its distribution centers, including closing the California facility as of July 1, 2023.\nGeneral and administrative expenses increased by $404,521 or 4% compared with the same period last year. General and administrative expenses increased by $2,332,690 from 2023 acquisitions with the remainder of the business had a decrease in general and administrative expenses of $1,928,169. Management has actively been reducing general and administrative costs by consolidation of administrative functions and capitalizing on the overall size of the Company. Management will continue to implement strategies to decrease the percentage of general and administrative costs when compared to total sales.\nOther operating expenses increased by $3,932,350 or 80% compared with the same period last year. These expenses are primarily non-cash and increase based on the intangible assets created with acquisitions and the continued amortization of stock compensation. $1,612,815 or 41% was related to the 2023 acquisitions amortization of acquired intangible assets and $1,616,188 or 41% of the increase was related to the 2022 acquisitions amortization of acquired intangible assets. The remaining increase of $703,347 was related to increases in stock-based compensation and depreciation.\nOther expenses increased by $11,020,570, which was primarily the loss recognized on the sale of Infusionz and select CBD assets, the reserves against amounts owed to the Company by the buyers of that business, the impairment of Interactive Offers intangible assets and an increase of interest expense from both acquisition debt and the termination of a $15,000,000 senior secured debt facility on October 1, 2022. Management estimates based on the current and expected debt balances in fiscal year 2024 that interest expense will be less than $2,800,000 and cash paid for interest expense to be less than $1,400,000.\nThe Company had a net loss of $16,930,289 compared to a net loss of $2,100,850 in the prior year. The decrease in the net losses primarily related to the above-mentioned changes, which was offset by the net loss attributable to non-controlling interest of our consolidated subsidiary.\nOperating Segments\nThe Companys financial reporting is organized into two segments: Our Branded Product segment and our Recommerce segment. Our Branded Product segment is focused on the development, growth and distribution of the branded products that we own. Our Recommerce segment is focused on the purchase and sale of new and used products through channels such as Amazon and wholesale distributors. Other sources of revenue and related costs are aggregated and viewed by management as immaterial or have similar economic characteristics, products, production, distribution processes and regulatory environment as the other product sales.\nSegment Information\nThe Company provides the following segments: (a) branded product segment and (b) product distribution segment.\nFor the year ended June 30, 2023:\nBranded Products\nRecommerce\nTotal\nRevenue\n$ 26,526,385\n$ 54,150,124\n$ 80,676,509\nLoss from operations\n$ (6,945,411 )\n$ (606,596 )\n$ (7,552,007 )\nOther (expense)\n$ (10,378,183 )\n$ (541,305 )\n$ (10,919,488 )\nDepreciation expense\n$ 944,704\n$ -\n$ 944,704\nIncome tax benefit\n$ 3,049,293\n$ -\n$ 3,049,293\nSegment assets:\nAdditions to property, plant, and equipment\n$ 1,078,264\n$ -\n$ 1,078,264\nTotal assets\n$ 28,588,365\n$ 35,264,702\n$ 63,853,067\nLiquidity and Capital Resources\nWorking Capital\nAs of\nJune 30, 2023\nAs of\nJune 30, 2022\nCurrent assets\n$ 25,455,714\n$ 17,061,622\nCurrent liabilities\n$ 19,606,010\n$ 10,127,748\nWorking capital\n$ 5,849,291\n$ 6,933,874\nCash Flows\nYears Ended June 30,\nCash flows provided by operating activities - continuing operations\n$ 517,697\n$ 715,150\nCash flows used in investing activities - continuing operations\n(2,574,858 )\n(10,903,318 )\nCash flows used in financing activities - continuing operations\n(285,333 )\n3,699,744\nCash flows used by operating activities - discontinued operations\n(315,021 )\n(895,981 )\nCash flows provided by (used by) investing activities - discontinued operations\n-\n-\nCash flows provided by (used by) financing activities - discontinued operations\n-\n-\nNet decrease in cash during the period\n$ (2,657,515 )\n$ (7,384,405 )\nOn June 30, 2023, the Company had cash of $4,492,291 or a decrease of $2,657,515 from June 30, 2022. The decrease in cash was primarily used for investing in the acquisition of new entities and the purchase of property and equipment. The Company financed some of the investment through financing activities.\nThe net cash provided by operating activities was $517,697 and offset by cash used in discontinued operations of $315,021. The loss of $16,284,292 was offset by the non-cash expenses of $5,153,695 depreciation and amortization, impairment of goodwill and identifiable intangible assets, $3,664,538 amortization of stock compensation, $2,212,542 of non-cash loses for the sale of Infusionz $969,098 amortization of consideration discount offset by $3,785,224 changes in deferred tax asset. The losses were also offset by an increase in liabilities of $3,312,604 and a decrease of $1,905,234 in current assets.\nNet cash used in investing activities for the years ended June 30, 2023, and 2022 was $2,574,858 and $10,903,318, respectively. For the year ended June 30, 2023, cash of $7,129,826 was used for two new acquisitions and payment related to prior year acquisitions and $937,564 for the acquisition of property and equipment and improvements to the building purchased in 2022. This was partially paid for with the $5,492,532, net cash received for the sale of Infusionz and select CBD assets. For the year ended June 30, 2022, the use of cash was primarily related to the investment of $5,457,545 in three acquisitions, $4,515,735 for the purchase of a building in Clearwater Florida and the related remodel of the acquired building and $936,038 for the acquisition of equipment.\nNet cash flows used in financing activities for the year ended June 30, 2023, was $285,333 compared to $3,699,744 provided in the year ended June 30, 2022. The Company had net proceeds of $6,127,893 from the issuance of stock and $7,120,000 in proceeds from the issuance of notes payable, including $1,470,000 of proceeds from a related party note payable, $3,000,000 of proceeds related to a note payable with a security interest in our building in Clearwater and $2,650,000 of unsecured debt. The newly issued debt was primarily used to repay the senior convertible note payable and the line of credit.\nOn April 15, 2022, the Company entered into a non-negotiable convertible promissory note in the original principal amount of $1,050,000, as adjusted, (Cygnet Note) which can be converted into common stock of the Company at a price of $6.00 per share and is payable in full, to the extent not previously converted, on April 15, 2023. This note was fully repaid in April of 2023.\nIn June 2022, the Company entered into a securities purchase agreement with two accredited investors pursuant to which the Company could receive up to $15,000,000 during the following twelve months of the agreement. The Company received $6,678,506 for Convertible Notes in the original principal amount of $7,500,000 (the Convertible Notes), representing the original purchase amount, less fees, costs and a $500,000 holdback by the investors. In addition to the Convertible Notes, the investors received Common Stock Purchase Warrants (the Warrants) to acquire an aggregate of 56,250 shares of common stock. The Warrants are exercisable for five years at an exercise price of $4.44 per share, provide customary anti-dilution protection, and an investor put right to require the Company to redeem the Warrants for a total of $250,000. There was a loss of $3,540 for the change in the derivative liability for the period ended December 31, 2022. On October 31, 2022, the Company entered into a letter agreement with the accredited investors in which all amounts owed were paid in full and the related convertible notes and all security interests were cancelled. Additionally, the Company terminated the related Form S-3 registration statement.\nOn October 19, 2022, the Company and its indirect wholly owned subsidiary, Upexi 17129 Florida, LLC entered into a loan agreement with Professional Bank, A Florida state-chartered bank, providing for a mortgage on the Companys principal office in N. Clearwater, Florida. The company received $3,000,000 in connection with the transaction. The principal is to be paid back to Professional Bank over a term of ten years. The proceeds of the loan were utilized by the Company to pay down its loan facility with Acorn Capital, LLC in the amount of $2,780,200, net of fees and other expenses. The remainder of the loan facility with Acorn Capital, LLC was fully repaid in October of 2022 when the Company received proceeds from the sale of Infusionz, including $613,466 in accrued interest, $250,000 for settlement of a Put Option and $7,900 in miscellaneous fees for a total of $5,146,437 to the holders of the $15 million senior secured convertible notes entered into on June 28, 2022. The payment terminates the agreement with the noteholders. The Company also terminated the registration statement covering the senior secured notes payable.\nIn June 2022, the Company executed a promissory note with Allan Marshall, the Companys Chief Executive Officer, in the original principal amount of $1,500,000 (Marshall Loan). The promissory note has a 2-year term and bears cash interest at the rate of 8.5% per annum with an additional PIK of 3.5% per annum. The promissory note provides for monthly payments of principal, on an even line 36-month basis, plus cash interest, with a balloon payment of all outstanding principal, cash interest, and PIK interest at maturity. The Company received and deposited the principal amount on July 31, 2022. Interest only has been paid related to this loan and $625,000 of principal payments were due at June 30, 2023 and are classified as current portion of notes payable in addition to the principal payments owed during fiscal year 2024.\nOn February 22, 2023, the Company executed a promissory note with an investor, in the original principal amount of $2,150,000 together with the issuance of 134,000 restricted shares (the PIK shares) of the Companys common stock at a price of $4.53 per share. The promissory note has a 21-month term and bears interest at 18.11% payable with the PIK shares. The promissory note provides for 12 monthly payments of principal beginning on December 22, 2023, and PIK interest of restricted shares on the Effective Date of the promissory note. The Company shall have the right at any time to convert all or any part of the outstanding and unpaid principal into fully paid and non-assessable shares of common stock, or any shares of capital stock or other securities, together with the PIK shares at a price per conversion share equal to $5.00.\nOn February 22, 2023, the Company executed a promissory note with an investor, in the original principal amount of $560,000. The promissory note has a 21-month term and bears cash interest at the rate of 10% per annum. The promissory note provides for monthly payments of interest beginning on March 22, 2023, and 12 monthly payments of principal beginning on December 22, 2023.\nWe estimate that we will have sufficient working capital to fund our operations over the twelve months following the date of the issuance of these condensed consolidated financial statements and meet all our debt obligations.\nOff-Balance Sheet Arrangements\nThe Company has no off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on its financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources that is material to stockholders.\nCritical Accounting Policies\nThe discussion and analysis of our financial condition and results of operations are based on our consolidated financial statements, which have been prepared in accordance with accounting principles generally accepted in the United States of America (GAAP). The preparation of these consolidated financial statements requires us to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues and expenses, and related disclosure of contingent assets and liabilities. On an on-going basis, we evaluate these estimates, including those related to bad debts, intangible assets, and litigation. We base our estimates on historical experience and on various other assumptions that are believed to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of certain assets and liabilities. Actual results may differ from these estimates under different assumptions or conditions.\nWe have identified below the accounting policies, related to what we believe are most critical to our business operations and are discussed throughout Managements Discussion and Analysis of Financial Condition or Plan of Operation where such policies affect our reported and expected financial results.\nUse of Estimates - The preparation of financial statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates.\nSignificant estimates underlying the Companys reported financial position and results of operations include the allowance for doubtful accounts, useful lives of property and equipment, impairment of long-lived assets, inventory valuation, fair value of stock-based compensation and valuation allowance on deferred tax assets.\nBusiness Combinations - The Company accounts for its business combinations using the acquisition method of accounting. The cost of an acquisition is measured as the aggregate of the acquisition date fair values of the assets transferred and liabilities assumed by the Company to the sellers cash consideration and equity instruments issued. Transaction costs directly attributable to the acquisition are expensed as incurred. The excess of (i) the total costs of acquisition over (ii) the fair value of the identifiable net assets of the acquiree is recorded as identifiable intangible assets and goodwill.\nGoodwill - The Company evaluates its goodwill for possible impairment, simplifying the test for goodwill Impairment at least annually and when one or more triggering events or circumstances indicate that the goodwill might be impaired. Under this guidance, annual or interim goodwill impairment testing is performed by comparing the estimated fair value of a reporting unit with its carrying amount. An impairment charge is recognized for the amount by which the carrying amount exceeds the reporting units fair value, not to exceed the carrying value of goodwill.\nThe Company performed its annual test as of June 30, 2023. No impairment charge was identified in connection with the annual goodwill impairment test\nRevenue Recognition - The Company analyzes its contracts and purchase orders to assess that revenue is properly recognized. In determining the appropriate amount of revenue to be recognized as the Company fulfills its obligations under each of its agreements, whether for goods and services or licensing, the Company performs the following steps: (i) identification of the promised goods or services in the contract; (ii) determination of whether the promised goods or services are performance obligations including whether they are distinct in the context of the contract; (iii) measurement of the transaction price, including the constraint on variable consideration; (iv) allocation of the transaction price to the performance obligations based on estimated selling prices; and (v) recognition of revenue when (or as) the Company satisfies each performance obligation. The Company acts as a principal in its revenue transactions as the Company is the primary obligor in the transactions. Generally, the Company recognizes revenue for its products when ownership is transferred to the customer, provided no significant obligations remain and collection is probable.\nProduct Revenue - Most of the Companys revenue contracts are from domestic sales and represent a single performance obligation related to the fulfillment of customer orders for the purchase of its products. Net sales reflect the transaction prices for these contracts based on the Companys selling list price, which is then reduced by estimated costs for trade promotional programs, consumer incentives, and allowances and discounts used to incentivize sales growth and build brand awareness.\nThe Company recognizes revenue at the point in time that control of the ordered product is transferred to the customer, which is upon shipment to the customer or other customer-designated delivery point. Taxes collected from customers that are remitted to governmental agencies are accounted for on a net basis and not included as revenue.\nThe Company does not accept sales returns from wholesale customers, as the products are pre-approved prior to production and shipment. E-Commerce product returns must be completed within 45 days of the date of purchase. The Company does not accrue for estimated sales returns as historical sales returns have been minimal. The Company records deferred revenues when cash payments are received or due in advance of performance, including amounts which are refundable. Substantially all the deferred revenue as of June 30, 2022 was recognized as revenue in the year ended June 30, 2023.\nShipping and handling fees billed to customers are included in revenue. Shipping and handling fees associated with freight are generally included in cost of revenue.\nImpairment of Long-lived Assets - Long-lived assets are reviewed for impairment whenever events or changes in circumstances indicate that the book value of the asset may not be recoverable. The Company periodically evaluates whether events and circumstances have occurred that indicate possible impairment. When impairment indicators exist, the Company estimates the future undiscounted net cash flows of the related asset or asset group over the remaining life in measuring whether or not the asset values are recoverable. The Company did not recognize impairment on its long-lived assets during the years ended June 30, 2023, or 2022.\nStock Based Compensation - The Company recognizes all share-based payments to employees, including grants of employee stock options, as compensation expense in the financial statements based on their fair values. That expense will be recognized over the period during which an employee is required to provide services in exchange for the award, known as the requisite service period (usually the vesting period) or immediately if the share-based payments vest immediately.\nInventory - The Company reviews the inventory level of all products and raw materials quarterly. For most products that have been in the market for one year or greater, we consider inventory levels of greater than one years sales to be excess or other items that show slower than projected sales. Due to limited market penetration for our products, we have decided to write down 50% of the cost against certain raw materials and finished products. Products that are no longer part of the current product offering are considered obsolete. The potential for re-sale of slow-moving and obsolete inventories is based upon our assumptions about future demand and market conditions. The recorded cost of obsolete inventories is then reduced to zero and the slow-moving and obsolete inventory is written off and are recorded as charges to cost of goods sold. All adjustments for obsolete inventory establish a new cost basis for that inventory as we believe such reductions are permanent declines in the market price of our products. Generally, obsolete inventory is sold to companies that specialize in the liquidation, while we continue to market slow-moving inventories until they are sold or become obsolete. As obsolete or slow-moving inventory is sold or disposed of, we write it off.\nNon-GAAP Measures (unaudited)\nReconciliation of Non-GAAP Adjusted EBITDA to GAAP Net Income (Net Loss)\nYear Ended June 30,\nNet income (Net loss) GAAP\n$ (16,930,289 )\n$ (2,100,850 )\nIncome tax\n(3,049,293 )\n(518,398 )\nInterest expense, net\n4,761,903\n202,120\nDepreciation and amortization\n5,153,695\n1,554,297\nStock compensation\n3,664,538\n3,331,586\nLoss on the sale of Infusionz and select assets\n2,212,542\n-\nChange in derivative liability\n(1,770 )\n3,293\nLoss (gain) on discontinued operations\n2,068,054\n(3,823,621 )\nGain on SBA PPP loan forgiveness\n-\n(300,995 )\n(Loss) income attributable to non-controlling interest\n(559,967 )\n54,820\nLease impairment, California facility\n200,512\n-\nGain on sale of asset\n-\n(5,500 )\nImpairment of Intangible assets\n3,746,301\n-\nNon-GAAP adjusted EBITDA\n$ 1,266,226\n$ (1,603,248 )\nUse of Non-GAAP Financial Measures\nThe Company discloses and uses the above-mentioned non-GAAP financial measures internally as a supplement to GAAP financial information to evaluate its operating performance, for financial planning purposes, to establish operational goals, for compensation plans, to measure debt service capability, for capital expenditure planning and to determine working capital needs and believes that these are useful financial measures also used by investors. Non-GAAP adjusted EBITDA is defined as GAAP net income or net loss before interest, taxes, depreciation and amortization (EBITDA) adjusted for the non-cash stock compensation and stock option expense, acquisition, integration & restructuring expenses, charges and gains or losses from extinguishment of debt and other non-cash items. Non-GAAP EBITDA and non-GAAP adjusted EBITDA are not terms defined by GAAP and, as a result, the Companys measure of non-GAAP EBITDA and non-GAAP adjusted EBITDA might not be comparable to similarly titled measures used by other companies. Generally, a non-GAAP financial measure is a numerical measure of a companys performance, financial position, or cash flow that either excludes or includes amounts that are not normally included in the most directly comparable measure calculated and presented in accordance with GAAP. The non-GAAP financial measures discussed above, however, should be considered in addition to, and not as a substitute for, or superior to net income or net loss as reported for GAAP on the Consolidated Statements of Operations, cash and cash flows on the Consolidated Statement of Cash Flows or other measures of financial performance prepared in accordance with GAAP, and as reflected on the Companys financial statements prepared in accordance with GAAP. These non-GAAP financial measures are not a substitute for or presented in lieu of financial measures provided by GAAP and all measures and disclosures of financial information pursuant to GAAP should be read to obtain a comprehensive and thorough understanding of the Companys financial results. The reconciliations of non-GAAP EBITDA and non-GAAP adjusted EBITDA to GAAP operating income (loss) and/or GAAP net income (net loss) referred to in the highlights or elsewhere are provided in the schedules that are a part of this document. Item 7A. Quantitative and Qualitative Disclosures About Market Risk.\nAs a smaller reporting company, the Company is not required to provide the information required by this Item. Item 8. Financial Statements and Supplementary Data.\nUPEXI INC.\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\nYEARS ENDED JUNE 30, 2023, AND 2022\nPage\nReport of Independent Registered Public Accounting Firm\nConsolidated Financial Statements\nConsolidated Balance Sheets\nConsolidated Statements of Operations\nConsolidated Statements of Stockholders (Deficit) Equity\nConsolidated Statements of Cash Flows\nNotes to Consolidated Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the shareholders and the board of directors of Upexi, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Upexi, Inc. (the Company) as of June 30, 2023 and 2022, and the related consolidated statements of operations, stockholders equity, and cash flows for each of the two years in the period ended June 30, 2023, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements referred to above present fairly, in all material respects, the financial position of Upexi, Inc. as of June 30, 2023 and 2022, and the results of its operations and its cash flows for each of the two years in the period ended June 30, 2023, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audit we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of financial statements. We believe that our audits provide a reasonable basis for our opinion.\n/s/ B F Borgers CPA PC\nWe have served as the Companys auditor since 2020.\nLakewood, Colorado\nOctober 2, 2023\nPCAOB ID Number 5041\nUPEXI, INC.\nCONSOLDIATED BALANCE SHEETS\nJune 30,\nJune 30,\nASSETS\nCurrent assets\nCash\n$ 4,492,291\n$ 7,149,806\nAccounts receivable\n7,163,564\n939,875\nInventory\n11,557,128\n4,725,685\nDue from Bloomios\n845,443\n-\nDeferred tax asset, current\n-\n462,070\nPrepaid expenses and other receivables\n1,307,299\n760,900\nCurrent assets of discontinued operations\n89,989\n3,023,286\nTotal current assets\n25,455,714\n17,061,622\nProperty and equipment, net\n7,526,463\n7,338,866\nIntangible assets, net\n13,571,960\n8,755,012\nGoodwill\n10,251,281\n4,644,609\nDeferred tax asset\n5,604,056\n2,002,759\nOther assets\n96,728\n75,613\nAssets held for sale\n936,054\n7,767,698\nRight-of-use asset\n410,811\n844,856\nTotal other assets\n38,397,353\n31,429,413\nTotal assets\n$ 63,853,067\n$ 48,491,035\nLIABILITIES AND STOCKHOLDERS' EQUITY\nCurrent liabilities\nAccounts payable\n$ 3,969,746\n$ 1,572,275\nAccrued compensation\n533,842\n489,712\nAccrued liabilities\n3,365,562\n816,632\nCurrent portion of notes payable\n2,731,377\n749,752\nCurrent portion of convertible notes payable\n1,254,167\n3,125,000\nCurrent portion of acquisition note payable\n5,656,620\n1,550,000\nLine of Credit\n882,845\n-\nCurrent portion of operating lease payable\n419,443\n183,881\nCurrent liabilities of discontinued operations\n792,408\n1,640,496\nTotal current liabilities\n19,606,010\n10,127,748\nOperating lease payable, net of current portion\n163,359\n700,411\nConvertible notes payable\n895,833\n3,180,406\nAcquisition notes payable, net of current\n7,605,085\n-\nNotes payable, net of current portion\n7,746,157\n5,695,726\nTotal long-term liabilities\n16,410,434\n9,576,543\nCommitments and contingencies\nStockholders' equity\nPreferred stock, $0.001 par value, 100,000,000 shares authorized, and 500,000 and 500,000 shares issued and outstanding, respectively\nCommon stock, $0.001 par value, 100,000,000 shares authorized, and 20,215,961 and 16,713,345 shares issued and outstanding, respectively\n20,216\n16,713\nAdditional paid in capital\n51,522,229\n34,985,597\nAccumulated deficit\n(23,201,175 )\n(6,270,886 )\nTotal stockholders' equity attributable to Upexi, Inc.\n28,341,770\n28,731,924\nNon-controlling interest in subsidiary\n(505,147 )\n54,820\nTotal stockholders'' equity\n27,836,623\n28,786,744\nTotal liabilities and stockholders' equity\n$ 63,853,067\n$ 48,491,035\nThe accompanying notes are an integral part of these consolidated financial statements.\nUPEXI, INC.\nCONSOLIDATED STATEMENTS OF OPERATIONS\nYear Ended June 30,\nRevenue\nRevenue\n$ 80,676,509\n$ 23,065,344\nCost of Revenue\n47,118,189\n8,195,735\nGross profit\n33,558,320\n14,869,609\nOperating expenses\nSales and marketing\n10,376,003\n5,116,868\nDistribution costs\n12,369,903\n2,214,322\nGeneral and administrative expenses\n9,546,188\n9,141,667\nShare-based compensation\n3,664,538\n3,331,586\nAmortization of acquired intangible assets\n4,208,991\n979,988\nDepreciation\n944,704\n574,309\n41,110,327\n21,358,740\nLoss from operations\n(7,552,007 )\n(6,489,131 )\nOther income (expense), net\nInterest (expense) income, net\n(4,761,903 )\n(202,120 )\nChange in derivative liability\n1,770\n(3,293 )\nLoss on sale of Infusionz and select assets\n(2,212,542 )\n-\nImpairment of Interactive Offers intangible assets\n(3,746,301 )\n-\nGain on sale of property and equipment\n-\n5,500\nLease impairment, California facility\n(200,512 )\n-\nGain on SBA PPP loan extinguishment\n-\n300,995\nOther (expense) income, net\n(10,919,488 )\n101,082\nNet loss before income tax\n(18,471,495 )\n(6,388,049 )\nIncome tax benefit\n3,049,293\n518,398\nNet loss from continuing operations\n(15,422,202 )\n(5,869,651 )\n(Loss) income from discontinued operations - Interactive Offers\n(1,729,636 )\n(1,160,160 )\n(Loss) income from discontinued operations - Infusionz\n(338,418 )\n4,983,781\nNet loss (income) attributable to non-controlling interest\n559,967\n(54,820 )\nNet (loss) income attributable to Upexi, Inc.\n$ (16,930,289 )\n$ (2,100,850 )\nBasic income (loss) per share:\nLoss per share from continuing operations\n$ (0.86 )\n$ (0.36 )\nIncome per share from discontinued operations\n$ (0.10 )\n$ (0.07 )\nTotal income (loss) per share\n$ (0.96 )\n$ (0.43 )\nDiluted income (loss) per share:\nLoss per share from continuing operations\n$ (0.86 )\n$ (0.36 )\nIncome per share from discontinued operations\n$ (0.10 )\n$ (0.07 )\nTotal income (loss) per share\n$ (0.96 )\n$ (0.43 )\nBasic weighted average shares outstanding\n17,877,959\n16,224,520\nFully diluted weighted average shares outstanding\n17,877,959\n16,224,520\nThe accompanying notes are an integral part of these consolidated financial statements.\nUPEXI, INC.\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS EQUITY\nPreferred Stock\nPreferred Stock\nCommon Stock\nCommon Stock\nAdditional Paid\nAccumulated\nNon-controlling\nTotal Stockholders'\nShares\nPar\nShares\nPar\nIn Capital\nDeficit\nInterest\nEquity\nBalance, June 30, 2021\n500,000\n$ 500\n15,262,394\n$ 15,262\n$ 25,372,247\n$ (4,170,036 )\n$ -\n$ 21,217,973\nIssuance of common stock for acquisition\n-\n-\n1,522,604\n1,523\n7,945,292\n-\n-\n7,946,815\nRepurchase common stock\n-\n-\n(467,765 )\n(468 )\n(1,975,420 )\n-\n-\n(1,975,888 )\nStock based compensation\n-\n-\n-\n-\n2,755,016\n-\n-\n2,755,016\nIssuance of common stock for services\n-\n-\n203,500\n717,271\n-\n-\n717,474\nIssuance of common stock for exercise of warrants\n-\n-\n119,792\n(120 )\n-\n-\n-\nIssuance of common stock for exercise of options\n-\n-\n72,820\n(73 )\n-\n-\n-\nWarrant issued related to debt\n-\n-\n-\n-\n171,384\n-\n-\n171,384\nNet loss\n-\n-\n-\n-\n-\n(2,100,850 )\n54,820\n(2,046,030 )\nBalance, June 30, 2022\n500,000\n$ 500\n16,713,345\n$ 16,713\n$ 34,985,597\n$ (6,270,886 )\n$ 54,820\n$ 28,786,744\nBalance, June 30, 2022\n500,000\n$ 500\n16,713,345\n$ 16,713\n$ 34,985,597\n$ (6,270,886 )\n$ 54,820\n$ 28,786,744\nAmortization of common stock issuance for services\n-\n-\n-\n-\n140,700\n-\n-\n140,700\nStock based compensation\n-\n-\n-\n-\n3,664,538\n-\n-\n3,664,538\nIssuance of common stock for acquisition of E-Core\n-\n-\n1,247,403\n1,247\n5,998,753\n-\n-\n6,000,000\nIssuance of common stock for interest on note payable\n-\n-\n134,000\n606,870\n-\n-\n607,004\nCommon stock issued for cash, net\n2,121,213\n2,122\n6,125,771\n6,127,893\nNet loss\n-\n-\n-\n-\n-\n(16,930,289 )\n(559,967 )\n(17,490,256 )\nBalance, June 30, 2023\n500,000\n$ 500\n20,215,961\n$ 20,216\n$ 51,522,229\n$ (23,201,175 )\n$ (505,147 )\n$ 27,836,623\nThe accompanying notes are an integral part of these consolidated financial statements.\nUPEXI, INC.\nCONSOLIDATED STATEMENTS OF CASH FLOW\nYear Ended June 30,\nCash flows from operating activities\nNet (loss) income from operations\n$\n(16,930,289 )\n$\n(2,100,850 )\nAdjustments to reconcile net income from continuing operations to net cash provided by operating activities:\nDepreciation and amortization\n5,153,695\n2,733,455\nNon-cash loss on the sale of Infusionz and select assets, net\n2,212,542\n-\nGain on forgiveness of PPP loan\n-\n(300,995 )\nGain on sale of assets\n-\n(5,500 )\nInventory write-offs\n118,990\n1,044,607\nBad debt expense\n-\n131,968\nAmortization of consideration discount\n969,098\n-\nAmortization of senior security original issue discount\n62,408\n-\nImpairment of goodwill and intangible assets\n3,746,301\n-\nNon-controlling interest\n(559,967 )\n54,820\nChange in deferred tax asset\n(3,139,227 )\n(1,061,238 )\nShares issued for services\n-\n576,774\nShares issued for finder fee\n1,770\n-\nStock based compensation\n3,664,538\n2,755,016\nChanges in assets and liabilities, net of acquired amounts\nAccounts receivable\n476,256\n284,998\nInventory\n1,260,479\n(2,795,486 )\nPrepaid expenses and other assets\n168,499\n284,653\nOperating lease payable\n132,555\n37,922\nAccounts payable and accrued liabilities\n3,180,049\n(446,609 )\nDeferred revenue\n-\n(478,385 )\nNet cash provided by operating activities - Continuing Operations\n517,697\n715,150\nNet cash used in operating activities - Discontinued Operations\n(315,021 )\n(895,981 )\nNet cash provided by operating activities\n202,676\n(180,831 )\nCash flows from investing activities\nAcquisition of Lucky Tail\n(3,528,239 )\n-\nAcquisition of VitaMedica, Inc., net of cash acquired\n(500,000 )\n(2,574,589 )\nAcquisition of New England Technology, Inc.\n(2,051,587 )\n-\nAcquisition of Cygnet\n(1,050,000 )\n(1,028,763 )\nAcquisition of Interactive Offers, net of cash acquired\n-\n(1,854,193 )\nProceeds from the sale of Infusionz and selected assets\n5,492,532\nAcquisition of property and equipment\n(937,564 )\n(5,451,773 )\nProceeds from the sale of equipment\n6,000\nNet cash used in investing activities - Continuing Operations\n(2,574,858 )\n(10,903,318 )\nNet cash (used in) provided by investing activities - Discontinued Operations\n-\n-\nNet cash used in investing activities\n(2,574,858 )\n(10,903,318 )\nCash flows from financing activities\nRepayment of notes payable\n(445,670 )\n(1,002,874 )\nRepayment of SBA note payable\n(305,482 )\n-\nRepayment of the senior convertible notes payable\n(6,305,406 )\n-\nProceeds of the senior convertible notes payable\n-\n6,678,506\nPayment on line of credit, net\n(6,318,234 )\n-\nProceeds on note payable on building\n3,000,000\n-\nProceeds from the issuance of stock, net\n6,127,893\nStock repurchase program\n-\n(1,975,888 )\nRepayment on note payable on building\n(158,434 )\n-\nProceeds from issuance of convertible debt\n2,650,000\nProceeds on note payable, related party\n1,470,000\n-\nNet cash used in financing activities - Continuing Operations\n(285,333 )\n3,699,744\nNet cash (used in) provided by financing activities - Discontinued Operations\n-\n-\nNet cash used in financing activities\n(285,333 )\n3,699,744\nNet decrease in cash - Continuing Operations\n(2,342,494 )\n(6,488,424 )\nNet decrease in cash - Discontinued Operations\n(315,021 )\n(895,981 )\nCash, beginning of year\n7,149,806\n14,534,211\nCash, end of year\n$ 4,492,291\n$ 7,149,806\nSupplemental cash flow disclosures\nInterest paid\n$ 2,278,292\n$ 64,460\nIncome tax paid\n$ -\n$ 656,000\nNon-cash financing activities\nIssuance of common stock for acquisition of Infusionz\n$ -\n$ 1,764,876\nIssuance of common stock for acquisition of VitaMedica\n$ -\n$ 482,000\nIssuance of debt for acquisition of VitaMedica\n$ -\n$ 1,000,000\nLiabilities assumed from acquisition of VitaMedica\n$\n-\n$\n(309,574\n)\nIssuance of common stock for interest expenses\n$ 607,004\n$ -\nIssuance of commons stock for services\n$ 140,700\n$ 140,700\nIssuance of common stock for acquisition of E-Core\n$ 6,000,000\n$ -\nLiabilities assumed from acquisition of E-Core\n$ (7,712,168 )\n$ -\nOperating assets designated as held for sale\n$ 1,026,043\n$ 10,790,984\nLiabilities assumed from acquisition of VitaMedica\n$ -\n$ (309,574 )\nIssuance of stock for acquisition of Interactive\n$ -\n$ 2,733,628\nLiabilities assumed from acquisition of Cygnet\n$ -\n$ 9,472,438\nThe accompanying notes are an integral part of these consolidated financial statements.\nUpexi, Inc.\nNotes to the Consolidated Financial Statements\nJune 30, 2023 and 2022\nUpexi is a multi-faceted brand owner with established brands in the health, wellness, pet, beauty and other growing markets. We operate in emerging industries with high growth trends and look to drive organic growth of our current brands. We focus on direct to consumer and Amazon brands that are scalable and have anticipated, high industry growth trends. Our goal is to continue to accumulate consumer data and build out a significant customer database across all industries we sell into. The growth of our current customer database has been key to the year-over-year gains in sales and profits. To drive additional growth, we have and will continue to acquire profitable Amazon and eCommerce businesses that can scale quickly and reduce costs through corporate synergies. We utilize our in-house, SaaS programmatic ad technology to help achieve a lower cost per acquisition and accumulate consumer data for increased cross-selling between our growing portfolio of brands.\nThe Company primarily conducts its business operations through the following subsidiaries: Upexi, Inc. (the Company) is a Nevada corporation with fourteen active subsidiaries, including thirteen wholly owned subsidiaries and one subsidiary, Cygnet Online, LLC, a Delaware limited liability company, that is 55% owned. The Companys fourteen active subsidiaries are as follows:\n☐\nHAVZ, LLC, d/b/a/ Steam Wholesale, a California limited liability company\no\nSWCH, LLC, a Delaware limited liability company\no\nCresco Management, LLC, a California limited liability company\n☐\nTrunano Labs, Inc., a Nevada corporation\n☐\nMW Products, Inc., a Nevada corporation\n☐\nUpexi Holding, LLC, a Delaware limited liability company\no\nUpexi Pet Products, LLC, a Delaware limited liability company\n☐\nVitaMedica, Inc, a Nevada corporation\n☐\nUpexi Enterprise, LLC, a Delaware limited liability company\no\nUpexi Property & Assets, LLC, a Delaware limited liability company\n■\nUpexi 17129 Florida, LLC, a Delaware limited liability company\no\nE-Core Technology, Inc.\no\nUpexi Distribution Management LLC, a Delaware limited liability company\n☐\nInteractive Offers, LLC (Interactive), a Delaware limited liability company\n☐\nCygnet Online, LLC (Cygnet), a Delaware limited liability company, 55% owned.\nIn addition, the Company has four wholly owned subsidiaries that had no activity during the year ended June 30, 2023 or for the year ended June 30, 2022.\n·\nSteam Distribution, LLC, a California limited liability company\n·\nOne Hit Wonder, Inc., a California corporation\n·\nOne Hit Wonder Holdings, LLC, a California limited liability company\n·\nVape Estate, Inc., a Nevada Corporation\nOur products are distributed in the United States of America and internationally through multiple entities and managed through our locations in Florida, California, and Nevada.\nUpexi operates from our corporate location in Tampa, Florida where direct to consumer and Amazon sales are driven by on-site and remote teams for all brands. The Tampa location also supports all the other locations with accounting, corporate oversight, day-to-day finances, business development and operational management operating from this location.\nVitaMedica operates mainly from our California location with product development and day to day management with the primary fulfillment center located in Tampa Florida.\nInteractive Offers is operated from its Florida office with day-to-day operations supported by various off site remote positions, and majority of the development team operating through out of Portugal.\nCygnet Online operates from our South Florida location with a full on-site GMP warehouse and distribution center, day-to-day operations of our Amazon liquidation business team from this location with support of remote team members.\nLucky Tail operates from our Clearwater, Florida location with sales and marketing driven by on-site and remote teams that operate the Amazon sales strategy and daily business operations.\nHAVZ, LLC, d/b/a/ Steam Wholesale operates manufacturing and/or distribution centers in Henderson, Nevada supporting our health and wellness products, including those products manufactured with hemp ingredients and our overall distribution operations. We have continued to manage these operations with corporate focus on larger opportunities that have warranted the majority of corporate focus and investments for the future.\nBusiness Acquisitions\nOn August 1, 2021, the Company completed an asset purchase agreement with Grove Acquisition Subsidiary, Inc., a Nevada corporation and wholly owned subsidiary of the Company, and the members of VitaMedica Corporation, a California corporation, to purchase all the assets and assume certain liabilities of VitaMedica. VitaMedica is a leading online seller of supplements for surgery, recovery, skin, beauty, health, and wellness.\nOn October 1, 2021, the Company entered into an equity interest purchase agreement with Gyprock Holdings LLC, a Delaware limited liability company, MFA Holdings Corp., a Florida corporation, and Sherwood Ventures, LLC, a Texas limited liability company, to acquire all the outstanding membership interest of Interactive Offers, LLC, a Delaware limited liability company.\nOn April 1, 2022, the Company entered into a securities purchase agreement with the single investor to purchase 55% of the equity interest in Cygnet Online, LLC, a Delaware limited liability company, and agreements to enable the Company to purchase the remaining 45% over the following two years. On September 1, 2023 the Company purchased the remaining 45% of Cygnet Online, LLC for $500,000 cash, 90,909 shares of the Companys common stock and a $300,000 cash payment due on September 1, 2024.\nOn August 12, 2022, the Company completed an asset purchase agreement with GA Solutions, LLC, a Delaware limited liability company (LuckyTail), pursuant to which the Company acquired substantially all assets of LuckyTail. LuckyTail sells pet nail grinders and other pet products through various sales channels including some international sales channels.\nOn October 31, 2022, the Company and its wholly owned subsidiary Upexi Enterprise, LLC, completed a securities purchase agreement to purchase the outstanding stock of E-Core Technology, Inc. d/b/a New England Technology, Inc. (E-Core), a Florida corporation. E-Core distributes non-owned branded products to national retail distributors and has branded products in the toy industry that E-Core sells direct to consumers through online sales channels and to national retail distributors.\nBusiness Divested\nOn October 26, 2022, the Company executed a membership interest purchase agreement to sell 100% of the membership interests of Infusionz LLC, a Colorado limited liability company (Infusionz), included in the sale was all rights to Infusionz brands and the manufacturing of certain private label business. Infusionz was originally purchased by the Company in July of 2020. The divestiture of Infusionz and related private label manufacturing represents a strategic shift in our operations and will allow us to become a predominantly product distribution focused company for both our Company owned brands and non-owned brands. Accordingly, the results of the business were classified as discontinued operations in our condensed statements of operations and excluded from both continuing operations and segment results for all periods presented.\nOn August 31, 2023, Upexi, Inc. (the Company) entered into an Equity Interest Purchase Agreement (EIPA) pursuant to which the Company sold one hundred percent (100%) of the issued and outstanding equity (the Interests) of its wholly owned subsidiary Interactive Offers, LLC (Interactive) to Amplifyir Inc. (the Buyer). The purchase price for the Interests was One Million Two Hundred Fifty Thousand Dollars ($1,250,000), subject to certain customary post-closing adjustments. In addition, the Buyer is obligated to pay the Company two-and one- half percent (2.5%) of certain advertising revenues of Interactive for a two-year period post-closing. Accordingly, the results of the business were classified as discontinued operations in our statements of operations and excluded from both continuing operations and segment results for all periods presented.\nNote 2. Significant Accounting Policies\nThe significant accounting policies followed are:\nUse of Estimates - The preparation of financial statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates.\nSignificant estimates underlying the Companys reported financial position and results of operations include the allowance for doubtful accounts, useful lives of property and equipment, impairment of long-lived assets, inventory valuation, fair value of stock-based compensation and valuation allowance on deferred tax assets.\nCash and Cash Equivalents - The Company considers all highly liquid investment instruments with a maturity of three months or less to be cash equivalents. Cash and cash equivalents are maintained at financial institutions and at times, balances may exceed federally insured limits. The Company has never experienced any losses related to these balances.\nAccounts Receivable - The Company regularly reviews accounts receivable for any bad debts based on an analysis of the Companys collection experience, customer creditworthiness and current economic trends. After all attempts to collect a receivable have failed, the receivable is written off against the allowance. Based on managements review of accounts receivable, the Company recorded $65,500 and $57,000 as allowance for doubtful accounts at June 30, 2023 and 2022, respectively. The Company had no bad debt expenses and $131,968 for the years ended June 30, 2023 and 2022, respectively. These amounts were direct write-offs against the specific accounts receivable.\nInventory - Inventory consists of finished goods and is stated at the lower of cost or net realizable value, cost is determined by the weighted average moving cost inventory method. Net realizable value is determined, with appropriate consideration given to obsolescence, excessive levels, deterioration, and other factors. On June 30, 2023 the Company had $11,557,128 of finished goods inventory and at June 30, 2022 had $4,725,685 of finished goods inventory with an inventory reserve of $475,000 and $50,000, respectively.\nProperty and Equipment - Property and equipment is recorded at cost. Depreciation is calculated using the straight-line method over the estimated useful lives of the assets ranging from 3 to 20 years. Leasehold improvements are amortized over the shorter of their estimated useful lives of 5 years or the related lease term. Gains and losses upon disposition are reflected in the Statements of Operations in the period of disposition. Maintenance and repair expenditures are charged to expense as incurred. The Company disposed of some equipment during 2023 and 2022 which resulted in gains on the sales as shown in the accompanying Statements of Operations.\nBusiness Combinations - The Company accounts for its business combinations using the acquisition method of accounting. The cost of an acquisition is measured as the aggregate of the acquisition date fair values of the assets transferred and liabilities assumed by the Company to the sellers cash consideration and equity instruments issued. Transaction costs directly attributable to the acquisition are expensed as incurred. The excess of (i) the total costs of acquisition over (ii) the fair value of the identifiable net assets of the acquiree is recorded as identifiable intangible assets and goodwill.\nGoodwill - The Company evaluates its goodwill for possible impairment, simplifying the test for goodwill impairment at least annually and when one or more triggering events or circumstances indicate that the goodwill might be impaired. Under this guidance, annual or interim goodwill impairment testing is performed by comparing the estimated fair value of a reporting unit with its carrying amount. An impairment charge is recognized for the amount by which the carrying amount exceeds the reporting units fair value, not to exceed the carrying value of goodwill.\nThe Company performed its annual test as of June 30, 2023, and 2022, respectively. There was no impairment charge identified in connection with the annual goodwill impairment test at June 30, 2022. It was determined by management that the goodwill related to Interactive Offers was completely impaired at June 30, 2023 based on the sale of the business at September 1, 2023. An impairment of goodwill in the amount of $2,889,158 was recorded at June 30, 2023 eliminating all of the goodwill related to Interactive Offers.\nImpairment of Long-lived Assets - Long-lived assets are reviewed for impairment whenever events or changes in circumstances indicate that the book value of the asset may not be recoverable. The Company periodically evaluates whether events and circumstances have occurred that indicate possible impairment. When impairment indicators exist, the Company estimates the future undiscounted net cash flows of the related asset or asset group over the remaining life in measuring whether or not the asset values are recoverable.\nThe Company did not recognize impairment on its long-lived assets during the year ended June 30, 2022. The Company did recognize an impairment of $857,143 on the assets held for sale, related to the Interactive Offers long-lived assets during the years ended June 30, 2023, leaving $716,944 of intangible assets related to Interactive Offers and classified as assets available for sale.\nRevenue Recognition - The Company analyzes its contracts and purchase orders to assess whether revenue is properly recognized. In determining the appropriate amount of revenue to be recognized as the Company fulfills its obligations under each of its agreements, whether for goods and services or licensing, the Company performs the following steps: (i) identification of the promised goods or services in the contract; (ii) determination of whether the promised goods or services are performance obligations including whether they are distinct in the context of the contract; (iii) measurement of the transaction price, including the constraint on variable consideration; (iv) allocation of the transaction price to the performance obligations based on estimated selling prices; and (v) recognition of revenue when (or as) the Company satisfies each performance obligation. The Company acts as principal in its revenue transactions as the Company is the primary obligor in the transactions. Generally, the Company recognizes revenue for its products when ownership is transferred to the customer, provided no significant obligations remain and collection is probable.\nProduct Revenue - Most of the Companys revenue contracts are from domestic sales and represent a single performance obligation related to the fulfillment of customer orders for the purchase of its products. Net sales reflect the transaction prices for these contracts based on the Companys selling list price, which is then reduced by estimated costs for trade promotional programs, consumer incentives, and allowances and discounts used to incentivize sales growth and build brand awareness.\nThe Company recognizes revenue at the point in time that control of the ordered product is transferred to the customer, which is upon shipment to the customer or other customer-designated delivery point. Taxes collected from customers that are remitted to governmental agencies are accounted for on a net basis and not included as revenue.\nThe Company does not accept sales returns from wholesale customers, as the products are pre-approved prior to production and shipment. E-Commerce product returns must be completed within 45 days of the date of purchase. The Company does not accrue estimated sales returns as historical sales returns have been minimal. The Company records deferred revenues when cash payments are received or due in advance of performance, including amounts which are refundable. Substantially all the deferred revenue as of June 30, 2022, was recognized as revenue in the year ended June 30, 2023.\nShipping and handling fees billed to customers are included in revenue, as this revenue is not directly related to the distribution costs associated with an order. Shipping fees associated with freight are generally included in distribution costs.\nAdvertising - The Company supports its products with advertising to build brand awareness of the Companys various products in addition to other marketing programs executed by the Companys marketing team. The Company believes continual investment in advertising is critical to the development and sale of its branded products. Advertising costs of $7,978,607 and $3,225,256 were expensed as incurred during the years ended June 30, 2023, and 2022, respectively.\nStock Based Compensation - The Company recognizes all share-based payments to employees, including grants of employee stock options, as compensation expense in the financial statements based on their fair values. That expense will be recognized over the period during which an employee is required to provide services in exchange for the award, known as the requisite service period (usually the vesting period) or immediately if the share-based payments vest immediately.\nNon-employee Stock-based Payments - The Companys accounting policy for equity instruments issued to consultants and vendors in exchange for goods and services follows the provisions of ASC 2018-07, which simplifies the accounting for non-employee share-based payment transactions. The amendments specify that Topic 718 applies to all share-based payment transactions in which a grantor acquires goods or services to be used or consumed in a grantors own operations by issuing share-based payment awards. Stock-based payments related to non-employees is accounted for based on the fair value of the related stock or options or the fair value of the services, whichever is more readily determinable. The measurement date for the fair value of the equity instruments issued is determined at the earlier of (i) the date at which a commitment for performance by the consultant or vendor is reached or (ii) the date at which the consultant or vendors performance is complete. In the case of equity instruments issued to consultants, the fair value of the equity instrument is recognized over the term of the consulting agreement.\nFair Value Measurements - The Company accounts for financial instruments in accordance with FASB Accounting Standards Codification (ASC) 820 Fair value Measurement and Disclosures (ASC 820). ASC 820 defines fair value, establishes a framework for measuring fair value and expands disclosures about fair value measurements. ASC 820 defines fair value as the exchange price that would be received for an asset or paid to transfer a liability (an exit price) in the principal or most advantageous market for the asset or liability in an orderly transaction between market participants on the measurement date. ASC 820 also establishes a fair value hierarchy that distinguishes between (1) market participant assumptions developed based on market data obtained from independent sources (observable inputs) and (2) an entitys own assumptions about market participant assumptions developed based on the best information available in the circumstances (unobservable inputs).\nThe fair value hierarchy consists of three broad levels, which gives the highest priority to unadjusted quoted prices in active markets for identical assets or liabilities (Level 1) and the lowest priority to unobservable inputs (Level 3). The three levels of the fair value hierarchy are described below:\n·\nLevel 1 - Unadjusted quoted prices in active markets that are accessible at the measurement date for identical, unrestricted assets or liabilities.\n·\nLevel 2 - Inputs other than quoted prices included within Level 1 that are observable for the asset or liability, either directly or indirectly, including quoted prices for similar assets or liabilities in active markets; quoted prices for identical or similar assets or liabilities in markets that are not active; inputs other than quoted prices that are observable for the asset or liability (e.g. interest rates); and inputs that are derived principally from or corroborated by observable market data by correlation or other means.\n·\nLevel 3 - Inputs that are both significant to the fair value measurement and unobservable.\nThe estimated fair value of certain financial instruments, including cash and cash equivalents, accounts receivable, accounts payable, accrued expenses, deferred revenue and debt are carried at historical cost basis, which approximates their fair values because of the short-term nature of these instruments.\nLeases - The Company determines if a contract contains a lease at inception. GAAP requires that the Companys leases be evaluated and classified as operating or finance leases for financial reporting purposes. The classification evaluation begins at the commencement date and the lease term used in the evaluation includes the non-cancellable period for which the Company has the right to use the underlying asset, together with renewal option periods when the exercise of the renewal option is reasonably certain and failure to exercise such option will result in an economic penalty. All of the Companys real estate leases are classified as operating leases.\nMost real estate leases include one or more options to renew, with renewal terms that generally can extend the lease term for an additional two years. The exercise of lease renewal options is at the Companys discretion. The Company evaluates renewal options at lease inception and on an ongoing basis and includes renewal options that it is reasonably certain to exercise in its expected lease terms when classifying leases and measuring lease liabilities. Lease agreements generally do not require material variable lease payments, residual value guarantees or restrictive covenants.\nThe Companys leases generally do not provide an implicit rate, and therefore the Company uses its incremental borrowing rate as the discount rate when measuring operating lease liabilities. The incremental borrowing rate represents an estimate of the interest rate the Company would incur at lease commencement to borrow an amount equal to the lease payments on a collateralized basis over the term of a lease within a particular currency environment.\nIncome Taxes - Income taxes are provided for the tax effects of transactions reported in the financial statements and consist of taxes currently due plus deferred taxes resulting from temporary differences. Such temporary differences result from differences in the carrying value of assets and liabilities for tax and financial reporting purposes. The deferred tax assets and liabilities represent the future tax consequences of those differences, which will either be taxable or deductible when the assets and liabilities are recovered or settled. A valuation allowance is provided to reduce the deferred tax assets reported if based on the weight of the available positive and negative evidence, it is more likely than not some portion or all of the deferred tax assets will not be realized.\nThe Company identifies and evaluates uncertain tax positions, if any, and recognizes the impact of uncertain tax positions for which there is a less than more-likely-than-not probability of the position being upheld when reviewed by the relevant taxing authority. Such positions are deemed to be unrecognized tax benefits and a corresponding liability is established on the balance sheet. The Company has not recognized a liability for uncertain tax positions. If there were an unrecognized tax benefit, the Company would recognize interest accrued related to unrecognized tax benefits in interest expense and penalties in operating expenses.\nThe Company uses the asset and liability method of accounting for income taxes in accordance with ASC Topic 740, Income Taxes. Under this method, income tax expense is recognized for the amount of: (i) taxes payable or refundable for the current year and (ii) deferred tax consequences of temporary differences resulting from matters that have been recognized in an entitys financial statements or tax returns. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled.\nThe effect on deferred tax assets and liabilities of a change in tax rates is recognized in the results of operations in the period that includes the enactment date.\nASC Topic 740 clarifies the accounting for uncertainty in income taxes recognized in an enterprises financial statements and prescribes a recognition threshold and measurement attribute for the financial statement recognition and measurement of a tax position taken or expected to be taken in a tax return. ASC Topic 740 provides guidance on de-recognition, classification, interest and penalties, accounting in interim periods, disclosure, and transition. There are no material uncertain tax positions at June 30, 2023.\nOn December 22, 2017, the U.S. government enacted the Tax Act, which made significant changes to the Internal Revenue Code of 1986, as amended, including, but not limited to, reducing the U.S. corporate statutory tax rate and the net operating loss incurred after December 31, 2017 can be carried forward indefinitely and the two year net operating loss carried back was eliminated (prohibited).\nEarnings (loss) per Share - Basic earnings (loss) per share is computed by dividing net income (loss) attributable to common stockholders by the weighted average common shares outstanding for the period. Diluted income (loss) per share is computed giving effect to all potentially dilutive common shares. Potentially dilutive common shares may consist of incremental shares issuable upon the exercise of stock options and warrants and upon the conversion of notes. For the year ended, the dilutive common shares are as follows:\nJune 30,\nJune 30,\nStock options\n4,839,278\n4,279,888\nWarrants\n220,297\n106,850\nPreferred stock\n277,778\n277,778\nConvertible debt\n1,157,651\n-\nTotal potential dilutive weighted average shares outstanding\n6,495,004\n4,664,516\nThe dilutive effect of potentially dilutive securities is reflected in diluted earnings per common share by application of the treasury stock method. Under the treasury stock method, an increase in the fair market value of the Companys common stock can result in a greater dilutive effect from potentially dilutive securities. During the year ended June 30, 2023, and 2022, the Company reported a net loss, so the potential effect is not reflected in the financial statements.\nDeferred Revenue - The Company records deposits as deferred revenue when a customer pays in advance of shipping the product. Once the product is shipped, the deposit is recorded as revenue and the related commissions are paid. All products were shipped related to deposits in deferred revenue, in less than one year.\nConvertible Debt and Securities - The Company follows beneficial conversion feature guidance in ASC 470-20, which applies to convertible stock as well as convertible debt. A beneficial conversion feature is defined as a nondetachable conversion feature that is in the money at the commitment date. The beneficial conversion feature guidance requires recognition of the conversion options in-the-money portion, the intrinsic value of the option, in equity, with an offsetting reduction to the carrying amount of the instrument. The resulting discount is amortized as interest over the life of the instrument, if a stated maturity date exists, or to the earliest conversion date, if there is no stated maturity date. If the earliest conversion date is immediately upon issuance, the expense must be recognized at inception. When there is a subsequent change to the conversion ratio based on a future occurrence, the new conversion price may trigger the recognition of an additional beneficial conversion feature on occurrence.\nNon-controlling Interests in Consolidated Financial Statements - In December 2007, the FASB issued ASC 810-10-65, Non-controlling Interests in consolidated Financial Statements. This ASC clarifies that a non-controlling (minority) interest in subsidiaries is an ownership interest in the entity that should be reported as equity in the consolidated financial statements. It also requires consolidated net income to include the amounts attributable to both the parent and non-controlling interest, with disclosure on the face of the consolidated income statement of the amounts attributed to the parent and to the non-controlling interest. In accordance with ASC 810-10-45-21, those losses attributable to the parent and the non-controlling interest in subsidiaries may exceed their interests in the subsidiarys equity. The excess and any further losses attributable to the parent and the non-controlling interest shall be attributed to those interests even if that attribution results in a deficit non-controlling interest balance.\nRecent Accounting Pronouncements - From time to time, new accounting pronouncements are issued by the Financial Accounting Standards Board, (FASB), or other standard setting bodies and adopted by us as of the specified effective date. Unless otherwise discussed, the impact of recently issued standards that are not yet effective will not have a material impact on the Companys financial position or results of operations upon adoption. The Company has considered all other recently issued accounting pronouncements, including the new provisions of ASC 326 (Financial Instruments - Credit Losses) pertaining to current expected credit losses, and does not believe the adoption of such pronouncements will have a material impact on its financial statements.\nNote 3. Acquisitions\nVitaMedica Corporation\nThe Company purchased VitaMedica on August 1, 2021. VitaMedica Corporation is a leading online seller of supplements for surgery, recovery, skin, beauty, health, and wellness.\nThe following table summarizes the consideration transferred to acquire VitaMedica and the amount of identified assets acquired, and liabilities assumed at the acquisition date.\nFair value of consideration transferred:\nCash\n$ 2,000,000\nCash, working capital adjustment\n74,589\nCommon stock, 100,000 shares valued at $4.82 per common share, the closing price on August 4, 2021.\n482,000\nNote payable\n500,000\n$ 3,556,589\nRecognized amounts of identifiable assets acquired, and liabilities assumed:\nAccounts receivable\n$ 107,446\nInventory\n619,837\nPrepaid expenses\n117,268\nProperty and equipment\n13,220\nTrade name\n463,000\nCustomer list\n1,329,000\nNon-compete\n143,000\nRight of use asset\n112,612\nAccounts payable\n(140,068 )\nOperating lease\n(56,894 )\nOperating lease\n(112,612 )\nTotal identifiable net assets\n$ 2,595,809\nGoodwill\n$ 960,780\nThe business was acquired through an asset purchase agreement, that acquired all the tangible and intangible assets of the VitaMedica business. There was no contingent consideration payable under the asset purchase agreement, although a provision was used to adjust the purchase price based on the final working capital transferred to the Company. The purchase price was increased by $74,589 for the excess working capital that was transferred in the business and the final purchase price allocation was completed by an independent consulting firm and is no longer subject to change.\nThe goodwill is deductible for tax purposes and attributable to the Companys added ability to enter the online sellers market for surgery supplements, recovery, skin, beauty, health and wellness and provided improved gross margins through synergies recognized with the consolidation of manufacturing and distribution operations.\nThe Companys consolidated financial statements for the year ended June 30, 2023 include the actual results for VitaMedica. For the year ended June 30, 2022, the Companys consolidated financial statements include the actual results of VitaMedica for the period August 1, 2021, to June 30, 2022.\nA finders fee of $103,740 was paid by the Company, $70,000 in cash and 7,000 shares of common stock, valued at $33,740, $4.82 per common share, the closing market price on August 4, 2021 (close date of the transaction). These fees were expensed during the year ended June 30, 2022.\nInteractive Offers, LLC\nThe Company acquired Interactive Offers, LLC, on October 1, 2021. The Companys CEO and Chairman, Allan Marshall, was the controlling stockholder and the president of MFA Holdings Corp, which owned 20% of the outstanding membership interests in Interactive. Interactive provides programmatic advertising with its SaaS platform which allows for programmatic advertisement placement automatically on any partners sites from a simple dashboard.\nThe following table summarizes the consideration transferred to acquire Interactive and the amount of identified assets acquired, and liabilities assumed at the acquisition date.\nFair value of consideration transferred:\nCash\n$ 2,100,000\nCommon stock, 100,000 shares valued at $4.88 per common share, the closing price on October 1, 2021.\n2,733,630\n$ 4,833,630\nRecognized amounts of identifiable assets acquired, and liabilities assumed:\nCash\n$ 245,247\nAccounts receivable\n23,791\nPrepaid expenses\n32,543\nProperty and equipment\n3,212\nTrade name\n146,000\nCustomer list\n763,000\nSoftware\n1,590,000\nNon-compete\n132,000\nAccounts payable\n(174,943 )\nAccrued liabilities\n(313,800 )\nAccrued compensation\n(24,193 )\nDeferred revenue\n(478,385 )\nTotal identifiable net assets\n$ 1,944,472\nGoodwill\n$ 2,889,158\nThe business was acquired through an equity interest purchase agreement. The equity purchase agreement provided for an increase in the purchase price of up to $600,000 based on the attainment of certain sales threshold in the first year. Our management believed that the attainment of those sales threshold at the time of acquisition was unlikely and valued the contingency at $0. The sales thresholds were not met, and no consideration was recorded for the contingency. The equity interest purchase agreement has standard provisions to adjust the purchase price based on the final working capital transferred to the Company. The purchase price was decreased by $638,978 and was repaid to the Company with 106,497 of the Companys common stock valued at $6.00 per share. The final purchase price allocation was completed by an independent consulting firm and is no longer subject to change.\nThe goodwill is deductible for tax purposes and attributable to the Company having a solid entry into the programmatic ad space and added a unique in-house advertising platform to leverage and scale its current and future brands. Access by sellers to Interactives ad platform provides further product sales growth and advertising efficiencies. These are the factors of goodwill recognized in the acquisition.\nOn September 1, 2023, the Company sold Interactive Offers. For the years ended June 30, 2023, and 2022 the operations have been reclassed to discontinued operations and the assets and liabilities reclassed to assets available for sale or current assets and current liabilities of discontinued operations. On June 30, 2023, the Company recorded an impairment of the assets available for sale of $3,746,301.\nCygnet Online, LLC\nThe Company acquired 55% of Cygnet Online, LLC, on April 1, 2022. The purchase price was $5,515,756, as amended.\nThe following table summarizes the consideration transferred to acquire Interactive and the amount of identified assets acquired, and liabilities assumed at the acquisition date.\nFair value of consideration transferred:\nCash\n$ 1,500,000\nConvertible note payable, convertible at $6.00 per common share\n1,050,000\nEarnout payment\n-\nCommon stock, 555,489 shares valued at $5.34 per common share, the closing price on April 1, 2022.\n2,965,756\n$ 5,515,756\nRecognized amounts of identifiable assets acquired and liabilities assumed:\nCash\n$ 471,237\nAccounts receivable\n860,882\nInventory\n2,337,208\nPrepaid expenses\n6,900\nProperty and equipment\n7,602\nRight to use asset\n410,365\nOther asset\n6,545\nOnline sales channels\n1,800,000\nVendor relationships\n6,000,000\nAccrued liabilities\n(701,606 )\nNotes payable\n(7,298,353 )\nOperating lease\n(422,479 )\nTotal identifiable net assets\n$ 3,478,301\nGoodwill\n$ 2,037,455\nThe 55% of the business was acquired through a stock purchase agreement on March 31, 2022. The purchase agreement provided for an increase in the purchase price of up to $700,000 based on the attainment of certain sales threshold in the first year. Our management believed that the attainment of those sales threshold at the time of acquisition was unlikely and valued the contingency at $0. The sales thresholds were not met, and no consideration was recorded for the contingency. The equity interest purchase agreement has standard provisions to adjust the purchase price based on the final working capital transferred to the Company. The purchase price was decreased by $950,000 and was repaid to the Company with the reduction in the loan to the seller. The 55% purchase price allocation is final and is no longer subject to change.\nThe Companys consolidated financial statements for the year ended June 30, 2023, include the actual results of Cygnet and for the year ended June 30, 2022 include the results for Cygnet from April 1, 2022 to June 30, 2022.\nOn September 1, 2023, the Company completed the acquisition of the remaining 45% interest for structured cash payments equaling $800,000 and 90,909 shares of the Companys common stock valued at $162,727.\nThe acquisition of Cygnet provided the Company with the opportunity to expand its operations as an Amazon and eCommerce seller. The resulting combination increased Cygnets product offerings through the Companys distributors and partnerships as it continues to focus on over-the -counter supplements and beauty products. Cygnet will be the anchor company for Upexis Amazon strategy. These are the factors of goodwill recognized in the acquisition.\nLuckyTail\nOn August 13, 2022, the Company acquired the pet product brand and the rights to the products of LuckyTail from GA Solutions, LLC.\nThe following table summarizes the consideration transferred to acquire LuckyTail and the amount of identified assets acquired, and liabilities assumed at the acquisition date.\nFair value of consideration transferred:\nCash\n$ 2,000,000\nCash payment, 90 days after close\n484,729\nCash payment, 180 days after close\n469,924\nContingent consideration\n112,685\nCash payment, working capital adjustment\n460,901\n$ 3,528,239\nRecognized amounts of identifiable assets acquired, and liabilities assumed:\nInventory\n$ 460,901\nTrade name\n383,792\nCustomer list\n1,834,692\nTotal identifiable net assets\n$ 2,679,385\nGoodwill\n$ 848,854\nThe business was acquired through an asset purchase agreement, that acquired all elements of a business, including all of the tangible and intangible assets of the LuckyTail business. The purchase agreement provided for an increase in the purchase price based on the attainment of certain sales thresholds in the first six months. The Company estimated the value of this at approximately $150,000 at the time of purchase. The sales calculated to a $112,685 payout and the purchase price was adjusted. The asset purchase agreement has standard provisions to adjust the purchase price based on the final working capital transferred to the Company. The purchase price was increased by $460,901 for the excess working capital that was transferred in the business and the final purchase price allocation was completed by an independent consulting firm and is no longer subject to change.\nThe Companys consolidated financial statements for the year ended June 30, 2023, include the actual results of LuckyTail from August 13, 2022, through June 30, 2023. The Company recorded interest on the consideration of $63,282 during the year ended June 30, 2023.\nThe acquisition of LuckyTail provided the Company with a foothold in the pet care industry and a strong presence on Amazon and its eCommerce store, offering nutritional and grooming products domestically and internationally. The acquisition provided both top line growth and improved EBITDA for the Company. These are the factors of goodwill recognized in the acquisition.\nE-Core, Technology Inc. and its subsidiaries\nOn October 21, 2022, the Company acquired E-Core Technology, Inc. (E-Core) d/b/a New England Technology, Inc., a Florida corporation (New England Technology).\nThe following table summarizes the consideration transferred to acquire E-Core and the amount of identified assets acquired, and liabilities assumed at the acquisition date.\nFair value of consideration transferred:\nCash\n$ 100,000\nCash payment, 120 days\n3,000,000\nNote payable\n5,189,718\nNote payable 2\n4,684,029\nConvertible note payable, convertible at $4.81 per common share\n2,418,860\nCommon stock, 1,247,402 shares valued at $4.81 per common share, the calculated closing price on October 21, 2022.\n6,000,000\n$ 21,039,765\nRecognized amounts of identifiable assets acquired, and liabilities assumed:\nCash\n$ 1,014,610\nAccounts receivable\n6,699,945\nInventory\n7,750,011\nPrepaid expenses\n75,721\nTrade name\n1,727,249\nCustomer relationships\n5,080,305\nAccrued liabilities\n(192,051 )\nLine of credit\n(7,201,079 )\nTotal identifiable net assets\n$ 14,635,673\nGoodwill\n$ 6,404,092\nThe business was acquired through membership interest purchase agreement on October 21, 2022. There was no contingent consideration payable under the asset purchase agreement, although a provision was used to adjust the purchase price based on the final working capital transferred to the Company. The purchase price was decreased by $33,803, net and was repaid to the Company with an adjustment to the $3,000,000 cash payment. The final purchase price allocation was completed by an independent consulting firm and is no longer subject to change.\nThe Companys consolidated financial statements for the year ended June 30, 2023, include the actual results of E-Core from October 21, 2022, through June 30, 2023. The Company recorded interest on the consideration of $969,098 during the year ended June 30, 2023. At June 30, 2023 there was $1,738,295 of unamortized debt discount that will be expensed over the next two years.\nThe acquisition of E-Core provided the Company with an entrance into the childrens toy sector as well as national retail distribution for owned and non-owned branded products. The acquisition expands the Companys ability to leverage direct-to-consumer distribution and further develops the broad distribution capabilities of E-Core. These are the factors of goodwill recognized in the acquisition.\nRevenue from acquisitions included in the financial statements.\nNet revenue included in the financial statements:\nJune 30,\nVitaMedica\n$ 7,610,949\n$ 5,124,583\nCygnet\n23,996,086\n7,934,153\nLuckyTail\n4,489,384\n-\nE-Core\n36,551,957\n-\n$ 72,648,376\n$ 13,058,736\nConsolidated pro-forma unaudited financial statements.\nThe following unaudited pro forma combined financial information is based on the historical financial statements of the Company, VitaMedica, Interactive, Cygnet, LuckyTail and E-Core after giving effect to the Companys acquisitions as if the acquisitions occurred on July 1, 2021.\nThe following unaudited pro forma information does not purport to present what the Companys actual results would have been had the acquisitions occurred on July 1, 2021, nor is the financial information indicative of the results of future operations. The following table represents the unaudited consolidated pro forma results of operations for the year ended June 30, 2023 and the year ended June 30, 2022. The results of operations for VitaMedica and Cygnet are included in the year ended June 30, 2023 and the results of operations for LuckyTail are included from August 13, 2022 to June 30, 2023 and the results of operations for E-Core are included from October 21, 2022 to June 30, 2023.\nOperating expenses have been increased for the amortization expense associated with the fair value adjustment of definite lived intangible assets of VitaMedica, Cygnet, LuckyTail and E-Core by approximately $41,363, $175,000, $44,619, and $134,625 per month, respectively.\nPro Forma, Unaudited\nProforma\nYear ended June 30, 2023\nUpexi, Inc.\nLuckyTail\nE-Core\nAdjustments\nProforma\nNet sales\n$ 80,676,509\n$ 892,270\n$ 12,905,836\n$\n$ 94,474,615\nCost of sales\n$ 47,118,189\n$ 137,088\n$ 11,177,032\n$\n$ 58,432,309\nOperating expenses\n$ 41,110,327\n$ 383,476\n$ 1,050,602\n$ 538,116\n$ 43,083,521\nNet income (loss) from continuing operations\n$ (15,422,202 )\n$ 371,706\n$ 660,860\n$ (538,116 )\n$ (14,927,752 )\nBasic income (loss) per common share\n$ (0.86 )\n$ -\n$ 0.53\n$\n$ (0.83 )\nWeighted average shares outstanding\n17,877,959\n-\n1,247,402\n(693,001 )\n18,432,360\nPro Forma, Unaudited\nProforma\nYear ended June 30, 2022\nUpexi, Inc.\nVitaMedica\nCygnet\nLuckyTail\nE-Core\nAdjustments\nProforma\nNet sales\n$ 23,065,344\n$ 384,391\n$ 22,583,781\n$ 4,596,641\n$ 50,474,510\n$\n$ 101,104,667\nCost of sales\n$ 8,195,735\n$ 93,509\n$ 19,117,296\n$ 802,614\n$ 45,722,296\n$\n$ 73,931,450\nOperating expenses\n$ 21,358,740\n$ 255,286\n$ 2,086,722\n$ 2,873,631\n$ 3,681,298\n$ 3,767,291\n$ 34,022,969\nNet income (loss) from continuing operations\n$ (5,869,651 )\n$ 35,596\n$ 1,147,971\n$ 920,396\n$ 1,178,491\n$ (3,767,291 )\n$ (6,462,064 )\nBasic income (loss) per common share\n$ (0.36 )\n$ 0.36\n$ 2.07\n$ -\n$ 0.86\n$\n$ (0.36 )\nWeighted average shares outstanding\n16,224,520\n100,000\n555,489\n-\n1,247,402\n(565,750 )\n18,121,831\nVitaMedica amortization expense of $496,356 annually and $41,363 monthly is based on the purchase price allocation report. For the year ended June 30, 2022, the proforma adjustment included $41,363, one month of amortization expense.\nThe total weighted average shares includes 560,170 shares of common stock outstanding from October 1, 2021 to June 30, 2022 for the acquisition of Interactive Offers.\nThe Company estimated the annual Cygnet amortization expense at $2,100,000 annually and $175,000 monthly, based on managements allocation of the purchase price. For the year ended June 30, 2022, the proforma adjustment included $1,575,000, nine months of amortization expense.\nThe Company estimated the annual LuckyTail amortization expense at $535,428 annually and $44,619 monthly, based on managements preliminary allocation of the purchase price. For the year ended June 30, 2023, the proforma adjustment included $66,929 of amortization expense for one and a half months. For the year ended June 30, 2022, the proforma adjustment included $648,000 of amortization and for the year.\nThe Company estimated the annual E-Core amortization expense at $1,615,500 annually and $134,625 monthly, based on managements preliminary allocation of the purchase price. For the year ended June 30, 2023, the proforma adjustment included $534,721 of amortization expense, three and a half months. For the year ended June 30, 2022, the proforma adjustment included $1,615,500 of amortization expense.\nThese costs are primarily external legal, accounting and consulting services directly related to completed acquisitions, due diligence, and review of possible target acquisitions. These acquisition-related costs are included in the general and administrative expenses on the Companys condensed consolidated statements of operations.\nNote 4. Property and Equipment\nProperty and equipment consist of the following:\nJune 30,\nJune 30,\nFurniture and fixtures\n$ 172,663\n$ 51,273\nComputer equipment\n156,283\n103,615\nInternal use software\n608,949\n-\nManufacturing equipment\n3,325,525\n1,002,796\nLeasehold improvements\n-\n2,144,341\nBuilding\n4,923,462\n4,656,435\nVehicles\n261,362\n253,229\nProperty and equipment, gross\n9,455,848\n8,211,689\nLess accumulated depreciation\n(1,921,780 )\n(872,823 )\n$ 7,526,463\n$ 7,338,866\nDepreciation expense for the years ended June 30, 2023 and 2022 was $944,704 and $574,309, respectively.\nDuring the year ended June 30, 2022, the Company sold vehicles with a carrying value of $500 for cash proceeds of $6,000, which resulted in a gain on the disposal of $5,500.\nNote 5. Intangible Assets\nIntangible assets as of June 30, 2023:\nEstimated\nLife\nCost\nAccumulated\nAmortization\nNet\nBook Value\nCustomer relationships\n4 years\n$ 8,243,897\n$ 1,937,595\n$ 6,306,302\nTrade name\n5 years\n2,574,041\n489,341\n2,084,700\nNon-compete agreements\nTerm of\nagreement\n143,000\n137,042\n5,958\nOnline sales channels\n2 years\n1,800,000\n1,125,000\n675,000\nVender relationships\n5 years\n6,000,000\n1,500,000\n4,500,000\n$ 18,760,938\n$ 5,188,978\n$ 13,571,960\nFor the years ended June 30, 2023 and 2022, the Company amortized approximately $4,208,991 and $979,988, respectively.\nThe following intangible assets were added during the year ended June 30, 2023, from the acquisitions noted below:\nLuckyTail:\nCustomer relationships\n$ 1,834,692\nTrade name\n383,792\nIntangible Assets from Purchase\n$ 2,218,484\nE-Core:\nCustomer relationships\n$ 5,080,205\nTrade name\n1,727,249\nIntangible Assets from Purchase\n$ 6,807,454\nIntangible assets as of June 30, 2022:\nCost\nAccumulated\nAmortization\nNet\nBook Value\nCustomer relationships, amortized over four years\n$ 1,329,000\n$ 304,842\n$ 1,024,158\nTrade name, amortized over five years\n463,000\n85,083\n377,917\nNon-compete agreements, amortized over the term of the agreement\n143,000\n65,063\n77,937\nOnline sales channels, amortized over two years\n1,800,000\n225,000\n1,575,000\nVender relationships, amortized over five years\n6,000,000\n300,000\n5,700,000\n$ 9,735,000\n$ 979,988\n$ 8,755,012\nThe following intangible assets were added during the year ended June 30, 2022, from the acquisition of VitaMedica and Cygnet.\nCustomer relationships\n$ 1,329,000\nTrade name\n463,000\nNon-compete agreements\n143,000\nOnline sales channels\n1,800,000\nVender relationships\n6,000,000\nIntangible Assets from Purchase\n$ 9,735,000\nFuture amortization of intangible assets at June 30, 2023 are as follows:\nJune 30, 2024\n$ 4,456,740\nJune 30, 2025\n3,775,782\nJune 30, 2026\n3,775,782\nJune 30, 2027\n1,538,187\nJune 30, 2028\n25,467\nThereafter\n-\n$ 13,571,960\nNote 6. Prepaid Expense and Other Current Assets\nPrepaid and other receivables consist of the following:\nJune 30,\nJune 30,\nInsurance\n$ 187,949\n$ 32,045\nPrepayment to vendors\n263,652\n139,356\nDeposits on services\n45,678\n13,762\nPrepaid monthly rent\n27,813\n6,900\nSubscriptions and services being amortized over the service period\n-\n204,490\nPrepaid sales tax\n70,021\n-\nOther deposits\n70,826\nStock issued for prepaid interest on convertible note payable\n465,595\n-\nOther prepaid expenses\n31,000\n364,347\nOther receivables\n144,765\n-\nTotal\n$ 1,307,299\n$ 760,900\nNote 7. Operating Leases\nThe Company has operating leases for corporate offices, warehouses and office equipment that have remaining lease terms of 1 year to 5 years.\nDuring November 2019, the Company entered into a lease for a Nevada facility that commenced on November 13, 2019, and recorded a right of use asset and corresponding lease liability. The Company uses this leased facility for office, manufacturing, and warehouse space. The Company is responsible for real estate taxes, utilities, and repairs under the terms of certain of the operating leases. Therefore, all lease and non-lease components are combined and accounted for as single lease component. Lease expense was $568,031 for the year ended June 30, 2022. Lease expenses for the year ended June 30, 2023 are included discontinued operations. The operating lease expired in 2022 and the Company continues to occupy the facility and pays rent on a month-to-month basis.\nDuring May 2021, the Company entered into a lease for an additional Nevada facility that commenced on May 1, 2021, and recorded a right of use asset and corresponding lease liability. The Company uses this leased facility for additional warehouse space. Lease expense was $117,992 for each of the years ended June 30, 2023 and 2022.\nDuring September 2020, the Company entered into a one-year lease for a Colorado facility that commenced on September 1, 2020, and recorded a right of use asset and corresponding lease liability. The Company used this facility for office and manufacturing space. Lease expense was $22,803 for the year ended June 30, 2022.\nDuring November 2018, the Company entered into a lease for equipment that commenced on November 1, 2018, and recorded a right of use asset and corresponding lease liability. Lease expenses were $6,744 and $6,428 for the years ended June 30, 2023 and June 30, 2022, respectively.\nOn July 1, 2021, the Company entered into a 39-month lease for Florida facility and recorded a right to use asset and corresponding lease liability for Interactive Offers. The Company uses this facility for office space. Lease expense was $39,820 for each of the years ended June 30, 2023 and 2022 and has been included in discontinued operations.\nDuring October 2021, the Company entered into a 3-year lease for a California warehouse. The Company recorded a right of use asset and corresponding lease liability of $295,305. The Company will use this leased facility for assembly and distribution of finished goods. Lease expenses were $105,600 and $79,200 for the years ended June 30, 2023 and 2022, respectively.\nOn April 1, 2022, the Company acquired Cygnet which had entered into a lease for a Florida facility that commenced on October 8, 2021, and Cygnet had recorded a right of use asset and corresponding lease liability. The lease expires on October 8, 2026. The Company uses this leased facility for warehouse and office space. The Company is responsible for real estate taxes, utilities, and repairs under the terms of certain of the operating leases. Therefore, all lease and non-lease components are combined and accounted for as single lease component. Lease expenses were $102,228 and $21,800 for the years ended June 30, 2023 and 2022, respectively.\nThe table below reconciles the undiscounted future minimum lease payments (displayed by year and in the aggregate) under noncancelable operating leases with terms of more than one year to the total operating lease liabilities recognized in the condensed consolidated balance sheet as of June 30, 2023:\n$ 318,636\n143,302\n121,273\n33,683\n-\nTotal undiscounted future minimum lease payments\n616,893\nLess: Imputed interest\n(34,091 )\nPresent value of operating lease obligation\n$ 582,802\nThe Companys weighted average remaining lease term and weighted average discount rate for operating leases as of June 30, 2023 are:\nWeighted average remaining lease term\n29 Months\nWeighted average incremental borrowing rate\n5.0\n%\nFor the years ended June 30, 2023 and 2022, the components of lease expense, included general and administrative expenses and interest expense in the condensed consolidated statement of operations, are as follows:\nJune 30, 2023\nJune 30, 2022\nOperating lease cost:\nOperating lease cost\n$ 341,644\n$ 368,680\nAmortization of ROU assets\n304,827\n273,746\nInterest expense\n35,003\n38,290\nTotal lease cost\n$ 681,474\n$ 680,716\nNote 8. Accrued Liabilities\nAccrued liabilities consist of the following:\nJune 30,\nJune 30,\nAccrued expenses for loyalty program\n$ -\n$ 6,418\nAccrued interest\n655,187\n147,887\nAccrued vendor liabilities\n861,664\n-\nAccrued sales tax\n47,070\n108,425\nDerivative liability\n-\n81,909\nAccrued expenses from sale of manufacturing operations\n1,360,000\n-\nOther accrued liabilities\n441,641\n471,993\n$ 3,365,562\n$ 816,632\nNote 9. Convertible Promissory Notes and Notes Payable\nMaturity\nJune 30,\nJune 30,\nDate\nConvertible Notes:\nPromissory Note, 21- month term note, 18.11% interest payable with common stock and subordinate to the Convertible Notes\nNovember 22, 2024\n$ 2,150,000\n$ -\nConvertible Notes, 3-year term note, 8.5% cash interest, 3.5% PIK interest and collateralized with all the assets of the Company\nJune 28, 2025\n-\n6,305,406\nLess current portion of notes payable\n1,254,167\n3,125,000\nNotes payable, net of current portion\n$ 895,833\n$ 3,180,406\nAcquisition Notes:\nConvertible Notes, 36-month term notes, 0% cash interest, collateralized with all the assets of the Company\nOctober 31, 2025\n3,500,000\n-\nSubordinated Promissory Notes, 24-month term notes, 4% cash interest, collateralized with all the assets of the Company\nOctober 31, 2024\n5,750,000\n-\nSubordinated Promissory Notes, 12-month term notes, 4% cash interest, collateralized with all the assets of the Company\nOctober 31, 2023\n5,750,000\n-\nVitaMedica Loan, 1-year term note, 6% interest and is convertible at $5.00 per share\nAugust 1, 2022\n-\n500,000\nCygnet Loan, 1-year term note, 6% interest and is convertible at $6.00 per share\nApril 15, 2023\n-\n1,050,000\nTotal\n$ 15,000,000\n$ 1,550,000\nDiscount on acquisition notes payable, current\n(93,380 )\n-\nAcquisition notes payable, current\n5,750,000\n1,550,000\nAcquisition notes payable, current net\n$ 5,656,620\n$ 1,550,000\nDiscount on acquisition notes payable, long-term\n(1,644,915 )\n-\nAcquisition notes payable, long-term\n9,250,000\n-\nAcquisition notes payable, long-term net\n$ 7,605,085\n$ -\nNotes Payable:\nMarshall Loan, 2-year term note, 8.5% cash interest, 3.5% PIK interest and subordinate to the Convertible Notes\nJune 28, 2024\n1,500,000\n-\nMortgage Loan, 10-year term note, 4.8% interest, collateralized by land and warehouse building\nSeptember 26, 2032\n2,841,566\nPromissory Note, 21-month term note, 10% cash interest and subordinate to the Convertible Notes\nNovember 22, 2024\n560,000\nSBA note payable, 30-year term note, 6% interest rate and collateralized with all assets of the Company\nOctober 6, 2021\n3,910,767\n4,216,248\nInventory consignment note, 60 monthly payments, with first payment due June 30, 2022, 3.5% interest rate and no security interest in the assets of the business\nJune 30, 2027\n1,099,592\n1,379,230\nGF Note, 6 annual payments, with first payment due December 31, 2022, 3.5% interest rate and no security interest in the assets of the business\nNovember 7, 2026\n683,968\n850,000\nTotal notes payable\n10,595,893\n6,445,478\nDiscount on notes payable, current\n(94,836 )\n-\nNotes payable, current\n2,826,213\n749,752\nNotes payable, current net\n$ 2,731,377\n$ 749,752\nDiscount on acquisition notes payable, long-term\n(23,522 )\n-\nNotes payable, long-term\n7,769,679\n5,695,726\nNotes payable, long-term, net\n$ 7,746,157\n$ 5,695,726\nTotal convertible notes payable, acquisition notes payable and notes payable\n$\n25,889,239\n$\n14,330,884\nFuture payments on notes payable are as follows:\nFor the year ended June 30:\nNote Payable\nConvertible Notes\nAcquisition Notes Payable\nTotal\n$ 2,826,213\n$ 1,254,167\n$ 5,750,000\n$ 9,830,380\n1,314,931\n895,833\n5,750,000\n7,960,764\n1,130,403\n3,500,000\n4,630,403\n1,052,943\n1,052,943\n784,450\n784,450\nThereafter\n3,486,952\n3,486,952\n$ 10,595,892\n$ 2,150,000\n$ 15,000,000\n$ 27,745,892\nNote original discount\n$ -\n$ (118,358 )\n$ (1,738,295 )\n$ (1,856,653 )\n$ 10,595,892\n$ 2,031,642\n$ 13,261,705\n$ 25,889,239\nConvertible Notes Payable:\nIn June 2022, the Company entered into a securities purchase agreement with two accredited investors pursuant to which the Company could receive up to $15,000,000 during the following twelve months of the agreement. The Company received $6,678,506 for Convertible Notes in the original principal amount of $7,500,000 (the Convertible Notes), representing the original purchase amount, less fees, costs and a $500,000 holdback by the investors. In addition to the Convertible Notes, the investors received Common Stock Purchase Warrants (the Warrants) to acquire an aggregate of 56,250 shares of common stock. The Warrants are exercisable for five years at an exercise price of $4.44 per share, provide customary anti-dilution protection, and an investor put right to require the Company to redeem the Warrants for a total of $250,000. There was a loss of $1,770 for the change in the derivative liability for the period ended March 31, 2023. On October 31, 2022, the Company entered into a letter agreement with the accredited investors in which all amounts owed were paid in full and the related convertible notes and all security interests were cancelled. Additionally, the Company terminated the related Form S-3 registration statement.\nOn February 22, 2023, the Company executed a promissory note with an investor, in the original principal amount of $2,150,000 together with the issuance of 134,000 restricted shares (the PIK shares) of the Companys common stock at a price of $4.53 per share. The promissory note has a 21-month term and bears interest at 18.11% payable with the PIK shares. The promissory note provides for 12 monthly payments of principal beginning on December 22, 2023, and PIK interest of restricted shares on the Effective Date of the promissory note. The Company shall have the right at any time to convert all or any part of the outstanding and unpaid principal into fully paid and non-assessable shares of common stock, or any shares of capital stock or other securities, together with the PIK shares at a price per conversion share equal to $5.00.\nAcquisition Notes Payable:\nOn August 1, 2021, the Company entered into a non-negotiable convertible promissory note related to the purchase of VitaMedica in the original principal amount of $500,000 (VitaMedica Note), convertible at $5.00 per share for a total of 100,000 shares of Company Common Stock. The Company repaid the note in full during August of 2022.\nOn April 15, 2022, the Company entered into a non-negotiable convertible promissory note in the original principal amount of $1,050,000, as adjusted, (Cygnet Note) which can be converted into common stock of the Company at a price of $6.00 per share and is payable in full, to the extent not previously converted, on April 15, 2023. The Company repaid the note in full plus all outstanding accrued interest during April 2023.\nThe Company and its wholly owned subsidiary, Upexi Enterprises, LLC entered into a securities purchase agreement with E-Core Technology, Inc. d/b/a New England Technology, Inc., a Florida corporation, and its three principals. The Company entered into a series of promissory notes with the principal parties: (a) promissory notes in the total original principal amount of $5,750,000 payable upon maturity with a term of 12 months at an interest rate of 4%, $600,000 of which shall be satisfied through the cancellation of an equal amount owed by one of the principals to the Company; (b) promissory notes in the total original principal amount of $5,750,000 payable upon maturity with a term of 24 months at an interest rate of 4%; and (c) promissory notes in the original principal amounts of $3,500,000 with a term of 36 months at an interest rate of 0%. The principals may convert the notes into shares of the Companys restricted common stock at a conversion price equal to $4.81. If the principals do not exercise their conversion rights, the principal balance of the notes will be paid in 12 equal monthly payments commencing on the two-year anniversary of the issuance of the notes, subject to adjustments based on the Companys EBITDA over the term of the notes.\nNotes Payable:\nIn June 2022, the Company executed a promissory note with Allan Marshall, the Companys Chief Executive Officer, in the original principal amount of $1,500,000 (Marshall Loan). The promissory note has a 2-year term and bears cash interest at the rate of 8.5% per annum with an additional PIK of 3.5% per annum. The promissory note provides for monthly payments of principal, on an even line 36-month basis, plus cash interest, with a balloon payment of all outstanding principal, cash interest, and PIK interest at maturity. The Company received and deposited the principal amount on July 31, 2022.\nOn October 19, 2022, Upexi, Inc. (the Company) and its indirect wholly owned subsidiary, Upexi 17129 Florida, LLC entered into a loan agreement, promissory note and related agreements with Professional Bank, a Florida state-chartered bank, providing for a mortgage on the Companys principal office in N. Clearwater, Florida. The Company received $3,000,000 in connection with the transaction. The principal is to be repaid to Professional Bank over a term of ten years. The proceeds of the loan were utilized by the Company to pay down its loan facility with Acorn Capital, LLC in the amount of $2,780,200.\nOn February 22, 2023, the Company executed a promissory note with an investor, in the original principal amount of $560,000. The promissory note has a 21-month term and bears cash interest at the rate of 10% per annum. The promissory note provides for monthly payments of interest beginning on March 22, 2023 and 12 monthly payments of principal beginning on December 22, 2023.\nThere were certain loan outstanding prior to the acquisition of Cygnet Online prior to acquisition and continued to be outstanding post acquisition.\n·\nCygnet Online, entered into a loan for $4,436,900 with the Small Business Administration. The promissory note has a scheduled payment commencing on November 6, 2021, consisting of principal and interest. The interest rate is adjustable of prime plus 2.5% and is currently at 10.25%. The balance of the principal and interest will be payable ten years from the date of the promissory note.\n·\nCygnet Online, entered into a 60 month inventory consignment note with the first payment due June 30, 2022. The note bears interest at 3.5% per annum.\n·\nCygnet Online, executed a promissory note in the amount of $850,000 payable in six annual installments of principal and interest, the final payment due December 1, 2027. The note bears interest at 3.5% per annum.\nNote 10. Related Party Transactions\nThe Company purchased Interactive Offers, Interactive Offers, LLC, a Delaware limited liability company The Companys CEO and Chairman, Allan Marshall, is the controlling stockholder and the president of MFA Holdings Corp., which owned 20% of the outstanding membership interests in Interactive.\nDuring the year ended June 30, 2022, the Company entered into a promissory note with Allan Marshall, CEO of the Company. The loan was for $1,500,000 and has a two-year term with an interest rate of 8.5% per annum with an additional PIK of 3.5% per annum.\nThe above related party transactions are not necessarily indicative of the amounts and terms that would have been incurred had comparable transactions been entered into with independent parties.\nNote 11. Equity Transactions\nConvertible Preferred Stock\nThe Companys Board of Directors has authorized 1,000,000 shares of preferred stock with a par value of $0.001 and issued 500,000 shares of preferred stock for a purchase price of $50,000. This preferred stock is convertible into shares of common stock at a ratio of 1.8 shares of preferred stock for a single share of the Companys common stock with additional terms and conditions determined by the Board of Directors. During the year ended June 30, 2020, an investor converted 500,000 shares of preferred stock into 277,778 shares of common stock.\nOn February 2, 2021, the Company sold the 500,000 shares of Preferred Stock to Allan Marshall, CEO for net proceeds of $50,000. The preferred stock is convertible into the Companys common stock at a ratio of 1.8 shares of preferred stock for a single share of the Companys common stock at the holders option, has preferential liquidation rights and the preferred stock shall vote together with the common stock as a single class on all matters to which shareholders of the Company are entitled to vote at the rate of ten votes per share of preferred stock.\nCommon Stock\nOn February 8, 2021, the Shareholders consented, and the Board of Directors approved the Reverse Stock Split at the rate of 1 share of Common Stock for each 1.8 shares of Common Stock of the Company issued and outstanding (rounded up to the nearest whole number after giving effect to the Reverse Stock Split) on the Record Date of February 5, 2021.\nOn February 8, 2021, the Board of Directors approved the officers of the Company to file a Registration Statement on Form S-1 (the Registration Statement) to be prepared for the purposes of registering (i) up to $20,000,000 of Common Stock at a purchase price of no less than $4.50 per share (post reverse split), including an over-allotment option for the underwriter named therein (the Underwriter) to purchase additional shares of Common Stock amounting to 15% of the number of shares of Common Stock offered to the public; and (ii) a warrant to be issued to the Underwriter for the purchase of shares of Common Stock (the Underwriter Warrant); and (iii) the shares of Common Stock underlying the Underwriter Warrant (collectively, the Securities).\nOn June 28, 2021, and the Company completed the sale of 2,530,000 shares of Common Stock to the Underwriters, which includes 330,000 shares sold upon the full exercise of the option, for total gross proceeds of approximately $12,650,000. After deducting the underwriting commissions, discounts, and offering expenses payable by the Company, the Company received net proceeds of $10,950,315. This registration is no longer effective.\nDuring the year ended June 30, 2021, the Company issued 526,404 shares of common stock for the acquisition of Infusionz. The shares were valued at $1,235,124 and the Company issued 306,935 of the Companys stock on September 1, 2021, for the remaining acquisition liability of $1,764,876. In addition, the Company issued 83,334 shares of common stock valued at $127,500 for acquisition costs.\nDuring the year ended June 30, 2022:\nThe Company issued 306,945 shares of common stock for the acquisition of Infusionz, the shares were valued at $1,764,876.\nThe Company issued 100,000 shares of common stock for the acquisition of VitaMedica, the shares were valued at $482,000.\nDuring the year ended June 30, 2023:\nThe Company issued 1,247,403 shares of common stock for the acquisition of E-Core Technologies Inc., a Florida corporation, valued at $6,000,000.\nThe Company issued 134,000 shares of common stock for prepayment of interest on a note payable. The shares were valued at $607,020 or $4.52 per common share and recorded as prepaid interest as the shares were issued at that time.\nThe Company agreed to sell 2,121,213 shares of common stock for a purchase price of approximately $7,000,000. After deducting the underwriters commissions, discounts, and offering expenses payable by the company, the Company expects to receive net proceeds of approximately $6,060,000. In addition, the Company issued warrants to purchase approximately 169,000 shares of the Companys common stock at a purchase price of $4.774 per common share.\nIn September of 2023, the Company issued 90,909 shares of common stock for the purchase of the remaining 45% of Cygnet Online, LLC. The shares were valued at $162,727 or $1.79 per common share.\nNote 12. Stock Based Compensation\nThe Company has established a Company an incentive plan, 2019 Equity Incentive Plan (the 2019 Plan). The plan grants incentives to select persons who can make, are making and continue to make substantial contributions to the growth and success of the Company, to attract and retain the employment and services of such persons and to encourage and reward such contributions by providing these individuals with an opportunity to acquire or increase stock ownership in the Company through either the grant of options or restructured stock. The 2019 Plan is administered by the Compensation Committee or such other committee as is appointed by the Board of Directors pursuant to the 2019 Plan (the Committee). The Committee has full authority to administer and interpret the provisions of the 2019 Plan including, but not limited to, the authority to make all determinations with regard to the terms and conditions of an award made under the 2019 Plan. On February 8, 2021, the Shareholders consented, and the Board of Directors approved, the amendment of the 2019 Plan to increase the maximum number of Shares that may be issued thereunder by 2,777,778 Shares to 5,555,555 Shares. On May 24, 2022, the Shareholders consented, and the Board of Directors approved the amendment of the 2019 Plan to increase the maximum number of Shares that may be issued thereunder by 4,444,445 Shares to 10,000,000 Shares.\nThe Board of Directors of the Company may from time to time, in its discretion grant to directors, officers, consultants and employees of the Company, non-transferable options to purchase common shares. The options are exercisable for a period of up to 10 years from the date of the grant.\nThe following table reflects the continuity of stock options for the year ended June 30, 2023, and 2022:\nA summary of stock option activity is as follows:\nWeighted\nAverage\nAverage\nRemaining\nAggregated\nOptions\nExercise\nContractual\nIntrinsic\nOutstanding\nPrice\nLife (Years)\nValue\nOutstanding at June 30, 2021\n2,089,000\n$ 1.55\n7.49\n$ 9,689,865\nGranted\n2,302,000\n4.36\n-\nForfeited\n(111,112 )\n1.53\n-\n-\nOutstanding at June 30, 2022\n4,279,888\n$ 3.05\n7.42\n$ 4,919,182\nGranted\n1,043,000\n4.63\n-\nForfeited\n(483,610 )\n1.53\n-\n-\nOutstanding at June 30, 2023\n4,839,278\n$ 3.31\n6.23\n$ 1,342,280\nOptions exercisable at June 30, 2023 (vested)\n4,349,799\n$ 3.12\n6.41\n$ 3,131,855\nOptions exercisable at June 30, 2022 (vested)\n2,987,772\n$ 2.43\n7.57\n$ 7,977,353\nThe average fair value of stock options granted was estimated to be $4.63 per share for the period ended June 30, 2023, and the closing stock price on June 30, 2023, was $2.25 per common share.\nThe average fair value of stock options granted was estimated to be $4.36 per share for the period ended June 30, 2022, and the closing stock price on June 30, 2022, was $4.20 per common share.\nStock-based compensation expense attributable to stock options was approximately $3,664,538 and $2,755,016 for the years ended June 30, 2023 and 2022, respectively. As of June 30, 2023, there was approximately $1,454,613 unrecognized compensation expense related to unvested stock options outstanding, and the weighted average vesting period for those options was 2 years.\nThe value of each grant is estimated at the grant date using the Black-Scholes option model with the following assumptions for options granted during the years ended June 30, 2023 and 2022.\nJune 30, 2023\nJune 30, 2022\nDividend rate\n-\n-\nRisk free interest rate\n2.70%-4.38%\n0.69%-2.91\n%\nExpected term\n6.5\n6.5\nExpected volatility\n68% - 117%\n%\nGrant date stock price\n$\n1.62 - 5.30\n$\n4.18 - 5.34\nThe basis for the above assumptions are as follows: the dividend rate is based upon the Companys history of dividends; the risk-free interest rate for periods within the expected term of the option is based on the U.S. Treasury yield curve in effect at the time of grant; the expected term was calculated based on the Companys historical pattern of options granted and the period of time they are expected to be outstanding; and expected volatility was calculated based upon historical trends in the Companys stock prices.\nForfeitures are estimated at the time of grant and revised, if necessary, in subsequent periods if actual forfeitures differ from those estimates. Based on historical experience of forfeitures, the Company estimated forfeitures at 0% for each of the years ended June 30, 2023, and 2022, respectively.\nThere were 4,648,624 shares available for issuance as of September 27, 2023, under the 2019 Plan as amended.\n13. Income Taxes\nThe components of the provision for income taxes are as follows:\nCurrent tax provision\n$ 349,260\n$ 80,769\nDeferred tax provision\n(3,601,298 )\n(599,167 )\nProvision for income taxes (benefit)\n$ (3,049,293 )\n$ (518,398 )\nThe differences between income taxes calculated at the statutory US federal income tax rate and the Companys provision for income taxes are as follows:\nIncome tax provision at statutory federal and state tax rate\n21.00 %\n21.00 %\nState taxes, net of federal benefit\n5.04 %\n(2.70 )%\nNondeductible expense\n(0.24 )%\n2.79 %\nTax return to provision\n(2.67 )%\n-%\nState tax rate change\n1.81 %\n%\nOther, net\n0.90 %\n0.72 %\nValuation allowance\n-\n%\n-\n%\nProvision for income taxes\n25.83 %\n20.37 %\nThe net deferred income tax asset balance related to the following:\nNet operating losses carry forward\n$ 752,863\n$ 296,352\nReward points\n-\n1,536\nInventory write off\n-\n11,965\nImpairment loss - Interactive Offers\n1,015,997\nIntangible assets\n1,714,8701\n691,411\nStock Options\n1,999,688\n887,550\nAllowance for doubtful accounts\n56,112\n13,760\nAccrued compensation\n19,323\n19,970\nDeferred revenue\n18,196\n80,215\nOther, net\n-\nValuation allowances\n-\n-\nDeferred tax asset\n$ 5,604,056\n$ 2,002,759\nThere were approximately $3,097,791 and $1,411,198 of losses available to reduce federal taxable income in future years and can be carried forward indefinitely as of June 30, 2023 and June 30, 2022 respectively.\nFuture realization of the tax benefits of existing temporary differences and net operating loss carryforwards ultimately depends on the existence of sufficient taxable income within the carryforward period. As of June 30, 2023 and 2022, the Company performed an evaluation to determine whether a valuation allowance was needed. The Company considered all available evidence, both positive and negative, which included the results of operations for the current and preceding years. The Company also considered whether there was any currently available information about future years. The Company determined that it is more likely than not that the Company will have future taxable income. The Company used $2,506,514 of the federal net operating loss carryover during the year ended June 30, 2022.\nWe file federal and state income tax returns in jurisdictions with varying statutes of limitations. Income tax returns generally remain subject to examination by federal and most state tax authorities. We are not currently under examination in any federal or state jurisdiction.\nNote 14. Risks and Uncertainties\nThere is substantial uncertainty and different interpretations among federal, state and local regulatory agencies, legislators, academics and businesses as to the scope of operation of Farm Bill-compliant hemp programs relative to the emerging regulation of cannabinoids. These different opinions include, but are not limited to, the regulation of cannabinoids by the U.S. Drug Enforcement Administration, or DEA, and/or the FDA and the extent to which manufacturers of products containing Farm Bill-compliant cultivators and processors may engage in interstate commerce. The uncertainties cannot be resolved without further federal, and perhaps even state-level, legislation, regulation or a definitive judicial interpretation of existing legislation and rules. If these uncertainties continue, they may have an adverse effect upon the introduction of our products in different markets.\nIn December 2019, a novel strain of coronavirus (COVID-19) surfaced. The spread of COVID-19 around the world in the first quarter of 2020 has caused significant volatility in U.S. and international markets. There is significant uncertainty around the breadth and duration of business disruptions related to COVID-19, as well as its impact on the U.S. and international economies and, as such, the Company is unable to predict with certainty the potential impact of COVID-19 on its business, results of operations, financial condition and cash flows.\nNote 15. Significant Customers\nThe Company had significant customers during the year ended June 30, 2023. A significant customer is defined as one that makes up ten percent or more of total revenues in a particular year or ten percent of outstanding accounts receivable balance as of the year end. The Company had no significant customers during the year ended June 30, 2022.\nNet revenues for the year ended June 30, 2023, include revenues from significant customers in the product segment as follows:\nJune 30,\nCustomer A\n7.7 %\nCustomer B\n4.6 %\nCustomer C\n18.2 %\nAccounts receivable balances as of June 30, 2023, from significant customers are as follows:\nJune 30,\nCustomer A\n30 %\nCustomer B\n13 %\nNote 16. Discontinued Operations - Sale of Infusionz to Bloomios\nOn October 28, 2022, the Company determined that the best course of action related to Infusionz, LLC and certain manufacturing business was to accept an offer to sell those operations.\nThe Company received from Bloomios, Inc.(OTCQB:BLMS), the purchaser (i) $5,500,000 paid at closing; (ii) a convertible secured subordinated promissory note in the original principal amount of $5,000,000; (iii) 85,000 shares of Series D convertible preferred stock, with a total stated value of $8,500,000; (iv) a senior secured convertible debenture with a subscription amount of $4,500,000, after original issue discount of $779,117; and (v) a common stock purchase warrant to purchase up to 2,853,910 shares of Bloomioss common stock. The Company recorded the consideration received at the estimated value at the time of the transaction and as part of that estimate valued the additional warrants to purchase Bloomios shares of common stock at $8,500,000 and a valuation allowance of $8,500,000.\nThe assets transferred were recorded at their respective book values, the accrued and incurred expenses estimated by management were recorded and the consideration received was recorded at managements estimated fair value based on the balance sheet on October 26, 2022, the effective closing date.\nTangible assets, inventory / working capital*\n$ (1,344,000 )\nTangible assets, warehouse and manufacturing equipment, net of accumulated depreciation*\n(679,327 )\nGoodwill\n(2,413,814 )\nIntangible assets, net of accumulated amortization\n(946,996 )\nAccrued and incurred expenses related to the transaction and additional working capital*\n(2,051,500 )\nConsideration received, including cash, debt and equity, net\n15,000,000\nTotal gain recognized\n$ 7,564,363\n*During the continuing transition period, all of the inventory or working capital has not been transferred to the buyer.\nAt closing, the Company provided working capital, in the form of inventory, in excess of the working capital agreement and during the transition period, there are certain expenses and purchases incurred that are to be netted against funds collected on behalf of the buyer. June 30, 2023, there was a receivable balance from the buyer of 845,443, net of a reserve of $931,613.\nAdvance for payroll\n$ 50,000\nOperating expense\n652,891\nManagement fees\n685,600\nExcess working capital\n388,565\nAccrued Interest\n247,885\nSubtotal due from Bloomios\n$ 2,024,941\nReserve\n1,179,498\nTotal due from Bloomios\n$ 845,443\nFor several reasons, including but not limited to the non-payment per the terms of several agreements and the continuous delay in getting the business transitioned, the Company notified Bloomios of its termination of the transition agreement. Management accrued a reserve on the receivable balance of $1,179,498 leaving a receivable balance of $845,443 on June 30, 2023. Accrued interest and the gain from the original issue discount were reversed and the remaining balance was expensed to loss from discontinued operations.\nThese are recorded on the balance sheet as due from Bloomios.\nInvestments - Bloomios:\nSenior secured convertible debenture, net of unamortized original issue discount\n$ 5,218,209\nSeries D convertible preferred stock\n8,500,000\nConvertible Secured Subordinate Promissory Note\n5,000,000\nReserve on Investments - Bloomios\n(18,718,209 )\nTotal Investments - Bloomios\n$ -\nSenior Secured convertible debenture:\nThe Company received a senior secured convertible debenture of $4,500,000, net of the original issue discount. The Debentures have a maturity date of October 26, 2024, an interest rate of 10% and are convertible into shares of Bloomios common stock. The debenture contains customary representations, warranties and indemnification provisions. The Debentures are secured by a senior security interest in all assets of the Company and its subsidiaries.\nIn addition, the Company received a warrant to purchase shares of Bloomios common stock. The Company did not place any value on this warrant. Bloomios has agreed to use commercially reasonable efforts to complete a Qualified Offering within six months of October 26, 2022, to file a registration statement covering the resale of the warrant shares and the underlying shares convertible with the debenture.\nSeries D convertible preferred stock\n85,000 shares of Series D preferred stock. The preferred shares have a stated value per share of $100 and we are to receive dividends equal to 8.5% per year on a monthly basis, 30 days in arrears, for each month during which the Series D Preferred shares remain outstanding. The preferred stock shall not receive the declared dividends until the senior secured debentures are all repaid in full for all investors, including the debentures held by the Company.\nConvertible Secured Subordinate Promissory Note\nThe note has an interest rate of eight and one-half percent (8.5%) per annum and requires Bloomios to make a prepayment to the note in the amount equal to 40% of the net proceeds received by Bloomios in connection with any offering of securities conducted in connection with an up listing. Interest is due monthly and the note is convertible, at the Companys option, into shares of Bloomios common stock at a conversion price of $5.00 per share subject to adjustments. The full principal and interest is due on or before October 26, 2024.\nThe note is secured by a subordinated security interest in all assets of Infusionz pursuant to a certain pledge and security agreement, dated as of October 26, 2022, which security interest shall rank junior to all liens and security interests granted by Bloomios to the senior secured convertible note, which the Company is a holder of a portion of this security.\nSummary of discontinued operations:\nYear ended June 30,\nDiscontinued Operations\nRevenue\n$ 3,042,878\n$ 19,327,469\nCost of sales\n$ 1,803,643\n$ 10,743,028\nSales, general and administrative expenses\n$ 1,300,102\n$ 1,850,010\nDepreciation and amortization\n$ 10,576\n$ 726,195\nIncome (loss) from discontinued operations, net of tax\n$ (338,418 )\n$ 4,983,781\nAccounts receivable net of allowance for doubtful accounts\n$ -\n$ 941,465\nFixed assets, net of accumulated depreciation\n$ -\n$ 670,528\nTotal assets\n$ -\n$ 8,330,573\nTotal liabilities\n$ -\n$ 167,008\nNote 17. Assets Held for Sale\nOn August 31, 2023, the Company sold Interactive offers to Amplifyir Inc. The purchase price is $1,250,000 with a provision to adjust the final purchase price based on the business being transferred to Amplifyer Inc. with a net zero working capital. In addition, the Buyer is obligated to pay the Company two-and one-half percent (2.5%) of certain advertising revenues of Interactive for a two-year period post-closing. Accordingly, the results of the business were classified as discontinued operations in our statements of operations and excluded from both continuing operations and segment results for all periods presented.\nSummary of discontinued operations:\nYear ended June 30,\nDiscontinued Operations\nRevenue\n$ 1,442,279\n$ 2,192,183\nCost of sales\n$ 446,332\n$ 457,361\nSales, general and administrative expenses\n$ 2,118,480\n$ 2,442,019\nDepreciation and amortization\n$ 607,103\n$ 452,963\nIncome (loss) from discontinued operations\n$ (1,729,636 )\n$ (1,160,160 )\nAccounts receivable net of allowance for doubtful accounts\n$ 67,467\n$ 197,762\nFixed assets, net of accumulated depreciation\n$ 2,835\n$ 4,917\nTotal assets\n$ 1,026,043\n$ 2,460,411\nTotal liabilities\n$ -\n$ 816,321\nNote 18. Subsequent Events\nOn September 1, 2023 (the Closing Date), the Company exercised its option to acquire forty-five percent (45%) of the issued and outstanding equity of Cygnet Online, LLC (Cygnet) As a result of the foregoing the Company now owns one hundred percent (100%) of the issued and outstanding equity of Cygnet. In consideration for the September 1, 2023, acquisition the Company paid Hanig Five Hundred Thousand Dollars ($500,000) on the Closing Date, issued Ninety Thousand Nine Hundred and Nine (90,909) shares of the Companys common stock to Hanig, and agreed to pay Hanig Three Hundred Thousand Dollars ($300,000) on the one-year anniversary of the Closing Date.\nOn August 31, 2023, Upexi, Inc. (the Company) entered into an Equity Interest Purchase Agreement (EIPA) pursuant to which the Company sold one hundred percent (100%) of the issued and outstanding equity (the Interests) of its wholly owned subsidiary Interactive Offers, LLC (Interactive) to Amplifyir Inc. (the Buyer). The purchase price for the Interests was One Million Two Hundred Fifty Thousand Dollars ($1,250,000), subject to certain customary post-closing adjustments. In addition, the Buyer is obligated to pay the Company two-and one-half percent (2.5%) of certain advertising revenues of Interactive for a two-year period post-closing. Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone. Item 9A. Controls and Procedures\nManagements Report on Disclosure Controls and Procedures\nUnder the supervision and with the participation of our senior management, including our chief executive officer and chief financial officer, we conducted an evaluation of the effectiveness of the design and operation of our disclosure controls and procedures, as defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934, as amended (the Exchange Act), as of the end of the period covered by this Annual Report on Form 10-K (the Evaluation Date). Based on this evaluation, our chief executive officer and chief financial officer concluded as of the Evaluation Date that our disclosure controls and procedures were not effective such that the information relating to us required to be disclosed in our Securities and Exchange Commission (SEC) reports (i) is recorded, processed, summarized and reported within the time periods specified in SEC rules and forms, and (ii) is accumulated and communicated to our management, including our chief executive officer and chief financial officer, as appropriate to allow timely decisions regarding required disclosure.\nManagements Report on Internal Control Over Financial Reporting\nManagements Report on Disclosure Controls and Procedures\nUnder the supervision and with the participation of our senior management, including our chief executive officer and chief financial officer, we conducted an evaluation of the effectiveness of the design and operation of our disclosure controls and procedures, as defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934, as amended (the Exchange Act), as of the end of the period covered by this Annual Report on Form 10-K (the Evaluation Date). Based on this evaluation, our chief executive officer and chief financial officer concluded as of the Evaluation Date that our disclosure controls and procedures were effective such that the information relating to us required to be disclosed in our Securities and Exchange Commission (SEC or Commission) reports (i) is recorded, processed, summarized and reported within the time periods specified in SEC rules and forms, and (ii) is accumulated and communicated to our management, including our chief executive officer and chief financial officer, as appropriate to allow timely decisions regarding required disclosure.\nManagements Report on Disclosure Controls and Procedures\nManagement is responsible for establishing and maintaining adequate internal control over the Companys financial reporting. In order to evaluate the effectiveness of internal control over financial reporting, as required by Section 404 of the Sarbanes-Oxley Act of 2002. Our management, with the participation of our principal executive officer and principal financial officer have conducted an assessment, including testing, using the criteria in Internal Control - Integrated Framework, issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) (2013). Our system of internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. Because of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. This assessment included review of the documentation of controls, evaluation of the design effectiveness of controls, testing of the operating effectiveness of controls and a conclusion on this evaluation. Based on this evaluation, management concluded that our internal control over financial reporting were effective as of June 30, 2023.\nBecause of its inherent limitations, internal controls over financial reporting may not prevent or detect misstatements. Projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate. All internal control systems, no matter how well designed, have inherent limitations. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation.\nManagements Report on Internal Control Over Financial Reporting\nManagement is responsible for establishing and maintaining adequate internal control over the Companys financial reporting. In order to evaluate the effectiveness of internal control over financial reporting, as required by Section 404 of the Sarbanes-Oxley Act of 2002. Our management, with the participation of our principal executive officer and principal financial officer have conducted an assessment, including testing, using the criteria in Internal Control - Integrated Framework, issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) (2013). Our system of internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. Because of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. This assessment included review of the documentation of controls, evaluation of the design effectiveness of controls, testing of the operating effectiveness of controls and a conclusion on this evaluation. Based on this evaluation, management concluded that our internal control over financial reporting was not effective as of June 30, 2023. The ineffectiveness of the Companys internal control over financial reporting was due to the following material weaknesses, which are indicative of many small companies with small staff:\n(i)\ninadequate segregation of duties consistent with control objectives; and\n(ii)\nlack of multiple levels of supervision and review.\nWe are currently reviewing our disclosure controls and procedures related to these material weaknesses and expect to implement changes in the current fiscal year, including identifying specific areas within our governance, accounting and financial reporting processes to add adequate resources to potentially mitigate these material weaknesses.\nOur management will continue to monitor and evaluate the effectiveness of our internal controls and procedures and our internal controls over financial reporting on an ongoing basis and is committed to taking further action and implementing additional enhancements or improvements, as necessary and as funds allow.\nBecause of its inherent limitations, internal controls over financial reporting may not prevent or detect misstatements. Projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate. All internal control systems, no matter how well designed, have inherent limitations. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation.\nManagements Remediation Plan\nThe weaknesses and their related risks are not uncommon in a company of our size because of the limitations in the size and number of staff. Due to our size and nature, segregation of all conflicting duties has not always been possible and may not be economically feasible.\nHowever, we plan to take steps to enhance and improve the design of our internal control over financial reporting. During the period covered by this annual report on Form 10-K, we have not been able to remediate the material weaknesses identified above. To remediate such weaknesses, we plan to implement the following changes in the current fiscal year as resources allow:\n(i)\nAppoint additional qualified personnel to address inadequate segregation of duties and implement modifications to our financial controls to address such inadequacies and to implement additional levels in the review process and the implementation of the new ERP for all subsidiaries; and\n(ii)\nWe will attempt to implement the remediation efforts set out herein by the end of the 2024 fiscal year. Because of the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues, if any, within our company have been detected. These inherent limitations include the realities that judgments in decision-making can be faulty and that breakdowns can occur because of simple error or mistake.\nManagement believes that despite our material weaknesses set forth above, our financial statements for the year ended June 30, 2023 are fairly stated, in all material respects, in accordance with U.S. GAAP.\nChanges in Internal Control Over Financial Reporting\nThere have been no changes in our internal controls over financial reporting that occurred during the year ended June 30, 2023, that have materially or are reasonably likely to materially affect, our internal controls over financial reporting. The Company has added significant qualified resources to ensure proper segregation of duties and proper review of the financial reporting policies and procedures. Item 9B. Other Information\nNone.\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections.\nNone.\nPART III Item 10. Directors, Executive Officers and Corporate Governance\nAll directors of our company hold office until the next annual meeting of the security holders or until their successors have been elected and qualified. The officers of our company are appointed by our board of directors and hold office until their death, resignation or removal from office. Our directors and executive officers, their ages, positions held, and duration as such, are as follows:\nName\nPosition Held with the Company\nAge\nDate First Elected or Appointed\nAllan Marshall\nChief Executive Officer, Chairman of the Board\nMay 17, 2019\nAndrew Norstrud\nChief Financial Officer, Director\nApril 1, 2020\nGene Salkind\nDirector\nJanuary 1, 2021\nThomas C. Williams\nDirector\nJanuary 1, 2021\nLawrence H Dugan\nDirector\nJanuary 1, 2021\n____________\nBusiness Experience\nThe following is a brief account of the education and business experience during at least the past five years of each director, executive officer and key employee of our company, indicating the persons principal occupation during that period, and the name and principal business of the organization in which such occupation and employment were carried out.\nAllan Marshall, 56, Chief Executive Officer, Director. Mr. Marshall joined the Company as CEO in May of 2019 and was previously retired prior to joining the Company working as a serial entrepreneur with a focus on development stage companies in hyper growth industries, with the past several years focusing on the technology and cannabis industries. Mr. Marshall is often the driving force behind the organization for its initial growth and funding strategies. Mr. Marshall began his career in the transportation and logistics industry. Mr. Marshall founded Segmentz, Inc. in November of 2000 and served as the Chief Executive Officer, successfully acquiring five distinct logistic companies, raised more than $25,000,000 of capital, creating the infrastructure and business foundation that is now XPO Logistics, Inc. (NYSE: XPO) with revenues in excess of $17 billion. Prior to Segmentz, Mr. Marshall founded U.S. Transportation Services, Inc. (UST) in 1995, whose main focus was third party logistics. UST was sold to Professional Transportation Group, Inc. in January 2000 and Professional Transportation Group ceased business in November 2000. Prior to 1995, Mr. Marshall served as Vice President of U.S. Traffic Ltd, a Canadian company, where he founded their United States logistics division and had previously founded a successful driver leasing company in Toronto, Ontario, Canada.\nAndrew J. Norstrud, 50, Chief Financial Officer, Director. Mr. Norstrud joined Upexi, Inc. in July of 2019 as a consultant and became the Chief Financial Officer in April of 2020 and a Director as of January 2020. Prior to joining Upexi, Inc., Mr. Norstrud worked as a consultant through his own consulting firm. Mr. Norstrud served as the Chief Financial Officer for Gee Group Inc. from March 2013 until June 2018. Mr. Norstrud also served Gee Group as CEO from March 7, 2014 until April 1, 2015. Mr. Norstrud served as a director of GEE Group Inc. from March 7, 2014 until August 16, 2017. Prior to GEE Group Inc., Mr. Norstrud was a consultant with Norco Accounting and Consulting from October 2011 until March 2013. From October 2005 to October 2011, Mr. Norstrud served as the Chief Financial Officer for Jagged Peak. Prior to his role at Jagged Peak, Mr. Norstrud was the Chief Financial Officer of Segmentz, Inc. (XPO Logistics), and played an instrumental role in the company achieving its strategic goals by pursuing and attaining growth initiatives, building a financial team, completing and integrating strategic acquisitions and implementing the structure required of public companies. Previously, Mr. Norstrud worked for Grant Thornton LLP and PricewaterhouseCoopers LLP and has extensive experience with young, rapid growth public companies. Mr. Norstrud earned a BA in Business and Accounting from Western State College and a Master of Accounting with a systems emphasis from the University of Florida. Mr. Norstrud is a Florida licensed Certified Public Accountant.\nGene Salkind, 69, Director. Gene Salkind, M.D. has been a practicing neurosurgeon for more than 35 years outside of Philadelphia, PA. He graduated from the University of Pennsylvania in 1974 with a B.A., Cum Laude, and received his medical degree from the Lewis Katz School of Medicine in 1979. He returned to the University of Pennsylvania for his neurosurgical residency and in 1985 was selected as the Chief Resident in Neurosurgery at the Hospital of the University of Pennsylvania. Since that time, he has been in a university affiliated practice of general neurological surgery. He is currently the Chief of Neurosurgery at Holy Redeemer Hospital and has also been the Chief of Neurosurgery at Albert Einstein Medical Center and Jeanes Hospital in Philadelphia. He has authored numerous peer reviewed journal articles and has given lectures throughout the country on various neurosurgical topics. He has held professorships at the University of Pennsylvania, the Allegheny Health Education and Research Foundation, and currently at the Lewis Katz School of Medicine.\nDr. Salkind is a prominent investor in the pharmaceutical arena. Past investments include Intuitive Surgical, Pharmacyclics, which grew from less than $1 per share to subsequently being acquired by Abbvie for $250 per share, and Centocor, one of the nations largest biotechnology companies, which was acquired by Johnson & Johnson for $4.9 billion in stock. Dr. Salkind currently sits on the boards of Cure Pharmaceuticals, a leader in the biotechnology field through its continual pursuit of redefining traditional drug delivery, and Mobiquity Technologies, Inc., a digital engagement provider. Mobiquity owns and operates a national location based mobile advertising network. The companys suite of technologies allows clients to execute personalized and relevant experiences, driving brand awareness and incremental revenue. He was previously a board member of Derm Tech International, a global leader in non-invasive dermatological molecular diagnostics.\nDr. Salkind in 2019 joined the Strategic Advisory Board of Bio Symetrics, a company that has built data services tools for automated pre-processing, integrated analytics, and predictive modeling to make machine learning accessible to scientists and providers. Their technology serves health and hospital systems, biopharma, drug discovery and precision medicine. Dr. Salkind is and has been an employee and shareholder of Leonard A. Bruno MD/ Gene Salkind MD for the past five years. Dr. Salkind, a member of our audit committee, currently owns greater than ten percent (10%) of the outstanding voting securities of the Company.\nThomas Williams, 63, has over 35 years of experience in the insurance industry. He has served in multiple roles in both originations and the administration side of operations. Mr. Williams has a specialization in providing securitization mechanisms of illiquid insurance assets. Thomas was with Smith Barney for his training on the capital markets and insurance industries.\nMr. Williams is currently an officer and director in several Ireland based holding companies with a focus in the insurance industry. He is an acting member of the Risk Committee of Wyndham, a large Bermuda based captive. Additionally, he has formed three insurance operations: JTRM, GIH and Arculius. Their lines of business range from Directors and Officers Liability Coverage, Life Extension Risk and Workers Compensation. He has extensive experience in the Offshore and European Union insurance markets in both developing the structure and implementing corporate governance.\nMr. Williams was the intermediary in the sale of Associate Industries of Florida, one of the largest insurance companies in workers compensation. He facilitated the sale to Am Trust, a New York publicly traded company in 2009.\nMr. Williams has served on the board of directors of two public companies:\n·\nGEE Group, an American Stock Exchange Company from 2008 to 2018. At this company, he chaired the nominating committee and was a member of the Corporate Governance Committee and Audit Committee.\n·\nTwo Rivers Water and Farming from 2019 to 2020.\nMr. Williams completed a training program at Northwesterns Kellogg Business School for Corporate Governance in Public Companies in 2013.\nLawrence H Dugan, 56, Director. Mr. Dugan is a partner with the accounting firm Dorra & Dugan and has been since 1996. Mr. Dugan graduated from the University of Central Florida in 1989. Mr. Dugan is a Florida licensed Certified Public Accountant.\nFamily Relationships\nThere are no family relationships between any of our directors, executive officers and proposed directors or executive officers.\nInvolvement in Certain Legal Proceedings\nTo the best of our knowledge, none of our directors or executive officers has, during the past ten years:\n1.\nbeen convicted in a criminal proceeding or been subject to a pending criminal proceeding (excluding traffic violations and other minor offences);\n2.\nhad any bankruptcy petition filed by or against the business or property of the person, or of any partnership, corporation or business association of which he was a general partner or executive officer, either at the time of the bankruptcy filing or within two years prior to that time, other than the filings of voluntary petitions for relief under Chapter 11 (Chapter 11 Proceedings) of the U.S. Bankruptcy Code in the U.S. Bankruptcy Court for the District of Nevada by Steam Distribution, LLC, One Hit Wonder, Inc., Havz, LLC, d/b/a Steam Wholesale, and One Hit Wonder Holdings, LLC, of which Mr. Robert Hackett was an equity holder, managing member and/or officer;\n3.\nbeen subject to any order, judgment, or decree, not subsequently reversed, suspended or vacated, of any court of competent jurisdiction or federal or state authority, permanently or temporarily enjoining, barring, suspending or otherwise limiting, his involvement in any type of business, securities, futures, commodities, investment, banking, savings and loan, or insurance activities, or to be associated with persons engaged in any such activity;\n4.\nbeen found by a court of competent jurisdiction in a civil action or by the SEC or the Commodity Futures Trading Commission to have violated a federal or state securities or commodities law, and the judgment has not been reversed, suspended, or vacated;\n5.\nbeen the subject of, or a party to, any federal or state judicial or administrative order, judgment, decree, or finding, not subsequently reversed, suspended or vacated (not including any settlement of a civil proceeding among private litigants), relating to an alleged violation of any federal or state securities or commodities law or regulation, any law or regulation respecting financial institutions or insurance companies including, but not limited to, a temporary or permanent injunction, order of disgorgement or restitution, civil money penalty or temporary or permanent cease-and-desist order, or removal or prohibition order, or any law or regulation prohibiting mail or wire fraud or fraud in connection with any business entity; or\n6.\nbeen the subject of, or a party to, any sanction or order, not subsequently reversed, suspended or vacated, of any self-regulatory organization (as defined in Section 3(a)(26) of the Exchange Act (15 U.S.C. 78c(a)(26)), any registered entity (as defined in Section 1(a)(29) of the Commodity Exchange Act (7 U.S.C. 1(a)(29)), or any equivalent exchange, association, entity or organization that has disciplinary authority over its members or persons associated with a member.\nCode of Business Conduct and Ethics\nThe Company has adopted a Code of Business Conduct and Ethics which is filed as Exhibit 14.1 of Form S1 as filed with the SEC on May 21, 2021. We have adopted a Code of Business Conduct and Ethics applicable to all of our directors, officers, employees and all persons performing similar functions. A copy of that code is attached as Exhibit 14.1 to the Companys Registration Statement on Form S-1 filed with the SEC on May 21, 2021. We expect that any amendments to the code, or any waivers of its requirements, will be disclosed in our public filings with the Commission.\nTerm of Office of Directors\nOur directors are elected at each annual meeting of stockholders and serve until the next annual meeting of stockholders or until their successor has been duly elected and qualified, or until their earlier death, resignation or removal.\nAudit Committee and Financial Expert\nOn January 27, 2021, our Board established an audit committee that operates under a written charter as approved by our Board. The members of our audit committee are Dr. Gene Salkind, Mr. Thomas Williams, and Mr. Lawrence Dugan. Mr. Dugan serves as chairman of the audit committee and our Board has determined that he is an audit committee financial expert as defined by applicable SEC rules. The Board has determined that Dr. Salkind, Mr. Williams and Mr. Dugan are independent directors as that term is defined in Rule 5605(a)(2) of the Nasdaq Listing Rules, and has determined that Dr. Salkind, Mr. Williams and Mr. Dugan as audit committee members meet the more stringent requirements under Rule 5605(c)(2) of the Nasdaq Listing Rules.\nOur audit committee is responsible for: (1) the integrity of the Companys financial statements, (2) the effectiveness of the Companys internal control over financial reporting, (3) the Companys compliance with legal and regulatory requirements, (4) the independent registered public accounting firms qualifications and independence, (5) and the performance of the Companys independent registered public accountants and (6) preparation of the audit committee report as required to be included in the Companys annual proxy statement. The Audit Committee Charter is filed as Exhibit 10.8 to this form 10K.\nThe audit committee met five times during the years ended June 30, 2023 and 2024\nCompensation Committee\nOn January 27, 2021, our Board established a compensation committee that operates under a written charter as approved by our Board. The members of our compensation committee are Dr. Gene Salkind, Mr. Thomas Williams, and Mr. Lawrence Dugan. Dr. Salkind serves as chairman of the compensation committee.\nOur compensation committee is responsible for the oversight of, and the annual and ongoing review of, the Chief Executive Officer, the compensation of the senior management team, and the bonus programs in place for employees, which includes: (1) reviewing the performance of the Chief Executive Officer and other senior officers, and determining the bonus entitlement for such officer or officers on an annual basis, (2) determining and approving proposed annual compensation and incentive opportunity level of executive officers for each fiscal year, and recommending such compensation to the Board, (3) administration of determination of proposed grants of stock options to directors, employees, consultants and advisors with the Chief Executive Officer, (4) reviewing and recommending to the Board the compensation of the Board and committee members, (5) administering and approving any general benefit plans in place for employees , ( 6 ) engaging and setting the compensation for independent counsel and other advisors and consultants, ( 7 ) preparing any reports on director and officer compensation to be included in the Companys proxy statements , (8) assessing the Companys competitive positions for each component of officer compensation and making recommendations to the Board regarding such positions and (9) reviewing and assessing the adequacy of its charter and submitting any recommended changes to our Board for its consideration and approval. The Compensation Committee Charter is filed as Exhibit 10.9 hereto.\nThe compensation committee met three times during the year ended June 30, 2023 and twice during the year ended June 30, 2022.\nNomination and Governance Committee\nOn January 27, 2021, our Board established a nomination and governance committee that operates under a written charter as approved by our Board. The members of our nomination committee are Dr. Gene Salkind, Mr. Thomas Williams, and Mr. Lawrence Dugan. Mr. Williams serves as chairman of the nomination and governance committee.\nOur nomination and corporate governance committee is responsible for assisting the Board in (1) proposing a slate of qualified nominees for election to the Board by the shareholders or in the event of a Board vacancy, (2) evaluating the suitability of potential nominees for membership on the Board, (3) determining the composition of the Board and its committees, (4) monitoring a process to assess Board, committee and management effectiveness, (5) aiding and monitoring management succession planning and (6) developing, recommending to the Board, implementing and monitoring policies and processes related to the Companys corporate governance guidelines. The Nominating Committee Charter is filed as Exhibit 10.10 to the Companys Form S-1 as filed with the SEC on May 21, 2021.\nThe nomination committee met twice during the years ended June 30, 2023 and 2022.\nNominations to the Board of Directors\nWe do not have any defined policy or procedural requirements for shareholders to submit recommendations or nominations for directors. Our Board believes that, given the stage of our development, a specific nominating policy would be premature and of little assistance until our business operations develop to a more advanced level. We do not currently have any specific or minimum criteria for the election of nominees to the Board. The Board, with the help of its nomination and corporate governance committee, will assess all candidates, whether submitted by management or shareholders, and make recommendations for election or appointment.\nStockholder Communications\nWe do not have a formal policy regarding stockholder communications with our Board. A shareholder who wishes to communicate with our Board may do so by directing a written request addressed to our Chief Executive Officer, at the address appearing on the first page of this filing. Item 11. Executive Compensation\nThe particulars of the compensation paid to the following persons:\n(a)\nour principal executive officers;\nSUMMARY COMPENSATION TABLE\nName and Principal Position\nYear\nSalary\n($)\nBonus\n($)\nStock\nAwards\n($)\nOption\nAwards\n($)(3)\nNon-Equity Incentive\nPlan\nCompensation ($)\nNonqualified Deferred Compensation Earnings\n($)\nAll\nOther\nCompensation\n($)\nTotal\n($)\nAllan Marshall, CEO, and Director\n840,000\n341,068\n90,000\n1,271,068\n840,000\n1,096,000\n2,977,300\n90,000\n5,003,300\nAndrew Norstrud, Chief Financial Officer\n250,000\n150,000\n30,000\n430,000\n250,000\n200,000\n476,400\n30,000\n956,400\nAnthony Bazan, COO (2)\n294,800\n294,800\nRobert Hackett, President(1)\n125,000\n50,000\n175,000\n_____________\n(1)\nRobert Hackett resigned all positions with the Company on September 26, 2022.\n(2)\nAnthony Bazan resigned all positions with the Company on June 15, 2023.\nThere are no arrangements or plans in which we provide pension, retirement or similar benefits for directors or executive officers. Our directors and executive officers may receive share options at the discretion of our board of directors in the future. We do not have any material bonus or profit-sharing plans pursuant to which cash or non-cash compensation is or may be paid to our directors or executive officers, except that share options may be granted at the discretion of our board of directors. The value of the option awards is based on the intrinsic value at date of grant.\n(3)\nRepresents equity-based compensation expense calculated in accordance with the provisions of Accounting Standards Codification Section 718 - Compensation - Stock Compensation, using the Black-Scholes option pricing model as set forth in Notes to our consolidated financial statements in Item 13.\nEmployment Agreements\nOn March 15, 2021, the Company entered a new employment agreement that superseded all previous agreements with Allan Marshall, Chairman and Chief Executive Officer (the Marshall Employment Agreement). The Marshall Employment Agreement provides for a three-year term ending on March 15, 2025, unless employment is earlier terminated in accordance with the provisions thereof and after the initial term has a standard 1-year automatic extension clause if there is no notice by the Company of termination. Mr. Marshall received a starting base salary at the rate of $460,000 per year which can be adjusted by the Compensation Committee. In the previous contract Mr. Marshall was granted an option to purchase 1,111,112 shares of Common Stock at a price of $1.53 per share with 555,556 shares vesting immediately and 555,556 shares vesting ratably over a two-year period. The options are exercisable for 10 years and provide for cashless exercise. Mr. Marshall is entitled to receive an annual bonus based on criteria to be agreed to by Mr. Marshall and the Compensation Committee. The Marshall Employment Agreement contains standard termination, change of control, non-compete and confidentiality provisions.\nOn February 1, 2021, the Company entered an employment agreement with Andrew Norstrud, Chief Financial Officer (the Norstrud Employment Agreement). The Norstrud Employment Agreement provides for a three-year term ending on February 1, 2023, unless employment is earlier terminated in accordance with the provisions thereof and after the initial term has a standard 1-year automatic extension clause if there is no notice by the Company of termination. Mr. Norstrud received a starting base salary at the rate of $250,000 per year which can be adjusted by the Compensation Committee. Mr. Norstrud was granted an option to purchase 388,889 shares of Common Stock at a price of $1.53 per share vesting ratably over a two-year period. The options are exercisable for 10 years and provide for cashless exercise. Mr. Norstrud is entitled to receive an annual bonus based on criteria to be agreed to by Mr. Norstrud and the Chief Executive Officer and the Compensation Committee. The Norstrud Employment Agreement contains standard termination, change of control, non-compete and confidentiality provisions.\nOutstanding Equity Awards at Fiscal Year- End Table\nThe following table summarizes equity awards granted to Named Executive Officers and directors that were outstanding as of June 30, 2023:\nOption Awards\nStock Awards\nName\nNumber of Securities Underlying Unexercised Options:\n# Exercisable\nNumber of Securities Underlying Unexercised Options:\n# Unexercisable\nEquity Incentive Plan Awards:\nNumber of Securities Underlying Unearned and Unexercisable Options:\nOption Exercise Price\n$\nOption\nExpiration\nDate\n# of Shares or Units of Stock That Have Not Vested\n#\nMarket Value of Shares or Units of Stock That Have Not Vested\n$\nEquity Incentive Plan Awards:\nNumber of Unearned Shares, Units or Other Rights That Have Not Vested\n#\nEquity Incentive Plan Awards: Market of Payout Value of Unearned Shares, Units or Other Rights That Have Not Vested\n$\nAllan Marshall, CEO, and Director\n1,197,917\n52,083\n-\n$ 4.18\n7/21/2031\n-\n-\n-\n-\n833,333\n-\n-\n$ 1.53\n6/1/2029\n-\n-\n-\n-\nAndrew Norstrud, Chief\n191,667\n8,333\n-\n$ 4.18\n7/21/2031\n-\n-\n-\n-\nFinancial Officer and Director\n166,667\n-\n-\n$ 1.53\n2/1/2031\n-\n-\n-\n-\n388,889\n-\n-\n$ 1.53\n6/1/2029\n-\n-\n-\n-\nGene Salkind, Director\n25,000\n25,000\n-\n$ 3.87\n9/30/2027\n-\n-\n-\n-\n47,917\n2,083\n-\n$ 4.18\n7/21/2031\n-\n-\n-\n-\n27,778\n-\n-\n$ 1.53\n2/1/2031\n-\n-\n-\n-\nTomas C. Williams, Director\n25,000\n25,000\n-\n$ 3.87\n9/30/2027\n-\n-\n-\n-\n47,917\n2,083\n-\n$ 4.18\n7/21/2031\n-\n-\n-\n-\n27,778\n-\n-\n$ 1.53\n2/1/2031\n-\n-\n-\n-\nLawrence H Dugan, Director\n25,000\n25,000\n-\n$ 3.87\n9/30/2027\n-\n-\n-\n-\n47,917\n2,083\n-\n$ 4.18\n7/21/2031\n-\n-\n-\n-\n27,778\n-\n-\n$ 1.53\n2/1/2031\n-\n-\n-\n-\n____________\nDirectors Compensation\nOur directors also receive cash compensation of $5,000 per quarterly board meeting and receive $5,000 up to $7,000 per year for being a committee chair.\nPension, Retirement or Similar Benefit Plans\nThere are no arrangements or plans in which we provide pension, retirement or similar benefits for directors or executive officers. We have no material bonus or profit-sharing plans pursuant to which cash or non-cash compensation is or may be paid to our directors or executive officers, except that stock options may be granted at the discretion of the board of directors or a committee thereof.\nIndebtedness of Directors, Senior Officers, Executive Officers and Other Management\nNone of our directors or executive officers or any associate or affiliate of our company during the last two fiscal years, is or has been indebted to our company by way of guarantee, support agreement, letter of credit or other similar agreement or understanding currently outstanding. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nSECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT\nThe following table sets forth the ownership, as of September 27, 2023, of our Common Stock by each of our directors, by all of our executive officers and directors as a group and by each person known to us who is the beneficial owner of more than 5% of any class of our securities. As of September 27, 2023, there were 20,306,870 shares of our Common Stock issued and outstanding. All persons named have sole or shared voting and investment control with respect to the shares, except as otherwise noted. The number of shares described below includes shares which the beneficial owner described has the right to acquire within 60 days of the date of the prospectus. Unless otherwise indicated, the address for each beneficial owner is c/o Upexi, Inc., 3030 North Rocky Point Drive Suite 420, Tampa, Florida 33607.\nName and Address of Beneficial Owner\nAmount and Nature of Beneficial Ownership\nPercentage of\nClass(1)\nAllan Marshall\n5,052,389 (2)\n22.57 %\nGene Salkind\n2,554,330 (3)\n12.51 %\nAndrew Norstrud\n1,061,112 (4)\n5.04 %\nLawrence Dugan\n134,723 (5)\n*%\nThomas Williams\n106,945 (6)\n*%\nDirectors and Executive Officers as a Group\n8,909,498\n37.97 %\n__________\n*\nRepresents less than 1% of the number of shares of our Common Stock outstanding\n(1)\nUnder Rule 13d-3, a beneficial owner of a security includes any person who, directly or indirectly, through any contract, arrangement, understanding, relationship, or otherwise has or shares: (i) voting power, which includes the power to vote, or to direct the voting of shares; and (ii) investment power, which includes the power to dispose or direct the disposition of shares. Certain shares may be deemed to be beneficially owned by more than one person (if, for example, persons share the power to vote or the power to dispose of the shares). In addition, shares are deemed to be beneficially owned by a person if the person has the right to acquire the shares (for example, upon exercise of an option) within 60 days of the date as of which the information is provided. In computing the percentage ownership of any person, the amount of shares outstanding is deemed to include the number of shares beneficially owned by such person (and only such person) by reason of these acquisition rights. As a result, the percentage of outstanding shares of any person as shown in this table does not necessarily reflect the persons actual ownership or voting power with respect to the number of shares of Common Stock actually outstanding on September 27, 2023. As of September 27, 2023, there were 20,306,870 shares of our companys Common Stock issued and outstanding.\n(2)\nRepresents (i) 2,691,278 shares of Common Stock, (ii) 2,083,333 shares issuable upon the exercise of stock options that are exercisable within 60 days, (iii) 277,778 shares issuable upon the conversion of preferred stock.\n(3)\nRepresents (i) 2,447,385 shares of Common Stock and (ii) 106,945 shares issuable upon the exercise of stock option that are exercisable within 60 days. Does not include 20,833 shares issuable upon vesting and exercise of remaining stock option.\n(4)\nRepresents (i) 305,556 shares of Common Stock and (ii) 755,556 shares issuable upon the exercise of stock options that are exercisable within 60 days.\n(5)\nRepresents (i)27,778 shares of Common Stock and (ii) 106,945 shares issuable upon the exercise of stock option that are exercisable within 60 days. Does not include 20,833 shares issuable upon vesting and exercise of remaining stock option.\n(6)\nRepresents 106,945 shares issuable upon the exercise of stock option that are exercisable within 60 days. Does not include 20,833 shares issuable upon vesting and exercise of remaining stock option.\nSecurities Authorized for Issuance under Equity Compensation Plans\nThe Company has established a Company an incentive plan, 2019 Equity Incentive Plan as amended (the 2019 Plan). The plan grants incentives to select persons who can make, are making and continue to make substantial contributions to the growth and success of the Company, to attract and retain the employment and services of such persons and to encourage and reward such contributions by providing these individuals with an opportunity to acquire or increase stock ownership in the Company through either the grant of options or restructured stock. The 2019 Plan is administered by the Compensation Committee or such other committee as is appointed by the Board of Directors pursuant to the 2019 Plan (the Committee). The Committee has full authority to administer and interpret the provisions of the 2019 Plan including, but not limited to, the authority to make all determinations with regard to the terms and conditions of an award made under the 2019 Plan. On May 24, 2022, the Shareholders consented, and the Board of Directors approved the amendment of the 2019 Plan to increase the maximum number of Shares that may be issued thereunder by 4,444,445 Shares to 10,000,000 Shares.\nThe Board of Directors of the Company may from time to time, in its discretion grant to directors, officers, consultants and employees of the Company, non-transferable options to purchase common shares. The options are exercisable for a period of up to 10 years from the date of the grant.\nPlan category\nNumber of securities to be issued upon exercise of outstanding options, warrants and rights\nWeighted-average exercise price of outstanding options, warrants and rights\nNumber of securities\nremaining available for future issuance under equity compensation plans (excluding securities reflected in first column)\nEquity compensation plans approved by security holders\n4,839,278\n$ 3.31\n4,648,624\nTotal\n4,839,278\n$ 3.31\n4,648,624 Item 13. Certain Relationships and Related Transactions, and Director Independence\nExcept as disclosed herein, no director, executive officer, shareholder holding at least 5% of shares of our Common Stock, or any family member thereof, had any material interest, direct or indirect, in any transaction, or proposed transaction during the year ended June 30, 2023 and June 30, 2022, in which the amount involved in the transaction exceeded or exceeds the lesser of $120,000 or one percent of the average of our total assets at the year-end for the last three completed fiscal years.\nDirector Independence\nThe Board of Directors has determined that Gene Salkind, Lawrence Dugan and Thomas Williams are independent directors under the listing standards. Gene Salkind owns greater than ten percent (10%) of the voting securities of the Company. Item 14. Principal Accountant Fees and Services\nThe aggregate fees billed for the most recently completed fiscal year ended June 30, 2023, and 2022 for professional services rendered by the principal accountant for the audit of our annual financial statements and review of the financial statements and services that are normally provided by the accountant in connection with statutory and regulatory filings or engagements for these fiscal periods were as follows:\nYear Ended\nJune 30,\nJune 30,\nAudit Fees\n$ 188,000\n$ 160,000\nAudit Related Fees and Acquisition Audit Fees\n189,420\n137,800\nTax Fees\n136,600\n122,500\nAll Other Fees\nTotal\n$ 514,020\n$ 420,300\nOur Board of Directors pre-approves all services provided by our independent auditors. All of the above services and fees were reviewed and approved by the Board of Directors either before or after the respective services were rendered.\nOur Board of Directors has considered the nature and amount of fees billed by our independent auditors and believes that the provision of services for activities unrelated to the audit is compatible with maintaining our independent auditors independence.\nPART IV Item 15. Exhibits and Financial Statement Schedules.\n(a)\nFinancial Statements\n(1)\nFinancial statements for our company are listed in the index under Item 8 of this document.\n(2)\nAll financial statement schedules are omitted because they are not applicable, not material or the required information is shown in the financial statements or notes thereto.\n(b)\nExhibits\nExhibit Index\nFiled or\nIncorporation by Reference\nFurnished\nExhibit No.\nDescription\nForm\nFile No.\nExhibit\nFiling Date\nHerewith\n3.1(a)\nAmended and Restated Articles of Incorporation\nS-1\n333-255266\n3.1\n4/15/2021\n3.1(b)\nCertificate of Amendment to Articles of Incorporation\n8-K\n001-40535\n3.1\n8/17/2022\n3.2\nAmended Bylaws\nS-1\n333-255266\n3.2\n4/15/2021\n4.1\nSpecimen of Stock Certificate\nS-1\n333-255266\n4.6\n4/15/2021\n4.2\n2019 Convertible Note issued by Registrant in favor Jeff M. Bishop\nS-1\n333-255266\n4.1\n4/15/2021\n4.3\n2019 Convertible Note issued by Registrant in favor Kyle Dennis\nS-1\n333-255266\n4.2\n4/15/2021\n4.4\n2019 Convertible Note issued by Registrant in favor Jason Bond\nS-1\n333-255266\n4.3\n4/15/2021\n4.5\nPromissory Note, Paycheck Protection Program, dated April 28, 2020, issued by Registrant in favor of Bank of the West\nS-1\n333-255266\n4.4\n4/15/2021\n4.6\nLoan Authorization and Agreement, dated May 30, 2020, by and between Registrant and the U.S. Small Business Administration\nS-1\n333-255266\n4.5\n4/15/2021\n4.7\nPromissory Note, Paycheck Protection Program, dated May 13, 2020, issued by Infusionz LLC in favor of Newtek Small Business Finance, LLC\nS-1\n333-255266\n4.7\n4/15/2021\n4.8\nForm of Representative's Warrant Agreement\nS-1\n333-255266\n4.8\n4/15/2021\n4.9\nForm of 2021 Convertible Promissory Note\nS-1\n333-255266\n4.9\n4/15/2021\n4.10\nForm of Senior Secured Convertible Note\n8-K\n001-40535\n10.2\n7/1/2022\n4.11\nForm of Common Stock Purchase Warrant by and between the Registrant and certain of its investors.\n8-K\n001-40535\n10.3\n7/1/2022\n4.12\nNote Conversion Agreement dated June 29, 2021\n8-K\n011-40535\n10.1\n7/2/2021\n4.13\nRegistration Rights Agreement dated June 28, 2022\n8-K\n001-40535\n10.5\n7/1/2022\n10.1\nUpexi, Inc. 2019 Incentive Stock Plan (Amended and Restated as of February 8, 2021)\nS-1\n333-255266\n10.1\n4/15/2021\n10.2\nForm of Nonqualified Stock Option Agreement\nS-1\n333-255266\n10.2\n4/15/2021\n10.3\nAgreement and Plan of Merger Infusionz LLC\nS-1\n333-255266\n2.1\n4/15/2021\n10.4\nSecurities Purchase Agreement, dated as of February 2, 2021, by and between the Registrant and Allan Marshall\nS-1\n333-255266\n10.4\n10.5\nSecurities Purchase Agreement, dated June 28, 2022, by and among the Registrant and certain of its investors.\n8-K\n001-40535\n10.1\n7/1/2022\n10.6\nPromissory Note dated June 28, 2022, by and between Registrant and Allan Marshall\n8-K\n001-40535\n10.4\n7/1/2022\n10.7\nEquity Interest Purchase Agreement, dated October 19, 2021, by and among Grove, Inc., Gyprock Holdings LLC, MFA Holdings Corp. and Sherwood Ventures, LLC.\n8-K\n001-40535\n2.1\n10/21/2021\n10.8\nAsset Purchase Agreement, dated August 1, 2021, by and among Registrant, Grove Acquisition Subsidiary, Inc., VitaMedica Corporation, David Rahm and Yvette La-Garde.\n8-K\n001-40535\n2.1\n8/6/2021\n10.9+\nEmployment Agreement, dated February 1, 2021, between Registrant and Andrew J. Norstrud\nS-1\n333-255266\n10.5\n4/15/2021\n10.10+\nEmployment Agreement, dated March 15, 2021, between Registrant and Allan Marshall\nS-1\n333-255266\n10.6\n4/15/2021\n10.11+\nExecutive Employment Agreement dated May 3, 2021 between the Company and Robert Hackett\nS-1\n333-255266\n10.7\n4/15/2021\n10.12\nSecurities Purchase Agreement, effective April 1, 2022, by and among Registrant, Eric Hanig and Cygnet Online, LLC.\n10-K\n333-255266\n10.12\n9/28/2022\n10.13\nAsset Purchase Agreement, dated August 12, 2022, by and among Upexi Pet Products and GA Solutions, LLC\n10-K\n333-255266\n10.13\n9/28/2022\n10.14\nLoan Agreement, dated October 19, 2022, between Registrant and its indirect wholly owned subsidiary Upexi 17129 Florida, LLC, and Professional Bank.\nx\n10.15\nPromissory Note (entered into in connection with October 19 Loan Agreement)\nx\n10.16\nSecurities Purchase Agreement, dated October 31, 2022, between Registrant and its wholly owned subsidiary Upexi Enterprise, LLC, and E-Core Technology, Inc. d/b/a New England Technology, Inc, and David Romano\n10-Q\n001-40535\n10.1\n2/15/2023\n10.17\nForm of Note A dated February 22, 2023\n8-K\n001-40535\n10.1\n2/24/2023\n10.18\nForm of Note B dated February 22, 2023\n8-K\n001-40535\n10.1\n2/24/2023\n10.19\nForm of Securities Purchase Agreement, dated May 11, 2023, between Registrant and certain accredited investors\n8-K\n001-40535\n10.1\n5/15/2023\n10.20\nForm of Placement Agency Agreement, dated May 11, 2023, between Registrant and A.G.P./Alliance Global Partners and Paulson Investment Company, LLC\n8-K\n001-40535\n1.1\n5/15/2023\n10.21\nForm of Placement Agent Warrants (issued in connection with the May 11 Placement Agency Agreement)\n8-K\n001-40535\n4.1\n5/15/2023\n10.22\nEquity Interest Purchase Agreement, dated August 31, 2023, between Registrant and Amplifyir Inc.\n8-K\n001-40535\n9/6/2023\n10.23\nExercise of Option to Acquire Cygnet Online, LLC, dated September 1, 2023, between Registrant and Eric Hanig\nx\n10.24\nGrove Inc. 2019 Amended and Restated Stock Incentive Plan, effective May 24, 2022\nS-8\n333-273859\n4.7\n8/9/2023\n10.25\nAudit Committee Charter\nx\n10.26\nCompensation Committee Charter\nx\n10.27\nNominating Committee Charter\nx\n14.1\nCode of Business Conduct and Ethics\nx\n14.2\nWhistleblower Policy\nx\n21.1\nList of Subsidiaries of Registrant\nx\n31.1\nCertification of Chief Executive Officer pursuant to Exchange Act Rule 13a-14a and 15d-14a, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\nx\n31.2\nCertification of Chief Financial Officer pursuant to Exchange Act Rules 13a-14a and 15d-14a, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\nx\n32.1\nCertification of Chief Executive Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.*\nx\n32.2\nCertification of Chief Financial Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.*\nx\n101.INS\nInline XBRL Instance Document (the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document).\nx\n101.SCH\nInline XBRL Taxonomy Extension Schema Document\nx\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document\nx\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document\nx\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document\nx\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document\nx\nCover Page Interactive Data File (formatted as inline XBRL with applicable taxonomy extension information contained in Exhibits 101)\nx\n_______\n* These exhibits are furnished with this Annual Report on Form 10-K and are not deemed filed with the Securities and Exchange Commission and are not incorporated by reference in any filing of Upexi, Inc. under the Securities Act of 1933, as amended, or the Securities Exchange Act of 1934, as amended, whether made before or after the date hereof and irrespective of any general incorporation language contained in such filings.\n+ Indicates a management contract or compensatory plan or arrangement.\nItem 16. Form 10-K Summary.\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, there unto duly authorized.\nUPEXI INC.\n(Registrant)\nDated: October 2, 2023\n/s/ Allan Marshall\nAllan Marshall\nPresident, Chief Executive Officer and Director\n(Principal Executive Officer)\nDated: October 2, 2023\n/s/ Andrew J. Norstrud\nAndrew J. Norstrud\nChief Financial Officer\n(Principal Financial Officer and Principal Accounting Officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nDated: October 2, 2023\n/s/ Allan Marshall\nAllan Marshall\nPresident, Chief Executive Officer and Director\n(Principal Executive Officer)\nDated: October 2, 2023\n/s/ Andrew J. Norstrud\nAndrew J. Norstrud\nChief Financial Officer\n(Principal Financial Officer and Principal Accounting Officer)\nDated: October 2, 2023\n/s/ Gene Salkind\nGene Salkind\nDirector\nDated: October 2, 2023\n/s/ Thomas C. Williams\nThomas C. Williams\nDirector\nDated: October 2, 2023\n/s/ Laurence H. Dugan\nLaurence H. Dugan\nDirector"
}