{
    "cik": "1787412",
    "company": "WB Burgers Asia, Inc.",
    "filing_type": "10-K",
    "filing_date": "2023-12-29",
    "period_of_report": "2023-07-31",
    "sic": "5812",
    "state_of_inc": "NV",
    "state_location": "M0",
    "fiscal_year_end": "0731",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1787412/0001599916-23-000295-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1787412/000159991623000295/wbba10k_23f.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1787412/0001599916-23-000295.txt",
    "filename": "1787412_10K_2023_0001599916-23-000295.htm",
    "content": "Item 1. Business\nCorporate History\nWe were originally incorporated in the state of Nevada on August 30, 2019, under the name Business Solutions Plus, Inc.\nOn August 30, 2019, Paul Moody was appointed Chief Executive Officer, Chief Financial Officer, President, Secretary, Treasurer, and Director.\nOn February 9, 2021, the Company filed, with the Secretary of State of Nevada (NSOS), Restated Articles of Incorporation.\nOn March 4, 2021, Business Solutions Plus, Inc., (the Company or Successor) announced on Form 8-K plans to participate in a holding company reorganization (the Reorganization or Merger) with InterActive Leisure Systems, Inc. (IALS or Predecessor), the Company and Business Solutions Merger Sub, Inc. (Merger Sub), collectively (the Constituent Corporations) pursuant to NRS 92A.180, NRS A.200, NRS 92A.230 and NRS 92A.250.\nImmediately prior to the Reorganization, the Company was a direct and wholly owned subsidiary of Interactive Leisure Systems, Inc. and Business Solutions Merger Sub, Inc. was a direct and wholly owned subsidiary of the Company.\nAs disclosed in our 8-K filed on March 26, 2021, the above-mentioned Reorganization was legally effective as of March 31, 2021.\nEach share of Predecessors common stock issued and outstanding immediately prior to the Effective Time was converted into one validly issued, fully paid and non-assessable share of Successor common stock. The control shareholder, (at the time) of the Predecessor, Flint Consulting Services, LLC, (Flint) a Wyoming limited liability company became the same control shareholder of the Successor. Jeffrey DeNunzio, as sole member of Flint was deemed to be the indirect and beneficial holder of 405,516,868 shares of Common Stock and 1,000,000 shares of Series A Preferred Stock of the Company representing, at the time, approximately 93.70% voting control of the Company. Paul Moody, (our now former sole officer/director), was the same officer/director of the Predecessor. There was no other shareholder(s) or any officer/director holding at least 5% of the outstanding voting shares of the Company.\nImmediately prior to the Effective Time, and under the respective articles of incorporation of Predecessor and Successor, the Successor Capital Stock had the same designations, rights, and powers and preferences, and the qualifications, limitations, and restrictions thereof, as the Predecessor Capital Stock which was automatically converted pursuant to the reorganization.\nImmediately prior to the Effective Time, the articles of incorporation and bylaws of Successor, as the holding company, contain provisions identical to the Articles of Incorporation and Bylaws of Predecessor immediately prior to the merger, other than as permitted by NRS 92A.200.\nImmediately prior to the Effective Time, the articles of incorporation of Predecessor stated that any act or transaction by or involving the Predecessor, other than the election or removal of directors of the Predecessor, that requires for its adoption under the NRS or the Articles of Incorporation of Predecessor the approval of the stockholders of the Predecessor, shall require in addition the approval of the stockholders of Successor (or any successor thereto by merger), by the same vote as is required by the articles of Incorporation and/or the bylaws of the Predecessor.\nImmediately prior to the Effective Time, the articles of incorporation and bylaws of Successor and Merger Sub were identical to the articles of incorporation and bylaws of Predecessor immediately prior to the merger, other than as permitted by NRS 92A.200;\nThe Boards of Directors of Predecessor, Successor, and Merger Sub approved the Reorganization, shareholder approval not being required pursuant to NRS 92A.180;\nThe Reorganization constituted a tax-free organization pursuant to Section 368(a)(1) of the Internal Revenue Code;\nSuccessor common stock traded in the OTC Markets under the Predecessor ticker symbol IALS under which the common stock of Predecessor previously listed and traded until the new ticker symbol BSPI was announced April 14, 2021, on the Financial Industry Regulatory Authoritys daily list with a market effective date of April 15, 2021. The CUSIP Number 45841W107 for IALSs common stock was suspended upon market effectiveness. The Company received a new CUSIP Number 12330M107.\nAfter completion of the Holding Company Reorganization, the Company cancelled all of its stock held in Predecessor resulting in the Company as a stand-alone and separate entity with no subsidiaries, no assets and negligible liabilities. The Company abandoned the business plan of its Predecessor and resumed its former business plan of a blank check company after completion of the Merger.\nOn May 4, 2021, Business Solutions Plus, Inc., a Nevada Corporation (the Company), entered into a Share Purchase Agreement (the Agreement) by and among Flint Consulting Services, LLC, a Wyoming Limited Liability Company (FLINT), and White Knight Co., Ltd., a Japan Company (WKC), pursuant to which, on May 7, 2021, (Closing Date), FLINT sold 405,516,868 shares of the Companys Restricted Common Stock and 1,000,000 Shares of Series A Preferred Stock, representing, at the time, approximately 93.70% voting control of the Company. The consummation of the transactions contemplated by the Agreement resulted in a change in control of the Company, with WKC becoming the Companys largest controlling stockholder.\nThe sole shareholder of White Knight Co., Ltd., a Japanese Company, is Koichi Ishizuka.\nOn May 7, 2021, Mr. Paul Moody resigned as the Companys Chief Executive Officer, Chief Financial Officer, President, Secretary, Treasurer, and Director.\nOn May 7, 2021, Mr. Koichi Ishizuka was appointed as the Companys Chief Executive Officer, Chief Financial Officer, President, Secretary, Treasurer, and Director.\n- 4 -\nA Certificate of Amendment to change our name, from Business Solutions Plus, Inc., to WB Burgers Asia, Inc. was filed with the Nevada Secretary of State on June 18, 2021, with a legal effective date of July 2, 2021. The name change to WB Burgers Asia, Inc., as well as a change of our ticker symbol from BSPI to WBBA, was announced by FINRA, via their daily list, on July 7, 2021, with a market effective date of both on July 8, 2021. The new CUSIP number associated with our common stock, as of the market effective date of July 8, 2021, is 94684P100.\nOn July 1, 2021, we filed an amendment to our Articles of Incorporation with the Nevada Secretary of State, resulting in an increase to our authorized shares of common stock from 500,000,000 to 1,500,000,000.\nSubsequent to the above action, on or about July 1, 2021, we sold 9,090,909 shares of restricted common stock to SJ Capital Co., Ltd., a Japanese Company, at a price of $0.20 per share of common stock. The total subscription amount paid by SJ Capital Co., Ltd. was approximately $1,818,181.80 or approximately 200,000,000 Japanese Yen.\nSJ Capital Co., Ltd., is owned and controlled by Senju Pharmaceutical Co., Ltd., a Japanese Company.\nMr. Takeshi Sugisawa, the President of SJ Capital Co., Ltd., authorized the above transaction on behalf of SJ Capital Co., Ltd. Both SJ Capital Co., Ltd., and Senju Pharmaceutical Co., Ltd. are considered non-related parties to the Company.\nThe proceeds from the above sale of shares went to the Company to be used for working capital.\nOn August 24, 2021, we sold 1,363,636 shares of restricted common stock to Yasuhiko Miyazaki, a Japanese Citizen, at a price of $0.20 per share of common stock. The total subscription amount paid by Yasuhiko Miyazaki was approximately $272,727 or approximately 30,000,000 Japanese Yen. Mr. Yasuhiko Miyazaki is not a related party to the Company. The proceeds from the above sale of shares went to the Company to be used for working capital.\nIn regards to all of the above transactions, the Company claims an exemption from registration afforded by Section Regulation S of the Securities Act of 1933, as amended (\"Regulation S\") for the above sales/issuances of the stock since the sales/issuances of the stock were made to non-U.S. persons (as defined under Rule 902 section (k)(2)(i) of Regulation S), pursuant to offshore transactions, and no directed selling efforts were made in the United States by the issuer, a distributor, any of their respective affiliates, or any person acting on behalf of any of the foregoing.\nOn August 30, 2021, our largest controlling shareholder, White Knight Co., Ltd., a Japanese Company, owned and controlled by our sole officer and director, Koichi Ishizuka, sold a total of 353,181,818 shares of restricted common stock of the Company to the following parties in the respective quantities:\nName of Purchaser Common Shares Purchased Price Paid Per Share Total Amount Paid ($)\nKoichi Ishizuka 101,363,636 $0.0001 10,136.00\nRei Ishizuka 1 50,000,000 $0.0001 5,000.00\nKiyoshi Noda 100,909,091 $0.0001 10,091.00\nYuma Muranushi 100,909,091 $0.0001 10,091.00\n1 Rei Ishizuka is the wife of our sole officer and director, Mr. Koichi Ishizuka.\nIn regards to all of the above transactions White Knight Co., Ltd. claims an exemption from registration afforded by Section Regulation S of the Securities Act of 1933, as amended (\"Regulation S\") for the above sales of the stock since the sales of the stock were made to non-U.S. persons (as defined under Rule 902 section (k)(2)(i) of Regulation S), pursuant to offshore transactions, and no directed selling efforts were made in the United States by the issuer, a distributor, any of their respective affiliates, or any person acting on behalf of any of the foregoing.\nOn September 14, 2021, we entered into an Acquisition Agreement with White Knight Co., Ltd., a Japan Company, whereas we issued 500,000,000 shares of restricted common stock to White Knight Co., Ltd., in exchange for 100% of the equity interests of WB Burgers Japan Co., Ltd., a Japan Company. Following this transaction, WB Burgers Japan Co., Ltd. became our wholly owned subsidiary which we now operate through.\nIn regards to the above transaction, the Company claims an exemption from registration afforded by Section Regulation S of the Securities Act of 1933, as amended (\"Regulation S\") for the above sales/issuances of the stock since the sales/issuances of the stock were made to non-U.S. persons (as defined under Rule 902 section (k)(2)(i) of Regulation S), pursuant to offshore transactions, and no directed selling efforts were made in the United States by the issuer, a distributor, any of their respective affiliates, or any person acting on behalf of any of the foregoing.\n- 5 -\nThe aforementioned Acquisition Agreement is attached as Exhibit 10.1 to our Form 8-K filed with the Securities and Exchange Commission on September 14, 2021. All references to the Acquisition Agreement are qualified, in their entirety, by the text of such exhibit.\nWhite Knight Co., Ltd., is owned entirely by our sole officer and director, Koichi Ishizuka. White Knight Co., Ltd. is our largest controlling shareholder.\nWB Burgers Japan Co., Ltd., referred to herein as WBJ or WBBJ, which we operate through and share the same business plan of, holds the rights to the Master Franchise Agreement with Jakes Franchising LLC, a Delaware Limited Liability Company, as it pertains to the establishment and operation of Wayback Burger Restaurants within the country of Japan.\nThe Master Franchise Agreement provides WBJ the right to establish and operate Wayback Burgers restaurants in the country of Japan, and also license affiliated and unaffiliated third parties (Franchisees) to establish and operate Wayback Burgers restaurants in the Country of Japan. The Master Franchise Agreement, amongst other things, also provides WBJ the right of first refusal to enter into a subsequent Master Franchise Agreement with Jakes Franchising, LLC to establish and operate Wayback Burgers restaurants in the Countries of Indonesia, Malaysia (Eastern Malaysia only, Western Malaysia if it becomes available as it is currently licensed to another party), the Philippines, Vietnam, China, India, Korea, Thailand, Singapore, and Taiwan.\nWB Burgers Japan Co., Ltd. seeks to make Wayback Burgers a nationally recognized brand, if not a household name, within the country of Japan through the promotion and opening of various Wayback Burgers Restaurants.\nFollowing the acquisition of our wholly owned subsidiary, WB Burgers Japan Co., Ltd., on September 14, 2021, we ceased to be a shell company. Immediately upon our acquisition of WB Burgers Japan Co., Ltd. we adopted the same business plan as WB Burgers Japan Co., Ltd.\nOn October 22, 2021, we sold 2,252,252 shares of restricted common stock to Shokafulin LLP, a Japan Company, which is controlled by Takuya Watanabe, a Japanese Citizen, at a price of $0.20 per share of common stock. The total subscription amount paid by Shokafulin LLP was approximately $450,450 or approximately 50,000,000 Japanese Yen. Shokafulin LLP and Mr. Watanabe are not related parties to the Company. The proceeds from the above sale of shares went to the Company to be used for working capital.\nThe aforementioned sale of shares was conducted pursuant to Regulation S of the Securities Act of 1933, as amended (\"Regulation S\"). The sale of shares was made only to non-U.S. persons (as defined under Rule 902 section (k)(2)(i) of Regulation S), pursuant to offshore transactions, and no directed selling efforts were made in the United States by the issuer, a distributor, any of their respective affiliates, or any person acting on behalf of any of the foregoing.\nOn November 6, 2021, our largest controlling shareholder, White Knight Co., Ltd., a Japanese Company, owned and controlled by our sole officer and director, Koichi Ishizuka, sold a total of 14,347,826 shares of restricted common stock to the following parties in the respective quantities:\nName of Purchaser Common Shares Purchased Price Paid Per Share ($) Total Approximate Amount Paid ($)\nM&A Company 1 1,304,348 0.20 260,870\nMichinari Yamamoto 1,304,348 0.20 260,870\nAtsushi Morikawa 1,304,348 0.20 260,870\nMotoki Hirai 1,304,348 0.20 260,870\nTomonori Yoshinaga 1,739,130 0.20 347,826\nGo Watanabe 3,043,478 0.20 608,696\nOkakichi Co., Ltd 2 4,347,826 0.20 869,565\nTotal 14,347,826 0.20 2,869,567\n1 The authorized party of M&A Company, a Japan entity, is Akihiro Ando.\n2 The authorized party of Okakichi Co., Ltd, a Japan entity, is Shigeru Okada.\nIn regards to all of the above transactions White Knight Co., Ltd. claims an exemption from registration afforded by Section Regulation S of the Securities Act of 1933, as amended (\"Regulation S\") for the above sales of the stock since the sales of the stock were made to non-U.S. persons (as defined under Rule 902 section (k)(2)(i) of Regulation S), pursuant to offshore transactions, and no directed selling efforts were made in the United States by the issuer, a distributor, any of their respective affiliates, or any person acting on behalf of any of the foregoing.\nOn November 9, 2021, our wholly owned subsidiary, WB Burgers Japan Co., Ltd., consummated a lease agreement with Arai Co., Ltd., a Japanese realty group, for the location of our first Wayback Burgers restaurant. The property is located in the popular shopping plaza of Omotesando, located in the Tokyo prefecture.\nOn December 27, 2021, we sold 1,315,789 shares of restricted Common Stock to Takahiro Fujiwara, Japanese Citizen, at a price of $0.20 per share of Common Stock. The total subscription amount paid by Takahiro Fujiwara was approximately $263,158. Takahiro Fujiwara is not a related party to the Company.\nThe aforementioned sale of shares was conducted pursuant to Regulation S of the Securities Act of 1933, as amended (\"Regulation S\"). The sale of shares was made only to non-U.S. persons (as defined under Rule 902 section (k)(2)(i) of Regulation S), pursuant to offshore transactions, and no directed selling efforts were made in the United States by the issuer, a distributor, any of their respective affiliates, or any person acting on behalf of any of the foregoing.\nOn or about February 8, 2022, we incorporated Store Foods Co., Ltd., a Japan Company. Store Foods Co., Ltd. is a wholly owned subsidiary of the Company. Currently, Koichi Ishizuka is the sole officer and director of Store Foods Co., Ltd.\nTo date, Store Foods Co., Ltd. has yet to commence material operations. While our future plans for Store Foods Co., Ltd. are not definitive and may change, our intended business purpose for this company are as follows:\n1. Food sales;\n2. Food wholesale and retail;\n3. Chain organizations consisting of food retailers as members;\n4. Restaurants;\n5. Manufacturing and sales of boxed lunches for catering;\n6. Alcohol sales;\n7. Health supplement and health drink sales;\n8. Manufacturing and sales of functional foods;\n9. Lease of goods related to restaurant management;\n10. System development;\n11. Delivery;\n12. Application development and sales;\n13. Advertising;\n14. Management consulting;\n15. All businesses incidental to any of the above.\n- 6 -\nOn March 11, 2022 we opened our first flagship Wayback Burgers location to the public in the Omotesando shopping plaza. At this location, we offer an array of quick bites, including but not limited to traditional hamburgers, fries, shakes, and other alternatives.\nOn March 29, 2022, 869,565 shares of restricted Common Stock were sold to Hidemi Arasaki, Japanese Citizen, by our controlling shareholder, White Knight Co., Ltd., at a price of $0.20 per share of Common Stock. This was a private sale, not a sale made by the Company. The total amount paid by Hidemi Arasaki was approximately $173,913. Hidemi Arasaki is not a related party to the Company.\nThe aforementioned sale of shares was conducted pursuant to Regulation S of the Securities Act of 1933, as amended (\"Regulation S\"). The sale of shares was made only to non-U.S. persons (as defined under Rule 902 section (k)(2)(i) of Regulation S), pursuant to offshore transactions, and no directed selling efforts were made in the United States by the issuer, a distributor, any of their respective affiliates, or any person acting on behalf of any of the foregoing.\nOn May 20, 2022, we dismissed our independent registered public accounting firm, BF Borgers CPA PC (BFG) effective immediately. This decision was approved by the Companys Board of Directors, comprised solely of Koichi Ishizuka.\nOn May 20, 2022, we engaged M&K CPAS, PLLC (M&K) as our new independent registered public accounting firm. This decision was approved by the Companys Board of Directors, comprised solely of Koichi Ishizuka.\nOn August 8, 2022, we sold 1,586,538 shares of restricted Common Stock to Takahiro Fujiwara, a Japanese Citizen, at a price of $0.032 per share of Common Stock. The total subscription amount paid by Takahiro Fujiwara was approximately $50,769. Takahiro Fujiwara is not a related party to the Company.\nOn August 8, 2022, we sold 2,403,846 shares of restricted Common Stock to Shokafulin LLP, a Japanese Company, at a price of $0.032 per share of Common Stock. The total subscription amount paid by Shokafulin LLP was approximately $76,923. Shokafulin LLP is not a related party to the Company.\nOn August 12, 2022, we sold 32,065,458 shares of restricted Common Stock to Asset Acceleration Axis, LLC, a Japanese Company, at a price of $0.034 per share of Common Stock. The total subscription amount paid by Asset Acceleration Axis, LLC was approximately $1,090,226. Asset Acceleration Axis, LLC is not a related party to the Company.\nThe proceeds from these sales went to the Company to be used as working capital.\nThe aforementioned sale of shares was conducted pursuant to Regulation S of the Securities Act of 1933, as amended (\"Regulation S\"). The sale of shares was made only to non-U.S. persons (as defined under Rule 902 section (k)(2)(i) of Regulation S), pursuant to offshore transactions, and no directed selling efforts were made in the United States by the issuer, a distributor, any of their respective affiliates, or any person acting on behalf of any of the foregoing.\nIn August of 2022, we, through our wholly owned subsidiary, WB Burgers Japan Co., Ltd., entered into and consummated a rental agreement with Kitchen Depot for a ghost kitchen in the Tamachi neighborhood of Minato, Tokyo, Japan. From this location the Company had offered food delivery of Wayback Burgers menu items, such as those offered at the Companys physical dine in restaurant location in the Omotesando shopping plaza, located in Tokyo, Japan.\nFollowing notice provided to Kitchen Depot in September of 2023, in November of 2023, the Company terminated its rental agreement with Kitchen Depot, as well as its operations at its ghost kitchen in the Tamachi neighborhood of Minato, Tokyo, Japan. The Company has no plans to resume operations at this location at any juncture, as it believes this location is unlikely to be profitable, considering the low volume of orders it received while this location was operational.\nOn September 13, 2022, we sold 7,262,324 shares of restricted Common Stock to Asset Acceleration Axis, LLC, a Japanese Company, at a price of $0.032 per share of Common Stock. The total subscription amount paid by Asset Acceleration Axis, LLC was approximately $232,395. Asset Acceleration Axis, LLC is not a related party to the Company.\nThe proceeds from these sales went to the Company to be used as working capital.\nThe aforementioned sale of shares was conducted pursuant to Regulation S of the Securities Act of 1933, as amended (\"Regulation S\"). The sale of shares was made only to non-U.S. persons (as defined under Rule 902 section (k)(2)(i) of Regulation S), pursuant to offshore transactions, and no directed selling efforts were made in the United States by the issuer, a distributor, any of their respective affiliates, or any person acting on behalf of any of the foregoing.\nOn October 4, 2022, 3,472,222 shares of restricted Common Stock of the Issuer were sold to Mitsuru Ueno, a Japanese Citizen, by White Knight Co., Ltd., at a price of $0.001 per share of Common Stock. This was a private sale. The total amount paid by Mitsuru Ueno was approximately $3,472.\nOn October 4, 2022, 3,472,222 shares of restricted Common Stock of the Issuer were sold to Motoki Hirai, a Japanese Citizen, by White Knight Co., Ltd., at a price of $0.001 per share of Common Stock. This was a private sale. The total amount paid by Motoki Hirai was approximately $3,472.\nThe aforementioned sales of shares, on October 4, 2022, were conducted pursuant to Regulation S of the Securities Act of 1933, as amended (\"Regulation S\"). The sale of shares was made only to non-U.S. persons (as defined under Rule 902 section (k)(2)(i) of Regulation S), pursuant to offshore transactions, and no directed selling efforts were made in the United States by the issuer, a distributor, any of their respective affiliates, or any person acting on behalf of any of the foregoing.\nOn February 6, 2023, we sold 10,033,445 shares of restricted Common Stock to Kazuya Iwasaki, a Japanese Citizen, at a price of $0.023 per share of Common Stock. The total subscription amount paid by Kazuya Iwasaki was approximately $230,769. Kazuya Iwasaki is not a related party to the Company.\nOn February 6, 2023, we sold 3,344,482 shares of restricted Common Stock to Shokafulin LLP, a Japanese Company, at a price of $0.023 per share of Common Stock. The total subscription amount paid by Shokafulin LLP was approximately $76,923. Shokafulin LLP is not a related party to the Company.\nThe proceeds from these sales went to the Company to be used as working capital.\nThe aforementioned sales of shares were conducted pursuant to Regulation S of the Securities Act of 1933, as amended (\"Regulation S\"). The sales of shares were made only to non-U.S. persons (as defined under Rule 902 section (k)(2)(i) of Regulation S), pursuant to offshore transactions, and no directed selling efforts were made in the United States by the issuer, a distributor, any of their respective affiliates, or any person acting on behalf of any of the foregoing.\nOn August 9, 2023, we sold 434,783 shares of restricted Common Stock to Takahiro Fujiwara, a Japanese Citizen, at a price of $0.023 per share of Common Stock. The total subscription amount paid by Takahiro Fujiwara was approximately $10,000. Takahiro Fujiwara is not a related party to the Company.\nThe Company intends to use the proceeds from the aforementioned sale of shares for working capital.\nThe aforementioned sale of shares was conducted pursuant to Regulation S of the Securities Act of 1933, as amended (\"Regulation S\"). The sale of shares was made only to non-U.S. persons (as defined under Rule 902 section (k)(2)(i) of Regulation S), pursuant to offshore transactions, and no directed selling efforts were made in the United States by the issuer, a distributor, any of their respective affiliates, or any person acting on behalf of any of the foregoing.\nOn August 17, 2023, our majority shareholder, White Knight Co., Ltd., and Koichi Ishizuka, our sole Officer and Director, executed a resolution to ratify, affirm, and approve to file an Amended and Restated Certificate of Incorporation.\nThe Amended and Restated Certificate of Incorporation was filed with the Nevada Secretary of State on August 17, 2023, effective immediately.\nThe Amended and Restated Certificate of Incorporation resulted in an increase to the authorized shares of our Common Stock from One Billion Five Hundred Million (1,500,000,000) to Five Billion (5,000,000,000). It also revised the rights of Series A Preferred Stock, now allowing each one (1) share of Series A Preferred Stock to be converted into one thousand (1,000) shares of Common Stock at the discretion of the holder(s) of Series A Preferred Stock.\nOn August 18, 2023, our majority shareholder, White Knight Co., Ltd., a Japanese Company, owned and controlled by our sole Officer and Director, Koichi Ishizuka, elected to convert its 1,000,000 shares of Series A Preferred Stock of WB Burgers Asia, Inc. into shares of Common Stock. This conversion has been approved by the Company, and the conversion became effective on August 18, 2023. Every 1 share of Series A Preferred Stock was converted into 1,000 shares of Common Stock, for a total of 1,000,000,000 shares of Common Stock.\nOn or about September 12, 2023, we sold 1,488,982 shares of restricted common stock to Shokafulin LLP, a Japanese Company, which is controlled by Takuya Watanabe, a Japanese citizen, at a price of approximately $0.023 per share of common stock.\nThe total subscription amount paid by Shokafulin LLP was approximately $34,247. Shokafulin LLP and Mr. Watanabe are not related parties to the Company.\nThe proceeds from the above sale of shares went to the Company to be used for working capital.\nThe aforementioned sale of shares was conducted pursuant to Regulation S of the Securities Act of 1933, as amended (\"Regulation S\"). The sale of shares was made only to non-U.S. persons (as defined under Rule 902 section (k)(2)(i) of Regulation S), pursuant to offshore transactions, and no directed selling efforts were made in the United States by the issuer, a distributor, any of their respective affiliates, or any person acting on behalf of any of the foregoing.\nAt this time, we are pending review of a FINRA corporate action, to effect a 100 to 1 Reverse Stock Split. Pursuant to the action, there is to be no change in the quantity of our authorized shares of Common Stock or Preferred Stock.\nThe legal date of the Certificate of Change that we have filed with the Nevada Secretary of State on December 6, 2023, in connection with our Reverse Stock Split, will not be the same exact date as the FINRA effective date of our Reverse Stock Split. We anticipate that we will file an 8-K with the Securities and Exchange Commission after completion of our FINRA corporate action that may include, amongst other details, our new CUSIP number for our Common Stock and other pertinent information.\n- 7 -\nJapanese Food-Service Market\nThe Japanese Food-Service Market is Segmented by Type (Full-service Restaurants, Quick Service Restaurants, Cafes, Bars, 100% Home Delivery Restaurants, Street Stalls and Kiosks) and Structure (Independent Consumer Food Service and Chained Consumer Food Service). We believe Japanese consumers, in general, tend to be highly demanding, putting great emphasis on quality and branding and are willing to spend more resources on value-added products. (1)\nThe Japanese food service market was valued at USD 142.84 billion in 2020, and it is projected to witness a CAGR of 0.84% during the forecast period, 2021 - 2026. The coronavirus pandemic has made short-term projections hard to predict, with sales in March 2020 down almost 40% for some food companies. Japanese food service operators, which rely on lunch and dinner demand from business workers, are also suffering as more companies have employees working from home at the governments request. (1)\nAccording to a report released by TableCheck Inc., the percentage of reservations (dining reservations) being canceled increased about 3.6 times before the pandemic for groups of 10 or more. A French restaurant and bar named Scene near Hachioji Station on the Keio Line, earlier in June 2020, launched take-out and delivery services which we believe many others will begin offering if not already, due in part to the changing attitudes of dining out as a result of the pandemic. We believe take-out and delivery services, along with menu options that are quick to prepare, increasing in consumer demand. (1)\nThe variety of restaurants and menu items available in the Japanese food service industry continues to expand in the country, as Japanese consumers are interested in trying a new and vast variety of cuisines, which are available at their convenience in Japan. Food from Europe, Asia, Australia, and the Americas are becoming increasingly popular, partly due to a large number of Japanese traveling abroad every year.\nThe Japanese food service market is highly competitive, with a major market share held by prominent companies, such as McDonalds Corporation, Yum! Brands Inc., Zensho Holdings Co. Ltd, Skylark Group, MOS Food Services Inc., and Yoshinoya Holdings Co. Ltd. Zensho Holdings Co. Ltd, with the largest market share of 2.76% in 2020, emerging as the market leader, and Skylark Group holding the second-largest share with 1.66%. (1)\nCurrently, in the Japanese market, hamburgers and related fast-food options have been prevalent, with high-end gourmet hamburgers being in the most expensive category consisting usually of single restaurant locations, followed by lesser expensive hamburger options via chain restaurants such as Shake Shack and MOS Premiums. The size of the current market for hamburgers in Japan is approximately $6.6 Billion (2020), and has been steadily increasing ever since 2015. It is also projected to grow by approximately 5% over the next few years. Hamburgers are considered to be one of the few food categories that were not affected by COVID-19 in Japan and were able to take advantage of home deliveries and to-go orders during the pandemic. (Source: Fuji Keizai Group 2020.)\nSource:\n1.https://www.reportlinker.com/p06036755/Japan-Foodservice-Market-Growth-Trends-COVID-19-Impact-and-Forecasts.html?utm_source=GNW\n- 8 -\nBusiness Information\nWB Burgers Japan Co., Ltd., referred to herein as WBJ, which we operate through and share the same business plan of, holds the rights to the Master Franchise Agreement with Jakes Franchising LLC, a Delaware Limited Liability Company, as it pertains to the establishment and operation of Wayback Burger Restaurants within the country of Japan.\nThe Master Franchise Agreement provides WBJ the right to establish and operate Wayback Burgers restaurants in the country of Japan, and also license affiliated and unaffiliated third parties (Franchisees) to establish and operate Wayback Burgers restaurants in the Country of Japan, this agreement lasts for a term of twenty years, unless it is terminated sooner in accordance with terms outlined in the Master Franchise Agreement, and may be extended one additional, consecutive term of ten years. In exchange for such rights, we paid Jakes Franchising $2,700,000 USD, and we must pay an additional $10,000 for each additional company operated Wayback Burgers restaurant and for each sub-franchised location the fee is either $10,000 or 28.57% of the initial franchise fee collected for such Restaurant, whichever is greater. Additionally, there is also a royalty fee in the amount of three percent (3%) of the Gross Sales of all Company-Operated Wayback Burgers Restaurants in the Country and the greater of two percent (2%) of the Gross Sales of all Franchised Wayback Burgers Restaurants in the Country or forty percent (40%) of the royalty fees collected for all Franchised Wayback Burgers Restaurants in the Country. The Master Franchise Agreement, amongst other things, also provides WBJ the right of first refusal to enter into a subsequent Master Franchise Agreement with Jakes Franchising, LLC to establish and operate Wayback Burgers restaurants in the Countries of Indonesia, Malaysia (Eastern Malaysia only, Western Malaysia if it becomes available as it is currently licensed to another party), the Philippines, Vietnam, China, India, Korea, Thailand, Singapore, and Taiwan.\nThe Master Franchise Agreement dictates specific duties we must perform which include, but are not limited to, providing Jakes Franchising with plans and specifications for restaurant locations, provide employees with Wayback Burgers mandated training, present Jakes Franchising with copies of all potential advertising and promotional material, etc. Furthermore, we are required to open one Wayback Burgers restaurant by the end of the 2022 calendar year, three restaurants by the end of the 2023 calendar year, and an additional three restaurants must open, and remain in operation, every following year until December 31, 2041, at which time we must have sixty Wayback Burgers restaurants open and in operation. If we fail to meet these targets, then we would need to renegotiate terms with Jakes Franchising, or we could potentially lose our master franchise rights in their entirety. As of the date of this report, the Company has not adhered to the stipulated requirements outlined in the Master Franchise Agreement concerning the establishment of additional restaurant locations. While the Company has received informal assurance, through verbal discussions with representatives of Jakes Franchising, that no penalties will be imposed, there remains the potential for Jakes Franchising to exercise their discretion and terminate the Master Franchise Agreement unless the Company achieves full compliance with all specified terms. In the event of such termination, the Companys operational outcomes would be adversely affected, necessitating a significant alteration of our business plan, or potentially raising questions about the feasibility of sustaining our operations.\nFor full terms and details of the Master Franchise Agreement, one can view a complete copy which has been filed as an exhibit to the Form 8-K filed with the Securities and Exchange Commission on September 16, 2021.\nWB Burgers Japan Co., Ltd. seeks to make Wayback Burgers a nationally recognized brand, if not a household name, within the country of Japan through the promotion and opening of various Wayback Burgers Restaurants.\nFollowing the acquisition of our wholly owned subsidiary, WB Burgers Japan Co., Ltd., on September 14, 2021, we ceased to be a shell company. Immediately upon our acquisition of WB Burgers Japan Co., Ltd. we adopted the same business plan as WB Burgers Japan Co., Ltd.\nBackground\nThe first Wayback Burgers, previously known as Jakes Wayback Burgers, began with a single location in Newark, Delaware approximately thirty-one years ago in 1991, offering a combination of burgers, hot dogs, fries, milkshakes, and other similar menu options. Since then, it has reached a global scale with a presence in the US, Europe, Africa, and Asia with hundreds of corporate owned restaurants and over five hundred franchise locations worldwide offering much of the same comfort items many have grown accustomed to, with the addition of a few menu items specifically geared toward the pallets of those in various demographics.\nThe products we seek to offer in our anticipated location(s), and those we seek to franchise to within Japan, will also offer many of the same product offerings many are accustomed to elsewhere such as hamburgers, hot dogs chicken sandwiches, hand-dipped milkshakes, various side dishes, fresh salad, kids meals, refreshing drinks and alcoholic beverages. We intend to source our ingredients in any of our current or future location(s) from highly regarded local Japanese suppliers in order to satisfy the food quality standards as set by Wayback Burgers Inc., within the United States.\nOur First Location\nOn November 9, 2021, our wholly owned subsidiary, WB Burgers Japan Co., Ltd., consummated a lease agreement with Arai Co., Ltd., a Japanese realty group, for the location in which we now operate our first Wayback Burgers restaurant. The property is located in the popular shopping plaza of Omotesando, located in the Tokyo prefecture, in the country of Japan. We believe the high volume of foot traffic and shopping will yield a large group of patrons seeking to try our product offerings.\nOn March 11, 2022 we opened our first flagship Wayback Burgers location to the public in the Omotesando shopping plaza in Japan. We offer an array of quick bites, including, but not limited to, traditional hamburgers, fries, shakes, and other alternatives.\nOther Current Locations\nIn August of 2022, we, through our wholly owned subsidiary, WB Burgers Japan Co., Ltd., entered into and consummated a rental agreement with Kitchen Depot for a ghost kitchen in the Tamachi neighborhood of Minato, Tokyo, Japan. Following notice provided to Kitchen Depot in September of 2023, in November of 2023, we terminated our rental agreement with Kitchen Depot and we ceased all operations through our, now former, ghost kitchen location in Tamachi. The Company has no plans to resume operations at this location at any juncture, as it believes this location is unlikely to be profitable, considering the low volume of orders it received while this location was operational.\nOn October 1, 2023, an agreement was established between our company and Next Meats Co., Ltd., spanning a three-year duration, concerning the licensing of logos and related assets. Subsequently, in November 2023, the operation of a ghost kitchen named \"NEXT Restaurant\" commenced at our flagship Omotesando location. This initiative stems from a collaboration between our company and Next Meats Holdings, Inc., particularly its subsidiary Next Meats Co., Ltd., aimed at opening a venue offering Next Meats menu selections, including, amongst other menu items, the prominently featured \"NEXT Pizza\".\nThe majority of menu items available at this ghost kitchen are sourced from Mama Foods Co., Ltd., a manufacturer of products for Next Meats Holdings, Inc. Consequently, 1% of the sales generated at this restaurant location are remitted to Next Meats Co., Ltd., as part of the collaborative agreement.\nFrom time to time, we purchase food products that we offer through our menu items from Mama Foods Co., Ltd., a Japanese Company owned and controlled by our sole officer and director, Koichi Ishizuka.\nKoichi Ishizuka is an executive officer and director of Next Meats Holdings, Inc., and through his direct and indirect ownership of Next Meats Holdings, Inc., he is deemed to be the controlling shareholder of Next Meats Holdings, Inc.\nMobile Application\nThe Company has entered the final stage of development for its own mobile application for food delivery services. At present, the Company is finalizing development, and is in the process of finalizing plans for the launch of the application, hiring delivery staff, etc. However, there is currently no specific timeframe established for the intended launch of the mobile application.\n- 9 -\nMarketing Strategy\nIn order to grow an initial customer base, from which we intend to launch future expansion efforts, our marketing strategy begins with the physical location of our flagship restaurant. Our current location in Omotesando is in a shopping center with high foot-traffic that can serve to attract not only customers, but also future franchisee prospects throughout Japan. For future franchisee locations, we intend to identify areas where competitors are not already located, such as road-side in the outskirts of major cities, and open our restaurants in these areas.\nHowever, we do not intend to rely solely on our physical location in order to attract customers, we also are in the early stages of our marketing stratagem comprised, in part, of SNS (social networking service) marketing through collaboration with influencers and celebrities, magazine advertisements, and expansive television and media appearances.\nWayback Burgers in Japan intends to position itself as a newly entered and authentic American hamburger brand, comparable to our competitor Shack Shake, while contrasting ourselves through offering higher quality foods at competitive price points. We plan to achieve this by focusing on the ingredients, such as the option of vegetables in our hamburgers, the increased diameter of our meat patties, and the overall volume of our menu items.\nExpansion Plans\nWe have forecasted our expansion plans over the next few years, however, as we have a limited operating history, we may find that our plans may be materially altered, expanded, or curtailed as dictated by market forces at the time. As such, our expansion plans should be read as a framework for our future goals, but not a guarantee that we will carry out any or all such operations in the indicated timeline.\nAt present, our expansion plans are as follows:\n- On March 11, 2022, we opened our first flagship Wayback Burgers location to the public in the Omotesando shopping plaza in Japan. We offer an array of quick bites, including, but not limited to, traditional hamburgers, fries, shakes, and other alternatives. We intend to utilize our franchise location to host meetings with all franchise candidates. In addition to our general marketing plans, which includes social media and internet advertising, we intend to utilize our flagship location to showcase any collaborative events/activities that we may engage in, which we believe may assist us in garnering the interest of future franchisees.\n- By the conclusion of 2024, we are aiming to open five Wayback Burgers restaurants throughout Japan, with one of these restaurants directly managed by us while the remaining four would ideally be franchise locations. This number may increase or decrease depending on the results of our operations.\n- Additionally, by the conclusion of 2024, we intend to execute another master franchise agreement in Asia for the right to open Wayback Burgers restaurants in another Asian country or territory. We have not yet identified which country or territory we will seek to acquire these rights for first. As noted previously, we have the right of first refusal to enter into a subsequent Master Franchise Agreement with Jakes Franchising, LLC to establish and operate Wayback Burgers restaurants in the Countries of Indonesia, Malaysia (Eastern Malaysia only, Western Malaysia if it becomes available as it is currently licensed to another party), the Philippines, Vietnam, China, India, Korea, Thailand, Singapore, and Taiwan.\nPartnerships\nThe company believes partnerships are a vital means to expansion and that partnerships with other food institutions or distributors may allow the Company to provide menu items that might appeal to a larger demographic within the Japanese market.\nOur current Officer and Director, Koichi Ishizuka has existing ties and relationships with Next Meats Co., Ltd. a Japanese plant alternative meat company, that produces and sells plant-based foods (predominantly meat alternatives) to consumers. As a result of the collaboration with Next Meats Co., Ltd., at our flagship Wayback Burgers restaurant we have been able to add alternative meat options into its menu, we have opened the NEXT Restaurant ghost kitchen at our Omotesando location, and in the future we may create customized menu options as provided by Next Meats Co., Ltd. Menu alterations are subject to approval by Jakes Franchising, LLC. It is the belief of management that such offerings can gain a larger market share in the country of Japan allowing for greater growth potential. However, such plans are speculative and may not materialize. It is also possible that if such plans do materialize, they may not result in the expected level of growth the Company forecasts as a result of the partnership or partnerships it enters into. Additionally, we may explore the possibility of entering into an agreement with Dr. Foods, Inc., a company in the alternative meat industry which has common management with the Company.\nIt should be noted that Koichi ishizuka has an equity interest in Next Meats Holdings, Inc., a Nevada Company. He also currently serves as Chief Executive Officer, Chief Financial Officer, and Director of Next Meats Holdings, Inc. Next Meats Co., Ltd. is a wholly owned subsidiary of Next Meats Holdings, Inc. Koichi Ishizuka is also the Sole Officer, Director, and controlling shareholder of Dr. Foods, Inc.\nFurthermore, the company has established an informal partnership with Mama Foods Co., Ltd. This collaboration involves Mama Foods Co., Ltd. supplying Next Meats products, which are then made available for purchase at our NEXT Restaurant ghost kitchen venue. Notably, Mama Foods Co., Ltd., serving as the main manufacturer for Next Meats Co., Ltd.'s products, operates under indirect ownership and control by our sole officer and director, Koichi Ishizuka.\n- 10 -\nGovernment Regulations\nThe below does not extensively detail every single law and regulation to which the Company may be subject to, but rather provides an overview of the kind of food safety standards to which our restaurant(s) will be held.\nThe main law that governs food quality and integrity in Japan is the Food Sanitation Act (\"FSA\") and the law that comprehensively governs food labelling regulation is the Food Labelling Act.\nThe FSA regulates food quality and integrity by:\n- Establishing standards and specifications for food, additives, apparatus, and food containers and packaging;\n- Providing for inspection to see whether the established standards are met;\n- Providing for hygiene management in the manufacture and sale of food; and\n- Requiring food businesses to be licensed.\nUnder the FSA, additives and foods containing additives must not be sold, or be produced, imported, processed, used, stored, or displayed for marketing purposes unless the Minister of Health, Labour and Welfare (\"MHLW\") has declared them as having no risk to human health after seeking the views of the Pharmaceutical Affairs and Food Sanitation Council (\"PAFSC\"). In addition, it is not permissible to add any processing aids, vitamins, minerals, novel foods or nutritive substances to food unless they have been expressly declared by the MHLW as having no risk to human health.\nThe MHLW may establish specifications for methods of producing, processing, using, cooking, or preserving food or additives to be served to the public for marketing purposes (\"Specifications\"), or may establish standards for food ingredients or additives to be served to the public for marketing purposes (\"Standards\") pursuant to the FSA. Accordingly, where substances are allowed to be added to food, they may only be used within the limits expressly set by the Specifications and Standards.\nIn order to operate a restaurant in Japan, we were required to obtain, and have obtained, a restaurant business license from a local health center. The requirement to obtain this license is that we must have, and we currently do have, an employee to act as a director of food sanitation, and a fire protection manager. Additionally, we must pay consumption tax, corporate tax, social insurance for our employees, as well as welfare pension for our employees. We follow all related guidelines and the company directly pays all such fees in order to remain in compliance.\nEmployees\nCurrently, we, WB Burgers Asia, Inc., have only one employee, our sole officer and director Koichi Ishizuka. Mr. Ishizuka does not have any employment agreement with the Company, and has not entered into any formal agreement with the company pertaining to compensation. Our wholly subsidiary, WB Burgers Japan Co., Ltd. has thirty nine salaried staff members. Four employees are full time, and thirty five employees are part time. The employees are comprised primarily of staff members who operate our restaurant location.\nDuring the period ending July 31, 2023, the Company paid White Knight Co., Ltd. $917,895 for compensation expenses. White Knight Co., Ltd. is owned and controlled by our sole officer and director, Koichi Ishizuka. Item 1A. Risk Factors.\nAs a smaller reporting company, as defined in Rule 12b-2 of the Exchange Act, we are not required to provide the information called for by this Item. Item 1B. Unresolved Staff Comments.\nThe Company filed a Form S-1/A with the Securities and Exchange Commission on September 22, 2023. Regarding this form, the Company received a comment letter from the Securities and Exchange Commission on October 18, 2023, to which it has not yet responded. The Company plans to address the outstanding comment letter within the next sixty days. Item 2. Properties.\nAt present, we do not own any properties. However, we do lease our restaurant location.\nOur flagship restaurant location is currently leased from Arai Co., Ltd., a Japanese realty group,\nDetails of the Leased Property: The property is located at 6-19-20 No.15 Arai Bldg Jingumae Shibuya-Ku, Tokyo, Japan, which is in a popular shopping location that is only a minute walk from the Omotesando Station. The deposit is 35,000,000 JPY ($304,000) and the monthly rent is 3,850,000 JPY (including tax) ($33,475). The term of the lease extends from November 9, 2021 to January 8, 2024, and has the option to be extended indefinitely for additional two-year periods. The interior space is 157.82 ㎡ (1698.760 square ft), and the terrace space is 145.06 ㎡ (1561.413 square ft), which accounts for a total usable space of 302.88 ㎡ (3260.173 square ft).\nBelow are a few photographs of this physical restaurant location. Logos and branding of neighboring businesses have been blurred out in the image below.\nIn August of 2022, we, through our wholly owned subsidiary, WB Burgers Japan Co., Ltd., entered into and consummated a rental agreement with Kitchen Depot for a ghost kitchen in the Tamachi neighborhood of Minato, Tokyo, Japan. Following notice provided to Kitchen Depot in September of 2023, in November of 2023, we terminated our rental agreement with Kitchen Depot and we ceased all operations through our, now former, ghost kitchen location in Tamachi. Item 3. Legal Proceedings.\nFrom time to time, we may become party to litigation or other legal proceedings that we consider to be a part of the ordinary course of our business. The Company is not currently involved in legal proceedings that could reasonably be expected to have a material adverse effect on our business, prospects, financial condition or results of operations.\nIn May of 2023, a shareholder of Next Meats Holdings, Inc. (NXMH), a company controlled by our sole officer and director, Koichi Ishizuka, brought an action against Koichi Ishizuka and White Knight Co., Ltd., in the Southern District of New York for recovery of alleged short swing profits earned from the sale of NXMH common stock, under Section 16(b) of the Securities Exchange Act of 1934. Koichi Ishizuka and White Knight Co., Ltd. are vigorously defending this matter.\nWB Burgers Asia, Inc. has no direct exposure in connection with the lawsuit and this action should not be considered material to the Company. Item 4. Mine Safety Disclosures.\nNot applicable.\n- 11 -\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities.\nMarket Information\nOur common stock was quoted on the over-the-counter market (the OTC Markets) in the Pink Open® Market (the Pink Market) under the symbol WBBA. Given our delinquent SEC Reporting status, we have recently been demoted by the OTC Markets to the Expert Market tier under the same symbol.\nQuotations in Expert Market securities are restricted from public viewing. We anticipate that we will resume trading on the Pink Open® Market when we are current in our SEC reporting obligations once again. Currently, we are delinquent in filing our Form 10-Q for the quarterly period ended October 31, 2023. We intend to file this report subsequent to the filing of this Form 10-K, however we cannot state with any level of specificity exactly when the delinquent report will be filed as we remain active in preparing the report.\nThere is currently a limited trading market in the Companys shares of common stock. Generally speaking, our shares of common stock are, and have been thinly traded, meaning our shares cannot be easily purchased or sold and have a low volume of shares trading per day which can lead to volatile changes in price per share.\nOver-the-counter market quotations reflect inter-dealer prices, without retail mark-up, mark-down or commission and may not necessarily represent actual transactions.\nQuarter Ended High Bid Low Bid\nOctober 31, 2023 $0.0799 $0.0008\nJuly 31, 2023 $0.0009 $0.0002\nApril 30, 2023 $0.034 $0.0002\nJanuary 31, 2023 $0.0445 $0.01\nOctober 31, 2022 $0.0472 $0.0169\nJuly 31, 2022 $0.0672 $0.0185\nApril 30, 2022 $0.247 $0.021\nJanuary, 31, 2022 $0.3455 $0.1101\nOctober 31, 2021 $0.46 $0.162\nHolders\nAs of December 29, 2023, we have 2,072,642,444 shares of Common Stock, $0.0001 par value, issued and outstanding and no shares of Preferred Stock, $0.0001 par value, issued and outstanding.\nAs of December 29, 2023, we have approximately 224 shareholders of record. This is inclusive of Cede and Co., which is deemed to be one shareholder of record. For further clarification, Cede & Co. is currently defined by the NASDAQ, as a Nominee name for The Depository Trust Company, a large clearing house that holds shares in its name for banks, brokers and institutions in order to expedite the sale and transfer of stock.\nDividends\nWe have not paid any cash dividends to date and do not anticipate or contemplate paying dividends in the foreseeable future. It is the present intention of our management to utilize all available funds for the development of our business.\nIssuer Purchases of Equity Securities\nNone.\nEquity Compensation Plan Information\nNot applicable.\nRecent Sales of Unregistered Securities; Uses of Proceeds from Registered Securities\nOn or about about July 1, 2021, we sold 9,090,909 shares of restricted common stock to SJ Capital Co., Ltd., a Japanese Company, at a price of $0.20 per share of common stock. The total subscription amount paid by SJ Capital Co., Ltd. was approximately $1,818,181.80 or approximately 200,000,000 Japanese Yen.\nSJ Capital Co., Ltd., is owned and controlled by Senju Pharmaceutical Co., Ltd., a Japanese Company.\nMr. Takeshi Sugisawa, the President of SJ Capital Co., Ltd., authorized the above transaction on behalf of SJ Capital Co., Ltd. Both SJ Capital Co., Ltd., and Senju Pharmaceutical Co., Ltd. are considered non-related parties to the Company. The proceeds from the above sale of shares went to the Company to be used for working capital.\nOn August 24, 2021, we sold 1,363,636 shares of restricted common stock to Yasuhiko Miyazaki, a Japanese Citizen, at a price of $0.20 per share of common stock. The total subscription amount paid by Yasuhiko Miyazaki was approximately $272,727 or approximately 30,000,000 Japanese Yen. Mr. Yasuhiko Miyazaki is not a related party to the Company. The proceeds from the above sale of shares went to the Company to be used for working capital.\nOn September 14, 2021, we entered into an Acquisition Agreement with White Knight Co., Ltd., a Japan Company, whereas we issued 500,000,000 shares of restricted common stock to White Knight Co., Ltd., in exchange for 100% of the equity interests of WB Burgers Japan Co., Ltd., a Japan Company. Following this transaction, WB Burgers Japan Co., Ltd. became our wholly owned subsidiary which we operate through.\nThe aforementioned Acquisition Agreement is attached as Exhibit 10.1 to our Form 8-K filed with the Securities and Exchange Commission on September 14, 2021. All references to the Acquisition Agreement are qualified, in their entirety, by the text of such exhibit. White Knight Co., Ltd., is owned entirely by our sole officer and Director, Koichi Ishizuka. White Knight Co., Ltd. is our largest controlling shareholder.\nOn October 22, 2021, we sold 2,252,252 shares of restricted common stock to Shokafulin LLP, a Japan Company, which is controlled by Takuya Watanabe, a Japanese Citizen, at a price of $0.20 per share of common stock. The total subscription amount paid by Shokafulin LLP was approximately $450,450 or approximately 50,000,000 Japanese Yen. Shokafulin LLP and Mr. Watanabe are not related parties to the Company. The proceeds from the above sale of shares went to the Company to be used for working capital.\n- 12 -\nOn December 27, 2021, we sold 1,315,789 shares of restricted Common Stock to Takahiro Fujiwara, Japanese Citizen, at a price of $0.20 per share of Common Stock. The total subscription amount paid by Takahiro Fujiwara was approximately $263,158. Takahiro Fujiwara is not a related party to the Company. The proceeds from the above sale of shares went to the Company to be used for working capital.\nOn August 8, 2022, we sold 1,586,538 shares of restricted Common Stock to Takahiro Fujiwara, a Japanese Citizen, at a price of $0.032 per share of Common Stock. The total subscription amount paid by Takahiro Fujiwara was approximately $50,769. Takahiro Fujiwara is not a related party to the Company.\nOn August 8, 2022, we sold 2,403,846 shares of restricted Common Stock to Shokafulin LLP, a Japanese Company, at a price of $0.032 per share of Common Stock. The total subscription amount paid by Shokafulin LLP was approximately $76,923. Shokafulin LLP is not a related party to the Company.\nOn August 12, 2022, we sold 32,065,458 shares of restricted Common Stock to Asset Acceleration Axis, LLC, a Japanese Company, at a price of $0.034 per share of Common Stock. The total subscription amount paid by Asset Acceleration Axis, LLC was approximately $1,090,226. Asset Acceleration Axis, LLC is not a related party to the Company.\nThe Company intends to use the proceeds from the aforementioned sales of shares for working capital.\nOn September 13, 2022, we sold 7,262,324 shares of restricted Common Stock to Asset Acceleration Axis, LLC, a Japanese Company, at a price of $0.032 per share of Common Stock. The total subscription amount paid by Asset Acceleration Axis, LLC was approximately $232,395. Asset Acceleration Axis, LLC is not a related party to the Company.\nThe Company intends to use the proceeds from the aforementioned sales of shares for working capital.\nOn February 6, 2023, we sold 10,033,445 shares of restricted Common Stock to Kazuya Iwasaki, a Japanese Citizen, at a price of $0.023 per share of Common Stock. The total subscription amount paid by Kazuya Iwasaki was approximately $230,769. Kazuya Iwasaki is not a related party to the Company.\nOn February 6, 2023, we sold 3,344,482 shares of restricted Common Stock to Shokafulin LLP, a Japanese Company, at a price of $0.023 per share of Common Stock. The total subscription amount paid by Shokafulin LLP was approximately $76,923. Shokafulin LLP is not a related party to the Company.\nThe proceeds from these sales went to the Company to be used as working capital.\nOn August 9, 2023, we sold 434,783 shares of restricted Common Stock to Takahiro Fujiwara, a Japanese Citizen, at a price of $0.023 per share of Common Stock. The total subscription amount paid by Takahiro Fujiwara was approximately $10,000. Takahiro Fujiwara is not a related party to the Company.\nThe Company intends to use the proceeds from the aforementioned sale of shares for working capital.\nOn August 18, 2023, our majority shareholder, White Knight Co., Ltd., a Japanese Company, owned and controlled by our sole Officer and Director, Koichi Ishizuka, elected to convert its 1,000,000 shares of Series A Preferred Stock of WB Burgers Asia, Inc. into shares of Common Stock. This conversion has been approved by the Company, and the conversion became effective on August 18, 2023. Every 1 share of Series A Preferred Stock was converted into 1,000 shares of Common Stock, for a total of 1,000,000,000 shares of Common Stock.\nOn or about September 12, 2023, we sold 1,488,982 shares of restricted common stock to Shokafulin LLP, a Japanese Company, which is controlled by Takuya Watanabe, a Japanese citizen, at a price of approximately $0.023 per share of common stock.\nThe total subscription amount paid by Shokafulin LLP was approximately $34,247. Shokafulin LLP and Mr. Watanabe are not related parties to the Company.\nThe proceeds from the above sale of shares went to the Company to be used for working capital.\nIn regards to all of the above transactions, the Company claims an exemption from registration afforded by Section Regulation S of the Securities Act of 1933, as amended (\"Regulation S\") for the above sales/issuances of the stock since the sales/issuances of the stock were made to non-U.S. persons (as defined under Rule 902 section (k)(2)(i) of Regulation S), pursuant to offshore transactions, and no directed selling efforts were made in the United States by the issuer, a distributor, any of their respective affiliates, or any person acting on behalf of any of the foregoing.\n- 13 - Item 6. Selected Financial Data.\nNot applicable because the Company is a smaller reporting company. Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations.\nManagements Discussion and Analysis of Financial Condition and Results of Operations is designed to provide a reader of the financial statements with a narrative report on our financial condition, results of operations, and liquidity. This discussion and analysis should be read in conjunction with the audited Financial Statements and notes thereto for the year ended July 31, 2023 and 2022, included under Item 8 Financial Statements and Supplementary Data in this Report. The following discussion contains forward-looking statements that involve risks and uncertainties, such as statements of our plans, objectives, expectations, and intentions. Our actual results could differ materially from those discussed in the forward-looking statements. Please also see the cautionary language at the beginning of this Report regarding forward-looking statements.\nSummary of Business\nWB Burgers Japan Co., Ltd., referred to herein as WBJ, which we operate through and share the same business plan of, holds the rights to the Master Franchise Agreement with Jakes Franchising LLC, a Delaware Limited Liability Company, as it pertains to the establishment and operation of Wayback Burger Restaurants within the country of Japan.\nMaster Franchise Agreement - Summary\nThe Master Franchise Agreement provides WBJ the right to establish and operate Wayback Burgers restaurants in the country of Japan, and also license affiliated and unaffiliated third parties (Franchisees) to establish and operate Wayback Burgers restaurants in the Country of Japan, this agreement lasts for a term of twenty years, unless it is terminated sooner in accordance with terms outlined in the Master Franchise Agreement, and may be extended one additional, consecutive term of ten years. In exchange for such rights, we paid Jakes Franchising $2,700,000 USD, and we must pay an additional $10,000 for each additional company operated Wayback Burgers restaurant and for each sub-franchised location the fee is either $10,000 or 28.57% of the initial franchise fee collected for such Restaurant, whichever is greater. Additionally, there is also a royalty fee in the amount of three percent (3%) of the Gross Sales of all Company-Operated Wayback Burgers Restaurants in the Country and the greater of two percent (2%) of the Gross Sales of all Franchised Wayback Burgers Restaurants in the Country or forty percent (40%) of the royalty fees collected for all Franchised Wayback Burgers Restaurants in the Country. The Master Franchise Agreement, amongst other things, also provides WBJ the right of first refusal to enter into a subsequent Master Franchise Agreement with Jakes Franchising, LLC to establish and operate Wayback Burgers restaurants in the Countries of Indonesia, Malaysia (Eastern Malaysia only, Western Malaysia if it becomes available as it is currently licensed to another party), the Philippines, Vietnam, China, India, Korea, Thailand, Singapore, and Taiwan.\nMaster Franchise Agreement - Duties\nThe Master Franchise Agreement dictates specific duties we must perform which include, but are not limited to, providing Jakes Franchising with plans and specifications for restaurant locations, provide employees with Wayback Burgers mandated training, present Jakes Franchising with copies of all potential advertising and promotional material, etc. Furthermore, we are required to open one Wayback Burgers restaurant by the end of the 2022 calendar year, three restaurants by the end of the 2023 calendar year, and an additional three restaurants must open, and remain in operation, every following year until December 31, 2041, at which time we must have sixty Wayback Burgers restaurants open and in operation. If we fail to meet these targets, then we would need to renegotiate terms with Jakes Franchising, or we could potentially lose our master franchise rights in their entirety. As of the date of this report, the Company has not adhered to the stipulated requirements outlined in the Master Franchise Agreement concerning the establishment of additional restaurant locations. While the Company has received informal assurance, through verbal discussions with representatives of Jakes Franchising, that no penalties will be imposed, there remains the potential for Jakes Franchising to exercise their discretion and terminate the Master Franchise Agreement unless the Company achieves full compliance with all specified terms. In the event of such termination, the Companys operational outcomes would be adversely affected, necessitating a significant alteration of our business plan, or potentially raising questions about the feasibility of sustaining our operations.\nFor full terms and details of the Master Franchise Agreement, one can view a complete copy which has been filed as an exhibit to the Form 8-K filed with the Securities and Exchange Commission on September 16, 2021.\nWB Burgers Japan Co., Ltd. seeks to make Wayback Burgers a nationally recognized brand, if not a household name, within the country of Japan through the promotion and opening of various Wayback Burgers Restaurants.\nLocations\nOn November 9, 2021, our wholly owned subsidiary, WB Burgers Japan Co., Ltd., consummated a lease agreement with Arai Co., Ltd., a Japanese realty group, for the location of our first Wayback Burgers restaurant. The property is located in the popular shopping plaza of Omotesando, located in the Tokyo prefecture. Currently, this is our central and only physical location. We believe the high volume of foot traffic and shopping will yield a large group of patrons seeking to try our product offerings.\nIn August of 2022, we, through our wholly owned subsidiary, WB Burgers Japan Co., Ltd., entered into and consummated a rental agreement with Kitchen Depot for a ghost kitchen in the Tamachi neighborhood of Minato, Tokyo, Japan. Following notice provided to Kitchen Depot in September of 2023, in November of 2023, the Company terminated its rental agreement with Kitchen Depot, as well as its operations at its ghost kitchen in the Tamachi neighborhood of Minato, Tokyo, Japan. The Company has no plans to resume operations at this location at any juncture, as it believes this location is unlikely to be profitable, considering the low volume of orders it received while this location was operational.\nOn October 1, 2023, an agreement was established between our company and Next Meats Co., Ltd., spanning a three-year duration, concerning the licensing of logos and related assets. Subsequently, in November 2023, the operation of a ghost kitchen named \"NEXT Restaurant\" commenced at our flagship Omotesando location. This initiative stems from a collaboration between our company and Next Meats Holdings, Inc., particularly its subsidiary Next Meats Co., Ltd., aimed at opening a venue offering Next Meats menu selections, including the prominently featured \"NEXT Pizza\".\nThe majority of menu items available at this ghost kitchen are sourced from Mama Foods Co., Ltd., the primary manufacturer of products for Next Meats Holdings, Inc. Consequently, 1% of the sales generated at this restaurant location are remitted to Next Meats Co., Ltd., as part of the collaborative agreement.\nSubsidiaries\nWe have two wholly owned subsidiaries, WB Burgers Japan Co., Ltd., and Store Foods Co., Ltd. Both of our wholly owned subsidiaries are Japanese Companies. Store Foods Co., Ltd. has not yet commenced any material operations and our plans for Store Foods Co., Ltd. have not yet been fully determined with any level of specificity.\nAnticipated Capital Requirements\nIn order to fund our operations for the next twelve months we believe we will need a minimum of at least $500,000. We believe this will cover our future expansion and growth efforts, barring any unforeseen capital expenditures that may arise.\n- 14 -\nCash and Cash Equivalents\nAs of July 31, 2023, and 2022, we had cash and cash equivalents in the amount of $161,213 and $126,669, respectively. The variance in our cash balance from July 31, 2022 to July 31, 2023 is the result of the Company having increased operations, namely our dine in and dine out restaurant location in the Omotesando Shopping Plaza, located in Tokyo, Japan.\nAssets\nOur total assets for July 31, 2023 and July 31, 2022 were $1,259,223 and $3,760,615, respectively. The reason for the variance is primarily attributable to the fact that the Master Franchise Agreement we entered into with Jakes Franchising LLC, a Delaware Limited Liability Company, to operate Wayback Burgers Franchise locations, is recorded as an asset for the fiscal year ended July 31, 2022, but not for the fiscal year ended July 31, 2023.\nThe reason why the franchise rights were not recorded as an asset for the fiscal year ended July 31, 2023 is because the Company has demonstrated no track record of capitalizing on the franchise rights beyond the company owned stores which were not profitable through the current date.\nRevenues\nFor the year ended July 31, 2023, and 2022, we generated revenues of $581,798 and $180,821 respectively. The variance in revenue year over year is due to the fact that we increased our operations during the fiscal year ended July 31, 2023. However, our cost of revenue was $1,341,572 for the year ended July 31, 2023 and $716,083 for the year ended July 31, 2022. As a result, our gross loss for the fiscal year ended July 31, 2023 was $759,774 compared to a gross loss of $535,262 for the fiscal year ended July 31, 2022. We do not believe that our cost of revenues will proportionally increase with our revenues, and thus, we believe generating more revenue will help to alleviate our losses we have experienced for the fiscal years ended July 31, 2023 and July 31, 2022.\nOther Income (Loss)\nOther income (expense) was $148,105, comprised of cash receipts of the consumption tax, for the year ended July 31, 2023, and $(334,317) for the year ended July 31, 2022. The variance year over year is primarily attributable to expensed related party loan receivables from the year ended July 31, 2022 that was recorded as other expense.\nNet Operating Loss\nOur general and administrative expenses were $3,311,706 for the year ended July 31, 2023 and $733,744 for the year ended July 31, 2022. Our net operating loss for the year ended July 31, 2023 was $4,071,480 and $1,269,006 for the fiscal year ended July 31, 2022. The variance is a result of the total general and administrative expense for the year ended July 31, 2023, which includes a loss on impairment totaling $1,899,666. This impairment loss is related to the Companys adjustment to the value of the franchise rights asset.\nAs mentioned above, we believe that in order to remedy our net loss we will require additional revenue. We are currently exploring a means in which to gain more customers at our dine in location.\nAdditional Paid-In Capital\nDuring the period ended July 31, 2022, White Knight forgave a loan to the Company of approximately $2,317,272, which is recorded as additional paid-in capital.\nThe Companys sole officer and director, Koichi Ishizuka, paid expenses on behalf of the Company totaling $55,030 during the period ended July 31, 2022. These payments are considered contributions to the company with no expectation of repayment and are posted as additional paid-in capital.\nDuring the year ended July 31, 2022, the Company recognized donated capital from its wholly owned subsidiary, Store Foods, as additional paid-in capital in the amount of $8,673.\nCash Flows\nFor the fiscal year ended July 31, 2023, our net cash used in operating activities totaled $(1,530,628), whereas for the fiscal year ended July 31, 2022, our net cash used in operating activities totaled $(1,642,176).\nFor the fiscal year ended July 31, 2023, our net cash used in investing activities totaled $12,290, whereas for the fiscal year ended July 31, 2022, our net cash used in investing activities totaled $(980,539). The variance between periods is primarily attributable to significantly more cash paid for fixed assets during the fiscal year ended July 31, 2022.\nFor the fiscal year ended July 31, 2023, our net cash provided by financing activities totaled $1,637,774, whereas for the fiscal year ended July 31, 2022, our net cash provided by financing activities totaled $2,688,659. This variance is primarily attributable to a greater amount of cash received from the sale of stock during the fiscal year ended July 31, 2022. Item 7A. Quantitative and Qualitative Disclosures about Market Risk.\nWe qualify as a smaller reporting company, as defined by Item 10 of Regulation S-K and, thus, are not required to provide the information required by this Item.\n- 15 - Item 8. Financial Statements and Supplementary Data.\nIndex to Financial Statements - WB Burgers Asia, Inc.\n(Audited)\nPage\nReport of Independent Registered Public Accounting Firm (PCAOB FIRM ID - 2738)\nFinancial Statements:\nConsolidated Balance Sheet\nConsolidated Statement of Operations\nConsolidated Statement of Changes in Stockholders Equity (Deficit)\nConsolidated Statement of Cash Flows\nNotes to Consolidated Audited Financial Statements\n-\n- -\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Stockholders of WB Burgers Asia, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of WB Burgers Asia, Inc. (the Company) as of July 31, 2023, and 2022, and the related consolidated statements of operations, changes in stockholders equity (deficit), and cash flows for the two-year period ended July 31, 2023, and the related notes (collectively referred to as the financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of July 31, 2023, and 2022, and the results of its consolidated operations and its cash flows for the two-year period ended July 31, 2023, in conformity with accounting principles generally accepted in the United States of America.\nThe Company's Ability to Continue as a Going Concern\nThe accompanying consolidated financial statements have been prepared assuming the Company will continue as a going concern. As discussed in Note 3 to the accompanying consolidated financial statements, the Company has negative financial trends, specifically operating loss, working capital deficiency, and other adverse key financial ratios that raises substantial doubt about the Companys ability to continue as a going concern. Managements evaluation of the events and conditions and managements plans in regarding these matters are also described in Note 3. The consolidated financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys consolidated financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, audits of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audits Matters\nThe critical audits matters communicated below are matters arising from the current period audits of the consolidated financial statements that were communicated or required to be communicated to the audits committee and that: (1) relate to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audits matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audits matter below, providing separate opinions on the critical audits matters or on the accounts or disclosures to which they relate.\nGoing Concern\nAs discussed in Note 3 the Company has negative financial trends, specifically operating loss, working capital deficiency, and other adverse key financial ratios that raises substantial doubt about the Companys ability to continue as a going concern. Auditing managements evaluation of a going concern can be a significant judgment given the fact that the Company uses management estimates on future revenues and expenses, which are difficult to substantiate.\nWe evaluated the appropriateness of the going concern, we examined and evaluated the financial information along with managements plans to mitigate the going concern and managements disclosure on going concern.\n/s/ M&K CPAS, PLLC\nwww.mkacpas.com\nWe have served as the Companys auditor since 2022.\nHouston, Texas\nDecember 29, 2023\n- -\nWB Burgers Asia, Inc.\nConsolidated Balance Sheet\nJuly 31, 2023\nJuly 31, 2022\nASSETS\nCurrent Assets\nCash and cash equivalents $ 161,213\n$ 126,669\nAccounts receivable\n62,063\n11,337\nInventories\n4,950\n4,568\nPrepaid expenses\n28,928\n51,526\nTotal Current Assets\n257,154\n194,100\nEquipment, software and leasehold improvement, net depreciation\n602,543\n805,882\nRight of use asset\n146,373\n442,025\nDeposits\n253,153\n265,115\nFranchise rights\n-\n2,053,493\nTOTAL ASSETS $ 1,259,223\n$ 3,760,615\nLIABILITIES AND STOCKHOLDERS DEFICIT\nCurrent Liabilities\nAccounts payable\n252,917\nIncome tax payable\n1,348\nLease liability, short term\n156,362\n330,066\nAccrued expenses and other payables\n2,429\n5,040\nTotal Current Liabilities\n413,056\n336,445\nLease liability, long term\n-\n148,822\nTOTAL LIABILITIES\n413,056\n485,267\nStockholders Equity (Deficit)\nPreferred stock ($0.0001 par value, 200,000,000 shares authorized; 1,000,000 issued and outstanding as of July 31, 2023 and July 31, 2022)\nCommon stock ($0.0001 par value, 1,500,000,000 shares authorized, 1,070,718,679 and 1,014,022,586 shares issued and outstanding as of July 31, 2023 and July 31, 2022, respectively)\n107,072\n101,402\nSubscription payable\n10,000\n130,392\nAdditional paid-in capital\n7,024,709\n5,272,374\nAccumulated deficit\n(5,687,400)\n(1,765,735)\nAccumulated other comprehensive income\n(608,314)\n(463,185)\nTotal Stockholders Equity\n846,167\n3,275,348\nTOTAL LIABILITIES & STOCKHOLDERS EQUITY (DEFICIT)\n1,259,223\n3,760,615\nThe accompanying notes are an integral part of these consolidated audited financial statements.\n- -\nWB Burgers Asia, Inc.\nConsolidated Statement of Operations\nYear Ended\nJuly 31, 2023\nYear Ended\nJuly 31, 2022\nRevenues $ 581,798 $ 180,821\nCost of revenue\n1,341,572\n716,083\nGross profit (loss) $ (759,774) $ (535,262)\nOperating expenses\nGeneral and administrative expenses $ 3,311,706 $ 733,744\nTotal operating expenses\n3,311,706\n733,744\nNet operating loss $ (4,071,480) $ (1,269,006)\nOther Income (Loss)\nGain on foreign currency exchange\n3,088\n60,796\nInterest income (expense)\n(24,471)\nOther income (expense)\n148,105\n(334,317)\nTotal other income (loss)\n151,196\n(297,992)\nIncome (loss) before income taxes provision $ (3,920,284) $ (1,566,998)\nProvision for income taxes\n1,381\nNet loss\n(3,921,665)\n(1,567,582)\nOther comprehensive income\nCurrency translation adjustment\n(145,129 )\n(462,412)\nComprehensive Income (Loss) $ (4,066,794) $ (2,029,994)\nBasic and Diluted net loss per common share $ (0.00) $ (0.00)\nWeighted average number of common shares outstanding - Basic and Diluted\n1,061,737,701\n951,239,800\nThe accompanying notes are an integral part of these consolidated audited financial statements.\n- -\nWB Burgers Asia, Inc.\nConsolidated Statement of Changes in Stockholders Equity (Deficit)\nFor the Years ended July 30, 2022 and July 31, 2023\nCommon Shares\nPar Value Common Shares Series A Preferred Shares\nPar Value Series A Preferred Shares\nShares Payable\nStock Receivable\nAdditional Paid-in Capital\nAccumulated Other Comprehensive Income\nAccumulated Deficit\nTotal\nBalances, July 31, 2021\n509,090,909 $ 50,909 1,000,000 $\n$\n-\n$\n(1,818,192)\n$ 1,955,557 $ (773) $ (198,153) $ (10,552)\nCommon shares sold\n4,931,677\n-\n-\n-\n-\n985,842\n-\n-\n986,335\nCommon shares issued for controlling interest of subsidiary\n500,000,000\n50,000 -\n-\n-\n-\n(50,000)\n-\n-\n-\nCommon shares sold by subsidiary\n-\n- -\n-\n-\n-\n8,673\n-\n-\n8,673\nCash received for shares to be issued\n-\n- -\n-\n130,392\n-\n-\n-\n-\n130,392\nCash received by subsidiary for shares sold\n-\n- -\n-\n-\n1,818,192\n-\n-\n-\n1,818,192\nExpenses paid on behalf of the Company and contributed to capital\n-\n- -\n-\n-\n-\n55,030\n-\n-\n55,030\nForgiveness of related party debt, net repayment\n-\n- -\n-\n-\n-\n2,317,272\n-\n-\n2,317,272\nNet loss\n-\n- -\n-\n-\n-\n-\n-\n(1,567,582)\n(1,567,582)\nForeign currency translation\n-\n- -\n-\n-\n-\n-\n(462,412)\n-\n(462,412)\nBalances, July 31, 2022\n1,014,022,586 $ 101,402 1,000,000 $ $ 130,392\n$\n-\n$ 5,272,374 $ (463,185) $ (1,765,735) $ 3,275,348\nCommon shares sold for cash\n56,696,093\n5,670\n(130,292)\n-\n1,752,335\n-\n-\n1,627,613\nCash received for shares to be issued\n-\n- -\n-\n10,000\n-\n-\n-\n-\n10,000\nNet loss\n-\n- -\n-\n-\n-\n-\n(3,921,665)\n(3,921,665)\nForeign currency translation\n-\n- -\n-\n-\n-\n-\n(145,129)\n-\n(145,129\nBalances, July 31, 2023\n1,070,718,679 $ 107,072\n1,000,000\n$ $ 10,000\n$\n-\n$ 7,024,709 $ (608,314) $ (5,687,400) $ 846,167\nThe accompanying notes are an integral part of these consolidated audited financial statements.\n- -\nWB Burgers Asia, Inc.\nConsolidated Statement of Cash Flows\nYear Ended\nJuly 31, 2023\nYear Ended\nJuly 31, 2022\nCASH FLOWS FROM OPERATING ACTIVITIES\nNet loss\n$ (3,921,665)\n$ (1,567,582)\nAdjustment to reconcile net loss to net cash provided by (used in) operating activities:\nDepreciation\n183,137\n73,669\nAmortization\n106,581\n122,659\nLoss on impairment\n1,899,666\nCapital contribution\n-\n8,673\nExpenses paid on behalf of the Company and contributed to capital\n-\n55,030\nChanges in current assets and liabilities:\nAccounts receivable\n(52,424)\n(12,758)\nInventories\n(601)\n(5,141)\nOther assets\n282,093\n(142,050)\nAccounts payable\n259,729\n7,362\nPrepaid expenses\n20,743\n(57,983)\nAccrued expenses and other payables\n(307,887)\n(124,055)\nNet cash used in operating activities\n(1,530,628)\n(1,642,176)\nCASH FLOWS FROM INVESTING ACTIVITIES\nCash paid for fixed assets\n(12,290)\n(980,539)\nNet cash used in investing activities\n(12,290)\n(980,539)\nCASH FLOWS FROM FINANCING ACTIVITIES\nCash received from the sale of stock\n1,637,774\n2,934,919\nBorrowings on debt\n-\n2,663,833\nPrincipal payments on debt\n-\n(2,910,093)\nNet cash provided by financing activities\n1,637,774\n2,688,659\nNet effect of exchange rate changes on cash\n$ (60,312)\n$ 30,704\nNet increase in cash and cash equivalents\n$ 34,544\n$ 96,648\nBeginning cash and cash equivalents balance\n126,669\n30,021\nEnding cash and cash equivalents balance\n$ 161,213\n$ 126,669\nNon-cash transactions\nForgiveness of loan from related party\n$ -\n$ 2,317,272\nShares issued for controlling interest of subsidiary\n$ -\n$ 50,000\nEstablished operating lease asset and liability\n$ -\n$ 653,704\nCash paid for:\nInterest\n$ -\n$ 24,477\nIncome taxes\n$\n$ -\nThe accompanying notes are an integral part of these consolidated audited financial statements.\n- -\nWB Burgers Asia, Inc.\nNotes to Consolidated Unaudited Financial Statements\nNote 1 - Description of Business\nWe, WB Burgers Asia, Inc., formerly known as, Business Solutions Plus, Inc. were originally incorporated in the state of Nevada on August 30, 2019.\nOn September 14, 2021, we acquired 100% of the equity interest of WB Burgers Japan Co., Ltd., a Japan Company. Following the acquisition, we ceased to be a shell company and adopted the same business plan as WB Burgers Japan Co., Ltd. WB Burgers Japan Co. (WBBJ), which we operate through and share the same business plan of, holds the rights to the Master Franchise Agreement with Jakes Franchising LLC, a Delaware Limited Liability Company, as it pertains to the establishment and operation of Wayback Burger Restaurants within the country of Japan.\nThe Master Franchise Agreement provides WBBJ the right to establish and operate Wayback Burgers restaurants in the country of Japan, and also license affiliated and unaffiliated third parties (Franchisees) to establish and operate Wayback Burgers restaurants in the Country of Japan. The Master Franchise Agreement, amongst other things, also provides WBBJ the right of first refusal to enter into a subsequent Master Franchise Agreement with Jakes Franchising, LLC to establish and operate Wayback Burgers restaurants in the Countries of Indonesia, Malaysia (Eastern Malaysia only, Western Malaysia if it becomes available as it is currently licensed to another party), the Philippines, Vietnam, China, India, Korea, Thailand, Singapore, and Taiwan.\nOn February 9, 2022, we incorporated Store Foods Co., Ltd. (Store Foods), a Japan Company. Store Foods is now a wholly owned subsidiary of the Company. Currently Koichi Ishizuka is the sole officer and director.\nAs of July 31, 2023, operations for Store Foods had not yet commenced.\nWhile our plans for Store Foods are not definitive and may change, the intended business purpose of the Company is as follows:\n1. Food sales;\n2. Food wholesale and retail;\n3. Chain organizations consisting of food retailers as members;\n4. Restaurants;\n5. Manufacturing and sales of boxed lunches for catering;\n6. Alcohol sales;\n7. Health supplement and health drink sales;\n8. Manufacturing and sales of functional foods;\n9. Lease of goods related to restaurant management;\n10. System development;\n11. Delivery;\n12. Application development and sales;\n13. Advertising;\n14. Management consulting;\n15. All businesses incidental to any of the above.\nThe Companys main office is located at 3F Ks Minamiaoyama 6-6-20 Minamiaoyama, Minato-ku, Tokyo 107-0062, Japan.\nThe Company has elected July 31st as its year end.\nNote 2 - Summary of Significant Accounting Policies\nBasis of Presentation\nThis summary of significant accounting policies is presented to assist in understanding the Company's financial statements. These accounting policies conform to accounting principles, generally accepted in the United States of America, and have been consistently applied in the preparation of the financial statements.\nUse of Estimates\nThe preparation of financial statements in conformity with generally accepted accounting principles requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. In the opinion of management, all adjustments necessary in order to make the financial statements not misleading have been included. Actual results could differ from those estimates.\nCash and Cash Equivalents\nThe Company considers all highly liquid investments with an original maturity of three months or less when purchased to be cash equivalents. Cash and cash equivalents at July 31, 2023 and July 31, 2022 were $161,213 and $126,669, respectively.\nRevenue Recognition\nThe Company adopted ASC 606, Revenue from Contracts with Customers (Topic 606) (ASC 606), in the second quarter of fiscal year 2020, as this was the first quarter that the Company generated revenues. Under ASC 606, the Company recognizes revenue when a customer obtains control of promised goods, in an amount that reflects the consideration that the Company expects to receive in exchange for the goods. To determine revenue recognition for arrangements within the scope of ASC 606, the Company performs the following five steps: (1) identify the contracts with a customer; (2) identify the performance obligations in the contract; (3) determine the transaction price; (4) allocate the transaction price to the performance obligations in the contract; and (5) recognize revenue when or as the entity satisfies a performance obligation. The Company only applies the five-step model to contracts when it is probable that the entity will collect the consideration it is entitled to in exchange for the goods it transfers to the customer. Under ASC 606, disaggregated revenue from contracts with customers depicts the nature, amount, timing, and uncertainty of revenue and cash flows affected by economic factors.\nForeign currency translation\nThe Company maintains its books and records in its local currency, Japanese YEN (JPY), which is a functional currency as being the primary currency of the economic environment in which its operation is conducted. Transactions denominated in currencies other than the functional currency are translated into the functional currency at the exchange rates prevailing at the dates of the transaction. Monetary assets and liabilities denominated in currencies other than the functional currency are translated into the functional currency using the applicable exchange rates at the balance sheet dates. The resulting exchange differences are recorded in the statements of operations.\nThe reporting currency of the Company is the United States Dollars (US$) and the accompanying consolidated financial statements have been expressed in US$. In accordance with ASC Topic 830-30, Translation of Financial Statement, assets and liabilities of the Company whose functional currency is not US$ are translated into US$, using the exchange rate on the balance sheet date. Revenues and expenses are translated at average rates prevailing during the period. The gains and losses resulting from translation of financial statements are recorded as a separate component of accumulated other comprehensive income within the statements of shareholders equity.\nTranslation of amounts from the local currency of the Company into US$1 has been made at the following exchange rates:\nJuly 31,\nCurrent JPY:US$1 exchange rate\n140.97\n134.61\nAverage JPY:US$1 exchange rate\n137.78\n119.62\nComprehensive income or loss\nASC Topic 220, Comprehensive Income, establishes standards for reporting and display of comprehensive income or loss, its components and accumulated balances. Comprehensive income or loss as defined includes all changes in equity during a period from non-owner sources. Accumulated comprehensive income, as presented in the accompanying consolidated statements of shareholders equity consists of changes in unrealized gains and losses on foreign currency translation.\nAccounts Receivable and Allowance for Doubtful Accounts\nAccounts receivable are recognized and carried at the original invoice amount less allowance for any uncollectible amounts. An estimate for doubtful accounts is made when collection of the full amount is no longer probable. Bad debts are written off as incurred.\nInventory\nInventories, consisting of products available for sale, are primarily accounted for using the first-in, first-out (FIFO) method, and are valued at the lower of cost or market value. This valuation requires the Company to make judgments, based on currently available information, about the likely method of disposition, such as through sales to individual customers, returns to product vendors, or liquidations, and expected recoverable values of each disposition category.\nFixed assets and depreciation\nProperty, plant and equipment are stated at cost less depreciation and impairment loss. The initial cost of the assets comprises its purchase price and any directly attributable costs of bringing the asset to its working condition and location for its intended use. Depreciation is calculated using the straight-line method over the shorter of the estimated useful life of the respective assets.\nROU lease assets and liabilities\nThe Company capitalizes all leased assets pursuant to ASU 2016-02, Leases (Topic 842), which requires lessees to recognize right-of-use assets and lease liability, initially measured at present value of the lease payments, on its balance sheet for leases with terms longer than 12 months and classified as either financing or operating leases. The Company excludes short-term leases having initial terms of 12 months or less from Topic 842 as an accounting policy election and recognizes rent expense on a straight-line basis over the lease term. The Company adopted the standard in the third quarter of fiscal year 2022.\nFranchise Rights and amortization\nFranchise rights are stated at cost less amortization. Initial cost of the asset comprises the deposit and fees paid to the franchisor. Amortization is calculated using the straight-line method over the life of the recognized asset, which is the duration of the contract held between the Company and the franchisor. During the year ended July 31, 2023 the Company recorded an impairment loss of $1,899,666 which reduced the value of the franchise rights asset by that amount. This impairment loss expense was deemed necessary by the Company due to insufficient revenues to offset the cost of the franchise rights and the lack of a formal franchise agreement to generate sufficient income. As of July 31, 2023, the franchise rights asset was fully amortized.\nIncome Taxes\nThe Company accounts for income taxes under ASC 740, Income Taxes. Under the asset and liability method of ASC 740, deferred tax assets and liabilities are recognized for the future tax consequences attributable to differences between the financial statements carrying amounts of existing assets and liabilities and their respective tax bases. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period the enactment occurs. A valuation allowance is provided for certain deferred tax assets if it is more likely than not that the Company will not realize tax assets through future operations. No deferred tax assets or liabilities were recognized at July 31, 2023 and July 31, 2022 except for accruals of $1,348 and $520, respectively, for Japanese income taxes payable by our wholly owned subsidiary, WB Burgers Japan Co., Ltd.\nBasic Earnings (Loss) Per Share\nThe Company computes basic and diluted earnings (loss) per share in accordance with ASC Topic 260, Earnings per Share. Basic earnings (loss) per share is computed by dividing net income (loss) by the weighted average number of common shares outstanding during the reporting period. Diluted earnings (loss) per share reflects the potential dilution that could occur if stock options and other commitments to issue common stock were exercised or equity awards vest resulting in the issuance of common stock that could share in the earnings of the Company.\nThe Company does not have any potentially dilutive instruments as of July 31, 2023 and, thus, anti-dilution issues are not applicable.\n- -\nFair Value of Financial Instruments\nThe Companys balance sheet includes certain financial instruments. The carrying amounts of current assets and current liabilities approximate their fair value because of the relatively short period of time between the origination of these instruments and their expected realization.\nASC 820, Fair Value Measurements and Disclosures, defines fair value as the exchange price that would be received for an asset or paid to transfer a liability (an exit price) in the principal or most advantageous market for the asset or liability in an orderly transaction between market participants on the measurement date. ASC 820 also establishes a fair value hierarchy that distinguishes between (1) market participant assumptions developed based on market data obtained from independent sources (observable inputs) and (2) an entitys own assumptions about market participant assumptions developed based on the best information available in the circumstances (unobservable inputs). The fair value hierarchy consists of three broad levels, which gives the highest priority to unadjusted quoted prices in active markets for identical assets or liabilities (Level 1) and the lowest priority to unobservable inputs (Level 3). The three levels of the fair value hierarchy are described below:\n- Level 1 - Unadjusted quoted prices in active markets that are accessible at the measurement date for identical, unrestricted assets or liabilities.\n- Level 2 - Inputs other than quoted prices included within Level 1 that are observable for the asset or liability, either directly or indirectly, including quoted prices for similar assets or liabilities in active markets; quoted prices for identical or similar assets or liabilities in markets that are not active; inputs other than quoted prices that are observable for the asset or liability (e.g., interest rates); and inputs that are derived principally from or corroborated by observable market data by correlation or other means.\n- Level 3 - Inputs that are both significant to the fair value measurement and unobservable.\nFair value estimates discussed herein are based upon certain market assumptions and pertinent information available to management as of July 31, 2023 and July 31, 2022. The respective carrying value of certain on-balance-sheet financial instruments approximated their fair values due to the short-term nature of these instruments. These financial instruments include accrued expenses.\nRelated Parties\nThe Company follows ASC 850, Related Party Disclosures, for the identification of related parties and disclosure of related party transactions.\nShare-Based Compensation\nASC 718, Compensation - Stock Compensation, prescribes accounting and reporting standards for all share-based payment transactions in which employee services are acquired. Transactions include incurring liabilities, or issuing or offering to issue shares, options, and other equity instruments such as employee stock ownership plans and stock appreciation rights. Share-based payments to employees, including grants of employee stock options, are recognized as compensation expense in the financial statements based on their fair values. That expense is recognized over the period during which an employee is required to provide services in exchange for the award, known as the requisite service period (usually the vesting period).\nThe Company accounts for stock-based compensation issued to non-employees and consultants in accordance with the provisions of ASC 505-50, Equity - Based Payments to Non-Employees. Measurement of share-based payment transactions with non-employees is based on the fair value of whichever is more reliably measurable: (a) the goods or services received; or (b) the equity instruments issued. The fair value of the share-based payment transaction is determined at the earlier of performance commitment date or performance completion date.\nThe Company had no stock-based compensation plans as of July 31, 2023.\nThe Companys stock-based compensation for the periods ended July 31, 2023 and July 31, 2022 were $0 for both periods.\nRecently Issued Accounting Pronouncements\nThe Company has implemented all new accounting pronouncements that are in effect and that may impact its financial statements and does not believe that there are any other new pronouncements that have been issued that might have a material impact on its financial position or results of operations.\nNote 3 - Going Concern\nThe Companys financial statements are prepared in accordance with generally accepted accounting principles applicable to a going concern that contemplates the realization of assets and liquidation of liabilities in the normal course of business.\nThe Company demonstrates adverse conditions that raise substantial doubt about the Company's ability to continue as a going concern for one year following the issuance of these financial statements. These adverse conditions are negative financial trends, specifically operating loss, working capital deficiency, and other adverse key financial ratios.\nThe Company has not established any source of revenue to cover its operating costs. Management plans to fund operating expenses with related party contributions to capital and the sale of shares of stock. There is no assurance that management's plan will be successful. The financial statements do not include any adjustments relating to the recoverability and classification of recorded assets, or the amounts and classification of liabilities that might be necessary in the event that the Company cannot continue as a going concern.\nNote 4 - Income Taxes\nIncome taxes are provided for the tax effects of transactions reported in the financial statements and consist of taxes currently due plus deferred taxes related primarily to differences between the recorded book basis and the tax basis of assets and liabilities for financial and income tax reporting. Deferred tax assets and liabilities represent the future tax return consequences of those differences, which will either be taxable or deductible when the assets and liabilities are recovered or settled. Deferred taxes are also recognized for operating losses that are available to offset future taxable income and tax credits that are available to offset future federal income taxes. The Company believes that its income tax filing positions and deductions will be sustained on audit and does not anticipate any adjustments that will result in a material adverse effect on the Companys financial condition, results of operations, or cash flow. Therefore, no reserves for uncertain income tax positions have been recorded pursuant to ASC 740.\nThe Company has not recognized an income tax benefit for its operating losses generated based on uncertainties concerning its ability to generate taxable income in future periods. The tax benefit for the period presented is offset by a valuation allowance established against deferred tax assets arising from the net operating losses, the realization of which could not be considered more likely than not. In future periods, tax benefits and related deferred tax assets will be recognized when management considers realization of such amounts to be more likely than not.\nAs of July 31, 2023, the Company has incurred a net loss of approximately $5,634,393 which resulted in a net operating loss for income tax purposes. The loss results in a deferred tax asset of approximately $1,183,223 at the effective statutory rate of 21%. The deferred tax asset has been offset by an equal valuation allowance. Given our inception on August 30, 2019, and our fiscal year end of July 31, 2022, we have completed four taxable fiscal years as of July 31, 2023.\n- -\nNote 5 - Commitments and Contingencies\nThe Company follows ASC 450-20, Loss Contingencies, to report accounting for contingencies. Liabilities for loss contingencies arising from claims, assessments, litigation, fines and penalties and other sources are recorded when it is probable that a liability has been incurred and the amount of the assessment can be reasonably estimated. There were no commitments or contingencies as of July 31, 2023 and July 31, 2022.\nNote 6 - Fixed Assets\nFixed assets are stated at cost and depreciated using the straight-line method over their estimated useful lives. When retired or otherwise disposed, the carrying value and accumulated depreciation of the fixed asset is removed from its respective accounts and the net difference less any amount realized from disposition is reflected in earnings. Expenditures for maintenance and repairs which do not extend the useful lives of the related assets are expensed as incurred.\nAs of July 31, 2023 and July 31, 2022 fixed assets were made up of the following:\nEstimated\nUseful\nLife\nJuly 31,\nJuly 31,\n(approx.. years)\nFurniture fixtures and equipment\n$ 46,224\n$ 48,408\nFurniture fixtures and equipment\n15,448\n16,178\nFurniture fixtures and equipment\n170,740\n178,807\nSoftware\n10,652\n-\nLeasehold improvement\nRemaining Lease Term\n607,457\n636,158\n879,551\nAccumulated depreciation\n(247,978 )\n(73,669)\nNet book value\n$ 602,543\n$ 805,882\nTotal depreciation expense for the periods ended July 31, 2023 and 2022, was $247,978 and $73,669, respectively, all of which was recorded in our general and administrative expenses on our statement of operations.\nNote 7 - Right of Use Asset\nThe Company capitalizes all leased assets pursuant to ASU 2016-02, Leases (Topic 842), which requires lessees to recognize right-of-use assets and lease liability, initially measured at present value of the lease payments, on its balance sheet for leases with terms longer than 12 months and classified as either financing or operating leases. The Company excludes short-term leases having initial terms of 12 months or less from Topic 842 as an accounting policy election and recognizes rent expense on a straight-line basis over the lease term. The Company adopted the standard in the third quarter of fiscal year 2022.\nOur adoption of ASU 2016-02, Leases (Topic 842), and subsequent ASUs related to Topic 842, requires us to recognize substantially all leases on the balance sheet as an ROU asset and a corresponding lease liability. The new guidance also requires additional disclosures as detailed below.\nWe determine if a contract is a lease at the inception of the arrangement. We review all options to extend, terminate, or purchase the ROU assets, and when reasonably certain to exercise, we include the option in the determination of the lease term and lease liability.\nLease ROU assets and liabilities are recognized at commencement date of the lease, based on the present value of lease payments over the lease term. The lease ROU asset also includes any lease payments made and excludes any lease incentives. When readily determinable, we use the implicit rate in determining the present value of lease payments. When leases do not provide an implicit rate, we use our incremental borrowing rate based on the information available at the lease commencement date, including the lease term.\nThe tables below present financial information associated with our leases. As noted above, we adopted Topic 842 using a transition method that does not require application to periods prior to adoption. The initial recognition of the ROU operating lease was $653,704 for both the ROU asset and ROU liability. As of July 31, 2023, the ROU lease liability was $156,362.\nBalance Sheet Classification July 31, 2023 July 31, 2022\nRight-of-use assets Lease asset long $ 146,373 $ 442,025\nCurrent lease liabilities Short-term lease liability\n156,362\n330,066\nNon-current lease liabilities Lease liability long term 　 - 　 148,822\nMaturities of lease liabilities as of July 31, 2023 are as follows:\n156,362\n-\nand beyond -\nTotal 156,362\nAdd(Less): Imputed interest -\nPresent value of lease liabilities 156,362\nNote 8 - Deposits\nDuring the period ended July 31, 2022, the Company paid two security deposits for the leased office and restaurant space totaling approximately $253,153 at the July 31, 2023 exchange rate.\nNote 9 - Franchise Rights\nOn June 9, 2021, our wholly owned subsidiary, WB Burgers Japan Co., Ltd (WBBJ), entered into a Master Franchise Agreement with Wayback Burgers. Compensation of approximately $2,275,204 was paid by WBBJ to Jake Franchise for these franchise rights. These funds were borrowed from related party White Knight. In addition, White Knight paid approximately $395,673 directly to Jake Franchise which was also considered a loan to the company. These payments were originally combined as a loan to the Company and $2,317,272 of this loan has since been forgiven and is posted as additional paid-in capital. The Franchise rights are being amortized over a 20 year period. The amortization expense was approximately $122,659 for the period ended July 31, 2022. As of July 31, 2023, the franchise asset was fully amortized with approximately $1,899,666 recorded as loss on impairment of the asset.\n- -\nNote 10 - Accrued Expenses and Other Payables\nAccrued expenses and other payables totaled $2,429 and $5,040 at July 31, 2023 and July 31, 2022, respectively, and consisted primarily of withholding taxes.\nNote 11 - Shareholder Equity\nPreferred Stock\nThe authorized preferred stock of the Company consists of 200,000,000 shares with a par value of $0.0001. There were 1,000,000 Series A preferred shares issued and outstanding as of July 31, 2023 and July 31, 2022. Our Certificate of Incorporation authorizes the issuance of up to 200,000,000 shares of Preferred Stock with designations, rights and preferences to be determined from time to time by our Board of Directors. Accordingly, our Board of Directors is empowered, without stockholder approval, to issue Preferred Stock with dividend, liquidation, conversion, voting, or other rights which could adversely affect the voting power or other rights of the holders of the Common Stock. In the event of issuance, the Preferred Stock could be utilized, under certain circumstances, as a method of discouraging, delaying or preventing a change in control of the Company. Although we have no present intention to issue any shares of our authorized Preferred Stock, there can be no assurance that we will not do so in the future.\nOf the 200,000,000 shares of preferred stock, 1,000,000 shares are designated as Series A Preferred Stock, $0.0001 par value each. Series A Preferred stock pay no dividends, have no right to convert into common stock or any other class of securities of the Corporation, and each share of Series A Preferred Stock shall have voting rights equal to one thousand (1,000) votes of Common Stock. With respect to all matters upon which stockholders are entitled to vote or to which stockholders are entitled to give consent, the holders of the outstanding shares of Series A Preferred Stock shall vote together with the holders of Common Stock without regard to class, except as to those matters on which separate class voting is required by applicable law or the Corporation's Certificate of Incorporation or by-laws.\nCommon Stock\nAs of July 31, 2023, and July 31, 2022, the authorized common stock of the Company consists of 1,500,000,000 shares with a par value of $0.0001. There were 1,070,718,679 and 1,014,022,586 shares of common stock issued and outstanding as of July 31, 2023 and July 31, 2022, respectively.\nOn August 8, 2022, we sold 1,586,538 shares of restricted Common Stock to Takahiro Fujiwara, a Japanese Citizen, at a price of $0.032 per share of Common Stock. The total subscription amount paid by Takahiro Fujiwara was approximately $50,769. Takahiro Fujiwara is not a related party to the Company.\nOn August 8, 2022, we sold 2,403,846 shares of restricted Common Stock to Shokafulin LLP, a Japanese Company, at a price of $0.032 per share of Common Stock. The total subscription amount paid by Shokafulin LLP was approximately $79,623. Shokafulin LLP is not a related party to the Company.\nOn August 12, 2022, we sold 32,065,458 shares of restricted Common Stock to Asset Acceleration Axis, LLC, a Japanese Company, at a price of $0.034 per share of Common Stock. The total subscription amount paid by Asset Acceleration Axis, LLC was approximately $1,090,226 . Asset Acceleration Axis, LLC is not a related party to the Company.\nOn September 13, 2022, we sold 7,262,324 shares of restricted Common Stock to Asset Acceleration Axis, LLC, a Japanese Company, at a price of $0.032 per share of Common Stock. The total subscription amount paid by Asset Acceleration Axis, LLC was approximately $232,395. Asset Acceleration Axis, LLC is not a related party to the\nCompany.\nOn February 6, 2023, we sold 10,033,445 shares of restricted Common Stock to Kazuya Iwasaki, a Japanese Citizen, at a price of $0.023 per share of Common Stock. The total subscription amount paid by Kazuya Iwasaki was approximately $230,769. Kazuya Iwasaki is not a related party to the Company.\nOn February 6, 2023, we sold 3,344,482 shares of restricted Common Stock to Shokafulin LLP, a Japanese Company, at a price of $0.023 per share of Common Stock. The total subscription amount paid by Shokafulin LLP was approximately $76,923. Shokafulin LLP is not a related party to the Company.\nAdditional Paid-In Capital\nDuring the period ended July 31, 2022, White Knight forgave a loan to the Company of approximately $2,317,272, which is recorded as additional paid-in capital.\nThe Companys sole officer and director, Koichi Ishizuka, paid expenses on behalf of the Company totaling $55,030 during the period ended July 31, 2022. These payments are considered contributions to the company with no expectation of repayment and are posted as additional paid-in capital.\nDuring the year ended July 31, 2022, the Company recognized donated capital from its wholly owned subsidiary, Store Foods, as additional paid-in capital in the amount of $8,673.\nShares payable\nDuring the period ended July 31, 2023, the Company received funds totaling approximately $10,000 to be used to finalize the sale of common shares which took place August 9, 2023 (see Note 13).\nOn or about December 30, 2022, the Company received funds totaling approximately $307,692 from two perspective shareholders to be used to finalize the sale of common shares, which took place February 6, 2023. No shares were issued until February 6, 2023 (see common stock).\nOn or about July 29, 2022, the Company received funds totaling approximately $130,392 from two perspective shareholders to be used to finalize the sale of common shares, which took place August 8, 2022. No shares were issued until August 8, 2022. The $130,392 was reclassed as cash received by subsidiary for the sale of common\nshares during the period ended October 31, 2022.\nNote 12 - General and Administrative Expense\nTotal general and administrative expense for the year ended July 31, 2023 includes a loss on impairment totaling $1,899,666. This impairment loss is related to the Companys adjustment to the value of the franchise rights asset.\nNote 13 - Related-Party Transactions\nCompensation Expense\nDuring the period ending July 31, 2023, the Company paid White Knight Co., Ltd. $917,895 for compensation expenses.\nPartnership and Licensing agreement\nDuring the period ended July 31, 2023, we operated a ghost kitchen, called Next Restaurant, in partnership with Next Meats Holdings, Inc. (Next Meats). Our CEO, Koichi Ishizuka, is the majority shareholder and CEO of Next Meats. The Company has a licensing agreement with Next Meats related to the Next Restaurant operations whereby the Company pays a 1% royalty fee to Next Meats based on revenue earned from selling Next Meats products. As of July 31, 2023, the royalty liability owed to Next Meats was approximately $37.\nAdditional Paid-In Capital\nDuring the period ended July 31, 2022, White Knight forgave a loan to the Company of approximately $2,317,272, which is recorded as additional paid-in capital.\nThe Companys sole officer and director, Koichi Ishizuka, paid expenses on behalf of the Company totaling $55,030 during the period ended July 31, 2022. These payments are considered contributions to the company with no expectation of repayment and are posted as additional paid-in capital.\nNote 14 - Subsequent Events\nOn August 9, 2023, the Company sold 434,783 shares of restricted Common Stock to Takahiro Fujiwara, a Japanese Citizen, at a price of $0.023 per share of Common Stock. The total subscription amount paid by Takahiro Fujiwara was approximately $10,000. Takahiro Fujiwara is not a related party to the Company.\nThe Company intends to use the proceeds from the aforementioned sale of shares for working capital.\nOn August 17, 2023, our majority shareholder, White Knight Co., Ltd., and Koichi Ishizuka, our sole Officer and Director, executed a resolution to ratify, affirm, and approve to file an Amended and Restated Certificate of Incorporation.\nThe Amended and Restated Certificate of Incorporation was filed with the Nevada Secretary of State on August 17, 2023, effective immediately.\nThe Amended and Restated Certificate of Incorporation resulted in an increase to the authorized shares of our Common Stock from One Billion Five Hundred Million (1,500,000,000) to Five Billion (5,000,000,000). It also revised the rights of Series A Preferred Stock, now allowing each one (1) share of Series A Preferred Stock to be converted into one thousand (1,000) shares of Common Stock at the discretion of the holder(s) of Series A Preferred Stock.\nOn August 18, 2023, our majority shareholder, White Knight Co., Ltd., a Japanese Company, owned and controlled by our sole Officer and Director, Koichi Ishizuka, elected to convert its 1,000,000 shares of Series A Preferred Stock of WB Burgers Asia, Inc. into shares of Common Stock. This conversion has been approved by the Company, and the conversion became effective on August 18, 2023. Every 1 share of Series A Preferred Stock was converted into 1,000 shares of Common Stock, for a total of 1,000,000,000 shares of Common Stock.\nOn or about September 12, 2023, we sold 1,488,982 shares of restricted common stock to Shokafulin LLP, a Japanese Company, which is controlled by Takuya Watanabe, a Japanese citizen, at a price of approximately $0.023 per share of common stock.\nThe total subscription amount paid by Shokafulin LLP was approximately $34,247. Shokafulin LLP and Mr. Watanabe are not related parties to the Company.\nThe proceeds from the above sale of shares went to the Company to be used for working capital.\nFollowing the above conversion, and as of December 29, 2023, there were 2,072,642,444 shares of Common Stock and 0 shares of Preferred Stock issued and outstanding.\nAt this time, we are pending review of a FINRA corporate action, to effect a 100 to 1 Reverse Stock Split. Pursuant to the action, there is to be no change in the quantity of our authorized shares of Common Stock or Preferred Stock.\nThe legal date of the Certificate of Change that we have filed with the Nevada Secretary of State on December 6, 2023, in connection with our Reverse Stock Split, will not be the same exact date as the FINRA effective date of our Reverse Stock Split.\n- - Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure.\nNone. Item 9A. Controls and Procedures.\nDisclosure Controls and Procedures\nThe Company has adopted and maintains disclosure controls and procedures that are designed to provide reasonable assurance that information required to be disclosed in the reports filed under the Exchange Act, such as this annual report, is collected, recorded, processed, summarized and reported within the time periods specified in the rules of the SEC. The Companys disclosure controls and procedures are also designed to ensure that such information is accumulated and communicated to management to allow timely decisions regarding required disclosure. As required under Exchange Act Rule 13a-15, the Companys Chief Chief Executive Officer who also serves as our Principal Financial Officer, Koichi Ishizuka, has conducted an evaluation of the effectiveness of disclosure controls and procedures as of the end of the period covered by this report. Based on that evaluation, Koichi Ishizuka, concluded that the disclosure controls and procedures are ineffective.\nOur Chief Executive Officer and Chief Financial Officer, Koichi Ishizuka, has reviewed the effectiveness of our disclosure controls and procedures (as defined in Rules 13a-15(f) and 15d-15(f) of the Exchange Act) as of the end of the period covered by the report July 31, 2023 and has concluded that (i) the Companys disclosure controls and procedures are not effective to ensure that material information relating to the Company is recorded, processed, summarized, and reported within the time periods specified in the rules and forms of the Commission, and (ii) the Companys controls and procedures have not been designed to ensure that information required to be disclosed by the Company in the reports that it files or submits under the Exchange Act is accumulated and communicated to the Company's management, including its principal executive and principal financial officers, or persons performing similar functions, as appropriate to allow timely decisions regarding required disclosure.\nManagements Report on Internal Control over Financial Reporting\nThe Companys management, which at this time consists solely of Koichi Ishizuka, is responsible for establishing and maintaining adequate internal control over financial reporting, as defined in Exchange Act Rule 13a-15(f). The Companys internal control over financial reporting is designed to provide reasonable assurance to the Companys management and board of directors regarding the preparation and fair presentation of published financial statements. Management conducted an assessment of the Companys internal control over financial reporting based on the framework and criteria established by the Committee of Sponsoring Organizations of the Treadway Commission in Internal Control - Integrated Framework. Based on the assessment, management concluded that, as of July 31, 2023, the Companys internal control over financial reporting is ineffective based on those criteria.\nThe Companys management, Koichi Ishizuka, who serves as our Chief Executive Officer, and Chief Financial Officer, does not expect that the Companys disclosure controls and procedures and its internal control processes will prevent all error and all fraud. A control system, no matter how well conceived and operated, can provide only reasonable, not absolute, assurance that the objectives of the control system are met. Further, the design of a control system must reflect the fact that there are resource constraints, and the benefits of controls must be considered relative to their costs. Because of the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues and instances of error or fraud, if any, within the Company have been detected. These inherent limitations include the realities that judgments in decision-making can be faulty, and that the breakdowns can occur because of simple error or mistake. Additionally, controls can be circumvented by the individual acts of some persons, by collusion of two or more people, or by management override of the control. The design of any system of controls also is based in part upon certain assumptions about the likelihood of future events, and there can be no assurance that any design will succeed in achieving its stated goals under all potential future conditions. Over time, controls may become inadequate because of changes in conditions, or the degree of compliance with the policies or procedures may deteriorate. Because of the inherent limitations in a cost-effective control system, misstatements due to error or fraud may occur and may not be detected. However, these inherent limitations are known features of the financial reporting process. Therefore, it is possible to design into the process safeguards to reduce, though not eliminate, this risk.\nThe matters involving internal controls and procedures that our sole officer and director, Koichi Ishizuka, considered to be material weaknesses under the standards of the Committee of Sponsoring Organizations of Treadway Commission were: domination of management by a single individual without adequate compensating controls, lack of a majority of outside directors on board of directors, resulting in ineffective oversight in the establishment and monitoring of required internal controls and procedures; inadequate segregation of duties consistent with control objectives, and lack of an audit committee.\nThe Company believes that the material weaknesses are due to the Companys limited resources and early stages of development, which have not allowed enough time for the Company to remedy any such weaknesses.\nOur sole officer and director, Koichi Ishizuka, believes that the material weaknesses did not have an effect on our financial results. However, management believes that the lack of a functioning audit committee and inadequate segregation of duties results in ineffective oversight in the establishment and monitoring of required internal controls and procedures, which could result in a material misstatement in our financial statements in future periods.\nOur Chief Executive Officer recognizes that its controls and procedures would be substantially improved if we had an audit committee and or two individuals serving as officers, and as such, is actively seeking to remediate this issue.\nManagements Remediation Initiatives\nIn an effort to remediate the identified material weaknesses and other deficiencies and enhance our internal controls, we have initiated, or plan to initiate, the following series of measures:\nWe intend to create a position to segregate duties consistent with control objectives and will increase our personnel resources and technical accounting expertise within the accounting function when funds are available to us. Furthermore, we plan to appoint one or more outside directors to our board of directors who shall be appointed to an audit committee resulting in a fully functioning audit committee who will undertake the oversight in the establishment and monitoring of required internal controls and procedures such as reviewing and approving estimates and assumptions made by management when funds are available to us.\nManagement believes that the appointment of one or more outside directors, who shall be appointed to a fully functioning audit committee, will remedy the lack of a functioning audit committee and a lack of a majority of outside directors on our Board.\nWe will work as quickly as possible to implement these initiatives however, the early stages of our current development, and other business initiatives will likely slow this implementation or divert our attention.\nAuditors Report on Internal Control Over Financial Reporting\nThis Report does not include an attestation report of our independent registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by our independent registered public accounting firm pursuant to the rules of the SEC that permit us to provide only managements report in this Report.\nChanges in Internal Control Over Financial Reporting\nThere have been no changes in our internal control over financial reporting (as that term is defined in Rules 13(a)-15(f) and 15(d)-15(f) of the Exchange Act) that have occurred during the fourth quarter ended July 31, 2023, that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. Item 9B. Other Information.\nNone.\n- 16 -\nPART III Item 10. Directors, Executive Officers and Corporate Governance.\nMr. Koichi Ishizuka, Age 53 - Chief Executive Officer, Chief Financial Officer, President, Director, Secretary, and Treasurer\nBackground of Mr. Koichi Ishizuka\nMr. Koichi Ishizukas academic journey includes earning his MBA from the University of Aoyama Gakuin in 2004 and completing the Advanced Management Program at Harvard School of Business in 2011. Stepping into the professional arena, he commenced as the head of marketing at Thomson Reuters, a prominent mass media and information firm. His career trajectory led him to pivotal roles, serving as CEO for Xinhua Finance Japan in 2006, Fate Corporation in 2008, and LCA Holdings, Ltd. in 2009.\nPresently, Mr. Ishizuka holds the position of Chief Executive Officer across a spectrum of companies, including OFF Line Co., Ltd., Photozou Co., Ltd., Photozou Holdings, Inc., Photozou Koukoku Co., Ltd., Off Line International, Inc., and OFF Line Japan Co., Ltd. He has held the position of CEO with OFF Line Co., Ltd. since 2013, Photozou Co., Ltd. since 2016, Photozou Holdings, Inc. since 2017, Photozou Koukoku Co., Ltd. since 2017, Zentrum Holdings, Inc. (formerly known as Off Line International, Inc.) since 2019, and OFF Line Japan Co., Ltd. since 2018. On November 18, 2020, Koichi Ishizuka assumed the roles of Chief Financial Officer and Director of Next Meats Holdings, Inc., followed by his appointment as Chief Executive Officer on December 28, 2021. He continues to hold these positions to this day, and additionally maintains a controlling interest in Next Meats Holdings, Inc. Additionally, he serves as the Chief Financial Officer of Next Meats Co., Ltd., a Japanese alternative meat company and wholly owned subsidiary of Next Meats Holdings, Inc.\nSince its inception on April 14, 2021, Koichi Ishizuka has served as CEO of WB Burgers Japan Co., Ltd., a Japanese company. On May 7, 2021, Mr. Koichi Ishizuka was appointed as the Chief Executive Officer, Chief Financial Officer, President, Secretary, Treasurer, and Director of Business Solutions Plus, Inc., which is now known as WB Burgers Asia, Inc. WB Burgers Japan Co., Ltd. is a wholly owned subsidiary of WB Burgers Asia, Inc. WB Burgers Japan Co., Ltd. holds the rights to the Master Franchise Agreement with Jakes Franchising LLC, a Delaware Limited Liability Company, as it pertains to the establishment and operation of Wayback Burger Restaurants within the country of Japan. On July 23, 2021, Mr. Ishizuka was appointed as Chief Executive Officer, Chief Financial Officer, President, Treasurer, and Director of Dr. Foods, Inc. (formerly known as Catapult Solutions, Inc.). Koichi Ishizuka has a controlling interest in Dr. Foods, Inc. On March 21, 2022, Mr. Ishizuka was appointed as the Chief Executive Officer, Chief Financial Officer, President, Secretary, Treasurer, and Director of WeCapital Holdings, Inc., (formerly known as Perfect Solutions Group, Inc.).\nGiven Mr. Ishizukas extensive business acumen and long standing entrepreneurial background, the company firmly believes that Koichi Ishizuka is well-suited to continue to serve as our sole officer and director.\nAs of the date of this filing, there has been no material plan, contract, or arrangement (whether or not written) to which our sole officer and director, Koichi Ishizuka, is a party in connection with his appointments at WB Burgers Asia, Inc.\nEmployees\nAs of December 29, 2023, we, WB Burgers Asia, Inc., have no employees outside of our sole officer and director, Koichi Ishizuka. We do not have an employment or consulting agreement with Mr. Ishizuka. Mr. Ishizuka has not received any monetary compensation by the Company and or its subsidiaries through our most recent fiscal year end July 31, 2023.\nOur wholly subsidiary, WB Burgers Japan Co., Ltd. has thirty nine salaried staff members. Four employees are full time, and thirty five employees are part time. The employees are comprised primarily of staff members who operate our restaurant location.\nDirectors Term of Office\nOur current director holds office until the next annual meeting of our stockholders or until his successor has been elected and qualified, or until his death, resignation, or removal. Our executive officers are appointed by our Board and hold office until their death, resignation, or removal from office.\nCorporate Governance\nThe Company promotes accountability for adherence to honest and ethical conduct; endeavors to provide full, fair, accurate, timely and understandable disclosure in reports and documents that the Company files with the Securities and Exchange Commission (the SEC) and in other public communications made by the Company; and strives to be compliant with applicable governmental laws, rules and regulations. The Company has not formally adopted a written code of business conduct and ethics that governs the Companys employees, officers and directors as the Company is not required to do so.\nIn lieu of an Audit Committee, the Companys Board of Directors, consisting solely of Koichi Ishizuka, is responsible for reviewing and making recommendations concerning the selection of outside auditors, reviewing the scope, results and effectiveness of the annual audit of the Company's financial statements and other services provided by the Companys independent public accountants. Our sole officer and director reviews the Company's internal accounting controls, practices, and policies.\nCommittees of the Board\nOur Company currently does not have nominating, compensation, or audit committees or committees performing similar functions nor does our Company have a written nominating, compensation or audit committee charter. Currently, our sole officer and director, Koichi Ishizuka, is performing the functions of such committees.\nAudit Committee Financial Expert\nOur Board has determined that we do not have a board member that qualifies as an audit committee financial expert as defined in Item 407(D)(5) of Regulation S-K, nor do we have a Board member that qualifies as independent as the term is used in Item 7(d)(3)(iv)(B) of Schedule 14A under the Securities Exchange Act of 1934, as amended, and as defined by Rule 4200(a)(14) of the FINRA Rules.\nWe believe that our sole director, Koichi Ishizuka, is currently capable of analyzing and evaluating our financial statements and understanding internal controls and procedures for financial reporting.\nInvolvement in Certain Legal Proceedings\nOur sole officer and director has not been involved in any of the following events during the past ten years:\n1. bankruptcy petition filed by or against any business of which such person was a general partner or executive officer either at the time of the bankruptcy or within two years prior to that time;\n2. any conviction in a criminal proceeding or being subject to a pending criminal proceeding (excluding traffic violations and other minor offenses);\n3. being subject to any order, judgment, or decree, not subsequently reversed, suspended or vacated, of any court of competent jurisdiction, permanently or temporarily enjoining, barring, suspending or otherwise limiting his/her involvement in any type of business, securities or banking activities; or\n4. being found by a court of competent jurisdiction (in a civil action), the Commission or the Commodity Futures Trading Commission to have violated a federal or state securities or commodities law, and the judgment has not been reversed, suspended, or vacated.\n5. Such person was found by a court of competent jurisdiction in a civil action or by the Commission to have violated any Federal or State securities law, and the judgment in such civil action or finding by the Commission has not been subsequently reversed, suspended, or vacated;\n6. Such person was found by a court of competent jurisdiction in a civil action or by the Commodity Futures Trading Commission to have violated any Federal commodities law, and the judgment in such civil action or finding by the Commodity Futures Trading Commission has not been subsequently reversed, suspended or vacated;\n7. Such person was the subject of, or a party to, any Federal or State judicial or administrative order, judgment, decree, or finding, not subsequently reversed, suspended or vacated, relating to an alleged violation of:(i) Any Federal or State securities or commodities law or regulation; or(ii) Any law or regulation respecting financial institutions or insurance companies including, but not limited to, a temporary or permanent injunction, order of disgorgement or restitution, civil money penalty or temporary or permanent cease-and-desist order, or removal or prohibition order; or(iii) Any law or regulation prohibiting mail or wire fraud or fraud in connection with any business entity; or\n8. Such person was the subject of, or a party to, any sanction or order, not subsequently reversed, suspended or vacated, of any self-regulatory organization (as defined in Section 3(a)(26) of the Exchange Act (15 U.S.C. 78c(a)(26))), any registered entity (as defined in Section 1(a)(29) of the Commodity Exchange Act (7 U.S.C. 1(a)(29))), or any equivalent exchange, association, entity or organization that has disciplinary authority over its members or persons associated with a member.\nIndependence of Directors\nWe are not required to have independent members of our Board of Directors, and currently we do not have any independent Directors.\nCode of Ethics\nWe have not adopted a formal Code of Ethics. The Board of Directors evaluated the business of the Company and the number of employees and determined that since the business is operated by a small number of persons, general rules of fiduciary duty and federal and state criminal, business conduct and securities laws are adequate ethical guidelines. In the event our operations, employees and/or Directors expand in the future, we may take actions to adopt a formal Code of Ethics.\nShareholder Proposals\nOur Company does not have any defined policy or procedural requirements for shareholders to submit recommendations or nominations for Directors. The Board of Directors, which presently consists solely of Koichi Ishizuka, believes that, given the stage of our development, and our limited resources, a specific nominating policy would be premature and of little assistance until our business operations develop to a more advanced level. Our Company does not currently have any specific or minimum criteria for the election of nominees to the Board of Directors and we do not have any specific process or procedure for evaluating such nominees. The Board of Directors will assess all candidates, whether submitted by management or shareholders, and make recommendations for election or appointment.\nA shareholder who wishes to communicate with our Board of Directors may do so by directing a written request addressed to our Chief Executive Officer, Koichi Ishizuka, at the address appearing on the first page of this Annual Report.\n- 17 - Item 11. Executive Compensation.\nSummary Compensation Table:\nName and\nprincipal position\nYear Ended July 31 Salary\n($)\nBonus\n($)\nStock\nAwards\n($)\nOption\nAwards\n($)\nNon-Equity\nIncentive Plan\nCompensation\n($)\nNonqualified\nDeferred\nCompensation\nEarnings ($)\nAll Other\nCompensation\n($)\nTotal\n($)\nKoichi Ishizuka\nChief Executive Officer, Chief Financial Officer, President, Secretary, Treasurer, and Director (1)\n0 917,895 917,895\n0 0\n(1) The row indicating compensation paid to Koichi Ishizuka includes monetary payments made by the Company and/or its wholly-owned subsidiaries to White Knight Co., Ltd., a Japanese entity controlled by our sole officer and director, Koichi Ishizuka.\nDuring the period ending July 31, 2023, the Company paid White Knight Co., Ltd. $917,895 for compensation expenses.\nCompensation of Directors\nThe table above summarizes the compensation of our directors, of whom we have one at this time, through our most recent fiscal year ending July 31, 2023.\nStock Option Grants\nWe have not granted any stock options to our executive officers, since our incorporation.\nEmployment Agreements\nWe do not have an employment or consulting agreement with our sole officer and director.\n- 18 - Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nAs of December 29, 2023, the Company has 2,072,642,444 shares of Common Stock and no shares of Preferred Stock issued and outstanding.\nAs of December 29, 2023, we have 2,072,642,444 shares of Common Stock and 0 shares of Preferred Stock issued and outstanding.\nAt this time, we are pending review of a FINRA corporate action, to effect a 100 to 1 Reverse Stock Split. Pursuant to the action, there is to be no change in the quantity of our authorized shares of Common Stock or Preferred Stock.\nThe legal date of the Certificate of Change that we have filed with the Nevada Secretary of State on December 6, 2023, in connection with our Reverse Stock Split, will not be the same exact date as the FINRA effective date of our Reverse Stock Split. The figures herein, do not account for the aforementioned reverse stock split.\nUnless otherwise noted, the address for each of the below parties is the same as that for the Company.\nName and Address of Beneficial Owner Shares of Common Stock Beneficially Owned Common Stock Voting Percentage Beneficially Owned Voting Shares Preferred Stock Are Able to Vote Preferred Stock Voting Percentage Beneficially Owned Total Voting Percentage Beneficially Owned (1)\nExecutive Officers and Directors\nKoichi Ishizuka 1 101,363,636 4.891% - - 4.891%\n5% or greater Shareholders (of any class)\nWhite Knight Co., Ltd. 2 1,525,575,514 73.605% - - 73.605%\nTotal 1,626,939,150 77.39% - - 78.496%\nThe row above for Koichi Ishizuka denotes shares held under his personal name and does not include those shares held indirectly through White Knight Co., Ltd. Collectively, with White Knight Co., Ltd., Koichi Ishizuka retains control of 1,626,939,150 shares of Common Stock.\nWhite Knight Co., Ltd., is owned entirely by our sole officer and director, Koichi Ishizuka.\nBeneficial ownership has been determined in accordance with Rule 13d-3 under the Exchange Act. Under this rule, certain shares may be deemed to be beneficially owned by more than one person (if, for example, persons share the power to vote or the power to dispose of the shares). In addition, shares are deemed to be beneficially owned by a person if the person has the right to acquire shares (for example, upon exercise of an option or warrant) within 60 days of the date as of which the information is provided. In computing the percentage ownership of any person, the amount of shares is deemed to include the amount of shares beneficially owned by such person by reason of such acquisition rights. As a result, the percentage of outstanding shares of any person as shown in the following table does not necessarily reflect the persons actual voting power at any particular date. Item 13. Certain Relationships and Related Transactions, and Director Independence.\nCompensation Expense\nDuring the period ending July 31, 2023, the Company paid White Knight Co., Ltd. $917,895 for compensation expenses. White Knight Co., Ltd. is owned and controlled by our sole officer and director, Koichi Ishizuka.\nAdditional Paid-In Capital\nDuring the period ended July 31, 2022, White Knight forgave a loan to the Company of approximately $2,317,272, which is recorded as additional paid-in capital.\nThe Companys sole officer and director, Koichi Ishizuka, paid expenses on behalf of the Company totaling $55,030 during the period ended July 31, 2022. These payments are considered contributions to the company with no expectation of repayment and are posted as additional paid-in capital.\nPurchase of wholly owned subsidiary\nOn September 14, 2021, we entered into an Acquisition Agreement with related party White Knight Co., Ltd., a Japan Company, whereas we issued 500,000,000 shares of restricted common stock to White Knight Co., Ltd., in exchange for 100% of the equity interests of WB Burgers Japan Co., Ltd., a Japan Company. Pursuant to the agreement, on October 1, 2021, White Knight Co., Ltd. has agreed to, and has subsequently forgiven any outstanding loans with WB Burgers Japan Co., Ltd. as of October 1, 2021. Following this transaction, WB Burgers Japan Co., Ltd. became our wholly owned subsidiary which we now operate through.\nIn regards to the above transaction, the Company claims an exemption from registration afforded by Section Regulation S of the Securities Act of 1933, as amended (\"Regulation S\") for the above sales/issuances of the stock since the sales/issuances of the stock were made to non-U.S. persons (as defined under Rule 902 section (k)(2)(i) of Regulation S), pursuant to offshore transactions, and no directed selling efforts were made in the United States by the issuer, a distributor, any of their respective affiliates, or any person acting on behalf of any of the foregoing.\nAdditional Information\nDuring the period ended July 31, 2023, and through the date of this Annual Report, December 29, 2023 we operated and continue to operate a ghost kitchen, called Next Restaurant, in partnership with Next Meats Holdings, Inc. The Company holds a licensing agreement with Next Meats pertaining to Next Restaurant operations, whereby the Company pays a 1% royalty fee to Next Meats based on revenue earned from the sale of Next Meats products. As of July 31, 2023, the royalty liability owed to Next Meats was approximately $37. Next Restaurant shares the same kitchen space as the Companys Omotesando location situated at 6-19-20 No.15 Arai Bldg Jingumae Shibuya-Ku, Tokyo, Japan. This location serves as the Companys flagship and sole physical dine-in location. Products from Next Restaurant can be enjoyed either within the premises or taken out, as the ghost kitchen operates in conjunction with the Companys flagship Wayback Burgers restaurant at the same location.\nKoichi Ishizuka is an executive officer and director of Next Meats Holdings, Inc., and through his direct and indirect ownership of Next Meats Holdings, Inc., he is deemed to be the controlling shareholder of Next Meats Holdings, Inc.\nFrom time to time, we purchase food products that we offer through our menu items from Mama Foods Co., Ltd., a Japanese Company owned and controlled by our sole officer and director, Koichi Ishizuka.\n- 19 -\nReview, Approval and Ratification of Related Party Transactions\nGiven our small size and limited financial resources, we have not adopted formal policies and procedures for the review, approval or ratification of transactions, such as those described above, with our executive officer, director and significant stockholders. We intend to establish formal policies and procedures in the future, once we have sufficient resources and have appointed additional directors, so that such transactions will be subject to the review, approval or ratification of our Board of Directors, or an appropriate committee thereof. On a moving forward basis, our sole officer and director, Koichi Ishizuka, will continue to approve any related party transaction. Item 14. Principal Accounting Fees and Services.\nBelow is the approximate aggregate amount of fees billed for professional services rendered by our principal accountants with respect to our last two fiscal year ends, each having ended July 31st.\nAudit fees BF Borgers CPA PC $- $21,600\nAudit related fees BF Borgers CPA PC $- -\nAudit fees M&K CPAS, PLLC $76,000 $39,250\nAudit related fees M&K CPAS, PLLC $- -\nTax fees\n- -\nAll other fees\n- -\nTotal\n$76,000 $60,850\nAudit fees represent the professional services rendered for the audit of our annual financial statements and the review of our financial statements included in quarterly reports, along with services normally provided by the accounting firm in connection with statutory and regulatory filings or engagements. These values are approximations. Audit-related fees represent professional services rendered for assurance and related services by the accounting firm that are reasonably related to the performance of the audit or review of our financial statements that are not reported under audit fees. These are also approximations.\nTax fees represent professional services rendered by the accounting firm for tax compliance, tax advice, and tax planning. All other fees represent fees billed for products and services provided by the accounting firm, other than the services reported for in the other categories.\n- 20 -\nPART IV Item 15. Exhibits, Financial Statement Schedules.\n(a) Financial Statements\n1. Financial statements for our company are listed in the index under Item 8 of this document.\n2. All financial statement schedules are omitted because they are not applicable, not material or the required information is already shown in the financial statements or notes.\n(b) Exhibits required by Item 601 of Regulation S-K.\nExhibit No.\nDescription\n3.1\nRestated Articles of Incorporation (1)\n3.1 (i)\nCertificate of Amendment (2)\n3.1 (ii)\nCertificate of Amendment (3)\n3.1 (iii)\nAmended and Restated Certificate of Incorporation (4)\n3.1 (iv)\nCertificate of Change (5)\n3.2\nBy-laws (6)\n10.1\nMaster Franchise Agreement (7)\nCertification of the Companys Principal Executive and Prinipal Financial Officer pursuant to the Securities Exchange Act Rules 13a-14(a) and 15d-14(a), as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 (8)\nCertification of the Companys Principal Executive and Principal Financial Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002 (8)\n101.SCH\nInline XBRL Taxonomy Extension Schema Document\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibits 101)\n_________________\n(1) Filed as an exhibit to the Company's Form 8-K, as filed with the SEC on March 4, 2021, and incorporated herein by this reference.\n(2) Filed as an exhibit to the Companys Form 8-K, as filed with the SEC on June 22, 2021, and incorporated herein by this reference.\n(3) Filed as an exhibit to the Company's Form 8-K, as filed with the SEC on July 8, 2021, and incorporated herein by this reference.\n(4) Filed as an exhibit to the Company's Form 8-K, as filed with the SEC on August 21, 2023, and incorporated herein by this reference.\n(5) Filed as an exhibit to the Company's Form 8-K, as filed with the SEC on December 7, 2023, and incorporated herein by this reference.\n(6) Filed as an exhibit to the Company's Form 10-12G, as filed with the SEC on December 28, 2020, and incorporated herein by this reference.\n(7) Filed as an exhibit to the Company's Form 8-K, as filed with the SEC on September 16, 2021, and incorporated herein by this reference.\n(8) Filed herewith.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nWB Burgers Asia, Inc.\n(Registrant)\nBy: /s/ Koichi Ishizuka\nKoichi Ishizuka, Chief Executive Officer\nDated: December 29, 2023\nBy: /s/ Koichi Ishizuka\nKoichi Ishizuka, Chief Financial Officer\nDated: December 29, 2023\nIn accordance with the Exchange Act, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nBy: /s/ Koichi Ishizuka\nKoichi Ishizuka, Chief Executive Officer\nDated: December 29, 2023\nBy: /s/ Koichi Ishizuka\nKoichi Ishizuka, Chief Financial Officer\nDated: December 29, 2023\n- 21 -"
}