{
    "cik": "1787123",
    "company": "QLY Biotech Group Corp.",
    "filing_type": "10-K",
    "filing_date": "2022-12-14",
    "period_of_report": "2022-08-31",
    "sic": "4700",
    "state_of_inc": "NV",
    "state_location": "G8",
    "fiscal_year_end": "0831",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1787123/0001477932-22-009289-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1787123/000147793222009289/lqly_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1787123/0001477932-22-009289.txt",
    "filename": "1787123_10K_2022_0001477932-22-009289.htm",
    "content": "ITEM 1. BUSINESS\nBusiness Overview\nQLY Biotech Group Corp. (Former name: Azar International Corp.), a Nevada corporation (the Company) was incorporated under the laws of the State of Nevada on September 20, 2018.\nQLY Biotech Group Corp. (Former name: Azar International Corp.) (QLY) was used to engaged in the tourism. The company used to organize individual and group sailing tours in the Dominican Republic. Services and itineraries were used to be provide by our company include custom packages according to the clients specifications. And we used to develop and offer our own sailing tours in the North part of Dominican Republic as well as third-party suppliers.\nOn July 8, 2022, as a result of a private transactions, 3,000,000 shares of common stock, $0.001 par value per share (the Shares) of QLY Biotech Group Corp. (Former name: Azar International Corp.)., were transferred from Hilario Lopez Vargas to Lixue Yang. As a result, Lixue Yang became holders of approximately 77% of the voting rights of the issued and outstanding share capital of the Company and became the controlling shareholder. The consideration paid for the Shares was $350,000. The source of the cash consideration for the Shares was personal funds of Lixue Yang. In connection with the transaction, Hilario Lopez Vargas released the Company from all debts owed to him.\nOn July 8, 2022, the existing director and officer resigned immediately. Accordingly, Hilario Lopez Vargas, serving as a director and an officer, ceased to be the Companys Chief Executive Officer, Chief Financial Officer, President, Treasurer, Secretary and a Director. At the effective date of the transfer, Lixue Yang consented to act as the new Chief Executive Officer, Chief Financial Officer, President, Treasurer, Secretary and a Director of the Company,\nMr. Lixue Yang, CEO, CFO, and Director, 39, Graduated from University of Science and Technology Beijing in 2006, majoring in marketing and management. He is the president, Chief Executive Officer and chairman of the Board of Directors of the Company.\nMr. Yang was the CEO of Shandong Zhongying Network Technology Co. Ltd, from 2012 to 2015. He was the CEO of Zhejiang Luo Fang Technology Co., Ltd, from 2015 to 2017. After that, he founded a company called Qingdao Qingliyuan Biotechnology Co., Ltd in 2017, up to present. He was also the founder and chairman of Yizhixin Co., Ltd, from 2018 to present.\nCompetition and Market Conditions\nWe will face substantial competition in our efforts to identify and pursue a business venture. The primary source of competition is expected to be from other companies organized and funded for similar purposes, including small venture capital firms, blank check companies, and wealthy investors, many of which may have substantially greater financial and other resources than we do. In light of our limited financial and human resources, we are at a competitive disadvantage compared to many of our competitors in our efforts to obtain an operating business or assets necessary to commence our operations in a new field. Additionally, with the economic downturn caused by the coronavirus pandemic, many venture capital firms and similar firms and individuals have been seeking to acquire businesses at discounted rates, and we therefore currently face additional competition and resultant difficulty obtaining a business. We expect these conditions to persist at least until such time as the economy recovers. Further, even if we are successful in obtaining a business or assets for new operations, we expect there to be enhanced barriers to entry in the marketplace in which we decide to operate as a result of reduced demand and/or increased raw material costs caused by the pandemic and other economic forces that are beyond our control.\nGovernment regulation\nAs of the date of this Report, we are required to file reports with the Securities and Exchange Commission (the SEC) by Section 13 of the Securities Exchange Act of 1934 (the Exchange Act).\nDepending on the direction management decides to take and a business or businesses we may acquire in the future, we may become subject to other laws or regulations that require us to make material expenditures on compliance including the increasing state level regulation of privacy. Any such requirements could require us to divert significant human and capital resources on compliance, which could have an adverse effect on our future operating results.\nEmployees\nAs of the date of this Report, we do not have employees. However, an entity controlled by our Chief Executive Officer provides part-time consulting services to us without compensation. ITEM 1A. RISK FACTORS\nYou should carefully consider the risks described below and elsewhere in this Annual Report, which could materially and adversely affect our business, results of operations or financial condition. Our business faces significant risks and the risks described below may not be the only risks we face. Additional risks not presently known to us or that we currently believe are immaterial may materially affect our business, results of operations, or financial condition. If any of these risks occur, the trading price of our common stock could be decline and you may lose all or part of your investment.\nCOVID-19 Pandemic\nCOVID-19 pandemic has had, and may continue to have, an adverse effect on our business and our financial results.\nIn December 2019, a novel strain of coronavirus was discovered in China, which has and is continuing to spread throughout the world. On January 30, 2020, the World Health Organization declared the outbreak of the COVID-19 disease a Public Health Emergency of International Concern. On March 11, 2020, the World Health Organization characterized the outbreak as a pandemic. The COVID-19 outbreak has resulted in, and a significant outbreak of other infectious diseases could result in, a widespread health crisis that could materially and adversely affect the economies and financial markets worldwide, and the operations and financial position of any potential target business with which we consummate a business combination could be materially and adversely affected. Furthermore, we may be unable to complete a business combination if continued concerns relating to COVID-19 restrict travel, limit the ability to have meetings with potential investors, if the target companys personnel, vendors and service providers are unavailable to negotiate and consummate a transaction in a timely manner, or if COVID-19 causes a prolonged economic downturn. The extent to which COVID-19 impacts our search for business combinations will depend on future developments, which are highly uncertain and cannot be predicted, including new information which may emerge concerning the severity of COVID-19 and the actions to contain COVID-19 or treat its impact, among others. If the disruptions posed by COVID-19 or other matters of global concern continue for an extensive period of time, our ability to consummate a business combination, or the operations of a target business with which we ultimately consummate a business combination, may be materially adversely affected.\nIn addition, our ability to consummate a business combination may be dependent on the ability to raise equity and debt financing which may be impacted by COVID-19 and other events, including as a result of increased market volatility, decreased market liquidity and third-party financing being unavailable on terms acceptable to us or at all.\nCOVID-19 could negatively affect our internal controls over financial reporting as a portion of our workforce is required to work from home and therefore new processes, procedures, and controls could be required to respond to changes in our business environment. Further, should any key employees become ill from COVID-19 and unable to work, the attention of the management team and resources could be diverted.\nThe potential effects of COVID-19 could also heighten the risks we face related to each of the risk factors disclosed below. As COVID-19 and its impacts are unprecedented and continuously evolving, the potential impacts to these risk factors remain uncertain. As a result, COVID-19 may also materially adversely affect our operating and financial results in a manner that is not currently known to us or that we do not currently consider may present significant risks to our operations.\nRisks Relating to Our Business and Financial Condition\nWe currently have no operations, and investors therefore have no basis on which to evaluate the Companys future prospects.\nWe currently have no operations and will be reliant upon a merger with or acquisition of an operating business to commence operations and generate revenue. Because we have no operations and have not generated revenues, investors have no basis upon which to evaluate our ability to achieve our business objective of locating and completing a business combination with a target business. We have no current arrangements or understandings with any prospective target business concerning a business combination and may be unable to complete a business combination in a reasonable timeframe, on reasonable terms or at all. If we fail to complete a business combination as planned, we will never generate any operating revenues.\nWe may face difficulties or delays in our search for a business combination, and we may not have access to sufficient capital to consummate a business combination.\nWe may face difficulty identifying a viable business opportunity or negotiating or paying for any resulting business combination. Economic factors that are beyond our control, including the COVID-19 pandemic and consequent economic downturn, as well as increased competition for acquisitions of operating entities that we expect to encounter as a result thereof, may hinder our efforts to locate and/or obtain a business that is suitable for our business goals at a price we can afford and on terms that will enable us to sufficiently grow our business to generate value to our shareholders. We have limited capital, and we may not be able to take advantage of any available business opportunities on favorable terms or at all due to the limited availability of capital. There can be no assurance that we will have sufficient capital to provide us with the necessary funds to successfully develop and implement our plan of operation or acquire a business we deem to be appropriate or necessary to accomplish our objectives, in which case we may be forced to terminate our business plan and your investment in the Company could become worthless.\nIf we are not successful in acquiring a new business and generating material revenues, investors will likely lose their investment.\nIf we are not successful in developing a viable business plan and acquiring a new business through which to implement it, our investors entire investment in the Company could become worthless. Even if we are successful in combining with or acquiring the assets of an operating entity, we can provide no assurances that the Company will be able to generate significant revenue therefrom in the short-term or at all or that investors will derive a profit from their investment. If we are not successful, our investors will likely lose their entire investment.\nIf we cannot manage our growth effectively, we may not become profitable.\nBusinesses, including development stage companies such as ours and/or any operating business or businesses we may acquire, often grow rapidly, and tend to have difficulty managing their growth. If we are able to acquire an operating business, we will likely need to expand our management team and other key personnel by recruiting and employing experienced executives and key employees and/or consultants capable of providing the necessary support.\nWe cannot assure you that our management will be able to manage our growth effectively or successfully. Our failure to meet these challenges could cause us to lose money, and your investment could be lost.\nBecause we have limited capital, we may need to raise additional capital in the future by issuing debt or equity securities, the terms of which may dilute our current investors and/or reduce or limit their liquidation or other rights.\nWe may require additional capital to acquire a business. We may not be able to obtain additional capital when required. Future business development activities, as well as administrative expenses such as salaries, insurance, general overhead, legal and compliance expenses, and accounting expenses will require a substantial amount of additional capital.\nThe terms of securities we issue in future capital raising transactions may be more favorable to new investors, and may include liquidation preferences, superior voting rights or the issuance of other derivative securities, which could have a further dilutive effect on or subordinate the rights of our current investors. Any additional capital raised through the sale of equity securities will likely dilute the ownership percentage of our shareholders. Additionally, any debt securities we issue would likely create a liquidation preference superior that of our current investors and, if convertible into shares of Common Stock, would also pose the risk of dilution.\nWe may be unable to obtain necessary financing if and when required.\nOur ability to obtain financing, if and when necessary, may be impaired by such factors as the capital markets (both in general and in the particular industry or industries in which we may choose to operate), our limited operating history and current lack of operations, the national and global economies, and the condition of the market for microcap securities. Further, economic downturns such as the current global depression caused by the COVID-19 pandemic may increase our requirements for capital, particularly if such economic downturn persists for an extended period of time or after we have acquired an operating entity, and may limit or hinder our ability to obtain the funding we require. If the amount of capital we are able to raise from financing activities, together with any revenues we may generate from future operations, is not sufficient to satisfy our capital needs, we may be required to discontinue our development or implementation of a business plan, cancel our search for business opportunities, cease our operations, divest our assets at unattractive prices or obtain financing on unattractive terms. If any of the foregoing should happen, our shareholders could lose some or all of their investment.\nBecause we are still developing our business plan, we do not have any agreement for a business combination.\nWe have no current arrangement, agreement or understanding with respect to engaging in a business combination with any specific entity. We may not be successful in identifying and evaluating a suitable acquisition candidate or in consummating a business combination. We are neutral as to what industry or segment for any target company. We have not established specific metrics and criteria we will look for in a target company, and if and when we do we may face difficulty reaching a mutual agreement with any such entity, including in light of market trends and forces beyond our control. Given our early-stage status, there is considerable uncertainty and therefore inherent risk to investors that we will not succeed in developing and implementing a viable business plan.\nBecause we are dependent upon Mr. Lixue Yang, our Chief Executive Officer and sole director to manage and oversee our Company, the loss of him could adversely affect our plan and results of operations.\nWe currently have a sole director and officer, Mr. Lixue Yang, who manages the Company and is presently evaluating a viable plan for our future operations. We will rely solely on his judgment in connection with selecting a target company and the terms and structure of any resulting business combination. The loss of our Chief Executive Officer, could delay or prevent the achievement of our business objectives, which could have a material adverse effect upon our results of operations and financial position.\nFurther, because Mr. Yang serves as Chief Executive Officer and sole director and also holds a controlling interest in the Companys Common Stock, our other shareholders will have limited ability to influence the Companys direction or management.\nIn addition, although not likely, the officers and directors of an acquisition candidate may resign upon completion of a combination with their business. The departure of a targets key personnel could negatively impact the operations and prospects of our post-combination business. The role of a targets key personnel upon the completion of the transaction cannot be ascertained at this time. Although we contemplate that certain or all members of a targets management team may remain associated with the target following a change of control thereof, there can be no assurance that all of such targets management team will decide to remain in place. The loss of key personnel, either before or after a business combination and including management of either us or a combined entity could negatively impact the operations and profitability of our business.\nRisks Related to a Potential Business Acquisition\nWe may encounter difficulty locating and consummating a business combination, including as a result of the competitive disadvantages we have.\nWe expect to face intense competition in our search for a revenue-producing business to combine with or acquire. Given the current economic climate, venture capital firms, larger companies, blank check companies such as special purpose acquisition companies and other investors are purchasing operating entities or the assets thereof in high volumes and at relatively discounted prices. These parties may have greater capital or human resources than we do and/or more experience in a particular industry within which we choose to search. Most of these competitors have a certain amount of liquid cash available to take advantage of favorable market conditions for prospective business purchaser such as those caused by the recent pandemic. Any delay or inability to locate, negotiate and enter into a business combination as a result of the relative illiquidity of our current asset or other disadvantages we have relative to our competitors could cause us to lose valuable business opportunities to our competitors, which would have a material adverse effect on our business.\nWe may expend significant time and capital on a prospective business combination that is not ultimately consummated.\nThe investigation of each specific target business and any subsequent negotiation and drafting of related agreements, SEC disclosure and other documents will require substantial amounts of managements time and attention and material additional costs in connection with outsourced services from accountants, attorneys, and other professionals. We will likely expend significant time and resources searching for, conducting due diligence on, and negotiating transaction terms in connection with a proposed business combination that may not ultimately come to fruition. In such event, all of the time and capital resources expended by the Company in such a pursuit may be lost and unrecoverable by the Company or its shareholders. Unanticipated issues which may be beyond our control or that of the seller of the applicable business may arise that force us to terminate discussions with a target company, such as the targets failure or inability to provide adequate documentation to assist in our investigation, a partys failure to obtain required waivers or consents to consummate the transaction as required by the inability to obtain the required audits, applicable laws, charter documents and agreements, the appearance of a competitive bid from another prospective purchaser, or the sellers inability to maintain its operations for a sufficient time to allow the transaction to close. Such risks are inherent in any search for a new business and investors should be aware of them before investing in an enterprise such as ours.\nConflicts of interest may arise between us and our shareholders, directors, or management, which may have a negative impact on our ability to consummate a business combination or favorable terms or generate revenue.\nOur Chief Executive Officer, Mr. Yang, is not required to commit his full time to our affairs, which may result in a conflict of interest in allocating his time between managing the Company and other businesses in which he is or may be involved. We do not intend to have any employees prior to the consummation of a business combination. Mr. Yang is not obligated to contribute any specific number of hours to our affairs, and he may engage in other business endeavors while he provides consulting services to the Company. If any of his other business affairs require him to devote substantial amounts of time to such matters, it could materially limit his ability to devote his time and attention to our business which could have a negative impact on our ability to consummate a business combination or generate revenue.\nIt is possible that we obtain an operating company in which a director or officer of the Company has an ownership interest in or that he or she is an officer, director, or employee of. If we do obtain any business affiliated with an officer or director, such business combination may be on terms other than what would be arrived at in an arms-length transaction. If any conflict of interest arises, it could adversely affect a business combination or subsequent operations of the Company, in which case our shareholders may see diminished value relative to what would have been available through a transaction with an independent third party.\nWe may engage in a business combination that causes tax consequences to us and our shareholders.\nFederal and state tax consequences will, in all likelihood, be a significant factor in considering any business combination that we may undertake. Under current federal law, such transactions may be subject to significant taxation to the buyer and its shareholders under applicable federal and state tax laws. While we intend to structure any business combination so as to minimize the federal and state tax consequences to the extent practicable in accordance with our business objectives, there can be no assurance that any business combination we undertake will meet the statutory or regulatory requirements of a tax-free reorganization or similar favorable treatment or that the parties to such a transaction will obtain the tax treatment intended or expected upon a transfer of equity interests or assets. A non-qualifying reorganization, combination or similar transaction could result in the imposition of significant taxation, both at the federal and state levels, which may have an adverse effect on both parties to the transaction, including our shareholders.\nIt is unlikely that our shareholders will be afforded any opportunity to evaluate or approve a business combination.\nIt is unlikely that our shareholders will be afforded the opportunity to evaluate and approve a proposed business combination. In most cases, business combinations do not require shareholder approval under applicable law, and our Articles of Incorporation and Bylaws do not afford our shareholders with the right to approve such a transaction. Further, Mr. Yang, our Chief Executive Officer and sole director, owns the vast majority of our outstanding Common Stock. Accordingly, our shareholders will be relying almost exclusively on the judgement of our board of directors (Board) and Chief Executive Officer and any persons on whom they may rely with respect to a potential business combination. In order to develop and implement our business plan, may in the future hire lawyers, accountants, technical experts, appraisers, or other consultants to assist with determining the Companys direction and consummating any transactions contemplated thereby. We may rely on such persons in making difficult decisions in connection with the Companys future business and prospects. The selection of any such persons will be made by our Board, and any expenses incurred or decisions made based on any of the foregoing could prove to be adverse to the Company in hindsight, the result of which could be diminished value to our shareholders.\nBecause our search for a business combination is not presently limited to a particular industry, sector or any specific target businesses, prospective investors will be unable to evaluate the merits or risks of any particular target business operations until such time as they are identified and disclosed.\nWe are still determining the Companys business plan, and we may seek to complete a business combination with an operating entity in any number of industries or sectors. Because we have not yet entered into any letter of intent or agreement to acquire a particular business, prospective investors currently have no basis to evaluate the possible merits or risks of any particular target businesss operations, results of operations, cash flows, liquidity, financial condition, prospects or other metrics or qualities they deem appropriate in considering to invest in the Company. Further, if we complete a business combination, we may be affected by numerous risks inherent in the operations of the business we acquire. For example, if we acquire a financially unstable business or an entity lacking an established operating history, we may be affected by the risks inherent in the business and operations of a new business or a development stage entity. Although our management intends to evaluate and weigh the merits and risks inherent in a particular target business and make a decision based on the Company and its shareholders interests, there can be no assurance that we will properly ascertain or assess all the significant risks inherent in a target business, that we will have adequate time to complete due diligence or that we will ultimately acquire a viable business and generate material revenue therefrom. Furthermore, some of these risks may be outside of our control and leave us with no ability to reduce the likelihood that those risks will adversely impact a target business or mitigate any harm to the Company caused thereby. Should we select a course of action, or fail to select a course of action, that ultimately exposes us to unknown or unidentified risks, our business will be harmed and you could lose some or all of your investment.\nPast performance by our management and their affiliates may not be indicative of future performance of an investment in us.\nWhile our Chief Executive Officer has prior experience in advising businesses, his past performance, the performance of other entities or persons with which he is involved, or the performance of any other personnel we may retain in the future will not necessarily be an indication of either (i) that we will be able to locate a suitable candidate for our initial business combination or (ii) the future operating results of the Company including with respect to any business combination we may consummate. You should not rely on the historical record of him or any other of our personnel or their affiliates performance as indicative of our future performance or that an investment in us will be profitable. In addition, an investment in the Company is not an investment in any entities affiliated with our management or other personnel. While management intends to endeavor to locate a viable business opportunity and generate shareholder value, there can be no assurance that we will succeed in this endeavor.\nWe may seek business combination opportunities in industries or sectors that are outside of our managements area of expertise.\nWe will consider a business combination outside of our managements area of expertise if a business combination candidate is presented to us and we determine that such candidate offers an attractive opportunity for the Company. Although management intends to endeavor to evaluate the risks inherent in any particular business combination candidate, we cannot assure you that we will adequately ascertain or assess all the significant risks, or that we will accurately determine the actual value of a prospective operating entity to acquire. In the event we elect to pursue an acquisition outside of the areas of our managements expertise, our managements ability to evaluate and make decisions on behalf of the Company may be limited, or we may make material expenditures on additional personnel or consultants to assist management in the Companys operations. Investors should be aware that the information contained herein regarding the areas of our managements expertise will not necessarily be relevant to an understanding of the business that we ultimately elect to acquire. As a result, our management may not be able to adequately ascertain or assess all the significant risks or strategic opportunities that may arise. Accordingly, any shareholders in the Company following a business combination could suffer a reduction in the value of their shares, and any resulting loss will likely not be recoverable.\nWe may attempt to complete a business combination with a private target company about which little information is available, and such target entity may not generate revenue as expected or otherwise by compatible with us as expected.\nIn pursuing our search for a business to acquire, we will likely seek to complete a business combination with a privately held company. Very little public information generally exists about private companies, and the only information available to us prior to making a decision may be from documents and information provided directly to us by the target company in connection with the transaction. Such documents or information or the conclusions we draw therefrom could prove to be inaccurate or misleading. As such, we may be required to make our decision on whether to pursue a potential business combination based on limited, incomplete, or faulty information, which may result in our subsequent operations generating less revenue than expected, which could materially harm our financial condition and results of operations.\nOur ability to assess the management of a prospective target business may be limited and, as a result, we may acquire a target business whose management does not have the skills, qualifications, or abilities to enable a seamless transition, which could, in turn, negatively impact our results of operations.\nWhen evaluating the desirability of a potential business combination, our ability to assess the target businesss management may be limited due to a lack of time, resources, or information. Our managements assessment of the capabilities of the targets management, therefore, may prove to be incorrect and such management may lack the skills, qualifications or abilities expected. Further, in most cases the targets management may be expected to want to manage us and replace our Chief Executive Officer. Should the targets management not possess the skills, qualifications, or abilities necessary to manage a public company or assist with their former entitys merger or combination into ours, the operations and profitability of the post-acquisition business may be negatively impacted and our shareholders could suffer a reduction in the value of their shares.\nAny business we acquire will likely lack diversity of operations or geographical reach, and in such case we will be subject to risks associated with dependence on a single industry or region.\nOur search for a business will likely be focused on entities with a single or limited business activity and/or that operate in a limited geographic area. While larger companies have the ability to manage their risk by diversifying their operations among different industries and regions, smaller companies such as ours and the entities we anticipate reviewing for a potential business combination generally lack diversification, in terms of both the nature and geographic scope of their business. As a result, we will likely be impacted more acutely by risks affecting the industry or the region in which we operate than we would if our business were more diversified. In addition to general economic risks, we could be exposed to natural disasters, civil unrest, technological advances, and other uncontrollable developments that will threaten our viability if and to the extent our future operations are limited to a single industry or region. If we do not diversify our operations, our financial condition and results of operations will be at risk.\nChanges in laws or regulations, or a failure to comply with the laws and regulations applicable to us, may adversely affect our business, ability to negotiate and complete a business combination, and results of operations.\nWe are subject to laws and regulations enacted by federal, state, and local governments. In addition to SEC regulations, any business we acquire in the future may be subject to substantial legal or regulatory oversight and restrictions, which could hinder our growth and expend material amounts on compliance. Compliance with, and monitoring of, applicable laws and regulations may be difficult, time consuming and costly. Those laws and regulations and their interpretation and application by courts and administrative judges may also change from time to time, and any such changes could be unfavorable to us and could have a material adverse effect on our business, investments, and results of operations. In addition, a failure to comply with applicable laws or regulations, as interpreted and applied, could result in material defense or remedial costs and/or damages have a material adverse effect on our financial condition.\nRisks associated with doing business in China\nTrading in our securities may be prohibited under the Holding Foreign Companies Accountable Act if the PCAOB determines that it cannot inspect or investigate completed our auditors for three consecutive years beginning in 2021, or for two consecutive years if the Accelerating Holding Foreign Companies Accountable Act or the America COMPETES Act becomes law.\nIn recent years, U.S. regulatory authorities have continued to express their concerns about challenges in their oversight of financial statement audits of U.S.-listed companies with significant operations in China. As part of a continued regulatory focus in the United States on access to audit and other information, the Holding Foreign Companies Accountable Act, or the HFCAA, was enacted on December 18, 2020. The HFCAA includes requirements for the SEC to identify issuers whose audit work is performed by auditors that the PCAOB is unable to inspect or investigate completely because of a restriction imposed by a non-U.S. authority in the auditors local jurisdiction. The HFCAA also requires that, to the extent that the PCAOB has been unable to inspect an issuers auditor for three consecutive years since 2021, the SEC shall prohibit its securities registered in the United States from being traded on any national securities exchange or over-the-counter markets in the United States.\nOn March 24, 2021, the SEC adopted interim final rules relating to the implementation of certain disclosure and documentation requirements of the HFCAA. The interim final rule applies to registrants that the SEC identifies as having filed an annual report with an audit report issued by a registered public accounting firm that is located in a foreign jurisdiction that the PCAOB is unable to inspect or investigate completely because of a position taken by an authority in that jurisdiction. Consistent with the HFCAA, the interim final rule requires the submission of documentation to the SEC establishing that such a registrant is not owned or controlled by a government entity in that foreign jurisdiction and also requires disclosure in a foreign issuers annual report regarding the audit arrangements of, and government influence on, such registrants. On May 13, 2021, the PCAOB issued proposed PCAOB Rule 6100, Board Determinations Under the Holding Foreign Companies Accountable Act for public comment. The proposed rule provides a framework for making determinations as to whether PCAOB is unable to inspect an audit firm in a foreign jurisdiction, including the timing, factors, bases, publication and revocation or modification of such determinations, and such determinations will be made on a jurisdiction-wide basis in a consistent manner applicable to all firms headquartered in the jurisdiction. In November 2021, the SEC approved PCAOB Rule 6100. On December 2, 2021, the SEC adopted amendments to final rules implementing the disclosure and submission requirements of the HFCAA.\nOn June 22, 2021, the U.S. Senate passed the Accelerating Holding Foreign Companies Accountable Act or AHFCAA, and on February 4, 2022, the U.S. House of Representatives passed the America Creating Opportunities for Manufacturing Pre-Eminence in Technology and Economic Strength (COMPETES) Act of 2022, or the COMPETES Act. If either bill is enacted into law, it would amend the HFCAA and require the SEC to prohibit an issuers securities from trading on any U.S. stock exchanges if its auditor is not subject to PCAOB inspections or complete investigations for two consecutive years instead of three. As a result, our securities may be prohibited from trading on Nasdaq or over-the-counter markets if our auditor is not inspected by the PCAOB for three consecutive years as specified in the HFCAA or two years if the AHFCAA or the COMPETES Act becomes law, and would reduce the time before our securities may be prohibited from trading or delisted.\nOn December 2, 2021, the SEC issued amendments to finalize rules implementing the submission and disclosure requirements in the HFCAA. The rules apply to registrants that the SEC identifies as having filed an annual report with an audit report issued by a registered public accounting firm that is located in a foreign jurisdiction and that PCAOB is unable to inspect or investigate completely because of a position taken by an authority in foreign jurisdictions.\nOn December 16, 2021, the PCAOB announced the PCAOB Holding Foreign Companies Accountable Act determinations (the PCAOB determinations) relating to the PCAOBs inability to inspect or investigate completely registered public accounting firms headquartered in mainland China of the PRC or Hong Kong, a Special Administrative Region and dependency of the PRC, because of a position taken by one or more authorities in the PRC or Hong Kong.\nThe lack of access to the PCAOB inspection or investigation in China prevents the PCAOB from fully evaluating audits and quality control procedures of the auditors based in China. As a result, the investors may be deprived of the benefits of such PCAOB inspections. The inability of the PCAOB to conduct inspections or investigation of auditors in China makes it more difficult to evaluate the effectiveness of these accounting firms audit procedures or quality control procedures as compared to auditors outside of China that are subject to the PCAOB inspections and investigation, which could cause existing and potential investors in our stock to lose confidence in our audit procedures and reported financial information and the quality of our financial statements.\nOur current auditor, TAAD, LLP, an independent registered public accounting firm that is headquartered in the Southern California, is a firm registered with the U.S. Public Company Accounting Oversight Board (the PCAOB), and is required by the laws of the U.S. to undergo regular inspections by the PCAOB to assess its compliance with the laws of the U.S. and professional standards. TAAD, LLP has been subject to PCAOB inspections, and is not among the PCAOB-registered public accounting firms headquartered in the PRC or Hong Kong that are subject to PCAOBs determination on December 16, 2021 of having been unable to inspect or investigate completely.\nNotwithstanding the foregoing, if it is later determined that the PCAOB is unable to inspect or investigate our auditor completely, or if there is any regulatory change or step taken by PRC regulators that does not permit TAAD, LLP to provide audit documentations located in China or Hong Kong to the PCAOB for inspection or investigation, or the PCAOB expands the scope of the Determination so that we are subject to the HFCAA, as the same may be amended, you may be deprived of the benefits of such inspection. Any audit reports not issued by auditors that are completely inspected or investigated by the PCAOB, or a lack of PCAOB inspections or investigations of audit work undertaken in China that prevents the PCAOB from regularly evaluating our auditors audits and their quality control procedures, could result in a lack of assurance that our financial statements and disclosures are adequate and accurate.\nChinas political climate and economic conditions, as well as changes in government policies, laws and regulations which may be quick with little advance notice, could have a material adverse effect on our business, financial condition and results of operations.\nOur officers and director are the resident of and is physically located in and has significant ties to China. Our business, financial condition, results of operations and prospects are subject, to a significant extent, to economic, political and legal developments in China. For example, as a result of recent proposed changes in the cybersecurity regulations in China that would require certain Chinese technology firms to undergo a cybersecurity review before being allowed to list on foreign exchanges, this may have the effect of further narrowing the list of potential businesses in Chinas consumer, technology and mobility sectors that we intend to focus on for our business combination or the ability of the combined entity to list in the United States.\nChinas economy differs from the economies of most developed countries in many respects, including the amount of government involvement, level of development, growth rate, control of foreign exchange and allocation of resources. While the PRC economy has experienced significant growth in the past two to three decades, growth has been uneven, both geographically and among various sectors of the economy. Demand for target services and products depends, in large part, on economic conditions in China. Any slowdown in Chinas economic growth may cause our potential customers to delay or cancel their plans to purchase our services and products, which in turn could reduce our net revenues.\nAlthough Chinas economy has been transitioning from a planned economy to a more market-oriented economy since the late 1970s, the PRC government continues to play a significant role in regulating industry development by imposing industrial policies. The PRC government also exercises significant control over Chinas economic growth through allocating resources, controlling the incurrence and payment of foreign currency-denominated obligations, setting monetary policy and providing preferential treatment to particular industries or companies. Changes in any of these policies, laws and regulations may be quick with little advance notice and could adversely affect the economy in China and could have a material adverse effect on our business and the value of our common stock.\nThe PRC government has implemented various measures to encourage foreign investment and sustainable economic growth and to guide the allocation of financial and other resources. However, we cannot assure you that the PRC government will not repeal or alter these measures or introduce new measures that will have a negative effect on us, or more specifically, we cannot assure you that the PRC government will not initiate possible governmental actions or scrutiny to us, which could substantially affect our operation and the value of our common stock may depreciate quickly. Chinas social and political conditions may change and become unstable. Any sudden changes to Chinas political system or the occurrence of widespread social unrest could have a material adverse effect on our business and results of operations.\nAny failure or perceived failure by our PRC subsidiaries to comply with the Anti-Monopoly Guidelines for Internet Platforms Economy Sector and other PRC anti-monopoly laws and regulations may result in governmental investigations or enforcement actions, litigation or claims against us and could have an adverse effect on our business, financial condition and results of operations.\nThe PRC anti-monopoly enforcement agencies have strengthened enforcement under the PRC Anti-Monopoly Law in the recent years. On December 28, 2018, the SAMR issued the Notice on Anti-monopoly Enforcement Authorization, pursuant to which its province-level branches are authorized to conduct anti-monopoly enforcement within their respective jurisdictions. On September 11, 2020, the Anti-Monopoly Commission of the State Council issued Anti-monopoly Compliance Guideline for Operators, which requires operators to establish anti-monopoly compliance management systems under the PRC Anti-Monopoly Law to manage anti-monopoly compliance risks. On February 7, 2021, the Anti-Monopoly Commission of the State Council published Anti-Monopoly Guidelines for the Internet Platform Economy Sector that specified circumstances under which an activity of an internet platform will be identified as monopolistic act as well as concentration filing procedures for business operators. According to the PRC Anti-Monopoly Law, if a business operator carries out a concentration in violation of the law, the relevant authority shall order the business operator to terminate the concentration, dispose of the shares or assets or transfer the business within a specified time limit, or take other measures to restore the pre-concentration status, and impose a fine of up to RMB500,000. On March 12, 2021, the SAMR published several administrative penalty cases in connection with concentration of business operators that violated PRC Anti-Monopoly Law in the internet sector.\nOn October 23, 2021, the Standing Committee of the National Peoples Congress issued a discussion draft of the amended Anti-Monopoly Law, which proposes to increase the fines for illegal concentration of business operators to no more than ten percent of its last years sales revenue if the concentration of business operator has or may have an effect of excluding or limiting competition; or a fine of up to RMB5 million if the concentration of business operator does not have an effect of excluding or limiting competition. The draft also proposes for the relevant authority to investigate transaction where there is evidence that the concentration has or may have the effect of eliminating or restricting competition, even if such concentration does not reach the filing threshold. On December 24, 2021, nine government agencies, including the NDRC, jointly issued the Opinions on Promoting the Healthy and Sustainable Development of Platform Economy, which provides that, among others, monopolistic agreements, abuse of dominant market position and illegal concentration of business operators in the field of platform economy will be strictly investigated and punished in accordance with the relevant laws.\nAt the present time, we have a relatively small scale supply chain platform operations based on our market share in our product markets and other factors. We are not an operator with a dominant market position, and our operating activity cannot constitute an anti-monopoly behavior that abuses our dominant market position. We have not entered into monopoly agreements prohibited by the Anti-Monopoly Law with competing business operators. As of the date of the prospectus, we have not received a notification from the anti-monopoly regulatory authority requiring us to file the concentration of undertakings or received any related administrative penalties. We believe that we are in compliance with the currently effective PRC anti-monopoly laws in all material aspects. Nevertheless, if the PRC regulatory authorities identify any of our activities as monopolistic under the PRC Anti-Monopoly Law or the Anti-Monopoly Guidelines for the Internet Platform Economy Sector, we may be subject to investigations and administrative penalties, and therefore materially and adversely affect our financial conditions, operations and business prospects. If we are required to take any rectifying or remedial measures or are subject to any penalties, our reputation and business operations may be materially and adversely affected.\nRecent regulatory developments in China, including greater oversight and control by the CAC over data security, may subject us to additional regulatory review, and any actions by the Chinese government to exert more oversight and control over foreign investment in China-based issuers could significantly limit or completely hinder our ability to offer or continue to offer securities to investors and cause the value of such securities to significantly decline or be worthless.\nOn December 28, 2021, the CAC, NDRC, and several other agencies jointly issued the final version of the Revised Measures for Cybersecurity Review, or the Revised Cybersecurity Measures, which took effect on February 15, 2022 and replaced the previously issued Revised Measures for Cybersecurity Review. Under the Revised Cybersecurity Measures, an online platform operator in possession of personal data of more than one million users must apply for a cybersecurity review if it intends to list its securities on a foreign stock exchange. The operators of critical information infrastructure purchasing network products and services, and the online platform operators (together with the operators of critical information infrastructure, the Operators) carrying out data processing activities that affect or may affect national security, shall conduct a cybersecurity review, and any online platform operator who controls more than one million users personal information must go through a cybersecurity review by the cybersecurity review office if it seeks to be listed in a foreign country. Pursuant to the Revised Cybersecurity Measures, we dont believe we will be subject to the cybersecurity review by the CAC, given that (i) our online platform business just start up, we possess personal information of a very small number of users (less than 100 users) in our business operations as of the date of this report, significantly less than the one million user threshold set for a data processing operator applying for listing on a foreign exchange that is required to pass such cybersecurity review; and (ii) data processed in our business does not have a bearing on national security and thus shall not be classified as core or important data by the authorities. We dont believe that we are an Operator within the meaning of the Revised Cybersecurity Measures, nor do we control more than one million users personal information, and as such, we should not be required to apply for a cybersecurity review under the Revised Cybersecurity Measures.\nHowever, there remains uncertainty as to how the Revised Cybersecurity Measures may be interpreted or implemented and whether the PRC regulatory agencies, including the CAC, may adopt new rules and regulations related to the Revised Cybersecurity Measures. For example, there is still no clear definition of online platform operator. Whether the data processing activities carried out by traditional enterprises (such as food, medicine, automobile and other production enterprises) are subject to such review and the scope of the review remain to be further clarified by the regulatory authorities in the subsequent implementation process. If any new laws, regulations, implementation measures or interpretation are adopted, we may need to take further actions and invest resources to comply with such new rules and to minimize any potential negative effects on us. In addition, if the number of our online platform users increases to a level close to one million, we would expect to prepare for the required cybersecurity review procedure and approval from the PRC government.\nGovernmental control of currency conversion may affect the value of your investment.\nThe PRC government imposes controls on the convertibility of the RMB into foreign currencies and, in certain cases, the remittance of currency out of China. We receive substantially all of our revenues in RMB. Under our current corporate structure, our income will currently only be derived from dividend payments from our PRC subsidiaries. Shortages in the availability of foreign currency may restrict the ability of our PRC subsidiaries to remit sufficient foreign currency to pay dividends or other payments to us, or otherwise satisfy their foreign currency denominated obligations. Under existing PRC foreign exchange regulations, payments of current account items, including profit distributions, interest payments and expenditures from trade-related transactions can be made in foreign currencies without prior approval from SAFE by complying with certain procedural requirements. However, approval from appropriate government authorities is required where RMB is to be converted into foreign currency and remitted out of China to pay capital expenses such as the repayment of loans denominated in foreign currencies. The PRC government may also at its discretion restrict access in the future to foreign currencies for current account transactions. If the foreign exchange control system prevents us from obtaining sufficient foreign currency to satisfy our currency demands, we may not be able to pay dividends in foreign currencies to our security-holders.\nFailure to comply with the Individual Foreign Exchange Rules relating to the overseas direct investment or the engagement in the issuance or trading of securities overseas by our PRC resident stockholders may subject such stockholders to fines or other liabilities.\nOur ability to conduct foreign exchange activities in the PRC may be subject to the interpretation and enforcement of the Implementation Rules of the Administrative Measures for Individual Foreign Exchange promulgated by SAFE in January 2007 (as amended and supplemented, the Individual Foreign Exchange Rules). Under the Individual Foreign Exchange Rules, any PRC individual seeking to make a direct investment overseas or engage in the issuance or trading of negotiable securities or derivatives overseas must make the appropriate registrations in accordance with SAFE provisions. PRC individuals who fail to make such registrations may be subject to warnings, fines or other liabilities.\nSAFE promulgated the Notice on Relevant Issues Relating to Domestic Residents Investment and Financing and Roundtrip Investment through Special Purpose Vehicles, or Notice 37, in July 2014 that requires PRC residents or entities to register with SAFE or its local branch in connection with their establishment or control of an offshore entity established for the purpose of overseas investment or financing. In addition, such PRC residents or entities must update their SAFE registrations when the offshore special purpose vehicle undergoes material events relating to material change of capitalization or structure of the PRC resident itself (such as capital increase, capital reduction, share transfer or exchange, merger or spin off).\nWe may not be fully informed of the identities of all our beneficial owners who are PRC residents. For example, because the investment in or trading of our shares will happen in an overseas public or secondary market where shares are often held with brokers in brokerage accounts, it is unlikely that we will know the identity of all of our beneficial owners who are PRC residents. Furthermore, we have no control over any of our future beneficial owners and we cannot assure you that such PRC residents will be able to complete the necessary approval and registration procedures required by the Individual Foreign Exchange Rules.\nTo our knowledge, our beneficial owners, who are PRC residents, have not completed the Notice 37 registration. And we cannot guarantee that all or any of the shareholders will complete the Notice 37 registration prior to the closing of this Offering. Failure by any such shareholders or beneficial owners to comply with Notice 37 could restrict our overseas or cross-border investment activities, limit our PRC subsidiaries ability to make distributions or pay dividends or affect our ownership structure, which could adversely affect our business and prospects. In addition, the PRC resident shareholders who fail to complete Notice 37 registration may subject to fines less than RMB50,000.\nAs these foreign exchange and outbound investment related regulations are relatively new and their interpretation and implementation has been constantly evolving, it is unclear how these regulations, and any future regulation concerning offshore or cross-border investments and transactions, will be interpreted, amended and implemented by the relevant government authorities.\nIt is uncertain how the Individual Foreign Exchange Rules will be interpreted or enforced and whether such interpretation or enforcement will affect our ability to conduct foreign exchange transactions. Because of this uncertainty, we cannot be sure whether the failure by any of our PRC resident stockholders to make the required registration will subject our PRC subsidiaries to fines or legal sanctions on their operations, delay or restriction on repatriation of proceeds of our securities offerings into the PRC, restriction on remittance of dividends or other punitive actions that would have a material adverse effect on our business, results of operations and financial condition.\nUnder the Enterprise Income Tax Law, we may be classified as a Resident Enterprise of China. Such classification will likely result in unfavorable tax consequences to us and our non-PRC stockholders.\nChina passed an Enterprise Income Tax Law (the EIT Law), as most recently amended and effective on December 29, 2018, and the related Implementation Regulations, as amended and effective on April 23 2019. Under the EIT Law, an enterprise established outside of China with de facto management bodies within China is considered a resident enterprise, meaning that it can be treated in a manner similar to a Chinese enterprise for enterprise income tax purposes. The implementing rules of the EIT Law define de facto management as substantial and overall management and control over the production and operations, personnel, accounting, and properties of the enterprise.\nOn April 22, 2009, the State Administration of Taxation of China issued the Notice Concerning Relevant Issues Regarding Cognizance of Chinese Investment Controlled Enterprises Incorporated Offshore as Resident Enterprises pursuant to Criteria of de facto Management Bodies, or the Notice, further interpreting the application of the EIT Law and its implementation to offshore entities controlled by a Chinese enterprise or group. Pursuant to the Notice, an enterprise incorporated in an offshore jurisdiction and controlled by a Chinese enterprise or group will be classified as a non-domestically incorporated resident enterprise if (i) its senior management in charge of daily operations reside or perform their duties mainly in China; (ii) its financial or personnel decisions are made or approved by bodies or persons in China; (iii) its substantial assets and properties, accounting books, corporate stamps, board and stockholder minutes are kept in China; and (iv) at least half of its directors with voting rights or senior management are often resident in China. A resident enterprise would be subject to an enterprise income tax rate of 25% on its worldwide income and must pay a withholding tax at a rate of 10% when paying dividends to its non-PRC stockholders.\nUncertainties with respect to the PRC legal system could adversely affect us, including risks and uncertainties regarding the enforcement of laws and that rules and regulations in China can change quickly with little advance notice.\nWe conduct substantially all of our business through our subsidiaries in China. Our operations in China are governed by PRC laws and regulations. Our PRC subsidiaries are generally subject to laws and regulations applicable to foreign investments in China and, in particular, laws and regulations applicable to wholly foreign-owned enterprises. The PRC legal system is based on statutes. Prior court decisions may be cited for reference but have limited precedential value.\nSince 1979, PRC legislation and regulations have significantly enhanced the protections afforded to various forms of foreign investments in China. However, China has not developed a fully integrated legal system and recently enacted laws and regulations may not sufficiently cover all aspects of economic activities in China. In particular, the interpretation and enforcement of these laws and regulations involve uncertainties. Since PRC administrative and court authorities have significant discretion in interpreting and implementing statutory provisions and contractual terms, it may be difficult to evaluate the outcome of administrative and court proceedings and the level of legal protection we enjoy. These uncertainties may affect our judgment on the relevance of legal requirements and our ability to enforce our contractual rights or tort claims. In addition, these regulatory uncertainties may be exploited through unmerited or frivolous legal actions or threats in attempts to extract payments or benefits from us.\nIn addition, the PRC legal system is based in part on government policies and internal rules (some of which are not published on a timely basis or at all) that may change quickly with little advance notice or have a retroactive effect. As a result, we may not be aware of our violation of these policies and rules until sometime after the violation. On July 6, 2021, the General Office of the Communist Party of China Central Committee and the General Office of the State Council jointly issued a document to enhance its enforcement against illegal activities in the securities markets and promote the high-quality development of capital markets, which, among other things, requires the relevant governmental authorities to strengthen cross-border oversight of law-enforcement and judicial cooperation, to enhance supervision over Chinese companies listed overseas, and to establish and improve the system of extraterritorial application of the Chinese securities laws. Since this document is relatively new, uncertainties exist in relation to how soon legislative or administrative regulation-making bodies will respond and what existing or new laws or regulations or detailed implementations and interpretations will be modified or promulgated, if any, and the potential impact such modified or new laws and regulations will have on companies like us. It is especially difficult for us to accurately predict the potential impact on us of new legal requirements in mainland China because the Chinese legal system is a civil law system based on written statutes. Unlike the common law system, prior court decisions under the civil law system may be cited for reference but have limited precedential value.\nSuch uncertainties, including any inability to enforce our contracts, together with any development or interpretation of PRC law that is adverse to us, could materially and adversely affect our business and operations. Furthermore, intellectual property rights and confidentiality protections in China may not be as effective as in the United States or other more developed countries. We cannot predict the effect of future developments in the PRC legal system, including the promulgation of new laws, changes to existing laws or the interpretation or enforcement thereof, or the preemption of local regulations by national laws. These uncertainties could limit the legal protections available to us and our investors.\nThe Chinese government may intervene or influence the operation of our PRC subsidiaries and exercise significant oversight and discretion over the conduct of their business and may intervene in or influence their operations at any time, or may exert more control over securities offerings conducted overseas and/or foreign investment in China-based issuers, which could result in a material change in operations of our PRC subsidiaries and/or the value of our common stock.\nThe Chinese government has exercised and continues to exercise substantial control over virtually every sector of the Chinese economy through regulation and state ownership. Our ability to operate in China may be harmed by changes in its laws and regulations, including those relating to securities regulation, data protection, cybersecurity and mergers and acquisitions and other matters. The central or local governments of these jurisdictions may impose new, stricter regulations or interpretations of existing regulations that would require additional expenditures and efforts on our part to ensure our compliance with such regulations or interpretations.\nGovernment actions in the future could significantly affect economic conditions in China or particular regions thereof, and could require us to materially change our operating activities or divest ourselves of any interests we hold in Chinese assets. Our business may be subject to various government and regulatory interference in the areas in which we operate. We may incur increased costs necessary to comply with existing and newly adopted laws and regulations or penalties for any failure to comply. Our operations could be adversely affected, directly or indirectly, by existing or future laws and regulations relating to our business or industry.\nGiven recent statements by the Chinese government indicating an intent to exert more oversight and control over offerings that are conducted overseas and/or foreign investment in China-based issuers, any such action could significantly limit or completely hinder our ability to offer or continue to offer securities to investors and cause the value of such securities to significantly decline or become worthless.\nRecently, the General Office of the Central Committee of the Communist Party of China and the General Office of the State Council jointly issued the Opinions on Severely Cracking Down on Illegal Securities Activities According to Law, or the Opinions, which was made available to the public on July 6, 2021. The Opinions emphasized the need to strengthen the administration over illegal securities activities, and the need to strengthen the supervision over overseas listings by Chinese companies. Effective measures, such as promoting the construction of relevant regulatory systems, will be taken to deal with the risks and incidents of China-based overseas listed companies. As of the date of this report, we have not received any inquiry, notice, warning, or sanctions from PRC government authorities in connection with the Opinions.\nOn June 10, 2021, the Standing Committee of the National Peoples Congress of China, or the SCNPC, promulgated the Data Security Law, which took effect in September 2021. The PRC Data Security Law imposes data security and privacy obligations on entities and individuals carrying out data activities, and introduces a data classification and hierarchical protection system based on the importance of data in economic and social development, and the degree of harm it will cause to national security, public interests, or legitimate rights and interests of individuals or organizations when such data is tampered with, destroyed, leaked, illegally acquired or used. The PRC Data Security Law also provides for a national security review procedure for data activities that may affect national security and imposes export restrictions on certain data an information. The law provides for privacy obligations of entities and individuals carrying out data activities, prohibits entities and individuals in China from providing any foreign judicial or law enforcement authority with any data stored in China without approval from the competent PRC authority, and sets forth the legal liabilities of entities and individuals found to be in violation of their data protection obligations, including rectification order, warning, fines of up to RMB10 million, suspension of relevant business, and revocation of business permits or licenses.\nIn early July 2021, regulatory authorities in China launched cybersecurity investigations with regard to several China-based companies that are listed in the United States. The Chinese cybersecurity regulator announced on July 2 that it had begun an investigation of Didi Global Inc. (NYSE: DIDI) and two days later ordered that the companys app be removed from smartphone app stores. On July 5, 2021, the Chinese cybersecurity regulator launched the same investigation on two other Internet platforms, Chinas Full Truck Alliance of Full Truck Alliance Co. Ltd. (NYSE: YMM) and Boss of KANZHUN LIMITED (Nasdaq: BZ). On July 24, 2021, the General Office of the Communist Party of China Central Committee and the General Office of the State Council jointly released the Guidelines for Further Easing the Burden of Excessive Homework and Off-campus Tutoring for Students at the Stage of Compulsory Education, pursuant to which foreign investment in such firms via mergers and acquisitions, franchise development, and variable interest entities are banned from that sector.\nOn July 10, 2021, the CAC released the Cybersecurity Review Measures (Revised Draft for Solicitation of Comments), or the Revised Cybersecurity Measures, pursuant to which operator holding more than one million users/users (which is to be further specified) individual information shall be subject to cybersecurity review before listing abroad. The cybersecurity review will evaluate, among others, the risk of critical information infrastructure, core data, important data, or a large amount of personal information being influenced, controlled or maliciously used by foreign governments after going public overseas. The procurement of network products and services, data processing activities and overseas listing should also be subject to cybersecurity review if they concern or potentially pose risks to national security. According to the effective Cybersecurity Review Measures, online platform/website operators of certain industries may be identified as critical information infrastructure operators by the CAC, once they meet standard as stated in the National Cybersecurity Inspection Operation Guide, and such operators may be subject to cybersecurity review. The scope of business operations and financing activities that are subject to the Revised Cybersecurity Measures and the implementation thereof is not yet clear. As of the date of this report, we have not been informed by any PRC governmental authority of any requirement that we file for approval in connection with an offering of our common stock.\nOn August 17, 2021, the State Council promulgated the Regulations on the Protection of the Security of Critical Information Infrastructure, or the Regulations, which took effect on September 1, 2021. The Regulations supplement and specify the provisions on the security of critical information infrastructure as stated in the Cybersecurity Review Measures. The Regulations provide, among others, that protection department of certain industry or sector shall notify the operator of the critical information infrastructure in time after the identification of certain critical information infrastructure.\nOn August 20, 2021, the SCNPC adopted the Personal Information Security Law, which took effect on November 1, 2021. The Personal Information Protection Law includes the basic rules for personal information processing, the rules for cross-border provision of personal information, the rights of individuals in personal information processing activities, the obligations of personal information processors, and the legal responsibilities for illegal collection, processing, and use of personal information. As the first systematic and comprehensive law specifically for the protection of personal information in the PRC, the Personal Information Protection Law provides, among others, that (i) an individuals consent shall be obtained to use sensitive personal information, such as biometric characteristics and individual location tracking, (ii) personal information operators using sensitive personal information shall notify individuals of the necessity of such use and impact on the individuals rights, and (iii) where personal information operators reject an individuals request to exercise his or her rights, the individual may file a lawsuit with a Peoples Court.\nOn December 28, 2021, the CAC, NDRC, and other regulatory agencies jointly issued the final version of the Revised Cybersecurity Review Measures, or the Measures, which took effect and replace the previously issued Revised Measures for Cybersecurity Review on February 15, 2022. Under the Revised Review Measures, an online platform operator in possession of personal data of more than one million users must apply for a cybersecurity review if it intends to list its securities on a foreign stock exchange. The operators of critical information infrastructure purchasing network products and services, and the online platform operators (together with the operators of critical information infrastructure, the Operators) carrying out data processing activities that affect or may affect national security, shall conduct a cybersecurity review, and any online platform operator who controls more than one million users personal information must go through a cybersecurity review by the cybersecurity review office if it seeks to be listed in a foreign country.\nWith regard to the current effective data security management regulations, we dont believe that we are required to conduct data security review for listing overseas. However, according to the Regulations on Network Data Security Management (Draft for Comment), as an overseas listed company, we will be required to conduct an annual data security review and to comply with the relevant reporting obligations. We have been closely monitoring the development in the regulatory landscape in China, particularly regarding the requirement of approvals, including on a retrospective basis, from the CSRC, the CAC or other PRC authorities with respect to this offering, as well as regarding any annual data security review or other procedures that may be imposed on us. If any approval, review or other procedure is in fact required, we cannot assure you that we will be able to obtain such approval or complete such review or other procedure timely or at all. For any approval that we may be able to obtain, it could nevertheless be revoked and the terms of its issuance may impose restrictions on our operations and offerings relating to our securities. The regulatory requirements with respect to cybersecurity and data privacy are constantly evolving and can be subject to varying interpretations, and significant changes, resulting in uncertainties about the scope of our responsibilities in that regard. Failure to comply with the cybersecurity and data privacy requirements in a timely manner, or at all, may subject us to government enforcement actions and investigations, fines, penalties, suspension or disruption of our operations, among other things.\nGiven that the above referenced laws, regulations and policies were recently promulgated or publicly released, their interpretation, application and enforcement are subject to substantial uncertainties.\nIf the Chinese government determines that our corporate structure does not comply with Chinese regulations, or if Chinese regulations change or are interpreted differently in the future, Chinese regulatory authorities could disallow our current operating structure, which would likely result in a material change in our operations and/or cause the value of such securities to significantly decline or become worthless.\nIn July 2021, the Chinese government provided new guidance on Chinese companies raising capital outside of mainland China, including through arrangements called variable interest entities, or VIEs. Currently, our corporate structure contains no variable interest entities and we are not in an industry that is subject to foreign ownership limitations in mainland China. However, there are uncertainties with respect to the Chinese legal system and there may be changes in laws, regulations and policies, including how those laws, regulations and policies will be interpreted or implemented. If in the future the Chinese government determines that our corporate structure does not comply with Chinese regulations, or if Chinese regulations change or are interpreted differently, the value of our securities may decline or become worthless.\nThe Chinese government may intervene or influence our operations at any time, or may exert more control over offerings conducted overseas and/or foreign investment in China-based issuers, which could result in a material change in our operations and/or cause the value of our securities to significantly decline or be worthless.\nThe Chinese government has significant oversight and discretion over the conduct of our business and may intervene or influence our operations as the government deems appropriate to further regulatory, political and societal goals. The Chinese government has recently published new policies that significantly affected certain industries such as the education and internet industries, and we cannot rule out the possibility that it will in the future release regulations or policies regarding the food and beverage industry or the supply china industry that could require us to seek permission from Chinese authorities to continue to operate our business, which may adversely affect our business, financial condition and results of operations. Furthermore, recent statements made by the Chinese government have indicated an intent to increase the governments oversight and control over offerings of companies with significant operations in mainland China that are to be conducted in foreign markets, as well as foreign investment in China-based issuers like us. Any future action by the Chinese government expanding the categories of industries and companies whose foreign securities offerings are subject to government review could significantly limit or completely hinder our ability to offer or continue to offer securities to investors or could disallow our current operating structure, which would likely result in a material change in our operations and/or a material change in the value of our securities, including causing the value of such securities to significantly decline or become worthless.\nOn July 6, 2021, the General Office of the Communist Party of China Central Committee and the General Office of the State Council jointly issued a document to crack down on illegal activities in the securities market and promote the high-quality development of the capital market, which, among other things, requires the relevant governmental authorities to strengthen cross-border oversight of law enforcement and judicial cooperation, to enhance supervision over China-based companies listed overseas, and to establish and improve the system of extraterritorial application of the PRC securities laws. Since this document is still relatively new, uncertainties still exist in relation to how soon legislative or administrative regulation making bodies will respond and what existing or new laws or regulations or detailed implementations and interpretations will be modified or promulgated, if any, and the potential impact such modified or new laws and regulations will have on our future business combination with a company with major operation in China.\nFurther, Chinese government continues to exert more oversight and control over Chinese technology firms. On July 2, 2021, Chinese cybersecurity regulator announced, that it had begun an investigation of Didi Global Inc. (NYSE: DIDI) and two days later ordered that the companys application be removed from smartphone application stores. On July 5, 2021, the Chinese cybersecurity regulator launched the same investigation on two other Internet platforms, Chinas Full Truck Alliance of Full Truck Alliance Co. Ltd. (NYSE: YMM) and Boss of KANZHUN LIMITED (Nasdaq: BZ).\nOn December 24, 2021, the CSRC issued the Administrative Provisions of the State Council Regarding the Overseas Issuance and Listing of Securities by Domestic Enterprises (the Draft Administrative Provisions) and the Measures for the Overseas Issuance of Securities and Listing Record-Filings by Domestic Enterprises (Draft for Comments) (the Draft Filing Measures), collectively, the Draft Overseas Listing Rules, which are currently published for public comments only. According to the Draft Overseas Listing Rules, among other things, all China-based companies applying for overseas securities issuance, listing and post-listing capital operations shall be subject to statutory procedures, such as filing and information reporting requirement. After making initial applications with overseas stock markets for offerings or listings, all China-based companies shall file with the CSRC within three business days. In addition, overseas offerings and listings may be prohibited for such China-based companies when any of the following applies: (a) if the securities offerings and listings are prohibited by applicable PRC laws and rules; (b) if securities offerings and listings may constitute a threat to, or endanger national security as reviewed and determined by PRC authorities; (c) if there are material ownership disputes over applicants equity interests, major assets, core technologies or other items; (d) if a PRC company or its controlling shareholders or de facto controllers have committed certain crimes, under investigation for suspicion of major violations in the prior three years; (e) if any directors, supervisors, or senior executives of applicants have been subject to administrative punishments for severe violations, or are under investigations for crimes or major violations; or (f) other circumstances as provided. The Draft Administrative Provisions further provide that a fine between RMB 1 million and RMB 10 million may be imposed if a company fails to fulfill the filing requirements with the CSRC or conducts an overseas offering or listing in violation of the Draft Overseas Listing Rules. In the case of severe violations, an order to suspend relevant businesses or halt operations for rectification may be issued, and relevant business permits or operational license revoked. Overseas issuance and listings subject to the Draft Overseas Listing Rules include direct and indirect issuance and listings. We believe that our future securities offerings and proposed listing of our shares on Nasdaq Capital Market would be deemed an Indirect Overseas Issuance and Listing under the Draft Overseas Listing Rules and will be required to complete the filing procedures and submit the relevant information to CSRC after the Draft Overseas Listing Rules become effective. As of the date of this report, such rules have not become effective and we are not required to complete the filing procedures if we complete this offering and begin the trading of our common stock on the Nasdaq before the rules take effect. In addition, after the rules take effect, we would only need to submit the filing materials and no CSRC approval would be required under the rules. Because we are relying on an opinion of counsel, there is uncertainty inherent in relying on an opinion of counsel in connection with whether we are required to obtain permissions from a governmental agency that is required to approve of our operations and/or listings. In the event that an government approval is required, we cannot assure you that we will be able to receive clearance in a timely manner, or at all. Any failure of us to fully comply with new regulatory requirements may significantly limit or completely hinder our ability to offer or continue to offer our common stock, cause significant disruption to our business operations, severely damage our reputation, materially and adversely affect our financial condition and results of operations and cause our shares to significantly decline in value or become worthless.\nChina Securities Regulatory Commission and other Chinese government agencies may exert more oversight and control over offerings that are conducted overseas and/or foreign investment in China-based issuers. Additional compliance procedures may be required in connection with the offering of our securities and our business operations, and, if required, we cannot predict whether we will be able to obtain such approval. As a result, we face uncertainty about future actions by the PRC government that could significantly affect our ability to offer or continue to offer securities to investors and/or conduct our operations and cause the value of our shares to significantly decline or be worthless.\nWe may be exposed to liabilities under the Foreign Corrupt Practices Act, and any determination that we violated the foreign corrupt practices act could have a material adverse effect on our business.\nWe are subject to the Foreign Corrupt Practice Act, or FCPA, and other laws that prohibit improper payments or offers of payments to foreign governments and their officials and political parties by U.S. persons and issuers as defined by the statute for the purpose of obtaining or retaining business. We will have operations, agreements with third parties and make sales in the PRC, which may experience corruption. Our proposed activities in the PRC create the risk of unauthorized payments or offers of payments by one of the employees, consultants, or sales agents of our Company, because these parties are not always subject to our control. It is our policy to implement safeguards to discourage these practices by our employees. Also, our existing safeguards and any future improvements may prove to be less than effective, and the employees, consultants, or sales agents of our Company may engage in conduct for which we might be held responsible. Violations of the FCPA may result in severe criminal or civil sanctions, and we may be subject to other liabilities, which could negatively affect our business, operating results and financial condition. In addition, the government may seek to hold our Company liable for successor liability FCPA violations committed by companies in which we invest or that we acquire.\nYou may have difficulty enforcing judgments against us.\nWe are a Nevada corporation but most of our assets are and will be located outside of the United States. Almost all our operations are conducted in the PRC. In addition, all our officers and directors are the nationals and residents of a country other than the United States. Almost all of their assets are located outside the United States. As a result, it may be difficult for you to effect service of process within the United States upon them. It may also be difficult for you to enforce in U.S. courts judgments on the civil liability provisions of the U.S. federal securities laws against us and our officers and directors, since he or she is not a resident in the United States. In addition, there is uncertainty as to whether the courts of the PRC or other jurisdictions would recognize or enforce judgments of U.S. courts.\nChinese economic growth slowdown may have a negative effect on our business.\nSince 2014, Chinese economic growth has been slowing down from double-digit GDP speed. The annual rate of growth declined from 7.3% in 2014 to 6.9% in 2015, to 6.7% in 2016, to 6.9% in 2017, to 6.6% in 2018, and to 6.1% in 2019. Due to the impact of COVID-19, Chinas economic growth rate in 2020 has slowed to 2.3%, its lowest level in years. While technology-based financial services companies have not been affected by the pandemic on the same level as companies in certain other industries, nevertheless a slow economic growth could adversely affect many of our customers and partners, which in turn may materially adversely affect our financial condition and results of operations.\nPRC regulation of loans and direct investment by offshore holding companies in PRC entities may delay or prevent us from using the proceeds of our securities offerings to make loans or additional capital contributions to our PRC operating subsidiaries, which could materially and adversely affect our liquidity and our ability to fund and expand our business.\nIn the normal course of our business, we may make loans to our PRC subsidiaries or may make additional capital contributions to our PRC subsidiaries. Any loans to our wholly foreign-owned or holding subsidiaries in China, which are treated as foreign-invested enterprises (FIEs) under PRC law, are subject to PRC regulations and foreign exchange loan registrations. For example, loans by us to our FIE subsidiaries in China to finance their activities cannot exceed statutory limits and must be registered with SAFE. In addition, a foreign invested enterprise shall use its capital pursuant to the principle of authenticity and self-use within its business scope. The capital of a foreign invested enterprise shall not be used for the following purposes: (i) directly or indirectly used for payment beyond the business scope of the enterprises or the payment prohibited by relevant laws and regulations; (ii) directly or indirectly used for investment in securities or investments other than banks principal-secured products unless otherwise provided by relevant laws and regulations; (iii) granting of loans to non-affiliated enterprises, except where it is expressly permitted in the business license; and (iv) paying the expenses related to the purchase of real estate that is not for self-use (except for the foreign-invested real estate enterprises).\nSAFE promulgated the Notice of the State Administration of Foreign Exchange on Reforming the Administration of Foreign Exchange Settlement of Capital of Foreign-invested Enterprises, or SAFE Circular 19, effective June 2015, in replacement of the Circular on the Relevant Operating Issues Concerning the Improvement of the Administration of the Payment and Settlement of Foreign Currency Capital of Foreign-Invested Enterprises, the Notice from the State Administration of Foreign Exchange on Relevant Issues Concerning Strengthening the Administration of Foreign Exchange Businesses, and the Circular on Further Clarification and Regulation of the Issues Concerning the Administration of Certain Capital Account Foreign Exchange Businesses. According to SAFE Circular 19, the flow and use of the RMB capital converted from foreign currency-denominated registered capital of a foreign-invested company is regulated such that RMB capital may not be used for the issuance of RMB entrusted loans, the repayment of inter-enterprise loans or the repayment of banks loans that have been transferred to a third party. Although SAFE Circular 19 allows RMB capital converted from foreign currency-denominated registered capital of a foreign-invested enterprise to be used for equity investments within China, it also reiterates the principle that RMB converted from the foreign currency-denominated capital of a foreign-invested company may not be directly or indirectly used for purposes beyond its business scope. SAFE promulgated the Notice of the State Administration of Foreign Exchange on Reforming and Standardizing the Foreign Exchange Settlement Management Policy of Capital Account, or SAFE Circular 16, effective on June 9, 2016, which reiterates some of the rules set forth in SAFE Circular 19, but changes the prohibition against using RMB capital converted from foreign currency-denominated registered capital of a foreign-invested company to issue RMB entrusted loans to a prohibition against using such capital to issue loans to non-associated enterprises. Violations of SAFE Circular 19 and SAFE Circular 16 could result in administrative penalties. SAFE Circular 19 and SAFE Circular 16 may significantly limit our ability to transfer any foreign currency we hold, including the net proceeds from this offering, to our PRC subsidiaries, which may adversely affect our liquidity and our ability to fund and expand our business in China. On October 23, 2019, the SAFE promulgated the Notice of the State Administration of Foreign Exchange on Further Promoting the Convenience of Cross-border Trade and Investment, or the SAFE Circular 28, which, among other things, allows all foreign-invested companies to use Renminbi converted from foreign currency-denominated capital for equity investments in China, as long as the equity investment is genuine, does not violate applicable laws, and complies with the negative list on foreign investment. However, since the SAFE Circular 28 is newly promulgated, it is unclear how SAFE and competent banks will implement the relevant rules in practice.\nIn light of the various requirements imposed by PRC regulations on loans to and direct investment in PRC entities by offshore holding companies, we cannot be certain that we will be able to complete the necessary government registrations or obtain the necessary government approvals on a timely basis, if at all, with respect to future loans to our PRC subsidiaries or future capital contributions by us to our subsidiaries in China. As a result, uncertainties exist as to our ability to provide prompt funding to our PRC subsidiaries when needed. If we fail to complete such registrations or obtain such approvals, our ability to use the proceeds we expect to receive from this offering and to capitalize or otherwise fund our PRC operations may be negatively affected, which could materially and adversely affect our financial condition and operating results.\nFluctuations in exchange rates could adversely affect our business and the value of our securities.\nChanges in the value of the RMB against the U.S. dollar, Euro and other foreign currencies are affected by, among other things, changes in Chinas political and economic conditions. Any significant revaluation of the RMB may have a material adverse effect on our revenues and financial condition, and the value of, and any dividends payable on our shares in U.S. dollar terms. For example, to the extent that we need to convert U.S. dollars we receive from our securities offerings into RMB for our operations, appreciation of the RMB against the U.S. dollar would have an adverse effect on RMB amount we would receive from the conversion. Conversely, if we decide to convert our RMB into U.S. dollars for the purpose of paying dividends on our common stock or for other business purposes, appreciation of the U.S. dollar against the RMB would have a negative effect on the U.S. dollar amount available to us. In addition, fluctuations of the RMB against other currencies may increase or decrease the cost of imports and exports, and thus affect the price-competitiveness of our products against products of foreign manufacturers or products relying on foreign inputs.\nSince July 2005, the RMB is no longer pegged to the U.S. dollar. Although the Peoples Bank of China regularly intervenes in the foreign exchange market to prevent significant short-term fluctuations in the exchange rate, the RMB may appreciate or depreciate significantly in value against the U.S. dollar in the medium to long term. Moreover, it is possible that in the future PRC authorities may lift restrictions on fluctuations in the RMB exchange rate and lessen intervention in the foreign exchange market.\nWe will reflect the impact of currency translation adjustments in our financial statements under the heading accumulated other comprehensive income (loss). Very limited hedging transactions are available in China to reduce our exposure to exchange rate fluctuations. To date, we have not entered into any hedging transactions. While we may enter into hedging transactions in the future, the availability and effectiveness of these transactions may be limited, and we may not be able to successfully hedge our exposure at all. In addition, our foreign currency exchange gains and losses may be magnified by PRC exchange control regulations that restrict our ability to convert RMB into foreign currencies.\nThere are uncertainties under the PRC laws relating to the procedures for U.S. regulators to investigate and collect evidence from companies located in the PRC.\nShareholder claims that are common in the U.S., including securities law class actions and fraud claims, among other matters, generally are difficult to pursue as a matter of law or practicality in China. For example, in China, there are significant legal and other obstacles to obtaining information needed for shareholder investigations or litigation outside China or otherwise with respect to foreign entities. Although the local authorities in China may establish a regulatory cooperation mechanism with the securities regulatory authorities of another country or region to implement cross-border supervision and administration, such regulatory cooperation with the securities regulatory authorities in the Unities States have not been efficient in the absence of mutual and practical cooperation mechanism. According to Article 177 of the PRC Securities Law, which became effective in March 2020, or Article 177, the securities regulatory authority of the State Council may collaborate with securities regulatory authorities of other countries or regions in order to monitor and oversee cross border securities activities. Article 177 further provides that overseas securities regulatory authorities are not permitted to carry out investigation and evidence collection directly within the territory of the PRC, and that any Chinese entities and individuals are not allowed to provide documents or materials related to securities business activities to overseas agencies without prior consent of the securities regulatory authority of the State Council and the competent departments of the State Council.\nOur principal business operations will be conducted in the PRC. In the event that the U.S. regulators carry out investigations with respect to our business and need to conduct investigation or collect evidence within the territory of the PRC, the U.S. regulators may not be able to carry out such investigation or evidence collection directly in the PRC under the PRC laws. The U.S. regulators may consider cross-border cooperation with securities regulatory authority of the PRC by way of judicial assistance, diplomatic channels or regulatory cooperation mechanism established with the securities regulatory authority of the PRC. However, there can be no assurance that the U.S. regulators could succeed in establishing such cross-border cooperation in a specific case or could establish the cooperation in a timely manner. If U.S. regulators are unable to conduct such investigations, such U.S. regulators may determine to suspend and ultimately delist our common stock from the Nasdaq Capital Market or choose to suspend or de-register our SEC registration.\nFailure to comply with laws and regulations applicable to our business in China could subject us to fines and penalties and could also cause us to lose customers or otherwise harm our business.\nOur business is subject to regulation by various governmental agencies in China, including agencies responsible for monitoring and enforcing compliance with various legal obligations, such as privacy and data protection-related laws and regulations, intellectual property laws, employment and labor laws, workplace safety, environmental laws, consumer protection laws, governmental trade laws, import and export controls, anti-corruption and anti-bribery laws, and tax laws and regulations. These laws and regulations impose added costs on our business. Noncompliance with applicable regulations or requirements could subject us to:\n●\ninvestigations, enforcement actions, and sanctions;\n●\nmandatory changes to our supply chain system and products;\n●\ndisgorgement of profits, fines, and damages;\n●\ncivil and criminal penalties or injunctions;\n●\nclaims for damages by our customers or partners;\n●\ntermination of contracts;\n●\nloss of intellectual property rights;\n●\nfailure to obtain, maintain or renew certain licenses, approvals, permits, registrations or filings\n●\nnecessary to conduct our operations; and\n●\ntemporary or permanent debarment from sales to public service organizations.\nIf any governmental sanctions are imposed, or if we do not prevail in any possible civil or criminal litigation, our business, results of operations, and financial condition could be adversely affected. In addition, responding to any action will likely result in a significant diversion of our managements attention and resources and an increase in professional fees. Enforcement actions and sanctions could materially harm our business, results of operations, and financial condition.\nWe are exposed to the risk of misconduct, errors and failure to functions by our management, employees and parties that we collaborate with, who may from time to time be subject to litigation and regulatory investigations and proceedings or otherwise face potential liability and penalties in relation to noncompliance with applicable laws and regulations, which could harm our reputation and business.\nPayment of dividends is subject to restrictions under Nevada and the PRC laws.\nUnder Nevada law, we may only pay dividends subject to our ability to service our debts as they become due and provided that our assets will exceed our liabilities after the payment of such dividends. Our ability to pay dividends will therefore depend on our ability to generate adequate profits. In addition, because of a variety of rules applicable to our operations in the PRC and the regulations on foreign investments as well as the applicable tax law, we may be subject to further limitations on our ability to declare and pay dividends to our shareholders.\nAs a holding company, we may rely on dividends and other distributions from our PRC subsidiaries and WFOEs for cash requirements. If a WFOE incurs any debts, the instruments governing such debts may restrict its ability to pay dividends to us. In order for us to pay dividends or other distributions to our shareholders, including investors in this offering, we will rely on payments from our subsidiaries. Cash or other assets may be transferred to us from our subsidiaries in the following manner: (i) funds from our operating subsidiaries to WFOEs may be remitted as services fees, dividends or other distributions; and (ii) WFOEs may make dividends or other distributions to us through our Hong Kong subsidiaries.\nCurrent PRC regulations permit Chinese operating subsidiaries to pay dividends to foreign parent companies only out of their accumulated profits, if any, determined in accordance with Chinese accounting standards and regulations. In addition, each of our subsidiaries in China is required to set aside at least 10% of its after-tax profits each year, if any, to fund a statutory reserve until such reserve reaches 50% of its registered capital. Each of our subsidiaries in China is also required to further set aside a portion of its after-tax profits to fund the employee welfare fund, although the amount to be set aside, if any, is determined at the discretion of its board of directors. While the statutory reserves can be used, among other ways, to increase the registered capital and eliminate future losses in excess of retained earnings of the respective companies, the reserve funds are not distributable as cash dividends except in the event of liquidation.\nCash dividends, if any, on our common stock will be paid in U.S. dollars. The PRC government also imposes restrictions on the conversion of RMB into foreign currencies and the remittance of currencies out of the PRC. As such, we may experience difficulties in completing the administrative procedures necessary to obtain and remit foreign currency for the payment of dividends from our profits, if any. Furthermore, if our subsidiaries in the PRC incur any debts, the existence of debts evidenced by the debt instruments may significantly limit their ability to pay dividends or make other payments. If we are unable to receive earnings distributions from our operating subsidiaries in China, we would be unable to pay dividends on our shares.\nIf we are deemed by the PRC tax authorities as a PRC tax resident enterprise for tax purposes, any dividends we pay to our non-PRC resident shareholders may be regarded as China-sourced income and as a result, may be subject to PRC withholding tax at a rate of up to 10.0%. Pursuant to the Arrangement between Mainland China and the Hong Kong Special Administrative Region for the Avoidance of Double Taxation and Tax Evasion on Income, or the Double Tax Avoidance Arrangement, the 10% withholding tax rate may be reduced to 5% if a Hong Kong resident enterprise owns no less than 25% of a PRC entity. However, the 5% withholding tax rate does not automatically apply and certain requirements must be satisfied, including, without limitation, that (a) the Hong Kong entity must be the beneficial owner of the relevant dividends; and (b) the Hong Kong entity must directly hold no less than 25% share ownership in the PRC entity during the 12 consecutive months preceding its receipt of the dividends. In practice, a Hong Kong entity must obtain a tax resident certificate from the Hong Kong tax authority to apply for the 5% lower PRC withholding tax rate. As the Hong Kong tax authority will issue such a tax resident certificate on a case-by-case basis, we cannot be certain that we will be able to obtain the tax resident certificate from the relevant Hong Kong tax authority and enjoy the preferential withholding tax rate of 5% under the Double Taxation Arrangement with respect to any dividends to be paid by our subsidiary in mainland China, to our Hong Kong subsidiary.\nAs of the date of this report, we have not paid, and do not anticipate paying in the foreseeable future, dividends or other distributions to our shareholders. We presently intend to retain all earnings to fund our operations and business expansions.\nWe can give no assurance that we will declare dividends of any amounts, at any rate or at all in the future. The declaration of future dividends, if any, will be at the discretion of our board of directors and will depend upon our future operations and earnings, capital requirements, general financial conditions, legal and contractual restrictions and other factors that our board of directors may deem relevant.\nRisks Related to Our Common Stock\nDue to factors beyond our control, our stock price may be volatile.\nThere is currently a limited market for our Common Stock, and there can be no guarantee that an active market for our Common Stock will develop, even if we are successful in consummating a business combination. Recently, the price of our Common Stock has been volatile for no reason. Further, even if an active market for our Common Stock develops, it will likely be subject to by significant price volatility when compared to more seasoned issuers. We expect that the price of our Common Stock will continue to be more volatile than more seasoned issuers for the foreseeable future. Fluctuations in the price of our Common Stock can be based on various factors in addition to those otherwise described in this Report, including:\n●\nGeneral speculative fever;\n●\nA prospective business combination and the terms and conditions thereof;\n●\nThe operating performance of any business we acquire, including any failure to achieve material revenues therefrom;\n●\nThe performance of our competitors in the marketplace, both pre- and post-combination;\n●\nThe publics reaction to our press releases, SEC filings, website content and other public announcements and information;\n●\nChanges in earnings estimates of any business that we acquire or recommendations by any research analysts who may follow us or other companies in the industry of a business that we acquire;\n●\nVariations in general economic conditions, including as may be caused by uncontrollable events such as the COVID-19 pandemic and the resulting decline in the economy;\n●\nThe public disclosure of the terms of any financing we disclose in the future;\n●\nThe number of shares of our Common Stock that are publicly traded in the future;\n●\nActions of our existing shareholders, including sales of Common Stock by our then directors and then executive officers or by significant investors; and\n●\nThe employment or termination of key personnel.\nMany of these factors are beyond our control and may decrease the market price of our Common Stock, regardless of whether we can consummate a business combination and of our current or subsequent operating performance and financial condition. In the past, following periods of volatility in the market price of a companys securities, securities class action litigation has often been instituted. A securities class action suit against us could result in substantial costs and divert our managements time and attention, which would otherwise be used to benefit our business.\nOur common stock may not develop an active trading market and the price and trading volume of our shares may fluctuate significantly.\nShares of common stock are currently quoted on the OTC marketplace. We cannot predict whether investor interest in us will lead to the development of an active and liquid trading market. If an active trading market does not develop, holders of our shares of common stock may have difficulty selling our shares that may now be owned or may be purchased later. In addition, until we are able to be listed on a national exchange, the number of investors willing to hold or acquire our shares may be reduced, we may receive decreased news and analyst coverage, and we may be limited in our ability to issue additional securities or obtain additional financing in the future on terms acceptable to us, or at all. Even if an active trading market develops for our shares, the market price of our shares may be highly volatile and could be subject to wide fluctuations. In addition, the trading volume of our shares may fluctuate and cause significant price variations to occur.\nIn case that our shares trade under $5.00 per share they will be considered penny stock. Trading in penny stocks has many restrictions and these restrictions could severely affect the price and liquidity of our common stock.\nIf our stock trades below $5.00 per share, our stock would be known as a penny stock, which is subject to various regulations involving disclosures to be given to you prior to the purchase of any penny stock. The U.S. Securities and Exchange Commission (the SEC) has adopted regulations which generally define a penny stock to be any equity security that has a market price of less than $5.00 per share, subject to certain exceptions. Depending on market fluctuations, our Common Stock would be considered as a penny stock. A penny stock is subject to rules that impose additional sales practice requirements on broker/dealers who sell these securities to persons other than established Members and accredited investors. For transactions covered by these rules, the broker/dealer must make a special suitability determination for the purchase of these securities. In addition, he must receive the purchasers written consent to the transaction prior to the purchase. He must also provide certain written disclosures to the purchaser. Consequently, the penny stock rules may restrict the ability of broker/dealers to sell our securities and may negatively affect the ability of holders of shares of our Common Stock to resell them. These disclosures require you to acknowledge that you understand the risks associated with buying penny stocks and that you can absorb the loss of your entire investment. Penny stocks are low priced securities that do not have a very high trading volume. Consequently, the price of the stocks is often volatile, and you may not be able to buy or sell the stock when you want to.\nWe do not anticipate paying cash dividends on our Common Stock in the foreseeable future.\nWe do not anticipate paying cash dividends in the foreseeable future. Presently, we intend to retain all our earnings, if any, to finance development and expansion of our business. Consequently, your only opportunity to achieve a positive return on your investment in us will be if the market price of our Common Stock appreciates.\nOur Chief Executive Officer, Mr. Lixue Yang, own a majority of our outstanding shares of common stock and could significantly influence the outcome of our corporate matters.\nMr. Lixue Yang, our CEO, beneficially owns 77% of our outstanding shares of Common Stock. As a result, Mr. Yang is collectively able to exercise significant influence over all matters that require us to obtain shareholder approval, including the election of directors to our board and approval of significant corporate transactions that we may consider, such as a merger or other sale of our company or its assets. This concentration of ownership in our shares by executive officers will limit other shareholders ability to influence corporate matters and may have the effect of delaying or preventing a third party from acquiring control over us.\nThe price of our common stock may be volatile or may decline regardless of our operating performance, and stockholders may not be able to resell their shares.\nThe trading price for our common stock has fluctuated since our common stock was first quoted on the OTC marketplace. The market price of our stock may fluctuate significantly in response to numerous factors, many of which are beyond our control, including:\n●\nactual or anticipated fluctuations in our revenue and other operating results;\n●\nthe financial projections we may provide to the public, any changes in these projections or our failure to meet these projections;\n●\nactions of securities analysts who initiate or maintain coverage of us, changes in financial estimates by any securities analysts who follow our company, or our failure to meet these estimates or the expectations of investors;\n●\nannouncements by us or our competitors of significant products, acquisitions, strategic partnerships, joint ventures, or capital commitments;\n●\nprice and volume fluctuations in the overall stock market, including as a result of trends in the economy as a whole;\n●\nlawsuits threatened or filed against us; and\n●\nother events or factors, including those resulting from health pandemics, war or incidents of terrorism, or responses to these events.\nIn addition, the stock markets have experienced extreme price and volume fluctuations that have affected and continue to affect the market prices of securities of many companies. Stock prices of many companies have fluctuated in a manner unrelated or disproportionate to the operating performance of those companies.\nFuture sales of substantial amounts of the shares of our Common Stock by existing shareholders could adversely affect the price of our Common Stock.\nIf our existing shareholders sell substantial amounts of the shares, then the market price of our Common Stock could fall. Such sales by our existing shareholders might make it more difficult for us to issue new equity or equity-related securities in the future at a time and place we deem appropriate. If any existing shareholders sell substantial amounts of shares, the prevailing market price for our shares could be adversely affected. ITEM 1B. UNRESOLVED STAFF COMMENTS\nWe are a smaller reporting company as defined by Rule 12b-2 of the Securities Exchange Act of 1934 and are not required to provide the information under this item. ITEM 2. PROPERTIES\nWe currently maintain our principal executive office at 5348 Vegas Drive, Las Vegas, Nevada 89108.\nAs of December 14, 2022, the Company has no operating lease agreement. ITEM 3. LEGAL PROCEEDINGS\nFrom time to time, we maybe involve in various lawsuits and legal proceedings which arise in the ordinary course of business. Litigation is subject to inherent uncertainties, and an adverse result in these or other matters may arise from time to time that may harm our business. Currently there are no pending legal proceedings or claims that we believe will have a material adverse effect on our business, financial condition or operating results. None of our directors, officers or affiliates is involved in a proceeding adverse to our business or has a material interest adverse to our business. ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\nPART II ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nOur common stock is currently quoted on the OTC Pink under the trading symbol LQLY.\nTrading in stocks quoted on the OTC market is often thin and is characterized by wide fluctuations in trading prices due to many factors that may have little to do with a companys operations or business prospects. We cannot assure you that there will be a market for our common stock in the future.\nHolders\nAs of December 14, 2022, we had 3,895,000 shares of our Common Stock par value, $.001 issued and outstanding. There were 7 beneficial owners of our Common Stock.\nTransfer Agent and Registrar\nThe transfer agent for our capital stock is Action Stock Transfer Corporation, with an address at 2469 E. Fort Union Blvd., Suite 214, Salt Lake City, UT 84121 and telephone number is 801 274 1088.\nPenny Stock Regulations\nThe Securities and Exchange Commission has adopted regulations which generally define penny stock to be an equity security that has a market price of less than $5.00 per share. Our Common Stock, when and if a trading market develops, may fall within the definition of penny stock and be subject to rules that impose additional sales practice requirements on broker-dealers who sell such securities to persons other than established customers and accredited investors (generally those with assets in excess of $1,000,000, or annual incomes exceeding $200,000 individually, or $300,000, together with their spouse).\nFor transactions covered by these rules, the broker-dealer must make a special suitability determination for the purchase of such securities and have received the purchasers prior written consent to the transaction. Additionally, for any transaction, other than exempt transactions, involving a penny stock, the rules require the delivery, prior to the transaction, of a risk disclosure document mandated by the Securities and Exchange Commission relating to the penny stock market. The broker-dealer also must disclose the commissions payable to both the broker-dealer and the registered representative, current quotations for the securities and, if the broker-dealer is the sole market-maker, the broker-dealer must disclose this fact and the broker-dealers presumed control over the market. Finally, monthly statements must be sent disclosing recent price information for the penny stock held in the account and information on the limited market in penny stocks. Consequently, the penny stock rules may restrict the ability of broker-dealers to sell our Common Stock and may affect the ability of investors to sell their Common Stock in the secondary market.\nIn addition to the penny stock rules promulgated by the Securities and Exchange Commission, the Financial Industry Regulatory Authority (FINRA) has adopted rules that require that in recommending an investment to a customer, a broker-dealer must have reasonable grounds for believing that the investment is suitable for that customer. Prior to recommending speculative low-priced securities to their non-institutional customers, broker-dealers must make reasonable efforts to obtain information about the customers financial status, tax status, investment objectives and other information. Under interpretations of these rules, FINRA believes that there is a high probability that speculative low-priced securities will not be suitable for at least some customers. The FINRA requirements make it more difficult for broker-dealers to recommend that their customers buy our common stock, which may limit the investors ability to buy and sell our stock.\nDividend Policy\nAny future determination as to the declaration and payment of dividends on shares of our Common Stock will be made at the discretion of our board of directors out of funds legally available for such purpose. We are under no contractual obligations or restrictions to declare or pay dividends on our shares of Common Stock. In addition, we currently have no plans to pay such dividends. Our board of directors currently intends to retain all earnings for use in the business for the future.\nEquity Compensation Plan Information\nCurrently, there is no equity compensation plan in place.\nPurchases of Equity Securities by the Registrant and Affiliated Purchasers\nWe have not repurchased any shares of our common stock during the fiscal year ended August 31, 2022. ITEM 6. SELECTED FINANCIAL DATA\nWe are a smaller reporting company as defined by Rule 12b-2 of the Securities Exchange Act of 1934 and are not required to provide the information under this item. ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion should be read in conjunction with our financial statements, including the notes thereto, appearing elsewhere in this Annual Report. The following discussion contains forward-looking statements that reflect our plans, estimates and beliefs. Our actual results could differ materially from those discussed in the forward- looking statements. Factors that could cause or contribute to such differences include, but are not limited to those discussed below and elsewhere in this Report. Our audited financial statements are stated in U.S. Dollars and are prepared in accordance with United States Generally Accepted Accounting Principles.\nCompany Overview\nQLY Biotech Group Corp. (Former name: Azar International Corp.) (the Company or QLY), was incorporated in the State of Nevada on September 20, 2018. The Company was used to engaged in the tourism. The company used to organize individual and group sailing tours in the Dominican Republic. Services and itineraries were used to be provide by our company include custom packages according to the clients specifications. And we used to develop and offer our own sailing tours in the North part of Dominican Republic as well as third-party suppliers.\nThe Company has no operations or revenue as of the date of this Report. We are currently in the process of developing a business plan. Management intends to explore and identify viable business opportunities within the U.S. including seeking to acquire a business in a reverse merger. Our ability to effectively identify, develop and implement a viable plan for our business may be hindered by risks and uncertainties which are beyond our control, including without limitation, the continued negative effects of the coronavirus pandemic on the U.S. and global economies. For more information about the risk of Covid-19 on our business, see Item 1.A. - Risk Factors.\nResults of Operations\nFor the year ended August 31, 2022 compared with the year ended August 31, 2021\nRevenue\nThe Company generated revenue of $0 for the year ended August 31, 2022 as compared to revenue of $4,000 for the year ended August 31, 2021. The revenue before is from former owner. Now the management intends to explore and identify business opportunities within the U.S., including a potential acquisition of an operating entity through a reverse merger, asset purchase or similar transaction. Our Chief Executive Officer has experience in business consulting, although no assurances can be given that he can identify and implement a viable business strategy or that any such strategy will result in profits. Our ability to effectively identify, develop and implement a viable plan for our business may be hindered by risks and uncertainties which are beyond our control, including without limitation, the continued negative effects of the coronavirus pandemic on the U.S. and global economies. For more information about the risk of coronavirus on our business, see Item 1A Risk Factors.\nCost of revenues\nCost of revenues of $0 and $1,400 for the year ended August 31, 2022 and 2021, respectively.\nOperating Expenses\nOperating expenses of $14,112 and $32,103 for the year ended August 31, 2022 and 2021, that were mainly consist of professional fees such as audit fees and edgar filing fee. Such decrease was mainly derived from advisory fee.\nNet Loss\nThe net loss of $14,112 and $29,503 for the year ended August 31, 2022 and 2021, respectively. The decrease was mainly derived from the advisory fees.\nLiquidity and Capital Resources\nAs of August 31, 2022 and 2021, we had working capital deficit of $0 and $7,953, respectively. The decrease in working capital deficit was reflected in the repayment from the former director. The Companys net loss of $14,112 and net loss of $29,503 for the years ended August 31, 2022 and 2021, respectively.\nCash Flow from Operating Activities\nNet cash used in operating activities for the year ended August 31, 2022 was $14,210 as compared to net cash used in operating activities of $26,265 for the year ended August 31, 2021, reflecting a decrease of $12,055. Such decrease was due to the Company incurred a lower net loss in current year.\nCash Flow from Investing Activities\nNet cash provided by investing activities for the year ended August 31, 2022 and 2021, was $0 and $0, respectively.\nCash Flow from Financing Activities\nNet cash generated from financing activities for the year ended August 31, 2022 was $9,041 as compared to net cash generated from financing activities of $3,800 for the year ended August 31, 2021, reflecting an increase of $5,241. Such increase was mainly due to the Former director agreed to waive the amount due to him at July 8, 2022 and the Company agreed to assign the Computer and Designer (that were acquired by the Company on September 30, 2019 and November 1, 2019, respectively) to the former director.\nWe do not currently engage in any business activities that provide revenue or cash flow. During the next 12-month period we anticipate incurring costs in connection with investigating, evaluating, and negotiating potential business combinations, filing SEC reports, and consummating an acquisition of an operating business.\nGiven our limited capital resources, we may consider a business combination with an entity which has recently commenced operations, is a developing company or is otherwise in need of additional funds for the development of new products or services or expansion into new markets, or is an established business experiencing financial or operating difficulties and needs additional capital. Alternatively, a business combination may involve the acquisition of, or merger with, an entity which desires access to the U.S. capital markets.\nAs of the date of this Report, our management has not had any discussions with any representative of any other entity regarding a potential business combination. Any target business that is selected may be financially unstable or in the early stages of development. In such event, we expect to be subject to numerous risks inherent in the business and operations of a financially unstable or early-stage entity. In addition, we may affect a business combination with an entity in an industry characterized by a high level of risk or in which our management has limited experience, and, although our management will endeavor to evaluate the risks inherent in a particular target business, there can be no assurance that we will properly ascertain or assess all significant risks.\nCritical accounting estimates\nUse of estimates\nIn preparing these financial statements, management makes estimates and assumptions that affect the reported amounts of assets and liabilities in the balance sheets and revenues and expenses during the periods reported. Actual results may differ from these estimates.\nCash and cash equivalents\nThe Company considers all highly liquid instruments with a maturity of three months or less at the time of issuance to be cash equivalents.\nRevenue recognition\nThe Company assesses and follows the guidance of ASC 606, revenue from contracts with customers is recognized using the following five steps:\n1.\nIdentify the contract(s) with a customer;\n2.\nIdentify the performance obligations in the contract;\n3.\nDetermine the transaction price;\n4.\nAllocate the transaction price to the performance obligations in the contract; and\n5.\nRecognize revenue when (or as) the entity satisfies a performance obligation.\nThe Company had generated zero revenue during the year ended August 31, 2022.\nIncome taxes\nThe Company followed the liability method of accounting for income taxes in accordance with ASC 740, Income Taxes, or ASC 740. Under this method, deferred tax assets and liabilities are determined based on the difference between the financial reporting and tax bases of assets and liabilities using enacted tax rates that will be in effect in the period in which the differences are expected to reverse. The Company recorded a valuation allowance to offset deferred tax assets if based on the weight of available evidence, it is more-likely-than-not that some portion, or all, of the deferred tax assets will not be realized. The effect on deferred taxes of a change in tax rate is recognized in tax expense in the period that includes the enactment date of the change in tax rate.\nThe Company accounted for uncertainties in income taxes in accordance with ASC 740. Interest and penalties related to unrecognizable tax benefit recognized in accordance with ASC 740 are classified in the statements of comprehensive loss as income tax expense.\nEarnings per share\nThe Company computes earnings per share (EPS) in accordance with ASC Topic 260, Earnings per share. Basic EPS is measured as the income or loss available to common shareholders divided by the weighted average common shares outstanding for the period. Diluted EPS is similar to basic EPS but presents the dilutive effect on a per share basis of potential common shares (e.g., convertible securities, options, and warrants) as if they had been converted at the beginning of the periods presented, or issuance date, if later. Any potential common shares in 2022 and 2021 that have an anti-dilutive effect (i.e. those that increase income per share or decrease loss per share) are excluded from the calculation of diluted EPS.\nRelated party transaction\nA related party is generally defined as (i) any person that holds 10% or more of the Companys securities and their immediate families, (ii) the Companys management, (iii) someone that directly or indirectly controls, is controlled by or is under common control with the Company, or (iv) anyone who can significantly influence the financial and operating decisions of the Company. A transaction is considered to be a related party transaction when there is a transfer of resources or obligations between related parties.\nTransactions involving related parties cannot be presumed to be carried out on an arms-length basis, as the requisite conditions of competitive, free market dealings may not exist. Representations about transactions with related parties, if made, shall not imply that the related party transactions were consummated on terms equivalent to those that prevail in arms-length transactions unless such representations can be substantiated.\nRecent accounting pronouncements\nThe Company has reviewed all recently issued, but not yet effective, accounting pronouncements and does not believe the future adoption of any such pronouncements may be expected to cause a material impact on its financial condition or the results of its operations.\nGoing Concern\nThe independent registered public accounting firm auditors report accompanying our August 31, 2022 financial statements contained an explanatory paragraph expressing substantial doubt about our ability to continue as a going concern. The financial statements have been prepared assuming that we will continue as a going concern, which contemplates that we will realize our assets and satisfy our liabilities and commitments in the ordinary course of business.\nOff-Balance Sheet Arrangements\nAs of August 31, 2022, we have no significant off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, changes in our financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources that are material to our stockholders. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nWe are a smaller reporting company as defined by Rule 12b-2 of the Securities Exchange Act of 1934 and are not required to provide the information under this item. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nThe financial statements required by this item are in PART IV of this Annual Report. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone. ITEM 9A. CONTROLS AND PROCEDURES\nDisclosure Controls and Procedures\nDisclosures Control and Procedures\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting. Internal control over financial reporting is defined in Rule 13a-15(f) or 15d-15(f) promulgated under the Exchange Act as a process designed by, or under the supervision of, the Companys principal executive and principal financial officers and effected by the Companys board of directors, management and other personnel, to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with accounting principles generally accepted in the United States of America and includes those policies and procedures that:\n●\nPertain to the maintenance of records that in reasonable detail accurately and fairly reflect the transactions and dispositions of the assets of the Company;\n●\nProvide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with accounting principles generally accepted in the United States of America and that receipts and expenditures of the Company are being made only in accordance with authorizations of management and directors of the Company; and\n●\nProvide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of the Companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate. All internal control systems, no matter how well designed, have inherent limitations. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation. Because of the inherent limitations of internal control, there is a risk that material misstatements may not be prevented or detected on a timely basis by internal control over financial reporting. However, these inherent limitations are known features of the financial reporting process. Therefore, it is possible to design into the process safeguards to reduce, though not eliminate, this risk.\nAs of August 31, 2022, management assessed the effectiveness of our internal control over financial reporting based on the criteria for effective internal control over financial reporting established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) and SEC guidance on conducting such assessments. Based on such evaluation, the Companys management concluded that, during the period covered by this Report, internal controls and procedures over financial reporting were not effective. This was due to deficiencies that existed in the design or operation of our internal controls over financial reporting that adversely affected our internal controls and that may be considered to be material weaknesses.\nIdentified Material Weaknesses\nA material weakness in internal control over financial reporting is a control deficiency, or combination of control deficiencies, that results in more than a remote likelihood that a material misstatement of the financial statements will not be prevented or detected.\nManagement identified the following material weaknesses during its assessment of internal controls over financial reporting as of August 31, 2022.\n1.\nWe do not have an Audit Committee - While not being legally obligated to have an audit committee, it is the managements view that such a committee, including a financial expert member, is an utmost important entity level control over the Companys financial statement. Currently the Chief Executive Officer and Director act in the capacity of the Audit Committee and does not include a member that is considered to be independent of management to provide the necessary oversight over managements activities.\n2.\nWe do not have Written Policies & Procedures - Due to lack of written policies and procedures for accounting and financial reporting, the Company did not establish a formal process to close our books monthly and account for all transactions and thus failed to properly record the Private Placement or disclose such transactions in its SEC filings in a timely manner.\n3.\nWe did not implement appropriate information technology controls - As at August 31, 2022, the Company retains copies of all financial data and material agreements; however, there is no formal procedure or evidence of normal backup of the Companys data or off-site storage of the data in the event of theft, misplacement, or loss due to unmitigated factors.\nAccordingly, the Company concluded that these control deficiencies resulted in a reasonable possibility that a material misstatement of the annual or interim financial statements will not be prevented or detected on a timely basis by the Companys internal controls.\nAs a result of the material weaknesses described above, management has concluded that the Company did not maintain effective internal control over financial reporting as of August 31, 2022 based on criteria established in Internal Control-Integrated Framework issued by COSO.\nManagements Remediation Initiatives\nIn an effort to remediate the identified material weaknesses and other deficiencies and enhance our internal controls, we have initiated, or plan to initiate, the following series of measures:\n1.\nWe plan to create a position to segregate duties consistent with control objectives and will increase our personnel resources and technical accounting expertise within the accounting function when funds are available to us. The accounting personnel is responsible for reviewing the financing activities, facilitate the approval of the financing, record the information regarding the financing, and submit SEC filing related documents to our legal counsel in order to comply with the filing requirements of SEC.\n2.\nWe plan to prepare written policies and procedures for accounting and financial reporting to establish a formal process to close our books monthly on an accrual basis and account for all transactions, including equity and debt transactions.\n3.\nWe intend to add staff members to our management team for making sure that information required to be disclosed in our reports filed and submitted under the Exchange Act is recorded, processed, summarized and reported as and when required and the staff members will have segregated responsibilities with regard to these responsibilities.\nWe anticipate that these initiatives will be at least partially, if not fully, implemented by the end of fiscal year 2022.\nChanges in internal controls over financial reporting\nThere was no change in our internal controls over financial reporting that occurred during the period covered by this Report, which has materially affected or is reasonably likely to materially affect, our internal controls over financial reporting, except that we have hired outside consultant to remediate our material weakness in lack of accounting and finance personnel with technical knowledge in SEC rules and regulations. ITEM 9B. OTHER INFORMATION\nNone.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nOur executive officers and directors and their respective ages as of the date hereof are as follows:\nNAME\nAGE\nPOSITION\nLixue Yang\nChief Executive Officer, Chief Financial Officer, Director\nSet forth below is a brief description of the background and business experience of our executive officer and director for the past five years.\nLixue Yang - Chief Executive Officer, Chief Financial Officer, Director\nMr. Lixue Yang CEO, CFO, and Director, 39, Graduated from University of Science and Technology Beijing in 2006, majoring in marketing and management. He is the president, Chief Executive Officer and chairman of the Board of Directors of the Company.\nMr. Yang was the CEO of Shandong Zhongying Network Technology Co. Ltd, from 2012 to 2015. He was the CEO of Zhejiang Luo Fang Technology Co., Ltd, from 2015 to 2017. After that, he founded a company called Qingdao Qingliyuan Biotechnology Co., Ltd in 2017, up to present. He was also the founder and chairman of Yizhixin Co., Ltd, from 2018 to present.\nFamily Relationships\nThere are no family relationships, or other arrangements or understandings between or among any of the director or executive officer.\nBoard Committees\nOur Company currently does not have nominating, compensation, or audit committees or committees performing similar functions nor does our Company have a written nominating, compensation or audit committee charter. Our Directors believes that it is not necessary to have such committees, at this time, because the Directors can adequately perform the functions of such committees.\nAudit Committee Financial Expert\nOur Board of Directors has determined that we do not have a board member that qualifies as an audit committee financial expert as defined in Item 407(D)(5) of Regulation S-K, nor do we have a Board member that qualifies as independent as the term is used in Item 7(d)(3)(iv)(B) of Schedule 14A under the Securities Exchange Act of 1934, as amended, and as defined by Rule 4200(a)(14) of the FINRA Rules.\nAudit committee financial expert means a person who has the following attributes:\n1.\nAn understanding of generally accepted accounting principles and financial statements;\n2.\nExperience applying such generally accepted accounting principles in connection with the accounting for estimates, accruals, and reserves that are generally comparable to the estimates, accruals and reserves, if any, used in the registrants financial statements;\n3.\nExperience preparing or auditing financial statements that present accounting issues that are generally comparable to those raised by the registrants financial statements;\n4.\nExperience with internal controls and procedures for financial reporting; and\n5.\nAn understanding of audit committee functions.\nCurrently, our Company does not have an audit committee or an audit committee financial expert (as defined in Item 407 of Regulation S-K) serving on its Board of Directors because given the early stage of our business development, it is costly to retain an independent Director who qualify as an audit committee financial expert. However, we expect, in the foreseeable future, to form such a committee composed of our non-employee directors. We may in the future attempt to add a qualified board member to serve as an audit committee financial expert in the future, subject to our ability to locate and compensate such a person. The audit committees duties will be to recommend to our Companys Board of Directors the engagement of an independent registered public accounting firm to audit our Companys financial statements and to review our Companys accounting and auditing principles.\nCorporate Governance\nThe Company promotes accountability for adherence to honest and ethical conduct; endeavours to provide full, fair, accurate, timely and understandable disclosure in reports and documents that the Company files with the Securities and Exchange Commission (the SEC) and in other public communications made by the Company; and strives to be compliant with applicable governmental laws, rules and regulations. The Company has not formally adopted a written code of business conduct and ethics that governs the Companys employees, officers and Directors as the Company is not required to do so.\nIn lieu of an Audit Committee, the Companys Board of Directors, is responsible for reviewing and making recommendations concerning the selection of outside auditors, reviewing the scope, results and effectiveness of the annual audit of the Companys financial statements and other services provided by the Companys independent public accountants. The Board of Directors, the Chief Executive Officer and the Chief Financial Officer of the Company review the Companys internal accounting controls, practices and policies.\nCode of Ethics\nWe have not adopted a formal Code of Ethics. The Board of Directors evaluated the business of the Company and the number of employees and determined that since the business is operated by a small number of persons, general rules of fiduciary duty and federal and state criminal, business conduct and securities laws are adequate ethical guidelines. In the event our operations, employees and/or Directors expand in the future, we may take actions to adopt a formal Code of Ethics.\nInvolvement in Certain Legal Proceedings\nTo our knowledge, there are no material proceedings to which any of our directors, officers or affiliates of the Company is a party adverse to the Company or has a material interest adverse to the Company.\nShareholder Proposals\nOur Company does not have any defined policy or procedural requirements for shareholders to submit recommendations or nominations for Directors. The Board of Directors believes that, given the stage of our development, a specific nominating policy would be premature and of little assistance until our business operations develop to a more advanced level. Our Company does not currently have any specific or minimum criteria for the election of nominees to the Board of Directors and we do not have any specific process or procedure for evaluating such nominees. The Board of Directors will assess all candidates, whether submitted by management or shareholders, and make recommendations for election or appointment.\nA shareholder who wishes to communicate with our Board of Directors may do so by directing a written request addressed to our President, at the address appearing on the first page of this Information Statement.\nSECTION 16(A) BENEFICIAL OWNERSHIP REPORTING COMPLIANCE\nSection 16(a) of the Securities Exchange Act requires our executive officers and directors, and persons who own more than 10% of our common stock, to file reports regarding ownership of, and transactions in, our securities with the Securities and Exchange Commission and to provide us with copies of those filings. Based solely on our review of the copies of such forms furnished to us and written representations by our officers and directors regarding their compliance with applicable reporting requirements under Section 16(a) of the Exchange Act, we believe that all Section 16(a) filing requirements for our executive officers, directors and 10% stockholders were met during the year ended August 31, 2022. ITEM 11. COMPENSATION OF EXECUTIVE AND DIRECTOR\nThe following table sets forth information concerning the compensation of our Chief Executive Officer, and the executive officers who served at the end of the year August 31, 2022, for services rendered in all capacities to us.\nSummary Compensation Table\nName and Principle Position\nPeriod\nSalary\n($)\nBonus\n($)\nStock Awards ($)\nOption Awards\n($)\nNon- Equity Incentive Plan Compensation ($)\nNon-qualified Deferred Compensation Earnings\n($)\nAll Other Compensation ($)\nTotal\n($)\nLixue Yang, Chief Executive Officer, Chief Financial Officer, Director\nFor the year ended August 31, 2022\n-\n-\n-\n-\n-\n-\n-\n-\nHilario Lopez Vargas, Former\nPresident, Secretary and Treasurer\nFor the year ended August 31, 2021\n-\n-\n-\n-\n-\n-\n-\n-\nWe do not pay our directors any fees or other compensation for acting as director. We have not paid any fees or other compensation to any of our directors for acting as directors to date.\nNarrative Disclosure to Summary Compensation Table\nThere are no arrangements or plans in which we provide pension, retirement or similar benefits for directors or executive officers. Our Directors and executive officers may receive stock options at the discretion of our Board of Directors in the future. We do not have any material bonus or profit sharing plans pursuant to which cash or non-cash compensation is or may be paid to our directors or executive officers, except that stock options may be granted at the discretion of our Board of Directors from time to time. We have no plans or arrangements in respect of remuneration received or that may be received by our executive officers to compensate such officers in the event of termination of employment (as a result of resignation, retirement, change of control) or a change of responsibilities following a change of control.\nStock Option Grants\nWe have not granted any stock options to our executive officers since our incorporation.\nEmployment Agreements\nWe do not have an employment or consulting agreement with any officers or Directors.\nCompensation Discussion and Analysis\nDirector Compensation\nOur Board of Directors does not currently receive any consideration for their services as members of the Board of Directors. The Board of Directors reserves the right in the future to award the members of the Board of Directors cash or stock-based consideration for their services to the Company, which awards, if granted shall be in the sole determination of the Board of Directors.\nExecutive Compensation Philosophy\nOur Board of Directors determines the compensation given to our executive officers in their sole determination. Our Board of Directors reserves the right to pay our executive or any future executives a salary, and/or issue them shares of common stock in consideration for services rendered and/or to award incentive bonuses which are linked to our performance, as well as to the individual executive officers performance. This package may also include long-term stock-based compensation to certain executives, which is intended to align the performance of our executives with our long-term business strategies. Additionally, while our Board of Directors has not granted any performance base stock options to date, the Board of Directors reserves the right to grant such options in the future, if the Board in its sole determination believes such grants would be in the best interests of the Company.\nIncentive Bonus\nThe Board of Directors may grant incentive bonuses to our executive officer and/or future executive officers in its sole discretion, if the Board of Directors believes such bonuses are in the Companys best interest, after analyzing our current business objectives and growth, if any, and the amount of revenue we are able to generate each month, which revenue is a direct result of the actions and ability of such executives.\nLong-term, Stock Based Compensation\nIn order to attract, retain and motivate executive talent necessary to support the Companys long-term business strategy we may award our executive and any future executives with long-term, stock-based compensation in the future, at the sole discretion of our Board of Directors, which we do not currently have any immediate plans to award. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nAs of August 31, 2022, the Company has 3,895,000 shares of common stock issued and outstanding, which number of issued and outstanding shares of common stock have been used throughout this report.\nThe following table sets forth, as of August 31, 2022 certain information with regard to the record and beneficial ownership of the Companys common stock by (i) each person known to the Company to be the record or beneficial owner of more than 5% of the Companys common stock, (ii) each director of the Company, (iii) each of the named executive officers, and (iv) all executive officers and directors of the Company as a group:\nTitle of Class\nName and Address of\nShareholders\nAmount and\nNature of\nShareholders\nOwnership\nPercent\nof Class\nCommon Stock\nLixue Yang (i), (ii), (iii)\n3,000,000\n77 %\n(1)\nBeneficial ownership is determined in accordance with the rules of the Securities and Exchange Commission and generally includes voting or investment power with respect to securities. Beneficial ownership also includes shares of stock subject to options and warrants currently exercisable or exercisable within 60 days of the date of this table. In determining the percent of common stock owned by a person or entity as of the date of this Report, (a) the numerator is the number of shares of the class beneficially owned by such person or entity, including shares which may be acquired within 60 days on exercise of warrants or options and conversion of convertible securities, and (b) the denominator is the sum of (i) the total shares of common stock outstanding on as of August 31, 2022 (3,895,000 shares), and (ii) the total number of shares that the beneficial owner may acquire upon exercise of the derivative securities. Unless otherwise stated, each beneficial owner has sole power to vote and dispose of its shares.\n(2)\nBased on the total issued and outstanding shares of 3,895,000 as of August 31, 2022. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, DIRECTOR INDEPENDENCE\nDue to former director mainly consists of borrowings for working capital purpose, the balances are unsecured, non-interest bearing and due on demand. During the year ended August 31, 2022, the Company borrowed $0 from former director, Hilario Lopez Vargas, and Hilario agreed to waive the amount of $18,925 due to him on July 8, 2022.\nReview, Approval and Ratification of Related Party Transactions\nGiven our small size and limited financial resources, we have not adopted formal policies and procedures for the review, approval or ratification of transactions, such as those described above, with our executive officer(s), Director(s) and significant stockholders. We intend to establish formal policies and procedures in the future, once we have sufficient resources and have appointed additional Directors, so that such transactions will be subject to the review, approval or ratification of our Board of Directors, or an appropriate committee thereof. On a moving forward basis, our Directors will continue to approve any related party transaction.\nDirector Independence\nOur board of directors is currently composed of one member, Lixue Yang, who do not qualifies as an independent director in accordance with the published listing requirements of the NASDAQ Global Market. The NASDAQ independence definition includes a series of objective tests, such as that the director is not, and has not been for at least three years, one of our employees and that neither the director, nor any of his family members has engaged in various types of business dealings with us. In addition, our board of directors has not made a subjective determination as to each director that no relationships exist which, in the opinion of our board of directors, would interfere with the exercise of independent judgment in carrying out the responsibilities of a director, though such subjective determination is required by the NASDAQ rules. Had our board of directors made these determinations, our board of directors would have reviewed and discussed information provided by the directors and us with regard to each directors business and personal activities and relationships as they may relate to us and our management. ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES\nThe following table sets forth the aggregate fees billed to the Company by its independent registered public accounting firm, for the fiscal years indicated.\nACCOUNTING FEES AND SERVICES\nFor the year ended August 31,\nAudit Fees (1)\n$ 6,820\n$ 3,145\nAudit-Related Fees(2)\n-\n-\nTax Fees(3)\nAll Other Fees(4)\n-\n-\nTotal\n$ 7,620\n$ 3,895\n(1)\nThis category consists of fees for professional services rendered by our principal independent registered public accountants for the audit of our annual financial statements, review of financial statements included in our quarterly reports and services that are normally provided by the independent registered public accounting firms in connection with statutory and regulatory filings or engagements for those fiscal years.\n(2)\nThis category consists of fees for assurance and related services by our independent registered public accountant that are reasonably related to the performance of the audit or review of our financial statements and are not reported above under Audit Fees. The services for the fees disclosed under this category include consultations concerning financial accounting and reporting standards.\n(3)\nThis category consists of fees for professional services rendered by our independent registered public accountant for tax compliance, tax advice, and tax planning.\n(4)\nThis category consists of fees for services provided by our independent registered public accountants other than the services described above.\nAll of the professional services rendered by principal accountants for the audit of our annual financial statements that are normally provided by the accountant in connection with statutory and regulatory filings or engagements for last two fiscal years were approved by our board of directors.\nAll above audit services were pre-approved by the Board of Directors for the fiscal years ended August 31, 2022 and 2021.\nHolding Foreign Companies Accountable Act (HFCAA)\nOur common stock may be prohibited from trading on a national exchange or over-the-counter markets under the HFCAA if the PCAOB determines it is unable to inspect or investigate completely our auditors for three consecutive years beginning in 2021. Furthermore, on June 22, 2021, the U.S. Senate passed the Accelerating Holding Foreign Companies Accountable Act (AHFCAA), which, if signed into law, would amend the HFCAA and require the SEC to prohibit an issuers securities from trading on any U.S. stock exchanges if its auditor is not subject to PCAOB inspections for two consecutive years instead of three consecutive years.\nPursuant to the HFCAA, the PCAOB issued a Determination Report on December 16, 2021 which found that the PCAOB is unable to inspect or investigate completely registered public accounting firms headquartered in: (1) mainland China and (2) Hong Kong. In addition, the PCAOBs report identified the specific registered public accounting firms which are subject to these determinations.\nOur auditor, TAAD, LLP, is headquartered in Southern California, and has been inspected by the PCAOB on a regular basis. TAAD, LLP is a firm registered with the PCAOB and is required by the laws of the U.S. to undergo regular inspections by the PCAOB to assess its compliance with the laws of the U.S. and professional standards. TAAD, LLP has been subject to PCAOB inspections, and is not among the PCAOB-registered public accounting firms headquartered in the PRC or Hong Kong that are subject to PCAOBs determination on December 16, 2021 of having been unable to inspect or investigate completely.\nNotwithstanding the foregoing, in the future, if it is determined that the PCAOB is unable to inspect or investigate our auditor completely, or if there is any regulatory change or step taken by PRC regulators that does not permit TAAD, LLP to provide audit documentations located in China or Hong Kong to the PCAOB for inspection or investigation, or the PCAOB expands the scope of the Determination so that we are subject to the HFCAA, as the same may be amended, you may be deprived of the benefits of such inspection. Any audit reports not issued by auditors that are completely inspected or investigated by the PCAOB, or a lack of PCAOB inspections of audit work undertaken in China that prevents the PCAOB from regularly evaluating our auditors audits and their quality control procedures, could result in a lack of assurance that our financial statements and disclosures are adequate and accurate. which could result in limitation or restriction to our access to the U.S. capital markets and trading of our securities, including trading on the national exchange and trading on over-the-counter markets, may be prohibited under the HFCAA. See Risk Factors - Our shares may be delisted under the Holding Foreign Companies Accountable Act if the PCAOB is unable to inspect our auditors for three consecutive years beginning in 2021, or for two consecutive years if the Accelerating Holding Foreign Companies Accountable Act becomes law; and the delisting of our shares, or the threat of their being delisted, may materially and adversely affect the value of your investment and Risk Factors - Newly enacted Holding Foreign Companies Accountable Act, recent regulatory actions taken by the SEC and the Public Company Accounting Oversight Board, and proposed rule changes submitted by Nasdaq calling for additional and more stringent criteria to be applied to China-based public companies could add uncertainties to our capital raising activities and compliance costs for more information.\nPART IV ITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n(a) Documents filed as part of this Annual Report\n(1) All Financial Statements\nThe financial statements as listed in the accompanying Index to Financial Statements are filed as part of this Annual Report on Form 10-K.\n(2) Financial Statement Schedules\nAll financial statement schedules have been omitted, since the required information is not applicable or is not present in amounts sufficient to require submission of the schedule, or because the information required is included in the financial statements and notes thereto included in this Form 10-K.\n(b) Exhibits\nThe following exhibits are filed or furnished herewith:\n3.1\nArticles of Incorporation**\n3.2\nBylaws**\n31.1\nRule 13(a)-14(a)/15(d)-14(a) Certification of principal executive officer*\n31.2\nRule 13(a)-14(a)/15(d)-14(a) Certification of principal financial officer*\n32.1\nSection 1350 Certification of principal executive officer*\n32.2\nSection 1350 Certification of principal financial officer*\n101.INS\nInline XBRL Instance Document\n101.SCH\nInline XBRL Taxonomy Extension Schema Document\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document\nCover Page Interactive Data File (embedded within the Inline XBRL document)\n* Filed herewith.\n** As filed in the Registrants Registration Statement on Form S-1 Amendment No.2 (File No. 333-234137) on February 6, 2020.\nSIGNATURES\nPursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nQLY BIOTECH GROUP CORP. (FORMER NAME: AZAR INTERNATIONAL CORP.)\n(Name of Registrant)\nDate: December 14, 2022\nBy:\n/s/ Lixue Yang\nLixue Yang\nTitle:\nChief Executive Officer, Chief Financial Officer, and Director\nPage\nFinancial Statements\nReport of Independent Registered Public Accounting Firm (PCAOB ID: 5854)\nReport of Independent Registered Public Accounting Firm (PCAOB ID: 3221)\nBalance Sheets\nStatements of Operations and Comprehensive Income\nStatements of Changes in Stockholders Deficit\nStatements of Cash Flows\nNotes to Financial Statements\n-\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo: The Board of Directors and Stockholders of\nQLY Biotech Group Corp. (Former name: Azar International Corp.)\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of QLY Biotech Group Corp. (Former name: Azar International Corp.) (the Company) as of August 31, 2022, the related statements of operations and comprehensive loss, stockholders deficit, and cash flows for the years then ended, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of August 31, 2022, and the results of its operations and its cash flows for the years then ended, in conformity with accounting principles generally accepted in the United States.\nGoing Concern Matter\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 2 to the financial statements, the Company has suffered recurring losses from operations and has a net capital deficiency that raises substantial doubt about its ability to continue as a going concern. Managements plans in regard to these matters are also described in Note 2. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion. Our audits included performing procedures to assess the risks of material misstatement, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements.\nOur audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audit provides a reasonable basis for our opinion.\nCritical Audit Matters\nCritical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. We determined that there are no critical audit matters.\n/s/ TAAD LLP\nWe have served as the Companys auditor since 2022.\nDiamond Bar, California\nDecember 14, 2022\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo: The Board of Directors and Stockholders of\nQLY Biotech Group Corp. (Former name: Azar International Corp.)\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of QLY Biotech Group Corp. (Former name: Azar International Corp.) (\"the Company\") as of August 31, 2021 and 2020, the related statements of operations, stockholder's equity, and cash flows, for each of the two years in the period ended August 31, 2021 and the related notes (collectively referred to as the \"financial statements\"). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of August 31, 2021 and 2020, and the results of its operations and its cash flows for each of the two years in the period ended August 31, 2021, in conformity with accounting principles generally accepted in the United States of America.\nMaterial Uncertainty Relating to Going Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 2 to the financial statements, the Company had not yet established an ongoing source of revenue sufficient to cover its operating costs and allow it to continue as a going concern. The Company had accumulated loss of $35,813 since inception (September 20, 2018) to August 31, 2021. These factors among others raise substantial doubt about its ability to continue as a going concern. Management's plans in regard to these matters are also described in Note 2 to the financial statements. The financial statements do not include any adjustments that might result from the outcome of this uncertainty. Our opinion is not modified with respect to this matter.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (\"PCAOB\") and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Company's internal control over financial reporting. Accordingly, we express no such opinion. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks.\nSuch procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nCritical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. We determined that there are no critical audit matters.\n/s/ Zia Masood Kiani & Co.\nZia Masood Kiani & Co.\n(Chartered Accountants)\nWe have served as the Company's auditor since 2019.\nIslamabad, Pakistan\nNovember 18, 2021\nQLY BIOTECH GROUP CORP. (FORMER NAME: AZAR INTERNATIONAL CORP.)\nBALANCE SHEETS\nAS OF AUGUST 31, 2022 AND 2021\n(Currency expressed in United States Dollars (US$), except for number of shares)\nAs of August 31,\nASSETS\nCURRENT ASSETS\nCash & cash equivalents\n$ -\n$ 5,169\nTotal current assets\n-\n5,169\nNON-CURRENT ASSETS\nProperty, plant and equipment, net\n-\nIntangible assets, net\n-\n1,867\nTotal non-current assets\n-\n1,991\nTOTAL ASSETS\n$ -\n$ 7,159\nLIABILITIES AND STOCKHOLDERS EQUITY\nCURRENT LIABILITIES\nAccount payable\n$ -\n$ 1,525\nLoan from related parties\n-\n11,597\nTotal current liabilities\n-\n13,122\nTOTAL LIABILITIES\n-\n13,122\nSTOCKHOLDERS DEFICIT\nCommon stock, $0.001 par value, 1,000,000,000 and 75,000,000 shares authorized, 3,895,000 and 3,895,000 shares issued and outstanding as of August 31, 2022 and 2021, respectively\n3,895\n3,895\nAdditional paid-in capital\n46,030\n25,955\nAccumulated deficit\n(49,925 )\n(35,813 )\nTOTAL STOCKHOLDERS DEFICIT\n-\n(5,963 )\nTOTAL LIABILITIES AND STOCKHOLDERS DEFICIT\n$ -\n$ 7,159\nSee accompanying notes to the financial statements.\nQLY BIOTECH GROUP CORP. (FORMER NAME: AZAR INTERNATIONAL CORP.)\nSTATEMENTS OF OPERATIONS AND COMPREHENSIVE LOSS\nFOR THE YEARS ENDED AUGUST 31, 2022 AND 2021\n(Currency expressed in United States Dollars (US$), except for number of shares)\nFor the year ended August 31,\nREVENUE\n$ -\n$ 4,000\nCOSTS OF REVENUE\n-\n(1,400 )\nGROSS INCOME\n-\n2,600\nGENERAL & ADMINISTRATIVE EXPENSES\n(14,112 )\n(32,103 )\nLOSS BEFORE INCOME TAX\n(14,112 )\n(29,503 )\nINCOME TAX EXPENSE\n-\n-\nNET LOSS\n$ (14,112 )\n$ (29,503 )\nOther comprehensive gain (loss):\nForeign exchange adjustment gain (loss)\n-\n-\nCOMPREHENSIVE LOSS\n$ (14,112 )\n$ (29,503\n)\nNet loss per share - Basic and diluted\n$ (0.00 )\n$ (0.00 )\nWeighted average number of common shares outstanding - Basic and diluted\n3,895,000\n3,895,000\nSee accompanying notes to the financial statements.\nQLY BIOTECH GROUP CORP. (FORMER NAME: AZAR INTERNATIONAL CORP.)\nSTATEMENTS OF CHANGES IN STOCKHOLDERS EQUITY (DEFICIT)\nFOR THE YEARS ENDED AUGUST 31, 2022 AND 2021\n(Currency expressed in United States Dollars (US$), except for number of shares)\nCOMMON STOCK\nADDITIONAL\nTOTAL\nNumber of\nshares\nAmount\nPAID-IN\nCAPITAL\nACCUMULATED DEFICIT\nSTOCKHOLDERS EQUITY (DEFICIT)\nBalance as of September 1, 2020\n3,895,000\n$ 3,895\n$ 25,955\n$ (6,310 )\n$ 23,540\nNet loss\n-\n-\n-\n(29,503 )\n(29,503 )\nBalance as of August 31, 2021\n3,895,000\n$ 3,895\n$ 25,955\n$ (35,813 )\n$ (5,963 )\nSatisfaction of amount due to former shareholder in connection with July 8, 2022 change in control transaction\n-\n-\n18,925\n-\n18,925\nSatisfaction of amount due to current shareholder on August 31, 2022\n-\n-\n1,150\n-\n1,150\nNet loss\n-\n-\n-\n(14,112 )\n(14,112 )\nBalance as of August 31, 2022\n3,895,000\n$ 3,895\n$ 46,030\n$ (49,925 )\n$ -\nSee accompanying notes to financial statements\nQLY BIOTECH GROUP CORP. (FORMER NAME: AZAR INTERNATIONAL CORP.)\nSTATEMENTS OF CASH FLOWS\nFOR THE YEARS ENDED AUGUST 31, 2022 AND 2021\n(Currency expressed in United States Dollars (US$)\nFor the year ended August 31,\nCASH FLOWS FROM OPERATING ACTIVITIES:\nNet loss\n$ (14,112 )\n$ (29,503 )\nAdjustments to reconcile net loss to net cash used in operating activities\nAmortization cost and depreciation\n1,427\n1,713\nChanges in operating assets and liabilities:\nAccounts payable\n(1,525 )\n1,525\nNet cash used in operating activities\n(14,210 )\n(26,265 )\nCASH FLOWS FROM FINANCING ACTIVITIES:\nProceeds of loan from shareholder\n9,041\n3,800\nNet cash provided by financing activities\n9,041\n3,800\nEffect of exchange rate changes on cash and cash equivalents\n-\n-\nNet change in cash and cash equivalents\n(5,169 )\n(22,465 )\nCash and cash equivalents, beginning of year\n5,169\n27,634\nCASH AND CASH EQUIVALENTS, END OF YEAR\n$ -\n$ 5,169\nSUPPLEMENTAL CASH FLOWS INFORMATION\nIncome taxes paid\n$ -\n$ -\nInterest paid\n$ -\n$ -\nNON-CASH INVESTMENT AND FINANCING ACTIVITIES\nComputer assigned to the former shareholder in connection with July 8, 2022 change in control transaction\n$ 29\n$ -\nWebsite assigned to the former shareholder in connection with July 8, 2022 change in control transaction\n$ 534\n$ -\nSatisfaction of amount due to former shareholder in connection with July 8, 2022 change in control transaction\n$ 18,925\n$ -\nSatisfaction of amount due to current shareholder on August 31, 2022\n$ 1,150\n$ -\nSee accompanying notes to the financial statements\nQLY BIOTECH GROUP CORP. (FORMER NAME: AZAR INTERNATIONAL CORP.)\nNOTES TO FINANCIAL STATEMENTS\nFOR THE YEARS ENDED AUGUST 31, 2022 AND 2021\n(Currency expressed in United States Dollars (US$), except for number of shares)\n1. ORGANIZATION AND BUSINESS BACKGROUND\nQLY Biotech Group Corp. (Former name: Azar International Corp.), a Nevada corporation (the Company or OLY) was incorporated under the laws of the State of Nevada on September 20, 2018.\nThe Company was used to engaged in the tourism. The company used to organize individual and group sailing tours in the Dominican Republic. Services and itineraries were used to be provide by our company include custom packages according to the clients specifications. And we used to develop and offer our own sailing tours in the North part of Dominican Republic as well as third-party suppliers.\nOn July 8, 2022, as a result of a private transactions, 3,000,000 shares of common stock, $0.001 par value per share (the Shares) of QLY Biotech Group Corp. (Former name: Azar International Corp.)., were transferred from Hilario Lopez Vargas to Lixue Yang. As a result, Lixue Yang became holders of approximately 77% of the voting rights of the issued and outstanding share capital of the Company and became the controlling shareholder. The consideration paid for the Shares was $350,000. The source of the cash consideration for the Shares was personal funds of Lixue Yang. In connection with the transaction, Hilario Lopez Vargas released the Company from all debts owed to him, and the Company agreed to assign the Computer and Designer (that were acquired by the Company on September 30, 2019 and November 1, 2019, respectively) to him.\nOn July 8, 2022, the existing director and officer resigned immediately. Accordingly, Hilario Lopez Vargas, serving as a director and an officer, ceased to be the Companys Chief Executive Officer, Chief Financial Officer, President, Treasurer, Secretary and a Director. At the effective date of the transfer, Lixue Yang consented to act as the new Chief Executive Officer, Chief Financial Officer, President, Treasurer, Secretary and a Director of the Company,\n2. GOING CONCERN UNCERTAINTIES\nAs of August 31, 2022, the Company suffered an accumulated deficit of $49,925 and incurred a net loss of $14,112. The continuation of the Company as a going concern through August 31, 2022 is dependent upon improving the profitability and the continuing financial support from its stockholders. Management believes the existing shareholders or external financing will provide the additional cash to meet the Companys obligations as they become due.\nThese and other factors raise substantial doubt about the Companys ability to continue as a going concern. These financial statements do not include any adjustments to reflect the possible future effects on the recoverability and classification of assets or the amounts and classification of liabilities that may result in the Company not being able to continue as a going concern.\n3. SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nThe accompanying audited financial statements reflect the application of certain significant accounting policies as described in this note and elsewhere in the accompanying financial statements and notes.\n●\nBasis of presentation\nThe financial statements of the Company have been prepared in accordance with generally accepted accounting principles in the United States of America. The Companys fiscal year end is August 31. The Companys financial statements are presented in U.S. dollars.\n●\nUse of estimates\nIn preparing these financial statements, management makes estimates and assumptions that affect the reported amounts of assets and liabilities in the balance sheets and revenues and expenses during the periods reported. Actual results may differ from these estimates.\n●\nCash and cash equivalents\nThe Company considers all highly liquid instruments with a maturity of three months or less at the time of issuance to be cash equivalents.\nQLY BIOTECH GROUP CORP. (FORMER NAME: AZAR INTERNATIONAL CORP.)\nNOTES TO FINANCIAL STATEMENTS\nFOR THE YEARS ENDED AUGUST 31, 2022 AND 2021\n(Currency expressed in United States Dollars (US$), except for number of shares)\n●\nProperty, plant and equipment\nProperty, plant and equipment are carried at cost less accumulated depreciation. Depreciation is provided over their estimated useful lives, using the straight-line method. Estimated useful lives of the property and equipment are as follows:\nOffice equipment\n3 years\nThe cost of maintenance and repairs is charged to expenses as incurred, whereas significant renewals and betterments are capitalized.\n●\nIntangible assets, net\nIntangible assets with definite lives are stated at cost less accumulated amortization.\nAmortization is calculated on the straight-line basis over the following estimated useful lives:\nWebsite\n3 years\n●\nRevenue recognition\nThe Company assesses and follows the guidance of ASC 606, revenue from contracts with customers is recognized using the following five steps:\n1.\nIdentify the contract(s) with a customer;\n2.\nIdentify the performance obligations in the contract;\n3.\nDetermine the transaction price;\n4.\nAllocate the transaction price to the performance obligations in the contract; and\n5.\nRecognize revenue when (or as) the entity satisfies a performance obligation.\nThe Company had generated zero revenue during the year ended August 31, 2022.\n●\nIncome taxes\nThe Company followed the liability method of accounting for income taxes in accordance with ASC 740, Income Taxes, or ASC 740. Under this method, deferred tax assets and liabilities are determined based on the difference between the financial reporting and tax bases of assets and liabilities using enacted tax rates that will be in effect in the period in which the differences are expected to reverse. The Company recorded a valuation allowance to offset deferred tax assets if based on the weight of available evidence, it is more-likely-than-not that some portion, or all, of the deferred tax assets will not be realized. The effect on deferred taxes of a change in tax rate is recognized in tax expense in the period that includes the enactment date of the change in tax rate.\nThe Company accounted for uncertainties in income taxes in accordance with ASC 740. Interest and penalties related to unrecognizable tax benefit recognized in accordance with ASC 740 are classified in the statements of comprehensive loss as income tax expense.\n●\nEarnings per share\nThe Company computes earnings per share (EPS) in accordance with ASC Topic 260, Earnings per share. Basic EPS is measured as the income or loss available to common shareholders divided by the weighted average common shares outstanding for the period. Diluted EPS is similar to basic EPS but presents the dilutive effect on a per share basis of potential common shares (e.g., convertible securities, options, and warrants) as if they had been converted at the beginning of the periods presented, or issuance date, if later. Any potential common shares in 2022 and 2021 that have an anti-dilutive effect (i.e. those that increase income per share or decrease loss per share) are excluded from the calculation of diluted EPS.\n●\nRelated party transaction\nA related party is generally defined as (i) any person that holds 10% or more of the Companys securities and their immediate families, (ii) the Companys management, (iii) someone that directly or indirectly controls, is controlled by or is under common control with the Company, or (iv) anyone who can significantly influence the financial and operating decisions of the Company. A transaction is considered to be a related party transaction when there is a transfer of resources or obligations between related parties.\nTransactions involving related parties cannot be presumed to be carried out on an arms-length basis, as the requisite conditions of competitive, free market dealings may not exist. Representations about transactions with related parties, if made, shall not imply that the related party transactions were consummated on terms equivalent to those that prevail in arms-length transactions unless such representations can be substantiated.\n●\nRecent accounting pronouncements\nThe Company has reviewed all recently issued, but not yet effective, accounting pronouncements and does not believe the future adoption of any such pronouncements may be expected to cause a material impact on its financial condition or the results of its operations.\nQLY BIOTECH GROUP CORP. (FORMER NAME: AZAR INTERNATIONAL CORP.)\nNOTES TO FINANCIAL STATEMENTS\nFOR THE YEARS ENDED AUGUST 31, 2022 AND 2021\n(Currency expressed in United States Dollars (US$), except for number of shares)\n4. PROPERTY, PLANT AND EQUIPMENT\nAs of August 31,\nOffice equipment\n$ 339\n$ 339\nLess: Accumulated depreciation\n(216 )\n(104 )\nLess: Depreciation for the year\n(94 )\n(112 )\nTotal accumulated depreciation\n(310 )\n(216 )\nLess: Computer assigned to the former shareholder in connection with July 8, 2022 change in control transaction\n(29 )\n-\nProperty, plant and equipment, net\n$ -\n$ 123\nDepreciation expense, classified as operating expenses, was $94 and $112 for the year ended August 31, 2022 and 2021, respectively.\n5. INTANGIBLE ASSETS\nAs of August 31,\nWebsite\n$ 4,800\n$ 4,800\nLess: Accumulated amortization\n(2,933 )\n(1,333 )\nLess: Amortization for the year\n(1,333 )\n(1,600 )\nTotal accumulated amortization\n(4,266 )\n(2,933 )\nLess: Website assigned to the former shareholder in connection with July 8, 2022 change in control transaction\n(534 )\n-\nIntangible assets, net\n$ -\n$ 1,867\nAmortization costs, classified as operating expenses, was $1,333 and $1,600 for the year ended August 31, 2022 and 2021, respectively.\n6. ACCOUNTS PAYABLE\nAs of August 31, 2022 and 2021, our accounts payable are $0 and $1,525, respectively.\n7. LOANS FROM RELATED PARTY\nAs of August 31, 2022 and 2021, the former director of the Company advanced $0 and $11,597 to the Company, which is unsecured, interest-free with no fixed payment term, for working capital purpose.\nQLY BIOTECH GROUP CORP. (FORMER NAME: AZAR INTERNATIONAL CORP.)\nNOTES TO FINANCIAL STATEMENTS\nFOR THE YEARS ENDED AUGUST 31, 2022 AND 2021\n(Currency expressed in United States Dollars (US$), except for number of shares)\n8. INCOME TAXES\nFor the years ended August 31, 2022 and 2021, the United States of loss before income taxes were comprised of the following:\nFor the year ended August 31,\nTax jurisdictions from:\n$\n$\n- United States\n(14,112\n)\n(29,503 )\nIncome (loss) before income tax\n$ (14,112\n)\n$ (29,503 )\nThe provision for income taxes consisted of the following:\nFor the year ended August 31,\nCurrent:\n$\n$\n- United States\n-\n-\nDeferred:\n- United States\n-\n-\nIncome tax expense\n$ -\n$ -\nThe Company is registered in the State of Nevada and is subject to the tax laws of the United States of America and the tax rate is 21%. As of August 31, 2022 the operations in the United States of America incurred $14,112 of cumulative net operating losses which can be carried forward to offset future taxable income. The net operating loss carryforwards begin to expire in 2042, if unutilized. The Company has provided for a full valuation allowance of $0 against the deferred tax assets on the expected future tax benefits from the net operating loss carryforwards as the management believes it is more likely than not that these assets will not be realized in the future.\nAs of August 31,\nDeferred tax assets:\n$\n$\nNet operating loss carryforwards\n- United States of America\n(10,484)\n(6,195)\nLess: valuation allowance\n10,484\n6,195\nDeferred tax assets\n$ -\n$ -\nQLY BIOTECH GROUP CORP. (FORMER NAME: AZAR INTERNATIONAL CORP.)\nNOTES TO FINANCIAL STATEMENTS\nFOR THE YEARS ENDED AUGUST 31, 2022 AND 2021\n(Currency expressed in United States Dollars (US$), except for number of shares)\n9. COMMON STOCK\nOn August 17, 2022, the Company increased its authorized shares of common stock to 1,000,000.\nAs of August 31, 2022 and 2021, the Company has 1,000,000,000 and 75,000,000 share authorized, 3,895,000 and 3,895,000 shares issued and outstanding, respectively. There are no shares of preferred stock issued and outstanding.\n10. ADDITIONAL PAID-IN CAPITAL - CAPITAL CONTRIBUTION\nAs of August 31, 2022 and 2021, the Company has a total additional paid-in capital - capital contribution balance of $46,030 and $25,955 respectively. Such increase was due to the satisfaction of amount of $18,925 due to former shareholder in connection with July 8, 2022 change in control transaction and the satisfaction of amount of 1,150 due to current shareholder on August 31, 2022"
}