{
    "cik": "1802974",
    "company": "Mission Produce, Inc.",
    "filing_type": "10-K",
    "filing_date": "2022-12-22",
    "period_of_report": "2022-10-31",
    "sic": "0700",
    "state_of_inc": "DE",
    "state_location": "CA",
    "fiscal_year_end": "1031",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1802974/0001802974-22-000050-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1802974/000180297422000050/avo-20221031.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1802974/0001802974-22-000050.txt",
    "filename": "1802974_10K_2022_0001802974-22-000050.htm",
    "content": "Item 1. Business\nOverview\nMission Produce, Inc. together with its consolidated subsidiaries (Mission Produce or the Company, Registrant, or Issuer, and generally referred to as we or us), is a global leader in the avocado industry. The Companys expertise lies in the farming, packaging, marketing and distribution of avocados to food retailers, distributors and produce wholesalers worldwide. The Company procures avocados principally from California, Mexico and Peru. Through our various operating facilities, we grow, sort, pack, bag and ripen avocados and a small amount of other fruits for distribution to domestic and international markets. We report our results of operations in three operating segments which are also reportable segments:\nMarketing and Distribution sources fruit from growers and then distributes fruit through our global distribution network;\nInternational Farming owns and operates orchards from which substantially all fruit produced is sold to our Marketing and Distribution segment. The segments farming activities range from cultivating early-stage plantings to harvesting from mature trees. It also earns service revenues for packing and processing for our Blueberries segment, as well as for third-party producers of other crops during the avocado off-harvest season. Operations are principally located in Peru, with smaller operations emerging in other areas of Latin America.\nBlueberries is a farming operation that cultivates blueberry plants in Peru. The entity farms high-quality varieties of blueberries, and has plants in various stages of development, from seedling to mature.\nProducts and services\nWe source, produce, pack and distribute avocados. The avocados we sell are primarily of the Hass variety. We sort and pack avocados and match their specifications to respective customer requirements. We sell both pre-ripe and ripened avocados, and with our network of ripening facilities, we can adjust the level of ripeness to the needs of our customers. Our custom ripening programs provide customers with the option of ordering avocados at five different stages of ripeness - hard, preconditioned, breaking, firm-ripe and ripe - which are delivered on specifically tailored schedules according to stage of ripeness.\nWe also provide value-added services including ripening, bagging, custom packaging, logistical management, and quality assurance. In addition, we provide our customers with merchandising and promotional support, insights on market trends and hands-on training to assist with their retail sales of our avocados. For example, we operate category management, merchandising and packaging programs, such as our Avocado Intel, Minis, Emeralds in the Rough, Ready, Size Minded, small but mighty, Jumbos-more to eat, more to love and shelf-life extension programs, to promote the sale of avocados that might otherwise be underutilized, to identify ready-to-eat and various size avocados for consumers and to increase shelf life.\nCustomers\nWe primarily market avocados to retail, wholesale and foodservice customers. We focus on delivering quality avocados on time and within customer specifications. Owning and farming our own avocado orchards also helps to mitigate potential disruptions across our third-party grower supply relationships. We forecast avocado sourcing costs for the season for our own production, which enables us to enter into fixed price contracts with customers for a season without bearing pricing risk from spot market purchases. We do not have long-term contracts with our customers and focus instead on building strong, long-term relationships based on product quality and specifications, on-time delivery and customer support and service.\nSupply chain and distribution network\nOur global distribution network includes twelve forward distribution centers in North America, China and Europe, equipped to offer value-added services such as ripening, bagging, custom packaging and logistical management. Our network of distribution facilities puts us in close proximity to our customers, allowing us provide fruit based on customer timing, specification, and volume needs. Within the United States, we can deliver avocados within approximately eight hours or less. Internationally, we have distribution centers and investments in other distributors in Europe and Asia to serve the growing retail demand outside of the United States.\nBefore being forwarded to distribution centers, avocados are sorted and packed at one of our four state-of-art packing facilities in Mexico, Peru, and California, or by co-packers in various locations. Our packing facilities are located in close proximity to growers,\nallowing us to control the logistics of the supply chain from tree to packing, to distribution. Transportation logistics are managed across truck, ocean, air and rail platforms, depending on origin and end markets.\nCompetition\nWe compete based on a variety of factors, including the appearance, taste, size, shelf life and overall quality of our fruit, price and distribution terms, the timeliness of our deliveries to customers and the availability of our products. The avocado and fresh produce business is highly competitive, and the effect of competition is intensified because our products are perishable. Marketing competitors include other distributors, producers, and other smaller packers and marketers. Farming competitors include other farming businesses of all sizes, from large-scale businesses and cooperatives, to individual farms.\nResources\nWe source avocados primarily from Mexico, Peru, and California, as well as Colombia, Guatemala, South Africa, Chile, and others. Our diverse sourcing network mitigates the impact of potential geographical or grower-specific supply disruptions and optimizes our ability to fulfill year-round global demand.\nThird-party growers\nWe have relationships with thousands of third-party growers. Our large scale and long track record of working with growers contributes to strong existing relationships and facilitates new relationships with third-party growers. We do not have exclusive sourcing contracts with growers.\nFarming\nIn addition to purchasing avocados from third-party growers, we have vertically integrated farming operations where we grow avocados on owned or leased land. In Peru, we own farmland with developed orchards that are in various stages of maturity. Since fiscal 2020, we have progressively planted new orchards in Guatemala on land under long-term leases, to diversify our vertical integration sourcing strategy. We also invest in a joint venture in Colombia that owns land that is under development. After planting, avocado trees begin to produce avocados in approximately three years and typically reach full production in approximately five to seven years, depending on location. We continue to innovate our farming practices to control the quality of our fruit, through various test plots, seed research, and soil analysis.\nAs of October 31, 2022, our approximate international avocado planted acreage, by age and rounded to the nearest hundred, was as follows:\nAvocado Acreage by Age\nCountry\n0-3 years 4-6 years >7 years Total\nPeru 3,100 200 6,300 9,600\nGuatemala 800 - - 800\nColombia(1)\n1,400 200 - 1,600\nTotal 5,300 400 6,300 12,000\n(1)Acreage in Colombia is farmed through a joint venture.\nWe are also involved in the farming of other fruits on a limited scale. We have planted mango orchards in Peru to enable us to realize synergies from labor and facility management during the avocado off-season. We have also invested in a blueberry farming joint venture, Moruga. While we do not market blueberries, our investment in Moruga further allows us to leverage labor and facility investments in Peru.\nIntellectual property\nWe have registered or submitted registrations for certain trademarks with the United Stated Patent and Trademark Office and with the appropriate bodies in international jurisdictions, including The MISSION & TOWER DESIGN® and MISSION PRODUCE™. In addition, we have several issued patents and copyrights that are not material to our business at this time.\nSeasonality\nThe total sales and sales price of avocados fluctuates throughout the year due to variations in supply of avocados based on geographic location. For example, in California and Peru, the harvest of avocados typically peaks between April and August. In Mexico, avocados are harvested year-round, but the harvest typically peaks between December through March. Although these geographical\ndifferences may lead to fluctuations in the purchase price of avocados, our diverse geographical avocado growth and production capabilities help us mitigate volatility in our access to supply of avocados. As a result of the volumes sourced from our farming operations in Peru, we realize a greater portion of our gross profit during the third and fourth quarters of our fiscal year.\nHuman Capital\nAs of October 31, 2022, we had approximately 3,900 employees located worldwide, of which, 2,500 were located in Peru, 600 were located in Mexico, 400 were located in the U.S., and 400 in other regions such as Guatemala, Europe, Canada and the U.K. Our headcount in Peru is inclusive of our Moruga blueberry operation. Due to the cyclical nature of avocado production, we also hire temporary and seasonal workers on our farms in Peru and packing houses in the U.S. and Mexico to meet our needs.\nFor nearly four decades, we have remained rooted in honesty, respect, and loyalty. Globally, we support our people in the distinct ways needed according to their respective regions and environment and commit to treating every individual with dignity and respect by following our human rights declaration. Weve made actionable goals to address the incorporation of Diversity, Equity, and Inclusion (DE&I) in our organization and industry by sponsoring and participating in certifications and trainings. Appointed teams continually work to improve the working conditions of our people through our Health and Safety program. Our social initiatives embody our core values: Fun, Innovative, Reliable, Successful, and Trustworthy. Our corporate culture embodies these values and, as a result, we believe we have a highly motivated and skilled workforce that is committed to the success of our business.\nRegulation and Industry Associations\nOur business is impacted by environmental, health and safety, government procurement, anti-bribery and other government regulations and requirements. Below is a summary of some of the significant regulations that impact our business.\nAs an agricultural producer and marketer of consumable products, our operations are subject to extensive regulation by various federal government agencies, including the FDA, the USDA and the Federal Trade Commission (FTC), as well as state and local agencies, with respect to product attributes, packing, labeling, storage and distribution. Under various statutes and regulations, these agencies prescribe requirements and establish standards for safety, purity and labeling. In addition, advertising of our products is subject to regulation by the FTC, and our operations are subject to health and safety regulations, including those issued under the Occupational Safety and Health Act (OSHA). Our packing facilities and products are subject to periodic inspection by federal, state and local authorities, including the California State Department of Food and Agriculture (CFDA), which oversees weights & measures compliance at our California packing facilities. All of our U.S. facilities are also in compliance with the FDAs Food Safety Modernization Act (FSMA). In addition, our operations in Mexico are subject to Mexican regulations and our operations in Peru are subject to Peruvian regulations.\nThe agricultural products sold and marketed by us are subject to additional specific government acts or regulations, including the Hass Avocado Promotion, Research and Information Act of 2000 for our avocados.\nWe are subject to numerous federal, state, local and foreign environmental laws and regulations. These laws and regulations govern, among other matters, the treatment, handling, storage, use and disposal of, and exposure to, hazardous materials and waste, including herbicides, fertilizers, pesticides and other agricultural products, the remediation of contaminated properties and climate change.\nIn the U.S., the Hass Avocado Board was established by the USDA to promote the sale of Hass variety avocados. This board provides a basis for unified funding of promotional activities based on an assessment on all avocados sold in the U.S. marketplace. The California Avocado Commission, which receives its funding from California avocado growers, has historically shouldered the promotional and advertising costs supporting avocado sales. We believe that the incremental funding of promotional and advertising programs in the U.S. will, in the long term, positively impact average selling prices and will favorably impact our avocado businesses. Similarly, Avocados from Mexico (AFM) was formed in 2013 as the marketing arm of the Mexican Hass Avocados Importers Association (MHAIA) and the Association of Growers and Packers of Avocados From Mexico (APEAM). In Peru, the organization Pro Hass promotes the marketing of high-quality Hass avocados, providing support to the local industry with technical research, packaging, and production.\nWe seek to comply at all times with all such laws and regulations and to obtain any necessary permits and licenses, and we are not aware of any instances of material non-compliance.\nAvailable Information\nOur corporate headquarters are located at 2710 Camino Del Sol, Oxnard, California, and our telephone number is (805) 981-3650. Our internet address is www.missionproduce.com. The information on or that can be accessed through our website is not incorporated by reference in this report.\nWe make available free of charge certain reports and amendments that we file with the SEC, such as our annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, our directors and officers Section 16 reports, as soon as\nreasonably practicable after filing or furnishing such materials to the SEC on the Investor relations section of our website. They are also available free of charge on the SECs website at www.sec.gov. Item 1A. Risk Factors\nYou should carefully consider the following risk factors, together with the other information contained in this annual report on Form 10-K, including our financial statements and the related notes and Managements Discussion and Analysis of Financial Condition and Results of Operations, before making a decision to purchase or sell shares of our common stock. We cannot assure you that any of the events discussed in the risk factors below will not occur. These risks could have a material and adverse impact on our business, results of operations, financial condition and growth prospects. If that were to happen, the trading price of our common stock could decline. Additional risks and uncertainties not presently known to us or that we currently deem immaterial also may impair our business operations or financial condition.\nRisks Related to Our Business\nOur ability to generate revenues is limited by the supply of avocados and our ability to purchase or grow additional avocados.\nOur ability to distribute avocados is limited by our ability to acquire supply from third-party growers and to produce on our own farms. With a limited number of avocado trees on our farms and on the farms from which we purchase, our ability to obtain supply from third parties and adapt to any changes in demand of our product is constrained. If we are unable to purchase sufficient volumes from third-party growers at acceptable prices or demand for our products were to increase in the future, we would need additional production capacity, which may take time, whether by purchasing additional fruit from third-party suppliers or by waiting for our younger avocado trees to bear fruit. These purchases may expose us to increases in short-term costs and additional production may expose us to additional long-term operating costs. If supply decreases dramatically, whether as a result of damage to farms, inclement weather, drought, labor issues, or other problems, prices have and could dramatically increase and we may not be able to purchase sufficient fruit. The impact of the limited supply and increased prices could decrease our revenues or increase our costs of goods sold, which would harm our business and financial results.\nOur profitability is sensitive to fluctuations in market prices of avocados which we do not control.\nThe pricing of avocados depends on supply, and excess supply can lead to price competition in our industry. Growing conditions in various parts of the world, particularly weather conditions such as windstorms, floods, droughts, wildfires and freezes, as well as diseases and pests, are primary factors affecting market prices because of their influence on the supply, size, and quality of product.\nPricing also depends on quality. Fresh produce is highly perishable and generally must be brought to market and sold soon after harvest. The selling price received depends on the availability and quality offered by us to customers and available in the market generally.\nPricing also depends on demand, and consumer preferences for particular food products are subject to fluctuations over time. Shifts in consumer preferences that impact demand at any given time can result from a number of factors, including dietary trends, price, attention to particular nutritional aspects, concerns regarding the health effects of particular products, attention given to product sourcing practices and general public perception of food safety risks. Consumer demand for our products also may be impacted by any public commentary that consumers may make regarding our products, as well as by changes in the level of advertising or promotional support that we employ or that are employed by relevant industry groups or third parties. If consumer preferences trend negatively with respect to avocados, our sales volumes may decline as a result.\nWe are subject to increasing competition that may adversely affect our operating results.\nThe market for avocados is highly competitive. Competition for the purchase of avocados from suppliers and the sale of avocados to distributors primarily comes from other avocado distributors. If we are unable to consistently pay growers a competitive price for their avocados, these growers may choose to have their avocados marketed by alternate distributors. If we are unable to offer attractive prices or consistent supply to retail and wholesale customers, they may choose to purchase from other companies. Such competition may adversely affect our volumes and prices, which would harm our business and results of operations.\nWe are subject to the risks of doing business internationally and our current international operations are subject to a number of inherent risks.\nWe conduct a substantial amount of business internationally, including: doing business with growers and customers who are located outside the United States; purchasing fruit from growers and packers in Mexico and other countries; owning or leasing thousands of acres of farms in other countries, operating packing facilities in Peru and Mexico, having farming joint ventures in Colombia and South\nAfrica, operating sales and distribution offices in China and in Europe, and selling products to foreign customers. We also continually explore sourcing, distribution and sales opportunities in additional countries. Conducting business internationally has exposed, and continues to expose, us to a variety of risks, including:\nChanges in legal or regulatory requirements affecting foreign investment, taxes, labor, imports and exports or changes in or interpretations of foreign regulations that may adversely affect our ability to sell our products, repatriate profits to the United States or operate our foreign-located facilities;\nincreased demands on our limited resources created by our operations may constrain the capabilities of our administrative and operational resources and restrict our ability to attract, train, manage and retain qualified management, technicians, scientists and other personnel;\ndifficulties associated with staffing and managing foreign operations;\nmultiple, conflicting and changing laws and regulations such as tariffs and tax laws, export and import restrictions, employment laws, regulatory requirements and other governmental approvals, permits and licenses;\npotential failure by us or third parties we rely on to obtain and/or maintain regulatory approvals for the sale or use of our products in various countries;\ndifficulties in managing global operations;\nlogistics and regulations associated with shipping products, including infrastructure conditions and transportation delays;\nfinancial risks, such as longer payment cycles, difficulty enforcing contracts and collecting accounts receivable, and exposure to currency exchange rate fluctuations;\nreduced protection for intellectual property rights, or lack of them in certain jurisdictions;\neconomic weakness or instability, economic recessions, political and economic instability, including corruption, wars, terrorism and political unrest, outbreak of disease, boycotts, curtailment of trade and other business restrictions;\nfailure to comply with the Foreign Corrupt Practices Act, including its books and records provisions and its anti-bribery provisions, by maintaining accurate information and control over sales activities and distributors activities;\nfailure to comply with restrictions on the ability of companies to do business in foreign countries;\nrestrictive U.S. and foreign governmental actions, such as restrictions on transfers of funds and trade protection measures, including import/export duties and quotas and customs duties and tariffs, or unexpected changes in tariffs, trade barriers and regulatory requirements;\ncompliance with tax, employment, immigration and labor laws;\ntaxes, including withholding of payroll taxes;\ncurrency fluctuations, which could result in increased operating expenses and reduced revenue, and other obligations incident to doing business in another country;\nworkforce uncertainty in countries where labor unrest is more common than in the United States;\nproduction shortages or disruptions in supply, labor, transportation and trading; and\nbusiness and shipping interruptions resulting from pandemics and natural or other disasters including earthquakes, volcanic activity, hurricanes, floods and fires.\nWe have encountered many of these risks, which has affected our international expansion and operations and, consequently, could have an adverse effect on our financial condition, results of operations and cash flows.\nOur business is also impacted by the negotiation and implementation of free trade agreements between the United States and other countries, particularly in Mexico, which is the largest source of our supply of avocados. Such agreements can reduce or increase barriers to international trade and thus affect the cost of conducting business internationally, including the cost of purchasing avocados.\nInflationary pressures and increases in costs of commodities or other products we use in our business, such as fuel, packing, and paper, could adversely affect our operating results.\nThe price of various products that we use in packing, shipping, or distributing avocados can significantly affect our costs. Fuel and transportation costs are a significant cost component and make up a meaningful portion of the price of much of the fruit that we purchase from growers, and such costs have recently been increasing. There can be no assurance that we will be able to, or to what extent we can, pass on to our customers the increased costs we incur in these respects.\nThe cost of paper is also significant to us because most of our products are packed in cardboard boxes. As the price of paper increases, our operating income will decrease if we are not able to effectively pass these price increases along to our customers.\nThe loss of one or more of our largest customers, or a reduction in the level of purchases made by these customers, could negatively impact our sales and profits.\nSales to our top 10 customers amounted to approximately 59% of net sales for both years ended October 31, 2022 and 2021, and approximately 64% for the year ended October 31, 2020. We expect that a significant portion of our revenues will continue to be derived from a relatively small number of customers. We believe these customers make purchase decisions based on a combination of price, product quality, consumer demand, customer service performance, desired inventory levels and other factors that may be important to them at the time the purchase decisions are made. Changes in our customers strategies or purchasing patterns, including a reduction or increase in the number of suppliers from which they purchase, may adversely affect our sales. Additionally, our customers may face financial or other difficulties which may impact their operations and cause them to reduce their level of purchases from us, which could adversely affect the results of operations. Customers also may respond to any price increase that we may implement by reducing their purchases from us, resulting in reduced sales of our products. If sales of our products to one or more of our largest customers are reduced, this reduction may have a material adverse effect on our business, financial condition, and results of operations. Any bankruptcy or other business disruption involving one of our significant customers also could adversely affect our results of operations.\nMexican economic, political and societal conditions may have an adverse impact on our business.\nMexico is the largest source of our supply of avocados, and our business is affected by developments in that country. Shipments from Mexico to the United States are dependent on the border remaining open to imports, which has closed from time to time. In addition, security institutions in Mexico are under significant stress as a result of organized crime and gang and drug-related violence, which also could affect avocado production and shipments. This situation creates potential risks that affect a large part of our sourcing in Mexico and would harm our operations if it impacts our facilities or personnel. In addition, Mexican growers strike from time to time to obtain higher prices for their avocados. We cannot provide any assurance that economic conditions or political developments, including any changes to economic policies or the adoption of other reforms proposed by existing or future administrations, in or affecting Mexico will not have a material adverse effect on market conditions or our business, results of operations or financial condition.\nWe are also subject to various legal and regulatory changes impacting labor in Mexico. In November 2020, the President of Mexico signed a reform bill on subcontracting matters to add and repeal various articles of Mexicos Federal Labor Law, Social Security Law, Law of the National Workers Housing Fund Institute, Federal Fiscal Code, Income Tax Law, the Value Added Tax Law, and other laws and regulations. This Reform on Outsourcing bill was later approved and published in the Official Gazette of the Federation in April 2021. The bill, amongst other things, prohibits the subcontracting of personnel unless the subcontracted personnel provides services or executes specialized works that are not part of the corporate purpose of economic activity of the beneficiary of the services. In November 2022, the Secretary of Labor and Social Welfare set forth the criteria for subcontracting inspections and noted that cutting, harvesting or picking would be considered the predominant economic activity of companies who are engaged in the cultivation, packing, distribution, and export of fruit. Under this interpretation, we may be required to directly employ the avocado harvesting and picking crews in Mexico and may no longer be able to subcontract such personnel. We are analyzing the impact of this on our business and contemplating all avenues available to us to challenge and/or comply with the both the bill and the criteria released in November 2022 for inspections. If we are unsuccessful in our challenges, if any, or if we fail to comply with these regulations, we could be subject to fines, penalties, unfavorable tax and other positions, and/or we may have to employ a significant number of picking and harvesting personnel in Mexico, and we may not have the infrastructure in place to do so in the time period required. This and other impacts from this bill could have a material impact on our operations, business, financial performance, and profitability.\nPeruvian economic and political conditions may have an adverse impact on our business.\nA significant part of our farming operations are conducted in Peru. Accordingly, our business, financial condition or results of operations are affected by changes in economic or other policies of the Peruvian government or other political, regulatory or economic developments in the country. During the past several decades, Peru has had a succession of regimes with differing policies and programs. Past governments have frequently intervened in the nations economy and social structure, and also faced money laundering and corruption issues. Among other actions, past governments have imposed controls on prices, exchange rates and local and foreign investments, as well as limitations on imports, have restricted the ability of companies to dismiss employees and have prohibited the remittance of profits to foreign investors.\nBecause we have significant operations in Peru, political developments and economic conditions, including changes to economic policies or the adoption of other reforms proposed by existing or future administrations, in Peru and/or other factors could have a material adverse effect on market conditions, prices of our securities, our ability to obtain financing and our results of operations and financial condition.\nOur performance may be impacted by general economic conditions or an economic downturn.\nAn overall decline in economic activity could adversely impact our business and financial results. Economic uncertainty, recessions, or inflationary pressures may reduce consumer spending as consumers make decisions on what to include in their food budgets. This could be caused by political unrest, wars or other conflicts, health pandemics or other matters beyond our control. This could also result in a shift in consumer preference. Shifts in consumer spending could result in increased pressure from competitors or customers that may require us to increase promotional spending or reduce the prices of some of our products and/or limit our ability to increase or maintain prices, which could lower our revenue and profitability. Instability in financial markets may impact our ability, or increase the cost, to enter into new credit agreements in the future. Additionally, it may weaken the ability of our customers, suppliers, third-party distributors, banks, insurance companies and other business partners to perform their obligations in the normal course of business, which could expose us to losses or disrupt the supply of inputs we rely upon to conduct our business. If one or more of our key business partners fail to perform as expected or contracted for any reason, our business could be negatively impacted.\nFailure to optimize our supply chain or disruption of our supply chain could have an adverse effect on our business, financial condition and results of operations.\nOur ability to make, move and sell products in coordination with our suppliers is critical to our success. Our inability to maintain sufficient internal production capacity or our inability to enter into co-packing arrangements on terms that are beneficial to the Company could have an adverse effect on our business. Failure to adequately handle increasing production costs and complexity, turnover of personnel, or production capability and efficiency issues could materially impact our ability to cost effectively produce our products and meet customer demand.\nAdditionally, damage or disruption to our collective production or distribution capabilities resulting from weather, any potential effects of climate change, natural disaster, disease, crop spoilage, fire or explosion, terrorism, pandemics, strikes, repairs or enhancements at our facilities, or other reasons, could impair our ability to produce or sell our products. Failure to take adequate steps to mitigate the likelihood or potential impact of such events, or to effectively manage such events if they occur, could adversely affect our business, financial condition and results of operations, and may require additional resources to restore our supply chain.\nOur ability to serve our customers is a function of reliable and cost-effective transportation. Disruption of the supply of these services and/or significant increases in the cost of these services could impact our operating income.\nWe use multiple forms of transportation to bring our products to market. They include sea, truck and air-cargo. Transportation costs include ship and truck operating expenses, using chartered refrigerated ships and trucks and container equipment related costs. Disruption to the timely supply of these services or dramatic increases in the cost of these services for any reason including availability of fuel or labor for such services, labor disputes, governmental regulation, or governmental restrictions limiting specific forms of transportation could have an adverse effect on our ability to serve our customers and consumers and could have an adverse effect on our financial performance.\nIn particular, as a result of increased shipping demand, inflationary pressures, and the COVID-19 pandemic, we have experienced increases in transportation costs, decreases in the availability of shipping, and other global supply chain complexities, including labor shortages. Such complexities have and could continue to result in delays in customer shipments which may negatively impact our ability to recover costs, retain or attract customers, and/or sell our product effectively. Significant disruptions could continue to occur and put pressure on transportation and shipping infrastructure, which could in turn cause continued increases in costs that we are unable to recover fully. The duration and magnitude of the increased transportation costs cannot be predicted at this time and there can be no assurances that such costs and/or shipping disruptions will not continue to increase.\nTo the extent that we experience increased costs, we may increase our prices, pass the increase along to customers, or otherwise take actions to offset the impacts. Further, competitive pressures and other factors may also limit our ability to quickly raise prices in response to increased costs. Accordingly, we may not be able to offset increased costs fully or at all, and there can be no assurances that increasing prices will fully mitigate the impact of these increases, which could adversely impact our results.\nWe depend on our key personnel and an effective organizational structure to run our business and if we lose the services of any of these individuals, fail to attract and retain additional key personnel, or fail to optimize our organization structure, we may not be able to implement our business strategy or operate our business effectively.\nOur future success largely depends on the contributions of our management team, including Stephen Barnard, our CEO. We believe that these individuals expertise and knowledge about our industry and their respective fields and their relationships with other individuals in our industry are critical factors to our continued growth and success. We have had departures of members of senior management and other members of senior management could depart the Company . This could have a material adverse effect on our business and prospects. Our success also depends upon our ability to attract and retain additional qualified sales, marketing and other personnel.\nThe operation of our facilities depends on adequate and affordable supply of labor and good labor relations with our employees. Our employees are essential to our operations and our ability to farm, package and/or deliver our products. We are subject to inflationary pressures in labor as well as a tight labor market for recruitment and retention of skilled, short- and long-term labor. If we are unable to attract and retain enough skilled personnel at a reasonable cost, our results may be negatively affected.\nWe and our growers are subject to the risks that are inherent in farming.\nOur results of operations may be adversely affected by numerous factors over which we have little or no control and that are inherent in farming, including reductions in the market prices for our products, adverse weather including drought, high winds, earthquakes and wildfires. Growing conditions, pest and disease problems and new government regulations regarding farming and the marketing of agricultural products can impose additional costs on, or make it more difficult to conduct, our business.\nDue to the seasonality of the business, our revenue and operating results may vary from quarter to quarter and year to year.\nOur earnings may be affected by seasonal factors, including:\nthe availability, quality and price of fruit;\nthe timing and effects of ripening and perishability;\nthe ability to process perishable raw materials in a timely manner;\nfixed overhead costs during off-season months at our farms; and\nthe impacts on consumer demand based on seasonal and holiday timing.\nIn particular, our farming operations in Peru are affected by seasonal factors, as the harvest in Peru is generally concentrated in the third and fourth fiscal quarters.\nSystem security risks, data protection breaches, cyber-attacks and systems integration issues could disrupt our internal operations or services provided to customers, and any such disruption could reduce our expected revenue, increase our expenses, damage our reputation and adversely affect our stock price.\nOur internal computer systems and those of our current and any future partners, contractors and consultants are vulnerable to damage from cyber-attacks, computer viruses, unauthorized access, natural disasters, terrorism, war and telecommunication and electrical failures. System failures, accidents or security breaches can cause interruptions in our operations and can result in a material disruption of our business operations. Experienced computer programmers and hackers may be able to penetrate our information technology security and misappropriate or compromise our confidential information or that of third parties, create system disruptions or cause shutdowns, or develop and deploy viruses, worms, and other malicious software programs that attack our programs or otherwise exploit any security vulnerabilities of our products. In addition, sophisticated hardware and operating system software and applications that we produce or procure from third parties may contain defects in design or manufacture, including bugs and other problems that could unexpectedly interfere with the operation of the system. The costs to us to eliminate or alleviate cyber or other security problems, bugs, viruses, worms, malicious software programs and security vulnerabilities could be significant, and our efforts to address these problems may not be successful and could result in interruptions, delays, cessation of service and loss of existing or potential customers that may impede our sales, production, distribution or other critical functions.\nPortions of our information technology infrastructure have and may in the future experience interruptions, delays or cessations of service or produce errors in connection with systems integration or migration work that takes place from time to time. We have experienced difficulties, and may not be successful in the future, with implementing new systems and transitioning data, which have and could cause business disruptions. These difficulties have resulted in and may result in increased costs, time consuming and resource-intensive remediation efforts to address issues, and disruption to the business. Such disruptions have and could adversely impact our ability to fulfill orders and interrupt other key business processes. We have experienced delays and lower profit from these disruptions and may experience such difficulties in the future. As a result, our financial results, stock price, or reputation have and may be adversely affected.\nWe are subject to stringent privacy laws, information security laws, regulations, policies and contractual obligations related to data privacy and security and changes in such laws, regulations, policies and contractual obligations could adversely affect our business.\nIn the ordinary course of business, we collect, store, process and transmit confidential business information and certain personal information relating to customers, employees and suppliers. We are subject to data privacy and protection laws and regulations that apply to the collection, transmission, storage and use of personally-identifying information, which among other things, impose certain requirements relating to the privacy, security and transmission of personal information. The legislative and regulatory landscape for privacy and data protection continues to evolve in jurisdictions worldwide, and there has been an increasing focus on privacy and data protection issues with the potential to affect our business. Failure to comply with any of these laws and regulations could result in enforcement action against us, including fines, imprisonment of company officials and public censure, claims for damages by affected\nindividuals, damage to our reputation and loss of goodwill, any of which could have a material adverse effect on our business, financial condition, results of operations or prospects. Ongoing efforts to comply with evolving laws and regulations may be costly and require ongoing modifications to our policies, procedures and systems.\nData privacy remains an evolving landscape at both the domestic and international level, with new regulations coming into effect, including, for example, the California Consumer Privacy Act of 2018 (CCPA) and the General Data Protection Regulation, or GDPR, and others. If our or our partners or service providers privacy or data security measures fail to comply with requirements, we may be subject to litigation, regulatory investigations, enforcement notices requiring us to change the way we use personal data and/or fines, as well as compensation claims by affected individuals, negative publicity, reputational harm and a potential loss of business and goodwill.\nIt is possible that these laws may be interpreted and applied in a manner that is inconsistent with our practices and our efforts to comply with the evolving data protection rules may be unsuccessful. We must devote significant resources to understanding and complying with this changing landscape. Failure to comply with federal, state and international laws regarding privacy and security of personal information could expose us to penalties under such laws. Any such failure to comply with data protection and privacy laws could result in government-imposed fines or orders requiring that we change our practices, claims for damages or other liabilities, regulatory investigations and enforcement action, litigation and significant costs for remediation, any of which could adversely affect our business. Even if we are not determined to have violated these laws, government investigations into these issues typically require the expenditure of significant resources and generate negative publicity, which could harm our business, financial condition, results of operations or prospects.\nFood safety events, including instances of food-borne illness involving avocados, could create negative publicity for our customers and adversely affect sales and operating results.\nFood safety is a top priority, and we dedicate substantial resources to ensure that our customers enjoy safe, quality products. However, food safety events, including instances of food-borne illness, have occurred with avocados in the past, and could occur in the future. Food safety events at customers, whether or not they involve avocados, could adversely affect sales to those customers. In addition, customers who purchase our avocados for their food products could experience negative publicity, or experience a significant increase in food costs if there are food safety events. If such customers experience a decline in sales as a result of such food safety event, our results of operations would be adversely affected.\nA recall of our products could have a material adverse effect on our business. In addition, we may be subject to significant liability claims should the consumption of any of our products cause injury, illness or death.\nThe sale of food products for human consumption involves the risk of injury to consumers. Such injuries may result from tampering by unauthorized third parties, product contamination or spoilage, including the presence of foreign objects, substances, chemicals, or residues introduced during the growing, storage, handling or transportation phases. While we are subject to governmental inspection and regulations and believe our facilities comply in all material respects with all applicable laws and regulations, we cannot be sure that consumption of our products will not cause a health-related illness in the future or that we will not be subject to claims or lawsuits relating to such matters. Even if a product liability claim is unsuccessful or is not fully pursued, the negative publicity surrounding any assertion that our products caused illness or injury could adversely affect our reputation with existing and potential customers and our corporate and brand image.\nWe are subject to possible changing United States Department of Agriculture and Food and Drug Administration regulations that govern the importation of foreign avocados into the United States.\nThe USDA has established, and continues to modify, regulations governing the importation of avocados into the United States, and also limits the countries from which avocados may be imported. Our permits that allow us to import foreign-sourced avocados into the United States generally are contingent on our compliance with these regulations. Our results of operations may be adversely affected if we are unable to comply with existing and modified regulations and are unable to secure avocado import permits in the future.\nThe FDA establishes, and continues to modify, regulations governing the distribution of avocado products, such as the new Food Safety Modernization Act, which implements mandatory preventive controls for food facilities and compliance with mandatory produce safety standards. Our results of operations may be adversely affected if we are unable to comply with these existing and modified regulations.\nChanges to U.S. trade policy, tariff and import/export regulations may adversely affect our operating results.\nChanges in U.S. or international social, political, regulatory and economic conditions or in laws and policies governing foreign trade, development and investment in the territories or countries where we currently conduct our business, as well as any negative sentiment toward the U.S. as a result of such changes, could adversely affect our business. The U.S. has instituted or proposed changes in trade policies that include the negotiation or termination of trade agreements, the imposition of higher tariffs on imports into the U.S.,\neconomic sanctions on individuals, corporations or countries, and other government regulations affecting trade between the U.S. and other countries where we conduct our business.\nAs a result of policy changes and government proposals, there may be greater restrictions and economic disincentives on international trade. The new tariffs and other changes in U.S. trade policy could trigger retaliatory actions by affected countries, and foreign governments have instituted or are considering imposing trade sanctions on U.S. goods. Such changes have the potential to adversely impact the U.S. economy or sectors thereof, our industry and the global demand for our products, and as a result, could have a negative impact on our business, financial condition and results of operations.\nWe are subject to health and safety laws, which may restrict our operations, result in operational delays or increase our operating costs and adversely affect our financial results of operations.\nWe are required to comply with health and safety laws and regulations in the United States, and in other countries where we do business and/or conduct our operations, including Peru and Mexico, and are subject to periodic inspections by the relevant governmental authorities. These laws and regulations govern, among others, health and safety workplace conditions, including high risk labor and the handling, storage and disposal of chemical and other hazardous substances. Compliance with these laws and regulations and new or existing regulations that may be applicable to us in the future could increase our operating costs and adversely affect our financial results of operations and cash flows.\nCompliance with environmental laws and regulations, including laws pertaining to the use of herbicides, fertilizers and pesticides or climate change, or liabilities thereunder, could result in significant costs that adversely impact our business, results of operations, financial position, cash flows and reputation.\nWe are subject to a variety of federal, state, local and foreign laws and regulations relating to environmental matters. In particular, our business depends on the use of herbicides, fertilizers, pesticides and other agricultural products and the use and disposal of these products in some jurisdictions are subject to regulation by various agencies. These laws and regulations may require that only certified or professional users apply the product or that certain products only be used in certain types of locations. These laws and regulations may also require users to post notices on properties at which products have been or will be applied, notification to individuals in the vicinity that products will be applied in the future, or labeling of certain products or may restrict or ban the use of certain products. We can give no assurance that we can prevent violations of these or other laws and regulations from occurring. If we fail to comply with these laws and regulations, we could be subject to, among other things, substantial penalties or fines, partial or complete cessation of our operations or a ban on the sale of part or all of our products in a jurisdiction. Even if we are able to comply with all such laws and regulations and obtain all necessary registrations and licenses, we cannot assure you that the herbicides, fertilizers, pesticides or other products we apply, or the manner in which we apply them, will not be alleged to cause injury to the environment, people or animals, or that such products will not be restricted or banned in certain circumstances. A decision by a regulatory agency to significantly restrict the use of or ban such products that have traditionally been used in the cultivation of one of our principal products could have an adverse impact on us. Under the Federal Insecticide, Fungicide and Rodenticide Act, the Federal Food, Drug and Cosmetic Act and the Food Quality Protection Act of 1996, the U.S. Environmental Protection Agency, or EPA, undertakes a series of regulatory actions relating to the evaluation and use of pesticides in the food industry. Similarly, in the EU, Regulation (EC) No. 1107/2009, which became effective on June 14, 2011, fundamentally changed the pesticide approval process from the current risk base to hazard criteria based on the intrinsic properties of the substance. Actions regarding the availability and use of herbicides, fertilizers, pesticides and other agricultural products, the costs of compliance, consequences of non-compliance, remediation costs and liabilities, unfavorable public perceptions of such products or products liability lawsuits could have a material adverse effect on our business, results of operations, financial position, cash flows and reputation.\nThere has been a broad range of proposed and promulgated state, national, local and international regulation aimed at reducing the effects of climate change. Such regulations apply or could apply in countries where we conduct operations or have interests or could conduct operations or have interests in the future. In the United States, there is a significant possibility that some form of regulation will be enacted at the federal level to address the effects of climate change. Such regulation could take several forms that could result in additional costs in the form of taxes, the restriction of output, investments of capital to maintain compliance with laws and regulations, or required acquisition or trading of emission allowances. Climate change regulation continues to evolve, and while it is not possible to accurately estimate either a timetable for implementation or our future compliance costs relating to implementation, such regulation could have a material effect on our business, results of operations, financial position or capital expenditures. To the extent that climate change affects our farms, including their water supply, our ability to grow crops could be harmed.\nThe acquisition of other businesses could pose risks to our financial condition and results.\nWe intend to review acquisition and investment prospects that would complement our business. Future acquisitions by us could result in accounting charges, potentially dilutive issuances of equity securities, and increased debt and contingent liabilities, any of which could have a material adverse effect on our business and the market price of our common stock. Acquisitions entail numerous risks, including the integration of the acquired operations, diversion of managements attention to other business concerns, risks of entering markets in which we have limited prior experience, assumption of liabilities and the potential loss of key employees of acquired organizations. We may be unable to successfully integrate businesses or the personnel of any business that might be acquired in the\nfuture, and our failure to do so could have a material adverse effect on our business and on the market price of our common stock. We may also not be able to achieve an attractive return on our investments.\nWe depend on our infrastructure to have sufficient capacity to handle our business needs.\nWe have an infrastructure that supports our production and distribution, but if we lose machinery or facilities due to natural disasters, mechanical failures, or other reasons, we may not be able to operate at a sufficient capacity to meet our needs. We will also continue to make investments in existing and new facilities to meet our needs. Any inability to have sufficient facilities, or loss or failure of facilities, could have a material adverse effect on our business, which could impact our results of operations and our financial condition.\nAdverse results in material litigation or governmental inquiries and actions could have an adverse financial impact and an adverse impact on our business and financial condition.\nWe are involved in various legal proceedings arising in the ordinary course of business including, among other things, disputes related to employee matters such as our pending class action lawsuits, disputes with respect to vendors or business partners and clients, as well as inquiries or investigations from governmental agencies. Some proceedings against us involve claims that are substantial in amount and could divert management's attention from operations. These proceedings also may result in substantial monetary damages. Further, the legal actions and government investigations could damage our reputation with investors and adversely affect the trading prices of our securities.\nWe are subject to extensive government regulation in the jurisdictions in which we do business. Regulations addressing, among other things, import/export restrictions, anti-bribery and corruption, and taxes, can negatively impact our financial condition, results of operation, and cash flows.\nWe are subject to government regulation in the United States and in the foreign jurisdictions where we conduct business. The application of laws and regulations to our business is sometimes unclear. Compliance with laws and regulations may involve significant costs or require changes in business practices that could result in reduced profitability. If there is a determination that we have failed to comply with applicable laws or regulations, we may be subject to penalties or sanctions that could adversely impact our reputation and financial results. Compliance with changes in laws or regulations can result in increased operating costs and require additional, unplanned capital expenditures. Export controls or other regulatory restrictions could prevent us from shipping our products to and from some markets or increase the cost of doing so. Changes in tax laws and regulations and international tax treaties could affect the financial results of our businesses. Increasingly aggressive enforcement of anti-bribery and anti-corruption requirements, including the U.S. Foreign Corrupt Practices Act, the United Kingdom Bribery Act and the China Anti-Unfair Competition Law, could subject us to criminal or civil sanctions if a violation is deemed to have occurred. In addition, we are subject to laws and sanctions imposed by the U.S. and other jurisdictions where we do business that may prohibit us, or certain of our affiliates, from doing business in certain countries, or restricting the kind of business that we may conduct.\nFurther, we cannot guarantee that our internal controls and compliance systems will always protect us from acts committed by employees, agents, business partners or that businesses that we acquire would not violate U.S. and/or non-U.S. laws, including the laws governing payments to government officials, bribery, fraud, kickbacks and false claims, pricing, sales and marketing practices, conflicts of interest, competition, export and import compliance, money laundering, and data privacy. Any such improper actions or allegations of such acts could damage our reputation and subject us to civil or criminal investigations in the U.S. and in other jurisdictions and related shareholder lawsuits, could lead to substantial civil and criminal, monetary and non-monetary penalties, and could cause us to incur significant legal and investigatory fees. In addition, the government may seek to hold us liable as a successor for violations committed by companies in which we invest or that we acquire.\nOur business depends on a strong and trusted brand, and any failure to maintain, protect, and enhance our brand would have an adverse impact on our business.\nConsumer and institutional recognition of the Mission Produce word and design marks and related brands and the association of these brands with our sourcing, production and distribution of fresh avocados, and mangos, are an integral part of our business. The occurrence of any events or rumors that cause consumers and/or institutions to no longer associate these brands with our products and services may materially adversely affect the value of our brand names and demand for our products and services.\nIn addition, certain of our registered trademarks has been opposed, and the registered or unregistered trademarks or trade names that we own or may own in the future may be challenged, infringed, declared generic, or determined to be infringing on or dilutive of other marks. We may not be able to protect our rights in these trademarks and trade names, which we need in order to build name recognition with potential customers. Moreover, third parties have and others may file for registration of trademarks similar or identical to our trademarks; if they succeed in registering or developing common law rights in such trademarks, and if we are not successful in challenging such third-party rights, we may not be able to use these trademarks to develop brand recognition of our technologies and products. Furthermore, there could be potential trade name or trademark infringement claims brought by owners of other registered\ntrademarks or trademarks that incorporate variations of our registered or unregistered trademarks or trade names. If we are unable to establish name recognition based on our trademarks and trade names, we may not be able to compete effectively, which could have a material adverse effect on our business, financial condition, and results of operations.\nWe could be subject to changes in tax rates, the adoption of new U.S. or international tax legislation or exposure to additional tax liabilities.\nWe are subject to taxes in the U.S., Mexico, Peru and other countries. Due to economic and political conditions, tax rates in various jurisdictions may be subject to significant change. Our effective tax rates could be affected by changes in the mix of earnings in countries with differing statutory tax rates, changes in the valuation of deferred tax assets and liabilities, or changes in tax laws or their interpretation. On December 30, 2020, Peru enacted tax law repealing current tax law which provided benefits to agribusiness entities. The new law will subject us to higher Peruvian corporate income tax rates than our current rate of 15% as follows: 20% for calendar years 2023 to 2024, 25% for calendar years 2025 to 2027, and 29.5% thereafter.\nWe are also subject to the examination of our tax returns and other tax matters by the U.S. Internal Revenue Service (IRS), the Servicio de Administracion Tributaria in Mexico (SAT), the Superintendencia Nacional de Administración Tributaria in Peru (SUNAT) and other tax authorities. We regularly assess the likelihood of an adverse outcome resulting from these examinations to determine the adequacy of its provision for taxes. There can be no assurance as to the outcome of these examinations. If our effective tax rates were to increase, or if the ultimate determination of our taxes owed is for an amount in excess of amounts previously accrued, our financial condition, operating results and cash flows could be adversely affected.\nThe ongoing conflict between Russia and Ukraine may adversely affect our business and results of operations.\nGiven the nature of our business and our global operations, political, economic, and other conditions in foreign countries and regions, including geopolitical risks such as the current conflict between Russia and Ukraine, may adversely affect our business and results of operations. The broader consequences of this conflict, which may include further sanctions, embargoes, regional instability, and geopolitical shifts; transportation bans relating to certain routes, or strategic decisions to alter certain routes; potential retaliatory action by the Russian government against companies, including us, as a result of the suspension of services in Russia, including nationalization of foreign businesses in Russia; increased tensions between the United States and countries in which we operate; and the extent of the conflicts effect on our business and results of operations as well as the global economy, cannot be predicted.\nRisks Related to Our Common Stock\nAn active, liquid and orderly market for our common stock may not be maintained.\nOur common stock began trading on Nasdaq in October 2020, but we can provide no assurance that we will be able to maintain an active trading market for our common stock. Even if an active trading market is developed, it may not be sustained. The lack of an active market may impair your ability to sell your shares at the time you wish to sell them or at a price that you consider reasonable. An inactive market may also impair our ability to raise capital by selling shares and may impair our ability to acquire other businesses or technologies using our shares as consideration, which, in turn, could materially adversely affect our business. We may fail to comply with Nasdaq listing standards which could cause our stock to be delisted.\nThe trading price of the shares of our common stock has been, and is likely to continue to be, highly volatile, and purchasers of our common stock could incur substantial losses.\nOur stock price has been and is likely to continue to be volatile. The stock market has experienced extreme volatility that has often been unrelated to the operating performance of particular companies. As a result of this volatility, investors may not be able to sell their common stock at or above the price at which they paid. The market price for our common stock may be influenced by those factors discussed in this Risk Factors section and many others.\nOur executive officers, directors and principal stockholders, if they choose to act together, have the ability to control or significantly influence all matters submitted to stockholders for approval. Furthermore, many of our current directors were appointed by our principal stockholders.\nOur executive officers, directors and greater than 5% stockholders, in the aggregate, own approximately 41% of our outstanding common stock as of October 31, 2022. Furthermore, many of our current directors were appointed by our principal stockholders. As a result, such persons or their appointees to our Board of Directors, acting together, have the ability to control or significantly influence all matters submitted to our Board of Directors or stockholders for approval, including the appointment of our management, the election and removal of directors and approval of any significant transaction, as well as our management and business affairs. This concentration of ownership may have the effect of delaying, deferring or preventing a change in control, impeding a merger, consolidation, takeover or\nother business combination involving us, or discouraging a potential acquirer from making a tender offer or otherwise attempting to obtain control of our business, even if such a transaction would benefit other stockholders.\nBecause we may not pay any cash dividends on our capital stock in the foreseeable future, capital appreciation, if any, may be your sole source of gain.\nWe have paid cash dividends on our capital stock in the past but cannot guarantee that we will continue to do so in the future. Any determination to pay dividends in the future will be at the discretion of our Board of Directors and will depend upon results of operations, financial condition, any contractual restrictions, our indebtedness, restrictions imposed by applicable law and other factors our Board of Directors deems relevant. Any return to stockholders will therefore be limited to the appreciation of their stock. Shares of our common stock may not appreciate in value or even maintain the price at which stockholders have purchased their shares.\nWe incur significant costs as a result of operating as a public company, and our management will be required to devote substantial time to new compliance initiatives.\nAs a public company, we incur significant legal, accounting and other expenses that we did not incur as a private company. We are subject to the reporting requirements of the Exchange Act, which require, among other things, that we file with the SEC, annual, quarterly and current reports with respect to our business and financial condition. In addition, the Sarbanes-Oxley Act, as well as rules subsequently adopted by the SEC and Nasdaq to implement provisions of the Sarbanes-Oxley Act, impose significant requirements on public companies, including requiring establishment and maintenance of effective disclosure and financial controls and changes in corporate governance practices. Further, pursuant to the Dodd-Frank Wall Street Reform and Consumer Protection Act of 2010, the SEC has adopted additional rules and regulations in these areas, such as mandatory say on pay voting requirements. Stockholder activism, the current political environment and the current high level of government intervention and regulatory reform may lead to substantial new regulations and disclosure obligations, including with respect to environmental, social and governance (ESG) matters, which may lead to additional compliance costs and impact the manner in which we operate our business in ways we cannot currently anticipate.\nThe rules and regulations applicable to public companies has and will continue to substantially increase our legal and financial compliance costs and to make some activities more time consuming. If these requirements divert the attention of our management and personnel from other business concerns, they could have a material adverse effect on our business, financial condition and results of operations. The increased costs will decrease our net income or increase our net loss, and may require us to reduce costs in other areas of our business. We cannot predict or estimate the amount or timing of additional costs we may incur to respond to these requirements. The impact of these requirements could also make it more difficult for us to attract and retain qualified persons to serve on our Board of Directors, our board committees or as executive officers.\nIf securities or industry analysts do not publish research or reports or publish unfavorable research or reports about our business, our stock price and trading volume could decline.\nThe trading market for our common stock depends in part on the research and reports that securities or industry analysts publish about us, our business, our market or our competitors. If no securities or industry analysts commence or continue coverage of our company, the trading price for our stock would be negatively impacted. In the event we obtain securities or industry analyst coverage, if one or more of the analysts who covers us downgrades our stock, our stock price would likely decline. If one or more of these analysts ceases to cover us or fails to regularly publish reports on us, interest in our stock could decrease, which could cause our stock price or trading volume to decline.\nIf we fail to maintain proper and effective internal control over financial reporting, our ability to produce accurate and timely financial statements could be impaired, investors may lose confidence in our financial reporting and the trading price of our common stock may decline.\nPursuant to Section 404 of Sarbanes-Oxley, our management is required to report upon the effectiveness of our internal control over financial reporting beginning with the annual report for our fiscal year ending October 31, 2021. Our independent registered public accounting firm is required to attest to the effectiveness of our internal control over financial reporting. The rules governing the standards that must be met for management to assess our internal control over financial reporting are complex and require significant documentation, testing and possible remediation. To comply with the requirements of being a reporting company under the Exchange Act, we have implemented additional financial and management controls, reporting systems and procedures; and hired additional accounting and finance staff. If we or, if required, our auditors are unable to conclude that our internal control over financial reporting is effective, investors may lose confidence in our financial reporting and the trading price of our common stock may decline.\nThere could be material weaknesses in our internal control over financial reporting in the future. Any failure to maintain internal control over financial reporting could severely inhibit our ability to accurately report our financial condition, results of operations or cash flows. If we are unable to conclude that our internal control over financial reporting is effective, or if our independent registered public accounting firm determines we have a material weakness in our internal control over financial reporting, investors may lose confidence in the accuracy and completeness of our financial reports, the market price of our common stock could decline, and we could\nbe subject to sanctions or investigations by Nasdaq, the SEC or other regulatory authorities. Failure to remedy any material weakness in our internal control over financial reporting, or to implement or maintain other effective control systems required of public companies, could also restrict our future access to the capital markets.\nProvisions in our charter documents and under Delaware law could discourage a takeover that stockholders may consider favorable and may lead to entrenchment of management.\nProvisions in our amended and restated certificate of incorporation and our amended and restated bylaws may discourage, delay or prevent a merger, acquisition or other change in control of us that stockholders may consider favorable, including transactions in which stockholders might otherwise receive a premium for their shares. These provisions could also limit the price that investors might be willing to pay in the future for shares of our common stock, thereby depressing the market price of our common stock. In addition, these provisions may frustrate or prevent any attempts by our stockholders to replace or remove our current management by making it more difficult for stockholders to replace members of our Board of Directors. Because our Board of Directors is responsible for appointing the members of our management team, these provisions could in turn affect any attempt by our stockholders to replace current members of our management team. These provisions provide, among other things, that:\nour Board of Directors has the exclusive right to expand the size of our Board of Directors and to elect directors to fill a vacancy created by the expansion of the Board of Directors or the resignation, death or removal of a director, which prevents stockholders from being able to fill vacancies on our Board of Directors;\nour Board of Directors is divided into three classes, Class I, Class II and Class III, with each class serving staggered three-year terms, which may delay the ability of stockholders to change the membership of a majority of our Board of Directors;\nour stockholders may not act by written consent, which forces stockholder action to be taken at an annual or special meeting of our stockholders;\na special meeting of stockholders may be called only by the chairperson of our Board of Directors, our chief executive officer, president or our Board of Directors, which may delay the ability of our stockholders to force consideration of a proposal or to take action, including the removal of directors;\nour amended and restated certificate of incorporation prohibits cumulative voting in the election of directors, which limits the ability of minority stockholders to elect director candidates;\nour Board of Directors may alter provisions of our bylaws without obtaining stockholder approval;\nthe approval of the holders of at least two-thirds of the shares entitled to vote at an election of directors is required to adopt, amend or repeal our bylaws or repeal the provisions of our amended and restated certificate of incorporation regarding the election and removal of directors;\nstockholders must provide advance notice and additional disclosures in order to nominate individuals for election to the Board of Directors or to propose matters that can be acted upon at a stockholders meeting, which may discourage or deter a potential acquirer from conducting a solicitation of proxies to elect the acquirers own slate of directors or otherwise attempting to obtain control of our company; and\nour Board of Directors is authorized to issue shares of preferred stock and to determine the terms of those shares, including preferences and voting rights, without stockholder approval, which could be used to significantly dilute the ownership of a hostile acquirer.\nMoreover, because we are incorporated in Delaware, we are governed by the provisions of Section 203 of the Delaware General Corporation Law, which prohibits a person who owns in excess of 15% of our outstanding voting stock from merging or combining with us for a period of three years after the date of the transaction in which the person acquired in excess of 15% of our outstanding voting stock, unless the merger or combination is approved in a prescribed manner.\nOur amended and restated certificate of incorporation provides that the Chancery Court of the State of Delaware is the exclusive forum for substantially all disputes between us and our stockholders, which could limit our stockholders ability to obtain a favorable judicial forum for disputes with us or our directors, officers or employees.\nOur amended and restated certificate of incorporation provides that, unless we consent in writing to the selection of an alternative forum, the Chancery Court of the State of Delaware (or, in the event that the Chancery Court does not have jurisdiction, the federal district court for the District of Delaware or other state courts of the State of Delaware) shall, to the fullest extent permitted by law, be the sole and exclusive forum for: (i) any derivative action, suit or proceeding brought on our behalf; (ii) any action, suit or proceeding asserting a claim of breach of a fiduciary duty owed by any of our directors, officers or stockholders owed to us or our stockholders; (iii) any action, suit or proceeding asserting a claim against us arising pursuant to any provision of the Delaware General Corporation Law, our amended and restated certificate of incorporation or our bylaws (as either may be amended from time to time); or (iv) any action, suit or proceeding asserting a claim against us governed by the internal affairs doctrine. We believe this provision benefits us by providing increased consistency in the application of Delaware law by chancellors particularly experienced in resolving corporate\ndisputes, efficient administration of cases on a more expedited schedule relative to other forums and protection against the burdens of multi-forum litigation.\nNotwithstanding the foregoing, the exclusive forum provision does not apply to suits brought to enforce any liability or duty created by the Exchange Act, the Securities Act or any claim for which the federal courts have exclusive or concurrent jurisdiction. Our amended and restated certificate of incorporation provides that the federal district courts of the United States of America will be the exclusive forum for resolving any complaint asserting a cause of action arising under the Securities Act. If any such action is filed in a court other than a court located within the State of Delaware (a foreign action) in the name of any stockholder, such stockholder will be deemed to have consented to (a) the personal jurisdiction of the state and federal courts located within the State of Delaware in connection with any action brought in any such court to enforce such actions and (b) having service of process made upon such stockholder in any such action by service upon such stockholders counsel in the foreign action as agent for such stockholder. Section 27 of the Exchange Act creates exclusive federal jurisdiction over all suits brought to enforce any duty or liability created by the Exchange Act of the rules and regulations thereunder, and Section 22 of the Securities Act creates concurrent jurisdiction for federal and state courts over all suits brought to enforce any duty or liability created by the Securities Act or the rules and regulations thereunder, and notwithstanding the provisions of our certificate of incorporation and our bylaws, compliance with the federal securities laws and the rules and regulations thereunder may not be waived by our investors. The enforceability of similar choice of forum provisions in other companies certificates of incorporation has been challenged in legal proceedings, and it is possible that a court could find these types of provisions to be inapplicable or unenforceable.\nThis choice of forum provision may limit a stockholders ability to bring a claim in a judicial forum that it finds favorable for disputes with us or our directors, officers or other employees, which may discourage such lawsuits against us and our directors, officers and other employees. Alternatively, if a court were to find the choice of forum provision contained in our amended and restated certificate of incorporation to be inapplicable or unenforceable in an action, we may incur additional costs associated with resolving such action in other jurisdictions.\nRisks Related to Our Indebtedness\nWe are subject to a number of restrictive covenants under our credit facility, which could affect our flexibility to fund ongoing operations, uses of capital and strategic initiatives, and, if we are unable to maintain compliance with such covenants, it could lead to significant challenges in meeting our liquidity requirements and acceleration of our debt.\nThe terms of our credit facility contain a number of restrictive covenants, including customary operating restrictions that limit our ability to engage in such activities as borrowing and making investments, capital expenditures and distributions on our capital stock, and engaging in mergers, acquisitions and asset sales. We are also subject to customary financial covenants, including a leverage ratio and a fixed coverage ratio. These covenants restrict the amount of our borrowings, reducing our flexibility to fund ongoing operations and strategic initiatives. These borrowing arrangements are described in more detail in Liquidity and Capital Resources under Part II, Item 7 and in Note 7 to the consolidated financial statements under Part II, Item 8 of this annual report. Compliance with some of these covenants is based on financial measures derived from our operating results. If economic conditions deteriorate, we may experience material adverse impacts to our business and operating results, such as through reduced customer demand and inflation. A decline in our business could make us unable to maintain compliance with these financial covenants, in which case we may be restricted in how we manage our business and deploy capital, including by limiting our ability to make acquisitions and dispositions and pay dividends. In addition, if we are unable to maintain compliance with our financial covenants or otherwise breach the covenants that we are subject to under our credit facility, our lenders could demand immediate payment of amounts outstanding and we would need to seek alternate financing sources to pay off such debts and to fund our ongoing operations. Such financing may not be available on favorable terms, if at all. In addition, our term loans are secured by real property, personal property and the capital stock of our subsidiaries. If we cannot repay all amounts that we have borrowed under our term loans, our lenders could proceed against our assets. Item 1B. Unresolved Staff Comments\nNone. Item 2. Properties\nOur principal operating, distribution and packing facilities as of October 31, 2022 were as follows:\nLocation\nType Reportable Segment Owned or Leased\nNorth America:\nLaredo, Texas Distribution Marketing & Distribution Owned\nOxnard, California Distribution, packing Marketing & Distribution Owned\nSwedesboro, New Jersey Distribution Marketing & Distribution Leased\nPortland, Oregon Distribution Marketing & Distribution Leased\nAtlanta, Georgia Distribution Marketing & Distribution Leased\nDenver, Colorado Distribution Marketing & Distribution Leased\nChicago, Illinois Distribution Marketing & Distribution Leased\nCalgary, Alberta, Canada Distribution Marketing & Distribution Leased\nDallas, Texas Distribution Marketing & Distribution Leased\nToronto, Ontario, Canada Distribution Marketing & Distribution Leased\nOxnard, California Corporate headquarters Marketing & Distribution Leased\nOther:\nBreda, the Netherlands Distribution Marketing & Distribution Leased\nDartford, U.K. Distribution* Marketing & Distribution Leased\nVirú, Peru Packing International Farming Owned\nUruapan, Mexico Packing Marketing & Distribution Owned\nZamora, Mexico Packing Marketing & Distribution Owned\nTrujillo, Peru Administrative International Farming Leased\nLima, Peru Administrative, sales International Farming Leased\n*Indicates that the property is under construction.\nWe own/lease approximately 20,000 acres of land under our farming operations. Our principal farming properties as of October 31, 2022 were as follows:\nLocation\nType Reportable Segment Owned or Leased\nOlmos, Peru Land International Farming Owned\nVirú, Peru Land International Farming Owned\nSanta Rosa, Guatemala Land International Farming Leased\nWe believe that our facilities are adequate to meet our current needs, and that suitable additional alternative spaces will be available in the future on commercially reasonable terms, if required. For additional information on leased property, see Note 8 of this annual report on Form 10-K. Item 3. Legal Proceedings\nWe are from time to time involved in legal proceedings and investigations arising in the ordinary course of business, including those relating to employment matters, relationships with clients and contractors, intellectual property disputes and other business matters.\nOn April 23, 2020, former Mission Produce, Inc. employees filed a class action lawsuit in the Superior Court of the State of California for the County of Los Angeles against us alleging violation of certain wage and labor laws in California, including failure to pay all overtime wages, minimum wage violations, and meal and rest period violations, among others. Additionally, on June 10, 2020, former Mission Produce, Inc. employees filed a class action lawsuit in the Superior Court of the State of California for the County of Ventura against us alleging similar violations of certain wage and labor laws. The plaintiffs in both cases seek damages primarily consisting of class certification and payment of wages earned and owed, plus other consequential and special damages. While the Company believes that it did not violate any wage or labor laws, it nevertheless decided to settle these class action lawsuits. In May 2021, the plaintiffs in both class action lawsuits and the Company agreed preliminarily to a comprehensive settlement to resolve both class action cases for a total of $0.8 million, which the Company recorded as a loss contingency in selling, general and administrative expenses in the consolidated statements of income during the three months ended April 30, 2021. The parties executed a stipulation of settlement agreement on such\nterms in November 2021. This preliminary settlement was approved by the applicable courts in October 2022 and is subject to final approval which is currently estimated to be in the spring of 2023.\nThe outcomes of our legal proceedings and other contingencies are inherently unpredictable, subject to significant uncertainties, and if one or more legal matters were resolved against the Company in a reporting period for amounts above managements expectations, the Companys financial condition and operating results for that period could be materially adversely affected. Item 4. Mine Safety Disclosures\nNone.\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nMarket Information\nOur common stock has been publicly traded on the Nasdaq Global Select Market under the symbol AVO since our IPO on October 1, 2020, which was completed at a price to the public of $12.00 per share. Prior to our IPO, there was no public market for our common stock.\nHolders of Common Stock\nWe had 19 shareholders of record of our common stock as of December 1, 2022. This number was derived from our shareholder records and does not include holders of our common stock whose shares are held in the name of various dealers, clearing agencies, banks, brokers and other fiduciaries.\nDividend Policy\nWe have paid cash dividends on our capital stock in the past but cannot guarantee that we will continue to do so in the future. Any determination to pay dividends in the future will be at the discretion of our Board of Directors and will depend upon results of operations, financial condition, capital requirements, business prospects, restrictions imposed by applicable law and other factors our Board of Directors deems relevant.\nSecurities Authorized for Issuance Under Equity Compensation Plans\nSee Item 12 of Part III of this annual report on Form 10-K for information about our equity compensation plans which is incorporated by reference herein.\nComparative Stock Performance Graph\nThe following performance graph shows a comparison from October 1, 2020 (the date our common stock commenced trading on the Nasdaq Global Market) through October 31, 2022, of the cumulative total return for our common stock, the Nasdaq Composite Total Return Index, and the Nasdaq US Smart Food & Beverage Total Return Index. The graph assumes $100 was invested on October 1, 2020 in Mission Produce common stock, or the respective indices, including reinvestment of dividends, with the associated plots indicating the relative performance as of the last day of trading prior to the fiscal year end date.\nOctober 1, 2020 October 29, 2021 October 31, 2022\nMission Produce, Inc. 100.0 137.6 120.6\nNasdaq Composite Total Return Index 100.0 136.8 97.0\nNasdaq US Smart Food & Beverage Total Return Index 100.0 121.2 135.1\nUnregistered Sales of Equity Securities\nNone.\nIssuer Repurchases of Equity Securities\nNone. Item 6. Reserved\nNot applicable. Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations\nYou should read the following discussion and analysis of our financial condition and results of operations together with our financial statements and related notes included elsewhere in this annual report. This discussion and analysis contains forward-looking statements based upon our current beliefs, plans and expectations that involve risks, uncertainties and assumptions. Our actual results may differ materially from those anticipated in these forward-looking statements as a result of various factors. Please refer to the section of this report under the heading Forward Looking Statements.\nOverview\nWe are a world leader in sourcing, producing and distributing fresh avocados, serving retail, wholesale and foodservice customers. We source, produce, pack and distribute avocados and a small amount of other fruits to our customers and provide value-added services including ripening, bagging, custom packaging and logistical management. In addition, we provide our customers with merchandising and promotional support, insights on market trends and training designed to increase their retail avocado sales.\nConsolidation of VIE\nOn May 1, 2022, a reconsideration event occurred related to Moruga S.A.C., a holding company with one wholly owned subsidiary Blueberries Peru, S.A.C. (collectively referred to as Moruga), an entity for which we have a 60% equity ownership interest. Moruga was previously accounted for under the equity method of accounting, where investments are stated at initial cost and adjusted for subsequent additional investments and our proportionate share of earnings or losses and distributions. As a result of the reconsideration event, we concluded that Moruga is a variable interest entity (VIE), and that the Company is the primary beneficiary with a controlling financial interest. Based on this conclusion, Moruga was prospectively consolidated on May 1, 2022. For more details on Moruga, refer to Note 3 to the financial statements in this annual report.\nReportable segments\nWe have three operating segments which are also reportable segments. Our reportable segments are presented based on how information is used by our CEO, who is the chief operating decision maker, to measure performance and allocate resources. After the consolidation of Moruga on May 1, 2022, the information used by the CEO was expanded to include the results of Moruga, and as such, we determined our reportable segments to be:\nMarketing and Distribution. Our Marketing and Distribution reportable segment sources fruit from growers and then distributes the fruit through our global distribution network.\nInternational Farming. International Farming owns and operates orchards from which substantially all fruit produced is sold to our Marketing and Distribution segment. Its farming activities range from cultivating early-stage plantings to harvesting from mature trees, and it also earns service revenues for packing and processing for our Blueberries segment, as well as for third-party producers of other crops during the avocado off-harvest season. Operations are principally located in Peru, with smaller operations emerging in other areas of Latin America.\nBlueberries. The new Blueberries segment represents the results of Moruga, subsequent to its consolidation on May 1, 2022. Morugas farming activities include cultivating early-stage blueberry plantings and harvesting mature bushes. Substantially all of blueberries produced are sold to a single distributor under an exclusive marketing agreement.\nRecent developments\nMarketing and Distribution\nOn November 1, 2021, we implemented a new enterprise resource planning (ERP) system to improve operational visibility and financial reporting capabilities. During implementation, we encountered significant challenges which limited our ability to effectively manage our business operations, thereby impacting our profitability and financial results for the first quarter of 2022. Our distribution centers and packing houses experienced problems with purchasing, receiving and shipping, which resulted in a high reliance on both third-party fruit and packaged fruit that we would have otherwise sourced directly in the field and packed in our facilities. Other issues included delays in automated customer invoicing and inventory management issues. During the second quarter of 2022, these operational issues we experienced during the first quarter were largely resolved.\nInternational Farming\nAs vertical integration is a key part of our sourcing strategy, we have continued to make investments in orchard development and land improvements in Peru, Guatemala and Colombia. After planting, our avocado trees begin to produce avocados in approximately three years and reach full production in approximately five to seven years, depending on location. As of October 31, 2022, we had approximately 12,000 acres planted across these locations.\nDuring the fourth quarter of fiscal 2022, we recorded a $49.5 million noncash impairment loss in the consolidated statements of (loss) income to reduce the carrying amount of goodwill associated to our Peruvian farming reporting unit within the International Farming reportable segment. Refer to Note 4 to the consolidated financial statements in this annual report for more information.\nBlueberries\nAs noted above, we consolidated Moruga on May 1, 2022, and in connection, announced plans for a new capital project to plant approximately 1,500 additional acres of blueberry farms in Peru. We are currently in the planning phase of this project and expect planting to commence during fiscal 2023. Our operations in Moruga enable us to utilize our existing infrastructure and workforce in Peru during the complementary periods between avocado harvest and processing seasons.\nResults of Operations\nThe operating results of our businesses are significantly impacted by the price and volume of avocados we farm, source and distribute. In addition, our results have been, and will continue to be, affected by quarterly and annual fluctuations due to a number of factors, including but not limited to pests and disease, weather patterns, changes in demand by consumers, food safety advisories, the timing of the receipt, reduction, or cancellation of significant customer orders, the gain or loss of significant customers, the availability, quality and price of raw materials, the utilization of capacity at our various locations and general economic conditions.\nOur financial reporting currency is the U.S. dollar. The functional currency of substantially all of our subsidiaries is the U.S. dollar and substantially all of our sales are denominated in U.S. dollars. A significant portion of our purchases of avocados are denominated in the Mexican Peso and a significant portion of our growing and harvesting costs are denominated in Peruvian Soles. Fluctuations in the exchange rates between the U.S. dollar and these local currencies usually do not have a significant impact on our gross margin because the impact affects our pricing by comparable amounts. Our margin exposure to exchange rate fluctuations is short-term in nature, as our sales price commitments are generally limited to less than one month and orders can primarily be serviced with procured inventory. Over longer periods of time, we believe that the impact exchange rate fluctuations will have on our cost of goods sold will largely be passed on to our customers in the form of higher or lower prices.\nYears ended October 31,\n2022 2021 2020\n(In millions, except percentages) Dollar\n%\nDollar\n%\nDollar\n%\nNet sales $ 1,045.9 100.0 % $ 891.7 100.0 % $ 862.3 100.0 %\nCost of sales 956.1 91.4 % 767.2 86.0 % 737.7 85.6 %\nGross profit 89.8 8.6 % 124.5 14.0 % 124.6 14.4 %\nSelling, general and administrative expenses 77.5 7.4 % 63.6 7.1 % 56.2 6.5 %\nGoodwill impairment 49.5 4.7 % - - % - - %\nOperating (loss) income (37.2) (3.6) % 60.9 6.8 % 68.4 7.9 %\nInterest expense (5.5) (0.5) % (3.7) (0.4) % (6.7) (0.8) %\nEquity method income 5.1 0.5 % 7.5 0.8 % 4.0 0.5 %\nRemeasurement gain on acquisition of equity method investee 2.0 0.2 % - - % - - %\nImpairment on equity method investment - - % - - % (21.2) (2.5) %\nOther income (expense), net 4.4 0.4 % 1.3 0.1 % (0.7) (0.1) %\n(Loss) income before income taxes (31.2) (3.0) % 66.0 7.4 % 43.8 5.1 %\nProvision for income taxes 3.7 0.4 % 21.1 2.4 % 15.0 1.7 %\nNet (loss) income (34.9) (3.3) % 44.9 5.0 % 28.8 3.3 %\nNet loss attributable to noncontrolling interest 0.3 - % - - % - - %\nNet (loss) income attributable to Mission Produce $ (34.6) (3.3) % $ 44.9 5.0 % $ 28.8 3.3 %\nNet sales\nOur net sales are generated predominantly from the shipment of fresh avocados to retail, wholesale and foodservice customers worldwide. Our net sales are affected by numerous factors, including the balance between the supply of and demand for our produce and competition from other fresh produce companies. Our net sales are also dependent on our ability to supply a consistent volume and quality of fresh produce to the markets we serve.\nYears ended October 31,\n(In millions)\n2022 2021 2020\nNet sales:\nMarketing and Distribution $ 1,016.1 $ 872.0 $ 846.9\nInternational Farming 19.1 19.7 15.4\nBlueberries 10.8 - -\nTotal net sales $ 1,045.9 $ 891.7 $ 862.3\nNet sales increased $154.2 million or 17% in fiscal year 2022 compared to the previous year, primarily due to a 28% increase in average per-unit avocado sales prices, partially offset by decreases in avocado volume sold of 11%. Price increases were due to lower industry supply out of Mexico for much of the fiscal year, as well as inflationary pressures. Lower avocado volume sold was primarily driven by lower Mexican supply. Domestic volumes declined at a lower rate relative to export markets, demonstrating the resiliency of demand for avocados amid higher price points in the U.S. market.\nNet sales increased $29.4 million or 3% in fiscal year 2021 compared to fiscal year 2020, primarily due to a 5% increase in avocado volume sold, partially offset by a 2% decrease in average per-unit avocado sales prices, both of which were driven by increased supply from Mexico and Peru. Higher volumes and lower pricing were concentrated in the first half of 2021 when Mexico was the country of origin for the majority of the fruit sold.\nGross profit\nCost of sales is composed primarily of avocado procurement costs from independent growers and packers, logistics costs, packaging costs, labor, costs associated with cultivation (the cost of growing crops), harvesting and depreciation. Avocado procurement costs from third-party suppliers can vary significantly between and within fiscal years and correlate closely with market prices for avocados. While we have long-standing relationships with our growers and packers, we predominantly purchase fruit on a daily basis at market rates. As such, the cost to procure products from independent growers can have a significant impact on our costs.\nLogistics costs include land and sea transportation and expenses related to port facilities and distribution centers. Land transportation costs consist primarily of third-party trucking services to support North American distribution, while sea transportation cost consists primarily of third-party shipping of refrigerated containers from supply markets in South and Central America to demand markets in North America, Europe and Asia. Variations in containerboard prices, which affect the cost of boxes and other packaging materials, and fuel prices can have an impact on our product cost and our profit margins. Variations in the production yields, and other input costs also affect our cost of sales.\nIn general, changes in our volume of products sold can have a disproportionate effect on our gross profit. Within any particular year, a significant portion of our cost of products are fixed. Accordingly, higher volumes produced on company-owned farms directly reduce the average cost per pound of fruit grown on company owned orchards, while lower volumes directly increase the average cost per pound of fruit grown on company owned orchards. Likewise, higher volumes processed through packing and distribution facilities directly reduce the average overhead cost per unit of fruit handled, while lower volumes directly increase the average overhead cost per unit of fruit handled.\nGross profit percentage will fluctuate based upon per-unit sales price levels in relation to per-unit costs. Margin is primarily managed on a per-unit basis in our Marketing & Distribution segment, which can lead to movement in gross profit percentage when sales prices fluctuate.\nYears ended October 31,\n2022 2021 2020\nGross profit (in millions)\n$ 89.8 $ 124.5 $ 124.6\nGross profit as a percentage of net sales\n8.6 % 14.0 % 14.4 %\nGross profit decreased $34.7 million in fiscal year 2022 compared to fiscal year 2021 to $89.8 million, and gross profit percentage decreased by 536 basis points to 8.6% of revenue. Within our Marketing and Distribution segment, the decreases were primarily driven by the impact of lower avocado volume sold, as well as temporary and unforeseen operational challenges created by the ERP implementation, which limited our ability to effectively manage our supply chain during the first quarter of 2022. Within our International Farming segment, we experienced gross profit decreases primarily due to inflationary cost pressures impacting ocean freight costs, packaging costs, and farming input costs, partially offset by increased avocado production at our farms.\nGross profit was nearly flat in fiscal year 2021 compared to fiscal year 2020 at $124.5 million, and gross profit percentage decreased by 40 basis points to 14.0% of revenue. The declines were due to lower per-unit margins related to sourcing of Californian and Mexican fruit, which were exacerbated by lower industry volumes from the California market as well as smaller fruit sizes from the Mexican market. Additionally, gross margin was impacted by incremental infrastructure costs related to our new Laredo facility within the Marketing & Distribution segment, which was still in the process of ramping up utilization. Gross margin was also negatively impacted by widespread port delays in the fourth quarter of 2021, which created quality issues related to the extended age of inventory on late-season fruit which impacted sales returns. These impacts were substantially offset by higher volume of avocados sold from Company-owned farms within our International Farming segment compared to 2020, which had lower per-unit cost than fruit purchased from third-party growers.\nSelling, general and administrative expenses\nSelling, general and administrative expenses primarily include the costs associated with selling, professional fees, general corporate overhead and other related administrative functions\nYears ended October 31,\n(In millions) 2022 2021 2020\nSelling, general and administrative expenses $ 77.5 $ 63.6 $ 56.2\nSelling, general and administrative expenses increased $13.9 million or 22% in fiscal year 2022 compared to fiscal year 2021 due to ERP costs in our Marketing and Distribution segment, higher employee-related costs, higher professional fees, and higher travel costs. ERP costs consisted of noncapitalizable implementation costs and nonrecurring process re-engineering costs. Employee-related costs were impacted by labor inflation and higher stock-based compensation expense. Higher professional fees were in-part due to our change in SEC filer status from an emerging growth company to a large accelerated filer on October 31, 2021. Travel costs increased as COVID-related travel restrictions eased relative to prior year. The consolidation of Moruga increased selling, general and administrative expenses by $1.7 million, which included amortization of an intangible asset recognized at acquisition.\nSelling, general and administrative expenses increased $7.4 million or 13% in fiscal year 2021 compared to fiscal year 2020 due primarily to higher professional fees and higher liability insurance premiums associated with being a public company and the change in SEC filer status referenced above. Other factors included an increase in rent expense in conjunction with our move to our new corporate headquarters in February 2021, and a legal settlement contingency of $0.8 million, partially offset by a $0.9 million gain from an insurance settlement, net of asset impairment and disposals.\nGoodwill impairment\nA noncash impairment loss of $49.5 million was recognized in the consolidated statements of income during the fourth quarter of fiscal 2022. No goodwill impairment was recognized in fiscal years 2021 or 2020. For more information, refer to Note 4 to the consolidated financial statements.\nInterest expense\nInterest expense consists primarily of interest on borrowings under working capital facilities that we maintain and interest on other long-term debt used to make capital and equity investments.\nYears ended October 31,\n(In millions) 2022 2021 2020\nInterest expense $ 5.5 $ 3.7 $ 6.7\nInterest expense increased $1.8 million or 49% in fiscal year 2022 compared to fiscal year 2021 primarily due to higher interest rates, as the majority of our outstanding debt is subject to variable rates.\nInterest expense decreased $3.0 million or 45% in fiscal year 2021 compared to fiscal year 2020 due to a combination of lower interest rates and lower average principal balances. A substantial portion of our debt had variable interest rates that were based on LIBOR, which declined significantly from 2020 to 2021.\nEquity method income\nOur material equity method investees include Henry Avocado (HAC), Mr. Avocado, Copaltas, and up until May 1, 2022, Moruga. On May 1, 2022, Moruga became a variable interest entity and prospectively consolidated into our financial statements.\nYears ended October 31,\n(In millions) 2022 2021 2020\nEquity method income $ 5.1 $ 7.5 $ 4.0\nRemeasurement gain on acquisition of equity method investee 2.0 - -\nImpairment on equity method investment - - (21.2)\nEquity method income decreased $2.4 million or 32% in fiscal year 2022 compared to fiscal year 2021, primarily due to the effect of consolidation of Moruga, partially offset by stronger operating performance from HAC.\nEquity method income increased $3.5 million or 88% in fiscal year 2021 compared to fiscal year 2020, driven by higher earnings from investments in Moruga and HAC. Morugas earnings increased due to higher blueberry volume attributed to improved yields and better pricing returns. HACs earnings increased due to higher per-unit margins. The impact of COVID-19 related stay at-home orders that went into effect in March 2020 were more profound to HAC due to their heavier concentration of foodservice customers.\nOther income (expense), net\nOther income (expense), net consists of interest income, currency exchange gains or losses, interest rate derivative gains or losses and other miscellaneous income and expense items.\nYears ended October 31,\n(In millions) 2022 2021 2020\nOther income (expense), net $ 4.4 $ 1.3 $ (0.7)\nOther income increased $3.1 million or 238% in fiscal year 2022 compared to the previous year, primarily due to gains on our interest rate swaps driven by market movements in short-term interest rates. The interest rate swaps are intended to hedge against variable interest rate exposure associated with our term debt facility.\nOther income in fiscal year 2021 was $1.3 million, compared to other expense of $0.7 million in fiscal year 2020. The $2.0 million change was primarily due to losses on interest rate swaps in 2020, driven by market movements in short-term interest rates, partially offset by the effect of foreign currency loss in 2021 compared to gains in 2020. The significant weakening of the Mexican peso relative to the U.S. dollar and the substantial reduction in LIBOR in fiscal 2020 were correlated with the COVID-19 pandemic.\nProvision for income taxes\nThe provision for income taxes consists of the consolidation of tax provisions, computed on a separate entity basis, in each country in which we have operations. We recognize the effects of tax legislation in the period in which the law is enacted. Our deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years we estimate the related temporary differences to reverse. Realization of deferred tax assets is dependent upon future earnings, the timing and amount of which are uncertain.\nWe recognize a tax benefit from an uncertain tax position only if it is more likely than not the tax position will be sustained on examination by the taxing authorities, based on the technical merits of the position. The tax benefits recognized from such positions are then measured based on the largest benefit that has a greater than 50% likelihood of being realized upon settlement. Interest and penalties related to unrecognized tax benefits are recognized within provision for income taxes.\nYears ended October 31,\n2022 2021 2020\nProvision for income taxes (in millions) $ 3.7 $ 21.1 $ 15.0\nEffective tax rate(1)\n(12.0) % 32.0 % 34.2 %\n(1)May not sum due to rounding.\nThe provision for income taxes decreased $17.4 million or 82% in fiscal year 2022 compared to fiscal year 2021. In 2022, our provision for income taxes was impacted by the $49.5 million non-deductible goodwill impairment charge, which generated a pre-tax loss. In 2021, the provision for income taxes included a $5.4 million charge from the remeasurement of our deferred tax balances in Peru due to the enactment of tax law repealing tax benefits to agribusiness entities. The new law was enacted on December 30, 2020, and will subject us to higher Peruvian corporate income tax rates than our current rate of 15% as follows: 20% for calendar years 2023 to 2024, 25% for calendar years 2025 to 2027, and 29.5% thereafter.\nThe provision for income taxes increased $6.1 million or 41% in fiscal year 2021 compared to fiscal year 2020, primarily due to remeasurement of our deferred tax balances in Peru due to the enactment of tax rate changes as described above. The deferred tax balances were remeasured based on the applicable tax rate in the year the deferred balances are expected to reverse, resulting in a net deferred tax liability increase of $5.4 million, which also increased income tax expense by the same amount. The effective tax rate decreased by 2.2% in fiscal year 2021 over fiscal year 2020. The decrease was primarily due to the nondeductible impairment of Moruga in fiscal year 2020, partially offset by increases in the Peruvian tax rates.\nSegment Results of Operations\nOur CEO evaluates and monitors segment performance primarily through segment sales and segment adjusted earnings before interest expense, income taxes and depreciation and amortization (adjusted EBITDA). We believe that adjusted EBITDA by segment provides useful information for analyzing the underlying business results as well as allowing investors a means to evaluate the financial results of each reportable segment in relation to the Company as a whole. These measures are not in accordance with, nor are they a substitute for or superior to, the comparable GAAP financial measures.\nAdjusted EBITDA refers to net income (loss), before interest expense, income taxes, depreciation and amortization expense, stock-based compensation expense, other income (expense), and income (loss) from equity method investees, further adjusted by asset impairment and disposals, net of insurance recoveries, farming costs for nonproductive orchards (which represents land lease costs), certain noncash and nonrecurring ERP costs, transaction costs, material legal settlements, amortization of inventory adjustments recognized from business combinations, and any special, non-recurring, or one-time items such as remeasurements or impairments, and\nany portion of these items attributable to the noncontrolling interest, all of which are excluded from the results the CEO reviews uses to assess segment performance and results.\nNet sales\nMarketing and Distribution International Farming Blueberries Total Marketing and Distribution International Farming Total Marketing and Distribution International Farming Total\nYears ended October 31,\n(In millions) 2022 2021 2020\nThird party sales $ 1,016.1 $ 19.1 $ 10.8 $ 1,045.9 $ 872.0 $ 19.7 $ 891.7 $ 846.9 $ 15.4 $ 862.3\nAffiliated sales - 95.6 - 95.6 - 84.9 84.9 - 66.4 66.4\nTotal segment sales $ 1,016.1 $ 114.7 $ 10.8 $ 1,141.5 $ 872.0 $ 104.6 $ 976.6 $ 846.9 $ 81.8 $ 928.7\nIntercompany eliminations - (95.6) - (95.6) - (84.9) (84.9) - (66.4) (66.4)\nTotal net sales $ 1,016.1 $ 19.1 $ 10.8 $ 1,045.9 $ 872.0 $ 19.7 $ 891.7 $ 846.9 $ 15.4 $ 862.3\nAdjusted EBITDA\nYears ended October 31,\n(In millions) 2022 2021 2020\nMarketing & Distribution adjusted EBITDA $ 23.5 $ 51.4 $ 68.2\nInternational Farming adjusted EBITDA 23.3 33.9 23.3\nBlueberries adjusted EBITDA 0.8 - -\nTotal reportable segment adjusted EBITDA $ 47.6 $ 85.3 $ 91.5\nNet (loss) income (34.9) 44.9 28.8\nInterest expense 5.5 3.7 6.7\nProvision for income taxes 3.7 21.1 15.0\nDepreciation and amortization(1)\n24.8 20.4 18.1\nEquity method income (5.1) (7.5) (4.0)\nStock-based compensation 3.6 2.6 5.0\nOther (income) expense, net (4.4) (1.3) 0.7\nLegal settlement - 0.8 -\nAsset impairment and disposals, net of insurance recoveries 0.4 (0.2) -\nFarming costs for nonproductive orchards 1.5 0.8 -\nERP costs(2)\n4.6 - -\nAmortization of inventory adjustment recognized from business combination 0.4 - -\nGoodwill impairment 49.5 - -\nRemeasurement gain on business combination with Moruga (2.0) - -\nImpairment on equity method investment - - 21.2\nTransaction costs 0.6 - -\nNoncontrolling interest(3)\n(0.6) - -\nTotal adjusted EBITDA $ 47.6 $ 85.3 $ 91.5\n(1)Includes $1.4 million of depreciation and amortization on purchase accounting assets including property, plant and equipment step-up and an intangible asset for the year ended October 31, 2022.\n(2)Includes recognition of deferred implementation costs and non-recurring post-implementation process reengineering costs.\n(3)Represents net loss attributable to noncontrolling interest plus the impact of non-GAAP adjustments, allocable to the noncontrolling owner based on their percentage of ownership interest.\nMarketing and Distribution\nNet sales in our Marketing and Distribution segment increased $144.1 million or 17% in fiscal year 2022 compared to fiscal year 2021, due to the same drivers impacting consolidated revenue.\nSegment adjusted EBITDA decreased $27.9 million or 54% in fiscal year 2022 compared to fiscal year 2021 due to the impact of lower avocado volume sold, lower gross margin primarily attributed to ERP-related issues during the first quarter of 2022, and higher selling, general and administrative expense as described above.\nNet sales in our Marketing and Distribution segment increased $25.1 million or 3% in fiscal year 2021 compared to fiscal year 2020, due to the same drivers impacting consolidated revenue.\nSegment adjusted EBITDA decreased $16.8 million or 25% in fiscal year 2021 compared to fiscal year 2020 due to lower gross margins and higher selling, general and administrative expenses. Gross margin was impacted by tighter per-unit margins related to the sourcing of Californian and Mexican fruit, which were exacerbated by smaller industry volumes within the California market as well as smaller fruit sizes within the Mexican market. Additionally, gross margin was pressured by incremental infrastructure costs related to our new Laredo facility, which was still in the process of ramping up utilization. Selling, general and administrative expenses increased due to the same factors as described above.\nInternational Farming\nSubstantially all sales of fruit from our International Farming segment are to the Marketing and Distribution segment, with the remainder of revenue largely derived from services provided to third parties and our Blueberries segment. Affiliated sales are concentrated in the second half of the fiscal year in alignment with the Peruvian avocado harvest season, which typically runs from April through August of each year. As a result, adjusted EBITDA for the International Farming segment is generally concentrated in the third and fourth quarters of the fiscal year in alignment with the timing of sales. The Company operates approximately 700 acres of mangos in Peru that are largely in an early stage of production. The timing of the mango harvest is concentrated in the fiscal second quarter and, as a result, mangos have a more pronounced impact on segment financial performance during this timeframe.\nTotal segment sales in our International Farming segment increased $10.1 million or 10% in fiscal year 2022 compared to fiscal year 2021, driven by increased avocado production of 15%, which increased affiliated sales.\nSegment adjusted EBITDA decreased $10.6 million or 31% in fiscal year 2022 compared to fiscal year 2021, primarily due to inflationary cost pressures impacting ocean freight costs, packaging costs, and farming input costs, partially offset by increased avocado production at our farms, as well as losses at early-stage mango farms that were mainly driven by lower sales prices and production yields.\nTotal segment sales in our International Farming segment increased $22.8 million or 28% in fiscal year 2021 compared to fiscal year 2020, due to a 33% increase in fruit volumes resulting from improved harvest yields at our maturing orchards, partially offset by a 3% decrease in average sales prices. Net sales increased $4.3 million or 28% in fiscal year 2021 compared to fiscal year 2020, primarily due to higher packing and processing service revenue for third-party growers.\nSegment adjusted EBITDA increased $10.6 million or 45% in fiscal year 2021 compared to fiscal year 2020, primarily due to the revenue drivers noted above.\nBlueberries\nIn the six months ended October 31, 2022, net sales in our Blueberries segment were $10.8 million and segment adjusted EBITDA was $0.8 million.\nLiquidity and Capital Resources\nOperating activities\nYears ended October 31,\n(In millions) 2022 2021 2020\nNet (loss) income $ (34.9) $ 44.9 $ 28.8\nDepreciation and amortization 24.8 20.4 18.1\nEquity method income (5.1) (7.5) (4.0)\nNoncash lease expense 5.3 4.3 -\nStock-based compensation 3.6 2.6 5.0\nDividends received from equity method investees 2.2 1.7 1.7\nDeferred income taxes (0.6) 8.8 (1.0)\nGoodwill impairment 49.5 - -\nRemeasurement gain on acquisition of equity method investee (2.0) - -\nImpairment on equity method investment - - 21.2\nUnrealized (gains) losses on derivative financial instruments (4.7) (0.8) 2.8\nOther 0.9 0.3 (1.6)\nChange in working capital (3.8) (27.7) 7.9\nNet cash provided by operating activities $ 35.2 $ 47.0 $ 78.9\nNet cash provided by operating activities decreased $11.8 million for fiscal year 2022 compared to fiscal year 2021, reflecting our net loss in the current year compared to net income in the prior year, partially offset by improvements in working capital. Working capital was primarily impacted by favorable movement in accounts receivable, partially offset by unfavorable movement in inventory. Accounts receivable as of October 31, 2022 was lower compared to prior year, as a result of per-unit sales prices trending lower during the fourth quarter. Changes in inventory were primarily driven by the consolidation of Moruga and its respective inventory.\nNet cash provided by operating activities decreased $31.9 million for fiscal year 2021 compared to fiscal year 2020, reflecting unfavorable net change in working capital. Within working capital, unfavorable changes in accounts receivable and inventory, were partially offset by favorable changes in grower payables. Accounts receivable increases were due to rising per-unit sales prices during the year. Changes in inventory were driven by a combination of higher farm related inventory in Peru, as well as higher per-unit cost of Mexican fruit on-hand compared to 2020. The increases in farm related inventory were due primarily to growth in productive acreage and higher on-hand quantities of fruit at the end of 2021 due to the extension of the harvest season combined with port delays. Favorable changes in grower payables were correlated with the pricing increases experienced with Mexican inventory.\nInvesting activities\nYears ended October 31,\n(In millions) 2022 2021 2020\nPurchases of property and equipment $ (61.2) $ (73.4) $ (67.3)\nProceeds from sale of property, plant and equipment 3.0 2.4 3.0\nInsurance proceeds for the replacement of property, plant and equipment - 1.1 -\nCash acquired in consolidation of Moruga 4.3 - -\nInvestment in equity method investees (0.4) (0.2) (3.4)\nLoans to equity method investees - (2.0) -\nLoan repayments from equity method investees 3.0 1.5 -\nOther (0.1) 0.3 -\nNet cash used in investing activities $ (51.4) $ (70.3) $ (67.7)\nProperty, plant and equipment\nIn fiscal year 2022, capital expenditures were concentrated in the purchase of farmland in Peru as well as land improvements and orchard development of avocados in Guatemala and both avocados and blueberries in Peru. Proceeds from the sale of property, plant and equipment were primarily from land that had been originally intended for use as our corporate headquarters.\nIn fiscal year 2021, capital expenditures were primarily for the construction of the Laredo facility, which was completed in mid-fiscal 2021, and land improvements and orchard development in Peru and Guatemala. Proceeds from the sale of property, plant and equipment were primarily from the sale of multi-unit housing properties in California that had been used for housing seasonal avocado labor contractors. We also received insurance proceeds for property, plant and equipment damage sustained in our Dallas facility from a cold weather storm, which were subsequently invested in the rebuilding of the equipment.\nEquity method investees\nCapital contributions were made to our joint venture, Copaltas, in both fiscal years 2022 and 2021 to support the purchase of additional farmland in Colombia. We also made a capital contribution to Mr. Avocado in fiscal year 2022 to support the addition of a new distribution facility in southern China.\nIn fiscal year 2021, we issued $2.0 million in loans to Copaltas to support the working capital needs of the entity, which was repaid in fiscal year 2022. In addition, loan repayments from Moruga were $1.5 million during fiscal year 2021.\nFinancing activities\nYears ended October 31,\n(In millions) 2022 2021 2020\nBorrowings on revolving credit facility $ 80.0 $ - $ 14.0\nPayments on revolving credit facility (40.0) - (14.0)\nShort-term borrowings 2.5 - -\nPrincipal payments on long-term debt obligations (63.3) (10.5) (6.3)\nPrincipal payments on finance lease obligations (1.2) (1.2) (0.9)\nPayments for long-term supplier financing - - (5.8)\nExercise of stock options 0.1 0.2 -\nRepayment of stock option notes receivable - 0.1 0.1\nPayment of debt issuance or extinguishment fees (0.8) (0.1) (0.2)\nPurchase and retirement of stock - - (1.9)\nProceeds from issuance of common stock in public offering, net of issuance costs - - 78.1\nDividends paid - - (13.0)\nContributions from noncontrolling interest holders 0.9 - -\nNet cash (used in) provided by financing activities $ (21.8) $ (11.5) $ 50.1\nBorrowings and repayments of debt\nWe utilize a revolving line of credit for short-term working capital purposes. Principal payments on our term loans and other notes payable are made in accordance with debt maturity schedules. Our financing cash flow for fiscal year 2022 reflects the modification of principal amounts on our term-loans and increased borrowing capacity on our revolver (refer to the Capital Resources section below for more information).\nDuring the year ended October 31, 2021, we repaid outstanding principal of $3.0 million on a note payable earlier than its scheduled maturity.\nShareholders equity\nNo dividends were paid in fiscal years 2022 and 2021. We paid dividends of $0.21 per share in fiscal year 2020.\nCapital resources\nOctober 31,\n(In millions) 2022 2021\nCash and cash equivalents $ 52.8 $ 84.5\nWorking capital(1)\n126.4 157.9\n(1)Includes cash and cash equivalents\nCapital resources include cash flows from operations, cash and cash equivalents, and debt financing.\nIn October 2022, we entered into a third amendment to our syndicated credit facility with Bank of America (the credit facility) Merrill Lynch, originally dated October 2018, as amended in September 2020 and April 2022. Among other things, the third amendment changed the total borrowing capacity from $275 million to $250 million. The credit facility is comprised of two senior term loans totaling $100 million, compared to $175 million before the third amendment and a revolving credit agreement now providing up to $150 million in borrowings compared to $100 million before the third amendment. The loans are secured by real property, personal property and the capital stock of the Companys subsidiaries. Borrowings under the credit facility bear interest at a spread over SOFR ranging from 1.5% to 2.5% depending on the Companys consolidated total net leverage ratio, compared to a spread over LIBOR, ranging from 1.50% to 2.75%, prior to the third amendment.\nAs of October 31, 2022, we were required to comply with the following financial covenants: (a) a quarterly consolidated leverage ratio of not more than 3.5 to 1.00 and (b) a quarterly consolidated fixed charge coverage ratio of not less than 1.25 to 1.00. As of October 31, 2022, our consolidated leverage ratio was 2.17 to 1.00 and our consolidated fixed charge coverage ratio was 1.71 to 1.00 and we were in compliance with all such covenants of the credit facility. We pay fees on unused commitments on the credit facility.\nCertain of our consolidated subsidiaries may also enter into short-term bank borrowings from time to time.\nMaterial cash requirements\nCapital expenditures\nWe have various capital projects in progress for farming expansion and facility improvements which we intend to fund through our operating cash flow as well as cash and cash equivalents on hand. For fiscal 2023, we expect capital expenditures excluding the Moruga Blueberry Project (described below) to be lower than fiscal 2022. Cash paid for capital expenditures for the year ended October 31, 2022 was $61.2 million.\nMoruga Blueberry Project\nOn May 1, 2022, the shareholders of Moruga approved a new capital project to farm approximately 1,500 additional acres of blueberries in the Olmos region of Peru. The project is anticipated to require a total investment of approximately $50 million, the majority of which will be funded by cash flow generated by Moruga and supplemented by pro-rata shareholder contributions based on each shareholders respective ownership interest. The project is expected to be carried out in phases, commencing in fiscal year 2023. For fiscal 2023, we expect capital expenditures related to the project to be approximately $20 to $25 million, depending on timing and other factors.\nLeases\nWe are party to various leases for facilities, land, and equipment, for which our undiscounted cash liabilities were $105.3 million as of October 31, 2022. Of that amount, approximately $20 million was related to a 15-year lease of a distribution facility in the U.K. that began July 1, 2022. The facility is expected to expand our distribution reach within the growing U.K. market. Facility improvements began in the fourth quarter of fiscal 2022. In November 2022, subsequent to our fiscal 2022 year end, Moruga entered into a 25-year land lease agreement as part of the new project. Undiscounted lease payments associated with the lease agreement are approximately $60 million.\nLong-term Debt\nAs of October 31, 2022, the aggregate principal amount outstanding on our term loans and notes was $141.0 million. See Note 7 to the consolidated financial statements for more information.\nCritical Accounting Estimates\nOur discussion and analysis of our financial condition and results of operations are based upon our consolidated financial statements, which have been prepared in accordance with U.S. GAAP. U.S. GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the consolidated financial statements and the reported amounts of revenues and expenses during the reporting period. We base our estimates on historical experience and on various other assumptions that are believed to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Additionally, we frequently engage third party valuation experts to assist us with estimates described below. Actual results could differ from those estimates.\nBusiness combinations. We account for business combinations under the acquisition method of accounting in accordance with ASC Topic 805, Business Combinations, which requires an allocation of the consideration paid, if any, to the identifiable assets, intangible assets and liabilities based on the estimated fair values as of the acquisition date. Goodwill represents the excess of the sum of the fair value of our previously held equity interest and the fair value of the noncontrolling interest, over the net of the acquisition-date values of the identifiable assets and liabilities assumed. Management estimates the fair value of assets and liabilities with the assistance of a third-party specialist, using a combination of the market and income valuation methods. These valuation methods use inputs that are estimated by management, such as revenue forecasts, projected capital spend and estimates for cost of sales. The Company may adjust the amounts recognized for a business combination within the allowable one-year measurement period after the acquisition date. Any such adjustments would generally be recorded as increases or decreases to the goodwill recognized in the transaction.\nGoodwill. Our goodwill represents the excess of the purchase price of business combinations over the fair value of the net assets acquired. Goodwill impairment testing requires significant judgment and management estimates, including, but not limited to, the determination of (i) the number of reporting units, (ii) the goodwill and other assets and liabilities to be allocated to the reporting units and (iii) the fair values of the reporting units. The estimates and assumptions described above, along with other factors such as discount rates, will significantly affect the outcome of the impairment tests and the amounts of any resulting impairment losses. We perform a qualitative assessment of goodwill for impairment on an annual basis during the fourth quarter of each year, and between annual tests whenever events or changes in circumstances indicate that the carrying amount may not be recoverable. If qualitative factors were to indicate that it is more-likely-than-not that the fair value of the reporting unit is less than its carrying value, we would then perform a quantitative assessment, which would consist primarily of a discounted cash flow (DCF) analysis and guideline publicly-traded companies (GPC) analysis to determine the fair value of the reporting unit. To the extent the carrying amount of the reporting unit exceeds its fair value, we recognize an impairment of goodwill for the excess up to the amount of goodwill of that reporting unit.\nDuring the fourth quarter of fiscal 2022, we performed our annual goodwill impairment test on our Peruvian farming reporting unit within the International Farming segment and determined that the qualitative factors indicated that it was more-likely-than-not that the fair value of the reporting unit was less than its carrying value. As a result, with the assistance of a third-party specialist, we performed a quantitative assessment of the fair value of the reporting unit using the DCF and GPC methods described in Notes 3 and 4 to the consolidated financial statements, resulting in an impairment charge of $49.5 million. The significant assumptions used in determining the fair values of the reporting unit have been described in Note 4. To the extent that BEV to EBITDA multiples in the future decrease, the discount rate used in determining the present value of our cash flows increases, or if the Company does not meet its cash flow projections for the reporting unit, additional impairment charges may be recorded in the future.\nInvestments. We maintain investments in other fruit growers, packers and distributors. These investments are accounted for under the equity method of accounting when we have the ability to exercise significant influence, but not control, over the investee. Significant influence generally exists when we have an ownership interest representing between 20% and 50% of the voting stock of the investee. Under the equity method of accounting, investments are stated at initial cost and are adjusted for subsequent additional investments and our proportionate share of earnings or losses and distributions. We review our investments for other-than temporary-impairment (OTTI) on a quarterly basis, or earlier if indicators of impairment arise. If an impairment of an equity method investment is determined to be other than temporary, we would record OTTI sufficient to reduce the investments carrying value to its fair value, which results in a new cost basis in the investment. The primary factors we consider in our determination of whether declines in fair value are other-than-temporary are the length of time that the fair value of the investment is below our carrying value; the severity of the decline; and the financial condition, operating performance and near-term prospects of the investee. In addition, we consider the reason for the decline in fair value, be it general market conditions, industry specific or investee specific; and our intent and ability to hold the investment for a period of time sufficient to allow for a recovery in fair value. As our assessment of the fair value of our investments and any resulting impairment losses and the timing of when to recognize such charges requires judgment and includes estimates and assumptions, actual results could differ materially from our estimates and assumptions.\nIncome taxes. As a multinational corporation, we are subject to taxation in many jurisdictions, and the calculation of our tax liabilities involves dealing with uncertainties in the application of complex tax laws and regulations in various taxing jurisdictions. If we ultimately determine that the payment of these liabilities will be unnecessary, the liability will be reversed, and we will recognize a tax benefit during the period in which it is determined the liability no longer applies. Conversely, we record additional tax charges in a period in which it is determined that a recorded tax liability is less than the ultimate assessment is expected to be.\nWe recognize the tax benefit from an uncertain tax position only if it is more likely than not the tax position will be sustained on examination by the taxing authorities, based on the technical merits of the position. The tax benefits recognized from such positions are then measured based on the largest benefit that has a greater than 50% likelihood of being realized upon settlement. Interest and penalties related to unrecognized tax benefits are recognized within provision for income taxes.\nThe application of tax laws and regulations is subject to legal and factual interpretation, judgment and uncertainty. Tax laws and regulations themselves are subject to change as a result of changes in fiscal policy, changes in legislation, the evolution of regulations and court rulings. Therefore, the actual liability for U.S. or foreign taxes may be materially different from managements estimates, which could result in the need to record additional tax liabilities or potentially reverse previously recorded tax liabilities.\nRecently Issued Accounting Standards\nRefer to Note 2 to the consolidated financial statements included herein for information on recently issued accounting standards.\nOff-Balance Sheet Arrangements\nDuring the periods presented we did not have, nor do we currently have, any off-balance sheet arrangements as defined under SEC rules, except as follows:\nThe Company may issue standby letters of credit through banking institutions. As of October 31, 2022, total letters of credit outstanding were $0.7 million. Item 7A. Quantitative and Qualitative Disclosures About Market Risk\nInterest Rate Risk\nBorrowings under our credit facility bear variable interest rates, based on SOFR, plus spreads that vary with the Companys leverage ratio. In October 2022, we amended the credit facility reducing the principal value of our term loans to $100 million. To reduce interest rate risk, we have interest rate swaps with a total notional amount of $100 million to hedge changes in the variable rates applicable to our term loan principal. The interest rate swaps carry fixed LIBOR rates ranging from 1.75% to 2.57%. A 10% increase or decrease in the interest rate on our long-term debt would not have a material effect on our financial position, results of operations, or cash flows.\nForeign Currency Risk\nThe majority of our sales are currently conducted in U.S. dollars, while a significant portion of our input costs are denominated in foreign currencies. Due to our short inventory turn-time and short-term pricing, transactions that may be conducted in foreign currencies are not expected to have a material effect on our results of operations, financial position or cash flows because of the short-term on-hand time of the fruit, and the sales price increases passed through.\nEffects of Inflation\nInflation generally affects us by increasing our cost of labor, materials, transportation, and general overhead costs. We cannot reasonably estimate our ability to successfully recover any impact of inflation through price increases in the future. Item 8. Financial Statements and Supplementary Data\nThe financial statements required pursuant to this item are incorporated by reference herein from the applicable information included in Item 15 of this annual report and are presented beginning on page. Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone. Item 9A. Controls and Procedures\nDisclosure Controls and Procedures\nOur management, with the participation and supervision of our Chief Executive Officer and our Chief Financial Officer, have evaluated the effectiveness of our disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934, as amended (the Exchange Act) as of the end of the period covered by this Annual Report on Form 10-K.\nDisclosure controls and procedures are controls and other procedures that are designed to ensure that information required to be disclosed in our reports filed or submitted under the Exchange Act is recorded, processed, summarized, and reported, within the time\nperiods specified in the SECs rules and forms. Disclosure controls and procedures include controls and procedures designed to ensure that information required to be disclosed in our reports filed under the Exchange Act is accumulated and communicated to management, including our Chief Executive Officer and Chief Financial Officer, to allow timely decisions regarding required disclosure. Management recognizes that any controls and procedures, no matter how well designed and operated, can provide only reasonable assurance of achieving their objectives, and management necessarily applies its judgment in evaluating the cost-benefit relationship of possible controls and procedures. Based on the evaluation of our disclosure controls and procedures, our Chief Executive Officer and our Chief Financial Officer have concluded that our disclosure controls and procedures were effective as of October 31, 2022.\nManagements Annual Report on Internal Control Over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act). Our internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with GAAP.\nUnder the supervision and with the participation of our management, including our Chief Executive Officer and Chief Financial Officer, we conducted an evaluation of the effectiveness of our internal control over financial reporting based on the framework set forth in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on that evaluation, our management concluded that our internal control over financial reporting was effective as of October 31, 2022. The business combination and consolidation of our equity ownership interest in Moruga S.A.C. (Moruga) on May 1, 2022 was excluded from the assessment of internal control over financial reporting as of October 31, 2022, under allowable exclusions.\nThe effectiveness of our internal control over financial reporting as of October 31, 2022 has been audited by Deloitte & Touche LLP, an independent registered public accounting firm, as stated in its report which is included below.\nAttestation Report of the Registered Public Accounting Firm\nThe attestation report of the independent registered public accounting firm, Deloitte & Touche LLP, on the Companys internal control over financial reporting is included below under the heading Report of Independent Registered Public Accounting Firm.\nChanges in Internal Control Over Financial Reporting\nOther than described below, there have been no changes in our internal control over financial reporting during the year ended October 31, 2022 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nOn May 1, 2022, we prospectively consolidated Moruga, an entity for which we have a 60% equity ownership interest, into our consolidated financial statements. We are currently in the process of integrating Moruga into our internal control environment over financial reporting, and as a result, certain controls may be changed.\nOn November 1, 2021, we implemented a new ERP system in our Marketing and Distribution segment, which impacted recordkeeping processes for the general ledger, accounts receivable, inventory, accounts payable, purchasing, and shipping. We have focused on the maintenance of internal controls and the assessment of the design of new controls through the development and deployment of the new ERP system.\nLimitations on Effectiveness of Controls and Procedures\nOur management does not expect that our disclosure controls and procedures or our internal control over financial reporting will prevent all errors and all fraud. A control system, no matter how well designed and operated, can provide only reasonable, not absolute, assurance that the objectives of the control system are met. Further, the design of a control system must reflect the fact that there are resource constraints, and the benefits of controls must be considered relative to their costs. Because of the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, within our Company have been detected. Item 9B. Other Information\nNone.\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNone.\nPART III Item 10. Directors, Executive Officers and Corporate Governance\nThe information required by this item will be contained in our definitive proxy statement to be filed with the SEC in connection with our 2023 Annual Meeting of Stockholders, or the Definitive Proxy Statement, which is expected to be filed not later than 120 days after the end of our fiscal year ended October 31, 2022, under the headings Election of Directors, Executive Officers, and Delinquent Section 16(a) Reports, and is incorporated herein by reference.\nCode of Conduct and Ethics\nWe have adopted a Code of Conduct and Ethics that applies to our officers, directors and employees, which is available on our website at www.missionproduce.com. The Code of Conduct and Ethics contains general guidelines for conducting the business of our company consistent with the highest standards of business ethics and is intended to qualify as a code of ethics within the meaning of Section 406 of the Sarbanes-Oxley Act of 2002 and Item 406 of Regulation S-K. In addition, we intend to promptly disclose (1) the nature of any amendment to our Code of Business Conduct and Ethics that applies to our principal executive officer, principal financial officer, principal accounting officer or controller or persons performing similar functions and (2) the nature of any waiver, including an implicit waiver, from a provision of our code of ethics that is granted to one of these specified officers, the name of such person who is granted the waiver and the date of the waiver on our website in the future. Item 11. Executive Compensation\nThe information required by this item will be set forth in the section headed Executive Compensation in our Definitive Proxy Statement and is incorporated herein by reference. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe information required by this item will be set forth in the section headed Security Ownership of Certain Beneficial Owners and Management in our Definitive Proxy Statement and is incorporated herein by reference.\nThe information required by Item 201(d) of Regulation S-K will be set forth in the section headed Executive Compensation in our Definitive Proxy Statement and is incorporated herein by reference. Item 13. Certain Relationships and Related Transactions, and Director Independence\nThe information required by this item will be set forth in the section headed Certain Relationships and Related Party Transactions, Director Independence and Board Committees and Charters in our Definitive Proxy Statement and is incorporated herein by reference. Item 14. Principal Accountant Fees and Services\nThe information required by this item will be set forth in the section headed Fees Billed by Deloitte for 2022 and 2021 in our Definitive Proxy Statement and is incorporated herein by reference.\nPART IV- OTHER INFORMATION Item 15. Exhibit and Financial Statement Schedules\nA.All financial statements\nThe financial statements of Mission Produce, Inc., together with the report thereon of Deloitte & Touche LLP, an independent registered public accounting firm, are included in this annual report on Form 10-K beginning on page.\nB.Financial statement schedules\nAll schedules have been omitted because the required information is not present or is not present in amounts sufficient to require submission of the schedule, or because the information required is included in the consolidated financial statements and notes thereto.\nC.Exhibits\nThe documents set forth are filed herewith or incorporated herein by reference.\nINDEX\nIncorporated by Reference\nExhibit No. Exhibit Description Form Date Number Filed\nHerewith\n3.1# Amended and Restated Certificate of Incorporation\n8-K 10/7/2020 3.1\n3.2# Amended and Restated Bylaws\n8-K 10/7/2020 3.2\n4.1# Form of Common Stock Certificate\nS-1/A 9/22/2020 4.1\n4.2# Description of Capital Stock\n10-K 12/22/2021 4.2\n10.1#+ Mission Produce, Inc. Amended and Restated 2003 Stock Incentive Plan\nS-1/A 9/22/2020 10.1\n10.2#+ Form of Stock Option Agreement pursuant to the Mission Produce, Inc. Amended and Restated 2003 Stock Incentive Plan\nS-8 10/5/2020 10.2\n10.3#+ Mission Produce, Inc. 2020 Incentive Award Plan\nS-1 9/4/2020 10.3\n10.5#+ Form of Stock Option Agreement pursuant to the Mission Produce, Inc. 2020 Incentive Award Plan\nS-1 9/4/2020 10.5\n10.6#+ Form of RSU Agreement pursuant to the Mission Produce, Inc. 2020 Incentive Award Plan\nS-1 9/4/2020 10.6\n10.7#+ Form of Indemnification Agreement between Mission Produce, Inc. and certain of its directors and officers\nS-1 9/4/2020 10.7\n10.8# Credit Agreement, dated as of October 11, 2018, by and among Mission Produce, Inc., as Borrower, certain subsidiaries of the Borrower party thereto as guarantors, Bank of America, N.A. as administrative agent, Swingline Lender and L/C Issuer, Farm Credit West, PCA as Syndication Agent, City National Bank and J.P. Morgan Chase Bank, N.A. as co-documentation agents, Merrill Lynch, Pierce, Fenner & Smith Incorporated and Farm Credit West, PCA as joint lead arrangers and joint bookrunners, and other lenders party thereto\nS-1 9/4/2020 10.8\n10.9# First Amendment to Credit Agreement and Consent, dated September 18, 2020, by and among Mission Produce, Inc., as Borrower, certain subsidiaries of the Borrower party thereto as guarantors, Bank of America, N.A. as administrative agent, Swingline Lender and L/C Issuer, Farm Credit West, PCA as Syndication Agent, City National Bank and J.P. Morgan Chase Bank, N.A. as co-documentation agents, Merrill Lynch, Pierce, Fenner & Smith Incorporated and Farm Credit West, PCA as joint lead arrangers and joint bookrunners, and other lenders party thereto\nS-1/A 9/22/2020 10.9\n10.10# Form of Amended and Restated Stockholder Agreement, by and among Mission Produce, Inc. and the stockholder party thereto\nS-1/A 9/22/2020 10.10\n10.11# Corporate Headquarters Lease Agreement\n10-K 1/19/2021 10.11\n10.13#+ Mission Produce Deferred Compensation Plan\n10-K 12/22/2021 10.13\n10.14#+ Director Equity Deferral Plan\n10-K 12/22/2021 10.14\n10.15+ Form of Performance Stock Unit Agreement pursuant to the Mission Produce, Inc. 2020 Incentive Award Plan\nX\nIncorporated by Reference\nExhibit No. Exhibit Description Form Date Number Filed\nHerewith\n10.16#+ Offer letter dated March 8, 2021 to Joanne Wu\n10-K 12/22/2021 10.16\n10.17# Second Amendment dated April 26, 2022, to the Credit Agreement dated as of October 11, 2018 and amended on September 18, 2020, by and among Mission Produce, Inc., as Borrower, certain subsidiaries of the Borrower party thereto as guarantors, Bank of America, N.A. as administrative agent, Swingline Lender and L/C Issuer, Farm Credit West, PCA as Syndication Agent, City National Bank and J.P. Morgan Chase Bank, N.A. as co-documentation agents, Merrill Lynch, Pierce, Fenner & Smith Incorporated and Farm Credit West, PCA as joint lead arrangers and joint bookrunners, and other lenders party thereto.\n8-K 4/26/2022 10.17\n10.18+# Amended and Restated Non-Employee Director Compensation Program\n10-Q 6/8/2022 10.18\n10.19+# Offer letter dated April 26, 2022 to Tim Bulow\n10-Q 6/8/2022 10.19\n10.20# Third Amendment to the Credit Agreement, dated as of October 11, 2018, as amended on September 18, 2020 and April 26, 2022, by and among Mission Produce, Inc., as Borrower, certain subsidiaries of the Borrower party thereto as guarantors, Bank of America, N.A. as administrative agent, Swingline Lender and L/C Issuer, Farm Credit West, PCA as Syndication Agent, City National Bank, Citibank, N.A., and J.P. Morgan Chase Bank, N.A. as co-documentation agents, BofA Securities, Inc. and Farm Credit West, PCA as joint lead arrangers and joint bookrunners, and other lenders party thereto\n8-K 10/21/2022 10.20\n10.21+# Employee Equity Deferral Plan\nX\n21.1# List of Subsidiaries of Registrant\nX\n23.1 Consent of Deloitte & Touche LLP\nX\n24.1# Power of Attorney\n10-K 1/19/2021 24.1\n31.1* Certification of Principal Executive Officer Pursuant to Rules 13a-14(a) and 15d-14(a) under the Securities Exchange Act of 1934, as Adopted Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\nX\n31.2* Certification of Principal Financial Officer Pursuant to Rules 13a-14(a) and 15d-14(a) under the Securities Exchange Act of 1934, as Adopted Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\nX\n32.1* Certification of Chief Executive Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\nX\n32.2* Certification of Chief Financial Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\nX\n101 The following financial statements from the Company's Annual Report on Form 10-K for the year ended October 31, 2022 formatted in Inline XBRL: (i) Consolidated Balance Sheets, (ii) Consolidated Statements of (Loss) Income, (iii) Consolidated Statements of Comprehensive (Loss) Income, (iv) Consolidated Statements of Changes in Equity, (v) Consolidated Statements of Cash Flows, and (vi) Notes to Consolidated Financial Statements, tagged as blocks of text and including detailed tags.\nX\n104 Cover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101) X\n# Previously filed\n+ Indicates management contract or compensatory plan.\n* These certifications are being furnished solely to accompany this annual report pursuant to 18 U.S.C. Section 1350, and are not being filed for purposes of Section 18 of the Securities Exchange Act of 1934 and are not to be incorporated by reference into any filing of the Registrant, whether made before or after the date hereof, regardless of any general incorporation language in such filing.\nItem 16. Form 10-K Summary\nNot applicable.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this annual report to be signed on its behalf by the undersigned, thereunto duly authorized, on December 22, 2022.\nMISSION PRODUCE, INC.\n/s/ Stephen J. Barnard\nStephen J. Barnard\nChief Executive Officer and Director\nPOWER OF ATTORNEY\nKNOW ALL PERSONS BY THESE PRESENTS, that each person whose signature appears below constitutes and appoints Stephen J. Barnard and Bryan E. Giles, or either of them, his or her attorneys-in-fact, each with the power of substitution, for him or her in any and all capacities, to sign any amendments to this Annual Report on Form 10-K and to file the same, with Exhibits thereto and other documents in connection therewith with the Securities and Exchange Commission, hereby ratifying and confirming all that each of said attorneys-in-fact, or substitute or substitutes may do or cause to be done by virtue hereof.\nPursuant to the requirements of the Securities Exchange Act of 1934, this annual report has been signed below on December 22, 2022, by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature\nTitle\n/s/ Stephen J. Barnard\nStephen J. Barnard Chief Executive Officer and Director (Principal Executive Officer)\n/s/ Bryan E. Giles\nBryan E. Giles\nChief Financial Officer (Principal Financial and Accounting Officer)\n/s/ Stephen A. Beebe\nSteve A. Beebe\nDirector\n/s/ Stephen W. Bershad\nStephen W. Bershad\nDirector\n/s/ Luis A. Gonzalez\nLuis A. Gonzalez\nDirector\n/s/ Bonnie C. Lind\nBonnie C. Lind\nDirector\n/s/ Jay A. Pack\nJay A. Pack\nDirector\n/s/ Bruce C. Taylor\nBruce C. Taylor\nDirector\n/s/ Linda B. Segre\nLinda B. Segre\nDirector\n/s/ Shaunte Mears-Watkins\nShaunte Mears-Watkins\nDirector\nMISSION PRODUCE, INC.\nPage\nReport of Independent Registered Public Accounting Firm (PCAOB Issued Audit Firm Identifier #34)\nConsolidated Balance Sheets\nConsolidated Statements of (Loss) Income\nConsolidated Statements of Comprehensive (Loss) Income\nConsolidated Statements of Changes in Equity\nConsolidated Statements of Cash Flows\nNotes to Consolidated Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the shareholders and the Board of Directors of Mission Produce, Inc.\nOpinion on Internal Control over Financial Reporting\nWe have audited the internal control over financial reporting of Mission Produce, Inc and subsidiaries (the Company) as of October 31, 2022, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). In our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of October 31, 2022, based on criteria established in Internal Control - Integrated Framework (2013) issued by COSO.\nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated financial statements as of and for the year ended October 31, 2022, of the Company and our report dated December 22, 2022, expressed an unqualified opinion on those financial statements and included an explanatory paragraph regarding the Companys adoption new accounting standards.\nAs described in Managements Annual Report on Internal Control Over Financial Reporting, management excluded from its assessment the internal control over financial reporting at Moruga S.A.C., which was acquired on May 1, 2022, and whose financial statements constitute 10% of total assets and 1% of revenues of the consolidated financial statement amounts as of and for the year ended October 31, 2022. Accordingly, our audit did not include the internal control over financial reporting at Moruga S.A.C.\nBasis for Opinion\nThe Companys management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Managements Annual Report on Internal Control Over Financial Reporting. Our responsibility is to express an opinion on the Companys internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. Our audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control over Financial Reporting\nA companys internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A companys internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ Deloitte & Touche LLP\nLos Angeles, California\nDecember 22, 2022\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the shareholders and the Board of Directors of Mission Produce, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Mission Produce, Inc. and subsidiaries (the \"Company\") as of October 31, 2022 and 2021, the related consolidated statements of (loss) income, comprehensive (loss) income, changes in equity, and cash flows, for each of the three years in the period ended October 31, 2022, and the related notes (collectively referred to as the \"financial statements\"). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of October 31, 2022 and 2021, and the results of its operations and its cash flows for each of the three years in the period ended October 31, 2022, in conformity with accounting principles generally accepted in the United States of America.\nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company's internal control over financial reporting as of October 31, 2022, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission and our report dated December 22, 2022, expressed an unqualified opinion on the Company's internal control over financial reporting.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current-period audit of the financial statements that was communicated or required to be communicated to the audit committee and that (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nGoodwill - Peruvian Farming Reporting Unit- Refer to Note 2 and Note 4 to the financial statements\nCritical Audit Matter Description\nThe Companys goodwill is tested annually for impairment during the fourth quarter of each year, and more frequently if events and circumstances indicate that the assets might be impaired. The Companys evaluation of goodwill for impairment involves the comparison of the fair value of each reporting unit to its carrying value.\nThe Company determines the fair value of its reporting units based upon the discounted cash flow method and the guideline publicly-traded companies method based on marketplace multiples to determine the fair value of its reporting units when it is more-likely-than-not that the fair value of a reporting unit is less than its carrying balance. The fair value determination using the discounted cash flow method requires management to make significant estimates and assumptions related to forecasts of future revenues and earnings before interest, taxes, depreciation, and amortization (EBITDA), gross margins, and the discount rate. The determination of the fair value using the public company guideline method requires management to make significant assumptions related to marketplace EBITDA multiples from within a peer public company group. The goodwill balance was $88.9 million as of July 31, 2022, of which $76.4 million was allocated to the Peruvian farming reporting unit within International Farming segment. The fair value of the Peruvian farming reporting unit was lower than its carrying value as of the measurement date, and as a result, management recorded a $49.5 million impairment charge related to the reporting unit goodwill.\nGiven the significant judgments made by management to estimate the fair value of Peruvian farming reporting unit, performing audit procedures to evaluate the reasonableness of managements estimates and assumptions related to forecasts of future revenues and EBITDA, as well as selection of the discount rate and selection of multiples applied to management's forecasted revenues and EBITDA estimates for the reporting unit, required a high degree of auditor judgment and an increased extent of effort, including the need to involve our fair value specialists.\nHow the Critical Audit Matter Was Addressed in the Audit\nOur audit procedures related to the forecasts of future revenues and EBITDA (\"forecasts\"), and the selection of the discount rate and selection of multiples applied to management's forecasted revenues and EBITDA estimates (\"market multiples\") for this reporting unit included the following, among others:\nWe tested the effectiveness of controls over management's goodwill impairment evaluation, including those over the determination of the fair value of the Peruvian farming reporting unit, such as controls related to management's forecasts and the selection of the discount rate and market multiples used.\nWe evaluated managements ability to accurately forecast by comparing actual results to managements historical forecasts.\nWe evaluated the reasonableness of management's forecasts by comparing the forecasts to (1) historical results, (2) internal communications to management, 3) inquiry with non-management personnel and (4) forecasted information included in industry reports that the reporting unit operates within.\nWith the assistance of our fair value specialists, we evaluated (1) the valuation methodologies used, (2) the marketplace multiples selected by management, and (3) the discount rate, used in determining the present value of the expected cash flows by developing a range of independent estimates and comparing those to the rate selected by management.\nWe considered the impact of changes in the industry on management's forecasts.\n/s/ Deloitte & Touche LLP\nLos Angeles, California\nDecember 22, 2022\nWe have served as the Company's auditor since 2019.\nMISSION PRODUCE, INC.\nCONSOLIDATED BALANCE SHEETS\nOctober 31,\n(In millions, except for shares) 2022 2021\nAssets\nCurrent Assets:\nCash and cash equivalents $ 52.8 $ 84.5\nRestricted cash 1.1 6.1\nAccounts receivable\nTrade, net of allowances of $0.3 and $0.2, respectively\n62.9 73.8\nGrower and fruit advances 1.8 0.6\nOther 17.3 12.3\nInventory 73.1 48.2\nPrepaid expenses and other current assets 11.1 11.6\nLoans to equity method investees - 3.3\nIncome taxes receivable 8.0 6.7\nTotal current assets 228.1 247.1\nProperty, plant and equipment, net 489.7 424.2\nOperating lease right-of-use assets 65.4 43.9\nEquity method investees 27.1 52.7\nLoans to equity method investees - 1.8\nDeferred income tax assets, net 8.1 7.6\nGoodwill 39.4 76.4\nIntangible asset, net 2.0 -\nOther assets 19.7 19.8\nTotal assets $ 879.5 $ 873.5\nLiabilities and Equity\nLiabilities\nAccounts payable $ 34.4 $ 22.8\nAccrued expenses 30.1 28.8\nIncome taxes payable 1.0 1.9\nGrower payables 24.3 22.2\nShort-term borrowings 2.5 -\nLong-term debt-current portion 3.5 8.8\nOperating leases-current portion 4.7 3.6\nFinance leases-current portion 1.2 1.1\nTotal current liabilities 101.7 89.2\nLong-term debt, net of current portion 136.9 155.1\nOperating leases, net of current portion 63.9 42.5\nFinance leases, net of current portion 1.4 2.2\nIncome taxes payable 3.1 3.5\nDeferred income tax liabilities, net 29.4 26.8\nOther long-term liabilities 20.2 20.0\nTotal liabilities 356.6 339.3\nCommitments and contingencies (Note 9)\nShareholders Equity\nCommon stock ($0.001 par value, 1,000,000,000 shares authorized; 70,669,535 and 70,631,525 shares issued and outstanding as of October 31, 2022 and 2021, respectively)\n0.1 0.1\nAdditional paid-in capital 229.3 225.6\nAccumulated other comprehensive loss (1.7) (0.5)\nRetained earnings 274.4 309.0\nMission Produce shareholders' equity 502.1 534.2\nNoncontrolling interest 20.8 -\nTotal equity 522.9 534.2\nTotal liabilities and equity $ 879.5 $ 873.5\nSee accompanying notes to consolidated financial statements.\nMISSION PRODUCE, INC.\nCONSOLIDATED STATEMENTS OF (LOSS) INCOME\nYears ended October 31,\n(In millions, except for per share amounts) 2022 2021 2020\nNet sales $ 1,045.9 $ 891.7 $ 862.3\nCost of sales 956.1 767.2 737.7\nGross profit 89.8 124.5 124.6\nSelling, general and administrative expenses 77.5 63.6 56.2\nGoodwill impairment 49.5 - -\nOperating (loss) income (37.2) 60.9 68.4\nInterest expense (5.5) (3.7) (6.7)\nEquity method income 5.1 7.5 4.0\nRemeasurement gain on acquisition of equity method investee 2.0 - -\nImpairment on equity method investment - - (21.2)\nOther income (expense), net 4.4 1.3 (0.7)\n(Loss) income before income taxes (31.2) 66.0 43.8\nProvision for income taxes 3.7 21.1 15.0\nNet (loss) income $ (34.9) $ 44.9 $ 28.8\nNet loss attributable to noncontrolling interest 0.3 - -\nNet (loss) income attributable to Mission Produce $ (34.6) $ 44.9 $ 28.8\nNet (loss) income per share attributable to Mission Produce:\nBasic $ (0.49) $ 0.64 $ 0.45\nDiluted $ (0.49) $ 0.63 $ 0.45\nSee accompanying notes to consolidated financial statements.\nMISSION PRODUCE, INC.\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE (LOSS) INCOME\nYears ended October 31,\n(In millions) 2022 2021 2020\nNet (loss) income $ (34.9) $ 44.9 $ 28.8\nOther comprehensive (loss) income, net of tax\nForeign currency translation adjustments (1.2) - (0.5)\nComprehensive (loss) income (36.1) 44.9 28.3\nComprehensive loss attributable to noncontrolling interest 0.3 - -\nComprehensive (loss) income attributable to Mission Produce $ (35.8) $ 44.9 $ 28.3\nSee accompanying notes to consolidated financial statements.\nMISSION PRODUCE, INC.\nCONSOLIDATED STATEMENTS OF CHANGES IN EQUITY\n(In millions, except for shares) Common stock\nAdditional paid-in capital Notes receivable from shareholders Accumulated other comprehensive loss Retained earnings Noncontrolling interest Total equity\nShares\nAmount\nBalance at October 31, 2019 63,386,251 $ 0.1 $ 139.7 $ (0.1) $ - $ 239.3 $ - $ 379.0\nDividends declared ($0.21 per share)\n- - - - - (13.0) - (13.0)\nIssuance of common stock in public offering, net of issuance costs 7,450,000 - 78.1 - - - - 78.1\nIssuance of common stock 7,921 - 0.1 - - - - 0.1\nStock-based compensation - - 4.6 - - - - 4.6\nReclassification of liability-based awards - - 0.3 - - - - 0.3\nExercise of stock options 17,000 - - - - - - -\nPurchase and retirement of stock (310,250) - - - - (3.9) - (3.9)\nNet income - - - - - 28.8 - 28.8\nOther comprehensive loss - - - - (0.5) - - (0.5)\nBalance at October 31, 2020 70,550,922 $ 0.1 $ 222.8 $ (0.1) $ (0.5) $ 251.2 $ - $ 473.5\nExercise of stock options 22,272 - 0.2 - - - - 0.2\nIssuance of common stock for equity awards 58,331 - - - - - - -\nStock-based compensation - - 2.6 - - - - 2.6\nRepayment of stock option notes receivable - - - 0.1 - - - 0.1\nNet income - - - - - 44.9 - 44.9\nCumulative effect of change in tax accounting principle(1)\n- - - - - 12.9 - 12.9\nBalance at October 31, 2021 70,631,525 $ 0.1 $ 225.6 $ - $ (0.5) $ 309.0 $ - $ 534.2\nStock-based compensation - - 3.6 - - - - 3.6\nIssuance of common stock for equity awards 38,010 - 0.1 - - - - 0.1\nNet (loss) income - - - - - (34.6) (0.3) (34.9)\nAcquired noncontrolling interest - - - - - - 20.2 20.2\nContributions from noncontrolling interest holders - - - - - - 0.9 0.9\nOther comprehensive loss - - - - (1.2) - - (1.2)\nBalance at October 31, 2022 70,669,535 $ 0.1 $ 229.3 $ - $ (1.7) $ 274.4 $ 20.8 $ 522.9\n(1)Related to the adoption of income tax guidance ASU 2019-12, wherein we derecognized a deferred tax liability against retained earnings.\nSee accompanying notes to consolidated financial statements.\nMISSION PRODUCE, INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nYears ended October 31,\n(In millions) 2022 2021 2020\nOperating Activities\nNet (loss) income $ (34.9) $ 44.9 $ 28.8\nAdjustments to reconcile net (loss) income to net cash provided by operating activities\nProvision for losses on accounts receivable 0.1 - 0.2\nDepreciation and amortization 24.8 20.4 18.1\nAmortization of debt issuance costs 0.3 0.3 0.3\nEquity method income (5.1) (7.5) (4.0)\nNoncash lease expense 5.3 4.3 -\nStock-based compensation 3.6 2.6 5.0\nDividends received from equity method investees 2.2 1.7 1.7\nLosses (gains) on asset impairment, disposals and sales, net of insurance recoveries 0.4 0.1 0.5\nDeferred income taxes (0.6) 8.8 (1.0)\nGoodwill impairment 49.5 - -\nRemeasurement gain on acquisition of equity method investee (2.0) - -\nImpairment on equity method investment - - 21.2\nUnrealized (gains) losses on derivative financial instruments (4.7) (0.8) 2.8\nOther 0.1 (0.1) (2.6)\nEffect on cash of changes in operating assets and liabilities, net of acquisition:\nTrade accounts receivable 10.6 (16.4) 10.3\nGrower fruit advances (1.2) 0.8 2.3\nOther receivables (2.4) 2.6 (3.8)\nInventory (15.3) (11.2) 5.9\nPrepaid expenses and other current assets (0.4) (2.5) (2.0)\nIncome taxes receivable (1.1) (3.8) (0.4)\nOther assets 0.2 (3.5) (4.2)\nAccounts payable and accrued expenses 9.4 8.9 8.2\nIncome taxes payable (1.3) (0.1) (1.9)\nGrower payables 2.2 3.4 (8.6)\nOperating lease liabilities (4.0) (3.2) -\nOther long-term liabilities (0.5) (2.7) 2.1\nNet cash provided by operating activities $ 35.2 $ 47.0 $ 78.9\nInvesting Activities\nPurchases of property and equipment (61.2) (73.4) (67.3)\nProceeds from sale of property, plant and equipment 3.0 2.4 3.0\nInsurance proceeds for the replacement of property, plant and equipment - 1.1 -\nCash acquired in consolidation of Moruga 4.3 - -\nInvestment in equity method investees (0.4) (0.2) (3.4)\nLoans to equity method investees - (2.0) -\nLoan repayments from equity method investees 3.0 1.5 -\nOther (0.1) 0.3 -\nNet cash used in investing activities $ (51.4) $ (70.3) $ (67.7)\nFinancing Activities\nBorrowings on revolving credit facility 80.0 - 14.0\nPayments on revolving credit facility (40.0) - (14.0)\nShort-term borrowings 2.5 - -\nPrincipal payments on long-term debt obligations (63.3) (10.5) (6.3)\nPrincipal payments on finance lease obligations (1.2) (1.2) (0.9)\nPayments for long-term supplier financing - - (5.8)\nExercise of stock options 0.1 0.2 -\nRepayment of stock option notes receivable - 0.1 0.1\nPayment of debt issuance or extinguishment fees (0.8) (0.1) (0.2)\nPurchase and retirement of stock - - (1.9)\nProceeds from issuance of common stock in public offering, net of issuance costs - - 78.1\nDividends paid - - (13.0)\nYears ended October 31,\n(In millions) 2022 2021 2020\nContributions from noncontrolling interest holders 0.9 - -\nNet cash (used in) provided by financing activities $ (21.8) $ (11.5) $ 50.1\nEffect of exchange rate changes on cash (0.3) - 0.1\nNet (decrease) increase in cash, cash equivalents and restricted cash (38.3) (34.8) 61.4\nCash, cash equivalents and restricted cash, beginning of period 92.2 127.0 65.6\nCash, cash equivalents and restricted cash, end of period $ 53.9 $ 92.2 $ 127.0\nSummary of cash, cash equivalents and restricted cash reported within the consolidated balance sheets:\nCash and cash equivalents $ 52.8 $ 84.5 $ 124.0\nRestricted cash 1.1 6.1 1.4\nRestricted cash included in other assets - 1.6 1.6\nTotal cash, cash equivalents, and restricted cash shown in the consolidated statements of cash flows $ 53.9 $ 92.2 $ 127.0\nCash paid during the year for:\nInterest $ 5.7 $ 4.3 $ 6.3\nIncome taxes 6.2 14.8 18.5\nNon-cash investing and financing activities:\nProperty, plant and equipment included in liabilities 7.6 3.4 4.0\nAdvances for property, plant and equipment included in assets 2.1 1.4 -\nElimination of loan receivable from Moruga upon consolidation (Note 3) 1.9 - -\nFinance leases for equipment and machinery 0.5 - -\nCommon stock issued in lieu of compensation 7,921 shares issued in 2020)\n- - 0.1\nSee accompanying notes to consolidated financial statements.\nMISSION PRODUCE, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n1. Nature of Business\nMission Produce, Inc. together with its consolidated subsidiaries (Mission, the Company, we, us or our), is a global leader in the avocado industry. The Companys expertise lies in the farming, packaging, marketing and distribution of avocados to food retailers, distributors and produce wholesalers worldwide. The Company procures avocados principally from California, Mexico and Peru. Through our various operating facilities, we grow, sort, pack, bag and ripen avocados and a small amount of other fruits for distribution to domestic and international markets. We report our results of operations in three reportable segments which are also equivalent to operating segments: Marketing and Distribution, International Farming and Blueberries (see Note 15).\n2. Summary of Significant Accounting Policies\nBasis of presentation and consolidation\nThe accompanying consolidated financial statements include the accounts of the Company, its consolidated subsidiaries and variable interest entity (VIE) for which we are the primary beneficiary and have a controlling interest. The consolidated financial statements have been prepared in accordance with accounting principles generally accepted in the United States (U.S. GAAP). All intercompany balances have been eliminated in consolidation.\nConsolidation of VIE\nOn May 1, 2022, a reconsideration event (explained in Note 3) occurred related to Moruga S.A.C., an entity for which we have a 60% equity ownership interest. Moruga S.A.C. is a holding company with one wholly owned subsidiary Blueberries Peru, S.A.C. (collectively referred to as Moruga). Moruga was previously accounted for under the equity method of accounting, where investments are stated at initial cost and adjusted for subsequent additional investments and our proportionate share of earnings or losses and distributions. As a result of the reconsideration event, we concluded that Moruga is a VIE, and that the Company is the primary beneficiary with a controlling financial interest. Based on this conclusion, Moruga was prospectively consolidated on May 1, 2022.\nUse of estimates\nThe preparation of the consolidated financial statements in conformity with U.S. GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the consolidated financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates.\nCash, cash equivalents and restricted cash\nThe Company considers all highly liquid instruments with an original maturity of three months or less and money market mutual funds to be cash equivalents. The carrying amounts of cash and cash equivalents approximate their fair values.\nRestricted cash represents cash and cash equivalents that are restricted to withdrawal or use as of the reporting date under contractual terms or regulatory requirements. As of October 31, 2022 and 2021, the restricted cash balance related to statutory requirements to support various programs at the Companys farms. Restricted cash is included with cash and cash equivalents when reconciling the beginning-of-period and end-of-period total amounts shown on the statements of cash flows.\nTrade accounts receivable\nTrade accounts receivable are reported at amounts due from customers, net of an allowance for doubtful accounts. The Company maintains an allowance for doubtful accounts to reflect its estimate of the uncollectability of the trade accounts receivable based on past collection history, the identification of specific potential customer risks, and other factors.\nGrower and fruit advances\nThe Company makes advances to growers and foreign suppliers who supply fruit to the Company. Such advances reduce amounts otherwise due to the growers or suppliers for fruit sales.\nMISSION PRODUCE, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nOther accounts receivable\nOther accounts receivable represent non-trade receivables and primarily consist of value-added taxes (VAT) collected on behalf of tax authorities. VAT included in other accounts receivable was $14.4 million and $11.0 million as of October 31, 2022 and 2021, respectively.\nInventory\nInventories are recorded at the lower of cost or net realizable value using the first-in, first-out method for finished goods and raw materials. Net realizable value is the estimated selling price in the ordinary course of business, less reasonably predictable costs of completion, disposal, and transportation.\nCrop growing costs are valued at the lower of cost or net realizable value and are deferred and charged to cost of goods sold when the related crop is harvested and sold. The deferred crop growing costs included in inventory consist primarily of orchard maintenance costs such as cultivation, irrigation, fertilization, soil amendments, pest control and pruning.\nWe assess the recoverability of inventories through an ongoing review of inventory levels in relation to sales and forecasts and product marketing plans. When the inventory on hand, at the time of review, exceeds the foreseeable demand, the value of inventory that is not expected to be sold is written down. The amount of the write-down is the excess of historical cost over estimated net realizable value. Once established, these write-downs are considered permanent adjustments to the cost basis of the excess inventory.\nThe assessment of the recoverability of inventories and the amounts of any write-downs are based on currently available information and assumptions about future demand and market conditions. Demand for avocados and other fruit may fluctuate significantly over time, and actual demand and market conditions may be more or less favorable than our projections. In the event that actual demand is lower than originally projected, additional inventory write-downs may be required.\nProperty, plant and equipment, net\nProperty, plant and equipment, net is stated at cost, net of accumulated depreciation. Depreciation is computed using the straight-line method using rates based upon the estimated useful lives of the related assets. Orchards, trees and bushes refer to avocado, mangos and blueberry plants, which accumulate planting and development costs that are capitalized into their basis until they become commercially productive, at which point the asset begins depreciating, and future maintenance costs are expensed as incurred. If proceeds are obtained from sales of fruit before commercial production begins, the net proceeds are applied to the capitalized cost of the trees. Planting costs consist primarily of the costs to purchase and plant nursery stock. Development costs consist of cultivation, pruning, irrigation, labor, spraying and fertilization, and interest costs during the development period. Leased equipment and leasehold improvements meeting certain criteria are capitalized and amortized over the shorter of the expected lease term or the useful life of the asset using the straight-line method.\nOctober 31,\n(In millions) Useful lives 2022 2021\nLand $ 141.4 $ 128.8\nOrchards/trees/bushes 7 to 25 years\n102.0 62.6\nBuildings and improvements 20 to 40 years\n120.1 110.9\nEquipment 3 to 20 years\n201.1 177.2\nConstruction-in-progress 47.0 43.2\nProperty, plant and equipment $ 611.6 $ 522.8\nAccumulated depreciation (121.9) (98.6)\nProperty, plant and equipment, net $ 489.7 $ 424.2\nDepreciation expense of property, plant and equipment, net was $24.0 million, $20.4 million, and $18.1 million for the years ended October 31, 2022, 2021 and 2020, respectively.\nAs of October 31, 2021, $2.7 million of property, plant and equipment, net was held for sale and classified in prepaid and other current assets in the consolidated balance sheets, and was sold during fiscal year 2022 for $2.9 million.\nMISSION PRODUCE, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFarming costs for nonproductive orchards\nWe lease land for the development of new orchards. During the development period, these costs are referred to as farming costs for nonproductive orchards and are expensed as incurred, and included in cost of sales in the consolidated statements of (loss) income.\nLeases\nWe determine if an arrangement is or contains a lease at inception or modification of the arrangement. An arrangement is or contains a lease if there are identified assets and the right to control the use of an identified asset is conveyed for a period in exchange for consideration. Control over the use of the identified assets means the lessee has both the right to obtain substantially all of the economic benefits from the use of the asset and the right to direct the use of the asset.\nFor leases where we are the lessee, we recognize the right-of-use (ROU) assets and lease liabilities for all leases other than those with a term of 12 months or less, as we have elected to apply the short-term lease recognition exemption. ROU assets represent our right to use an underlying asset for the lease term. Lease liabilities represent our obligation to make lease payments arising from the lease. ROU assets and lease liabilities are classified and recognized at the commencement date of a lease. Lease liabilities are measured based on the present value of fixed lease payments over the lease term. ROU assets consist of: (i) initial measurement of the lease liability; (ii) lease payments made to the lessor at or before the commencement date less any lease incentives received; and (iii) initial direct costs incurred by us. Lease payments may vary because of changes in facts or circumstances occurring after the commencement, including changes in inflation indices. Variable lease payments are excluded from the measurement of ROU assets and lease liabilities and are recognized in the period in which the obligation for those payments is incurred.\nThe discount rate used to determine the present value of the lease payments is the rate of interest that the Company would have to pay to borrow on a collateralized basis over a similar term for an amount equal to the lease payments in a similar economic environment.\nFor income statement purposes, we recognize straight-line rent expense for operating leases. For finance leases, we recognize interest expense associated with the lease liability and depreciation expense associated with the ROU asset. For ROU assets held under finance leases and leasehold improvements, the estimated useful lives are limited to the shorter of the useful life of the asset or the term of the lease.\nMany of our lease arrangements include options to extend the lease, which we do not include in the lease term unless we are reasonably certain to exercise it. We have lease arrangements with lease and non-lease components. From a lessee perspective, we have elected to apply the practical expedient to combine lease and related non-lease components, for all classes of underlying assets, and account for the combined contract as a lease component.\nEquity method investees\nWe maintain investments in other fruit growers, packers and distributors. These investments are accounted for under the equity method of accounting when we have the ability to exercise significant influence, but not control, over the investee. Significant influence generally exists when we have an ownership interest representing between 20% and 50% of the voting stock of the investee. Under the equity method of accounting, investments are stated at initial cost and are adjusted for subsequent additional investments and our proportionate share of earnings or losses and distributions.\nWe review our investments for other-than temporary-impairment (OTTI) on a quarterly basis, or earlier if indicators of impairment arise. If an impairment of an equity method investment is determined to be other than temporary, we would record OTTI sufficient to reduce the investments carrying value to its fair value, which results in a new cost basis in the investment. There was no OTTI identified in the years ended October 31, 2022 and 2021 that would have required us to test for impairment.\nDuring fiscal year 2020, industry-wide production information regarding the 2019-2020 blueberry harvest in Peru became available, indicating that there is greater competition and expansion by competitors than what we were previously expecting. We believed that the increase in supply due to expansion would result in a reduction in pricing over the long-term. As a result of this factor, among others, management lowered its long-term revenue and profitability forecasts of Moruga during the second quarter of 2020 and concluded that the reduction in the forecasted revenues was an indicator of impairment. As a result, management tested its investment in Moruga for impairment and concluded that the estimated fair value of the investment in Moruga was less than the carrying value of the investment. Due to the change in long-term pricing and revenue expectations, management concluded that the impairment is other-than-temporary and recorded an impairment charge of $21.2 million in the year ended October 31, 2020.\nMISSION PRODUCE, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nLong-lived assets\nThe Company evaluates its long-lived assets for impairment whenever events or changes in circumstances indicate that the carrying amount of any such asset may not be recoverable. Long-lived assets are assessed for impairment by comparing the carrying amount of an asset to future undiscounted net cash flows expected to be generated from the use of the asset and its eventual disposition. If the future undiscounted net cash flows are less than the carrying amount of the asset being tested, an impairment is recorded for the difference between the carrying amount of the asset and the estimated fair value of the asset. The estimate of undiscounted cash flows is based upon, among other things, certain assumptions about future operating performance, growth rates and other factors. Estimates of undiscounted cash flows may differ from actual cash flows due to, among other things, technological changes, economic conditions, changes to the business model or changes in operating performance. In the fourth quarter of 2022, the Company determined that there was an impairment indicator associated with our Peruvian farming operations asset group, however the undiscounted cash flows of the asset group exceeded its carrying value. For fiscal years 2021 and 2020, we did not identify any indicators of impairment that would have required the Company to test its long-lived assets for impairment.\nGoodwill\nOur goodwill represents the excess of the purchase price of business combinations over the fair value of the net assets acquired. Goodwill impairment testing requires significant judgment and management estimates, including, but not limited to, the determination of (i) the number of reporting units, (ii) the goodwill and other assets and liabilities to be allocated to the reporting units and (iii) the fair values of the reporting units. The estimates and assumptions described above, along with other factors such as discount rates, will significantly affect the outcome of the impairment tests and the amounts of any resulting impairment losses. We perform a qualitative assessment of goodwill for impairment on an annual basis during the fourth quarter of each year, and between annual tests whenever events or changes in circumstances indicate that the carrying amount may not be recoverable. If qualitative factors were to indicate that it is more-likely-than-not that the fair value of the reporting unit is less than its carrying value, we would then perform a quantitative assessment, which would consist primarily of a discounted cash flow (DCF) analysis and guideline publicly-traded companies (GPC) analysis to determine the fair value of the reporting unit. To the extent the carrying amount of the reporting unit exceeds its fair value, we recognize an impairment of goodwill for the excess up to the amount of goodwill of that reporting unit. Refer to Note 4 for more information.\nFair value of financial instruments\nThe Company applies the provisions of Accounting Standards Codification (ASC) 820, Fair Value Measurements, for fair value measurements of financial assets and financial liabilities and for fair value measurements of nonfinancial items that are recognized at fair value in the financial statements. Fair value is defined as the price that would be received when selling an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. In determining the fair value for the assets and liabilities required or permitted to be recorded, the Company considers the principal or most advantageous market in which it would transact, and it considers assumptions that market participants would use when pricing the asset or liability.\nASC 820 establishes a fair value hierarchy that requires an entity to maximize the use of observable inputs and minimize the use of unobservable inputs when measuring fair value. The framework has three levels of inputs that may be used to measure fair value, giving the highest priority to unadjusted quoted prices in active markets for identical assets or liabilities (Level 1 measurements) and the lowest priority to measurements involving significant unobservable inputs (Level 3 measurements). The three levels of the fair value hierarchy are as follows:\nLevel 1: Unadjusted quoted prices in active markets that are accessible at the measurement date for identical, unrestricted assets or liabilities;\nLevel 2: Quoted prices, other than those in Level 1, in markets that are not active or for similar assets and liabilities, or inputs that are observable, either directly or indirectly, for substantially the full term of the asset or liability;\nLevel 3: Prices or valuation techniques that require inputs that are both significant to the fair value measurement and unobservable (supported by little or no market activity).\nThere were no transfers between level 1, level 2 or level 3 measurements during the years ended October 31, 2022 and 2021.\nWe believe that the carrying amounts of cash and cash equivalents, accounts receivable, accounts payable, accrued expenses and short-term borrowings approximates fair value based on either their short-term nature or on terms currently available to the Company in financial markets. Due to current market rates, we believe that our long-term obligations have fair values that approximate carrying values. Refer to Note 12 for further information.\nMISSION PRODUCE, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nInterest rate swaps\nThe Company has four separate interest rate swaps with a total notional amount of $100 million to hedge changes in variable interest rates on the principal value of the Companys term loans. The interest rate swaps carry fixed LIBOR rates ranging from 1.75% to 2.57%. We account for the interest rate swaps in accordance with ASC 815, Derivatives and Hedging, as amended, which requires the recognition of all derivative instruments as either assets or liabilities in the consolidated balance sheets and measurement of those instruments at fair value. The Company has not designated the interest rate swaps as cash flow hedges, and as a result under the accounting guidance, changes in the fair value of the interest rate swaps have been recorded in other income (expense), net in the consolidated statements of (loss) income and changes in the asset or liability are presented in net cash provided by operating activities in the consolidated statements of cash flow. Refer to Note 12 for more details.\nRevenue recognition\nWe recognize revenue according to the model under ASC 606, which requires the recognition of revenue when performance obligations to customers have been satisfied in amounts equal to the consideration to which we expect to be entitled.\nFor our customer contracts, we identify the performance obligations (products or services), determine the transaction price, allocate the contract transaction price to the performance obligations, and recognize the revenue when the performance obligation is fulfilled, which is when the product is shipped to or received by the customer, depending on the specific terms of the arrangement. Our revenues are recorded at a point in time. Revenue recognized from product sales is based primarily on purchase orders issued by customers which specify shipping terms and details of the transaction. The performance obligations in a given transaction are determined by the individual purchase orders with revenue recognized at the time that the performance obligations have been satisfied. Shipping and handling activities that occur prior to the transfer of control of goods to the customer are treated as fulfillment activities related to the promise to transfer goods, rather than as performance obligations. Amounts collected from customers for sales and other similar taxes are excluded from the transaction price.\nMost performance obligations are subject to customer acceptance. However, our customers have an implicit and explicit right to return products following acceptance, if they are found not to conform to the specifications generally agreed upon or detailed in the individual purchase orders. We evaluate the need for provisions related to product return allowances based on estimates and record such provisions as a reduction in revenue in the same period that revenue for the related transactions is recognized.\nWe routinely enter into consignment arrangements to purchase avocados from foreign suppliers in which we do not take legal title of the good prior to selling those goods to customers. The Company has evaluated its role in such transactions and has concluded that it has control of the products due to our ability to determine the sales price and our role as the primary obligor in the transactions with the end customer. As a result, we are deemed to act as the principle rather than the agent, and therefore recognize and report revenue on a gross basis for its consignment arrangements.\nStock-based compensation\nThe Company uses the fair value recognition method for accounting for stock-based compensation. Under the fair value recognition method, cost is measured at the grant date based on the fair value of the award and is recognized as expense on the straight-line basis over the requisite service period, which is generally the vesting period. When vesting is based on the occurrence of certain defined liquidity events, expense relative to such awards is measured based on the grant date fair value of the award and is recorded when the event occurs. Forfeitures are recognized in the period they occur.\nThe fair value of stock options is estimated as of the date of grant using the Black-Scholes option model, which requires various inputs, including volatility, risk-free interest rate, and the estimated life of the option term. See Note 11 for more information. The fair value of restricted stock units (RSUs) and performance stock units (PSUs) is determined based on the market price of our common stock on the date of grant.\nAdvertising costs\nAdvertising costs are expensed when incurred and are included as a component of selling, general and administrative expense. Such costs were $0.3 million for the years ended October 31, 2022 and 2021, and $0.4 million for the year ended October 31, 2020.\nEmployee benefits\nEligible employees of the Company may participate in a 401(k)-retirement plan, whereby employees may elect to make contributions pursuant to a salary reduction agreement upon meeting age and length-of-service requirements. Employees can defer up to 60% of their compensation subject to fixed annual limits. The Company makes a 100% matching contribution on deferrals up to 3%, and\nMISSION PRODUCE, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n50% on deferrals over 3% up to 5%. Total contributions made by the Company were $0.9 million for the years ended October 31, 2022 and 2021, and $0.7 million for the year ended October 31, 2020.\nIncome taxes\nThe Company uses the liability method to account for income taxes as prescribed by ASC 740. Deferred tax assets and liabilities are determined based on the difference between the financial statement and tax bases of assets and liabilities as measured by the enacted tax rates which will be in effect when these differences reverse. Deferred tax expense (benefit) is the result of changes in deferred tax assets and liabilities. Deferred income tax assets and liabilities are adjusted to recognize the effects of changes in tax laws or enacted tax rates in the period during which they are signed into law. The factors used to assess the Companys ability to realize its deferred tax assets are the Companys forecast of future taxable income and available tax planning strategies that could be implemented. Under ASC 740 a valuation allowance is required when it is more likely than not that all or some portion of the deferred tax assets will not be realized due to the inability to generate sufficient future taxable income of the correct character. Failure to achieve previous forecasted taxable income could affect the ultimate realization of deferred tax assets and could negatively impact the Companys effective tax rate on future earnings.\nWe recognize the tax benefit from an uncertain tax position only if it is more likely than not that the tax position will be sustained on examination by the taxing authorities, based on the technical merits of the position. The tax benefits recognized in the financial statements from such a position should be measured based on the largest benefit that has a greater than 50% likelihood of being realized upon ultimate settlement.\nAs a multinational corporation, we are subject to taxation in many jurisdictions, and the calculation of our tax liabilities involves dealing with uncertainties in the application of complex tax laws and regulations in various taxing jurisdictions. If we ultimately determine that the payment of these liabilities will be unnecessary, the liability will be reversed, and we will recognize a tax benefit during the period in which it is determined the liability no longer applies. Conversely, we record additional tax charges in a period in which it is determined that a recorded tax liability is less than the ultimate assessment is expected to be.\nThe application of tax laws and regulations is subject to legal and factual interpretation, judgment and uncertainty. Tax laws and regulations themselves are subject to change as a result of changes in fiscal policy, changes in legislation, the evolution of regulations and court rulings. Therefore, the actual liability for U.S. or foreign taxes may be materially different from managements estimates, which could result in the need to record additional tax liabilities or potentially reverse previously recorded tax liabilities.\nForeign currency translation and remeasurement\nOur foreign operations are subject to exchange rate fluctuations and foreign currency transaction costs. The functional currency for substantially all of our foreign subsidiaries is the United States dollar. When remeasuring from a local currency to the functional currency, monetary assets and liabilities are remeasured into U.S. dollars at exchange rates in effect at the balance sheet dates and non-monetary assets, liabilities and equity are remeasured at historical rates when remeasuring from a local currency to the functional currency. Sales and expenses are remeasured using weighted-average exchange rates for each period. Gains and losses resulting from foreign currency transactions are recognized in other income (expense), net in the consolidated statements of (loss) income.\nEarnings per share\nWe compute earnings per share (EPS) in accordance with ASC 260, which requires companies with complex capital structures to present basic and diluted EPS. Basic EPS is measured as net income attributable to us, divided by the weighted average shares outstanding during the period. Diluted EPS is similar to basic EPS but presents the dilutive effect on a per share basis of contracts to issue shares (e.g., equity awards) as if they had been converted at the beginning of the periods presented, or issuance date, if later. The computation of diluted EPS includes the estimated impact of the exercise of contracts to purchase common stock using the treasury stock method. Potential shares that have an anti-dilutive effect (i.e., those that increase earnings per share or decrease loss per share) are excluded from the calculation of diluted EPS.\nRisk concentration\nAccounts receivable from three single customers each represented 13%, 12% and 11% of trade accounts receivables, net of allowance, as of October 31, 2022. Accounts receivable from these same three customers each represented 7%, 8%, and 13%, respectively, as of October 31, 2021.\nSales to our top 10 customers amounted to approximately 59% of net sales for both years ended October 31, 2022 and 2021, and approximately 64% for the year ended October 31, 2020. For the year ended October 31, 2022, one single customer represented 13% of net sales. For the year ended October 31, 2021, no single customer represented more than 10% of net sales. For the year ended October 31, 2020, two single customers represented 12% and 10% of net sales, respectively. All of these customers were from our\nMISSION PRODUCE, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nMarketing and Distribution segment. Substantially all sales generated by our Blueberries segment are from a single customer with which we have an exclusive marketing agreement with.\nRecently issued accounting standards\nIn September 2022, the Financial Accounting Standards Board (FASB) issued Accounting Standards Update (ASU) 2022-04, Liabilities-Supplier Finance Programs (Topic 405), which among other things, requires certain disclosures for a buyer in a supplier finance program. Some of the amendments in this ASU are required to be adopted for fiscal years beginning after December 15, 2022, including interim periods within those fiscal years, and others are required to be adopted for fiscal years beginning after December 15, 2023. Early adoption is permitted. We are currently evaluating the impact of adoption on our financial disclosures.\nIn March 2022, the FASB issued ASU, Financial Instruments-Credit Losses (Topic 326) Troubled Debt Restructurings and Vintage Disclosures, which among other things, requires that entities disclose current-period gross write-offs by year of origination for financing receivables. The amendments in this ASU are required to be adopted for fiscal years beginning after December 15, 2022, including interim periods within those fiscal years. The impact of ASU 2022-02 is not expected to be material on our financial condition, results of operations and cash flows.\n3. Business Combination\nThe Company owns a 60% equity interest in Moruga, which was established in 2014 when it began small-scale blueberry plantings in Peru. Since inception, Moruga has expanded to approximately 900 productive acres. On May 1, 2022, the shareholders of Moruga amended and restated its shareholders agreement (the Amendment), wherein certain supermajority requirements that previously prevented the Company from directing the primary activities of Moruga were removed. In connection with the Amendment, shareholders approved a new capital project to farm approximately 1,500 additional acres of blueberries in the Olmos region of Peru. Blueberries produced will be marketed through an agreement which gives exclusive marketing rights to a minority shareholder. The new capital project is anticipated to require a total investment of approximately $50 million, the majority of which will be funded by cash flow generated by Moruga and supplemented by pro-rata shareholder contributions based on each shareholders respective ownership interest.\nThe Amendment resulted in the consolidation of Moruga because the Company concluded that that Moruga was a VIE, and the Company could control the primary activities of Moruga and is the primary beneficiary of the entity. Upon consolidation, Moruga was accounted for using the acquisition method of accounting. In relation to our preexisting equity interest, we recognized a remeasurement gain of $2.0 million, calculated as the difference between our 60% investment carrying value of $28.2 million and its acquisition date fair value of $30.2 million.\nPreliminary fair value allocation of Moruga\nThe fair value of Moruga is a Level 3 measurement in the fair value hierarchy. Management estimated the fair value of Moruga with the assistance of a third-party valuation specialist, using a combination of the GPC method under the market approach and the DCF method under the income approach. We applied an equal weighting to the value conclusions resulting from the two employed approaches, because there was sufficient information available to estimate fair value under both methods.\nUnder the GPC method, valuation multiples are calculated from the operating data and market metrics of the GPCs, and are then evaluated and adjusted based on the strengths and weaknesses of the entity relative to the comparable GPCs. The significant inputs used to estimate the fair value of the investment under the GPC method are the selected business enterprise value (BEV) to EBITDA multiple and BEV to revenue multiple. Of the derived multiples, we selected 8.0x for BEV to EBITDA and 1.1x for BEV to revenue. The mean and median multiples of the GPCs were 9.1x and 9.2x for BEV to EBITDA, respectively, and 1.1x and 0.7x for BEV to revenue, respectively.\nUnder the DCF method, the most significant inputs used to estimate the fair value are the cash flow projections, which are sensitive to the revenue projections, and the weighted average cost of capital (\"WACC) which is used to discount and present value the projected cash flows. For the revenue projections, we assumed a nearly flat annual growth rate based on the maturity of the existing blueberry plants for the discrete forecast period from 2023 to 2032, prior to reaching the terminal period. The WACC was estimated using a capital asset pricing model and the discount rate used to present value the future cash flows was 9%.\nGoodwill represents the excess of the sum of the fair value of our previously held equity interest and the fair value of the noncontrolling interest, over the net of the acquisition-date values of the identifiable assets and liabilities assumed. The goodwill is attributable to our expected ability to utilize our existing infrastructure and workforce in Peru during the complementary periods between avocado harvest and processing seasons. The goodwill recognized is not expected to be deductible for income tax purposes.\nMISSION PRODUCE, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nThe allocation of the fair value of Moruga as of the acquisition date is preliminary and subject to change within the allowable measurement period from the acquisition date, primarily for the calculation of deferred taxes. Amounts of identifiable assets acquired and liabilities assumed as of the acquisition date were as follows:\n(In millions)\nFair value of 100% of Moruga\n$ 50.4\nRecognized amounts of identifiable assets acquired and liabilities assumed:\nInventory 7.7\nOther current assets 7.7\nProperty, plant and equipment 29.6\nIntangible asset 2.8\nOther assets 5.6\nGoodwill 12.5\nCurrent liabilities (4.5)\nDeferred tax liability (3.0)\nOther liabilities (8.0)\n$ 50.4\nThe fair value of the noncontrolling interest in Moruga on the acquisition date was $20.2 million.\n4. Goodwill and Intangible Asset, net\nGoodwill\nChanges in the net carrying amount of goodwill by reportable segment were as follows:\n(In millions) International Farming Blueberries Total\nGoodwill as of October 31, 2021\n$ 76.4 $ - $ 76.4\nBusiness combination with Moruga (Note 3)\n- 12.5 12.5\nImpairment (49.5) - (49.5)\nGoodwill as of October 31, 2022\n$ 26.9 $ 12.5 $ 39.4\nDuring the fourth quarter of fiscal 2022, management performed its annual goodwill impairment test on its Peruvian farming reporting unit within the International Farming segment. With the assistance of a third-party specialist, management performed a quantitative assessment of the fair value of the reporting unit using the GPC and DCF methods described above in Note 3. We applied an equal weighting to the value conclusions resulting from the two employed approaches, because there was sufficient information to estimate the fair value of the reporting unit under both methods. The selected BEV to EBITDA multiple used in the GPC method was 12.0x for the first forecast year and 8.0x for the second forecast year. The mean and median BEV to EBITDA multiples of GPCs were 10.0x and 8.8x, respectively. The discount rate used in the DCF model was 17.5%, which reflects a significant increase in the WACC due to recent rising interest rates. In addition, forecasted cash flows have been negatively impacted by tax law repealing tax benefits to agribusiness entities in Peru. Peruvian corporate tax rates will increase from the current rate of 15% to 29.5% by calendar year 2028. When forecasting cash flows during the fourth quarter of 2022, production and sales information regarding the 2022 avocado harvest in Peru became available, along with information on the impact of inflationary pressures on the Peruvian farming cost structure, lowering managements profitability forecasts for the reporting unit. As a result of the valuations performed, management concluded that the fair value of the reporting unit was lower than its carrying value by $49.5 million, which was recorded as an impairment charge to goodwill in the consolidated statements of (loss) income. In the Blueberries segment, there were no indicators of impairment to the blueberries reporting unit following the recording of goodwill in the third quarter of fiscal 2022.\nThe result of our annual impairment assessment for the years ended October 31, 2021 and 2020 indicated that it was more likely than not that the fair value of our reporting units goodwill had exceeded its carrying value and accordingly, no impairment was recognized.\nMISSION PRODUCE, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIntangible asset, net\nOctober 31,\n(In millions) 2022 2021\nIntangible asset, gross $ 2.8 $ -\nAccumulated amortization (0.8) -\nIntangible asset, net $ 2.0 $ -\nThe intangible asset, net consists of a distributor relationship entirely attributed to the business combination with Moruga on May 1, 2022 (see Note 3). The intangible asset has an amortizable life of 2 years, to be recognized in selling, general and administrative expenses coinciding with the timing of the estimated revenues. Amortization expense was $0.8 million for year ended October 31, 2022. The remaining amortization expense is expected to be recognized as follows:\nYears Ending October 31,\n(In millions) 2023 2024\nEstimated annual amortization expense $ 1.5 $ 0.5\n5. Details of Certain Account Balances\nDetails of certain of our significant account balances in our consolidated financial statements are included below.\nInventory\nOctober 31,\n(In millions) 2022 2021\nFinished goods $ 33.8 $ 22.5\nCrop growing costs 19.5 11.9\nPackaging and supplies 19.8 13.8\nInventory $ 73.1 $ 48.2\nInventory at October 31, 2022 included a $0.7 million adjustment to increase inventories recognized in the business combination with Moruga to their fair value as of May 1, 2022. These inventories, including the fair value adjustment, will be recognized in cost of sales as the underlying inventories are sold. Refer also to Note 3 for more information.\nAccrued expenses\nOctober 31,\n(In millions) 2022 2021\nEmployee-related $ 16.3 $ 14.6\nFreight 6.2 3.9\nOutside fruit purchase 1.0 2.2\nVAT and local taxes payable 0.1 1.0\nLegal settlement 0.8 0.8\nInterest rate swaps - 2.1\nConstruction-in-progress - 0.2\nOther 5.7 4.0\nAccrued expenses $ 30.1 $ 28.8\nMISSION PRODUCE, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nOther long-term liabilities\nOctober 31,\n(In millions) 2022 2021\nUncertain tax positions $ 17.1 $ 15.7\nEmployee-related 1.2 1.6\nInterest rate swaps - 1.4\nOther 1.9 1.3\nOther long-term liabilities $ 20.2 $ 20.0\nOther income (expense), net\nYears ended October 31,\n(In millions) 2022 2021 2020\nNet gains (losses) on derivative financial instruments $ 4.7 $ 0.8 $ (4.2)\nForeign currency transaction (loss) gain, net (2.0) (1.6) 1.3\nInterest income 1.7 1.7 2.4\nDebt extinguishment costs - (0.1) -\nOther - 0.5 (0.2)\nOther income (expense), net $ 4.4 $ 1.3 $ (0.7)\n6. Equity Method Investees\nHenry Avocado\nThe Company owns a 49% interest in Henry Avocado Corporation (Henry Avocado), based in Escondido, California. Henry Avocado packs, distributes and sells fresh avocados in the domestic market from California growers and also imports packed Chilean and Mexican avocados. Henry Avocado also operates a farm management and orchard leasing business where it performs various farming functions on behalf of growers. There is a basis difference between the Companys historical investment in Henry Avocado and the amount recorded in members capital by the investee of $4.0 million as of October 31, 2022 and 2021, comprised solely of goodwill.\nMr. Avocado\nThe Company owns a 33% interest in Shanghai Mr. Avocado Limited (Mr. Avocado), a Chinese joint venture enterprise, through its Mission Produce Asia Ltd. subsidiary. The primary business operations include the marketing, ripening and distribution of fresh avocados within China.\nMoruga\nAs noted in Note 3, Moruga was accounted for under the equity method of accounting until its consolidation on May 1, 2022. More information on Moruga is also included in Note 3.\nCopaltas\nThe Company owns a 50% interest in Copaltas S.A.S. (Copaltas), a Colombian joint venture enterprise. The primary business operations include the development and operation of avocado farms within Colombia.\nMISSION PRODUCE, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFinancial information for our equity method investees as of and for the years ended October 31 was as follows:\n(In millions) Henry Avocado\nMr. Avocado\nMoruga(1)\nCopaltas\nCurrent assets $ 49.5 $ 3.3 $ 0.6\nLong-term assets 16.0 1.7 20.6\nCurrent liabilities 18.6 3.9 6.7\nLong-term liabilities 7.6 0.6 7.3\nSales 371.6 20.5 $ 39.6 0.2\nGross profit 33.4 1.7 7.1 0.2\nNet income (loss) 11.5 (1.8) 5.9 (0.7)\nCurrent assets $ 45.1 $ 4.4 $ 24.8 $ 1.5\nLong-term assets 16.6 0.5 21.5 16.6\nCurrent liabilities 22.7 3.1 13.6 2.5\nLong-term liabilities 6.8 - 3.8 6.5\nSales 261.7 20.1 37.3 0.1\nGross profit 24.6 3.4 10.5 -\nNet income (loss) 7.5 0.5 6.4 (0.2)\nSales $ 254.1 $ 11.7 $ 28.7 $ 0.2\nGross profit 22.8 1.9 7.7 -\nNet income (loss) 4.4 (0.2) 3.8 0.1\n(1)Selected financial information for Moruga is set forth for periods under which Moruga was accounted for under the equity method of accounting. As of October 31, 2022, Moruga was consolidated.\nThe Companys investments in its equity method investees have been impacted by the following:\n(In millions) Henry Avocado\nMr. Avocado\nMoruga\nCopaltas\nTotal\nInvestment balance as of October 31, 2020 $ 17.9 $ 0.4 $ 23.9 $ 4.5 $ 46.7\nEquity method income (losses) 3.7 0.2 3.8 (0.2) 7.5\nDividends received (1.7) - - - (1.7)\nInvestment contributions - - - 0.2 0.2\nInvestment balance as of October 31, 2021 $ 19.9 $ 0.6 $ 27.7 $ 4.5 $ 52.7\nEquity method income (losses) 5.6 (0.6) 0.5 (0.3) 5.1\nTranslation - - - (0.7) (0.7)\nDividends received (2.2) - - - (2.2)\nInvestment contributions - 0.2 - 0.2 0.4\nRemeasurement gain - - 2.0 - 2.0\nEffect of consolidation with Mission Produce on May 1, 2022 - - (30.2) - (30.2)\nInvestment balance as of October 31, 2022 $ 23.3 $ 0.2 $ - $ 3.7 $ 27.1\n7. Debt\nCredit facility\nIn October 2022, the Company entered into a third amendment to its syndicated credit facility with Bank of America (the credit facility) Merrill Lynch, originally dated October 2018, as amended in September 2020 and April 2022. Among other things, the third amendment changed the total borrowing capacity from $275 million to $250 million. The credit facility is comprised of two senior term loans totaling $100 million, compared to $175 million before the third amendment and a revolving credit agreement now providing up to $150 million in borrowings compared to $100 million before the third amendment. The loans are secured by real property, personal\nMISSION PRODUCE, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nproperty and the capital stock of the Companys subsidiaries. Borrowings under the credit facility bear interest at a spread over the Secure Overnight Financing Rate (SOFR) ranging from 1.5% to 2.5% depending on the Companys consolidated total net leverage ratio, compared to a spread over the London Interbank Offer Rate (LIBOR), ranging from 1.50% to 2.75% before the third amendment. The credit facility also includes a swing line facility and an accordion feature which allows the Company to increase the borrowings by up to $125 million, with bank approval. We pay fees on unused commitments on the credit facility that accrue at rates ranging from 0.18% to 0.3% depending upon the Companys consolidated total net leverage ratio.\nThe credit facility requires the Company to comply with financial and other covenants, including limitations on investments, capital expenditures, dividend payments, amounts and types of liens and indebtedness, and material asset sales. The Company is also required to maintain certain leverage and fixed charge coverage ratios. As of October 31, 2022, the Company was in compliance with all covenants of the credit facility.\nLong-term debt under the credit facility consisted of the following:\nOctober 31,\n(In millions) 2022 2021\nRevolving line of credit. As of October 31, 2022 and 2021, the interest rate(1) was 5.34% and 1.84%, respectively. Interest is payable monthly and principal is due in full in October 2027.\n$ 40.0 $ -\nSenior term loan (A-1). As of October 31, 2022 and 2021, the interest rate(1) was 5.58% and 1.84%, respectively. Interest is payable monthly, principal is payable quarterly and due in full in October 2027.\n50.0 90.0\nSenior term loan (A-2). As of October 31, 2022 and 2021, the interest rate(1) was 5.83% and 2.34% respectively. Interest is payable monthly, principal is payable quarterly and due in full in October 2029.\n50.0 72.8\nNote payable to BoA. Payable in monthly installments including interest at a rate of 3.96% as of both October 31, 2022 and 2021. Principal is due July 2024.\n1.0 1.5\nTotal long-term debt 141.0 164.3\nLess debt issuance costs (0.6) (0.4)\nLong-term debt, net of debt issuance costs 140.4 163.9\nLess current portion of long-term debt (3.5) (8.8)\nLong-term debt, net of current portion $ 136.9 $ 155.1\n(1)The interest rate as of October 31, 2022 was variable, based on SOFR, in accordance with the credit facility as amended in October 2022. The interest rate as of October 31, 2021 was variable, based on LIBOR under the facility in effect at the time. The variable rates bear spreads that vary with the Companys leverage ratio.\nOther\nCertain of our consolidated subsidiaries may also enter into short-term bank borrowings from time to time. As of October 31, 2022, short-term borrowings outstanding were $2.5 million with a variable interest rate of 6.65%. No short-term borrowings were outstanding as of October 31, 2021.\nAs of October 31, 2022, future principal payments for our total debt were as follows:\nYear ending October 31, (In millions)\n2023 $ 6.1\n2024 3.4\n2025 3.0\n2026 3.0\n2027 80.5\nThereafter 47.5\n$ 143.5\nThe Company may issue standby letters of credit through banking institutions. As of October 31, 2022, total letters of credit outstanding were $0.7 million.\n8. Leases\nWe lease facilities, land, fleet and other industrial equipment under operating leases, expiring at various dates through 2048. We also lease equipment under finance leases, expiring at various dates through 2028. Certain of these leases have clauses such as\nMISSION PRODUCE, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nextension options, stipulated escalation provisions, early termination, and payment obligations for property taxes, insurance, maintenance and other costs.\nLease-related assets and liabilities on our consolidated balance sheets as of October 31, 2022 and 2021 were as follows:\nOctober 31,\n(In millions) Location on Consolidated Balance Sheets 2022 2021\nAssets\nOperating Operating lease right-of-use assets $ 65.4 $ 43.9\nFinance Property, plant and equipment, net 3.8 4.4\nTotal lease assets $ 69.2 $ 48.3\nLiabilities\nCurrent\nOperating Operating leases-current portion $ 4.7 $ 3.6\nFinance Finance leases-current portion 1.2 1.1\nNoncurrent\nOperating Operating leases, net of current portion 63.9 42.5\nFinance Finance leases, net of current portion 1.4 2.2\nTotal lease liabilities $ 71.2 $ 49.4\nMost lease costs are recognized in the consolidated statements of (loss) income, however, costs qualifying for capitalization, such as lease costs for equipment used in the development of orchards, are recognized into property, plant and equipment or inventory. A summary of lease costs for the years ended October 31, 2022 and 2921 is as follows:\n(In millions) Inventory Property, plant and equipment Cost of sales Selling, general and administrative expenses Interest Expense Total\nYear ended October 31, 2022\nOperating leases\nLease cost $ 0.2 $ - $ 6.4 $ 1.6 $ - $ 8.2\nVariable lease cost - - 1.9 - - 1.9\nShort-term lease cost 1.9 3.5 11.5 1.0 - 17.9\nFinance leases\nAmortization of right-of-use assets - - 0.5 0.2 - 0.7\nInterest on lease liabilities - - - - 0.2 0.2\nTotal lease cost $ 2.1 $ 3.5 $ 20.3 $ 2.8 $ 0.2 $ 28.9\nYear ended October 31, 2021\nOperating leases\nLease cost $ - $ - $ 3.9 $ 2.6 $ - $ 6.5\nVariable lease cost - - 0.8 0.1 - 0.9\nShort-term lease cost 1.3 2.7 13.2 0.8 - 18.0\nFinance leases\nAmortization of right-of-use assets - - 0.7 0.4 - 1.1\nInterest on lease liabilities - - - - 0.3 0.3\nTotal lease cost $ 1.3 $ 2.7 $ 18.6 $ 3.9 $ 0.3 $ 26.8\nRent expense from operating leases was approximately $6.9 million for the year ended October 31, 2020. Depreciation expense on finance leases was $0.3 million for the year ended October 31, 2020.\nMISSION PRODUCE, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nSupplemental cash flow information related to leases is set forth below:\nYears ended October 31,\n(In millions) 2022 2021\nCash paid for amounts included in the measurement of lease liabilities for operating cash flows for operating lease liabilities $ 6.4 $ 5.5\nRight-of-use assets obtained in exchange for new operating lease liabilities 23.1 11.3\nAs of October 31, 2022, future maturities of lease liabilities with original terms in excess of one year were as follows:\n(In millions)\nYear ending October 31, Operating Leases\nFinance Leases\n2023 $ 7.2 $ 1.4\n2024 7.4 1.2\n2025 6.9 0.2\n2026 6.8 -\n2027 6.0 -\nThereafter 71.0 -\nTotal undiscounted future minimum lease payments\n$ 105.3 $ 2.8\nLess imputed interest (36.7) (0.2)\nTotal discounted future minimum lease payments\n$ 68.6 $ 2.6\nWeighted average remaining lease terms and weighted average discount rates as of October 31, 2022 were as follows:\nOperating Leases\nFinance Leases\nWeighted average remaining lease term (in years) 16.2 2.1\nWeighted average discount rate 5.0 % 7.1 %\n9. Commitments and Contingencies\nLitigation\nWe are from time to time involved in legal proceedings and investigations arising in the ordinary course of business, including those relating to employment matters, relationships with clients and contractors, intellectual property disputes and other business matters.\nOn April 23, 2020, former Mission Produce, Inc. employees filed a class action lawsuit in the Superior Court of the State of California for the County of Los Angeles against us alleging violation of certain wage and labor laws in California, including failure to pay all overtime wages, minimum wage violations, and meal and rest period violations, among others. Additionally, on June 10, 2020, former Mission Produce, Inc. employees filed a class action lawsuit in the Superior Court of the State of California for the County of Ventura against us alleging similar violations of certain wage and labor laws. The plaintiffs in both cases seek damages primarily consisting of class certification and payment of wages earned and owed, plus other consequential and special damages. While the Company believes that it did not violate any wage or labor laws, it nevertheless decided to settle these class action lawsuits. In May 2021, the plaintiffs in both class action lawsuits and the Company agreed preliminarily to a comprehensive settlement to resolve both class action cases for a total of $0.8 million, which the Company recorded as a loss contingency in selling, general and administrative expenses in the consolidated statements of income during the three months ended April 30, 2021. The parties executed a stipulation of settlement agreement on such terms in November 2021. This preliminary settlement was approved by the applicable courts in October 2022 and is subject to final approval which is currently estimated to be in the spring of 2023.\nThe outcomes of our legal proceedings and other contingencies are inherently unpredictable, subject to significant uncertainties, and if one or more legal matters were resolved against the Company in a reporting period for amounts above managements expectations, the Companys financial condition and operating results for that period could be materially adversely affected.\nMISSION PRODUCE, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n10. Income Taxes\nThe components of the provision for income taxes were as follows:\nYears ended October 31,\n(In millions) 2022 2021 2020\nCurrent\nFederal $ 0.5 $ 2.2 $ 4.6\nState (0.1) 0.6 0.7\nForeign 3.9 9.5 10.7\nTotal current 4.3 12.3 16.0\nDeferred\nFederal 0.7 2.6 1.1\nState 0.2 0.3 (0.2)\nForeign (1.5) 5.9 (1.9)\nTotal deferred (0.6) 8.8 (1.0)\nProvision for income taxes $ 3.7 $ 21.1 $ 15.0\nU.S. and foreign components of (loss) income before income taxes were as follows:\nYears ended October 31,\n(In millions) 2022 2021 2020\nU.S. $ 1.9 $ 20.8 $ 31.0\nForeign (33.1) 45.2 12.8\n(Loss) income before income taxes $ (31.2) $ 66.0 $ 43.8\nA reconciliation of the provision for income taxes computed at the federal statutory tax rate to income taxes as reflected in the financial statements is as follows:\nYears ended October 31,\n2022 2021 2020\nFederal statutory rate 21.0 % 21.0 % 21.0 %\nState income taxes, net of federal tax benefit (0.7) % 1.0 % 2.0 %\nGILTI (1.9) % 2.3 % 5.6 %\nNon-deductible executive compensation (0.9) % 0.5 % 3.9 %\nGoodwill impairment (33.4) % - % - %\nMoruga fair value remeasurement 1.4 % - % - %\nMoruga impairment - % - % 10.1 %\nForeign tax credits 0.8 % (0.9) % (4.6) %\nNOL carryback - CARES Act - % - % (2.8) %\nPeru income tax rate change 1.8 % 8.3 % - %\nUnrecognized tax benefits increase (2.8) % 0.9 % 0.6 %\nOther, net 2.7 % (1.1) % (1.6) %\nEffective tax rate(1)\n(12.0) % 32.0 % 34.2 %\n(1)May not sum due to rounding.\nMISSION PRODUCE, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nDeferred taxes are recognized for temporary differences between the basis of assets and liabilities for financial statement and income tax purposes. The significant components of deferred tax assets and liabilities were as follows:\nOctober 31,\n(In millions) 2022 2021\nAccrued expenses $ 4.6 $ 4.2\nNet operating loss and other carryforwards 1.4 0.8\nInventory 0.6 0.8\nInterest rate swaps - 0.8\nOperating lease liabilities 13.8 11.2\nAllowances, reserves, and other 1.4 0.3\nTotal deferred tax assets 21.8 18.1\nLess: valuation allowance (0.7) (0.5)\nTotal net deferred tax assets $ 21.1 $ 17.6\nEquity interest in unconsolidated subsidiaries (3.4) (3.1)\nInterest rate swaps (0.6) -\nProperty, plant and equipment (23.8) (21.6)\nOperating lease right-of-use assets (13.1) (10.7)\nRepatriation of foreign earnings (1.5) (1.4)\nTotal deferred tax liabilities (42.4) (36.8)\nTotal net deferred tax assets/(liabilities) $ (21.3) $ (19.2)\nAs of October 31, 2022, the Company had foreign net operating loss carryforwards of $5.5 million, $5.4 million of which, carries forward indefinitely.\nThe net change in the valuation allowance for deferred tax assets was $(0.2) million and $0.6 million for the years ended October 31, 2022 and 2021, respectively. Our valuation allowances primarily relate to deferred tax assets related to net operating losses in our foreign jurisdictions and certain of our equity method investments whereby sale would result in capital losses that are not more likely than not to be realized.\nAs of October 31, 2022, the Company recorded a deferred tax liability for the withholding tax that will be due upon future distribution of approximately $28.1 million of foreign earnings from its International Farming operations in Peru. The Company has determined all other accumulated foreign earnings of $168.1 million to be indefinitely reinvested, as it is our intent to permanently reinvest these funds outside of the United States and our current plans do not demonstrate a need to repatriate the cash to fund our U.S. operations.\nThe Company may recognize the tax benefit from an uncertain tax position claimed on a tax return only if it is more likely than not that the tax position will be sustained on examination by the taxing authorities, based on the technical merits of the position. The tax benefits recognized in the financial statements from such a position should be measured based on the largest benefit that has a greater than 50% likelihood of being realized upon ultimate settlement.\nA reconciliation of the total amounts of unrecognized tax benefits (exclusive of interest and penalties) is as follows:\nOctober 31,\n(In millions) 2022 2021\nUnrecognized tax benefits beginning of year $ 6.1 $ 6.0\nIncreases/(decreases) related to prior year positions 0.5 (0.2)\nForeign currency remeasurement 0.1 0.3\nUnrecognized tax benefits end of year $ 6.7 $ 6.1\nIf recognized, the total amount of unrecognized tax benefits as of October 31, 2022 and 2021 would impact the effective tax rate. There is potential for significant changes to unrecognized tax benefits by the end of fiscal year 2023 with regards to the 2013 tax assessment as discussed below.\nThe Company recognizes interest and penalties related to uncertain tax positions in income tax expense. The Company recorded $0.6 million, $0.9 million, and $(1.9) million of interest and penalties in the years ended October 31, 2022, 2021 and 2020,\nMISSION PRODUCE, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nrespectively, in the consolidated statements of (loss) income and had $8.3 million and $7.7 million for interest and penalties accrued as of October 31, 2022 and 2021, respectively, which have been included in other long-term liabilities in the consolidated balance sheets.\nWe conduct business both domestically and internationally and, as a result, one or more of our subsidiaries files income tax returns in U.S. federal, U.S. state and certain foreign jurisdictions. Accordingly, in the normal course of business, we are subject to examination by taxing authorities, primarily in the United States, Mexico and Peru. The Company is no longer subject to U.S. federal tax examinations for the fiscal years prior to and including October 31, 2018, nor is it subject to U.S. state income tax examinations for fiscal years prior to and including October 31, 2017. The Company is no longer subject to income tax examinations in Mexico for calendar years prior to and including December 31, 2016, except for the 2013 calendar year, which is under audit as discussed below. The Company is no longer subject to income tax examinations in Peru for calendar years prior to and including December 31, 2016.\nThe Companys wholly owned subsidiary in Mexico is currently under audit for the fiscal year 2013 and received certain proposed adjustments during fiscal year 2018 from the Mexican taxing authorities pertaining to disallowed deductions. During June 2018, the Company filed an administrative appeal challenging the 2013 tax assessment, which in June 2019 the authorities issued a resolution revoking the tax assessment and ordering the tax auditors to appraise some evidence and re-issue a new assessment in connection with one of the intermediaries. The Mexican subsidiary filed a tax lawsuit since the tax auditors did not appraise the evidence offered in connection with a significant portion of the disallowed deductions, which the Company is currently waiting for the resolution of the trial. The Company believes that is has adequately provided taxes for this matter.\nOn December 30, 2020, Peru enacted tax law repealing current tax law which provided benefits to agribusiness entities. The new law will subject us to higher Peruvian corporate income tax rates than our current rate of 15% as follows: 20% for calendar years 2023 to 2024, 25% for calendar years 2025 to 2027, and 29.5% thereafter. We remeasured our deferred tax balances based on the applicable tax rate in the year the deferred balances are expected to reverse. The increase to the net deferred tax liability for the change in Peruvian tax rate resulted in a $5.4 million increase to tax expense during fiscal year 2021.\nOn March 27, 2020, the Coronavirus Aid, Relief and Economic Security (CARES Act) was signed into law. Among other things, the CARES Act permitted NOL carryovers and carrybacks to offset 100% of taxable income for taxable years beginning before 2021. In addition, the CARES Act allowed NOLs incurred in 2018, 2019, and 2020 to be carried back to each of the five preceding taxable years to generate a refund of previously paid income taxes. For fiscal year 2020 the Company recorded a discrete benefit of $1.2 million due to the revaluation of deferred tax assets due to the utilization of NOLs at a higher tax rate in the carryback period. The CARES Act also contains modifications on the limitation of business interest for tax years beginning in 2019 and 2020. The modifications to Section 163(j) increased the allowable business interest deduction from 30% of adjusted taxable income to 50% of adjusted taxable income which did not have an impact to the company for fiscal year 2020 or 2021.\n11. Shareholders Equity\n2003 Stock Incentive Plan\nOur Board of Directors adopted the Mission Produce, Inc. 2003 Stock Incentive Plan in fiscal year 2004, and subsequently restated and amended the plan on July 9, 2019 (collectively, the 2003 Plan). The 2003 Plan is a non-qualified stock option plan that allowed for the granting of a combined maximum of 10,200,000 stock option awards to key employees and directors, until the completion of our IPO in October 2020, at which time we adopted the 2020 Incentive Award Plan (2020 Plan), and shares of our common stock subject to awards granted under the 2003 Plan that were available for issuance were transferred to, and became available for issuance under the 2020 Plan in accordance with its terms.\n2020 Incentive Award Plan\nOn October 1, 2020, our Board of Directors adopted the 2020 Plan, which provides for the grant of equity awards, including stock options, RSUs, and PSUs to directors, employees, consultants, and certain of our affiliates. The terms of awards may vary based on the grantee classification, or nature of the award, such as awards contingent upon discrete events, or awards related to continuing employment. A maximum of 9,880,190 shares of common stock may be issued under the 2020 Plan. As of October 31, 2022, 8,785,878 shares were available for issuance under the 2020 Plan.\nStock-based compensation\nStock-based compensation expense is recorded in selling, general and administrative expenses in the consolidated statements of income. Total stock-based compensation expense under these plans and the total related recognized tax benefit were as follows:\nMISSION PRODUCE, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nYears ended October 31,\n(In millions) 2022 2021 2020\nRSUs $ 2.0 $ 1.1 $ 0.1\nPSUs 0.3 - -\nStock options 1.3 1.5 4.8\nTotal stock-based compensation expense under incentive plans, pretax 3.6 2.6 4.9\nTax benefit - 0.1 0.1\nUnrecognized stock-based compensation expense as of October 31, 2022 was $6.5 million and is expected to be recognized over a weighted-average period of 1.5 years.\nRSUs\nRSUs are service-based awards granted under the 2020 Plan to eligible employees and non-employees. RSUs are expected to be settled with shares of the Companys common stock. Vesting and forfeiture conditions are specific to each grant as determined by the plan administrator. The fair value of RSUs is determined based on the market price of our common stock on the date of grant.\nEmployees\nRSUs are granted to employees as well as new-hires and generally vest ratably over three to four years. Activity for awards during the year ended October 31, 2022 was as follows. No awards were granted during the year ended October 31, 2020.\nUnits\n(in thousands) Weighted average grant-date fair value per unit\nOutstanding at October 31, 2021\n8 $ 20.87\nGranted 293 15.88\nVested (2) 20.87\nForfeited (19) 15.89\nOutstanding at October 31, 2022\n280 $ 15.99\nBoard of Directors\nUnder our Director Compensation Plan, directors receive an automatic annual grant on the date of each Annual Shareholders Meeting, set to cliff-vest at the earlier of one year following the grant date or at the subsequent Annual Shareholders Meeting. Directors are also eligible to defer the distribution of shares between two to five years, either in lump sum or annual installments. Deferral elections are made annually at the beginning of each plan year and apply to grants made within said year.\nActivity for RSU awards for directors during the year ended October 31, 2022 was as follows:\nUnits\n(in thousands) Weighted average grant-date fair value per unit\nOutstanding at October 31, 2021\n35 $ 19.89\nGranted 71 13.08\nVested (38) 19.74\nForfeited - -\nOutstanding at October 31, 2022\n68 $ 12.90\nVested and deferred at October 31, 2022\n15 $ 19.89\nPSUs\nPSUs are performance-based awards granted to eligible employees under the 2020 Plan. PSUs are expected to be settled with shares of the Companys common stock at the end of a three-year cliff vesting period, provided the performance conditions are achieved as of the end of such period. The actual number of shares issued may range from 0% to 200% of the target shares issued at time of grant. The fair value of PSUs is determined based on the market price of our common stock on the date of grant.\nMISSION PRODUCE, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nActivity for PSU awards during the year ended October 31, 2022 was as follows. No PSU awards were granted during the years ended October 31, 2021 or 2020.\nUnits\n(in thousands) Weighted average grant-date fair value per unit\nUnvested at October 31, 2021\n- $ -\nGranted at target 100 15.89\nVested - -\nForfeited (5) 15.89\nUnvested at October 31, 2022\n95 $ 15.89\nStock options\nStock options are generally granted with exercise prices no less than the fair market value at grant date and vest based on tenure of employment or other specific events and expire 10 years after the grant date. The fair value of stock options are estimated as of the date of grant using the Black-Scholes option valuation model with the following assumptions, as required by the model:\nRisk-free rate- the current interest rate on five to seven-year U.S. Treasury Bonds\nVolatility- the average of equity implied asset volatility of publicly-traded direct competitor companies\nExpected life- calculated as the average of the vesting term and original contractual term, known as the simplified method\nNo stock options were granted during the years ended October 31, 2022 and 2021. The weighted-average grant-date fair value of options granted during the year ended October 31, 2020 was $3.61. Assumptions used to estimate the fair value for stock options granted during the year ended October 31, 2020 were as follows:\nRisk-free interest rate 0.4 %\nVolatility 30 %\nExpected life (in years) 6.3\nDividend rate -\nThe total grant-date fair value of stock options vested during the years ended October 31, 2022, 2021 and 2020 was $1.4 million, $1.3 million, and $5.5 million, respectively. The total intrinsic value of stock options exercised was $0.1 million in the year ended October 31, 2022, and $0.2 million in both years ended October 31, 2021 and 2020.\nCEO Award\nOn July 9, 2019 our Board of Directors approved a stock option grant to the Companys Chief Executive Officer (CEO), Steve Barnard, covering 1,700,000 shares of our common stock (CEO Award). The CEO Award had a strike price of $9.41 per share, which the Board of Directors assumed to be the then current fair market value of the Companys common stock on the grant date. The terms of the grant were such that the vesting of the stock option was contingent upon a successful initial public offering of the Companys common stock. There were 471,308 shares available under the 2003 Plan as of the date the CEO Award was granted. We accounted for 471,308 shares of the CEO Award that are subject to share settlement as equity-classified awards and 1,228,692 shares as liability-classified awards. The liability-classified portion of the CEO Award represented that portion of the CEO Award that was in excess of the shareholder-approved share limit authorized under the 2003 Plan as of October 31, 2019 and thus were classified as liability awards. In the event the modified Plan was not approved by the shareholders, the liability-classified portion of the CEO Award would have been subject to cash settlement. The Company has not recognized any stock-based compensation expense prior to the modification of the CEO Award discussed below because the vesting of the award was dependent upon the occurrence of an initial public offering. At the date of grant, based on a subsequent valuation performed, the estimated fair market value of the CEO award was determined to be $9.1 million.\nOn October 29, 2019, our Board of Directors, with the consent of Mr. Barnard, modified the CEO Award to amend the vesting schedule. As a result of this amendment, 850,000 shares subject to the CEO Award were modified to vest at the earlier of (i) the seventh year anniversary of the grant date, (ii) immediately prior to the consummation of a change in control (as defined in the Plan) or, (iii) upon the closing of an IPO of our common stock, in each case, subject to Mr. Barnards continued service with the Company as of the applicable vesting date. Of these CEO Award shares, we accounted for 235,654 shares as equity-classified awards and 614,346 CEO Award shares (i.e., the allocable portion of those CEO Award shares that were in excess of the shareholder-approved share limit authorized under the original Plan as of October 31, 2019) as liability-classified awards. The remaining 850,000 CEO Award shares were modified to\nMISSION PRODUCE, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nvest in five equal installments on the first five anniversaries of the grant date, subject to Mr. Barnards continued service with the Company as of the applicable vesting date. Of these shares, we accounted for 235,654 shares as equity-classified awards and 614,346 shares as liability-classified awards (i.e., the allocable portion of those CEO Award shares that were in excess of the shareholder-approved share limit authorized under the 2003 Plan as of October 31, 2019).\nPrior to the October 2019 modification, the Company determined that it was not probable that the CEO awards would vest because of the contingent nature of the CEO Award. Upon modification of the vesting terms, during October 2019, the Company determined that it was probable that the CEO Award would vest. The Company determined the fair value of the CEO Award on the date of modification to be $11.3 million, to be recognized as stock-based compensation expense as service is provided.\nDuring December 2019, management determined the fair value of our common stock with the support of a third-party valuation specialist as of the July 9, 2019 stock option grant date. As a result of this independent valuation, the Company determined the fair value of our common stock on the stock option grant date to be $13.74 per share. As a result, the Board of Directors, with the consent of Mr. Barnard, modified the CEO Awards to increase the strike price to $13.74 per share. As of the modification date, the fair value of liability-classified awards was $5.6 million.\nOn March 19, 2020, shareholders approved an amendment to the 2003 Plan that added an additional 2,550,000 shares available to be issued. Upon the approval of the amendment, the 1,228,692 awards previously accounted for as liability-classified awards were reclassified to shareholders equity and accounted for prospectively as equity awards because of the increase in shares available to be issued under the 2003 Plan. On the date of reclassification, management determined the fair value of our common stock, with the assistance of a third-party valuation specialist, to be $12.63 per share, resulting in an estimated fair value of $4.6 million for the reclassified awards. As of March 19, 2020, the Company had accrued $0.3 million in accrued expenses related to the liability-classified awards, which was reclassified to shareholders equity as of March 19, 2020.\nStock option activity for the CEO Award during the year ended October 31, 2022 was as follows:\nNumber of options\n(in thousands) Weighted-average\nexercise price\nWeighted-average\nremaining life\n(in years)\nAggregate\nintrinsic value\n(in millions)\nOutstanding at October 31, 2021\n1,700 $ 13.74\nGranted -\nExercised - 13.74\nForfeited -\nOutstanding at October 31, 2022\n1,700 $ 13.74 6.7 $ 4.9\nVested and expected to vest at October 31, 2022\n1,700 $ 13.74 6.7 $ 4.9\nExercisable at October 31, 2022\n1,360 $ 13.74 6.7 $ 3.9\nNumber of options\n(in thousands) Weighted average grant-date fair value\nUnvested at October 31, 2021\n510 $ 5.35\nGranted - -\nVested (170) 5.35\nForfeited - -\nUnvested at October 31, 2022\n340 $ 5.35\nMISSION PRODUCE, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nEmployees\nStock options granted to employees generally vest ratably over four years. Stock option activity for other employees during the year ended October 31, 2022 was as follows:\nNumber of options\n(in thousands) Weighted-average\nexercise price\nWeighted-average\nremaining life\n(in years)\nAggregate\nintrinsic value\n(in millions)\nOutstanding at October 31, 2021\n486 $ 11.55\nGranted - -\nExercised (15) 6.66\nForfeited (23) 12.00\nOutstanding at October 31, 2022\n448 $ 11.69 7.2 $ 2.2\nVested and expected to vest at October 31, 2022\n448 11.69 7.2 2.2\nExercisable at October 31, 2022\n240 $ 11.43 6.7 $ 1.3\nNumber of options\n(in thousands) Weighted average grant-date fair value\nUnvested at October 31, 2021\n362 $ 3.99\nGranted - -\nVested (131) 4.66\nForfeited (23) 3.61\nUnvested at October 31, 2022\n208 $ 3.61\nDividends\nIf we do not comply with certain covenants under our credit facility, our ability to pay dividends in the future could be limited.\n12. Fair Value Measurements\nFinancial assets and liabilities measured and recorded at fair value on a recurring basis included in the consolidated balance sheets were as follows:\nOctober 31, 2022 October 31, 2021\n(In millions) Total\nQuoted Prices\nin Active\nMarkets\n(Level 1)\nSignificant\nOther\nObservable\nInputs\n(Level 2)\nSignificant\nUnobservable\nInputs\n(Level 3)\nTotal\nQuoted Prices\nin Active\nMarkets\n(Level 1)\nSignificant\nOther\nObservable\nInputs\n(Level 2)\nSignificant\nUnobservable\nInputs\n(Level 3)\nAssets\nMutual funds $ 1.2 $ 1.2 $ - $ - $ 1.2 $ 1.2 $ - $ -\nInterest rate swap 2.6 - 2.6 - - - - -\nLiabilities\nInterest rate swap - - - - 3.5 - 3.5 -\nOur mutual fund investments relate to our deferred compensation plan, which are held in a Rabbi trust which is included in other assets in our consolidated balance sheets. The funds are measured at quoted prices in active markets, which is equivalent to their fair value.\nThe fair value of interest rate swaps is determined using widely accepted valuation techniques, including the DCF method. The analysis reflects the contractual terms of the swaps, including the period to maturity, and uses observable market-based inputs, including interest rate curves (significant other observable inputs). The fair value calculation also includes an amount for risk of non-performance using significant unobservable inputs such as estimates of current credit spreads to evaluate the likelihood of default. The Company has concluded, as of October 31, 2022 and 2021, that the fair value associated with the significant unobservable inputs relating to the Companys risk of non-performance was insignificant to the overall fair value of the interest rate swap agreements and, as a result, the\nMISSION PRODUCE, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nCompany has determined that the relevant inputs for purposes of calculating the fair value of the interest rate swap agreements, in their entirety, were based upon significant other observable inputs. The assets or liabilities associated with the interest rate swaps have been included in prepaid and other current assets and other assets or accrued expenses and other long-term liabilities, respectively, in the consolidated balance sheets and gains and losses for the interest rate swaps have been included in other income (expense), net in the consolidated statements of (loss) income.\n13. Earnings Per Share\nYears ended October 31,\n2022 2021 2020\nNumerator:\nNet (loss) income attributable to Mission Produce (in millions)\n$ (34.6) $ 44.9 $ 28.8\nDenominator:\nWeighted average shares of common stock outstanding, used in computing basic earnings per share 70,647,469 70,583,424 63,634,863\nEffect of dilutive stock options - 466,227 22,038\nEffect of dilutive RSUs - 18,830 3,117\nWeighted average shares of common stock outstanding, used in computing diluted earnings per share 70,647,469 71,068,481 63,660,018\nEarnings per share\nBasic $ (0.49) $ 0.64 $ 0.45\nDiluted $ (0.49) $ 0.63 $ 0.45\nEquity awards representing shares of common stock outstanding that were excluded in the computation of diluted earnings per share because their effect would have been anti-dilutive as a result of applying the treasury stock method, were as follows:\nYears ended October 31,\n2022 2021 2020\nAnti-dilutive stock options 606,453 145,735 1,289,589\nAnti-dilutive RSUs 200,681 24,540 -\nMISSION PRODUCE, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n14. Related Party Transactions\nTransactions with related parties included in the consolidated financial statements were as follows:\nConsolidated Balance Sheets Consolidated Statements of (Loss) Income\nAccounts receivable\nLoans to equity method investees Accounts payable & accrued expenses\nNet sales\nCost of sales\nSelling, general and administrative expenses\nOther income (expense), net\n(In millions) October 31, 2022\nYear ended October 31, 2022\nEquity method investees:\nHenry Avocado $ - $ - $ - $ 2.7 $ 0.5 $ - $ -\nMr. Avocado 1.5 - - 2.7 - - -\nMoruga(1)\n- - - 4.1 - - -\nCopaltas(2)\n- - - - - - 0.1\nOther:\nDirectors/officers(3)\n0.1 - 2.5 1.0 5.8 - -\nEmployees(4)\n- - 0.4 - 6.2 - -\nOctober 31, 2021\nYear ended October 31, 2021\nEquity method investees:\nHenry Avocado $ - $ - $ - $ 4.4 $ - $ - $ -\nMr. Avocado 1.3 - - 4.3 - - -\nMoruga(1)\n3.9 3.0 - 6.1 - - 0.4\nCopaltas(2)\n- 2.1 - - - - 0.1\nOther:\nDirectors/officers(3)\n0.1 - - 2.5 3.5 0.1 -\nEmployees(4)\n- - 0.2 - 9.6 - -\nYear ended October 31, 2020\nEquity method investees:\nHenry Avocado $ 1.3 $ - $ - $ -\nMr. Avocado 1.9 - - -\nMoruga(1)\n4.9 - - 0.6\nOther:\nDirectors/officers(3)\n2.3 5.1 0.2 -\n(1)Effective May 1, 2022, Moruga was prospectively consolidated into the Companys financial statements (refer to Note 3 for more details), thereby eliminating related party transactions. Related party transactions prior to consolidation are presented the same as in prior periods. The Company provided loans to Moruga to support growth and expansion projects, bearing interest at 6.5%, due December 31, 2023. The Company also provides packing and cooling services for blueberries and leases owned land to Moruga.\n(2)The Company has provided loans to Copaltas to support growth and expansion projects, bearing interest at 6.66%, which had an amended due date of August 31, 2022. As of October 31, 2022, the principal balance of the loan was fully repaid.\n(3)The Company purchases from and sells avocados to, and provides logistics services to, a small number of entities having full or partial ownership by some of our directors/officers. These transactions are made under substantially similar terms as with other growers and customers. The Company had a consulting agreement with a director to advise on business operations, as well as to analyze opportunities for fresh avocado farming and packing facilities in South and Central America, that was terminated in June 2021.\n(4)The Company utilizes a small number of transportation vendors in Mexico having full or partial ownership by some of our employees. The Company also purchases avocados from a small number of entities having full or partial ownership by some employees. These transactions are made under substantially similar terms as with other transportation carriers and growers.\n15. Segment and Revenue Information\nWe have three operating segments which are also reportable segments. Our reportable segments are presented based on how information is used by our CEO, who is the chief operating decision maker, to measure performance and allocate resources. After the consolidation of Moruga on May 1, 2022 (refer to Notes 2 and 3 for more information), the information used by the CEO changed to include the results of Moruga, and as such, we determined our reportable segments to be:\nMarketing and Distribution. Our Marketing and Distribution reportable segment sources fruit from growers and then distributes the fruit through our global distribution network.\nInternational Farming. International Farming owns and operates orchards from which substantially all fruit produced is sold to our Marketing and Distribution segment. Its farming activities range from cultivating early-stage plantings to harvesting from mature trees, and it also earns service revenues for packing and processing for our Blueberries segment, as well as for third-\nMISSION PRODUCE, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nparty producers of other crops during the avocado off-harvest season. Operations are principally located in Peru, with smaller operations emerging in other areas of Latin America.\nBlueberries. The new Blueberries segment represents the results of Moruga, subsequent to its consolidation on May 1, 2022. Morugas farming activities include cultivating early-stage blueberry plantings and harvesting mature bushes. Substantially all of blueberries produced are sold to a single distributor under an exclusive marketing agreement.\nThe CEO evaluates and monitors segment performance primarily through segment sales and segment adjusted EBITDA. Adjusted EBITDA refers to net income (loss), before interest expense, income taxes, depreciation and amortization expense, stock-based compensation expense, other income (expense), and income (loss) from equity method investees, further adjusted by asset impairment and disposals, net of insurance recoveries, farming costs for nonproductive orchards (which represents land lease costs), certain noncash and nonrecurring ERP costs, transaction costs, material legal settlements, amortization of inventory adjustments recognized from business combinations, and any special, non-recurring, or one-time items such as remeasurements or impairments, and any portion of these items attributable to the noncontrolling interest, all of which are excluded from the results the CEO reviews uses to assess segment performance and results. We believe that adjusted EBITDA by segment provides useful information for analyzing the underlying business results as well as allowing investors a means to evaluate the financial results of each reportable segment in relation to the Company as a whole. These measures are not in accordance with, nor are they a substitute for or superior to, the comparable GAAP financial measures.\nNet sales from each of our reportable segments were as follows.\nMarketing and Distribution International Farming Blueberries Total Marketing and Distribution International Farming Total Marketing and Distribution International Farming Total\nYears ended October 31,\n(In millions) 2022 2021 2020\nThird party sales $ 1,016.1 $ 19.1 $ 10.8 $ 1,045.9 $ 872.0 $ 19.7 $ 891.7 $ 846.9 $ 15.4 $ 862.3\nAffiliated sales - 95.6 - 95.6 - 84.9 84.9 - 66.4 66.4\nTotal segment sales $ 1,016.1 $ 114.7 $ 10.8 $ 1,141.5 $ 872.0 $ 104.6 $ 976.6 $ 846.9 $ 81.8 $ 928.7\nIntercompany eliminations - (95.6) - (95.6) - (84.9) (84.9) - (66.4) (66.4)\nTotal net sales $ 1,016.1 $ 19.1 $ 10.8 $ 1,045.9 $ 872.0 $ 19.7 $ 891.7 $ 846.9 $ 15.4 $ 862.3\nSupplemental sales information is as follows.\nYears ended October 31,\n(In millions) 2022 2021 2020\nBy type\nAvocado $ 998.4 $ 864.5 $ 845.7\nBlueberry(1)\n10.8 - -\nMango 17.5 6.0 0.3\nOther 19.2 21.2 16.3\nTotal net sales $ 1,045.9 $ 891.7 $ 862.3\nBy customer location\nUnited States 854.7 674.7 659.5\nRest of world 191.2 217.0 202.8\nTotal net sales $ 1,045.9 $ 891.7 $ 862.3\n(1)Blueberry sales are generated entirely by our Blueberries segment, and are therefore reported prospectively from May 1, 2022.\nMISSION PRODUCE, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nAdjusted EBITDA for each of our reportable segments was as follows:\nYears ended October 31,\n(In millions) 2022 2021 2020\nMarketing & Distribution adjusted EBITDA $ 23.5 $ 51.4 $ 68.2\nInternational Farming adjusted EBITDA 23.3 33.9 23.3\nBlueberries adjusted EBITDA 0.8 - -\nTotal reportable segment adjusted EBITDA $ 47.6 $ 85.3 $ 91.5\nNet (loss) income (34.9) 44.9 28.8\nInterest expense 5.5 3.7 6.7\nProvision for income taxes 3.7 21.1 15.0\nDepreciation and amortization(1)\n24.8 20.4 18.1\nEquity method income (5.1) (7.5) (4.0)\nStock-based compensation 3.6 2.6 5.0\nOther (income) expense, net (4.4) (1.3) 0.7\nLegal settlement - 0.8 -\nAsset impairment and disposals, net of insurance recoveries 0.4 (0.2) -\nFarming costs for nonproductive orchards 1.5 0.8 -\nERP costs(2)\n4.6 - -\nAmortization of inventory adjustment recognized from business combination 0.4 - -\nGoodwill impairment 49.5 - -\nRemeasurement gain on business combination with Moruga (2.0) - -\nImpairment on equity method investment - - 21.2\nTransaction costs 0.6 - -\nNoncontrolling interest(3)\n(0.6) - -\nTotal adjusted EBITDA $ 47.6 $ 85.3 $ 91.5\n(1)Includes $1.4 million of depreciation and amortization on purchase accounting assets including property, plant and equipment step-up and an intangible asset for the year ended October 31, 2022.\n(2)Includes recognition of deferred implementation costs and non-recurring post-implementation process reengineering costs.\n(3)Represents net loss attributable to noncontrolling interest plus the impact of non-GAAP adjustments, allocable to the noncontrolling owner based on their percentage of ownership interest.\nProperty, plant and equipment, net attributed to geographic areas was as follows:\nOctober 31,\n(In millions) 2022 2021\nNorth America $ 153.0 $ 161.7\nSouth America 331.9 261.7\nEurope 4.8 0.8\nProperty, plant and equipment, net $ 489.7 $ 424.2\n16. Subsequent Event\nIn November 2022, Moruga entered into a 25-year lease agreement with a company owned by one of our directors for approximately 1,500 acres of land in Chao, Peru. The land lease was secured for the new capital project approved by the shareholders of Moruga in May 2022 (see Note 3). Approximately two-thirds of the area was delivered upon execution of the lease, with the remainder expected to be delivered at the start of fiscal 2024. Total undiscounted lease payments associated with the lease agreement are approximately $60 million. The rental rate in the lease was comparable to market rates and reflective of an arms-length transaction."
}