{
    "cik": "1807166",
    "company": "Amesite Inc.",
    "filing_type": "10-K",
    "filing_date": "2023-10-06",
    "period_of_report": "2023-06-30",
    "sic": "7372",
    "state_of_inc": "DE",
    "state_location": "MI",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1807166/0001213900-23-081208-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1807166/000121390023081208/f10k2023_amesiteinc.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1807166/0001213900-23-081208.txt",
    "filename": "1807166_10K_2023_0001213900-23-081208.htm",
    "content": "ITEM 1. BUSINESS\nOverview\nAmesites smart, intuitive learning environments help organizations thrive. Amesite is a high-tech artificial intelligence software company offering a cloud-based platform and content creation services for business and university-delivered education and upskilling. Amesite-offered courses and programs are branded to our part. Amesite uses artificial intelligence technologies to provide customized environments for learners, easy-to-manage interfaces for instructors, and greater accessibility for learners in the US education market and beyond. The Company leverages existing institutional infrastructures, adding mass customization and cutting-edge technology to provide cost-effective, scalable and engaging experiences for learners anywhere.\nWe are passionate about improving the learner experience and learner outcomes in online learning products and improving our Customers ability to create and deliver both. We are focused on creating the best possible technology solutions and have been awarded an innovation award for our product. We are committed to our team, and have been recognized with 10 workplace excellence awards, 4 of them national.\nAmesite offers our white label platform to our Customers: universities, museums, businesses and government agencies. Amesites Customers offer learning to their users, who are students, professional learners and / or their own employees. Amesite derives revenue from the licensing of our platform, and user fees associated with its use by our Customers for their users. Some of our Customers generate revenue using our systems, including Universities and Museums.\nOur Strategy\nWe deliver Learning Community Environment®s (LCESMs) to businesses and educational institutions (EIs) that enable them to offer branded learning products to their students, professional learners or employees with ease. Our business model offers flexibility for our Customers. Our Customers license our platform and can also contract with to us to create and maintain customized learning products, or easily launch their own learning products on the platform. We have entered into master service agreements with our Customers, including, but not limited to, universities such as Wayne State University and enterprises such as The Henry Ford Museum. These agreements include statements of work detailing the services to be rendered and programs or products to be delivered on the platform. We use the proprietary data we collect on learner behavior and responses with their consent, to deliver to learners engaging, effective courses and programs. Our Customers gain efficiency, flexibility and can generate high return on investment and revenue through partnership with us, because of the speed, flexibility, effectiveness and scalability of the LCESMs we build for them.\nUniversities need to be able to launch programs that upskill their alumni and other professionals, accessibly and at scale. Museums need to engage their patrons and visitors with high quality digital learning opportunities. Businesses need learning systems that enable them to upskill people quickly and efficiently. Retention and execution of strategic plans require that employees stay engaged and learn effectively. Government needs to be able to offer learning programs that allow job seekers to advance skills. Amesites cloud-based platform addresses all of these key needs.\nWe target Customers who already have large cohorts of users who can consume their delivered learning programs. Our revenues are derived from license fees, but more importantly, by user fees, that we believe will enable us to scale revenue. Importantly, we aim to serve our Customers by delivering learning programs at price points that are accessible and are highly targeted to their needs.\nOur Proprietary Technology\nWe believe that online learning products are essential for accessibility, engagement and scalability for businesses and EIs alike. We utilize artificial intelligence to achieve improved engagement, and continuous integration of current, qualified information into our learning products.\nOur technology utilizes a flexible and scalable full stack solution, with robust tools powering front-end technology. Our code architecture offers outstanding accessibility and agility for engineers, using best-in-class languages for both client and server-side functions. We also use tools employed by many high-end platforms. Our architecture enables us to achieve full integration of best-in-class third party tools, and custom-built features, delivering on-demand and as-needed, such as leading calendar platform integrations, and high quality, encrypted video calling.\nOur architecture enables us to utilize artificial intelligence algorithms to ultimately improve learning outcomes. Much as artificial intelligence algorithms presently recognize and respond to natural language on commercial platforms, predict behaviors and deliver suggestions, our algorithms have been developed to assist learners in accessing, utilizing and remaining engaged with platform content, their instructors and their peers.\nWe generate content for our Customers using the highest standards in business and higher education, and our business model enables us to deliver content for our Customers efficiently and rapidly. Rapidly evolving technology has driven the need to continuously upskill students and workforces, and we use the highest possible standards to deliver this content according to Customer needs. This substantially reduces the time it takes for traditional program creation by businesses or EIs.\nWe market to our Customers, and enable them to offer and monetize learning products, or to deliver learning products to their own employees efficiently and cost effectively. Our Customers want the capability of delivery to their own Customers and are best able to market to them. We deliver the content and technology to enable this.\nWe protect and utilize learner data solely to improve learning outcomes. Learner data is collected with learner permission, and information about learner behavior, study preferences and preferences for types of material delivered as part of learning products, will be used to improve learning outcomes and learner experiences. We will validate algorithms using both offline and online testing. By correlating learner behaviors with specific outcomes as identified by qualified instructors, we will train our algorithms specifically for important learning outcomes, enabling it to be a useful tool for instructors. We believe that the combinations of information that will be collected through our educational products, and outcomes measured using our online learning products will be unique, and constantly improving. We will never sell or distribute our learner data to third parties without the explicit permission of learners. We will not deliver unwanted content or advertising to learners or to Customer personnel. Our proprietary technology is developed solely for purposes of improving learner experiences and outcomes and improving the ability of our Customers to deliver outstanding educational products.\nOur Research and Development Programs\nWe use advanced technologies to create effective and accessible learning environments. We seek to improve learning at many levels, including college and professional. Our research and development programs will expand continuously based on learner preferences, outcomes and the desires of our Customers. Some of these will include:\n● Improvements in learner engagement with cloud-based platforms. We will continuously gather data on how learners engage with us and other online platforms and conduct research and development to create and incorporate useful tools for learning on our platform.\n● Improvements in instructor experience using our platform. We will continuously develop tools designed to improve the ability of our Customers to deliver timely and relevant content, deliver assessments which are fair, correctly represent educational objectives and give repeatable outcomes when employed on our platform.\n● Integration of new technology in the delivery of learning products. A technology stack is a combination of software products and programming languages used to create our platform. We will continuously develop improvements to our technology stack, inventing and integrating best-in-class online engagement features. These will range from invention of novel user experience features to integration of capabilities offered by other vendors and developers.\n● Qualification of information for use by learners in all sectors. We plan to provide both our Customers and our learners with the constantly improving ability to find and integrate qualified information into products on our platform, and maximize learner ability to utilize qualified information, designed to offer learners the most carefully curated, most relevant, timely and engaging materials in every discipline in which we offer products.\nOur Intellectual Property\nOur intellectual property rights include patent applications, trade secrets, trademark rights, and contractual agreements. Our patent applications are directed to our proprietary technology, including an artificial intelligence platform for learning, and will seek patent protection for our designs, development, and related alternatives by filing and prosecuting patent applications in the U.S. and other countries as appropriate.\nWeve received two U.S. patents and currently have five pending U.S. patent applications, including one to cover the artificial intelligence platform, and others related to security, power consumption, blockchain, design and other technologies, including methods and systems. Any patent issued from these applications are expected to expire in 2038, not including any applicable patent term adjustment or extension or design patents.\nWe have protected our source codes, methodologies, algorithms, and techniques directed to other aspects of our artificial intelligence learning platform using our trade secret rights. We have received service marks for AMESITESM, KEEP LEARNINGSM and LCESM from the United States Patent and Trademark Office. We have registered a service mark for LEARNING COMMUNITY ENVIRONMENT® with the United States Patent and Trademark Office. We have also secured domain names, including amesite.com, amesite.co, amesite.net, and others.\nWe ensure that we own intellectual property created for us by signing agreements with employees, independent contractors, consultants, companies, and any other third party that creates intellectual property for us or that assign any intellectual property rights to us. Portions of our platform may rely upon third-party licensed intellectual property.\nWe have established business procedures designed to maintain the confidentiality of our proprietary information, including the use of confidentiality agreements with employees, independent contractors, consultants and entities with which we conduct business.\nCompetition\nThe online and software industries for higher education are characterized by rapid evolution of technologies, fierce competition, government regulation, and strong defense of intellectual property. The overall market for technology solutions that enable providers to deliver education online is highly fragmented, rapidly evolving and subject to changing technology, shifting needs of learners and educators and frequent introductions of new methods of delivering education online. While we believe that our platform, programs, technology, knowledge, experience, and resources provide us with competitive advantages, we face competition from major online companies, academic institutions, governmental agencies, and public and private research institutions, among others.\nAny learning product that we successfully develop and commercialize will compete with current learning products. Key product features that would affect our ability to effectively compete with other course offerings include efficiency, security and convenience, and availability. Our competitors fall primarily into the following groups:\n● Online Program Management (OPM) firms, who create and launch educational products for EIs and businesses, using either their own or others Learning Management Systems (LMSs).\n● Learning Management System (LMS) technology firms, who offer technology platforms suitable for offering online educational or training products\n● Learning product aggregators, who offer multiple ‘institutions or businesses learning products on online platforms for direct purchase by learners, or through licenses by institutions.\nMany of the companies, colleges, or universities against which we may compete have significantly greater financial resources and expertise in education, software design and development, and have already obtained approvals and marketing approved products. Smaller or early-stage companies may also prove to be significant competitors, particularly through collaborative arrangements with large and established companies. These competitors also compete with us in recruiting and retaining qualified engineers, scientists, and management personnel, as well as in acquiring technologies complementary to, or necessary for, our programs.\nWe expect that the competitive landscape will continue to expand as the market for online programs at nonprofit institutions matures. We believe the principal competitive factors in our market include the following:\n● brand awareness and reputation;\n● ability of online programs to deliver desired learner outcomes;\n● robustness and evolution of technology offering; and\n● breadth and depth of service offering.\nWe believe we compete favorably on the basis of these factors. Our ability to remain competitive will depend, to a great extent, on our ability to consistently deliver high-quality offerings; meet client needs for content development; attract, support and retain learners; and deliver desired outcomes for our Customers and their learners.\nGovernment Regulation and Product Approval\nThe education industry is heavily regulated. Institutions of higher education that award degrees and certificates to signify the successful completion of an academic program are subject to regulation from three primary entities, namely, the U.S. Department of Education (the DOE), accrediting agencies, and state licensing authorities. Each of these entities promulgates and enforces its own laws, regulations and standards, which we refer to collectively as education laws.\nWe contract with higher education institutions that are subject to education laws. In addition, we are required to comply with certain education laws as a result of our role as a service provider to institutions of higher education, either directly or indirectly through our contractual arrangements with Customers. Our failure, or that of our Customers, to comply with education laws could adversely impact our operations. As a result, we work closely with our Customers to maintain compliance with education laws.\nWe will abide by education laws, including incentive compensation rules, misrepresentation rules, accreditation rules and standards, among state and federal regulations. We also closely monitor state law developments and we will work closely with our Customers to assist them with obtaining any required approvals.\nOur activities on behalf of our Customers are also subject to other federal and state laws. These regulations include, but are not limited to, consumer marketing and unfair trade practices laws and regulations, including those promulgated and enforced by the Federal Trade Commission, as well as federal and state data protection and privacy requirements.\nSales and Marketing\nWe plan to grow our sales and marketing program as we build our Customer base, advancing from our small, direct sales force to a distribution network that has existing relationships with colleges, universities, non-profit organizations and businesses.\nWe also intend to develop a branding strategy to introduce and support our platform. The strategy may include our presence at colleges, universities, and other commercial institutions on a national, state, and regional basis to engage and educate users of our products, as well as engaging in a variety of other direct marketing methods to educational institutions and businesses. We plan to pursue selected business opportunities, including joint developments, collaborations and acquisitions that have the potential to build sales more rapidly. We aim to develop and pursue such opportunities on a consistent basis to grow the Company.\nBoard of Advisors\nDennis Bernard, Chairman of the Board of Advisors\nMr. Bernard is the founder and President of Bernard Financial Group and Bernard Financial Servicing Group (BFG). BFG is the largest commercial mortgage banking firm in Michigan, financing, on average, over $1.0 billion annually. Mr. Bernard has been involved with over 1,200 commercial real estate financial transactions totaling over $18.6 billion. Mr. Bernard specializes in both debt and equity placement with commercial lenders and institutional joint venture participants.\nMartha A. Darling, Member\nOver the past 22 years, Ms. Darling has held volunteer leadership roles nationally and in Michigan and has consulted on education policy issues for the National Academy of Sciences and other non-profit organizations. Prior to moving to Ann Arbor, Ms. Darling was a Senior Program Manager at The Boeing Company in Seattle, from which she retired in 1998. She joined Boeing in 1987, with assignments in 747 Program Management, Government Affairs and Boeings Corporate Offices, where she supported the chief executive officer and other executives. Previously, she was Vice President for Strategic Planning at Seattle-First National Bank and then, on loan from Seattle-First, she served as Executive Director of the Washington Business Roundtables Education Study. From 1977 to 1982 she served in Washington, D.C. as White House Fellow and Executive Assistant to Secretary of the Treasury W. Michael Blumenthal and then as Senior Legislative Aide to U.S. Senator Bill Bradley. She has also served as Special Assistant to the Governor of Washington, Research Social Scientist at the Battelle Seattle Research Center, and was a free-lance consultant to the Organization for Economic Cooperation and Development and other international organizations for four years in Paris.\nTheodore l. Spencer, Member\nMr. Spencer is Senior Advisor on Admissions Outreach at the University of Michigan. Prior to September 2014, he was Associate Vice Provost and Executive Director of Undergraduate Admissions. Before joining Michigan in 1989, he was an Associate Director of Admissions at the United States Air Force Academy. He is a graduate of the Military Air War College and was one of thirty-five Air Force recruiting commanders in the United States. He is a retired Lieutenant Colonel in the United States Air Force. Early in his career, he was a salesman for the IBM Corporation in the City of Detroit. Ted has presented at numerous professional conferences state-wide, nationally and internationally, and has written and published articles on the college admissions process. He has received numerous awards and was recognized as the Point Man on Diversity Defense for affirmative action in college admissions. He has previously served as a Trustee for the College Board and on the faculty for the Harvard Summer Institute on College Admissions. Ted holds a M.S. degree in sociology from Pepperdine University and a B.S. in political science from Tennessee State University.\nHuman Capital Management\nGeneral Information About Our Human Capital Resources\nAs of September 30, 2023, we have 12 full-time employees and 2 consultants. We intend to engage consultants in general administration on an as-needed basis. We also intend to engage experts in operations, finance and general business to advise us in various capacities. None of our employees are covered by a collective bargaining agreement, and we believe our relationship with our employees is good to excellent.\nOur Culture\nAmesites mission is to improve the way the world learns. We are passionate about understanding the needs of our learners, and we work hard to build products that deliver-for each and every one. We also believe that supporting our team with a wonderful environment supports and powers us to accomplish our goals. Our values are summarized in our beats-the guideposts for our culture.\n● Judgment beats rules\n● Measurement beats conjecture\n● Humility beats arrogance\n● Honesty beats politeness\n● Growth beats comfort\n● Transparency beats manipulation\n● Passion beats indifference\nDiversity and Inclusion\nTo truly change how the world learns and improve the learning process and environment for learners across the world, we need to work with a diversity of partners as well as have a diverse workforce. We also must operate with a high degree of awareness of evolving social conditions, social justice - and create policy accordingly. We acknowledge that these measures evolve over time and commit to improving our policies as awareness of social inequities or injustice arise. We believe an equitable and inclusive environment with diverse teams produces more creative solutions and results in better outcomes for our Customers, partners, employees, and stakeholders. We strive to attract, retain, and promote diverse talent at all levels of the organization. Our management team is 57% female, 29% racially diverse, and 71% female or racially diverse. The entire Amesite team is 50% female, 43% racially diverse, and 71% female or racially diverse. Additional information regarding Amesites social impact can be found in our 2021 ESG Report available at www.amesite.com.\nCorporate Information\nThe Company was incorporated in November 2017. The Company is an artificial intelligence driven platform and course designer, that provides customized, high performance and scalable online products for schools and businesses. The Company uses machine learning to provide a novel, mass customized experience to learners. The Companys Customers are businesses, universities and colleges, and K-12 schools. The Companys activities are subject to significant risks and uncertainties. The Companys operations are in one segment.\nOn September 18, 2020, we consummated a reorganizational merger (the Reorganization), pursuant to an Agreement and Plan of Merger (the Merger Agreement), dated July 14, 2020, whereby Amesite Inc. (Amesite Parent), our former parent corporation, merged with and into us, with our Company resulting as the surviving entity. In connection with the same, we filed a Certificate of Ownership and Merger with the Secretary of State of the State of Delaware, and changed our name from Amesite Operating Company to Amesite Inc. The stockholders of Amesite Parent approved the Merger Agreement on August 4, 2020. The directors and officers of Amesite Parent became our directors and officers.\nPursuant to the Merger Agreement, on the Effective Date, each share of Amesite Parents common stock, $0.0001 par value per share, issued and outstanding immediately before the Effective Date, was converted, on a one-for-one basis, into shares of our common stock. Additionally, each option or warrant to acquire shares of Amesite Parent outstanding immediately before the Effective Date was converted into and became an equivalent option to acquire shares of our common stock, upon the same terms and conditions.\nOur corporate headquarters are located at 607 Shelby Street, Suite 700 PMB 214, Detroit, Michigan 48226, and our telephone number is (734) 876-8130. We maintain a website at www.amesite.com. The contents of, or information accessible through, our website is not part of this Annual Report on Form 10-K, and our website address is included in this document as an inactive textual reference only. We make our filings with the SEC, including our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and all amendments to those reports, available free of charge on our website as soon as reasonably practicable after we file such reports with, or furnish such reports to, the SEC. The public may read and copy the materials we file with the SEC at the SECs Public Reference Room at 100 F Street, NE, Washington, D.C. 20549. The public may also obtain information on the operation of the Public Reference Room by calling the SEC at 1-800-SEC-0330. Additionally, the SEC maintains an internet site that contains reports, proxy and information statements and other information. The address of the SECs website is www.sec.gov. The information contained in the SECs website is not intended to be a part of this filing. ITEM 1A. RISK FACTORS\nYou should carefully consider the risks described below, as well as general economic and business risks and the other information in this Annual Report on Form 10-K. The occurrence of any of the events or circumstances described below or other adverse events could have a material adverse effect on our business, results of operations and financial condition and could cause the trading price of our common stock to decline. Additional risks or uncertainties not presently known to us or that we currently deem immaterial may also harm our business.\nRisks Related to Our Business\nWe have a short operating history in online programs and may fail to grow our Customer base.\nWe were incorporated in November 2017 and have no operating history in offering online courses. Historically, we have had no significant tangible assets other than cash. If our assumptions about market needs are incorrect, we may fail to launch courses and gain initial Customers. Even if we launch courses in a timely manner, our assumptions regarding recovery of upfront costs and growth of revenue may differ substantially from reality, in which case we will fail to achieve our revenue goals.\nWe have not developed a strong Customer base and we have not generated sustainable revenue since inception. There can be no assurance that we will be able to do so in the future. We will incur significant losses in launching products and we may not realize sufficient subscriptions or profits in order to sustain our business.\nWe have not yet developed a strong Customer base and we have not generated sustainable revenue since inception. We are subject to the substantial risk of failure facing businesses seeking to develop and commercialize new products and technologies. Maintaining and improving our platform will require significant capital. We also incur substantial accounting, legal and other overhead costs as a public company. If our offerings to Customers are unsuccessful, result in insufficient revenue or result in us not being able to sustain revenue, we will be forced to reduce expenses, which may result in an inability to gain new Customers.\nOur business model relies on us successfully licensing our platform and providing services to colleges, universities, and businesses for creation and online delivery of their learning products. If we fail to attract Customers, or to negotiate agreements with them that provide us with sustainable revenue, it will impair our ability to operate and grow our business.\nWe may not be able to convince educational institutions and businesses that our methods will produce better outcomes than their current approaches to online learning products, in a cost-effective manner. We may also not be able to convince them to dedicate significant resources to moving courses onto our platform and gain their trust in operating them collaboratively. If our learning products are not better, or only modestly better than the incumbent versions, we will be unable to grow and gain more Customers, which will materially harm our business.\nWe will be relying on our college, university and museum Customers to drive enrollment and revenue and continue to license our platform and pay for our services.\nFactors within and outside of our control will affect enrollments and include the following:\n● Negative perceptions about online courses. Students may reject the opportunity to take courses online, when residential courses are offered as an option, due to negative perceptions of online education.\n● Ineffective marketing efforts. Our Customers marketing efforts are required to drive enrollment of our online courses. If our Customers fail to successfully execute our marketing strategies, they may not continue to license our platform.\n● Damage to Customer reputation. Our Customers rankings, reputation and marketing efforts strongly affect enrollments, none of which we control. If we fail to gain Customers with strong, stable reputations and rankings, they will fail to achieve stable enrollments.\n● Lack of subscription to our courses. We do not control the courses required for a degree by our Customers, and if the courses we offer do not build to a degree, enrollments could suffer.\n● Reduced enrollment in higher education due to lack of funding. Significant reductions in student funding, through grants or loans, would reduce enrollments in courses on our platform and could adversely affect our business model.\n● General economic conditions. Any contraction in the economy could be expected to reduce enrollment in higher education, whether by reducing funding, reducing corporate allowances for continuing education, general reductions in employment or savings or other factors. Any of these could substantially reduce licensing of our platform.\nWe will be relying on our enterprise Customers to prioritize providing online learning programs to train or upskill their workforces.\nFactors within and outside of our control will affect enrollments and include the following:\n● General economic conditions. Any contraction in the economy could be expected to cause business leaders to deprioritize workforce training.\n● Negative perceptions about online courses. Workers may reject the opportunity to take courses online through their employers.\nWe will face intense competition, which may cause pricing pressures, decreased gross margins and loss of market share, and may materially and adversely affect our business, financial condition and results of operations.\nWe will compete with other online education services companies, and colleges and universities themselves. We expect competition in our markets to intensify as new competitors enter the online education market, existing competitors merge or form alliances and new technologies emerge. Our competitors may introduce new solutions and technologies that are superior to our platform. Certain of our competitors may be able to adapt more quickly than we can to new or emerging technologies and changes in Customer requirements or may be able to devote greater resources to the development, promotion and sale of their products than we can.\nIncreased competition could also result in pricing pressures, declining average selling prices for our service model, decreased gross margins and loss of market share. We will need to make substantial investments to develop these enhancements and technologies to our platform, and we cannot assure investors that we will have funds available for these investments or that these enhancements and technologies will be successful. If a competing technology emerges that is, or is perceived to be, superior to our existing technology and we are unable to adapt and compete effectively, our market share and financial condition could be materially and adversely affected, and our business, revenue, and results of operations could be harmed.\nWe are dependent on the services of certain key management personnel, employees, advisors, and consultants. If we are unable to retain or motivate such individuals or hire qualified personnel, we may not be able to grow effectively.\nWe depend on the services of a number of key management personnel, employees, advisors and consultants and our future performance will largely depend on the talents and efforts of such individuals. We do not currently maintain key person life insurance on any of our employees, except for our Chief Executive Officer. The loss of one or more of such key individuals, or failure to find a suitable successor, could hamper our efforts to successfully operate our business and achieve our business objectives. Our future success will also depend on our ability to identify, hire, develop, motivate and retain highly skilled personnel. Competition in our industry for qualified employees is intense, and our compensation arrangements may not always be successful in attracting new employees and/or retaining and motivating our existing employees. Future acquisitions by us may also cause uncertainty among our current employees and employees of the acquired entity, which could lead to the departure of key individuals. Such departures could have an adverse impact on the anticipated benefits of an acquisition.\nWe have risk factors within and outside of our control that may inhibit our ability to deliver products on our platform.\nOur Customers will rely on us to deliver a stable platform, with correct measures of performance in a manner that instructors, lecturers, graduate student assistants and professors can easily use.\nEven if we are successful in delivering a stable platform, our operating results may fluctuate as a result of a number of factors, many of which are outside of our control. The following factors may affect our operating results:\n● our ability to compete effectively;\n● our ability to continue to attract users to our platform;\n● our ability to attract new Customers to our platform;\n● our ability to attract colleges and universities to our platform;\n● the mix in our net revenues generated from Customers and colleges and universities;\n● the amount and timing of operating costs and capital expenditures related to the maintenance and expansion of our business, operations and infrastructure;\n● our focus on long term goals over short-term results;\n● the results of our investments in risky projects;\n● general economic conditions and those economic conditions specific to our online courses;\n● our ability to keep our platform operational at a reasonable cost and without service interruptions;\n● the success of our geographical and product expansion;\n● our ability to attract, motivate and retain top-quality employees;\n● foreign, federal, state or local government regulation that could impede our ability to operate our platform;\n● our ability to upgrade and develop our systems, infrastructure and products;\n● new technologies or services that block our platform and user adoption of these technologies;\n● the costs and results of litigation that we may face;\n● our ability to protect our intellectual property rights;\n● our ability to forecast revenue;\n● our ability to manage fraud and other activities that violate our terms of services;\n● our ability to successfully integrate and manage our colleges and universities; and\n● geopolitical events such as war, threat of war, or terrorist actions.\nWe may have risks related to our financial condition.\nWe have a history of losses, will need substantial additional funding to continue our operations and may not achieve or sustain profitability in the future.\nOur operations have consumed substantial amounts of cash since inception. We do not expect more than nominal revenues until at least some point during the fiscal year ending June 30, 2024. If our expectations prove incorrect, our business, operating results and financial condition will be materially and adversely affected. We anticipate that our operating expenses may increase in the foreseeable future as we continue to pursue the development of our platform, invest in marketing, sales and distribution of our platform to grow our business, acquire Customers, and commercialize our technology. These efforts may prove more expensive than we currently anticipate, and we may not succeed in generating sufficient revenues to offset these increased expenses. In addition, we expect to incur significant expenses related to regulatory requirements, and our ability to obtain, protect, and defend our intellectual property rights.\nWe may also encounter unforeseen expenses, difficulties, complications, delays, and other unknown factors that may increase our capital needs and/or cause us to spend our cash resources faster than we expect. Accordingly, we may need to obtain substantial additional funding to continue our operations. We cannot assure you that such additional funding will be available on favorable terms, or at all.\nWe may have risks related to managing any growth we may experience.\nWe may engage in future acquisitions that could disrupt our business, cause dilution to our stockholders and harm our financial condition and operating results.\nWhile there are currently no specific plans to acquire any other businesses, we may, in the future, make acquisitions of, or investments in, companies that we believe have products or capabilities that are a strategic or commercial fit with our current business or otherwise offer opportunities. In connection with these acquisitions or investments, we may:\n● issue shares of our common stock or other forms of equity that would dilute our existing stockholders percentage of ownership;\n● incur debt and assume liabilities; and\n● incur amortization expenses related to intangible assets or incur large and immediate write-offs.\nWe may not be able to complete acquisitions on favorable terms, if at all. If we do complete an acquisition, we cannot assure you that such acquisition will ultimately strengthen our competitive position or that such acquisition will be viewed positively by Customers, financial markets, or investors. Furthermore, future acquisitions could pose numerous additional risks to our expected operations, including:\n● problems integrating the purchased business, products, or technologies;\n● challenges in achieving strategic objectives, cost savings and other anticipated benefits;\n● increases to our expenses;\n● the assumption of significant liabilities that exceed the limitations of any applicable indemnification provisions or the financial resources of any indemnifying party;\n● inability to maintain relationships with prospective key Customers, vendors, and other business partners of the acquired businesses;\n● diversion of managements attention from their day-to-day responsibilities;\n● difficulty in maintaining controls, procedures and policies during the transition and integration;\n● entrance into marketplaces where we have limited or no prior experience and where competitors have stronger marketplace positions;\n● potential loss of key employees, particularly those of the acquired entity;\n● that historical financial information may not be representative or indicative of results as a combined entity; and\n● that our business and operations would suffer in the event of system failures, and our operations are vulnerable to interruption by natural disasters, terrorist activity, power loss and other events beyond our control, the occurrence of which could materially harm our business.\nIf our security measures or those of our future business partners are breached or fail and result in unauthorized disclosure of data, we could lose Customers and/or fail to attract new Customers. Such breach or failure could also harm our reputation and expose us to protracted and costly lawsuits.\nOur platform and computer systems store and transmit proprietary and confidential information that is subject to stringent legal and regulatory obligations. Due to the nature of our product, we face an increasing number of threats to our platform and computer systems including unauthorized activity and access, system viruses, worms, malicious code, denial of service attacks, and organized cyberattacks, any of which could breach our security and disrupt our platform. The techniques used by computer hackers and cyber criminals to obtain unauthorized access to data or to sabotage computer systems change frequently and generally are not detected until after an incident has occurred. Our cybersecurity measures or those of our future business partners may be unable to anticipate, detect or prevent all attempts to compromise our systems or those of our future business partners. Our internal computer systems and those of our future business partners are or may also be vulnerable to telecommunication and electrical failures, the occurrence of which could result in material disruptions of our services. If our security measures are breached or fail because of third-party action, employee error, malfeasance or otherwise, we could be subject to liability or our business could be interrupted, potentially over an extended period of time. Any or all of these issues could harm our reputation, adversely affect our ability to attract new Customers, cause existing Customers to scale back their offerings or elect not to renew their agreements, cause prospective students not to enroll or students to not stay enrolled in our offerings, or subject us to third-party lawsuits, regulatory fines or other action or liability. Such issues could also cause a delay in the further development of our new technology for online education. Any reputational damage resulting from breach of our systems or disruption of our services could create distrust of our company by prospective Customers. We do not currently have cyber risk insurance. If we obtain one, such insurance may not be adequate to cover losses associated with such events, and in any case, such insurance may not cover all of the types of costs, expenses and losses we could incur to respond to and remediate a security breach. As a result, we may be required to expend significant additional resources to protect against the threat of these disruptions and security breaches or to alleviate problems caused by such disruptions or breaches.\nWe may have risks related to regulatory requirements.\nOnline education is subject to ongoing regulatory obligations and review. Maintaining compliance with these requirements may result in significant additional expense to us and any failure to maintain such compliance could cause our business to suffer.\nNoncompliance with applicable regulations or requirements could subject us to investigations, sanctions, mandatory product recalls, enforcement actions, disgorgement of profits, fines, damages, civil and criminal penalties, or injunctions. An adverse outcome in any such litigation could require us to pay contractual damages, compensatory damages, punitive damages, attorneys fees and other costs. These enforcement actions could harm our business, financial condition, and results of operations. If any governmental sanctions are imposed, or if we do not prevail in any possible civil or criminal litigation, our business, financial condition, and results of operations could be materially adversely affected. In addition, responding to any action will likely result in a significant diversion of our managements attention and resources and an increase in professional fees.\nUnfavorable global economic, business, or political conditions could adversely affect our business, financial condition or results of operations.\nOur results of operations could be adversely affected by general conditions in the global economy and in the global financial markets, including conditions that are outside of our control and the impact of health and safety concerns, such as those relating to the current coronavirus pandemic (COVID-19). The recent global financial crisis in connection with COVID-19 has caused extreme volatility and disruptions in the capital and credit markets. A severe or prolonged economic downturn could result in a variety of risks to our business, including our ability to raise additional capital when needed on acceptable terms, if at all. Any of the foregoing could harm our business and we cannot anticipate all the ways in which the current economic climate and financial market conditions could adversely impact our business.\nRisks Related to Our Common Stock\nAn active trading market for our common stock may not be sustained.\nAlthough our common stock is listed on the Nasdaq Capital Market, the market for our shares has demonstrated varying levels of trading activity. Furthermore, the current level of trading may not be sustained in the future. The lack of an active market for our common stock may impair investors ability to sell their shares at the time they wish to sell them or at a price that they consider reasonable, may reduce the fair market value of their shares and may impair our ability to raise capital to continue to fund operations by selling shares and may impair our ability to acquire additional intellectual property assets by using our shares as consideration.\nWe may acquire other companies or technologies, which could divert our managements attention, result in dilution to our stockholders and otherwise disrupt our operations and adversely affect our operating results.\nWe may in the future seek to acquire or invest in businesses, applications and services or technologies that we believe could complement or expand our services, enhance our technical capabilities, or otherwise offer growth opportunities. The pursuit of potential acquisitions may divert the attention of management and cause us to incur various expenses in identifying, investigating, and pursuing suitable acquisitions, whether or not they are consummated.\nIn addition, we do not have any experience in acquiring other businesses. If we acquire additional businesses, we may not be able to integrate the acquired personnel, operations and technologies successfully, or effectively manage the combined business following the acquisition. We also may not achieve the anticipated benefits from the acquired business due to several factors, including:\n● inability to integrate or benefit from acquired technologies or services in a profitable manner;\n● unanticipated costs or liabilities associated with the acquisition;\n● difficulty integrating the accounting systems, operations and personnel of the acquired business;\n● difficulties and additional expenses associated with supporting legacy products and hosting infrastructure of the acquired business;\n● difficulty converting the Customers of the acquired business onto our platform and contract terms, including disparities in the revenue, licensing, support or professional services model of the acquired company;\n● diversion of managements attention from other business concerns;\n● adverse effects to our existing business relationships with business partners and Customers because of the acquisition;\n● the potential loss of key employees;\n● use of resources that are needed in other parts of our business; and\n● use of substantial portions of our available cash to consummate the acquisition.\nIn addition, a significant portion of the purchase price of companies we acquire may be allocated to acquired goodwill and other intangible assets, which must be assessed for impairment at least annually. In the future, if our acquisitions do not yield expected returns, we may be required to take charges to our operating results based on this impairment assessment process, which could adversely affect our results of operations.\nAcquisitions could also result in dilutive issuances of equity securities or the incurrence of debt, which could adversely affect our operating results. In addition, if an acquired business fails to meet our expectations, our operating results, business and financial position may suffer.\nMarket and economic conditions may negatively impact our business, financial condition and share price.\nConcerns over inflation, energy costs, geopolitical issues, the U.S. mortgage market and a declining real estate market, unstable global credit markets and financial conditions, and volatile oil prices have led to periods of significant economic instability, diminished liquidity and credit availability, declines in consumer confidence and discretionary spending, diminished expectations for the global economy and expectations of slower global economic growth going forward, increased unemployment rates, and increased credit defaults in recent years. Our general business strategy may be adversely affected by any such economic downturns, volatile business environments and continued unstable or unpredictable economic and market conditions. If these conditions continue to deteriorate or do not improve, it may make any necessary debt or equity financing more difficult to complete, more costly, and more dilutive. Failure to secure any necessary financing in a timely manner and on favorable terms could have a material adverse effect on our growth strategy, financial performance, and share price and could require us to delay or abandon development or commercialization plans.\nFuture sales and issuances of our securities could result in additional dilution of the percentage ownership of our shareholders and could cause our share price to fall.\nWe expect that significant additional capital will be needed in the future to continue our planned operations, including research and development, increased marketing, hiring new personnel, commercializing our products, and continuing activities as an operating public company. To the extent we raise additional capital by issuing equity securities, our shareholders may experience substantial dilution. We may sell common stock, convertible securities or other equity securities in one or more transactions at prices and in a manner, we determine from time to time. If we sell common stock, convertible securities or other equity securities in more than one transaction, investors may be materially diluted by subsequent sales. Such sales may also result in material dilution to our existing shareholders, and new investors could gain rights superior to our existing shareholders.\nWe do not intend to pay cash dividends on our shares of common stock so any returns will be limited to the value of our shares.\nWe currently anticipate that we will retain future earnings for the development, operation and expansion of our business and do not anticipate declaring or paying any cash dividends for the foreseeable future. Any return to shareholders will therefore be limited to the increase, if any, of our share price.\nWe are an emerging growth company and can avail ourselves of reduced disclosure requirements applicable to emerging growth companies, which could make our common stock less attractive to investors.\nWe are an emerging growth company, as defined in the Jumpstart Our Business Startups Act of 2012 (the JOBS Act), and we have elected to take advantage of certain exemptions from various reporting requirements that are applicable to other public companies that are not emerging growth companies including not being required to comply with the auditor attestation requirements of Section 404(b) of the Sarbanes-Oxley Act, reduced disclosure obligations regarding executive compensation in our periodic reports and proxy statements, and exemptions from the requirements of holding a nonbinding advisory vote on executive compensation and shareholder approval of any golden parachute payments not previously approved. In addition, pursuant to Section 107 of the JOBS Act, as an emerging growth company we have elected to take advantage of the extended transition period provided in Section 7(a)(2)(B) of the Securities Act, for complying with new or revised accounting standards. In other words, an emerging growth company can delay the adoption of certain accounting standards until those standards would otherwise apply to private companies. As such, our financial statements may not be comparable to companies that comply with public company effective dates.\nWe may be at risk of securities class action litigation.\nWe may be at risk of securities class action litigation. In the past, small-cap issuers have experienced significant stock price volatility, particularly when associated with regulatory requirements by governmental authorities, which our industry now increasingly faces. If we face such litigation, it could result in substantial costs and a diversion of managements attention and resources, which could harm our business and result in a decline in the market price of our common stock.\nThe Nasdaq Capital Market may delist our securities from trading on its exchange, which could limit investors ability to make transactions in our securities and subject us to additional trading restrictions.\nAlthough we expect to meet the Nasdaq Capital Markets continued listing standards, we cannot assure you that our securities will be, or will continue to be, listed on the Nasdaq Capital Market in the future. In order to continue to have our securities listed on the Nasdaq Capital Market, we must maintain and comply with certain standards including, but not limited to, standards relating to corporate governance, stockholders equity and market value of listed securities. If we are unable to comply with the continued listing requirements of the Nasdaq Capital Market our securities may be delisted from the Nasdaq Capital Market. If our securities are delisted from the Nasdaq Capital Market, we could face significant adverse consequences including, but not limited to:\n● a limited availability of market quotations for our securities;\n● a limited amount of news and analyst coverage for our Company; and\n● a decreased ability to issue additional securities or obtain additional financing in the future.\nFinancial reporting obligations of being a public company in the United States are expensive and time-consuming, and our management will be required to devote substantial time to compliance matters.\nAs a publicly traded company, we incur significant additional legal, accounting, and other expenses that we did not incur as a private company. The obligations of being a public company in the United States require significant expenditures and will place significant demands on our management and other personnel, including costs resulting from public company reporting obligations under the Exchange Act and the rules and regulations regarding corporate governance practices, including those under the Sarbanes-Oxley Act of 2002 (Sarbanes-Oxley) the Dodd-Frank Wall Street Reform and Consumer Protection Act, and the listing requirements of the stock exchange on which our securities are listed. These rules require the establishment and maintenance of effective disclosure and financial controls and procedures, internal control over financial reporting and changes in corporate governance practices, among many other complex rules that are often difficult to implement, monitor and maintain compliance with. Moreover, despite recent reforms made possible by the JOBS Act, the reporting requirements, rules, and regulations will make some activities more time-consuming and costly, particularly after we are no longer an emerging growth company. Our management and other personnel devote a substantial amount of time to ensure that we comply with all of these requirements and to keep pace with new regulations, otherwise we may fall out of compliance and risk becoming subject to litigation or being delisted, among other potential problems.\nOur principal stockholders and management own a significant percentage of our stock and will be able to exert significant control over matters subject to stockholder approval.\nOur directors, executive officers and each of our stockholders who owned greater than 5% of our outstanding Common Stock beneficially, as of June 30, 2023, own approximately 37% of our common stock. Accordingly, these stockholders have and will continue to have significant influence over the outcome of corporate actions requiring stockholder approval, including the election of directors, a merger, the consolidation, or sale of all or substantially all of our assets or any other significant corporate transaction. The interests of these stockholders may not be the same as or may even conflict with our other investors interests. For example, these stockholders could delay or prevent a change in control of us, even if such a change in control would benefit our other stockholders, which could deprive our stockholders of an opportunity to receive a premium for their Common Stock as part of a sale of the Company or our assets. The significant concentration of stock ownership may negatively impact the value of our Common Stock due to potential investors perception that conflicts of interest may exist or arise.\nOur certificate of incorporation provides that the Court of Chancery of the State of Delaware will be the sole and exclusive forum for substantially all disputes between the Company and its stockholders, which could limit stockholders ability to obtain a favorable judicial forum for disputes with the Company or its directors, officers, or employees.\nOur certificate of incorporation provides that unless the Company consents in writing to the selection of an alternative forum, the State of Delaware is the sole and exclusive forum for: (i) any derivative action or proceeding brought on behalf of the Company, (ii) any action asserting a claim of breach of a fiduciary duty owed by any director, officer or other employee of the Company to the Company or the Companys stockholders, (iii) any action asserting a claim against the Company, its directors, officers or employees arising pursuant to any provision of the Delaware General Corporation Law (the DGCL) or our certificate of incorporation or our bylaws, or (iv) any action asserting a claim against the Company, its directors, officers, employees or agents governed by the internal affairs doctrine, except for, as to each of (i) through (iv) above, any claim as to which the Court of Chancery determines that there is an indispensable party not subject to the jurisdiction of the Court of Chancery (and the indispensable party does not consent to the personal jurisdiction of the Court of Chancery within ten days following such determination), which is vested in the exclusive jurisdiction of a court or forum other than the Court of Chancery, or for which the Court of Chancery does not have subject matter jurisdiction. This exclusive forum provision would not apply to suits brought to enforce any liability or duty created by the Securities Act or the Exchange Act or any other claim for which the federal courts have exclusive jurisdiction. To the extent that any such claims may be based upon federal law claims, Section 27 of the Exchange Act creates exclusive federal jurisdiction over all suits brought to enforce any duty or liability created by the Exchange Act or the rules and regulations thereunder. Furthermore, Section 22 of the Securities Act creates concurrent jurisdiction for federal and state courts over all suits brought to enforce any duty or liability created by the Securities Act or the rules and regulations thereunder.\nSection 22 of the Securities Act creates concurrent jurisdiction for federal and state courts over all suits brought to enforce any duty or liability created by the Securities Act or the rules and regulations thereunder. However, our certificate of incorporation contains a federal forum provision which provides that unless the Company consents in writing to the selection of an alternative forum, the federal district courts of the United States of America will be the exclusive forum for the resolution of any complaint asserting a cause of action arising under the Securities Act. Any person or entity purchasing or otherwise acquiring any interest in shares of capital stock of the Corporation are deemed to have notice of and consented to this provision. The Supreme Court of Delaware has held that this type of exclusive federal forum provision is enforceable. There may be uncertainty, however, as to whether courts of other jurisdictions would enforce such provision, if applicable.\nThese choice of forum provisions may limit a stockholders ability to bring a claim in a judicial forum that it finds favorable for disputes with the Company or its directors, officers or other employees, which may discourage such lawsuits against the Company and its directors, officers and other employees. Alternatively, if a court were to find our choice of forum provisions contained in either our certificate of incorporation or bylaws to be inapplicable or unenforceable in an action, the Company may incur additional costs associated with resolving such action in other jurisdictions, which could harm its business, results of operations, and financial condition.\nCertain provisions of our certificate of incorporation and Delaware law make it more difficult for a third party to acquire us and make a takeover more difficult to complete, even if such a transaction were in stockholders interest.\nOur certificate of incorporation and the Delaware General Corporation Law contain certain provisions that may have the effect of making it more difficult or delaying attempts by others to obtain control of our Company, even when these attempts may be in the best interests of our stockholders. We also are subject to the anti-takeover provisions of the Delaware General Corporation Law, which prohibits us from engaging in a business combination with an interested stockholder unless the business combination is approved in a prescribed manner and prohibits the voting of shares held by persons acquiring certain numbers of shares without obtaining requisite approval. The statutes and our certificate of incorporation have the effect of making it more difficult to effect a change in control of our Company. ITEM 1B. UNRESOLVED STAFF COMMENTS\nNot applicable. ITEM 2. PROPERTIES\nOur corporate headquarters are located at 607 Shelby Street, Suite 700 PMB 214, Detroit, Michigan 48226. The lease term for our office and laboratory space in Ann Arbor, Michigan commenced in November 2017 with an expiration date of May 5, 2019 (the Ann Arbor Lease). In March 2019, the Ann Arbor Lease was extended through May 2022 with monthly payments of $7,942 through May 2022. In May 2020, we terminated the Ann Arbor Lease and began operating remotely with no further lease obligations.\nWe believe that our existing remote environment is adequate for our current needs. We believe that suitable additional or alternative space will be available in the future on commercially reasonable terms. ITEM 3. LEGAL PROCEEDINGS\nFrom time to time, we may be involved in certain claims and litigation arising out of the ordinary course and conduct of business. Management assesses such claims and, if it considers that it is probable that an asset had been impaired or a liability had been incurred and the amount of loss can be reasonably estimated, provisions for loss are made based on managements assessment of the most likely outcome. We are not currently a party to or aware of any proceedings that we believe will have, individually or in the aggregate, a material adverse effect on our business, financial condition, or results of operations. ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\nPART II ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nMarket Information\nOur common stock is trading on the Nasdaq Capital Market under the symbol AMST.\nShareholders\nAs of September 21, 2023, there were approximately 40 stockholders of record of our common stock. Because many of our shares of common stock are held by brokers and other institutions on behalf of stockholders, this number is not representative of the total number of beneficial owners of our stock. On September 21, 2023, the closing price of our common stock was $2.55.\nDividends\nWe have never paid or declared any cash dividends on our common stock, and we do not anticipate paying any cash dividends on our common stock in the foreseeable future. We intend to retain all available funds and any future earnings to fund the development and expansion of our business. Any future determination to pay dividends will be at the discretion of our Board of Directors and will depend upon a number of factors, including our results of operations, financial condition, future prospects, contractual restrictions, restrictions imposed by applicable law and other factors our Board of Directors deems relevant.\nRecent Sales of Unregistered Securities\nDuring the year ended June 30, 2023, 999 options to purchase common stock were issued to employees under our 2018 Equity Incentive Plan.\nOn July 12, 2022, the Company issued 10,417 shares of its common stock totaling approximately $61,250 in value to various consultants in exchange for strategic investor relations services. These shares vested immediately upon issuance.\nIn connection with the Companys September 2022 public offering of 348,485 shares of common stock, in a concurrent private placement, the Company issued warrants to purchase an aggregate of 348,485 shares of common stock. The warrants were issued pursuant to an exemption provided in Section 4(a)(2) under the Securities Act and Rule 506(b) promulgated thereunder.\nOn December 20, 2022, the Company issued 3,667 shares of its common stock totaling approximately $10,560 in value to various consultants in exchange for strategic investor relations services. These shares vested immediately upon issuance.\nAlso, during the year ended June 30, 2023, 14,083 shares of common stock were issued to consultants.\nThe foregoing issuances were exempt from registration under Section 4(a)(2) of the Securities Act. ITEM 6. [RESERVED]. ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nManagements Discussion and Analysis of Financial Condition and Results of Operations is intended to provide a reader of our financial statements with a narrative from the perspective of our management on our financial condition, results of operations, liquidity, and certain other factors that may affect our future results. You should read the following discussion and analysis of financial condition and results of operations in conjunction with our financial statements and the related notes thereto included elsewhere in this Annual Report on Form 10-K. In addition to historical information, the following discussion and analysis includes forward-looking information that involves risks, uncertainties, and assumptions. Our actual results and the timing of events could differ materially from those anticipated by these forward-looking statements because of many factors, including those discussed under Item 1A. Risk Factors and elsewhere in this Form 10-K. See Cautionary Note Regarding Forward-Looking Statements included elsewhere in this Form 10-K.\nOverview\nThe following discussion highlights our results of operations and the principal factors that have affected our financial condition as well as our liquidity and capital resources for the twelve months ended June 30, 2023 and provides information that management believes is relevant for an assessment and understanding of the statements of financial condition and results of operations presented herein. The following discussion and analysis are based on our audited financial statements contained in this Annual Report on Form 10-K, which we have prepared in accordance with United States generally accepted accounting principles, or GAAP. You should read the discussion and analysis together with such financial statements and the related notes thereto.\nOn February 15, 2023, the Company held a special meeting of stockholders (the Special Meeting). At the Special Meeting, the stockholders also approved a proposal to amend the Companys certificate of incorporation to effect a reverse split of the Companys outstanding shares of common stock, par value $0.0001 at a specific ratio within a range of one-for five (1-for-5) to a maximum of one-for-fifty (1-for-50) to be determined by the Companys board of directors in its sole discretion.\nFollowing the Special Meeting, the board of directors approved a one-for-twelve (1-for-12) reverse split of the Companys issued and outstanding shares of common stock (the Reverse Stock Split). On February 21, 2023, the Company filed with the Secretary of State of the State of Delaware a certificate of amendment to its certificate of incorporation (the Certificate of Amendment) to affect the Reverse Stock Split. The Reverse Stock Split became effective as of 4:01 p.m. Eastern Time on February 21, 2023, and the Companys common stock began trading on a split-adjusted basis when the Nasdaq Stock Market opened on February 22, 2023.\nThe Reverse Stock Split did not change the par value of the Company's common stock. Any fractional shares of common stock resulting from the Reverse Stock Split were rounded up to the nearest whole post-Reverse Stock Split share. All outstanding securities entitling their holders to acquire shares of common stock were adjusted as a result of the Reverse Stock Split. All common share and per share data are retrospectively restated to give effect to the Reverse Stock Split for all periods presented herein.\nWe are not currently profitable, and we cannot provide any assurance that we will ever be profitable. We incurred a net loss of $(4,153,303) for the twelve months ended June 30, 2023, and we incurred a net loss of $(33,449,021) for the period from November 14, 2017 (date of incorporation) to June 30, 2023.\nBasis of Presentation\nThe financial statements contained herein have been prepared in accordance with GAAP and the requirements of the SEC.\nCritical Accounting Policies and Significant Judgments and Estimates\nThis managements discussion and analysis of financial condition and results of operations is based on our financial statements, which have been prepared in accordance with U.S. GAAP. The preparation of these financial statements requires us to make estimates and assumptions that affect the reported amounts of assets and liabilities, disclosure of contingent assets and liabilities at the date of the financial statements, and the reported amounts of revenue and expenses during the reported period. In accordance with U.S. GAAP, we base our estimates on historical experience and on various other assumptions we believe to be reasonable under the circumstances. Actual results may differ from these estimates if conditions differ from our assumptions. While our significant accounting policies are more fully described in Note 2 in the Notes to Financial Statements, we believe the following accounting policies are critical to the process of making significant judgments and estimates in preparation of our financial statements.\nInternally-Developed Capitalized Software\nWe capitalize certain costs related to internal-use software, primarily consisting of direct labor and third-party vendor costs associated with creating the software. Software development projects generally include three stages: the preliminary project stage (all costs are expensed as incurred), the application development stage (certain costs are capitalized and certain costs are expensed as incurred) and the post-implementation/operation stage (all costs are expensed as incurred). Costs capitalized in the application development stage include costs related to the design and implementation of the selected software components, software build and configuration infrastructure, and software interfaces. Capitalization of costs requires judgment in determining when a project has reached the application development stage, the proportion of time spent in the application development stage, and the period over which we expect to benefit from the use of that software. Once the software is placed in service, these costs are amortized on the straight-line method over the estimated useful life of the software, which is generally three years.\nStock-Based Compensation\nWe have issued three types of stock-based awards under our stock plans: stock options, restricted stock units and stock warrants. All stock-based awards granted to employees, directors and independent contractors are measured at fair value at each grant date. We rely on the Black-Scholes option pricing model for estimating the fair value of stock-based awards granted, and expected volatility is based on the historical volatility of the Companys stock prices. Stock options generally vest over two years from the grant date and generally have ten-year contractual terms. Restricted stock units generally have a term of 12 months from the closing date of the agreement. Stock warrants issued have a term of five years. Information about the assumptions used in the calculation of stock-based compensation expense is set forth in Notes 4 and 6 in the Notes to Financial Statements.\nRevenue Recognition\nWe generate substantially all our revenue from contractual arrangements with our Customers to provide a comprehensive platform of tightly integrated technology and technology enabled services related to product offerings. Revenue related to our licensing arrangements is generally recognized ratably over the contract term commencing upon platform delivery. Revenue related to licensing arrangements recognized in a given time period will consist of contracts that went live in the current period or that went live in previous periods and are currently ongoing.\nPerformance Obligations and Timing of Recognition\nA performance obligation is a promise in a contract to transfer a distinct good or service to the Customer. A contracts transaction price is allocated to each distinct performance obligation and recognized as revenue when, or as, the performance obligation is satisfied.\nWe derive revenue from annual licensing arrangements, including maintenance fees, setup fees and other fees for course development and miscellaneous items. Our contracts with Customers typically have a term of at least one year and have at least a single performance obligation. The promises to set up and provide a hosted platform of tightly integrated technology and services partners need to attract, enroll, educate, and support learners are not distinct within the context of the contracts. This performance obligation is satisfied as the partners receive and consume benefits, which occurs ratably over the contract term.\nWe routinely provide professional services, such as custom development, non-complex implementation activities, training, and other various professional services. We evaluate these services to determine if they are distinct and separately identifiable in the context of the contract. In our contracts with Customers that contain multiple performance obligations because of this assessment, we allocate the transaction price to each separate performance obligation on a relative standalone selling price basis. Standalone selling prices of our solutions and services are typically estimated based on observable transactions when the solutions or services are sold on a standalone basis. When standalone selling prices are not observable, we utilize a cost-plus margin approach to allocate the transaction price.\nWe do not disclose the value of unsatisfied performance obligations because the consideration is allocated entirely to a wholly unsatisfied promise to transfer a service that forms part of a single performance obligation (i.e., consideration received is based on the level of product offerings, which is unknown in advance). During the year ended June 30, 2023, five Customers comprised approximately 84% of total revenue. During the year ended June 30, 2022, three Customers comprised approximately 69% of total revenue.\nWe also receive fees that are fixed in nature, such as annual license and maintenance charges. The fees are independent of the number of students that are enrolled in courses with our Customers and are allocated to and recognized ratably over the service period of the contract that the Companys platform is made available to the Customer (i.e., the Customer simultaneously receives and consumes the benefit of the software over the contract service period).\nThe following factors affect the nature, amount, timing, and uncertainty of our revenue and cash flows:\n● The majority of our Customers are private and public learning institutions across various domestic regions\n● The majority of our Customers have annual payment terms\nAccounts Receivable, Contract Assets and Liabilities\nBalance sheet items related to contracts consist of accounts receivable (net) and contract liabilities on our balance sheets. Accounts receivable (net) is stated at net realizable value, and we utilize the allowance method to provide for doubtful accounts based on managements evaluation of the collectability of the amounts due. Our estimates are reviewed and revised periodically based on historical collection experience and a review of the current status of accounts receivable. Historically, actual write-offs for uncollectible accounts have not significantly differed from prior estimates. There was no allowance for doubtful accounts on accounts receivable balances as of June 30, 2023 and 2022, respectively.\nWe may recognize revenue prior to billing a Customer when we have satisfied or partially satisfied our performance obligations as billings to our Customers may not be made until after the service period has commenced. As of June 30, 2023 and 2022, we do not have any contract assets.\nContract liabilities as of each balance sheet date represent the excess of amounts billed or received as compared to amounts recognized in revenue on our statements of operations as of the end of the reporting period, and such amounts are reflected as a current liability on our balance sheets as deferred revenue. We generally receive payments prior to completion of the service period and our performance obligations. These payments are recorded as deferred revenue until the services are delivered or until our obligations are otherwise met, at which time revenue is recognized.\nSome contracts also involve annual license fees, for which upfront amounts are received from Customers. In these contracts, the license fees received in advance of the platforms launch are recorded as contract liabilities.\nResults of Operations\nRevenue\nWe generated revenues of $845,009 for the year ended June 30, 2023 as compared to $697,001 for the year ended June 30, 2022. Revenue growth compared to prior year for the twelve months ended June 30, 2022 was primarily driven by growth in the sale of annual license fees and associated implementation and customization services.\nGeneral and Administrative\nGeneral and administrative expenses consist primarily of personnel and personnel-related expenses, including executive management, legal, finance, human resources and other departments that do not provide direct operational services. General and administrative expenses also include professional fees and other corporate expense.\nGeneral and administrative expenses for the year ended June 30, 2023, were $2,492,777 as compared to $5,183,863 for the year ended June 30, 2022. The decrease of $2,691,086 is primarily due to savings in the areas of employee payroll, legal and audit, and insurance.\nTechnology and Content Development\nTechnology and content development expenses consist primarily of personnel and personnel-related expenses and contracted services associated with the ongoing improvement and maintenance of our platform as well as hosting and licensing costs. Technology and content expenses also include the amortization of capitalized software costs.\nTechnology and content development expenses for the year ended June 30, 2023, were $1,523,547 as compared to $3,059,962 for the year ended June 30, 2022. The decrease of $1,536,415 is primarily due to savings in employee payroll and contracted programming.\nSales and Marketing\nSales and marketing expense consist primarily of activities to attract Customers to our offerings. This includes personnel and personnel-related expenses, various search engine and social media costs as well as the cost of advertising.\nSales and marketing expenses for the year ended June 30, 2023 were $1,053,193 as compared to $1,509,694 for the year ended June 30, 2022. The decrease of $456,501 is primarily due to savings with outside vendors.\nInterest Income\nFor the year ended June 30, 2023, interest income totaled $72,824 as compared to interest income of $9,230 for the year ended June 30, 2022.\nInterest Expense.\nInterest expense amounted to $1,619 for the year ended June 30, 2023 as compared to interest expense (including amortization of issuance costs) of $12,635 for the year ended June 30, 2022.\nNet Loss\nOur net loss for the year ended June 30, 2023 was $4,153,303 as compared to a net loss for the year ended June 30, 2022 of $9,059,923. The loss was substantially lower during the year ended June 30, 2023 compared to 2022 as a result of the savings discussed above.\nCapital Expenditures\nDuring the years ended June 30, 2023 and 2022, we had capital asset additions of $396,033 and $616,235, respectively, which were comprised of $368,909 and $599,660 respectively, in capitalized technology and content development, and $27,124 and $16,575, respectively, of property and equipment, including primarily computer equipment and software. We will continue to capitalize significant software development costs, comprised primarily of internal payroll, payroll related and contractor costs, as we build out and complete our technology platforms.\nFinancial Position, Liquidity, and Capital Resources\nOverview\nWe are not currently profitable, and we cannot provide any assurance that we will ever be profitable, as indicated by our losses noted above.\nDuring the period from November 14, 2017 (date of incorporation) to September 30, 2020, we raised net proceeds of approximately $11,760,000 from private placement financing transactions (stock and debt). On September 25, 2020, we completed the Offering of 250,000 shares of its common stock, $0.0001 par value per share, at an offering price of $60.00 per share (total net proceeds of approximately $12.8 million after underwriting discounts, commissions, and other offering costs).\nOn August 2, 2021, we entered into a purchase agreement (the Purchase Agreement) with Lincoln Park Capital Fund, LLC (Lincoln Park), under which, subject to specified terms and conditions, we may sell up to $16.5 million of shares of common stock. Our net proceeds under the Purchase Agreement will depend on the frequency of sales and the number of shares sold to Lincoln Park and the prices at which we sell shares to Lincoln Park. On August 2, 2021, we sold 63,260 shares of our common stock to Lincoln Park in an initial purchase under the Purchase Agreement for a total purchase price of $1,500,000. We also issued 12,726 shares of our common stock to Lincoln Park as consideration for its irrevocable commitment to purchase our common stock under the Purchase Agreement.\nOn February 16, 2022, we closed on an offering of common stock and received approximately $2.51 million of cash proceeds, net of underwriting discounts, commissions, and other offering costs (Note 4 to the Financial Statements).\nOn September 1, 2022, we closed a public offering of 348,485 shares of common stock and a concurrent private placement of warrants to purchase 348,485 shares of common stock at a combined purchase price of $6.60 per share. The net proceeds to the Company were approximately $1.85 million.\nAs of June 30, 2023, our cash balance totaled $5.36 million.\nThe Company is developing its Customer base and has not completed its efforts to establish a stabilized source of revenue sufficient to cover its expenses. The Company has had a history of net losses and negative cash flows from operating activities since inception and expects to continue to incur net losses and use cash in its operations in the foreseeable future.\nOff-Balance Sheet Arrangements\nWe did not have during the periods presented, nor do we currently have, any off-balance sheet arrangements as defined under applicable SEC rules. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nThe Company is not required to provide the information required by this Item as it is a smaller reporting company. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nReport of Independent Registered Public Accounting Firm (PCAOB ID No. 76)\nReport of Independent Registered Public Accounting Firm (PCAOB ID No. 34)\nBalance Sheets\nStatements of Operations\nStatements of Changes in Stockholders Equity\nStatements of Cash Flows\nNotes to Financial Statements\nReport of Independent Registered Public Accounting Firm\nBoard of Directors and Shareholders\nAmesite Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheet of Amesite Inc. as of June 30, 2023, and the related statements of operations, stockholders equity, and cash flows for the year then ended, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of Amesite Inc. as of June 30, 2023, and the results of its operations and its cash flows for the year then ended in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the entitys management. Our responsibility is to express an opinion on the entitys financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to Amesite Inc. in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Amesite Inc. is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audit we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the entitys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audit provides a reasonable basis for our opinion.\n/s/ Turner, Stone & Company, L.L.P.\nWe have served as Amesite Inc.'s auditor since 2023.\nDallas, Texas\nOctober 6, 2023\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the shareholders and the Board of Directors of Amesite Inc.\nOpinion on the Financial Statements\nWe have audited, before the effects of the adjustments to retrospectively apply the reverse stock split discussed in Note 4 to the financial statements, the balance sheet of Amesite Inc. (the \"Company\") as of June 30, 2022, the related statements of operations, stockholders equity, and cash flows, for the year then ended, and the related notes (collectively referred to as the \"financial statements\") (the 2022 financial statements before the retrospective effects of the reverse stock split discussed in Note 4 to the financial statements are not presented herein). In our opinion, the 2022 financial statements, before the effects of the adjustments to retrospectively apply the reverse stock split discussed in Note 4 to the financial statements, present fairly, in all material respects, the financial position of the Company as of June 30, 2022, and the results of its operations and its cash flows for the year then ended in conformity with accounting principles generally accepted in the United States of America.\nWe were not engaged to audit, review, or apply any procedures to the adjustments to retrospectively apply the reverse stock split discussed in Note 4 to the financial statements, and accordingly, we do not express an opinion or any other form of assurance about whether such retrospective adjustments are appropriate and have been properly applied. Those retrospective adjustments were audited by other auditors.\nGoing Concern\nThe 2022 financial statements of the Company were prepared assuming that the Company would continue as a going concern. As of the date of the issuance of the 2022 financial statements, the Company had a history of net losses and negative cash flows from operating activities since inception, and expected to continue to incur net losses and use cash in its operations in the foreseeable future. The resulting net losses and negative cash flows from operating activities raised substantial doubt about the Companys ability to continue as a going concern as of the date of issuance of the 2022 financial statements. The 2022 financial statements did not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audit, we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audit provides a reasonable basis for our opinion.\n/s/ Deloitte and Touche LLP\nDetroit, MI\nSeptember 28, 2022\nWe began serving as the Companys auditor in 2017. In 2022, we became the predecessor auditor.\nAmesite Inc.\nBalance Sheets\nJune 30,\nJune 30,\nAssets\nCurrent Assets\nCash and cash equivalents $ 5,360,661 $ 7,155,367\nAccounts receivable 15,000 14,545\nPrepaid expenses and other current assets 106,679 560,084\nTotal current assets 5,482,340 7,729,996\nNoncurrent Assets\nProperty and equipment - net 88,966 87,190\nCapitalized software - net 778,446 1,066,674\nTotal noncurrent assets 867,412 1,153,864\nTotal assets $ 6,349,752 $ 8,883,860\nLiabilities and Stockholders Equity\nCurrent Liabilities\nAccounts payable $ 70,070 $ 122,285\nAccrued and other current liabilities:\nAccrued compensation 64,500 174,056\nDeferred revenue 53,958 342,672\nOther accrued liabilities 76,799 109,095\nTotal current liabilities 265,327 748,108\nStockholders equity\nCommon stock, $.0001 par value; 100,000,000 shares authorized; 2,542,440 and 2,166,124 shares issued and outstanding at June 30, 2023 and 2022, respectively\nPreferred stock, $.0001 par value; 5,000,000 shares authorized; no shares issued and outstanding at June 30, 2023 and 2022, respectively\nAdditional paid-in capital 39,514,489 37,412,551\nAccumulated earnings deficit (33,430,319 ) (29,277,016 )\nTotal stockholders equity 6,084,425 8,135,752\nTotal liabilities and stockholders equity $ 6,349,752 $ 8,883,860\nSee accompanying Notes to Financial Statements\nAmesite Inc.\nStatements of Operations\nYear Ended Year Ended\nJune 30, June 30,\nNet Revenue $ 845,009 $ 697,001\nOperating Expenses\nGeneral and administrative expenses 2,492,777 5,183,863\nTechnology and content development 1,523,547 3,059,962\nSales and marketing 1,053,193 1,509,694\nTotal operating expenses 5,069,517 9,753,519\nLoss from Operations (4,224,508 ) (9,056,518 )\nOther Income (Expense)\nInterest Income 72,824 9,230\nOther Expense (1,619 ) (12,635 )\nTotal other income (expense) 71,205 (3,405 )\nNet Loss $ (4,153,303 ) $ (9,059,923 )\nEarnings per Share\nBasic and diluted loss per share\n$ (1.68 ) $ (4.67 )\nWeighted average shares outstanding 2,469,890 1,939,132\nSee accompanying Notes to Financial Statements\nAmesite Inc.\nStatement of Stockholders Equity\nAdditional\nCommon Stock Paid-In Accumulated\nShares Amount Capital Deficit Total\nBalance - July 1, 2021 1,755,330 $ 176 $ 31,952,007 $ (20,217,093 ) $ 11,735,090\nNet loss - -\n-\n(9,059,923 ) (9,059,923 )\nIssuance of common stock for consulting services 21,994 148,946 -\n148,948\nIssuance of common stock - net 388,800 3,869,511 -\n3,869,550\nStock-based compensation expense - -\n1,442,087 -\n1,442,087\nBalance - June 30, 2022 2,166,124 37,412,551 (29,277,016 ) 8,135,752\nNet loss - -\n-\n(4,153,303 ) (4,153,303 )\nIssuance of common stock for consulting services 14,083 71,938 -\n71,940\nIssuance of common stock - net 368,233 1,850,466 -\n1,850,502\nStock-based compensation expense - -\n179,534 -\n179,534\nBalance - June 30, 2023 2,542,440 $ 255 $ 39,514,489 $ (33,430,319 ) $ 6,084,425\nSee accompanying Notes to Financial Statements\nAmesite Inc.\nStatements of Cash Flows\nYear Ended Year Ended\nJune 30, June 30,\nCash Flows from Operating Activities\nNet Loss $ (4,153,303 ) $ (9,059,923 )\nAdjustments to reconcile net loss to net cash used in operating activities:\nDepreciation and amortization 682,483 875,604\nStock-based compensation expense 179,534 1,442,087\nValue of common stock issued in exchange for consulting services 71,938 148,948\nChanges in operating assets and liabilities which used cash:\nAccounts Receivable (455 ) 36,575\nPrepaid expenses and other current assets 453,405 (260,695 )\nAccounts payable (52,212 ) 77,918\nAccrued compensation (109,556 ) (25,852 )\nDeferred revenue (288,714 ) 9,472\nAccrued and other liabilities (32,296 ) 40,214\nNet cash and cash equivalents (used) in operating activities (3,249,176 ) (6,715,652 )\nCash Flows from Investing Activities\nPurchase of property and equipment (27,124 ) (16,575 )\nInvestment in capitalized software (368,909 ) (695,047 )\nNet cash and cash equivalents (used) in investing activities (396,033 ) (711,622 )\nCash flows from Financing Activities\nIssuance of common stock - net of issuance costs 1,850,503 3,869,550\nNet cash and cash equivalents provided by financing activity 1,850,503 3,869,550\nNet decrease in cash and cash equivalents (1,794,706 ) (3,557,724 )\nCash and cash equivalents, beginning of period 7,155,367 10,713,091\nCash and cash equivalents, end of year $ 5,360,661 $ 7,155,367\nSee accompanying Notes to Financial Statements\nAmesite Inc.\nNotes to Financial Statements\nJune 30, 2023 and 2022\nNote 1 - Nature of Business\nAmesite Inc. (the Company) was incorporated in November 2017. The Company is an artificial intelligence driven platform and course designer, that provides customized, high performance and scalable online products for schools and businesses. The Company uses artificial intelligence to provide a novel, mass customized experience to learners. The Companys Customers include offerors in the university, business, k-12, museum, and other non-profit markets. The Companys activities are subject to significant risks and uncertainties. The Companys operations are considered to be in one segment.\nIn the prior year's financial statements, management disclosed conditions that raised substantial doubt about the Company's ability to continue as a going concern. Since then, significant changes have occurred in the Company's financial position and operations that have mitigated these concerns.\nAdditional Financing: Subsequent to the year-end, the Company successfully secured additional financing, thereby strengthening its liquidity position and ensuring the availability of necessary resources to meet both its short-term and long-term obligations.\nExpense Reduction: Concurrently, the Company undertook a rigorous review of its operating structure and has implemented strategic expense reduction initiatives. These initiatives have resulted in a significant decrease in our operational expenses, further enhancing the Company's financial stability and outlook.\nBased on these developments and the current financial position, management believes the conditions that raised substantial doubt about the Company's ability to continue as a going concern have been alleviated. As a result, management no longer has substantial doubt about the Company's ability to continue as a going concern for the foreseeable future.\nNote 2 - Significant Accounting Policies\nBasis of Presentation\nThe financial statements of the Company have been prepared in accordance with accounting principles generally accepted in the United States of America (GAAP) and considering the requirements of the United States Securities and Exchange Commission (SEC). The Company has a fiscal year with a June 30 year end.\nUse of Estimates\nThe preparation of financial statements in conformity with generally accepted accounting principles requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities at the date of the financial statements and the reported amounts of revenue and expenses during the reporting period. Actual results could differ from those estimates.\nFair Value Measurements\nAccounting standards require certain assets and liabilities be reported at fair value in the financial statements and provide a framework for establishing that fair value. The framework for determining fair value is based on a hierarchy that prioritizes the inputs and valuation techniques used to measure fair value.\nFair values determined by Level 1 inputs use quoted prices in active markets for identical assets or liabilities that the Company has the ability to access.\nFair values determined by Level 2 inputs use other inputs that are observable, either directly or indirectly. These Level 2 inputs include quoted prices for similar assets and liabilities in active markets and other inputs such as interest rates and yield curves that are observable at commonly quoted intervals.\nLevel 3 inputs are unobservable inputs, including inputs that are available in situations where there is little, if any, market activity for the related asset. These Level 3 fair value measurements are based primarily on managements own estimates using pricing models, discounted cash flow methodologies, or similar techniques.\nIn instances wherein inputs used to measure fair value fall into different levels in the above fair value hierarchy, fair value measurements in their entirety are categorized based on the lowest level input that is significant to the valuation. The Companys assessment of the significance of particular inputs to these fair value measurements requires judgment and considers factors specific to each asset or liability.\nCash and Cash Equivalents\nThe Company considers all investments with an original maturity of three months or less when purchased to be cash equivalents. The total amount of bank deposits (checking and savings accounts) that were insured by the FDIC at year end was $250,000.\nThe Company maintains a compensating balance of $157,500 in relation to its credit card facility at June 30, 2023. This balance is held as security and is a condition of our credit card agreement with the bank. Consequently, while this amount is included in the total cash and cash equivalents reported on the balance sheet, it is not readily available for general corporate use until the credit card obligation is fulfilled or the agreement is otherwise modified.\nIncome Taxes\nA current tax liability or asset is recognized for the estimated taxes payable or refundable on tax returns for the year. Deferred tax liabilities or assets are recognized for the estimated future tax effects of temporary differences between financial reporting and tax accounting.\nDeferred tax assets are reduced by a valuation allowance to the extent management concludes it is more likely than not that the assets will not be realized. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in the statement of operations in the period that includes the enactment date.\nTechnology and Content Development\nTechnology and content development expenditures consist primarily of personnel and personnel-related expense and contracted services associated with the maintenance of our platform as well as hosting and licensing costs and are charged to expense as incurred. It also includes amortization of capitalized software costs and research and development costs related to improving our platform and creating content that are charged to expense as incurred.\nProperty and Equipment\nProperty and equipment are recorded at cost. The straight-line method is used for computing depreciation and amortization. Assets are depreciated over their estimated useful lives. The cost of leasehold improvements is depreciated (amortized) over the lesser of the length of the related leases or the estimated useful lives of the assets. Costs of maintenance and repairs are charged to expense when incurred.\nDepreciable Life - Years\nLeasehold improvements\nShorter of estimated lease term or 10 years\nFurniture and fixtures\n7 years\nComputer equipment and software\n5 years\nCapitalized Software Costs\nThe Company capitalizes costs incurred in the development of software for internal use, including the costs of the software, materials, consultants, and payroll and payroll related costs for employees incurred in developing internal use computer software. Software development projects generally include three stages: the preliminary project stage (all costs are expensed as incurred), the application development stage (certain costs are capitalized and certain costs are expensed as incurred) and the post-implementation/operation stage (all costs are expensed as incurred). Capitalization of costs requires judgment in determining when a project has reached the application development stage, the proportion of time spent in the application development stage, and the period over which we expect to benefit from the use of that software. Once the software is placed in service, these costs are amortized on the straight-line method over the estimated useful life of the software, which is generally three years.\nJune 30, June 30,\nBeginning balance $ 3,250,082 $ 2,650,422\nAdditions 368,909 599,660\nTotal cost 3,618,991 3,250,082\nAccumulated amortization 2,840,545 2,183,408\nClosing balance $ 778,446 $ 1,066,674\nAmortization expense for the years ended June 30, 2023 and 2022 was $657,137 and $845,629, respectively and included as part of Technology and content development in the Statements of Operations.\nFuture Estimated Amortization:\nFY2024 $ 478,994\nFY2025 $ 226,625\nFY2026 72,827\nTotal $ 778,446\nRevenue Recognition\nWe generate our revenue from contractual arrangements with businesses, colleges and universities to provide a comprehensive platform of integrated technology and technology enabled services related to product offerings. During the year-end June 30, 2023 and 2022, we recognized revenue from contracts with Customers of $845,009 and $697,001, respectively, of which $0 and $26,900, respectively, related to services transferred at a point in time and the remainder related to services provided over time.\nPerformance Obligations and Timing of Recognition\nA performance obligation is a promise in a contract to transfer a distinct good or service to the Customer. A contracts transaction price is allocated to each distinct performance obligation and recognized as revenue when, or as, the performance obligation is satisfied.\nWe derive revenue from annual licensing arrangements, including maintenance fees, setup fees and other fees for course development and miscellaneous items. Our contracts with Customers generally have a one-year term. The promises to set up and provide a hosted platform of tightly integrated technology and services Customers need to attract, enroll, educate, and support students are not distinct within the context of the contracts. This performance obligation is satisfied as the Customers receive and consume benefits, which occurs ratably over the contract term.\nOccasionally, we will provide professional services, such as custom development, non-complex implementation activities, training, and other various professional services. We evaluate these services to determine if they are distinct and separately identifiable in the context of the contract. In our contracts with Customers that contain multiple performance obligations because of this assessment, we allocate the transaction price to each separate performance obligation on a relative standalone selling price basis. Standalone selling prices of our solutions and services are typically estimated based on observable transactions when the solutions or services are sold on a standalone basis. When standalone selling prices are not observable, we utilize a cost-plus margin approach to allocate the transaction price.\nWe do not disclose the value of unsatisfied performance obligations because the consideration is allocated entirely to a wholly unsatisfied promise to transfer a service that forms part of a single performance obligation (i.e., consideration received is based on the level of product offerings, which is unknown in advance). During the year ended June 30, 2023, five Customers comprised approximately 87% of total revenue. During the year ended June 30, 2022, three Customers comprised approximately 69% of total revenue.\nWe also receive fees that are fixed in nature, such as annual license and maintenance charges. The fees are independent of the number of students that are enrolled in courses with our Customers and are allocated to and recognized ratably over the service period of the contract that the Companys platform is made available to the Customer (i.e., the Customer simultaneously receives and consumes the benefit of the software over the contract service period).\nThe following factors affect the nature, amount, timing, and uncertainty of our revenue and cash flows:\n● The majority of our Customers are private and public learning institutions across various domestic regions\n● The majority of our Customers have annual payment terms\nThe following table shows revenue from contracts with Customers by Customer type for the years ended June 30, 2023 and 2022, respectively.\nCustomer Type\nEnterprise $ 513,969 $ 579,664\nUniversity 331,040 97,337\nK-12 - 20,000\nTotal $ 845,009 $ 697,001\nAccounts Receivable, Contract Assets and Liabilities\nBalance sheet items related to contracts consist of accounts receivable (net) and contract liabilities on our balance sheets. Accounts receivable (net) is stated at net realizable value, and we utilize the allowance method to provide for doubtful accounts based on managements evaluation of the collectability of the amounts due. Our estimates are reviewed and revised periodically based on historical collection experience and a review of the current status of accounts receivable. Historically, actual write-offs for uncollectible accounts have not significantly differed from prior estimates. There was no allowance for doubtful accounts on accounts receivable balances as of June 30, 2023 and 2022.\nWe may recognize revenue prior to billing a Customer when we have satisfied or partially satisfied our performance obligations as billings to our Customers may not be made until after the service period has commenced. As of June 30, 2023 and 2022, we do not have any contract assets.\nContract liabilities as of each balance sheet date represent the excess of amounts billed or received as compared to amounts recognized in revenue on our statements of operations as of the end of the reporting period, and such amounts are reflected as a current liability on our balance sheets as deferred revenue. We generally receive payments prior to completion of the service period and our performance obligations. These payments are recorded as deferred revenue until the services are delivered or until our obligations are otherwise met, at which time revenue is recognized.\nSome contracts also involve annual license fees, for which upfront amounts are received from Customers. In these contracts, the license fees received in advance of the platforms launch are recorded as contract liabilities.\nThe following table provides information on the changes in the balance of contract liabilities for the years ended June 30:\nOpening balance $ 342,672 $ 333,200\nBillings 556,295 706,473\nLess revenue recognized from continuing operations (845,009 ) (697,001 )\nClosing balance $ 53,958 $ 342,672\nRevenue recognized during the years ended June 30, 2023 and 2022 that was included in the deferred revenue balance that existed in the opening balance of each year was approximately $311,806 and $315,590, respectively.\nThe deferred revenue balance as of June 30, 2023 is expected to be recognized over the next 12 months.\nNet Loss per Share\nBasic net loss per share is calculated by dividing the net loss for the year by the weighted-average number of common shares outstanding during the period. Diluted loss per share includes potentially dilutive securities such as outstanding options and warrants, using various methods such as the treasury stock or modified treasury stock method in the determination of dilutive shares outstanding during each reporting period.\nAt June 30, 2023 and June 30, 2022, the Company had 758,079 and 410,167 potentially dilutive shares of common stock related to common stock options and warrants, respectively, as determined using the if-converted method. For the years ended June 30, 2023 and 2022, the dilutive effect of common stock options and common stock warrants has not been included in the average shares outstanding for the calculation of net loss per share as the effect would be anti-dilutive as a result of our net losses in these years.\nStock-Based Compensation\nWe have issued four types of stock-based awards under our stock plans: stock options, restricted stock units, deferred stock units, and stock warrants. All stock-based awards granted to employees, directors and independent contractors are measured at fair value at each grant date. We rely on the Black-Scholes option pricing model for estimating the fair value of stock-based awards granted, and expected volatility is based on the historical volatility of the Companys stock prices. Stock options generally vest over two years from the grant date and generally have ten-year contractual terms. Restricted stock units generally have a term of 12 months from the closing date of the agreement. Stock warrants issued have a term of five years. Information about the assumptions used in the calculation of stock-based compensation expense is set forth in Notes 4 and 6 in the Notes to Financial Statements.\nRisks and Uncertainties\nThe Company operates in an industry subject to rapid change. The Companys operations are subject to significant risk and uncertainties including financial, operational, technological, and other risks associated with an early-stage company, including the potential risk of business failure.\nNote 3 - Property and Equipment\nProperty and equipment are summarized as follows:\nFor the Years Ended\nJune 30,\nFurniture and fixtures $ 41,360 $ 36,960\nComputer equipment 139,817 117,094\nTotal cost 181,177 154,054\nLess accumulated depreciation (92,211 ) (66,864 )\nClosing balance $ 88,966 $ 87,190\nDepreciation expense for the years ended June 30, 2023 and 2022 was $25,348 and $29,975, respectively and included as part of General and administrative expenses in the Statements of Operations.\nNote 4 - Common Stock\nThe Companys preferred stock has a $.0001 par value. 5,000,000 shares have been authorized while no shares have been issued or are outstanding.\nOn February 15, 2023, the Company held a special meeting of stockholders (the Special Meeting). At the Special Meeting, the stockholders also approved a proposal to amend the Companys certificate of incorporation to effect a reverse split of the Companys outstanding shares of common stock, par value $0.0001 at a specific ratio within a range of one-for five (1-for-5) to a maximum of one-for-fifty (1-for-50) to be determined by the Companys board of directors in its sole discretion.\nFollowing the Special Meeting, the board of directors approved a one-for-twelve (1-for-12) reverse split of the Companys issued and outstanding shares of common stock (the Reverse Stock Split). On February 21, 2023, the Company filed with the Secretary of State of the State of Delaware a certificate of amendment to its certificate of incorporation (the Certificate of Amendment) to affect the Reverse Stock Split. The Reverse Stock Split became effective as of 4:01 p.m. Eastern Time on February 21, 2023, and the Companys common stock began trading on a split-adjusted basis when the Nasdaq Stock Market opened on February 22, 2023.\nThe Reverse Stock Split did not change the par value of the Company's common stock. Any fractional shares of common stock resulting from the Reverse Stock Split were rounded up to the nearest whole post-Reverse Stock Split share. All outstanding securities entitling their holders to acquire shares of common stock were adjusted as a result of the Reverse Stock Split. All common share and per share data are retrospectively restated to give effect to the Reverse Stock Split for all periods presented herein.\nOn August 2, 2021, the Company entered into a purchase agreement (the Purchase Agreement), with Lincoln Park Capital Fund, LLC (Lincoln Park), under which, subject to specified terms and conditions, the Company may sell to Lincoln Park up to $16.5 million worth of common stock, par value $0.0001 per share, from time to time during the term of the Purchase Agreement, which ended on August 2, 2023. No shares were sold as part of this agreement.\nIn connection with the Purchase Agreement, the Company entered into an introducing broker agreement with Laidlaw & Company (UK) Ltd. (Laidlaw), pursuant to which the Company agreed to pay a cash fee to Laidlaw (the Introductory Fee) equal to (i) 8% of the amount of the Initial Purchase, (ii) 8% of the amount of a one-time share request up to $1,000,000 (Tranche Purchase), if any, and (iii) 4% of up to the next $13,500,000 (or up to $14,500,000 if the Tranche Purchase is not exercised).\nUpon entering into the Purchase Agreement, the Company sold 63,260 shares of common stock to Lincoln Park as an initial purchase for a total purchase price of $1,500,000 (the Initial Purchase). The Company received net proceeds from the Initial Purchase of $1,360,000 after the payment of the Introductory Fee and offering costs. As consideration for Lincoln Parks commitment to purchase up to $16.5 million of shares of common stock under the Purchase Agreement, the Company issued 12,726 shares of common stock to Lincoln Park. If Lincoln Park is requested to purchase additional shares during the term of the Purchase Agreement, the requested shares, (Regular Purchase), are limited based on the current share price of the Companys common stock. If the average price is below $36.00 per share, the Company is limited to issuing 4,167 shares per request; if the share price is between $36.00 and $48.00 per share, the limit is 6,250 shares per request, if the share price is between $48.00 and $60.00, the limit is 8,334 shares per request, and if the share price is above $60.00, the limit is 12,500 shares per request. Requests for purchases are permitted daily as long as the Companys stock price is above $6.00 per share. The price for such regular purchases will be the lower of: (i) the lowest closing price of the Companys common stock on the purchase date for such Regular Purchase and (ii) the arithmetic average of the three (3) lowest closing prices of the Companys common stock during the ten (10) consecutive business days immediately preceding. Additionally, the Company may instruct Lincoln Park to purchase additional shares of common stock that exceed the Regular Purchase limits (Accelerated Purchase). If the Company requests Lincoln Park to make an Accelerated Purchase, the price per share is discounted from average historical closing prices. No additional shares were sold to Lincoln Park in the year ended June 30, 2023.\nThe Company evaluated the contract that includes the right to require Lincoln Park to purchase additional shares of common stock in the future (put right) considering the guidance in ASC 815-40, Derivatives and Hedging - Contracts on an Entitys Own Equity (ASC 815-40) and concluded that it is an equity-linked contract that does not qualify for equity classification, and therefore requires fair value accounting. The Company has analyzed the terms of the put right and has concluded that it has no value as of June 30, 2023 and June 30, 2022.\nOn October 19, 2021 and December 2, 2021, the Company issued 826 shares of its common stock totaling approximately $18,218 and 334 shares of its common stock totaling approximately $4,480 in value, respectively, to various consulting firms in exchange for strategic investor relations services. These shares vested immediately upon issuance. During the fourth quarter of fiscal year 2022, the Company issued 20,834 shares of its common stock totaling approximately $126,250 in value, respectively, to a consulting firm in exchange for strategic advisory and digital marketing services. These shares vested immediately upon issuance.\nOn February 11, 2022, the Company entered into an underwriting agreement with Laidlaw, as representative of the several underwriters, to issue and sell up to 286,459 shares of the Companys common stock, at a public offering price of $9.60 per share. On February 14, 2022, the Company entered into an amended and restated underwriting agreement in order to increase the number of shares sold in the offering to 312,500. On February 16, 2022, the Company closed the offering, and sold 312,500 shares of common stock to Laidlaw for total gross proceeds of $3,000,000. After deducting the underwriting commission and expenses, the Company received net proceeds of approximately $2,509,550. In connection with the offering, the Company issued five (5) year warrants to the underwriter to purchase 15,625 common shares at an exercise price of $12.00.\nThe Company measures the warrants using the BSM to estimate their fair value. The fair value of the warrants issued in connection with the offering was approximately $94,165 based on the following inputs and assumptions using the BSM: (i) expected stock price volatility of 80.10%; (ii) risk free interest rate of 1.63%; and (iii) expected life of the warrants of 5 years. The warrants were fully vested on the date of grant and are included in offering costs in the Statement of Stockholders Equity.\nOn July 12, 2022, the Company issued 10,417 of its common stock totaling $61,250 in value to a consulting firm in exchange for strategic advisory and digital marketing services. These shares vested immediately upon issuance.\nOn September 1, 2022, the Company sold 348,485 shares of common stock for approximately $1.85 million, net of financing fees and expenses, and in a concurrent private placement, warrants to purchase an aggregate of 348,485 shares of common stock at an exercise price of $9.84 per share. The fair value of the warrants issued was approximately $953,460 based on the following inputs and assumptions using the BSM: (i) expected stock price volatility of 94.90%; (ii) risk free interest rate of 3.54%; and (iii) expected life of the warrants of 5.5 years.\nIn connection with the offering, the Company issued five (5) year warrants to the underwriter to purchase 17,424 shares of common stock at an exercise price of $8.25 per share. The fair value of the warrants issued in connection with the offering was approximately $42,454 based on the following inputs and assumptions using the BSM: (i) expected stock price volatility of 94.90%; (ii) risk free interest rate of 3.54%; and (iii) expected life of the warrants of 5 years. The warrants were fully vested on the date of grant and are included in offering costs.\nNote 5 - Warrants\nAs of June 30, 2023 and June 30, 2022, there were 521,038 and 118,477 warrants outstanding, respectively. During the years ended June 30, 2023 and June 30, 2022, the Company issued 402,561 and 15,625 common stock warrants, respectively, to a placement agent related to fundraising and other advisory services. The warrants are fully vested, have a term of 5 years from closing date of the private placements and an exercise price of $9.84 and $12.00 per share respectively (see Note 4 for additional terms of the warrants).\nWarrants Number of\nWarrants\nOutstanding at June 30, 2021 102,852\nGranted 15,625\nOutstanding at June 30, 2022 118,477\nGranted 402,561\nOutstanding at June 30, 2023 521,038\nThe Company measures the fair value of warrants using Black-Scholes Model. The fair value of the warrants issued during the year ended June 30, 2023 and June 30, 2022 was approximately $2,026,010 and $94,165, respectively, based on the following inputs and assumptions below.\nVolatility (percent) 94.90 % 80.1 %\nRisk-free rate (percent) 3.54 % 1.63 %\nExpected term (in years) 5.5\nNote 6 - Stock-Based Compensation\nThe Companys Equity Incentive Plan (the Plan) permits the grant of stock options, stock appreciation rights, restricted stock, or restricted stock units to officers, employees, directors, consultants, agents, and independent contractors of the Company. The Company believes that such awards better align the interests of its employees, directors, and consultants with those of its stockholders. Option awards are generally granted with an exercise price equal to the market price of the Companys stock at the date of grant; those option awards generally vest over two years from the grant date and generally have ten-year contractual terms. Certain option awards provide for accelerated vesting (as defined in the Plan).\nThe Company has reserved 633,334 shares of common stock to be available for granting under the Plan.\nThe Company estimates the fair value of each option award using a BSM that uses the weighted average assumptions included in the table below. Expected volatilities used in the BSM assumptions are based on historical volatility of the Companys stock prices. The expected term of stock options granted has been estimated using the simplified method because the Company is generally unable to rely on its limited historical exercise data or alternative information as a reasonable basis upon which to estimate the expected term of such options. The risk-free rate for periods within the contractual life of the option is based on the U.S. Treasury yield curve in effect at the time of grant. The Company has not paid any dividends on common stock since its inception and does not anticipate paying dividends on its common stock in the foreseeable future. When calculating the amount of annual compensation expense, the Company has elected not to estimate forfeitures and instead accounts for forfeitures as they occur.\nThe following table summarizes the assumptions used for estimating the fair value of the stock options granted for the year ended:\nFor the Years Ended\nJune 30,\nExpected term (years) 7.00\nRisk-free interest rate 0.12% - 2.2 %\nExpected volatility 46.3% - 93 %\nDividend yield 0 %\nA summary of option activity for the years ended June 30, 2023 and 2022 is presented below:\nOptions Number of\nShares Weighted\nAverage\nExercise\nPrice Weighted\nAverage\nRemaining\nContractual\nTerm\n(in years)\nOutstanding at June 30, 2021 268,510 23.25 8.34\nGranted 10,752 21.12 9.26\nTerminated (15,663 ) 36.12 8.69\nOutstanding and expected to vest at June 30, 2022 263,599 22.68 7.34\nGranted - -\n-\nTerminated (26,558 ) 31.20 7.85\nOutstanding and expected to vest at June 30, 2023 237,041 21.73 6.39\nThe weighted-average grant-date fair value of options granted during the year ended June 30, 2022 was $21.12. The options contained time-based vesting conditions satisfied over one to ten years from the grant date. During the year ended June 30, 2022, the Company issued 10,752 options. During the year ended June 30, 2023 and 2022, no options were exercised, and 26,558 and 15,633 options were terminated.\nOn September 28, 2021, the Board approved certain stock awards to its board members in the form of stock options and restricted stock. The stock option awards are expected to vest ratably over twelve-month period from beginning September 28, 2021 through September 28, 2022. The restricted stock awards vested over a twelve-month period beginning July 1, 2021 through June 30, 2022. The total approved compensation was $172,702 in stock options and $600,000 in restricted stock. The number of options was determined based on the fair value of the Companys share price as of the date of grant. The Company determined that there will be 28,090 of restricted shares issued upon vesting, based on the fair value of the Companys share price on the grant date.\nAccordingly, $130,486 related to the stock option grants made to the board members, was recognized as stock-based compensation expense for the twelve months ended June 30, 2022. The Company also recognized $600,000 as stock-based compensation expense related to the restricted stock unit grants made to the board members for the twelve months ended June 30, 2022 as part of general and administrative expenses. The cost related to the grants made to board members is expected to be recognized through September of 2022.\nFor the years ended June 30, 2023 and 2022, the Company recognized $179,534 and $1,442,087, in expense related to the Plan, respectively.\nAs of June 30, 2023, there was approximately $45,329 of total unrecognized compensation cost for employees and non-employees related to nonvested options. These costs are expected to be recognized through March 2026.\nNote 7 - Income Taxes\nFor the year ended June 30, 2023 and prior periods since inception, the Companys activities have not generated taxable income. A valuation allowance has been recorded on tax loss carryforwards and other deferred tax assets. Accordingly, the Company has not recognized any current or deferred income tax expense or benefit for the years ended June 30, 2023 and 2022.\nA reconciliation of the provision for income taxes to income taxes computed by applying the statutory United States federal rate to income before taxes is as follows:\nFor the Years Ended\nJune 30,\nIncome tax, at applicable federal tax rate $ (872,194 ) $ (1,894,858 )\nState income tax (207,665 ) (451,344 )\nChange in valuation allowance 1,069,422 2,440,991\nPermanent differences 10,436 125,216\nPrior period adjustment\n(220,005 )\n$ -\n$ -\nThe details of the net deferred tax asset are as follows:\nFor the Years Ended\nJune 30,\nDeferred tax assets:\nNet operating loss carryforwards $ 6,292,000 $ 6,000,166\nStock-based compensation 818,755 771,816\nCapitalization of start-up costs for tax purposes 104,596 114,800\nDepreciation 10,150 3,560\nAccrued payroll 16,770 35,559\nDeferred revenues 14,029 17,255\nCharitable contributions 4,049 3,913\nGross deferred tax assets 7,260,360 6,947,069\nValuation allowance recognized for deferred tax assets (7,057,954 ) (6,666,179 )\nNet deferred tax assets 202,396 280,890\nDeferred tax liabilities:\nCapitalized software (202,396 ) (280,890 )\nGross deferred tax liabilities (202,396 ) (280,890 )\nNet deferred tax assets - -\nThe Company has approximately $24.2 million of net operating loss carryforwards for federal and $24.2 million for state, available to reduce future income taxes. Of the $24.2 million of federal net operating losses, approximately $17,000 will expire in 2037 and the balance can be utilized indefinitely but will be limited to 80% utilization. The state net operating losses will begin to expire in 2027. Due to uncertainty as to the realization of the net operating loss carryforwards and other deferred tax assets, as a result of the Companys limited operating history and operating losses since inception, a full valuation allowance has been recorded against the Companys deferred tax assets. The Company does not have any uncertain tax positions. The net operating loss carryforwards may be subject to an annual limitation as a result of a change of ownership as defined under Internal Revenue Code Section 382. Tax years 2019-2022 remain open to examination for federal income tax purposes and by other major taxing jurisdictions to which the Company is subject.\nNote 8 - Subsequent Events\nThe company has evaluated subsequent events through October 6, 2023. No material subsequent events have been identified that would require adjustments to or disclosures in the financial statements as of and for the years ended June 30, 2023 and 2022. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone. ITEM 9A. CONTROLS AND PROCEDURES.\nEvaluation of Disclosure Controls and Procedures\nWe are required to maintain disclosure controls and procedures that are designed to ensure that information required to be disclosed in our reports filed under Rules 13a-15(e) and 15d-15(e) of the Securities Exchange Act of 1934, as amended, is recorded, processed, summarized and reported within the time periods specified in the Securities and Exchange Commissions rules and forms, and that such information is accumulated and communicated to our management, including our Chief Executive Officer (also our principal executive officer) and our Chief Financial Officer (also our principal financial and accounting officer) to allow for timely decisions regarding required disclosure.\nOur management, with the participation of our Chief Executive Officer and Chief Financial Officer, evaluated the effectiveness of our disclosure controls and procedures as of June 30, 2023. Based on that evaluation, our CEO and CFO concluded that our disclosure controls and procedures were effective as of June 30, 2023.\nManagements Annual Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting. Internal control over financial reporting is defined in Rule 13a-15(f) and 15d-15(f) promulgated under the Securities Exchange Act of 1934 as a process designed by, or under the supervision of, the companys principal executive and principal financial officers and effected by the Companys board of directors, management and other personnel, to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with accounting principles generally accepted in the United States of America.\nBecause of its inherent limitations, a system of internal control over financial reporting may not prevent or detect misstatements. Projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation. Because of the inherent limitations of internal control, there is a risk that material misstatements may not be prevented or detected on a timely basis by internal control over financial reporting. However, these inherent limitations are known features of the financial reporting process. Therefore, it is possible to design into the process safeguards to reduce, though not eliminate, this risk.\nOur management, including our CEO and CFO, conducted an evaluation of the effectiveness of our internal control over financial reporting as of June 30, 2023, based on the framework and criteria established in the Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).\nA material weakness is a deficiency, or combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of the Companys annual or interim financial statements will not be prevented or detected on a timely basis. No material weaknesses were identified.\nIn the prior year, we identified certain material weaknesses in our internal control over financial reporting in the areas of risk assessment, control activities, and monitoring activities. We have since taken significant measures to address and correct those deficiencies including formalizing our risk assessment process, implementing revised control activities and control documentation, and strengthening process controls regarding ongoing monitoring activities related to internal controls over financial reporting.\nOur CEO and CFO have evaluated the effectiveness of the company's internal control over financial reporting as of the end of the period covered by this report. Based on this evaluation, they have concluded that our internal control over financial reporting was effective as of the end of the period covered by this report, and that the previously reported material weaknesses have been adequately addressed and remediated.\nThis Annual Report on Form 10-K does not include an attestation report of our independent registered public accounting firm on internal control over financial reporting due to an exemption established by the JOBS Act for emerging growth companies. ITEM 9B. OTHER INFORMATION.\nNone.\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS.\nNot applicable.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe information required by this Item 10 will be included in our definitive Proxy Statement for the 2023 Annual Meeting of Stockholders to be filed with the SEC within 120 days after the end of our fiscal year (the Proxy Statement) and is incorporated herein by reference. ITEM 11. EXECUTIVE COMPENSATION\nThe information required in response to this Item 11 will be set forth in our Proxy Statement and is incorporated herein by reference. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS.\nThe information required in response to this Item 12 will be set forth in our Proxy Statement and is incorporated herein by reference. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE.\nThe information required in response to this Item 13 will be set forth in our Proxy Statement and is incorporated herein by reference. ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES.\nThe information required in response to this Item 14 will be set forth in our Proxy Statement and is incorporated herein by reference. ITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n(a) the following documents are filed as part of this report\n(1) Financial Statements:\nReport of Independent Registered Public Accounting Firm\nBalance Sheets\nStatements of Operations\nStatements of Changes in Stockholders Equity\nStatements of Cash Flows\nNotes to Financial Statements\n(2) Financial Statement Schedules:\nAll financial statement schedules have been omitted because they are not applicable, not required or the information required is shown in the financial statements or the notes thereto.\n(b) Exhibits\nExhibit\nFiled\nwith this\nIncorporated by Reference\nNumber\nExhibit Title\nForm 10-K\nForm\nFile No.\nExhibit\nDate Filed\n2.1*\nAgreement and Plan of Merger and Reorganization, dated April 26, 2018, by and among Lola One Acquisition Corporation, Lola One Acquisition Sub, Inc., and Amesite Inc.\nS-1\n333-248001\n2.1\n9/4/2020\n2.2\nForm of Agreement and Plan of Merger and Reorganization, dated July 14, 2020, by and between Amesite Operating Company, a Delaware corporation, and Amesite Inc., a Delaware corporation\nS-1\n333-248001\n2.2\n9/4/2020\n3.1\nCertificate of Merger of Lola One Acquisition Sub, Inc. with and into Amesite OpCo (then known as Amesite Inc.)\nS-1\n333-248001\n3.1\n9/4/2020\n3.2\nForm of Certificate of Merger relating to the merger of Amesite Inc. with and into Amesite Operating Company, to be filed with the Secretary of State of the State of Delaware.\nS-1\n333-248001\n3.2\n9/4/2020\n3.3\nAmended and Restated Certificate of Incorporation, as currently in effect.\nS-1\n333-248001\n3.3\n9/4/2020\n3.4\nAmended and Restated Certificate of Incorporation of Amesite Parent, as currently in effect.\nS-1\n333-248001\n3.4\n9/4/2020\n3.5\nSecond Amended and Restated Certificate of Incorporation, to be in effect after the completion of the Reorganization.\nS-1\n333-248001\n3.5\n9/4/2020\n3.6\nBylaws, as currently in effect.\nS-1\n333-248001\n3.6\n9/4/2020\n3.7\nAmended and restated Bylaws, to be in effect after the completion of the Reorganization.\n333-248001\n3.7\n9/4/2020\n3.8\nCertificate of Incorporation of the Registrant.\n10-Q\n3.1\n11/16/2020\n3.9\nBylaws of the Registrant.\n10-Q\n3.2\n11/16/2020\n3.10\nCertificate of Designations of Series A Preferred Stock, dated January 13, 2023\n8-K\n001-39533\n1/13/2023\n3.11\nCertificate of Amendment to Certificate of Incorporation of Amesite Inc. dated February 16, 2023\n8-K\n001-39533\n3.1\n2/21/2023\n4.1\nForm of Warrant\n001-39533\n4.1\n9/1/2022\n4.2\nForm of Placement Agent Warrant\n001-39533\n4.2\n9/1/2022\n4.3\nDescription of Registrants Securities\nX\n10.1\nForm of Subscription Agreement.\nS-1\n333-248001\n10.1\n9/4/2020\n10.2\nForm of Registration Rights Agreement\nS-1\n333-248001\n10.2\n9/4/2020\n10.3\nForm of Amended and Restated Registration Rights Agreement, dated February 14, 2020.\nS-1\n333-248001\n10.3\n9/4/2020\n10.4\nForm of Amended and Restated Registration Rights Agreement, dated April 14, 2020.\nS-1\n333-248001\n10.4\n9/4/2020\n10.5\nForm of Purchase Agreement\nS-1\n333-248001\n10.5\n9/4/2020\n10.6\nForm of Unsecured Convertible Promissory Note\nS-1\n333-248001\n10.6\n9/4/2020\nExhibit\nFiled\nwith this\nIncorporated by Reference\nNumber\nExhibit Title\nForm 10-K\nForm\nFile No.\nExhibit\nDate Filed\n10.7+\n2017 Equity Incentive Plan and forms of award agreements thereunder, assumed in the Reorganization\nS-1\n333-248001\n10.7\n9/4/2020\n10.8+\n2018 Equity Incentive Plan and forms of award agreements thereunder, assumed in the Reorganization.\nS-1\n333-248001\n10.8\n9/4/2020\n10.9+\nEmployment Agreement dated as of November 14, 2017 by and between Amesite Operating Company and Ann Marie Sastry, Ph.D.\nS-1\n333-248001\n10.9\n9/4/2020\n10.10\nLease Agreement dated as of November 13, 2017 by and between Amesite Operating Company and 205-207 East Washington, LLC.\nS-1\n333-248001\n10.10\n9/4/2020\n10.11+\nEmployment Agreement dated as of April 27, 2018 by and between the Company and Ann Marie Sastry.\nS-1\n333-248001\n10.11\n9/4/2020\n10.12+\nExecutive Agreement, effective as of June 1, 2020, by and between the Company and Ann Marie Sastry.\nS-1\n333-248001\n10.12\n9/4/2020\n10.13\nForm of Lock-up Agreement\nS-1\n333-248001\n10.13\n9/4/2020\n10.14\nConsulting Agreement by between the Company and Richard DiBartolomeo\nS-1\n333-248001\n10.14\n9/4/2020\n10.15+\nEmployment Offer Letter, dated July 14, 2020, by and between the Company and Richard DiBartolomeo\nS-1\n333-248001\n10.15\n9/4/2020\n10.16+\nKern Employment Letter, Dated January 31, 2021\n8-K\n001-39533\n10.1\n2/4/2021\n10.17\nPurchase Agreement, dated as of August 2, 2021, between Amesite, Inc. and Lincoln Park Capital Fund, LLC\n8-K\n001-39533\n10.1\n8/6/2021\n10.18\nRegistration Rights Agreement, dated as of August 2, 2021, between Amesite, Inc. and Lincoln Park Capital Fund, LLC\n8-K\n001-39533\n10.2\n8/6/2021\n10.19\nForm of Senior Indenture\nS-3\n333-260666\n4.2\n11/1/2021\n10.20\nForm of Subordinated Indenture\nS-3\n333-260666\n4.3\n11/1/2021\n10.21\nCorrao Employment Agreement, dated as of December 15, 2021\n8-K\n001-39533\n10.1\n12/21/2021\n10.22\nAmended and Restated Underwriting Agreement, dated February 12, 2022, by and between the Company and Laidlaw & Company (UK) Ltd., as representative of the several underwriters listed in Schedule I thereto.\n8-K\n001-39533\n1.1\n2/16/2022\n10.23\nForm of Underwriters Warrant\n8-K\n4.1\n2/16/2022\n10.24\nMaster Services Agreement, dated as of August 26, 2022, by and between the Company and NAFEO\n8-K\n001-39533\n1.1\n8/29/2022\n10.25\nForm of Securities Purchase Agreement\n8-K\n001-39533\n10.1\n9/1/2022\n10.26\nForm of Placement Agency Agreement\n8-K\n001-39533\n10.2\n9/1/2022\n10.27\nForm of Lock-Up Agreement\n8-K\n001-39533\n10.3\n9/1/2022\nExhibit\nFiled\nwith this\nIncorporated by Reference\nNumber\nExhibit Title\nForm 10-K\nForm\nFile No.\nExhibit\nDate Filed\n10.28+\nFarrell CFO Agreement\n8-K\n001-39533\n10.1\n12/15/2022\n10.29\nSubscription and Investment Representation Agreement\n8-K\n001-39533\n10.1\n1/13/2023\n10.30+\nFirst Amendment to Amesite Inc. 2018 Equity Incentive Plan\n8-K\n001-39533\n10.1\n2/21/2023\n16.1\nLetter from Deloitte & Touche LLP dated February 2, 2023\n8-K\n001-39533\n16.1\n2/2/2023\n23.1\nConsent of Deloitte & Touche LLP\nX\n23.2\nConsent of Turner, Stone & Company, L.L.P\nX\n31.1\nCertification of Chief Executive Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\nX\n31.2\nCertification of Chief Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\nX\n32.1\nCertification of Chief Executive Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\nX\n32.2\nCertification of Chief Financial Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\nX\n101.INS\nInline XBRL Instance Document.\nX\n101.SCH\nInline XBRL Taxonomy Extension Schema Document.\nX\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document.\nX\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document.\nX\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document.\nX\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document.\nX\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101).\n* Pursuant to Item 601(b)(2) of Regulation S-K promulgated by the SEC, certain schedules have been omitted. The registrant hereby agrees to furnish supplementally to the SEC, upon its request, any or all omitted schedules.\n* Management contracts or compensation plans or arrangements in which directors or executive officers are eligible to participate.\nITEM 16. FORM 10-K SUMMARY\nNot applicable.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nAMESITE INC.\nDate: October 6, 2023 By: /s/ Ann Marie Sastry\nAnn Marie Sastry, Ph.D.\nChief Executive Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/ Ann Marie Sastry, Ph.D.\nChief Executive Officer, President\nand Chairman of the Board\nOctober 6, 2023\nAnn Marie Sastry, Ph.D.\n(Principal Executive Officer)\n/s/ Sherlyn W. Farrell\nChief Financial Officer\nOctober 6, 2023\nSherlyn W. Farrell\n(Principal Financial Officer and\nPrincipal Accounting Officer)\n/s/ Anthony M. Barkett\nDirector\nOctober 6, 2023\nAnthony M. Barkett\n/s/ Barbie Brewer\nDirector\nOctober 6, 2023\nBarbie Brewer\n/s/ Michael Losh\nDirector\nOctober 6, 2023\nMichael Losh\n/s/ Richard T. Ogawa\nDirector\nOctober 6, 2023\nRichard T. Ogawa\n/s/ Gilbert S. Omenn, M.D., Ph.D.\nDirector\nOctober 6, 2023\nGilbert S. Omenn, M.D., Ph.D.\n/s/ George Parmer\nDirector\nOctober 6, 2023\nGeorge Parmer\n1.68 4.67\nfalse FY\n2022-07-01 2023-06-30\n2022-12-31\n2023-09-29\namst:AuditorTwoThousandTwentyTwoMember\n2022-07-01 2023-06-30\n2023-06-30\n2022-06-30\n2021-07-01 2022-06-30\nus-gaap:CommonStockMember\n2021-06-30\nus-gaap:AdditionalPaidInCapitalMember\n2021-06-30\nus-gaap:RetainedEarningsMember\n2021-06-30\n2021-06-30\nus-gaap:CommonStockMember\n2021-07-01 2022-06-30\nus-gaap:AdditionalPaidInCapitalMember\n2021-07-01 2022-06-30\nus-gaap:RetainedEarningsMember\n2021-07-01 2022-06-30\nus-gaap:CommonStockMember\n2022-06-30\nus-gaap:AdditionalPaidInCapitalMember\n2022-06-30\nus-gaap:RetainedEarningsMember\n2022-06-30\nus-gaap:CommonStockMember\n2022-07-01 2023-06-30\nus-gaap:AdditionalPaidInCapitalMember\n2022-07-01 2023-06-30\nus-gaap:RetainedEarningsMember\n2022-07-01 2023-06-30\nus-gaap:CommonStockMember\n2023-06-30\nus-gaap:AdditionalPaidInCapitalMember\n2023-06-30\nus-gaap:RetainedEarningsMember\n2023-06-30\namst:ServicesTransferredMember\n2022-07-01 2023-06-30\namst:ServicesTransferredMember\n2021-07-01 2022-06-30\namst:FiveCustomersMember\n2023-06-30\namst:ThreeCustomerMember\n2022-06-30\nus-gaap:LeaseholdImprovementsMember\n2022-07-01 2023-06-30\nus-gaap:FurnitureAndFixturesMember\n2023-06-30\nus-gaap:ComputerEquipmentMember\n2023-06-30\namst:EnterpriseMember\n2022-07-01 2023-06-30\namst:EnterpriseMember\n2021-07-01 2022-06-30\namst:UniversityMember\n2022-07-01 2023-06-30\namst:UniversityMember\n2021-07-01 2022-06-30\namst:K12Member\n2021-07-01 2022-06-30\namst:K12Member\n2023-06-30\namst:K12Member\n2022-06-30\n2023-02-15\namst:LincolnParkCapitalFundLLCMember\n2021-08-01 2021-08-02\namst:LincolnParkCapitalFundLLCMember\n2021-08-02\nus-gaap:ShareBasedCompensationAwardTrancheOneMember\n2022-07-01 2023-06-30\nus-gaap:ShareBasedCompensationAwardTrancheTwoMember\n2022-07-01 2023-06-30\nus-gaap:ShareBasedCompensationAwardTrancheThreeMember\n2022-07-01 2023-06-30\nsrt:MinimumMember us-gaap:ShareBasedCompensationAwardTrancheThreeMember\n2022-07-01 2023-06-30\nsrt:MaximumMember us-gaap:ShareBasedCompensationAwardTrancheThreeMember\n2022-07-01 2023-06-30\namst:LincolnParkCapitalFundLLCMember\n2022-07-01 2023-06-30\namst:RegularPurchaseMember\n2022-07-01 2023-06-30\nsrt:MinimumMember\n2023-06-30\nsrt:MaximumMember\n2023-06-30\nsrt:MinimumMember amst:LincolnParkCapitalFundLLCMember\n2023-06-30\nsrt:MaximumMember amst:LincolnParkCapitalFundLLCMember\n2023-06-30\namst:InitialPurchaseMember\n2022-07-01 2023-06-30\namst:RegularPurchaseMember\n2023-06-30\namst:AcceleratedPurchaseMember\n2023-06-30\n2021-10-01 2021-12-02\n2021-12-02 2021-12-02\n2021-12-02\n2022-02-01 2022-02-11\n2022-02-11\n2022-02-01 2022-02-16\namst:BlackScholesModelMember\n2022-07-01 2023-06-30\n2020-11-03\n2022-09-01\n2020-08-25 2022-09-01\nus-gaap:WarrantMember\n2023-06-30\namst:BlackScholesModelMember\n2022-06-30\namst:BlackScholesModelMember\n2022-07-01 2023-06-30\namst:BlackScholesModelMember\n2021-07-01 2022-06-30\nsrt:MinimumMember\n2021-07-01 2022-06-30\nsrt:MaximumMember\n2021-07-01 2022-06-30\n2020-06-30\n2020-07-01 2021-06-30\niso4217:USD\nxbrli:shares\niso4217:USD\nxbrli:shares\nxbrli:pure"
}