{
    "cik": "1815632",
    "company": "Tego Cyber, Inc.",
    "filing_type": "10-K",
    "filing_date": "2022-11-14",
    "period_of_report": "2022-06-30",
    "sic": "7370",
    "state_of_inc": "NV",
    "state_location": "NV",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1815632/0001654954-22-015167-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1815632/000165495422015167/tgcb_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1815632/0001654954-22-015167.txt",
    "filename": "1815632_10K_2022_0001654954-22-015167.htm",
    "content": "Item 1.\nBusiness Item 1A.\nRisk Factors Item 1B.\nUnresolved Staff Comments Item 2. Properties\nOur executive offices are located at 8565 South Eastern Avenue, Suite 150 Las Vegas, Nevada 89123. This space is sufficient to meet our needs, however, once we expand our business to a significant degree, we will have to find a larger space. We do not foresee any significant difficulties in obtaining any required additional space. We do not currently own any real property. Item 3. Legal Proceedings\nFrom time to time, we may become subject to various legal proceedings that are incidental to the ordinary conduct of its business. Although we cannot accurately predict the amount of any liability that may ultimately arise with respect to any of these matters, it makes provision for potential liabilities when it deems them probable and reasonably estimable. These provisions are based on current information and legal advice and may be adjusted from time to time according to developments.\nWe know of no material, existing or pending legal proceedings against our company, nor are we involved as a plaintiff in any material proceeding or pending litigation. There are no proceedings in which any of our directors, officers or affiliates, or any registered or beneficial stockholder, is an adverse party or has a material interest adverse to our interest. Item 4. Mine Safety Disclosures\nNot applicable.\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity\nCommon Stock\nOur Articles of Incorporation authorize us to issue 50,000,000 shares of common stock, par value $0.001.\nThe following statements relating to the capital stock set forth the material terms of the securities of our company. Reference is also made to the more detailed provisions of the certificate of incorporation and the by-laws, copies of which are filed as exhibits to this registration statement.\nVoting Rights: Except as otherwise required by law or as may be provided by the resolutions of the board of directors authorizing the issuance of Common Stock, all rights to vote and all voting power shall be vested in the holders of Common Stock. Each share of Common Stock shall entitle the holder thereof to one vote.\nNo Cumulative Voting: Except as may be provided by the resolutions of the board of directors authorizing the issuance of Common Stock, cumulative voting by any shareholder is expressly denied.\nNo Preemptive Rights: Preemptive rights shall not exist with respect to shares of Common Stock or securities convertible into shares of Common Stock of the Company.\nDividends: We have not paid any cash dividends on our Common Stock since inception and presently anticipate that all earnings, if any, will be retained for development of our business and that no dividends on our Common Stock will be declared in the foreseeable future. Any future dividends will be subject to the discretion of our Board of Directors and will depend upon, among other things, future earnings, operating and financial condition, capital requirements, general business conditions and other pertinent facts. Therefore, there can be no assurance that any dividends on our Common Stock will be paid in the future.\nRights upon Liquidation, Dissolution or Winding-Up of the Company: Upon any liquidation, dissolution or winding-up of our company, whether voluntary or involuntary, the remaining net assets shall be distributed pro rata to the holders of the Common Stock.\nPreferred Stock\nWe have no preferred stock authorized.\nSecurities Authorized for Issuance Under Equity Compensation Plans\nOn December 8, 2021, our Board of Directors approved the adoption of the 2021 Equity Compensation Plan (the Equity Compensation Plan) to provide employees, certain consultants and advisors who perform services for us, and non-employee members of our Board of Directors, with the opportunity to receive grants of incentive stock options, nonqualified stock options, stock appreciation rights, stock awards, stock units and other stock-based awards. We have 10,000,000 common stock shares authorized under the Equity Compensation Plan\nStock Options\nDuring the year ended June 30, 2022, we issued a total of 6,000,000 non-qualified stock options (the options) to directors, officers and certain key consultants. These options are subject to the terms and conditions of the Equity Compensation Plan. All granted options are subject to a five-year vesting schedule equal to 20% per year starting on the 1st day of each year following the effective date. All options have an exercise price of $0.65 which was the closing price of our common stock on the day the day grant. The following table sets forth the number of non-qualified stock options, their exercise prices, vesting dates, and expiry dates.\nNumber of Options\nExercise Prices\nVesting Dates\nExpiry Dates\n1,200,000\n$0.65\nJanuary 1, 2023\n10 Years from date of grant\n1,200,000\n$0.65\nJanuary 1, 2024\n10 Years from date of grant\n1,200,000\n$0.65\nJanuary 1, 2025\n10 Years from date of grant\n1,200,000\n$0.65\nJanuary 1, 2026\n10 Years from date of grant\n1,200,000\n$0.65\nJanuary 1, 2027\n10 Years from date of grant\nPerformance Stock Units\nDuring the year ended June 30, 2022, we issued a total of 4,000,000 performance stock units (performance units) to directors, officers and certain key consultants. These performance units are subject to the terms and conditions of the Equity Compensation Plan. The performance units will be earned and vest upon reaching certain market capitalization goals during the performance period ending on December 31, 2026. The following table sets forth the number of performance stock units, their vesting conditions and expiry dates.\nNumber of Performance Units\nVesting Conditions\nExpiry Dates\n1,000,000\nMarket capitalization of the Company reaches $25 million\nDecember 31, 2026\n1,000,000\nMarket capitalization of the Company reaches $50 million\nDecember 31, 2026\n1,000,000\nMarket capitalization of the Company reaches $75 million\nDecember 31, 2026\n1,000,000\nMarket capitalization of the Company reaches $100 million\nDecember 31, 2026\nWarrants\nCommon Stock Purchase Warrants. As of November 10, 2022, there are an aggregate 5,014,026 outstanding Common Stock Purchase Warrants (Warrants), the terms of which are summarized below:\nExercisability. The outstanding Common Stock Purchase Warrants (Warrants) are exercisable immediately upon issuance. The warrants will be exercisable, at the option of each holder, in whole or in part, by delivering to us a duly executed exercise notice accompanied by payment in full for the number of shares of our common stock purchased upon such exercise (except in the case of a cashless exercise as discussed below). Unless otherwise specified in the warrant, the holder will not have the right to exercise any portion of the Warrant if the holder (together with its affiliates) would beneficially own in excess of 4.99% of the number of shares of our common stock outstanding immediately after giving effect to the exercise (or, upon election by a Holder prior to the issuance of any warrants, 9.99%), as such percentage ownership is determined in accordance with the terms of the Warrants.\nCashless Exercise. In the event that a registration statement covering shares of common stock underlying the Warrants, is not available for the issuance of such shares of common stock underlying the Warrants, the holder may, in its sole discretion, exercise the warrant in whole or in part and, in lieu of making the cash payment otherwise contemplated to be made to us upon such exercise in payment of the aggregate exercise price, elect instead to receive upon such exercise the net number of shares of common stock determined according to the formula set forth in the warrant. In no event shall we be required to make any cash payments or net cash settlement to the registered holder in lieu of issuance of common stock underlying the Warrants.\nCertain Adjustments. The exercise price and the number of shares of common stock purchasable upon the exercise of the Warrants are subject to adjustment upon the occurrence of specific events, including stock dividends, stock splits, combinations and reclassifications of our common stock, and dilutive issuances as defined in the Warrants.\nTransferability. Subject to applicable laws, the Warrants may be transferred at the option of the holders upon surrender of the Warrants to the Company together with the appropriate instruments of transfer.\nRights as a Stockholder. Except as otherwise provided in the Warrants or by virtue of such holders ownership of shares of our common stock, the holder of a warrant does not have the rights or privileges of a holder of our common stock, including any voting rights, until the holder exercises the warrant.\nBeneficial Ownership Limitation. Holders exercise shall be limited 4.99% of the Companys outstanding common stock (or, upon election by a Holder prior to the issuance of any Warrants, 9.99%) of the number of shares of the common stock outstanding immediately after giving effect to the issuance of shares of common stock issuable upon exercise. The Holder, upon notice to the Company, may increase or decrease the beneficial ownership limitation provided that the beneficial ownership limitation in no event exceeds 9.99% of the number of shares of the common stock outstanding immediately after giving effect to the issuance of shares of common stock upon exercise of the warrant held by the Holder. Any increase in the beneficial ownership limitation will not be effective until the 61st day after such notice is delivered to the Company.\nThe following table set forth the number of warrants, exercise prices and expiry dates\nNumber of Warrants\nExercise Price\nExpiry Date\n1,100,000\n$0.25\nDecember 28, 2022\n1,100,000\n$0.25\nMarch 25, 2023\n506,838\n$0.25\nApril 15, 2023\n307,408\n$0.25\nApril 28, 2023\n500,000\n$0.25\nJuly 12, 2027\n250,000\n$0.25\nJuly 15, 2027\n250,000\n$0.25\nJuly 18, 2027\n1,000,000\n$0.25\nOctober 13, 2027\nDividend Policy\nWe have never paid any cash dividends and intends, for the foreseeable future, to retain any future earnings for the development of our business. Our future dividend policy will be determined by the board of directors on the basis of various factors, including our results of operations, financial condition, capital requirements and investment opportunities.\nHolders\nAs of November 10, 2022, we have 27,316,337 issued and outstanding shares of Common Stock, which are held by approximately 400 shareholders of record.\nTransfer Agent and Registrar\nTego Cyber Inc. has appointed Signature Stock Transfer Inc. as its transfer agent. Signatures address is 14673 Midway Road, Suite #220, Addison, Texas, 75001. The transfer agent is responsible for all record-keeping and administrative functions in connection with the common shares.\nMarket Information\nOur common shares are currently quoted on the OTCQB under the symbol \"TGCB. The following table sets forth the range of the high and low sale prices of the common stock for the periods indicated. The quotations reflect inter-dealer prices, without retail markup, markdown or commission, and may not represent actual transactions. Consequently, the information provided below may not be indicative of our common stock price under different conditions.\nPeriod Ended\nHigh\nLow\nYear Ended June 30, 2022\nThrough June 30, 2022\n$0.80\n$0.53\nMarch 31, 2022\n$0.94\n$0.5301\nDecember 31, 2021\n$0.90\n$0.52\nSeptember 30, 2021\n$0.97\n$0.51\nYear Ended June 30, 2021 (1)\nJune 30, 2021\n$1.25\n$0.30\n(1)\nThe shares of our common stock were not approved for trading on the OTCQB until February 19, 2021. The first trade occurred on April 12, 2021, which is why there is limited historical trading data for the fiscal year ended June 30, 2021.\nAs of November 10 , 2022, the high and low sales price of our common stock was $1.25 per share and $0.2613 per share, respectively. As of November 10, 2022, there were 27,316,377 shares of common stock outstanding held by approximately 400 stockholders of record.\nTrades in our common stock may be subject to Rule 15g-9 of the Exchange Act, which imposes requirements on broker/dealers who sell securities subject to the rule to persons other than established customers and accredited investors. For transactions covered by the rule, broker/dealers must make a special suitability determination for purchasers of the securities and receive the purchasers written agreement to the transaction before the sale.\nPenny Stock Regulation\nPenny stocks generally are equity securities with a price of less than $5.00 per share other than securities registered on national securities exchanges or listed on the Nasdaq Stock Market, provided that current price and volume information with respect to transactions in such securities are provided by the exchange or system. The penny stock rules impose additional sales practice requirements on broker-dealers who sell such securities to persons other than established customers and accredited investors (generally those with assets in excess of $1,000,000 or annual income exceeding $200,000, or $300,000 together with their spouse). For transactions covered by these rules, the broker-dealer must make a special suitability determination for the purchase of such securities and have received the purchaser's written consent to the transaction prior to the purchase. Additionally, for any transaction involving a penny stock, unless exempt, the rules require the delivery, prior to the transaction, of a disclosure schedule prescribed by the SEC relating to the penny stock market. The broker-dealer also must disclose the commissions payable to both the broker-dealer and the registered representative and current quotations for the securities. Finally, monthly statements must be sent disclosing recent price information on the limited market in penny stocks. Because of these penny stock rules, broker-dealers may be restricted in their ability to sell our common stock. The foregoing required penny stock restrictions will not apply to our common stock if such stock reaches and maintains a market price of $5.00 per share or greater.\nAdditional Information\nWe refer you to our Articles of Incorporation, Bylaws, and the applicable provisions of the Nevada Revised Statues for a more complete description of the rights and liabilities of holders of our securities. Item 6. [Reserved]\nWe are a smaller reporting company as defined by Rule 12b-2 of the Exchange Act and are not required to provide the information required under this item. Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations.\nThe following discussion of our financial condition and results of operations should be read in conjunction with the financial statements and related notes to the financial statements included elsewhere in this Registration Statement. Some of the statements under Managements Discussion and Analysis, Description of Business and elsewhere herein may include forward-looking statements which reflect our current views with respect to future events and financial performance. These statements include forward-looking statements both with respect to us specifically and the renewable energy industry in general. Statements which include the words expect, intend, plan, believe, project, anticipate, will, and similar statements of a future or forward-looking nature identify forward-looking statements for purposes of the federal securities laws or otherwise. The safe harbor provisions of the federal securities laws do not apply to any forward-looking statements contained in this Registration Statement. All forward-looking statements address such matters that involve risks and uncertainties. Accordingly, there are or will be important factors that could cause our actual results to differ materially from those indicated in these statements. We undertake no obligation to publicly update or review any forward-looking statements, whether as a result of new information, future developments or otherwise. If one or more of these or other risks or uncertainties materialize, or if our underlying assumptions prove to be incorrect, actual results may vary materially from what we projected. Any forward-looking statements you read herein reflect our current views with respect to future events and are subject to these and other risks, uncertainties and assumptions relating to our written and oral forward-looking statements attributable to us or individuals acting on our behalf and such statements are expressly qualified in their entirety by this paragraph.\nOverview\nWe were incorporated in the State of Nevada on September 6, 2019. We have developed a cyber threat intelligence application that integrates with top end security platforms to gather, analyze, then proactively identify threats to an enterprise network. The Tego Guardian app takes in vetted and curated threat data and through a proprietary process compiles, analyzes, and delivers that data to an enterprise network in a format that is timely, informative and relevant. The first version of the Tego Guardian app integrates with the Splunk SIEM (Security Information and Event Management) platform. Splunk is a recognized industry leader in data analytics and has an established user base of over 22,000 enterprise clients including 90 of the Fortune 100 companies. The Tego Guardian app will be marketed as a value-add enhancement to an existing Splunk SIEM environment. Tego Guardian adds value by providing data enrichment: a detailed ‘who, what, when and where of any potential cyberthreat within an enterprise network environment. Other similar applications identify that something is ‘bad but do not provide any additional context, so it is up to the enterprises cybersecurity team to analyze the threat data to establish which threats need to be acted upon. It is then up to the enterprises cybersecurity team to analyze the threat data to establish which threats need to be acted upon. Tego Guardian automates this process thereby saving the enterprise time and money. The Tego Guardian app is now available to Splunk SIEM platform users via direct download through Splunks app store: Splunkbase. Tego Cyber plans to develop future versions of the Tego Guardian app for integration with other leading SIEM platforms including Elastic, Devo, IBM QRadar, AT&T Cybersecurity, Exabeam and Google Chronical. The goal is to have a version of the Tego Guardian available for integration with these SIEM platforms within the next two years. For more information, please visit www.tegocyber.com.\nResults of operations for fiscal year ended June 30, 2022 compared to year ended June 30, 2021\nRevenues\nWe are in development stage and only generated $3,550 of revenue for the fiscal year ended June 30, 2022 compared to $8,100 for the fiscal year ended June 30, 2021.\nOperating Expenses\nWe incurred total operating expenses of $3,085,319 for the fiscal year ended June 30, 2022, compared to $674,918 for the fiscal year ended June 30, 2021. These amounts consisted of the following:\nGeneral & administration\n$ 1,258,539\n$ 367,854\nProfessional fees\n749,607\n238,894\nSales & marketing\n171,211\n68,170\nShare-based compensation\n905,962\n-\nTotal operating expenses\n$ 3,085,319\n$ 674,918\nOverall operating expenses increased by $2,410,401 to $3,085,319 for the year ended June 30, 2022, as compared to $674,918 for the year ended June 30, 2021. General and administration increased by $890,739 as result of increased operational expenses due to the growth of the overall business and setting up of the infrastructure in preparation of full commercialization of the first version of the Tego Guardian. Professional fees increased by $510,713 as a result of being fully reporting with the SEC for one full year and the additional expenditures that go along with being a publicly traded company. Sales and marketing increased by $239,381 as a result of the initial commercialization of the first version of the Tego Guradian. Share-based compensation expense increased $905,962 as a result of the issuance of the non-qualified stock options and performance stock units. .\nNet Loss\nWe incurred a net loss of $3,147,901 for the fiscal year ended June 30, 2022 compared to a net loss of $923,180 for the fiscal year ended June 30, 2021.\nLiquidity and Capital Resources\nAs at June 30, 2022, we have a working capital surplus of $48,945, a net loss of $3,147,901 and have earned limited revenue to cover our operating costs. We have $47,742 cash on hand and our burn rate is approximately $150,000 per month. We intend to fund future operations through debt or equity financing arrangements. Our ability to realize our business plan is dependent upon, among other things, obtaining additional financing to continue operations, and development of our business plan. In response to these problems, management intends to raise additional funds through debt, public or private placement offerings. These factors, among others, raise substantial doubt about our ability to continue as a going concern. The accompanying financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nCash Flow from Operating Activities\nFor the fiscal year ended June 30, 2022, the cash flows used in our operating activities was $1,618,526 compared to $578,415 for the same period ended June 30, 2021. This amount was primarily related to a (i) net loss of $3,147,901; (ii) share based compensation of $905,962; and (iii) shares issued for services of $458,250\nCash Flow from Investing Activities\nFor the fiscal year ended June 30, 2022, the net cash used in investing activities by the Company was $341,949 compared to $54,250 for the same period ended June 30, 2021. The amount was related to the capitalization of software development costs of $335,372 and purchase of computer equipment of $6,577.\nCash Flow from Financing Activities\nFor the fiscal year ended June 30, 2022, the net cash provided by financing activities by the Company was $1,425,202 compared to $1,133,808 for the same period ended June 30, 2021. The cash provided by financing activities is related to the proceeds received from sales of our common stock.\nContractual Obligations\nWe are a smaller reporting company as defined by Rule 12b-2 of the Securities Exchange Act of 1934 and are not required to provide the information under this item.\nFuture Financings\nWe will continue to rely on equity sales of our common shares and debt proceeds in order to continue to fund our business operations. Issuances of additional shares will result in dilution to existing stockholders. There is no assurance that we will achieve any additional sales of the equity securities or arrange for debt or other financing to fund our operations and other activities.\nExpected Purchase or Sale of Significant Equipment\nWe do not anticipate the purchase or sale of any significant equipment, as such items are not required by us at this time or in the next twelve months.\nOff-Balance Sheet Arrangements\nWe have no significant off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources that are material to stockholders.\nCritical Accounting Policies\nThis summary of significant accounting policies is presented to assist in understanding the financial statements. The financial statements and notes are representations of the Companys management, who are responsible for their integrity and objectivity. These accounting policies conform to US GAAP and have been consistently applied in the preparation of the financial statements.\nBasis of Preparation\nThe accompanying financial statements have been prepared to present the balance sheets the statements of operations, statements of changes in shareholders equity and cash flows of the Company for the fiscal year ended June 30, 2022 and have been prepared in accordance with US GAAP.\nUse of Estimates\nIn preparing financial statements in conformity with US GAAP, management makes estimates and assumptions that affect the reported amounts of assets and liabilities and disclosures of contingent assets and liabilities at the dates of the financial statements, as well as the reported amounts of revenues and expenses during the reporting periods. Management makes these estimates using the best information available at the time the estimates are made. However, actual results could differ materially from those estimates.\nConcentrations of Credit Risk\nFinancial instruments that potentially subject the Company to significant concentrations of credit risk consist principally of cash and accounts receivable. During the fiscal periods ended June 30, 2022 and 2021, substantially all of the Companys cash was held by major financial institutions located in the United States, which management believes are of high credit quality. With respect to accounts receivable, the Company extended credit based on an evaluation of the customers financial condition. The Company generally did not require collateral for accounts receivable and maintained an allowance for doubtful accounts of accounts receivable if necessary.\nCash\nCash consists of cash held at major financial institutions and is subject to insignificant risk of changes in value.\nReceivables and Allowance for Doubtful Accounts\nTrade accounts receivable are recorded at net realizable value and do not bear interest. No allowance for doubtful accounts was made during the period ended June 30, 2021, based on managements best estimate of the amount of probable credit losses in accounts receivable. The Company evaluates its allowance for doubtful accounts based upon knowledge of its customers and their compliance with credit terms. The evaluation process includes a review of customers accounts on a regular basis. The review process evaluates all account balances with amounts outstanding for more than 60 days and other specific amounts for which information obtained indicates that the balance may be uncollectible. As of June 30, 2022, there was no allowance for doubtful accounts and the Company does not have any off-balance-sheet credit exposure related to its customers.\nFair Value of Financial Instruments\nAccounting Standards Codification (ASC) 820 Fair Value Measurements and Disclosures, adopted January 1, 2008, defines fair value, establishes a three-level valuation hierarchy for disclosures of fair value measurement and enhances disclosure requirements for fair value measures. The Companys financial instruments include cash, current receivables and payables. These financial instruments are measured at their respective fair values. The three levels are defined as follows:\nLevel 1 - inputs to the valuation methodology are quoted prices for identical assets or liabilities in active markets.\nLevel 2 - inputs to the valuation methodology include quoted prices for similar assets and liabilities in active markets, and inputs that are observable for the assets or liability, either directly or indirectly, for substantially the full term of the financial instruments.\nLevel 3 - inputs to the valuation methodology are unobservable and significant to the fair value.\nFor cash, accounts receivables, subscription receivables, and accounts payable and accrued liabilities, it is managements opinion that the carrying values are a reasonable estimate of fair value because of the short period of time between the origination of such instruments and their expected realization and if applicable, their stated interest rate approximates current rates available.\nManagement believes it is not practical to estimate the fair value of related party receivables and payables because the transactions cannot be assumed to have been consummated at arms length, the terms are not deemed to be market terms, there are no quoted values available for these instruments, and an independent valuation would not be practical due to the lack of data regarding similar instruments, if any, and the associated potential costs.\nRevenue Recognition\nAccounting Standards Update (ASU) No. 2014-09, Revenue from Contracts with Customers (Topic 606), was adopted by the Company as of September 6, 2019. The Companys revenue recognition disclosure reflects its updated accounting policies that are affected by this new standard. The Company applied the modified retrospective transition method for open contracts for the implementation of Topic 606. As revenues are and have been primarily from consulting and management services, and the Company has no significant post-delivery obligations, this new standard did not result in a material recognition of revenue on the Companys accompanying financial statements for the cumulative impact of applying this new standard. The Company made no adjustments to its previously reported total revenues, as those periods continue to be presented in accordance with its historical accounting practices under Topic 605, Revenue Recognition.\nRevenue from providing consulting and management services under Topic 606 is recognized in a manner that reasonably reflects the delivery of services to customers in return for expected consideration and includes the following elements:\n-\nexecuted contracts with the Companys customers that it believes are legally enforceable;\n-\nidentification of performance obligations in the respective contract;\n-\ndetermination of the transaction price for each performance obligation in the respective contract;\n-\nallocation of the transaction price to each performance obligation; and\n-\nrecognition of revenue only when the Company satisfies each performance obligation.\nThese five elements as applied to the Companys consulting and management services results in revenue recorded as services are provided.\nIncome Taxes\nThe Company uses the asset and liability method of accounting for income taxes pursuant to ASC 740 Income Taxes. ASC 740 requires an asset and liability approach for financial accounting and reporting for income taxes and allows recognition and measurement of deferred tax assets based upon the likelihood of realization of tax benefits in future years. Under the asset and liability approach, deferred taxes are provided for the net tax effects of temporary differences between the carrying amounts of assets and liabilities for financial reporting purposes and the amounts used for income tax purposes. Valuation allowances are provided for deferred tax assets if it is more likely than not these items will either expire before the Company is able to realize their benefits, or that future deductibility is uncertain. The provision for income taxes represents current taxes payable net of the change during the period in deferred tax assets and liabilities.\nEarnings per Share\nBasic earnings per share are computed by dividing income available to common shareholders by the weighted-average number of common shares outstanding during the period. Diluted earnings per share is computed similar to basic earnings per share except that the denominator is increased to include the number of additional common shares that would have been outstanding if the potential common shares had been issued and if the additional common shares were dilutive. If applicable, diluted earnings per share assume the conversion, exercise or issuance of all common stock instruments unless the effect is to reduce a loss or increase earnings per share. The Company had no dilutive securities for the periods ended June 30, 2022 and June 30, 2021.\nRecently Issued Accounting Pronouncements\nIn June 2018, the Financial Accounting Standards Board (the FASB) issued ASU 2018-07, Compensation - Stock Compensation (Topic 718): Improvements to Nonemployee Share-Based Payment Accounting, to include share-based payment transactions for acquiring goods and services from nonemployees. ASU 2018-07 simplifies the accounting for nonemployee share-based payments, aligning it more closely with the accounting for employee awards.\nOther recent accounting pronouncements issued by the FASB (including its Emerging Issues Task Force) did not or are not expected to have a material impact on the Company's present or future financial statements.\nItem 7.A Quantitative and Qualitative Disclosures about Market Risk.\nWe are a smaller reporting company as defined by Rule 12b-2 of the Securities Exchange Act of 1934 and are not required to provide the information under this item.  Item 8. Financial Statements and Supplementary Data.\nReport of Independent Registered Public Accounting Firm (PCAOB ID: 5041)\n20-21\nFINANCIAL STATEMENTS\nBalance Sheets as of June 30, 2022 and June 30, 2021\nStatement of Operations for the years ended June 30, 2022 and 2021\nStatement of Changes in Shareholders Equity for the years ended June 30, 2022 and 2021\nStatement of Cash Flows for the years ended June 30, 2022 and 2021\nNotes to the Financial Statements\n26-37\nReport of Independent Registered Public Accounting Firm\nTo the Board of Directors and Shareholders of Tego Cyber, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheet of Tego Cyber, Inc. (the Company) as of June 30, 2022, and the related statement of operations, stockholders equity, and cash flows for the year then ended, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of June 30, 2022, and the results of its operations and its cash flows for the year then ended in conformity with accounting principles generally accepted in the United States of America.\nSubstantial Doubt about the Companys Ability to Continue as a Going Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 3 to the financial statements, the Companys significant operating losses raise substantial doubt about its ability to continue as a going concern. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audit, we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audit provides a reasonable basis for our opinion.\n/S/ BF Borgers CPA PC\nBF Borgers CPA PC\nServed as auditor since 2022\nLakewood, CO\nNovember 10, 2022\nREPORT OF INDEPENDENT PUBLIC ACCOUNTING FIRM\nTo the Shareholders and Board of Directors of Tego Cyber Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheet of Tego Cyber Inc. (the Company) as of June 30, 2021 and 2020, and the related statements of operations and comprehensive loss, changes in shareholders equity, and cash flows for the year June 30, 2021 then ended and for the period from September 6, 2019 (date of inception) to June 30, 2020 and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of June 30, 2021 and 2020, and the results of its operations and its cash flows for the year and period then ended, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on these financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the auditing standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audit, we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures including examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audit provides a reasonable basis for our opinion.\nExplanatory Paragraph Regarding Going Concern\nThe accompanying financial statements have been prepared assuming that Tego Cyber Inc. will continue as a going concern. As discussed in Note 3 to the financial statements, the Companys significant operating losses raise substantial doubt about its ability to continue as a going concern. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\n/s/ HARBOURSIDE CPA LLP\n(formerly Buckley Dodds LLP)\nVancouver, Canada\nSeptember 28, 2021\nWe have served as the Companys auditor since July 2020.\nTEGO CYBER INC.\nBALANCE SHEETS\n(Expressed in US Dollars)\nJune 30,\nJune 30,\nASSETS\nCurrent assets\nCash\n$ 47,742\n$ 583,015\nAccounts receivable\n1,150\n1,450\nPrepaid expenses (Note 5)\n66,119\n113,462\nTotal current assets\n115,011\n697,927\nComputer equipment, net\n3,207\n-\nSoftware (Note 6)\n411,122\n75,750\nTOTAL ASSETS\n$ 529,340\n$ 773,677\nLIABILITIES & SHAREHOLDERS DEFICIT\nCurrent liabilities\nAccounts payable (Note 7)\n$ 66,066\n$ 23,010\nConvertible debts\n-\n22,621\nTOTAL LIABILITIES\n66,066\n45,631\nSHAREHOLDERS EQUITY\nCommon shares\n50,000,000 shares authorized\n$0.001 par value 25,508,044 shares issued and outstanding at June 30, 2022 and 18,296,511 shares at June 30, 2021\n25,508\n18,297\nAdditional paid in capital\n4,586,049\n1,720,631\nSubscriptions receivable\n-\n(10,500 )\nAccumulated deficit\n(4,148,283 )\n(1,000,382 )\nTOTAL SHAREHOLDERS EQUITY\n463,274\n728,046\nTOTAL LIABILITIES & SHAREHOLDERS EQUITY\n$ 529,340\n$ 773,677\nThe accompanying notes are an integral part of these financial statements\nTEGO CYBER INC.\nSTATEMENTS OF OPERATIONS\n(Expressed in US Dollars)\nYear Ended\nJune 30,\nYear Ended\nJune 30,\nREVENUE\nConsulting fees\n$\n1,050\n$\n5,600\nSubscription Revenue\n2,500\n2,500\nTOTAL REVENUE\n3,550\n8,100\nOPERATING EXPENSES\nGeneral & administration\n1,258,539\n367,854\nProfessional fees\n749,607\n238,894\nSales & marketing\n171,211\n68,170\nShare based compensation\n905,962\n-\nTOTAL OPERATING EXPENSES\n3,085,319\n674,918\nNET OPERATING LOSS\n(3,081,769\n)\n(666,818\n)\nOTHER INCOME (EXPENSE)\nAccretion expense\n(66,132\n)\n(168,638\n)\nFinancing fees\n-\n(26,966\n)\nGain on extinguishment of convertible debts\n-\n36,731\nLoss on settlement of convertible debts\n-\n(97,489\n)\nTOTAL OTHER INCOME (EXPENSE)\n(66,132\n)\n(256,362\n)\nNET LOSS\n$\n(3,147,901\n)\n$\n(923,180\n)\nBASIC AND DILUTED LOSS PER COMMON SHARE\n$\n(0.13\n)\n$\n(0.07\n)\nWEIGHTED AVERAGE NUMBER OF COMMON SHARES OUTSTANDING\n24,184,384\n13,566,628\nThe accompanying notes are an integral part of these financial statements\nTEGO CYBER INC.\nSTATEMENTS OF CHANGES IN SHAREHOLDERS EQUITY\nFOR THE YEARS ENDED JUNE 30, 2022 AND JUNE 30, 2021\n(Expressed in US Dollars)\nNumber\nof\nShares\nCommon Stock\nAdditional\nPaid-In Capital\nSubscriptions\nReceivable\nAccumulated Deficit\nTotal Shareholder Equity\nBalances, June 30, 2020\n12,406,236\n$ 12,406\n$ 175,906\n$ (24,500 )\n$ (77,202 )\n$ 86,610\nShares issued for cash\n5,041,190\n5,042\n1,155,256\n14,000\n-\n1,174,298\nShares issued for services\n299,752\n74,638\n-\n-\n74,938\nShares issued as prepaid expenses\n300,248\n74,762\n-\n-\n75,062\nShares issued for settlement of debt\n51,085\n38,449\n-\n-\n38,500\nShares issued as transaction costs for convertible debts\n198,000\n32,802\n-\n-\n33,000\nEquity portion of convertible debts\n-\n-\n10,167\n-\n-\n10,167\nWarrants issued with convertible debts\n-\n-\n158,651\n-\n-\n158,651\nNet loss for the year ended June 30, 2021\n-\n-\n-\n-\n(923,180 )\n(923,180 )\nBalances, June 30, 2021\n18,296,511\n$ 18,297\n$ 1,720,631\n$ (10,500 )\n$ (1,000,382 )\n$ 728,046\nShares issued for cash\n5,558,810\n5,558\n1,409,144\n10,500\n-\n1,425,202\nShares issued for services\n715,572\n457,534\n-\n-\n458,250\nShares issued for settlement of convertible debt\n937,151\n92,778\n-\n-\n93,715\nShare-based compensation\n-\n-\n905,962\n-\n-\n905,962\nNet loss for the year ended June 30, 2022\n-\n-\n-\n-\n(3,147,901 )\n(3,147,901 )\nBalances, June 30, 2022\n25,508,044\n$ 25,508\n$ 4,586,049\n$ -\n$ (4,148,283 )\n$ 463,274\nThe accompanying notes are an integral part of these financial statements\nTEGO CYBER INC.\nSTATEMENTS OF CASH FLOWS\n(Expressed in US Dollars)\nYear Ended\nJune 30,\nYear Ended\nJune 30,\nCASH FLOWS FROM OPERATING ACTIVITIES\nNet loss for the year\n$ (3,147,901 )\n$ (923,180 )\nItems not affecting cash\nShares issued for services\n458,250\n74,938\nInterest on short term debt\n4,962\n8,567\nAmortization\n3,370\n-\nAccretion expense\n66,132\n168,638\nFinancing fees\n-\n26,966\nGain on extinguishment of convertible debts\n-\n(36,731 )\nLoss on settlement of convertible debts\n-\n97,489\nShare-based compensation\n905,962\n-\nChanges in non-cash working capital items:\nAccounts receivable\n(1,300 )\nPrepaid expenses\n47,343\n(38,400 )\nAccounts payable and accrued liabilities\n43,056\n45,956\nDue to related parties\n-\n(1,358 )\nNET CASH USED IN OPERATING ACTIVITIES\n(1,618,526 )\n(578,415 )\nCASH FLOWS FROM INVESTING ACTIVITIES\nPurchase of computer equipment\n(6,577 )\n-\nCapitalized software development costs\n(335,372 )\n(54,250 )\nNET CASH USED IN INVESTING ACTIVITIES\n(341,949 )\n(54,250 )\nCASH FLOWS FROM FINANCING ACTIVITIES\nProceeds from shares issued\n1,425,202\n1,149,798\nProceeds from issuance of convertible debt\n-\n300,000\nRepayment of convertible debt\n-\n(312,240 )\nConvertible debt issuance costs\n-\n(28,250 )\nCollection of subscription receivable\n-\n24,500\nNET CASH PROVIDED BY FINANCING ACTIVITIES\n1,425,202\n1,133,808\nNET INCREASE (DECREASE) IN CASH\n(535,273 )\n501,143\nCASH AT BEGINNING OF THE PERIOD\n583,015\n81,872\nCASH AT END OF THE PERIOD\n$ 47,742\n$ 583,015\nNon-cash investing and financing activities:\nShares issued included in subscriptions receivable\n$ -\n$ 10,500\nShares issued for prepaid expenses\n$ -\n$ 75,062\nShares issued for settlement of debt\n$ 93,715\n$ 38,500\nShares issued with convertible debts\n$ -\n$ 33,000\nEquity portion of convertible debts\n$ -\n$ 10,167\nWarrants issued with convertible debt\n$ -\n$ 158,651\nThe accompanying notes are an integral part of these audited financial statements\nNOTE 1 - ORGANIZATION AND DESCRIPTION OF BUSINESS\nTego Cyber Inc. (the Company) was incorporated in the State of Nevada on September 6, 2019. It was created to capitalize on the emerging cyber threat intelligence market and has developed a state-of-the-art cyber threat intelligence application that enriches threat data to help enterprises identify cyber threats within their environments. Tego Guardian is a proactive intelligent cyberthreat hunting tool that gives enterprises the ability to quickly track threats throughout their networks, mapping out exposures and expediting remediation. Tego Guardian integrates with the widely used Splunk Security Information and Event Management (SIEM) platform. Tego Guardian is a Splunk approved app and available for download through Splunks marketplace. The Company plans on developing future versions of Tego Guardian for integration with other established SIEM systems and platforms including: Elastic, IBM QRadar, AT&T AlienVault, Exabeam, and Google Chronical.\nThe Companys head office is at 8565 S. Eastern Ave. #150, Las Vegas, Nevada, 89123.\nNOTE 2 - BASIS OF PRESENTATION\nThe accompanying audited financial statements have been prepared in accordance with generally accepted accounting principles in the United States of America (US GAAP). In the opinion of management, the financial statements include all adjustments of a normal recurring nature necessary for a fair statement of the results for the period presented.\nThe accompanying financial statements have been prepared to present the balance sheets, the statements of operations, statements of changes in shareholders equity and the statements of cash flows of the Company for the years ended June 30, 2022 and 2021. The accompanying audited financial statements have been prepared in accordance with US GAAP using Company-specific information where available and allocations and estimates where data is not maintained on a Company-specific basis within its books and records. Due to the allocations and estimates used to prepare the financial statements, they may not reflect the financial position, cash flows and results of operations of the Company in the future or its operations, cash flows and financial position.\nThe preparation of financial statements in accordance with US GAAP requires the use of estimates and assumptions that affect the reported amounts of assets and liabilities, disclosure of contingent assets and liabilities known to exist as of the date the financial statements are published, and the reported amounts of revenues and expenses during the reporting period. Uncertainties with respect to such estimates and assumptions are inherent in the preparation of the Companys financial statements; accordingly, it is possible that the actual results could differ from these estimates and assumptions and could have a material effect on the reported amounts of the Companys financial position and results of operations.\nNOTE 3 - GOING CONCERN UNCERTAINTY\nThe accompanying financial statements have been prepared on a going concern basis, which contemplates the realization of assets and satisfaction of liabilities in the normal course of the business. The Company has incurred material losses from operations and has an accumulated deficit. At June 30, 2022, the Company had a working capital surplus of $48,945. For the year ended June 30, 2022, the Company sustained net losses and generated negative cash flows from operations. In March 2020, the World Health Organization recognized the outbreak of COVID-19 as a global pandemic. The COVID-19 pandemic and government actions implemented to contain the further spread of COVID-19 have severely restricted economic activity around the world. These factors, among others, raise substantial doubt about the Companys ability to continue as a going concern. The financial statements do not include any adjustments relating to the recoverability and classification of recorded asset amounts or the amounts and classification of liabilities that may be necessary should the Company be unable to continue as a going concern. These adjustments could be material. The Companys continuation as a going concern is contingent upon its ability to earn adequate revenues from operations and to obtain additional financing. There is no assurance that the Company will be able to obtain such financings or obtain them on favorable terms.\nNOTE 4 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nThis summary of significant accounting policies is presented to assist in understanding the financial statements. The financial statements and notes are representations of the Companys management, who are responsible for their integrity and objectivity. These accounting policies conform to US GAAP and have been consistently applied in the preparation of the financial statements.\nBasis of Preparation\nThe accompanying financial statements have been prepared to present the balance sheets, the statements of operations, statements of changes in shareholders equity and statements of cash flows of the Company for the period ended June 30, 2022 and 2021 and have been prepared in accordance with US GAAP.\nUse of Estimates\nIn preparing financial statements in conformity with US GAAP, management makes estimates and assumptions that affect the reported amounts of assets and liabilities and disclosures of contingent assets and liabilities at the dates of the financial statements, as well as the reported amounts of revenues and expenses during the reporting periods. Management makes these estimates using the best information available at the time the estimates are made. However, actual results could differ materially from those estimates.\nConcentrations of Credit Risk\nFinancial instruments that potentially subject the Company to significant concentrations of credit risk consist principally of cash and accounts receivable. As at June 30, 2022, substantially all of the Companys cash was held by major financial institutions located in the United States, which management believes are of high credit quality. With respect to accounts receivable, the Company extended credit based on an evaluation of the customers financial condition. The Company generally did not require collateral for accounts receivable and maintained an allowance for doubtful accounts of accounts receivable if necessary.\nCash\nCash consists of cash held at major financial institutions and is subject to insignificant risk of changes in value.\nReceivables and Allowance for Doubtful Accounts\nTrade accounts receivable are recorded at net realizable value and do not bear interest. No allowance for doubtful accounts was made during the period ended June 30, 2022 and 2021, based on managements best estimate of the amount of probable credit losses in accounts receivable. The Company evaluates its allowance for doubtful accounts based upon knowledge of its customers and their compliance with credit terms. The evaluation process includes a review of customers accounts on a regular basis. The review process evaluates all account balances with amounts outstanding for more than 60 days and other specific amounts for which information obtained indicates that the balance may be uncollectible. As of June 30, 2022 and 2021, there was no allowance for doubtful accounts and the Company does not have any off-balance-sheet credit exposure related to its customers.\nSoftware\nSoftware is stated at cost less accumulated amortization and is depreciated using the straight-line method over the estimated useful life of the asset. The estimated useful life of the asset is 5 years and is not depreciated until it is available for use by the Company.\nLeases\nThe Company determines if an arrangement is a lease at inception. Operating and financing right-of-use assets and lease liabilities are included on the balance sheet. Right-of-use assets represent the Companys right to use an underlying asset for the lease term and lease liabilities represent the Companys obligation to make lease payments arising from the lease. Right-of-use assets and liabilities are recognized at commencement date based on the present value of lease payments over the lease term. The Company uses its incremental borrowing rate, based on the information available at the commencement date, in determining the present value of future lease payments. Right-of-use assets include any prepaid lease payments and exclude any lease incentives and initial direct costs incurred. Operating lease expenses are recognized on a straight-line basis over the term of the lease, consisting of interest accrued on the lease liability and depreciation of the right-of-use asset. The lease terms may include options to extend or terminate the lease is it is reasonably certain the Company will exercise that option. The Company leases its corporate office located at 8565 S. Eastern Ave. #150, Las Vegas, Nevada. The initial lease term is for 12 months commencing on September 8, 2019 after which the term is on a month-to-month basis. After the initial term, the Company may cancel the lease agreement at any time by providing 30 days written notice. The Company has elected the short-term lease practical expedient of 12 months and has not recorded a lease.\nFair Value of Financial Instruments\nAccounting Standards Codification (ASC) 820 Fair Value Measurements and Disclosures, adopted January 1, 2008, defines fair value, establishes a three-level valuation hierarchy for disclosures of fair value measurement and enhances disclosure requirements for fair value measures. The Companys financial instruments include cash, current receivables and payables. These financial instruments are measured at their respective fair values. The three levels are defined as follows:\nLevel 1 - inputs to the valuation methodology are quoted prices for identical assets or liabilities in active markets.\nLevel 2 - inputs to the valuation methodology include quoted prices for similar assets and liabilities in active markets, and inputs that are observable for the assets or liability, either directly or indirectly, for substantially the full term of the financial instruments.\nLevel 3 - inputs to the valuation methodology are unobservable and significant to the fair value.\nFor cash, accounts receivable, accounts payable and accrued liabilities and due to related parties, it is managements opinion that the carrying values are a reasonable estimate of fair value because of the short period of time between the origination of such instruments and their expected realization and if applicable, their stated interest rate approximates current rates available.\nFor convertible debts, the carrying values, excluding any unamortized discounts, approximate the respective fair value. There are no convertible debt at June 30, 2022. The convertible debts have been discounted to reflect their net present value as at June 30, 2021. The carrying values of embedded conversion features not considered to be derivative instruments were determined by allocating the remaining carrying value of the convertible debt after deducting the estimated carrying value of the liability portion.\nEstimating fair value for warrants require determining the most appropriate valuation model which is dependent on the terms and conditions of the grant. This estimate requires determining the most appropriate inputs to the valuation model including the expected life of the warrant, volatility, dividend yield, and rate of forfeitures and making assumptions about them.\nRevenue Recognition\nRevenue is recognized under ASC 606, Revenue from Contracts with Customers using the modified retrospective method. Under this method, the Company follows the five-step model provided by ASC Topic 606 in order to recognize revenue in the following manner: 1) identify the contract; 2) identify the performance obligations of the contract; 3) determine the transaction price of the contract; 4) allocate the transaction price to the performance obligations; and 5) recognize revenue. The Company recognizes revenue for the transfer of promised goods or services to customers in an amount that reflects the consideration for which the entity expects to be entitled in exchange for those goods or services.\nRevenue for the fiscal years ended June 30, 2022 and June 30, 2021 consisted of the following:\nJune 30,\nJune 30,\nConsulting fees\n$ 1,050\n$ 5,600\nSubscription revenue\n2,500\n2,500\nTotal\n$ 3,550\n$ 8,100\nThe Company currently has not generated any revenue from its threat intelligence software.\nIncome Taxes\nThe Company uses the asset and liability method of accounting for income taxes pursuant to ASC 740 Income Taxes. ASC 740 requires an asset and liability approach for financial accounting and reporting for income taxes and allows recognition and measurement of deferred tax assets based upon the likelihood of realization of tax benefits in future years. Under the asset and liability approach, deferred taxes are provided for the net tax effects of temporary differences between the carrying amounts of assets and liabilities for financial reporting purposes and the amounts used for income tax purposes. Valuation allowances are provided for deferred tax assets if it is more likely than not these items will either expire before the Company is able to realize their benefits, or that future deductibility is uncertain. The provision for income taxes represents current taxes payable net of the change during the period in deferred tax assets and liabilities.\nEarnings (Loss) per Share\nBasic earnings (loss) per share is computed by dividing income (loss) available to common shareholders by the weighted-average number of common shares outstanding during the period. Diluted earnings (loss) per share is computed similar to basic earnings (loss) per share except that the denominator is increased to include the number of additional common shares that would have been outstanding if the potential common shares had been issued and if the additional common shares were dilutive. If applicable, diluted earnings (loss) per share assume the conversion, exercise or issuance of all common stock instruments unless the effect is to reduce a loss or increase earnings (loss) per share. The Company had no dilutive securities for the year ended June 30, 2022 and 2021.\nRecently Issued Accounting Pronouncements\nIn December 2019, the FASB issued ASU 2019-12, Simplifying the Accounting for Income Taxes which amends ASC 740 Income Taxes (ASC 740). This update is intended to simplify accounting for income taxes by removing certain exceptions to the general principles in ASC 740 and amending existing guidance to improve consistent application of ASC 740. This update is effective for fiscal years beginning after December 15, 2021. The guidance in this update has various elements, some of which are applied on a prospective basis and others on a retrospective basis with earlier application permitted. The Companys management is currently evaluating the effect of this ASU on the Companys financial statements and related disclosures.\nIn June 2020, the FASB issued ASU 2020-05 in response to the ongoing impacts to U.S. businesses in response to the COVID-19 pandemic. ASU 2020-05, Revenue from Contracts with Customers (Topic 606) and Leases (Topic 842) Effective Dates for Certain Entities provide a limited deferral of the effective dates for implementing previously issued ASU 606 and ASU 842 to give some relief to businesses considering the difficulties they are facing during the pandemic. These entities may defer application to fiscal years beginning after December 15, 2019, and interim periods within fiscal years beginning after December 15, 2020. As the Company has already adopted ASU 606 and ASU 842, the Company does not anticipate any effect on its financial statements.\nIn August 2020, the FASB issued ASU 2020-06, Debt-Debt with Conversion and Other Options (Subtopic 470-20) and Derivatives and Hedging-Contracts in Entitys Own Equity (Subtopic 815-40)-Accounting for Convertible Instruments and Contracts in an Entitys Own Equity. ASU 2020-06 reduces the number of accounting models for convertible debt instruments and convertible preferred stock. For convertible instruments with conversion features that are not required to be accounted for as derivatives under Topic 815, Derivatives and Hedging, or that do not result in substantial premiums accounted for as paid-in capital, the embedded conversion features no longer are separated from the host contract. ASU 2020-06 also removes certain conditions that should be considered in the derivatives scope exception evaluation under Subtopic 815-40, Derivatives and Hedging-Contracts in Entitys Own Equity, and clarify the scope and certain requirements under Subtopic 815-40. In addition, ASU 2020-06 improves the guidance related to the disclosures and earnings-per-share (EPS) for convertible instruments and contract in entitys own equity. ASU 2020-06 is effective for public business entities that meet the definition of a SEC filer, excluding entities eligible to be smaller reporting companies as defined by the SEC, for fiscal years beginning after December 15, 2021, including interim periods within those fiscal years. For all other entities, the amendments are effective for fiscal years beginning after December 15, 2023, including interim periods within those fiscal years. Early adoption is permitted, but no earlier than fiscal years beginning after December 15, 2020, including interim periods within those fiscal years. The Board specified that an entity should adopt the guidance as of the beginning of its annual fiscal year. The Companys management is currently evaluating the impact this ASU will have on its financial statements.\nManagement does not believe that any recently issued, but not yet effective, accounting standards could have a material effect on the accompanying consolidated financial statements. As new accounting pronouncements are issued, we will adopt those that are applicable under the circumstances.\nNOTE 5 - PREPAID EXPENSES\nPrepaid expense balance as of June 30, 2022 and June 30, 2021 consisted of the following:\nJune 30, 2022\nJune 30, 2021\nAdvertising & promotion\n$ 5,500\n$ 18,750\nConsultants & contractors\n5,301\nInvestor relations & shareholder communications\n-\n56,312\nPlatform costs\n30,318\n-\nSoftware development\n25,000\n38,400\nTotal\n$ 66,119\n$ 113,462\nNOTE 6 - SOFTWARE\nThe Company has developed an automated threat intelligence defense platform, named Tego Guardian, that provides real-time protection against cyber-threats. The Company is focused on filling the cyber-security skills gap with automated cyber defense solutions, including a monthly software subscription to users of the multiple router and firewall manufacturers.\nBalance, September 6, 2019 (Date of Inception)\n$\n-\nAdditions\n21,500\nDepreciation\n-\nBalance, June 30, 2020\n21,500\nAdditions\n54,250\nDepreciation\n-\nBalance, June 30, 2021\n$\n75,750\nAdditions\n335,372\nDepreciation\n-\nBalance, June 30, 2022\n$\n411,122\nAs at June 30, 2022, the software was not generating revenue and no depreciation has been recorded for the periods then ended. It is expected the software will begin to generate revenue in the quarter ended December 31, 2022.\nNOTE 7 - ACCOUNTS PAYABLE\nAccounts payable balance as of June 30, 2022 and June 30, 2021 consisted of the following:\nJune 30, 2022\nJune 30, 2021\nAdvertising & promotion\n$ -\n$ 585\nLegal & accounting\n23,247\n1,127\nSoftware development\n42,819\n-\nTotal\n$ 66,066\n$ 1,712\nNOTE 8 - RELATED PARTY TRANSACTIONS\nRelated party transactions are measured at the exchange amount, which is the amount of consideration established and agreed to by the related parties. Related parties are natural persons or other entities that have the ability, directly, or indirectly, to control another party or exercise significant influence over the party in making financial and operating decisions. Related parties include other parties that are subject to common control or that are subject to common significant influences.\nDuring the year ended June 30, 2022, there were transactions incurred between the Company and Shannon Wilkinson, Director, CEO, President, Secretary and Treasurer of the Company for management fees of $45,000 (June 30, 2021 - $134,750) and net wages of $89,150 (June 30, 2021 - $Nil).\nDuring the year ended June 30, 2022, there were transactions incurred between the Company and Earl Johnson, Chief Financial Officer of the Company for net wages of $5,037 (June 30, 2021 - $Nil).\nDuring the year ended June 30, 2022, there were transactions incurred between the Company and Chris White, Director and Chief Information Security Officer of the Company for management fees of $12,500 (June 30, 2021 - $32,500) and net wages of $59,785 (June 30, 2021 - $Nil).\nDuring the year ended June 30, 2022, there were transactions incurred between the Company and Troy Wilkinson, Director of the Company for management fees of $119,250 (June 30, 2021 - $Nil).\nNOTE 9 - COMMON SHARES\nCommon Stock\nAt June 30, 2022, the Companys authorized capital consisted of 50,000,000 of common shares with a $0.001 par value and 25,508,044 shares were issued and outstanding.\nDuring the year ended June 30, 2021, the Company incurred the following transactions:\nDuring the period from July 2, 2020 to July 31, 2020, the Company completed various private placements whereby a total of 500,000 common shares were issued at a price of $0.05 per share for a total value of $25,000.\nDuring the period from November 24, 2020 to June 30, 2021, the Company completed various private placements whereby a total of 4,541,190 common shares were issued at a price of $0.25 per share for a total value of $1,135,298. As at June 31, 2021, $10,500 of the subscriptions still remained receivable.\nOn December 28, 2020, the Company issued 110,000 common shares to a non-related party at a price of $0.10 per share for a total value of $11,000 as commitment shares in exchange for services related to the issuance of convertible debt.\nOn March 29, 2021, the Company issued 88,000 common shares to a non-related party at a price of $0.25 per share for a total value of $22,000 as debt issuance costs related to the issuance of convertible debt.\nOn March 29, 2021, the Company issued 100,000 common shares to a director of the Company at a price of $0.25 per share for a total value of $25,000 in exchange for services.\nOn April 12, 2021, the Company issued 400,000 common shares to a non-related party at a price of $0.25 per share for a total value of $100,000 in exchange for services.\nOn April 15, 2021, the Company issued 100,000 common shares to a non-related party at a price of $0.25 per share for a total value of $25,000 in exchange for services.\nOn June 21, 2021, the Company issued 41,085 common shares to a non-related party at a price of $0.73 per share for a total value of $30,000 as settlement of debt.\nOn June 25, 2021, the Company issued 10,000 common shares to a non-related party at a price of $0.85 per share for a total value of $8,500 as settlement of debt.\nDuring the year ended June 30, 2022, the Company incurred the following transactions:\nDuring the period July 1, 2021 to October 28, 2021, the Company completed various private placements whereby a total of 5,558,810 common shares were issued for a total proceeds of $1,425,202.\nOn October 15, 2021, the Company issued 125,000 common shares at a price of $0.80 per share for marketing services valued at $100,000.\nOn October 28, 2021, the Company issued 28,572 common shares at a price of $0.70 per share for legal services valued at $20,000.\nOn December 8, 2021, the Company issued 50,000 common shares at a price of $0.71 per share for consulting services valued at $35,250.\nOn December 31, 2021, the Company issued 583,936 common shares for the conversion of debt at a conversion price of $0.10 per share for a total value of $58,394. See Note 10 (a).\nOn December 31, 2021, the Company issued 353,215 common shares for the conversion of debt at a conversion price of $0.10 per share for a total value of $35,321. See Note 10 (b).\nOn January 1, 2022, the Company issued 100,000 common shares at a price of $0.65 per share for consulting services valued at $65,000.\nOn March 25, 2022, the Company issued 12,000 common shares to a non-related party at a price of $0.60 per share for a total value of $7,200 in exchange for services.\nOn May 19, 2022, the Company issued 400,000 common shares to a non-related party at a price of $0.577 per share for investor relations services valued at $230,800\nWarrants\nOn December 28, 2020, the Company granted 1,100,000 warrants with a contractual life of two years and exercise price of $0.25 per share to a lender as part of the convertible debt financing transaction (Note 8 (b)). The warrants were valued at $46,898 using the Black Scholes Option Pricing Model.\nOn March 25, 2021, the Company granted 1,100,000 warrants with a contractual life of two years and exercise price of $0.25 per share to a lender as part of the convertible debt financing transaction (Note 8 (c)). The warrants were valued at $41,920 using the Black Scholes Option Pricing Model.\nOn April 22, 2021, the Company granted 506,838 warrants with a contractual life of two years and exercise price of $0.25 per share to a lender as part of the convertible debt financing transaction (Note 8 (a)). The warrants were valued at $44,088 using the Black Scholes Option Pricing Model.\nOn April 28, 2021, the Company granted 307,408 warrants with a contractual life of two years and exercise price of $0.25 per share to a lender as part of the convertible debt financing transaction (Note 8 (a)). The warrants were valued at $25,745 using the Black Scholes Option Pricing Model.\nThe Black Scholes Option Pricing Model assumptions used in the valuation of the warrants are outlined below. The stock price was based on recent issuances. Expected life was based on the expiry date of the warrants as the Company did not have historical exercise data of such warrants.\nJune 30, 2022\nStock price\n$0.85 - $0.25\nRisk-free interest rate\n0.13%-0.17%\nExpected life\n2 Years\nExpected dividend rate\nExpected volatility\n102.03% - 206.63%\nContinuity of the Companys common stock purchase warrants issued and outstanding is as follows:\nNumber\nof\nWarrants\nWeighted\nAverage\nExercise\nPrice\nOutstanding, June 30, 2020\n-\n$ -\nGranted\n3,014,246\n0.25\nExercised\n-\n-\nExpired\n-\n-\nOutstanding, June 30, 2021\n3,014,246\n$ 0.25\nGranted\n-\n-\nExercised\n-\n-\nExpired\n-\n-\nOutstanding, June 30, 2022\n3,014,246\n$ 0.25\nAs at June 30, 2022, the weighted average remaining contractual life of warrants outstanding was 1.20 years with an intrinsic value of $0.25.\nStock Options\nOn December 8, 2021, the Board of Directors of the Company approved the adoption of the 2021 Equity Compensation Plan (the Equity Compensation Plan) to provide employees, certain consultants and advisors who perform services for the Company, and non-employee members of the Board of Directors of the Company with the opportunity to receive grants of incentive stock options, nonqualified stock options, stock appreciation rights, stock awards, stock units and other stock-based awards.\nDuring the year ended June 30, 2022 the Company issued a total of 6,000,000 non-qualified stock options (the options) to directors, officers and certain key consultants. The options are subject to the terms and conditions of the Equity Compensation Plan. All granted options are subject to a five-year vesting schedule equal to 20% per year starting on the 1st day of each year following the effective date. All options have an exercise price of $0.65 which was the closing price of the Companys common stock on the day the day grant.\nThe following is a continuity schedule for the Companys outstanding non-qualified stock options:\nNumber of\noptions\nWeighted Average Exercise Price\nOutstanding, June 30, 2021\n-\nUSD -\nGranted\n6,000,000\nUSD 0.65\nExercised\n-\nUSD -\nCancelled\n-\nUSD -\nOutstanding, June 30, 2022\n6,000,000\nUSD 0.65\nAs at June 30, 2022, the Company had the following stock options outstanding:\nGrant\nDate\nNumber\nOutstanding\nNumber\nExercisable\nExercise\nPrice\nWeighted Average Life (Years)\nExpiry Date\nJanuary 3, 2022\n125,000\n-\nUSD 0.65\n9.52\nJanuary 3, 2032\nJanuary 4, 2022\n5,875,000\n-\nUSD 0.65\n9.52\nJanuary 4, 2032\nTotal\n6,000,000\n-\nUSD 0.65\n9.52\nDuring the period ended June 30, 2022, the Company recorded $605,114 as share-based compensation relating to the issuance of the non-qualified stock options.\nThe fair value of the options granted during the year ended June 30, 2022 was estimated on the date of the grant date using the Black-Scholes option pricing model with the following weighted average assumptions:\nExpected volatility\n81.59 %\nExpected option life (years)\n6 years\nRisk-free interest rate (10-year U.S. treasury yield)\n1.55 - 1.66%\nExpected dividend yield\n0 %\nPerformance Stock Units\nOn December 8, 2021, the Board of Directors of the Company approved the adoption of the 2021 Equity Compensation Plan (the Equity Compensation Plan) to provide employees, certain consultants and advisors who perform services for the Company, and non-employee members of the Board of Directors of the Company with the opportunity to receive grants of incentive stock options, nonqualified stock options, stock appreciation rights, stock awards, stock units and other stock-based awards.\nDuring the year ended June 30, 2022 the Company issued a total of 4,000,000 performance stock units (performance units) to directors, officers and certain key consultants. The performance units are subject to the terms and conditions of the Equity Compensation Plan. The performance units will be earned and vest upon reaching certain market capitalization goals during the performance period ending on December 31, 2026.\nThe following is a continuity schedule for the Companys outstanding performance stock units:\nNumber of Performance Units\nWeighted Average Exercise Price\nOutstanding, June 30, 2021\n-\n$ -\nGranted\n4,000,000\n-\nReleased\n-\n-\nForfeited or cancelled\n-\n-\nOutstanding, June 30, 2022\n4,000,000\n$ -\nAs at June 30, 2022, the Company had the following performance units outstanding:\nGrant\nDate\nNumber\nOutstanding\nNumber\nExercisable\nExercise\nPrice\nWeighted Average Life (Years)\nExpiry Date\nMarch 8, 2022\n4,000,000\n-\nUSD $0.00\n4.82\nDecember 31, 2026\nTotal\n4,000,000\n-\nUSD $0.00\n4.82\nDuring the period ended June 30, 2022, the Company recorded $300,848 as share-based compensation relating to the issuance of the performance units.\nThe fair value of the performance units granted during the year ended June 30, 2022 was estimated on the date of the grant date using advanced techniques with the following weighted average assumptions:\nExpected volatility\n85.0 %\nRequisite period\n4.82 years\nRisk-free interest rate (US Treasury Bond rate as of the grant date)\n1.80 %\nExpected dividend yield\n0 %\nNOTE 10 - CONVERTIBLE DEBTS\n(a)\nOn November 10, 2020, the Company issued a convertible debt in the principal amount of $20,000 each in exchange for cash. The convertible debt is unsecured, bears interest at 8% per annum compounded on the basis of a 365-day year and actual days lapsed, is convertible at $0.10 per 1 common share, and has a maturity date of May 10, 2021. The carrying value of beneficial conversion features not considered to be derivative instruments were determined by allocating the intrinsic value of the conversion features from proceeds. As a result, total proceeds of $20,000 were allocated to the beneficial conversion feature, recorded as equity portions of convertible debt and there were no remaining proceeds available for allocation to the liability portion of the convertible debt. The convertible debt was discounted by the amounts allocated to the conversion features.\nOn April 22, 2021, the Company renegotiated the terms of the convertible debt in exchange for a new convertible debt in the principal amount of $55,245 at $50,684, with $4,561 original issue discount, for additional cash proceeds of $30,000 and surrender of the convertible note previously issued. In connection with the note, the Company issued 506,838 warrants exercisable at $0.25 per share, expiring on April 22, 2023. The warrants were calculated to have a relative fair value of $44,088. The convertible debt is unsecured, bears interest at 8% per annum compounded on the basis of a 365-day year and actual days elapsed, is convertible at $0.10 per 1 common share, and matures on January 22, 2022. The terms of the new convertible debt were substantially different and deemed extinguished resulting in a gain of $18,049 recorded on extinguishment of convertible debt.\nThe proceeds were allocated between the convertible debt and warrants on a relative fair value basis, and the issuance costs were proportioned accordingly. The fair value of the convertible debt was calculated using the present value of the debt and related interest at 12% incremental borrowing rate as the discount rate. The warrants were valued using the Black Scholes Option Pricing Model (Note 7).\nThe carrying value of beneficial conversion features not considered to be derivative instruments was determined by allocating $5,912 for the intrinsic value of the conversion features from the remaining proceeds allocated to the convertible debt after deducting the amount allocated to the warrants. As such, there were no remaining proceeds available for allocating to the liability portion of the convertible debt. As at June 30, 2021, the carrying value of this convertible debt was $14,374 (June 30, 2020 - $Nil) net of $40,871 unamortized discounts.\nOn December 31, 2021 the outstanding balance of the convertible debt and accrued interest was converted in exchange for 583,936 common shares at a conversion price of $0.10 per share for a total value of $58,394. As at June 30, 2022, the carrying value of this convertible debt was $nil (June 30, 2021 - $14,374).\n(b)\nOn November 10, 2020, the Company issued a convertible debt in the principal amount of $20,000 each in exchange for cash. The convertible debt is unsecured, bears interest at 8% per annum compounded on the basis of a 365-day year and actual days lapsed, is convertible at $0.10 per 1 common share, and has a maturity date of May 10, 2021. The carrying value of beneficial conversion features not considered to be derivative instruments were determined by allocating the intrinsic value of the conversion features from proceeds. As a result, total proceeds of $20,000 were allocated to the beneficial conversion feature, recorded as equity portions of convertible debt and there were no remaining proceeds available for allocation to the liability portion of the convertible debt. The convertible debt was discounted by the amounts allocated to the conversion features.\nOn April 28, 2021, the Company renegotiated the terms of the convertible debt in exchange for a new convertible debt in the principal amount of $33,508 at $30,741, with $$2,767 original issue discount, for additional cash proceeds of $10,000 and surrender of the convertible note previously issued. In connection with the note, the Company issued 307,408 warrants exercisable at $0.25 per share, expiring on April 28, 2023. The warrants were calculated to have a relative fair value of $25,745. The convertible debt is unsecured, bears interest at 8% per annum compounded on the basis of a 365-day year and actual days elapsed, is convertible at $0.10 per 1 common share, and matures on January 28, 2022. The terms of the new convertible debt were substantially different and deemed extinguished resulting in a gain of $18,682 recorded on extinguishment of convertible debt.\nThe proceeds were allocated between the convertible debt and warrants on a relative fair value basis, and the issuance costs were proportioned accordingly. The fair value of the convertible debt was calculated using the present value of the debt and related interest at 12% incremental borrowing rate as the discount rate. The warrants were valued using the Black Scholes Option Pricing Model (Note 7).\nThe carrying value of beneficial conversion features not considered to be derivative instruments was determined by allocating $4,255 for the intrinsic value of the conversion features from the remaining proceeds allocated to the convertible debt after deducting the amount allocated to the warrants. As such, there were no remaining proceeds available for allocating to the liability portion of the convertible debt. As at June 30, 2021, the carrying value of this convertible debt was $8,247 (June 30, 2020 - $Nil) net of $25,261 unamortized discounts.\nOn December 31, 2021 the outstanding balance of the convertible debt and accrued interest was converted in exchange for 353,215 common shares at a conversion price of $0.10 per share for a total value of $35,321. As at June 30, 2022, the carrying value of this convertible debt was $nil (June 30, 2021 - $8,247).\n(c)\nOn December 28, 2020, the Company entered into a securities purchase agreement with a non-related party. Pursuant to this agreement, the Company issued a convertible debt in the principal amount of $120,000 at $110,000 with $10,000 original issue discount. In connection with this note, the Company paid an additional $15,000 in cash transaction costs, issued 110,000 common shares valued at $11,000 in transaction costs, and issued 1,100,000 warrants exercisable at $0.25 per share, expiring on December 28, 2022. The warrants were calculated to have a fair value of $67,555, which was reduced by the equity components of the transaction costs of $20,657, leaving a value of $46,898 as at March 31, 2021. This convertible debt is unsecured, bears interest at 8% per annum compounded on the basis of a 365-day year and actual days lapsed, is convertible at $0.10 per 1 common share, and matures on September 28, 2021.\nThe proceeds were allocated between the convertible debt and warrants on a relative fair value basis, and the issuance costs were proportioned accordingly. The fair value of the convertible debt was calculated using the present value of the debt and related interest at 12% incremental borrowing rate as the discount rate. The warrants were valued using the Black Scholes Option Pricing Model (Note 7).\nThe carrying value of beneficial conversion features not considered to be derivative instruments was determined by allocating $41,961 for the intrinsic value of the conversion features from the remaining proceeds allocated to the convertible debt after conducting the amount allocated to the warrants. As such, there were no remaining proceeds available for allocating to the liability portion of the convertible debt.\nOn June 18, 2021, the Company settled the convertible debt with a payment of $165,360 resulting in a loss on settlement of convertible debt of $41,037.\n(d)\nOn March 25, 2021, the Company entered into a securities purchase agreement with a non-related party. Pursuant to this agreement, the Company issued a convertible debt in the principal amount of $120,000 at $110,000 with $10,000 original issue discount. In connection with this note, the Company paid an additional $13,250 in cash transactions, issued 88,000 common shares valued at $22,000 in transaction costs, and issued 1,100,000 warrants exercisable at $0.25 per share, expiring on March 25, 2023. The warrants were calculated to have a fair value of $74,026, which was reduced by the equity components of the transaction costs of $32,106, leaving a value of $41,920 as at March 31, 2021. This convertible debt is unsecured, bears interest at 8% per annum compounded on the basis of a 365-day year and actual days lapsed, is convertible at $0.10 per 1 common share, and matures in nine months on December 25, 2021.\nThe proceeds were allocated between the convertible debt and warrants on a relative fair value basis, and the issuance costs were proportioned accordingly. The fair value of the convertible debt was calculated using the present value of the debt and related interest at 12% incremental borrowing rate as the discount rate. The warrants were valued using the Black Scholes Option Pricing Model (Note 7).\nThe carrying value of beneficial conversion features not considered to be derivative instruments was determined by allocating $42,492 for the intrinsic value of the conversion features from the remaining proceeds allocated to the convertible debt after conducting the amount allocated to the warrants. As such, there were no remaining proceeds available for allocating to the liability portion of the convertible debt.\nOn June 29, 2021, the Company settled the convertible debt with a payment of $146,880 resulting in a loss on settlement of convertible debt of $56,452.\nNOTE 11 - COMMITMENTS AND CONTINGENCIES\nThe Company leases its corporate office located at 8565 S. Eastern Ave. #150, Las Vegas, Nevada. The initial lease term is for 12 months commencing on September 8, 2019 after which the term is on a month-to-month basis. After the initial term, the Company may cancel the lease agreement at any time by providing 30 days written notice. The Company has elected the short-term lease practical expedient of 12 months and has not recorded a lease.\nNOTE 12 - INCOME TAXES\nAs of June 30, 2022, the Company was in a loss position; therefore, no deferred tax liability was recognized related to the undistributed earnings subject to withholding tax.\nNet operating loss carry forward of the Company, amounted to $2,909,935 (June 30, 2021 - $741,817) for the period ended June 30, 2022. The net operating loss carry forwards are available to be utilized against future taxable income for years through calendar year 2042. In assessing the reliability of deferred income tax assets, management considers whether it is more likely than not that some portion or all of the deferred income tax assets will not be realized. The ultimate realization of deferred tax assets is dependent upon the generation of future taxable income during the periods in which those temporary differences become deductible. Management considers the scheduled projected future taxable income, and tax planning strategies in making this assessment.\nNOTE 13 - RECLASSIFICATION OF PRIOR YEAR PRESENTATION\nCertain prior year amounts have been reclassified for consistency with the current year presentation. These reclassifications are limited to the Statement of Operations and have no effect on the reported results of operations.\nNOTE 14 - SUBSEQUENT EVENTS\nOn July 12, 2022, the Company entered into a securities purchase agreement with a non-related party. Pursuant to this agreement, the Company issued a convertible debt in the principal amount of $300,000 at $270,000 with $30,000 original issue discount. In connection with this note, the Company paid an additional $27,500 in cash transaction costs, issued 150,000 common shares valued at $75,000 in transaction costs, and issued 500,000 warrants exercisable at $0.25 per share, expiring on July 12, 2027. This convertible debt is unsecured, bears interest at 10% per annum compounded on the basis of a 365-day year and actual days lapsed payable monthly, is convertible at the lower of the lowest trading price during the previous 20 Trading Day period either (i) ending on date of conversion of this Note or (ii) the date hereof, and matures on January 12, 2023 (the Maturity Date). The Maturity Date may be extended by up to 6 months following the date of the original Maturity Date. In the event that the Maturity Date is extended, the interest rate shall increase to 18% per annum for any period following the original Maturity Date, payable monthly.\nOn July 15, 2022, the Company entered into a securities purchase agreement with a non-related party. Pursuant to this agreement, the Company issued a convertible debt in the principal amount of $150,000 at $135,000 with $15,000 original issue discount. In connection with this note, the Company paid an additional $11,250 in cash transaction costs, issued 75,000 common shares valued at $37,500 in transaction costs, and issued 250,000 warrants exercisable at $0.25 per share, expiring on July 15, 2027. This convertible debt is unsecured, bears interest at 10% per annum compounded on the basis of a 365-day year and actual days lapsed payable monthly, is convertible at the lower of the lowest trading price during the previous 20 Trading Day period either (i) ending on date of conversion of this Note or (ii) the date hereof, and matures on January 12, 2023 (the Maturity Date). The Maturity Date may be extended by up to 6 months following the date of the original Maturity Date. In the event that the Maturity Date is extended, the interest rate shall increase to 18% per annum for any period following the original Maturity Date, payable monthly.\nOn July 18, 2022, the Company entered into a securities purchase agreement with a non-related party. Pursuant to this agreement, the Company issued a convertible debt in the principal amount of $150,000 at $135,000 with $15,000 original issue discount. In connection with this note, the Company paid an additional $11,250 in cash transaction costs, issued 75,000 common shares valued at $37,500 in transaction costs, and issued 250,000 warrants exercisable at $0.25 per share, expiring on July 18, 2027. This convertible debt is unsecured, bears interest at 10% per annum compounded on the basis of a 365-day year and actual days lapsed payable monthly, is convertible at the lower of the lowest trading price during the previous 20 Trading Day period either (i) ending on date of conversion of this Note or (ii) the date hereof, and matures on January 12, 2023 (the Maturity Date). The Maturity Date may be extended by up to 6 months following the date of the original Maturity Date. In the event that the Maturity Date is extended, the interest rate shall increase to 18% per annum for any period following the original Maturity Date, payable monthly.\nOn July 26, 2022, the Company issued 275,000 common shares to a non-related party at a price of $0.50 per share for a total value of $137,500 in exchange for services.\nOn October 13, 2022, the Company entered into a securities purchase agreement with a non-related party. Pursuant to this agreement, the Company issued a convertible debt in the principal amount of $150,000 at $135,000 with $15,000 original issue discount. In connection with this note, the Company paid an additional $23,750 in cash transaction costs, issued 166,667 common shares valued at $50,000 in transaction costs, and issued 500,000 warrants exercisable at $0.25 per share, expiring on October 13, 2027. This convertible debt is unsecured, bears interest at 10% per annum compounded on the basis of a 365-day year and actual days lapsed payable monthly, is convertible at the lower of the lowest trading price during the previous 20 Trading Day period either (i) ending on date of conversion of this Note or (ii) the date hereof, and matures on April 13, 2023 (the Maturity Date). The Maturity Date may be extended by up to 6 months following the date of the original Maturity Date. In the event that the Maturity Date is extended, the interest rate shall increase to 18% per annum for any period following the original Maturity Date, payable monthly.\nOn October 13, 2022, the Company entered into a securities purchase agreement with a non-related party. Pursuant to this agreement, the Company issued a convertible debt in the principal amount of $75,000 at $135,000 with $7,500 original issue discount. In connection with this note, the Company paid an additional $5,625 in cash transaction costs, issued 83,300 common shares valued at $25,000 in transaction costs, and issued 250,000 warrants exercisable at $0.25 per share, expiring on October July 13, 2027. This convertible debt is unsecured, bears interest at 10% per annum compounded on the basis of a 365-day year and actual days lapsed payable monthly, is convertible at the lower of the lowest trading price during the previous 20 Trading Day period either (i) ending on date of conversion of this Note or (ii) the date hereof, and matures on April 13, 2023 (the Maturity Date). The Maturity Date may be extended by up to 6 months following the date of the original Maturity Date. In the event that the Maturity Date is extended, the interest rate shall increase to 18% per annum for any period following the original Maturity Date, payable monthly.\nOn October 13, 2022, the Company entered into a securities purchase agreement with a non-related party. Pursuant to this agreement, the Company issued a convertible debt in the principal amount of $75,000 at $135,000 with $7,500 original issue discount. In connection with this note, the Company paid an additional $5,625 in cash transaction costs, issued 83,300 common shares valued at $25,000 in transaction costs, and issued 250,000 warrants exercisable at $0.25 per share, expiring on October July 13, 2027. This convertible debt is unsecured, bears interest at 10% per annum compounded on the basis of a 365-day year and actual days lapsed payable monthly, is convertible at the lower of the lowest trading price during the previous 20 Trading Day period either (i) ending on date of conversion of this Note or (ii) the date hereof, and matures on April 13, 2023 (the Maturity Date). The Maturity Date may be extended by up to 6 months following the date of the original Maturity Date. In the event that the Maturity Date is extended, the interest rate shall increase to 18% per annum for any period following the original Maturity Date, payable monthly. Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nOn August 23, 2022, we received notice of resignation from Harbourside CPA, LLP (Harbourside), as our registered independent registered public accountant. The resignation from Harbourside is the result of their decision to cease operations. We appointed BF Borgers CPA PC (\"Borgers\") as our registered independent public accounting firm as of August 24, 2022. The decisions to appoint Borgers was approved by our Board of Directors on August 24, 2022.\nDisagreements with Accountants on Accounting and Financial Disclosure\nOther than the disclosure of uncertainty regarding the ability for us to continue as a going concern which was included in our accountants report on the financial statements for the fiscal year ended June 30, 2021; Harbouside CPAs report on the financial statements for the fiscal year ended June 30, 2021 did not contain an adverse opinion or a disclaimer of opinion, nor were they qualified or modified as to uncertainty, audit scope, or accounting principles.\nIn connection with the audit and review of our financial statements from the fiscal year ended June 30, 2022, there were no disagreements on any matter of accounting principles or practices, financial statement disclosures, or auditing scope or procedures, which disagreements if not resolved to their satisfaction would have caused them to make reference in connection with Borgerss opinion to the subject matter of the disagreement.\nIn connection with the audited financial statements of the Company for the fiscal year June 30, 2022, there have been no reportable events with the Company as set forth in Item 304(a)(1)(v) of Regulation S-K.\nItem 9.A Controls and Procedures.\nEvaluation of Disclosure Controls and Procedures\nWe conducted an evaluation, under the supervision and with the participation of our management, of the effectiveness of the design and operation of our disclosure controls and procedures. The term disclosure controls and procedures, as defined in Rules 13a-15(e) and 15d-15(e) under the Securities and Exchange Act of 1934, as amended (Exchange Act), means controls and other procedures of a company that are designed to ensure that information required to be disclosed by the company in the reports it files or submits under the Exchange Act is recorded, processed, summarized and reported, within the time periods specified in the Securities and Exchange Commission's rules and forms. Disclosure controls and procedures also include, without limitation, controls and procedures designed to ensure that information required to be disclosed by a company in the reports that it files or submits under the Exchange Act is accumulated and communicated to the company's management, including its principal executive and principal financial officers, or persons performing similar functions, as appropriate, to allow timely decisions regarding required disclosure. Based on this evaluation, our principal executive and principal financial officers concluded as of June 30, 2022 that our disclosure controls and procedures were not effective at the reasonable assurance level due to the material weaknesses in our internal controls over financial reporting discussed immediately below.\nIdentified Material Weakness\nA material weakness in our internal control over financial reporting is a control deficiency, or combination of control deficiencies, that results in more than a remote likelihood that a material misstatement of the financial statements will not be prevented or detected.\nManagement identified the following material weakness during its assessment of internal controls over financial reporting, which are primarily due to the size of the Company and available resources:\nPersonnel: We do not employ a full time Chief Financial Officer. We utilize a consultant to assist with our financial reporting. There are limited personnel to assist with the accounting and financial reporting function, which results in: (i) a lack of segregation of duties and (ii) controls that may not be adequately designed or operating effectively. Despite the existence of material weaknesses, the Company believes the financial information presented herein is materially correct and fairly presents the financial position and operating results of the year ended June 30, 2022, in accordance with GAAP. During 2022-2023, the Company intends to seek qualified accounting staff to expand its internal accounting and reporting functions.\nAudit Committee: We do not yet have an audit committee, and we lack a financial expert. During 2022-2023, the Board expects to appoint an Audit Committee and to identify a committee Chairman who is an audit committee financial expert as defined by the Securities and Exchange Commission (SEC) and as adopted under the Sarbanes-Oxley Act of 2002.\nManagement's Report on Internal Control Over Financial Reporting.\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting as defined in Rules 13a-15(f) and 15d-15(f) under the Securities Exchange Act of 1934. Our internal control over financial reporting is a process designed by, or under the supervision of, our CEO and CFO, or persons performing similar functions, and effected by our board of directors, management and other personnel, to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with accounting principles generally accepted in the United States of America (GAAP). Our internal control over financial reporting includes those policies and procedures that: (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and disposition of the assets of the Company; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with GAAP and that receipts and expenditures of the Company are being made only in accordance with authorization of management and directors of the Company; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the Companys assets that could have a material effect on the financial statements.\nManagement assessed the effectiveness of the Companys internal control over financial reporting as of June 30, 2022. In making this assessment, management used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission in the 2013 Internal Control-Integrated Framework. Based on its evaluation, management has concluded that the Companys internal control over financial reporting was not effective as of June 30, 2022.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions or that the degree of compliance with the policies or procedures may deteriorate. A control system, no matter how well designed and operated can provide only reasonable, but not absolute, assurance that the control systems objectives will be met. The design of a control system must reflect the fact that there are resource constraints, and the benefits of controls must be considered relative to their cost.\nChanges in Internal Control over Financial Reporting\nThere have been no changes in our internal control over financial reporting subsequent to the fiscal year ended June 30, 2022, which were identified in connection with our managements evaluation required by paragraph (d) of rules 13a-15 and 15d-15 under the Exchange Act, that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nWe are not required by current SEC rules to include an auditor's attestation report. Our registered public accounting firm has not attested to Management's reports on our internal control over financial reporting.\nLimitations of the Effectiveness of Disclosure Controls and Internal Controls\nOur management, including our Principal Executive Officer and Principal Financial Officer, does not expect that our disclosure controls and internal controls will prevent all error and all fraud. A control system, no matter how well conceived and operated, can provide only reasonable, not absolute, assurance that the objectives of the control system are met. Further, the design of a control system must reflect the fact that there are resource constraints, and the benefits of controls must be considered relative to their costs. Because of inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, within our company have been detected. These inherent limitations include the realities that judgments in decision-making can be faulty, and that breakdowns can occur because of a simple error or mistake. Additionally, controls can be circumvented by the individual acts of some persons, by collusion of two or more people, or by management override of the control.\nThe design of any system of controls is also based in part upon certain assumptions about the likelihood of future events, and there can be no assurance that any design will succeed in achieving our stated goals under all potential future conditions; over time, a control may become inadequate because of changes in conditions, or the degree of compliance with the policies or procedures may deteriorate. Because of inherent limitations in a cost-effective control system, misstatements due to error or fraud may occur and not be detected.\nItem 9.B Other Information\nDuring the fiscal year ended June 30, 2022, we completed various private placements whereby a total of 5,558,810 common shares were issued for a total of $1,425,202 cash. We also issued 715,572 common shares for services valued at $458,250. We also issued 937,151 common shares in settlement of convertible debt valued at $93,715.\nItem 9.C Disclosure Regarding Foreign Jurisdiction the Prevent Inspection\nNot applicable.\nPART III   Item 10. Directors, Executive Officers and Corporate Governance\nIdentification of Directors and Executive Officers\nThe following table sets forth the names and ages of our current directors and executive officers as of November 108, 2022:\nName and Age\nPosition(s) Held\nDate of Appointment\nOther Public Company Directorships\nShannon Wilkinson, 45\nDirector\nPresident\nChief Executive Officer\nSecretary\nTreasurer\nSeptember 6, 2019\nNone\nTroy Wilkinson, 46\nDirector\nSeptember 6, 2019\nNone\nMichael De Valera, 57\nDirector\nSeptember 6, 2019\nNone\nChris White, 50\nDirector\nChief Information Security Officer\nApril 14, 2021\nNone\nEarl Johnson, 85\nChief Financial Officer\nApril 26, 2022\nNone\nTerm of Office\nShould a vacancy exist, our Board of Directors has the power to nominate and appoint a director or directors to fill such vacancy, and each shall hold office until the next annual meeting of stockholders and until his/her successor shall have been duly elected and qualified.\nBackground and Business Experience\nShannon Wilkinson - Director, President, Chief Executive Officer, Secretary and Treasurer\nShannon Wilkinson is a graduate from the University of Nevada, Las Vegas with a Bachelor's in Management Information Systems. She also earned her Masters in Information Systems Management from the University of Phoenix. Shannon spent the first 12 years of her career overseas working for the United Nations Department of Peacekeeping Operations building mission critical software platforms. Upon her return to the US in February 2013, Shannon joined SocialWellth as Director of Software Development leading development teams in building software platforms for some of the largest healthcare organizations. She remained in that position until summer of 2015 when she left to co-found Axiom Cyber Solutions where she was responsible for the software development arm of the company, developing Axioms cloud based Polymorphic Cyber Defense Platform. She exited Axiom Cyber Solutions in June 2019 when Axiom was acquired by a private equity firm. In September 2019, Mrs. Wilkinson co-founded Tego Cyber Inc. with her husband, with a mission to develop an innovative threat intelligence platform and continue developing automated cybersecurity solutions to help companies respond to the ever-changing cyber threat landscape. Mrs. Wilkinson works full time in her capacity as Director, President, CEO, Secretary and Treasurer of Tego Cyber Inc. Mrs. Wilkinson was selected as the 2018 Las Vegas Women in Technology - Cybersecurity, 2017 Las Vegas Women in Technology Entrepreneur as well as appeared in the MyVEGAS Magazine Top 100 Women of Las Vegas in 2017 and 2018.\nTroy Wilkinson - Director\nTroy Wilkinson began his career in January 2000 as a Law Enforcement officer with the Conway Police Department where he remained until June 2007 when he joined a Joint Terrorism Task Force as a lead bomb investigator and violent crime homicide detective. In December 2008 Troy was recruited by the U.S. State Department to train police officers in Kosovo on cybercrime related matters where he earned a reputation as a top cybercrime investigator. Together with a team of international investigators he built the first IT forensics lab in the European Union Mission in Kosovo. After returning home to the U.S. in February 2013, Mr. Wilkinson joined SocialWellth as its Infrastructure Security Director. He remained in that position until June 2014 when he accepted the position of Director of Information Technology for Litigation Services, LLC. In the summer of 2015, he co-founded Axiom Cyber Solutions with his wife Shannon Wilkinson and left in December of 2018 to accept the position of Executive Director of Information Security (CISO) with International Cruise and Excursion where he remained until August 2019. In addition to his role as Director of Tego Cyber Inc., Mr. Wilkinson is currently is the Chief Information Security Officer for Interpublic Group of Companies (IPG) where he is responsible for all aspects of cyber defense for over 60,000 users in more than 130 countries. Mr. Wilkinson is a worldwide keynote speaker on cybersecurity, co-authored an Amazon Best Seller, is featured on several news sources as a cybersecurity expert and has contributed to numerous national syndicated publications on cybersecurity topics including ransomware, DDoS, cyber-crime trends, and cyber security careers.\nMichael De Valera - Director\nMichael De Valera has over thirty years of experience providing information technology services. In 1989 he co-founded Internet Computers, Inc. where he remained as one of the founding principles until January 2006 when he left to start his own company TechnoMedia Consulting, Inc. where he remains the sole principal to this day. TechnoMedia Consulting, Inc. provides information technology services for companies and organizations that are either too small to have their own dedicated IT departments or simply realize that specialized functionality is more efficiently and economically provided by a third party. His clients cover a broad range of organizations and industries. His undergraduate BA Finance studies, majoring in Finance and Economics, were at the University of Pennsylvania Wharton School of Finance. Michael currently dedicates up to 5 hours a week to Tego Cyber Inc. and will allocate more time when first product is launched. Michael has traveled extensively around the world and his personal interests include wine and cooking.\nChris White - Director, Chief Information Security Officer\nChris White has over thirty years of experience in cyber security, telecommunications and automation. He most recently was the Deputy CISO / Director of Global Security Operations for The Interpublic Group of Companies, Inc. and has previously served as the Chief Technology Officer for EY MSS, Senior Security Engineer at AT&T, Senior Lead Engineer at General Dynamics AIS, and a member of the US Air Force. He holds a master's degree in Systems Engineering and a Bachelor of Science degree in Network Engineering from Regis University.\nEarl Johnson - Chief Financial Officer\nDr. Johnson has over 35 years experience in international finance, corporate investigations, and law enforcement. He currently is the CEO & President of International Consultants & Investigations, a private security and investigation consultancy firm. His field of expertise includes international fraud investigations, corporate intelligence and due diligence, cryptocurrency tracking, and cybersecurity consulting. He has experience operating in the Far East, Middle East, Europe and South America. Dr. Johnson holds a PhD in International Finance from the California University for Advanced Studies.\nTerm of Office\nEach director serves for a term of one year and until his successor is elected at the Annual Shareholders Meeting and is qualified, subject to removal by the shareholders. Each officer serves for a term of one year and until his successor is elected at a meeting of the Board of Directors and is qualified. Each member of the Advisory Board serves at the discretion of the Board of Directors.\nEmployees\nWe have a total of 5 employees, 3 of which are our executive officers. These individuals are not obligated to devote any specific number of hours to our matters and intend to devote only as much time as they deem necessary to our affairs. At this time, our President and Chief Executive Officer is devoted full time to our operations and devotes approximately 40-50 hours per week. At this time, our Chief Information Security Officer devotes approximately 8-10 hours per week to our operations. At this time, our Chief Financial Officer devotes approximately 8-10 hours per week to our operations. The amount of time they will devote in any time period will vary based on the stage of our business and the progress we make. Accordingly, once we are beyond the developmental phase our management will spend more time on our affairs.\nLimitation of Liability and Indemnification Matters\nInsofar as indemnification for liabilities arising under the Securities Act may be permitted to directors, officers and controlling persons of the registrant pursuant to the foregoing provisions, or otherwise, we have been advised that in the opinion of the Securities and Exchange Commission such indemnification is against public policy as expressed in the Securities Act, and is, therefore, unenforceable.\nIdentification of Significant Employees\nWe have no significant employees other than the aforementioned Officers and Directors.\nFamily Relationship\nShannon and Troy Wilkinson are husband and wife. Other than the foregoing, we currently do not have any officers or directors of who are related to each other.\nInvolvement in Certain Legal Proceedings\nDuring the past ten years no director, executive officer, promoter or control person of our company has been involved in the following:\n(1) a petition under the Federal bankruptcy laws or any state insolvency law which was filed by or against, or a receiver, fiscal agent or similar officer was appointed by a court for the business or property of such person, or any partnership in which he was a general partner at or within two years before the time of such filing, or any corporation or business association of which he was an executive officer at or within two years before the time of such filing;\n(2) such person was convicted in a criminal proceeding or is a named subject of a pending criminal proceeding (excluding traffic violations and other minor offenses);\n(3) such person was the subject of any order, judgment, or decree, not subsequently reversed, suspended or vacated, of any court of competent jurisdiction, permanently or temporarily enjoining him from, or otherwise limiting, the following activities:\ni.\nActing as a futures commission merchant, introducing broker, commodity trading advisor, commodity pool operator, floor broker, leverage transaction merchant, any other person regulated by the Commodity Futures Trading Commission, or an associated person of any of the foregoing, or as an investment adviser, underwriter, broker or dealer in securities, or as an affiliated person, director or employee of any investment company, bank, savings and loan association or insurance company, or engaging in or continuing any conduct or practice in connection with such activity;\nii.\nEngaging in any type of business practice; or\niii.\nEngaging in any activity in connection with the purchase or sale of any security or commodity or in connection with any violation of Federal or State securities laws or Federal commodities laws;\n(4) such person was the subject of any order, judgment or decree, not subsequently reversed, suspended or vacated, of any Federal or State authority barring, suspending or otherwise limiting for more than 60 days the right of such person to engage in any activity described in paragraph (f)(3)(i) of this section, or to be associated with persons engaged in any such activity;\n(5) such person was found by a court of competent jurisdiction in a civil action or by the Commission to have violated any Federal or State securities law, and the judgment in such civil action or finding by the Commission has not been subsequently reversed, suspended, or vacated;\n(6) such person was found by a court of competent jurisdiction in a civil action or by the Commodity Futures Trading Commission to have violated any Federal commodities law, and the judgment in such civil action or finding by the Commodity Futures Trading Commission has not been subsequently reversed, suspended or vacated;\n(7) such person was the subject of, or a party to, any Federal or State judicial or administrative order, judgment, decree, or finding, not subsequently reversed, suspended or vacated, relating to an alleged violation of:\ni.\nAny Federal or State securities or commodities law or regulation; or\nii.\nAny law or regulation respecting financial institutions or insurance companies including, but not limited to, a temporary or permanent injunction, order of disgorgement or restitution, civil money penalty or temporary or permanent cease-and-desist order, or removal or prohibition order; or\niii.\nAny law or regulation prohibiting mail or wire fraud or fraud in connection with any business entity; or\n(8) such person was the subject of, or a party to, any sanction or order, not subsequently reversed, suspended or vacated, of any self-regulatory organization (as defined in Section 3(a)(26) of the Exchange Act (15 U.S.C. 78c(a)(26))), any registered entity (as defined in Section 1(a)(29) of the Commodity Exchange Act (7 U.S.C. 1(a)(29))), or any equivalent exchange, association, entity or organization that has disciplinary authority over its members or persons associated with a member.\nIndependence of Directors\nThe Board of Directors is currently composed of 4r members. Mrs. Shannon Wilkinson, Mr. Troy Wilkinson, Mr. Michael De Valera and Mr. Chris White. Mrs. Wilkinson and Mr. White do not qualify as an independent Directors in accordance with the published listing requirements of the NASDAQ Global Market as they hold officer positions. Mr. Wilkinson does not qualify as an independent Directors in accordance with the published listing requirements of the NASDAQ Global Market as he is married to Mrs. Wilkinson. Mr. Michael De Valera does qualify as independent director as he is not an officer of our company. The NASDAQ independence definition includes a series of objective tests, such as that the Director is not, and has not been for at least three years, one of the companys employees and that neither the Director, nor any of his family members has engaged in various types of business dealings with us. In addition, the Board of Directors has not made a subjective determination as to each Director that no relationships exist which, in the opinion of the Board of Directors, would interfere with the exercise of independent judgment in carrying out the responsibilities of a Director, though such subjective determination is required by the NASDAQ rules. Had the Board of Directors made these determinations, the Board of Directors would have reviewed and discussed information provided by the Directors and the Company with regard to each Directors business and personal activities and relationships as they may relate to the Company and its management\nCommittees\nWe do not currently have an audit, compensation or nominating committee. The Board of Directors as a whole currently acts as our audit, compensation and nominating committees. We intend to establish an audit, compensation and nominating committee of our Board of Directors once we expand the Board to include one or more independent directors and intend to adopt a charter for each committee.\nOur audit committee shall be primarily responsible for reviewing the services performed by our independent auditors, evaluating our accounting policies and our system of internal controls. Our compensation committee shall assist the Board in reviewing and approving the compensation structure, including all forms of compensation, relating to our directors and executive officers and periodically reviewing and approving any long-term incentive compensation or equity plans, programs or similar arrangements. Our nominating committee shall assist the Board in selecting individuals qualified to become our directors and in determining the composition of the Board and its committees.\nCompliance with Section 16(a) of the Exchange Act\nSection 16(a) of the Exchange Act requires the Companys directors, executive officers and persons who beneficially own 10% or more of a class of securities registered under Section 12 of the Exchange Act to file reports of beneficial ownership and changes in beneficial ownership with the SEC. Directors, executive officers and greater than 10% stockholders are required by the rules and regulations of the SEC to furnish the Company with copies of all reports filed by them in compliance with Section 16(a). To the Companys knowledge, based solely on a review of reports furnished to it, for the year ended June 30, 2022, all of the Companys officers, directors and ten percent holders have made the required filings other than one Form 3 filing regarding the initial statement of beneficial ownership of Earl Johnson which was filed late.\nRisk Oversight\nEffective risk oversight is an important priority of the Board of Directors. Because risks are considered in virtually every business decision, the Board of Directors discusses risk throughout the year generally or in connection with specific proposed actions. The Board of Directors approach to risk oversight includes understanding the critical risks in our business and strategy, evaluating our risk management processes, allocating responsibilities for risk oversight among the full Board of Directors, and fostering an appropriate culture of integrity and compliance with legal responsibilities.\nCorporate Governance\nWe promote accountability for adherence to honest and ethical conduct; endeavors to provide full, fair, accurate, timely and understandable disclosure in reports and documents that we file with the SEC and in other public communications made; and we strive to be compliant with applicable governmental laws, rules and regulations. We have not yet formally adopted a written code of business conduct and ethics that govern our employees, officers and Directors as we are not currently required to do so.\nIn lieu of an Audit Committee, our Board of Directors is responsible for reviewing and making recommendations concerning the selection of outside auditors, reviewing the scope, results and effectiveness of the annual audit of our financial statements and other services provided by our independent public accountants. The Board of Directors reviews our internal accounting controls, practices and policies.\nCode of Ethics\nOur Board of Directors has not adopted a code of ethics. We anticipate that we will adopt a code of ethics when we increase either the number of our Directors or the number of our employees. Item 11. Executive Compensation\nName\nPosition\nFiscal Year\nEnded\n6/30\nWages\n$\nManagement\nFees\n$\nBonus\n$\nStock\nAwards\n$\nOption\nAwards\n$\nAll Other\nCompensation\n$\nTotal\n$\nShannon Wilkinson (1)\n89,150\n45,000\n-\n-\n-\n-\n134,750\nTroy Wilkinson (2)\n-\n119,250\n-\n-\n-\n-\n119,250\nNarrative Disclosure to Summary Compensation Table\n(1)\nOn January 3, 2022, the Company entered into an employment agreement with Shannon (the Wilkinson Employment Agreement) having an effective date of January 1, 2022. The Wilkinson Employment Agreement provides for 5 year initial term. Thereafter, either the Company or Ms. Wilkinson has the right to extend the Wilkinson Employment Agreement for 3 additional one-year terms. The Company and Ms. Wilkinson can mutually elect to terminate the Wilkinson Employment Agreement at any time upon 90 days written notice. Ms. Wilkinson is entitled to a base salary of $120,000 per year. Ms. Wilkinson has been granted non-qualified options to purchase 2,000,000 shares under the terms and conditions of the Companys 2021 Equity Compensation Plan (Equity Compensation Plan). The stock options shall be subject to a 5 year vesting schedule of 400,000 options on the 1st day of each year following the Effective Date. The option grant is priced at $0.65 per share. The Company has also granted to Mrs. Wilkinson, performance stock units of 1,000,000 shares of the Companys common stock pursuant to the Equity Compensation Plan which shall vest in 250,000 share increments upon reaching certain market capitalization goals. In the event Mrs. Wilkinsons employment is terminated without Cause or Mrs. Wilkinson resigns for Good Reason (as Cause and Good Reason are defined in the Wilkinson Employment Agreement) within 12 months of a Change in Control (as defined in the Wilkinson Employment Agreement), Mrs. Wilkinson shall receive her salary for the duration of the term of the Wilkinson Employment Agreement and 100% of the total number of Options and Performance stock units due to Mrs. Wilkinson for the duration of the term of the Wilkinson Employment Agreement shall immediately become vested and issuable.\n(2)\nThere is no formal contract in place for Mr. Tory Wilkinson to act as director. Mr. Wilkinson has been granted non-qualified options to purchase 2,000,000 common shares under the terms and conditions of the Companys 2021 Equity Compensation Plan (Equity Compensation Plan). The stock options shall be subject to a 5 year vesting schedule of 400,000 options on the 1st day of each year following the Effective Date. The option grant is priced at $0.65 per share. The Company has also granted to Mr. Wilkinson performance stock units of 1,000,000 shares of the Companys common stock pursuant to the Equity Compensation Plan which shall vest in 250,000 share increments upon reaching certain market capitalization goals.\nOutstanding Equity Awards at Fiscal Year-End\nOn December 8, 2021, the Board of Directors of the Company approved the adoption of the 2021 Equity Compensation Plan (the Equity Compensation Plan) to provide employees, certain consultants and advisors who perform services for the Company, and non-employee members of the Board of Directors of the Company with the opportunity to receive grants of incentive stock options, nonqualified stock options, stock appreciation rights, stock awards, stock units and other stock-based awards.\nStock Options\nDuring the year ended June 30, 2022 the Company issued a total of 6,000,000 non-qualified stock options (the options) to directors, officers and certain key consultants. The options are subject to the terms and conditions of the Equity Compensation Plan. All granted options are subject to a five-year vesting schedule equal to 20% per year starting on the 1st day of each year following the effective date. All options have an exercise price of $0.65 which was the closing price of the Companys common stock on the day the day grant. As of June 30, 2022 none of the options had vested.\nThe following is a continuity schedule for the Companys outstanding non-qualified stock options:\nNumber of\nOptions\nWeighted Average Exercise Price\nOutstanding, June 30, 2021\n-\n$ -\nGranted\n6,000,000\n0.65\nExercised\n-\n-\nCancelled\n-\n-\nOutstanding, June 30, 2022\n6,000,000\n$ 0.65\nAs at June 30, 2022, the Company had the following stock options outstanding:\nGrant\nDate\nNumber\nOutstanding\nNumber\nExercisable\nExercise\nPrice\nWeighted Average Life (Years)\nExpiry Date\nJanuary 3, 2022\n125,000\n-\n$ 0.65\n9.52\nJanuary 3, 2032\nJanuary 4, 2022\n5,875,000\n-\n$ 0.65\n9.52\nJanuary 4, 2032\nTotal\n6,000,000\n-\n$ 0.65\n9.52\nPerformance Stock Units\nDuring the year ended June 30, 2022 the Company issued a total of 4,000,000 performance stock units (performance units) to directors, officers and certain key consultants. The performance units are subject to the terms and conditions of the Equity Compensation Plan. The performance units will be earned and vest upon reaching certain market capitalization goals during the performance period ending on December 31, 2026. As of June 30, 2022, none of the performance stock units had vested.\nThe following is a continuity schedule for the Companys outstanding performance stock units:\nNumber of\nUnits\nWeighted Average Exercise Price\nOutstanding, June 30, 2021\n-\n$ -\nGranted\n4,000,000\n-\nExercised\n-\n-\nCancelled\n-\n-\nOutstanding, June 30, 2022\n4,000,000\n$ -\nAs at June 30, 2022, the Company had the following stock options outstanding:\nGrant\nDate\nNumber\nOutstanding\nNumber\nExercisable\nExercise\nPrice\nWeighted Average Life (Years)\nExpiry Date\nMarch 8, 2022\n4,000,000\n-\n$ 0.00\n4.82\nDecember 31, 2026\nTotal\n4,000,000\n-\n$ 0.00\n4.82\nLong-Term Incentive Plans\nThere are no arrangements or plans in which we provide pension, retirement or similar benefits for directors or executive officers.\nCompensation of Directors\nOur directors receive no annual salary or bonus for their service as members of the Companys board of directors.\nSecurity Holders Recommendations to Board of Directors\nShareholders can direct communications to our Chief Executive Officer, Shannon Wilkinson, at our executive offices. However, while we appreciate all comments from shareholders, we may not be able to individually respond to all communications. We attempt to address shareholder questions and concerns in our press releases and documents filed with the SEC so that all shareholders have access to information about us at the same time. Mrs. Wilkinson collects and evaluates all shareholder communications. All communications addressed to our directors and executive officers will be reviewed by those parties unless the communication is clearly frivolous. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholders Matters\nThe following table sets forth certain information concerning the number of shares of our common stock owned beneficially as of November 10, 2022, by: (i) each of our directors; (ii) each of our named executive officers; and (iii) each person or group known by us to beneficially own more than 5% of our outstanding shares of common stock. Unless otherwise indicated, the shareholders listed below possess sole voting and investment power with respect to the shares they own. Unless otherwise specified, the address of each of the persons set forth below is care of the Company at the address 8565 South Eastern Avenue, Suite 150, Las Vegas, Nevada, 89123.\nBeneficial ownership has been determined in accordance with Rule 13d-3 under the Exchange Act. Under this rule, certain shares may be deemed to be beneficially owned by more than one person (if, for example, persons share the power to vote or the power to dispose of the shares). In addition, shares are deemed to be beneficially owned by a person if the person has the right to acquire shares (for example, upon exercise of an option or warrant) within 60 days of the date as of which the information is provided. In computing the percentage ownership of any person, the amount of shares is deemed to include the amount of shares beneficially owned by such person by reason of such acquisition rights. As a result, the percentage of outstanding shares of any person as shown in the following table does not necessarily reflect the persons actual voting power at any particular date.\nName and Address of Beneficial Owner\nAmount and Nature\nof Beneficial\nOwnership (1)\n(#)\nPercent of\nClass (2)\n(%)\nShannon Wilkinson (3)\n3,000,000\n10.98 %\nTroy Wilkinson (4)\n3,000,000\n10.98 %\nMichael De Valera (5)\n1,020,000\n3.73 %\nChris White (6)\n108,000\n0.40 %\nEarl Johnson (7)\n36,600\n0.13 %\nAll Officers, Directors and Beneficial Owners as a Group Total\n7,164,600\n26.22 %\n(1) The number and percentage of shares beneficially owned is determined under rules of the SEC and the information is not necessarily indicative of beneficial ownership for any other purpose. Under such rules, beneficial ownership includes any shares as to which the individual has sole or shared voting power or investment power and also any shares, which the individual has the right to acquire within 60 days through the exercise of any stock option or other right. The persons named in the table have sole voting and investment power with respect to all shares of common stock shown as beneficially owned by them, subject to community property laws where applicable and the information contained in the footnotes to this table.\n(2) Based on 27,316,377 issued and outstanding shares of common stock as of November 10, 2022.\n(3) Shannon Wilkinson is a Director and the Company's Chief Executive Officer, President, Secretary and Treasurer. Her beneficial ownership includes 3,000,000 common shares.\n(4) Troy Wilkinson is a Director of the Company. His beneficial ownership includes 3,000,000 common shares.\n(5) Michael De Valera is a Director of the Company. His beneficial ownership includes 1,020,000 common shares directly owned.\n(6) Chris White is a Director of the Company and the Companys Chief Information Security Officer. His beneficial ownership includes 108,000 common shares directly owned.\n(7) Earl Johnson is the Chief Financial Officer of the Company. His beneficial ownership includes 36,000 common shares directly owned.\nChanges in Control\nThere are no present arrangements or pledges of the Companys securities, which may result in a change in control of the Company. Item 13. Certain Relationships and Related Transactions, and Director Independence\nRelated Party Transactions\nRelated party transactions are measured at the exchange amount, which is the amount of consideration established and agreed to by the related parties. Related parties are natural persons or other entities that have the ability, directly, or indirectly, to control another party or exercise significant influence over the party in making financial and operating decisions. Related parties include other parties that are subject to common control or that are subject to common significant influences.\nDuring the year ended June 30, 2022, there were transactions incurred between the Company and Shannon Wilkinson, Director, CEO, President, Secretary and Treasurer of the Company for management fees of $45,000 (June 30, 2021 - $134,750) and net wages of $89,150 (June 30, 2021 - $Nil).\nDuring the year ended June 30, 2022, there were transactions incurred between the Company and Earl Johnson, Chief Financial Officer of the Company for net wages of $5,037 (June 30, 2021 - $Nil).\nDuring the year ended June 30, 2022, there were transactions incurred between the Company and Chris White, Director and Chief Information Security Officer of the Company for management fees of $12,500 (June 30, 2021 - $32,500) and net wages of $59,785 (June 30, 2021 - $Nil).\nDuring the year ended June 30, 2022, there were transactions incurred between the Company and Troy Wilkinson, Director of the Company for management fees of $119,250 (June 30, 2021 - $Nil).\nOther than the foregoing, none of the directors or executive officers of the Company, nor any person who owned of record or was known to own beneficially more than 5% of the Companys outstanding shares of its Common Stock, nor any associate or affiliate of such persons or companies, has any material interest, direct or indirect, in any transaction that has occurred during the past fiscal year, or in any proposed transaction, which has materially affected or will affect the Company.\nWith regard to any future related party transaction, we plan to fully disclose any and all related party transactions in the following manner:\n-\ndisclosing such transactions in reports where required;\n-\ndisclosing in any and all filings with the SEC, where required;\n-\nobtaining disinterested directors consent; and\n-\nobtaining shareholder consent where required.\nReview, Approval or Ratification of Transactions with Related Persons\nGiven our small size and limited financial resources, we have not adopted formal policies and procedures for the review, approval or ratification of transactions, such as those described above, with our executive officers, Directors and significant stockholders. However, all of the transactions described above were approved and ratified by our Board of Directors. In connection with the approval of the transactions described above, our Board of Directors, took into account several factors, including their fiduciary duties to the Company; the relationships of the related parties described above to the Company; the material facts underlying each transaction; the anticipated benefits to the Company and related costs associated with such benefits; whether comparable products or services were available; and the terms the Company could receive from an unrelated third party.\nWe intend to establish formal policies and procedures in the future, once we have sufficient resources and have appointed additional Directors, so that such transactions will be subject to the review, approval or ratification of our Board of Directors, or an appropriate committee thereof. With regard to any future related party transaction, we plan to fully disclose any and all related party transactions in the following manner:\n-\ndisclosing such transactions in reports where required;\n-\ndisclosing in any and all filings with the SEC, where required;\n-\nobtaining disinterested directors consent; and\n-\nobtaining shareholder consent where required.\nDirector Independence\nQuotations for our common stock are entered on the Over-the-Counter Bulletin Board inter-dealer quotation system, which does not have director independence requirements. For purposes of determining director independence, we apply the definitions set out in NASDAQ Rule 4200(a)(15). Under NASDAQ Rule 4200(a)(15), a director is not considered to be independent if he or she is also an executive officer or employee of the corporation. As a result, the we have one independent director, Michael De Valera, as our other directors are each also an executive officers or related to an executive officer. Item 14. Principle Accountant Fees and Services\nFor Year Ended\nJune 30, 2022\nFor Year Ended\nJune 30, 2021\nAudit Fees\n$ 45,000\n$ 52,240\nAudit Related Fees\n7,500\n-\nTax Preparation\n2,000\n2,000\nOther\n-\n-\nTotal\n$ 54,500\n$ 54,240\nAudit Fees consist of fees billed for professional services rendered for the audit of our financial statements and review of the interim financial statements included in quarterly reports and services that are normally provided by the above auditors in connection with statutory and regulatory fillings or engagements.\nAudit-Related Fees are fees for assurance and related services by the principal accountant that are traditionally performed by the principal accountant and which are reasonably related to the performance of the audit or review of the registrant's financial statements and fees attributed to the audit of.\nIn the absence of a formal audit committee, the full Board of Directors pre-approves all audit and non-audit services to be performed by the independent registered public accounting firm in accordance with the rules and regulations promulgated under the Securities Exchange Act of 1934, as amended. The Board of Directors pre-approved 100% of the audit, audit-related and tax services performed by the independent registered public accounting firm for the fiscal periods ended June 30, 2022 and June 30, 2021.\nPART IV Item 15. Exhibits and Financial Statements.\nExhibit\nNumber\nDescription\n3.1\nArticles of Incorporation filed with the Nevada Secretary of State on September 6, 2019 (2)\n3.2\nBylaws (2)\n4.1\n2021 Equity Compensation Plan (3)\n10.1\nCompilation of Website or Software Development Agreement and Addendum between Company and Cistck, dated June 4, 2020 (4)\n10.2\nCompilation of FirstFire Global Opportunities Fund, LLC Securities Purchase Agreement, Convertible Promissory Note and Other Agreements (5)\n10.3\nCompilation of GS Capital Partners, LLC Securities Purchase Agreement, Convertible Promissory Note and Other Agreements (6)\n10.4\nCompilation of Analytico Services Conseils Inc. Securities Purchase Agreement, Convertible Promissory Note and Warrant (7)\n10.5\nCompilation of Reynald Thauvette and Dominique Joyal Securities Purchase Agreement, Convertible Promissory Note and Warrant (8)\n10.6\nMaster Services Agreement between the Company and IONnovate, LLC dated September 3, 2021 (9)\n10.7\nEmployment Agreement between the Company and Shannon Wilkinson dated January 3, 2022 (10)\n10.8\nEmployment Agreement between the Company and Chris C. White dated January 3, 2022 (11)\n10.9\nEmployment Agreement between the Company and Earl R. Johnson dated April 26, 2022 (12)\n101.INS\nXBRL Instance Document\n101.SCH\nXBRL Taxonomy Extension Schema Document\n101.CAL\nXBRL Taxonomy Extension Calculation Linkbase Document\n101.LAB\nXBRL Taxonomy Extension Labels Linkbase Document\n101.PRE\nXBRL Taxonomy Extension Presentation Linkbase Document\n101.DEF\nXBRL Taxonomy Extension Definition Linkbase Document\n*\nFiled herewith.\n**\nFurnished herewith.\nItem 16. Form 10-K Summary\nNone.\nSIGNATURES\nIn accordance with Section 13 or 15(d) of the Exchange Act, the registrant caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nTego Cyber Inc.\nDate: November 14, 2022\nBy:\n/s/ Shannon Wilkinson\nShannon Wilkinson\nChief Executive Officer\n(Principal Executive Officer)\nTego Cyber Inc.\nDate: November 14, 2022\nBy:\n/s/ Earl Johnson\nEarl Johnson\nChief Executive Officer\n(Principal Financial and Accounting Officer)"
}