{
    "cik": "1818550",
    "company": "Incordex Corp.",
    "filing_type": "10-K",
    "filing_date": "2023-10-10",
    "period_of_report": "2023-06-30",
    "sic": "7200",
    "state_of_inc": "NV",
    "state_location": "X0",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1818550/0001477932-23-007468-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1818550/000147793223007468/incordex_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1818550/0001477932-23-007468.txt",
    "filename": "1818550_10K_2023_0001477932-23-007468.htm",
    "content": "ITEM 1\nDescription of Business ITEM 1A\nRisk Factors ITEM 1B\nUnresolved Staff comments Item 2. Properties.\nCurrently we dont own any properties. Our business office is located at 6 Rosemary Way, Nuneaton, United Kingdom CV10 7ST. This address was provided by sole officer and president, Mr. Abramovici. Our telephone number is +44-203-99-11-252. Item 3. Legal Proceedings.\nWe are not currently a party to any legal proceedings, and we are not aware of any pending or potential legal actions. Item 4. Mine Safety Disclosures.\nNot Applicable.\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters, and Issuer Purchases of Equity Securities.\nThe company stock is not trading at the moment.\nRegistered Holders of our Common Stock\nAs of June 30, 2023, there were 30 record owners of our common stock including the director.\nDividends\nThe Company has never declared or paid cash dividends on its common stock and does not anticipate paying cash dividends in the foreseeable future.\nRecent Sales of Unregistered Securities\nDuring our fiscal years ended June 30, 2023 and 2022, we had no sales of unregistered shares.\nIssuer Purchases of Equity Securities\nDuring the fiscal year ended June 30, 2023, and 2022 the Company did not repurchase any shares of its Common Stock. Item 6. Selected Financial Data\nNot applicable to smaller reporting companies. Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations\nWe are a development stage corporation with limited operations and no revenues from our business operations. Our auditors have issued a going concern opinion. This means that our auditors believe there is substantial doubt that we can continue as an on-going business for the next twelve months. We do not anticipate that we will generate significant revenues until we have raised the funds necessary to conduct a marketing program.\nPLAN OF OPERATION\nFISCAL YEAR ENDED JUNE 30, 2023 COMPARED TO FISCAL YEAR ENDED JUNE 30, 2022\nOur net loss for the fiscal year ended June 30, 2023 was $8,827 compared to a net loss of $14,887 during the fiscal year ended June 30, 2022. In the fiscal year ended June 30, 2023 we have generated $9,561 in services rendered and in the fiscal year ended June 30, 2022 we have generated $5,000.\nExpenses incurred were $18,388 during fiscal year ended June 30, 2023 compared to $19,887 during fiscal year ended June 30, 2022. Expenses decreased due to the Companys operational activities.\nThe number of shares outstanding was 6,450,000 for the fiscal years ended June 30, 2023 and 2022.\nLIQUIDITY AND CAPITAL RESOURCES\nFISCAL YEAR ENDED June 30, 2023 and 2022.\nAs of June 30, 2023, our total assets were $9,280 consisting of capital raised from issuance of common stock. As of June 30, 2022, our total assets were $18,107.\nCash Flows from Operating Activities\nWe have not generated positive cash flows from operating activities for the fiscal year ended June 30, 2023, net cash flows used in operating activities was $(4,163). We have not generated positive cash flows from operating activities for the fiscal year ended June 30, 2022 net cash flows used in operating activities was $(20,689).\nCash Flows from Investing Activities\nNet cash flows used in investing activities for the fiscal years ended June 30, 2023, and 2022, were $0 and $5,000.\nCash Flows from Financing Activities\nWe have financed our operations primarily from either advances from our sole executive or the issuance of equity. For the fiscal years ended June 30, 2023 and 2022, net cash provided by financing activities was $0 and $19,000.\nOFF-BALANCE SHEET ARRANGEMENTS\nWe have no off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources.\nGOING CONCERN\nThere is no historical financial information about us upon which to base an evaluation of our performance. We are in start-up stage operations and have generated minimal revenues. We cannot guarantee we will be successful in our business operations. Our business is subject to risks inherent in the establishment of a new business enterprise, including limited capital resources and possible cost overruns due to price and cost increases in services and products.\nWe have no assurance that future financing will be available to us on acceptable terms. If financing is not available on satisfactory terms, we may be unable to continue, develop or expand our operations. Equity financing could result in additional dilution to existing shareholders.\nCritical Accounting Policies\nThe discussion and analysis of our financial condition and results of operations are based upon our financial statements, which have been prepared in accordance with the accounting principles generally accepted in the United States of America. Preparing financial statements requires management to make estimates and assumptions that affect the reported amounts of assets, liabilities, and expenses. These estimates and assumptions are affected by managements application of accounting policies. We believe that understanding the basis and nature of the estimates and assumptions involved with the following aspects of our financial statements is critical to an understanding of our financial statements.\nUse of Estimates\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements. The estimates and judgments will also affect the reported amounts for certain expenses during the reporting period. Actual results could differ from these good faith estimates and judgments. Item 7A. Quantitative and Qualitative Disclosures about Market Risk\nNot applicable to smaller reporting companies. Item 8. Financial Statements and Supplementary Data\nThe Companys Financial Statements required by Item 8, together with the reports thereon of the Independent Registered Public Accounting Firm are set forth on pages through of this report and are incorporated by reference in this Item 8. Item 9. Changes in and Disagreements with Accounting and Financial Disclosures.\nNone. Item 9A. Controls and Procedures. Disclosure Controls and Procedures\nDisclosure controls and procedures are designed to ensure that information required to be disclosed in the reports filed or submitted under the Exchange Act is recorded, processed, summarized and reported, within the time period specified in the SECs rules and forms, and that such information is accumulated and communicated to management, including the CEO and CFO, as appropriate, to allow timely decisions regarding required disclosures. Our management necessarily applied its judgment in assessing the costs and benefits of such controls and procedures, which, by their nature, can provide only reasonable assurance regarding managements control objectives.\nOur management, with the participation of our CEO, evaluated the effectiveness of the design and operation of our disclosure controls and procedures as of the end of the period covered by this Report. Based upon this evaluation, our CEO concluded that our disclosure controls and procedures were not effective because of the identification of a material weakness in our internal control over financial reporting which is described below.\nManagements Report on Internal Control Over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Exchange Rule 13a-15(f). Our internal control over financial reporting is a process designed to provide reasonable assurance to our management and board of directors regarding the reliability of financial reporting and the preparation of the financial statements for external purposes in accordance with U.S. GAAP.\nOur internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of our assets; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with U.S. GAAP and our receipts and expenditures are being made only in accordance with authorizations of our management and directors; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of our assets that could have a material effect on our financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. All internal control systems, no matter how well designed, have inherent limitations, including the possibility of human error and the circumvention of overriding controls. Accordingly, even effective internal control over financial reporting can provide only reasonable assurance with respect to financial statement preparation. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nOur management assessed the effectiveness of our internal control over financial reporting as of June 30, 2023. In making this assessment, it used the criteria set forth by the Committee of Sponsoring Organizations of the Tread way Commission (COSO) in Internal Control-Integrated Framework (2013). Based on this evaluation, management concluded that that our internal control over financial reporting was not effective as\nof June 30, 2023. Our CEO concluded we have a material weakness due to lack of segregation of duties, a limited corporate governance structure, and a lack of a formal management review process over preparation of financial information. A material weakness is a deficiency, or a combination of control deficiencies, in internal control over financial reporting such that there is a reasonable possibility that a material misstatement of our annual or interim financial statements will not be prevented or detected on a timely basis.\nOur size has prevented us from being able to employ sufficient resources to enable us to have an adequate level of supervision and segregation of duties within our system of internal control. Therefore, while there are some compensating controls in place, it is difficult to ensure effective segregation of accounting and financial reporting duties. Management reported the following material weaknesses:\nLack of segregation of duties in certain accounting and financial reporting processes including the initiation, processing, recording and approval of disbursements;\nOur corporate governance responsibilities are performed by the Board of Directors, none of whom are independent under applicable standards; we do not have an audit committee or compensation committee. Our Board of Directors acts primarily by written consent without meetings which results in several of our corporate governance functions not being performed concurrent (or timely) with the underlying transactions, including evaluation of the application of accounting principles and disclosures relating to those transactions; and\nCertain reports that we prepare, and accounting and reporting conclusions reached in connection with the financial statement preparation process are not subjected to a formal review process that includes multiple levels of review and are not submitted timely to the Board of Directors for review or approval.\nWhile we strive to segregate duties as much as practicable, there is an insufficient volume of transactions at this point in time to justify additional full-time staff. We believe that this is typical in many development stage companies. We may not be able to fully remediate the material weakness until we commence operations at which time, we would expect to hire more staff. We will continue to monitor and assess the costs and benefits of additional staffing.\nThis Annual Report does not include an attestation report of our registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by our registered public accounting firm pursuant to the SEC rules that permit us to provide only managements report in this Annual Report.\nChanges in Internal Control Over Financial Reporting\nThere were no changes in our internal control over financial reporting that occurred during the quarter ended June 30, 2023, that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting. Item 9B. Other Information.\nNone.\nItem 9C. Disclosures Regarding Foreign Jurisdictions that Prevent Inspections.\nNot Applicable.\nPART III Item 10. Directors, Executive Officers, and Corporate Governance.\nThe board of directors elects our executive officers annually. A majority vote of the directors who are in office is required to fill vacancies. Each director is elected for a term of one year, and until his or her successor is elected and qualified, or until his earlier resignation or removal. The name, address, age and position of our officers and directors are as follows:\nName and Address of Executive\nOfficer and/or Director\nAge\nPosition\nIurii Abramovici\n6 Rosemary Way, Nuneaton,\nUnited Kingdom CV10 7ST\nPresident, Secretary, Treasurer and Director\nThe person named above has held his offices/positions since the inception of our Company and is expected to hold said offices/positions until the next annual meeting of our stockholders.\nResume\nIurii Abramovici has acted as our President, Secretary, Treasurer and sole Director since our incorporation on June 12, 2020.\nPrior, from September 2016 till June 2020, Mr. Abramovici has been working as logistics administrator at Unipart Group, Nuneaton, (United Kingdom). He assisted with all aspects of logistic and marketing end to end.\nFrom March 2015 to August 2016, he worked as releasing room assistant at ITH Pharma in London (United Kingdom). He was providing support to final checking and releasing stuff at final stage of the production process.\nFrom May 2012 to December 2014, Iurii Abramovici worked as marketing department manager at STLST Ltd., in Marki (Poland). His responsibility was the realization of sales and marketing strategies, cooperation with customers, supervising payments and liability for timely deliveries.\nFrom 2003 to 2012, Iurii Abramovici worked as Regional Sales Representative at National Alcohol Traditions in Kiev (Ukraine). His responsibilities were direct contact with customers, conclusion and negotiation of contracts.\nHe graduated from National University, Chernivtsi, (Ukraine) in 2003. He has a Bachelor of Science in Marketing.\nDelinquent Section 16(a) Reports\nOur common stock is not registered pursuant to Section 12 of the Exchange Act of 1934, as amended (the Exchange Act). Accordingly, our officers, directors and principal stockholders are not subject to the beneficial ownership reporting requirements of Section 16(a) of the Exchange Act.\nCode of Business Conduct\nWe have not adopted a Code of Business Conduct within the meaning of Item 406(b) of Regulation S-K.\nBoard Committees\nWe do not have any Board Committees. Item 11. Executive Compensation.\nThe table below summarizes the total compensation earned by each of our named executive Officers (NEOs) for each of the fiscal years listed.\nSUMMARY COMPENSATION TABLE\nName\nPosition\nYear\nSalary ($)\nBonus ($)\nStock Awards ($)\nOption Awards ($)\nNon-Equity Incentive Plan\nCompensation ($)\nAll Other Compensation\nTotal Compensation ($)\nIurii Abramovici\nTreas., Sec.\nTreas., Sec.\nSince Inception on June 12, 2020, Iurii Abramovici only member of our Board of Director was not compensated for his services. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matter.\nSECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT\nDirectors and Executive Officers\nThe following table sets forth the beneficial ownership (and the percentages of outstanding shares represented by such beneficial ownership) as of June 30, 2023 of (i) each director, (ii) the current NEOs named in the Summary Compensation Table contained in this Form 10-K and (iii) all current directors and executive officers as a group. Except as otherwise indicated, we believe that the beneficial owners of the common stock listed below, based on information provided by such owners, have sole investment and voting power with respect to such shares, subject to community property laws where applicable. Persons, who have the power to vote or dispose of common stock of the Company, either alone or jointly with others, are deemed to be beneficial owners of such common stock.\nIurii Abramovici, President, CEO, Treasurer, Secretary and Chairman of the Board.\n5,000,000 shares\nCertain Stockholders\nThe following table sets forth certain information with respect to each person known by us to be the beneficial owner of five percent or more of either class of the Companys outstanding common stock. The content of this table is based upon the most current information contained in Schedules 13D or 13G filings with the SEC, unless more recent information was obtained.\nIurii Abramovici, President, CEO, Treasurer, Secretary and Chairman of the Board.\n78% Item 13. Certain Relationships and Related Transactions, and Director Independence.\nCERTAIN RELATIONSHIPS AND RELATED PARTY TRANSACTIONS\nOn February 21, 2020, we offered and sold 5,000,000 shares of common stock to Iurii Abramovici, our sole officer and director, at a purchase price of $0.001 per share, for aggregate proceeds of $5,000.\nDuring the period from June 12, 2020 (inception) to June 30, 2023, Iurii Abramovici loaned $7,314 to the Company. This loan is non-interest bearing, due upon demand and unsecured. Item 14. Principal Accountant Fees and Services.\nFEES TO THE COMPANYS AUDITORS\nSet forth below is a summary of certain fees paid to our independent audit Fruci & Associates II, PLLC. for services for the fiscal years 2023 and 2022, respectively.\nFee Category\nFiscal Year\nFiscal Year\nAudit Fees\n$ 9,825\n$ 6,825\nTax Fees\n-\n-\nAll Other Fees\n-\n-\nTotal\n$ 9,825\n$ 6,825\nAudit Fees\nAudit fees were for professional services rendered in connection with the audit of our annual financial statements set forth in our Annual Reports on Form 10-K, the review of our quarterly financial statements set forth in our Quarterly Reports on Form 10-Q and consents for other SEC filings.\nAudit-Related Fees\nAudit-related fees consist of fees billed for professional services for consultation on accounting matters.\nApproval of Services Provided by Independent Registered Public Accounting Firm\nThe Board of Directors has considered whether the services provided under other non-audit services are compatible with maintaining the auditors independence and has determined that such services are compatible. The Board of Directors has adopted policies and procedures for pre-approving all non-audit work performed by the external auditors. The Board of Directors will annually pre-approve services in specified accounting areas. The Board of Directors also annually approves the budget for the annual generally accepted accounting principles (GAAP) audit.\nPART IV item 15. Exhibit and Financial Statement Schedules.\n(a)(1) Financial Statements\nThe following documents are filed as part of this report:\nThe Financial Statements of Incordex Corp. at June 30, 2023 and 2022, and for each of the two fiscal years in the period ended June 30, 2023, together with the reports of the Independent Registered Public Accounting Firms, are set forth on pages through of this Report.\n(2) Not applicable.\n(3) Exhibits\n#\n31.1\nCertification of the Chief Executive Officer pursuant to Section 302 of Sarbanes-Oxley Act of 2002.\n#\n31.2\nCertification of the Chief Financial Officer pursuant to Section 302 of Sarbanes-Oxley Act of 2002.\nItem 16. Form 10-K Summary.\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized on October 9, 2023.\nINCORDEX CORP.\nBy:\n/s/ Iurii Abramovici\nIurii Abramovici\nPresident and Chief Executive Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities indicated on October 9, 2023.\nSignature\nTitle\n/s/ Iurii Abramovici\nPresident, Chief Executive Officer, Treasurer, Secretary,\nIurii Abramovici\nand Director (Principal Executive Officer and Principal Accounting Officer)\nINCORDEX CORP.\nReport of Independent Registered Accounting Firm\nBalance Sheets as of June 30, 2023 and 2022\nStatements of Operations for the Years ended June 30, 2023 and 2022\nStatements of Changes in Stockholders Equity for the Years ended June 30, 2023 and 2022\nStatements of Cash Flows for the Years ended June 30, 2023 and 2022\nNotes to the Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Stockholders of Incordex Corp.\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of Incordex Corp. (the Company) as of June 30, 2023 and 2022, and the related statements of operations, changes in stockholders equity, and cash flows for each of the years in the two-year period ended June 30, 2023, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of June 30, 2023 and 2022 and the results of its operations and its cash flows for each of the years in the two-year period ended June 30, 2023, in conformity with accounting principles generally accepted in the United States of America.\nGoing Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 2 to the financial statements, the Company has an accumulated deficit, losses, and has not completed its efforts to establish a stable source of revenue. These factors, among others, raise substantial doubt about the Companys ability to continue as a going concern. Managements plans in regard to these matters are also described in Note 2. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nCritical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. We determined that there were no critical audit matters.\nFruci & Associates II, PLLC - PCAOB ID #05525\nWe have served as the Companys auditor since 2020.\nSpokane, Washington\nOctober 9, 2023\nINCORDEX CORP.\nBALANCE SHEETS\n(AUDITED)\nJune 30,\nJune 30,\nASSETS\nCurrent Asset\nCash\n5,392\n9,555\nPrepaid Expenses\n1,800\n4,800\nTotal Current Assets\n$ 7,192\n$ 14,355\nFixed assets\nWebsite purchase\n2,088\n3,752\nTotal Fixed Assets\n2,088\n3,752\nTotal Assets\n$ 9,280\n$ 18,107\nLIABILITIES AND STOCKHOLDERS EQUITY\nLong term Liabilities\nDirector loan\n$ 7,314\n$ 7,314\nTotal Liabilities\n7,314\n7,314\nStockholders Equity\nCommon stock, par value $0.001; 75,000,000 shares authorized, 6,450,000 and 6,450,000 shares issued and outstanding\n6,450\n6,450\nAdditional paid in capital\n27,550\n27,550\nAccumulated deficit\n(32,034 )\n(23,207 )\nTotal Stockholders Equity\n1,966\n10,793\nTotal Liabilities and Stockholders Equity\n$ 9,280\n$ 18,107\nSee accompanying notes, which are an integral part of these financial statements\nINCORDEX CORP.\nSTATEMENTS OF OPERATIONS\n(AUDITED)\nFor the year\nended\nJune 30,\nFor the year\nended\nJune 30,\nREVENUES (services rendered)\n$ 9,561\n$ 5,000\nOPERATING EXPENSES\nGeneral and Administrative Expenses\n18,388\n19,887\nTOTAL OPERATING EXPENSES\n(18,388 )\n(19,887 )\nNET INCOME (LOSS) FROM OPERATIONS\n(8,827 )\n(14,887 )\nPROVISION FOR INCOME TAXES\n-\n-\nNET PROFIT/LOSS\n$ (8,827 )\n$ (14,887 )\nNET LOSS PER SHARE: BASIC AND DILUTED\n$ (0.00 )\n$ (0.00 )\nWEIGHTED AVERAGE NUMBER OF SHARES OUTSTANDING: BASIC AND DILUTED\n6,450,000\n6,379,945\nSee accompanying notes, which are an integral part of these financial statements\nINCORDEX CORP\nSTATEMENTS OF CHANGES IN STOCKHOLDERS EQUITY\n(AUDITED)\nFOR THE YEAR ENDED JUNE 30, 2023 AND 2022\nCommon Stock\nAdditional\nPaid-in\nRetained\nTotal\nStockholders\nShares\nAmount\nCapital\nDeficit\nEquity\nBalance at June 30, 2021 (Audited)\n5,500,000\n$ 5,500\n$ 9,500\n$ (8,320 )\n$ 6,680\nShares issued for cash at $0.02 per share in September 30, 2021\n950,000\n18,050\n-\n19,000\nNet loss for the year ended June 30, 2022\n-\n-\n-\n(14,887 )\n(14,887 )\nBalance at June 30, 2022 (Audited)\n6,450,000\n$ 6,450\n$ 27,550\n$ (23,207 )\n$ 10,793\nNet loss for the year ended June 30, 2023\n-\n-\n-\n(8,827 )\n(8,827 )\nBalance at June 30, 2023 (Audited)\n6,450,000\n$ 6,450\n$ 27,550\n$ (32,034 )\n$ 1,966\nSee accompanying notes, which are an integral part of these financial statements\nINCORDEX CORP\nSTATEMENTS OF CASH FLOWS\n(AUDITED)\nYear ended\nJune 30,\nYear ended\nJune 30,\nCASH FLOWS FROM OPERATING ACTIVITIES\nNet loss for the period\n$ (8,827 )\n$ (14,887 )\nAdjustments to reconcile net loss to net cash from operating activities:\nAccumulated Depreciation\n1,664\n1,248\nPrepaid Expenses\n3,000\n(4,800 )\nAccounts Payable\n-\n(2,250 )\nCASH FLOWS USED IN OPERATING ACTIVITIES\n(4,163 )\n(20,689 )\nCASH FLOWS FROM INVESTING ACTIVITIES\nWebsite purchase\n-\n(5,000 )\nCASH FLOWS USED IN INVESTING ACTIVITIES\n-\n(5,000 )\nCASH FLOWS FROM FINANCING ACTIVITIES\nProceeds from sale of common stock\n-\n19,000\nCASH FLOWS PROVIDED BY FINANCING ACTIVITIES\n-\n19,000\nNET CHANGE IN CASH\n(4,163 )\n(6,689 )\nCash, beginning of period\n9,555\n16,244\nCash, end of period\n$ 5,392\n$ 9,555\nSUPPLEMENTAL CASH FLOW INFORMATION:\nInterest paid\n$ -\n$ -\nIncome taxes paid\n$ -\n$ -\nSee accompanying notes, which are an integral part of these financial statements\nINCORDEX CORP.\nNOTES TO THE FINANCIAL STATEMENTS\nYear ended June 30, 2023 and 2022 (Audited)\nNote 1 - ORGANIZATION AND NATURE OF BUSINESS\nIncordex Corp. (the Company, we, us or our) we were incorporated on June 12, 2020 and intend to offer handwritten letter service via our web platform. Incordex Corp. will be an online handwritten letter service that sends handwritten letters and cards. Our customers will be business and private persons. Customers will use our services to send real handwritten letters to prospects and new customers. We expect our main customers will be direct mail marketing companies. Private persons will use our services for their private needs. The letter writers will be freelancers around the world. Our freelancers will be working on an independent contract basis. Additionally, we plan to develop and sell Customer Relationship Management (CRM) program designed to assist businesses in sending handwritten letters to their customers. Also, we are planning to develop Reporting and Analytics Software analytics to help our customers see how effective these handwritten letters are in their marketing campaigns\nOur current address is 6 Rosemary Way, Nuneaton, CV107ST United Kingdom.\nNote 2 - GOING CONCERN\nThe accompanying financial statements have been prepared in conformity with generally accepted accounting principles in the United States of America (GAAP), which contemplate continuation of the Company as a going concern. The Company has an accumulated deficit of $32,034 as of June 30, 2023. The Company currently has losses and has not completed its efforts to establish a stabilized source of revenues sufficient to cover operating costs over an extended period of time. Therefore, there is substantial doubt about the Companys ability to continue as a going concern. Management anticipates that the Company will be dependent, for the near future, on additional investment capital to fund operating expenses. The Company intends to position itself so that it will be able to raise additional funds through the capital markets. In light of managements efforts, there are no assurances that the Company will be successful in this or any of its endeavors or become financially viable and continue as a going concern.\nNote 3 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBasis of presentation\nThe accompanying financial statements have been prepared in accordance with generally accepted accounting principles in the United States of America. The Companys year-end is June 30.\nUse of Estimates\nThe preparation of financial statements in conformity with US GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date the financial statements and the reported amount of revenues and expenses during the reporting period. Actual results could differ from those estimates.\nFair Value of Financial Instruments\nFASB ASC Topic 820, \"Fair Value Measurement,\" defines fair value as the exchange price that would be received for an asset or paid to transfer a liability in the principal or most advantageous market for the asset or liability in an orderly transaction between market participants on the measurement date. The standards apply to recurring and nonrecurring fair value measurements of financial and non-financial assets and liabilities. The Company determines the fair values of its assets and liabilities based on a fair value hierarchy that includes three levels of inputs that may be used to measure fair value.\nThe three levels are defined as follows:\nLevel 1:\ndefined as observable inputs such as quoted prices in active markets;\nLevel 2:\ndefined as inputs other than quoted prices in active markets that are either directly or indirectly observable; and\nLevel 3:\ndefined as unobservable inputs in which little or no market data exists, therefore requiring an entity to develop its own assumptions.\nIncome Taxes\nThe Company is a C Corporation under the Internal Revenue Code and a similar section of the state code.\nAll income tax amounts reflect the use of the liability method under accounting for income taxes. Income taxes are provided for the tax effects of transactions reported in the financial statements and consist of taxes currently due plus deferred taxes arising primarily from differences between financial and tax reporting purposes. Current year expense represents the amount of income taxes paid, payable or refundable for the period.\nDeferred income taxes, net of appropriate valuation allowances, are determined using the tax rates expected to be in effect when the taxes are actually paid. Valuation allowances are recorded against deferred tax assets when it is more likely than not that such assets will not be realized. When an uncertain tax position meets the more likely than not recognition threshold, the position is measured to determine the amount of benefit or expense to recognize in the financial statements.\nThe Companys income tax returns are subject to review and examination by federal, state and local governmental authorities. As of June 30, 2023, there is no year open to examination with federal, state and local governmental authorities. To the extent penalties and interest are incurred through an examination, they would be included in the income tax section of the statement of operations and comprehensive loss.\nBasic Income (Loss) Per Share\nThe Company computes income (loss) per share in accordance with FASB ASC 260 Earnings per Share. Basic loss per share is computed by dividing net income (loss) available to common shareholders by the weighted average number of outstanding common shares during the period. Diluted income (loss) per share gives effect to all dilutive potential common shares outstanding during the period. Dilutive loss per share excludes all potential common shares if their effect is anti-dilutive. As of June 30, 2023 there were no potentially dilutive debt or equity instruments issued or outstanding.\nComprehensive Income\nComprehensive income is defined as all changes in stockholders equity, exclusive of transactions with owners, such as capital investments. Comprehensive income includes net income or loss, changes in certain assets and liabilities that are reported directly in equity such as translation adjustments on investments in foreign subsidiaries and unrealized gains (losses) on available-for-sale securities. As of June 30, 2023 were no differences between our comprehensive loss and net loss.\nRevenue Recognition\nThe Company recognizes revenue in accordance with Accounting Standards Codification (ASC) 606, Revenue from Contracts with Customers. The core principle of ASC 606 is that an entity recognizes revenue to depict the transfer of promised goods or services to customers in an amount that reflects the consideration to which the entity expects to be entitled in exchange for those goods or services. An entity recognizes revenue in accordance with that core principle by applying the following steps: Step 1: Identify the contract(s) with a customer Step 2: Identify the performance obligations in the contract Step 3: Determine the transaction price Step 4: Allocate the transaction price to the performance obligations in the contract Step 5: Recognize revenue when (or as) the entity satisfies a performance obligation. Specifically, Section 606-10-50 requires an entity to provide information about: a. Revenue recognized from contracts with customers, including the disaggregation of revenue into appropriate categories; b. Contract balances, including the opening and closing balances of receivables, contract assets, and contract liabilities; c. Performance obligations, including when the entity typically satisfies its performance obligations and the transaction price that is allocated to the remaining performance obligations in a contract; d. Significant judgments, and changes in judgments, made in applying the requirements to those contracts.\nThe Companys revenues are recognized at a point-in-time as ownership of software (when it is approved by the customer) is transferred at a distinct point in time per the terms of a contract. Any liability of the Company shall be limited to the total of all amounts paid by the customer for services under the contract.\nThe Company collects payment from customers prior to transferring ownership of the software and may require deposits from customers at the time an order is placed. When deposits are collected prior to transferring ownership of the software the Company recognizes deferred revenue until the transfer is made.\nWe've developed a specialized component of a Customer Relationship Management (CRM) program designed to assist businesses in sending handwritten letters to their customers. This CRM module is installed on the company's own servers and is intended for internal use. We've created this program for two companies, one based in the UK and the other in Hong Kong.\nAs of June 30, 2023, the Company has generated $9,561 in revenue.\nRecent Accounting Pronouncements\nWe have reviewed all the recently issued, but not yet effective, accounting pronouncements and we do not believe any of these pronouncements will have a material impact on the Company.\nNote 4 - INTANGIBLE ASSETS\nThe Company purchased and possesses an asset in the form of an operative website. The Company purchased the website for $5,000 and is amortizing the asset straight-line over its three-year useful life or $1,664 per year. As of June 30, 2023 our amortization was $2,912.\nNote 5- COMMON STOCK\nThe Company has 75,000,000, $0.0001 par value shares of common stock authorized.\nIn June 2021 the Company issued 500,000 shares of common stock at $0.02 for a total of $10,000.\nThere were 5,500,000 shares of common stock issued and outstanding as of June 30, 2021.\nIn July, and August 2021 the Company issued 950,000 common shares at $0.02 for total of $19,000.\nThere were 6,450,000 shares of common stock issued and outstanding as of June 30, 2023 and 2022.\nVoting Common Stock\nAll shares of common stock have voting rights and are identical. All holders of shares of voting common stock shall at every meeting of the stockholders be entitled to one vote for each share of the capital stock held by such stockholder.\nNon-voting Common Stock\nAll of the other terms of the Non-Voting Common Stock shall be identical to the Voting Common Stock, except for the right of first refusal that attaches to the Non-Voting Common Stock, as explained in the Companys Bylaws.\nNote 6 - COMMITMENTS AND CONTINGENCIES\nIn the normal course of business, the Company may become a party to litigation matters involving claims against it. As of June 30, 2023, there are no current matters that would have a material effect on the Companys financial position or results of operations.\nNote 7 - SUBSEQUENT EVENTS\nIn accordance with FASB ASC Topic 855 Subsequent Events, the Company has analyzed its operations through October 9, 2023 and the date these financial statements were available to be issued, and there were events to report: On September 28, 2023, we entered into a $4,000 contract with the developer of our new company website, www.incordexcrm.com, for its development. Additionally, on September 29, 2023, we executed a $30,000 contract for the development of a Customer Relationship Management (CRM) system on our website. This CRM system will manage customer data, handle handwritten letter requests, facilitate order tracking, and provide other related functionalities."
}