{
    "cik": "1821806",
    "company": "Leslie's, Inc.",
    "filing_type": "10-K",
    "filing_date": "2023-11-29",
    "period_of_report": "2023-09-30",
    "sic": "5990",
    "state_of_inc": "DE",
    "state_location": "AZ",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1821806/0000950170-23-066773-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1821806/000095017023066773/lesl-20230930.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1821806/0000950170-23-066773.txt",
    "filename": "1821806_10K_2023_0000950170-23-066773.htm",
    "content": "Item 1. Business.\nIn this Annual Report on Form 10-K, unless otherwise indicated or the context otherwise requires, all references to we, our, us, Leslies, the Company, and our Company refer to Leslies, Inc. and its consolidated subsidiaries.\nOur Company\nWe are the largest and most trusted direct-to-consumer brand in the $15 billion United States pool and spa care industry, serving residential and professional consumers. Founded in 1963, we are the only direct-to-consumer pool and spa care brand with national scale, operating an integrated marketing and distribution ecosystem powered by a physical network of over 1,000 branded locations and a robust digital platform. We have a market-leading share of approximately 15% of residential aftermarket product spend as of 2022, our physical network is larger than the sum of our 20 largest competitors and our digital sales are estimated to be greater than five times as large as that of our largest digital competitor. We offer an extensive assortment of professional-grade products, the majority of which are exclusive to Leslies, as well as certified installation and repair services, all of which are essential to the ongoing maintenance of pools and spas. Our dedicated team of associates, pool and spa care experts, and experienced service technicians are passionate about empowering our consumers with the knowledge, products, and solutions necessary to confidently maintain and enjoy their pools and spas. The unprecedented scale of our integrated marketing and distribution ecosystem, which is powered by our direct-to-consumer network, uniquely enables us to efficiently reach and service every pool and spa in the continental United States.\nWe operate primarily in the pool and spa aftermarket industry, which is one of the most fundamentally attractive consumer categories given its scale, predictability, and growth outlook. More than 80% of our assortment is comprised of non-discretionary products essential to the care of residential and commercial pools and spas. Our assortment includes chemicals, equipment and parts, cleaning and maintenance equipment, and safety, recreational, and fitness-related products. We also offer important essential services, such as equipment installation and repair for residential consumers and professional pool operators. Consumers receive the benefit of extended vendor warranties on products purchased through our locations and on on-site installations or repairs by our certified in-field technicians. We offer complimentary, commercial-grade in-store water testing and analysis via our proprietary AccuBlue® system, which increases consumer engagement, conversion, basket size, and loyalty, resulting in higher lifetime value. Our water treatment expertise is powered by data and intelligence accumulated from the millions of water tests we have performed over the years, positioning us as the most trusted water treatment service provider in the industry. Due to the non-discretionary nature of our products and services, our business has historically delivered strong, growth and profitability in challenging market environments, including through the Great Recession and the COVID-19 pandemic.\nWe have a legacy of leadership and disruptive innovation. Since our founding in 1963, we have been the leading innovator in our category and have provided our consumers with the most advanced pool and spa care available. As we have scaled, we have leveraged our competitive advantages to strategically reinvest in our business and intellectual property to develop new value-added capabilities. We have pioneered complimentary in-store water testing, offered complimentary in-store equipment repair services, introduced the industrys first loyalty program, and developed an expansive platform of owned and exclusive brands. These differentiated capabilities allow us to meet the needs of any pool and spa owner, whether they care for their pool or spa themselves or rely on a professional, whenever, wherever, and however they choose to engage with us.\nOur Competitive Strengths\nWe believe that the following competitive strengths have been key drivers of our success to date, and strategically position us for continued success.\nUndisputed direct-to-consumer market leader in the aftermarket pool and spa care industry.\nFor 60 years, we have been dedicated to addressing our consumers pool needs so that they can spend less time maintaining and more time enjoying their pools. We are the only direct-to-consumer pool and spa care brand with a nationwide physical presence and an integrated digital platform, consisting of individually merchandised e-commerce websites, a mobile app with transaction capabilities, and online marketplace operations, designed to address the needs of all pool and spa consumers. The remainder of the industry is highly fragmented across both offline and online providers.\nDirect relationships with more than 12 million pool and spa owners and professionals, generating durable, annuity-like economics.\nWe are the largest national pool and spa care brand with a direct relationship with pool and spa owners and the professionals who serve them. Across our integrated platform, we have more than 12 million consumers who rely on us for their ongoing pool and spa care needs. Through our team of highly trained pool and spa experts, we offer sophisticated product recommendations and other expert advice, which cultivates long-standing relationships with our consumers. The comprehensive nature of our product and service offering eliminates the need for consumers to leave the Leslies ecosystem, driving exceptional retention with annuity-like economics. We define direct relationships as the number of unique customers for whom we have a mailing address, a phone number, or an email address.\nConsumer-centric connected ecosystem for all pool and spa owners and the professionals who serve them using proprietary, leading brands across all channels.\nWe have built the most extensive and geographically diverse pool and spa care network in the United States. Our locations are strategically located in densely populated areas mainly throughout the Sunbelt, including California, Arizona, Texas, and Florida. Across our physical network, we employ a team of more than 3,000 associates, including pool and spa care experts and service technicians, who act as solution providers to all of our consumers, including both do-it-yourself (DIY) and do-it-for-me (DIFM) pool owners as well as pool professionals.\nAs the world has become more digitally focused, we have focused on architecting an industry-leading integrated digital platform of proprietary e-commerce websites designed to serve our residential and professional consumers. Our proprietary e-commerce websites serve digital consumers through curated pricing and targeted merchandising strategies. In addition to our owned e-commerce websites, we also offer our products through online marketplaces such as Amazon, eBay, and Walmart. As a result of our strategic investments in digital, we are uniquely positioned to serve our consumers with cross-channel capabilities and capture incremental online demand from new consumers while growing the total profitability of the network.\nComprehensive assortment of proprietary brands with recurring, essential, superior product formulations, and trusted, solution-based services for all consumers.\nWe offer a comprehensive product assortment, consisting of more than 30,000 products across chemicals, equipment and parts, cleaning and maintenance equipment, and safety, recreational, and fitness-related categories. More than 80% of our product sales are non-discretionary and recurring in nature. In addition, more than 55% of our total sales and 80% of our chemical sales are derived from proprietary brands and custom-formulated products, which allows us to create an entrenched consumer relationship, optimize our supply chain, and capture attractive margins. Consumers choose our exclusive, proprietary brands and custom-formulated products for their efficacy and value, a combination that we believe cannot be found elsewhere.\nWe pair our comprehensive product assortment with differentiated in-store and on-site service offerings. We pioneered the complimentary in-store water test and resulting pool or spa water prescription, which has driven consumer traffic and loyalty, and has created a pharmacist-like relationship with our consumers. We recently developed and introduced significant upgrades to our water testing capabilities with the launch of our AccuBlue® platform. The AccuBlue® testing device screens for nine distinct water quality criteria. Our in-store experts leverage our proprietary AccuBlue® water diagnostics software engine to offer our consumers a customized prescription and treatment plan using our comprehensive range of exclusive products, walking them through product use sequencing step-by-step. These detailed and sophisticated treatment algorithms are supported by our differentiated water treatment expertise built over decades. Historically, we have found that consumers who test their water with us regularly spend more with us per year than those who do not, underscoring the importance of this acquisition and retention vehicle. We also employ the industrys largest network of in-field technicians who perform on-site evaluations, installation, and repair services for residential consumers and professional pool operators.\nAttractive financial profile characterized by consistent, profitable growth, and strong cash flow conversion offering multiple levers to drive shareholder value.\nWe historically have had strong sales growth, demonstrating our ability to deliver strong financial results through all economic cycles. Our growth has been broad-based across residential pool, residential spa, and professional pool consumers and has been driven by strong retention and profitable acquisition of sticky, long-term consumer relationships. Due to our scale, vertical integration, and operational excellence, we maintain high profitability. Due to our low maintenance capital intensity, we generate strong cash flows. As a result of our attractive financial profile, we have significant flexibility with respect to capital allocation, giving us the ability to drive long-term shareholder value through various operating, investing, and financial strategies.\nHighly experienced and visionary leadership team that combines deep industry expertise and advanced direct-to-consumer capabilities.\nOur strategic vision and culture are directed by our executive leadership team under the leadership of our Chief Executive Officer, Michael R. Egeck, and our Chief Financial Officer, Scott Bowman. Our well-balanced executive leadership team is comprised of leaders with decades of experience in the pool and spa care industry as well as recently-hired executives who bring new expertise and capabilities to Leslies from outside industries. Our leadership team is uniquely capable of executing upon our strategic vision and successfully continuing to create long-term shareholder value.\nOur Growth Strategies\nWe believe we are well positioned to drive sustainable growth and profitability over the long-term by executing on the following strategies:\nGrow our consumer file.\nWe believe we have significant opportunity to acquire new residential consumers and reactivate lapsed residential consumers, which we plan to do by executing on the following strategies:\nAcquire or reactivate consumers via optimized marketing strategy. We believe we have a sizeable opportunity to grow by serving the millions of pool and spa owners in our market who do not actively shop with us today. We plan to accelerate our acquisition of these potential new or reactivated consumers and, at the same time, manage consumer acquisition cost by shifting our marketing mix toward more efficient digital and social channels.\nCapture outsized share of new pool and spa consumers. We intend to bolster consumer file growth by deploying targeted marketing tactics to win an outsized share of new pool and spa owners.\nIncrease share of wallet among existing consumers.\nWe believe we have a significant opportunity to increase spend from existing consumers and drive higher lifetime value. We plan to do this by executing on the following strategies:\nIncrease loyalty membership penetration and introduce program upgrades. We plan to continue to market our loyalty program in-store and online to convert more of our consumers to loyalty members through our loyalty program, Pool Perks®, in order to offer more value-added features to further drive member enrollment and engagement. We will explore opportunities to drive interest by selectively offering special incentives and rewards as well as introducing new value-added features. We believe these initiatives will drive higher transaction frequency and basket size, which will result in increased category spend and higher lifetime value with existing consumers.\nEnhance retention marketing. While we have historically been satisfied with our consumer retention metrics, we believe there is opportunity to drive even greater retention. We plan to do this by more actively leveraging our consumer database to personalize the consumer experience with targeted messaging and product recommendations.\nExpand our product and service offering. We plan to expand our offering by introducing new and innovative products and services in our existing categories and by expanding into adjacent categories. Specifically, we believe there is an opportunity with products targeted to spa owners, who have historically been underserved.\nGrow additional share in the professional market.\nWe believe we have a significant opportunity to grow our sales with pool care professionals, who individually spend more than 25x as much as residential consumers on pool supplies and equipment.\nOur research suggests that small and mid-size pool professionals value convenience and referrals, both of which we are uniquely positioned to offer given our over 1,000 locations and the industrys largest consumer file. We plan to expand our physical network of PRO locations, which specifically cater to pool professionals, by opening new locations and selectively remodeling existing residential locations. We believe there is significant whitespace opportunity to operate more than 350 PRO locations, inclusive of new store openings and conversions, across the United States. We continue to assemble an affiliated network of qualified pool professionals through our PRO Partner program, extending the Leslies name into water maintenance. To further benefit pool care professionals, we also have a dedicated Leslies PRO e-commerce website. This website provides all of the online tools needed for professionals to serve their respective communities and grow their pool care businesses. We believe that this initiative represents a natural adjacency and will resonate with existing residential consumers as well as help attract new residential consumers.\nUtilize strategic M&A to consolidate share and further enhance capabilities.\nThe aftermarket pool and spa industry is highly fragmented, which offers attractive opportunities to utilize strategic M&A to drive consolidation. We have historically used, and plan to continue to use, strategic acquisitions to obtain consumers and capabilities in both new and existing markets. We completed six acquisitions during fiscal 2022 and five acquisitions during fiscal 2023, and continue to look for opportunities that will strategically benefit our business. We believe that we are the consolidator of choice in the industry, and we will continue to focus on acquiring high quality, market-leading businesses with teams, capabilities, and technologies that uniquely position us to create value by applying best practices across our entire physical and digital network to better serve new and existing consumer types.\nAddressing underserved residential whitespace.\nWe have identified more than 800 markets in the continental United States that we can address through our store densification strategy. With our omni-channel capabilities, successful track record of new location openings, location acquisitions, and targeted digital marketing tactics, we believe we are well positioned to capitalize on this meaningful whitespace opportunity. We plan to assess each market independently and determine the most capital efficient way to serve these trade areas using digital assets, new locations, or acquired locations.\nContinue to introduce disruptive innovation.\nLeslies has a legacy of disruptive innovation in the pool and spa care industry. We plan to continue that legacy by developing and introducing capabilities that create value for our consumers. Present areas of focus include water testing, maintenance prescriptions, new product offerings, and our product distribution ecosystem.\nAs the Internet of Things wave continues, we believe consumers will seek the convenience of smart home functionality in more facets of their daily lives. We perceive this as an opportunity to introduce a full service, connected home solution that effectively automates pool maintenance, including actively monitoring our consumers water, diagnosing, developing, and prescribing a treatment plan, and delivering to their home the assortment of products needed to maintain a clear, safe, beautiful pool.\nAccordingly, in fiscal 2023 we completed the commercial launch of our AccuBlue Home® program, a subscription-based offering that enables pool and spa owners to confidently test and treat their pools and spas without ever having to leave their backyard. Using the new, industry-leading AccuBlue Home® connected device and the Leslies mobile app, program members can test all critical aspects of their water chemistry with ease and generate a custom treatment plan tailored to the specifications of their pool or spa. Within the Leslies mobile app, consumers can review their prescription, order the products they need, and have them delivered right to their door or arrange for a same-day pick-up at their local Leslies location. We plan to introduce enhancements and expand the program.\nOur Industry\nWe operate in the aftermarket pool and spa care industry, which is broadly comprised of: (i) chemicals; (ii) equipment, parts, and accessories; and (iii) services. The United States market consists of millions of installed pools and spas, which require routine maintenance throughout their lifetime. We estimate the average in-ground pool owner spends $900 each year on the chemicals, equipment, parts, and accessories needed to maintain their pool. Neglecting pool maintenance is not a viable option, as it can result in equipment failure, structural damage, or other costly issues. This drives an annuity-like stream of demand for the chemicals and products necessary to properly maintain a pool or spa.\nWhile we benefit from the growth in the installed base, our business is not dependent on new pool construction activity and can generate strong growth from a fixed installed base through increased pool usage, more frequent sanitization, and recurring maintenance needs.\nSeasonality\nOur business is highly seasonal. Sales and earnings are highest during our third and fourth fiscal quarters, being April through September, and represent the peak months of swimming pool use. Sales are substantially lower during our first and second fiscal quarters when we typically generate net losses and we realized negative operating cash flows.\nOur Consumers\nWe strategically serve all consumers within the aftermarket pool and spa care industry including Residential Pool, Residential Spa, and Professional Pool consumers.\nResidential Pool. The residential pool market consists of 8.8 million pools representing a total aftermarket sales opportunity of $8.4 billion. Within this market, the DIY aftermarket spend represents roughly 70% of total spend while DIFM services represent approximately 30% of total spend. Many of our residential pool consumers visit our locations on a regular basis to conduct water testing, seek expert pool advice, and purchase products as well as utilize our integrated digital platforms.\nResidential Spa. The residential spa market consists of nearly 5.5 million spas or hot tubs representing a $0.9 billion aftermarket sales opportunity for chemicals and equipment. Including the $1.7 billion market for new spas, residential spa represents a total addressable market of approximately $2.6 billion.\nProfessional Pool. The professional pool market consists of pool service professionals and professional pool operators. Pool service professionals specialize in maintenance and equipment repair for DIFM homeowners, businesses, and government entities. Professional pool operators manage approximately 250,000 pools across hotels, motels, apartment complexes, and water parks. This market represents a total aftermarket sales opportunity of $4.4 billion.\nOur Product and Service Offering\nWe offer a comprehensive assortment of more than 30,000 products across chemicals, equipment and parts, cleaning and maintenance equipment, and safety, recreational, and fitness related products. Historically, more than 80% of our assortment has been comprised of essential and non-discretionary products that are needed by residential and professional consumers to care for pools and spas. The vast majority of our assortment features non-discretionary products that are shelf-stable and generally not prone to either obsolescence or shrinkage, which could occur from changing technology or consumer buying habits. As the trusted one-stop destination for all aftermarket pool and spa needs, we provide an extensive and highly differentiated product offering. We aim to fulfill the needs of our residential and professional consumers with our comprehensive assortment, in-stock inventory, and product selection across a broad range of premium third-party and proprietary brands.\nSince our inception in 1963, we have offered a portfolio of owned and exclusive brands. We continue to expand our selection of exclusive offerings through innovation. Our exclusive brands and products account for more than 55% of total sales and 80% of chemical sales. These proprietary brands and custom-formulated products are only available through our integrated platform and offer professional-grade quality to our consumers, while allowing us to achieve higher gross margins relative to sales of third-party products.\nIn addition to our comprehensive product assortment, we offer critical services, such as complimentary water testing and in-store equipment repair. We also employ a large in-field service network of pool and spa care service professionals who have the expertise to provide essential on-site equipment installation and repair services for residential consumers and professional pool operators throughout the continental United States.\nOur Integrated Platform\nWe operate an integrated platform consisting of locations, distribution centers, and proprietary e-commerce websites.\nResidential Locations. We serve our residential consumers through locations that are strategically spread across 39 states. We offer a range of differentiated and innovative in-store and on-site service offerings including our in-store water test. Our residential locations are supported by a team of associates, including pool and spa care experts and experienced service technicians, who are committed to decoding pool care for consumers and performing on-site installation and repair services. Our residential locations have service counters through which we also provide products and services to professional consumers.\nDigital Network. Our complementary platform of branded proprietary e-commerce websites and marketplace storefronts allows us to seamlessly serve the needs of all digital consumers through curated pricing and targeted merchandising strategies. Our portfolio of proprietary e-commerce websites includes Leslies and In the Swim. In addition to our owned e-commerce websites, we sell through online marketplaces such as Amazon, Walmart, and eBay.\nPRO Locations. Our PRO locations are conveniently situated along popular service routes and carry a product assortment that targets the professional consumer. We have identified significant opportunities to expand and develop our PRO network to address the growing and underserved professional consumer base. Our PRO locations also serve residential consumers.\nResidential Hot Tub Locations. In select markets, we also operate full service hot tub and spa locations under various banners. At these locations, we offer an expanded assortment of merchandise and services specifically catering to current and prospective spa owners.\nOur Vertically Integrated Model\nWe operate a vertically integrated supply chain, packaging, and distribution model, which represents a significant competitive advantage.\nOur vertically integrated supply chain enables us to produce and package products at our company-operated packaging facilities and third-party contract packaging facilities. Our strategy is to identify, produce, and package high volume items that do not require sophisticated or capital-intensive production or packaging equipment, but allow us to offer our consumers a premium product while offering us a significant cost advantage. We source a variety of raw materials and chemicals directly from a diversified supplier base; we maintain strong relationships with these suppliers. As of September 30, 2023, we had one supplier that represented more than 10% of our annual purchases. Using these raw materials, we manufacture and package a wide selection of final products, including, but not limited to, chlorine products, pH adjusters, and filter cleaners. A significant portion of our total mix is comprised of products that we manufacture or package through vertical integration, which offers economies of scale that has resulted in higher quality products and a structurally advantaged margin profile.\nWe also operate a vertically integrated distribution and delivery model. In addition to operating two manufacturing facilities, we operate a national network of company-operated distribution centers as well as utilize third-party distribution centers. Our company-operated distribution centers and our third-party logistics partners have the capacity to carry a broad breadth of our products in significant quantities and are capable of replenishing inventory throughout our physical network. From these facilities, we distribute to our physical network through a contracted fleet of tractors and trailers, which helps ensure optimal in-stock levels throughout the year. Our third-party distribution centers are strategically located to complement our company-operated distribution centers and primarily fulfill online orders.\nOur Marketing Strategy\nWe believe there is significant potential to drive increased share of wallet among our existing consumers through strategic initiatives, such as our loyalty membership program and dynamic promotions.\nDue to the highly recurring, replenishment nature of our product mix and long-term consumer relationships, we believe that our investments in consumer acquisition marketing generate highly attractive returns. We know the location of pools and spas throughout the United States, and by leveraging this information, we have the ability to allocate our advertising dollars in a highly targeted manner. Additionally, we have added experienced marketing talent with significant expertise in analytics and performance marketing to grow our consumer file. Through these strategies, we plan to increase brand awareness and continue profitably acquiring new consumers.\nOur Competition\nThe United States aftermarket pool and spa care industry is fragmented and competitive. We compete against a wide range of manufacturers, retailers, distributors, and service providers in the residential and professional pool and spa care market. This includes original equipment manufacturers, regional and local retailers, home improvement retailers, mass-market retailers, and specialty e-commerce operators. Key competitive groups include:\nRegional and Local Independent Retailers. Estimated to include more than 8,000 smaller, local independent competitors, which offer the convenience of proximity. The vast majority of these competitors operate single stores and, due to relative economies of scale, this group generally offers limited product assortment, charges higher prices and invests less resources in marketing;\nHome Improvement Retailers. Includes national home improvement retailers, such as Home Depot, Lowes, and local and regional hardware stores. This group generally employs a seasonal strategy, offering limited product assortment during select spring and summer months, does not offer services, and typically does not employ associates with the pool and spa care expertise;\nMass-Market Retailers. Includes larger, scaled players, such as Amazon, Walmart, and Costco. This group generally offers limited product assortment, often on a seasonal basis, and does not offer services or pool and spa care expertise; and\nWholesale Distributors. Includes large wholesalers, such as Heritage Pool Supply Group and Pool Corp. This group generally does not directly serve the end-consumer, but rather serves as an intermediary that supplies product to retailers as well as the professional channel.\nOur competitors offer pool care products and services of varied quality and across a wide range of retail price points. We experience greater brick-and-mortar competition in the states with the largest installed pool bases, including California, Texas, Florida, and Arizona. While some of our competitors also market and sell online, there are various challenges to serving consumers in the aftermarket pool and spa care industry via e-commerce. These challenges include regulatory restrictions on shipping hazardous materials, the need for professional installation of equipment at point of delivery, and the need for regular water testing, expert advice, and customized prescriptions and solutions related to the sale of chemicals. In addition, due to the seasonality of the aftermarket pool and spa care industry, several competitors only stock related products during the summer months, and their product assortment tends to be limited to basic offerings.\nHuman Capital Resources\nAs of September 30, 2023, we employed approximately 4,100 employees. Of these employees, approximately 3,200 work in our physical network, approximately 250 work as in-field service technicians, approximately 360 work in our corporate office, and approximately 275 work in our distribution centers. We believe that we have good relations with our employees. None of our employees are currently covered under any collective bargaining agreements.\nWe consider our employees to be the foundation for our growth and success. As such, our future success depends in large part on our ability to attract, train, retain, and motivate qualified personnel. The growth and development of our workforce is an integral part of our success. We place a priority on promoting from within. Over the last three years, approximately 80% of our retail and corporate management openings have been filled by existing employees.\nWe are also committed to developing and fostering a culture of diversity and inclusion and know that a companys ultimate success is directly linked to its ability to identify and hire talented individuals from all backgrounds and perspectives.\nTrademarks and Other Intellectual Property\nIn the course of our business, we employ various trademarks, trade names and service marks, including Leslies®, AccuBlue®, AccuBlue Home®, Pool Perks®, and our logo, in packaging and advertising our products. We have registered trademarks and trade names for several of our major products on the Principal Register of the United States Patent and Trademark Office. We distinguish the products produced in our chemical repackaging operation or by third-party repackagers at our direction through the use of the Leslies brand name and logo and the trademarks and trade names of the individual items, none of which is patented, licensed, or otherwise restricted to or by us. We believe the strength of our trademarks and trade names has been beneficial to our business and we intend to continue to protect and promote our trademarks in appropriate circumstances.\nLeslies®, AccuBlue®, AccuBlue Home®, Pool Perks®, and other trademarks, trade names or service marks of Leslies, Inc. appearing in this Annual Report on Form 10-K are the property of Leslies, Inc. All other trademarks, trade names, and service marks appearing in this Annual Report on Form 10-K are the property of their respective owners.\nAvailable Information\nOur website address is www.lesliespool.com. Information contained on our website or connected thereto does not constitute a part of this Annual Report on Form 10-K or any other filing we make with the SEC. We make available on this website under the Investor Relations section, free of charge, our annual reports on Form 10-K, quarterly reports on Form 10-Q, and current reports on Form 8-K, and amendments to those reports, as soon as reasonably practicable after we electronically file those materials with, or furnish them to, the SEC. The SEC also maintains a website that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC at www.sec.gov.\nNote Regarding Third-Party Information\nThis Annual Report on Form 10-K includes market data and certain other statistical information and estimates that are based on reports and other publications from industry analysts, market research firms, and other independent sources, as well as managements own good faith estimates and analyses. We believe these third-party reports to be reputable, but have not independently verified the underlying data sources, methodologies, or assumptions. Information that is based on estimates, forecasts, projections, market research, or similar methodologies is inherently subject to uncertainties, and actual events or circumstances may differ materially from events and circumstances reflected in this information. Item 1A. Risk Factors.\nInvesting in our common stock involves a high degree of risk. You should carefully consider the risks described below in addition to the other information set forth in this Annual Report on Form 10-K, including the Managements Discussion and Analysis of Financial Condition and Results of Operations section and the consolidated financial statements and related notes, before making an investment decision. The risks described below are not the only risks or uncertainties we face. The occurrence of any of the following risks or additional risks and uncertainties not presently known to us, or that we currently believe to be immaterial, could materially and adversely affect our business, financial condition, prospects, or results of operations. In such case, the trading price of our common stock could decline, and you may lose all or part of your original investment. Our actual results could differ materially from those anticipated in the forward-looking statements as a result of specific factors, including the risks and uncertainties described below.\nAdditionally, macroeconomic and geopolitical developments, including public health crises, escalating global conflicts, supply chain disruptions, labor market constraints, rising rates of inflation and rising interest rates may amplify many of the risks discussed below to which we are subject. The extent of the impact of macroeconomic and geopolitical developments, including public health crises, on our financial and operating performance depends significantly on the duration and severity of such macroeconomic and geopolitical developments, including public health crises, the actions taken to contain or mitigate its impact and any changes in consumer behaviors as a result thereof. Among other factors, a significant disruption to our supply chain for products we sell, as a result of macroeconomic and geopolitical developments, including public health crises or otherwise, could have a material impact on our sales and earnings.\nSummary of Risk Factors\nThe following summarizes the risks facing our business, all of which are more fully described below. This summary should be read in conjunction with Risk Factors below and should not be relied upon as an exhaustive summary of the material risks facing our business. The order of presentation is not necessarily indicative of the level of risk that each factor poses to us.\nRisks Related to the Nature of Our Business\nIf we are unable to achieve comparable sales growth, our profitability and performance could be materially adversely impacted.\nPast growth may not be indicative of future growth.\nWe may not be able to successfully manage our inventory to match consumer demand.\nLoss of key members of management could adversely affect our business.\nOur business is significantly dependent on our ability to meet our labor needs.\nWe are subject to legal or other proceedings that could have a material adverse effect on us.\nDisruptions from disasters and similar events could have a material adverse effect on our business.\nRisks Related to Our Industry and the Broader Economy\nWe face competition by manufacturers, retailers, distributors, and service providers in the residential and professional pool and spa care market.\nThe demand for our swimming pool and spa related products and services may be adversely affected by unfavorable economic conditions.\nThe COVID-19 pandemic could adversely impact our business and results of operations.\nThe demand for pool chemicals may be affected by consumer attitudes towards products for environmental or safety reasons.\nOur results of operations may fluctuate from quarter to quarter for many reasons, including seasonality.\nAdverse developments affecting the financial services industry, such as actual events or concerns involving liquidity, defaults, or non-performance by financial institutions or transactional counterparties, could adversely affect our current and projected business operations and our financial condition and results of operations.\nWe maintain our cash at financial institutions in balances that may exceed federally insured limits.\nWe are susceptible to adverse weather conditions.\nTechnology and Privacy Related Risks\nIf our online systems do not function effectively, our operating results could be adversely affected.\nAny limitation or restriction to sell on online platforms could harm our profitability.\nA significant disturbance or breach of our technological infrastructure could adversely affect our financial condition and results of operations.\nImproper activities by third parties and other events or developments may result in future intrusions into or compromise of our networks, payment card terminals, or other payment systems.\nRisks Related to Our Business Strategy\nWe may acquire other companies or technologies, which could fail to result in a commercial product and otherwise disrupt our business.\nOur operating results will be harmed if we are unable to effectively manage and sustain our future growth or scale our operations.\nOur aspirations and disclosures related to environmental, social, and governance (ESG) matters expose us to risks that could adversely affect our reputation and performance.\nRisks Related to the Manufacturing, Processing, and Supply of Our Products\nOur business includes the packaging and storage of chemicals, and an accident related to these chemicals could subject us to liability and increased costs.\nProduct supply disruptions may have an adverse effect on our profitability and operating results.\nThe cost of raw materials could increase our cost of goods sold and cause our results of operations and financial condition to suffer.\nRisks Related to Commercialization of Our Products\nThe commercial success of our planned or future products is not guaranteed.\nWe may implement a product recall or voluntary market withdrawal, which could significantly increase our costs, damage our reputation, and disrupt our business.\nIf we do not manage product inventory effectively and efficiently, it could adversely affect profitability.\nIf we do not effectively manage our distribution centers, it could adversely affect our business and financial condition.\nIf we do not continue to obtain favorable purchase terms with manufacturers, it could adversely affect our operating results.\nProduct quality, warranty claims, or safety concerns could impact our sales and expose us to litigation.\nRisks Related to Government Regulation\nThe nature of our business subjects us to compliance with employment, environmental, health, transportation, safety, and other governmental regulations.\nRisks Related to Intellectual Property Matters\nIf we are unable to adequately protect our intellectual property rights, our competitive position could be harmed or we could be required to incur significant expenses to enforce or defend our rights.\nIf we infringe on or misappropriate the proprietary rights of others, we may be liable for damages.\nRisks Related to Our Indebtedness\nOur substantial indebtedness could materially adversely affect our financial condition and our ability to operate our business.\nOur ability to generate sufficient cash depends on numerous factors beyond our control, and we may be unable to generate sufficient cash flow to service our debt obligations.\nRestrictive covenants in the agreements governing our Credit Facilities may restrict our ability to pursue our business strategies, and failure to comply with these restrictions could result in acceleration of our debt.\nIncurrence of substantially more debt could further exacerbate the risks associated with our substantial leverage.\nRisks Related to Ownership of Our Common Stock\nOur stock price may be volatile, resulting in substantial losses for investors.\nAn active trading market for our common stock may not be sustained.\nFuture sales of common stock by existing stockholders could cause our stock price to decline.\nTransactions engaged in by our principal stockholders, our officers or directors involving our common stock may have an adverse effect on the price of our stock.\nWe do not intend to pay dividends for the foreseeable future.\nAnti-takeover provisions in our charter documents and under Delaware law could limit certain stockholder actions.\nCertain provisions of our sixth amended and restated certificate of incorporation may have the effect of discouraging lawsuits against our directors and officers.\nWe will continue to incur increased costs as a result of being a public company.\nWe have identified material weaknesses in our internal control over financial reporting. Such weaknesses led to a determination that our internal control over financial reporting and disclosure controls and procedures were not effective as of September 30, 2023. Our inability to remediate these material weaknesses, our identification of any additional weaknesses, or our inability to achieve and maintain effective disclosure controls and procedures and internal control over financial reporting in a timely manner could adversely affect our results of operations, our stock price and investor confidence in us.\nRisks Related to the Nature of Our Business\nOur success depends on our ability to maintain or increase comparable sales, and if we are unable to achieve comparable sales growth, our profitability and performance could be materially adversely impacted.\nOur success depends on increasing comparable sales through our merchandising strategy and ability to increase sales and profits. To increase sales and profits, and therefore comparable sales growth, we focus on delivering value and generating consumer excitement by staffing our locations with pool and spa experts, developing compelling products, optimizing inventory management, maintaining strong location conditions, and effectively marketing current products and new product offerings. If these efforts become less successful, we may not be able to maintain or improve the levels of comparable sales that we have experienced in the past, which could adversely impact our profitability and overall business results. In addition, competition and pricing pressures from competitors may also materially adversely impact our operating margins. Our comparable sales growth could be lower than our historical average or our future target for many reasons, including general economic conditions, operational performance, price inflation or deflation, rising interest rates, recession fears, industry competition, new competitive entrants near our locations, price changes in response to competitive factors, the impact of new locations entering the comparable base, cycling against any year or quarter of above-average sales results, unfavorable weather conditions, supply shortages or other operational disruptions, the number and dollar amount of consumer transactions in our locations, our ability to provide product or service offerings that generate new and repeat visits to our locations, and the level of consumer engagement that we provide in our locations. Opening new locations in our established markets may result in inadvertent oversaturation, temporary or permanent diversion of consumers, and sales from our existing locations to new locations and reduced comparable sales, thus adversely affecting our overall financial performance. These factors may cause our comparable sales results to be materially lower than in recent periods, which could harm our profitability and business.\nPast growth may not be indicative of future growth.\nHistorically, we have experienced substantial sales growth through organic market share gains, new location openings, and acquisitions that have increased our size, scope, and geographic footprint. Our various business strategies and initiatives, including our growth initiatives, are subject to business, economic, and competitive uncertainties and contingencies, many of which are beyond our control. While we contemplate continued growth through internal expansion and acquisitions, we may not be able to:\nacquire new consumers, retain existing consumers, and grow our share of the market;\npenetrate new markets;\nprovide a relevant omni-channel experience to rapidly evolving consumer expectations through our proprietary mobile app and e-commerce websites;\ngenerate sufficient cash flows or obtain sufficient financing to support expansion plans and general operating activities;\nidentify suitable acquisition candidates and successfully integrate acquired businesses;\nmaintain favorable supplier arrangements and relationships; and\nidentify and divest assets that do not continue to create value consistent with our objectives.\nIf we do not manage these factors successfully, our operating results could be adversely affected.\nWe may not be able to successfully manage our inventory to match consumer demand, which could have a material adverse effect on our business, financial condition, and results of operations.\nWe base our inventory purchases, in part, on our sales forecasts. If our sales forecasts overestimate consumer demand, we may experience higher inventory levels, which could result in the need to sell products at lower than anticipated prices, leading to decreased profit margins. Conversely, if our sales forecasts underestimate consumer demand, we may have insufficient inventory to meet demand, leading to lost sales, either of which could materially adversely affect our financial performance.\nLoss of key members of management or failure to attract, develop, and retain highly qualified personnel could adversely affect our business.\nOur future success depends on the continued efforts of the members of our executive leadership team. If one or more of our executives or other key personnel are unable or unwilling to continue in their present positions, or if we are unable to attract and retain high-quality executives or key personnel in the future, our business may be adversely affected.\nWe consider our employees to be the foundation for our growth and success. As such, our future success depends in large part on our ability to attract, train, retain, and motivate qualified personnel. During the height of our seasonal activities, we hire additional employees, including seasonal and part-time employees who generally are not employed during the off-season. If we are unable to attract and hire additional personnel during these seasons, our operating results could be adversely affected.\nOur business is significantly dependent on our ability to meet our labor needs.\nIn order to maintain and continue expanding our operations, we depend on our ability to attract and retain qualified team members. Competition for non-entry-level personnel, particularly for team members with retail experience, is significant. Additionally, our ability to maintain a consistent level of high-quality customer service in our stores is critical to our success. Many of our store team members are in entry-level positions that historically have high rates of turnover. We may be unable to meet our labor needs and control our costs due to external factors such as the availability of qualified persons in the work forces of the markets in which we operate, which is impacted by factors including competition, unemployment levels, demand for certain labor expertise, prevailing wage rates, and the potential adoption of new or revised employment and labor laws and regulations. If we are unable to locate, attract, or retain qualified personnel, or if costs of labor or other related costs increase significantly, our financial performance could be adversely affected.\nWe are subject to, and may in the future be subject to, legal or other proceedings that could have a material adverse effect on us.\nFrom time-to-time, we are a party to legal proceedings, including matters involving personnel and employment issues, personal injury, antitrust claims, intellectual property claims, securities law claims, and other proceedings arising in or outside of the ordinary course of business. We cannot guarantee that the insurance coverage we maintain for the Company and our directors and officers will be available for or adequately cover current or future claims or that we will be able to maintain adequate insurance in the future at rates we consider reasonable. In addition, there are an increasing number of cases being filed against companies generally, including class-action allegations under federal and state wage and hour laws. We could be exposed to legal proceedings arising out of the COVID-19 pandemic, including wrongful death actions brought on behalf of employees who contracted COVID-19 while performing their employment-related duties. We estimate our exposure to these legal proceedings and establish reserves for the probable and reasonably estimated liabilities. Assessing and predicting the outcome of these matters involves substantial uncertainties. Although not currently anticipated by management, unexpected outcomes in these legal proceedings or changes in managements forecast assumptions or predictions could have a material adverse impact on our results of operations.\nDisruptions from natural or man-made disasters or extreme weather, public health and safety issues, geopolitical events and security issues, labor or trade disputes, macroeconomic crises, and similar events could have a material adverse effect on our business.\nNatural or man-made disasters or extreme weather (including as a result of climate change), public health and safety issues, geopolitical events and conflicts (including terrorist attacks and armed hostilities), labor or trade disputes, macroeconomic crises (including any stemming from recent adverse developments in the financial services industry), and similar events can lead to uncertainty and have a negative impact on demand for our products, in addition to causing disruptions to our supply chain. Discretionary spending on chemicals, equipment and parts, cleaning and maintenance equipment, and safety, recreational, and fitness-related products, such as ours, is generally adversely affected during times of economic, social, or political uncertainty. The potential for natural or man-made disasters or extreme weather, geopolitical events and conflicts, labor or trade disputes, macroeconomic crises, and similar events could create these types of uncertainties and negatively impact our business for the short- or long-term in ways that cannot presently be predicted.\nRisks Related to Our Industry and the Broader Economy\nWe face competition by manufacturers, retailers, distributors, and service providers in the residential and professional pool and spa care market.\nWithin our industry, competition is highly fragmented. We compete against a wide range of manufacturers, retailers, distributors, and service providers in the residential and professional pool and spa care market. This includes original equipment manufacturers, regional and local retailers, home improvement retailers, mass-market retailers, and specialty e-commerce operators.\nMost of our competition comes from regional and local independent retailers. National home improvement and retailers, such as Home Depot, Lowes, and local and regional hardware stores, compete with us mainly on a seasonal basis during the spring and summer months, but experience significantly higher foot traffic than our retail locations. We also face competition from mass-market retail competitors, such as Walmart and Costco, who devote shelf space to merchandise and products targeted to our consumers, as well as online mass-market retailers such as Amazon, who devote online categories to merchandise and products targeted to our consumers. Historically, mass-market retailers have generally expanded by adding new stores and product breadth, but their product offerings of pool-related products have remained relatively constant. If pool and spa owners are attracted by the convenience afforded by any of our competitors, they may be less inclined to purchase products and/or services from us.\nIn addition, new competitors may emerge as there are no proprietary technologies or other significant barriers to prevent other firms from entering the swimming pool and spa supply retail market in the future. Should store and internet-based mass-market retailers increase their focus on the pool and spa industry, or increase the breadth of their pool, spa, and related product offerings, they may become a more significant competitor for our industry, which could have an adverse impact on our business. We may face additional competitive pressures if large pool supply retailers look to expand their consumer base. Given the density and demand for pool and spa products, some geographic markets that we serve also tend to have a higher concentration of competitors than others, particularly Arizona, California, Florida, and Texas. These states encompass our largest markets and entry of significant new competitors into them could have a substantial impact on our total sales.\nThe demand for our swimming pool and spa related products and services may be adversely affected by unfavorable economic conditions.\nConsumer discretionary spending affects our sales and is impacted by factors outside of our control, including general economic conditions, the residential housing market, unemployment rates and wage levels, rising interest rates, inflation, disposable income levels, consumer confidence, recession fears, and access to credit. In economic downturns, the demand for swimming pool and spa related products and services may decline, often corresponding with declines in discretionary consumer spending, the growth rate of pool-eligible households, and swimming pool construction. A weak economy may also cause consumers to defer discretionary replacement and refurbishment activity. Even in generally favorable economic conditions, severe and/or prolonged downturns in the housing market could have a material adverse impact on our financial performance. Similarly, slow growth in the number of pool-eligible households can have a lasting negative impact by limiting the potential for future growth of the pool and spa maintenance market.\nWe believe that homeowners access to consumer credit is a critical factor enabling the purchase of new pools, spas and related products. Unfavorable economic conditions and downturn in the housing market can result in significant tightening of credit markets, which limit the ability of consumers to access financing for new swimming pools, spas, and related supplies, and consequently, replacement, repair, and maintenance of equipment. Tightening consumer credit could prevent consumers from obtaining financing for pool and spa projects, which could negatively impact our sales of products and services.\nThe COVID-19 pandemic and associated responses could adversely impact our business and results of operations.\nThe COVID-19 pandemic has significantly impacted economic activity and markets throughout the world. In response, governmental authorities have periodically imposed, and others in the future may impose, stay-at-home orders, shelter-in-place orders, quarantines, executive orders, and similar government orders and restrictions to control the spread of COVID-19. Such orders or restrictions have resulted in temporary location closures, limitation of location hours, limitations on the number of people in locations or in warehouses, enhanced requirements on sanitation, social distancing practices, and travel restrictions, among other effects. Historically, we were able to continue to operate as an essential business under substantially all relevant state and local regulations, and if this changes under future government orders and restrictions, it will adversely impact our financial condition and operating results.\nThe long-term impact of the COVID-19 pandemic on our financial condition or results of operations remains uncertain, in particular, due to external factors related to the pandemic and as COVID-19 cases (including the spread of variants or mutant strains) continue to surge in certain parts of the world. In particular, COVID-19 could have significant disruption to our supply chain for products we sell, which could have a material impact on our sales and earnings. Accordingly, COVID-19 may have negative impacts on our business in the future, and any future adverse impacts on our business may be worse than we anticipate. The ultimate impact will depend on the severity and duration of the COVID-19 pandemic and future resurgences and actions taken by governmental authorities and other third parties in response, each of which is uncertain, rapidly changing, and difficult to predict. Our growth rates during the COVID-19 pandemic may not be sustainable and may not be indicative of future growth.\nThe demand for pool chemicals may be affected by consumer attitudes towards products for environmental or safety reasons.\nWe could be adversely affected if consumers lose confidence in the safety and quality of our products. The demand for the pool chemicals sold by us may also be affected by changes in consumer attitudes toward pool chemical products for environmental or safety reasons. To the extent more environmentally friendly alternative pool and spa water treatment methods emerge, we may not be successful in adopting them in a timely manner.\nOur results of operations may fluctuate from quarter to quarter for many reasons, including seasonality.\nOur sales are highly seasonal and we experience fluctuations in quarterly results as a result of many factors, many of which are outside of our control and/or difficult to predict. We have historically generated a greater percentage of our revenues during the warm weather months of April through September. Timing of consumer purchases will vary each year and sales can be expected to shift from one period to another. As a result, management believes that period-to-period comparisons of results of operations are not necessarily meaningful and should not be relied upon as any indication of future performance or results. In addition, because our revenues are concentrated to a limited number of months, our business is more susceptible to adverse events occurring in those months than other businesses that have consistent levels of revenue throughout the year.\nAdverse developments affecting the financial services industry, such as actual events or concerns involving liquidity, defaults, or non-performance by financial institutions or transactional counterparties, could adversely affect our current and projected business operations and our financial condition and results of operations.\nActual events involving reduced or limited liquidity, defaults, non-performance, or other adverse developments that affect financial institutions or other companies in the financial services industry or the financial services industry generally, or concerns or rumors about any events of these kinds, have in the past and may in the future lead to market-wide liquidity problems. For example, in March 2023, the Federal Deposit Insurance Corporation (FDIC) took control of Silicon Valley Bank and Signature Bank due to liquidity concerns. Although we did not have any cash or cash equivalent balances on deposit with Silicon Valley Bank or Signature Bank, investor concerns regarding the U.S. or international financial systems could result in less favorable commercial financing terms, including higher interest rates or costs and tighter financial and operating covenants, or systemic limitations on access to credit and liquidity sources, thereby making it more difficult for us to acquire financing on acceptable terms or at all. Any decline in available funding or access to our cash and liquidity resources could, among other risks, adversely impact our ability to meet our operating expenses, financial obligations or fulfill our other obligations, or result in breaches of our financial and/or contractual obligations. Any of these impacts, or any other impacts resulting from the factors described above or other similar factors, could have material adverse impacts on our liquidity and our current and/or projected business operations and financial condition and results of operations.\nWe maintain our cash at financial institutions in balances that may exceed federally insured limits.\nThe majority of our cash is held in accounts at U.S. banking institutions, and the amounts of cash held in non-interest-bearing and interest-bearing operating accounts may exceed the FDIC insurance limits. If the banking institutions we use were to fail, we could lose all or a portion of those amounts held in excess of such insurance limitations, and our ability to access such funds in a timely manner, or at all, could be limited. Any material loss or delayed receipt of cash that we may experience in the future could have an adverse effect on our ability to pay our operational expenses or make other payments and may require us to move our accounts to other banks, which could cause a temporary delay in making payments to our suppliers, vendors, and employees, and cause other operational challenges.\nWe are susceptible to adverse weather conditions.\nGiven the nature of our business, weather is one of the principal external factors affecting our business. Unseasonably cool weather or significant amounts of rainfall during the peak sales season can reduce chemical consumption in pools and spas and decrease consumer purchases of our products and services. In addition, unseasonably early or late warming trends can increase or decrease the length of the pool season and impact timing around pool openings and closings and, therefore, our total sales and timing of our sales. While warmer weather conditions favorably impact our sales, global warming trends and other significant climate changes can create more variability in the short-term or lead to other unfavorable weather conditions that could adversely impact our sales or operations. Drought conditions or water management initiatives sometimes lead to municipal ordinances related to water use restrictions. To the extent such restrictions result in decreased pool installations, our sales could be negatively impacted.\nCertain extreme weather events, such as hurricanes and tropical storms, may impact demand for our products and services, our ability to deliver our products, provide services, continue to keep our facilities open and operational, cause damage to our facilities, or impact our business in other ways. As a consequence of these or other catastrophic or uncharacteristic events, we may experience interruption to our operations, increased costs or loss of property, equipment or inventory, which would adversely affect our revenue and profitability.\nTechnology and Privacy Related Risks\nIf the technology-based systems that give our consumers the ability to shop with us online do not function effectively, our operating results, as well as our ability to grow our e-commerce business globally, could be materially adversely affected.\nMany of our consumers shop with us through our physical network and digital platform, which includes our proprietary mobile app and e-commerce websites. Increasingly, consumers are using tablets and smart phones to shop online with us and with our competitors and to do comparison shopping. We are increasingly using social media and our proprietary mobile app to interact with our consumers and as a means to enhance their shopping experience. Any failure on our part to provide an attractive, effective, reliable, and user-friendly digital platform that offers a wide assortment of merchandise with rapid delivery options and that meets the changing expectations of online shoppers could place us at a competitive disadvantage, result in the loss of e-commerce and other sales, harm our reputation with consumers, have a material adverse impact on the growth of our e-commerce business globally, and could have a material adverse impact on our business and results of operations.\nOur e-commerce operation faces distinct risks, such as the failure to make and implement changes to our e-commerce websites and mobile app, the failure to maintain a relevant consumer experience in understanding and interacting with our e-commerce websites and mobile app, telecommunications disruptions, reliance on third-party software technologies, and rapid changes in technology, among others. If not managed effectively, these risks could adversely impact our operating results.\nA significant portion of our digital sales take place through online marketplaces and online retailers and any limitation or restriction, temporarily or otherwise, to sell on these online platforms could harm our profitability and results of operation.\nMarketplace storefronts complement our platform of branded proprietary e-commerce websites. A significant portion of our digital sales take place through online marketplaces and online retailers and are subject to their terms of service and their various other policies including fees charged for transacting on the corresponding platforms. While we endeavor to materially comply with the terms of service and other policies of each online marketplace and online retailer through which we sell our products, these online marketplaces or online retailers may not have the same determination with respect to our compliance. These online marketplaces and online retailers may, in certain circumstances, refuse to continue hosting us or selling our products or temporarily suspend or discontinue our access to their online platform and any limitation or restriction (whether temporary or otherwise) on our ability to sell our products or a material change in transaction fees charged through these online platforms could harm our profitability and results of operations.\nWe rely on information technology systems to support our business operations. A significant disturbance or breach of our technological infrastructure could adversely affect our financial condition and results of operations. Additionally, failure to maintain the security of confidential information could damage our reputation and expose us to litigation.\nInformation technology supports several aspects of our business, including, among others, product sourcing, pricing, consumer service, transaction processing, financial reporting, collections, and cost management. Our ability to operate effectively on a day-to-day basis and accurately report our results depends on robust technological infrastructure, which may be susceptible to internal and external threats. We are vulnerable to interruption by fire, natural disaster, power loss, telecommunication failures, internet failures, security breaches, catastrophic events, and other significant disruptions. Exposure to various types of cyberattacks such as malware, computer viruses, worms, social engineering attacks, or other malicious acts, as well as human error and technological malfunction, could also potentially disrupt our operations or result in a significant interruption in the delivery of our goods and services.\nWe also may experience occasional system interruptions and delays, as a result of routine maintenance, periodic updates, or other factors, that make our information systems unavailable or slow to respond, including the interaction of our information systems with those of third parties. A lack of sophistication or reliability of our information systems could adversely impact our operations and consumer service and could require major repairs or replacements, resulting in significant costs and foregone revenue.\nOur numerous procedures and protocols designed to mitigate cybersecurity risks (including processes for timely notification of appropriate personnel, for assessment and resolution of cybersecurity incidents, and for company-wide training programs, our investments in information technology security and our updates to our business continuity plan) may not prevent or effectively mitigate adverse consequences from cybersecurity risks. Any failure by us to maintain or protect our information technology systems and data integrity, including from cyberattacks, intrusions, or other breaches, could result in the unauthorized access to consumer data, credit card information, and personally identifiable information, theft of intellectual property or other misappropriation of assets, or otherwise compromise our confidential or proprietary information and disrupt our operations, putting us at a competitive disadvantage. Such a breach could result in damage to our reputation and subject us to potential litigation, liability, fines, and penalties, resulting in a possible material adverse impact on our financial condition and results of operations.\nImproper activities by third parties, exploitation of encryption technology, new data-hacking tools and discoveries, and other events or developments may result in future intrusions into or compromise of our networks, payment card terminals, or other payment systems.\nWe may not be able to anticipate the frequently changing techniques used to obtain unauthorized access to sensitive data or implement adequate preventive measures for all of them. Any unauthorized access into our consumers sensitive information, or data belonging to us or our suppliers, even if we are compliant with industry security standards, could put us at a competitive disadvantage, result in deterioration of our consumers confidence in us, and subject us to potential litigation, liability, fines, penalties, and consent decrees, resulting in a possible material adverse impact on our financial condition and results of operations.\nAs a merchant that accepts debit and credit cards for payment, we are subject to the Payment Card Industry Data Security Standard (PCI DSS) issued by the Payment Card Industry Council and to the American National Standards Institute (ANSI) data encryption standards and payment network security operating guidelines, as well as the Fair and Accurate Credit Transactions Act (FACTA). Failure to comply with these guidelines or standards may result in the imposition of financial penalties or the allocation by debit and credit card companies of the costs of fraudulent charges to us. Despite our efforts to comply with these or other payment card standards and other information security measures, we cannot be certain that all of our IT systems will be able to prevent, contain, or detect all cyberattacks or intrusions from known malware or malware that may be developed in the future. To the extent that any disruption results in the loss, damage, or misappropriation of information, we may be adversely affected by claims from consumers, financial institutions, regulatory authorities, payment card associations, and others. In addition, privacy and information security laws and standards continue to evolve and could expose us to further regulatory burdens. The cost of our continued compliance with stricter laws and standards, including, among other regulations, PCI DSS, ANSI, and FACTA data encryption standards and the California Consumer Privacy Act, which took effect in January 2020, and the California Privacy Rights Act, which took effect on January 1, 2023, and the cost of complying with other state data privacy regulations that we may be subject to in the future, could be significant.\nRisks Related to Our Business Strategy\nWe may acquire other companies or technologies, which could fail to result in a commercial product or sales, divert our managements attention, result in additional dilution to our stockholders, and otherwise disrupt our business.\nWe may in the future seek to acquire or invest in businesses or technologies that we believe could complement or expand our portfolio, enhance our technical capabilities, or otherwise offer growth opportunities. We may not be able to successfully complete any acquisition we choose to pursue and we may not be able to successfully integrate any acquired business, product or technology in a cost-effective and non-disruptive manner. The pursuit of potential acquisitions may divert the attention of management and cause us to incur various costs and expenses in identifying, investigating, and pursuing suitable acquisitions, whether or not they are consummated. We may not be able to identify desirable acquisition targets or be successful in entering into an agreement with any particular target or obtain the expected benefits of any acquisition or investment. Similarly, we may not be able to successfully identify and acquire new technologies in a timely manner or at all. Acquisitions could also result in dilutive issuances of equity securities, the use of our available cash, or the incurrence of debt, which could harm our operating results. In addition, if an acquired business fails to meet our expectations, our business, financial condition, and results of operations may be negatively affected.\nOur operating results will be harmed if we are unable to effectively manage and sustain our future growth or scale our operations.\nWe may not be able to manage our growth or future growth efficiently or profitably. Our revenue and operating margins, or revenue and margin growth, may be less than expected. If we are unable to scale our operations efficiently or maintain pricing without significant discounting, we may fail to achieve expected operating margins, which would have a material and adverse effect on our operating results. Growth may also stress our ability to adequately manage our operations, quality of products, safety, and regulatory compliance. If growth significantly decreases, it will negatively impact our cash reserves, and it may be necessary to obtain additional financing, which will increase indebtedness or result in dilution to shareholders. Further, we may not be able to obtain additional financing on acceptable terms, if at all.\nOur aspirations and disclosures related to ESG matters expose us to risks that could adversely affect our reputation and performance.\nWe have established and publicly announced ESG goals, including our commitments to diversity and inclusion. These statements reflect our current plans and aspirations and are not guarantees that we will be able to achieve them. Our failure to accomplish or accurately track and report on these goals on a timely basis, or at all, could adversely affect our reputation, financial performance, and growth, and expose us to increased scrutiny from the investment community as well as enforcement authorities.\nOur ability to achieve any ESG objective is subject to numerous risks, many of which are outside of our control. Additionally, standards for tracking and reporting ESG matters continue to evolve. Our selection of voluntary disclosure frameworks and standards, and the interpretation or application of those frameworks and standards, may change from time-to-time or differ from those of others. This may result in a lack of consistent or meaningful comparative data from period to period or between us and other companies in the same industry.\nIn addition, our processes and controls may not comply with evolving standards for identifying, measuring, and reporting ESG metrics, including ESG-related disclosures that may be required of public companies by the SEC or state governments, and such standards may change over time, which could result in significant revisions to our current goals, reported progress in achieving such goals, or ability to achieve such goals in the future.\nIf our ESG practices do not meet evolving investor or other stakeholder expectations and standards, then our reputation, our ability to attract or retain employees, and our attractiveness as an investment or partner could be negatively impacted. Further, our failure or perceived failure to pursue or fulfill our goals and objectives or to satisfy various reporting standards on a timely basis, or at all, could have similar negative impacts or expose us to government enforcement actions and private litigation.\nRisks Related to the Manufacturing, Processing, and Supply of Our Products\nOur business includes the packaging and storage of chemicals and an accident related to these chemicals could subject us to liability and increased costs.\nWe operate chemical repackaging facilities and we store chemicals in our locations and in our distribution facilities. Because some of the chemicals we repackage and store are hazardous materials, we must comply with various fire and safety ordinances. However, a release at a location or a fire at one of our facilities could give rise to liability claims against us and potential environmental liability. In addition, if an incident involves a repackaging or distribution facility, we might be required temporarily to use alternate sources of supply that could increase our cost of sales.\nWe cannot guarantee that our insurance coverage will be adequate to cover future claims that may arise or that we will be able to maintain adequate insurance in the future at rates we consider reasonable. Successful claims for which we are not fully insured may adversely affect our working capital and profitability. In addition, changes in the insurance industry have generally led to higher insurance costs and decreased availability of coverage.\nNotwithstanding our internal training curriculum and compliance programs, we cannot guarantee that our employees will follow the applicable operating procedures and regulations, or that no accidents or incidents will arise that could expose us to liability and have a negative impact on our operations and results.\nProduct supply disruptions may have an adverse effect on our profitability and operating results.\nWe rely on various suppliers and vendors to provide and deliver product inventory on a continuous basis, some of which are located outside of the United States. These suppliers (and those they depend upon for materials and services) are subject to risks, including from natural or man-made disasters or extreme weather (including as a result of climate change), public health and safety issues, geopolitical events and conflicts (including terrorist attacks and armed hostilities), power outages, labor or trade disputes, union organizing activities, financial liquidity problems, and similar events, as well as supply constraints and general economic, social, and political conditions that can limit their ability to provide us (or our suppliers) with quality products and services in a timely manner. The occurrence of these or other unexpected events can cause us to suffer significant product inventory losses and significant lost revenue. For example, due to the COVID-19 pandemic and the resulting disruption of workplaces and the economy, the ability of certain vendors to supply required products was impaired as a result of labor shortages, government mandated shutdown orders, impaired financial conditions, or for other reasons. The supply of these products may not return to pre-COVID-19 levels, or products may return to pre-COVID levels at different times, and our efforts to ensure in-stock positions for all of the products that our consumers require may not be successful.\nThe cost of raw materials could increase our cost of goods sold and cause our results of operations and financial condition to suffer.\nOur principal chemical raw materials are granular chlorine compounds, which are commodity materials. The prices of granular chlorine compounds are a function of, among other things, manufacturing capacity and demand. We have generally passed through chlorine price increases to our consumers. The price of granular chlorine compounds may increase in the future and we may not be able to pass on any such increase to our consumers. We purchase granular chlorine compounds primarily from the nations largest suppliers. The alternate sources of supply we currently view as reliable may ultimately be unable to supply us with all of our raw materials and finished goods, including chlorine products. Additionally, significant price fluctuations or shortages in raw materials needed for our products have increased our cost of goods sold for certain products and may cause our results of operations and financial condition to suffer. For example, during times of highly unstable supply of granular chlorine compounds we believe some customers stockpile chemicals, resulting in unexpected changes in demand. As a result of such behavior, our revenue is higher than normal during periods of stockpiling and lower than normal during the period after stockpiling has occurred. We believe that consumer stockpiling of chemicals may have negatively impacted our results of operations in fiscal 2023 and may impact us in future periods.\nRisks Related to Commercialization of Our Products\nEven if we are able to attain significant market acceptance of our planned or future products or services, the commercial success of our planned or future products is not guaranteed.\nOur future financial success will depend substantially on our ability to effectively and profitably market and sell our planned and future products and services on a sustained basis, which ability is dependent on a number of additional and/or unpredictable factors. Successful growth of our sales and marketing efforts will depend on the strength of our marketing infrastructure and the effectiveness of our sales and marketing strategies, as well as our ability to forecast demand. Our ability to satisfy product demand driven by our sales and marketing efforts will be largely dependent on the ability to maintain a commercially viable manufacturing process that is compliant with regulatory standards. If we fail to market and sell our planned or future products or services successfully, we will not be able to achieve profitability, which could have a material adverse effect on our business, financial condition, and results of operations.\nWe may implement a product recall or voluntary market withdrawal, which could significantly increase our costs, damage our reputation, and disrupt our business.\nThe manufacturing, packaging, marketing, and processing of our products involves an inherent risk that our processes do not meet applicable quality standards and requirements. In that event, we may voluntarily implement a recall or market withdrawal or may be required to do so by a regulatory authority. A recall or market withdrawal of one of our products would be costly and would divert management resources. A recall or withdrawal of one of our products, or a similar product processed by another entity, also could impair sales of our products because of confusion concerning the scope of the recall or withdrawal, or because of the damage to our reputation for quality and safety.\nIf we do not manage product inventory in an effective and efficient manner, it could adversely affect profitability.\nMany factors affect the efficient use and planning of product inventory, such as effectiveness of predicting demand, preparing manufacturing to meet demand, meeting product mix and product demand requirements, and managing product expiration. At times, we may be unable to manage our inventory efficiently, keep inventory within expected budget goals, keep our work-in-process inventory on hand or manage it efficiently, control expired product, or keep sufficient product on hand to meet demand. We may not be able to keep inventory costs within our target levels. Failure to do so can harm our profitability and long-term growth prospects.\nAny significant interruption to the operations of our distribution centers could affect our ability to distribute our products in a timely manner, which could adversely impact our business and financial condition.\nWe utilize a national network of company-operated distribution centers as well as third-party operated distribution centers to manage the receipt, storage, sorting, packing and distribution of our merchandise to appropriate stores or to customers directly. We depend in large part on the orderly operation of our receiving and distribution process, which depends, in turn, on adherence to shipping schedules, proper functioning of our information technology and inventory control systems and, the overall effective management of such distribution centers. Work stoppages, labor shortages, operations below historical efficiency levels, supply chain disruptions, inclement weather, or other unforeseen events in the areas or regions in which these distribution centers operate could impair our ability to adequately stock our stores, ship products to our e-commerce customers, process returns of products, and may adversely affect our sales and profitability.\nIf we do not continue to obtain favorable purchase terms with manufacturers, it could adversely affect our operating results.\nMost raw materials and those products not repackaged by us are purchased directly from manufacturers. It is common in the swimming pool supply industry for certain manufacturers to offer extended payment terms on certain products to quantity purchasers such as us. These payment terms typically include favorable pricing and are available to us for pre-season or early season purchases. If we do not continue to maintain such favorable purchase terms with manufacturers, it could adversely affect our operating results.\nWe depend on a network of suppliers to source our products, including our own branded products. Product quality, warranty claims, or safety concerns could negatively impact our sales and expose us to litigation.\nWe rely on manufacturers and other suppliers to provide us with the products we sell. As we increase the number of branded products we sell, our exposure to potential liability claims may increase. Product and service quality issues could negatively impact consumer confidence in our brands and our business. If our product and service offerings do not meet applicable safety standards or our consumers expectations regarding safety or quality, we could experience lost sales and increased costs and be exposed to legal, financial, and reputational risks, as well as governmental enforcement actions. Actual, potential, or perceived product safety concerns, including health-related concerns, could expose us to litigation, as well as government enforcement actions, and result in costly product recalls and other liabilities.\nIn addition, if our products are defectively designed, manufactured, or labeled, contain defective components or are misused, we may become subject to costly litigation initiated by consumers. Product liability claims could harm our reputation, divert managements attention from our core business, be expensive to defend, and may result in sizable damage awards against us. Although we maintain product liability insurance, we may not have sufficient insurance coverage for future product liability claims. We may not be able to obtain insurance in amounts or scope sufficient to provide us with adequate coverage against all potential liabilities. Any product liability claims brought against us, with or without merit, could increase our product liability insurance rates or prevent us from securing continuing coverage, harm our reputation, significantly increase our expenses, and reduce product sales. Product liability claims could cause us to incur significant legal fees and deductibles and claims in excess of our insurance coverage would be paid out of cash reserves, harming our financial condition and operating results. In addition, successful product liability claims made against one of our competitors could cause claims to be made against us or expose us to a perception that we are vulnerable to similar claims. Claims against us, regardless of their merit or potential outcome, may also hurt our ability to obtain acceptance of our products or to expand our business.\nRisks Related to Government Regulation\nThe nature of our business subjects us to compliance with employment, environmental, health, transportation, safety, and other governmental regulations.\nWe are subject to federal, state, and local laws and regulations relating to matters such as product labeling, weights and measures, zoning, land use, environmental protection, local fire codes, and workplace safety, including regulation by the Environmental Protection Agency, the Consumer Product Safety Commission, the Department of Transportation, the Occupational Safety and Health Administration, and the National Fire Protection Agency and corresponding state and local authorities. Most of these requirements govern the packaging, labeling, handling, transportation, storage, disposal, and sale of chemicals. We store certain types of chemicals at each of our locations and the storage of these items is strictly regulated by local fire codes. In addition, we sell algaecides and related products that are regulated under the Federal Insecticide, Fungicide and Rodenticide Act, and various state pesticide laws. These laws primarily relate to labeling, annual registration, and licensing.\nCompliance with new and proposed ESG disclosure requirements, including the climate change disclosure requirements of the SEC and the State of California, could require significant effort and divert managements attention and resources, which could adversely affect our operating results. We are also subject to evolving data privacy and cybersecurity laws and regulations (including applicable standards), compliance with which may also increase our costs of doing business.\nManagement has processes in place to facilitate and support our compliance with these requirements. However, failure to comply with these laws and regulations may result in investigations, the assessment of administrative, civil and criminal fines, damages, seizures, disgorgements, penalties, or the imposition of injunctive relief. Moreover, compliance with such laws and regulations in the future could prove to be costly. Although we presently do not expect to incur any capital or other expenditures relating to regulatory matters in amounts that may be material to us, we may be required to make such expenditures in the future. These laws and regulations have changed substantially and rapidly in recent years, and we anticipate that there will be continuing changes.\nThe clear trend in environmental, health, transportation, and safety regulations is to place more restrictions and limitations on activities that impact the environment, such as the use and handling of chemicals. Increasingly, strict restrictions and limitations have resulted in higher operating costs for us and it is possible that the costs of compliance with such laws and regulations will continue to increase. Our attempts to anticipate future regulatory requirements that might be imposed and our plans to remain in compliance with changing regulations and to minimize the costs of such compliance may not be as effective as we anticipate.\nRisks Related to Intellectual Property Matters\nIf we are unable to adequately protect our intellectual property rights, our competitive position could be harmed, we may not be able to build name recognition in our markets of interest, or we could be required to incur significant expenses to enforce or defend our rights.\nIn the course of our business, we employ various trademarks, trade names, and service marks as well as our logo in packaging and advertising of our products. Our commercial success depends in part on our success in obtaining and maintaining issued trademarks, trade names, and service marks in the United States and protecting our proprietary technology. If we do not adequately protect our intellectual property and proprietary technology, competitors may be able to use our technologies or the goodwill we have acquired in the marketplace and erode or negate any competitive advantage we may have, which could harm our business and ability to achieve profitability.\nOur ability to enforce our intellectual property rights depends on our ability to detect infringement. It may be difficult to detect infringers who do not advertise the components that are used in their products. Moreover, it may be difficult or impossible to obtain evidence of infringement in a competitors or potential competitors product. We may not prevail in any lawsuits that we initiate and the damages or other remedies awarded if we were to prevail may not be commercially meaningful.\nIf our trademarks and trade names are not adequately protected, we may not be able to build name recognition in our target markets and our business may be adversely affected. At times, competitors may adopt trade names or trademarks similar to ours, thereby impeding our ability to build brand identity, possibly leading to market confusion and potentially requiring us to pursue legal action. In addition, there could be potential trade name or trademark infringement claims brought by owners of other registered trademarks or trademarks that incorporate variations of our unregistered trademarks or trade names. If we are unable to successfully register our trademarks and trade names and establish name recognition based on our trademarks and trade names, then we may not be able to compete effectively and our business may be adversely affected. Our efforts to enforce or protect our proprietary rights related to trademarks, domain names, copyrights, or other intellectual property may be ineffective and could result in substantial costs and diversion of resources and could adversely impact our financial condition or results of operations.\nOur success depends in part on our ability to operate without infringing on or misappropriating the proprietary rights of others, and if we are unable to do so we may be liable for damages.\nWe cannot be certain that United States or foreign patents or patent applications of other companies do not exist or will not be issued that would prevent us from commercializing our products. Third parties may sue us for infringing or misappropriating their patent or other intellectual property rights. Intellectual property litigation is costly. If we do not prevail in litigation, in addition to any damages we might have to pay, we could be required to cease the infringing activity or obtain a license requiring us to make royalty payments. It is possible that a required license may not be available to us on commercially acceptable terms, if at all. In addition, a required license may be non-exclusive, and therefore our competitors may have access to the same technology licensed to us. If we fail to obtain a required license or are unable to design around another companys patent, we may be unable to make use of some of the affected products, which would reduce our revenues.\nThe defense costs and settlements for patent infringement lawsuits are not covered by insurance. Patent infringement lawsuits can take years to settle. If we are not successful in our defense of or are not successful in obtaining dismissals of any such lawsuit, legal fees or settlement costs could have a material adverse effect on our results of operations and financial position.\nRisks Related to Our Indebtedness\nOur substantial indebtedness could materially adversely affect our financial condition and our ability to operate our business, react to changes in the economy or industry or pay our debts and meet our obligations under our debt agreements, and could divert our cash flow from operations to debt payments.\nWe have a substantial amount of indebtedness. As of November 20, 2023, our total borrowings under our Amended and Restated Term Loan Credit Agreement (the Term Loan) and our credit facility, as amended from time-to-time, among Leslies Poolmart, Inc., the subsidiary borrowers, Leslies, Inc., each lender party thereto, Bank of America, N.A., as Administrative Agent, and U.S. Bank National Association, as Co-Collateral Agent (the Revolving Credit Facility, together, the Credit Facilities) was $789.8 million. Subject to restrictions in the agreements governing our debt, we may incur additional debt.\nOur substantial debt could have important consequences to our stockholders, including the following:\nit may be difficult for us to satisfy our obligations, including debt service requirements under our existing or future debt agreements, resulting in possible defaults on and acceleration of such debt;\nour ability to obtain additional financing for working capital, capital expenditures, debt service requirements, or other general corporate purposes may be impaired;\na substantial portion of cash flow from operations may be dedicated to the payment of principal and interest on our debt, therefore reducing our ability to use our cash flow to fund our operations, capital expenditures, future business opportunities, and acquisitions or for other purposes;\nwe are more vulnerable to economic downturns and adverse industry conditions and our flexibility to plan for, or react to, changes in our business or industry is more limited;\nour ability to capitalize on business opportunities and to react to competitive pressures, as compared to our competitors, may be compromised due to our high level of debt and restrictive covenants contained in the agreements governing our existing and any future debt; and\nour ability to borrow additional funds or to refinance debt may be limited.\nFurthermore, all of our debt under our Credit Facilities bears interest at variable rates. If these rates were to increase significantly, our ability to borrow additional funds may be reduced and the risks related to our substantial debt would intensify.\nServicing our debt requires a significant amount of cash. Our ability to generate sufficient cash depends on numerous factors beyond our control, and we may be unable to generate sufficient cash flow to service our debt obligations.\nOur business may not generate sufficient cash flow from operating activities to service our debt obligations. Our ability to make payments on and to refinance our debt and to fund planned capital expenditures depends on our ability to generate cash in the future. To some extent, this is subject to general economic, financial, competitive, legislative, regulatory, and other factors that are beyond our control.\nIf we are unable to generate sufficient cash flow from operations to service our debt and meet our other commitments, we may need to refinance all or a portion of our debt, sell material assets or operations, delay capital expenditures, or raise additional debt or equity capital. We may not be able to effect any of these actions on a timely basis, on commercially reasonable terms or at all, and these actions may not be sufficient to meet our capital requirements. In addition, the terms of our existing or future debt agreements may restrict us from pursuing any of these alternatives.\nRestrictive covenants in the agreements governing our Credit Facilities may restrict our ability to pursue our business strategies, and failure to comply with any of these restrictions could result in acceleration of our debt.\nThe operating and financial restrictions and covenants in the agreements governing our Credit Facilities may materially adversely affect our ability to finance future operations or capital needs or to engage in other business activities. Such agreements limit our ability, among other things, to:\nincur additional debt or issue certain preferred shares;\npay dividends on or make distributions in respect of our common stock or make other restricted payments;\nmake certain investments;\nsell certain assets;\ncreate liens;\nconsolidate, merge, sell, or otherwise dispose of our assets;\nmake certain payments in respect of certain debt obligations;\nenter into certain transactions with our affiliates; and\ndesignate our subsidiaries as unrestricted subsidiaries.\nA breach of any of these covenants could result in an event of default under our Credit Facilities. Upon the occurrence of an event of default under any of our Credit Facilities, the lenders could elect to declare all amounts outstanding under our Credit Facilities to be immediately due and payable and terminate all commitments to extend further credit. If we were unable to repay those amounts, the lenders under our Credit Facilities could proceed against the collateral granted to them to secure the debt under the Credit Facilities. We have pledged substantially all of our assets as collateral to secure our Credit Facilities. Our future operating results may not be sufficient to enable compliance with our Credit Facilities, and we may not have sufficient assets to repay amounts outstanding under our Credit Facilities. In addition, in the event of an acceleration of our debt upon an event of default, we may not have or be able to obtain sufficient funds to make any accelerated payments.\nFurthermore, the terms of any future debt we may incur could have further additional restrictive covenants. We may not be able to maintain compliance with these covenants in the future, and in the event that we are not able to maintain compliance, we cannot assure you that we will be able to obtain waivers from the lenders or amend the covenants.\nDespite current debt levels, we and our subsidiaries may still be able to incur substantially more debt. This could further exacerbate the risks associated with our substantial leverage.\nWe and our subsidiaries may be able to incur substantial additional debt in the future. Although the agreements governing our Credit Facilities contain restrictions on the incurrence of additional debt, these restrictions are subject to a number of qualifications and exceptions, and the debt incurred in compliance with these restrictions could be substantial. Additionally, we may successfully obtain waivers of these restrictions. If we incur additional debt above the levels currently in effect, the risks associated with our leverage, including those described above, would increase.\nRisks Related to Ownership of Our Common Stock\nOur stock price may be volatile or may decline regardless of our operating performance, resulting in substantial losses for investors.\nThe market price of our common stock may fluctuate significantly in response to numerous factors, many of which are beyond our control, including:\nactual or anticipated fluctuations in our results of operations;\nthe financial projections we may provide to the public, any changes in these projections, or our failure to meet these projections;\nfailure of securities analysts to initiate or maintain coverage of us, changes in financial estimates or ratings or negative reports by any securities analysts who follow us or our failure to meet these estimates or the expectations of investors;\nannouncements by us or our competitors of significant technical innovations, acquisitions, strategic partnerships, joint ventures, results of operations, or capital commitments;\nchanges in operating performance and stock market valuations of other retail companies generally, or those in our industry in particular;\nprice and volume fluctuations in the overall stock market, including as a result of trends in the economy as a whole;\nchanges in our board of directors or management;\nsales of large blocks of our common stock, including sales by our executive officers or directors;\nlawsuits threatened or filed against us;\nchanges in laws or regulations applicable to our business;\nchanges in our capital structure, such as future issuances of debt or equity securities;\nshort sales, hedging, and other derivative transactions involving our capital stock;\nthe inability to execute on our share repurchase program as planned, including failure to meet internal or external expectations around the timing or price of share repurchases, and any reductions or discontinuances of repurchases thereunder;\nour performance with respect to ESG and other issues impacting our reputation;\ngeneral economic conditions in the United States, including rising interest rates, inflationary pressures, and recession fears (including as a result of recent liquidity and financial stability concerns with respect to banks and financial institutions);\nother events or factors, including those resulting from war, incidents of terrorism, pandemics, or other public health emergencies or responses to these events; and\nother factors described in this section and Cautionary Note Regarding Forward-Looking Statements.\nAn active trading market for our common stock may not be sustained.\nAlthough our common stock is traded on the Nasdaq under the symbol LESL, there is a limited trading history on an active trading market for our common stock, which may not be sustained. Accordingly, no assurance can be given as to the following:\nthe likelihood that an active trading market for our common stock will be sustained;\nthe liquidity of any such market;\nthe ability of our stockholders to sell their shares of common stock; or\nthe price of our stockholders may obtain for their common stock.\nIf an active market for our common stock with meaningful trading volume is not maintained, the market price of our common stock may decline materially. Consequently, you may not be able to sell our common stock at prices equal to or greater than the price you paid.\nFuture sales of common stock by existing stockholders could cause our stock price to decline.\nIf our existing stockholders sell, or indicate an intention to sell, substantial amounts of our common stock in the public market the trading price of our common stock could be adversely impacted. As of November 20, 2023, we had 184,333,670 shares of common stock outstanding. All such shares are eligible for resale in the public market, subject to applicable securities laws, including the Securities Exchange Act of 1934, as amended (the Exchange Act). The trading price of our common stock could be adversely impacted if any of these certain significant stockholders sell, or indicate an intention to sell, substantial amounts of our common stock in the public market.\nTransactions engaged in by our principal stockholders, our officers, or directors involving our common stock may have an adverse effect on the price of our stock.\nSales of our shares by our officers, directors, and principal stockholders could have the effect of lowering our stock price. The perceived risk associated with the possible sale of a large number of shares by these stockholders, or the adoption of significant short positions by hedge funds or other significant investors, could cause some of our stockholders to sell their stock, thus causing the price of our stock to decline. In addition, actual or anticipated downward pressure on our stock price due to actual or anticipated sales of stock by our directors or officers could cause other institutions or individuals to engage in short sales of our common stock, which may further cause the price of our stock to decline.\nFrom time-to-time, our directors and executive officers may sell shares of our common stock on the open market. These sales will be publicly disclosed in filings made with the SEC. In the future, our directors and executive officers may sell a significant number of shares for a variety of reasons unrelated to the performance of our business. Our stockholders may perceive these sales as a reflection on managements view of the business and result in some stockholders selling their shares of our common stock. These sales could cause the price of our stock to drop.\nWe do not intend to pay dividends for the foreseeable future.\nWe currently intend to retain any future earnings to finance the operation and expansion of our business and we do not expect to declare or pay any dividends in the foreseeable future. As a result, stockholders must rely on sales of their common stock after price appreciation as the only way to realize any future gains on their investment.\nAnti-takeover provisions in our charter documents and under Delaware law could make an acquisition of us more difficult, limit attempts by our stockholders to replace or remove our current management, and limit the market price of our common stock.\nProvisions in our certificate of incorporation and bylaws may have the effect of delaying or preventing a change of control or changes in our management. Our amended and restated certificate of incorporation and amended and restated bylaws include provisions that:\npermit the board of directors to establish the number of directors and fill any vacancies and newly created directorships;\nprovide that a director may be removed only for cause and only by the affirmative vote of the holders of at least 66 2/3% in voting power of all the then-outstanding shares of stock of the Company entitled to vote thereon, voting together as a single class;\nprovide that the affirmative vote of the holders of at least 66 2/3% in voting power of all the then-outstanding shares of stock of the Company entitled to vote thereon, voting together as a single class, is required in order to amend certain provisions of our sixth amended and restated certificate of incorporation regarding the amendment of our sixth amended and restated certificate of incorporation, the composition and authority of our board of directors, the election and removal of directors, limitations of director liability, stockholder meetings, corporate opportunities, choice of forum and the interpretation of our sixth amended and restated certificate of incorporation;\nauthorize the board of directors to amend our bylaws without the assent or vote of shareholders, provided that stockholders may amend the bylaws with the affirmative vote of the holders of at least 66 2/3% in voting power of all the then-outstanding shares of stock of the Company entitled to vote thereon, voting together as a single class;\nwith the exception of actions required or permitted to be taken by the holders of preferred stock, prohibit stockholder action by written consent, instead requiring stockholder actions to be taken at a meeting of our stockholders;\npermit our board of directors, without further action by our stockholders, to fix the rights, preferences, privileges, and restrictions of preferred stock, the rights of which may be greater than the rights of our common stock;\nrestrict the forum for certain litigation against us to Delaware; and\nestablish advance notice requirements for nominations for election to our board of directors or for proposing matters that can be acted upon by stockholders at annual stockholder meetings.\nThese provisions may frustrate or prevent any attempts by our stockholders to replace or remove our current management by making it more difficult for stockholders to replace members of our board of directors, which is responsible for appointing the members of our management. As a result, these provisions may adversely affect the market price and market for our common stock if they are viewed as limiting the liquidity of our stock or as discouraging takeover attempts in the future.\nThe provision of our sixth amended and restated certificate of incorporation, requiring exclusive forum in certain courts in the State of Delaware or the federal district court for the District of Delaware for certain types of lawsuits, may have the effect of discouraging lawsuits against our directors and officers.\nOur sixth amended and restated certificate of incorporation requires, to the fullest extent permitted by law, that (i) any derivative action or proceeding brought on our behalf, (ii) any action asserting a claim of breach of a fiduciary duty owed by any of our directors, officers, or other employees or stockholders to us or our stockholders, creditors or other constituents, or a claim of aiding and abetting any such breach of fiduciary duty, (iii) any action asserting a claim against us or our directors or officers arising pursuant to any provision of the Delaware General Corporation Law (DGCL) or our sixth amended and restated certificate of incorporation or our amended and restated bylaws or as to which the DGCL confers jurisdiction on the Court of Chancery of the State of Delaware, (iv) any action to interpret, apply, enforce or determine the validity of our sixth amended and restated certificate of incorporation or amended and restated bylaws, (v) any action asserting a claim against us or our directors or officers governed by the internal affairs doctrine or (vi) any action asserting an internal corporate claim as that term is defined in Section 115 of the DGCL will have to be brought only in the Court of Chancery of the State of Delaware (or if the Court of Chancery of the State of Delaware lacks subject matter jurisdiction, any other state court of the State of Delaware, or if no state court of the State of Delaware has subject matter jurisdiction, the federal district court for the District of Delaware), unless we consent in writing to the selection of an alternative forum. The foregoing provision will not apply to claims arising under the Exchange Act or the Securities Act of 1933, as amended (the Securities Act). Unless we consent in writing to the selection of an alternative forum, the federal district court for the District of Delaware shall be, to the fullest extent permitted by law, the exclusive forum for the resolution of any complaint asserting a cause of action arising under the Securities Act against us or any of our directors or officers. Although we believe these exclusive forum provisions benefit us by providing increased consistency in the application of Delaware law and federal securities laws in the types of lawsuits to which each applies, the exclusive forum provisions may limit a stockholders ability to bring a claim in a judicial forum that it finds favorable for disputes with us or any of our directors, officers, or stockholders, which may discourage lawsuits with respect to such claims. Our stockholders will not be deemed to have waived our compliance with the federal securities laws and the rules and regulations thereunder as a result of our exclusive forum provisions. Further, in the event a court finds either exclusive forum provision contained in our sixth amended and restated certificate of incorporation to be unenforceable or inapplicable in an action, we may incur additional costs associated with resolving such action in other jurisdictions, which could harm our business, operating results, and financial condition.\nWe will continue to incur increased costs as a result of being a public company, and our management will continue to be required to devote substantial time to compliance with our public company responsibilities and corporate governance practices.\nAs a company with publicly traded securities, we incur greater costs associated with corporate governance requirements that are applicable to us as a public company, including rules and regulations of the SEC, under the Sarbanes-Oxley Act of 2002 (Sarbanes-Oxley Act), the Dodd-Frank Wall Street Reform and Consumer Protection Act of 2010, the Exchange Act, as well as the Nasdaq listing requirements. These rules and regulations significantly increase our accounting, legal, and financial compliance costs and make some activities more time-consuming. These rules and regulations make it more expensive for us to maintain directors and officers liability insurance. As a result, it may be more difficult for us to attract and retain qualified persons to serve on our board of directors or as executive officers. Furthermore, these rules and regulations will continue to increase our legal and financial compliance costs and will make some activities more time-consuming and costly. We cannot predict or estimate the amount of additional costs we will continue to incur as a public company or the timing of such costs. Accordingly, increases in costs incurred as a result of being a publicly traded company may adversely affect our business, financial condition, and results of operations.\nWe have identified material weaknesses in our internal control over financial reporting. If we are unable to remediate these material weaknesses, or if we experience additional material weaknesses or other deficiencies in the future or otherwise fail to maintain an effective system of internal control over financial reporting, we may not be able to accurately or timely report our financial results, in which case our business may be harmed, investors may lose confidence in the accuracy and completeness of our financial reports, and our stock price could be adversely affected.\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting and for evaluating and reporting on the effectiveness of our system of internal control. As a public company, we are also required by Section 404 of the Sarbanes-Oxley Act to evaluate the effectiveness of our internal control over financial reporting. We must also include a report issued by our independent registered public accounting firm based on their audit of our internal control over financial reporting.\nWe reported in our Annual Report on Form 10-K for the year ended October 1, 2022, a material weakness associated with ineffective information technology general controls (ITGCs) for user access over certain IT systems that support the Companys financial reporting processes. Management also deemed ineffective certain automated and manual business process controls that are dependent on the affected ITGCs because they could have been adversely impacted to the extent that they rely upon information and configurations from the affected IT systems. During fiscal 2023, we completed remediation measures related to the material weakness associated with our ITGCs and concluded the corresponding ITGCs were operating effectively as of September 30, 2023.\nIn connection with our year-end assessment of internal control over financial reporting as part of this Annual Report on Form 10-K, we determined that, as of September 30, 2023, we did not maintain effective internal control over financial reporting because of material weaknesses related to the design and/or operation of controls that were not performed at a sufficient level of precision with respect to (i) the performance of physical inventories and the validation of data utilized in inventory costing for a subset of our inventory and (ii) the accounting for vendor rebates receivable and related income earned and recognized. We intend to remediate these material weaknesses, but we cannot be certain as to when remediation will be complete. Further, remediation efforts may place a significant burden on management and add increased pressure to our financial and IT resources and processes. As a result, we may not be successful in making the improvements necessary to remediate the material weaknesses identified by management, we may not be able to do so in a timely manner, or we may not be able to identify and remediate additional control deficiencies, including material weaknesses, in the future. For further discussion of the material weaknesses identified and our remedial efforts, see Item 9A, Controls and Procedures of this Annual Report.\nCompletion of remediation does not provide assurance that our remediation or other controls will continue to operate properly. If we are unable to maintain effective internal control over financial reporting or disclosure controls and procedures, our ability to record, process and report financial information accurately, and to prepare financial statements within required time periods could be adversely affected, which could subject us to litigation or investigations requiring management resources and payment of legal and other expenses, negatively affect investor confidence in our financial statements and adversely impact our stock price.\nAny failure to maintain internal control over financial reporting could severely inhibit our ability to accurately report our financial condition or results of operations. The effectiveness of our controls and procedures may be limited by a variety of factors, including:\nfaulty human judgment and simple errors, omissions, or mistakes;\nfraudulent action of an individual or collusion of two or more people;\ninappropriate management override of procedures; and\nthe possibility that any enhancements to controls and procedures may still not be adequate to assure timely and accurate financial control.\nOur ability to comply with the annual internal control report requirements will depend on the effectiveness of our financial reporting and data systems and controls across our Company. We expect the modification, enhancement, or replacement of these systems and controls to involve significant expenditures and to become increasingly complex as our business grows. To effectively manage this complexity, we will need to continue to improve our operational, financial, and management controls, and our reporting systems and procedures. Our inability to successfully remediate our existing or any future material weaknesses or other deficiencies in our internal control over financial reporting or any failure to implement required new or improved controls, or difficulties encountered in the implementation or operation of these controls, could harm our operating results and cause us to fail to meet our financial reporting obligations or result in material misstatements in our financial statements, which could limit our liquidity and access to capital markets, adversely affect our business and investor confidence in us, and reduce our stock price. Item 1B. Unresolved Staff Comments.\nNone. Item 2. Properties.\nProperties\nAs of September 30, 2023, we had over 1,000 locations in 39 states, two manufacturing facilities, and six distribution centers supporting our residential locations. In addition, we contract with third-party logistic providers under short-term agreements for additional capacity as needed. Most of our locations operate on five-year leases, which offer significant flexibility as they can be located in a variety of venues, including strip centers, lifestyle centers, and shopping centers. Our current physical network of locations is summarized in the chart below:\nState\nNumber of\nLocations\nAlabama\nArizona\nArkansas\nCalifornia\nColorado\nConnecticut\nDelaware\nFlorida\nGeorgia\nIllinois\nIndiana\nIowa\nKansas\nKentucky\nLouisiana\nMaryland\nMassachusetts\nMichigan\nMississippi\nMissouri\nNebraska\nNevada\nNew Hampshire\nNew Jersey\nNew Mexico\nNew York\nNorth Carolina\nOhio\nOklahoma\nOregon\nPennsylvania\nRhode Island\nSouth Carolina\nTennessee\nTexas\nUtah\nVirginia\nWashington\nWisconsin\nTotal Locations\n1,008\nOur corporate offices are located in Phoenix, Arizona. The 92,669 square foot office building has a current lease term through February 28, 2027, with our ability to exercise two five-year renewal options. Item 3. Legal Proceedings.\nOn September 8, 2023, a class action complaint for violation of federal securities laws was filed by West Palm Beach Police Pension Fund in the U.S. District Court for the District of Arizona against us, our Chief Executive Officer and our former Chief Financial Officer. The complaint alleges that we violated federal securities laws by issuing materially false and misleading statements that failed to disclose adverse facts about our financial guidance, business operations and prospects, and seeks class certification, damages, interest, attorneys fees, and other relief. Due to the early stage of this proceeding, we cannot reasonably estimate the potential range of loss, if any. We dispute the allegations of wrongdoing and intend to defend ourselves vigorously in this matter.\nWe are subject to other litigation, claims, and other proceedings that arise from time-to-time in the ordinary course of business. We believe these actions are routine and incidental to the business. As of September 30, 2023, we had established reserves for claims that are probable and estimable and such reserves were not significant. While we cannot feasibly predict the outcome of these matters with certainty, we believe, based on examination of these matters, experience to date and discussions with counsel, that the ultimate liability, individually or in the aggregate, will not have a material adverse effect on our business, financial position, results of operations, or cash flows. Item 4. Mine Safety Disclosures.\nNot applicable.\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities.\nOur common stock is listed on Nasdaq under the LESL symbol and began regular way trading on Nasdaq on October 29, 2020. Prior to that date, there was no public trading market for our common stock.\nAs of November 20, 2023, there were three stockholders of record, although there is a much larger number of beneficial holders. The actual number of stockholders is greater than the number of record holders stated above, and includes stockholders who are beneficial owners, but whose shares are held in street name by brokers and other nominees.\nStock Performance Chart\nThis performance graph shall not be deemed filed with the SEC for purposes of Section 18 of the Exchange Act or incorporated by reference into any filing of Leslies, Inc. under the Securities Act or the Exchange Act.\nThe graph below presents our cumulative total shareholder returns on our common stock relative to the performance of the Nasdaq Global Composite Index and the S&P SmallCap 600 Index. The graph assumes $100 was invested at the market close on October 29, 2020, which was the first day our common stock began trading and its relative performance is tracked through September 30, 2023. Data for the Nasdaq Global Composite Index, S&P 500 Index, and S&P SmallCap 600 Index assume reinvestment of dividends. The graph uses the closing market price on October 29, 2020 of $21.70 per share as the initial value of our common stock. The comparisons in the graph below are based upon historical data and are not indicative of, nor intended to forecast, future performance of our common stock:\nDividends\nWe have never declared nor paid any cash dividends on our common stock. We currently do not expect to pay any dividends on our common stock in the foreseeable future. Any future determination relating to our dividend policy will be made by our board of directors and will depend on a number of factors, including: our actual and projected financial condition, liquidity, and results of operations; our capital levels and needs; tax considerations; any acquisitions or potential acquisitions; statutory and regulatory prohibitions and other limitations; the terms of any credit agreements or other borrowing arrangements that restrict the amount of cash dividends that we can pay; general economic conditions; and other factors deemed relevant by our board of directors. We are not obligated to pay dividends on our common stock.\nRecent Sales of Unregistered Securities\nNone.\nRepurchase of Equity Securities\nOn December 3, 2021, the board of directors authorized a share repurchase program for up to an aggregate of $300 million of the Companys outstanding shares of common stock over a period of three years, expiring December 31, 2024. During the quarter ended September 30, 2023, there were no repurchases under our program and as of September 30, 2023, approximately $147.7 million remained available for future purchases under our share repurchase program. Item 6. [Reserved]. Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations.\nThe following discussion and analysis of our financial condition and results of operations should be read together with our consolidated financial statements and related notes, which are included elsewhere in this Annual Report on Form 10-K. This discussion may contain forward-looking statements based upon current expectations that involve risks and uncertainties. Actual results or outcomes may differ materially from those anticipated in these forward-looking statements, which are subject to risks, uncertainties, and other factors, including those described in Part I, Item 1A, Risk Factors of this Annual Report on Form 10-K for the fiscal year ended September 30, 2023.\nWe operate on a fiscal calendar that results in a fiscal year consisting of a 52- or 53-week period ending on the Saturday closest to September 30th. In a 52-week fiscal year, each quarter contains 13 weeks of operations; in a 53-week fiscal year, each of the first, second, and third quarters includes 13 weeks of operations and the fourth quarter includes 14 weeks of operations. References to fiscal 2023, 2022, and 2021 refer to the fiscal years ended September 30, 2023, October 1, 2022, and October 2, 2021, respectively. Fiscal 2023, 2022, and 2021 included 52 weeks of operations.\nOur Company\nWe are the largest and most trusted direct-to-consumer brand in the $15 billion United States pool and spa care industry, serving residential and professional consumers. Founded in 1963, we are the only direct-to-consumer pool and spa care brand with national scale, operating an integrated marketing and distribution ecosystem powered by a physical network of over 1,000 branded locations and a robust digital platform. We offer an extensive assortment of professional-grade products, the majority of which are exclusive to Leslies, as well as certified installation and repair services, all of which are essential to the ongoing maintenance of pools and spas. Our dedicated team of associates, pool and spa care experts, and experienced service technicians are passionate about empowering our consumers with the knowledge, products, and solutions necessary to confidently maintain and enjoy their pools and spas. The considerable scale of our integrated marketing and distribution ecosystem, which is powered by our direct-to-consumer network, uniquely enables us to efficiently reach and service every pool and spa in the continental United States.\nWe operate primarily in the pool and spa aftermarket industry, which is one of the most fundamentally attractive consumer categories given its scale, predictability, and growth outlook. More than 80% of our assortment is comprised of non-discretionary products essential to the care of residential and commercial pools and spas. Our assortment includes chemicals, equipment and parts, cleaning and maintenance equipment, and safety, recreational, and fitness-related products. We also offer important essential services, such as equipment installation and repair for residential consumers and professional pool operators. Consumers receive the benefit of extended vendor warranties on purchased products from our locations and on installations or repairs from our certified in-field technicians. We offer complimentary, commercial-grade in-store water testing and analysis via our proprietary AccuBlue® system, which increases consumer engagement, conversion, basket size, and loyalty, resulting in higher lifetime value. Our water treatment expertise is powered by data and intelligence accumulated from the millions of water tests we have performed over the years, positioning us as the most trusted water treatment service provider in the industry. Due to the non-discretionary nature of our products and services, our business has historically delivered strong, uninterrupted growth and profitability in all market environments, including through the Great Recession and the COVID-19 pandemic.\nWe have a legacy of leadership and disruptive innovation. Since our founding in 1963, we have been the leading innovator in our category and have provided our consumers with the most advanced pool and spa care available. As we have scaled, we have leveraged our competitive advantages to strategically reinvest in our business and intellectual property to develop new value-added capabilities. Over the course of our history, we have pioneered complimentary in-store water testing, offered complimentary in-store equipment repair services, introduced the industrys first loyalty program, and developed an expansive platform of owned and exclusive brands. These differentiated capabilities allow us to meet the needs of any pool and spa owner, whether they care for their pool or spa themselves or rely on a professional, whenever, wherever, and however they choose to engage with us.\nKey Factors and Measures We Use to Evaluate Our Business\nWe consider a variety of financial and operating measures in assessing the performance of our business. The key measures we use under United States generally accepted accounting principles (GAAP) are sales, gross profit and gross margin, selling, general, and administrative expenses (SG&A), and operating income (loss). The key non-GAAP measures and other operating measures we use are comparable sales, comparable sales growth, Adjusted EBITDA, Adjusted net income (loss), and Adjusted earnings per share.\nSales\nWe offer a broad range of products that consists of regularly purchased, non-discretionary pool and spa maintenance items such as chemicals, equipment, cleaning accessories and parts, as well as installation and repair services for pool and spa equipment. Our offering of proprietary, owned, and third-party brands across diverse product categories drives sales growth by attracting new consumers and encouraging repeat visits from our existing consumers. Revenue from merchandise sales at retail locations is recognized at the point of sale, revenue from services is recognized when the services are rendered, and revenue from e-commerce merchandise sales is generally recognized upon shipment of the merchandise. Revenue is recorded net of related discounts and sales tax. Payment from retail customers is generally at the point of sale and payment terms for professional pool operator customers are based on our credit requirements and generally have terms of less than 60 days. When we receive payment from a consumer before the consumer has taken possession of the merchandise or the service has been performed, the amount received is recorded as deferred revenue or as a customer deposit until the sale or service is complete. Sales are impacted by product mix and availability, as well as promotional and competitive activities and the spending habits of our consumers. Growth of our sales is primarily driven by comparable sales growth and expansion of our locations in existing and new markets.\nComparable Sales and Comparable Sales Growth\nWe measure comparable sales growth as the increase or decrease in sales recorded by the comparable base in any reporting period, compared to sales recorded by the comparable base in the prior reporting period. The comparable base includes sales through our locations and through our e-commerce websites and third-party marketplaces. Comparable sales growth is a key measure used by management and our board of directors to assess our financial performance.\nWe consider a new or acquired location comparable in the first full month after it has completed one year of sales. Closed locations become non-comparable during their last partial month of operation. Locations that are relocated are considered comparable at the time the relocation is complete. Comparable sales is not calculated in the same manner by all companies, and accordingly, is not necessarily comparable to similarly titled measures of other companies and may not be an appropriate measure for performance relative to other companies.\nThe number of new locations reflects the number of locations opened during a particular reporting period. New locations require an initial capital investment in location buildouts, fixtures, and equipment, which we amortize over time as well as cash required for inventory.\nAs of September 30, 2023, we operated over 1,000 locations in 39 states across the United States. We owned 27 locations and leased the remainder of our locations. Our initial lease terms are typically five years with options to renew for multiple successive five-year periods. We evaluate new opportunities in new and existing markets based on the number of pools and spas in the market, competition, our existing locations, availability and cost of real estate, and distribution and operating costs of our locations. We review performance of our locations on a regular basis and evaluate opportunities to strategically close locations to improve our profitability. Our limited investment costs in individual locations and our ability to transfer sales to our extensive network of remaining locations and e-commerce websites allows us to improve profitability as a result of any strategic closures.\nGross Profit and Gross Margin\nGross profit is equal to our sales less our cost of merchandise and services sold. Cost of merchandise and services sold reflects the direct cost of purchased merchandise, costs to package certain chemical products, including direct materials and labor, costs to provide services, including labor and materials, as well as distribution and occupancy costs. The direct cost of purchased merchandise includes vendor rebates. We recognize vendor rebates based on an estimated recognition pattern using historical data. Distribution costs include warehousing and transportation expenses, including costs associated with third-party fulfillment centers used to ship merchandise to our e-commerce consumers. Occupancy costs include the rent, common area maintenance, real estate taxes, and depreciation and amortization costs of all retail locations. These costs are significant and are expected to continue to increase proportionate to our growth.\nGross margin is gross profit as a percentage of our sales. Gross margin is impacted by merchandise costs, pricing and promotions, product mix and availability, inflation, and service costs, which can vary. Our proprietary brands, custom-formulated products, and vertical integration provide us with cost savings, as well as greater control over product availability and quality as compared to other companies in the industry. Gross margin is also impacted by the costs of distribution and occupancy costs, which can vary.\nOur gross profit is variable in nature and generally follows changes in sales. The components of our cost of merchandise and services sold may not be comparable to the components of cost of sales or similar measures of other companies. As a result, our gross profit and gross margin may not be comparable to similar data made available by other companies.\nSelling, General and Administrative Expenses\nOur SG&A includes selling and operating expenses across our retail locations and digital platform, and our corporate-level general and administrative expenses. Selling and operating expenses at retail locations include payroll, bonus and benefit costs for personnel, supplies, and credit and debit card processing costs. Corporate expenses include payroll, bonus, and benefit costs for our corporate and field support functions, equity-based compensation, marketing and advertising, insurance, utilities, occupancy costs related to our corporate office facilities, professional services, and depreciation and amortization for all assets, except those related to our retail locations and distribution operations, which are included in cost of merchandise and services sold. Selling and operating expenses generally vary proportionately with sales and the change in the number of locations. In contrast, general and administrative expenses are generally not directly proportional to sales and the change in the number of locations, but may increase over time to support our growth and public company obligations. The components of our SG&A may not be comparable to the components of similar measures of other companies.\nOperating Income (Loss)\nOperating income (loss) is gross profit less SG&A. Operating income (loss) excludes interest expense, loss on debt extinguishment, income tax expense (benefit), and other (income) expenses, net. We use operating income (loss) as an indicator of the productivity of our business and our ability to manage expenses.\nAdjusted EBITDA\nAdjusted EBITDA is defined as earnings before interest (including amortization of debt issuance costs), taxes, depreciation and amortization, management fees, equity-based compensation expense, loss (gain) on debt extinguishment, loss (gain) on asset and contract dispositions, executive transition costs, severance, costs related to equity offerings, strategic project costs, merger and acquisition costs, and other non-recurring, non-cash or discrete items. Adjusted EBITDA is a key measure used by management and our board of directors to assess our financial performance. Adjusted EBITDA is also frequently used by analysts, investors, and other interested parties to evaluate companies in our industry, when considered alongside other GAAP measures. We use Adjusted EBITDA to supplement GAAP measures of performance to evaluate the effectiveness of our business strategies, to make budgeting decisions, and to compare our performance against that of other companies using similar measures.\nAdjusted EBITDA is not a recognized measure of financial performance under GAAP but is used by some investors to determine a companys ability to service or incur indebtedness. Adjusted EBITDA is not calculated in the same manner by all companies, and accordingly, is not necessarily comparable to similarly titled measures of other companies and may not be an appropriate measure for performance relative to other companies. Adjusted EBITDA should not be construed as an indicator of a companys operating performance in isolation from, or as a substitute for, net income (loss), cash flows from operations or cash flow data, all of which are prepared in accordance with GAAP. We have presented Adjusted EBITDA solely as supplemental disclosure because we believe it allows for a more complete analysis of results of operations. Adjusted EBITDA is not intended to represent, and should not be considered more meaningful than, or as an alternative to, measures of operating performance as determined in accordance with GAAP. In the future, we may incur expenses or charges such as those added back to calculate Adjusted EBITDA. Our presentation of Adjusted EBITDA should not be construed as an inference that our future results will be unaffected by these items.\nAdjusted Net Income (Loss) and Adjusted Earnings per Share\nAdjusted net income (loss) and Adjusted earnings per share are additional key measures used by management and our board of directors to assess our financial performance. Adjusted net income (loss) and Adjusted earnings per share are also frequently used by analysts, investors, and other interested parties to evaluate companies in our industry, when considered alongside other GAAP measures.\nAdjusted net income (loss) is defined as net income (loss) adjusted to exclude management fees, equity-based compensation expense, loss (gain) on debt extinguishment, loss (gain) on asset and contract dispositions, executive transition costs, severance, costs related to equity offerings, strategic project costs, merger and acquisition costs, and other non-recurring, non-cash, or discrete items. Adjusted diluted earnings per share is defined as Adjusted net income (loss) divided by the diluted weighted average number of common shares outstanding.\nFactors Affecting the Comparability of our Results of Operations\nOur reported results have been affected by, among other events, the following events, which must be understood in order to assess the comparability of our period-to-period financial performance and condition.\nImpact of Macroeconomic Events and Uncertainties\nOur financial performance and condition may be impacted to varying extents from period to period by macroeconomic and geopolitical developments, including public health crises, escalating global conflicts, supply chain disruptions, labor market constraints, rising rates of inflation, rising interest rates, general economic slowdown, and potential failures among financial institutions. The direct and indirect impact COVID-19 has had on our financial and operating performance since 2020 has made period-to-period analysis and accurate forecasting difficult. Due to the non-discretionary nature of our products and services, our business delivered strong growth and profitability throughout the pandemic, despite restrictions on the operation of our locations and distribution facilities. Significant disruption to our supply chain for products we sell, as a result of COVID-19, geopolitical conflict or otherwise, can also have a material impact on our sales and earnings and cause unpredictable changes in results.\nAn additional uncertainty that can impact our results of operation is consumer purchasing patterns. Due to the highly unstable supply of granular chlorine compounds, we believe some customers stockpile chemicals, resulting in unexpected changes in demand. As a result of such behavior, our revenue is higher than normal during the periods of stockpiling and lower than normal during period after stockpiling has occurred. We believe that consumer stockpiling of chemicals may have negatively impacted our results of operations in fiscal 2023 and may impact us in future periods.\nBusiness Acquisitions\nSee Note 3-Business Combinations to our consolidated financial statements included elsewhere in this Annual Report on Form 10-K for information regarding our business acquisitions.\nResults of Operations\nWe derived our consolidated statements of operations for fiscal 2023, 2022, and 2021 from our consolidated financial statements. Our historical results are not necessarily indicative of the results that may be expected in the future. The following table summarizes key components of our results of operations for the periods indicated, both in dollars and as a percentage of our sales (in thousands, except per share amounts):\nYear Ended\nStatements of Operations Data:\nSeptember 30, 2023\nOctober 1, 2022\nOctober 2, 2021\nSales\n$\n1,451,209\n$\n1,562,120\n$\n1,342,917\nCost of merchandise and services sold\n902,986\n888,379\n747,757\nGross profit\n548,223\n673,741\n595,160\nSelling, general and administrative expenses\n446,044\n434,987\n386,075\nOperating income\n102,179\n238,754\n209,085\nOther expense:\nInterest expense\n65,438\n30,240\n34,410\nLoss on debt extinguishment\n-\n-\n9,169\nOther expenses, net\n-\n2,377\nTotal other expense\n65,438\n30,637\n45,956\nIncome before taxes\n36,741\n208,117\n163,129\nIncome tax expense\n9,499\n49,088\n36,495\nNet income\n$\n27,242\n$\n159,029\n$\n126,634\nEarnings per share\nBasic\n$\n0.15\n$\n0.86\n$\n0.68\nDiluted\n$\n0.15\n$\n0.85\n$\n0.67\nWeighted average shares outstanding\nBasic\n183,839\n184,347\n185,412\nDiluted\n184,716\n186,148\n190,009\nPercentage of Sales(1)\n(%)\n(%)\n(%)\nSales\n100.0\n100.0\n100.0\nCost of merchandise and services sold\n62.2\n56.9\n55.7\nGross margin\n37.8\n43.1\n44.3\nSelling, general and administrative expenses\n30.7\n27.8\n28.7\nOperating income\n7.0\n15.3\n15.6\nOther expense:\nInterest expense\n4.5\n1.9\n2.6\nLoss on debt extinguishment\n-\n-\n0.7\nOther expenses, net\n-\n0.1\n0.2\nTotal other expense\n4.5\n2.0\n3.4\nIncome before taxes\n2.5\n13.3\n12.1\nIncome tax expense\n0.7\n3.1\n2.7\nNet income\n1.9\n10.2\n9.4\nOther Financial and Operations Data:\nNumber of new and acquired locations, net\nNumber of locations open at end of period\n1,008\nComparable sales growth(2)\n(11.0\n)%\n10.6\n%\n21.5\n%\nAdjusted EBITDA(3)\n$\n168,149\n$\n292,276\n$\n270,613\nAdjusted EBITDA as a percentage of sales(3)\n11.6\n%\n18.7\n%\n20.2\n%\nAdjusted net income(3)\n$\n51,113\n$\n176,391\n$\n161,478\nAdjusted diluted earnings per share\n$\n0.28\n$\n0.95\n$\n0.85\n(1)Components may not add to totals due to rounding.\n(2)See the section titled Managements Discussion and Analysis of Financial Condition and Results of Operations-Key Factors and Measures We Use to Evaluate Our Business.\n(3)The tables below provide a reconciliation from our net income to Adjusted EBITDA and net income to Adjusted net income for fiscal 2023, 2022, and 2021 (in thousands).\nYear Ended\nSeptember 30, 2023\nOctober 1, 2022\nOctober 2, 2021\nNet income\n$\n27,242\n$\n159,029\n$\n126,634\nInterest expense\n65,438\n30,240\n34,410\nIncome tax expense\n9,499\n49,088\n36,495\nDepreciation and amortization expense(1)\n34,142\n30,769\n26,553\nManagement fees(2)\n-\n-\nEquity-based compensation expense(3)\n12,067\n11,922\n25,621\nLoss on debt extinguishment(4)\n-\n-\n9,169\nLoss (gain) on asset and contract dispositions(5)\n6,379\n(1,643\n)\nExecutive transition costs(6)\n6,160\n-\nCosts related to equity offerings(7)\n-\n10,444\nStrategic project costs(8)\n3,004\n4,960\n-\nOther non-recurring costs(9)\n4,218\n4,409\n2,548\nAdjusted EBITDA\n$\n168,149\n$\n292,276\n$\n270,613\nYear Ended\nSeptember 30, 2023\nOctober 1, 2022\nOctober 2, 2021\nNet income\n$\n27,242\n$\n159,029\n$\n126,634\nManagement fees(2)\n-\n-\nEquity-based compensation expense(3)\n12,067\n11,922\n25,621\nLoss on debt extinguishment(4)\n-\n-\n9,169\nLoss (gain) on asset and contract dispositions(5)\n6,379\n(1,643\n)\nExecutive transition costs(6)\n6,160\n-\nCosts related to equity offerings(7)\n-\n10,444\nStrategic project costs(8)\n3,004\n4,960\n-\nOther non-recurring costs(9)\n4,218\n4,409\n2,548\nTax effects of these adjustments(10)\n(7,957\n)\n(5,788\n)\n(11,677\n)\nAdjusted net income\n$\n51,113\n$\n176,391\n$\n161,478\n(1)Includes depreciation related to our distribution centers and locations, which is reported in cost of merchandise and services sold in our consolidated statements of operations.\n(2)Represents amounts paid or accrued in connection with our management services agreement, which was terminated upon the completion of our IPO in November 2020 and are reported in SG&A in our consolidated statements of operations.\n(3)Represents charges related to equity-based compensation and the related Company payroll tax expense, which are reported in SG&A in our consolidated statements of operations.\n(4)Represents non-cash expense due to the write-off of deferred financing costs related to our Term Loan modification and the repayment of our senior unsecured notes in fiscal 2021 and are reported in loss on debt extinguishment in our consolidated statements of operations.\n(5)Includes losses (gains) on asset and contract dispositions, which are reported in SG&A in our consolidated statements of operations.\n(6)Includes executive transition costs and severance associated with corporate restructuring, which are reported in SG&A in our consolidated statements of operations.\n(7)Includes costs incurred for follow-on equity offerings, which are reported in other (income) expenses, net in our consolidated statements of operations.\n(8)Represents non-recurring costs, such as third-party consulting costs, which are not part of our ongoing operations and are incurred to execute differentiated, strategic projects, and are reported in SG&A in our consolidated statements of operations.\n(9)Includes merger and acquisition costs, and other non-recurring, non-cash, or discrete items as determined by management, which are reported in SG&A in our consolidated statements of operations.\n(10)Represents the tax effect of the total adjustments based on our combined U.S. federal and state statutory tax rates. Amounts are reported in income tax expense in our consolidated statements of operations.\nComparison of Fiscal 2023 and 2022\nSales\nSales decreased to $1,451.2 million in fiscal 2023 compared to $1,562.1 million in fiscal 2022, a decrease of $110.9 million, or 7.1%. Comparable sales decreased $170.5 million, or 11.0%, compared to fiscal 2022, primarily driven by traffic declines. Non-comparable sales including acquisitions and new stores were $59.6 million compared to the prior year period.\nGross Profit and Gross Margin\nGross profit decreased to $548.2 million in fiscal 2023 compared to $673.7 million in fiscal 2022, a decrease of $125.5 million or 18.6%. Gross margin decreased to 37.8% compared to 43.1% in fiscal 2022, a decrease of 530 basis points. The decrease in gross margin was primarily driven by a decrease in retail chemical pricing retail in June 2023, adjustments associated with year-end physical inventory results, adjustments to product rebates based on reduced equipment purchases, and occupancy deleverage associated with the decrease in comparable sales.\nSelling, General and Administrative Expenses\nSG&A increased to $446.0 million in fiscal 2023 compared to $435.0 million in fiscal 2022, an increase of $11.0 million or 2.5%. This increase in SG&A was primarily related to a $5.5 million increase in executive transition and other costs related to severance payments associated with the elimination of non-customer facing positions and a $6.1 million increase in connection with the costs incurred from the discontinued use of certain software product subscriptions.\nTotal Other Expense\nTotal other expense increased to $65.4 million in fiscal 2023 compared to $30.6 million in fiscal 2022, an increase of $34.8 million. These increases in total other expense were primarily related to the increase in interest expense of $35.2 million for fiscal 2023 compared to fiscal 2022, due to higher interest rates on our Term Loan and Revolving Credit Facility and increased borrowings on our Revolving Credit Facility.\nIncome Taxes\nIncome tax expense decreased to $9.5 million in fiscal 2023 compared to $49.1 million in fiscal 2022, a decrease of $39.6 million. This decrease was primarily attributable to lower pretax income. Our effective tax rate was 25.9% for fiscal 2023 compared to 23.6% for fiscal 2022.\nNet Income and Earnings per Share\nNet income decreased to $27.2 million in fiscal 2023 compared to $159.0 million in fiscal 2022, a decrease of $131.8 million. Diluted earnings per share decreased to $0.15 in fiscal 2023 compared to $0.85 in fiscal 2022.\nAdjusted net income decreased to $51.1 million in fiscal 2023 compared to $176.4 million in fiscal 2022, a decrease of $125.3 million. Adjusted diluted earnings per share decreased to $0.28 in fiscal 2023 compared to $0.95 in fiscal 2022.\nAdjusted EBITDA\nAdjusted EBITDA decreased to $168.1 million in fiscal 2023 compared to $292.3 million in fiscal 2022, a decrease of $124.2 million. This decrease was primarily due to the decrease in gross profit.\nComparison of Fiscal 2022 and 2021\nSales\nSales increased to $1,562.1 million in fiscal 2022 from $1,342.9 million in fiscal 2021, an increase of $219.2 million or 16.3%. The increase was primarily driven by comparable sales growth of $143.1 million, or 10.6%, in fiscal 2022 as well as non-comparable sales of $76.1 million, driven by acquisitions and new locations open for less than 52 weeks.\nGross Profit and Gross Margin\nGross profit increased to $673.7 million in fiscal 2022 from $595.2 million in fiscal 2021, an increase of $78.5 million or 13.2%. Gross margin decreased to 43.1% compared to 44.3% in fiscal 2021, a decrease of 120 basis points. The increase in gross profit was primarily due to increased sales. The decrease in gross margin was primarily due to shifts in business mix, decreased product margin related to promotions and higher product cost, partially offset by distribution and occupancy leverage.\nSelling, General and Administrative Expenses\nSG&A increased to $435.0 million in fiscal 2022 from $386.1 million in fiscal 2021, an increase of $48.9 million or 12.7%. This increase in SG&A was primarily related to a $57.0 million increase associated with higher sales, inflationary costs associated with payroll and digital marketing expenses and non-comparable SG&A associated with our acquisitions; a $5.0 million increase related to strategic project costs incurred during fiscal 2022; a $4.9 million increase associated with executive transition costs, losses (gains) on disposition of fixed assets, merger and acquisition costs and other non-recurring, non-cash or discrete items; and a $3.9 million increase associated with higher depreciation and amortization expense. These increases were offset by lower non-cash equity-based compensation expense of $13.7 million compared to fiscal 2021 and certain one-time payments of contractual amounts of $8.2 million made in fiscal 2021, both of which were primarily incurred in connection with our IPO.\nTotal Other Expense\nTotal other expenses decreased to $30.6 million in fiscal 2022 from $46.0 million in fiscal 2021, a decrease of $15.4 million. The decrease in other expenses was primarily related to a $9.2 million non-cash loss on debt extinguishment related to the refinancing of the Term Loan and repayment of our senior unsecured notes during fiscal 2021, a decrease in interest expense of $4.2 million in fiscal 2022 due to the repayment of our senior unsecured notes with the proceeds of our IPO and $2.0 million of follow-on offering costs incurred in fiscal 2021.\nIncome Taxes\nIncome tax expense increased to $49.1 million in fiscal 2022 from $36.5 million in fiscal 2021, an increase of $12.6 million. Our effective tax rate was 23.6% for fiscal 2022 compared to 22.4% for fiscal 2021, reflecting lower income tax benefits attributable to equity-based compensation awards and research and development credits.\nNet Income and Earnings per Share\nNet income increased to $159.0 million in fiscal 2022 from $126.6 million in fiscal 2021, an increase of $32.4 million. Diluted earnings per share increased to $0.85 in fiscal 2022 from $0.67 in fiscal 2021.\nAdjusted net income increased to $176.4 million in fiscal 2022 from $161.5 million in fiscal 2021, an increase of $14.9 million. Adjusted diluted earnings per share increased to $0.95 in fiscal 2022 compared to $0.85 in fiscal 2021.\nAdjusted EBITDA\nAdjusted EBITDA increased to $292.3 million in fiscal 2022 from $270.6 million fiscal 2021, an increase of $21.7 million. This increase was due primarily to the increase in comparable sales and gross profit.\nSeasonality and Quarterly Fluctuations\nOur business is highly seasonal. Sales and earnings are highest during the third and fourth fiscal quarters, which include April through September, and represent the peak months of swimming pool use. Sales are substantially lower during our first and second fiscal quarters when we typically generate net losses and we realize negative operating cash flows. We have a long track record of investing in our business throughout the year, including in operating expenses, working capital, and capital expenditures related to new locations and other growth initiatives. While these investments drive performance during the primary selling season in our third and fourth fiscal quarters, they have a negative impact on our earnings and cash flow during our first and second fiscal quarters.\nWe typically experience a build-up of inventory and accounts payable during the first and second fiscal quarters in anticipation of the peak swimming pool supply selling season. We negotiate extended payment terms with certain of our primary suppliers as we receive merchandise in December through March, and we pay for merchandise in April through July.\nThe principal external factor affecting our business is weather. Hot weather can increase purchases of chemicals and other non-discretionary products as well as purchases of discretionary products and can drive increased purchases of installation and repair services. Unseasonably cool weather or significant amounts of rainfall during the peak sales season can reduce chemical consumption in pools and spas and decrease consumer purchases of our products and services. In addition, unseasonably early or late warming trends can increase or decrease the length of the pool season and impact timing around pool openings and closings and, therefore, our total sales and timing of our sales.\nWe generally open new locations before our peak selling season begins and we generally close locations after our peak selling season ends. We expect that our quarterly results of operations will fluctuate depending on the timing and amount of sales contributed by new locations.\nLiquidity and Capital Resources\nOverview\nOur primary sources of liquidity are net cash provided by operating activities and borrowing availability under our Revolving Credit Facility. Historically, we have funded working capital requirements, capital expenditures, payments related to acquisitions, debt service requirements, and repurchases of shares of our common stock with internally generated cash on hand and through our Revolving Credit Facility.\nCash and cash equivalents consist primarily of cash on deposit with banks. Cash and cash equivalents totaled $55.4 million and $112.3 million as of September 30, 2023 and October 1, 2022, respectively. As of September 30, 2023 and October 1, 2022, we did not have any outstanding borrowings under our Revolving Credit Facility.\nOur primary working capital requirements are for the purchase of inventory, payroll, rent, other facility costs, distribution costs, and general and administrative costs. Our working capital requirements fluctuate during the year, driven primarily by seasonality and the timing of inventory purchases.\nOur capital expenditures are primarily related to infrastructure-related investments, including investments related to upgrading and maintaining our information technology systems, ongoing location improvements, expenditures related to our distribution centers, and new location openings. We expect to fund capital expenditures from net cash provided by operating activities.\nBased on our growth plans, we believe our cash and cash equivalents position, net cash provided by operating activities and borrowing availability under our Revolving Credit Facility will be adequate to finance our working capital requirements, planned capital expenditures, strategic acquisitions, share repurchases, and debt service over the next 12 months. If cash provided by operating activities and borrowings under our Revolving Credit Facility are not sufficient or available to meet our capital requirements, then we may need to obtain additional equity or debt financing. There can be no assurance that equity or debt financing will be available to us if we need it or, if available, whether the terms will be satisfactory to us.\nAs of September 30, 2023, outstanding standby letters of credit totaled $11.4 million, and after considering borrowing base restrictions, we had $238.6 million of available borrowing capacity under the terms of the Revolving Credit Facility. As of September 30, 2023, we were in compliance with the covenants under the Revolving Credit Facility and our Term Loan agreements.\nSummary of Cash Flows\nA summary of our cash flows from operating, investing, and financing activities is presented in the following table (in thousands):\nYear Ended\nSeptember 30, 2023\nOctober 1, 2022\nOctober 2, 2021\nNet cash provided by operating activities\n$\n6,470\n$\n66,644\n$\n169,272\nNet cash used in investing activities\n(52,539\n)\n(138,981\n)\n(35,355\n)\nNet cash (used in) provided by financing activities\n(10,804\n)\n(158,868\n)\n53,780\nNet (decrease) increase in cash and cash equivalents\n$\n(56,873\n)\n$\n(231,205\n)\n$\n187,697\nCash Provided by Operating Activities\nNet cash provided by operating activities was $6.5 million in fiscal 2023 compared to $66.6 million in fiscal 2022. This decrease was primarily driven by lower net income in the current year and changes in working capital.\nNet cash provided by operating activities decreased to $66.6 million in fiscal 2022 compared to $169.3 million in fiscal 2021. This decrease was primarily driven by changes in working capital related to business acquisitions and strategic investment in product inventories to meet heightened customer demand across product categories.\nCash Used in Investing Activities\nNet cash used in investing activities was $52.5 million in fiscal 2023 compared to $139.0 million in fiscal 2022. This decrease was driven by lower investments for business acquisitions.\nNet cash used in investing activities was $139.0 million in fiscal 2022 compared to $35.4 million in fiscal 2021. This increase was primarily driven by higher investments for business acquisitions.\nCash (Used in) Provided by Financing Activities\nNet cash used in financing activities was $10.8 million in fiscal 2023 compared to $158.9 million in fiscal 2022. This decrease was primarily driven by repurchases and retirement of common stock that occurred in fiscal 2022.\nNet cash used in financing activities was $158.9 million in fiscal 2022 and was primarily related to the repurchase and retirement of common stock of $152.1 million. Net cash provided by financing activities was $53.8 million in fiscal 2021 and was primarily related to net proceeds raised during our IPO in November 2020 of $458.6 million, partially offset by a $396.1 million repayment of long-term debt.\nShare Repurchase Program\nOn December 3, 2021, the board of directors authorized a share repurchase program for up to an aggregate of $300 million of the Companys outstanding shares of common stock over a period of three years, expiring December 31, 2024. As of September 30, 2023, approximately $147.7 million remained available for future purchases under our share repurchase program (see Note 16-Share Repurchase Program to our consolidated financial statements included elsewhere in this Annual Report on Form 10-K).\nContractual Obligations and Other Commitments\nThe following table summarizes our contractual cash obligations as of September 30, 2023 (in thousands):\nPayments Due By Period\nTotal\nThereafter\nLong-term debt, net (1)\n$\n789,750\n$\n6,075\n$\n10,125\n$\n8,100\n$\n8,100\n$\n757,350\n$\n-\nPurchase commitments (2)\n174,018\n79,941\n78,327\n7,838\n5,705\n2,207\n-\nOperating lease obligations (3)\n306,281\n76,361\n70,356\n61,616\n41,139\n22,036\n34,773\nTotal\n$\n1,270,049\n$\n162,377\n$\n158,808\n$\n77,554\n$\n54,944\n$\n781,593\n$\n34,773\n(1)We are required to pay a commitment fee of 0.25% based on the unused portion of the Revolving Credit Facility, which is not included in the table above due to the unknown nature of future borrowings.\n(2)Purchase obligations include all legally binding contracts and primarily relate to firm commitments for inventory purchases. Purchase orders that are not binding agreements are excluded from the table above.\n(3)Operating lease obligations relate to our locations, office, distribution, and manufacturing facilities. We are obligated to make cash payments in connection with various lease obligations and purchase commitments and all obligations require cash payments to be made by us over varying periods of time. Certain leases are renewable at our option typically for periods of five or more years and some require payments upon early termination.\nCritical Accounting Estimates\nThe preparation of our consolidated financial statements in accordance with GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, disclosures of contingent assets and liabilities at the date of the financial statements, and the reported amounts of sales and expenses during the reported periods. The SEC has defined a companys critical accounting policies as the ones that are most important to the portrayal of a companys financial condition and results of operations, and which require a company to make its most difficult and subjective judgments. Based on this definition, we have identified the critical accounting policies and judgments, which are disclosed in this Annual Report on Form 10-K for the fiscal year ended September 30, 2023. We base these estimates on historical results and various other assumptions we believe to be reasonable, all of which form the basis for making estimates concerning the carrying values of assets and liabilities that are not readily available from other sources. Actual results may differ from these estimates.\nVendor Rebates\nMany of our vendor arrangements provide for us to receive specified amounts of consideration when we achieve various measures. These measures generally relate to the volume level of purchases. We calculate the amount earned based on actual purchases, recorded as a reduction of the prices of the vendors products and therefore a reduction of inventory at the end of each period based on a detailed analysis of inventory and of the facts and circumstances of various contractual agreements with vendors. We recognize rebates based on an estimated recognition pattern using historical data, and we record this as a reduction of cost of merchandise and services sold in our consolidated statements of operations. We do not believe there is a reasonable likelihood there will be a material change in the future estimates or assumptions we use to calculate our reduction of inventory.\nInventories\nInventories are stated at the lower of cost or market or net realizable value. We value inventory using the weighted-average cost method. We evaluate inventory for excess and obsolescence and record necessary reserves. We provide provisions for losses related to inventories based on managements judgement regarding historical purchase cost, selling price, margin, and current business trends. If actual demand or market conditions are different than those projected by management, future margins may be unfavorably or favorably affected by adjustments to these estimates. When an inventory item is sold or disposed, the associated reserve is released at that time. We do not believe there is a reasonable likelihood that there will be a material change in the future estimates or assumptions used to calculate our inventory reserve.\nBusiness Combinations\nWe account for business combinations using the acquisition method of accounting. This method requires that the purchase price of the acquisition be allocated to the assets acquired and liabilities assumed using the fair values determined by management as of the acquisition date. The excess of the purchase price over the amounts allocated to assets acquired and liabilities assumed is recorded as goodwill.\nThe accounting for business combinations requires us to make estimates and assumptions at the acquisition date with respect to the fair value of assets acquired and liabilities assumed as well as the useful lives of those acquired intangible assets. Critical estimates in valuing certain of the intangible assets and goodwill we have acquired include but are not limited to; future expected cash flows, historical and expected customer attribution rates and royalty and discount rates. Unanticipated events and circumstances may occur that may affect the accuracy or validity of such assumptions, estimates or actual results.\nIn addition, the consideration for an acquisition may include future payments that are contingent upon the occurrence of a particular event. We record a contingent consideration at fair value on the acquisition date. We estimate the fair values through valuation models that incorporate probability adjusted assumptions related to the achievement of the milestones and the likelihood of making related payments. The fair value is remeasured at the end of each period and changes in fair value are recorded in within SG&A in the consolidated statements of operations. Determining the fair value of the contingent consideration requires management to make assumptions and judgments. We do not believe there is a reasonable likelihood that there will be a material change in the future estimates or assumptions used to calculate the values of our acquired intangible assets contingent considerations liabilities.\nRecent Accounting Pronouncements\nFor information regarding recent accounting pronouncements, see Note 2-Summary of Significant Accounting Policies to our consolidated financial statements included elsewhere in this Annual Report on Form 10-K. Item 7A. Quantitative and Qualitative Disclosures About Market Risk.\nInterest Rate Risk\nThe interest rates on borrowings under our Revolving Credit Facility and Term Loan were LIBOR-based rates prior to March 2023 and June 2023, respectively. Due to the discontinuation of LIBOR-based rates, we have transitioned the impacted interest rate benchmarks to Term SOFR-based rates. See Note 10-Long-Term Debt, Net to our consolidated financial statements for additional information. Accordingly, we are subject to interest rate risk in connection with borrowings under our Revolving Credit Facility and Term Loan, both of which bear interest at variable rates. As of September 30, 2023, we had $789.8 million outstanding on our Term Loan. No amounts were outstanding on our Revolving Credit Facility as of such date. The impact of a 1.0% rate change on our outstanding balance less contractual amortization would total approximately $7.9 million over the next 12 months.\nImpact of Inflation and Deflation\nWe experience inflation and deflation related to our purchase of certain products. This price volatility could potentially have a material impact on our financial condition and/or our results of operations. We actively manage the impact of inflation, including tariffs, through strong relationships with our diverse supplier base, vendor negotiation, and promotion management. We also strategically invest through inventory purchases in order to obtain favorable pricing ahead of any vendor price increases. In order to mitigate price volatility, we monitor price fluctuations and may adjust our selling prices accordingly; however, our ability to recover higher costs through increased pricing may be limited by the competitive environment in which we operate. Although we may experience periodic effects on sales, gross profit, gross margins, and cash flows as a result of changing prices, we do not expect the effect of inflation or deflation to have a material impact on our ability to execute our long-term business strategy. We currently do not use derivative instruments to manage these risks. Item 8. Financial Statements and Supplementary Data.\nLESLIES, INC.\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\nAudited Consolidated Financial Statements for the fiscal years ended September 30, 2023, October 1, 2022, and October 2, 2021\nPage\nReport of Independent Registered Public Accounting Firm (PCAOB ID: 42)\nConsolidated Balance Sheets\nConsolidated Statements of Operations\nConsolidated Statements of Stockholders Deficit\nConsolidated Statements of Cash Flow\nNotes to Consolidated Financial Statements\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and the Board of Directors of Leslies, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Leslies, Inc. (the Company) as of September 30, 2023 and October 1, 2022, and the related consolidated statements of operations, stockholders deficit, and cash flows for each of the three years in the period ended September 30, 2023, and the related notes (collectively referred to as the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at September 30, 2023 and October 1, 2022, and the results of its operations and its cash flows for each of the three years in the period ended September 30, 2023, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Companys internal control over financial reporting as of September 30, 2023, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) and our report dated November 29, 2023 expressed an adverse opinion thereon.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nVendor Rebates\nDescription of the Matter\nAs discussed in Note 2, certain of the Companys arrangements with vendors provide for consideration, such consideration is generally based on purchase volume. The Company generally accounts for vendor rebate programs as a reduction of the prices of the vendors products and therefore a reduction of the cost of inventory. The Company estimates the recognition pattern of vendor rebate income based on historical trending and data and recognizes such consideration as a reduction of cost of merchandise and services sold. The Company had $4.7 million of vendor rebate receivables as of September 30, 2023.\nAuditing vendor rebates was challenging due to the extent of audit effort required resulting from the volume of individual transactions and complexities in evaluating the Companys compliance with the terms of the vendor agreements.\nHow we Addressed the Matter in Our Audit\nTo test the vendor rebates, we performed audit procedures that included, among others, assessing the estimation methodology used by management. We tested a sample of vendor rebate agreements by evaluating the inputs used and the terms of the contracts. We recalculated the amount of vendor rebate income earned and the related reduction of the carrying cost of inventory based on the inputs and the terms of the agreements. We tested the Companys pattern of recognition of vendor rebate income as a reduction of cost of merchandise and services sold and tested deferred rebate income for appropriateness and consistency with authoritative accounting guidance. We also performed sensitivity analyses over the historical time period used in part to determine the recognition pattern of vendor rebate income, to evaluate the significance of changes that would result from changes in the assumption used. In addition, we selected a sample of vendor rebate receivables and confirmed the amount outstanding directly with the vendors.\n/s/ Ernst & Young LLP\nWe have served as the Companys auditor since 2000.\nPhoenix, Arizona\nNovember 29, 2023\nLESLIES, INC.\nConsolidated Balance Sheets\n(Amounts in Thousands, Except Share and Per Share Amounts)\nSeptember 30, 2023\nOctober 1, 2022\nAssets\nCurrent assets\nCash and cash equivalents\n$\n55,420\n$\n112,293\nAccounts and other receivables, net\n29,396\n45,295\nInventories\n311,837\n361,686\nPrepaid expenses and other current assets\n23,633\n23,104\nTotal current assets\n420,286\n542,378\nProperty and equipment, net\n90,285\n78,087\nOperating lease right-of-use assets\n251,460\n236,477\nGoodwill and other intangibles, net\n218,855\n213,701\nDeferred tax assets\n7,598\n1,268\nOther assets\n45,951\n37,720\nTotal assets\n$\n1,034,435\n$\n1,109,631\nLiabilities and stockholders deficit\nCurrent liabilities\nAccounts payable and accrued expenses\n$\n149,154\n$\n266,972\nOperating lease liabilities\n62,794\n60,373\nIncome taxes payable\n5,782\n12,511\nCurrent portion of long-term debt\n8,100\n8,100\nTotal current liabilities\n225,830\n347,956\nOperating lease liabilities, noncurrent\n193,222\n179,835\nLong-term debt, net\n773,276\n779,726\nOther long-term liabilities\n3,469\nTotal liabilities\n1,195,797\n1,307,582\nCommitments and contingencies\nStockholders deficit\nCommon stock, $0.001 par value, 1,000,000,000 shares authorized and 184,333,670 and 183,480,545 issued and outstanding as of September 30, 2023 and October 1, 2022, respectively.\nAdditional paid in capital\n99,280\n89,934\nRetained deficit\n(260,826\n)\n(288,068\n)\nTotal stockholders deficit\n(161,362\n)\n(197,951\n)\nTotal liabilities and stockholders deficit\n$\n1,034,435\n$\n1,109,631\nSee accompanying notes which are an integral part of these consolidated financial statements.\nLESLIES, INC.\nConsolidated Statements of Operations\n(Amounts in Thousands, Except Per Share Amounts)\nYear Ended\nSeptember 30, 2023\nOctober 1, 2022\nOctober 2, 2021\nSales\n$\n1,451,209\n$\n1,562,120\n$\n1,342,917\nCost of merchandise and services sold\n902,986\n888,379\n747,757\nGross profit\n548,223\n673,741\n595,160\nSelling, general and administrative expenses\n446,044\n434,987\n386,075\nOperating income\n102,179\n238,754\n209,085\nOther expense:\nInterest expense\n65,438\n30,240\n34,410\nLoss on debt extinguishment\n-\n-\n9,169\nOther expenses, net\n-\n2,377\nTotal other expense\n65,438\n30,637\n45,956\nIncome before taxes\n36,741\n208,117\n163,129\nIncome tax expense\n9,499\n49,088\n36,495\nNet income\n$\n27,242\n$\n159,029\n$\n126,634\nEarnings per share:\nBasic\n$\n0.15\n$\n0.86\n$\n0.68\nDiluted\n$\n0.15\n$\n0.85\n$\n0.67\nWeighted average shares outstanding:\nBasic\n183,839\n184,347\n185,412\nDiluted\n184,716\n186,148\n190,009\nSee accompanying notes which are an integral part of these consolidated financial statements.\nLESLIES, INC.\nConsolidated Statements of Stockholders Deficit\n(Amounts in Thousands)\nCommon Stock\nAdditional\nPaid in\nCapital\nRetained\nTotal\nStockholders\nShares\nAmount\n(Deficit)\nDeficit\nDeficit\nBalance, October 3, 2020\n156,500\n$\n$\n(278,063\n)\n$\n(549,093\n)\n$\n(826,999\n)\nIssuance of common stock upon initial public offering, net of offering costs\n30,000\n458,557\n-\n458,587\nIssuance of common stock under the Plan\n3,321\n-\n-\nEquity-based compensation\n-\n-\n24,217\n-\n24,217\nNet income\n-\n-\n-\n126,634\n126,634\nBalance, October 2, 2021\n189,821\n$\n$\n204,711\n$\n(422,459\n)\n$\n(217,558\n)\nIssuance of common stock under the Plan\n1,160\n1,377\n-\n1,378\nEquity-based compensation\n-\n-\n11,346\n-\n11,346\nRepurchase and retirement of common stock\n(7,500\n)\n(8\n)\n(127,500\n)\n(24,638\n)\n(152,146\n)\nNet income\n-\n-\n-\n159,029\n159,029\nBalance, October 1, 2022\n183,481\n$\n$\n89,934\n$\n(288,068\n)\n$\n(197,951\n)\nIssuance of common stock under the Plan\n1,057\n-\n-\nEquity-based compensation\n-\n-\n11,703\n-\n11,703\nRestricted stock units surrendered in lieu of withholding taxes\n(204\n)\n-\n(2,357\n)\n-\n(2,357\n)\nNet income\n-\n-\n-\n27,242\n27,242\nBalance, September 30, 2023\n184,334\n$\n$\n99,280\n$\n(260,826\n)\n$\n(161,362\n)\nSee accompanying notes which are an integral part of these consolidated financial statements.\nLESLIES, INC.\nConsolidated Statements of Cash Flows\n(Amounts in Thousands)\nYear Ended\nSeptember 30, 2023\nOctober 1, 2022\nOctober 2, 2021\nOperating Activities\nNet income\n$\n27,242\n$\n159,029\n$\n126,634\nAdjustments to reconcile net income to net cash provided by operating activities:\nDepreciation and amortization\n34,142\n30,769\n26,553\nEquity-based compensation\n11,703\n11,346\n24,217\nAmortization of deferred financing costs and debt discounts\n2,100\n1,982\n2,483\nProvision for doubtful accounts\n1,186\n2,105\nDeferred income taxes\n(6,330\n)\n2,466\n2,848\nLoss (gain) on asset dispositions\n6,396\n(1,606\n)\nLoss on debt extinguishment\n-\n-\n9,169\nChanges in operating assets and liabilities:\nAccounts and other receivables\n16,101\n(7,621\n)\n(9,484\n)\nInventories\n54,331\n(143,147\n)\n(47,787\n)\nPrepaid expenses and other current assets\n(3,466\n)\n(1,476\n)\n2,674\nOther assets\n(9,990\n)\n(12,670\n)\n(11,164\n)\nAccounts payable and accrued expenses\n(120,048\n)\n23,841\n35,756\nIncome taxes payable\n(6,729\n)\n5,566\n5,088\nOperating lease assets and liabilities, net\n(5,093\n)\n1,786\nNet cash provided by operating activities\n6,470\n66,644\n169,272\nInvesting Activities\nPurchases of property and equipment\n(38,577\n)\n(31,726\n)\n(28,931\n)\nBusiness acquisitions, net of cash acquired\n(15,549\n)\n(107,663\n)\n(8,868\n)\nProceeds from asset dispositions\n1,587\n2,444\nNet cash used in investing activities\n(52,539\n)\n(138,981\n)\n(35,355\n)\nFinancing Activities\nBorrowings on Revolving Credit Facility\n264,000\n45,000\n-\nPayments on Revolving Credit Facility\n(264,000\n)\n(45,000\n)\n-\nRepayment of long-term debt\n(8,100\n)\n(8,100\n)\n(396,135\n)\nIssuance of long-term debt\n-\n-\nPayment of deferred financing costs\n(347\n)\n-\n(9,579\n)\nProceeds from options exercised\n-\n1,378\n-\nRepurchase and retirement of common stock\n-\n(152,146\n)\n-\nProceeds from issuance of common stock upon initial public offering, net\n-\n-\n458,587\nPayments of employee tax withholdings related to restricted stock vesting\n(2,357\n)\n-\n-\nNet cash (used in) provided by financing activities\n(10,804\n)\n(158,868\n)\n53,780\nNet (decrease) increase in cash and cash equivalents\n(56,873\n)\n(231,205\n)\n187,697\nCash and cash equivalents, beginning of year\n112,293\n343,498\n155,801\nCash and cash equivalents, end of year\n$\n55,420\n$\n112,293\n$\n343,498\nSupplemental Information:\nInterest\n$\n63,059\n$\n32,617\n$\n36,408\nIncome taxes, net of refunds received\n22,559\n41,149\n28,559\nSee accompanying notes which are an integral part of these consolidated financial statements.\nLESLIES, INC.\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nNote 1-Business and Operations\nLeslies, Inc. (Leslies, we, our, us, its, or the Company) is the leading direct-to-consumer pool and spa care brand. We market and sell pool and spa supplies and related products and services, which primarily consist of maintenance items such as chemicals, equipment and parts, and cleaning accessories, as well as safety, recreational, and fitness-related products. We currently market our products through over 1,000 company-operated locations in 39 states and e-commerce websites.\nNote 2-Summary of Significant Accounting Policies\nBasis of Presentation and Principles of Consolidation\nWe prepared the accompanying consolidated financial statements following GAAP. The financial statements include all normal and recurring adjustments that are necessary for a fair presentation of our financial position and operating results. The consolidated financial statements include the accounts of Leslies, Inc. and our subsidiaries. All significant intercompany accounts and transactions have been eliminated.\nFiscal Periods\nWe operate on a fiscal calendar that results in a fiscal year consisting of a 52- or 53-week period ending on the Saturday closest to September 30th. In a 52-week fiscal year, each quarter contains 13 weeks of operations; in a 53-week fiscal year, each of the first, second and third quarters includes 13 weeks of operations and the fourth quarter includes 14 weeks of operations. References to fiscal 2023, 2022, and 2021 refer to the 52 weeks ended September 30, 2023, October 1, 2022, and October 2, 2021, respectively.\nSegment Reporting\nOur Chief Operating Decision Maker is our Chief Executive Officer, who reviews financial information presented on a consolidated basis for purposes of allocating resources and assessing performance. We operate all of our locations in the United States and offer consumers similar products, services, and methods of distribution through our retail locations and e-commerce websites. As a result, we have a single reportable segment.\nSeasonality\nOur business is highly seasonal. Sales and earnings are highest during our third and fourth fiscal quarters, being April through September, which represent the peak months of swimming pool use. Sales are substantially lower during our first and second fiscal quarters.\nUse of Estimates\nManagement is required to make certain estimates and assumptions during the preparation of the consolidated financial statements in accordance with GAAP. These estimates and assumptions impact the reported amount of assets and liabilities and disclosures of contingent assets and liabilities as of the date of the consolidated financial statements. They also impact the reported amount of net income (loss) during any period. Actual results could differ from those estimates.\nSignificant estimates underlying the accompanying consolidated financial statements include inventory reserves, lease assumptions, vendor rebate programs, our loyalty program, the determination of income taxes payable and deferred income taxes, sales returns reserve, self-insurance liabilities, the recoverability of intangible assets and goodwill, fair value of assets acquired in a business combination, and contingent consideration related to business combinations.\nCash and Cash Equivalents\nCash and cash equivalents include cash on hand, demand deposits, money market funds and credit and debit card transactions. Our cash balance at financial institutions may exceed the FDIC insurance coverage limit. We consider all investments with an original maturity of three months or less and money market funds to be cash equivalents. All credit card and debit card transactions that process in less than seven days are classified as cash and cash equivalents.\nFair Value Measurements\nWe use fair value measurements to record the fair value of certain assets and to estimate the fair value of financial instruments not recorded at fair value but required to be disclosed at fair value.\nTo determine the fair value, we maximize the use of observable inputs and minimize the use of unobservable inputs by requiring that the most observable inputs be used when available. Observable inputs are inputs market participants would use to value an asset or liability and are developed based on market data obtained from independent sources. Unobservable inputs are inputs based on assumptions about the factors market participants would use to value an asset or liability.\nThe fair value hierarchy is as follows, of which the first two are considered observable and the last unobservable:\nLevel 1-Quoted prices in active markets for identical assets or liabilities.\nLevel 2-Inputs other than Level 1 that are observable for the asset or liability, either directly or indirectly, such as quoted prices for similar assets and liabilities in active markets; quoted prices for identical or similar assets or liabilities in markets that are not active; or other inputs that are observable or can be corroborated by observable market data by correlation or other means.\nLevel 3-Unobservable inputs that are supported by little or no market activity and that are significant to the fair value of the assets or liabilities. Value is determined using pricing models, discounted cash flow methodologies, or similar techniques and also includes instruments for which the determination of fair value requires significant judgment or estimation.\nAs of September 30, 2023 and October 1, 2022, we held no assets that were required to be measured at fair value on a recurring basis. There were no transfers between levels in the fair value hierarchy during fiscal 2023, 2022, and 2021, respectively.\nThe fair value of our Amended and Restated Term Loan Credit Agreement (Term Loan) due in 2028 was determined to be $774.9 million and $760.0 million as of September 30, 2023 and October 1, 2022, respectively. These fair value estimates, determined to be Level 2, are subjective in nature and involve uncertainties and matters of judgment and therefore cannot be determined with precision. Changes in assumptions could significantly affect these estimates.\nThe Companys measurement of contingent consideration is categorized as Level 3 within the fair value hierarchy. Refer to Business Combinations herein Note 2-Summary of Significant Accounting Policies below for the fair value measurement of its contingent consideration.\nThe carrying amounts of cash, cash equivalents, accounts receivable, accounts payable and accrued expenses approximate fair value due to the short-term maturity of these instruments.\nVendor Rebates\nMany of our vendor arrangements provide for us to receive specified amounts of consideration when we achieve various measures. These measures generally relate to the volume level of purchases. We calculate the amount earned based on actual purchases, recorded as a reduction of the prices of the vendors products and therefore a reduction of inventory at the end of each period based on a detailed analysis of inventory and of the facts and circumstances of various contractual agreements with vendors. We recognize rebates based on an estimated recognition pattern using historical data, and we record this as a reduction of cost of merchandise and services sold in our consolidated statements of operations. Accounts and other receivables include vendor rebate receivables of $4.7 million and $16.6 million as of September 30, 2023 and October 1, 2022, respectively.\nAllowance for Doubtful Accounts\nAllowance for doubtful accounts is calculated based on historical experience, counterparty credit risk, consumer credit risk and application of the specific identification method.\nInventories\nInventories are stated at the lower of cost or market or net realizable value. We value inventory using the weighted-average cost method. We evaluate inventory for excess and obsolescence and record necessary reserves. We provide provisions for losses related to inventories based on managements judgment regarding historical purchase cost, selling price, margin, movements, and current business trends. If actual demand or market conditions are different than those projected by management, future margins may be unfavorably or favorably affected by adjustments to these estimates. When an inventory item is sold or disposed, the associated reserve is released at that time.\nBusiness Combinations\nWe account for business combinations using the acquisition method of accounting. This method requires that the purchase price of the acquisition be allocated to the assets acquired and liabilities assumed using the fair values determined by management as of the acquisition date. The excess of the purchase price over the amounts allocated to assets acquired and liabilities assumed is recorded as goodwill.\nWe use our best estimates and assumptions as part of the purchase price allocation process to accurately value assets acquired and liabilities assumed as of the acquisition date. Our estimates are inherently uncertain and subject to refinement. As a result, during the measurement period, which may be up to one year from the acquisition date, we record adjustments to the assets acquired and liabilities assumed, with the corresponding offset to goodwill to the extent we identify adjustments to the preliminary purchase price allocation. Upon the conclusion of the measurement period or final determination of the fair values of the assets acquired or liabilities assumed, whichever comes first, any subsequent adjustments are recorded in our consolidated statements of operations. Our consolidated financial statements include the results of operations from the date of acquisition for each business combination.\nThe consideration for an acquisition may include future payments that are contingent upon the occurrence of a particular event. We record contingent consideration at fair value on the acquisition date. We estimate the fair values through valuation models that incorporate probability adjusted assumptions related to the achievement of the milestones and the likelihood of making related payments. The fair value is remeasured at each reporting date and changes in fair value are recorded within SG&A in our consolidated statements of operations. Determining the fair value of the contingent consideration requires management to make certain assumptions and judgments, primarily based on the achievement of certain performance metrics specified in the purchase agreements.\nWe expense all acquisition-related costs as incurred within SG&A expenses in our consolidated statements of operations.\nProperty and Equipment, Net\nProperty and equipment are stated at cost, less accumulated depreciation and amortization. Costs of normal maintenance and repairs are charged to expense as incurred. Major replacements or improvements of property and equipment are capitalized. When items are sold or otherwise disposed of, the cost and related accumulated depreciation or amortization are removed from the accounts, and any resulting gain or loss is included in our consolidated statements of operations.\nDepreciation and amortization are computed using the straight-line method. These charges are based on the following range of useful lives:\nBuilding and improvements\n5-39 years\nVehicles, machinery and equipment\n3-10 years\nOffice furniture, computers and software\n3-7 years\nLeasehold improvements\n5-10 years, not to exceed the lease life\nWe evaluate our long-lived assets for potential impairment whenever events or changes in circumstances indicate that the carrying amount of an asset group may not be recoverable. The evaluation for long-lived assets (asset group) is performed at the lowest level of identifiable cash flows, which, for location assets, is the individual location level. The assets of a physical location with indicators of impairment are evaluated for recoverability by comparing its undiscounted future cash flows with its carrying value. If the carrying value is greater than the undiscounted future cash flows, we then measure the assets fair value to determine whether an impairment loss should be recognized. If the resulting fair value is less than the carrying value, an impairment loss is recognized for the difference between the carrying value and the estimated fair value. Impairment charges are recorded in SG&A in our consolidated statements of operations. There was no impairment charge in fiscal 2023, 2022, or 2021.\nCloud Computing Arrangements\nFrom time-to-time, we enter into various agreements with unaffiliated third parties for assistance with technical development work related to our security-related software and systems and other ongoing projects. Expenditures for implementation, set-up, and other upfront costs incurred in a cloud computing arrangement that is hosted by the vendor are capitalized generally in the same manner as internal use software and are recorded as other assets in our consolidated balance sheets. Such costs are amortized over the life of the related cloud computing arrangement. As of September 30, 2023 and October 1, 2022, approximately $5.9 million and $9.7 million associated with these agreements are included in prepaid expenses and other current assets in our consolidated balance sheets, respectively. Approximately $44.1 million and $35.7 million associated with these agreements are included in other assets in our consolidated balance sheets as of September 30, 2023 and October 1, 2022, respectively. In addition, for the year ended September 30, 2023, the Company recognized $6.3 million of expense in connection with the discontinued use of certain software subscriptions which is recorded in SG&A in our consolidated statements of operations and a corresponding $4.4 million liability for future obligations associated with these subscriptions.\nGoodwill and Other Intangibles, Net\nGoodwill and intangible assets are recorded at their estimated fair values at the date of acquisition. We review goodwill and indefinite-lived intangible assets for impairment annually (in the fourth quarter) or more frequently if impairment indicators arise. Goodwill can be evaluated for impairment, at our option, by first performing a qualitative assessment to determine whether a quantitative goodwill test is necessary. If it is determined, based on qualitative factors, the fair value of the reporting unit may be more likely than not less than the carrying amount, a quantitative goodwill impairment test would be required. Additionally, we can elect to forgo a qualitative assessment and perform a quantitative test. The quantitative test is to identify if a potential impairment exists by comparing the fair value of a reporting unit with its carrying amount, including goodwill. If the carrying amount of the reporting unit exceeds the fair value, an impairment loss is recognized in an amount equal to that excess, not to exceed the carrying amount of goodwill.\nIf a quantitative test is performed, we would estimate the value considering the use of various valuation techniques which may use significant unobservable inputs, or Level 3 inputs, as defined by the fair value hierarchy. We include assumptions about sales growth, operating margins, discount rates and valuations multiples which consider our budgets, business plans, economic projections and marketplace data, and are believed to reflect market participant views which would exist in an exit transaction. Some of the inherent estimates and assumptions used in this analysis are outside the control of management, including cost of capital, tax rates and market EBITDA comparables.\nFinite-lived intangible assets are amortized to reflect the pattern of economic benefits consumed. We evaluate amortizable intangible assets for potential impairment whenever events or changes in circumstances indicate that the carrying amounts of the assets may not be fully recoverable. Intangible assets useful lives are reviewed annually.\nFor our indefinite life intangible assets, a qualitative assessment can also be performed to determine whether the existence of events and circumstances indicates it is more likely than not the intangible asset is impaired. Similar to goodwill, we can also elect to forgo a qualitative test for indefinite life intangible assets and perform a quantitative test. Upon performing the quantitative test, if the carrying value of the intangible asset exceeds its fair value, an impairment loss is recognized in an amount equal to that excess. We evaluate whether certain trade names continue to have an indefinite life annually.\nAfter we made our assessments, it was determined that there was no impairment related to goodwill or other intangible assets during fiscal 2023, 2022, and 2021.\nLeases\nWe enter into contractual arrangements for the utilization of certain non-owned assets which are evaluated as finance or operating leases upon commencement and are accounted for accordingly. Specifically, a contract is or contains a lease when (1) the contract contains an explicitly or implicitly identified asset and (2) we obtain substantially all of the economic benefits from the use of that underlying asset and direct how and for what purpose the asset is used during the term of the contract in exchange for consideration. We assess whether an arrangement is or contains a lease at inception of the contract.\nWe lease certain retail locations, warehouse and distribution space, office space, equipment, and vehicles. A substantial majority of our leases have an initial lease term of five years, typically with the option to extend the lease for at least one additional five-year term. Some of our leases may include the option to terminate in less than five years. The lease term used to calculate the right-of-use asset and lease liability at commencement includes the impacts of options to extend or terminate the lease when it is reasonably certain that we will exercise that option. When determining whether it is reasonably certain that we will exercise an option at commencement, we consider various existing economic factors, including market conditions, real estate strategies, the nature, length, and terms of the agreement, as well as the uncertainty of the condition of leased equipment at the end of the lease term. Based on these considerations, we generally conclude that the exercise of renewal options would not be reasonably certain in calculating our operating lease liability at commencement. The discount rate used to calculate the present value of lease payments is the rate implicit in the lease, when readily determinable. As the rate implicit in the lease is rarely readily determinable, we use a secured incremental borrowing rate, which is updated on a periodic basis as the discount rate for the present value of lease payments. Real estate taxes, insurance, maintenance, and operating expenses applicable to the leased property are generally our obligations under our lease agreements. In instances where these payments are fixed, they are included in the measurement of our lease liabilities, and when variable, are excluded and recognized in the period in which the obligation for those payments is incurred. For variable payments dependent upon an index or rate, we apply the active index or rate as of the lease commencement date. Variable lease payments not based on an index or rate are not included in the measurement of our operating lease liabilities as they cannot be reasonably estimated and are recognized in the period in which the obligation for those payments is incurred. Leases that have a term of 12 months or less upon commencement are considered short-term in nature and as such are not included in the measurement of our operating lease right-of-use assets and operating lease liabilities on the consolidated balance sheets and are expensed on a straight-line basis over the lease term. In addition, we separate lease and non-lease components (e.g., common area maintenance). Our lease agreements do not contain any material residual value guarantees or material restrictive covenants.\nRevenue Recognition\nRevenue is recognized when control of the promised goods or services is transferred to our customer, in an amount that reflects the consideration we expect to be entitled to in exchange for such goods or services. Revenue from merchandise sales at retail locations is recognized at the point of sale and revenue from services is recognized when the services are rendered. Revenue from e-commerce merchandise sales is recognized either at the time of pick-up at one of our locations or at the time of shipment, depending on the customers order designation. Revenue is recorded net of related discounts, loyalty point deferrals, and sales tax. Payment from retail customers is generally at the point of sale and payment terms for professional pool operators are based on our credit requirements and generally have terms of less than 60 days. When we receive payment from a consumer before the consumer has taken possession of the merchandise or the service has been performed, the amount received is recorded as deferred revenue or as a customer deposit until the sale or service is complete. Shipping and handling are treated as costs to fulfill the contract and not a separate performance obligation.\nWe estimate a liability for sales returns based on current sales levels and historical return trends. At each financial reporting date, we assess our estimates of expected returns, and a corresponding adjustment to cost of sales for our right to recover the goods returned by the customer, net of any expected recovery cost. Adjustments related to changes in return estimates were immaterial in all periods presented.\nOur loyalty program, Pool Perks®, allows members to earn reward points based on their purchases. Once a loyalty member achieves a certain point level, the member earns an award that may be used on future purchases. Points and awards are valid for 12 months from issuance. We defer revenue related to earned points and awards that have not yet been redeemed. The amount of deferred revenue is based on the estimated standalone selling price of points and awards earned by members and reduced by the percentage of points and awards expected to be redeemed. Estimating future redemption rates requires judgment based on current trends and historical patterns. Revenue is recognized when the rewards are redeemed and expired. To the extent we have a change in our breakage estimates, the corresponding amount of change is recognized in revenue. As of September 30, 2023 and October 1, 2022, deferred revenue related to the loyalty program was $5.6 million and $4.6 million, respectively, and is included in accounts payable and accrued expenses in our consolidated balance sheets.\nCost of Merchandise and Services Sold\nCost of merchandise and services sold reflects the direct cost of purchased merchandise, costs to package certain chemical products, including direct materials and labor, costs to provide services, including labor and materials, as well as distribution and occupancy costs. Distribution costs include warehousing and transportation expenses, including costs associated with third-party fulfillment centers. Occupancy costs include the rent, common area maintenance, real estate taxes, and depreciation and amortization costs of all retail locations.\nSelling, General and Administrative Expenses\nOur SG&A includes selling and operating expenses at our retail locations and corporate level general and administrative expenses. Selling and operating expenses at retail locations include payroll, bonus and benefit costs for personnel, supplies, and credit and debit card processing costs. Corporate expenses include payroll, bonus, and benefit costs for our corporate and field support functions, equity-based compensation, marketing and advertising, insurance, utilities, occupancy costs related to our corporate office facilities, professional services, and depreciation and amortization for all assets, except those related to our retail locations and distribution operations, which are included in cost of merchandise and services sold.\nAdvertising\nWe expense advertising costs as incurred. Advertising costs for fiscal 2023, 2022, and 2021 were approximately $35.1 million, $38.0 million, and $25.4 million, respectively.\nIncome Taxes\nWe account for income taxes under the asset and liability method, which requires the recognition of deferred tax assets and liabilities for the future tax consequences attributable to differences between the financial statement carrying amounts and tax bases of existing assets and liabilities. Deferred tax assets, including the benefit of net operating loss and tax credit carryforwards, are evaluated based on the guidelines for realization and are reduced by a valuation allowance if it is deemed more likely than not that such assets will not be realized. We consider several factors in evaluating the realizability of our deferred tax assets, including the nature, frequency and severity of recent losses, the remaining years available for carryforwards, changes in tax laws, the future profitability of the operations in the jurisdiction, and tax planning strategies. Our judgments and estimates concerning realizability of deferred tax assets could change if any of the evaluation factors change, resulting in an increase or decrease to income tax expense in any period.\nThe ultimate realization of deferred tax assets can be dependent upon the generation of future taxable income during the periods in which the associated temporary differences become deductible. On a quarterly basis, we evaluate whether it is more likely than not that our deferred tax assets will be realized in the future and conclude whether a valuation allowance must be established.\nWe record a liability for uncertain tax positions to the extent a tax position taken or expected to be taken in a tax return does not meet certain recognition or measurement criteria. Considerable management judgment is necessary to assess the inherent uncertainties related to the interpretations of complex tax laws, regulations and taxing authority rulings. Our judgments and estimates may change as a result of the evaluation of new information, such as the outcome of tax audits or changes to or further interpretations of tax laws and regulations, resulting in an increase or decrease to income tax expense in any period. Interest and penalties accrued, if any, relating to uncertain tax positions will be recognized as a component of the income tax provision.\nWe determined there were no material uncertain tax positions as of September 30, 2023 and October 1, 2022.\nEquity-Based Compensation\nStock-based compensation expense is measured at grant date, based on the fair value of the award, and is recognized on a straight-line basis over the requisite service period for awards expected to vest. See Note 17-Equity-Based Compensation for further discussion.\nSelf-Insurance Reserves\nWe are self-insured for losses relating to workers compensation, general liability, and employee medical. Stop-loss coverage has been purchased to limit exposure to any material level of claims. Liabilities for self-insurance reserves are estimated based on independent actuarial estimates, which are based on historical information and assumptions about future events. We utilize various techniques, including analysis of historical trends and actuarial valuation methods, to estimate the cost to settle reported claims and claims incurred but not yet reported as of the balance sheet date. The actuarial valuation methods consider loss development factors, which include the development time frame and expected claim reporting and settlement patterns, and expected loss costs, which include the expected frequency and severity of claim activity.\nEarnings per Share\nBasic earnings per share is calculated by dividing net income by the weighted average number of shares outstanding during the period. Dilutive earnings per share is computed giving effect to all potentially dilutive shares, unless their effect is antidilutive. We apply the treasury stock method for dilutive share-based awards. Performance-based share-based awards are included in diluted shares only if the related performance conditions have been considered satisfied as of the end of the reporting period.\nRecent Accounting Pronouncements\nIn March 2020, January 2021 and December 2022, the FASB issued ASU No. 2020-04, 2021-01 and 2022-06, respectively, regarding Reference Rate Reform (collectively Topic 848). This collective guidance was in response to accounting concerns regarding contract modifications and hedge accounting because of rate reform associated with structural risks of interbank offered rates, and particularly, the risk of cessation of the London Inter-Bank Offer Rate (LIBOR) related to regulators in several jurisdictions around the world having undertaken reference rate reform initiatives to identify alternative reference rates. In addition, Topic 848 provided optional expedients and exceptions for applying GAAP to contracts, hedging relationships, and other transactions affected by reference rate reform if certain criteria were met. The guidance was effective upon issuance and may be applied through December 31, 2024, after which entities will no longer be permitted to apply the relief in Topic 848. The primary contracts for which LIBOR were used were our Revolving Credit Facility and Term Loan (as defined in Note 10-Long-Term Debt, Net). The Company transitioned from a LIBOR-based rate to a Term Secured Overnight Financing Rate (Term SOFR)-based rate for our Revolving Credit Facility and Term Loan and elected the optional expedients under the standard as of the first day of the second and third quarters, respectively. This adoption did not have a material impact to our condensed consolidated financial statements.\nNote 3-Business Combinations\nOur consolidated financial statements include the results of operations of these acquisitions from the date of acquisition. The total purchase consideration was allocated to the tangible and intangible assets acquired and the liabilities assumed at their estimated fair values as of each acquisition date, with the excess recorded to goodwill. The goodwill resulting from these acquisitions is expected to be deductible for income tax purposes. During the measurement periods, which will not exceed one year from each closing, we will continue to obtain information to assist us in finalizing the acquisition date fair values. Any qualifying changes to our preliminary estimates will be recorded as adjustments to the respective assets and liabilities, with any residual amounts allocated to goodwill.\nFiscal 2023 Acquisitions\nIn fiscal 2023, we acquired five businesses for an aggregate purchase price of $15.5 million, net of cash acquired. These acquisitions expanded our pool and spa footprint and added 12 new locations across Arizona, California, Florida, and Louisiana. The purchase accounting for these acquisitions has not yet been completed and therefore the purchase price allocations are preliminary.\nTotal\nTotal purchase consideration, net of cash acquired\n$\n15,549\nFair value of assets acquired and liabilities assumed:\nInventories\n4,518\nFinite-lived intangible assets\n2,700\nOther assets and liabilities, net\nTotal assets acquired, net of liabilities assumed\n7,370\nGoodwill\n$\n8,179\nFiscal 2022 Acquisitions\nIn fiscal 2022, we acquired six businesses for an aggregate purchase price of $107.7 million, inclusive of contingent considerations of up to $4.0 million if certain performance metrics are achieved within one to three years of the respective closing dates. Contingent considerations are remeasured to fair value at each reporting period until the contingency is resolved. As of September 30, 2023, the fair value of fiscal 2022 contingent consideration is $3.0 million and is included in accounts payable and accrued expenses in our consolidated balance sheets. These acquisitions expanded our pool and spa footprint and added 27 new locations as well as expanded our manufacturing capabilities. The following table sets forth the purchase price allocation of these acquisitions, net of immaterial measurement period adjustments, in the aggregate (in thousands). The purchase accounting for these acquisitions is complete.\nTotal\nTotal purchase consideration, net of cash acquired\n$\n107,663\nFair value of assets acquired and liabilities assumed:\nInventories\n20,050\nFinite-lived intangible assets\n15,200\nOther assets and liabilities, net\n3,086\nTotal assets acquired, net of liabilities assumed\n38,336\nGoodwill\n$\n69,327\nNote 4-Goodwill and Other Intangibles, Net\nGoodwill\nThe following table details the changes in goodwill (in thousands):\nSeptember 30, 2023\nOctober 1, 2022\nBalance at beginning of the year\n$\n173,513\n$\n101,114\nAcquisitions, net of measurement period adjustments\n7,185\n72,399\nBalance at the end of the year\n$\n180,698\n$\n173,513\nOther Intangible Assets\nOther intangible assets consisted of the following as of September 30, 2023 (in thousands, except weighted average remaining useful life):\nWeighted\nAverage\nRemaining\nUseful Life\n(in Years)\nGross\nCarrying\nValue\nAccumulated\nAmortization\nNet\nCarrying\nAmount\nTrade name and trademarks (finite life)\n9.8\n$\n26,740\n$\n(7,958\n)\n$\n18,782\nTrade name and trademarks (indefinite life)\nIndefinite\n9,350\n-\n9,350\nNon-compete agreements\n5.4\n8,683\n(7,585\n)\n1,098\nConsumer relationships\n7.4\n24,100\n(15,317\n)\n8,783\nOther intangibles\n5.1\n6,620\n(6,476\n)\nTotal\n$\n75,493\n$\n(37,336\n)\n$\n38,157\nOther intangible assets consisted of the following as of October 1, 2022 (in thousands, except weighted average remaining useful life):\nWeighted\nAverage\nRemaining\nUseful Life\n(in Years)\nGross\nCarrying\nValue\nAccumulated\nAmortization\nNet\nCarrying\nAmount\nTrade name and trademarks (finite life)\n11.0\n$\n24,440\n$\n(5,907\n)\n$\n18,533\nTrade name and trademarks (indefinite life)\nIndefinite\n9,350\n-\n9,350\nNon-compete agreements\n6.5\n8,683\n(7,379\n)\n1,304\nConsumer relationships\n7.9\n24,100\n(13,339\n)\n10,761\nOther intangibles\n6.2\n6,620\n(6,380\n)\nTotal\n$\n73,193\n$\n(33,005\n)\n$\n40,188\nOther intangible assets consisted of the following as of October 2, 2021 (in thousands, except weighted average remaining useful life):\nWeighted\nAverage\nRemaining\nUseful Life\n(in Years)\nGross\nCarrying\nValue\nAccumulated\nAmortization\nNet\nCarrying\nAmount\nTrade name and trademarks (finite life)\n6.6\n$\n5,940\n$\n(5,274\n)\n$\nTrade name and trademarks (indefinite life)\nIndefinite\n17,750\n-\n17,750\nNon-compete agreements\n7.5\n8,633\n(7,123\n)\n1,510\nConsumer relationships\n6.4\n19,000\n(11,688\n)\n7,312\nOther intangibles\n7.0\n6,620\n(5,952\n)\nTotal\n$\n57,943\n$\n(30,037\n)\n$\n27,906\nAmortization expense was $4.3 million, $3.0 million, and $2.2 million in fiscal 2023, 2022, and 2021, respectively. No impairment of goodwill or other intangible assets was recorded during fiscal 2023, 2022, and 2021.\nIn fiscal 2022, an $8.4 million indefinite-lived trade name intangible asset was reclassified to a finite-lived intangible asset due to a change in the way the asset will be utilized in the future. Prior to reclassifying the trade name to a finite-lived intangible asset, the Company tested it for impairment and determined that the fair value of the asset exceeded the carrying value. This trade name was assigned a 10-year estimated useful life and will be amortized over its useful life on a prospective basis.\nThe following table summarizes the estimated future amortization expense related to finite-lived intangible assets on our consolidated balance sheet as of September 30, 2023 (in thousands):\nAmount\n$\n3,693\n3,596\n3,350\n3,226\n2,273\nThereafter\n12,669\nTotal\n$\n28,807\nNote 5-Accounts and Other Receivables, Net\nAccounts and other receivables, net consisted of the following (in thousands):\nSeptember 30, 2023\nOctober 1, 2022\nVendor and other rebates receivable\n$\n6,818\n$\n24,546\nCustomer receivables\n18,334\n17,708\nOther receivables\n5,900\n4,553\nAllowance for doubtful accounts\n(1,656\n)\n(1,512\n)\nTotal\n$\n29,396\n$\n45,295\nNote 6-Inventories\nInventories consisted of the following (in thousands):\nSeptember 30, 2023\nOctober 1, 2022\nRaw materials\n$\n3,076\n$\n9,065\nFinished goods\n308,761\n352,621\nTotal\n$\n311,837\n$\n361,686\nChanges in inventory excess and obsolescence reserves were as follows (in thousands):\nAdditions\nDeductions\nBalance at Beginning of Period\nCharged to Costs and Expenses\nSale or Disposal of Inventories\nBalance at\nEnd of Period\nFiscal 2023\n$\n5,871\n$\n4,387\n$\n(3,334\n)\n$\n6,924\nFiscal 2022\n$\n5,856\n$\n$\n(850\n)\n$\n5,871\nFiscal 2021\n$\n4,939\n$\n1,993\n$\n(1,076\n)\n$\n5,856\nNote 7-Prepaid Expenses and Other Current Assets\nPrepaid expenses and other current assets consisted of the following (in thousands):\nSeptember 30, 2023\nOctober 1, 2022\nPrepaid insurance\n$\n1,236\n$\n1,110\nPrepaid occupancy costs\n1,967\n1,840\nPrepaid sales tax\n4,060\n2,874\nPrepaid other\n6,239\n4,847\nOther current assets\n10,131\n12,433\nTotal\n$\n23,633\n$\n23,104\nNote 8-Property and Equipment\nProperty and equipment consist of the following (in thousands):\nSeptember 30, 2023\nOctober 1, 2022\nLand\n$\n5,401\n$\n5,813\nBuildings and improvements\n10,063\n10,135\nVehicles, machinery and equipment\n42,663\n42,394\nLeasehold improvements\n200,968\n187,876\nOffice furniture, computers and software\n178,733\n168,988\nConstruction in process\n12,389\n5,741\n$\n450,217\n$\n420,947\nLess: accumulated depreciation and amortization\n(359,932\n)\n(342,860\n)\nTotal\n$\n90,285\n$\n78,087\nDepreciation and amortization expense on property and equipment was $29.8 million, $27.8 million, and $26.6 million in fiscal 2023, 2022, and 2021, respectively. Construction in process primarily consisted of leasehold improvements related to new or remodeled locations where construction had not been completed by the end of the period and internal use software as of September 30, 2023 and October 1, 2022, respectively.\nCapitalized software additions placed into service were $5.2 million, $6.5 million, and $2.8 million in fiscal 2023, 2022, and 2021, respectively. Capitalized software accumulated amortization totaled approximately $22.0 million and $20.9 million as of September 30, 2023 and October 1, 2022, respectively. Capitalized software and development costs remaining to be amortized were approximately $11.6 million and $7.6 million as of September 30, 2023 and October 1, 2022, respectively.\nNote 9-Accounts Payable and Accrued Expenses\nAccounts payable and accrued expenses consisted of the following (in thousands):\nSeptember 30, 2023\nOctober 1, 2022\nAccounts payable\n$\n58,556\n$\n156,456\nAccrued payroll and employee benefits\n18,558\n34,010\nCustomer deposits\n7,356\n13,250\nInterest\nInventory related accruals\n13,843\n16,034\nLoyalty and deferred revenue\n6,785\n5,541\nSales tax\n9,146\n9,130\nSelf-insurance reserves\n9,138\n9,280\nOther accrued liabilities\n25,191\n22,929\nTotal\n$\n149,154\n$\n266,972\nAs of September 20, 2023, October 1, 2022, and October 2, 2021, approximately $1.5 million, $1.1 million, and $1.5 million of capital expenditures were included in other accrued liabilities, respectively.\nNote 10-Long-Term Debt, Net\nOur long-term debt, net consisted of the following (in thousands, except interest rates):\nEffective\nInterest Rate (1)\nSeptember 30, 2023\nOctober 1, 2022\nTerm Loan\n8.20\n%\n(2)\n$\n789,750\n$\n797,850\nRevolving Credit Facility\n-\n%\n(3)\n-\n-\nTotal long-term debt\n789,750\n797,850\nLess: current portion of long-term debt\n(8,100\n)\n(8,100\n)\nLess: unamortized discount\n(2,316\n)\n(2,805\n)\nLess: deferred financing charges\n(6,058\n)\n(7,219\n)\nTotal long-term debt, net\n$\n773,276\n$\n779,726\n(1)Effective interest rates as of September 30, 2023.\n(2)Carries interest at a specified margin over Term SOFR between 2.50% and 2.75% with a minimum SOFR of 0.50% plus a SOFR adjustment.\n(3)Carries interest at a specific margin between 0.25% and 0.75% with respect to Base Rate loans and between 1.25% and 1.75% with respect to Term SOFR loans, with a SOFR adjustment.\nTerm Loan\nIn June 2023, we entered into Amendment No. 1 (Term Loan Amendment) to our Term Loan. The Term Loan Amendment (i) replaced the existing LIBOR-based interest rate benchmark with a Term SOFR-based benchmark and (ii) amended certain other related terms and provisions, including the addition of a SOFR adjustment of (a) 0.11448% per annum for one-month, (b) 0.26161% per annum for three months, and (c) 0.42826% per annum for six months. The other material terms of the Term Loan remained substantially unchanged.\nThe Term Loan provides for an $810.0 million secured term loan facility with a maturity date of March 9, 2028. Borrowings under the Term Loan have an initial applicable rate, at our option, of (i) 2.75% for loans that are Term SOFR loans and (ii) 1.75% for loans that are ABR loans (the Applicable Rate). The Applicable Rate of the Term Loan is based on our first lien leverage ratio as follows: (a) if the first lien leverage ratio is greater than 2.75 to 1.00, the applicable rate will be 2.75% for Term SOFR loans and 1.75% for ABR loans and (b) if the first lien leverage ratio is less than or equal to 2.75 to 1.00, the applicable rate will be 2.50% for Term SOFR loans and 1.50% for ABR loans. For Term SOFR loans, the loans will bear interest at the Term SOFR-based benchmark rate plus the Applicable Rate and the SOFR adjustment, as defined above.\nRevolving Credit Facility\nIn March 2023, we entered into Amendment No. 6 to our $200.0 million credit facility (Revolving Credit Facility) maturing on August 13, 2025 (the Amendment). The Amendment (i) increased the revolving credit commitments under the Revolving Credit Facility in the amount of $50.0 million, such that the aggregate commitments are $250.0 million and (ii) replaced the existing LIBOR-based rate with a Term SOFR-based rate, as an interest rate benchmark. The Revolving Credit Facility has (i) an applicable margin on Base Rate loans with a range of 0.25% to 0.75%, (ii) an applicable margin on Term SOFR loans with a range of 1.25% and 1.75%, (iii) a SOFR Adjustment of 0.10% for all borrowing periods, (iv) a floor of 0% per annum, and (v) a commitment fee rate of 0.25% per annum. The other material terms of the Revolving Credit Facility prior to the Amendment remained substantially unchanged.\nAs of September 30, 2023 and October 1, 2022, no amounts were outstanding under the Revolving Credit Facility. The amount available under our Revolving Credit Facility was reduced by $11.4 million and $10.0 million of existing standby letters of credit as of September 30, 2023 and October 1, 2022, respectively.\nRepresentations and Covenants\nSubstantially all of our assets are pledged as collateral to secure our indebtedness. The Term Loan does not require us to comply with any financial covenants. The Term Loan and the Revolving Credit Facility contain customary representations and warranties, covenants, and conditions to borrowing. No events of default occurred as of September 30, 2023 and October 1, 2022, respectively.\nFuture Debt Maturities\nThe following table summarizes the debt maturities and scheduled principal repayments of our indebtedness as of September 30, 2023 (in thousands):\nAmount\n$\n6,075\n10,125\n8,100\n8,100\n757,350\nThereafter\n-\nTotal\n$\n789,750\nNote 11-Leases\nOperating Leases\nWe lease certain locations, office, distribution, and manufacturing facilities under operating leases that expire at various dates through December 2048. We are obligated to make cash payments in connection with various lease obligations and purchase commitments. All of these obligations require cash payments to be made by us over varying periods of time. Certain leases are renewable at our option typically for periods of five or more years. Certain of these arrangements are cancelable on short notice and others require payments upon early termination. We do not have any finance leases.\nThe following table summarizes the components of lease expense (in thousands):\nYear Ended\nSeptember 30, 2023\nOctober 1, 2022\nOctober 2, 2021\nOperating lease expense\n$\n79,741\n$\n72,922\n$\n68,130\nVariable lease expense\n-\n-\n1,129\nTotal net lease expense\n$\n79,741\n$\n72,922\n$\n69,259\nAs of September 30, 2023 and October 1, 2022, operating lease right-of-use assets obtained in exchange for operating lease liabilities totaled $11.1 million and $32.6 million, respectively.\nThe following table presents the weighted-average remaining lease term and discount rate for operating leases:\nSeptember 30, 2023\nOctober 1, 2022\nWeighted-average remaining lease term\n5.0 years\n4.4 years\nWeighted-average discount rate\n6.2\n%\n5.5\n%\nThe following table summarizes the future annual minimum lease payments as of September 30, 2023 (in thousands):\nAmount\n$\n76,361\n70,356\n61,616\n41,139\n22,036\nThereafter\n34,773\nTotal\n$\n306,281\nLess: amount of lease payments representing imputed interest\n50,265\nPresent value of future minimum lease payments\n256,016\nLess: current operating lease liabilities\n62,794\nOperating lease liabilities, noncurrent\n$\n193,222\nNote 12-Income Taxes\nThe provision for income taxes consists of the following (in thousands):\nYear Ended\nSeptember 30, 2023\nOctober 1, 2022\nOctober 2, 2021\nCurrent:\nFederal\n$\n13,425\n$\n37,886\n$\n25,914\nState\n2,404\n8,736\n7,733\nTotal Current\n15,829\n46,622\n33,647\nDeferred:\nFederal\n(5,608\n)\n2,556\n2,633\nState\n(722\n)\n(90\n)\nTotal Deferred\n(6,330\n)\n2,466\n2,848\nTotal income tax provision\n$\n9,499\n$\n49,088\n$\n36,495\nA reconciliation of the provision for income taxes to the amount computed at the federal statutory rate is as follows (in thousands):\nYear Ended\nSeptember 30, 2023\nOctober 1, 2022\nOctober 2, 2021\nFederal income tax at statutory rate\n$\n7,716\n$\n43,705\n$\n34,257\nEquity-based compensation\n(1,025\n)\n(2,360\n)\nSection 162(m) limitation\n2,826\nPermanent differences\nChange in valuation allowance\n-\n-\n(5,425\n)\nState taxes, net of federal benefit\n1,109\n6,734\n7,072\nOther\n(57\n)\n(1,227\n)\n(439\n)\nTotal income tax provision\n$\n9,499\n$\n49,088\n$\n36,495\nOur effective income tax rate for fiscal 2023 was 25.9% as compared to 23.6% in fiscal 2022.\nThe tax effects of temporary differences that give rise to significant portions of deferred tax assets and liabilities are summarized below (in thousands):\nSeptember 30, 2023\nOctober 1, 2022\nDeferred tax assets:\nCompensation accruals\n$\n1,878\n$\n4,067\nInventories\n1,237\n3,496\nLease liabilities\n64,619\n58,710\nEquity-based compensation\n2,503\n2,151\nReserves and other accruals\n2,696\n1,059\nInterest limitation\n7,615\n-\nCapitalized research expenditures\n2,017\n-\nTotal deferred tax assets\n82,565\n69,483\nDeferred tax liabilities:\nProperty, plant, and equipment\n(4,387\n)\n(4,066\n)\nIntangibles\n(6,109\n)\n(4,302\n)\nLease assets\n(61,835\n)\n(57,798\n)\nDeferred financing cost\n(253\n)\n(310\n)\nOther\n(2,383\n)\n(1,739\n)\nTotal deferred tax liabilities\n(74,967\n)\n(68,215\n)\nDeferred tax assets (liabilities), net\n$\n7,598\n$\n1,268\nManagement assesses the available positive and negative evidence to estimate if sufficient future taxable income will be generated to utilize the existing deferred tax assets. The interest expense limitation passed in the Coronavirus Aid, Relief, and Economic Security Act (the CARES Act) created a deferred tax asset for the fiscal year ended October 3, 2020 that we did not anticipate realizing in the immediate future; as a result, a valuation allowance was recorded. The $5.4 million valuation allowance was removed during the first quarter of fiscal 2021 as the realization of the CARES Act deferred tax asset was deemed probable due to the Company's paydown of debt with proceeds from the IPO, which decreased interest expense.\nWe are subject to United States federal and state taxes in the normal course of business and our income tax returns are subject to examination by the relevant tax authorities. We are no longer subject to United States federal examinations by taxing authorities for calendar years before 2019 and no longer subject to state examinations for calendar years before 2018.\nWe have not identified any material uncertain tax positions.\nIn August 2022, the Inflation Reduction Act of 2022 was signed into law and contains provisions effective January 1, 2023 which were not material to the Companys income tax provision.\nNote 13-Commitments & Contingencies\nContingencies\nOn September 8, 2023, a class action complaint for violation of federal securities laws was filed by West Palm Beach Police Pension Fund in the U.S. District Court for the District of Arizona against us, our Chief Executive Officer and our former Chief Financial Officer. The complaint alleges that we violated federal securities laws by issuing materially false and misleading statements that failed to disclose adverse facts about our financial guidance, business operations and prospects, and seeks class certification, damages, interest, attorneys fees, and other relief. Due to the early stage of this proceeding, we cannot reasonably estimate the potential range of loss, if any. We dispute the allegations of wrongdoing and intend to defend ourselves vigorously in this matter.\nWe are also defendants in lawsuits or potential claims encountered in the normal course of business. When the potential liability from a matter can be estimated and the loss is considered probable, we record the estimated loss. Due to uncertainties related to the resolution of lawsuits, investigations and claims, the ultimate outcome may differ from the estimates. We do not expect that the resolutions of any of these matters will have a material effect to our consolidated financial position or results of operations. We did not record any material loss contingencies as of September 30, 2023, October 1, 2022, and October 2, 2021, respectively.\nOur workers compensation insurance program, general liability insurance program, and employee group medical plan have self-insurance retention features of up to $0.4 million per event as of September 30, 2023 and October 1, 2022. We had standby letters of credit outstanding in the amount of $11.4 million and $10.0 million as of September 30, 2023 and October 1, 2022, respectively, for the purpose of securing such obligations under our workers compensation self-insurance programs.\nPurchase Commitments\nIn addition to our lease obligations, we maintain future purchase commitments related to inventory and operational requirements.\nThe following table summarizes the future minimum purchase commitments as of September 30, 2023 (in thousands):\nAmount\n$\n79,941\n78,327\n7,838\n5,705\n2,207\nThereafter\n-\nTotal\n$\n174,018\nNote 14-401(K) Plan\nWe provide for the benefit of our employees a voluntary defined contribution retirement plan under Section 401(k) of the Internal Revenue Code. The plan covers all eligible employees and provides for a matching contribution by us of 50% of each participants contribution of up to 4% of the individuals compensation as defined. The expenses related to this plan were $1.5 million, $1.4 million, and $0.8 million in fiscal 2023, 2022, and 2021, respectively.\nNote 15-Related Party Transactions\nOn December 14, 2021, the Company entered into a share repurchase agreement with Bubbles Investor Aggregator, L.P. and Explorer Investment Pte. Ltd. (together, the Selling Stockholders), each a greater than 5% beneficial owner of the Companys common stock at the time of the transaction, providing for the repurchase by the Company from the Selling Stockholders of an aggregate of 7.5 million shares of common stock, conditioned on the closing of a contemporaneous secondary public offering (the Offering). The price per share of repurchased common stock paid by the Company was $20.25, which represents the per share price at which shares of common stock were sold to the public in the Offering less the underwriting discount. The repurchase\ntransaction closed on December 16, 2021. See Note 16-Share Repurchase Program for detailed information regarding our share repurchase program.\nNote 16-Share Repurchase Program\nOn December 3, 2021, the board of directors authorized a share repurchase program for up to an aggregate of $300 million of the Companys outstanding shares of common stock over a period of three years, expiring December 31, 2024. The amount, price, manner, and timing of repurchases are determined by the Company in its discretion and depends on a number of factors, including legal requirements, price, economic and market conditions, the Companys financial condition, capital requirements, cash flows, results of operations, future business prospects, and other factors our management may deem relevant. The share repurchase program may be amended, suspended, or discontinued at any time. Shares may be repurchased from time-to-time using a variety of methods, including on the open market and/or in privately negotiated transactions, including under plans complying with Rule 10b5-1 under the Exchange Act, as part of accelerated share repurchases, and other methods.\nOn December 16, 2021, the Company repurchased and retired 7.5 million shares of common stock at a price per share of $20.25 under the program. The Company paid $151.9 million ($152.1 million including offering costs) to fund the share repurchase using existing cash on hand. The Company accounted for the share repurchase and retirement of shares under the cost method by deducting its par value from common stock, reducing additional paid-in-capital by $127.5 million (using the share price when the shares were originally issued), and increasing retained deficit by the remaining excess cost of $24.4 million.\nAs of September 30, 2023, approximately $147.7 million remained available for future purchases under our share repurchase program.\nThe following table presents information about our repurchases of common stock under our share repurchase program (in thousands):\nYear Ended\nSeptember 30, 2023\nOctober 1, 2022\nTotal number of shares repurchased\n-\n7,500\nTotal amount paid for shares repurchased\n$\n-\n$\n151,875\nNote 17-Equity-Based Compensation\nEquity-Based Compensation\n2020 Omnibus Incentive Plan\nIn October 2020, we adopted the Leslies, Inc. 2020 Omnibus Incentive Plan (the Plan). The Plan provides for various types of awards, including non-qualified stock options to purchase Leslies common stock (each, a Stock Option), restricted stock units (RSUs) and performance stock units (PSUs) which may settle in Leslies, Inc. common stock to our directors, executives, and eligible employees of the Company. As of September 30, 2023, we had approximately 7.7 million shares of common stock available for future grants under the Plan.\nAs of September 30, 2023, the aggregate unamortized value of all outstanding equity-based compensation awards was approximately $22.6 million, which is expected to be recognized over a weighted average period of approximately 2.4 years.\nStock Options\nStock Options granted under the Plan generally expire ten years from the date of grant and consist of Stock Options that vest upon satisfaction of time-based requirements. The following tables summarize our Stock Option activity under the Plan (in thousands, except per share amounts):\nYear Ended\nSeptember 30, 2023\nOctober 1, 2022\nNumber of Options\nWeighted Average\nExercise Price\nNumber of Options\nWeighted Average\nExercise Price\nOutstanding, Beginning\n3,780\n$\n18.24\n4,877\n$\n18.22\nGranted\n-\n-\n-\n-\nExercised\n-\n-\n(81\n)\n17.00\nForfeited/Expired\n(472\n)\n19.25\n(1,016\n)\n18.22\nBalance, Ending\n3,308\n$\n18.10\n3,780\n$\n18.24\nVested and exercisable as of September 30, 2023\n1,980\n$\n18.18\n1,349\n$\n18.28\nSeptember 30, 2023\nAggregate intrinsic value of Stock Options outstanding\n$\n-\nUnamortized value of unvested Stock Options\n$\n4,072\nWeighted average years that expense is expected to be recognized\n1.1\nWeighted average remaining contractual years outstanding\n7.5\nRestricted Stock Units and Performance Units\nRSUs represent grants that vest ratably upon the satisfaction of time-based requirements. PSUs represent grants potentially issuable in the future based upon the Companys achievement of certain performance conditions. The fair value of our RSUs and PSUs are calculated based on the Companys stock price on the date of the grant.\nThe following table summarizes our RSU and PSU activity under the Plan (in thousands, except per share amounts):\nYear Ended\nSeptember 30, 2023\nOctober 1, 2022\nNumber of RSUs/PSUs\nWeighted Average\nGrant Date Fair Value\nNumber of RSUs/PSUs\nWeighted Average\nGrant Date Fair Value\nOutstanding, Beginning\n2,297\n$\n10.04\n3,135\n$\n6.90\nGranted (1)\n1,487\n11.19\n18.57\nVested\n(1,057\n)\n7.00\n(1,079\n)\n5.99\nForfeited\n(643\n)\n11.58\n(390\n)\n9.82\nBalance, Ending\n2,084\n$\n11.92\n2,297\n$\n10.04\n(1)Includes 0.3 million PSUs granted in December 2022 subject to the Company achieving certain adjusted net income and sales performance targets on a cumulative basis during each of fiscal years 2023, 2024, and 2025. The criteria are based on a range of these performance targets in which participants may earn between 0% to 200% of the base number of awards granted. The weighted average grant date fair value of the PSUs was $12.04. The Company assesses the attainment of target payout rates each reporting period. Equity-based compensation expense is recognized for awards deemed probable of vesting.\nSeptember 30, 2023\nUnamortized value of unvested RSUs/PSUs\n$\n18,527\nWeighted average period (years) expense is expected to be recognized\n2.7\nDuring the fiscal year ended September 30, 2023, equity-based compensation expense was $11.7 million. During the fiscal year ended October 1, 2022, equity-based compensation expense was $11.3 million. Equity-based compensation expense is reported in SG&A in our consolidated statements of operations.\nNote 18-Earnings Per Share\nThe following is a reconciliation of basic weighted average common shares outstanding to diluted weighted average common shares outstanding (in thousands, except per share amounts):\nYear Ended\nSeptember 30, 2023\nOctober 1, 2022\nOctober 2, 2021\nNumerator:\nNet income\n$\n27,242\n$\n159,029\n$\n126,634\nDenominator:\nWeighted average shares outstanding - basic\n183,839\n184,347\n185,412\nEffect of dilutive securities:\nStock Options\n-\n-\nRSUs\n1,801\n4,030\nWeighted average shares outstanding - diluted\n184,716\n186,148\n190,009\nBasic earnings per share\n$\n0.15\n$\n0.86\n$\n0.68\nDiluted earnings per share\n$\n0.15\n$\n0.85\n$\n0.67\nThe following number of weighted-average potentially dilutive shares were excluded from the calculation of diluted earnings per share because the effect of including such shares would have been antidilutive (in thousands):\nYear Ended\nSeptember 30, 2023\nOctober 1, 2022\nOctober 2, 2021\nStock Options\n3,539\n4,020\nRSUs\n2,154\nTotal\n5,693\n4,621 Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure.\nNone. Item 9A. Controls and Procedures.\nManagements Evaluation of Disclosure Controls and Procedures\nOur disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e)) are designed to ensure that information required to be disclosed by us in reports we file or submit under the Securities Exchange Act of 1934, as amended (the Exchange Act), is recorded, processed, summarized, and reported within the appropriate time periods specified in SEC rules and forms, and that such information is accumulated and communicated to our management, including our Chief Executive Officer and Chief Financial Officer, as appropriate, to allow timely discussions regarding required disclosure. We, under the supervision of and with the participation of our management, including our Chief Executive Officer and Chief Financial Officer, have evaluated the effectiveness of our disclosure controls and procedures. Based on that evaluation, our Chief Executive Officer (Principal Executive Officer) and Chief Financial Officer (Principal Financial Officer and Principal Accounting Officer) have concluded that our disclosure controls and procedures were not effective as of September 30, 2023, due to the material weaknesses in our internal control over financial reporting as described below.\nLimitations on Effectiveness of Controls and Procedures\nIn designing and evaluating the disclosure controls and procedures, management recognizes that any controls and procedures, no matter how well designed and operated, can provide only reasonable, not absolute, assurance of achieving the desired control objectives. In addition, the design of disclosure controls and procedures must reflect the fact that there are resource constraints and management is required to apply its judgment in evaluating the benefits of possible controls and procedures relative to their costs. The design of any disclosure controls and procedures is also based in part upon certain assumptions about the likelihood of future events, and there can be no assurance that any design will succeed in achieving its stated goals under all potential future conditions.\nManagements Report on Internal Control over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) of the Exchange Act). Our internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with GAAP and includes those policies and procedures that (i) pertain to the maintenance of records that in reasonable detail accurately and fairly reflect our transactions and the dispositions of our assets; (ii) provide reasonable assurance that our transactions are recorded as necessary to permit preparation of financial statements in accordance with GAAP and that our receipts and expenditures are being made only in accordance with appropriate authorizations; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of our assets that could have a material effect on our financial statements.\nUnder the supervision of and with the participation of our management, we assessed the effectiveness of our internal control over financial reporting as of September 30, 2023, using the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission in Internal Control-Integrated Framework (2013). Based on our assessment, our management concluded that we did not maintain effective internal control over financial reporting as of September 30, 2023 due to the material weaknesses described below. A material weakness is a deficiency, or a combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of the annual or interim financial statements will not be prevented or detected on a timely basis.\nWe identified a material weakness in the Companys internal control over financial reporting related to the operation of controls over the performance of a subset of the Companys physical inventories held at certain locations to validate inventory existence and the completeness and accuracy of data used in validating the appropriateness of inventory costing for a subset of the Companys inventories and inventory reserves.\nWe also identified a material weakness in the Companys internal control over financial reporting related to the design and operation of controls over the Companys vendor rebate process, including the timing of when rebates are recognized within the consolidated statement of operations.\nThese material weaknesses did not result in any identified material misstatements to the financial statements, and there were no changes to previously released financial results. However, the deficiencies created a reasonable possibility that material misstatements to the consolidated financial statements would not be prevented or detected on a timely basis.\nManagement has analyzed the material weaknesses and performed additional analysis and procedures in preparing our consolidated financial statements. We have concluded that our consolidated financial statements fairly present, in all material respects, our financial condition, results of operations and cash flows at and for the periods presented. Ernst & Young LLP, an independent registered public accounting firm who audited and reported on our consolidated financial statements included in this report, has issued an adverse report on the effectiveness of our internal control over financial reporting as of September 30, 2023, included in their report under Item 8, Financial Statements and Supplementary Data of this Annual Report.\nRemediation Efforts\nWe took steps to remediate the control deficiencies contributing to the material weakness relating to information technology general controls (ITGCs) first identified in Part II, Item 9A of our Annual Report on Form 10-K for the fiscal year ended October 1, 2022, such that these controls are designed, implemented and operating effectively. Specifically, during the year ended September 30, 2023, management: (i) engaged a consulting firm to assist with the design and assessment of the internal control environment, (ii) developed a detailed project plan which included all critical tasks, owners and due dates to properly design and execute controls adequately and effectively, (iii) re-designed controls and delivered training to key control owners to ensure a sustainable and effective control environment, (iv) created a steering committee who was responsible and accountable for validating the established project plan and testing performed over key controls was on track and effective, which helped oversee and prioritize the remediation activities. The efforts detailed above allowed management to conclude that the Companys internal controls over ITGCs that were deemed to be ineffective in managements report on internal control over financial reporting as of October 1, 2022 are effective and the corresponding material weakness has been remediated during the year ended and as of September 30, 2023.\nWe will design and implement new processes and enhanced controls to address the underlying causes of the unremediated material weaknesses related to inventory and vendor rebates as of September 30, 2023. Our planned remediation actions include the following:\nexamination of our current controls and identifying the root cause(s) for the deficiencies;\nexamination and enhancement of the procedures over certain of our annual physical inventory counts, including the augmentation of training and validation of system generated reports utilized in performing certain annual physical counts and clear instruction as to the process for the recording of adjustments to inventory as a result of physical counts and validation of data used in inventory costing;\nenhanced supervision of personnel during and subsequent to physical inventory counts to ensure compliance with established Company policies;\nexamination and enhancement of the procedures over the completeness and accuracy of data utilized in computing inventory reserves;\nimplementing and executing enhanced controls operating at the level of precision necessary to detect potential material misstatements in the data utilized to calculate vendor rebates earned and timing of vendor rebate income recognition, to aid in the detection of potential deviations that may be relied upon in our financial reporting processes; and\nengagement with outside consultants and/or other personnel to assist with the identification, implementation, and review of changes to our suite of internal controls related to inventory and vendor rebates, as necessary.\nWe intend to remediate these material weaknesses as soon as possible, and we believe the measures described above will remediate the material weaknesses and strengthen our internal control over financial reporting. These material weaknesses will not be considered remediated until the applicable controls operate for a sufficient period of time and management has concluded through testing that the controls are operating effectively. We anticipate that the remediation will be completed during fiscal year 2024. We are committed to continuing to improve our internal control processes, and, as we continue to evaluate and work to improve our internal control over financial reporting, we may take additional measures to address control deficiencies, or we may modify certain of the remediation measures described above.\nChanges in Internal Control Over Financial Reporting\nOur Chief Executive Officer and Chief Financial Officer, with other members of management, evaluated the changes in our internal control over financial reporting during the quarter ended September 30, 2023. Except as described above, we determined that there were no changes in our internal control over financial reporting during the quarter ended September 30, 2023 that materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and the Board of Directors of Leslies, Inc.\nOpinion on Internal Control over Financial Reporting\nWe have audited Leslies, Incs internal control over financial reporting as of September 30, 2023, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the COSO criteria). In our opinion, because of the effect of the material weakness described below on the achievement of the objectives of the control criteria, Leslies, Inc. (the Company) has not maintained effective internal control over financial reporting as of September 30, 2023, based on the COSO criteria.\nA material weakness is a deficiency, or combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of the companys annual or interim financial statements will not be prevented or detected on a timely basis. The following material weaknesses were identified and included in managements assessment. Management has identified material weaknesses in controls related to the Companys vendor rebate process and inventory process.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated balance sheets of the Company as of September 30, 2023 and October 1, 2022, and the related consolidated statements of operations, stockholders deficit, and cash flows for each of the three years in the period ended September 30, 2023, and the related notes. These material weaknesses were considered in determining the nature, timing and extent of audit tests applied in our audit of the fiscal 2023 consolidated financial statements, and this report does not affect our report dated November 29, 2023 which expressed an unqualified opinion thereon.\nBasis for Opinion\nThe Companys management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Managements Report on Internal Control Over Financial Reporting. Our responsibility is to express an opinion on the Companys internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects.\nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA companys internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A companys internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ Ernst & Young LLP\nPhoenix, Arizona\nNovember 29, 2023 Item 9B. Other Information.\n(a) Information Required to be Disclosed on Form 8-K\nNone.\n(b) Trading Plans\nDuring the quarter ended September 30, 2023, no director or Section 16 officer adopted or terminated any Rule 10b5-1 trading arrangements or non-Rule 10b5-1 trading arrangements (in each case, as defined in Item 408(a) of Regulation S-K).\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections.\nNot applicable.\nPART III Item 10. Directors, Executive Officers and Corporate Governance.\nExcept as indicated below, information responsive to this item is incorporated herein by reference to our Proxy Statement with respect to our 2024 Annual Meeting of Shareholders to be filed with the SEC within 120 days after the end of our fiscal year covered by this Annual Report on Form 10-K, including under the headings Corporate Governance, Proposal 1: Election of Directors, Information about Our Executive Officers, and, if applicable, Delinquent Section 16(a) Reports.\nWe have adopted a Code of Ethics that applies to all of our directors, officers, and employees, including our Principal Executive, Principal Financial, and Principal Accounting Officers, or persons performing similar functions. Our Code of Ethics is posted on the investor relations page of our website: www.lesliespool.com. We intend to disclose future amendments to certain provisions of the Code of Ethics, and waivers of the Code of Ethics granted to executive officers and directors, on the website within four business days following the date of the amendment or waiver. Item 11. Executive Compensation.\nInformation responsive to this item is incorporated herein by reference to our Proxy Statement with respect to our 2024 Annual Meeting of Shareholders to be filed with the SEC within 120 days after the end of our fiscal year covered by this Annual Report on Form 10-K, including under the headings Compensation Discussion and Analysis and Compensation Committee Interlocks and Insider Participation. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nInformation responsive to this item is incorporated herein by reference to our Proxy Statement with respect to our 2024 Annual Meeting of Shareholders to be filed with the SEC within 120 days after the end of our fiscal year covered by this Annual Report on Form 10-K, including under the headings Beneficial Ownership of Securities and Compensation Discussion and Analysis. Item 13. Certain Relationships and Related Transactions, and Director Independence.\nInformation responsive to this item is incorporated herein by reference to our Proxy Statement with respect to our 2024 Annual Meeting of Shareholders to be filed with the SEC within 120 days after the end of our fiscal year covered by this Annual Report on Form 10-K, including under the headings Certain Relationships and Related Party Transactions and Director Independence. Item 14. Principal Accountant Fees and Services.\nInformation responsive to this item is incorporated herein by reference to our Proxy Statement with respect to our 2024 Annual Meeting of Shareholders to be filed with the SEC within 120 days after the end of our fiscal year covered by this Annual Report on Form 10-K, including under the heading Proposal 2: Ratification of Appointment of Independent Registered Public Accounting Firm.\nPART IV Item 15. Exhibits, Financial Statements Schedules.\n(a)The following documents are filed as a part of this report:\n(1)Financial Statements. The Companys financial statements are included in Part II, Item 8, Financial Statements and Supplementary Data.\n(2)Financial Statements Schedules. All schedules are omitted since they are not applicable, not required, or the information required to be set forth therein is included under Part II, Item 8, Financial Statements and Supplementary Data.\n(3)Exhibits. The exhibits listed in the Exhibit Index immediately below are filed as part of this Annual Report on Form 10-K.\nIncorporated by Reference\nExhibit\nNumber\nExhibit Description\nForm\nExhibit\nFiling Date/\nPeriod End Date\n3.1\nSixth Amended and Restated Certificate of Incorporation, effective as of March 16, 2023\n8-K\n3.1\n3/16/2023\n3.2\nAmended and Restated Bylaws, effective as of August 1, 2023\n10-Q\n3.1\n8/3/2023\n4.1\nIndenture, dated as of August 16, 2016, by and among Leslies Poolmart, Inc., Leslies Holdings, Inc., the other guarantors party thereto and U.S. Bank National Association, as Trustee\nS-1/A\n4.1\n10/22/2020\n4.2\nFirst Supplemental Indenture, dated as of October 26, 2016, by and among Leslies Poolmart, Inc., Leslies Holdings, Inc., the other guarantors party thereto and U.S. Bank National Association, as Trustee\nS-1/A\n4.2\n10/22/2020\n4.3\nSecond Supplemental Indenture, dated as of February 3, 2017, by and among Leslies Poolmart, Inc., Leslies Holdings, Inc., the other guarantors party thereto and U.S. Bank National Association, as Trustee\nS-1/A\n4.3\n10/22/2020\n4.4\nForm of Registration Rights and Lock-up Agreement between Leslies, Inc., Bubbles Investor Aggregator, L.P., Explorer Investment Pte. Ltd. and certain other investors\nS-1/A\n4.4\n10/28/2020\n4.5\nFirst Amendment to Registration Rights and Lock-up Agreement between Leslies, Inc. and Bubbles Investor Aggregator, L.P.\nS-1\n4.5\n2/8/2021\n4.6\nSecond Amendment to Registration Rights and Lock-up Agreement between Leslies, Inc. and Bubbles Investor Aggregator, L.P.\nS-1\n4.6\n6/7/2021\n4.7\nThird Amendment to Registration Rights and Lock-up Agreement between Leslies, Inc. and Bubbles Investor Aggregator, L.P.\n8-K\n4.1\n10/26/2021\n4.8\nDescription of Securities Registered under Section 12 of the Securities Exchange Act of 1934\n10-K\n4.5\n12/23/2020\n10.1#\nForm of Indemnification Agreement between Leslies, Inc. and its directors and officers\nS-1/A\n10.1\n10/22/2020\n10.2#\n2020 Omnibus Incentive Plan\nS-1/A\n10.2\n10/22/2020\n10.3#\nForm of Stock Option Agreement pursuant to 2020 Omnibus Incentive Plan\nS-1/A\n10.3\n10/22/2020\n10.4#\nForm of Restricted Stock Unit Agreement pursuant to 2020 Omnibus Incentive Plan\n10-Q\n10.2\n2/3/2023\n10.5#\nForm of Performance Unit Award Agreement pursuant to 2020 Omnibus Incentive Plan\n10-Q\n10.3\n2/3/2023\n10.6#\nAmended and Restated Employment Agreement, dated as of October 19, 2020, by and between Leslies, Inc. and Michael R. Egeck\nS-1/A\n10.5\n10/22/2020\n10.7#\nSecond Amended and Restated Employment Agreement, dated as of October 19, 2020, by and between Leslies, Inc. and Steven M. Weddell\nS-1/A\n10.7\n10/22/2020\n10.8#\nOffer Letter, dated as of October 11, 2019, by and between Leslies Poolmart, Inc. and Paula Baker\nS-1/A\n10.8\n10/22/2020\n10.9#\nForm of Director Designation Agreement, by and among Leslies, Inc., Bubbles Investor Aggregator, L.P., and each other person that becomes party thereafter\nS-1/A\n10.11\n10/22/2020\n10.10\nTerm Loan Credit Agreement, dated as of August 16, 2016, among Leslies Poolmart, Inc., Leslies Holdings, Inc., the lenders party thereto from time-to-time and Nomura Corporate Funding Americas, LLC, as administrative agent and as collateral agent\nS-1/A\n10.12\n10/22/2020\n10.11\nIncremental Amendment No. 1, dated as of January 26, 2017, to the Term Loan Credit Agreement among Leslies Poolmart, Inc., Leslies Holdings, Inc., the lenders party thereto from time-to-time and Nomura Corporate Funding Americas, LLC, as administrative agent and as collateral agent\nS-1/A\n10.13\n10/22/2020\n10.12\nAmendment No. 2, dated as of February 16, 2017, to the Term Loan Credit Agreement among Leslies Poolmart, Inc., Leslies Holdings, Inc., the lenders party thereto from time-to-time and Nomura Corporate Funding Americas, LLC, as administrative agent and as collateral agent\nS-1/A\n10.14\n10/22/2020\n10.13\nAmendment No. 3, dated as of February 27, 2018, to the Term Loan Credit Agreement among Leslies Poolmart, Inc., Leslies Holdings, Inc., the lenders party thereto from time-to-time and Nomura Corporate Funding Americas, LLC, as administrative agent and as collateral agent\nS-1/A\n10.15\n10/22/2020\n10.14\nCredit Agreement entered into as of October 16, 2012, among Leslies Poolmart, Inc., the subsidiary borrowers from time-to-time party thereto, Leslies Holdings, Inc., each lender from time-to-time party thereto, Bank of America, N.A., as Administrative Agent, and U.S. Bank National Association, as Co-Collateral Agent\nS-1/A\n10.16\n10/22/2020\n10.15\nAmendment No. 1, dated as of August 16, 2016, to the Credit Agreement among Leslies Poolmart, Inc., the subsidiary borrowers from time-to-time party thereto, Leslies Holdings, Inc., each lender from time-to-time party thereto, Bank of America, N.A., as Administrative Agent, and U.S. Bank National Association, as Co-Collateral Agent\nS-1/A\n10.17\n10/22/2020\n10.16\nAmendment No. 2, dated as of September 29, 2016, to the Credit Agreement among Leslies Poolmart, Inc., the subsidiary borrowers from time-to-time party thereto, Leslies Holdings, Inc., each lender from time-to-time party thereto, Bank of America, N.A., as Administrative Agent, and U.S. Bank National Association, as Co-Collateral Agent\nS-1/A\n10.18\n10/22/2020\n10.17\nAmendment No. 3, dated as of January 13, 2017, to the Credit Agreement among Leslies Poolmart, Inc., the subsidiary borrowers from time-to-time party thereto, Leslies Holdings, Inc., each lender from time-to-time party thereto, Bank of America, N.A., as Administrative Agent, and U.S. Bank National Association, as Co-Collateral Agent\nS-1/A\n10.19\n10/22/2020\n10.18\nAmendment No. 4, dated as of August 13, 2020, to the Credit Agreement among Leslies Poolmart, Inc., the subsidiary borrowers from time-to-time party thereto, Leslies Holdings, Inc., each lender from time-to-time party thereto, Bank of America, N.A., as Administrative Agent, and U.S. Bank National Association, as Co-Collateral Agent\nS-1/A\n10.20\n10/22/2020\n10.19\nAmendment No. 5, dated as of April 12, 2021, to the Credit Agreement among Leslies Poolmart, Inc., the subsidiary borrowers from time-to-time party thereto, Leslies, Inc., each lender from time-to-time party thereto, Bank of America, N.A., as Administrative Agent, and U.S. National Association, as Co-Collateral Agent\n10-Q\n10.2\n5/10/2021\n10.20\nAmendment No. 6, dated as of March 15, 2023, to the Credit Agreement among Leslies Poolmart, Inc., Leslies, Inc., and the subsidiary borrowers named therein, Bank of America, N.A., as Administrative Agent, and U.S. Bank National Association, Co-Collateral Agent\n8-K\n10.1\n3/16/2023\n10.21\nAmended & Restated Term Loan Credit Agreement, dated as of March 9, 2021, by and among the Company, Leslies Poolmart, Inc., the lenders from time-to-time party thereto and Nomura Corporate Funding Americas, LLC, as administrative agent for the Lenders and as collateral agent for the Secured Parties\n8-K\n10.1\n3/10/2021\n10.22\nAmendment No. 1, dated as of June 8, 2023, to the Amended and Restated Term Loan Credit Agreement by and among Leslies Poolmart, Inc., Leslies, Inc., the lenders from time to time party thereto and Nomura Corporate Funding Americas, LLC, as administrative agent and collateral agent\n8-K\n10.1\n6/13/2023\n10.23#\nLeslies, Inc. Annual Incentive Plan\n10-Q\n10.1\n2/3/2023\n10.24#\nExecutive Severance Pay Plan, dated April 11, 2022, by and between Leslies Poolmart, Inc. and Paula Baker\n10-K\n10.23\n11/30/2022\n10.25#\nExecutive Severance Pay Plan, dated April 11, 2022, by and between Leslies Poolmart, Inc. and Brad Gazaway\n10-K\n10.24\n11/30/2022\n10.26#\nExecutive Severance Pay Plan, dated April 11, 2022, by and between Leslies Poolmart, Inc. and Moyo LaBode\n10-K\n10.25\n11/30/2022\n10.27#\nOffer Letter, dated as of July 7, 2023, by and between Leslies Poolmart, Inc. and Scott Bowman\n10-Q\n10.2\n8/3/2023\n10.28#\nExecutive Severance Pay Plan, dated July 17, 2023, by and between Leslies Poolmart, Inc. and Scott Bowman\n10-Q\n10.3\n8/3/2023\n10.29#\nTransition Agreement between the Company and Paula Baker with an effective date of September 19, 2023\n8-K\n10.1\n9/20/2023\n10.30#*\nExecutive Severance Pay Plan, dated April 11, 2022, by and between Leslies Poolmart, Inc. and Mike Africa\n10.31#*\nExecutive Severance Pay Plan, dated October 19, 2022, by and between Leslies Poolmart, Inc. and Naomi Cramer\n10.32#*\nExecutive Severance Pay Plan, dated June 29, 2023, by and between Leslies Poolmart, Inc. and Dave Caspers\n21.1*\nSubsidiaries of Registrant\n23.1*\nConsent of Independent Registered Public Accounting Firm\n31.1*\nCertification of Principal Executive Officer Pursuant to Rules 13a-14(a) and 15d-14(a) under the Securities Exchange Act of 1934\n31.2*\nCertification of Principal Financial Officer Pursuant to Rules 13a-14(a) and 15d-14(a) under the Securities Exchange Act of 1934\n32.1+\nCertification of Principal Executive Officer Pursuant to 18 U.S.C. Section 1350\n32.2+\nCertification of Principal Financial Officer Pursuant to 18 U.S.C. Section 1350\n97.1#*\nLeslies, Inc. Compensation Recovery Policy\n101.INS*\nInline XBRL Instance Document\n101.SCH*\nInline XBRL Schema Document\n101.CAL*\nInline XBRL Calculation Linkbase Document\n101.LAB*\nInline XBRL Label Linkbase Document\n101.PRE*\nInline XBRL Presentation Linkbase Document\n101.DEF*\nInline XBRL Definition Linkbase Document\n104*\nThe cover page from the Companys Annual Report on Form 10-K for the year ended September 30, 2023, formatted in Inline XBRL (included as Exhibit 101)\n* Filed herewith.\n# Indicates a management contract or compensatory plan or arrangement.\n+ Furnished herewith and not deemed to be filed for purposes of Section 18 of the Securities Exchange Act of 1934, as amended, and shall not be deemed to be incorporated by reference into any filing under the Securities Act of 1933, as amended, or the Securities Exchange Act of 1934, as amended.\nItem 16. Form 10-K Summary.\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, as amended, the Registrant has duly caused this Report to be signed on its behalf by the undersigned, thereunto duly authorized.\nLESLIES, INC.\nDate: November 29, 2023\nBy:\n/s/ Michael R. Egeck\nMichael R. Egeck\nChief Executive Officer\n(Principal Executive Officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, as amended, this Report has been signed below by the following persons on behalf of the Registrant in the capacities and on the dates indicated.\nName\nTitle\nDate\n/s/ Steven L. Ortega\nChairman\nNovember 29, 2023\nSteven L. Ortega\n/s/ Michael R. Egeck\nChief Executive Officer (Principal Executive Officer) and Director\nNovember 29, 2023\nMichael R. Egeck\n/s/ Scott Bowman\nChief Financial Officer (Principal Financial Officer and Principal Accounting Officer)\nNovember 29, 2023\nScott Bowman\n/s/ Yolanda Daniel\nDirector\nNovember 29, 2023\nYolanda Daniel\n/s/ Seth Estep\nDirector\nNovember 29, 2023\nSeth Estep\n/s/ Eric Kufel\nDirector\nNovember 29, 2023\nEric Kufel\n/s/ Susan OFarrell\nDirector\nNovember 29, 2023\nSusan OFarrell\n/s/ James R. Ray, Jr.\nDirector\nNovember 29, 2023\nJames R. Ray, Jr.\n/s/ Claire Spofford\nDirector\nNovember 29, 2023\nClaire Spofford\n/s/ John Strain\nDirector\nNovember 29, 2023\nJohn Strain"
}