{
    "cik": "1828739",
    "company": "Azzurro Solutions Corp.",
    "filing_type": "10-K",
    "filing_date": "2023-11-30",
    "period_of_report": "2023-09-30",
    "sic": "5099",
    "state_of_inc": "NV",
    "state_location": "2N",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1828739/0001477932-23-008872-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1828739/000147793223008872/azzurro_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1828739/0001477932-23-008872.txt",
    "filename": "1828739_10K_2023_0001477932-23-008872.htm",
    "content": "ITEM 1. DESCRIPTION OF BUSINESS\nFORWARD-LOOKING STATEMENTS\nThis annual report contains forward-looking statements. These statements relate to future events or our future financial performance. These statements often can be identified by the use of terms such as may, will, expect, believe, anticipate, estimate, approximate or continue, or the negative thereof. We intend that such forward-looking statements be subject to the safe harbors for such statements. We wish to caution readers not to place undue reliance on any such forward-looking statements, which speak only as of the date made. Any forward-looking statements represent managements best judgment as to what may occur in the future. However, forward-looking statements are subject to risks, uncertainties and important factors beyond our control that could cause actual results and events to differ materially from historical results of operations and events and those presently anticipated or projected. We disclaim any obligation subsequently to revise any forward-looking statements to reflect events or circumstances after the date of such statement or to reflect the occurrence of anticipated or unanticipated events.\nAs used in this annual report, the terms we, us, our, the Company, mean AZZURRO SOLUTIONS CORP., unless otherwise indicated.\nAll dollar amounts refer to US dollars unless otherwise indicated.\nDESCRIPTION OF BUSINESS\nAzzurro Solutions Corp. was incorporated in the State of Nevada on October 4, 2019 and established a fiscal year end of September 30. We have no revenues, have minimal assets and have incurred losses since inception. We are still in the development stage and as of today we have generated no revenue. Our business is the distribution of Bohemian crystal chandeliers produced in Czech Republic. We will distribute our chandeliers in the North American market to both retail and wholesale customers.\nBohemian glass, chiefly referred to as Bohemia crystal, is glass produced in the regions of Bohemia and Silesia, now parts of the Czech Republic. It has a centuries long history of being internationally recognized for its high quality, craftsmanship, beauty and often innovative designs. All our Bohemian crystal chandeliers come with a manufacturers warranty and are guaranteed against any factory defects. We plan on purchasing products only from reliable and established suppliers with excellent reputation. ITEM 1A. RISK FACTORS\nNot applicable. ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone. ITEM 2. PROPERTIES\nWe do not own any property. ITEM 3. LEGAL PROCEEDINGS\nWe are not currently involved in any legal proceedings and we are not aware of any pending or potential legal actions. ITEM 4. SUBMISSION OF MATTERS TO A VOTE OF SECURITY HOLDERS\nNo report required.\n3 | Page\nPART II ITEM 5. MARKET FOR EQUITY SECURITIES AND OTHER SHAREHOLDER MATTERS\nMARKET INFORMATION\nAs of November 29, 2023, 4,058,167 issued and outstanding shares of common stock were held by a total of 31 shareholders of record.\nDIVIDENDS\nWe have never paid or declared any dividends on our common stock and do not anticipate paying cash dividends in the foreseeable future.\nSECURITIES AUTHORIZED FOR ISSUANCE UNDER EQUITY COMPENSATION PLANS\nWe currently do not have any equity compensation plans. ITEM 6. SELECTED FINANCIAL DATA\nNot Applicable. ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULT OF OPERATIONS\nThe following discussion should be read in conjunction with our financial statements, including the notes thereto, appearing elsewhere in this annual report. The following discussion contains forward-looking statements that reflect our plans, estimates and beliefs. Our actual results could differ materially from those discussed in the forward-looking statements. Factors that could cause or contribute to such differences include, but are not limited to those discussed below and elsewhere in this Annual Report. Our audited financial statements are stated in United States Dollars and are prepared in accordance with United States Generally Accepted Accounting Principles.\n4 | Page\nRESULTS OF OPERATION\nAs of September 30, 2023, we had deficit of $74,505. Our financial statements have been prepared assuming that we will continue as a going concern. We expect we will require additional capital to meet our long term operating requirements. We expect to raise additional capital through, among other things, the sale of equity or debt securities.\nYear ended September 30, 2023 compared to year ended September 30, 2022\nRevenue\nDuring year ended September 30, 2023, the Company generated $7,982 in revenue compared to $-0- in revenue during year ended September 30, 2022.\nOperating Expenses\nDuring the year ended September 30, 2023, we incurred general and administrative expenses of $24,759 and cost of goods sold of $6,525 compared to $32,466 for the year ended September 30, 2022. General and administrative and professional fee expenses incurred generally related to corporate overhead, financial and administrative contracted services, such as legal and accounting.\nNet Loss\nOur net loss for the year ended September 30, 2023 was $23,302 compared to $32,466 for the year ended September 30, 2022.\nLIQUIDITY AND CAPITAL RESOURCES\nAs at September 30, 2023 our total assets were $2,499 compared to $5,676 in total assets at September 30, 2022. As at September 30, 2023, our current liabilities were $45,859 compared to $25,734 as of September 30, 2022.\nStockholders deficit was $43,360 as of September 30, 2023 compared to stockholders equity of $20,058 as of September 30, 2022.\nCash Flows from Operating Activities\nFor the year ended September 30, 2023, net cash flows used in operating activities was $33,236, consisting of net loss of $23,302, amortization expenses of $66 and decrease in accounts payable of $10,000. For the year ended September 30, 2022, net cash flows used in operating activities was $22,466, consisting of net loss of $32,466 and $10,000 of accounts payable.\nCash Flows from Investing Activities\nCash flows used in investing activities during year ended September 30, 2023 was $2,000 compared to $-0- during year ended September 30, 2022.\nCash Flows from Financing Activities\nCash flows provided by financing activities during the year ended September 30, 2023 were $30,125, consisting of loan from shareholder compared to $13,964 for the year ended September 30, 2022, consisting of loan from shareholder.\n5 | Page\nPLAN OF OPERATION AND FUNDING\nWe expect that working capital requirements will continue to be funded through a combination of our existing funds and further issuances of securities. Our working capital requirements are expected to increase in line with the growth of our business.\nExisting working capital, further advances and debt instruments, and anticipated cash flow are expected to be adequate to fund our operations over the next six months. We have no lines of credit or other bank financing arrangements. Generally, we have financed operations to date through the proceeds of the private placement of equity and debt instruments. In connection with our business plan, management anticipates additional increases in operating expenses and capital expenditures relating to: (i) developmental expenses associated with a start-up business and (ii) marketing expenses. We intend to finance these expenses with further issuances of securities, and debt issuances. Thereafter, we expect we will need to raise additional capital and generate revenues to meet long-term operating requirements. Additional issuances of equity or convertible debt securities will result in dilution to our current shareholders. Further, such securities might have rights, preferences or privileges senior to our common stock. Additional financing may not be available upon acceptable terms, or at all. If adequate funds are not available or are not available on acceptable terms, we may not be able to take advantage of prospective new business endeavors or opportunities, which could significantly and materially restrict our business operations.\nMATERIAL COMMITMENTS\nAs of the date of this Annual Report, we do not have any material commitments.\nPURCHASE OF SIGNIFICANT EQUIPMENT\nWe do not intend to purchase any significant equipment during the next twelve months.\nOFF-BALANCE SHEET ARRANGEMENTS\nAs of the date of this Annual Report, we do not have any off balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources that are material to investors. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nNot applicable.\n6 | Page Item 8. Financial Statements and Supplementary Data\nReport of Independent Registered Public Accounting Firm\nBalance Sheets as of September 30, 2023 and September 30, 2022\nStatements of Operations for the years ended September 30, 2023 and 2022\nStatement of Changes in Stockholders Equity for the years ended September 30, 2023 and 2022\nStatements of Cash Flows for the years ended September 30, 2023 and 2022\nNotes to the Financial Statements\n-F-8\n7 | Page\nMICHAEL GILLESPIE & ASSOCIATES, PLLC\nCERTIFIED PUBLIC ACCOUNTANTS\nVANCOUVER, WA 98666\n206.353.5736\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Shareholders & Board of Directors\nAzzurro Solutions Corp.\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of Azzurro Solutions Corp. as of September 30, 2023 and 2022 and the related statements of operations, changes in stockholders deficit, cash flows, and the related notes (collectively referred to as financial statements) for the periods then ended. In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of September 30, 2023 and 2022 and the results of its operations and its cash flows for the years then ended in conformity with accounting principles generally accepted in the United States of America.\nGoing Concern\nThe accompanying financial statements have been prepared assuming the Company will continue as a going concern. As discussed in Note #2 to the financial statements, although the Company has limited operations it has yet to attain profitability. This raises substantial doubt about its ability to continue as a going concern. Managements plan in regard to these matters is also described in Note #2. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audit, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audit provides a reasonable basis for our opinion.\n/S/ MICHAEL GILLESPIE & ASSOCIATES, PLLC\nWe have served as the Companys auditor since 2022.\nPCAOB ID: 6108\nVancouver, Washington\nNovember 14, 2023\nAZZURRO SOLUTIONS CORP.\nBALANCE SHEETS\nSEPTEMBER 30,\n(AUDITED)\nSEPTEMBER 30, 2022\n(AUDITED)\nASSETS\nCurrent Assets\nCash & cash equivalents\n$ 565\n$ 5,676\nTotal current assets\n5,676\nNon-current assets\n1,934\n-\nTotal non-current assets\n1,934\n-\nTotal Assets\n$ 2,499\n$ 5,676\nLIABILITIES AND STOCKHOLDERS EQUITY\nCurrent Liabilities\nAccounts payable\n$ -\n$ 10,000\nLoans from related parties\n45,859\n15,734\nTotal current liabilities\n45,859\n25,734\nTotal Liabilities\n45,859\n25,734\nStockholders Equity\nCommon stock, $0.001 par value, 75,000,000 shares authorized:\n4,058,167 shares issued and outstanding\n4,058\n4,058\nAdditional Paid-In-Capital\n27,087\n27,087\nAccumulated Deficit\n(74,505 )\n(51,203 )\nTotal Stockholders equity\n(43,360 )\n(20,058 )\nTotal Liabilities and Stockholders equity\n$ 2,499\n$ 5,676\nThe accompanying notes are an integral part of these financial statements.\nAZZURRO SOLUTIONS CORP.\nSTATEMENTS OF OPERATIONS (AUDITED)\nYEAR ENDED SEPTEMBER 30, 2023\nYEAR ENDED TO SEPTEMBER 30, 2022\nRevenue\n$ 7,982\n$ -\nOPERATING EXPENSES\nCost of goods sold\n6,525\n-\nGeneral and administrative expenses\n24,759\n$ 32,466\nNet loss from operations\n(23,302 )\n(32,466 )\nLoss before provision for income taxes\n(23,302 )\n(32,466 )\nProvision for income taxes\n-\n-\nNet income (loss)\n$ (23,302 )\n$ (32,466 )\nIncome (loss) per common share:\nBasic and Diluted\n$ (0.00 )\n$ (0.00 )\nWeighted Average Number of Common Shares Outstanding:\nBasic and Diluted\n4,058,167\n4,058,167\nThe accompanying notes are an integral part of these financial statements.\nAZZURRO SOLUTIONS CORP.\nSTATEMENT OF STOCKHOLDERS EQUITY (AUDITED)\nFOR THE YEARS ENDED SEPTEMBER 30, 2022 AND 2023\nNumber of\nCommon\nShares\nAmount\nAdditional\nPaid-In -Capital\nAccumulated\nDeficit\nTotal\nBalance as of September 30, 2021\n4,058,167\n$ 4,058\n$ 27,087\n$ (18,737 )\n$ 12,408\nNet income (loss)\n-\n-\n-\n(32,466 )\n(32,466 )\nBalance as of September 30, 2022\n4,058,167\n$ 4,058\n$ 27,087\n$ (51,203 )\n$ (20,058 )\nBalance as of September 30, 2022\n4,058,167\n$ 4,058\n$ 27,087\n$ (51,203 )\n$ (20,058 )\nNet income (loss)\n-\n-\n-\n(23,302 )\n(23,302 )\nBalance as of September 30, 2023\n4,058,167\n$ 4,058\n$ 27,087\n$ (74,505 )\n$ (43,360 )\nThe accompanying notes are an integral part of these financial statements.\nAZZURRO SOLUTIONS CORP.\nSTATEMENTS OF CASH FLOWS (AUDITED)\nYEAR ENDED SEPTEMBER 30, 2023\nYEAR ENDED\nSEPTEMBER 30, 2022\nCASH FLOWS FROM OPERATING ACTIVITIES\nNet loss\n$ (23,302 )\n$ (32,466 )\nAmortization expense\n-\nAccounts payable\n(10,000 )\n10,000\nNet cash provided by operating activities\n(33,236 )\n(22,466 )\nCASH FLOWS FROM INVESTING ACTIVITIES\nComputer Software\n(2,000 )\n-\nNet cash used in investing activities\n(2,000 )\n-\nCASH FLOWS FROM FINANCING ACTIVITIES\nProceeds of loan from shareholder\n30,125\n13,964\nNet cash provided by financing activities\n30,125\n13,964\nNet decrease in cash and equivalents\n(5,111 )\n(8,502 )\nCash and equivalents at beginning of the period\n5,676\n14,178\nCash and equivalents at end of the year/ period\n$ 565\n$ 5,676\nSupplemental cash flow information:\nCash paid for:\nInterest\n$ -\n$ -\nTaxes\n$ -\n$ -\nThe accompanying notes are an integral part of these financial statements.\nAZZURRO SOLUTIONS CORP.\nNOTES TO THE AUDITED FINANCIAL STATEMENTS\nFOR THE PERIOD FROM INCEPTION (OCTOBER 4, 2019) TO SEPTEMBER 30, 2023\nNOTE 1 - ORGANIZATION AND BUSINESS\nAZZURRO SOLUTIONS CORP. (the Company) is a corporation established under the corporation laws in the State of Nevada on October 4, 2019. The Company administrative office is located at V Osikách, 24, Dolni Mecholupy, Prague, Czech Republic 10900. The Company intends to commence operations in the distribution of Bohemian Crystal Chandeliers.\nThe Company has adopted September 30 fiscal year end.\nNOTE 2 - GOING CONCERN\nThe Companys financial statements as of September 30, 2023 been prepared using generally accepted accounting principles in the United States of America applicable to a going concern, which contemplates the realization of assets and liquidation of liabilities in the normal course of business. The Company has not yet established an ongoing source of revenues sufficient to cover its operating costs and allow it to continue as a going concern. The Company has accumulated loss from inception (October 4, 2019) to September 30, 2023, of $74,505. These factors among others raise substantial doubt about the ability of the company to continue as a going concern for a reasonable period of time.\nIn order to continue as a going concern, the Company will need, among other things, additional capital resources. Managements plan is to obtain such resources for the Company by obtaining capital from management and significant shareholders sufficient to meet its minimal operating expenses and seeking third party equity and/or debt financing. However, management cannot provide any assurances that the Company will be successful in accomplishing any of its plans. These financial statements do not include any adjustments related to the recoverability and classification of assets or the amounts and classification of liabilities that might be necessary should the Company be unable to continue as a going concern.\nNOTE 3 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBasis of Presentation\nThe financial statements of the Company have been prepared in accordance with generally accepted accounting principles in the United States of America. Company functional and operational currency is US Dollar.\nCash and Cash Equivalents\nFor purposes of the statement of cash flows, the Company considers all highly liquid instruments purchased with an original maturity of three months or less to be cash equivalents. The Companys bank accounts are deposited in insured institutions. The funds are insured up to $250,000. At September 30, 2023 the Companys bank deposits did not exceed the insured amounts.\nStock-Based Compensation\nAs of September 30, 2023, the Company has not issued any stock-based payments to its employees.\nStock-based compensation is accounted for at fair value in accordance with ASC 718, when applicable. To date, the Company has not adopted a stock option plan and has not granted any stock options.\nUse of Estimates\nPreparing financial statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets, liabilities, revenue, and expenses. Actual results and outcomes may differ from managements estimates and assumptions.\nIncome Taxes\nThe Company follows the liability method of accounting for income taxes. Under this method, deferred income tax assets and liabilities are recognized for the estimated tax consequences attributable to differences between the financial statement carrying values and their respective income tax basis (temporary differences). The effect on deferred income tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date.\nThe Company utilizes the Financial Accounting Standards Boards Accounting Standards Codification Topic 740 related to Income Taxes to account for the uncertainty in income taxes. Topic 740 for Income Taxes clarifies the accounting for uncertainty in income taxes by prescribing rules for recognition, measurement and classification in financial statements of tax positions taken or expected to be in a tax return. Further, it prescribes a two-step process for the financial statement measurement and recognition of a tax position. The first step involves the determination of whether it is more likely than not (greater than 50 percent likelihood) that a tax position will be sustained upon examination, based on the technical merits of the position. The second step requires that any tax position that meets the more likely than not recognition threshold be measured and recognized in the financial statements at the largest amount of benefit that is a greater than 50 percent likelihood of being realized upon ultimate settlement. This topic also provides guidance on the accounting for related interest and penalties, financial statement classification and disclosure. The Companys policy is that any interest or penalties related to uncertain tax positions are recognized in income tax expense when incurred. The Company has no uncertain tax positions or related interest or penalties requiring accrual at September 30, 2023.\nNew Accounting Pronouncements\nThere were various accounting standards and interpretations issued recently, none of which are expected to a have a material impact on our financial position, operations or cash flows.\nFair Value of Financial Instruments\nASC 825, Disclosures about Fair Value of Financial Instruments, requires disclosure of fair value information about financial instruments. ASC 820, Fair Value Measurements defines fair value, establishes a framework for measuring fair value in generally accepted accounting principles, and expands disclosures about fair value measurements. Fair value estimates discussed herein are based upon certain market assumptions and pertinent information available to management as of September 30, 2023.\nThe respective carrying values of certain on-balance-sheet financial instruments approximate their fair values. These financial instruments include cash and related party loan payable. Fair values were assumed to approximate carrying values for these financial instruments since they are short term in nature and their carrying amounts approximate fair value.\nBasic and Diluted Loss Per Share\nThe Company computes earnings (loss) per share in accordance with ASC 260-10-45 Earnings per Share, which requires presentation of both basic and diluted earnings per share on the face of the statement of operations. Basic earnings (loss) per share is computed by dividing net earnings (loss) available to common stockholders by the weighted average number of outstanding common shares during the period. Diluted earnings (loss) per share gives effect to all dilutive potential common shares outstanding during the period. Dilutive earnings (loss) per share excludes all potential common shares if their effect is anti-dilutive. The Company has no potential dilutive instruments, and therefore, basic and diluted earnings (loss) per share are equal.\nNOTE 4 - CAPITAL STOCK\nThe Company has 75,000,000 shares of common stock authorized with a par value of $0.001 per share.\nIn September 2020, the Company issued 3,000,000 shares of its common stock at $0.001 per share for total proceeds of $3,000 and 180,000 shares of its common stock at $0.01 per share for total proceeds of $1,800. For the year ended September 30, 2022, the Company issued 878,167 shares of its common stock at $0.03 per share for total proceeds of $26,345.\nAs of September 30, 2023, the Company had 4,058,167 shares issued and outstanding.\nNOTE 5 - RELATED PARTY TRANSACTIONS\nIn support of the Companys efforts and cash requirements, it may rely on advances from related parties until such time that the Company can support its operations or attains adequate financing through sales of its equity or traditional debt financing. There is no formal written commitment for continued support by officers, directors, or shareholders. Amounts represent advances or amounts paid in satisfaction of liabilities. The advances are considered temporary in nature and have not been formalized by a promissory note.\nSince October 4, 2019 (Inception) through September 30, 2023, the Companys sole officer and director loaned the Company $45,859 to pay for incorporation costs and operating expenses. As of September 30, 2023, the amount outstanding was $45,859. The loan is non-interest bearing, due upon demand and unsecured.\nNOTE 6. SUBSEQUENT EVENTS\nThe Company has evaluated subsequent events from September 30, 2023 to the date the financial statements were issued and has determined that there are the following items to disclose:\nIn October 2023, the Companys sole officer and director loaned the Company $8,350 to pay for operating expenses. This loans is non-interest bearing, due upon demand and unsecured. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone. ITEM 9A. CONTROLS AND PROCEDURES\nOur management is responsible for establishing and maintaining a system of disclosure controls and procedures (as defined in Rule 13a-15(e) and 15d-15(e) under the Exchange Act) that is designed to ensure that information required to be disclosed by us in the reports that we file or submit under the Exchange Act is recorded, processed, summarized and reported, within the time periods specified in the Commissions rules and forms. Disclosure controls and procedures include, without limitation, controls and procedures designed to ensure that information required to be disclosed by an issuer in the reports that it files or submits under the Exchange Act is accumulated and communicated to the issuers management, including its principal executive officer or officers and principal financial officer or officers, or persons performing similar functions, as appropriate to allow timely decisions regarding required disclosure.\nAn evaluation was conducted under the supervision and with the participation of our management of the effectiveness of the design and operation of our disclosure controls and procedures as of September 30, 2023. Based on that evaluation, our management concluded that our disclosure controls and procedures were not effective as of such date to ensure that information required to be disclosed in the reports that we file or submit under the Exchange Act, is recorded, processed, summarized and reported within the time periods specified in SEC rules and forms. Such officer also confirmed that there was no change in our internal control over financial reporting during the year September 30, 2023 that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting. ITEM 9B. OTHER INFORMATION\nNone.\n8 | Page\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS, PROMOTERS AND CONTROL PERSONS OF THE COMPANY\nDirectors of the corporation are elected by the stockholders to a term of one year and serve until a successor is elected and qualified. Officers of the corporation are appointed by the Board of Directors to a term of one year and serves until a successor is duly appointed and qualified, or until he or she is removed from office. The Board of Directors has no nominating, auditing or compensation committees.\nMs. Selyska was selected as our Director. Ms. Selyska is not considered to be an independent director of the Company; we presently have no independent directors.\nThe name, address, age and position of our officers and director is set forth below:\nName and Address\nAge\nPosition(s)\nHanna Selyska\nV Osikách, 24, Dolni Mecholupy\nPrague, Czech Republic 10900\nPresident, Secretary\nChief Financial Officer,\nChief Executive Officer,\nSole Director\nOur Director Hanna Selyska:\nHeld her offices/positions since the inception of our Company and is expected to hold said offices/positions until the next annual meeting of our stockholders. The officers listed are our only officers and control persons.\nBACKGROUND INFORMATION ABOUT OUR SOLE OFFICER AND DIRECTOR\nHanna Selyska has acted as our President, Treasurer, Secretary and Director since our incorporation on October 4, 2019. Since 2010, she has been working as a sole proprietor in the building material distribution business. Ms. Selyska has never been in default with the bank or government and does not have any pending litigations or claims.\nMs. Selyska owned 73.92% of the outstanding shares of our common stock at the time of the appointment. As such, it was unilaterally decided that Ms. Selyska was going to be our President, Chief Executive Officer, Treasurer, Secretary, Chief Financial Officer, Chief Accounting Officer and sole member of our board of directors. This decision did not in any manner relate to Ms. Selyskas previous employments. Ms. Selyskas and previous experience, qualifications, attributes or skills were not considered when she was appointed as our President, Chief Executive Officer, Treasurer, Chief Financial Officer, Chief Accounting Officer, Secretary and member of our board of directors.\nAUDIT COMMITTEE\nWe do not have an audit committee financial expert. We do not have an audit committee financial expert because we believe the cost related to retaining a financial expert at this time is prohibitive. Further, because we have no operations, at the present time, we believe the services of a financial expert are not warranted.\nSIGNIFICANT EMPLOYEES\nOther than our director, we do not expect any other individuals to make a significant contribution to our business. ITEM 11. EXECUTIVE COMPENSATION\nThe following tables set forth certain information about compensation paid, earned or accrued for services by our Executive Officer for the years ended September 30, 2023 and September 30, 2022:\n9 | Page\nSummary Compensation Table\nName and\nPrincipal\nPosition\nYear\nSalary\n($)\nBonus\n($)\nStock\nAwards\n($)\nOption\nAwards\n($)\nNon-Equity\nIncentive Plan\nCompensation\n($)\nAll Other\nCompensation\n($)\nAll Other\nCompensation\n($)\nTotal\n($)\nHanna Selyska\nPresident, Secretary\nCEO, CFO\nAnd Director\nOctober 1, 2021 to September 30, 2022\nOctober 1, 2022 to September 30, 2023\nThere are no current employment agreements between the company and its officer.\nThere are no annuity, pension or retirement benefits proposed to be paid to the officer or director or employees in the event of retirement at normal retirement date pursuant to any presently existing plan provided or contributed to by the company or any of its subsidiaries, if any.\nCHANGE OF CONTROL\nAs of September 30, 2023, we had no pension plans or compensatory plans or other arrangements which provide compensation in the event of a termination of employment or a change in our control.\n10 | Page ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe following table sets forth, as of the date of this prospectus, the total number of shares owned beneficially by our director, officers and key employees, individually and as a group, and the present owners of 5% or more of our total outstanding shares. The table also reflects what the percentage of ownership will be assuming completion of the sale of all shares in this offering, which we cant guarantee. The stockholder listed below has direct ownership of his shares and possesses sole voting and dispositive power with respect to the shares.\nTitle of Class\nName and Address of\nBeneficial Owner\nAmount and Nature of\nBeneficial Ownership\nPercentage\nCommon Stock\nHanna Selyska\n3,000,000 shares of common stock (direct)\n73.92\n%\nThe percentages below are based on 4,058,167 shares of our common stock issued and outstanding as of the date of this prospectus. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS\nOn September 17, 2020 the Company issued a total of 3,000,000 shares of common stock to Ms. Hanna Selyska for cash at $0.001 per share for a total of $3,000.\nMs. Selyska has loaned us funds for operations. The loan was not made pursuant to any loan agreements or promissory note. The loan is unsecured, non-interest bearing and due on demand. The balance due to the Ms. Selyska was $45,859 as of September 30, 2023. Ms. Selyska is under no obligation to continue lending us money.\nMs. Selyska provides our office facilities at zero ($-0-) rent per month.\nWe do not currently have any conflicts of interest by or among our current officer, director, key employee or advisors. We have not yet formulated a policy for handling conflicts of interest; however, we intend to do so upon completion of this offering and, in any event, prior to hiring any additional employees. ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nDuring fiscal year ended September 30, 2023, we incurred approximately $16,250 in fees for professional services rendered in connection with the audit of our financial statements for the fiscal year ended September 30, 2022 and for the reviews of our financial statements for the quarters ended December 31, 2022, March 31, 2023 and June 30, 2023.\n11 | Page ITEM 15. EXHIBITS\nThe following exhibits are filed as part of this Annual Report.\nExhibits:\n31.1\nCertification of Chief Executive Officer and Chief Financial Officer pursuant to Securities Exchange Act of 1934 Rule 13a-14(a) or 15d-14(a)\n32.1\nCertifications pursuant to Securities Exchange Act of 1934 Rule 13a-14(b) or 15d-14(b) and 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes- Oxley Act of 2002\n101.INS\nInline XBRL Instance Document (the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document).\n101.SCH\nInline XBRL Taxonomy Extension Schema Document.\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document.\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document.\n101.LAB\nInline XBRL Taxonomy Extension Labels Linkbase Document.\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document.\nCover Page Interactive Data File (formatted as inline XBRL and contained in Exhibit 101).\n12 | Page\nSIGNATURES\nIn accordance with the requirements of the Exchange Act, the registrant caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nAZZURRO SOLUTIONS CORP.\nDated: November 29, 2023\nBy:\n/s/ Hanna Selyska\nHanna Selyska, President and\nChief Executive Officer and Chief Financial Officer\n13 | Page"
}