{
    "cik": "1832161",
    "company": "KeyStar Corp.",
    "filing_type": "10-K",
    "filing_date": "2022-10-13",
    "period_of_report": "2022-06-30",
    "sic": "5900",
    "state_of_inc": "NV",
    "state_location": "FL",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1832161/0001393905-22-000412-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1832161/000139390522000412/keyr-20220630.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1832161/0001393905-22-000412.txt",
    "filename": "1832161_10K_2022_0001393905-22-000412.htm",
    "content": "Item 1. Business\nOverview\nAs used in this Annual Report and unless otherwise indicated, the terms the Company, we, us and our mean KeyStar Corp., a Nevada corporation formed on April 16, 2020.\nAs of the year ended June 30, 2022, our business provided online retail sales of masks and similar products and convention services (together, Prior Business). Through our online store, we offered merchandise on both the retail and wholesale level in the United States (U.S.). Due to the global Coronavirus (COVID-19) pandemic, the focus was on providing 3-ply and KN95 masks at affordable rates through our extensive network of manufacturers and suppliers in China.\nOur convention services connected U.S. buyers to Chinese manufacturers. Due to the COVID-19 pandemic, the traditional in person conventions were paused or postponed worldwide. Both buyer and seller were eager to connect as markets opened from shutdowns. Regional chambers of commerce and industry associations in China were also actively organizing online conventions. Our job was to bridge the gap and introduce these online conventions to potential buyers, and then resume services for traditional conventions once shutdowns eased. For online conventions, the intent was to bill manufacturers for each potential buyer we introduce or for each virtual meeting we scheduled. This was an ongoing project.\nAs of or shortly after June 15, 2022, we hired a new Chief Executive Officer and Chief Financial Officer along with certain key employees of ZenSports, Inc. to explore business opportunities related to software and mobile application development and services related to such technology. On August 26, 2022, we entered into an Asset Purchase Agreement to purchase certain technological assets, as well as the brand ZenSports, from ZenSports, Inc. The assets were purchased to allow us to offer online sports betting, eSports, DeFi fintech and various entertainment services, on a direct-to-consumer (B2C) and business-to-business (B2B) basis. We did not acquire the entity, ZenSports, Inc.\nOn September 12, 2022, we entered into an Asset Purchase Agreement with Excel Members, LLC, a company controlled by Bruce Cassidy, a member of our Board of Directors (the Board), to acquire certain assets of a company acquired previously by Excel through an assignment for the benefit of creditors. Ultimate Gamer, LLC, which was formerly in the business of organizing and operating in-person and online video game competitions tournament, originally owned these assets. The purchased assets included the brand name Ultimate Gamer.\nOn September 15, 2022, we entered into an agreement to assign all of the assets in connection with or relating to our Prior Business owned or used by us, and to delegate any and all liabilities owed by us, to TopSight Corporation, a company owned by Ms. Chen, our former Chief Financial Officer.\nAs a result of the foregoing transactions, we have effectively ceased operations relating to our Prior Business and commenced operations relating to both B2B and B2C offerings within online sports betting, eSports, and DeFi fintech (collectively, New Business). With our New Business, augmented by net new development of products and services, we intend to pursue global business opportunities through a platform weve designed to be a flexible foundation for corporate growth.\nThrough our ZenSports brand we will be offering a modern, full-featured, native mobile, and global online sports betting platform incorporating a sports book, peer-to-peer betting, fiat ($, €, £, ¥, etc.), and digital currency for betting, eSports wagering, loyalty, and player retention.\nThrough our Ultimate Gamer brand, we expect to offer a modern, full-featured mobile and PC-based eSports tournament management platform designed to improve the overall experience and reduce digital friction for the 3.24 billion gamers that seek the ability to curate their online gaming experience in a personalized manner.\nThrough our Burstive brand, we expect to offer comprehensive financial services utilizing a Decentralized Finance (DeFi) backbone that will incorporate a blockchain-based digital currency and marketplace infrastructure. Burstive is integrated with our ZenSports and Ultimate Gamer brands, and together they provide differentiation in their respective markets and a foundation for success for white-label partners in online sports betting, eSports, e-commerce, and financial services.\nBeing a start-up company, our Prior Business had limited revenues and limited operating history. Our New Business continues in a start-up mode as we aggregate our recent asset acquisitions and continue the development of our comprehensive platform capability. At present, we are pursuing both a global licensing strategy for obtaining online gaming licenses and a go-to-market strategy to monetize our assets. As part of our growth strategy, we expect to continue to raise funds from time to time to support our strategic organic and M&A activities.\nThe website for our Prior Business is https://www.keystarshop.com. Our Prior Business was an online-based company with no demand for a physical storefront location. Our New Business is a mobile app and online-based technology company with no demand for a physical storefront location. The website for our New Business is https://www.keystarcorp.com. The information on our website is not made a part of this Annual Report. Our headquarters address is 8400 W Sunset Rd Suite 300, Las Vegas, NV 89113. We have a mailbox service at 9620 Las Vegas Blvd S., E4-98, Las Vegas, NV 89123. Our phone number is: (866) 783-9435.\nCOVID-19\nAs of the filing date, COVID-19 has caused significant volatility in global markets, including the market price of inventory for our Prior Business. The demand for our products and services from our Prior Business has fluctuated and the ability of our customers to make payments for the products and services they purchased has been impacted.\nWe do not have enough data to evaluate the effects, if any, of COVID-19 on our New Business operations.\nSuppliers and Distribution\nPrior Business:\nAt the early stage of the COVID-19 pandemic, the personal protection equipment (PPE) supply faced extreme shortages and inflated prices, from raw materials to finished products. The needed PPE equipment was not only difficult to obtain, but also difficult to purchase because of increased and fluctuating pricing from the influx in demand from existing suppliers and distributors in the market, along with new entrants. There were frequent changes in agreement terms as fraudulent buyers were weeded out of the market.\nDespite the volatility in the PPE market, through years of trade show experiences and the network of Chinese manufacturers known to our management, we were able to get in touch with some reliable suppliers to start our screening process, as well as place our initial orders. Subsequently, as more products became available on an international B2B trading platform, we also explored opportunities for new channels to increase our supplier base.\nDue to the time sensitivity of these products, the early orders were all through international express mail by air. The courier rates were extremely high for these orders and pricing consistently increased on a weekly basis due to high demand and significantly reduced flights caused by pandemic travel lockdowns. Progressively, we were able to import more PPE products via ocean shipping, a slower but significantly cheaper option. Once delivered to Las Vegas, the products are stored in a climate-controlled storage unit with 24/7 security service.\nWe believed our network of PPE product suppliers, and the rates we are able to get for our products, constituted a competitive strength in the industry.\nNew Business:\nOur technology is internally developed by our dedicated global team of product managers, designers, and engineers. Each product feature is meticulously designed to enhance the overall user experience for our target markets and deployed using industry best practices. Our products are principally delivered through mobile and internet applications and, as such, we are not reliant on specific physical delivery.\nOur Technology and Product Development\nPrior Business:\nWe were an online e-commerce company that processed all our orders through our online store at www.KeyStarShop.com. Instead of building our e-commerce website from scratch, we decided to use Shopify, a professional and well-integrated system that covered every aspect of our needs, from inventory tracking, payment, and shipping, to order tracking, and reporting, financial reports, marketing tools, and point-of-sale (POS) systems. We subscribed to or outsourced all our operational technology. We did not develop or own any of our own technology.\nNew Business:\nThrough technology asset purchases and the strategic personnel hires described above, we have assembled a comprehensive platform capability that enables both B2B and B2C offerings within the online sports betting, eSports, and DeFi fintech markets. The strategic hires include highly capable product managers, software designers, developers, and engineers. Our team continues to enhance the platform through new development and integration with, and for, strategic partners.\nOur current offerings are built on an integrated proprietary platform using modern, native-mobile and internet technologies that provide flexibility in branding and deployment while addressing specific market requirements in an efficient manner.\nWe will continue to invest in our asset acquisitions from ZenSports and Ultimate Gamer ensuring that the needs of our target markets are addressed in all our brands. Significant effort is made in avoiding technical debt as we enhance and augment our market-leading technical and product roadmaps. Fortunately, we do not have old legacy technology that restricts our speed to market and flexibility, reduces efficiency and increases cost, and forces workarounds and limited features.\nFor example, our new brand, Burstive, has been easily deployed from the ZenSports financial backbone designed to support online sports betting and eSports. Originally designed and built as a separate product set tightly integrated with ZenSports other offerings, it has always been able to be deployed to third parties as a standalone solution platform.\nAs a fundamentally digital business, our foundational focus revolves around the features and data that are desired by our end user clients and our B2B affiliates. Our integrated platform has been designed and built to be easily scalable, maintainable, and supportable. This creates the ability to offer outstanding customer responsiveness and reduce friction and inefficiency within operations.\nWhile some components of our operational matrix include 3rd party providers, principally data providers, the vast majority of our capabilities are unique and have been developed internally. This proprietary nature of our technology provides a significant measure of control over data, analytics, and marketing capabilities deployed natively in our\nintegrated platforms. It further lends itself to advanced machine learning and artificial intelligence across both our customer-facing functionality and our back-end infrastructure.\nFurthermore, it facilitates our ability to manage data from a holistic perspective and streamline our regulatory compliance across various jurisdictions. This data management design extends our universal user profile for both B2C users and our B2B affiliates to comprehensive management of both fiat and digital currencies which is a significant differentiator for our company in the marketplace.\nThis powerful combination of features and data delivers significantly advanced automation and is incorporated for both enhanced user experience and the ability to reward referrals and behavior while driving significant customer retention. As a result, lifetime customer value can be tracked and grown organically within our solutions.\nMarketing\nPrior Business:\nDue to the ongoing COVID-19 pandemic, we were unable to reach potential clients through traditional channels, such as trade shows and regional events. We mainly focused on digital marketing, which included emailing potential and existing clients, social media promotions, and social media group advertising. For the local Las Vegas market, we also went door-to-door for B2B clients, and mobile advertisements to promote our online store, as well as to maximize the exposure of our products by word-of-mouth and through a network of families, friends, and business associates.\nNew Business:\nWhile a variety of marketing activities are already underway, we are in the process of designing, budgeting, and funding a longer-term marketing plan and have a search underway for a head of Marketing. In the meantime, we expect to leverage the considerable marketing experience of our executive team and potentially leverage strategic vendor resources as we pursue our plan to offer B2B and B2C solutions to a variety of market sectors. In addition, due to the fact that much of our current offering requires new regulatory approval, we anticipate we will be launching new initiatives at the beginning of the calendar year in line with our licensing schedule.\nClient and User Acquisition and Retention\nThe online sports betting market has cycled through an inherently inefficient and costly approach to user acquisition. Ever escalating costs of acquisition seem to have not translated to corresponding profitability in the U.S. market. We are not currently participating in this activity and will not until licenses are granted in various jurisdictions. When we do, we expect to avoid programs that have a questionable return on investment, unless they contribute significantly to growth and can be throttled to achieve planned results.\nAdvanced data and behavioral analytics have been used effectively by the team prior to acquisition and they will be important components of a broad-based strategy. In addition, our unique loyalty programs have proven in the past to not only result in high retention but also serve as a referral engine that grows our user base for a fraction of the cost.\nThis is also true when applied to eSports. The eSports market is highly fragmented, and loyalty comes from a number of factors, most importantly user experience. Through user focus groups and a variety of market testing techniques, our products and roadmaps have been tuned to respond to that important metric of success as well as other related factors such as ease of use, quick funding, and where allowed, the enablement of cryptocurrency and NFT-related features.\nPre-existing opt-in databases of sports bettors and eSports players and spectators have been included as part of our asset acquisitions. It is our expectation that they will provide an important resource as we ramp up each of these areas of our business.\nTraditional approaches to user acquisition such as database segmentation and marketing, affiliate marketing, advertising, social media and influencer marketing and other forms of free and paid content marketing will all be deployed in a planned manner as well. In addition, we believe that cross-sell and up-sell strategies will enable whole new groups of users to be introduced to the various solutions available from us.\nBecause our DeFi fintech offerings are not targeted at B2C investment or securities engagement, our principal focus will be B2B. We also have B2B offerings for our other brands. B2B requires an entirely different strategy - one in which our management has extensive experience.\nAgain, the traditional approaches noted above can also be effective in a B2B strategy. We will augment them through trade shows, personal activities by management in speaking engagements, publishing in both trade press and social media, and the utilization of other personal and customer relationship marketing techniques.\nFurthermore, customer satisfaction is the number one critical success factor. We will consistently measure this important metric to ensure that our products and customer service are delivering what the market needs and expects.\nAs noted previously, we are currently in the process of obtaining online gaming licenses both domestically and internationally and until such time as we are licensed our marketing spend related to those areas will be tempered and adjusted accordingly.\nE-commerce Website\nPrior Business:\nWe processed all our orders through our online store at www.KeyStarShop.com. Instead of building our e-commerce website from scratch, we decided to use Shopify, a professional and well-integrated system that covers every aspect of our needs, from inventory tracking, payment, shipping, order tracking, reporting, financial reports, marketing tools, and POS systems. The monthly subscription system enabled us to quickly start the sale of products without heavy upfront investments in both time and funding. It also gave us the flexibility to scale up or expand our wholesaling efforts when needed. Using a hosted method, such as Shopify, has allowed us to free up time, energy, and resources leaving the site security and reliability issues to the team at Spotify while allowing management to focus on the growth of our business.\nNew Business:\nWe have recently deployed our new Keystar corporate website together with the new Burstive website. They are basic sites that we launched for presence and a unifier of our different brands. We expect to augment them shortly with a more integrated design across all the brands.\nThe ZenSports website and ZenSports Bet mobile app have been updated and are live. A new Ultimate Gamer website is also operational. The Ultimate Gamer mobile app has also been updated. Both the ZenSports Bet and the Ultimate Gamer mobile apps are available for download on both IOS and Android app stores.\nDistribution\nNew Business:\nOur distribution strategy includes specific solutions for a variety of channels on a B2B basis for online sports betting and mostly in different channels for our eSports and DeFi fintech offerings. Although we will not have the ability to have active users on our betting applications until we are licensed, our mobile app is live and downloadable. We are not currently marketing B2C in online sports betting and have just now begun to run eSports tournaments under the Keystar brand. We have the ability to provide private/white labeling for partners and also have mobile applications for B2C products as noted above.\nCompetition\nPrior Business:\nCompetition in all aspects of the PPE products and business services industry is intense. We competed against established PPE product companies and outsourced business services companies with name familiarity and greater financial resources. Our intent was to use our relatively small size to our advantage by focusing on customer service and by deploying unique marketing strategies. A large part of our effort to compete against the other companies in our field was directed to being recognized in this market of large players and, as a small company, to gain the trust\nof purchasing decision-makers as our potential customers. In an effort to effectively compete, we focused heavily on providing excellent service to our customers.\nNew Business:\nOur users face a vast array of entertainment choices. Other forms of entertainment, such as television, movies, sporting events, and in-person casinos, are better established and may be perceived by our users to offer greater variety, affordability, interactivity, and enjoyment. We compete with these other forms of entertainment for the discretionary time and income of our users. Through our white-label products, we compete with much larger, better-funded, established organizations. We believe our fresh technology and know-how including our advanced blockchain-based digital currency integration and marketplace infrastructure provides significant differentiation.\nThe specific industries in which we operate are characterized by dynamic customer demand and technological advances, and there is intense competition among online gaming and entertainment providers. A number of established, well-financed companies producing online gaming and/or interactive entertainment products and services compete with our offerings, and other well-capitalized companies may introduce competitive services. There has also been considerable consolidation among competitors in the entertainment and online gaming industries, and such consolidation and future consolidation could result in the formation of larger competitors with increased financial resources and lower cost structures, which may enable them to offer more competitive products, gain a larger market share, expand offerings and broaden their geographic scope of operations.\nOur white-label products are also directed toward a burgeoning area of the financial services sector, whose technology and regulations are advancing rapidly, and there is intense competition among providers. We are competing against established, well-financed companies that may introduce competitive services. These established companies have the financial resources and lower cost structures, which may enable them to offer more competitive products, gain a larger market share, expand offerings and broaden their geographic scope of operations.\nRegulations\nPrior Business:\nFederal, state and international laws and regulations impose a number of requirements and restrictions on our Prior Business. There are state and federal consumer protection laws that apply to our customer management services business, such as laws limiting telephonic sales or mandating special disclosures, and laws that apply to information that may be captured, used, shared and/or retained when sales are made and/or collections are attempted. State and federal laws also impose limits on credit account interest rates and fees, and their disclosure, as well as the time frame in which judicial actions may be initiated to enforce the collection of consumer accounts. There are numerous other federal, state, local and even international laws and regulations related to, among other things, privacy, identity theft, telephonic and electronic communications, sharing and use of consumer information that apply to our Prior Business and to our employees interactions and communications with others.\nFor example, the Federal Trade Commissions Telemarketing Sales Rule applies a number of limitations and restrictions on our ability to make outbound calls on behalf of our clients and our ability to encourage customers to purchase higher value products and services on inbound calls. Similarly, the Telephone Consumer Protection Act of 1991, which among other things governs the use of certain automated calling technologies, applies to calls to customers. Many states also have telemarketing laws that may apply to our Prior Business, even if the call originates from outside the state. Additionally, some of the laws directed toward credit originators, such as the Truth in Lending Act and the Fair Credit Billing Act, affected our prior Business operations because our receivables were originated through credit transactions.\nFederal and state regulators are empowered to examine and take enforcement actions for violations of these laws and regulations or for practices, policies or procedures they deem non-compliant, unfair, unsafe or unsound. Moreover, lawsuits may be brought by appropriate regulatory agencies, attorneys general, and private parties for non-compliance with these laws and regulations.\nNew Business:\nWe are subject to various U.S. and foreign laws and regulations (online gaming laws) that affect our ability to operate our online sports betting and tournament betting product offerings. These product offerings are generally\nsubject to extensive and evolving regulations that could change based on political and social norms and that could be interpreted in ways that could negatively impact our business.\nThe online gaming industry (inclusive of our betting product offerings) is highly regulated, and we must maintain licenses and pay online gaming taxes or a percentage of revenue where required by the jurisdictions in which we operate in order to continue our operations. Our business is subject to extensive regulation under the laws, rules and regulations of the jurisdictions in which we operate. These laws, rules, and regulations generally concern the responsibility, financial stability, integrity, and character of the owners, managers, and persons with material financial interests in the online gaming operations along with the integrity and security of the sports and tournament betting product offerings. Violations of laws or regulations in one jurisdiction could result in disciplinary action in that and other jurisdictions.\nGaming laws are generally based upon declarations of public policy designed to protect online gaming consumers and the viability and integrity of the online gaming industry. Gaming laws also may be designed to protect and maximize state and local tax revenues, as well as to enhance economic development and tourism. To accomplish these public policy goals, online gaming laws establish stringent procedures to ensure that participants in the online gaming industry meet certain standards of character and responsibility.\nLicensing and Suitability Determinations\nIn order to operate in certain jurisdictions, we must obtain either a temporary or permanent license or determination of suitability from the responsible authorities. We seek to ensure that we obtain all necessary licenses to develop and put forth our offerings in the jurisdictions in which we operate and where our users are located.\nGaming laws in certain jurisdictions require us, and certain of our directors, officers and employees, and in some cases, certain of our stockholders, to obtain licenses from gaming authorities. Such licenses typically require a determination that the applicant qualifies or is suitable to hold the license. When determining whether to grant such a license to an applicant, gaming authorities generally consider: (i) the financial stability, integrity and responsibility of the applicant (including verification of the applicants sources of funding); (ii) the quality and security of the applicants online gaming platform, hardware and related software (including the platforms ability to operate in compliance with local regulation, as applicable); (iii) the applicants history; (iv) the applicants ability to operate its online gaming business in a socially responsible manner; and (v) in certain circumstances, the effect on competition.\nGaming authorities may, subject to certain administrative procedural requirements: (i) deny an application, or limit, condition, revoke or suspend any license issued by them; (ii) impose fines, either on a mandatory basis or as a consensual settlement of regulatory action; (iii) demand that named individuals or stockholders be disassociated from an online gaming business; and (iv) in serious cases, liaise with local prosecutors to pursue legal action, which may result in civil or criminal penalties.\nEvents that may trigger revocation of such an online gaming license or another form of sanction vary by jurisdiction. However, typical events include, among others: (i) conviction in any jurisdiction of certain persons with an interest in, or key personnel of, the licensee of an offense that is punishable by imprisonment or may otherwise cast doubt on such persons integrity; (ii) failure without reasonable cause to comply with any material term or condition of the online gaming license; (iii) declaration of, or otherwise engaging in, certain bankruptcy, insolvency, winding-up or discontinuance activities, or an order or application with respect to the same; (iv) obtaining the online gaming license by a materially false or misleading representation or in some other improper way; (v) violation of applicable anti-money laundering or terrorist financing laws or regulations; (vi) failure to meet commitments to users; (vii) failure to pay in a timely manner all online gaming or betting taxes or fees due; or (viii) determination by the gaming authority that there is another material and sufficient reason to revoke or impose another form of sanction upon the licensee.\nWe currently have no active licenses and are in the process of identifying and executing license applications in various states within the U.S. and various foreign countries and jurisdictions. In that regard we have hired a Chief Compliance Officer and are in the process of selecting and engaging legal counsel with specific expertise in this area.\nData Protection and Privacy\nOur acquired technological assets include certain data protections and privacy protections for our anticipated: handling, collection, storage, receiving, transmission and other processes pertaining to certain personal information of expected future users and employees. We do adhere to data and privacy protection regulations in our current marketing activities. Once we have our online gaming license, we expect to be subject to other federal, state and foreign laws related to the privacy and protection of such data.\nOnce operations commence in Europe, we may also face increased privacy, data security and data protection risks in connection with requirements of the General Data Protection Regulation of the European Union (EU) 2016/679 (the GDPR) and other data protection regulations. Any failure to comply with these rules may result in regulatory fines or penalties including orders that require us to change the way we process data. In the event of a data breach, we are also subject to breach notification laws in the jurisdictions in which we operate, including the GDPR, and the risk of litigation and regulatory enforcement actions.\nAny significant change to applicable laws, regulations, interpretations of laws or regulations, or market practices, regarding the use of personal data, or regarding the manner in which we seek to comply with applicable laws and regulations, could require us to make modifications to our products, services, policies, procedures, notices, and business practices, including potentially material changes. Such changes could potentially have an adverse impact on our business.\nCompliance\nWe have hired a Chief Compliance officer. He is currently reviewing and augmenting our existing internal compliance programs to help ensure that we comply with legal and regulatory requirements imposed on us in connection our New Business.\nResponsible and Safer Gaming\nWe view the safety and welfare of our future users as critical to our business and have made or will make appropriate investments in our processes and systems as we enter the marketplace. We have written responsible online gaming policies and are committed to industry-leading responsible online gaming practices as seek to provide our users with the resources and services they need to play responsibly. Additionally, all our employees will take responsible online gaming training with mandatory periodic refresher training, overseen by our compliance team.\nIntellectual Property, Proprietary Rights, Patents and Trademarks\nPrior Business\nOur Prior Business did not have or utilize any patent, trademark or other proprietary rights.\nNew Business\nOur New Business substantially relies on the creation, acquisition, use and protection of intellectual property. Some of this intellectual property is in the form of software code and trade secrets that we use to develop and properly run our online sports betting, eSports, DeFi fintech and other offerings and related services. We also purchase and use proprietary data acquired from other vendors.\nWhile most of the intellectual property we use is created by us, we have obtained rights to use intellectual property of third parties, for both internal business operations and our market offerings, through licenses and service agreements with those third parties. Although we believe these licenses are sufficient for the operation of the company, these licenses typically limit our use of the third parties intellectual property to specific uses and for specific time periods.\nWe protect our intellectual property rights by relying on federal, state, and common law rights, including but not limited to registered trademarks and copyright law, as well as contractual restrictions. We control access to our proprietary technology by entering into confidentiality and invention assignment agreements with our employees and contractors, and confidentiality agreements with third parties. As we increase our B2B business, we will also\nengage in monitoring the activities of third parties with respect to potential infringing uses of our intellectual property.\nWhile some intellectual property is best protected through trade secret and copywrite law, we expect that we may from time to time actively seek patent protection covering inventions originating from us and, from time to time, review opportunities to acquire patents to the extent we believe such patents may be useful or relevant to our business.\nIn addition to these contractual arrangements, we also rely on a combination of trade secret, trademark, trade dress, and domain names to protect our product offerings and other intellectual property. We own the copyright to the software code to our content, as well as trademarks under which our product offerings and related services are marketed. We pursue the registration of our domain names, trademarks, and service marks in the U.S. and in locations outside the U.S. We have a significant number of registered trademarks for products and services, that have been or are being developed in the U.S., including our primary brands such as ZenSports and Ultimate Gamer. Our Burstive brand claims common law protection and we are currently in the process of requesting registration.\nEmployees\nAs of June 30, 2022, we had a total of 15 employees and 7 consultants. Item 1A. Risk Factors\nInvesting in our common stock involves a high degree of risk. You should consider carefully the risks and uncertainties described below, together with all of the other information in this Annual Report, including the consolidated financial statements, the notes thereto and the section entitled Managements Discussion and Analysis of Financial Condition and Results of Operations included elsewhere in this Annual Report before deciding whether to invest in shares of our common stock. The risks and uncertainties described below are not the only ones we face. Additional risks and uncertainties that we are unaware of or that we deem immaterial may also become important factors that adversely affect our business. If any of the following risks actually occur, our business, financial condition, results of operations and future prospects could be materially and adversely affected. In that event, the market price of our common stock could decline, and you could lose part or all of your investment.\nRisks Related to Our Business and Industry\nBecause we have a limited operating history, you may not be able to accurately evaluate our operations.\nWe have had limited operations to date and have generated some revenues. Therefore, we have a limited operating history upon which to evaluate the merits of investing in our company. Potential investors should be aware of the difficulties normally encountered by new companies and the high rate of failure of such enterprises. The likelihood of success must be considered in light of the problems, expenses, difficulties, complications and delays encountered in connection with the operations that we plan to undertake. These potential problems include, but are not limited to, unanticipated problems relating to the ability to generate sufficient cash flow to operate our business, and additional costs and expenses that may exceed current estimates. We expect to incur significant losses into the foreseeable future. We recognize that if the effectiveness of our business plan is not forthcoming, we will not be able to continue business operations. There is no history upon which to base any assumption as to the likelihood that we will prove successful, and it is doubtful that we will generate any operating revenues or ever achieve profitable operations. If we are unsuccessful in addressing these risks, our business will most likely fail.\nOur investors may lose their entire investment because our financial status creates a doubt whether we will continue as a going concern.\nOur auditors, in their opinion dated October 13, 2022 have included a going concern paragraph. We do not have a steady stream of revenues to cover our expenses and we are dependent on outside capital to continue our operations.\nWe are dependent on outside financing for continuation of our operations.\nOur Prior Business only generated some revenues, minimal gross profits to date, and currently operated at a loss. Our New Business is in start-up mode building out our comprehensive platform capability, we currently are not\nlicensed for gambling in any jurisdiction and as such, we are precluded from generating any revenues from our gambling technology and currently have no revenues from our other offerings, we are completely dependent on the continued availability of financing in order to continue our business.\nWe are dependent upon, among other things, achieving a level of profitable operations and receiving additional cash infusions including securing additional lines of credit and raising additional capital through placement of preferred and/or common stock in order to implement its business plan. There can be no assurance that we will be successful in order to continue as a going concern. We are funding its initial operations by securing a related party line of credit, issuing preferred stock, and issuing common stock through private placements.\nWe cannot be certain that capital will be provided when it is required or in amounts sufficient to meet our operating requirements. Management believes the existing stockholders, prospective new investors, and future sales will provide the additional cash needed to meet our obligations as they become due and will allow the development of our core business operations. No assurance can be given that any future financing will be available or, if available, that it will be on terms that are satisfactory to us. Even if we are able to obtain additional financing, it may contain restrictions on our operations, in the case of debt financing, or cause substantial dilution for our stockholders, in case of equity financing.\nOur failure to obtain future financing or to produce levels of revenue to meet our financial needs could result in our inability to continue as a going concern and, as a result, our investors could lose their entire investment.\nWe have a new business model, which makes it difficult for us to forecast our financial results, creates uncertainty as to how investors will evaluate our prospects, and increases the risk that we will not be successful.\nWe recorded revenue of $78,407 and a gross profit of $15,234 for the year ended June 30, 2022. We spent $63,173 in costs of services for the year ended June 30, 2022. Our small gross profit number was caused by high costs for masks from vendors and high courier rates. We have determined that the business as originally conceived (Prior Business) is likely unsustainable and as such, we replaced our management team, hired new employees and are moving forward with the new business model.\nAccordingly, it will be difficult for us to forecast our future financial results, and it will be uncertain how our new business model will affect investors perceptions and expectations of our prospects. Additionally, it may be difficult for investors to evaluate our business due to the lack of similarly situated competitors. Furthermore, our new business model may not be successful. You should not rely upon our historical financial results as indicators of our future financial performance, and our financial results and stock price may be volatile.\nOur New Business is in start-up mode building out our comprehensive platform capability, we currently are not licensed for online gaming in any jurisdiction and as such, we are precluded from generating any revenues from our online gaming technology and currently have no revenues from our other offerings, we are completely dependent on the continued availability of financing in order to continue our business. Without financing sufficient to support our nascent New Business, we will go out of business.\nReductions in discretionary consumer spending could have an adverse effect on our business, financial condition, results of operations and prospects.\nOur New Business is particularly sensitive to reductions from time to time in discretionary consumer spending. Demand for entertainment and leisure activities, including online gaming, can be affected by changes in the economy and consumer tastes, both of which are difficult to predict and beyond our control. Unfavorable changes in general economic conditions, including recessions, economic slowdowns, sustained high levels of unemployment, and rising prices or the perception by consumers of weak or weakening economic conditions, may reduce our prospective users disposable income or result in fewer individuals engaging in entertainment and leisure activities. As a result, we cannot ensure that demand for our offerings will materialize or remain constant. Adverse developments affecting economies throughout the world, including a general tightening of availability of credit, decreased liquidity in certain financial markets, increased interest rates, foreign exchange fluctuations, increased energy costs, acts of war or terrorism, transportation disruptions, natural disasters, declining consumer confidence, sustained high levels of unemployment or significant declines in stock markets, as well as concerns regarding pandemics, epidemics and the spread of contagious diseases, could lead to a further reduction in discretionary spending on leisure activities, such as online gaming.\nOur projections are subject to significant risks, assumptions, estimates and uncertainties, including assumptions regarding future legislation and changes in regulations, both inside and outside of the U.S. As a result, our projected revenues, market share, expenses and profitability may differ materially from our expectations.\nWe operate in rapidly changing and competitive industries and our projections are subject to the risks and assumptions made by management with respect to our industries. Operating results are difficult to forecast because they generally depend on our assessment of the timing of adoption of future legislation and regulations by different states, which are uncertain. Furthermore, if we invest in the development of new products or distribution channels that do not achieve significant commercial success, whether because of competition or otherwise, we may not recover the often substantial up front costs of developing and marketing those products and distribution channels or recover the opportunity cost of diverting management and financial resources away from other products or distribution channels.\nAdditionally, as described above under Reductions in discretionary consumer spending could have an adverse effect on our business, financial condition, results of operations and prospects, our business may be affected by reductions in consumer spending from time to time as a result of a number of factors which may be difficult to predict. This may result in decreased revenue levels, and we may be unable to adopt measures in a timely manner to compensate for any unexpected shortfall in income. This inability could cause our operating results in a given quarter to be higher or lower than expected. If actual results differ from our estimates, analysts may react negatively, and our stock price could be materially impacted.\nOur business may be harmed by fraudulent activities.\nAs an e-commerce business, we may receive in the future, communications from customers due to purported fraudulent activities, including fraudulent activities on our websites such as fraudulent credit card transactions. Negative publicity generated as a result of fraudulent conduct by third parties could damage our reputation and diminish the value of our brand name. Fraudulent activities could also subject us to losses and could lead to scrutiny from lawmakers and regulators regarding the operation of our businesses, including the operation of our websites. We expect to continue to receive requests from customers for reimbursement due to purportedly fraudulent activities or threats of legal action against us if no reimbursement is made.\nDespite our security measures, our information technology and infrastructure may be vulnerable to attacks by hackers or breached due to employee error, malfeasance or other disruptions. Any such breach could compromise our networks and the information stored there could be accessed, publicly disclosed, lost or stolen. Any such access, disclosure or other loss of information could result in legal claims or proceedings, liability under laws that protect the privacy of personal information, and regulatory penalties, disruption of our operations and the services we provide to users, damage to our reputation, and a loss of confidence in our products and services, which could adversely affect our business.\nThe secure maintenance and transmission of user information is a critical element of our operations. Our information technology and other systems that maintain and transmit user information, or those of service providers, business partners or employee information may be compromised by a malicious third- party penetration of our network security, or that of a third-party service provider or business partner, or impacted by intentional or unintentional actions or inaction by our employees, or those of a third- party service provider or business partner. As a result, our users information may be lost, disclosed, accessed or taken without our users consent. We expect that we will be subject to attempts to gain unauthorized access to or through our information systems or those we develop for our customers, whether by our employees or third parties, including cyber-attacks by computer programmers and hackers who may develop and deploy viruses, worms or other malicious software programs. We cannot provide assurance that they will not have a material impact in the future.\nWe rely on encryption and authentication technology licensed from third parties in an effort to securely transmit confidential and sensitive information, including credit card numbers. Advances in computer capabilities, new technological discoveries or other developments may result in the whole or partial failure of this technology to protect transaction data or other confidential and sensitive information from being breached or compromised. In addition, websites are often attacked through compromised credentials, including those obtained through phishing and credential stuffing. Our security measures, and those of our third-party service providers, may not detect or prevent all attempts to breach our systems, denial-of-service attacks, viruses, malicious software, break-ins, phishing attacks, social engineering, security breaches or other attacks and similar disruptions that may jeopardize the security of information stored in or transmitted by our websites, networks and systems or that we or such third\nparties otherwise maintain, including payment card systems, which may subject us to fines or higher transaction fees or limit or terminate our access to certain payment methods. We and such third parties may not anticipate or prevent all types of attacks until after they have already been launched. Further, techniques used to obtain unauthorized access to or sabotage systems change frequently and may not be known until launched against us or our third-party service providers.\nIn addition, security breaches can also occur as a result of non-technical issues, including intentional or inadvertent breaches by our employees or by third parties. These risks may increase over time as the complexity and number of technical systems and applications we use also increases. Breaches of our security measures or those of our third-party service providers or cybersecurity incidents could result in unauthorized access to our sites, networks and systems; unauthorized access to and misappropriation of user information, including users personally identifiable information, or other confidential or proprietary information of ourselves or third parties; viruses, worms, spyware or other malware being served from our sites, networks or systems; deletion or modification of content or the display of unauthorized content on our sites; interruption, disruption or malfunction of operations; costs relating to breach remediation, deployment of additional personnel and protection technologies, response to governmental investigations and media inquiries and coverage; engagement of third-party experts and consultants; litigation, regulatory action and other potential liabilities. If any of these breaches of security should occur and be material, our reputation and brand could be damaged, our business may suffer, we could be required to expend significant capital and other resources to alleviate problems caused by such breaches, and we could be exposed to a risk of loss, litigation or regulatory action and possible liability. We cannot guarantee that recovery protocols and backup systems will be sufficient to prevent data loss. Actual or anticipated attacks may cause us to incur increasing costs, including costs to deploy additional personnel and protection technologies, train employees and engage third-party experts and consultants. While we expect to obtain and maintain cybersecurity insurance coverage that we believe is adequate for our business, such coverage may not cover all potential costs and expenses associated with cybersecurity incidents that may occur in the future.\nIn addition, any party who is able to illicitly obtain a users password could access the users transaction data or personal information, resulting in the perception that our systems are insecure. Any compromise or breach of our security measures, or those of our third-party service providers, could violate applicable privacy, data protection, data security, network and information systems security and other laws and cause significant legal and financial exposure, adverse publicity and a loss of confidence in our security measures, which could have a material adverse effect on our business, financial condition, results of operations and prospects. We devote significant resources to protect against security breaches or we may need to in the future to address problems caused by breaches, including notifying affected subscribers and responding to any resulting litigation, which in turn, diverts resources from the growth and expansion of our business.\nWe rely on other third-party service providers and if such third parties do not perform adequately or terminate their relationships with us, our costs may increase and our business, financial condition and results of operations could be adversely affected.\nOur success depends in part on our relationships with other third-party service providers. For example, we rely on third parties for content delivery, load balancing and protection against distributed denial-of-service attacks. If those providers do not perform adequately, our users may experience issues or interruptions with their experiences. Furthermore, if any of our partners terminates its relationship with us or refuses to renew its agreement with us on commercially reasonable terms, we would need to find an alternate provider, and may not be able to secure similar terms or replace such providers in an acceptable time frame. We also rely on other software and services supplied by third parties, such as communications and internal software, and our business may be adversely affected to the extent such software and services do not meet our expectations, contain errors or vulnerabilities, are compromised or experience outages. Any of these risks could increase our costs and adversely affect our business, financial condition and results of operations. Further, any negative publicity related to any of our third-party partners, including any publicity related to regulatory concerns, could adversely affect our reputation and brand, and could potentially lead to increased regulatory or litigation exposure.\nWe incorporate technology from third parties into our offerings. We cannot be certain that our licensors are not infringing the intellectual property rights of others or that the suppliers and licensors have sufficient rights to the technology in all jurisdictions in which we may operate. Some of our license agreements may be terminated by our licensors for convenience. If we are unable to obtain or maintain rights to any of this technology because of intellectual property infringement claims brought by third parties against our suppliers and licensors or against us, or if we are unable to continue to obtain the technology or enter into new agreements on commercially reasonable\nterms, our ability to develop our offerings containing that technology could be severely limited and our business could be harmed.\nAdditionally, if we are unable to obtain necessary technology from third parties, we may be forced to acquire or develop alternate technology, which may require significant time and effort and may be of lower quality or performance standards. This would limit and delay our ability to provide new or competitive offerings and increase our costs. If alternate technology cannot be obtained or developed, we may not be able to offer certain functionality as part of our offerings, which could adversely affect our business, financial condition and results of operations.\nIf Internet and other technology-based service providers experience service interruptions, our ability to conduct our business may be impaired and our business, financial condition and results of operations could be adversely affected.\nA substantial portion of our network infrastructure is provided by third parties, including Internet service providers and other technology-based service providers. We require technology-based service providers to implement cyber-attack-resilient systems and processes. However, if Internet service providers experience service interruptions, including because of cyber-attacks, or due to an event causing an unusually high volume of Internet use (such as a pandemic or public health emergency), communications over the Internet may be interrupted and impair our ability to conduct our business. Internet service providers and other technology-based service providers may in the future roll out upgraded or new mobile or other telecommunications services, such as 5G or 6G services, which may not be successful and thus may impact the ability of our users to access our offerings in a timely fashion or at all. In addition, our ability to process e-commerce transactions depends on bank processing and credit card systems. To prepare for system problems, we continuously seek to strengthen and enhance our current facilities and the capabilities of our system infrastructure and support. Nevertheless, there can be no assurance that the Internet infrastructure or our own network systems will continue to be able to meet the demand placed on us by the continued growth of the Internet, the overall online gaming industry and our users. Any difficulties these providers face, including the potential of certain network traffic receiving priority over other traffic (i.e., lack of net neutrality), may adversely affect our business, and we exercise little control over these providers, which increases our vulnerability to problems with the services they provide. Any system failure as a result of reliance on third parties, such as network, software or hardware failure, including as a result of cyber-attacks, which causes a loss of our users property or personal information or a delay or interruption in our online services and products and e-commerce services, including our ability to handle existing or increased traffic, could result in a loss of anticipated revenue, interruptions to our offerings, cause us to incur significant legal, remediation and notification costs, degrade the customer experience and cause users to lose confidence in our offerings, any of which could have a material adverse effect on our business, financial condition, results of operations and prospects.\nWe may invest in or acquire other businesses, and our business may suffer if we are unable to successfully integrate acquired businesses into our company or otherwise manage the growth associated with multiple acquisitions.\nAs part of our business strategy, we have made, and we intend to continue to make, acquisitions as opportunities arise to add new or complementary businesses, products, brands or technologies. In some cases, the costs of such acquisitions may be substantial, including as a result of professional fees and due diligence efforts. There is no assurance that the time and resources expended on pursuing a particular acquisition will result in a completed transaction, or that any completed transaction will ultimately be successful. In addition, we may be unable to identify suitable acquisition or strategic investment opportunities, or may be unable to obtain any required financing or regulatory approvals, and therefore may be unable to complete such acquisitions or strategic investments on favorable terms, if at all. We may decide to pursue acquisitions with which our investors may not agree and we cannot assure investors that any acquisition or investment will be successful or otherwise provide a favorable return on investment. In addition, acquisitions and the integration thereof require significant time and resources and place significant demands on our management, as well as on our operational and financial infrastructure. In addition, if we fail to successfully close transactions or integrate new teams, or integrate the products and technologies associated with these acquisitions into our company, our business could be seriously harmed. Acquisitions may expose us to operational challenges and risks, including:\n·the ability to profitably manage acquired businesses or successfully integrate the acquired businesses operations, personnel, financial reporting, accounting and internal controls, technologies and products into our business;\n·increased indebtedness and the expense of integrating acquired businesses, including significant administrative, operational, economic, geographic or cultural challenges in managing and integrating the expanded or combined operations;\n·entry into jurisdictions or acquisition of products or technologies with which we have limited or no prior experience, and the potential of increased competition with new or existing competitors as a result of such acquisitions;\n·diversion of managements attention and the over-extension of our operating infrastructure and our management systems, information technology systems, and internal controls and procedures, which may be inadequate to support growth;\n·the ability to fund our capital needs and any cash flow shortages that may occur if anticipated revenue is not realized or is delayed, whether by general economic or market conditions, or unforeseen internal difficulties; and\n·the ability to retain or hire qualified personnel required for expanded operations.\nOur acquisition strategy may not succeed if we are unable to remain attractive to target companies or expeditiously close transactions. Issuing shares of common stock to fund an acquisition would cause economic dilution to existing stockholders. If we develop a reputation for being a difficult acquirer or having an unfavorable work environment, or target companies view our common stock unfavorably, we may be unable to consummate key acquisition transactions essential to our corporate strategy and our business may be seriously harmed.\nOur growth prospects depend on the legal status of online sports betting and online gaming in various jurisdictions, predominantly within the U.S., and legalization may not occur in as many states as we expect, or may occur at a slower pace than we anticipate. Additionally, even if jurisdictions legalize online sports betting and online gaming, this may be accompanied by legislative or regulatory restrictions and/or taxes that make it impracticable or less attractive to operate in those jurisdictions, or the process of implementing regulations or securing the necessary licenses to operate in a particular jurisdiction may take longer than we anticipate, which could adversely affect our future results of operations and make it more difficult to meet our expectations for financial performance.\nA number of states have legalized, or are currently considering legalizing, online sports betting and online gaming, and our business, financial condition, results of operations and prospects are significantly dependent upon legalization of online sports betting and online gaming. Our business plan is partially based upon the legalization of online sports betting and online gaming for a specific percent of the population on a yearly basis and the legalization may not occur as we have anticipated. Additionally, if a large number of additional states or the federal government enact online sports betting and online gaming legislation and we are unable to obtain, or are otherwise delayed in obtaining the necessary licenses to operate online sports betting or online gaming websites in U.S. jurisdictions where such games are legalized, our future growth in online sports betting and online gaming could be materially impaired.\nAs we enter into new jurisdictions, states or the federal government may legalize online sports betting and online gaming in a manner that is unfavorable to us. As a result, we may encounter legal, regulatory and political challenges that are difficult or impossible to foresee and which could result in an unforeseen adverse impact on planned revenues or costs associated with the new opportunity. For example, states may require us to have a relationship with a retail operator for online sports betting access, which tends to increase our costs of revenue. States that have established state-run monopolies may limit opportunities for private sector participants like us. States also impose substantial tax rates on online sports betting and online gaming revenue, in addition to the federal excise tax of 25 basis points on the amount of each wager. As most state product taxes apply to various measures of modified gross profit, tax rates, whether federal- or state-based, that are higher than we expect will make it more costly and less desirable for us to launch in a given jurisdiction, while tax increases in any of our existing jurisdictions may adversely impact our profitability.\nTherefore, even in cases in which a jurisdiction purports to license and regulate online sports betting or online gaming, the licensing and regulatory regimes can vary considerably in terms of their business-friendliness and at times may be intended to provide incumbent operators with advantages over new licensees. Therefore, some liberalized regulatory regimes are considerably more commercially attractive than others.\nFailure to comply with regulatory requirements in a particular jurisdiction, or the failure to successfully obtain a license or permit applied for in a particular jurisdiction, could impact our ability to comply with licensing and regulatory requirements in other jurisdictions, or could cause the rejection of license applications or cancellation of existing licenses in other jurisdictions, or could cause financial institutions, online and mobile platforms, advertisers and distributors to stop providing services to us which we will need to rely upon to receive payments from, or distribute amounts to, our users, or otherwise to deliver and promote our services.\nCompliance with the various regulations applicable to online sports betting and online gaming is costly and time-consuming. Regulatory authorities at the non-U.S., U.S. federal, state and local levels have broad powers with respect to the regulation and licensing of online sports betting and online gaming operations and may refuse to issue, revoke, suspend, condition or limit our online sports betting or online gaming licenses, impose substantial fines on us and take other actions, any one of which could have a material adverse effect on our business, financial condition, results of operations and prospects. These laws and regulations are dynamic and subject to potentially differing interpretations, and various legislative and regulatory bodies may expand current laws or regulations or enact new laws and regulations regarding these matters. We will strive to comply with all applicable laws and regulations relating to our business. It is possible, however, that these requirements may be interpreted and applied in a manner that is inconsistent from one jurisdiction to another and may conflict with other rules. Non-compliance with any such law or regulations could expose us to claims, proceedings, litigation and investigations by private parties and regulatory authorities, as well as substantial fines and negative publicity, each of which may materially and adversely affect our business.\nAny online sports betting or online gaming license could be denied, and if issued could be revoked, suspended or conditioned at any time. The loss of a license in one jurisdiction could trigger the loss of a license or affect our eligibility for such a license in another jurisdiction, and any of such losses, or potential for such loss, could cause us to cease offering some or all of our offerings in the impacted jurisdictions. We may be unable to obtain or maintain all necessary registrations, licenses, permits or approvals, and could incur fines or experience delays related to the licensing process, which could adversely affect our operations. Our delay or failure to obtain or maintain licenses in any jurisdiction may prevent us from distributing our offerings, increasing our customer base and/or generating revenues. We cannot assure you that we will be able to obtain and maintain the licenses and related approvals necessary to conduct our planned New Business operations. Any failure to obtain, maintain or renew licenses, registrations, permits or approvals could have a material adverse effect on our business, financial condition, results of operations and prospects.\nOur growth prospects and market potential will depend on our ability to obtain licenses to operate in a number of jurisdictions and if we fail to obtain such licenses our business, financial condition, results of operations and prospects could be impaired.\nOur ability to grow our business will depend on our ability to obtain and maintain licenses to offer our product offerings in a large number of jurisdictions or in heavily populated jurisdictions. If we fail to obtain and maintain licenses in large jurisdictions or in a greater number of mid-market jurisdictions, this may prevent us from expanding the footprint of our product offerings, increasing our user base and/or generating revenues. We cannot be certain that we will be able to obtain and maintain licenses and related approvals necessary to conduct our proposed business operations. Any failure to obtain and maintain licenses, registrations, permits or approvals could have a material adverse effect on our business, financial condition, results of operations and prospects.\nGiven our business, we may the subject of governmental investigations and inquiries with respect to the operation of our businesses and we could be subject to future governmental investigations and inquiries, legal proceedings and enforcement actions. Any such investigation, inquiry, proceeding or action, could adversely affect our business.\nWe may receive formal and informal inquiries from time to time, from government authorities and regulators, including tax authorities and gaming regulators, regarding compliance with laws and other matters, particularly as we grow and expand our operations. Violation of existing or future regulations, regulatory orders or consent decrees could subject us to substantial monetary fines and other penalties that could negatively affect our financial condition and results of operations. In addition, it is possible that future orders issued by, or inquiries or enforcement actions initiated by, government or regulatory authorities could cause us to incur substantial costs, expose us to unanticipated liability or penalties, or require us to change our business practices in a manner materially adverse to our business.\nWe allow our customers in certain markets to buy, hold and sell certain cryptocurrencies as well as use the proceeds from sales of cryptocurrencies to pay for purchases or services as well as deposit into a properly onboarded online gaming account.\nThese cryptocurrencies consist of Bitcoin, USDT, and ICX. We engage third parties, which are properly licensed entities, to provide certain custodial services, including holding our customers cryptographic key information, securing our customers crypto assets, and protecting them from loss or theft, including indemnification against certain types of losses such as theft. Our third-party custodian holds the crypto assets in a custodial account in our name for the benefit of our customers. We maintain the internal recordkeeping of our customers crypto assets, including the amount and type of crypto asset owned by each of our customers in that custodial account. As such, since we currently utilize one third-party custodian, there is concentration risk in the event the custodian is not able to perform in accordance with our agreement.\nA particular crypto assets status as a security in any relevant jurisdiction is subject to a high degree of uncertainty and if we are unable to properly characterize a crypto asset, we may be subject to regulatory scrutiny, inquiries, investigations, fines, and other penalties, which may adversely affect our business, operating results, and financial condition.\nThe Securities Exchange Commission (SEC) and its staff have taken the position that certain crypto assets fall within the definition of a security under the U.S. federal securities laws. The legal test for determining whether any given crypto asset is a security is a highly complex, fact-driven analysis that evolves over time, and the outcome is difficult to predict. The SEC generally does not provide advance guidance or confirmation on the status of any particular crypto asset as a security. Furthermore, the SECs views in this area have evolved over time and it is difficult to predict the direction or timing of any continuing evolution. It is also possible that a change in the governing administration or the appointment of new SEC commissioners could substantially impact the views of the SEC and its staff. For example, Chair Gary Gensler has repeatedly remarked on the need for further regulatory oversight on crypto assets, crypto trading, and lending platforms by the SEC. Public statements made in the past by senior officials at the SEC have indicated that the SEC does not intend to take the position that Bitcoin or Ethereum are securities (in their current form). In May 2022, Chairman of the Commodity Futures Trading Commission (CFTC), Rostin Behnam stated that Bitcoin and Ethereum are commodities. However, in June 2022, Mr. Gensler suggested that Bitcoin is a commodity but did not opine on the status of other crypto assets. Such statements or efforts by officials at the CFTC and SEC are not official policy statements by these agencies and reflect only the speakers views, which are not binding on any agency or court and cannot be generalized to any other crypto asset. Also, through the SECs Strategic Hub for Innovation and Innovation and Financial Technology published a framework for analyzing whether any given crypto asset is a security in April 2019, this framework is also not a rule, regulation or statement of the SEC and is not binding on the SEC. Despite the SEC being the principal federal securities law regulator in the U.S., whether or not an asset is a security under federal securities laws is ultimately determined by a federal court.\nSeveral foreign jurisdictions have taken a broad-based approach to classifying crypto assets as securities, while other foreign jurisdictions, such as Switzerland, Malta, and Singapore, have adopted a narrower approach. As a result, certain crypto assets may be deemed to be a security under the laws of some jurisdictions but not others. Various foreign jurisdictions may, in the future, adopt additional laws, regulations, or directives that affect the characterization of crypto assets as securities.\nThe classification of a crypto asset as a security under applicable law has wide-ranging implications for the regulatory obligations that flow from the offer, sale, trading, and clearing of such assets. For example, a crypto asset that is a security in the U.S. may generally only be offered or sold in the U.S. pursuant to a registration statement filed with the SEC or in an offering that qualifies for an exemption from registration. Persons that effect transactions in crypto assets that are securities in the U.S. may be subject to registration with the SEC as a broker or dealer. Platforms that bring together purchasers and sellers to trade crypto assets that are securities in the U.S. are generally subject to registration as national securities exchanges, or must qualify for an exemption, such as by being operated by a registered broker-dealer as an Alternative Trading System (ATS) in compliance with rules for ATSs. Persons facilitating clearing and settlement of securities may be subject to registration with the SEC as a clearing agency. Foreign jurisdictions may have similar licensing, registration, and qualification requirements.\nWe have policies and procedures to analyze whether each crypto asset that we seek to facilitate trading on our platform could be deemed to be a security under applicable laws. Our policies and procedures do not constitute a\nlegal standard, but rather represent our company-developed model, which we use to make a risk-based assessment regarding the likelihood that a particular crypto asset could be deemed a security under applicable laws. Regardless of our conclusions, we could be subject to legal or regulatory action in the event the SEC, a state or foreign regulatory authority, or a court were to determine that a supported crypto asset currently offered, sold, or traded on our platform is a security under applicable laws.\nBecause our platform is not registered or licensed with the SEC or foreign authorities as a broker-dealer, national securities exchange, or ATS (or foreign equivalents), and we do not seek to register or rely on an exemption from such registration or license to facilitate the offer and sale of crypto assets on our platform, we only permit trading on our core platform of those crypto assets for which we determine there are reasonably strong arguments to conclude that the crypto asset is not a security. We believe that our process reflects a comprehensive and thoughtful analysis and is reasonably designed to facilitate consistent application of available legal guidance to crypto assets to facilitate informed risk-based business judgment. However, we recognize that the application of securities laws to the specific facts and circumstances of crypto assets may be complex and subject to change, and that a listing determination does not guarantee any conclusion under the U.S. federal securities laws. Accordingly, we expect our risk assessment policies and procedures to continuously evolve to take into account case law, facts, and developments in technology.\nThere can be no assurances that we will properly characterize any given crypto asset as a security or non-security for purposes of determining whether our platform will support trading of the crypto asset, or that the SEC, foreign regulatory authority, or a court, if the question was presented to it, would agree with our assessment. If an applicable regulatory authority or a court, in either case having final determinative authority on the topic, were to determine that a supported crypto asset currently offered, sold, or traded on our platform is a security, we would not be able to offer such crypto asset for trading until we are able to do so in a compliant manner. A determination by the SEC, a state or foreign regulatory authority, or a court that an asset that we currently support for trading on our platform constitutes a security may result in removing that crypto asset from our platform and may also result in us determining that it is advisable to remove assets from our platform that have similar characteristics to the asset that was alleged or determined to be a security. Alternatively, we may determine not to remove a particular crypto asset from our platform even if the SEC or another regulator alleges that the crypto asset is a security, pending a final judicial determination as to that crypto assets proper characterization, and the fact that we waited for a final judicial determination would generally not preclude penalties or sanctions against us for our having previously made our platform available for trading that crypto asset without registering as a national securities exchange or ATS. As such, we could be subject to judicial or administrative sanctions for failing to offer or sell the crypto asset in compliance with the registration requirements, or for acting as a broker, dealer, or national securities exchange without appropriate registration. Such an action could result in injunctions, cease and desist orders, as well as civil monetary penalties, fines, and disgorgement, criminal liability, and reputational harm. Customers that traded such supported crypto asset on our platform and suffered trading losses could also seek to rescind a transaction that we facilitated as the basis that it was conducted in violation of applicable law, which could subject us to significant liability. We may also be required to cease facilitating transactions in the supported crypto asset other than via our licensed subsidiaries, which could negatively impact our business, operating results, and financial condition. Furthermore, if we remove any assets from trading on our platform, our decision may be unpopular with users and may reduce our ability to attract and retain customers, especially if such assets remain traded on unregulated exchanges, which includes many of our competitors.\nFurther, if Bitcoin, Ethereum, or any other supported crypto asset is deemed to be a security under any U.S. federal, state, or foreign jurisdiction, or in a proceeding in a court of law or otherwise, it may have adverse consequences for such supported crypto asset. For instance, all transactions in such supported crypto asset would have to be registered with the SEC or other foreign authority, or conducted in accordance with an exemption from registration, which could severely limit its liquidity, usability and transactability. Moreover, the networks on which such supported crypto assets are utilized may be required to be regulated as securities intermediaries, and subject to applicable rules, which could effectively render the network impracticable for its existing purposes. Further, it could draw negative publicity and a decline in the general acceptance of the crypto asset. Also, it may make it difficult for such supported crypto asset to be traded, cleared, and custodied as compared to other crypto assets that are not considered to be securities. Specifically, even if transactions in a crypto asset were registered with the SEC or conducted in accordance with an exemption from registration, the current intermediary-based framework for securities trading, clearance and settlement is not consistent with the operations of the crypto asset market. For example, under current SEC guidance, crypto asset securities cannot be held on behalf of customers by broker-dealers that also support custody of traditional securities; and the SEC has not permitted public permissionless blockchain-based clearance and settlement systems for securities.\nWe may have difficulty accessing the service of banks, credit card issuers and payment processing services providers, which may make it difficult to sell our products and services.\nAlthough financial institutions and payment processors are permitted to provide services to us and others in our industry, banks, credit card issuers and payment processing service providers may be hesitant to offer banking and payment processing services to online sports betting and online gaming businesses. Consequently, those businesses involved in our industry, including our own, may encounter difficulties in establishing and maintaining banking and payment processing relationships with a full scope of services and generating market rate interest. If we were unable to maintain our bank accounts or our users were unable to use their credit cards, bank accounts or e-wallets to make deposits and withdrawals from our offerings it would make it difficult for us to operate our business, increase our operating costs, and pose additional operational, logistical and security challenges which could result in an inability to implement our business plan.\nIf we are unable to hire and retain key personnel, we may not be able to implement our business plan.\nDue to the specified nature of our New Business, having certain key personnel is essential to the development and marketing of the products and services we plan to sell and thus to the entire business itself. Our officer and director, John Linss, and our officer, Anthony J. Fidaleo, are instrumental in the viability of our business and our future success. Consequently, the loss of either of those individuals may have a substantial effect on our future success or failure. We may have to recruit qualified personnel with competitive compensation packages, equity participation, and other benefits that may affect the working capital available for our operations. Management may have to seek to obtain outside independent professionals to assist them in assessing the merits and risks of any business proposals as well as assisting in the development and operation of many company projects. No assurance can be given that we will be able to obtain such needed assistance on terms acceptable to us. Our failure to attract additional qualified employees or to retain the services of key personnel could have a material adverse effect on our operating results and financial condition.\nOur commercial success depends significantly on our ability to develop and commercialize our products without infringing the intellectual property rights of third parties.\nOur commercial success will depend, in part, on operating our business without infringing the trademarks or proprietary rights of third parties. Third parties that believe we are infringing on their rights could bring actions against us claiming damages and seeking to enjoin the development, marketing and distribution of our products. If we become involved in any litigation, it could consume a substantial portion of our resources, regardless of the outcome of the litigation. If any of these actions are successful, we could be required to pay damages and/or to obtain a license to continue to develop or market our products, in which case we may be required to pay substantial royalties. However, any such license may not be available on terms acceptable to us or at all. Ultimately, we could be prevented from commercializing a product or forced to cease some aspect of our business operations as a result of patent infringement claims, which would harm our business.\nBecause the Chairman of the Board beneficially owns stock representing a majority of the total voting power of our outstanding stock, you may not have any influence in the corporate decisions of the company, including the election of directors.\nOur current Chairman of the Board, Bruce Cassidy, through his companies Eagle Investment Group, LLC and Excel Family Partners, LLLP, beneficially owns outstanding voting securities representing 51.2% of the total voting power of our outstanding common stock and preferred stock. Currently, there are 39,230,000 shares of common stock outstanding that entitle the holders to 1 vote per share for a total of 39,230,000 votes. We also have 11,693 shares of Series B preferred stock outstanding that have the right to 100 votes per share for a total of 1,169,300 votes, and 5,813,331 shares of Series C preferred stock outstanding that have the right to 1 vote per share for a total of 5,813,331 votes. Thus, there are a total of 46,212,631 total votes available and Mr. Cassidy controls 23,663,966 votes for 51.2% voting power over the company.\nAs a result, Mr. Cassidy has a majority of the voting power in all matters submitted to our stockholders for approval including:\n·Election of members of the Board;\n·Removal of any of our directors;\n·Amendment of our Certificate of Incorporation or bylaws;\n·Adoption of measures that could delay or prevent a change in control or impede a merger, takeover or other business combination involving us.\nAs a result of his ownership and position, Mr. Cassidy is able to substantially influence all matters requiring stockholder approval, including the election of directors and approval of significant corporate transactions. In addition, the future prospect of sales of significant amounts of shares held by Mr. Cassidy could affect the market price of our common stock if the marketplace does not orderly adjust to the increase in shares in the market and the value of your investment in our company may decrease. Mr. Cassidys stock ownership may discourage a potential acquirer from making a tender offer or otherwise attempting to obtain control of us, which in turn could reduce our stock price or prevent our stockholders from realizing a premium over our stock price.\nCompliance with changing regulation of corporate governance and public disclosure may result in additional expenses.\nChanging laws, regulations and standards relating to corporate governance and public disclosure, including the Sarbanes-Oxley Act of 2002 and new SEC regulations, are creating uncertainty for companies such as ours. These new or changed laws, regulations and standards are subject to varying interpretations in many cases due to their lack of specificity, and as a result, their application in practice may evolve over time as new guidance is provided by regulatory and governing bodies, which could result in continuing uncertainty regarding compliance matters and higher costs necessitated by ongoing revisions to disclosure and governance practices. We are committed to maintaining high standards of corporate governance and public disclosure. As a result, we intend to invest resources to comply with evolving laws, regulations and standards, and this investment may result in increased general and administrative expenses and a diversion of management time and attention from revenue-generating activities to compliance activities. If our efforts to comply with new or changed laws, regulations and standards differ from the activities intended by regulatory or governing bodies due to ambiguities related to practice, our reputation may be harmed.\nIf we fail to comply with the new rules under the Sarbanes-Oxley Act related to accounting controls and procedures, or if material weaknesses or other deficiencies are discovered in our internal accounting procedures, our stock price could decline significantly.\nSection 404 of the Sarbanes-Oxley Act requires annual management assessments of the effectiveness of our internal controls over financial reporting and a report by our independent auditors addressing these assessments. We are in the process of documenting and testing our internal control procedures, and we may identify material weaknesses in our internal control over financial reporting and other deficiencies. If material weaknesses and deficiencies are detected, it could cause investors to lose confidence in our Company and result in a decline in our stock price and consequently affect our financial condition. In addition, if we fail to achieve and maintain the adequacy of our internal controls, we may not be able to ensure that we can conclude on an ongoing basis that we have effective internal controls over financial reporting in accordance with Section 404 of the Sarbanes-Oxley Act. Moreover, effective internal controls, particularly those related to revenue recognition, are necessary for us to produce reliable financial reports and are important to helping prevent financial fraud. If we cannot provide reliable financial reports or prevent fraud, our business and operating results could be harmed, investors could lose confidence in our reported financial information, and the trading price of our Common Stock could drop significantly. In addition, we cannot be certain that additional material weaknesses or significant deficiencies in our internal controls will not be discovered in the future.\nAs an emerging growth company under the JOBS Act, we are permitted to rely on exemptions from certain disclosure requirements.\nWe qualify as an emerging growth company under the JOBS Act. As a result, we are permitted to, and intend to, rely on exemptions from certain disclosure requirements. For so long as we are an emerging growth company, we will not be required to:\n·have an auditor report on our internal controls over financial reporting pursuant to Section 404(b) of the Sarbanes-Oxley Act;\n·comply with any requirement that may be adopted by the Public Company Accounting Oversight Board regarding mandatory audit firm rotation or a supplement to the auditors report providing additional information about the audit and the consolidated financial statements (i.e., an auditor discussion and analysis);\n·submit certain executive compensation matters to stockholder advisory votes, such as say-on-pay and say-on-frequency; and\n·disclose certain executive compensation related items such as the correlation between executive compensation and performance and comparisons of the Chief Executives compensation to median employee compensation.\nIn addition, Section 107 of the JOBS Act also provides that an emerging growth company can take advantage of the extended transition period provided in Section 7(a)(2)(B) of the Securities Act for complying with new or revised accounting standards. In other words, an emerging growth company can delay the adoption of certain accounting standards until those standards would otherwise apply to private companies. We have elected to take advantage of the benefits of this extended transition period. Our consolidated financial statements may therefore not be comparable to those of companies that comply with such new or revised accounting standards.\nWe will remain an emerging growth company until the earliest of: (i) the last day of the first fiscal year in which our total annual gross revenues exceed $1.07 billion; (ii) the date that we become a large accelerated filer as defined in Rule 12b-2 under the Securities Exchange Act of 1934, which would occur if the market value of our ordinary shares that is held by non-affiliates exceeds $700 million as of the last business day of our most recently completed second fiscal quarter; (iii) the date on which we have issued more than $1 billion in non-convertible debt during the preceding three year period; or (iv) June 30, 2026. Even if we no longer qualify for the exemptions for an emerging growth company, we may still be, in certain circumstances, subject to scaled disclosure requirements as a smaller reporting company. For example, smaller reporting companies, like emerging growth companies, are not required to provide a compensation discussion and analysis under Item 402(b) of Regulation S-K or auditor attestation of internal controls over financial reporting.\nUntil such time, however, we cannot predict if investors will find our common stock less attractive because we may rely on these exemptions. If some investors find our common stock less attractive as a result, there may be a less active trading market for our common stock and our stock price may be more volatile.\nRisks Related to Our Securities\nOur common stock price may be volatile and could fluctuate widely in price, which could result in substantial losses for investors.\nThe market price of our common stock is likely to be highly volatile and could fluctuate widely in price in response to various factors, many of which are beyond our control, including:\n·technological innovations or new products and services by us or our competitors;\n·government regulation of our products and services;\n·the establishment of partnerships with other technology companies;\n·intellectual property disputes;\n·additions or departures of key personnel;\n·sales of our common stock\n·our ability to integrate operations, technology, products and services;\n·our ability to execute our business plan;\n·operating results below expectations;\n·loss of any strategic relationship;\n·industry developments;\n·economic and other external factors; and\n·period-to-period fluctuations in our financial results.\nBecause we are an emerging growth company with nominal revenues to date, you should consider any one of these factors to be material. Our stock price may fluctuate widely as a result of any of the above. In addition, the securities markets have from time-to-time experienced significant price and volume fluctuations that are unrelated to the operating performance of particular companies. These market fluctuations may also materially and adversely affect the market price of our common stock.\nWe have not paid cash dividends in the past and do not expect to pay cash dividends in the future on our common stock. Any return on investment may be limited to the value of our common stock.\nWe have never paid cash dividends on our common stock and do not anticipate paying cash dividends in the foreseeable future. The payment of cash dividends on our common stock will depend on earnings, financial condition and other business and economic factors at such time as the board of directors may consider relevant. If we do not pay cash dividends, our common stock may be less valuable because a return on your investment will only occur if its stock price appreciates.\nOur shares will be subject to the Penny Stock Reform Act, which will affect your ability to sell your shares in any secondary market, which may develop. If our shares are not listed on a nationally approved exchange or NASDAQ, we do not meet certain minimum financing requirements, or have a bid price of at least $5.00 per share, they will likely be defined as a penny stock. Broker-dealer practices, in connection with transactions in penny stocks, are regulated by the SEC. Rules associated with transactions in penny stocks include the following:\n·the delivery of standardized risk disclosure documents;\n·the provision of other information such as current bid/offer quotations, compensation to be provided broker-dealer and salesperson, monthly accounting for penny stocks held in the customers account;\n·written determination that the penny stock is a suitable investment for purchaser;\n·written agreement to the transaction from purchaser; and\n·a two-business day delay prior to execution of a trade\nThese disclosure requirements and the wide fluctuations that penny stocks often experience in the market may make it difficult for you to sell your shares in any secondary market, which may develop.\nRule 144 sales in the future may have a depressive effect on our stock price as an increase in supply of shares for sale, with no corresponding increase in demand will cause prices to fall.\nAll of the outstanding shares of common stock held by the present officers, directors, and affiliate stockholders are restricted securities within the meaning of Rule 144 under the Securities Act of 1933, as amended. As restricted shares, these shares may be resold only pursuant to an effective registration statement or under the requirements of Rule 144 or other applicable exemptions from registration under the Act and as required under applicable state securities laws. Rule 144 provides in essence that a person who is an affiliate or officer or director who has held restricted securities for six months may, under certain conditions, sell every three months, in brokerage transactions, a number of shares that does not exceed the greater of 1.0% of a companys outstanding common stock. There is no limit on the amount of restricted securities that may be sold by a non-affiliate after the owner has held the restricted securities for a period of six months if the company is a current reporting company under the 1934 Act. A sale under Rule 144 or under any other exemption from the Act, if available, or pursuant to subsequent registration of shares of common stock of present stockholders, may have a depressive effect upon the price of the common stock in any market that may develop.\nFINRA sales practice requirements may also limit a stockholders ability to buy and sell our stock.\nIn addition to the penny stock rules described above, the Financial Industry Regulatory Authority (FINRA) has adopted rules that require that in recommending an investment to a customer, a broker-dealer must have reasonable grounds for believing that the investment is suitable for that customer. Prior to recommending speculative low priced securities to their non-institutional customers, broker-dealers must make reasonable efforts to obtain information about the customers financial status, tax status, investment objectives and other information. Under interpretations of these rules, FINRA believes that there is a high probability that speculative low priced securities will not be suitable for at least some customers. FINRA requirements make it more difficult for broker-dealers to recommend that their customers buy our common stock, which may limit your ability to buy and sell our stock and have an adverse effect on the market for our shares. Item 1B. Unresolved Staff comments\nNone Item 2. Properties\nCurrently, we do not own any real estate, but are on a month-to-month lease for limited office space in Las Vegas, Nevada. We have a mailbox service at 8400 W. Sunset Road, Las Vegas, Nevada 89113. Our phone number: (866)\n783-9435\nWe believe that our current lease is adequate for our current needs, but growth potential may require larger facilities due to anticipated addition of personnel. We do not have any policies regarding investments in real estate, securities or other forms of property. Item 3. Legal Proceedings\nWe have no current legal proceedings. Item 4. Mine Safety Disclosures\nNot applicable.\nPART II Item 5. Market for Registrants Common Equity and Related Stockholder Matters and Issuer Purchases of Equity Securities\nMarket Information\nShares of our common stock are listed for quotation on the OTC Markets Groups Pink Open Market under the symbol KEYR. Our shares, however, are not actively traded and there is currently no established public trading market for our shares of common stock. Any quotations that do occur reflect inter-dealer prices, without retail mark-up, mark-down or commission and may not represent actual transactions.\nHolders of Our Common Stock\nAs of October 10, 2022, we had 39,230,000 shares of our common stock issued and outstanding, held by approximately 55 stockholders of record.\nDividends\nWe currently intend to retain future earnings for the operation of our business. We have never declared or paid cash dividends on our common stock, and we do not anticipate paying any cash dividends in the foreseeable future.\nIn the event that a dividend is declared, common stockholders on the record date are entitled to share ratably in any dividends that may be declared from time to time on the common stock by the Board from funds legally available.\nThere are no restrictions in our articles of incorporation or bylaws that restrict us from declaring dividends. The Nevada Revised Statutes, however, do prohibit us from declaring dividends where, after giving effect to the distribution of the dividend:\n1.We would not be able to pay our debts as they become due in the usual course of business; or\n2.Our total assets would be less than the sum of our total liabilities, plus the amount that would be needed to satisfy the rights of shareholders who have preferential rights superior to those receiving the distribution.\nRecent Sales of Unregistered Securities\nDuring our fiscal year ended June 30, 2022, all sales of equity securities that were not registered under the Securities Act were previously reported in a Quarterly Report on Form 10-Q or in a Current Report on Form 8-K.\nPurchase of Equity Securities by the Issuer and Affiliated Purchasers\nWe did not purchase any of our shares of our equity securities that are registered by us pursuant to Section 12 of the Exchange Act during our fourth quarter of our fiscal year ended June 30, 2022.. Item 6. Selected Financial Data\nNot required under Regulation S-K for smaller reporting companies. Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion of our financial condition and results of operations should be read in conjunction with our audited consolidated financial statements and the related notes thereto and other financial information appearing elsewhere in this Annual Report. The following discussion contains forward-looking statements that reflect our plans, estimates, and beliefs. Our actual results could differ materially from those discussed in the forward-looking statements. Factors that could cause or contribute to these differences include those discussed below and elsewhere in this Annual Report, particularly in the section titled Risk Factors.\nResults of Operations\nFiscal Year Ended June 30, 2022, Compared to Fiscal Year Ended June 30, 2021\nRevenues and Costs of Revenues\nRevenues for the years ended June 30, 2022, and 2021 were $78,407 and $47,172, respectively. Costs of revenues for the years ended June 30, 2022, and 2021 were $63,173 and $43,932, respectively. Our sales and gross profits principally increased as a result of higher margin convention services revenues of $67,056 for the year ended June 30, 2022, compared with $0 for the year ended June 30, 2021.\nOperating Expenses\nOperating expenses for the years ended June 30, 2022, and 2021 were $648,160 and $48,883, respectively.\nOur operating expenses consisted of general and administrative costs and salaries and wages. The significant increase in operating expenses during the year ended June 30, 2022, compared to the year ended June 30, 2021, was primarily due to an increase in general and administrative costs of $335,065 and salaries and wages of $264,212 during the year ended June 30, 2022, compared to the year ended June 30, 2021.\nGeneral and Administrative Expenses\nGeneral and administrative costs for the years ended June 30, 2022, and 2021 were $383,948 and $48,476, respectively. The increase was due to significant legal and professional fees during the last half of the year ended June 30, 2022, that were principally related to funding raises, and exploring and hiring personnel as part of the transition from our Prior Business to our New Business.\nSalaries and Wages\nSalaries and wages of $264,212 were incurred during the year ended June 30, 2022, compared to $0 during the year ended June 30, 2021. The increase is due to the hiring of new executives and key personnel on June 16, 2022, as part of our transition from our Prior Business to our New Business.\nOther Expenses\nOther expenses for the years ended June 30, 2022, and 2021 were $830,150 and $5,995, respectively. The increase is primarily due to the recording of the $821,307 non-cash loss on the extinguishment of related party debt. The loss was recorded as part of a transaction where the noteholder Zixiao Chen, our former Chief Financial Officer, transferred her ownership in a $10,000 convertible note payable to another entity that is controlled by Bruce Cassidy, our former Chief Executive Officer through June 14, 2022, a member and Chairman of the Board. The Company and the new noteholder mutually agreed to allow the note to be converted into Series B preferred stock at the conversion price of $1.00 per share. The principal balance and accrued interest were converted into 11,693 shares of Series B preferred stock. The fair value of the stock was $833,000, and we recorded a loss on the extinguishment of debt of $821,307.\nNet Loss\nOur net loss for the years ended June 30, 2022, and 2021 was $1,463,076 and $51,638, respectively. The significant increase in the net loss is primarily related to the above-noted increase in legal and professional fees, compensation,\nand the non-cash loss from the extinguishment of related party debt, all related to our transition from our Prior Business to our New Business.\nLiquidity and Capital Resources\nLiquidity is the ability of a company to generate funds to support its current and future operations, satisfy its obligations, and otherwise operate on an ongoing basis. Significant factors in the management of liquidity are funds generated by operations, levels of accounts payable and accrued expenditures, and capital expenditures, including the costs associated with internally developed software and attaining Gaming licenses.\nAs of June 30, 2022, and June 30, 2021, we had total current assets of $76,296, and $107,050, a working capital deficit of $537,113, and $4,277, respectively.\nNet cash used in operating activities during the year ended June 30, 2022, was $280,596 compared to $10,182, for the year ended June 30, 2021.\nThe $270,414 increase in negative operating cash flow from operations during the year ended June 30, 2022, as compared to the year ended June 30, 2021, is principally the result of the $264,212 increase in salaries and wages and $328,006 in legal and professional fees associated with our hiring new employees, fundraising, and other legal and professional costs associated with our transition from our Prior Business to our New Business, offset by an increase in accrued salaries and wages of $213,166 and an increase in accounts payable of $127,572.\nNet cash provided by financing activities during the year ended June 30, 2022, was $258,272 compared to $60,829 for the year ended June 30, 2021.\nThe $197,443 increase in net cash provided from financing activities during the year ended June 30, 2022, as compared to the year ended June 30, 2021, was principally the result of the receipt of $97,240 in net proceeds from the issuance of Series C preferred stock and $166,539 in proceeds from the issuance of common stock, all from related parties, during the year ended June 30, 2022. This compares to proceeds of $30,000 in notes payable from a related party, and $39,977 in proceeds from the issuance of common stock to a related party during the year ended June 30, 2021.\nWe were incorporated on April 16, 2020. Our operations from our Prior Business, to date, have been devoted primarily to startup, development activities, preparing our eCommerce site, establishing vendors for our products, collecting inventory, selling products, and other activities. As part of our transition to our New Business, on August 26, 2022, we entered into an Asset Purchase Agreement to purchase certain technology assets from ZenSports, Inc. We purchased the assets so we could offer gambling and entertainment opportunities through technology, principally the online gaming technology and use of the name ZenSports.\nOn September 12, 2022, we entered into an Asset Purchase Agreement with Excel Members, LLC (Excel), a company controlled by Bruce Cassidy, (our former Chief Executive Officer through June 14, 2022) a member and Chairman of the Board, to acquire certain assets from Excel. Excel acquired certain assets of Ultimate Gamer, LLC, a company that used to host eSports tournaments, through an assignment for the benefit of the creditors court process.\nOn September 15, 2022, we entered into an agreement to assign all of our rights in our Prior Business, including certain assets and liabilities, to TopSight Corporation, a company owned by Zixiao Chen, our former Chief Financial Officer.\nAs of the filing date of this Annual Report, we have ceased all operations relating to our Prior Business and commenced executing our business plan for our New Business. Since our New Business has no history of generating revenues or operating successfully, we will be dependent upon, among other things, achieving a level of profitable operations and receiving additional cash infusions including securing additional lines of credit and raising additional capital through the placement of preferred and/or common stock in order to implement our business plan. Because of our limited operating history, it is difficult to predict our capital needs on a monthly, quarterly, or annual basis. We will have no capital available to us if we are unable to raise money through private equity offerings or find alternate forms of financing, which we do not have in place at this time.\nWe expect our revenues to significantly decrease in the short term as we transition from our Prior Business to our New Business.\nWe expect to incur significant increases in operating costs as we incur the costs of transitioning from our Prior Business to our New Business and begin to execute our New Business operating plan. The expected significant increases in costs will include, but not be limited to, costs relating to obtaining licenses, technology development, sales and marketing, legal and professional.\nGoing Concern\nOur consolidated financial statements are prepared using the accrual method of accounting in accordance with accounting principles generally accepted in the U.S. and have been prepared on a going concern basis, which contemplates the realization of assets and the settlement of liabilities in the normal course of business. We had an accumulated deficit of $1,522,307 as of June 30, 2022. We had a net loss of $1,463,076 and negative cash flows of $280,596 from operations for the year ended June 30, 2022. These conditions raise substantial doubt about our ability to continue as a going concern. Our independent auditors, in their report on our audited consolidated financial statements for the year ended June 30, 2022, expressed substantial doubt about our ability to continue as a going concern.\nAs of the filing date of this Annual Report, we have ceased all operations relating to our Prior Business and commenced executing our business plan for our New Business. Since our New Business has no history of generating revenues or operating successfully, we will be dependent upon, among other things, achieving a level of profitable operations and receiving additional cash infusions including securing additional lines of credit and raising additional capital through the placement of preferred and/or common stock in order to implement our business plan. There can be no assurance that we will be successful in order to continue as a going concern. We are funding our New Business operations by utilizing a related party demand line of credit, issuing preferred stock, and issuing common stock through private placements.\nWe cannot be certain that capital will be provided when it is required or in amounts sufficient to meet our operating requirements. Management believes the existing stockholders, the prospective new investors, and future sales will provide the additional cash needed to meet our obligations as they become due and will allow the development of our core business operations. No assurance can be given that any future financing will be available or, if available, that it will be on terms that are satisfactory to us. Even if we are able to obtain additional financing, it may contain restrictions on our operations, in the case of debt financing, or cause substantial dilution for our stockholders, in the case of equity financing. If adequate working capital is not available, we may not continue our operations.\nThe consolidated financial statements do not include any adjustments relating to the recoverability and classification of asset-carrying amounts or the amount and classification of liabilities that might be necessary should we be unable to continue as a going concern.\nOff-Balance Sheet Arrangements\nAs of June 30, 2022, and 2021, there were no off-balance sheet arrangements.\nEmerging Growth Company Status\nWe qualify as an emerging growth company under the JOBS Act. As a result, we are permitted to, and intend to, rely on exemptions from certain disclosure requirements. For so long as we are an emerging growth company, we will not be required to:\n·have an auditor report on our internal controls over financial reporting pursuant to Section 404(b) of the Sarbanes-Oxley Act;\n·comply with any requirement that may be adopted by the Public Company Accounting Oversight Board regarding mandatory audit firm rotation or a supplement to the auditors report providing additional information about the audit and the consolidated financial statements (i.e., an auditor discussion and analysis);\n·submit certain executive compensation matters to stockholder advisory votes, such as say-on-pay and say-on-frequency; and\n·disclose certain executive compensation-related items such as the correlation between executive compensation and performance and comparisons of the CEOs compensation to median employee compensation.\nIn addition, Section 107 of the JOBS Act also provides that an emerging growth company can take advantage of the extended transition period provided in Section 7(a)(2)(B) of the Securities Act for complying with new or revised accounting standards. In other words, an emerging growth company can delay the adoption of certain accounting standards until those standards would otherwise apply to private companies. We have elected to take advantage of the benefits of this extended transition period. Our consolidated financial statements may therefore not be comparable to those of companies that comply with such new or revised accounting standards.\nWe will remain an emerging growth company until the earliest of: (i) the last day of the first fiscal year in which our total annual gross revenues exceed $1.07 billion; (ii) the date that we become a large accelerated filer as defined in Rule 12b-2 under the Securities Exchange Act of 1934, which would occur if the market value of our ordinary shares that is held by non-affiliates exceeds $700 million as of the last business day of our most recently completed second fiscal quarter; (iii) the date on which we have issued more than $1 billion in non-convertible debt during the preceding three year period; or (iv) June 30, 2026. Even if we no longer qualify for the exemptions for an emerging growth company, we may still be, in certain circumstances, subject to scaled disclosure requirements as a smaller reporting company. For example, smaller reporting companies, like emerging growth companies, are not required to provide a compensation discussion and analysis under Item 402(b) of Regulation S-K or auditor attestation of internal controls over financial reporting. Item 7A. Quantitative and Qualitative Disclosures About Market Risk\nWe are a smaller reporting company as defined by Rule 12b-2 of the Exchange Act, and are not required to provide the information under this Item. Item 8. Financial Statements and Supplementary Data\nThe information required by this Item is incorporated herein by reference to the consolidated financial statements and supplementary data set forth in Item 15 - Exhibits and Consolidated Financial Statement Schedules of Part IV of this Annual Report. Item 9. Changes In and Disagreements with Accountants on Accounting and Financial Disclosure\nThere were no changes in, disagreements or reportable events required to be disclosed under Item 304(b) of Regulation S-K. Item 9A. Controls and Procedures\nEvaluation of Effectiveness of Disclosure Controls and Procedures\nOur management is responsible for establishing and maintaining a system of disclosure controls and procedures (as defined in Rule 13a-15(e) and 15d-15(e) under the Exchange Act) that is designed to ensure that information required to be disclosed by us in the reports we file or submit under the Exchange Act is recorded, processed, summarized, and reported, within the time periods specified in the SECs rules and forms. Disclosure controls and procedures include, without limitation, controls and procedures designed to ensure that information required to be disclosed by an issuer in the reports that it files or submits under the Exchange Act is accumulated and communicated to the issuers management, including its principal executive officer(s) and principal financial officer(s), or persons performing similar functions, as appropriate to allow timely decisions regarding required disclosure.\nIn accordance with Exchange Act Rules 13a-15 and 15d-15, an evaluation was completed under the supervision and with the participation of our management, including our Chief Executive Officer and Chief Financial Officer, of the effectiveness of the design and operation of our disclosure controls and procedures as of the fiscal year ended June 30, 2022.\nBased on that evaluation, our management, including our Chief Executive Officer and Chief Financial Officer, concluded that our disclosure controls and procedures were not effective in providing reasonable assurance that\ninformation required to be disclosed in our reports filed or submitted under the Exchange Act was recorded, processed, summarized, and reported within the time periods specified in the SECs rules and forms.\nManagements Report on Internal Control over Financial Reporting\nOur management is also responsible for establishing and maintaining adequate internal control over financial reporting, as defined in Rule 13a-15(f) and 15d-15(f) under the Exchange Act. Our internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of consolidated financial statements for external purposes in accordance with generally accepted accounting principles.\nOur internal control over financial reporting includes those policies and procedures that;\n·Pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of our assets;\n·Provide reasonable assurance that transactions are recorded as necessary to permit preparation of consolidated financial statements in accordance with generally accepted accounting principles,\n·That our receipts and expenditures are being made only in accordance with authorizations of our management and directors; and\n·Provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of our assets that could have a material effect on the consolidated financial statements.\nAs of June 30, 2022, management conducted an evaluation of the effectiveness of internal control over financial reporting based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on this evaluation, management concluded that our internal control over financial reporting was not effective as of June 30, 2022.\nManagement has identified the following material weaknesses and is taking action to remedy and remove the weakness in its internal controls over financial reporting:\n·Lack of an independent Board, including an independent financial expert. The current Board is evaluating expanding the Board to include additional independent directors.\n·Lack of segregation of duties and adequate documentation of our internal controls.\n·Lack of multiple levels of review in our financial reporting process.\nLimitations on the Effectiveness of Internal Controls\nOur management, including our Chief Executive Officer and Chief Financial Officer, does not expect that our disclosure controls and procedures or our internal controls will prevent all error and all fraud. A control system, no matter how well conceived and operated, can provide only reasonable, not absolute, assurance that the objectives of the control system are met. Further, the design of a control system must reflect the fact that there are resource constraints, and the benefits of controls must be considered relative to their costs. Because of the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues, misstatements, errors, and instances of fraud, if any, within our company have been or will be prevented or detected. These inherent limitations include the realities that judgments in decision making can be faulty, and that breakdowns can occur because of a simple error or mistake. Additionally, controls can be circumvented by the individual acts of some persons, by collusion of two or more people, or by management or Board override of the control.\nThe design of any system of controls also is based in part upon certain assumptions about the likelihood of future events, and there can be no assurance that any design will succeed in achieving its stated goals under all potential future conditions; over time, controls may become inadequate because of changes in conditions, or the degree of compliance with the policies or procedures may deteriorate. Because of the inherent limitations in a cost-effective control system, misstatements due to error or fraud may occur and not be detected.\nAuditors Report on Internal Control over Financial Reporting\nThis annual report does not include a standard internal control report by our registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by our registered public accounting firm pursuant to current rules of the SEC that permit us, as a smaller reporting company and an emerging growth company, to provide only managements report in this annual report.\nChanges in Internal Controls over Financial Reporting\nIn connection with our continued monitoring and maintenance of our controls procedures as part of the implementation of Section 404 of the Sarbanes-Oxley Act, we continue to review, test, and improve the effectiveness of our internal controls. There have not been any changes in our internal control over financial reporting (as such term is defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act) during the year ended June 30, 2022, that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nRemediation of Material Weakness\nWe are unable to remedy our controls related to the lack of segregation of duties and inadequate documentation of our internal controls until we receive additional financing specifically to hire additional employees who could help cost-effectively mitigate these issues and/or add systems that would assist in addressing these issues.\nPART III  Item 10. Directors, Executive Officers and Corporate Governance\nThe current executive officers and directors of our company are as follows:\nName\nAge\nPosition\nDate First Appointed\nBruce A. Cassidy\nSecretary and Director\nDecember 17, 2021(1)\nJohn Linss\nChief Executive Officer, Principal Executive Officer, President and Director\nJune 14, 2022(2)\nAnthony J. Fidaleo\nChief Financial Officer, Treasurer, Principal Financial Officer and Principal Accounting Officer\nJune 15, 2022\n(1)Mr. Cassidy was appointed as our Secretary as of December 17, 2021, and as a member and chairman of the Board as of June 28, 2022.\n(2)Mr. Linss was appointed as our Chief Executive Officer and Principal Executive Officer as of June 14, 2022, as our President as of June 15, 2022 and as a member of the Board as of June 28, 2022.\nBruce A. Cassidy: Since 2019, Mr. Cassidy has served as a member of the board of directors of Loop Media, Inc. (OTC: LPTV), a Glendale, California-based multichannel digital platform media company that offers self-curated, premium videos to customers in OOH venues and D2C on their personal in-home and mobile devices. Since November 2020, he has served as chairman of the board of Assisted 4 Living Inc. (OTC: ASSF), a Bradenton, Florida-based entity that provides, among other services, daily medical care for medically fragile and chronically ill children. Bruce also currently serves as chairman of the board of Segmint, Inc. He serves as Chairman of the Sarasota Green Group, the Executive Chairman of each of CelebYou LLC and CelebYou Productions, and is on the board of directors of Selinsky Force LLC. He was also the founding investor and served on the board of directors of Ohio Legacy Corp. Previously, Mr. Cassidy was the founder and CEO of Excel Mining Systems from 1991 until its sale in 2007 to Orica Mining Services, and from 2008 to 2009, served as the President and CEO of one of its subsidiaries, Minora North & South Americas. Bruce currently serves as President of The Concession Golf Club in Sarasota, Florida.\nJohn Linss: Mr. Linss has been an entrepreneur, intrapreneur, and C-level executive for Fortune 500 companies and most recently served as the acting CEO and President of Ultimate Gamer, LLC from September 2021 to May 2022. From March 2021 to September 2021 he worked with Gartner, Inc. as an Executive Partner to Fortune 500 CIOs and CTOs. From June 2017 to July 2020, Mr. Linss served as VP, SVP, and CTO for Caesars Entertainment. As CTO, his broad areas of responsibility included M&A, technology operations, and global strategy while he worked closely with the senior management team to achieve aggressive enterprise-wide digital transformation initiatives. John successfully led integration activities for the $17.5 billion merger of Eldorado Resorts and Caesars to create the largest U.S. integrated resort and gaming company and accelerated over $100 million in synergies within loyalty program integration, property conversions, and business systems prior to financial close. From January 2016 to June 2017, Mr. Linss served as VP of Digital Enterprise Innovation, Transformation, and Technologies for Hexaware Technologies. He pursued dual Bachelor of Science majors in Economics and Interpersonal Communications at the University of Georgia, and he has served as an adjunct professor for Management Information Systems at Emory Universitys Goizueta Business School.\nAnthony J. Fidaleo: Mr. Fidaleo has been the CEO of his financial accounting and consulting practice since 1992, specializing in private and publicly traded companies, ranging from start-ups to Fortune 500 companies. From October 2021 to May 2022, Mr. Fidaleo served as the acting CFO of Ultimate Gamer, LLC. From 2013 to 2021, Mr. Fidaleo served as a Senior Executive Consultant for Buxbaum HCS, specializing in interim CFO, M&As, Quality of earnings, audit preparatory work, transaction coordination with investment bankers, legal counsel, CPA, and Due Diligence firms. Mr. Fidaleo has been the CFO of multiple publicly traded companies listed on Nasdaq and OTC, as well as having served as a member of the board of directors of several public and private companies. Mr. Fidaleo spent approximately 10 years in public accounting where he attained the title of Audit Senior Manager at BDO USA. Mr. Fidaleo is currently the financial expert on the board of directors of Origin Clear, a publicly traded company. Mr. Fidaleo is a California CPA (inactive) and has a Bachelor of Accounting from California State University at Long Beach.\nTerm of Office\nEach of our directors is elected or appointed to hold office for a one-year term expiring at the next annual meeting of our stockholders or until his successor has been elected or appointed and qualified, or until his earlier death, resignation, or removal. There are no agreements with respect to the election of directors. Our executive officers are appointed by the Board and serve at the discretion of the Board or until they resign.\nFamily Relationships\nThere are no family relationships between or among the directors, executive officers or persons nominated or chosen by us to become directors or executive officers.\nInvolvement in Certain Legal Proceedings\nNone of our directors and executive officers has been involved in any legal or regulatory proceedings, as set forth in Item 401 of Regulation S-K, during the past ten years.\nDelinquent Section 16(a) Reports\nSection 16(a) of the Exchange Act requires our directors, executive officers and persons who are beneficial owners of more than 10% of a registered class of our equity securities, to file reports of ownership and changes in ownership with the SEC.\nBased solely upon our review of Forms 3 and 4 and amendments thereto filed electronically with the SEC during our most recent fiscal year or prior fiscal year, and a review of Forms 5 and amendments thereto filed electronically with the SEC with respect to our most recent fiscal year or prior fiscal year, we believe that all of our directors, executive officers and any other applicable stockholders timely filed all reports required by Section 16(a) of the Exchange Act during the fiscal year ended June 30, 2022, except for the following: (i) Steven Lane filed a Form 3 on June 8, 2021, which was due on June 2, 2021; (ii) Bruce A. Cassidy failed to file a Form 3 which was due on December 27, 2021, and failed to file Forms 4 covering transactions that each required Form 4 filings due on December 30, 2021 and June 30, 2022; (iii) Roger Tichenor failed to file a Form 3 which was due on January 6, 2022; (iv) Eagle Investment Group, LLC failed to file a Form 3 which was due on December 30, 2021; (v) John Linss failed to file a Form 3 which was due on June 16, 2022; and (vi) Anthony J. Fidaleo failed to file a Form 3 which was due on June 17, 2022.\nCode of Ethics\nWe have not adopted a Code of Ethics because we have not had any independent executive officers until our recent hiring of John Linss as our principal executive officer on June 14, 2022, and Anthony J. Fidaleo as our principal financial officer and principal accounting officer on June 15, 2022. We intend to adopt a Code of Ethics in the second fiscal quarter ending December 31, 2022.\nBoard and Committee Meetings\nThe Board does not have any standing committees. All proceedings of the board of directors were conducted by resolutions consented to in writing by all the directors and filed with the minutes of the proceedings of the directors. Such resolutions consented to in writing by the directors entitled to vote on that resolution at a meeting of the directors are, according to the Nevada Business Corporation Act and our Bylaws, as valid and effective as if they had been passed at a meeting of the directors duly called and held.\nNomination Process\nAs of June 30, 2022, we did not affect any material changes to the procedures by which our stockholders may recommend nominees to the Board. The Board does not have a policy with regards to the consideration of any director candidates recommended by our stockholders. The Board has determined that it is in the best position to evaluate our requirements as well as the qualifications of each candidate when it considers a nominee for a position on the Board. If stockholders wish to recommend candidates directly to the Board, they may do so by sending communications to our Chief Executive Officer at the address on the cover of this annual report.\nAudit Committee\nCurrently our audit committee consists of the entire Board. We do not have a separately-designated standing audit committee as we currently have limited working capital and minimal revenues. Should we be able to raise sufficient funding to execute our business plan, we intend to form an audit committee and other applicable committees utilizing our directors expertise.\nFrom inception to present date, we believe that the members of the Board have been and are collectively capable of analyzing and evaluating our consolidated financial statements and understanding internal controls and procedures for financial reporting.\nAudit Committee Financial Expert\nWe do not currently have an audit committee financial expert because we do not have an audit committee. We also do not have a director who is qualified to act as financial expert of an audit committee. Item 11. Executive Compensation\nThe following table sets forth all compensation awarded to, earned by, or paid to the following named executive officers, which is defined as follows:\n(a)all individuals serving as our principal executive officer during the fiscal year ended June 30, 2022; and\n(b)each of our two other most highly compensated executive officers who were serving as executive officers at the end of the year ended June 30, 2022.\nSummary Compensation Table\nName\nTitle\nYear\nSalary\n($)\nBonus\n($)\nStock\nAwards\n($)\nAll Other\nCompensation\n($)\nTotal\n($)\nSteven Lane\nPresident, Chief Executive Officer, Principal Executive Officer, Secretary and Director(1)\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\nBruce A. Cassidy\nPresident, Chief Executive Officer, Principal Executive Officer, Treasurer, Secretary and Director(2)\n-\nn/a\n-\nn/a\n-\nn/a\n-\nn/a\n-\nn/a\nJohn Linss\nPresident, Chief Executive Officer, Principal Executive Officer and Director(3)\n20,833\nn/a\n112,000\nn/a\n-\nn/a\n2,500\nn/a\n134,083\nn/a\nAnthony J. Fidaleo\nChief Financial Officer, Treasurer, Principal Financial Officer and Principal Accounting Officer(4)\n10,500\nn/a\n50,000\nn/a\n-\nn/a\n-\nn/a\n60,500\nn/a\n(1)Mr. Lane resigned as President, Chief Executive Officer, Principal Executive Officer and Secretary as of December 17, 2021, and as a Director as of December 28, 2021.\n(2)Mr. Cassidy was appointed as President, Chief Executive Officer, Principal Executive Officer, Treasurer and Secretary as of December 17, 2021, and as a Director as of June 28, 2022. He resigned as President, Chief Executive Officer and Principal Executive Officer as of June 14, 2022 and as Treasurer as of June 15, 2022.\n(3)Mr. Linss was appointed as Chief Executive Officer and Principal Executive Officer as of June 14, 2022, as President as of June 15, 2022, and as a Director as of June 28, 2022. Salary represents one-half month of compensation and the bonus is a one-time signing bonus. Subsequent to fiscal year end, Mr. Linss received 2,980,000 shares of Series C preferred stock pursuant to the terms of his employment agreement executed on June 14, 2022. The shares were issued and granted on August 16, 2022, and are subject to our right to repurchase such shares and other transfer restrictions until such time as the shares become vested on\nAugust 16, 2025, or sooner if we meet certain milestones. Mr. Linss is entitled to all voting rights with regard to such shares as of the date of grant.\n(4)Mr. Fidaleo was appointed as Chief Financial Officer, Principal Financial Officer, Principal Accounting Officer and Treasurer as of June 15, 2022. Salary represents one-half month of compensation and the bonus is a one-time signing bonus.\nNarrative to Compensation Table\nPursuant to Mr. Linss Employment Agreement he entered into with us on June 14, 2022 (the Employment Agreement), he receives an annual salary of $500,000. The $20,833 of salary set forth in the above table represents one-half of a months salary. Pursuant to the Employment Agreement: (1) Mr. Linss received a signing bonus of $112,000 (including employer payroll taxes), payable within 30 days of execution of the Employment Agreement; (2) within 60 days of execution of the Employment Agreement he was to receive a purchase agreement for the purchase of 2,980,000 shares of our common stock for a total purchase price of $2,980,000, with the full purchase price to be paid through a non-recourse secured promissory note (prior to entering into the purchase agreement or note, the Employment Agreement was amended; see discussion on the amendment below); and (3) if we do not provide medical health benefits at any time during the three-year term of the Employment Agreement, in addition to the base salary, Mr. Linss is entitled to $2,500 a month for private health insurance. Mr. Linss was paid his bonus on July 15, 2022 and was reimbursed $2,500 for medical health benefits for June 2022 as set forth in the above table. We obtained medical health insurance for our employees effective July 1, 2022.\nOn August 16, 2022, we entered into an amendment to the Employment Agreement. Pursuant to the amendment:\n·Section 3(b) of the Employment Agreement relating to a stock purchase agreement to purchase and finance 2,980,000 shares of our common stock was deleted and replaced with a grant of 2,980,000 restricted shares of our Series C preferred stock (the Restricted Shares) pursuant to a Restricted Stock Award Agreement dated August 16, 2022 (the Award Agreement). Under the Award Agreement, the Restricted Shares are subject to a repurchase option by us until the shares vest. Provided Mr. Linss remains in continuous service with us or an affiliate, whether as an employee, consultant or member of our board of directors, through the vesting date, the Restricted Shares will vest upon the earlier of: (a) August 16, 2025; and (b) the occurrence of: (1) our common stock is listed for public trading on the Nasdaq Stock Market, the New York Stock Exchange or the NYSE American (an Uplisting); (2) a (i) sale of all or substantially all of our assets other than to an affiliated entity; (ii) merger, consolidation or other capital reorganization or business combination transaction of the Company with or into another corporation, limited liability company or other entity other than an affiliated entity; or (iii) consummation of a transaction, or series of related transactions, in which any person (as such term is used in Sections 13(d) and 14(d) of the Exchange Act of 1934) who did not before such transaction, or series of transactions, own more than 50% of our then outstanding voting securities becomes the beneficial owner (as defined in Rule 13d-3 of the Exchange Act of 1934), directly or indirectly, of more than 50% of our then outstanding voting securities; (3) the termination of Mr. Linss continuous service on account of death or disability; (4) an involuntary termination of employment by us other than for cause; or (5) Mr. Linss voluntary termination of employment for good reason.\n·Section 3(c) of the Employment Agreement relating to an annual bonus was amended to add that provided Mr. Linss is employed by us as of December 31, 2022, his annual bonus will be an amount no less than $425,000, which will be paid by January 31, 2023.\n·Section 3(f) of the Employment Agreement relating to payment of a bonus upon an Uplisting was amended to reduce the bonus amount to be paid upon an Uplisting from $1,700,000 to $300,000.\nPursuant to Mr. Fidaleos offer letter he entered into with us on June 15, 2022, he receives an annual salary of $252,000. The $10,500 of salary set forth in the above table represents one-half of a months salary. The offer letter also states that he is entitled to a signing bonus of $50,000 (excluding employer payroll taxes), contingent upon the successful completion of an initial closing of ZenSports, Inc.s non-gambling related assets. Mr. Fidaleo was paid his bonus on July 15, 2022.\nOutstanding Equity Awards at Fiscal Year End\nThe following table sets forth certain information regarding all outstanding equity awards held by our named executive officers as of June 30, 2022.\nOPTION AWARDS\nSTOCK AWARDS\nName\nNumber of\nSecurities\nUnderlying\nUnexercised\nOptions (#)\nExercisable\nNumber of\nSecurities\nUnderlying\nUnexercised\nOptions (#)\nUnexercisable\nEquity\nIncentive\nPlan\nAwards:\nNumber of\nSecurities\nUnderlying\nUnexercised\nUnearned\nOptions\n(#)\nOption\nExercise\nPrice\n($)\nOption\nExpiration\nDate\nNumber\nof Units\nor Units\nof Stock\nthat have\nnot Vested\n(#)\nMarket\nValue\nof\nUnits\nor Units\nof Stock\nthat have\nnot Vested\n($)\nEquity\nIncentive\nPlan\nAwards:\nNumber of\nUnearned\nUnits,\nUnits or\nOther\nRights\nthat have\nnot Vested\n($)\nEquity\nIncentive\nPlan\nAwards:\nMarket or\nPayout\nValue of\nUnearned\nUnits,\nUnits or\nOther\nRights that\nhave not\nVested\n($)\nSteven Lane\n-\n-\n-\n-\n-\n-\n-\n-\n-\nBruce A. Cassidy\n-\n-\n-\n-\n-\n-\n-\n-\n-\nJohn Linss\n-\n-\n-\n-\n-\n-\n-\n-\n-\nAnthony J. Fidaleo\n-\n-\n-\n-\n-\n-\n-\n-\n-\nDirector Compensation\nWe have not compensated our directors for service on the Board or reimbursed for expenses incurred for attendance at meetings of the Board for the year ended June 30, 2022. We do not have any agreements for compensating our directors for their services in their capacity as directors. The Board may, however, in the future determine to pay directors fees and reimburse directors for expenses related to their activities as such.\nEquity Compensation Plan Information\nOur 2021 Stock Plan (2021 Stock Plan) provides eligible participants with benefits consisting of one or more of the following: Incentive Stock Options (ISOs), Nonstatutory Stock Options (NSOs) and bonuses in the form of common stock in the Company (Stock Bonuses). The Board or a committee of directors shall administer the 2021 Stock Plan. The Board or committee shall determine what employees or officers shall receive an award under the Plan. ISOs, which are intended to be compliant with Section 422 of the Internal Revenue Code, may be awarded only to employees of the Company. NSOs and Stock Bonuses are not subject to Section 422 of the Internal Revenue Code and can be awarded to employees and non-employee officers. The aggregate number of Shares of the Company that can be awarded under the Plan is 5,960,000 shares of Common Stock, whether in the form ISOs, NSOs, or Stock Bonuses (or a combination thereof). Awards can be issued under the Plan for ten years from the effective date of the Plan. ISOs may be exercised during a period no longer than 10 years from the date of the award (5 years for individuals who own more than 10% of the combined voting power of the Company). NSOs may be exercised for a maximum period of 10 years from the date of the award. ISOs and NSOs may not be exercised after the earlier of the following: (a) in the event of termination for cause (as defined by the plan): the date of termination; (b) in the event of termination due to death or disability: the earlier of the ISO or NSOs expiration or one year after the termination due to death or disability; (c) in the event of termination for any other reason: three months following the date of termination.\nThe following table summarizes the number of shares of our common stock authorized for issuance under our equity compensation plans (including individual compensation arrangements) as of June 30, 2022.\nPlan Category\nNumber of securities\nto be issued upon\nexercise of outstanding\noptions, warrants and\nrights\n(a)\nWeighted-average\nexercise price of\noutstanding options,\nwarrants and rights\n(b)\nNumber of securities\nremaining available\nfor future issuance\nunder equity\ncompensation plans\n(excluding securities\nreflected in column (a)\n(c)\nEquity compensation plans approved by security holders\n$0\nEquity compensation plans not approved by security holders(1)\n$0\n5,960,000\nTotal\n$0\n5,960,000\n(1)Plan was approved by the Board on December 28, 2021 for officers, employees, directors and consultants, and will be submitted to the stockholders for approval at or before the next annual meeting. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nSECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS\nThe following table sets forth, as of September 30, 2022, certain information with respect to the beneficial ownership of shares of our common stock by: (i) each of our directors (including director nominees); (ii) each of our named executive officers; (iii) our directors and executive officers as a group; and (iv) each stockholder known by us to be the beneficial owner of more than 5% of our outstanding common stock. To our knowledge, none of the shares reported below are pledged as security. Unless otherwise indicated, the address of each of the individuals and entity listed below is c/o KeyStar Corp. 8400 W. Sunset Road, Suite 300, Las Vegas, Nevada 89113:\nCommon Stock\nSeries B Preferred Stock(2)\nSeries C Preferred Stock(3)\nName and Address\nof Beneficial Owner(1)\nNumber of\nShares Owned(4)\nPercent of\nClass(5)\nNumber of\nShares Owned(4)\nPercent of\nClass(5)\nNumber of\nShares Owned(4)\nPercent of\nClass(5)\nBruce A. Cassidy(6)\nDirector & Chairman\n23,663,966\n56.25%\n11,693\n100%\n1,666,666\n28.67%\nJohn Linss(7)\nChief Executive Officer & Director\n3,313,333\n7.79%\n-\n-\n3,313,333\n57%\nAnthony J. Fidaleo\nChief Financial Officer\n-\n-\n-\n-\n-\n-\nAll Directors and Executive Officers\nas a Group (3 persons)\n26,977,299\n59.45%\n11,693\n100%\n4,979,999\n85.67%\n5% Holders\nRAT Investment Holdings, LLC\n2,800,000\n7.14%\n-\n-\n-\n-\nZen SRQ, LLC\n833,332\n2.08%\n-\n-\n833,332\n14.33%\nZenSports, Inc.\n6,500,000\n16.57%\n-\n-\n-\n-\n(1) Unless otherwise indicated, each person or entity named in the table has sole voting power and investment power (or shares that power with that persons spouse) with respect to all shares of voting stock listed as owned by that person or entity.\n(2) Holders of Series B preferred stock vote with the common stockholders on an as-converted basis, with each share of Series B preferred stock converting into 100 shares of common stock, on all matters submitted to a vote by holders of our common stock; but, with respect to the election of directors, however, the majority of the holders of Series B preferred stock shall have the power to elect a majority of the then-seated or to-be-seated members of our Board and the common stockholders are entitled only to elect a minority of the then-seated or to-be-seated members of our Board.\n(3) Holders of Series C preferred stock vote with the common stockholders on an as-converted basis, with each share of Series C preferred stock converting into one share of common stock, on all matters submitted to a vote by holders of our common stock, including the election of directors and all other matters as required by law.\n(4) Pursuant to Rules 13d-3 and 13d-5 of the Exchange Act, number of shares beneficially owned includes any shares as to which a stockholder has sole or shared voting power or investment power, and also any shares which the stockholder has the right to acquire within 60 days, including upon exercise of purchase options or warrants.\n(5) The percent of class is based on 39,230,000 shares of common stock, 11,693 shares of Series B preferred stock and 5,813,331 shares of Series C preferred stock issued and outstanding as of September 30, 2022.\n(6) Mr. Cassidys beneficial ownership includes (A) (i) 19,328,000 shares of common stock; and (ii) 11,693 shares of Series B preferred stock convertible into 1,169,300 shares of common stock held by Eagle Investment Group, LLC, of which Mr. Cassidy is the manager; (B) 1,666,666 shares of Series C preferred stock held by Excel Family Partners, LLLP, of which Mr. Cassidy is an indirect limited partner along with his wife, and he is the indirect general partner as sole manager of a limited liability company that is the general partner of Excel Family Partners; and (C) 1,500,000 shares of common stock held by Excel Members, LLC, of which Mr. Cassidy is the co-manager with two other people and may be deemed to share voting and investment power with respect to these shares.\n(7) Mr. Linss beneficial ownership includes (A) 2,980,000 shares of Series C preferred stock subject to a repurchase option by us until the shares vest, and during the vesting period he is entitled to all of the rights of a stockholder of the Company with regards to such shares including, without limitation, the right to vote such shares; and (B) 333,333 shares of Series C preferred stock held by Corespeed, LLC, of which Mr. Linss is the sole member and manager. Item 13. Certain Relationships and Related Transactions, and Director Independence\nExcept as disclosed herein, no director, executive officer, stockholder holding at least 5% of shares of our common stock, or any family member thereof, had any material interest, direct or indirect, in any transaction, or proposed transaction since July 1, 2020, in which the amount involved in the transaction exceeded or exceeds the lesser of $120,000 or one percent of the average of our total assets at the year-end for the last two completed fiscal years.\nOn December 30, 2020, we executed a promissory note with Zixiao Chen, our former Chief Financial Officer, for cash proceeds of $30,000. The note bears interest at 10% per annum and is due in two business days after the demand for payment. As of June 30, 2022, the principal balance was $30,000 and accrued interest was $4,496. The interest expense for the years ended June 30, 2022, and 2021 was $1,496 and $3,000 respectively.\nOn December 28, 2021, in connection with the assignment of that certain Demand Promissory Note dated April 20, 2020, in the principal amount of $10,000 (the Demand Note) that was initially in favor of Zixiao Chen, our Chief Financial Officer at the time of the Demand Notes issuance, was purchased from Ms. Chen by Eagle Investment Group, LLC, we amended and restated the Demand Note that is now in favor of Eagle Investment Group, LLC, a company controlled by Bruce Cassidy, our former Chief Executive Officer through June 14, 2022, a member and the Chairman of the Board. On December 28, 2021, we issued 11,693 shares of Series B preferred stock to Eagle Investment Group, LLC in exchange for the extinguishment of the Demand Note. The loss from the extinguishment of debt is $821,307.\nOn February 22, 2022, we executed a non-revolving line of credit demand note for $250,000 with Excel Family Partners, LLLP a company controlled by Bruce Cassidy, our former Chief Executive Officer through June 14, 2022, a member and the Chairman of the Board. The note bears interest at 5% per annum. As of June 30, 2022, the balance of the line of credit was $166,539 including accrued interest.\nOn June 14, 2022, we entered into an employment agreement with John Linss, as our Chief Executive Officer. The agreement was amended on August 16, 2022. The agreement and amended agreement work in tandem and provide for a 3-year term at an annual base salary of $500,000, a $112,000 signing bonus, a bonus of no less than $425,000 if Mr. Linss is still employed on December 31, 2022, to be paid in January 2023, a bonus of $300,000 should we achieve a stock listing up-list, a grant on August 16, 2022 of 2,980,000 restricted Series C preferred stock, which\nincludes voting rights and 100% vesting as of August 16, 2022, or sooner if certain agreed upon transactions occur, as well as participation in any company benefits, stock option or bonus plans, none of which have been formalized or entered into at this time.\nOn June 28, 2022, we issued 666,666 shares of our Series C preferred stock to an entity controlled by Bruce Cassidy, our former Chief Executive Officer through June 14, 2022, a member and the Chairman of the Board, for cash proceeds of $200,000.\nDuring the years ended June 30, 2022, and June 30, 2021, Zixiao Chen, our former Chief Financial Officer, paid expenses of $5,006 and $2,992, respectively, on our behalf and received repayments of $5,507 and $10,648, respectively. The balance due to Ms. Chen at June 30, 2022, and 2021 was $17,565 and $18,066 respectively. Item 14. Principal Accounting Fees and Services\nBelow are tables of Audit Fees (amounts in US$) billed by our auditors in connection with the audit of the Companys annual financial statements and review of the quarterly financial statements for the years indicated below:\nConsolidated Financial Statements\nFor the Year Ended June 30\nAudit\nServices\nAudit\nRelated Fees\nTax Fees\nOther Fees\n$\n20,838\n$\n-\n$\n-\n$\n-\n$\n11,000\n$\n-\n$\n-\n$\nPART IV Item 15. Exhibits, Financial Statements Schedules\n(a)The following documents are filed as part of this Annual Report on Form 10-K:\n(1)Consolidated Financial Statements\nThe following documents are filed as part of this Form 10 K, as set forth on the Index to Consolidated Financial Statements found below after the signature page.\n·Report of Independent Registered Public Accounting Firm\n·Consolidated Balance Sheets as of June 30, 2022 and 2021\n·Consolidated Statements of Operations for the years ended June 30, 2022 and 2021\n·Consolidated Statements of Stockholders Deficit for the years ended June 30, 2022 and 2021\n·Consolidated Statements of Cash Flows for the years ended June 30, 2022 and 2021\n·Notes to Consolidated Financial Statements\n(2)Consolidated Financial Statement Schedules\nAll consolidated financial statement schedules are omitted because they are not applicable, or the required information is shown in the consolidated financial statements or notes thereto.\n(b)Exhibits to this Form 10-K\nExhibit\nIncorporated By Reference\nNumber\nExhibit Description\nForm\nAs Exhibit\nFiling Date\n2.1\nAsset Purchase Agreement with KeyStar Corp., ZenSports, Inc., Mark Thomas, Etan Mizrahi-Shalom, Adil Sher and John Dulay, dated August 26, 2022\n8-K\n2.1\n09/01/2022\n2.2\nAsset Purchase Agreement with Excel Members, LLC, dated as of September 12, 2022\n8-K\n2.1\n09/16/2022\n3.1\nArticles of Incorporation\nS-1\n3.1\n02/11/2021\n3.2\nCertificate of Amendment\nS-1\n3.2\n02/11/2021\n3.3\nCertificate of Designation of Series B Preferred Stock\n8-K\n3.1\n01/12/2022\n3.4\nCertificate of Designation of Series C Preferred Stock\n8-K\n3.1\n07/05/2022\n3.5\nAmended and Restated Bylaws\n8-K\n3.1\n10/04/2022\n4.1\nRegistration Rights Agreement for the Benefit of ZenSports, Inc., dated as of August 26, 2022\n8-K\n4.1\n09/01/2022\n10.1\nDemand Promissory Note, dated December 30, 2020\nS-1\n10.1\n02/11/2021\n10.2\nFirst Amended and Restated Demand Note, dated December 28, 2021\n8-K\n4.1\n01/12/2022\n10.3\nDiscretionary Non-Revolving Line of Credit Demand Note, dated February 22, 2022\n8-K\n10.1\n03/22/2022\n10.4\nEmployment Agreement with John Linss, dated June 14, 2022\n8-K\n10.1\n06/21/2022\n10.5\nEmployment Conditions Agreement with Anthony J. Fidaleo, dated June 15, 2022.\n8-K\n10.2\n06/21/2022\n10.6\nForm of Securities Purchase Agreement between KeyStar Corp. and Investors\n8-K\n10.1\n07/05/2022\n10.7\nAmendment to Employment Agreement with John Linss, dated August 16, 2022.\n8-K\n10.2\n08/23/2022\nExhibit\nIncorporated By Reference\nNumber\nExhibit Description\nForm\nAs Exhibit\nFiling Date\n10.8\nAmended and Restated Discretionary Non-Revolving Line of Credit Demand Note, dated August 16, 2022\n8-K\n10.1\n08/23/2022\n10.9\nRestricted Stock Award Agreement between KeyStar Corp. and John Linss, dated August 16, 2022\n8-K\n10.3\n08/23/2022\n10.10*\nKeyStar Corp. 2021 Stock Plan\n31.1*\nCertification of Principal Executive Officer filed pursuant to Exchange Act Rules 13a-14(a) and 15d-14(a), as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n31.2*\nCertification of Principal Financial Officer filed pursuant to Exchange Act Rules 13a-14(a) and 15d-14(a), as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n32.1**\nCertification of Chief Executive Officer furnished pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n32.2**\nCertification of Chief Financial Officer furnished pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n101.INS\nInline XBRL Instance Document\n101.SCH\nInline XBRL Taxonomy Extension Schema Document\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101)\n*Filed herewith.\n**Furnished herewith.\nIndicates a management contract or compensation plan, contract or arrangement.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, as amended, the registrant has duly caused this Annual Report to be signed on its behalf by the undersigned thereunto duly authorized.\nKeyStar Corp., a Nevada corporation\n(Registrant)\nOctober 13, 2022\nBy:\n/s/ John Linss\nJohn Linss\nChief Executive Officer\n(Principal Executive Officer)\nOctober 13, 2022\nBy:\n/s/ Anthony J. Fidaleo\nAnthony J. Fidaleo\nChief Financial Officer\n(Principal Financial and Accounting Officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, as amended, this Annual Report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/ John Linss\nJohn Linss\nChief Executive Officer (Principal Executive Officer) and Director\nOctober 13, 2022\n/s/ Anthony J. Fidaleo\nAnthony J. Fidaleo\nChief Financial Officer (Principal Financial and Accounting Officer)\nOctober 13, 2022\n/s/ Bruce A. Cassidy\nBruce A. Cassidy\nDirector\nOctober 13, 2022\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\nKEYSTAR CORP. AUDITED CONSOLIDATED FINANCIAL STATEMENTS\nReport of Independent Registered Public Accounting Firm\nConsolidated Balance Sheets as of June 30, 2022 and 2021\nConsolidated Statements of Operations for the years ended June 30, 2022 and 2021\nConsolidated Statements of Stockholders Deficit for the years ended June 30, 2022 and 2021\nConsolidated Statements of Cash Flows for the years ended June 30, 2022 and 2021\nNotes to the Consolidated Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Shareholders of KeyStar Corp.:\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of KeyStar Corp., (the Company) as of June 30, 2022 and 2021, the related consolidated statements of operations, stockholders deficit, and cash flows for each of the years in the two-year period ended June 30, 2022 and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements referred to above present fairly, in all material respects, the financial position of the Company as of June 30, 2022 and 2021, and the results of its operations and its cash flows for each of the years in the two-year period ended June 30, 2022, in conformity with accounting principles generally accepted in the United States of America.\nExplanatory Paragraph Regarding Going Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 1 to the financial statements, the Company has incurred losses since inception, has negative cash flows from operations, and has negative working capital, which creates substantial doubt about its ability to continue as a going concern. Managements plans in regard to these matters are also described in Note 1. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\n/s/ Sadler, Gibb & Associates, LLC\nSadler, Gibb & Associates, LLC (PCAOB ID: 3627)\nWe have served as the Companys auditor since 2020.\nDraper, UT\nOctober 13, 2022\nKEYSTAR CORP.\nCONSOLIDATED BALANCE SHEETS\nJune 30,\nJune 30,\nASSETS\nCurrent assets:\nCash\n$\n66,241\n$\n88,565\nInventory, net\n8,341\nPrepaid expenses\n9,063\n10,144\nTotal current assets\n76,296\n107,050\nOther assets:\nSecurity deposit\n1,523\n1,523\nTotal other assets\n1,523\n1,523\nTotal assets\n$\n77,819\n$\n108,573\nLIABILITIES AND STOCKHOLDERS DEFICIT\nCurrent liabilities:\nAccounts payable and accrued expenses\n$\n381,870\n$\n36,327\nNotes payable - related party\n65,000\n65,000\nConvertible debt - related party\n-\n10,000\nLine of credit - related party\n166,539\n-\nTotal current liabilities\n613,409\n111,327\nTotal liabilities\n613,409\n111,327\nCommitments and contingencies - See Note 8\nStockholders deficit:\nPreferred stock, series A, $0.0001 par value, 25,000,000 shares\nAuthorized 2,000,000 and 2,000,000 shares issued and outstanding\nas of June 30, 2022 and June 30, 2021, respectively\nPreferred stock, series B, $1.00 par value, 12,000 shares\nAuthorized 11,693 and 0 shares issued and outstanding as of\nJune 30, 2022 and June 30, 2021, respectively\n11,693\n-\nPreferred stock, series C, $0.0001 par value, 25,000,000 shares\nAuthorized 666,666 and 0 shares issued and outstanding as of\nJune 30, 2022 and June 30, 2021, respectively\n-\nCommon stock, $0.0001 par value, 475,000,000 shares authorized\n29,800,000 shares issued and outstanding as of June 30, 2022\nand June 30, 2021, respectively\n2,980\n2,980\nAdditional paid-in capital\n1,074,537\n53,297\nSubscriptions receivable\n(102,760)\n-\nAccumulated deficit\n(1,522,307)\n(59,231)\nTotal stockholders deficit\n(535,590)\n(2,754)\nTotal liabilities and stockholders deficit\n$\n77,819\n$\n108,573\nThe accompanying notes are an integral part of these audited financial statements.\nKEYSTAR CORP.\nCONSOLIDATED STATEMENTS OF OPERATIONS\nFor the Years Ended\nJune 30,\nRevenue\n$\n78,407\n$\n47,172\nCost of goods sold\n63,173\n43,932\nGross profit\n15,234\n3,240\nOperating expenses:\nGeneral and administrative\n383,948\n48,883\nSalaries and wages\n264,212\n-\nTotal operating expenses\n648,160\n48,883\nLoss from operations\n(632,926)\n(45,643)\nOther expense:\nLoss on extinguishment of related party debt\n(821,307)\n-\nInterest expense - related party\n(8,843)\n(5,995)\nTotal other expense\n(830,150)\n(5,995)\nNet loss\n$\n(1,463,076)\n$\n(51,638)\nNet loss per common share\n- basic and diluted\n$\n(0.05)\n$\n(0.00)\nWeighted average number of common shares outstanding\n- basic and diluted\n29,800,000\n29,127,479\nThe accompanying notes are an integral part of these audited financial statements.\nKEYSTAR CORP.\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS DEFICIT\nPreferred Shares\nSeries A\n$0.0001 Par Value\nPreferred Shares\nSeries B\n$1.00 Par Value\nPreferred Shares\nSeries C\n$0.0001 Par Value\nCommon Shares\n$0.0001 Par Value\nShares\nAmount\nShares\nAmount\nShares\nAmount\nShares\nAmount\nAdditional\nPaid-In\nCapital\nStock\nSubscriptions\nReceivable\nAccumulated\nDeficit\nTotal\nStockholders\nEquity (Deficit)\nBalance,\nJune 30, 2020\n2,000,000\n$\n-\n$\n-\n-\n$\n-\n29,000,000\n$\n2,900\n$\n13,400\n$\n(1,500)\n$\n(7,593)\n$\n7,407\nCash received in\nsatisfaction for\nstock subscriptions\nreceivable\n-\n-\n-\n-\n-\n-\n-\n-\n1,500\n-\n1,500\nIssuance of common\nstock for cash\n-\n-\n-\n-\n-\n-\n800,000\n39,897\n-\n-\n39,977\nNet loss\nfor the period\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n(51,638)\n(51,638)\nBalance,\nJune 30, 2021\n2,000,000\n$\n-\n$\n-\n-\n$\n-\n29,800,000\n$\n2,980\n$\n53,297\n$\n-\n$\n(59,231)\n$\n(2,754)\nIssuance of preferred\nstock for\nextinguishment\nof debt\n-\n-\n11,693\n11,693\n-\n-\n-\n-\n821,307\n-\n-\n833,000\nIssuance of preferred\nstock for cash\n-\n-\n-\n-\n666,666\n-\n-\n199,933\n(102,760)\n-\n97,240\nNet loss\nfor the period\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n(1,463,076)\n(1,463,076)\nBalance,\nJune 30, 2022\n2,000,000\n$\n11,693\n$\n11,693\n666,666\n$\n29,800,000\n$\n2,980\n$\n1,074,537\n$\n(102,760)\n$\n(1,522,307)\n$\n(535,590)\nThe accompanying notes are an integral part of these audited financial statements.\nKEYSTAR CORP.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nFor the Years Ended\nJune 30,\nCASH FLOWS FROM OPERATING ACTIVITIES\nNet loss\n$\n(1,463,076)\n$\n(51,638)\nAdjustments to reconcile to net loss to net cash from operating activities:\nExpenses paid on behalf of the company by related party\n5,006\n2,992\nLoss on extinguishment of debt\n821,307\n1,472\nChanges in operating assets and liabilities:\nInventory\n7,349\n35,309\nPrepaid expenses\n1,081\n(11,199)\nAccounts payable and accrued expenses\n340,738\n6,885\nAccounts payable and accrued expenses - related party\n6,999\n5,997\nNet cash from operating activities\n(280,596)\n(10,182)\nCASH FLOWS FROM INVESTING ACTIVITIES\nNet cash from investing activities\n-\n-\nCASH FLOWS FROM FINANCING ACTIVITIES\nProceeds from notes payable, related party\n-\n30,000\nProceeds from issuance of common stock\n-\n39,977\nProceeds from issuance of Series C convertible preferred stock\n97,240\n-\nProceeds from line of credit, related party\n166,539\n-\nRepayment of amounts due to related party\n(5,507)\n(10,648)\nCash received in satisfaction of stock subscriptions receivable\n-\n1,500\nNet cash from financing activities\n258,272\n60,829\nNET CHANGE IN CASH\n(22,324)\n50,647\nCASH AT BEGINNING OF PERIOD\n88,565\n37,918\nCASH AT END OF PERIOD\n$\n66,241\n$\n88,565\nSUPPLEMENTAL INFORMATION:\nInterest paid\n$\n-\n$\n-\nIncome taxes paid\n$\n-\n$\n-\nNON-CASH FINANCING AND INVESTING ACTIVITIES:\nSeries B preferred stock issued for extinguishment of debt\n$\n833,000\n$\n-\nThe accompanying notes are an integral part of these audited financial statements.\nKEYSTAR CORP.\nNOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\nJune 30, 2022 and 2021\nNOTE 1 - ORGANIZATION & SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nOverview and Organization\nKeyStar Corp. (the Company, we, us and our) was incorporated on April 16, 2020, under the laws of the State of Nevada, as KeyStar Corp. The wholly-owned subsidiary was formed on December 21, 2021, under the State of Nevada, as UG Acquisition Sub, Inc.\nAs of June 30, 2022, our business consisted the retail sale of masks and similar products, and convention services (together, the Prior Business). Through our e-commerce sales channel, we sell KN-95 facemasks, disposable facemasks, and disinfectant wipes through an online store in the United States of America. Through our convention sales channel, we offer convention services, which connect US buyers to Chinese manufacturers. Due to the COVID-19 pandemic, many traditional conventions were postponed in the United States. Accordingly, our convention services had been intended to offer online (or virtual) convention services to potential customers. However, as a result of the commencement of lifting of many travel restrictions, we adjusted our convention services from coordinating virtual conventions to focusing on certain traditional on-site convention services. Through our KeyStarCorp.com website, we now offer trade show booth staffing, trade show booth design, and manufacturing, turn-key trade show booths.\nAs of June 15, 2022, we hired a new Chief Executive Officer and Chief Financial Officer along with certain key employees of ZenSports, Inc. to explore business opportunities related to software and mobile application development and services related to such technology. On August 26, 2022, the Company entered into an Asset Purchase Agreement to purchase certain technological assets from ZenSports, Inc. The assets were purchased to allow us to offer gambling and entertainment opportunities through technology principally the online gaming technology and use of the name ZenSports. We did not acquire all the assets of the Company, the assets we didnt purchase include, among other assets, ZenSports legal entity name ZenSports, Inc. and those assets related to ZenSports physical casino called the Big Wheel Casino, located in Lovelock, Nevada. See Note 11.\nOn September 12, 2022, we entered into an Asset Purchase Agreement between the Company and Excel Members, LLC (Excel), a company controlled by Bruce Cassidy, a member of our board of directors, to acquire certain assets of Excel a company of which a member of our Board of Directors is a Member, manager, and effectively has a controlling interest. Excel acquired certain assets of a company, Ultimate Gamer, LLC (UG) which was formerly an Esports tournament company, through the assignment for the benefit of the creditors court process. See Notes 10 and 11.\nOn September 15, 2022, we entered into an agreement to assign all of the Prior Business rights, including certain of its assets and liabilities, to TopSight Corporation, a company owned by Ms. Chen, the Companys former Chief Financial Officer until her resignation effective December 17, 2021. TopSights services terminated concurrently.\nAfter the foregoing transactions, we have effectively ceased our Prior Business operations and assembled a comprehensive platform capability that enables both business-to-business and direct-to-consumer offerings within the online sports betting, eSports, and fintech/digital currency markets. The platform is targeted at global business opportunities and has been designed as a flexible foundation for corporate growth.\nBasis of Presentation\nThe consolidated financial statements presented in this report are of KeyStar Corp. and UG Acquisition Sub, Inc.; its wholly-owned subsidiary. The Company maintains its accounting records on an accrual basis in accordance with generally accepted accounting principles in the United States of America (U.S. GAAP).\nPrincipals of Consolidation\nThe consolidated financial statements represent the results of KeyStar Corp. and UG Acquisition Sub, Inc.; its wholly-owned subsidiary. All intercompany transactions and balances have been eliminated upon consolidation of these entities.\nFiscal Year End\nThe Companys year-end is June 30.\nUse of Estimates\nThe preparation of the consolidated financial statements in conformity with accounting principles generally accepted in the United States requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, and disclosure of contingent liabilities at the date of the financial statements and the reported amounts of expenses during the reporting period. Actual results could differ from those estimates.\nGoing Concern\nThe Companys consolidated financial statements are prepared using the accrual method of accounting in accordance with accounting principles generally accepted in the United States of America and have been prepared on a going concern basis, which contemplates the realization of assets and the settlement of liabilities in the normal course of business. The Company has an accumulated deficit of $1,522,307 as of June 30, 2022. The Company had a net loss of $1,463,076 and negative cash flows of $280,596 from operations for the year ended June 30, 2022. These conditions raise substantial doubt about the entitys ability to continue as a going concern for a period of one year from the issuance of these financial statements. Our independent auditors, in their report on our audited financial statements for the year ended June 30, 2022, expressed substantial doubt about our ability to continue as a going concern.\nThe Company will be dependent upon, among other things, achieving a level of profitable operations and receiving additional cash infusions including securing additional lines of credit and raising additional capital through placement of preferred and/or common stock in order to implement its business plan. There can be no assurance that the Company will be successful in order to continue as a going concern. The Company is funding its initial operations by securing a related party line of credit, issuing preferred stock, and issuing common stock through private placements.\nWe cannot be certain that capital will be provided when it is required or in amounts sufficient to meet our operating requirements. Management believes the existing shareholders, the prospective new investors, and future sales will provide the additional cash needed to meet the Companys obligations as they become due and will allow the development of its core business operations. No assurance can be given that any future financing will be available or, if available, that it will be on terms that are satisfactory to the Company. Even if the Company is able to obtain additional financing, it may contain restrictions on our operations, in the case of debt financing, or cause substantial dilution for our stockholders, in case of equity financing.\nCash and Equivalents\nThe Company considers all highly liquid investments with an original maturity of three months or less to be cash equivalents. Cash includes amounts deposited in financial institutions in excess of insurable Federal Deposit Insurance Company (FDIC) limits. At times throughout the year, the Company may maintain cash balances in certain bank accounts in excess of FDIC limits. As of June 30, 2022, the cash balance did not exceed the FDIC limits. The Company has not experienced any losses in such accounts and believes it is not exposed to any significant credit risk in these accounts.\nInventory\nInventory is carried at the lower of cost and estimated net realizable value, with cost being determined using the first-in, first-out (FIFO) method. The Company establishes reserves for estimated excess and obsolete inventory equal to the difference between the cost of inventory and the estimated net realizable value of the inventory based on the estimated reserve percentage, which considers historical usage, known trends, inventory age, and market conditions. When the Company disposes of excess and obsolete inventories, the related disposals are charged against the inventory reserve. See Note 2.\nLease Commitments\nThe Company has no lease commitments. The Company leases a storage facility for its inventory on a month-to-month lease agreement.\nFair Value of Financial Instruments\nThe Company recognized the fair value of financial instruments in accordance with FASB ASC 820, Fair Value Measurements and Disclosures, Fair Value Measurements, which provides a framework for measuring fair value under GAAP. Fair value is defined as the exchange price that would be received for an asset or paid to transfer a liability (an exit price) in the principal or most advantageous market for the asset or liability in an orderly transaction between market participants on the measurement date. The standard also expands disclosures about instruments measured at fair value and establishes a fair value hierarchy, which requires an entity to maximize the use of observable inputs and minimize the use of unobservable inputs when measuring fair value. The standard describes three levels of inputs that may be used to measure fair value:\nLevel 1 - Quoted prices for identical assets and liabilities in active markets;\nLevel 2 - Quoted prices for similar assets and liabilities in active markets; quoted prices for identical or similar assets and liabilities in markets that are not active; and model-derived valuations in which all significant inputs and significant value drivers are observable in active markets; and\nLevel 3 - Valuations derived from valuation techniques in which one or more significant inputs or significant value drivers are unobservable.\nAs of June 30, 2022, the balances reported for cash, inventory, prepaid expenses, accounts payable, accrued expenses, related party notes payable, and related party line of credit approximate the fair value because of their short maturities.\nThe Company has had no transfers between levels of its assets or liabilities as of June 30, 2022.\nRevenue Recognition\nThe Company recognizes revenue in accordance with generally accepted accounting principles as outlined in the Financial Accounting Standard Boards (FASB) Accounting Standards Codification (ASC) 606, Revenue From Contracts with Customers, which consists of five steps to evaluating contracts with customers for revenue recognition: (i) identify the contract with the customer; (ii) identity the performance obligations in the contract; (iii) determine the transaction price; (iv) allocate the transaction price; and (v) recognize revenue when or as the entity satisfied a performance obligation.\nRevenue recognition occurs at the time we satisfy a service performance obligation to our customers or when control of product transfers to customers upon shipment, provided there are no material remaining performance obligations required of the Company or any matters of customer acceptance. We only record revenue when collectability is probable. All payments are received upon order of services and prior to delivery of product, so we have no accounts receivable.\nThe Company provides quality merchandise through our online store in the United States of America. Due to the COVID-19 pandemic, the Company is focusing on providing disposable face masks and KN-95 face masks at affordable prices. Product customers order and pay for the products through our online store, when the Company confirms the order and payment, the Company delivers the product through common carriers, at which point the Company recognizes the revenue, as this is when our performance obligation is satisfied. The Company records actual sales returns when the customers return the products. The transaction price has not been affected by returns based on the Company not having significant returns.\nFor the years ended June 30, 2022, and 2021, the Company recognized e-commerce sales of products $11,352 and, $47,172, respectively.\nFor the years ended June 30, 2022, and 2021, the Company recognized convention services revenues of $67,056 and $0, respectively.\nCost of Revenues\nCosts of revenues primarily consist of outsourced vendors for both types of revenues. The Company includes product costs (i.e., material, direct labor and overhead costs) and shipping and handling expense in cost of revenues.\nConcentration of Credit Risk\nDuring the year ended June 30, 2022, the Company had one customer that accounted for 86 percent total revenue.\nIncome Taxes\nThe Company accounts for income taxes under an asset and liability approach. This process involves calculating the temporary and permanent differences between the carrying amounts of the assets and liabilities for financial reporting purposes and the amounts used for income tax purposes. The temporary differences result in deferred tax assets and liabilities, which would be recorded on the Companys balance sheet in accordance with ASC 740, which established financial accounting and reporting standards for the effect of income taxes. The Company must assess the likelihood that its deferred tax assets will be recovered from future taxable income and, to the extent, the Company believes that recovery is not likely, the Company must establish a valuation allowance. Changes in the Companys valuation allowance in a period are recorded through the income tax provision on the statements of operations.\nASC 740-10 clarifies the accounting for uncertainty in income taxes recognized in an entitys financial statements and prescribes a recognition threshold and measurement attributes for financial statement disclosure of tax positions taken or expected to be taken on a tax return.\nUnder ASC 740-10, the impact of an uncertain income tax position on the income tax return must be recognized at the largest amount that is more likely than not to be sustained upon audit by the relevant taxing authority. An uncertain income tax position will not be recognized if it has less than a 50% likelihood of being sustained. Additionally, ASC 740-10 provides guidance on derecognition, classification, interest, and penalties, accounting in interim periods, disclosure, and transition. As a result of the implementation of ASC 740-10, the Company recognized no material adjustment in the liability for unrecognized income tax benefits.\nEarnings per Share\nBasic earnings per share (EPS) are determined by dividing the net earnings by the weighted-average number of shares of common shares outstanding during the period. Diluted EPS is determined by dividing net earnings by the weighted average number of common shares used in the basic EPS calculation plus the number of common shares that would be issued assuming conversion of all potentially dilutive securities outstanding under the treasury stock method. As of June 30, 2022, there were 201,391,520 potentially dilutive shares that need to be considered as common share equivalents and because of the net loss, the effect of these potential common shares is anti-dilutive.\nRecent Accounting Pronouncements\nThe Company does not expect the adoption of recently issued accounting pronouncements to have a potential impact on the Companys results of operations, financial position, or cash flow.\nNOTE 2 - INVENTORY\nAs of June 30, 2022, and 2021, the value of inventory was $992 and $8,341, respectively.\nInventory reserves are established for estimated excess and obsolete inventory equal to the difference between the cost of the inventory and the estimated net realizable value of the inventory on estimated reserve percentage, which consider historical usage, known trends, inventory age, and market conditions. As of June 30, 2022, and 2021, Inventory reserve was $175 and $1,472, respectively.\nJune 30, 2022\nJune 30, 2021\nDisposable Face Masks\n$\n-\n$\n3,179\nKN-95 Masks\n1,167\n6,634\nTotal Inventory\n1,167\n9,813\nLess: Inventory Reserve\n(175)\n(1,472)\nInventory, net\n$\n$\n8,341\nNOTE 3 - NOTES PAYABLE - RELATED PARTY\nOn April 27, 2020, the Company executed a promissory note with Zixiao Chen, our former Chief Financial Officer for $35,000. The note bears interest at 10% per annum and is due in two business days after demand for payment. As of June 30, 2022, the principal balance is $35,000 and accrued interest is $7,614. The interest expense for the year ended June 30, 2022, and 2021 was $3,500 and $3,500 respectively. The note was repaid in full on July 25, 2022. See Note 10.\nOn December 30, 2020, the Company executed a promissory note with note with Zixiao Chen, our former Chief Financial Officer for cash proceeds of $30,000. The note bears interest at 10% per annum and is due in two business days after the demand for payment. As of June 30, 2022, the principal balance is $30,000 and accrued interest is $4,496. The interest expense for the year ended June 30, 2021, and 2022 was $1,496 and $3,000, respectively. See Note 11.\nOn December 28, 2021, in connection with the assignment of that certain Demand Promissory Note dated April 20, 2020, in the principal amount of $10,000 (the Demand Note) that was initially in favor of Zixiao Chen (our Chief Financial Officer at the time of the Demand Notes issuance) was purchased from Ms. Chen by Eagle Investment Group, LLC, we amended and restated the demand note (the Demand Note) that is now in favor of Eagle Investment Group, LLC. a company controlled by Bruce Cassidy (our former Chief Executive Officer through June 14, 2022) our Chairman and member of our Board of Directors See Note 4.\nNOTE 4 - CONVERTIBLE DEBT - RELATED PARTY\nOn April 20, 2020, the Company executed a convertible promissory note with note with Zixiao Chen, our former Chief Financial Officer for $10,000. The note bears interest at 10% per annum and is due in two business days after demand for payment. This note is convertible at $0.001 per common share and can be converted by Notice of Conversion at the option of the holder. See Note 3.\nOn December 28, 2021, the noteholder transferred the loan to another entity that is controlled by Bruce Cassidy a member of the Companys Board of Directors. The Company and the new noteholder mutually agreed to allow the note to be converted into Series B Convertible Preferred Stock and the conversion price of $1.00 per share. The principal balance and accrued interest were converted into 11,693 shares of Series B Convertible Preferred Stock. The fair value of the stock was $833,000 and the Company recorded a loss on extinguishment of debt of $821,307. The interest expense for the year ended June 30, 2022, was $499.\nNOTE 5 - LINE OF CREDIT - RELATED PARTY\nOn February 22, 2022, the Company executed a non-revolving line of credit demand note for $250,000 with Excel Family Partners, LLLP a company controlled by Bruce Cassidy (our former Chief Executive Officer through June 14, 2022) our Chairman and a member of our board of directors. The note bears interest at 5% per annum. As of June 30, 2022, the balance of the line of credit is $166,539 including accrued interest. On August 16, 2022, the non-revolving line of credit demand note was increased to $2,000,000 under the same terms and conditions. See Note 11.\nNOTE 6 - STOCKHOLDERS DEFICIT\nThe Company is authorized to issue 475,000,000 shares of its $0.0001 par value common stock, 25,000,000 shares of its $0.0001 par value Series A preferred stock, 12,000 shares of its $1.00 par value Series B preferred stock, and 25,000,000 shares of its $0.0001 par value Series C preferred stock.\nThe Series A convertible preferred stock has a liquidation preference of $0.10 per share, has super-voting rights of 100 votes per share, and each share of Series A may be converted into 100 shares of common stock. On August 30, 2022, the Series A preferred shares owned by TopSight a company owned by Ms. Chen, the Companys former Chief Financial Officer were redeemed and the Company retired all the Series A Preferred shares. See Note 11.\nThe Series B convertible preferred stock has a liquidation preference of $1.00 per share, has super-voting rights, and votes are determined by multiplying (a) the number of shares of Series B Convertible Preferred Stock held by such holder and (b) the Conversion Ratio, and each share of Series B may be converted into 100 shares of common stock. The Series B preferred shares authorized were increased from 0 to 12,000 shares during the year.\nThe Series C convertible preferred stock has a liquidation preference of $0.30 per share, plus a 6% per annum coupon compounded annually since the date of issuance, have the right to vote for all matters submitted, including the election of directors, and all other matters as required by law. The Series C shall automatically convert into Common stock by multiplying the number of shares of Series C to be converted by the quotient obtained by dividing (x) the Liquidation Value by (y) the Conversion value upon the date that is the earlier of (a) the closing date of an underwritten, follow-on public offering of shares of the Corporations Common Stock with gross offering proceeds of not less than $6,000,000; (b) the date the Corporation receives written notice from a holder of Series C Convertible Preferred Stock of such holders desire and intention to convert all or some of such holders Series C Convertible Preferred Stock; and (c) June 15, 2024. The Series C preferred shares authorized were increased from 0 to 475,000,000 shares during the year.\nSeries A Preferred Stock\nDuring the year ended June 30, 2022, there were no issuances of Series A preferred stock.\nSeries B Preferred Stock\nOn December 28, 2021, the Company issued 11,693 shares of Series B Convertible Preferred Stock in exchange for the extinguishment of debt. The loss from the extinguishment of debt is $821,307. See Note 4.\nSeries C Preferred Stock\nOn June 28, 2022, the Company issued 666,666 shares of Series C Convertible Preferred Stock to Excel Family Partners, LLLP a company controlled by Bruce Cassidy (our former Chief Executive Officer through June 14, 2022) our Chairman and a member of our board of directors for net cash proceeds of $97,240.\nCommon Stock\nDuring the year ended June 30, 2022, there were no issuances of common stock.\nNOTE 7 - STOCK OPTIONS\nThe KeyStar Corp. 2021 Stock Plan (2021 Stock Plan) will provide eligible participants with benefits consisting of one or more of the following: Incentive Stock Options (ISOs), Nonstatutory Stock Options (NSOs), and bonuses in the form of common stock in the Company (Stock Bonuses). The Board of Directors of the Company or a committee of directors shall administer the 2021 Stock Plan. The Board or committee shall determine what employees or officers shall receive an award under the Plan. ISOs, which are intended to be compliant with Section 422 of the Internal Revenue Code, may be awarded only to employees of the Company. NSOs and Stock Bonuses are not subject to Section 422 of the Internal Revenue Code and can be awarded to employees and non-employee officers. The aggregate number of Shares of the Company that can be awarded under the Plan is 5,960,000 shares of Common Stock, whether in the form of ISOs, NSOs, or Stock Bonuses (or a combination thereof). Awards can be issued under the Plan for ten years from the effective date of the Plan. ISOs may be exercised during a period no longer than 10 years from the date of the award (5 years for individuals who own more than 10% of the combined voting power of the Company). NSOs may be exercised for a maximum period of 10 years from the date of the award. ISOs and NSOs may not be exercised after the earlier of the following: (a) in the event of termination for cause (as defined by the plan): the date of termination; (b) in the event of termination due to death or disability: the earlier of the ISO or NSOs expiration or one year after the termination due to death or disability; (c) in the event of termination for any other reason: three months following the date of termination. No awards have yet been made under the Plan.\nNOTE 8 - COMMITMENTS AND CONTINGENCIES\nAs of June 30, 2021, the Company had the following contractual commitments. As of June 30, 2021, the Company did not have any known commitments or contingencies. Commitments as of June 30, 2022, are as follows:\nOn June 14, 2022, the Company entered into an employment agreement with John Linss, as the Companys Chief Executive Officer. The agreement was amended on August 16, 2022. The agreement and amended agreement work in tandem and provide for a 3-year term at an annual base salary of $500,000, a $112,000 signing bonus, a bonus of no less than $425,000 if Mr. Linss is still employed on December 31, 2022, to be paid in January 2023, a bonus of $300,000 should the Company achieve a stock listing up-list, a grant on August 16, 2022, of 2,980,000 restricted Series C convertible stock, which includes voting rights. The stock vests on June 13, 2025, or sooner upon the company meets certain milestones, as well as participation in any company benefits, stock option, or bonus plans, none of which have been formalized or entered into at this time. See Notes 10 and 11.\nLegal matter contingencies\nThe Company believes, based on current knowledge and after consultation with counsel, that it is not currently party to any material pending proceedings, individually or in the aggregate, the resolution of which would have a material effect on the Company. Provisions for losses are established in accordance with ASC 450, Contingencies when warranted. Once established, such provisions are adjusted when there is more information available about an event occurs requiring a change.\nNOTE 9 - INCOME TAXES\nThe provision for income taxes on the statements of operations consists of $0 and $0 for the years ended June 30, 2022, and 2021. Deferred tax assets are comprised of the following at June 30:\nNet operating loss carryforward\n$\n149,311\n$\n14,539\nTemporary differences\n-\n-\nLess: Valuation allowance\n(149,311)\n(14,539)\nDeferred tax asset, net\n$\n-\n$\n-\nDeferred taxes arising from temporary differences in the recognition of certain expenses for tax and financial reporting purposes. At June 30, 2022, and 2021, management determined that realization of these benefits is not assured and has provided a valuation allowance for the entire amount of such benefits. At June 30, 2022, and 2021, net operating loss carryforwards were approximately $711,007 and $69,232, respectively, for federal tax purposes that expire at various dates through 2041.\nUtilization of net operating loss carryforwards may be subject to substantial annual limitations due to the change in ownership provisions of the Internal Revenue Code of 1986, as amended, and similar state regulations. The annual limitation may result in the expiration of substantial net operating loss carryforwards before utilization.\nFor June 30, 2022, the provision for income taxes differs from the amount computed by applying the U.S. federal statutory tax rate (21% in 2022) to income taxes as follows:\nTax benefit computed at 21%\n$\n-\n$\n-\nChange in valuation allowance\n149,311\n14,539\nChange in carryovers and tax attributes\n(149,311)\n(14,539)\nIncome tax provision\n$\n-\n$\n-\nNOTE 10 - RELATED PARTY TRANSACTIONS\nOn June 14, 2022, the Company entered into an employment agreement with John Linss, as the Companys Chief Executive Officer. The agreement was amended on August 16, 2022. The agreement and amended agreement work in tandem and provide for a 3-year term at an annual base salary of $500,000, a $112,000 signing bonus, a bonus of no less than $425,000 if Mr. Linss is still employed on December 31, 2022, to be paid in January 2023, a bonus of $300,000 should the Company achieve a stock listing up-list, a grant on August 16, 2022, of 2,980,000 restricted Series C convertible stock, which includes voting rights and 100% vesting as of August 16, 2022, or sooner if certain agreed upon transactions occur, as well as participation in any company benefits, stock option or bonus plans, none of which have been formalized or entered into at this time. See Notes 8 and 11.\nDuring the year ended June 30, 2022, the Companys former Chief Financial Officer paid $5,006 of expenses on behalf of the Company and demanded repayment of $5,507 leaving a balance due to related party of $17,565 as of June 30, 2022.\nAs of June 30, 2022, the balance of accounts payable and accrued expenses due to the Companys former Chief Financial officer was $43,675. The amounts are included in accounts payable and accrued expenses on the balance sheet.\nOn April 27, 2020, the Company executed a promissory note with Zixiao Chen, our former Chief Financial Officer for $35,000. The note bears interest at 10% per annum and is due in two business days after the demand for payment. As of June 30, 2022, the principal balance is $35,000 and accrued interest is $7,614. The interest expense for the year ended June 30, 2022, and 2021 was $3,500 and $3,500 respectively. The note was repaid in full on July 25, 2022. See Note 10.\nOn September 12, 2022, we entered into an Asset Purchase Agreement between the Company and Excel Members, LLC, to acquire certain assets of Excel. Mr. Cassidy, a member of our board of directors, our corporate secretary,\nand the holder of a majority of our issued and outstanding common stock prior to the Transaction, is a member, manager, and controlling owner of Excel.\nWe purchased a portion of the UG Assets, consisting primarily of intellectual property, including trademarks, domain name registrations, and UGs database(s) of users and gamers for 1,500,000 shares of our common stock, valued at $1.00 per share, which is the same consideration paid by unrelated and non-affiliated investors in our current private offering of common shares. We did not assume any liabilities or obligations of Excel or UG.\nOn September 15, 2022, we entered into an agreement to assign all of Prior Business rights including certain of its assets and liabilities to TopSight Corporation a company owned by Ms. Chen the Companys former Chief Financial Offer.\nThe Company has a note $30,000 payable demand note payable, and a non-revolving line of credit demand note with a company managed by a member of the Board of Directors of the Company. See Notes 3, 4, and 5.\nDuring the years ended June 30, 2021, and 2022 the Companys former Chief Financial Officer was paid $7,125 and $28,000 in management fees to TopSight Corporation a company owned by Ms. Chen the Companys former Chief Financial Offer, respectively.\nNOTE 11 - SUBSEQUENT EVENTS\nIn accordance with ASC 855-10, the Company has analyzed its operations subsequent to June 30, 2022, to the date these financial statements were issued. The following subsequent events were deemed material and as such disclosed in these financial statements:\nFinancings:\nSeries C convertible preferred stock issuances:\nOn July 11, 2022, the company sold 2,166,666 shares of its convertible preferred series C stock at $0.30 per share for total proceeds of $650,000 to related parties. A company managed by a member of Excel Family Partners, LLLP a company controlled by Bruce Cassidy (our former Chief Executive Officer through June 14, 2022) our Chairman and a member of our board of directors purchased 1,000,000 shares, Zen SRQ LLC a company associated with a former member of the board of directors purchased 833,332 and Core Speed, LLC a Company owned by our Chief Executive officer purchased 333,333 shares. The proceeds were used to fund operations.\nTransactions with our former Chief Financial Officer:\nOn July 26, 2022, the Company made 3 payments to the Companys former Chief Financial Officer totaling $77,000 for the settlement of the three above-noted liabilities, to redeem and retire the 2,000,000 shares of Series A preferred owned by her and outstanding at June 30, 2022, and in anticipation of the execution of assignment and assumption agreement to assume agreed upon assets and liabilities of the Prior Business The assignment and assumption agreement was executed on September 15, 2022. The Series A preferred was redeemed and retired on July 26, 2022. The payments were made as follows.\nOn July 26, 2022, the Company paid off the promissory note held by the Companys former Chief Financial Officer for $35,000. The accrued interest accrued was waived.\nOn July 26, 2022, the Company reimbursed Companys former Chief Financial Officer $20,000 to settle the accrued expenses owed by the Company.\nOn July 26, 2022, the company redeemed and retired the 2,000,000 Series A preferred stock owned by Ms. Chen for $22,000.\nEmployment agreement:\nOn August 16, 2022, we completed negotiations and amended our Chief Executives employment agreement originally dated June 14, 2022, whereby the Company entered into an employment agreement with John Linss, as the Companys Chief Executive Officer. The agreement and amended agreement work in tandem and provide for a\n3-year term at an annual base salary of $500,000, a $112,000 signing bonus, a bonus of no less than $425,000 if Mr. Linss is still employed on December 31, 2022, to be paid in January 2023, a bonus of $300,000 should the Company achieve a stock listing up-list, a grant on August 16, 2022, of 2,980,000 restricted Series C convertible stock, which includes voting rights and 100% vesting as of August 16, 2022, or sooner if certain agreed upon transactions occur, as well as participation in any company benefits, stock option or bonus plans, none of which have been formalized or entered into at this time. See Notes 8 and 10.\nTechnological asset purchases from unrelated companies:\nZenSports, Inc.\nPrior to entering the Transaction, on June 16, 2022, we hired certain employees Key Persons of ZenSports, Inc. including Mark Thomas as our Chief Product Officer. Mr. Thomas is still the Chief Executive Officer and sole member of the board of directors of ZenSports. The Key Persons, as a group, are collectively the record and beneficial owners of a majority of the issued and outstanding shares of capital stock of the surviving ZenSports, Inc.\nOn August 26, 2022, 6,500,000 shares of the Companys common stock were issued in exchange for the purchase of certain technological assets of ZenSports, Inc. Concurrently the Company issued 750,000 shares of common stock in conjunction with a $750,000 private placement in a public company. In connection with the Transaction, on August 31, 2022, we paid an aggregate of $1,000,000 in bonuses to Key Persons (the Bonuses) as defined in the Asset Purchase Agreement (APA).\nZenSports is in the business of offering gambling and entertainment opportunities through technology and a physical casino. The Company purchased a portion of ZenSports assets, principally the online gaming technology and use of the name ZenSports. The assets we didnt purchase include, among other assets, ZenSports legal entity name ZenSports, Inc. and those assets related to ZenSports physical casino called the Big Wheel Casino, located in Lovelock, Nevada.\nPursuant to the terms and conditions of the APA, the aggregate purchase price paid to ZenSports consisted of cash in the amount of $481,054; cash in the amount of $1,030,593 for Bonuses including employer payroll taxes; 5,850,000 shares of our common stock, valued at $1.00 per share, which is the same consideration paid by unrelated and non-affiliated investors in our private offering of common shares which closed on August 26, 2022 (the Stock Consideration); and (iii) 650,000 additional shares of our common stock subject to set off or recoupment by us until August 25, 2023, in connection with any indemnified losses we may incur pursuant to the Purchase Agreement (the Holdback Stock, and together with the Stock Consideration, the Transaction Shares).\nIn connection with the Transaction and issuance of the Transaction Shares, we also entered into a Registration Rights Agreement (the Registration Rights Agreement) with ZenSports (together with any other party that may become a party to the Registration Rights Agreement, Holders). Pursuant to the Registration Rights Agreement, subject to the terms and conditions set forth therein, we are obligated, among other things, to use our reasonable best efforts to prepare and file on the six-month anniversary of our common stock becoming listed on the New York Stock Exchange, The NYSE American, The Nasdaq Global Market, The Nasdaq Global Select Market, The Nasdaq Capital Market or any successor or substantially equivalent national securities exchange a registration statement covering the sale or distribution from time to time of our common stock held by Holders. We are also obligated to provide for the registration of such registrable securities for resale by Holders in accordance with any reasonable method of distribution elected by Holders, and to use our reasonable best efforts to cause such registration statement to be declared effective by the Securities and Exchange Commission as promptly as is reasonably practicable.\nCash payments for ZenSports, Inc. pursuant to the APA and related financings:\nIn connection with the Transaction, on August 31, 2022, we paid an aggregate of $1,000,000 in bonuses to Key Persons (the Bonuses) as defined in the Asset Purchase Agreement (APA). To pay part of the Bonuses, we borrowed an additional $735,120 under the related party LOC and we used proceeds from the $750,000 Private Offering to pay the remaining amount of the Bonuses and the employer portion of payroll taxes owed as a result of the Bonuses.\nOn August 16, 2022, the related party non-revolving line of credit demand note managed by a member of the Board of Directors was increased to $2,000,000 under the same terms and conditions. From August 24, 2022, we drew down a total of $1,037,430 on the line of credit of which $735,120 was used to pay net bonus payments made as part\nof cash payments made in association with the ZenSports asset purchase described below, the remainder was used to pay payroll taxes associated with the ZenSports asset purchase bonus and ongoing operating costs, principally compensation and recurring operating services.\nOn August 26, 2022, we closed on a private offering of our common stock where we sold an aggregate of 750,000 shares of our common stock to 11 third-party investors at a price of $1.00 per share for an aggregate purchase price of $750,000 (the Private Offering). Each of the investors had access to information concerning us and our business prospects and represented to us in connection with their purchase that they: (i) acquired the securities for investment only and not with a view to or for sale in connection with any distribution thereof; (ii) were accredited investors (iii) could bear the risks of the investment, and (iv) could hold the securities for an indefinite period of time. The offer, sale, and issuance of the shares were deemed to be exempt from registration under the Securities Act in reliance on Section 4(a)(2) of the Securities Act and/or Rule 506(b) of Regulation D promulgated thereunder, as transactions by an issuer not involving a public offering.\nFrom August 26 to September 26, 2022, we had multiple closings on our private offering including a $250,000, 80,000, and $100,000 close for a total of $430,000 to 4 third-party investors at a price of $1.00 per share under the same terms and conditions as the $750,000 close.\nUltimate Gamer\nOn September 12, 2022, we entered into an Asset Purchase Agreement with Excel Members, LLC, a company controlled by Bruce Cassidy, our Chairman and member of our Board of Directors, to acquire certain assets of a company acquired previously by Excel through an assignment for the benefit of creditors. Ultimate Gamer, LLC (UG), which was formerly in the business of organizing and operating in-person and online video game competitions tournaments, originally owned these assets. The purchased assets included the brand name Ultimate Gamer.\nWe purchased a portion of the UG Assets, consisting primarily of intellectual property, including trademarks, domain name registrations, and UGs database(s) of users and gamers for 1,500,000 shares of our common stock, valued at $1.00 per share, which is the same consideration paid by unrelated and non-affiliated investors in our current private offering of common shares. We did not assume any liabilities or obligations of Excel or UG.\nDisposition of Prior Business\nOn September 15, 2022, we entered into an agreement to assign all of Prior Business rights including certain of its assets and liabilities to TopSight Corporation a company owned by Ms. Chen the Companys former Chief Financial Offer.\nAfter the foregoing transactions, we have effectively ceased our Prior Business operations and assembled a comprehensive platform capability that enables both business-to-business and direct-to-consumer offerings within the online sports betting, eSports, and fintech/digital currency markets. The platform is targeted at global business opportunities and has been designed as a flexible foundation for corporate growth."
}