{
    "cik": "1844519",
    "company": "Drax, Industries Inc.",
    "filing_type": "10-K",
    "filing_date": "2022-10-26",
    "period_of_report": "2021-12-31",
    "sic": "3533",
    "state_of_inc": "WY",
    "state_location": "CA",
    "fiscal_year_end": "1231",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1844519/0001079973-22-001353-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1844519/000107997322001353/drax_10k-123121.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1844519/0001079973-22-001353.txt",
    "filename": "1844519_10K_2021_0001079973-22-001353.htm",
    "content": "Item 1. Business.\nOur Company\nDRAX, INDUSTRIES INC. (\"the Company\", \"Drax\") was incorporated in the state of Wyoming on March 24, 2020 (\"Inception\"). The Company is an assembly company that intends to provide one product to consumers: a mobile evaporative cooling trailer that is 83 inches by 16 feet called \"R3Cooler\"\nOur principal executive offices are located at 1385 Park Center Drive, Vista, California 92081. Our telephone number is (760) 739-0069. Our fiscal year end is December 31.\nPrincipal Business\nDrax, Industries cooling trailer is self-contained, fully equipped cooling systems that allow people to sit in and escape the outdoor heat by lowering temperatures as much as 30 degrees. The evaporative cooling trailers are designed to aid in the relief of heat stress in outdoor work sites.\nThe Department of Labor Occupational Safety & Health Administration, OSHA Technical Manual Section III Chapter 4 sets forth Guidelines for Operations conducted outdoors in hot weather. Such as construction, refining, and fire control, especially those that require workers to wear protective clothing. A Cool Box trailer on the job site allows the workers to cool off in compliance with the OSHA regulations. It is likely that the OSHA requirements will increase in the future increasing the market for cool Box products.\nThe evaporative cooling trailer have two 3,500 lb. axles, brakes with a breakaway kit, 12,000lb jack, two 5/16 adjustable cast coupler, 3 x 2 Angle cross members, 5\" Channel frame and tongue, 5\" Boxed flush floor, all lights sealed rubber mounted in frame and 225/75/15 8 ply tires with spare. We purchase trailers for our B-26 from Air-Tow which is located at 1480 Arrow Hwy. La Verne, Ca. 91750. The system uses an evaporating cooling system and a 325-gallon water tank.\nThe evaporative cooling trailer will be sold directly to the customers. Drax technology is based on the principles of evaporative cooling which has been around for years.\nAs water is evaporated, energy is lost from the air, reducing the temperature. Two temperatures are important when dealing with evaporative cooling systems.\nDry Bulb Temperature\nThis is the temperature that we usually think of as air temperature, measured by a regular thermometer exposed to the air stream.\nWet Bulb Temperature\nThis is the lowest temperature that can be reached by the evaporation of water only.\nWhen considering water evaporating into air, the wet-bulb temperature, as compared to the air's dry-bulb temperature is a measure of the potential for evaporative cooling. The dry and wet bulb temperature can be used to calculate the relative humidity.\nEvaporation will take place when the humidity is below 100% and the air begins to absorb water. Any given volume of air can hold a certain amount of water vapor and the degree of absorption will depend on the amount it is already holding.\nThe term humidity describes how much water is already in the air; relative to the amount it can hold. Air is saturated when it cannot hold any more water. Imagine it as a sponge: if the sponge held half as much water as it could hold, it would be 50% saturated. In the case of air, we would describe the relative humidity as being 50%.\nEnergy is required to change water from liquid to vapor. This energy is obtained in an adiabatic process from the air itself. Air entering an evaporative air cooler gives up heat energy to evaporate water. During this process, the dry bulb temperature of the air passing through the cooler is lowered as much as 30 degrees.\nDrax has commenced its major operations of selling and then assembling R3Cooler units. The Company has distributed two to date and has orders for another 4 units to date.\nGovernment Regulation\nWe are subject to government regulations that regulate businesses generally, such as compliance with regulatory requirements of federal, state, and local agencies and authorities, including regulations concerning workplace safety and labor relations. In addition, our operations are affected by federal and state laws relating to marketing practices in the music industry. Environmental laws and regulations do not materially impact our operations.\nResearch and Development\nWe have not spent any funds on research and development activities in connection with our business.\nPersonnel\nAs of December 31, 2021, we employed one person on a part-time basis. Our employee is not subject to a collective bargaining agreement. We believe that our relationship with our employee is good. Item 1A. Risk Factors.\nNot applicable to smaller reporting companies. Item 1B. Unresolved Staff Comments.\nNone. Item 2. Properties.\nOur executive offices are located at 1385 Park Center Drive, Vista California 92081. On January 1, 2022, the Company entered into a new lease at 1385 Park Center Drive in Vista, CA 92081 consisting of approximately 7,500 square feet. of office/warehouse space. The lease is for the 6-month period from January 1, 2022 to June 30, 2022, with options for additional periods, at $12,807 per month. Per the agreement, the months of January, February, and March 2022 are rent-free, with the first least payment due on the 1st of every month. The existing Security Deposit of $50,366 shall carry over to the new lease. The Company is not responsible for property taxes or repairs. The Company is presently at the same location on a month to month basis at $12,807 per month. Item 3. Legal Proceedings.\nWe are not a party to any legal proceedings, nor are we aware of any threatened litigation whatsoever. Item 4. Mine Safety Disclosures\nNot applicable to smaller reporting companies.\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities.\nMarket Information\nNone.\nHolders of Record\nAs of December 31, 2021, and 2020, there were 35 record holders and one as of December 31, 2020, of the Companys common stock.\nDividend Policy\nWe have never declared or paid any cash dividends on our common stock. We do not anticipate paying any cash dividends on our common stock in the foreseeable future. We currently intend to retain future earnings, if any, to finance our operations, and to expand our business. Subject to the rights of holders of preferred stock, any future determination to pay cash dividends will be at the discretion of our board of directors and will be dependent upon our financial condition, operating results, capital requirements, limitations under Florida law and other factors that our board of directors considers appropriate.\nRecent Sales of Registered Securities\nThe Company filed a General form for registration of securities under the Securities Act of 1933 on February 12, 2021. The registration Statement became effective May 13, 2021. Pursuant to the May 13, 2021, registration Statement the company has sold to 35 investors 3,136,571 shares of the Companys common stock and received $784,143 cash. Item 6. Selected Financial Data.\nNot applicable to smaller reporting companies. Item 7. Managements Discussion And Analysis Of Financial Condition And Results Of Operations\nThe following discussion and analysis should be read in conjunction with our financial statements, including the notes thereto, appearing in this Form 10-K and are hereby referenced. The following discussion contains forward-looking statements that reflect our plans, estimates and beliefs. Our actual results could differ materially from those discussed in the forward-looking statements. Factors that could cause or contribute to such differences include, but are not limited to, those discussed below and elsewhere in this report. You should not place undue certainty on these forward-looking statements, which apply only as of the date of this report. We believe it is important to communicate our expectations. However, our management disclaims any obligation to update any forward-looking statements whether as a result of new information, future events or otherwise.\nThe COVID-19 pandemic has adversely impacted and is likely to further adversely impact the Company's business and markets. The full extent to which the COVID-19 pandemic will directly or indirectly impact the Company's business, results of operations and financial condition, including revenues, expenses, reserves and allowances, fair value measurements and asset impairment charges, will depend on future developments that are highly uncertain and difficult to predict. These developments include, but are not limited to, the duration and spread of the pandemic, its severity in our markets and elsewhere, governmental actions to contain the spread of the pandemic and respond to the reduction in global economic activity, and how quickly and to what extent normal economic and operating conditions can resume.\nThese forward-looking statements are based on our managements current expectations and beliefs and involve numerous risks and uncertainties that could cause actual results to differ materially from expectations. You should not rely upon these forward-looking statements as predictions of future events because we cannot assure you that the events or circumstances reflected in these statements will be achieved or will occur. You can identify a forward-looking statement by the use of the forward-terminology, including words such as may, will, believes, anticipates, estimates, expects, continues, should, seeks, intends, plans, and/or words of similar import, or the negative of these words and phrases or other variations of these words and phrases or comparable terminology. These forward-looking statements relate to, among other things: our sales, results of operations and anticipated cash flows; capital expenditures; depreciation and amortization expenses; sales, general and administrative expenses; our ability to maintain and develop relationship with our existing and potential future customers, and, our ability to maintain a level of investment that is required to remain competitive. Many factors could cause our actual results to differ materially from those projected in these forward-looking statements, including, but not limited to: variability of our revenues and financial performance; risks associated with technological changes; the acceptance of our products in the marketplace by existing and potential customers; disruption of operations or increases in expenses due to our involvement with litigation or caused by civil or political unrest or other catastrophic events; general economic conditions, government mandates; and, the continued employment of our key personnel and other risks associated with competition.\nOverview\nDRAX, INDUSTRIES INC. (\"the Company\", \"Drax\") was incorporated in the state of Wyoming on March 24, 2020 (\"Inception\"). The Company is an assembly company that intends to provide a mobile evaporative cooling trailer that is 83 inches by 16 feet called \"R3Cooler.\nPlan of Operation\nDrax, Industries cooling trailer is self-contained, fully equipped cooling systems that allow people to sit in and escape the outdoor heat by lowering temperatures as much as 30 degrees. The evaporative cooling trailers are designed to aid in the relief of heat stress in outdoor work sites.\nThe Department of Labor Occupational Safety & Health Administration, OSHA Technical Manual Section III Chapter 4 sets forth Guidelines for Operations conducted outdoors in hot weather. Such as construction, refining, and fire control, especially those that require workers to wear protective clothing. A Cool Box trailer on the job site allows the workers to cool off in compliance with the OSHA regulations. It is likely that the OSHA requirements will increase in the future increasing the market for cool Box products.\nThe evaporative cooling trailer have two 3,500 lb. axles, brakes with a breakaway kit, 12,000lb jack, two 5/16 adjustable cast coupler, 3 x 2 Angle cross members, 5\" Channel frame and tongue, 5\" Boxed flush floor, all lights sealed rubber mounted in frame and 225/75/15 8 ply tires with spare. We purchase the B-26 trailers from Air-Tow which is located at 480 Arrow Hwy. La Verne, Ca. 91750. The system uses an evaporating cooling system and a 325-gallon water tank.\nThe evaporative cooling trailer will be sold directly to the customers. Drax technology is based on the principles of evaporative cooling which has been around for years.\nAs water is evaporated, energy is lost from the air, reducing the temperature. Two temperatures are important when dealing with evaporative cooling systems.\nDry Bulb Temperature\nThis is the temperature that we usually think of as air temperature, measured by a regular thermometer exposed to the air stream.\nWet Bulb Temperature\nThis is the lowest temperature that can be reached by the evaporation of water only.\nWhen considering water evaporating into air, the wet-bulb temperature, as compared to the air's dry-bulb temperature is a measure of the potential for evaporative cooling. The dry and wet bulb temperature can be used to calculate the relative humidity.\nEvaporation will take place when the humidity is below 100% and the air begins to absorb water. Any given volume of air can hold a certain amount of water vapor and the degree of absorption will depend on the amount it is already holding.\nThe term humidity describes how much water is already in the air; relative to the amount it can hold. Air is saturated when it cannot hold any more water. Imagine it as a sponge: if the sponge held half as much water as it could hold, it would be 50% saturated. In the case of air, we would describe the relative humidity as being 50%.\nEnergy is required to change water from liquid to vapor. This energy is obtained in an adiabatic process from the air itself. Air entering an evaporative air cooler gives up heat energy to evaporate water. During this process, the dry bulb temperature of the air passing through the cooler is lowered as much as 30 degrees.\nDrax has commenced its major operations of selling and then assembling R3Cooler units. The Company has distributed two cooling units to date and has orders for another 4 units to date.\nResults of Operations for the Year Ended December 31, 2021, compared to the Year Ended December 31, 2020\nRevenues. Revenue for the year ended December 31, 2021, was $31,000 as compared to 0 for the year ended December 31, 2020, Revenue increased due to our sales of cooling units.\nGeneral and Administrative Expenses. Selling, general and administrative expenses for the year ended December 31, 2021, were $156,872 as compared to $1,125 for year ended December 31, 2020. General and administrative expenses increased due to expenses related to generating revenue, and the Company incurring more expenses related to being a public reporting company, including service fees and for preparing our SEC reports.\nLiquidity and Capital Resources\nWe measure our liquidity in a number of ways, including the following:\nAs of As of\nDecember 31, 2021 December 31, 2020\nCash $ 17,344 $ 3,300\nAccumulated Equity (Deficit) $ (205,761 ) $ (4,753\nCurrent Liabilities $ 2,724 $ -\nImpact of Inflation\nWe believe that the rate of inflation has had negligible effect on our operations. We believe we can absorb most, if not all, increased non-controlled operating costs by increasing sales prices, whenever deemed necessary and by operating our Company in the most efficient manner possible.\nNet Cash Used in Operating Activities\nWe experienced negative cash flow from operating activities for the year ended December 31, 2021, in the amount of $645,710) due to cash used to fund a net loss of $201,008 , adjusted for the increase in professional fees to being a public reporting company, plus rent was just under $147,776, setting up the warehouse, the purchase of inventory, and prepaid expenses.\nWe experienced negative cash flow from operating activities for the period ended December 31, 2020, in the amount of $7,000 due to cash used to fund a net loss of $4,753, adjusted for the increase in accounts payable for legal and accounting services to being a public reporting company.\nNet Cash Used in Investing Activities\nWe experienced negative cash flow from investing activities for the year ended December 31, 2021, in the amount of $111,305 due to costs involved in setting up a physical site and the purchase of furniture, equipment and vehicles and related depreciation. The Company did not have any investing activities in 2020.\nNet Cash Provided by Financing Activities\nWe experienced positive cash flow from financing activities for the year ended December 31, 2021, in the amount of $771,059 due to the sale of common stock and the creation of a line-of-credit loan.\nAvailability of Additional Funds\nBased on our working capital as of December 31, 2021, we will need additional equity and/or debt financing to continue our operations during the next 12 months. See Description of Business.\nCritical Accounting Policies and Estimates\nOur financial statements and accompanying notes have been prepared in accordance with United States generally accepted accounting principles applied on a consistent basis. The preparation of financial statements in conformity with United States generally accepted accounting principles requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, the disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting periods. Actual results could differ from these estimates. Our significant estimates and assumptions include amortization, the fair value of our stock, and the valuation allowance relating to the Companys deferred tax assets.\nWe qualify as an emerging growth company, as defined in the Jumpstart Our Business Startups Act, which became law in April 2012. Under the JOBS Act, emerging growth companies, can delay adopting new or revised accounting standards until such time as those standards apply to private companies. We have elected not to avail ourselves of this exemption from new or revised accounting standards and, therefore, will be subject to the same new or revised accounting standards as other public companies that are not emerging growth companies.\nThe accompanying financial statements have been prepared in conformity with generally accepted accounting principles (U.S. GAAP), which contemplate continuation of the Company as a going concern. However, the Company has not commenced its major operations and has accumulated a capital deficit as of December 31, 2021. The Company currently has limited liquidity and has not completed its efforts to establish a stabilized source of revenues sufficient to cover operating costs over an extended period of time. Management has evaluated these factors and has determined that they raise substantial doubt about the Companys ability to continue as a going concern.\nRecently Issued Accounting Pronouncements\nReference is made to the Organization and Significant Accounting Pronouncements in Note 1 to our financial statements included elsewhere in this report for information related to new accounting pronouncements.\nMaterial Commitments\nDrax, Industries Inc. leased office/warehouse at located at 3151 Scott Street, Vista California 92081 effective December 15, 2020. The lease is for a period of 36 months. The warehouse space consists of 2,500 square feet of warehouse space and 500 feet of office space for a total of 3,000 square feet. Rent for the facility is $-0- per month for the first nine months; and then $3,000 per month thereafter. The Company is not responsible for property taxes or repairs. There are currently no proposed programs for renovation, improvement, or development of the facility.\nOn July 15, 2021, the above lease was terminated and the Company entered into a new lease at the same address consisting of 22,000 square feet of office/warehouse space. The lease is for the 6-month period from July 15, 2021 to December 31, 2021, at $24,817 per month. The Company is not responsible for property taxes or repairs.\nUpon execution of the lease, $100,000 was paid to Optec International for first and last months rents at $24,817 each, and $50,366 security deposits as framed out in the lease agreement.\nOn January 1, 2022, the Company entered into a new lease at 1385 Park Center Drive in Vista, CA 92081 consisting of approximately 7,500 square feet. of office/warehouse space. The lease is for the 6-month period from January 1, 2022 to June 30, 2022, with options for additional periods, at $12,807 per month. Per the agreement, the months of January, February, and March 2022 are rent-free, with the first least payment due on the 1st of every month. The existing Security Deposit of $50,366 shall carry over to the new lease. The Company is not responsible for property taxes or repairs. The Company is presently at the same location on a month to month basis at $12,807 per month.\nPurchase of Furniture and Equipment\nAs of December 31, 2021, we had $111,305 purchases of furniture and equipment. Purchases include fees related to setting up the warehouse, the purchase of inventory, and prepaid expenses.\nThe Company recognized interest expense for both loans for the twelve-month period ending December 31, 2021 of $642.\nOff-Balance Sheet Arrangements\nAs of December 31, 2021, we do not have any off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources that are material to investors.\nCritical Accounting Policies\nOur financial statements and accompanying notes have been prepared in accordance with United States generally accepted accounting principles applied on a consistent basis. The preparation of financial statements in conformity with United States generally accepted accounting principles requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, the disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting periods.\nWe regularly evaluate the accounting policies and estimates that we use to prepare our financial statements. In general, management's estimates are based on historical experience, on information from third party professionals, and on various other assumptions that are believed to be reasonable under the facts and circumstances. Actual results could differ from those estimates made by management.\nCash and Cash Equivalents\nWe consider all highly liquid debt instruments with original maturities of three months or less to be cash equivalents. We have no cash equivalents.\nRevenue Recognition\nRevenue is recognized when a customer obtains control of promised goods or services and is recognized at an amount that reflects the consideration expected to be received in exchange for such goods or services. The billing invoice is prepared at that time.\nThe Company recognizes revenue in accordance with Accounting Standards Codification (ASC) Topic 606. The underlying principle is that the Company recognize revenue to depict the transfer of promised goods and services to customers in an amount that they expect to be entitled to in the exchange for goods and services provided. A process has been designed for the sale of Cooling Trailers for contracts to keep financial statements focused on this principle.\nRevenues from cost-to-cost method is used because management considers it to be the best available measure of progress on these contacts. Revenues from cost-plus-fee contracts are recognized on the basis of costs incurred during the period plus the fee earned, measured on the cost-to-cost method.\nRevenues from maintenance service contracts are recognized on a straight-line basis over the life of the contract once the Company has an agreement, service has begun, the price is fixed or determinable and collectability is reasonably assumed.\nCost of revenues include all direct material, sub-contractor, labor and certain other direct costs, as well as those indirect costs related to contract performance, such as indirect labor and fringe benefits. Selling, general, and administrative costs are charged to expense as incurred. Provisions for estimated losses on uncompleted contracts are made in the period in which such losses are determined. Changes in job performance, job conditions and estimated profitability may result in revisions to cost and income, which are recognized in the period in which the revisions are determined. Changes in estimated job profitability resulting from job performance, job conditions, contract penalty provisions, claims, change orders, and settlements, are accounted for as changes in estimates in the current period. Claims for additional contract revenue are recognized when realization of the claim is probable and the amount can be reasonably determined.\nUse of Estimates\nThe preparation of financial statements in conformity with generally accepted accounting principles requires management to make estimates and assumptions that affect certain reported amounts and disclosures. Accordingly, actual results could differ from those estimates.\nShare Based Payments\nWe recognize compensation cost for stock-based awards to employees in accordance with ASC Topic 718, over the requisite service period for each separately vesting tranche, as if multiple awards were granted. Compensation cost is based on grant-date fair value using quoted market prices for our common stock. We recognize compensation cost for stock-based awards to nonemployees in accordance with ASC Topic 505.\nEarnings (Loss) Per Share\nThe Company computes earnings per share in accordance with ASC 260, Earnings Per Share. Under the provisions of ASC 260, basic earnings per share is computed by dividing the net income (loss) for the period by the weighted average number of common shares outstanding during the period. Diluted earnings per share is computed by dividing the net income (loss) for the period by the weighted average number of common and potentially dilutive common shares outstanding during the period. There were no potentially dilutive common shares outstanding during the period.\nIncome Taxes\nThe Company accounts for income taxes as outlined in ASC 740, Income Taxes. Under the asset and liability method of ASC 740, deferred tax assets and liabilities are recognized for the estimated future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases. Deferred tax assets and liabilities are measured using enacted tax rates in effect for the year in which those temporary differences are expected to be recovered or settled.\nFair Value of Financial Instruments\nASC 820, Fair Value Measurements (ASC 820) and ASC 825, Financial Instruments (ASC 825), requires an entity to maximize the use of observable inputs and minimize the use of unobservable inputs when measuring fair value. It establishes a fair value hierarchy based on the level of independent, objective evidence surrounding the inputs used to measure fair value. A financial instrument's categorization within the fair value hierarchy is based upon the lowest level of input that is significant to the fair value measurement. It prioritizes the inputs into three levels that may be used to measure fair value:\nLevel 1 - Level 1 applies to assets or liabilities for which there are quoted prices in active markets for identical assets or liabilities.\nLevel 2 - Level 2 applies to assets or liabilities for which there are inputs other than quoted prices that are observable for the asset or liability such as quoted prices for similar assets or liabilities in active markets; quoted prices for identical assets or liabilities in markets with insufficient volume or infrequent transactions (less active markets); or model-derived valuations in which significant inputs are observable or can be derived principally from, or corroborated by, observable market data.\nLevel 3 - Level 3 applies to assets or liabilities for which there are unobservable inputs to the valuation methodology that are significant to the measurement of the fair value of the assets or liabilities.\nThe carrying values of cash, accounts payable, and accrued liabilities approximate fair value. Pursuant to ASC 820 and 825, the fair value of cash is determined based on \"Level 1\" inputs, which consist of quoted prices in active markets for identical assets. The recorded values of all other financial instruments approximate their current fair values because of their nature and respective maturity dates or durations.\nRecent Accounting Pronouncements\nReference is made to the Organization and Significant Accounting Pronouncements in Note 1 to our financial statements included elsewhere in this report for information related to new accounting pronouncements. Item 7A. Quantitative and Qualitative Disclosures about Market Risk.\nWe are not subject to risks related to foreign currency exchange rate fluctuations. Our functional currency is the United States dollar. We do not transact our business in other currencies. As a result, we are not subject to exposure from movements in foreign currency exchange rates. We do not use derivative financial instruments for speculative trading purposes. Item 8. Financial Statements and Supplementary Data.\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Stockholders of Drax, Industries Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of Drax, Industries Inc., Inc. (the Company) as of December 31, 2021 and 2020, and the related statements of operations, stockholders equity (deficit), and cash flows for the year ended December 31, 2021 and for the period from March 24, 2020 (inception) through December 31, 2020, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of December 31, 2021 and 2020, and the results of its operations and its cash flows for the year ended December 31, 2021 and for the period from March 24, 2020 (inception) through December 31, 2020, in conformity with accounting principles generally accepted in the United States of America.\nGoing Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 4 to the financial statements, the Company has incurred losses since inception and is currently dependent on stockholders to fund its contemplated operational activities which raise substantial doubt about its ability to continue as a going concern. Management's plans in regard to these matters are also described in Note 4. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements.\nOur audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgements. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing separate opinion on the critical audit matter or on the accounts or disclosures to which they relate.\nDue to a new loss for the year, the Company evaluated the need for a going concern. Auditing managements evaluation of a going concern can be significant judgement given the fact that the Company uses the managements estimates on future revenues and expenses which are not able to be substantiated.\nAs discussed in Note 4, the Company has a going concern due to the net loss during the year ended December 31, 20201. To evaluate the appropriateness of the going concern, we examined and evaluated the financial information along with managements plans to mitigate the going concern and managements disclosure on going concern.\nM & K CPAS\nHouston, Texas\nOctober 26, 2022\nWe have served as the Companys auditor since 2020.\nDRAX, INDUSTRIES INC.\nBALANCE SHEETS\nFor the year ended December 31, 2021 and 2020\nDecember 31, 2021 December 31, 2020\nASSETS\nCurrent assets:\nCash $ 17,344 $ 3,300\nNote Receivable, Related Party 10,000 -\nInventory 311,892 -\nPrepaid expenses 105,272 2,500\nTotal current assets 444,508 5,800\nOther assets:\nFurniture and equipment, net of depreciation $7,674 103,632 -\nSecurity deposits 50,366 1,000\nTotal assets $ 598,506 $ 6,800\nLIABILITIES AND STOCKHOLDER'S EQUITY (DEFICIT)\nCurrent liabilities:\nAccounts payable $ 2,640 $ -\nAccrued interest\nTotal current liabilities 2,742\nOther Liabilities:\nCustomer deposits 10,000 -\nNote payable, net of unamortized discount of $0 and $500 - 10,000\nLine of Credit, Related Party 7,000 -\nDeferred rent liability - 1,125\nTotal liabilities: 19,724 11,153\nStockholders Equity (deficit):\nPreferred stock, $0.0001 par value, 100,000 authorized 0 and 0 issued and outstanding - -\nCommon stock, $0.0001 par value, 70,000,000 authorized,\nIssued and outstanding: 7,136,571, at December 31, 2021\nand 4,000,000 at December 31, 2020\nAdditional paid in capital 783,829 -\nDeficit accumulated during development stage 205,761 (4,753 )\nTotal stockholders' equity (deficit): 578,782 (4,353 )\nTotal liabilities and stockholders equity (deficit): $ 598,506 $ 6,800\nThe accompanying notes are an integral part of these financial statements.\nDRAX, INDUSTRIES INC.\nSTATEMENTS OF OPERATIONS\nFor the year ending December 31, 2021\nand the period from March 24, 2020 (date of inception) through December 31, 2020\nPeriod from March 24, 2020\nYear ended (date of inception) through\nDecember 31, 2021 December 31, 2020\nREVENUES $ 31,000 $ -\nCOSTS OF SALES 33,165 -\nGROSS MARGIN (2,165 ) -\nEXPENSES:\nProfessional fees 33,570 3,600\nGeneral and administrative 156,872 1,125\nAmortization expense -\nDepreciation expense 7,674 -\nTOTAL OPERATING EXPENSES: 198,202 4,725\nOTHER EXPENSE\nInterest expense\nTOTAL OTHER EXPENSES:\nTOTAL EXPENSES 198,844 -\nLOSS FROM OPERATIONS (201,009 ) (4,753 )\nNET LOSS $ (201,009 ) $ (4,753 )\n-\nNet income (loss) per common share, basic and diluted $ (0.04 ) $ (0.00 )\nWeighted average number of common shares outstanding, basic and diluted 5,663,494 4,000,000\nThe accompanying notes are an integral part of these financial statements.\nDRAX, INDUSTRIES INC.\nSTATEMENTS OF STOCKHOLDERS' EQUITY (DEFICIT)\nFor the year ended December 31, 2021 and the period from\nMarch 24, 2020 (date of inception) through December 31, 2020\nAdditional\nTotal\nCommon stock Paid-In Accumulated Stockholders'\nShares Amount Capital (Deficit) Equity\nBalance, March 24, 2020 (inception) - $ - $ - $ - $ -\nShares issued for cash 4,000,000 - -\nNet loss for the period from March 24, 2020 (inception) through December 31, 2020 - - - (4,753 ) (4,753 )\nBalance December 31, 2020 4,000,000 $ 400 $ - $ (4,753 ) $ (4,353 )\nShares issued for cash 3,136,571 783,829 - 784,143\nNet loss for the year ended December 31, 2021 - - - (201,008 ) (201,008 )\nBalance December 31, 2021 7,136,571 $ 714 $ 783,829 $ (205,761 ) $ 578,782\nThe accompanying notes are an integral part of these financial statements.\nDRAX, INDUSTRIES INC.\nSTATEMENTS OF CASH FLOWS\nFor the year ending December 31, 2021 and the period from\nMarch 24, 2020 (date of inception) through December 31, 2020\nMarch 24, 2020\nYear ended (inception) through\nDecember 31, 2021 December 31, 2020\nCASH FLOWS FROM OPERATING ACTIVITIES\nNet loss $ (201,008 ) $ (4,753 )\nAdjustments to reconcile net (loss) to net cash used in operating activities\nAmortization expense -\nDepreciation expense 7,674 -\nCustomer deposits 10,000 -\nInventory (311,892 ) -\nPrepaid expenses (102,772 ) (2,500 )\nAccrued interest\nSecurity deposits (49,366 ) (1,000 )\nAccounts payable 2,640 -\nDeferred Rent Liability (1,125 ) 1,125\nNet cash used for operating activities (645,710 ) (7,100 )\nCASH FLOWS FROM INVESTING ACTIVITIES:\nPurchase of Furniture and equipment (111,305 ) -\nNet cash used by investing activities (111,305 ) -\nCASH FLOWS FROM FINANCING ACTIVITIES:\nProceeds from sale of stock 784,143\nProceeds from loan - 10,000\nAccounts and notes receivable, related party (10,000 )\nAdvances from line of credit 7,000 -\nPayments on note payable (10,084 ) -\nNet cash provided by financing activities 771,059 10,400\nNet increase in cash 14,044 3,300\nCash, beginning of year 3,300 -\nCash, end of period $ 17,344 $ 3,300\nSupplemental Disclosures\nInterest paid $ 920 $ -\nTax paid $ - $ -\nOperating lease ROU asset/Lease liability acquisition $ 79,078 $ -\nOperating lease ROU asset/Lease liability disposal $ 59,478 $ -\nThe accompanying notes are an integral part of these financial statements.\nDRAX, INDUSTRIES INC.\nNotes to the Financial Statements\nDecember 31, 2021 and 2020\nNOTE 1 - NATURE OF BUSINESS AND SIGNIFICANT ACCOUNTING POLICIES\nNature of Business\nDRAX, INDUSTRIES INC. (\"the Company\", \"Drax\") was incorporated in the state of Wyoming on March 24, 2020 (\"Inception\"). The Company is an assembly company that intends to provide one product to consumers: a mobile evaporative cooling trailer that is 83 inches by 16 feet called \"R3Cooler\".\nThese statements reflect all adjustments, consisting of normal recurring adjustments, which in the opinion of management are necessary for fair presentation of the information contained therein.\nThe Company filed a General form for registration of securities under the Securities Act of 1933 on February 12, 2021. The registration Statement became effective May 13, 2021. Pursuant to the May 13, 2021, registration Statement the company has sold to 35 investors 3,136,571 shares of the Companys common stock and received $784,543 cash.\nThe company has adopted a fiscal year-end of December 31.\nOn July 22, 2021, the Company incorporated Calt Services, Inc., a wholly owned subsidiary, in the state of California. Calt Services, Inc. authorized 25,000 shares of common stock at $0.001 par value. Drax, Industries Inc. purchased 100% of the common stock of Calt Services at par value for $25.\nOn November 30, 2021, the Company entered into a Conditional Stock Purchase Agreement and Change in Control Agreement with Robert Cashman for the 25,000 common shares of Calt Services, Inc. The total purchase price for the shares is $10,000 and is to be paid on or before June 30, 2022. Upon the signing of the agreement, the sole officer, Virgil Enriquez, resigned and Robert Cashman was named to the Board of Directors.\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBasis of Presentation\nThe Company maintains its accounting records on an accrual basis in accordance with generally accepted accounting principles in the United States of America (U.S. GAAP).\nThe accompanying financial statements present the Balance Sheet and Statements of Operations, Shareholders' Equity, and Cash Flows of the Company. as of December 31, 2021, and December 31, 2020 and for the year ended December 31, 2021 and the period from March 24, 2020 (date of inception) through December 31, 2020. These financial statements are presented in United States dollars. All adjustments which are, in the opinion of management, necessary for a fair presentation of the results of operations for the periods have been made and are of a recurring nature unless otherwise disclosed herein.\nUse of Estimates\nThe preparation of the financial statements in conformity with accounting principles generally accepted in the United States requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, and disclosure of contingent liabilities at the date of the financial statements and the reported amounts of expenses during the reporting period. Actual results could differ from those estimates.\nCash and Cash Equivalents\nCash and equivalents include investments with initial maturities of three months or less. The Company maintains its cash balances at credit-worthy financial institutions that are insured by the Federal Deposit Insurance Corporation (\"FDIC\") up to $250,000. There were no cash equivalents at December 31, 2021 and December 31, 2020.\nAccounts Receivable\nAccounts receivable are recorded at the invoiced amount and do not bear interest. We determine the allowance for doubtful accounts by evaluating individual customer receivables, and will establish an allowance for doubtful accounts when collection is uncertain. Customer accounts will be written off against the allowance only when all attempts to collect have been exhausted.\nThe Company has established an allowance for doubtful accounts after a period of 90 days from the date of delivery.\nNote Receivable, Related Party\nOn November 30, 2021, the Company entered into a Conditional Stock Purchase Agreement and Change in Control Agreement with Robert Cashman, a Related Party, for the 25,000 common shares (100%) of Calt Services, Inc. The total purchase price for the shares is $10,000, payable on or before June 30, 2022, and carries no interest. Upon the signing of the agreement, the sole officer, Virgil Enriquez, resigned and Robert Cashman was named to the Board of Directors.\nAt December 31, 2021 and 2020, the Company had total accounts receivable of -0- and $0, respectively, consisting of a note receivable of $10,000 and $-0-.\nInventory\nInventories are stated at the lower of cost or market value, using the first-in, first-out convention. Inventories consist of raw materials, work in progress and finished goods. Raw materials are stocked to reduce the risk of impact on manufacturing for potential supply interruptions due to the COVID-19 pandemic or long lead times on certain components.\nSchedule of inventory\nComponents of inventory are: December 31, December 31,\nRaw Materials $ 311,892 $ -\nWork in progress - -\nFinished goods - -\nTotal inventory 311,892 -\nLess:\nReserve for obsolete - -\nTotal net inventory 311,892 -\nBeneficial Conversion Features\nFrom time to time, the Company may issue convertible notes that may contain an imbedded beneficial conversion feature. A beneficial conversion feature exists on the date a convertible note is issued when the fair value of the underlying common stock to which the note is convertible into is in excess of the remaining unallocated proceeds of the note after first considering the allocation of a portion of the note proceeds to the fair value of warrants, if related warrants have been granted. The intrinsic value of the beneficial conversion feature is recorded as a debt discount with a corresponding amount to additional paid in capital. The debt discount is amortized to interest expense over the life of the note using the effective interest method. As of December 31, 2021, and 2020, the company does not have any loans that contain a beneficial conversion feature.\nFair Value of Financial Instruments\nThe Company adopted Financial Accounting Standards Board (\"FASB\") Accounting Standards Codification (\"ASC\") 820 on June 6, 2011. Under this FASB, fair value is defined as the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date (an exit price). The standard outlines a valuation framework and creates a fair value hierarchy in order to increase the consistency and comparability of fair value measurements and the related disclosures. Under GAAP, certain assets and liabilities must be measured at fair value, and FASB ASC 820-10-50 details the disclosures that are required for items measured at fair value.\nThe Company may have various financial instruments that must be measured under the new fair value standard including cash, promissory notes payable. The Company's financial assets and liabilities are measured using inputs from the three levels of the fair value hierarchy. The three levels are as follows:\nLevel 1 - Inputs are unadjusted quoted prices in active markets for identical assets or liabilities that the Company has the ability to access at the measurement date. The fair value of the Company's cash is based on quoted prices and therefore classified as Level 1.\nLevel 2 - Inputs include quoted prices for similar assets and liabilities in active markets, quoted prices for identical or similar assets or liabilities in markets that are not active, inputs other than quoted prices that are observable for the asset or liability (e.g., interest rates, yield curves, etc.), and inputs that are derived principally from or corroborated by observable market data by correlation or other means (market corroborated inputs).\nLevel 3 - Unobservable inputs that reflect our assumptions about the assumptions that market participants would use in pricing the asset or liability.\nCash, security deposits, prepaid expenses, accrued expenses and note payable reported on the balance sheet are estimated by management to approximate fair market value due to their short-term nature.\nBasic and Diluted Loss Per Share\nThe basic net loss per common share is computed by dividing the net loss by the weighted average number of common shares outstanding. Diluted net loss per common share is computed by dividing the net loss adjusted on an \"as if converted\" basis, by the weighted average number of common shares outstanding plus potential dilutive securities. For the periods presented, there were no outstanding potential common stock equivalents and therefore basic and diluted earnings per share result in the same figure.\t\nShare Based Expenses\nThe Company accounts for the issuance of equity instruments to acquire goods and/or services based on the fair value of the goods and services or the fair value of the equity instrument at the time of issuance, whichever is more readily determinable. The Company's accounting policy for equity instruments issued to consultants and vendors in exchange for goods and services follows the provisions of standards issued by the FASB. The measurement date for the fair value of the equity instruments issued is determined at the earlier of (i) the date at which a commitment for performance by the consultant or vendor is reached or (ii) the date at which the consultant or vendor's performance is complete. In the case of equity instruments issued to consultants, the fair value of the equity instrument is recognized over the term of the consulting agreement.\nStock Based Compensation\nIn December of 2004, the FASB issued a standard which applies to transactions in which an entity exchanges its equity instruments for goods or services and also applies to liabilities an entity may incur for goods or services that are based on the fair value of those equity instruments. For any unvested portion of previously issued and outstanding awards, compensation expense is required to be recorded based on the previously disclosed methodology and amounts. Prior periods presented are not required to be restated. The company adopted the standard as of inception. The Company has not issued any stock options to its Board of Directors and officers as compensation for their services. If options are granted, they will be accounted for at a fair value as required by the FASB ASC 718.\nNet Loss Per Share\nThe Company adopted the standard issued by the FASB, which requires presentation of basic earnings or loss per share and diluted earnings or loss per share. Basic income (loss) per share (\"Basic EPS\") is computed by dividing net income (loss) available to common stockholders by the weighted average number of common shares outstanding during the period. Diluted earnings per share (\"Diluted EPS\") are similarly calculated using the treasury stock method except that the denominator is increased to reflect the potential dilution that would occur if dilutive securities at the end of the applicable period were exercised.\nAdvertising and Promotion\nAll costs associated with advertising and promoting products are expensed as incurred. There are no advertising or promotional expenses at this time.\nRevenue Recognition\nUnder the new revenue standards, the revenues are recognized when its customer obtains control of promised goods or services, in an amount that reflects the consideration which it expects to receive in exchange for those goods. The Company recognizes revenues in the following manner. Customer submits Purchase Order, Company provides Invoice which provides, Type of product ordered, Transaction price for the product ordered, delivery date of product, location of delivery of the product and the amount of deposit for the product. Final receipt of delivery of product satisfies the performance obligation of the company. Revenue is recognized on delivery of the product to the customer. When an account receivable becomes 90 days old, a full reserve for bad debt is established for the entire amount outstanding.\nThe Company recognizes revenues following the five step model prescribed under ASU No. 2014-09: (1) identify contract(s) with a customer; (2) identify the performance obligations in the contract; (3) determine the transaction price; (4) allocate the transaction price to the performance obligations in the contract; and (5) recognize revenues when (or as) we satisfy the performance obligation.\nAs of December 31, 2021, and December 31, 2020, the Company had received customer deposits in the amount of $10,000 and $0, respectively.\nFixed Assets\nProperty, plant, and equipment is carried at cost less accumulated depreciation. Cost includes all direct costs necessary to acquire and prepare assets for use, including internal labor and overhead in some cases. Depreciation is computed using the straight-line method over the estimated useful lives of the assets, ranging from 5 to 10 years for the Companys acquired equipment.\nRecently Issued Accounting Pronouncements\nIn February 2016, the FASB issued ASU No. 2016-02, Leases (Topic 842): Accounting for Leases. This update requires that lessees recognize right-of-use assets and lease liabilities that are measured at the present value of the future lease payments at lease commencement date. The recognition, measurement, and presentation of expenses and cash flows arising from a lease by a lessee will largely remain unchanged and shall continue to depend on its classification as a finance or operating lease. The update will become effective for periods beginning after December 15, 2020. The Company has performed a comprehensive review in order to determine what changes were required to support the adoption of this new standard and has determined that the adoption of the new standard will have a material impact on the Companys financial statements with the recognition of operating ROU assets and lease liabilities. The Company elected the optional transition method that allows for a cumulative-effect adjustment in the period of adoption and will not restate prior periods. Under its core principle, a lessee will recognize right-of-use (ROU) assets and related lease liabilities on the balance sheet for all arrangements with terms longer than 12 months.\nThe company adopted at its inception on March 24, 2020, the May 2017 FASB issued ASU 2014-09, Revenue from Contracts with Customers (Topic 606), to clarify the principles of recognizing revenue and create common revenue recognition guidance between U.S. GAAP and International Financial Reporting Standards. Under ASU 2014-09, revenue is recognized when a customer obtains control of promised goods or services and is recognized at an amount that reflects the consideration expected to be received in exchange for such goods or services. In addition, ASU 2014-09 requires disclosure of the nature, amount, timing, and uncertainty of revenue and cash flows arising from contracts with customers. The ASU is effective for fiscal years beginning after December 15, 2017. The new revenue standard is principle based and interpretation of those principles may vary from company to company based on their unique circumstances. It is possible that interpretation, industry practice, and guidance may evolve as companies and the accounting profession work to implement this new standard. The implementation of this standard did not have a material effect on the Companys results of operations.\nIn January 2017, the FASB issued ASU No. 2017-04, Simplifying the Test for Goodwill Impairment, which simplifies the subsequent measurement of goodwill by eliminating Step 2 from the goodwill impairment test. In computing the implied fair value of goodwill under Step 2, current U.S. GAAP requires the performance of procedures to determine the fair value at the impairment testing date of assets and liabilities (including unrecognized assets and liabilities) following the procedure that would be required in determining the fair value of assets acquired and liabilities assumed in a business combination. Instead, the amendments under this ASU require the goodwill impairment test to be performed by comparing the fair value of a reporting unit with its carrying amount. An impairment charge should be recognized for the amount by which the carrying amount exceeds the reporting units fair value; however, the loss recognized should not exceed the total amount of goodwill allocated to that reporting unit. The ASU became effective for the Company on March 24, 2020. The amendments in this ASU will be applied on a prospective basis. Early adoption is permitted for interim or annual goodwill impairment tests performed.\nNOTE 3 - DEBT TRANSACTIONS\nPromissory Note Payable\nOn December 15, 2020, the Company issued a promissory note to U.S. Affiliated, Inc. for $10,500 of cash consideration. The note bears interest at 6% and matures on December 14, 2023. The Loan included fees of $500. During the period ended December 31, 2020 the company paid the loan fees of $500 and recorded them as a discount against the note. The Company recognized interest expense of $28.\nOn March 10, 2021, the Company entered into a Note (Line of Credit Agreement) with U.S. Affiliated, Inc. an unrelated third party for $100,000 maturing on April 1, 2020. The Line of Credit bears interest at 10% simple interest per annum. The company drew down $9,500 during the period ending December 31, 2021.\nOn September 24, 2021, the Company entered into a settlement agreement with U.S. Affiliated, Inc. for the repayment of the promissory note and line of credit. On that date, the parties agreed that the principal and interest outstanding on the promissory note was $10,338, and on the line of credit was $10,248. Both loans were paid in full on September 24, 2021.\nOn March 10, 2021, the Company entered into a Note (Line of Credit Agreement) with U.S. Affiliated, Inc. an unrelated third party for $100,000 maturing on April 1, 2024. The Line of Credit bears interest at 10% simple interest per annum. The company drew down $7,000 during the period ending December 31, 2021. At December 31, 2021, the Company recognized interest expense of $84.\nAs of December 31, 2021, and December 31, 2020, the Company owed $7,000 and $0, respectively, on the Line of Credit. The Company recognized interest expense for both loans for the twelve-month period ending December 31, 2021 of $642.\nNOTE 4 - GOING CONCERN\nAs shown in the accompanying financial statements, the Company has net losses from operations of $201,008 as of December 31, 2021. This factor raises substantial doubt about the Company's ability to continue as a going concern. Management is actively pursuing its business plan in an effort to begin to realize additional revenues. In addition, the Company is currently seeking additional sources of capital to fund short term operations. The Company, however, is dependent upon its ability to secure equity and/or debt financing and there are no assurances that the Company will be successful, therefore, without sufficient financing it would be unlikely for the Company to continue as a going concern. The president has committed to pay expenses for the Company as necessary.\nThe financial statements do not include any adjustments that might result from the outcome of any uncertainty as to the Company's ability to continue as a going concern. The financial statements also do not include any adjustments relating to the recoverability and classification of recorded asset amounts or amounts and classifications of liabilities that might be necessary should the Company be unable to continue as a going concern.\nNOTE 5 - RELATED PARTY\nOn December 31, 2020, the Company sold 4,000,000 founder's shares at the par value of $0.0001 in exchange for proceeds of $400 in cash.\nCALT, SERVICE INC.\nOn November 30, 2021, the Company entered into a Conditional Stock Purchase Agreement and Change in Control Agreement with Robert Cashman, a Related Party, for the 25,000 common shares (100%) of Calt Services, Inc. The total purchase price for the shares is $10,000, payable on or before June 30, 2022, and carries no interest. Upon the signing of the agreement, the sole officer, Virgil Enriquez, resigned and Robert Cashman was named to the Board of Directors.\nRobert L. Cashman purchased this company to develop new products that could be manufactured by Trade Leasing, Inc.\nCalt has no business with Drax, Services Inc. at this time.\nU.S. AFFILATED, INC.\nKaren Fowler is the President and Sole Director of U.S. Affiliated, Inc. Karen is the daughter of Robert L. Cashman. Robert L. Cashman does not own any shares of stock in U.S. Affiliated and is not an Officer or Director of U.S. Affiliated.\nRobert L. Cashman does not receive any compensation from this company.\nOn March 10, 2021, the Company entered into a Note (Line of Credit Agreement) with U.S. Affiliated, Inc. an unrelated third party for $100,000 maturing on April 1, 2020. The Line of Credit bears interest at 10% simple interest per annum. The company drew down $9,500 during the period ending December 31, 2021.\nOn September 24, 2021, the Company entered into a settlement agreement with U.S. Affiliated, Inc. for the repayment of the promissory note and line of credit. On that date, the parties agreed that the principal and interest outstanding on the promissory note was $10,338, and on the line of credit was $10,248. Both loans were paid in full on September 24, 2021.\nOn March 10, 2021, the Company entered into a Note (Line of Credit Agreement) with U.S. Affiliated, Inc. an unrelated third party for $100,000 maturing on April 1, 2024. The Line of Credit bears interest at 10% simple interest per annum. The company drew down $7,000 during the period ending December 31, 2021. At December 31, 2021, the Company recognized interest expense of $84.\nAs of December 31, 2021, and December 31, 2020, the Company owed $7,000 and $0, respectively, on the Line of Credit. The Company recognized interest expense for both loans for the twelve-month period ending December 31, 2021 of $642.\nThe financial statements do not include any adjustments that might result from the outcome of any uncertainty as to the Company's ability to continue as a going concern. The financial statements also do not include any adjustments relating to the recoverability and classification of recorded asset amounts or amounts and classifications of liabilities that might be necessary should the Company be unable to continue as a going concern.\nTRADE LEASING, INC.\nTrade Leasing, Inc. manufactures parts for Drax, Services, Incs cooling trailers. Trade leasing, Inc. has manufactured metal encourages for Draxs cooling trailers. Karen Fowler is the President and Sole Director of Trade Leasing, Inc. Karen is the daughter of Robert L. Cashman. Robert L. Cashman owns no shares of stock in Trade Leasing, Inc. and is not an Officer or Director of Trade Leasing, Inc.\nRobert L. Cashman provides consulting services to his daughter (Trade Leasing, Inc.) as needed. Robert L. Cashman is paid by Trade Leasing, Inc. for his consulting services.\nNOTE 6 - STOCKHOLDERS EQUITY\nOn March 24, 2020, the Company authorized 100,000 shares of preferred stock at $0.0001 par value, and 70,000,000 shares of common stock at $0.0001 par value. At December 31, 2021, no preferred stock has been issued. At December 31, 2021 and December 31, 2020, the Company had 7,136,571 and 4,000,000, common shares issued and outstanding, respectively.\nCommon Stock\nOn December 31, 2020, the Company sold 4,000,000 founder's shares at the par value of $0.0001 in exchange for proceeds $400 in cash.\nAt June 30, 2021, the Company sold 2,856,751 shares to 32 investors at $0.25 per share in exchange for $714,143.\nAt September 30, 2021, the Company sold an additional 140,000 shares to 32 investors at $0.25 per share in exchange for $35,000.\nAt December 31, 2021, the Company sold an additional 140,000 shares to 2 investors at $0.25 per share in exchange for $35,000.\nAs of December 31, 2021, and 2020, no warrants have been issued by the Company.\nNOTE 7 - INCOME TAXES\nThe Company accounts for income taxes under FASB ASC 740-10, which requires use of the liability method. FASB ASC 740-10-25 provides that deferred tax assets and liabilities are recorded based on the differences between the tax bases of assets and liabilities and their carrying amounts for financial reporting purposes, referred to as temporary differences.\nFor the year ending December 31, 2021, the company had net operating losses of $171,008, but no provision for income taxes has been recorded. In addition, no benefit for income taxes has been recorded due to the uncertainty of the realization of any tax assets. On December 31, 2021, the company had approximately $171,008 of federal net operating losses. The net operating loss carry forwards, if not utilized, will begin to expire in 2034.\nThe components of the Company's deferred tax asset are as follows:\nSchedule of deferred tax asset\nDecember 31, December 31,\nDeferred tax assets\nNet operating loss carry forwards $ 171,008 $ 4,753\nNet deferred tax assets before valuation allowance $ 35,912 $ 998\nLess: Valuation allowance $ (35,912 ) $ (998 )\nNet deferred tax assets $ 0 $ 0\nBased on the available objective evidence, including the company's history of loss, management believes it is more likely than not that the net deferred tax assets will not be fully realizable. Accordingly, the company provided for a full valuation allowance against its net deferred tax assets at December 31, 2021.\nA reconciliation between the amounts of income tax benefit determined by applying the applicable U.S. and State statutory income tax rate to pre-tax loss is as follows:\nSchedule of U.S. and State statutory income tax rate\nDecember 31,\nFederal statutory rate 21 %\nState statutory rate 11 %\nIn accordance with FASB ASC 740, the company has evaluated its tax positions and determined there are no uncertain tax positions.\nNOTE 8 - COMMITMENTS AND CONTINGENCIES\nOperating Leases\nDrax, Industries Inc. leased office/warehouse at located at 3151 Scott Street, Vista California 92081 effective December 15, 2020. The lease is for a period of 36 months. The warehouse space consists of 2,500 square feet of warehouse space and 500 feet of office space for a total of 3,000 square feet. Rent for the facility is $-0- per month for the first nine months; and then $3,000 per month thereafter. The Company is not responsible for property taxes or repairs. There are currently no proposed programs for renovation, improvement, or development of the facility.\nOn July 15, 2021, the above lease was terminated, and the Company entered into a new lease at the same address consisting of 22,000 square feet of office/warehouse space. The lease is for the 6-month period from July 15, 2021 to December 31, 2021, at $24,817 per month. The Company is not responsible for property taxes or repairs.\nUpon execution of the lease, $100,000 was paid to Optec International for first and last months rents at $24,817 each, and $50,366 security deposits as framed out in the lease agreement.\nOn January 1, 2022, the Company entered into a new lease at 1385 Park Center Drive in Vista, CA 92081 consisting of approximately 7,500 square feet. of office/warehouse space. The lease is for the 6-month period from January 1, 2022 to June 30, 2022, with options for additional periods, at $12,807 per month. Per the agreement, the months of January, February, and March 2022 are rent-free, with the first least payment due on the 1st of every month. The existing Security Deposit of $50,366 shall carry over to the new lease. The Company is not responsible for property taxes or repairs. The Company is presently at the same location on a month to month basis at $12,807 per month.\nPursuant to ACS 842 lessees must recognize right-of-use assets and lease liabilities that are measured at the present value of the future lease payments at lease commencement date. The recognition, measurement, and presentation of expenses and cash flows arising from a lease by a lessee will largely remain unchanged and shall continue to depend on its classification as a finance or operating lease. The Company has reviewed this policy and determined that changes were required to support the adoption of this new standard, and that the adoption of the new standard will not have a material impact on the Companys financial statements with the recognition of operating ROU assets and lease liabilities. The Company elected the optional transition method that allows for a cumulative-effect adjustment in the period of adoption and will not restate prior periods.\nUnder the core principle of ASC 842, a lessee will recognize right-of-use (ROU) assets and related lease liabilities on the balance sheet for all arrangements with terms longer than 12 months. Due to the shortened period of these leases, those calculations have not been made at December 31, 2021 or December 31, 2020.\nLegal Proceedings\nThe company may be subject to legal proceedings and claims arising from contracts or other matters from time to time in the ordinary course of business. Management is not aware of any pending or threatened litigation where the ultimate disposition or solution could have a material adverse effect on its financial position, results of operations or liquidity.\nNOTE 9 - FIXED ASSETS\nProperty, plant, and equipment is carried at cost less accumulated depreciation. Cost includes all direct costs necessary to acquire and prepare assets for use, including internal labor and overhead in some cases. Depreciation is computed using the straight-line method over the estimated useful lives of the assets, ranging from 5 to 10 years for the Companys equipment. For the year ended December 31, 2021, and the period from March 24, 2020 (date of inception) through December 31, 2020, total fixed assets were $103,632 and $0, respectively, and accumulated depreciation was $7,674 and $0, respectively.\nAt December 31, 2021, the fixed assets of the Company are:\nSchedule of fixed assets\nDecember 31, 2021 December 31, 2020\nFixed Assets\nVehicles $ 97,100 $ -\nComputer/ Furniture $ 14,205 $ -\nTOTAL FIXED ASSETS $ 111,305 $ -\nAccumulated Depreciation $ 7,674 $ -\nNet Fixed Assets $ 103,632 $ -\nNOTE 10 - SUBSEQUENT EVENTS\nManagement has evaluated subsequent events according to the requirements of ASC 855, and there are currently no subsequent events to report as of May 28, 2021.\nOn January 1, 2022, the Company entered into a new lease at 1385 Park Center Drive in Vista, CA, 92081, consisting of approximately 7,500 square feet. of office/warehouse space. The lease is for the 6-month period from January 1, 2022 to June 30, 2022, with options for additional periods, at $12,807 per month. Per the agreement, the months of January, February, and March 2022 are rent-free, with the first least payment due on the 1st of April and continuing on the 1st of every month. The existing Security Deposit of $50,366 shall carry over to the new lease. The Company is not responsible for property tax or repairs. The Company is presently at the same location on a month to month basis at $12,807 per month. Item 9. Changes In and Disagreements with Accountants on Accounting and Financial Disclosure.\nNone. Item 9A. Controls and Procedures.\nEVALUATION OF DISCLOSURE CONTROLS AND PROCEDURES\nWe maintain disclosure controls and procedures, as such term is defined in Rule 13a-15(e) under the Securities Exchange Act of 1934 (the Exchange Act), that are designed to ensure that information required to be disclosed in our Exchange Act reports is recorded, processed, summarized and reported within the time periods specified in the Securities and Exchange Commission rules and forms, and that such information is accumulated and communicated to our management, including our Chief Executive Officer and Chief Financial Officer, as appropriate, to allow timely decisions regarding required disclosure. We conducted an evaluation, under the supervision and with the participation of our Chief Executive Officer (CEO) and Chief Financial Officer (CFO), of the effectiveness of the design and operation of our disclosure controls and procedures as of the end of the period covered by this report pursuant to Rule 13a-15 of the Exchange Act. Based on this evaluation, our CEO and CFO concluded that our disclosure controls were not effective as of the end of the period covered by this report.\nMANAGEMENTS REPORT ON INTERNAL CONTROL OVER FINANCIAL REPORTING\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting. Internal control over financial reporting is defined in Rule 13a-15(f) or 15d-15(f) promulgated under the Securities Exchange Act of 1934 as a process designed by, or under the supervision of, the Companys principal executive and financial officer and effected by the Companys board of directors, management and other personnel, to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles and includes those policies and procedures that:\nPertain to the maintenance of records that in reasonable detail accurately and fairly reflect the transactions and dispositions of the assets of the Company;\nProvide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the Company are being made only in accordance with authorizations of management and directors of the Company; and\nProvide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of the Companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nThe Companys management assessed the effectiveness of the Companys internal control over financial reporting as of October 6, 2022. In making this assessment, the Companys management used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in Internal Control-Integrated Framework. The COSO framework is based upon five integrated components of control: control environment, risk assessment, control activities, information and communications and ongoing monitoring.\nBased on an evaluation under the supervision and with the participation of the Companys management, the Companys principal executive officer and principal financial officer has concluded that the Companys internal control over financial reporting as defined in Rules 13a-15(e) and 15d-15(e) under the Exchange Act were not effective as of October 6, 2022 (the Evaluation Date), to ensure that information required to be disclosed by the Company in reports that it files or submits under the Exchange Act is (i) recorded, processed, summarized and reported within the time periods specified in the Securities and Exchange Commission rules and forms and (ii) accumulated and communicated to the Companys management, including its principal executive officer and principal financial officer, as appropriate to allow timely decisions regarding required disclosure. Each of the following is deemed a material weakness in our internal control over financial reporting:\nLimited or no segregation of duties and lack of multiple levels of supervision and review.\nNo independent directors.\nIneffective controls over financial reporting.\nLack of controls over authorization related party transactions.\nIn 2022 the Company addressed the weakness in control and reporting and has made appropriate changes to ensure that the Company complies with the financial reporting as defined in Rules 13a-15(e) and 15d-15(e) under the Exchange Act.\nManagement believes that the material weaknesses set forth in the four items above did not have an effect on our financial results. However, management believes that the lack of a functioning audit committee results in ineffective oversight in the establishment and monitoring of required internal controls and procedures, which could result in a material misstatement in our financial statements in future periods.\nManagement's Remediation Initiatives\nIn an effort to remediate the identified material weaknesses and other deficiencies and enhance our internal controls, we plan to initiate the following series of measures once we have the financial resources to do so:\nWe will create a position to segregate duties consistent with control objectives and will increase our personnel resources and technical accounting expertise within the accounting function when funds are available to us. And, we plan to appoint one or more outside directors to an audit committee resulting in a fully functioning audit committee, which will undertake the oversight in the establishment and monitoring of required internal controls and procedures, such as reviewing and approving estimates and assumptions made by management when funds are available to us.\nManagement believes that the appointment of outside directors to a fully functioning audit committee, would remedy the lack of a functioning audit committee.\nChanges in Internal Control Over Financial Reporting\nThere were no changes in our internal controls over financial reporting that occurred during the period covered by this report, which were identified in connection with managements evaluation required by paragraph (d) of Rules 13a-15 and 15d-15 under the Exchange Act, that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nThis Annual Report does not include an attestation report of the Companys registered independent public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by the Companys independent registered public accounting firm pursuant to rules of the SEC that permit the Company to provide only managements report in this Annual Report. Item 9B. Other Information.\nNone.\nCHANGES IN CONTROL OF REGISTRANT\nNone.\nPART III Item 10. Directors, Executive Officers and Corporate Governance.\nOur director and executive officer, and his age as of December 31, 2021, are as follows:\nName\nAge\nPrincipal Positions With Us\nVirgil Enriquez\nPresident, Chief Financial Officer, Secretary, Treasurer and Director\nThe following describes the business experience of each of our directors and executive officers, including other directorships held in public reporting companies, if any:\nSet forth below is the biographical information about the director and executive officers:\nVirgil Enriquez\nJanuary 2020 - Current, Prestige Contracting, Poway CA. Position Senior Estimator.\nResponsible for the following, (1)Track bid opportunities and prioritize for estimating staff (2) Perform quantity take offs and prepare estimates using Excel spreadsheet templates, (3)Compose clear, concise, detailed proposals, (4) Obtain and negotiate pricing from vendors and subcontractors, (5) Negotiate contracts and change orders with customers when required, (6) Collect, track and report estimating and cost data, (7) Hire, train and supervise other estimators, (8) Review estimates and proposals prepared by estimating staff, (9) Create processes and procedures to streamline and improve estimating process and (10) Coordinate with Production Team to ensure project parameters and budgets are understood.\nJULY 2017 PRESIDENT OF HLLK\nNovember 2007-September 2019 MCV Companies Inc., Escondido, CA\nOwned and ran MCV Companies, the company provided Contracting - Consulting - Development. Responsible for (1) Estimating, Daily Operations & Production of MCVs construction projects, (2) Responsible for the complete startup and closeout of all projects, including submittals, subcontracts & schedules, (3) Established the projects working budget and ensured that all jobs were completed on budget or better, (4) Project documentation and\nNovember 2006 -November 2007 \t\tHighland Fairview - Costa Mesa, CA\nLand Development Manager / Purchasing, Responsible for the following.\n· Prepared new contract agreements for both subcontractors and consultants\n· Initiated new contracting procedures\n· Purchased new contracting software (Prolog) and in charge of implementation and integration of existing Timberline data\n· RME on Highland Fairviews contractor license\n· Involved in establishing new cost code structure\n· Reconciling, organizing and updating existing contract\n· Primary responsibility was the Purchasing and Contracting of all Land Development trades\n· Prepared all Bid packages, including the various Scopes of Work\n· Responsible for generating and issuing contracts. Worked with Legal concerning insurance requirements\nJanuary 2005- November 2006 \tCentex Homes-San Diego & Southern CA Costal Division\nLand Development Purchasing Manager: Responsible for the following.\n· Primary responsibility was the Purchasing and Contracting of all Land Development trades. Included trades range from Mass Grading, Erosion Control, Water, Sewer, Storm Drain, Dry Utilities, Concrete Improvements, Street Balance and Paving, Landscaping, and Bond Exoneration work\n· Prepared all Bid packages, including the various Scopes of Work\n· Responsible for generating and issuing contracts. Worked with Legal concerning insurance requirement\n· Projects consist of both Multi-family and Single-Family developments\n· Coordinated and completed Due Diligence Packages for Land Acquisition\n· Assist General Field Superintendent in coordinating and resolving issues with Project Management and Forward Planning\n· Strong Reputation with various Subcontractor\n2004-2005 \tPardee Homes San Diego, CA\nOffsite Superintendent: Responsible for the following.\n· Responsible for managing subcontractors for new construction in the Del Mar area\n· Facilitate coordination between Subcontractors, Architects, HOA and Pardee Homes\n· Experienced in Bond exoneration\n· Responsible for Open Space turnover and Brush Management\n· Ensure that subcontractors and Pardee Homes complied with SWPPP and BMPs\n2000-2004 \tE.V. Constructors Inc. / Dimax Escondido CA\nOwner / Contractor: Responsible for the following.\n· Started and operated E.V. Constructors, Inc. which focused on Public Works construction\n· Responsible for obtaining work through competitive bidding, complete startup of awarded contracts, project management and responsible for all project billings and negotiations\n· Maintained excellent working relationships with the various project owners and subcontractors\n1996-1999 \tHeffler Company San Diego, CA\nVice President / Project Manager: Responsible for the following.\n· Promoted to Vice President in charge of operations in January 1997\n· In charge of the daily operations & production of Heffler Companys construction projects\n· Responsible for the complete startup and closeout of all projects, including submittals, subcontracts & schedules\n· Established the projects working budget and ensured that projects were complete on budget or better\n· Project documentation\nEDUCATION:\t1985-1989 University of San Diego, CA\n· BA, Business Administration\n· Qualified for the California State Contractor A, B, C-27 and C-53 License\nTerm of Office\nAll of our directors hold office until the next annual meeting of the shareholders or until their successors are elected and qualified. Our officers are appointed by our board of directors and hold office until their earlier death, retirement, resignation, or removal.\nFamily Relationships\nThere are no family relationships among any of the Companys directors and officers.\nBoard Composition and Committees\nThe Companys Board of Directors is currently composed of one member, Virgil Enriquez.\nWe do not have a standing nominating, compensation, or audit committee. Rather, our full board of directors performs the functions of these committees. Also, we do not have a audit committee financial expert on our board of directors as that term is defined by Item 407(d)(5)(ii) of Regulation S-K. We do not believe it is necessary for our board of directors to appoint such committees because the volume of matters that come before our board of directors for consideration permits the directors to give sufficient time and attention to such matters to be involved in all decision making.\nInvolvement in Certain Legal Proceedings\nMr. Enriquez filed a petition for personal bankruptcy under Chapter 7 of the federal bankruptcy laws, which was subsequently discharged in September 2019.\nNone of our directors, executive officers or control persons has been involved in any of the events prescribed by Item 401(f) of Regulation S-K during the past ten years, excluding the Chapter 7 bankruptcy referenced above, but including:\n1.\nany petition under the Federal bankruptcy laws or any state insolvency law filed by or against, or a receiver, fiscal agent or similar officer was appointed by a court for the business or property of such person, or any partnership in which he or she was a general partner at or within two years before the time of such filing, or any corporation or business association of which he or she was an executive officer at or within two years before the time of such filing;\n2.\nany conviction in a criminal proceeding or being named a subject of a pending criminal proceeding (excluding traffic violations and other minor offenses);\n3.\nbeing subject to any order, judgment, or decree, not subsequently reversed, suspended or vacated, of any court of competent jurisdiction, permanently or temporarily enjoining him or her from, or otherwise limiting, the following activities:\ni. acting as a futures commission merchant, introducing broker, commodity trading advisor, commodity pool operator, floor broker, leverage transaction merchant, any other person regulated by the Commodity Futures Trading Commission, or an associated person of any of the foregoing, or as an investment adviser, underwriter, broker or dealer in securities, or as an affiliated person, director or employee of any investment company, bank, savings and loan association or insurance company, or engaging in or continuing any conduct or practice in connection with such activity;\nii. engaging in any type of business practice; or\niii. engaging in any activity in connection with the purchase or sale of any security or commodity or in connection with any violation of Federal or State securities laws or Federal commodities laws;\n4.\nbeing subject to any order, judgment or decree, not subsequently reversed, suspended or vacated, of any Federal or State authority barring, suspending or otherwise limiting for more than 60 days the right of such person to engage in any type of business regulated by the Commodity Futures Trading Commission, securities, investment, insurance or banking activities, or to be associated with persons engaged in any such activity;\n5.\nbeing found by a court of competent jurisdiction in a civil action or by the SEC to have violated any Federal or State securities law, and the judgment in such civil action or finding by the Commission has not been subsequently reversed, suspended, or vacated;\n6.\nbeing found by a court of competent jurisdiction in a civil action or by the Commodity Futures Trading Commission to have violated any Federal commodities law, and the judgment in such civil action or finding by the Commodity Futures Trading Commission has not been subsequently reversed, suspended, or vacated;\n7.\nbeing subject to, or a party to, any Federal or State judicial or administrative order, judgment, decree, or finding, not subsequently reversed, suspended, or vacated, relating to an alleged violation of:\ni. any Federal or State securities or commodities law or regulation; or\nii. any law or regulation respecting financial institutions or insurance companies including, but not limited to, a temporary or permanent injunction, order of disgorgement or restitution, civil money penalty or temporary or permanent cease-and-desist order, or removal or prohibition order; or\niii. any law or regulation prohibiting mail or wire fraud or fraud in connection with any business entity; or\n8.\nbeing subject to, or a party to, any sanction or order, not subsequently reversed, suspended or vacated, of any self-regulatory organization (as defined in Section 3(a)(26) of the Exchange Act (15 U.S.C. 78c(a)(26))), any registered entity (as defined in Section 1(a)(29) of the Commodity Exchange Act (7 U.S.C. 1(a)(29))), or any equivalent exchange, association, entity or organization that has disciplinary authority over its members or persons associated with a member.\nCompliance with Section 16(a) of the Act\nSection 16(a) of the Exchange Act requires our officers and directors, and persons who own more than ten percent (10%) of our shares of common stock, to file reports of ownership and changes in ownership with the SEC. Officers, directors and greater than ten percent (10%) stockholders are required by regulations promulgated by the SEC to furnish us with copies of all Section 16(a) forms that they file. With reference to transactions during the fiscal year ended December 31, 2021, to our knowledge, all Section 16(a) forms required to be filed with the SEC were filed. Item 11. Executive Compensation.\nCompensation Discussion and Analysis\nPhilosophy and objectives\nSince our inception, all compensation decisions have been made by our Board of Directors. The primary objective of our compensation policies and programs with respect to executive compensation is to serve our shareholders by attracting, retaining and motivating talented and qualified individuals to manage and lead our business. We will focus on providing a competitive compensation package that provides significant short and long-term incentives for the achievement of measurable corporate and individual performance objectives.\nElements of executive compensation\nBase salary. We will seek to provide our senior management with a level of base salary in the form of cash compensation appropriate to their roles and responsibilities. Base salaries for our executives will be established based on the executives qualifications, experience, scope of responsibilities, future potential and past performance and cash available to pay executive compensation. Base salaries will be reviewed annually and adjusted from time to time to realign salaries with market levels after taking into account an individual's responsibilities, performance, and experience. We will consider four factors in determining the base salaries of our named executive officers. These four factors are, in order of significance, (1) creating an incentive to achieve corporate goals, (2) individual performance, (3) cash available to pay compensation and (4) the total compensation each executive officer previously received while employed with us, if any. We have not paid any executive compensation in the form of base salary to our management during the years ended December 31, 2021, or 2020.\nIncentive cash bonuses. Our practice will be to seek to award incentive cash bonuses to our executive officers based upon their individual performance, as well as our overall business and strategic objectives. In determining the amount of cash bonuses paid to our named executive officers, we will consider the same four factors as in determining their base salaries. We expect that our Board of Directors will adopt formal processes for incentive cash bonuses during the next 24 months and will utilize incentive cash bonuses to reward executives for achieving corporate financial and operational goals and for achieving individual performance objectives. To date, we have not paid any incentive cash bonuses to our management.\nLong-term equity compensation. We believe that successful long-term performance is achieved through an ownership culture that encourages long-term performance by our executive officers through the use of stock and stock-based awards. We intend to establish equity incentive plans to provide our employees, including our executive officers, with incentives to help align those employees interests with the interests of our shareholders.\nWe expect that our incentive plans will permit the grant of stock options, restricted shares and other stock awards to our executive officers, employees, consultants, and non-employee board members. When we hire executive officers in the future, we expect to grant them stock-based awards that will generally vest over a five-year period. We believe that stock-based awards provide an incentive for these officers to continue their employment with us, provide our executive officers with an opportunity to obtain an ownership interest in our company and encourage them to focus on our long-term profitable growth. We believe that the use of long-term equity compensation will promote our overall executive compensation objectives and expect that equity incentives will be an important source of compensation for our executives. In determining amounts awarded to our executive officers under our incentive plans, we will consider the same four factors (and use the same method of measurement) as in determining base salary. The third factor (cash available) has an indirect effect when determining long-term equity compensation. Specifically, to the extent that this factor causes us not to pay base salary or cash bonuses, it points toward providing long-term equity compensation. We have not issued any long-term equity compensation to our management during the years ended December 31, 2021, or 2020.\nOther compensation. When we hire executive officers, our executive officers will be eligible to receive the same benefits, including non-cash group life and health benefits that are available to all employees. We may offer a 401(k) plan to our employees, including our executive officers. This plan will permit employees to make contributions up to a statutory maximum and will permit us to make matching or profit-sharing contributions. To date, we have not offered to our employees any benefit plans, including but not limited a 401(k) plan or made, or committed to make, any matching or profit-sharing contributions under a 401(k) plan.\nPolicies related to compensation\nGuidelines for equity awards. We have not formalized a policy as to the amount or timing of equity grants to our executive officers. We expect, however, that our board of directors will approve and adopt guidelines for equity awards. Among other things, we expect that the guidelines will specify procedures for equity awards to be made under various circumstances, address the timing of equity awards in relation to the availability of information about us and provide procedures for grant information to be communicated to and tracked by our finance department. As of the date of this report, we have not established a finance department. We anticipate that the guidelines will require that any stock options or stock appreciation rights have an exercise or strike price not less than the fair market value of our common stock on the date of the grant.\nStock ownership guidelines. As of the date of this report, we have not established stock ownership guidelines for our executive officers or the Board of Directors.\nCompliance with Sections 162(m) and 409A of the Internal Revenue Code\nSection 162(m) of the Internal Revenue Code limits the deductibility of compensation in excess of $1 million paid to certain executive officers, unless such compensation qualifies as performance-based compensation. Among other things, in order to be deemed performance-based compensation for Section 162(m) purposes, the compensation must be based on the achievement of pre-established, objective performance criteria and must be pursuant to a plan that has been approved by our shareholders. At least for the next several years, we expect the cash compensation paid to our executive officers to be below the threshold for non-deductibility provided in Section 162(m), and our equity incentive plans will afford our board of directors with the flexibility to make a variety of types of equity awards to our executive officers, the deductibility of which will not be limited under Section 162(m). However, our board of directors will fashion our future equity compensation awards. However, we do not now know whether any such awards will satisfy the requirements for deductibility under Section 162(m).\nWe also currently intend for our executive compensation program to satisfy the requirements of Internal Revenue Code Section 409A, which addresses the tax treatment of certain nonqualified deferred compensation benefits.\nExecutive Compensation\nThe following table sets forth information concerning all cash and non-cash compensation awarded to, earned by, or paid to the Companys officer during the years ended December 31, 2021, and 2020 for services to the Company.\nName\nPosition\nYear\nEnded\n&\nPeriod\nEnded\nSalary\nPaid ($)\nBonus ($)\nStock\nAwards ($)\nOption\nAwards ($)\nNon-\nEquity\nIncentive\nPlan\nCompensation ($)\nAll\nOther\nCompensation ($)\nTotal ($)\nVirgil\n-\n-\n-\n-\n-\n-\n-\nEnriquez\n-\n-\n-\n-\n-\n-\n-\nCompensation of Directors\nThe following table sets forth the information concerning cash and non-cash compensation awarded to, earned by, or paid to the Companys director during the years ended December 31, 2021, and 2020 for services to the Company.\nName\nYear\nEnded\n&\nPeriod\nEnded\nFees\nEarned\nor Paid\nin Cash ($)\nStock\nAwards ($)(2)\nOption\nAwards ($)\nNon-\nEquity\nIncentive\nPlan\nCompensation ($)\nChange in\nPension Value\nand Nonqualified\nDeferred\nCompensation\nEarnings ($)\nAll Other\nCompensation ($)\nTotal ($)\nVirgil\n-\n-\n-\n-\n-\n-\nEnriquez\n-\n-\n-\n-\n-\n-\nEmployment Agreements and Benefits\nWe currently have one employee, Mr. Virgil Enriquez. There is no executive employment agreement between him and the Company.\nPotential Payments Upon Termination or Change in Control\nAs of the date of this report, there were no potential payments or benefits payable to our executive officer upon his termination or in connection with a change in control.\nPension Benefits\nNo named executive officer received or held pension benefits during the years ended December 31, 2021, and 2020.\nNonqualified Deferred Compensation\nNo nonqualified deferred compensation was offered or issued to our executive officer for the years ended December 31, 2021, and 2020.\nGrants of Plan-Based Awards\nDuring the years ended December 31, 2021, and 2020, we have not granted any plan-based awards to our executive officer.\nOutstanding Equity Awards\nNo unexercised options or warrants were held by our named executive officer during the years ended December 31, 2021, and 2020. No equity awards were made during the years ended December 31, 2021, and 2020.\nOption Exercises and Stock Vested\nDuring the years ended December 31, 2021, and 2020 our executive officer has neither been granted any options, nor did any unvested stock or options granted to our executive officer vest. As of the date of this report, our executive officer did not have any stock options or unvested shares of stock of the Company.\nCompensation Committee Interlocks and Insider Participation\nDuring the years ended December 31, 2021, and 2020, we did not have a standing compensation committee. Our Board of Directors was responsible for the functions that would otherwise be handled by the compensation committee. All directors participated in deliberations concerning executive officer compensation, including directors who were also executive officers.\nEmployment Agreements\nWe have not entered into an employment agreement with our executive officer. Our decision to enter into an employment agreement, if any, will be made by our compensation committee.\nEquity Incentive Plan\nWe expect to adopt an equity incentive plan. The purpose of the plan is to attract and retain qualified persons upon whom our sustained progress, growth and profitability depend, to motivate these persons to achieve long-term company goals, and to more closely align these persons' interests with those of our other shareholder by providing them with a proprietary interest in our growth and performance. Our future executive officers, employees, consultants, and non-employee directors will be eligible to participate in the plan. We have not determined the number of shares of our common stock to be reserved for issuance under the proposed equity incentive plan. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nThe following table sets forth certain information regarding beneficial ownership of our common stock as of December 31, 2021 for:\n● each person or group known to us to beneficially own 5% or more of our common stock;\n● each of our directors and director nominees;\n● each of our named executive officers; and\n● all of our executive officers and directors as a group.\nUnless otherwise indicated below, to our knowledge, all persons listed below have sole voting and investment power with respect to their shares of common stock, except to the extent authority is shared by spouses under applicable law. Unless otherwise indicated below, each entity or person listed below maintains an address 8217 East Spanish Boot Road, Carefree, Arizona 85377.\nThe number of shares beneficially owned by each shareholder is determined under rules promulgated by the SEC. The information is not necessarily indicative of beneficial ownership for any other purpose. Under these rules, beneficial ownership includes any shares as to which the individual or entity has sole or shared voting or investment power and any shares as to which the individual or entity has the right to acquire beneficial ownership within 60 days after December 31, 2021, through the exercise of any stock option, warrant, or other right.\nBeneficial Owner\nNumber of Shares\nBeneficially\nOwned\nPercentage\nof Shares\nOutstanding\nVirgil Enriquez\n4,000,000\n56.1% Item 13. Certain Relationships and Related Transactions, and Director Independence.\nTransactions With Related Persons, Promoters And Certain Control Persons\nOn December 31, 2020, the Company sold 4,000,000 founder's shares at the par value of $0.0001 in exchange for proceeds $400 in cash.\nDirector Independence\nWe do not have a standing nominating, compensation, or audit committee. Rather, the board of directors performs the functions of these committees. We do not believe it is necessary for the board of directors to appoint such committees, because the volume of matters that come before the board of directors for consideration is not so substantial that our directors are usually allowed sufficient time and attention to such matters.\nAnnual Report on Form 10-K\nCopies of our Annual Report on Form 10-K, without exhibits, can be obtained without charge from us at Drax, Industries Inc., 1385 Park Center Drive, Vista California 92081. Telephone (760) 739-0069. Item 14. Principal Accountant Fees and Services.\nThe following table sets forth fees billed to us for principal accountant fees and services for year ended December 31, 2021 and the year ended December 31, 2020.\nYear Ended\nDecember 31, 2021\nYear Ended\nDecember 31, 2020\nAudit Fees $ 17,500 $ 5,000\nAudit-Related Fees - -\nTax Fees - -\nAll Other Fees - -\nTotal Audit and Audit-Related Fees $ 17,500 $ 5,000 Item 15. Exhibits.\n(a) Exhibits\nThe following exhibits are filed with this Report on Form 10-K:\nExhibit No.\nDescription\n3.1\nArticles of Incorporation, as currently in effect*\n3.2\nBylaws as currently in effect*\n31.1\n302 Certification - Virgil Enriquez\n32.1\n906 Certification - Virgil Enriquez\n101.INS\nInline XBRL Instance Document\n101.SCH\nInline XBRL Instance Schema\n101.CAL\nInline XBRL Instance Calculation Linkbase\n101.DEF\nInline XBRL Instance Definition Linkbase\n101.LAB\nInline XBRL Instance Label Linkbase\n101.PRE\nInline XBRL Instance Presentation Linkbase\nCover Page Interactive Data File (Formatted as Inline Xbrl and contained in Exhibit 101)\n* Included as an Exhibit to our Registration Statement on Form S-1 filed on February 12, 2021\nSIGNATURES\nIn accordance with Section 13 or 15(d) of the Exchange Act, the registrant caused this report to be signed on its behalf by the undersigned, thereunto duly authorized, on the 26th of October 2022.\nDRAX, INDUSTRIES INC.\nBy: /s/ Virgil Enriquez\nVirgil Enriquez\nPresident, Chief Financial Officer, Secretary and Treasurer\nPursuant to the requirements of the Securities Exchange Act of 1934, as amended, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/ Virgil Enriquez\nVirgil Enriquez\nPresident, Chief Financial Officer\n(Accounting Officer), Secretary, Treasurer\nOctober 26, 2022"
}