{
    "cik": "1873213",
    "company": "Birdie Win Corp",
    "filing_type": "10-K",
    "filing_date": "2022-10-11",
    "period_of_report": "2022-07-31",
    "sic": "8200",
    "state_of_inc": "NV",
    "state_location": "N8",
    "fiscal_year_end": "0731",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1873213/0001493152-22-028024-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1873213/000149315222028024/form10-k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1873213/0001493152-22-028024.txt",
    "filename": "1873213_10K_2022_0001493152-22-028024.htm",
    "content": "ITEM 1. BUSINESS\nOverview\nBirdie Win Corporation, a Nevada corporation (the Company) was incorporated under the laws of the State of Nevada on April 16, 2021.\nOn April 16, 2021, Mr. Chee Yong Yee (Mr. Yee) was appointed as President, Secretary, Treasurer and a member of our Board of Directors. Mr. Yee also served as Chief Executive Officer of the Company.\nOn April 16, 2021, the Company issued 3,600,000 shares of restricted common stock, with a par value of $0.001 per share, to Mr. Chee Yong Yee in consideration of $3,600. The $3,600 in proceeds went to the Company to be used as working capital.\nIn regards to all of the above transactions we claim an exemption from registration afforded by Section 4a(2) and/or Regulation S of the Securities Act of 1933, as amended (Regulation S) due to the fact that all sales of stock were made to non-U.S. persons (as defined under Rule 902 section (k)(2)(i) of Regulation S), pursuant to offshore transactions, and no directed selling efforts were made in the United States by the issuer, a distributor, any of their respective affiliates, or any person acting on behalf of any of the foregoing.\nOn August 27, 2021, the Company has submitted initial Form S-1 Registration Statement to S.E.C registering an offering by the Company amounted up to $120,000 to Securities & Exchange Commission (S.E.C), which was later declared effective on September 23, 2021.\nOn October 11, 2021, the Company resolved to close the public offering pursuant to Form S-1, resulting in 1,440,000 shares of common stock being sold at $0.025 per share for a total of $36,000. The proceed of $36,000 went directly to the Company and shall be utilized pursuant to the use of proceed stated in the Form S-1.\nDescription of Business\nBirdie Win Corporation is headquartered in Selangor, Malaysia. The Company primarily operates through providing financial literacy seminar services to Malaysian individuals and families. Our mission is to improve the financial well-being of our clients which coincides with the Malaysia National Strategy for Financial Literacy 2019-2023.\nThe Company believes there is enormous opportunity in promoting, and at the same time profiting from financial literacy in Malaysia. At present, the only service that has been provided by the Company is the one-on-one Personal Financial Literacy Seminar (herein referred as PFL Seminar). All other additional services are prospective, and have not, as of this point in time, been performed for any clients yet. We believe that we have the capacity to offer the services immediately upon securing an agreement with a client.\nOur PFL Seminar focuses on elevating our clients financial literacy and teaching them responsible financial behaviors and rational attitudes towards financial management. Our PFL Seminar aims to improve clients awareness and capability to make rational financial decision throughout their life stages, which leads to sustained improvements in their financial behavior. We believe that raising financial literacy is a key to empower clients with the financial knowledge and skills to improve their financial well-being. Financially capable clients could interact responsibly with their financial service providers, which in turn builds a healthy financial lifestyle. At present, our PFL Seminar is taught solely by the Companys President. We intend to hire additional instructors in the future, depending on the success of our operations, and will require that all instructors have relevant training/background and that the follow a standard of procedure (SOP), that has yet to be developed, in order to ensure that their lessons meet the quality standards we require.\nOur PFL Seminar is a one-on-one workshop, presently conducted online via Zoom due to the Covid-19 pandemic, which consists of four sessions and the clients are expected to devote at least three hours per session as elaborated below:\nSession 1: Financial Management Knowledge, Tool and Resources\nStudies reveal that Malaysians lack sufficient confidence in their financial knowledge and skills. According to the Malaysia National Strategy for Financial Literacy 2019-20231, it was found that one-third of Malaysians rated their financial knowledge as low; while one-tenth felt that they were not disciplined when it came to their financial budgeting.\nSession 1 of our PFL Seminar enlightens clients with the above concerns and goes into detail on the following key learning objectives:\n1. Knowledge of financial concepts;\n2. Ability to live within means;\n3. Management of expected and unexpected expenses;\n4. Being vigilant to avoid financial scams; and\n5. Ability to assess the risks and benefits of financial products and services.\nSession 2: Long-term Financial Planning Knowledge\nOur research indicates Malaysians tend to save without clear goals and live for today, leaving them with insufficient funds for major expenses. According to the Malaysia National Strategy for Financial Literacy 2019-20231, it was found that 84% of Malaysians who claim to save regularly do so only for the immediate term. These savings are typically withdrawn by the end of the month with no accumulation of wealth. The absence of long-term goals leaves many Malaysians ill-prepared to deal with both expected and unexpected expenses such as loss of income, serious illness, accidents, pandemic, etc.\nSession 2 of our PFL Seminar enlightens clients with the above concerns and goes into detail on the following key learning objectives:\n1. The use of innovation guides and tools to improve long-term financial planning;\n2. Awareness and knowledge of the benefits of seeking appropriate professional advice on financial planning;\n3. The importance of voluntary savings and income diversification; and\n4. The importance of long-term financial plans for retirement.\nThe desired outcomes of this session are inculcating clients with the habit of long-term planning for different life stages or events, such as marriage, having children, performing pilgrimage, death and illness. Clients will also be aware of the importance of funding sufficiency to meet their future financial needs and retirement life.\nSession 3: Protect Your Money\nWe believe it is increasingly important to be financially literate in this era of digitization, as online information can be overwhelming and even inaccurate. Furthermore, as new financial products and services, such as internet banking and mobile payments, are growing in popularity, the capability to validate and verify such information is crucial before making any financial decisions.\nExpectations of unrealistically high returns also increase the risk of falling victim to scams and illegal financial schemes. We believe with enough financial knowledge; our clients will be able to make the distinction between legitimate products and fraudulent schemes and be aware of avenues to seek help when in doubt.\nSession 3 of our PFL Seminar enlightens clients with the above concerns and goes into detail on the following key learning objectives:\n1. Provide better understanding of risks and returns;\n2. Improve awareness of the innovation of financial products and its implications;\n3. Raise awareness on financial scams and fraud; and\n4. Explain the risks of sophisticated financial products and services.\nSession 3 of PFL Seminar should increase clients awareness and understandings on the key features of certain financial products and services. They should also be able to identify suitable financial products based on their risk appetites and objectives and make rational financial decisions.\nSession 4: Personal Financial Report Preparation and Analysis\nSession 4 of our PFL Seminar equips our clients with the skills to generate their own Personal Financial Report by using third party financial planning software with goal-planning and scenario-based features. The Personal Financial Report should take into consideration of local financial markets system, social welfare system, quality of health care services, tax regulations and current economic indicators such as inflation rate, nominal real interest, regional GDP growth rate and unemployment rate.\nWe also educate our clients on how to analyze their Personal Financial Reports to understand their financial situations and evaluate to what extent their goals, needs and priorities can be met by their resources and current course of action. One useful function of the Personal Financial Report is financial ratio analysis which allows the client to evaluate their financial health. The financial ratio includes solvency ratio, investment assets to net worth ratio, debt to total assets ratio, debt to income ratio, liquidity ratio and saving ratio.\nBased on the Personal Financial Report, we also equip clients with the skills needed to forecast their pre-retirement wealth accumulation and post-retirement expenses by assuming constant consumption and investment patterns. The Personal Financial Report also creates simulations of both optimistic and pessimistic wealth accumulation scenarios, including longevity risks. Additionally, if the client is married or in a long-term partnership, the plan should include survivorship considerations and projected financial scenarios for the surviving partner.\nSession 4 of our PFL Seminar intends to empower our clients to be able to prepare and analyze their Personal Financial Report which provides guidance for rational decision-making and serves as both a roadmap to successful financial planning and a bulwark against potential mistakes or misdeeds. Our proposed content of the Personal Financial Report is as follows:\n1. Disclaimer\n2. Financial Overview\n3. Personal Information\n4. Balance Sheet\n5. Cash Flow\n6. Financial Ratios Analysis\n7. Financial Goals\n8. Insurance Coverage\n9. Investment Strategy\nWe will not advise any specific insurance product or investment product issued by any financial institutes, including bank, insurance company, fund house, etc. This will enhance the independence and accuracy of the Personal Financial Report through avoidance of potential conflicts of interest. Instead of any specific insurance or investment product, we will recommend the proposed amount of sum insured for insurance portion while the asset class allocation for the investment strategy portion.\nOnce the client is satisfied with the Personal Financial Report generated, the client needs to decide the timing of implementation. We can accompany the client to visit different financial institutes and help to sort out the suitable products, which are relevant and consistent with their Personal Financial Reports, in order to avoid mis-selling or mis-matching between the client and products objective and risk.\nPersonal Financial Report Review and Evaluation Program\nPersonal Financial Report Review and Evaluation Program enables our existing clients to understand how their investment portfolio is performing and whether their financial goals are likely to be achieved. Our clients can subscribe to the program after their Personal Financial Reports are generated. We can review and re-assess a clients Personal Financial Report to check whether their portfolio management is in line with their investment strategy, and whether any changes are required to achieve the clients goals. During the program, the client can obtain a better picture on their goal achievement progress, process consistency and portfolio performance. Furthermore, if there is any update on our program, we will invite those existing clients to join the updated session at a discounted fee.\nPricing\nWe generate our revenues by providing FPL Seminar services to Malaysian individuals and families. The one-time PFL seminar fees are typically a flat fee, which is currently proposed as $10,000 for each client.\nFurthermore, we charge our clients who subscribe to our Personal Financial Report Review and Evaluation Program recurring consulting fees. The amount is negotiated on a case-by-case basis depending on the nature and extent of our services, such as investor coordination, investment advisory services and distribution of periodic product performance reports computed.\nMarketing Efforts\nWe believe word-of-mouth is an especially effective marketing tool for our business. We intend to engage in nationwide marketing initiatives to further raise our brand awareness while continuing to improve client satisfaction to strengthen our word-of-mouth referrals.\nWe expect to increase our marketing efforts through our Presidents personal networks and industry association channels which have not, at this point of time, been fully identified. Our President leverages various resources in performing tasks, including their social connections and referrals from existing clients.\nAdditionally, we intend to bolster our professional reputation and image by showcasing our knowledge and industry expertise via marketing campaigns through various forms of media, including our website at www.birdiewin.com. We have undefined plans to initially market our services through webinars, the creation of a wide variety of white papers, newsletters, books, and other information offerings. Furthermore, we plan to begin a social media campaign utilizing blogs, twitter, Facebook, and LinkedIn. A targeted campaign is intended to be made to focus on individuals and families. At this point in time, we cannot state with any certainty when we will commence with the aforementioned marketing activities.\nCompetition\nThe financial literacy services industry is very competitive and fragmented in the market niche in which our Company operates. There are limited barriers to entry and new competitors frequently enter the market. A significant number of our competitors possess substantially greater resources than we possess. Additionally, we face substantial competition for potential clients and for technical and professional personnel from providers of similar specialties, which range from giant national wealth management firm, private banks and family offices headquartered in Malaysia.\nThe majority of our competitors are banks, wealth management firms, and insurance brokers who aim to sell their own products by providing financial literacy services. As such, we feel that we have a competitive advantage over many of our competitors, in that we do not sell any specific insurance or investment product, and instead strive to maintain our independence and avoid potential conflicts of interest. We believe that our clients will feel assured that the quality of our services and recommendations are not hampered by the need to sell any additional products.\nWe believe that existing and new competitors will continue to improve their services and introduce new services with competitive pricing and performance characteristics. In periods of reduced demand for our services, we can either choose to maintain market share by reducing our prices to meet competition or maintain prices, which would likely sacrifice market share. Sales and overall profitability could be reduced in either case.\nEmployees\nCurrently, we have one employee which is our President and Chief Executive Officer, Mr. Chee Yong Yee. Currently, Mr. Yee has the flexibility to work on our business up to 30 hours per week, but is prepared to devote more time if necessary.\nWe do not presently have pension, health, annuity, insurance, stock options, profit sharing, or similar benefit plans; however, we may adopt plans in the future. There are presently no personal benefits available to our employee, Officer and/or Director. We have no employment agreements at this time with our officers and directors. We intend to hire more staffs to assist in the development and execution of our business operations.\nGovernment Regulations\nBirdie Win Corporation solely provides financial literacy seminar services, and we will not take part in any distribution of financial products, such as insurance or investment products. We are not required to obtain any license that we are aware of except possibly business registration licenses in jurisdictions we may intend to operate in.\nHowever, from time to time during one-on-one PFL Seminar and Personal Financial Report Review and Evaluation Program, the Company or employee of the Company will come across personal data as defined under Malaysia Personal Data Protective Act 2010 (herein referred as PDPA). According to PDPA, Data User, such as the Company or employee of the Company, shall not process personal data about a data subject unless the data subject has given his consent to the processing of the personal data. ITEM 1A. RISK FACTORS\nWe are a smaller reporting company as defined by Rule 12b-2 of the Securities Exchange Act of 1934 and are not required to provide the information under this item. ITEM 1B. UNRESOLVED STAFF COMMENTS\nWe are a smaller reporting company as defined by Rule 12b-2 of the Securities Exchange Act of 1934 and are not required to provide the information under this item. ITEM 2. DESCRIPTION OF PROPERTY\nWe do not own any real estate or other properties. Our office is located at D109, Level 1, Block D, Kelana Square, Jalan SS 7/26, 47301 Petaling Jaya, Selangor, Malaysia. The Company rents this office space from a third party at a price of approximately $496 a year. The term of the rental is from May 9, 2022 through May 8, 2023.\nWe believe that our existing facilities are adequate for our current needs and that we will be able to lease suitable additional or alternative space on commercially reasonable terms if and when we need it. ITEM 3. LEGAL PROCEEDINGS\nFrom time to time, we may become involved in various lawsuits and legal proceedings which arise in the ordinary course of business. Litigation is subject to inherent uncertainties, and an adverse result in these or other matters may arise from time to time that may harm our business. There are currently no pending legal proceedings or claims that we believe will have a material adverse effect on our business, financial condition or operating results. None of our directors, officers or affiliates is involved in a proceeding adverse to our business or has a material interest adverse to our business. ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable. ITEM 5. MARKET FOR COMMON EQUITY AND RELATED STOCKHOLDER MATTERS\nThe Company sole class of common equity is currently quoted under OTC Markets Pink Sheet under symbol BRWC since March 23, 2022. The Company believes that we do not have an established public trading market and we cannot assure you that there will be any liquidity for our common stock in the future and such quotation reflect inter-dealer prices, without retail mark-up, mark-down or commission and may not necessarily represent actual transactions.\nFiscal Year 2022\nHigh Bid\nLow Bid\nFirst Quarter\n$ -\n$ -\nSecond Quarter\n$ -\n$ -\nThird Quarter\n$ 0.2001\n$ 0.025\nFourth Quarter\n$ 0.215\n$ 0.1802\nHolders\nAs of July 31, 2022, we have 30 shareholders on record of our common stock.\nTransfer Agent and Registrar\nThe transfer agent for our capital stock is Transfer Online, Inc, with an address at 512 SE Salmon St., Portland, OR 97214, United States and telephone number is +1 (503) 227-2950.\nPenny Stock Regulations\nThe Securities and Exchange Commission has adopted regulations which generally define penny stock to be an equity security that has a market price of less than $5.00 per share. Our Common Stock, when and if a trading market develops, may fall within the definition of penny stock and be subject to rules that impose additional sales practice requirements on broker-dealers who sell such securities to persons other than established customers and accredited investors (generally those with assets in excess of $1,000,000, or annual incomes exceeding $200,000 individually, or $300,000, together with their spouse).\nFor transactions covered by these rules, the broker-dealer must make a special suitability determination for the purchase of such securities and have received the purchasers prior written consent to the transaction. Additionally, for any transaction, other than exempt transactions, involving a penny stock, the rules require the delivery, prior to the transaction, of a risk disclosure document mandated by the Securities and Exchange Commission relating to the penny stock market. The broker-dealer also must disclose the commissions payable to both the broker-dealer and the registered representative, current quotations for the securities and, if the broker-dealer is the sole market-maker, the broker-dealer must disclose this fact and the broker-dealers presumed control over the market. Finally, monthly statements must be sent disclosing recent price information for the penny stock held in the account and information on the limited market in penny stocks. Consequently, the penny stock rules may restrict the ability of broker-dealers to sell our Common Stock and may affect the ability of investors to sell their Common Stock in the secondary market.\nIn addition to the penny stock rules promulgated by the Securities and Exchange Commission, the Financial Industry Regulatory Authority (FINRA) has adopted rules that require that in recommending an investment to a customer, a broker-dealer must have reasonable grounds for believing that the investment is suitable for that customer. Prior to recommending speculative low-priced securities to their non-institutional customers, broker-dealers must make reasonable efforts to obtain information about the customers financial status, tax status, investment objectives and other information. Under interpretations of these rules, FINRA believes that there is a high probability that speculative low-priced securities will not be suitable for at least some customers. The FINRA requirements make it more difficult for broker-dealers to recommend that their customers buy our common stock, which may limit the investors ability to buy and sell our stock.\nDividends\nAny future determination as to the declaration and payment of dividends on shares of our Common Stock will be made at the discretion of our board of directors out of funds legally available for such purpose. We are under no contractual obligations or restrictions to declare or pay dividends on our shares of Common Stock. In addition, we currently have no plans to pay such dividends. Our board of directors currently intends to retain all earnings for use in the business for the foreseeable future.\nRecent Sales of Unregistered Securities\nNo securities have been sold by the Company during the period covered by this Form 10-K.\nPurchases of Equity Securities by the Registrant and Affiliated Purchasers\nWe have not repurchased any shares of our common stock during the fiscal year ended July 31, 2022.\nOther Stockholder Matters\nNone. ITEM 6. SELECTED FINANCIAL DATA\nWe are a smaller reporting company as defined by Rule 12b-2 of the Securities Exchange Act of 1934 and are not required to provide the information under this item. ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion and analysis of our results of operations and financial condition for fiscal year ended July 31, 2022 should be read in conjunction with our financial statements and the notes to those financial statements that are included elsewhere in this report. Some of the information contained in this managements discussion and analysis or set forth elsewhere in this Annual Report, including information with respect to our plans and strategy for our business and related financing, includes forward looking statements that involve risks, uncertainties and assumptions. As a result of many factors, including those factors set forth in the Risk Factors section in Form S-1/A registration statement, filed on August 27, 2021, our actual results could differ materially from the results described in or implied by the forward-looking statements contained in this Annual Report.\nOverview\nBirdie Win Corporation is headquartered in Selangor, Malaysia. The Companys executive office is located at D109, Level 1, Block D, Kelana Square, Jalan SS 7/26, 47301 Petaling Jaya, Selangor, Malaysia. We offer one-on-one Personal Financial Literacy Seminar services, with a focus on providing such services to customers in Malaysia and Hong Kong individuals or families.\nOur cash and cash equivalents are $19,312 as of July 31, 2022. Our cash balance is not sufficient to fund our limited levels of operations for any period of time. In order to continue our current business plan and increase our current level of operations for the next twelve-month period, we require further funding.\nFor the year ended July 31, 2022, the Company incurred a net loss of $25,494 and used cash in operating activities of $35,203 and borrowed $4,645 from our director. These conditions raise substantial doubt about the Companys ability to continue as a going concern. The ability to continue as a going concern is dependent upon the Companys profit generating operations in the future and/or obtaining the necessary financing to meet its obligations and repay its liabilities arising from normal business operations when they become due. These consolidated financial statements do not include any adjustments to the recoverability and classification of recorded asset amounts and classification of liabilities that might be necessary should the Company be unable to continue as a going concern.\nThe Company expects to finance its operations primarily through cash flow from revenue and continuing financial support from a shareholder. In the event that we require additional funding to finance the growth of the Companys current and expected future operations as well as to achieve our strategic objectives, the shareholder has indicated the intent and ability to provide additional financing.\nNo assurance can be given that any future financing, if needed, will be available or, if available, that it will be on terms that are satisfactory to the Company. Even if the Company is able to obtain additional financing, if needed, it may contain undue restrictions on its operations, in the case of debt financing, or cause substantial dilution for its stockholders, in the case of equity financing.\nResults of operations for the year ended July 31, 2022\nRevenues\nFor the years ended July 31, 2022 and 2021, the Company has generated a revenue of $30,000 and $20,000 respectively. The revenue is generated through provision of Personal Financial Literacy Seminar (PFL Seminar) services to clients.\nGeneral and Administrative Expenses\nFor the years ended July 31, 2022 and 2021, the Company incurred general and administrative expenses of $55,756 and $20,279 respectively. These were primarily comprised of audit fees, stock and registrar fees, legal fees and other professional fees.\nNet Loss\nFor the years ended July 31, 2022 and 2021, the Company incurred a net loss of $25,494 and $427 respectively.\nLiquidity and Capital Resources\nThe Companys cash and cash equivalents has decreased by $507, from $19,819 as of July 31, 2021 to $19,312 as of July 31, 2022. The accompanying financial statements have been prepared on a going concern basis, which contemplates the realization of assets and the settlement of liabilities and commitments in the normal course of business.\nCash Used in Operating Activities\nFor the year ended July 31, 2022, the Company has used $35,203 in operating activities, which was primarily attributable to net loss from operation, increase in prepayment, decrease in accrued liabilities and decrease in customer deposit.\nFor the year ended July 31, 2021, the Company has received $17,146 from operating activities, which was primarily attributable to increase in accrued liabilities, the amount due to our director and a customer deposit.\nCash Used in Investing Activities\nFor the year ended July 31, 2022, the Company has used $1,304 in investing activity primarily attributable to the purchase of equipment.\nFor the year ended July 31, 2021, the Company has used $927 in investing activity primarily attributable to the purchase of equipment.\nCash Provided by Financing Activities\nOn April 16, 2021, our sole officer and director, Mr. Chee Yong Yee, purchased 3,600,000 shares of restricted common stock at a purchase price of $0.001 (par value) per share. The $3,600 in proceeds went directly to the Company to be used for working capital.\nFor the year ended July 31, 2022, the Company has received $36,000 from financing activity primarily from issuance of shares of common stock pursuant to our initial public offering.\nFor the year ended July 31, 2021, the Company has received $3,600 from financing activity primarily from subscription of shares of common stock by our director, Mr. Chee Yong Yee.\nOff-Balance Sheet Arrangement\nWe have no significant off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, changes in our financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources that are material to our stockholders as of July 31, 2022.\nContractual Obligation\nAs a smaller reporting company, we are not required to provide the aforementioned information. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nWe are a smaller reporting company as defined by Rule 12b-2 of the Securities Exchange Act of 1934 and are not required to provide the information under this item. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nThe financial statements required by this item are located following the signature page of this Annual Report. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNot Applicable ITEM 9A. CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nWe conducted an evaluation under the supervision and with the participation of our management, including our Chief Executive Officer, of the effectiveness of the design and operation of our disclosure controls and procedures. The term disclosure controls and procedures, as defined in Rules 13a-15(e) and 15d-15(e) under the Securities and Exchange Act of 1934, as amended (Exchange Act), means controls and other procedures of a company that are designed to ensure that information required to be disclosed by the company in the reports it files or submits under the Exchange Act is recorded, processed, summarized and reported, within the time periods specified in the Securities and Exchange Commissions rules and forms. Disclosure controls and procedures also include, without limitation, controls and procedures designed to ensure that information required to be disclosed by a company in the reports that it files or submits under the Exchange Act is accumulated and communicated to the companys management, including its principal executive and principal financial officers, or persons performing similar functions, as appropriate, to allow timely decisions regarding required disclosure. Based on this evaluation, our Chief Executive Officer concluded as of July 31, 2022, that our disclosure controls and procedures were not effective. The matters involving internal controls and procedures that our management considered to be material weaknesses under the standards of the Public Company Accounting Oversight Board were: (1) lack of a functioning audit committee due to a lack of a majority of independent members and a lack of a majority of outside directors on our board of directors, resulting in ineffective oversight in the establishment and monitoring of required internal controls and procedures; (2) inadequate segregation of duties and effective risk assessment ; (3) insufficient written policies and procedures for accounting and financial reporting with respect to the requirements and application of both US GAAP and SEC guidelines; and (4) lack of internal audit function due to the fact that the Company lacks qualified resources to perform the internal audit functions properly and that the scope and effectiveness of the internal audit function are yet to be developed. The aforementioned material weaknesses were identified by our Chief Executive Officer in connection with the review of our financial statements as of July 31, 2022.\nManagement believes that the material weaknesses set forth in items (2) and (3) above did not have an effect on our financial results. However, management believes that the lack of a functioning audit committee and the lack of a majority of outside directors on our board of directors results in ineffective oversight in the establishment and monitoring of required internal controls and procedures, which could result in a material misstatement in our financial statements in future periods.\nManagements Report on Internal Control Over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act. Our internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. The internal controls for the Company are provided by executive managements review and approval of all transactions. Our internal control over financial reporting also includes those policies and procedures that:\n● Pertain to the maintenance of records that in reasonable detail accurately and fairly reflect the transactions and dispositions of the assets of the Company;\n● Provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with accounting principles generally accepted in the United States of America and that receipts and expenditures of the Company are being made only in accordance with authorizations of management and directors of the Company; and\n● Provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of the Companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nManagement assessed the effectiveness of the Companys internal control over financial reporting as of July 31, 2022. In making this assessment, management used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission in Internal Control-Integrated Framework. Managements assessment included an evaluation of the design of our internal control over financial reporting and testing of the operational effectiveness of these controls.\nBased on this assessment, management has concluded that as of July 31, 2022, our internal control over financial reporting was not effective to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with U.S. generally accepted accounting principles. In an effort to remediate the identified material weaknesses and other deficiencies and enhance our internal controls, we have initiated, or plan to initiate, the following series of measures:\nWe will increase our personnel resources and technical accounting expertise within the accounting function. We will create a position to segregate duties consistent with control objectives. And, we plan to appoint one or more outside directors to our board of directors who shall be appointed to an audit committee resulting in a fully functioning audit committee who will undertake the oversight in the establishment and monitoring of required internal controls and procedures such as reviewing and approving estimates and assumptions made by management when funds are available to us.\nWe anticipate that these initiatives will be at least partially, if not fully, implemented by the end of fiscal year 2023.\nChanges in Internal Control over Financial Reporting\nThere was no change in our internal controls over financial reporting that occurred during the period covered by this Report, which has materially affected, or is reasonably likely to materially affect, our internal controls over financial reporting:\nThis annual report does not include an attestation report of the Companys registered independent public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by the Companys registered independent public accounting firm pursuant to rules of the Securities and Exchange Commission that permit the Company to provide only managements report in this Annual Report on Form 10-K. ITEM 9B. OTHER INFORMATION\nNone.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nSet forth below are the present directors and executive officers of the Company. Note that there are no other persons who have been nominated or chosen to become directors nor are there any other persons who have been chosen to become executive officers. There are no arrangements or understandings between any of the directors, officers and other persons pursuant to which such person was selected as a director or an officer. Directors are elected to serve until the next annual meeting of stockholders and until their successors have been elected and have qualified. Officers are appointed to serve until the meeting of the board of directors following the next annual meeting of stockholders and until their successors have been elected and qualified.\nName\nAge\nPositions and Offices\nChee Yong Yee\nChief Executive Officer, President, Secretary, Treasurer, Director\nChee Yong Yee - Chief Executive Officer, President, Secretary, Treasurer, Director\nIn 2015, Mr. Yee graduated from the Lancaster University with a Bachelor of Science (Hons) in Accounting and Finance. In December 2015, he started his career as a Corporate Finance Engineer at the Greenpro Resources Sdn. Bhd., a Hong Kong based multinational company. He was responsible for the daily operations which included, but were not limited to, transaction advisory, corporate restructuring, accounting, tax planning and advisory, audit arrangement, and investor relations of Greenpro Capital Corp, the parent company of Greenpro Resources Sdn. Bhd. In June 2018, Mr. Yee was promoted as the Assistant Manager of Greenpro Resources Sdn. Bhd. Mr. Yee left this position in February 2019 and joined Hexcellence Consulting Sdn. Bhd. in April 2019. Hexcellence Consulting Sdn. Bhd. is a Malaysia-based boutique corporate advisory firm, which specializes in merger and acquisitions, corporate reporting services, corporate secretarial services, business restructuring, and due diligence advisory services.\nIn April 2021, Mr. Yee founded Birdie Win Corporation, and serves as our President, Secretary, Treasurer, and Director.\nMr. Yees experience in financial advisory and business development has led the Board of Directors to reach the conclusion that he should serve as President, Chief Executive Officer and Director of the Company.\nCorporate Governance\nThe Company promotes accountability for adherence to honest and ethical conduct; endeavors to provide full, fair, accurate, timely and understandable disclosure in reports and documents that the Company files with the Securities and Exchange Commission and in other public communications made by the Company; and strives to be compliant with applicable governmental laws, rules and regulations. The Company has not formally adopted a written code of business conduct and ethics that governs the Companys employees, officers and Directors as the Company is not required to do so.\nIn lieu of an Audit Committee, the Companys Board of Directors, is responsible for reviewing and making recommendations concerning the selection of outside auditors, reviewing the scope, results and effectiveness of the annual audit of the Companys financial statements and other services provided by the Companys independent public accountants. The Board of Directors and the Chief Executive Officer of the Company review the Companys internal accounting controls, practices and policies.\nCommittees of the Board\nOur Company currently does not have nominating, compensation, or audit committees or committees performing similar functions nor does our Company have a written nominating, compensation or audit committee charter. Our Director(s) believe that it is not necessary to have such committees, at this time, because the Directors can adequately perform the functions of such committees.\nAudit Committee Financial Expert\nOur Board of Directors has determined that we do not have a board member that qualifies as an audit committee financial expert as defined in Item 407(D)(5) of Regulation S-K, nor do we have a Board member that qualifies as independent as the term is used in Item 7(d)(3)(iv)(B) of Schedule 14A under the Securities Exchange Act of 1934, as amended, and as defined by Rule 4200(a)(14) of the FINRA Rules.\nWe believe that our Director(s) are capable of analyzing and evaluating our financial statements and understanding internal controls and procedures for financial reporting. The Director(s) of our Company does not believe that it is necessary to have an audit committee because management believes that the Board of Directors can adequately perform the functions of an audit committee. In addition, we believe that retaining an independent Director who would qualify as an audit committee financial expert would be overly costly and burdensome and is not warranted in our circumstances given the stage of our development and the fact that we have not generated any positive cash flows from operations to date.\nInvolvement in Certain Legal Proceedings\nOur Directors and our Officers have not been involved in any of the following events during the past ten years:\n1. bankruptcy petition filed by or against any business of which such person was a general partner or executive officer either at the time of the bankruptcy or within two years prior to that time;\n2. any conviction in a criminal proceeding or being subject to a pending criminal proceeding (excluding traffic violations and other minor offenses);\n3. being subject to any order, judgment, or decree, not subsequently reversed, suspended or vacated, of any court of competent jurisdiction, permanently or temporarily enjoining, barring, suspending or otherwise limiting his/her involvement in any type of business, securities or banking activities; or\n4. being found by a court of competent jurisdiction (in a civil action), the Commission or the Commodity Futures Trading Commission to have violated a federal or state securities or commodities law, and the judgment has not been reversed, suspended, or vacated.\n5. Such person was found by a court of competent jurisdiction in a civil action or by the Commission to have violated any Federal or State securities law, and the judgment in such civil action or finding by the Commission has not been subsequently reversed, suspended, or vacated;\n6. Such person was found by a court of competent jurisdiction in a civil action or by the Commodity Futures Trading Commission to have violated any Federal commodities law, and the judgment in such civil action or finding by the Commodity Futures Trading Commission has not been subsequently reversed, suspended or vacated;\n7. Such person was the subject of, or a party to, any Federal or State judicial or administrative order, judgment, decree, or finding, not subsequently reversed, suspended or vacated, relating to an alleged violation of: (i) Any Federal or State securities or commodities law or regulation; or(ii) Any law or regulation respecting financial institutions or insurance companies including, but not limited to, a temporary or permanent injunction, order of disgorgement or restitution, civil money penalty or temporary or permanent cease-and-desist order, or removal or prohibition order; or(iii) Any law or regulation prohibiting mail or wire fraud or fraud in connection with any business entity; or\n8. Such person was the subject of, or a party to, any sanction or order, not subsequently reversed, suspended or vacated, of any self-regulatory organization (as defined in Section 3(a)(26) of the Exchange Act (15 U.S.C. 78c(a)(26))), any registered entity (as defined in Section 1(a)(29) of the Commodity Exchange Act (7 U.S.C. 1(a)(29))), or any equivalent exchange, association, entity or organization that has disciplinary authority over its members or persons associated with a member.\nIndependence of Directors\nWe are not required to have independent members of our Board of Directors, and do not anticipate having independent Directors until such time as we are required to do so.\nCode of Ethics\nWe have not adopted a formal Code of Ethics. The Board of Directors evaluated the business of the Company and the number of employees and determined that since the business is operated by a small number of persons, general rules of fiduciary duty and federal and state criminal, business conduct and securities laws are adequate ethical guidelines. In the event our operations, employees and/or Directors expand in the future, we may take actions to adopt a formal Code of Ethics.\nShareholder Proposals\nOur Company does not have any defined policy or procedural requirements for shareholders to submit recommendations or nominations for Directors. The Board of Directors believes that, given the stage of our development, a specific nominating policy would be premature and of little assistance until our business operations develop to a more advanced level. Our Company does not currently have any specific or minimum criteria for the election of nominees to the Board of Directors and we do not have any specific process or procedure for evaluating such nominees. The Board of Directors will assess all candidates, whether submitted by management or shareholders, and make recommendations for election or appointment.\nA shareholder who wishes to communicate with our Board of Directors may do so by directing a written request addressed to our President, at the address appearing on the first page of this Information Statement.\nSECTION 16(A) BENEFICIAL OWNERSHIP REPORTING COMPLIANCE\nSection 16(a) of the Securities Exchange Act requires our executive officers and directors, and persons who own more than 10% of our common stock, to file reports regarding ownership of, and transactions in, our securities with the Securities and Exchange Commission and to provide us with copies of those filings. Based solely on our review of the copies of such forms furnished to us and written representations by our officers and directors regarding their compliance with applicable reporting requirements under Section 16(a) of the Exchange Act, we believe that all Section 16(a) filing requirements for our executive officers, directors and 10% stockholders were met during the year ended July 31, 2022. ITEM 11. EXECUTIVE COMPENSATION\nMANAGEMENT COMPENSATION\nThe following tables set forth certain information about compensation paid, earned or accrued for services by our Executive Officer from inception (April 16, 2021) to July 31, 2022:\nSummary Compensation Table\nSummary Compensation Table\nName\nand\nprincipal\nposition\n(a)\nYear\nended\nJuly 31\n(b)\nSalary ($)\n(c)\nBonus ($)\n(d)\nStock Compensation ($)\n(e)\nOption\nAwards ($)\n(f)\nNon-Equity\nIncentive\nPlan\nCompensation ($)\n(g)\nNonqualified\nDeferred\nCompensation\nEarnings ($)\n(h)\nAll Other\nCompensation ($)\n(i)\nTotal ($)\n(j)\nChee Yong Yee,\nChief Executive Officer, President, Secretary, Treasurer, Director\n$ -\n-\n-\n-\n-\n-\n-\n$ -\nStock Option Grants\nWe have not granted any stock options to our executive officers since our incorporation.\nEmployment Agreements\nWe do not have an employment or consulting agreement with any officers or Directors.\nCompensation Discussion and Analysis\nDirector Compensation\nOur Board of Directors does not currently receive any consideration for their services as members of the Board of Directors. The Board of Directors reserves the right in the future to award the members of the Board of Directors cash or stock-based consideration for their services to the Company, which awards, if granted shall be in the sole determination of the Board of Directors.\nExecutive Compensation Philosophy\nOur Board of Directors determines the compensation given to our executive officers in their sole determination. Our Board of Directors reserves the right to pay our executive or any future executives a salary, and/or issue them shares of common stock in consideration for services rendered and/or to award incentive bonuses which are linked to our performance, as well as to the individual executive officers performance. This package may also include long-term stock-based compensation to certain executives, which is intended to align the performance of our executives with our long-term business strategies. Additionally, while our Board of Directors has not granted any performance base stock options to date, the Board of Directors reserves the right to grant such options in the future, if the Board in its sole determination believes such grants would be in the best interests of the Company.\nIncentive Bonus\nThe Board of Directors may grant incentive bonuses to our executive officer and/or future executive officers in its sole discretion, if the Board of Directors believes such bonuses are in the Companys best interest, after analyzing our current business objectives and growth, if any, and the amount of revenue we are able to generate each month, which revenue is a direct result of the actions and ability of such executives.\nLong-term, Stock Based Compensation\nIn order to attract, retain and motivate executive talent necessary to support the Companys long-term business strategy we may award our executive and any future executives with long-term, stock-based compensation in the future, at the sole discretion of our Board of Directors, which we do not currently have any immediate plans to award. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nAs of July 31, 2022, the Company has 3,600,000 shares of common stock issued and outstanding, which number of issued and outstanding shares of common stock have been used throughout this report.\nName and Address of\nBeneficial Owner Shares of\nCommon\nStock\nBeneficially\nOwned Common\nStock Voting\nPercentage\nBeneficially\nOwned Voting\nShares of\nPreferred\nStock Preferred\nStock Voting\nPercentage\nBeneficially\nOwned Total Voting\nPercentage\nBeneficially\nOwned\nExecutive Officers and Directors\nChee Yong Yee\nPresident, Secretary, Treasurer, Chief Executive Officer, and Director 3,600,000 71.42 % - - 71.42 %\n5% or Greater Shareholders - - - - -\n*Officers and or Directors who may hold a 5% or greater controlling interest in the Company are included above, but only under the subtitle, Executive Officers and Directors.\nBeneficial ownership has been determined in accordance with Rule 13d-3 under the Exchange Act. Under this rule, certain shares may be deemed to be beneficially owned by more than one person (if, for example, persons share the power to vote or the power to dispose of the shares). In addition, shares are deemed to be beneficially owned by a person if the person has the right to acquire shares (for example, upon exercise of an option or warrant) within 60 days of the date as of which the information is provided. In computing the percentage ownership of any person, the amount of shares is deemed to include the amount of shares beneficially owned by such person by reason of such acquisition rights. As a result, the percentage of outstanding shares of any person as shown in the following table does not necessarily reflect the persons actual voting power at any particular date. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, DIRECTOR INDEPENDENCE\nExcept as set forth below, during the year ended July 31, 2022, we had not entered into any transactions with our sole officer or director, or persons nominated for these positions, beneficial owners of 5% or more of our common stock, or family members of these persons wherein the amount involved in the transaction or a series of similar transactions exceeded the lesser of $120,000 or 1% of the average of our total assets for the last three fiscal years.\nOn April 16, 2021, the Company issued 3,600,000 shares of restricted common stock, with a par value of $0.001 per share, to Mr. Chee Yong Yee in consideration of $3,600. The $3,600 in proceeds went to the Company to be used as working capital.\nMr. Chee Yong Yee, serves as our Chief Executive Officer, President, Secretary, Treasurer and Director.\nAs of July 31, 2021, our sole director, Mr. Chee Yong Yee, advanced $2,681 to the Company, which is unsecured and non-interest bearing and is repayable on demand.\nAs of July 31, 2022, our sole director, Mr. Chee Yong Yee, advanced $4,645 to the Company, which is unsecured and non-interest bearing and is repayable on demand.\nReview, Approval and Ratification of Related Party Transactions\nGiven our small size and limited financial resources, we have not adopted formal policies and procedures for the review, approval or ratification of transactions, such as those described above, with our executive officer(s), Director(s) and significant stockholders. We intend to establish formal policies and procedures in the future, once we have sufficient resources and have appointed additional Directors, so that such transactions will be subject to the review, approval or ratification of our Board of Directors, or an appropriate committee thereof. On a moving forward basis, our Directors will continue to approve any related party transaction. ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES\nAudit Fees\nThe following table sets forth the aggregate fees billed to the Company by its independent registered public accounting firms for the fiscal years ended July 31, 2022 and 2021. We have engaged JP Centurion & Partners PLT as our independent registered public accounting firm since July 01, 2021.\nACCOUNTING FEES AND SERVICES\nAudit fees\n$ 5,000\n$ 5,000\nAudit-related fees\n7,500\n-\nTax fees\n-\n-\nAll other fees\n-\n-\nTotal\n$ 12,500\n$ 5,000\nThe category of Audit fees includes fees for our annual audit, quarterly reviews and services rendered in connection with regulatory filings with the SEC, such as the issuance of comfort letters and consents.\nThe category of Audit-related fees includes employee benefit plan audits, internal control reviews and accounting consultation.\nThe category of Tax services includes tax compliance, tax advice, tax planning.\nThe category of All other fees generally includes advisory services related to accounting rules and regulations.\nAll of the professional services rendered by principal accountants for the audit of our annual financial statements that are normally provided by the accountant in connection with statutory and regulatory filings or engagements for last two fiscal years were approved by our board of directors.\nPART IV ITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n(a) Financial Statements\nThe following are filed as part of this report:\nFinancial Statements\nThe following financial statements of Birdie Win Corporation and Report of Independent Registered Public Accounting Firm are presented in the F pages of this Report:\nPage\nAudited Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nCONSOLIDATED BALANCE SHEETS\nCONSOLIDATED STATEMENTS OF OPERATIONS AND COMPREHENSIVE LOSS\nCONSOLIDATED STATEMENTS OF SHAREHOLDERS EQUITY\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS -\n(b) Exhibits\nThe following exhibits are filed herewith:\n31.1\nRule 13(a)-14(a)/15(d)-14(a) Certification of principal executive officer, principal financial officer*\n32.1\nSection 1350 Certification of principal executive officer, principal financial officer and principal accounting officer*\n101.INS*\nInline XBRL Instance Document\n101.SCH*\nInline XBRL Taxonomy Extension Schema Document\n101.CAL*\nInline XBRL Taxonomy Extension Calculation Linkbase\n101.DEF*\nInline XBRL Taxonomy Extension Definition Linkbase\n101.LAB*\nInline XBRL Taxonomy Extension Labels Linkbase\n101.PRE*\nInline XBRL Taxonomy Extension Presentation Linkbase\n104*\nCover Page Interactive Data File (embedded within the Inline XBRL document)\n*Filed herewith\nITEM 16. FORM 10-K SUMMARY\nAs permitted, the registrant has elected not to supply a summary of information required by Form 10-K.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this Report to be signed on its behalf by the undersigned, thereunto duly authorized.\nBirdie Win Corporation\nDate: October 11, 2022 By: /s/ CHEE YONG YEE\nChee Yong Yee\nChief Executive Officer, President, Secretary, Treasurer, and Director\n(Principal Executive Officer, Principal Financial Officer, Principal Accounting Officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Registrant, and in the capacities and on the dates indicated:\nSignature\nTitle\nDate\n/s/ Chee Yong Yee\nChief Executive Officer, President, Secretary, Treasurer, Director\nCHEE YONG YEE\n(Principal Executive Officer, Principal Financial Officer and Principal Accounting Officer)\nOctober 11, 2022\nBIRDIE WIN CORPORATION\nPage\nAudited Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM (PCAOB ID: 6723)\nCONSOLIDATED BALANCE SHEETS\nCONSOLIDATED STATEMENTS OF OPERATIONS AND COMPREHENSIVE INCOME (LOSS)\nCONSOLIDATED STATEMENTS OF CHANGES IN STOCKHOLDERS EQUITY\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS -\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nThe Board of Directors and Stockholders\nof Birdie Win Corporation\nD109, Level 1, Block D\nKelana Square, Jalan SS7/26\nPetaling Jaya\nSelangor Darul Ehsan\nMalaysia.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Birdie Win Corporation (the ‘Company) as of July 31, 2022 and July 31, 2021, and the related statements of operations and comprehensive loss, stockholders equity, and cash flows for the year ended July 31, 2022 and July 31, 2021, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of July 31, 2022 and July 31,2021, and the results of its operations and its cash flows for the year ended July 31, 2022 and July 31, 2021, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nGoing Concern\nThe financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 11 to the financial statements, the Company has suffered losses from operations and has a net capital deficiency. These conditions raise substantial doubt about the Companys ability to continue as a going concern. Managements plan in regard to these matters are also described in Note 11. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nCritical Audit Matters\nCritical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to those charged with governance that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgements. We determined that there are no critical matters.\n/s/ JP CENTURION & PARTNERS PLT\nJP CENTURION & PARTNERS PLT\nWe have served as the Companys auditor since 2021.\nJP Centurion & Partners PLT (PCAOB: 6723)\nKuala Lumpur, Malaysia\nOctober 11, 2022\nItem 1. Financial Statements\nBIRDIE WIN CORPORATION\nCONSOLIDATED BALANCE SHEETS\nAS OF JULY 31, 2022 AND 2021\n(Currency expressed in United States Dollars (US$), except for number of shares)\nAs of\nJuly 31, 2022 As of\nJuly 31, 2021\n(Audited) (Audited)\nASSETS\nCURRENT ASSETS\nCash and cash equivalents $ 19,312 $ 19,819\nPrepayment 2,594\nTOTAL CURRENT ASSETS 21,906 20,203\nNON-CURRENT ASSET\nPlant and equipment, net $ 1,599 $ 901\nTOTAL NON-CURRENT ASSET 1,599\nTOTAL ASSETS $ 23,505 $ 21,104\nLIABILITIES AND STOCKHOLDERS EQUITY\nCURRENT LIABILITIES\nAccrued liabilities $ 2,500 $ 5,250\nAmount due to a director 7,326 2,681\nCustomer deposit - 10,000\nTOTAL CURRENT LIABILITIES 9,826 17,931\nTOTAL LIABILITIES $ 9,826 $ 17,931\nSTOCKHOLDERS EQUITY\nCommon stock - Par value $ 0.001; Authorized: 75,000,000 shares; Issued and outstanding: 5,040,000 and 3,600,000 shares as of July 31, 2022 and July 31, 2021, respectively $ 5,040 $ 3,600\nAdditional paid in capital 34,560 -\nAccumulated deficit (25,921 ) (427 )\nTOTAL STOCKHOLDERS EQUITY $ 13,679 $ 3,173\nTOTAL LIABILITIES AND STOCKHOLDERS EQUITY $ 23,505 $ 21,104\nSee accompanying notes to consolidated financial statements.\nBIRDIE WIN CORPORATION\nCONSOLIDATED STATEMENTS OF OPERATIONS AND COMPREHENSIVE INCOME (LOSS)\nFOR THE YEARS ENDED JULY 31, 2022 AND 2021\n(Currency expressed in United States Dollars (US$), except for number of shares)\nFor the Years Ended,\nJuly 31\n(Audited) (Audited)\nREVENUE $ 30,000 $ 20,000\nCOST OF REVENUE (294 ) (148 )\nGROSS PROFIT 29,706 19,852\nOTHER INCOME -\nGENERAL AND ADMINISTRATIVE EXPENSES (55,756 ) (20,279 )\nLOSS BEFORE INCOME TAX (25,494 ) (427 )\nINCOME TAX EXPENSES - -\nNET LOSS (25,494 ) (427 )\nOTHER COMPREHENSIVE LOSS - -\nTOTAL COMPREHENSIVE LOSS $ (25,494 ) $ (427 )\nNET LOSS PER SHARE - BASIC AND DILUTED $ (0.01 ) $ (0.00 )\nWEIGHTED AVERAGE NUMBER OF COMMON SHARES OUTSTANDING, BASIC AND DILUTED 4,807,104 3,600,000\nSee accompanying notes to consolidated financial statements.\nBIRDIE WIN CORPORATION\nCONSOLIDATED STATEMENTS OF CHANGES IN STOCKHOLDERS EQUITY\nFOR THE YEARS ENDED JULY 31, 2022 AND 2021\n(Currency expressed in United States Dollars (US$), except for number of shares)\nNumber of\nshares Amount PAID-IN CAPITAL ACCUMULATED DEFICIT TOTAL EQUITY\nCOMMON STOCK ADDITIONAL\nNumber of\nshares Amount PAID-IN CAPITAL ACCUMULATED DEFICIT TOTAL EQUITY\nBalance as of April 16, 2021 (Date of Inception) - $ - $ - $ - $ -\nIssuance of share capital, founders shares 3,600,000 3,600 - - 3,600\nNet loss for the year 2021 - - - (427 ) (427 )\nBalance as of July 31, 2021 3,600,000 3,600 - (427 ) 3,173\nInitial public offering 1,440,000 1,440 34,560 - 36,000\nNet loss for the year 2022 - - - (25,494 ) (25,494 )\nNet loss - - - (25,494 ) (25,494 )\nBalance as of July 31, 2022 5,040,000 5,040 34,560 (25,921 ) 13,679\nSee accompanying notes to consolidated financial statements.\nBIRDIE WIN CORPORATION\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nFOR THE YEARS ENDED JULY 31, 2022 AND 2021\n(Currency expressed in United States Dollars (US$), except for number of shares)\nFor the Year Ended\nJuly 31,\n(Audited) (Audited)\nCASH FLOWS FROM OPERATING ACTIVITIES:\nNet loss $ (25,494 ) $ (427 )\nAdjustments to reconcile net loss to net cash used in operating activities\nDepreciation expenses\nChanges in operating assets and liabilities:\nIncrease in prepayment (2,210 ) (384 )\n(Decrease)/Increase in accrued liabilities (2,750 ) 5,250\nIncrease in amount due to a director 4,645 2,681\n(Decrease)/Increase in customer deposit (10,000 ) 10,000\nNet cash flows (used in)/from operating activities (35,203 ) 17,146\nCASH FLOWS FROM INVESTING ACTIVITY:\nPurchase of plant and equipment (1,304 ) (927 )\nNet cash flows used in investing activity (1,304 ) (927 )\nCASH FLOWS FROM FINANCING ACTIVITY:\nProceeds from issuance of share 36,000 3,600\nNet cash flows provided by financing activity 36,000 3,600\nEffect of exchange rate changes in cash and cash equivalents - -\nNet changes in cash and cash equivalents (507 ) 19,819\nCash and cash equivalents, beginning of year 19,819 -\nCASH AND CASH EQUIVALENTS, END OF YEAR $ 19,312 $ 19,819\nSUPPLEMENTAL CASH FLOWS INFORMATION\nIncome taxes paid $ - $ -\nInterest paid $ - $ -\nSee accompanying notes to consolidated financial statements.\nBIRDIE WIN CORPORATION\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED JULY 31, 2022 AND 2021\n(Currency expressed in United States Dollars (US$), except for number of shares)\n1. ORGANIZATION AND BUSINESS BACKGROUND\nBirdie Win Corporation, a Nevada corporation (the Company) was incorporated under the laws of the State of Nevada on April 16, 2021.\nBirdie Win Corporation is headquartered in Selangor, Malaysia. We provide financial literacy seminar services to Malaysian and Hong Kong individuals and families. Our mission is to improve the financial well-being of our clients.\nThe Companys executive office is located at D109, Level 1, Block D, Kelana Square, Jalan SS 7/26, 47301 Petaling Jaya, Selangor, Malaysia.\nOn April 16, 2021, Mr. Chee Yong Yee (Mr. Yee) was appointed as President, Secretary, Treasurer and a member of our Board of Directors. Mr. Yee also served as Chief Executive Officer of the Company.\nOn April 16, 2021, the Company issued 3,600,000 shares of restricted common stock, with a par value of $0.001 per share, to Mr. Chee Yong Yee in consideration of $3,600. The $3,600 in proceeds went to the Company to be used as working capital.\nOn October 11, 2021, the Company resolved to close the public offering pursuant to Form S-1, resulting in 1,440,000 shares of common stock being sold at $0.025 per share for a total of $36,000. The proceed of $36,000 went directly to the Company and shall be utilized pursuant to the use of proceed stated in the Form S-1.\n2. SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBasis of Presentation\nThe accompanying consolidated financial statements of the Company are prepared pursuant to the rules and regulations of the U.S. Securities and Exchanges Commission (SEC) and in conformity with generally accepted accounting principles in the U.S. (US GAAP). The Company has adopted July 31 as its fiscal year end.\nUse of Estimates\nManagement uses estimates and assumptions in preparing these financial statements in accordance with US GAAP. Those estimates and assumptions affect the reported amounts of assets and liabilities, the disclosure of contingent assets and liabilities in the balance sheets, and the reported revenue and expenses during the periods reported. Actual results may differ from these estimates.\nCash and Cash Equivalents\nCash and cash equivalents are carried at cost and represent cash on hand, demand deposits placed with banks or other financial institutions and all highly liquid investments with an original maturity of three months or less as of the purchase date of such investments.\nOur deposit in Malaysia is currently deposit in United Overseas Bank (Malaysia) Berhad, and there is a Perbadanan Insurans Deposit Malaysia protects our eligible deposits held with bank in Malaysia which is members of the Scheme. The Scheme will pay a compensation up to a limit of Malaysia Ringgit (MYR) 250,000 per deposit per member bank, which is equivalent to $59,462, if the aforementioned banks fail.\nPlant and Equipment\nPlant and equipment are stated at cost less accumulated depreciation and impairment. Depreciation of plant, equipment and software are calculated on the straight-line method over their estimated useful lives or lease terms generally as follows:\nSCHEDULE OF PLANT AND EQUIPMENT USEFUL LIVES\nClassification\nUseful Life\nComputer and software\nyears\nRevenue Recognition\nRevenue is generated through provision of Personal Financial Literacy Seminar (PFL Seminar) services to customer. Revenue is recognized when a customer obtains control of promised goods or services and is recognized in an amount that reflects the consideration that the Company expects to receive in exchange for those goods or services. In addition, the standard requires disclosure of the nature, amount, timing, and uncertainty of revenue and cash flows arising from contracts with customers. The amount of revenue that is recorded reflects the consideration that the Company expects to receive in exchange for those goods and services. The Company applies the following five-step model in order to determine this amount:\n(i) identification of the promised goods and services in the contract;\n(ii) determination of whether the promised goods and services are performance obligations, including whether they are distinct in the context of the contract;\n(iii) measurement of the transaction price, including the constraint on variable consideration;\n(iv) allocation of the transaction price to the performance obligations; and\n(v) recognition of revenue when (or as) the Company satisfies each performance obligation.\nThe Company adopted ASU 2014-09, Revenue from Contracts with Customers (Topic 606). Under Topic 606, the Company records revenue when persuasive evidence of an arrangement exists, delivery has occurred, the fee is fixed or determinable and collectability is probable. The Company records revenue from the provision of services upon delivery of the finalized Personal Financial Report to the customer.\nEarnings Per Share\nThe Company reports earnings per share in accordance with ASC Topic 260 Earnings Per Share, which requires presentation of basic and diluted earnings per share in conjunction with the disclosure of the methodology used in computing such earnings per share. Basic earnings per share excludes dilution and is computed by dividing income available to common stockholders by the weighted average common shares outstanding during the period. Diluted earnings per share takes into account the potential dilution that could occur if securities or other contracts to issue common stock were exercised and converted into common stock. Further, if the number of common shares outstanding increases as a result of a stock dividend or stock split or decreases as a result of a reverse stock split, the computations of a basic and diluted earnings per share shall be adjusted retroactively for all periods presented to reflect that change in capital structure.\nThe Companys basic earnings per share is computed by dividing the net income available to holders by the weighted average number of the Companys ordinary shares outstanding. Diluted earnings per share reflects the amount of net income available to each ordinary share outstanding during the period plus the number of additional shares that would have been outstanding if potentially dilutive securities had been issued.\nIncome Taxes\nThe Company accounts for income taxes using the asset and liability method prescribed by ASC Topic 740 Income Taxes. Under this method, deferred tax assets and liabilities are determined based on the difference between the financial reporting and tax bases of assets and liabilities using enacted tax rates that will be in effect in the years in which the differences are expected to reverse. The Company records a valuation allowance to offset deferred tax assets if based on the weight of available evidence, it is more-likely-than-not that some portion, or all, of the deferred tax assets will not be realized. The effect on deferred taxes of a change in tax rates is recognized as income or loss in the period that includes the enactment date.\nNew U.S. federal tax legislation, commonly referred to as the Tax Cuts and Jobs Act (the U.S. Tax Reform), was signed into law on December 22, 2017. The U.S. Tax Reform modified the U.S. Internal Revenue Code by, among other things, reducing the statutory U.S. federal corporate income tax rate from 35% to 21% for taxable years beginning after December 31, 2017; limiting and/or eliminating many business deductions; migrating the U.S. to a territorial tax system with a one-time transaction tax on a mandatory deemed repatriation of previously deferred foreign earnings of certain foreign subsidiaries; subject to certain limitations, generally eliminating U.S. corporate income tax on dividends from foreign subsidiaries; and providing for new taxes on certain foreign earnings. Taxpayers may elect to pay the one-time transition tax over eight years, or in a single lump-sum payment.\nRelated Parties\nParties, which can be a corporation or individual, are considered to be related if the Company has the ability, directly or indirectly, to control the other party or exercise significant influence over the other party in making financial and operating decisions. Companies are also considered to be related if they are subject to common control or common significant influence.\nFair Value Measurement\nAccounting Standards Codification (ASC) Topic 820 Fair Value Measurements and Disclosures (ASC Topic 820), which defines fair value, establishes a framework for measuring fair value and expands disclosures about fair value measurements. The statement clarifies that the exchange price is the price in an orderly transaction between market participants to sell the asset or transfer the liability in the market in which the reporting entity would transact for the asset or liability, that is, the principal or most advantageous market for the asset or liability. It also emphasizes that fair value is a market-based measurement, not an entity-specific measurement, and that market participant assumptions include assumptions about risk and effect of a restriction on the sale or use of an asset.\nASC Topic 820 establishes a fair value hierarchy that prioritizes the inputs to valuation techniques used to measure fair value. The hierarchy gives the highest priority to unadjusted quoted prices in active markets for identical assets or liabilities (Level 1 measurements) and the lowest priority to unobservable inputs (Level 3 measurements). The three levels of the fair value hierarchy are described below:\nLevel 1: Unadjusted quoted prices in active markets that are accessible at the measurement date for identical, unrestricted assets or liabilities;\nLevel 2: Quoted prices in markets that are not active, or inputs that are observable, either directly or indirectly, for substantially the full term of the asset or liability; and\nLevel 3: Prices or valuation techniques that require inputs that are both significant to the fair value measurement and unobservable (supported by little or no market activity).\nAs of July 31, 2022 and 2021, the Company did not have any non-financial assets and liabilities that are recognized or disclosed at fair value in the financial statements, at least annually, on a recurring basis, nor did the Company have any assets or liabilities measured at fair value on a non-recurring basis.\nRecently Issued and Adopted Accounting Standards\nIn June 2016, the FASB issued ASU 2016-13, Measurement of Credit Losses on Financial Instruments (Topic 326). ASU 2016-13 requires entities to use a forward-looking approach based on current expected credit losses (CECL) to estimate credit losses on certain types of financial instruments, including trade receivables. This may result in the earlier recognition of allowances for losses. ASU 2016-13 is effective for the Company beginning January 1, 2023, and early adoption is permitted. The Company does not believe the potential impact of the new guidance and related codification improvements will be material to its financial position, results of operations and cash flows.\nThe Company reviews new accounting standards as issued. Management has not identified any other new standards that it believes will have a significant impact on the Companys present or future financial statements.\n3. PREPAYMENT\nSCHEDULE OF PREPAYMENT\nAs of July 31\nPrepaid expenses\n$\n2,594\n$\nTotal\n$\n2,594\n$\nPrepaid expenses for the years ended July 21, 2022 and 2021 represent the payment made to stock and registrar fee, OTCIQ fee and virtual office rental fee.\n4. PLANT AND EQUIPMENT\nPlant and equipment consisted of the following as of July 31, 2022 and 2021:\nSCHEDULE OF PLANT AND EQUIPMENT\nAs of July 31\nComputer and software\n$ 2,231 $ 927\nLess: Accumulated depreciation (632 ) (26 )\nPlant and equipment, net $ 1,599 $ 901\nFor the year ended July 31, 2022, the Company has invested $1,304 in computer and software.\nFor the year ended July 31, 2021, the Company has invested $927 in computer and software.\nDepreciation expenses for the years ended July 31, 2022 and 2021 amounted to $606 and $26 respectively.\n5. ACCRUED LIABILITIES\nSCHEDULE OF ACCRUED LIABILITIES\nAs of July 31\nAccrued expenses\n$\n2,500\n$\n5,250\nTotal\n$ 2,500\n$ 5,250\nAccrued expenses for the years ended July 31, 2022 and 2021 consist of accrued audit fees.\n6. AMOUNT DUE TO A DIRECTOR\nAs of July 31, 2022, the sole director of the Company advanced $7,326 to the Company, which is unsecured and non-interest bearing and is repayable on demand.\nOur director, Mr. Chee Yong Yee, has not been compensated for the services.\n7. SHAREHOLDERS EQUITY\nThe Company has 75,000,000 shares of common stock authorized.\nFor the year ended July 31, 2022, the Company issued an aggregated of 1,440,000 shares of its common stock at $0.025 per share for aggregate gross proceeds of $36,000.\nAs of July 31, 2022, the Company has 5,040,000 shares of common stock issued and outstanding. There are no shares of preferred stock authorized.\n8. CONCENTRATION OF RISK\nCustomer Concentration\nFor the year ended July 31, 2022, there were three customers who accounted for 100% of the Companys revenues. The customer who accounted for 100% of the Companys revenues and its outstanding receivable balance at period-end is presented below:\nSCHEDULE OF REVENUES AND OUTSTANDING RECEIVABLE\nFor the year ended July 31, 2022\nRevenue Percentage of\nRevenue Accounts\nreceivable\nCustomer A $ 10,000 33 % $ -\nCustomer B 10,000 33 % -\nCustomer C 10,000 33 % -\nTotal $ 30,000 100 % $ -\n9. INCOME TAX\nThe loss from operation before income tax of the Company for the years ended July 31, 2022 and 2021 were comprised of the following:\nSCHEDULE OF OPERATION BEFORE INCOME TAX\nFor the years ended July 31\nTax jurisdictions from:\n- Local $ (25,494 ) $ (427 )\nLoss before income taxes $ (25,494 ) $ (427 )\nUnited States of America\nThe Company is registered in the State of Nevada and is subject to the tax laws of the United States of America. As of July 31, 2022, the operations in the United States of America incurred $25,921 of cumulative net operating losses (NOLs) which can be carried forward to offset future taxable income, at the tax rate of 21%. The NOL carry forwards begin to expire in 2042, if unutilized. The Company has provided for a full valuation allowance of approximately $5,443 against the deferred tax assets on the expected future tax benefits from the net operating loss carryforwards as the management believes it is more likely than not that these assets will not be realized in the future.\nThe following table sets forth the significant components of the aggregate deferred tax assets of the Company as of July 31, 2022 and July 31, 2021:\nSCHEDULE OF AGGREGATE DEFERRED TAX\nAs of July 31\nDeferred tax assets:\nNet operating loss carryforwards $ $\n- United States of America 5,443\nLess: valuation allowance (5,443 ) (90 )\nDeferred tax assets $ - $ -\nManagement believes that it is more likely than not that the deferred tax assets will not be fully realizable in the future. Accordingly, the Company provided for a full valuation allowance against its deferred tax assets of $5,443 as of July 31, 2022.\n10. SEGMENT REPORTING\nASC 280, Segment Reporting establishes standards for reporting information about operating segments on a basis consistent with the Companys internal organization structure as well as information about services categories, business segments and major customers in financial statements. The Company has single reportable segment based on business unit, food and beverage business and single reportable segment based on country, Malaysia.\nIn accordance with the Segment Reporting Topic of the ASC, the Companys chief operating decision maker has been identified as the Chief Executive Officer and President, who reviews operating results to make decisions about allocating resources and assessing performance for the entire Company. Existing guidance, which is based on a management approach to segment reporting, establishes requirements to report selected segment information quarterly and to report annually entity-wide disclosures about products and services, major customers, and the countries in which the entity holds material assets and reports revenue. All material operating units qualify for aggregation under Segment Reporting due to their similar customer base and similarities in economic characteristics; nature of products and services; and procurement, manufacturing and distribution processes.\nSCHEDULE OF SEGMENT REPORTING\nFor the Year Ended July 31, 2022\nBy Business Unit Financial Services\nBusiness Total\nRevenue $ 30,000 $ 30,000\nCost of revenue (294 ) (294 )\nGeneral and administrative expenses (55,756 ) (55,756 )\nLoss from operations (26,050 ) (26,050 )\nTotal assets $ 23,505 $ 23,505\nCapital expenditure $ 1,304 $ 1,304\nFor the Year Ended July 31, 2021\nBy Business Unit Financial Services\nBusiness Total\nRevenue $ 20,000 $ 20,000\nCost of revenue (148 ) (148 )\nGeneral and administrative expenses (20,279 ) (20,279 )\nLoss from operations (427 ) (427 )\nTotal assets $ 21,104 $ 21,104\nCapital expenditure $ 927 $ 927\nBy Country United States Hong Kong Malaysia Total\nFor the Year Ended July 31, 2022\nBy Country United States Hong Kong Malaysia Total\nRevenue $ - $ 20,000 $ 10,000 $ 30,000\nCost of revenue - (196 ) (98 ) (294 )\nGeneral and administrative expenses - (37,171 ) (18,585 ) (55,756 )\nLoss from operations - (17,367 ) (8,683 ) (26,050 )\nTotal assets $ - $ - $ 23,505 $ 23,505\nCapital expenditure $ - $ - $ 1,304 $ 1,304\nBy Country United States Hong Kong Malaysia Total\nFor the Year Ended July 31, 2021\nBy Country United States Hong Kong Malaysia Total\nRevenue $ - $ 10,000 $ 10,000 $ 20,000\nCost of revenue - (74 ) (74 ) (148 )\nGeneral and administrative expenses - (10,139 ) (10,140 ) (20,279 )\nLoss from operations - (213 ) (214 ) (427 )\nTotal assets $ - $ - $ 21,104 $ 21,104\nCapital expenditure $ - $ - $ 927 $ 927\n11. GOING CONCERN\nFor the year ended July 31, 2022, the Company incurred a net loss of $25,494 and used cash in operating activities of $35,203. These conditions raise substantial doubt about the Companys ability to continue as a going concern. The ability to continue as a going concern is dependent upon the Companys profit generating operations in the future and/or obtaining the necessary financing to meet its obligations and repay its liabilities arising from normal business operations when they become due. These financial statements do not include any adjustments to the recoverability and classification of recorded asset amounts and classification of liabilities that might be necessary should the Company be unable to continue as a going concern. The Company expects to finance its operations primarily through cash flow from revenue and continuing financial support from a shareholder. In the event that we require additional funding to finance the growth of the Companys current and expected future operations as well as to achieve our strategic objectives, the shareholder has indicated the intent and ability to provide additional financing.\n12. SUBSEQUENT EVENTS\nIn accordance with ASC Topic 855, Subsequent Events, which establishes general standards of accounting for and disclosure of events that occur after the balance sheet date but before financial statements are issued, the Company has evaluated all events or transactions that occurred after July 31, 2022 up through the date the Company presented these audited financial statements. During the period, the Company did not have any material recognizable subsequent events."
}