{
    "cik": "1874999",
    "company": "AG Acquisition Group III, Inc.",
    "filing_type": "10-K",
    "filing_date": "2022-10-11",
    "period_of_report": "2022-06-30",
    "sic": "6770",
    "state_of_inc": "DE",
    "state_location": "FL",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1874999/0001493152-22-028039-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1874999/000149315222028039/form10-k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1874999/0001493152-22-028039.txt",
    "filename": "1874999_10K_2022_0001493152-22-028039.htm",
    "content": "ITEM 1. BUSINESS\nUnless the context otherwise requires, AG Acquisition Group III, Inc., we, us, our, or the Company refer to AG Acquisition Group III, Inc.\nOverview\nThe Company was incorporated on June 22, 2021, in the state of Delaware as a blank check company. Since inception, the Company has only engaged in organizational efforts. The Company was formed to be used as a vehicle to pursue a business combination with an unidentified target. The Company has not yet conducted negotiations or entered into preliminary discussions with a target company.\nThe Company has been solely funded by its management and does not intend to seek outside funding sources at this time, though it may do so in the future. During the remainder of the fiscal year and beyond such time, we anticipate incurring costs related to the filing of reports under the Securities Exchange Act of 1934, as amended (the Exchange Act), and investigating, analyzing and consummating an acquisition. We believe we will be able to meet these costs through use of funds to be loaned by or invested in us by our management or other investors. Our management has indicated their intent to advance funds on behalf of the Company as needed in order to accomplish its business plan and comply with its Exchange Act reporting requirements; however, there are no agreements in effect between the Company and our management specifically requiring that they provide any funds to the Company. As a result, there are no assurances that such funds will be advanced or that the Company will be able to secure any additional funding as needed and therefore there is no guarantee that the Company can comply with the filing of reports required under the Exchange Act.\nMany states have enacted statutes, rules and regulations limiting the sale of securities of blank check companies in their respective jurisdictions. Management does not intend to undertake any efforts to cause a market to develop in our securities, either debt or equity, until we have successfully concluded a business combination. The Company intends to comply with the periodic reporting requirements of the Exchange Act for so long as it is subject to those requirements.\nThe Company is a shell company in that it has no or nominal operations and either no or nominal assets. At this time, the Companys purpose is to seek, investigate and, if such investigation warrants, acquire an interest in business opportunities presented to it by persons or firms who or which desire to seek the perceived advantages of an Exchange Act registered corporation. The Company will not restrict its search to any specific business, industry, or geographical location and the Company may participate in a business venture of virtually any kind or nature. This discussion of the proposed business is purposefully general and is not meant to be restrictive of the Companys virtually unlimited discretion to search for and enter into potential business opportunities.\nAlthough there is no guarantee that a merger with a private, operating business would result in any benefit to our current or future shareholders, the Company believes there exists a potential benefit to the shareholders from the consummation of such a merger or acquisition. For example, our common stock may become more attractive to the financial community, resulting in an increased share price and/or greater liquidity. Moreover, if all of the preconditions of Rule 144, promulgated under the Securities Act of 1933, as amended (the Securities Act), are met, including the introduction of an operating business, current restricted shareholders may be able to utilize Rule 144 for the sale of their shares. Currently, Rule 144 is not available as further described below in Risk Factors. There is no guarantee that any of these possible benefits will come to fruition.\nOther perceived benefits of becoming a publicly traded corporation include, among other things, facilitating or improving the terms on which additional equity financing may be obtained, providing liquidity for the principals of and investors in a business, creating a means for providing incentive stock options or similar benefits to key employees, and offering greater flexibility in structuring acquisitions, joint ventures and the like through the issuance of stock.\nNegotiations with any merger candidate are expected to focus on the percentage of the Company which the target company shareholders would acquire in exchange for all of their shareholdings in the target company. Depending upon certain factors, such as the target companys assets and liabilities, the Companys current shareholders will most likely hold a substantially lesser percentage ownership interest in the Company following any merger or acquisition. The percentage ownership may be subject to significant reduction in the event the Company acquires an operating business with substantial assets. Any merger or acquisition effected by the Company can be expected to have a significant dilutive effect on the percentage of shares held by the Companys then shareholders. Management does not expect to negotiate a cash payment in exchange for the outstanding shares held by non-affiliates.\nIn applying the foregoing criteria, none of which will be controlling, management will attempt to analyze all factors and circumstances and make a determination based upon reasonable investigative measures and available data. Potentially available business opportunities may occur in many different industries, and at various stages of development, all of which will make the task of comparative investigation and analysis of such business opportunities extremely difficult and complex. Due to the Companys limited capital available for investigation, we may not discover or adequately evaluate adverse facts about the opportunity to be acquired. In addition, we will be competing against other entities that possess greater financial, technical and managerial capabilities for identifying and completing business combinations.\nWe may seek a business opportunity with entities which have recently commenced operations, or which wish to utilize the public marketplace in order to raise additional capital in order to expand into new products or markets, to develop a new product or service, or for other corporate purposes. We may acquire assets and establish wholly owned subsidiaries in various businesses or acquire existing businesses as subsidiaries.\nWe would not be obligated nor does management intend to seek pre-approval by our shareholders prior to entering into a transaction.\nThe Company intends to promote itself privately. The Company anticipates that the selection of a business opportunity in which to participate will be complex and risky. Due to general economic conditions, rapid technological advances being made in some industries and shortages of available capital, management believes that there are numerous firms seeking the perceived benefits of a publicly registered corporation. Such perceived benefits may include facilitating or improving the terms on which additional equity financing may be sought, providing liquidity for incentive stock options or similar benefits to key employees, providing liquidity (subject to restrictions of applicable statutes), for all shareholders, and other factors.\nThere are different situations for private companies which may make a reverse merger more attractive to an operating private company than filing its own Form 10. It takes significant time and effort just to be able to learn to file the necessary documents through the SECs EDGAR database, especially if the operating company has not invested in filing software to streamline the process which is expensive. We believe that small companies are usually in a hurry to raise capital and some investors require that the private companies they invest in are or become SEC reporting. The reason being is that some investors desire to have an exit strategy and a reverse merger with a Form 10 shell is perceived to be one step closer to liquidity. It should be noted that if a public shell company consummates a reverse merger with a private operating company, the company will be required to file a Current Report on Form 8-K with the SEC within four business days of the transaction and that the Form 8-K will need to include audited financial statements of the private operating company and pro forma financial statements giving effect to the business combination.\nIn contrast with a Form 10 shell company, a merger with a legacy shell company that has a significant shareholder base and is trading may have poignant liabilities including previous disgruntled shareholders that may suppress the stock price upon merger with an operating company. In addition, the surviving company may not qualify post-reverse merger as an emerging growth company under the Jumpstart Our Business Startups Act of 2012, as amended (the JOBS Act), if the legacy shell company had a registration statement declared effective on or before December 8, 2011 and the first sale of common equity occurred on or before December 8, 2011. Due diligence is slow and may be complicated by many different factors.\nIn contrast with a Form 10 shell company, a merger with a development stage company, a shell company with an existing business plan and minimum shareholder base and free trading stock necessary to achieve a ticker symbol and begin trading is very expensive compared to a Form 10 shell company notwithstanding the consideration a private company would have to provide to us and the fact that we would not provide such company with a shareholder base.\nThe Company has, and will continue to have, little or no capital with which to provide the owners of business opportunities with any significant cash or other assets. At June 30, 2022, the Company had a cash balance of $710. Management believes that the Company will be able to offer owners of acquisition candidates the opportunity to acquire a controlling ownership interest in a publicly registered company without incurring the cost and time of completing such initial registration. The owners of the business opportunities will, however, incur significant legal and accounting costs in connection with the acquisition of a business opportunity, including the costs of preparing Current Reports on Form 8-K, Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q and agreements and related reports and documents. The Exchange Act specifically requires that any merger or acquisition candidate comply with all applicable reporting requirements, which include providing audited financial statements to be included within the numerous filings relevant to complying with the Exchange Act. The Company has not conducted market research and is not aware of statistical data which would support the perceived benefits of a merger or acquisition transaction for the owners of a business opportunity.\nThe analysis of new business opportunities will be undertaken by, or under the supervision of our officers and directors, or successor management, with such outside assistance as they may deem appropriate. The Company intends to concentrate on identifying preliminary prospective business opportunities, which may be brought to our attention through present associations of the Companys officers and directors. In analyzing prospective business opportunities, the Company will consider such matters as the available technical, financial and managerial resources; working capital and other financial requirements; history of operations, if any; prospects for the future; nature of present and expected competition; the quality and experience of management services which may be available and the depth of that management; the potential for further research, development, or exploration; specific risk factors not now foreseeable but which then may be anticipated to impact the proposed activities of the Company; the potential for growth or expansion; the potential for profit; the perceived public recognition or acceptance of products, services, or trades; name identification; and other relevant factors. The Company will not acquire or merge with any company for which audited financial statements are not available.\nManagement has substantial flexibility in identifying and selecting a prospective new business opportunity. In reviewing business opportunities, management will also consider such factors as: (a) potential for growth, indicated by new technology, anticipated market expansion or new products; (b) competitive position as compared to other firms of similar size and experience within the industry segment as well as within the industry as a whole; (c) strength and diversity of management, either in place or scheduled for recruitment; (d) capital requirements and anticipated availability of required funds, to be provided by the registrant or from operations, through the sale of additional securities, through joint ventures or similar arrangements or from other sources; and (e) the extent to which the business opportunity can be advanced considering the availability of both human and economic capital.\nThe foregoing criteria are not intended to be exhaustive and there may be other criteria that the Company may deem relevant.\nIn evaluating a prospective business combination, we will conduct as extensive a due diligence review of potential targets as possible given the lack of information which may be available regarding private companies, our limited personnel and financial resources and the relative inexperience of our management with respect to such activities. Our management includes a securities attorney with over 20 years experience working on private to public transactions and a consultant who has advised many public companies on matters related to capital markets; however, we believe there are many companies and professionals with significantly more experience than our management that also are seeking business combination targets.\nWe expect that our due diligence will encompass, among other things, meetings with the target businesss incumbent management and inspection of its facilities, as necessary, as well as a review of financial and other information which is made available to us. This due diligence review will be conducted either by our management or by unaffiliated third parties we may engage, including but not limited to attorneys, accountants, consultants or other such professionals. At this time, the Company has not specifically identified any third parties that it may engage. The costs associated with hiring third parties as required to complete a business combination may be significant and are difficult to determine as such costs may vary depending on a variety of factors, including the amount of time it takes to complete a business combination, the location of the target company, and the size and complexity of the business of the target company.\nOur limited funds and the lack of full-time management will likely make it impracticable to conduct a complete and exhaustive investigation and analysis of a target business before we consummate a business combination. Management decisions, therefore, will likely be made without detailed feasibility studies, independent analysis, market surveys and the like which, if we had more funds available to us, would be desirable. We will be particularly dependent in making decisions upon information provided by the promoters, owners, sponsors or others associated with the target business seeking our participation.\nThe time and costs required to select and evaluate a target business and to structure and complete a business combination cannot presently be ascertained with any degree of certainty. The amount of time it takes to complete a business combination, the location of the target company, and the size and complexity of the business of the target company, whether current stockholders of the Company will retain equity in the Company, the scope of the due diligence investigation required, the involvement of the Companys auditors in the transaction, possible changes in the Companys capital structure in connection with the transaction, and whether funds may be raised contemporaneously with the transaction are all factors that determine the costs associated with completing a business combination transaction. The time and costs required to complete a business combination can be estimated once a business combination target has been identified. Any costs incurred with respect to the evaluation of a prospective business combination that is not ultimately completed will result in a loss to us.\nThe Company does not intend to obtain funds in one or more private placements to finance the operation of any acquired business opportunity until such time as the Company has successfully identified such a merger or acquisition.\nManagement intends to devote such time as it deems necessary to carry out the Companys affairs. We cannot project the amount of time that our management will actually devote to our plan of operation.\nThe Company intends to conduct its activities so as to avoid being classified as an investment company under the Investment Company Act of 1940, as amended (the Investment Company Act), and therefore avoid application of the costly and restrictive registration and other provisions of the Investment Company Act and the regulations promulgated thereunder.\nGovernment Regulations\nAs a public company, we will be subject to the reporting requirements of the Exchange Act, which include the preparation and filing of current, quarterly and annual reports on Forms 8-K, 10-Q and 10-K. The Exchange Act specifically requires that any merger or acquisition candidate comply with all applicable reporting requirements, which include providing audited financial statements to be included within the numerous filings relevant to complying with the Exchange Act.\nThe Company is a Blank Check Company\nAs of October 11, 2022, the Company is a blank check company with no revenues and has no specific business plan or purpose other than to seek new business opportunities or to engage in a merger or acquisition with an unidentified company. Any offerings of our securities would need to comply with Rule 419 under the Securities Act. The provisions of Rule 419 apply to every registration statement filed under the Securities Act by a blank check company. Rule 419 requires that the blank check company filing such registration statement deposit the securities being offered and proceeds of the offering into an escrow or trust account pending the execution of an agreement for an acquisition or merger. In addition, the registrant is required to file a post-effective amendment to the registration statement containing the same information as found in a Form 10 registration statement, upon the execution of an agreement for such acquisition or merger. The rule provides procedures for the release of the offering funds in conjunction with the post effective acquisition or merger. The Company has no current plans to engage in any such offerings.\nAcquisition Opportunities\nTogether, management owns 10,000,000 shares of common stock representing 100% of the total issued and outstanding shares of the Company. As a result, management will have substantial flexibility in identifying and selecting a prospective new business opportunity. In implementing a structure for a particular business acquisition, the Company may become a party to a merger, consolidation, reorganization, joint venture, or licensing agreement with another corporation or entity. It may also acquire stock or assets of an existing business. On the consummation of a transaction, it is probable that the present management and shareholders of the Company will no longer be in control of the Company. In addition, the Companys directors may, as part of the terms of the acquisition transaction, resign and be replaced by new directors without a vote of the Companys shareholders or may sell their stock in the Company. Moreover, management may sell or otherwise transfer his interest in the Company to new management who will then continue the Company business plan of seeking new business opportunities.\nIt is anticipated that any securities issued in any reorganization would be issued in reliance upon an exemption from registration under applicable federal and state securities laws. In some circumstances, however, as a negotiated element of its transaction, the Company may agree to register all or a part of such securities immediately after the transaction is consummated or at specified times thereafter. If such registration occurs, of which there can be no assurance, it will be undertaken by the surviving entity after the Company has successfully consummated a merger or acquisition.\nThe Company will participate in a business opportunity only after the negotiation and execution of appropriate written agreements. Although the terms of such agreements cannot be predicted, generally such agreements will require some specific representations and warranties by all of the parties thereto, will specify certain events of default, will detail the terms of closing and the conditions which must be satisfied by each of the parties prior to and after such closing, will outline the manner of bearing costs, including costs associated with the Companys attorneys and accountants, will set forth remedies on default and will include miscellaneous other terms.\nThe Company does not intend to provide its security holders with any complete disclosure documents or audited financial statements concerning an acquisition or merger candidate and its business prior to the consummation of any acquisition or merger transaction. In the event a proposed business combination involves a change in majority of directors of the Company, the Company will file and provide to stockholders a Schedule 14F-1, which shall include information concerning the target company, as required. The Company will file a Current Report on Form 8-K, as required, within four business days of a business combination which results in the Company ceasing to be a shell company. This Form 8-K will include complete disclosure of the target company, including audited financial statements.\nThe present stockholders of the Company will likely not have control of a majority of the voting securities of the Company following a reorganization transaction. As part of such a transaction, all or a majority of the Companys directors may resign and one or more new directors may be appointed without any vote by stockholders.\nThe Company has not expended funds on, and has no plans to expend funds or time on, product research or development.\nCompetition\nThe Company will remain an insignificant participant among the firms which engage in acquisition opportunities. There are many established venture capital and financial concerns which have significantly greater financial and personnel resources and technical expertise than the Company. In view of the Companys combined extremely limited financial resources and limited management availability, the Company will continue to be at a significant competitive disadvantage compared to the Companys competitors which are also in the business of seeking opportunities to engage in a merger or acquisition with other companies.\nEmployees\nThe Company currently has no employees. The business of the Company will be managed by its officers and directors and such officers or directors which may join the Company in the future, and who may become employees of the Company. The Company does not anticipate a need to engage any fulltime employees at this time.\nEmerging Growth Company\nThe Company is an emerging growth company, as defined in the JOBS Act, and may take advantage of certain exemptions from various reporting requirements that are applicable to other public companies that are not emerging growth companies including, but not limited to, not being required to comply with the auditor attestation requirements of Section 404(b) of the Sarbanes-Oxley Act of 2002, as amended (the Sarbanes-Oxley Act), and exemptions from the requirements of Sections 14A(a) and (b) of the Exchange Act to hold a nonbinding advisory vote of stockholders on executive compensation and any golden parachute payments not previously approved.\nThe Company has elected to use the extended transition period for complying with new or revised accounting standards under Section 102(b)(1) of the JOBS Act. This election allows us to delay the adoption of new or revised accounting standards that have different effective dates for public and private companies until those standards apply to private companies. As a result of this election, our financial statements may not be comparable to companies that comply with public company effective dates.\nWe will remain an emerging growth company for up to five years, although we will lose that status sooner if our revenues exceed $1 billion, if we issue more than $1 billion in non-convertible debt in a three-year period, or if the market value of our common stock that is held by non-affiliates exceeds $700 million as of the last business day of our last second fiscal quarter.\nTo the extent that we continue to qualify as a smaller reporting company, as such term is defined in Rule 12b-2 under the Exchange Act, after we cease to qualify as an emerging growth company, certain of the exemptions available to us as an emerging growth company may continue to be available to us as a smaller reporting company, including: (i) not being required to comply with the auditor attestation requirements of Section 404(b) of the Sarbanes Oxley Act; (ii) scaled executive compensation disclosures; and (iii) the requirement to provide only two years of audited financial statements, instead of three years.\nLegal Proceedings\nThe Companys officers and directors are not aware of any current, threatened or pending litigation to which the Company is a party or which any of its property is the subject and which would have any material, adverse effect on the Company.\nProperties\nThe Company shares office space with its officer and director, Laura Anthony, at 625 N. Flagler Drive, Suite 600, West Palm Beach, Florida 33401. The Company does not have a lease and the Company pays no rent for the space. The Company does not own any properties, nor does it lease any properties. The Company does not believe it will need to maintain an office at any time in the foreseeable future in order to carry out its plan of operations as described herein. ITEM 1A. RISK FACTORS\nAn investment in our securities carries a significant degree of risk. You should carefully consider the following risks, as well as the other information contained in this Annual Report on Form 10-K, including our historical financial statements and related notes included elsewhere in this Annual Report on Form 10-K, before you decide to purchase our securities. Any one of these risks and uncertainties has the potential to cause material adverse effects on our business, prospects, financial condition and operating results which could cause actual results to differ materially from any forward-looking statements expressed by us and a significant decrease in the value of our common shares and warrants. Refer to Cautionary Statement Regarding Forward-Looking Statements.\nWe may not be successful in preventing the material adverse effects that any of the following risks and uncertainties may cause. These potential risks and uncertainties may not be a complete list of the risks and uncertainties facing us. There may be additional risks and uncertainties that we are presently unaware of, or presently consider immaterial, that may become material in the future and have a material adverse effect on us. You could lose all or a significant portion of your investment due to any of these risks and uncertainties.\nBelow is a summary of material risks, uncertainties and other factors that could have a material effect on the Company and its operations:\n● We are dependent on the services of our officers and directors.\n● The Company has limited assets and no present source of revenues. The Company is dependent upon the financial support of its officers and directors.\n● Management has broad discretion over the selection of our prospective business.\n● Shareholders will note receive disclosure or information regarding a prospective business.\n● There is no active market for our common stock and accordingly, our stock is illiquid and may remain so.\n● We have not specified an industry for new prospective business opportunities and accordingly risks associated with a specific business cannot be ascertained.\n● Our officers and directors could have future conflicts of interest in determining business opportunities.\n● There are many blank check companies for which AG Acquisition Group III will compete to attract business opportunities.\n● Potential risks of an acquisition or merger with a foreign company.\n● AG Acquisition Group III may require additional financing to maintain its reporting requirements and administrative expenses.\n● State blue sky registration; potential limitations on resale of the securities.\n● Rule 144 related risk.\n● Rule 145 related risks.\n● The Company may be subject to certain tax consequences in our business, which may increase our cost of doing business.\n● We will not declare dividends.\n● We most likely will issue additional securities in conjunction with a business opportunity which will result in a dilution of present shareholder ownership.\n● Principal stockholders may engage in a transaction to cause the Company to repurchase their shares of common stock.\nRisks Related to Our Business\nWE ARE DEPENDENT ON THE SERVICES OF OUR OFFICERS AND DIRECTORS.\nAG Acquisition Group III is dependent upon the continued services of its officers and directors, Laura Anthony and Howard Gostfrand. Our officers and directors are our sole funding source and provide us with substantial expertise. Ms. Anthony has previously served as an officer and director of other blank check companies, including AG Acquisition Group, Inc., and AG Acquisition Group II, Inc. Ms. Anthony also serves as a director of Aditxt, Inc., a Nasdaq-listed public company. Further, Ms. Anthony has acted as legal counsel for numerous public and private companies over the past 28 years. AG Acquisition Group III believes that Ms. Anthonys experience as legal counsel working with small cap companies, including blank check companies, as well as her previous experience being an officer and director of AG Acquisition Group, Inc. and AG Acquisition Group II, Inc. and her knowledge of securities laws and regulations makes her very qualified to be an officer and director of AG Acquisition Group III. Mr. Gostfrand has also previously served as an officer and director of other blank check companies, including AG Acquisition Group, Inc., and AG Acquisition Group II, Inc. Further, Mr. Gostfrand has experience assisting shell companies with finding potential business combinations. Mr. Gostfrand founded and serves as President of American Capital Ventures (ACV), an investor relations and consulting firm focused on assisting small public companies with their approach to the investment community. ACV has represented over 150 companies in diverse industries from all over the country as well as internationally. Mr. Gostfrand has worked closely with management teams and understands the challenges associated with being a small cap company. We believe that Mr. Gostfrands previous experience being an officer and director of AG Acquisition Group, Inc., and AG Acquisition Group II, and his years of experience working with small public companies make him highly qualified to act as CEO of AG Acquisition Group III. See Directors and Executive Officers. If either of Ms. Anthony or Mr. Gostfrand were to cease offering his or her services, it is likely that the Company would cease to maintain its filings under the Exchange Act although it would continue to be obligated to do so and would cease to seek new business opportunities. This would have a material adverse effect on the Company.\nTHE COMPANY HAS LIMITED ASSETS AND NO PRESENT SOURCE OF REVENUES. THE COMPANY IS DEPENDENT UPON THE FINANCIAL SUPPORT OF ITS OFFICERS AND DIRECTORS.\nAt present, our business activities are limited to seeking potential business opportunities. Due to our limited financial and personnel resources, there is only a limited basis upon which to evaluate our prospects for achieving our intended business objectives. We have only limited resources and have no operating income, revenues or cash flow from operations. Our management is providing us with funding, on an as needed basis, necessary for us to continue our corporate existence and our business objective to seek new business opportunities, as well as funding the costs, including professional accounting fees, of registering our securities under the Exchange Act and continuing to be a reporting company under the Exchange Act. We have no written agreement with our management to provide any interim financing for any period. In addition, we will not generate any revenues unless and until we enter into a new business. As of June 30, 2022, we had cash of $710.\nMANAGEMENT HAS BROAD DISCRETION OVER THE SELECTION OF OUR PROSPECTIVE BUSINESS.\nAs of the date hereof, we have two stockholders: Leone Group, LLC (Leone Group) and ACV, each of whom owns 50.0% of our outstanding common stock. Ms. Anthony, our Chief Financial Officer, Secretary and director, is the sole equity holder of Leone Group. Mr. Gostfrand, our Chief Executive Officer and director, is the sole stockholder of ACV. At this time, we do not expect to seek investors outside of management but we could decide to do so in the future. Any person who invests in our securities will do so without an opportunity to evaluate the specific merits or risks of any potential new prospective business in which we may engage. As a result, investors will be entirely dependent on the broad discretion and judgment of management in connection with the selection of a prospective business. The business decisions made by our management may not be successful.\nSHAREHOLDERS WILL NOT RECEIVE DISCLOSURE OR INFORMATION REGARDING A PROSPECTIVE BUSINESS.\nAs of the date hereof, we have not yet identified any prospective business or industry in which we may seek to become involved and at present we have no information concerning any prospective business. Management is not required to and will not provide shareholders with disclosure or information regarding prospective business opportunities. Moreover, a prospective business opportunity may not result in a benefit to shareholders or prove to be more favorable to shareholders than any other investment that may be made by shareholders and investors.\nTHERE IS NO ACTIVE MARKET FOR OUR COMMON STOCK AND ACCORDINGLY OUR STOCK IS ILLIQUID AND MAY REMAIN SO.\nManagement does not intend to undertake any efforts to cause a market to develop in our securities, either debt or equity, until we have successfully concluded a business combination. Accordingly, our stock is illiquid and may remain so.\nWE HAVE NOT SPECIFIED AN INDUSTRY FOR NEW PROSPECTIVE BUSINESS OPPORTUNITIES AND ACCORDINGLY RISKS ASSOCIATED WITH A SPECIFIC BUSINESS CANNOT BE ASCERTAINED.\nThere is no basis for shareholders to evaluate the possible merits or risks of potential new business opportunities or the particular industry in which we may ultimately operate. To the extent that we effect a business combination with a financially unstable entity or an entity that is in its early stage of development or growth, including entities without established records of revenues or income, we will become subject to numerous risks inherent in the business and operations of that financially unstable company. In addition, to the extent that we effect a business combination with an entity in an industry characterized by a high degree of risk, we will become subject to the currently unascertainable risks of that industry. A high level of risk frequently characterizes certain industries that experience rapid growth, including internet companies. Although management will endeavor to evaluate the risks inherent in a particular new prospective business or industry, there can be no assurance that we will properly ascertain or assess all such risks or that subsequent events may not alter the risks that we perceive at the time of the consummation of any new business opportunity.\nOUR OFFICERS AND DIRECTORS COULD HAVE FUTURE CONFLICTS OF INTEREST IN DETERMINING BUSINESS OPPORTUNITIES.\nOur management is not required to, nor will they, commit full time to our affairs. As a result, pursuing new business opportunities may require a greater period of time than otherwise. Management is not precluded from serving as an officer or director of any other entity that is engaged in business activities similar to those of AG Acquisition Group III. Management is not currently an officer and director of any competing entities but could become so in the future.\nMs. Anthony is the founding partner of Anthony, L.G., PLLC (ALG), a corporate, securities and business transactions law firm, and the sole owner of Leone Group. See Directors and Executive Officers. Leone Group is a personal limited liability company that solely owns Ms. Anthonys holdings in AG Acquisition Group III and certain other personal investments. Ms. Anthony is also an owner and managing member of A.G. Capital Advisors, LLC (AG Capital), a consulting and advisory firm for small and middle market private and public companies. Neither ALG nor Leone Group or AG Capital currently competes, and will not compete, with AG Acquisition Group III. Although not expected or planned, if AG Acquisition Group III were to consummate a transaction with an entity that ALG currently represents or has previously represented, the conflict of interest would be appropriately disclosed and waived by all parties. It is likely, however, that AG Acquisition Group III will enter into a transaction with an entity with no relationship with ALG.\nMr. Gostfrand founded and serves as President of ACV, an investor relations and consulting firm focused on assisting small public companies with their approach to the investment community. Mr. Gostfrand is also an owner and managing member of AG Capital, a consulting and advisory firm for small and middle market private and public companies. See Directors and Executive Officers. Neither ACV nor AG Capital will compete with AG Acquisition Group III. Mr. Gostfrand does not currently intend to have ACV represent or provide services to any entity with which AG Acquisition Group III consummates a transaction.\nIn addition to the potential conflict of interest described above in the event that prior to the Company consummating a merger or acquisition, management becomes associated with another substantially similar entity, they will have a conflict of interest. Such conflict would result in a conflict of interest in determining to which entity a particular business opportunity should be presented. In general, officers and directors of a Delaware corporation are required to present certain business opportunities to a corporation for which they serve as an officer of director. In the event that our management has multiple business affiliations, he may have similar legal obligations to present certain business opportunities to multiple entities. In the event that a conflict of interest shall arise, management will consider factors such as reporting status, availability of audited financial statements, current capitalization and the laws of jurisdictions. In particular, management will likely present a business opportunity to an entity he controls that is current in its reporting obligations and has records sufficient to perform an audit. Moreover, management will likely present an opportunity to an entity he controls that is domiciled in Delaware or another state that management believes has well known corporate laws in the business community, prior to an entity domiciled in a less well known state. Further, management will consider the current capitalization of an entity they control in offering a business opportunity to such entity. In particular, management will consider whether they believe that the entity would be more attractive to an operating business following a change in capitalization such as a reverse split or decrease or increase in authorized capital stock. If several business opportunities or operating entities approach management with respect to a business combination, management will consider the foregoing factors as well as the preferences of the management of the operating company. In the event that all factors appear equal, management will likely present an operating company with a choice of blank check companies and defer to such operating companys preference.\nManagement believes that operating companies will consider such factors as outstanding shares, outstanding shares held by non-affiliates, number of shareholders, reporting history, if any, outstanding liabilities or potential liabilities, tax losses, outstanding SEC comments, regulatory history, the name of an entity and the state of domicile of an entity. This list is not exclusive and the management of an operating company may have a preference for an entity for reasons that we cannot determine in advance. However, management will act in what it believes will be in the best interests of the shareholders of AG Acquisition Group III and other respective public companies. AG Acquisition Group III shall not enter into a transaction with a target business that is affiliated with management. Moreover, in the event a business opportunity is presented to another entity controlled by management, management will continue to actively seek business opportunities for AG Acquisition Group III.\nIn addition, conflicts of interest create the risk that management may have an incentive to act adversely to the interests of other non-management stockholders, if any. A conflict of interest may arise between managements personal pecuniary interest and its fiduciary duty to stockholders.\nTHERE ARE MANY BLANK CHECK COMPANIES FOR WHICH AG ACQUISITION GROUP III WILL COMPETE TO ATTRACT BUSINESS OPPORTUNITIES.\nAG Acquisition Group III expects to encounter intense competition from other entities seeking to pursue new business opportunities. Many of these entities are well-established and have extensive experience in identifying new prospective business opportunities. Many of these competitors possess greater financial, technical, human and other resources than we do. Based upon our limited financial and personnel resources, we may lack the resources as compared to those of many of our potential competitors.\nPOTENTIAL RISKS OF AN ACQUISITION OR MERGER WITH A FOREIGN COMPANY.\nIf we enter into a business combination, acquisition or merger with a foreign concern, we will be subject to risks inherent in business operations outside of the United States. These risks include, for example, currency fluctuations, regulatory problems, punitive tariffs, unstable local tax policies, trade embargoes, risks related to shipment of raw materials and finished goods across national borders and cultural and language differences. Foreign economies may differ favorably or unfavorably from the United States economy in growth of gross national product, rate of inflation, market development, rate of savings, capital investment, resource self-sufficiency and balance of payments positions and in other respects.\nAG ACQUISITION GROUP III MAY REQUIRE ADDITIONAL FINANCING TO MAINTAIN ITS REPORTING REQUIREMENTS AND ADMINISTRATIVE EXPENSES.\nAG Acquisition Group III has no revenues and is dependent upon the willingness of management to fund the costs associated with the reporting obligations under the Exchange Act, and other administrative costs associated with our corporate existence. We may not generate any revenues unless and until the commencement of new business operations. We believe that management will continue to provide sufficient funds to pay accounting and professional fees and other expenses to fulfill our reporting obligations under the Exchange Act until we commence business operations. Through June 30, 2022, management related parties have made a capital investment of $18,500. In the event that our available funds from our management and affiliates prove to be insufficient, we will be required to seek additional financing. Our failure to secure additional financing could have a material adverse effect on our ability to pay the accounting and other fees in order to continue to fulfill our reporting obligations and pursue our business plan. We do not have any arrangements with any bank or financial institution to secure additional financing and such financing may not be available on terms acceptable and in our best interests. We do not have any written agreement with our affiliates to provide funds for our operating expenses.\nSTATE BLUE SKY REGISTRATION; POTENTIAL LIMITATIONS ON RESALE OF THE SECURITIES.\nThe holders of our shares of common stock and those persons, who desire to purchase our stock in any trading market that might develop, should be aware that there may be state blue-sky law restrictions upon the ability of investors to resell our securities. Accordingly, investors should consider the secondary market for AG Acquisition Group IIIs securities to be a limited one.\nRULE 144 RELATED RISK.\nA person who has beneficially owned restricted shares of our common stock for at least six months would be entitled to sell their securities provided that (i) such person is not deemed to have been one of our affiliates at the time of, or at any time during the three months preceding a sale, (ii) we are subject to the Exchange Act periodic reporting requirements for at least 90 days before the sale and (iii) if the sale occurs prior to satisfaction of a one-year holding period, we provide current information at the time of sale.\nPersons who have beneficially owned restricted shares of our common stock for at least six months but who are our affiliates at the time of, or at any time during the three months preceding a sale, would be subject to additional restrictions, by which such person would be entitled to sell within any three-month period only a number of securities that does not exceed the greater of either of the following:\n● 1% of the total number of securities of the same class then outstanding; or\n● the average weekly trading volume of such securities during the four calendar weeks preceding the filing of a notice on Form 144 with respect to the sale;\nprovided, in each case, that we are subject to the Exchange Act periodic reporting requirements for at least three months before the sale. Such sales by affiliates must also comply with the manner of sale, current public information and notice provisions of Rule 144.\nRestrictions on the Reliance of Rule 144 by Shell Companies or Former Shell Companies\nThe use of Rule 144 is prohibited for the resale of securities issued by any shell companies (other than business combination related shell companies) or any issuer that has been at any time previously a shell company. The SEC has provided an important exception to this prohibition, however, if the following conditions are met:\n● The issuer of the securities that was formerly a shell company has ceased to be a shell company;\n● The issuer of the securities is subject to the reporting requirements of Section 13 or 15(d) of the Exchange Act;\n● The issuer of the securities has filed all Exchange Act reports and material required to be filed, as applicable, during the preceding 12 months (or such shorter period that the issuer was required to file such reports and materials), other than Current Reports on Form 8-K; and\n● At least one year has elapsed from the time that the issuer filed current comprehensive disclosure with the SEC reflecting its status as an entity that is not a shell company.\nAs a result, it is likely that pursuant to Rule 144, stockholders who receive our restricted securities in a business combination will not be able to sell our shares without registration until one year after we have completed our initial business combination.\nRULE 145 RELATED RISKS.\nAffiliates of a target company who receive registered shares in a Rule 145 business combination transaction, and who do not become affiliates of the acquirer, will be able to immediately resell the securities received by them into the public markets without registration (except for affiliates of a shell company as discussed in the following section). However, those persons who are affiliates of the acquirer, and those who become affiliates of the acquirer after the acquisition, will still be subject to the Rule 144 resale conditions generally applicable to affiliates, including the adequate current public information requirement, volume limitations, manner-of-sale requirements for equity securities, and, if applicable, a Form 144 filing.\nApplication of Rule 145 to Shell Companies\nPublic resales of securities acquired by affiliates of acquirers and target companies in business combination transactions involving shell companies will continue to be subject to restrictions imposed by Rule 145. If the business combination transaction is not registered under the Securities Act, then the affiliates must look to Rule 144 to resell their securities (with the additional Rule 144 conditions applicable to shell company securities). If the business combination transaction is registered under the Securities Act, then affiliates of the acquirer and target company may resell the securities acquired in the transaction, subject to the following conditions:\n● The issuer must meet all of the conditions applicable to shell companies under Rule 144;\n● After 90 days from the date of the acquisition, the affiliates may resell their securities subject to Rule 144s volume limitations, adequate current public information requirement, and manner-of-sale requirements;\n● After six months from the date of the acquisition, selling security-holders who are not affiliates of the acquirer may resell their securities subject only to the adequate current public information requirement of Rule 144; and\n● After one year from the date of the acquisition, selling security-holders who are not affiliates or the acquirer may resell their securities without restriction.\nTHE COMPANY MAY BE SUBJECT TO CERTAIN TAX CONSEQUENCES IN OUR BUSINESS, WHICH MAY INCREASE OUR COST OF DOING BUSINESS.\nWe may not be able to structure our acquisition to result in tax-free treatment for the companies or their stockholders, which could deter third parties from entering into certain business combinations with us or result in being taxed on consideration received in a transaction. Currently, a transaction may be structured so as to result in tax-free treatment to both companies, as prescribed by various federal and state tax provisions. We intend to structure any business combination so as to minimize the federal and state tax consequences to both us and the target entity. We cannot guarantee however that the business combination will meet the statutory requirements of a tax-free reorganization or that the parties will obtain the intended tax-free treatment upon a transfer of stock or assets. A non-qualifying reorganization could result in the imposition of both federal and state taxes that may have an adverse effect on both parties to the transaction. It should be noted that in certain circumstances the criteria for determining whether or not an acquisition is a so-called tax free reorganization under Section 368(a)(1) of the Internal Revenue Code of 1986, as amended (the Code), depends upon whether the owners of the acquired business own 80% or more of the voting stock of the surviving entity. If a transaction were structured to take advantage of these provisions rather than other tax free provisions provided under the Code, all prior stockholders would in such circumstances retain 20% or less of the total issued and outstanding shares of the surviving entity. Under other circumstances, depending upon the relative negotiating strength of the parties, prior stockholders may retain substantially less than 20% of the total issued and outstanding shares of the surviving entity.\nWE WILL NOT DECLARE DIVIDENDS.\nWe do not expect to pay dividends for the foreseeable future because we have no revenues. The payment of dividends will be contingent upon our future revenues and earnings, if any, capital requirements and overall financial condition. The payment of any future dividends will be within the discretion of our board of directors. It is our expectation that after the commencement of new business operations that future management will determine to retain any earnings for use in business operations and accordingly, we do not anticipate declaring any dividends in the foreseeable future.\nWE MOST LIKELY WILL ISSUE ADDITIONAL SECURITIES IN CONJUNCTION WITH A BUSINESS OPPORTUNITY WHICH WILL RESULT IN A DILUTION OF PRESENT SHAREHOLDER OWNERSHIP.\nOur certificate of incorporation authorizes the issuance of 100,000,000 shares of common stock, par value $0.0001 per share, and 5,000,000 shares of preferred stock, par value $0.0001 per share. The Company has designated 1,000,000 shares as Series A Preferred Stock. Each share of Series A Preferred Stock is entitled to 1,000 votes on any matter submitted to the holders of common stock. The Series A Preferred Stock is not convertible. As of October 11, 2022, we have 10,000,000 shares of common stock issued and outstanding and only two shareholders of such common stock and we have no shares of preferred stock issued or outstanding. We may be expected to issue additional shares in connection with our pursuit of new business opportunities and new business operations. To the extent that additional shares of common stock are issued, our shareholders would experience dilution of their respective ownership interests. If we issue shares of common stock in connection with our intent to pursue new business opportunities, a change in control of our Company may be expected to occur. The issuance of additional shares of common stock may adversely affect the market price of our common stock, in the event that an active trading market commences.\nPRINCIPAL STOCKHOLDERS MAY ENGAGE IN A TRANSACTION TO CAUSE THE COMPANY TO REPURCHASE THEIR SHARES OF COMMON STOCK.\nIn order to provide control of the Company to a third party or third parties, our principal stockholders may choose to cause the Company to sell Company securities to a third party or third parties, with the proceeds of such sale being utilized for the Company to repurchase shares of common stock held by such principal stockholders. ITEM 1B. UNRESOLVED STAFF COMMENTS\nNone. ITEM 2. PROPERTIES\nThe Company shares office space with its officer and director, Laura Anthony, at 625 N. Flagler Drive, Suite 600, West Palm Beach, Florida 33401. The Company does not have a lease and the Company pays no rent for the space. The Company does not own any properties, nor does it lease any properties. The Company does not believe it will need to maintain an office at any time in the foreseeable future in order to carry out its plan of operations as described herein. ITEM 3. LEGAL PROCEEDINGS\nThe Companys officers and directors are not aware of any current, threatened or pending litigation to which the Company is a party or which any of its property is the subject and which would have any material, adverse effect on the Company. ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\nPART II ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nMarket Information\nThe Companys common stock is not traded on any markets.\nAs of October 11, 2022, there is no common stock that is subject to outstanding options or warrants to purchase.\nHolders\nAs of October 11, 2022, there were 10,000,000 shares of common stock issued and outstanding, and we had two holders of record of our common stock.\nDividends\nThe Company has not declared any dividends since inception and does not anticipate paying any dividends in the foreseeable future. We intend to retain future earnings, if any, for reinvestment in the development and expansion of our business. The payment of dividends is within the discretion of the Board of Directors and will depend on the Companys earnings, capital requirements, financial condition, and other relevant factors. There are no restrictions that currently limit the Companys ability to pay dividends on its common stock other than those generally imposed by applicable state law.\nSecurities Authorized for Issuance Under Equity Compensation Plans\nWe have no equity compensation plans.\nRecent Sales of Unregistered Securities\nThe following is a list of unregistered securities sold by the Company within the last three years, including the date sold, the title of the securities, the amount sold, the identity of the person who purchased the securities, the price or other consideration paid for the securities, and the section of the Securities Act under which the sale was exempt from registration as well as the factual basis for claiming such exemption.\nIn exchange for a capital investment of $3,000 by Leone Group, on or near June 22, 2021, AG Acquisition Group III issued to Leone Group 5,000,000 of its common stock representing 50% of its common stock outstanding on that date. The funds were used to pay ongoing administrative expenses, including but not limited to, organization expenses and expenses related to the audit.\nIn exchange for a capital investment of $3,000 by ACV on or near June 22, 2021, AG Acquisition Group III issued to ACV 5,000,000 of its common stock representing 50% of its common stock outstanding on that date. The funds were used to pay ongoing administrative expenses, including but not limited to, organization expenses and expenses related to the audit.\nThe Company believes that the issuance and sale of the restricted shares was exempt from registration pursuant to Section 4(a)(2) of the Securities Act as privately negotiated, isolated, non-recurring transactions not involving any public solicitation. An appropriate restrictive legend is affixed to the stock certificates issued in such transactions.\nPurchases of Equity Securities by the Issuer and Affiliated Purchasers\nNone.\nTransfer Agent and Registrar\nThe Company does not currently have a transfer agent. ITEM 6. RESERVED ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following presentation of managements discussion and analysis of our financial condition and results of operations should be read in conjunction with our financial statements, the accompanying notes thereto and other financial information appearing elsewhere in this Annual Report on Form 10-K. This section and other parts of this Annual Report on Form 10-K contain forward-looking statements that involve risks and uncertainties. See Forward-Looking Statements.\nOverview\nAG Acquisition Group III, Inc. (AG Acquisition Group III, we, us, our, or the Company) was organized as a vehicle to investigate and, if such investigation warrants, acquire a target company or business seeking the perceived advantages of being a publicly held corporation. We are an emerging growth company that is exempt from certain financial disclosure and governance requirements for up to five years as defined in the JOBS Act, that eases restrictions on the sale of securities; and increases the number of shareholders a company must have before becoming subject to the Securities and Exchange Commissions (the SEC) reporting and disclosure rules. Our principal business objective for the next 12 months and beyond such time will be to achieve long-term growth potential through a combination with a business rather than immediate, short-term earnings. We will not restrict our potential candidate target companies to any specific business, industry or geographical location and, thus, may acquire any type of business.\nOur current activities are related to seeking new business opportunities. We will use our limited personnel and financial resources in connection with such activities. It may be expected that pursuing a new business opportunity will involve the issuance of restricted shares of common stock. At June 30, 2022, we had $710 of cash assets and total liabilities of $0. We have generated no revenues since inception.\nWe have elected to use the extended transition period for complying with new or revised accounting standards under Section 102(b)(2) of the JOBS Act, that allows us to delay the adoption of new or revised accounting standards that have different effective dates for public and private companies until those standards apply to private companies. As a result of this election, our financial statements may not be comparable to companies that comply with public company effective dates.\nWe do not currently engage in any business activities that provide cash flow. The costs of investigating and analyzing business combinations for the next 12 months and beyond such time will be paid with money in our treasury or with additional amounts, as necessary, to be loaned to or invested in us by our stockholders, management or other investors.\nDuring the next 12 months, we anticipate incurring costs related to:\n(i) Filing reports pursuant to the Exchange Act (accounting and auditing fees) in the amount of approximately $20,000; and\n(ii) Consummating an acquisition in the amount of approximately $100,000 or more, depending on the terms of the specific acquisition at issue to pay for audit fees, and the range of audit fees for this is unknown at such time and cannot be predicted with any accuracy.\nOur officer and director, Laura Anthony, currently is providing legal services to the Company without charge.\nWe believe we will be able to meet the costs of filing reports under the Exchange Act during the next 12 months through use of funds to be loaned to or invested in us by our management or other investors. However, there is no guarantee that such additional funds will be made available to us or on terms that are favorable to us. If we enter into a business combination with a target entity, we will request the target company to pay the acquisition related fees and expenses as a condition precedent to such an agreement. Our management may also agree to invest or loan money to cover such expenses. To date, we have had no discussions with our management or other investors, regarding funding and no funding commitment for future expenses has been obtained. If in the future we need funds to pay expenses, we will consider these and other yet to be identified options for raising funds and/or paying expenses. If our management, or other investors, does not loan to or invest sufficient funds in us, then we will not be able to meet our SEC reporting obligations and will not be able to attract a private company with which to combine.\nWe have no source of revenues and will quickly have a stockholders deficit. These conditions raise substantial doubt about our ability to continue as a going concern. We plan to devote our efforts to locating merger candidates since effectiveness of our registration statement on Form 10, as amended, on September 30, 2021. Our ability to continue as a going concern is dependent upon our ability to develop additional sources of capital, locate and complete a merger with another company, and ultimately, achieve profitable operations.\nThe Company may consider a business which has recently commenced operations, is in need of additional funds for expansion into new products or markets, is seeking to develop a new product or service, or is an established business which may be experiencing financial or operating difficulties and is in need of additional capital. Our management believes that the public company status that results from a combination with the Company will provide such company greater access to the capital markets, increase its visibility in the investment community, and offer the opportunity to utilize its stock to make acquisitions. However, there is no assurance that the Company will have greater access to capital due to its public company status, and therefore a business combination with an operating company in need of additional capital may expose the Company to additional risks and challenges. In the alternative, a business combination may involve the acquisition of, or merger with, a company which does not need substantial additional capital, but which desires to establish a public trading market for its shares, while avoiding, among other things, the time delays, significant expense, and loss of voting control which may occur in a public offering.\nManagement believes there exist numerous private operating businesses seeking the perceived benefits of operating as a publicly registered corporation. Perceived benefits may include increasing equity financing options, providing stock options or similar benefits as incentives to key employees, and achieving liquidity (subject to restrictions of applicable statutes), for all shareholders. Management further believes that certain private operating businesses prefer merging into a publicly registered company so as to eliminate the time and expense of conducting an initial public offering.\nWe have, and will continue to have, no capital with which to provide the owners of business entities with any cash or other assets. However, owners of these private operating businesses will still incur significant legal and accounting costs in connection with the acquisition of a publicly registered corporation, including the costs of preparing Current Reports on Form 8-K, Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q and agreements and related reports and documents. The Exchange Act specifically requires that within four business days of completion of a merger or acquisition transaction with a private operating business, a Current Report on Form 8-K be filed containing Form 10 information regarding the private operating company, including audited financial statements.\nContinuing Operations, Liquidity and Capital Resources\nWe have no known demands or commitments and are not aware of any events or uncertainties as of the date of this report that will result in or that are reasonably likely to materially increase or decrease our current liquidity. We had no material commitments for capital expenditures as of June 30, 2022.\nThe Company currently plans to satisfy its cash requirements for the next 12 months through its current cash and by borrowing from its stockholders. The Company currently expects that money borrowed will be used during the next 12 months to satisfy the Companys operating costs, professional fees and for general corporate purposes. The Company may explore alternative financing sources, although it currently has not done so. However, there is no guarantee that such additional funds will be made available to us or on terms that are favorable to us. If we enter into a business combination with a target entity, we will request the target company to pay the acquisition related fees and expenses as a condition precedent to such an agreement. Our current stockholders may also agree to invest or loan money to cover such expenses. To date, we have had no discussions with our stockholders or other investors, regarding funding and no funding commitment for future expenses has been obtained. If in the future we need funds to pay expenses, we will consider these and other yet to be identified options for raising funds and/or paying expenses. If our current stockholders, or other investors, do not loan to or invest sufficient funds in us, then we will not be able to meet our SEC reporting obligations and will not be able to attract a private company with which to combine.\nThe Company will use its limited personnel and financial resources in connection with seeking new business opportunities, including seeking an acquisition or merger with an operating company. It may be expected that entering into a new business opportunity or business combination will involve the issuance of a substantial number of restricted shares of common stock. If such additional restricted shares of common stock are issued, the shareholders will experience a dilution in their ownership interest in the Company. If a substantial number of restricted shares are issued in connection with a business combination, a change in control may be expected to occur.\nThere are no limitations in the certificate of incorporation on the Companys ability to borrow funds or raise funds through the issuance of capital stock to effect a business combination. The Companys limited resources and lack of recent operating history may make it difficult to borrow funds or raise capital. Such inability to borrow funds or raise funds through the issuance of capital stock required to effect or facilitate a business combination may have a material adverse effect on the Companys financial condition and future prospects, including the ability to complete a business combination. To the extent that debt financing ultimately proves to be available, any borrowing will subject the Company to various risks traditionally associated with indebtedness, including the risks of interest rate fluctuations and insufficiency of cash flow to pay principal and interest, including debt of an acquired business.\nThe Company currently has no plans to conduct any research and development or to purchase or sell any significant equipment. The Company does not expect to hire any employees during the next 12 months.\nOff-Balance Sheet Arrangements\nNone. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nNot applicable. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nReference is made to pages through comprising a portion of this annual report. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNot applicable. ITEM 9A. CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nDisclosure controls are procedures that are designed with the objective of ensuring that information required to be disclosed in our reports filed under the Exchange Act, such as this annual report, is recorded, processed, summarized, and reported within the time period specified in the SECs rules and forms. Disclosure controls are also designed with the objective of ensuring that such information is accumulated and communicated to our management, including the chief executive officer and chief financial officer, as appropriate to allow timely decisions regarding required disclosure. Our management evaluated, with the participation of our current chief executive officer and chief financial officer (our Certifying Officers), the effectiveness of our disclosure controls and procedures as of June 30, 2022, pursuant to Rule 13a-15(b) under the Exchange Act. Based upon that evaluation, our Certifying Officers concluded that, as of June 30, 2022, our disclosure controls and procedures were not effective.\nManagements Report on Internal Control Over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting, as defined under Exchange Act Rules 13a-15(f) and 14d-14(f). Our internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles.\nAll internal control systems, no matter how well designed, have inherent limitations and may not prevent or detect misstatements. Therefore, even those systems determined to be effective can only provide reasonable assurance with respect to financial reporting reliability and financial statement preparation and presentation. In addition, projections of any evaluation of effectiveness to future periods are subject to risk that controls become inadequate because of changes in conditions and that the degree of compliance with the policies or procedures may deteriorate.\nManagement assessed the effectiveness of the Companys internal control over financial reporting as of June 30, 2022. In making the assessment, management used the criteria issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) in Internal Control-Integrated Framework. Based on its assessment, management concluded that, as of June 30, 2022, our Companys internal control over financial reporting was not effective.\nChanges in Internal Control over Financial Reporting\nThere were no changes in our internal control over financial reporting (as such term is defined in Rules 13a-15(f) and 15d-15(f) of the Exchange Act) during the most recent fiscal quarter that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. ITEM 9B. OTHER INFORMATION\nNone.\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nOfficers and Directors\nThe following table sets forth the names and ages of the members of our Board of Directors and our executive officers and the positions held by each. Each directors term continues until his or her successor is elected or qualified at the next annual meeting, unless such director earlier resigns or is removed.\nName\nAge\nPosition\nHoward Gostfrand\nChief Executive Officer and Director\nLaura Anthony\nChief Financial Officer, Secretary and Director\nBiographical information concerning our directors and executive officers listed above is set forth below.\nOur directors are elected to serve until the next annual meeting of shareholders and until their respective successors will have been elected and will have qualified. Officers are not elected for a fixed term of office but hold office until their successors have been elected. Neither of our directors are a party to any arrangement or understanding pursuant to which he/she was or is to be elected as a director. As discussed in the Section Acquisition Opportunities, it is likely that our officers and directors will resign their positions as officers and directors of our Company upon consummation of a merger or acquisition. In light of Mr. Gostfrands and Ms. Anthonys experience as described in this section, we believe they are qualified to act as our director and to assist in the carrying out of our business plan.\nHoward Gostfrand. Mr. Gostfrand has been an officer and director of the Company since June 22, 2021. Howard Gostfrand has been involved in the financial industry for over 26 years. Mr. Gostfrand formed ACV in 1999. As President and Founder of ACV, Mr. Gostfrand has worked closely with hundreds of public companies of various market capitalizations and diversified industries both domestic and international. His experience lies in consulting and guiding small-cap and middle market companies through implemented corporate strategy, investor outreach and financial marketing initiatives. Prior to founding ACV, he was a retail stockbroker focused on small-cap companies, having worked in New York City and South Florida.\nACV is an investor relations and consulting firm focused on assisting small public companies with their approach to the investment community. ACV has represented over 150 companies in diverse industries from all over the country as well as internationally. Mr. Gostfrand has worked closely with management teams and understands the challenges associated with being a small and micro-cap company. Mr. Gostfrand has no intention of acting as the investor relations representative for any company AG Acquisition Group III may complete a transaction with. Rather, his years of experience working with small public companies makes him highly qualified to act as CEO of AG Acquisition Group III.\nMr. Gostfrand is also an owner and managing member of AG Capital, a consulting and advisory firm for small and middle market private and public companies.\nMr. Gostfrand has not been involved in any negative legal proceedings required to be disclosed as enumerated in Item 401(f) of Regulation S-K.\nLaura Anthony. Ms. Anthony has been an officer and director of the Company since June 22, 2021. Ms. Anthony is the founding partner of Anthony L.G., PLLC, which she founded in 2001, a corporate, securities and business transactions law firm and has been practicing law since 1993. Ms. Anthony provides corporate counsel to small-cap and middle market private and public companies. For 28 years, Ms. Anthony has served clients in the areas including but not limited to compliance with Securities Act offer, sale and registration requirements, including private and public offerings; initial public offerings; follow-on offerings and PIPE transactions; compliance with NASDAQ and NYSE American initial and continued listing requirements; compliance with the initial quotation and maintenance of standards for the OTCQB and OTCQX; working with foreign private issuers; Regulation A/A+ offerings; compliance with the registration and reporting requirements under the Exchange Act; mergers and acquisitions; and general contract and business transactions. Ms. Anthony has served on the board of directors of Aditx, Inc. (Nasdaq: ADTX), a biotechnology company, since July 2020.\nMs. Anthony is also an owner and managing member of AG Capital, a consulting and advisory firm for small and middle market private and public companies.\nMs. Anthony has not been involved in any negative legal proceedings as enumerated in Item 401(f) of Regulation S-K either in the past 10 years or ever.\nIn addition, Mr. Gostfrand and Ms. Anthony founded AG Acquisition Group, Inc. (AG I) and AG Acquisition Group II, Inc. (AG II), each of which was organized as a blank check company. AG I is now defunct. AG I did not engage in a business combination with another entity, and did not effect any registered securities offerings. Mr. Gostfrand and Ms. Anthony have no current relationship with AG I.\nUnder Mr. Gostfrands and Ms. Anthonys leadership, on November 8, 2018, AG II entered into a business combination with John Keeler & Co., Inc. (d/b/a Blue Star Foods), Blue Star Acquisition Corp. and John Keeler. Upon closing, Mr. Gostfrand and Ms. Anthony resigned all officer and director positions with AG II. Mr. Gostfrand and Ms. Anthony have no ongoing relationship with AG II (n/k/a Blue Star Foods Corp.), other than as warrant holders. As of October 11, 2022, each of Mr. Gostfrand and Ms. Anthony owns a warrant to purchase 12,500 shares of Blue Star Foods Corp.s common stock at an exercise price of $2.00 per share. Subsequent to the business combination and Mr. Gostfrands and Ms. Anthonys resignations, Blue Star Foods Corp. effected certain registered securities offerings. As part of the business combination, Blue Star Foods Corp. redeemed 4,625,000 shares from each of Mr. Gostfrand and Ms. Anthony. There was no cash or additional consideration paid, directly or indirectly, as part of the business combination or otherwise.\nThere are no family relationships between Mr. Gostfrand and Ms. Anthony.\nBoard Committees and Director Independence\nThe Company has an audit committee, which is currently comprised of Ms. Anthony as the sole member and Chairman of the audit committee. Other than the audit committee, the Companys board of directors has no standing nominating, compensation or any other committees. Rather, our full board of directors performs the functions of these committees. We do not believe it is necessary for our board of directors to appoint such committees because the volume of matters that come before our board of directors for consideration permits the directors to give sufficient time and attention to such matters to be involved in all decision making. Additionally, because our common stock is not listed for trading or quotation on a national securities exchange, we are not required to have such committees. The Company has no qualified financial expert at this time because it has not been able to hire a qualified candidate. Further, the Company believes that it has inadequate financial resources at this time to hire such an expert.\nThe Company is not quoted on any exchange that requires director independence requirements, or any exchange at all at this time nor on OTC Markets. We have not established our own definition for determining whether our director and nominees for directors are independent nor have we adopted any other standard of independence employed by any national securities exchange or inter-dealer quotation system, though our current directors would not be deemed to be independent under any applicable definition given that they are officers of the Company. Our board of directors takes the position that management of a target business will establish its own board of directors; establish its own definition of ‘independent as related to directors and nominees for directors; and establish committees that will be suitable for its operations after the Company consummates a business combination.\nDirector Nominations\nOur full Board of Directors recommends candidates for nomination for election at the annual meeting of the stockholders. We have not formally established any specific, minimum qualifications that must be met or skills that are necessary for directors to possess. In general, in identifying and evaluating nominees for director, the Board of Directors considers educational background, diversity of professional experience, knowledge of our business, integrity, professional reputation, independence, wisdom, and the ability to represent the best interests of our stockholders.\nCode of Ethics\nThe Company has not adopted a code of ethics.\nLimitation on Liability and Indemnification of Officers and Directors\nOur certificate of incorporation provides that our officers and directors will be indemnified by us to the fullest extent authorized by Delaware law, as it now exists or may in the future be amended. In addition, our certificate of incorporation provides that our directors will not be personally liable for monetary damages to us for breaches of their fiduciary duty as directors, except to the extent such exemption from liability or limitation thereof is not permitted by the Delaware General Corporation Law (DGCL).\nOur certificate of incorporation also permit us to maintain insurance on behalf of any officer, director or employee for any liability arising out of his or her actions, regardless of whether Delaware law would permit such indemnification. We have purchased a policy of directors and officers liability insurance that insures our officers and directors against the cost of defense, settlement or payment of a judgment in some circumstances and insures us against our obligations to indemnify our officers and directors.\nThese provisions may discourage stockholders from bringing a lawsuit against our directors for breach of their fiduciary duty. These provisions also may have the effect of reducing the likelihood of derivative litigation against officers and directors, even though such an action, if successful, might otherwise benefit us and our stockholders. Furthermore, a stockholders investment may be adversely affected to the extent we pay the costs of settlement and damage awards against officers and directors pursuant to these indemnification provisions.\nWe believe that these provisions and the insurance are necessary to attract and retain talented and experienced officers and directors. ITEM 11. EXECUTIVE COMPENSATION\nNo executive compensation had been paid by the Company since inception. The Company has no employment agreements with any of its officers and directors.\nThere are no outstanding options, warrants or equity awards.\nSummary Compensation Table\nThe following summary compensation table provides information regarding the compensation paid during our fiscal years ended June 30, 2022 and 2021 to our executive officers, who we collectively refer to as our named executive officers.\nName and Position Year Salary ($) Bonus ($) Stock\nAwards\n($) Option\nAwards\n($) Non-\nEquity\nIncentive\nPlan\nCompensation\n($) Non-\nqualified\nDeferred\nCompensation\nEarnings\n($) All\nOther\nCompensation\n($) Total\n($)\nHoward Gostfrand - - - - - - - -\nChief Executive Officer - - - - - - - -\nLaura Anthony - - - - - - - -\nChief Financial Officer - - - - - - - -\nManagement will not receive any finders fee, either directly or indirectly, as a result of their efforts to implement the Companys business plan outlined herein.\nIt is possible that, after the Company successfully consummates a business combination with an unaffiliated entity, that entity may desire to employ or retain one or a number of members of our management for the purposes of providing services to the surviving entity. However, the Company has adopted a policy whereby the offer of any post-transaction employment to members of management will not be a consideration in our decision whether to undertake any proposed transaction.\nCompensation of Directors\nThe Companys directors are not compensated for their services as directors of the Company. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe following table sets forth information regarding the beneficial ownership of our common stock as of October 11, 2022 by:\n● each person known by us to be the beneficial owner of more than 5% of our outstanding shares of common stock;\n● each of our executive officers and directors that beneficially owns shares of our common stock; and\n● all our executive officers and directors as a group.\nIn the table below, percentage ownership is based on 10,000,000 shares of our common stock issued and outstanding as of October 11, 2022. Unless otherwise noted below, the address for each beneficial owner listed on the table is c/o AG Acquisition Group III, Inc., 625 N. Flagler Drive, Suite 600, West Paul Beach, FL 33401. We have determined beneficial ownership in accordance with the rules of the SEC. We believe, based on the information furnished to us, that the persons and entities named in the tables below have sole voting and investment power with respect to all shares of common stock that they beneficially own, subject to applicable community property laws.\nName and Address of Beneficial Owner Number and\nNature of\nShares Beneficially\nOwned\nPercentage of Outstanding Common Stock (1)\nNamed Executive Officers and Directors:\nHoward Gostfrand 5,000,000 (2) 50.0 %\nLaura Anthony 5,000,000 (3) 50.0 %\nAll executive officers and directors as a group (2 persons) 10,000,000 100.0 %\nGreater than 5% Stockholders:\nAmerican Capital Ventures, Inc.\n625 N. Flagler Drive, Suite 600\nWest Palm Beach, FL 33401 (4) 5,000,000 (2) 50.0 %\nLeone Group, LLC\n625 N. Flagler Drive, Suite 600\nWest Palm Beach, FL 33401 (5) 5,000,000 (3) 50.0 %\n(1) The percentages in the table have been calculated based on 10,000,000 shares of our common stock outstanding on October 11, 2022. To calculate a stockholders percentage of beneficial ownership, we include in the numerator and denominator the common stock outstanding and all shares of our common stock issuable to that person in the event of the exercise of outstanding options and other derivative securities owned by that person which are exercisable within 60 days of October 11, 2022. Stock options and derivative securities held by other stockholders are disregarded in this calculation. Therefore, the denominator used in calculating beneficial ownership among our stockholders may differ. Unless we have indicated otherwise, each person named in the table has sole voting power and sole investment power for the shares listed opposite such persons name.\n(2) Represents shares held by American Capital Ventures, Inc. Mr. Gostfrand, Chief Executive Officer and Director of the Company, is sole owner of American Capital Ventures, Inc. and has sole voting and dispositive power over such shares.\n(3) Represents shares held by Leone Group, LLC. Ms. Anthony, Chief Financial Officer and Director of the Company, is sole owner of Leone Group, LLC and has sole voting and dispositive power over such shares.\n(4) Mr. Gostfrand is sole owner of American Capital Ventures, Inc.\nThere are no arrangements that may result in a change of control of the Company.\nSecurities Authorized for Issuance under Equity Compensation Plans\nThe following table provides information as of June 30, 2022, regarding our compensation plans under which equity securities are authorized for issuance:\nPlan category Number of\nsecurities to\nbe issued\nupon\nexercise of\noutstanding\noptions, warrants and rights Weighted-average\nexercise\nprice of\noutstanding\noptions, warrants and rights Number of securities\nremaining\navailable\nfor future\nissuance\nunder equity\ncompensation\nplans (excluding\nsecurities\nreflected\nin column (a))\n(a) (b) (c)\nEquity compensation plans approved by security holders - $ - -\nEquity compensation plans not approved by security holders - - -\nTotal - $ - - ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nPolicies and Procedures for Related Party Transactions\nUnder Item 404 of SEC Regulation S-K, a related person transaction is any actual or proposed transaction, arrangement or relationship or series of similar transactions, arrangements or relationships, including those involving indebtedness not in the ordinary course of business, to which we or our subsidiaries were or are a party, or in which we or our subsidiaries were or are a participant, in which the amount involved exceeded or exceeds the lesser of $120,000 or 1% of the average of our total assets at year-end for the last two completed fiscal years and in which any of our directors, nominees for director, executive officers, beneficial owners of more than 5% of any class of our voting securities (a significant shareholder), or any member of the immediate family of any of the foregoing persons, had or will have a direct or indirect material interest.\nWe recognize that transactions between us and any of our directors or executives or with a third party in which one of our officers, directors or significant shareholders has an interest can present potential or actual conflicts of interest and create the appearance that our decisions are based on considerations other than the best interests of our Company and stockholders.\nOur Audit Committee is charged with responsibility for reviewing, approving and overseeing any transaction between the Company and any related person (as defined in Item 404 of Regulation S-K), including the propriety and ethical implications of any such transactions, as reported or disclosed to the Audit Committee by the independent auditors, employees, officers, members of the Board of Directors or otherwise, and to determine whether the terms of the transaction are not less favorable to us than could be obtained from an unaffiliated party.\nFrom time to time, we engage in transactions with related parties. The following is a summary of the related party transactions during the fiscal years ended June 30, 2022 and 2021, and any proposed transactions, requiring disclosure pursuant to Item 404 of Regulation S-K.\nEffective June 22, 2021, the Company issued a total of 10,000,000 shares of the Companys common stock to entities owned and controlled by the Companys two officers and directors. The shares were issued for $0.0004 per share, for a total of $4,000.\nAs of June 30, 2022 and 2021, entities owned and controlled by Mr. Gostfrand and Ms. Anthony, the Companys sole officers and directors, have provided the Company with its only cash for operations. That is, entities owned and controlled by the Companys sole officers and directors purchased a total of 10,000,000 shares of the Companys common stock for a total of $18,500.\nThe Company uses the office address of Ms. Anthony, an officer and director, without charge. Ms. Anthony has also provided legal services to the Company since inception and through June 30, 2022, without charge.\nBoth Mr. Gostfrand and Ms. Anthony may be considered as promoters as that term is defined by Rule 405 of Regulation C. Neither Ms. Anthony nor Mr. Gostfrand has any agreements with the Company to receive directly or indirectly, anything of value in the future.\nMs. Anthony is corporate and securities counsel to the Company. Ms. Anthony has been providing legal services without charge to the Company but is under no obligation to continue to do so.\nThe Company does not have any outside directors.\nDirector Independence\nThe Company is not quoted on any exchange that requires director independence requirements, or any exchange at all at this time nor on OTC Markets. We have not established our own definition for determining whether our director and nominees for directors are independent nor have we adopted any other standard of independence employed by any national securities exchange or inter-dealer quotation system, though our current directors would not be deemed to be independent under any applicable definition given that they are officers of the Company.\nCommittees\nThe Company has an audit committee, which is currently comprised of Ms. Anthony as the sole member and Chairman of the audit committee. Other than the audit committee, the Companys board of directors has no standing nominating, compensation or any other committees. Rather, our full board of directors performs the functions of these committees. We do not believe it is necessary for our board of directors to appoint such committees because the volume of matters that come before our board of directors for consideration permits the directors to give sufficient time and attention to such matters to be involved in all decision making. Additionally, because our common stock is not listed for trading or quotation on a national securities exchange, we are not required to have such committees. The Company has no qualified financial expert at this time because it has not been able to hire a qualified candidate. Further, the Company believes that it has inadequate financial resources at this time to hire such an expert.\nOur board of directors takes the position that management of a target business will establish its own board of directors; establish its own definition of ‘independent as related to directors and nominees for directors; and establish committees that will be suitable for its operations after the Company consummates a business combination.\nCode of Ethics\nThe Company does not currently have a code of ethics adopted. ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES\nD. Brooks and Associates CPAs, P.A. acts as our independent registered public accounting firm. The following is a summary of fees paid or to be paid to D. Brooks and Associates CPAs, P.A. for the fiscal years ended June 30, 2022 and 2021.\nFiscal Year Ended June 30,\nAudit Fees $ 12,500 $ 5,000\nAudit Related Fees - -\nTax Fees - -\nAll Other Fees - -\nTotal $ 12,500 $ 5,000\nAudit Fees. Audit fees consist of fees billed for professional services rendered for the audit of our year-end financial statements and services that are normally provided by our independent registered public accounting firm in connection with regulatory filings. The above amounts include interim procedures and audit fees, as well as attendance at Board meetings, as applicable.\nAudit-Related Fees. Audit-related services consist of fees billed for assurance and related services that are reasonably related to performance of the audit or review of our financial statements and are not reported under Audit Fees. These services include attest services that are not required by statute or regulation and consultations concerning financial accounting and reporting standards.\nTax Fees. Tax fees consist of fees billed for tax planning services and tax advice. The board of directors must specifically approve all other tax services.\nAll Other Fees. Other services are services provided by the independent registered public accounting firm that do not fall within the established audit, audit-related, and tax services categories. The board of directors preapproves specified other services that do not fall within any of the specified prohibited categories of services.\nPre-Approval Policy\nAll of the foregoing services were pre-approved by our audit committee. Our audit committee will pre-approve all auditing services and permitted non-audit services to be performed for us by our auditors, including the fees and terms thereof (subject to the de minimis exceptions for non-audit services described in the Exchange Act which are approved by the audit committee prior to the completion of the audit).\nPART IV ITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n(a) The following documents are filed as part of this annual report:\n(1) Financial Statements\nSee Index to Financial Statements on page.\n(2) Financial Statements Schedules\nAll financial statements schedules are omitted because they are not applicable or the amounts are immaterial and not required, or the required information is presented in the financial statements and notes thereto beginning on page of this annual report.\n(3) Exhibits\nWe hereby file as part of this annual report the exhibits listed in the Exhibit Index below. Exhibits which are incorporated herein by reference can be inspected and copied at the public reference facilities maintained by the SEC, 100 F Street, N.E., Room 1580, Washington, D.C. 20549. Copies of such material can also be obtained from the Public Reference Section of the SEC, 100 F Street, N.E., Washington, D.C. 20549, at prescribed rates or on the SEC website at www.sec.gov.\nEXHIBIT INDEX\nExhibit No.\nExhibit\n3.1\nCertificate of Incorporation of the registrant (incorporated by reference to Exhibit 3.1 to the registrants registrant statement on Form 10 (File No. 000-56326), filed with the SEC on August 13, 2021).\n3.2\nCertificate of Designations for Series A Preferred Stock (incorporated by reference to Exhibit 3.2 to the registrants registrant statement on Form 10 (File No. 000-56326), filed with the SEC on August 13, 2021).\n3.3\nBylaws of the registrant (incorporated by reference to Exhibit 3.3 to the registrants registrant statement on Form 10 (File No. 000-56326), filed with the SEC on August 13, 2021).\n31.1*\nRule 13a-14(a) Certification of Principal Executive Officer\n31.2*\nRule 13a-14(a) Certification of Principal Financial Officer\n32.1**\nCertification Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002, of Principal Executive Officer and Principal Financial Officer\n101.INS*\nInline XBRL Instance Document\n101.SCH*\nInline XBRL Taxonomy Extension Schema Document\n101.CAL*\nInline XBRL Taxonomy Extension Calculation Linkbase\n101.DEF*\nInline XBRL Taxonomy Extension Definition Linkbase\n101.LAB*\nInline XBRL Taxonomy Extension Labels Linkbase\n101.PRE*\nInline XBRL Taxonomy Extension Presentation Linkbase\n104*\nCover Page Interactive Data File (embedded within the Inline XBRL document)\n* Filed herewith\n**Furnished herewith\nItem 16. Form 10-K Summary\nNot applicable.\nAG ACQUISITION GROUP III, INC.\nReport of Independent Registered Public Accounting Firm (PCAOB ID No. 4048)\nBalance Sheets as of June 30, 2022 and 2021\nStatements of Operations for the year ended June 30, 2022 and the period from June 22, 2021 (inception) through June 30, 2021\nStatements of Changes in Stockholders Equity for the period from June 22, 2021 (inception) through June 30, 2021 and the year ended June 30, 2022\nStatements of Cash Flows for the year ended June 30, 2022 and the period from June 22, 2021 (inception) through June 30,\nNotes to Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and\nStockholders of AG Acquisition Group III, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of AG Acquisition Group III, Inc. (the Company) as of June 30, 2022 and 2021, and the related statements of operations, stockholders equity, and cash flows for the year ended June 30, 2022 and for the period from June 22, 2021 (Inception) through June 30, 2021, and the related notes to the financial statements (collectively referred to as the financial statements).\nIn our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of June 30, 2022 and 2021, and the results of its operations and its cash flows for the year ended June 30, 2022 and for the period from June 22, 2021 (Inception) through June 30, 2021, in conformity with accounting principles generally accepted in the United States of America.\nSubstantial Doubt Regarding Going Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 3 to the financial statements, the Company has incurred operating losses, has incurred negative cash flows from operations and has an accumulated deficit. These and other factors raise substantial doubt about the Companys ability to continue as a going concern. Managements plan regarding these matters is also described in Note 3 to the financial statements. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nCritical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. We determined that there were no critical audit matters.\nD. Brooks and Associates CPAs, P.A.\nWe have served as the Companys auditor since 2021.\nPalm Beach Gardens, Florida\nOctober 11, 2022\nAG Acquisition Group III, Inc.\nBalance Sheets\nAs of June 30, 2022 and 2021\nJune 30, 2022 June 30, 2021\nASSETS\nCURRENT ASSETS:\nCash $ 710 $ 1,000\nOther current assets - 5,000\nTotal current assets $ 710 $ 6,000\nTotal Assets $ 710 $ 6,000\nLIABILITIES AND STOCKHOLDERS EQUITY\nCurrent Liabilities $ - $ -\nTotal Liabilities $ - $ -\nCOMMITMENTS AND CONTINGENCIES - -\nSTOCKHOLDERS EQUITY:\nPreferred stock, $0.0001 par value: 5,000,000 shares authorized; none issued and outstanding -\n-\nCommon stock, $0.0001 par value: 100,000,000 shares authorized; 10,000,000 shares issued and outstanding 1,000 1,000\nAdditional paid in capital 17,500 5,000\nAccumulated deficit (17,790 ) -\nTotal Stockholders Equity $ 710 $ 6,000\nTotal Liabilities and Stockholders Equity $ 710 $ 6,000\nSee accompanying notes to the financial statements.\nAG Acquisition Group III, Inc.\nStatements of Operations\nFor the Year Ended June 30, 2022 and the Period from June 22, 2021 (Inception) through June 30, 2021\nRevenue $ - $ -\nCosts and Expenses:\nGeneral and administrative - professional fees 17,790 -\nLoss from operations before income taxes $ (17,790 ) $ -\nIncome tax provision $ - $ -\nNet Loss $ (17,790 ) $ -\nBasic and diluted loss per share:\nBasic and diluted loss per share $ - $ -\nBasic and diluted weighted average shares outstanding 10,000,000 10,000,000\nSee accompanying notes to the financial statements.\nAG Acquisition Group III, Inc.\nStatements of Changes in Stockholders Equity\nFor the Period from June 22, 2021 (Inception) through June 30, 2021 and the Year Ended June 30, 2022\nNumber of\nPaid-in Accumulated Total\nShares Amount Capital Deficit Stockholders Equity\nBalance, June 22, 2021 (Inception) - $ - $ - $ - $ -\nCommon stock issued to founders for cash 10,000,000 1,000 5,000 - 6,000\nNet loss - - - - -\nBalance, June 30, 2021 10,000,000 1,000 5,000 - 6,000\nCapital Contributions - - 12,500 - 12,500\nNet Loss - - - (17,790 ) (17,790 )\nBalance, June 30, 2022 10,000,000 $ 1,000 $ 17,500 $ (17,790 ) $ 710\nSee accompanying notes to the financial statements.\nAG Acquisition Group III, Inc.\nStatements of Cash Flows\nFor the Year Ended June 30, 2022 and the Period from June 22, 2021 (Inception) through June 30, 2021\nCash flows from Operating Activities:\nNet Loss $ (17,790 ) $\n-\nDecrease (increase) in prepaid expenses and other assets 5,000 (5,000\n)\nCash used in operating activities (12,790 ) (5,000\n)\nCash flows from financing activities:\nProceeds from contributions from stockholders - 6,000\nCapital contributions from stockholders 12,500 -\nCash provided by financing activities 12,500 6,000\nNet (decrease) increase in cash (290 ) 1,000\nCash - beginning of period 1,000 -\nCash - end of period $ 710 $\n1,000\nSupplemental cash information:\nInterest paid in cash $ - -\nTaxes paid in cash $ - -\nSee accompanying notes to the financial statements.\nAG ACQUISITION GROUP III, INC.\nNotes to Financial Statements\nJune 30, 2022\nNOTE 1 - ORGANIZATION AND NATURE OF OPERATIONS\nAG Acquisition Group III, Inc. (the Company) was incorporated in the State of Delaware on June 22, 2021 and established a fiscal year end of June 30. The Company was formed to engage in any lawful business. The Companys activities since formation have been limited to issuing shares to its founding stockholders for cash and setting up its corporate entity. The Companys initial business plan is to seek and engage in an as of yet unidentified merger or acquisition. The Company will not restrict its search to any specific business, industry, or geographical location and the Company may participate in a business venture of virtually any kind or nature. This discussion of the proposed business is purposefully general and is not meant to be restrictive of the Companys virtually unlimited discretion to search for and enter into potential business opportunities. The Company has been formed to provide a method for a foreign or domestic private company to become a reporting company with a class of securities registered under the Securities Exchange Act of 1934, as amended.\nNOTE 2 - BASIS OF PRESENTATION AND SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nThe accompanying financial statements have been prepared in accordance with accounting principles generally accepted in the United States of America (U.S. GAAP) and the rules and regulations of the United States Securities and Exchange Commission (the SEC). The financial statements and accompanying notes are the representations of the Companys management, who are responsible for their integrity and objectivity. The Company has not earned any revenue from operations since inception.\nUSE OF ESTIMATES\nThe preparation of financial statements in conformity with U.S. GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements, and the reported amounts of revenues and expenses during the reporting periods. Actual results could differ from those estimates.\nCASH AND CASH EQUIVALENTS\nCash and cash equivalents include cash on hand and on deposit at banking institutions as well as all highly liquid short-term investments with original maturities of 90 days or less. The Company had $710 of cash as of June 30, 2022.\nINCOME TAXES\nUnder the Financial Accounting Standards Boards (FASB) Accounting Standards Codification (ASC) 740, Income Taxes, deferred tax assets and liabilities are recognized for the future tax consequences attributable to temporary differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. Valuation allowances are established when it is more likely than not that some or all of the deferred tax assets will not be realized. As of June 30, 2022 and 2021, there were no deferred taxes due to the uncertainty of the realization of net operating loss or carry forward prior to expiration.\nINCOME (LOSS) PER COMMON SHARE\nBasic income (loss) per common share excludes dilution and income (loss) is computed by dividing net income (loss) by the weighted average number of common shares outstanding during the period. Diluted income (loss) per common share reflect the potential dilution that could occur if securities or other contracts to issue common stock were exercised or converted into common stock or resulted in the issuance of common stock that then shared in the loss of the entity. During the fiscal year ended June 30, 2022 and the period from June 22, 2021 (inception) through June 30, 2021, there were no outstanding dilutive securities.\nFAIR VALUE OF FINANCIAL INSTRUMENTS\nThe fair value of the Companys assets and liabilities, which qualify as financial instruments under the FASB ASC 820, Fair Value Measurements and Disclosures, approximates the carrying amounts represented in the balance sheet, primarily due to its short-term nature.\nRECENT ACCOUNTING PRONOUNCEMENTS\nRecent accounting pronouncements issued by the FASB (including its Emerging Issues Task Force) and the SEC did not or are not believed by management to have a material impact on the Companys present or future financial statements.\nNOTE 3 - GOING CONCERN\nSince the inception of the Company and during the fiscal year ended June 30, 2022, the Company did not generate cash or revenue. During the fiscal year ended June 30, 2022, the Company incurred a loss of $17,790 and used net cash in operations of $12,790. The Company had working capital of $710 as of June 30, 2022. The Companys continuation as a going concern is dependent on its ability to obtain additional financing from its stockholders or other sources, as may be required, to meet is financial obligations as they become due.\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern; however, the above condition raises substantial doubt about the Companys ability to do so. The financial statements do not include any adjustments to reflect the possible future effects on the recoverability and classification of assets or the amounts and classifications of liabilities that may result should the Company be unable to continue as a going concern. The Company currently has no commitments for the purchase of its equity. If the Company is unable to acquire additional working capital, it may not be able to execute its business plan.\nNOTE 4 - STOCKHOLDERS EQUITY\nEffective June 22, 2021, the Company issued a total of 10,000,000 shares of common stock to entities owned and controlled by the Companys two officers and directors. The shares were issued for $0.0004 per share for a total of $4,000. The Company is authorized to issue 100,000,000 shares of common stock, par value $0.0001 per share, and 5,000,000 shares of preferred stock, par value $0.0001 per share. The Company has designated 1,000,000 shares as Series A Preferred Stock. Each share of Series A Preferred Stock is entitled to 1,000 votes on any matter submitted to the holders of common stock. The Series A Preferred Stock is not convertible and is not entitled to dividends.\nAs of June 30, 2022, there are 10,000,000 shares of common stock and no shares of preferred stock issued and outstanding.\nNOTE 5 - RELATED PARTY TRANSACTIONS\nSince inception, entities owned and controlled by the Companys sole officers and directors have provided the Company with its only cash for operations. That is, entities owned and controlled by the Companys sole officers and directors purchased a total of 10,000,000 shares of common stock for a total of $6,000 during the period ended June 30, 2021 and have provided additional paid in capital contributions of $17,790 for working capital purposes of $12,500 during the fiscal year ended June 30, 2022.\nThe Company uses the office address of an officer and director, without charge. The same officer has also provided legal services to the Company since inception and through June 30, 2022, without charge.\nNOTE 6 - INCOME TAXES\nThe Company accounts for income taxes using the asset and liability method. Deferred income taxes are recognized for the tax consequences of temporary differences by applying enacted statutory rates to differences between the financial statement carrying amounts and tax bases of existing assets and liabilities. Deferred tax assets and liabilities are adjusted for the effects of changes in tax laws and rates on the date of enactment. The Company provides a valuation allowance for deferred tax assets, when required, based on evaluation of the realizability of such deferred tax assets.\nThe tax effects of the significant temporary differences representing deferred assets (liabilities) for the year ended June 30, 2022 and the period from June 22, 2021 (Inception) through June 30, 2021:\nSCHEDULE OF DEFERRED ASSETS AND LIABILITIES\nYear Ended\nJune 30, 2022 Period from June 22, 2021 (Inception) through\nJune 30, 2021\nNet operating loss $ 3,735 $ -\nValuation allowance (3,735 ) -\nNet deferred income tax asset $ - $ -\nAs of June 30, 2022, the Company has net operating losses of approximately $18,000 available to offset future taxable income, subject to annual limitations.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nAG ACQUISITION GROUP III, INC.\nDated: October 11, 2022 By: /s/ Laura Anthony\nLaura Anthony\nChief Financial Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/ Howard Gostfrand\nChief Executive Officer and Director (principal executive officer)\nOctober 11, 2022\nHoward Gostfrand\n/s/ Laura Anthony\nChief Financial Officer and Director (principal financial officer and principal accounting officer)\nOctober 11, 2022\nLaura Anthony"
}