{
    "cik": "1875746",
    "company": "Entertainment Holdings, Inc./OK",
    "filing_type": "10-K",
    "filing_date": "2022-12-16",
    "period_of_report": "2022-06-30",
    "sic": "6770",
    "state_of_inc": "OK",
    "state_location": "UT",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1875746/0001096906-22-002999-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1875746/000109690622002999/xrxh-20220630.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1875746/0001096906-22-002999.txt",
    "filename": "1875746_10K_2022_0001096906-22-002999.htm",
    "content": "ITEM 1: DESCRIPTION OF BUSINESS\nOur Company\nEntertainment Holdings, Inc., an Oklahoma corporation, (XRXH, we,\" \"us,\" our, or Company) is a publicly quoted shell company seeking to create value for its shareholders by merging with another entity with experienced management and opportunities for growth in return for shares of our common stock.\nNo potential merger candidate has been identified at this time.\nWe do not propose to restrict our search for a business opportunity to any particular industry or geographical area and may, therefore, engage in essentially any business in any industry. We have unrestricted discretion in seeking and participating in a business opportunity, subject to the availability of such opportunities, economic conditions, and other factors.\nThe selection of a business opportunity in which to participate is complex and risky. Additionally, we have only limited resources and may find it difficult to locate good opportunities. There can be no assurance that we will be able to identify and acquire any business opportunity which will ultimately prove to be beneficial to us and our shareholders. We will select any potential business opportunity based on our management's best business judgment.\nOur activities are subject to several significant risks, which arise primarily as a result of the fact that we have no specific business and may acquire or participate in a business opportunity based on the decision of management, which potentially could act without the consent, vote, or approval of our shareholders. The risks faced by us are further increased as a result of our lack of resources and our inability to provide a prospective business opportunity with significant capital.\nYou may read and copy any materials we file with the SEC in the SECs Public Reference Section, Room 1580, 100 F Street N.E., Washington, D.C. 20549. You may obtain information on the operation of the Public Reference Section by calling the SEC at 1-800-SEC-0330. Additionally, the SEC maintains an Internet site that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC, which can be found at http://www.sec.gov.\nJumpstart Our Business Startups Act\nWe qualify as an emerging growth company as defined in Section 101 of the Jumpstart our Business Startups Act (JOBS Act) as we did not have more than $1,000,000,000 in annual gross revenue and did not have such amount as of June 30, 2021, our last fiscal quarter.\nWe may lose our status as an emerging growth company on the last day of our fiscal year during which (i) our annual gross revenue exceeds $1,000,000,000 or (ii) we issue more than $1,000,000,000 in non-convertible debt in a three-year period. We will lose our status as an emerging growth company if at any time we are deemed to be a large accelerated filer. We will lose our status as an emerging growth company on the last day of our fiscal year following the fifth anniversary of the date of the first sale of common equity securities pursuant to an effective registration statement.\nAs an emerging growth company, we may take advantage of specified reduced reporting and other burdens that are otherwise applicable to generally reporting companies. These provisions include:\n-\nA requirement to have only two years of audited financial statement and only two years of related Management Discussion and Analysis Disclosures:\n-\nReduced disclosure about the emerging growth companys executive compensation arrangements; and\n-\nNo non-binding advisory votes on executive compensation or golden parachute arrangements.\nAs an emerging growth company, we are exempt from Section 404(b) of the Sarbanes-Oxley Act of 2002 and Section 14A(a) and (b) of the Securities Exchange Act of 1934. Such sections are provided below:\nSection 404(b) of the Sarbanes-Oxley Act of 2002 requires a public companys auditor to attest to, and report on, managements assessment of its internal controls.\nSections 14A(a) and (b) of the Securities and Exchange Act, implemented by Section 951 of the Dodd-Frank Act, require companies to hold shareholder advisory votes on executive compensation and golden parachute compensation.\nWe have already taken advantage of these reduced reporting burdens in this registration statement, which are also available to us as a smaller reporting company as defined under Rule 12b-2 of the Securities Exchange Act of 1934, as amended (the Exchange Act).\nAs long as we qualify as an emerging growth company, we will not be required to comply with the requirements of Section 404(b) of the Sarbanes-Oxley Act of 2002 and Section 14A(a) and (b) of the Securities Exchange Act of 1934.\nIn addition, Section 107 of the JOBS Act also provides that an emerging growth company can take advantage of the extended transition period provided in Section 7(a)(2)(B) of the Securities Act of 1933, as amended (the Securities Act) for complying with new or revised accounting standards.\nOur History\nOur predecessor issuer was incorporated on June 15, 1998, as XRX International Entertainment Holding Group, Inc. and continued under that name until June 30, 2021.\nReorganization Activities:\nDomiciliary Merger: On June 14, 2021, the predecessor issuer, XRX International Entertainment Holding Group, Inc. of Florida, completed a domiciliary merger into Traveler Holdings, Inc. of Oklahoma, with the Oklahoma company being the survivor under the name Traveler Holdings, Inc.\nHolding Company Parent/Subsidiary Formation: On June 30, 2021, Entertainment Holdings, Inc. an Oklahoma Corporation became the parent/successor issuer pursuant to Section 1081(g) of the Oklahoma General Corporation Act under an executed agreement titled Agreement and Plan of Reorganization (Parent Subsidiary Formation) which was executed by Traveler Holdings, Inc. (OK), Entertainment Holdings, Inc. (OK), and Expedition Holdings, Inc. (OK). Under the terms of the Agreement, Traveler Holdings, Inc. (OK) merged into Expedition Holdings, Inc. (OK) and Traveler Holdings, Inc. (OK). ceased to exist, wherein Expedition Holdings, Inc. (OK) became the survivor and successor under Section 1088 of the Oklahoma Act, having acquired all of Traveler Holdings, Inc.s (OK) assets, rights financial statements, obligations, and liabilities as the constituent or resulting corporation. Entertainment Holdings, Inc. (OK) became the parent and the holding company of Expedition Holdings, Inc. (OK) under the Parent Subsidiary Formation which was in compliance with Section 1081(g) of the Oklahoma General Corporation Act.\nUpon consummation of the Parent Subsidiary Formation, each issued and outstanding equity of the former Traveler Holdings, Inc. (OK) was transmuted into and represented the identical equity structure of XRX International Entertainment Holding Group, Inc. (FL) that existed prior to the domiciliary change and immediately prior to the Reorganization (on a share-for-share basis) having the same designations, rights, powers and preferences, and qualifications, limitations and restrictions. Upon consummation of the Agreement, Entertainment Holdings, Inc. (OK), was the issuer since the former Traveler Holdings, Inc. (OK) equity structure was transmuted pursuant to Section 1081(g) as the current issued and outstanding equities of Entertainment Holdings, Inc. (OK). The subsidiary, Expedition Holdings, Inc. was divested on June 30, 2021 and therefore is no longer consolidated into Entertainment Holdings, Inc. The shareholders of the Company became the shareholders of the former XRX International Entertainment Holding Group, Inc. (FL).\nAs a result of this reorganization, the resulting reorganized Company name became Entertainment Holdings, Inc. (XRXH Company, we, or us).\nThe Companys fiscal year ending is June 30. ITEM 1A: RISK FACTORS\nWe need to find financing for our business idea which is uncertain and risky.\nOur plan of operation is to obtain debt or equity finance to meet our ongoing operating expenses and attempt to merge with another entity with experienced management and opportunities for growth in return for shares of our common stock to create value for our shareholders. There can be no assurance that any of the events can be successfully completed, that any such business will be identified or that any stockholder will realize any return on their shares after such a transaction has been completed. In particular, there is no assurance that any such business will be located or that any stockholder will realize any return on their shares after such a transaction. Any merger or acquisition completed by us can be expected to have a significant dilutive effect on the percentage of shares held by our current stockholders.\nWe believe we are an insignificant participant among the firms which engage in the acquisition of business opportunities. There are many established venture capital and financial concerns that have significantly greater financial and personnel resources and technical expertise than we have. In view of our limited financial resources and limited management availability, we will continue to be at a significant competitive disadvantage compared to our competitors.\nYou should be aware that there are various risks associated with our business, including the risks discussed below. You should carefully consider these risk factors, as well as the other information contained in this Registration Statement, in evaluating our business and us.\nRather than our previous operating business, our business is now to seek to raise the debt and/or equity to meet our ongoing operating expenses and attempt to merge with another entity with experienced management and opportunities for growth in return for shares of our common stock to create value for our shareholders. There can be no assurance that this series of events will be successfully completed or that any stockholder will realize any return on their shares after the new business plan has been implemented.\nRISKS RELATED TO OUR COMPANY\nALTHOUGH WE HAVE NOT INCURRED SIGNIFICANT LOSSES, WE ANTICIPATE FUTURE LOSSES\nAs of June 30, 2022, we had an accumulated deficit and total stockholders deficit of $0.\nFuture losses are likely to occur as, until we are able to merge with another entity with experienced management and opportunities for growth in return for shares of our common stock to create value for our shareholders as we have no sources of income to meet our operating expenses. Our auditor's going concern opinion and the notation in the financial statements indicate that we do not have significant cash or other material assets and that we are relying on advances from stockholders, officers and directors to meet our limited operating expenses. We are insolvent in that we are unable to pay our debts in the ordinary course of business as they become due.\nRISKS RELATED TO OUR SECURITIES\nRULE 144 SALES IN THE FUTURE MAY HAVE A DEPRESSIVE EFFECT ON OUR STOCK PRICE.\nAll of the outstanding shares of common stock held by our present officers, directors, and affiliate stockholders are \"restricted securities\" within the meaning of Rule 144 under the Securities Act of 1933, as amended. We are a shell company as defined by the Securities Act, and therefore the resale provisions of Rule 144 are unavailable to our restricted securities.\nOUR STOCK IS NOT ACTIVELY LISTED ON ANY EXHANGE OR OTC MARKETS\nThe Companys common stock is listed on the OTC Markets Expert tier under the ticker XRXH. Currently, the Company has a dark or defunct warning from OTC Markets and there is only a limited, sporadic, and volatile market for our unsolicited stock on the OTC.\nLOSS OF CONTROL BY OUR PRESENT MANAGEMENT AND STOCKHOLDERS MAY OCCUR UPON ISSUANCE OF ADDITIONAL SHARES.\nWe may issue further shares as consideration for the cash or assets or services out of our authorized but unissued common stock that would, upon issuance, represent a majority of our voting power and equity. The result of such an issuance would be those new stockholders and management would control us, and persons unknown could replace our management at this time. Such an occurrence would result in a greatly reduced percentage of ownership of us by our current Shareholders.\nIF THE REGISTRATION OF OUR COMMON STOCK IS REVOKED IN THE FUTURE, OUR BUSINESS OPPORTUNITIES WILL CEASE TO EXIST\nIn the event our securities registration was to be revoked, we would not have the ability to raise money through the issuance of shares and would lose the ability to continue the business plan set out in this filing. Common stock issued and outstanding at that time would no longer be tradable.\nWE DO NOT ANTICIPATE PAYING CASH DIVIDENDS ON OUR COMMON STOCK\nWe do not anticipate paying any cash dividends on our common stock in the foreseeable future.\nLOSS OF SECURITIES REGISTRATION EXEMPTION\nAlthough we believe the exemptions utilized in relation to the disclosure of recent unregistered sales included in Item 10 to be applicable under Securities and Exchange Commission interpretations, should these exemptions be determined to not apply, the Company may be subject to civil and criminal liability as provided in the Securities Act. Furthermore, any loss of exemption or determination of a lack of an applicable exemption to the unregistered sales of the Companys securities may adversely affect the Company in relation to the issuance and the resale of stock. At such time, the Company may be required to registered said securities, and any such violation of the Act could subject the Company to material adverse consequences including, the loss of your investment, the loss of the Companys ability to register any securities in the future, or the ability to comply with any reporting requirements. ITEM 1B: UNRESOLVED STAFF COMMENTS\nNot applicable. ITEM 2: PROPERTIES\nWe do not own or lease any properties.\nSince June 30, 2021 and through the date of this filing, our corporate offices have been located at 3625 Cove Point Dr. Salt Lake City, Utah 84109 and are provided to us by our sole officer and director at no cost to us. ITEM 3: LEGAL PROCEEDINGS\nNeither we nor our sole officer, director or holder of five percent or more of our common stock is a party to any pending legal proceedings and to the best of our knowledge, no such proceedings by or against us or our officers, or directors or holders of five percent or more of its common stock have been threatened or is pending against us. ITEM 4. MINE SAFETY DISCLOSURES\nNot Applicable.\nPART II ITEM 5: MARKET PRICE OF AND DIVIDENDS ON THE REGISTRANT'S COMMON EQUITY AND RELATED VICTORIA LAKE, INC. MATTERS\nMarket Price and Stockholder Matters\nThe Companys common stock is listed on the OTC Markets Expert tier under the ticker XRXH. Currently, the Company has a dark or defunct warning from OTC Markets and there is only a limited, sporadic, and volatile market for our unsolicited stock on the OTC.  ITEM 7: MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS.\nManagement's Discussion and Analysis of Financial Condition and Results of Operations.\nThe following information should be read in conjunction with the financial statements and notes thereto appearing elsewhere in this Form 10-K.\nThe Company is considered a startup company with no assets and/or capital and no material operations or income. Ongoing expenses, including the costs associated with the preparation and filing of this registration statement, have been paid for by advances from a stockholder, which are evidenced on the Companys financial statements as accounts payable-related parties. It is anticipated that the Company will require only nominal capital to maintain its corporate viability. Additional necessary funds will most likely be provided by the Company's officers and directors, although there is no agreement related to future funds and there is no assurance such funds will be available. However, unless the Company is able to facilitate an acquisition of or merger with an operating business or is able to obtain significant outside financing, there is substantial doubt about its ability to continue as a going concern.\nPLAN OF OPERATION\nOur plan of operations is to raise debt and/or equity to meet our ongoing operating expenses and attempt to merge with another entity with experienced management and opportunities for growth in return for shares of our common stock to create value for our shareholders. There can be no assurance that we will successfully complete this series of transactions. In particular, there is no assurance that any such business will be located or that any stockholder will realize any return on their shares after such a transaction. Any merger or acquisition completed by us can be expected to have a significant dilutive effect on the percentage of shares held by our current stockholders.\nOur intended budget for the next twelve months is as follows:\nQ1 3 months ended September 30, 2022\nQ2 3 months ended December 31, 2022\nQ3 3 months ended March 31, 2023\nQ4 3 months ended June 30, 2023\nTwelve Month\nTotal\nAccounting\n$\n5,000\n$\n5,000\n$\n5,000\n$\n5,000\n$\n20,000\nGeneral and administrative\n$\n3,000\n$\n3,000\n$\n3,000\n$\n3,000\n$\n12,000\nMiscellaneous\n$\n2,000\n$\n2,000\n$\n2,000\n$\n2,000\n$\n8,000\nTotal Operating Expenses\n$\n10,000\n$\n10,000\n$\n10,000\n$\n10,000\n$\n40,000\nAt this time, we have no cash on hand, and we are dependent on advances from our principal shareholder or our directors and officers. There can be no guarantee that we will be able to obtain sufficient funding these sources.\nAs of the date of this Report we intend to engage in what we believe to be synergistic acquisitions or joint ventures with a company or companies that we believe will enhance our business plan. The Company will not restrict its search to any specific business, industry, or geographical location and it may participate in a business venture of virtually any kind or nature. One of the benefits to our being a reporting and publicly traded company is to allow us to utilize our securities as consideration for some or all of the purchase price of these potential acquisitions. There are no assurances we will be able to consummate any acquisitions using our securities as consideration, or at all.\nThere are numerous things that will need to occur in order to allow us to implement this aspect of our business plan and there are no assurances that any of these developments will occur, or if they do occur, that we will be successful in fully implementing our plan.\nManagement will seek out and evaluate businesses for acquisition. The integrity and reputation of any potential acquisition candidate will first be thoroughly reviewed to ensure it meets with managements standards. Once targeted as a potential acquisition candidate, we will enter into negotiations with the potential candidate and commence due diligence evaluation, including its financial statements, cash flow, debt, location and other material aspects of the candidates business. If we are successful in our attempts to acquire a company or companies utilizing our securities as part or all of the consideration to be paid, our current shareholders will incur dilution.\nIn implementing a structure for a particular acquisition, we may become a party to a merger, consolidation, reorganization, joint venture, asset purchase, or licensing agreement with another corporation or entity. We may also acquire stock or assets of an existing business. Upon the consummation of a transaction, it is likely that our present management and shareholders will no longer be in control of our Company.\nAs part of our investigation, our officers and directors will meet personally with management and key personnel, may visit and inspect material facilities, obtain independent analysis of verification of certain information provided, check references of management and key personnel, and take other reasonable investigative measures, to the extent of our limited financial resources and management expertise. The manner in which we participate in an acquisition will depend on the nature of the opportunity, the respective needs and desires of us and other parties, the management of the acquisition candidate and our relative negotiation strength.\nWe will participate in an acquisition only after the negotiation and execution of appropriate written agreements. Although the terms of such agreements cannot be predicted, generally such agreements will require some specific representations and warranties by all of the parties thereto, will specify certain events of default, will detail the terms of closing and the conditions which must be satisfied by each of the parties prior to and after such closing, will outline the manner of bearing costs, including costs associated with our attorneys and accountants, will set forth remedies on default and will include miscellaneous other terms.\nDepending upon the nature of the acquisition, including the financial condition of the acquisition company, as a reporting company under the Securities Exchange Act of 1934 (34 Act ), it will be necessary for such acquisition candidate to provide independent audited financial statements. We will not acquire any entity which cannot provide independent audited financial statements within a reasonable period of time after closing of the proposed transaction. If such audited financial statements are not available at closing, or within time parameters necessary to insure our compliance with the requirements of the 34 Act, or if the audited financial statements provided do not conform to the representations made by the candidate to be acquired in the closing documents, the closing documents will provide that the proposed transaction will be voidable, at the discretion of our present management. If such transaction is voided, the agreement will also contain a provision providing for the acquisition entity to reimburse us for all costs associated with the proposed transaction.\nAs of the date of this Report we are not engaged in discussions with any concerning any potential merger or acquisition. We will not engage in any discussions concerning any merger or acquisition until a minimum of sixty (60) days has elapsed since the filing of this registration statement. There are no assurances that any material acquisition will occur in the future.\nWe believe there are certain perceived benefits to being a public company whose securities are publicly traded, including the following:\n·\nincreased visibility in the financial community;\n·\nincreased valuation;\n·\ngreater ease in raising capital;\n·\ncompensation of key employees through stock options for which there may be a market valuation; and\n·\nenhanced corporate image.\nThere are also certain perceived disadvantages to being a trading company including the following:\n·\nrequired publication of corporate information;\n·\nrequired filings of periodic and episodic reports with the Securities and Exchange Commission.\nBusiness entities, if any, which may be interested in a combination with us may include the following:\n·\na company for which a primary purpose of becoming public is the use of its securities for the acquisition of assets or businesses;\n·\na company which is unable to find an underwriter of its securities or is unable to find an underwriter of securities on terms acceptable to it;\n·\na company which wishes to become public with less dilution of its securities than would occur upon an underwriting;\n·\na company which believes that it will be able to obtain investment capital on more favorable terms after it has become public;\n·\na foreign company which may wish an initial entry into the United States securities market;\n·\na special situation company, such as a company seeking a public market to satisfy redemption requirements under a qualified Employee Stock Option Plan;\n·\na company seeking one or more of the other perceived benefits of becoming a public company.\nA business combination with a private company will normally involve the transfer to the private company of the majority of the issued and outstanding common stock of the Company, and the substitution by the private company of its own management and board of directors.\nThe proposed business activities described herein classify us as a shell company. The Securities and Exchange Commission and certain states have enacted statutes, rules and regulations regarding the sales of securities of shell companies, as well as limitations on\na shareholders ability to sell their restricted securities. Rule 144 is not available to a shareholder of a shell company unless and until the Company files a registration statement with the SEC that includes certain specific information about existing business operations of a registrant and thereafter must wait an additional one year to take advantage of that exemption from registration.\nRESULTS OF OPERATIONS FROM INCEPTION (JUNE 30, 2021) THROUGH JUNE 30, 2021 COMPARED TO THE YEAR ENDED JUNE 30, 2022.\nRevenue\nWe recognized no revenue from June 30, 2021 (inception) through June 30, 2022, as we had no business from which to generate revenues.\nCost of Revenue\nWe recognized no cost of revenue from June 30, 2021 (inception) through June 30, 2022.\nProfessional Fees\nDuring the period from June 30, 2021 (inception) through June 30, 2021, and for the year ended June 30, 2022, we incurred $0 and $14,488 in professional fees, respectively.\nGeneral and Administrative Expenses\nDuring the period from June 30, 2021 (inception) through June 30, 2021, and for the year ended June 30, 2022, we incurred $0 and $2,320 in general, selling, and administrative expenses, respectively.\nOperating Loss\nDuring the period from June 30, 2021 (inception) through June 30, 2021, and for the year ended June 30, 2022, we incurred an operating loss of $(16,808) and $0, respectively.\nOther Income (Expenses)\nDuring the period from June 30, 2021 (inception) through June 30, 2021, and for the year ended June 30, 2022, we recognized other income (expense) of $0 and $0, respectively.\nProvision for Income Tax\nDuring the period from June 30, 2021 (inception) through June 30, 2021, and for the year ended June 30, 2022, no provision for income taxes was recorded.\nNet Loss\nDuring the period from June 30, 2021 (inception) through June 30, 2021, and for the year ended June 30, 2022, we incurred a net loss of $0 and $(16,808), respectively due to the factors discussed above.\nCASH FLOW\nDuring the period from June 30, 2021 (inception) through June 30, 2021, and for the year ended June 30, 2022, we did not have any assets, operating business or other source of income. We had $27,266 and $10,458 of outstanding liabilities, for each period, respectively.\nConsequently, we are now dependent on raising additional equity and/or debt to meet our ongoing operating expenses. There is no assurance that we will be able to raise the necessary equity and/or debt that we will need to fund our ongoing operating expenses.\nIt is our current intention to seek to raise debt and/or equity financing to meet ongoing operating expenses and attempt to merge with another entity with experienced management and opportunities for growth in return for shares of our common stock to create value for our shareholders. There is no assurance that this series of events will be satisfactorily completed.\nFuture losses are likely to occur as, until we are able to merge with another entity with experienced management and opportunities for growth in return for shares of our common stock to create value for our shareholders as we have no sources of income to meet our operating expenses. As a result of these, among other factors, we received from our registered independent public accountants in their\nreport for the financial statements for the year ended June 30, 2022, an explanatory paragraph stating that there is substantial doubt about our ability to continue as a going concern.\nYear Ended\nYear Ended\nJune 30, 2022\nJune 30, 2021\nNet Cash from Operating Activities\n$\n-\n$\n-\nNet Cash from Investing Activities\n-\n-\nNet Cash from Financing Activities\n-\n-\nNet Change in Cash\n$\n-\n$\n-\nOperating Activities\nDuring the period from inception through June 30, 2021, or for the year ended June 30, 2022, we used $0 in our operating activities.\nInvesting Activities\nWe neither generated nor used funds in investing activities during the period from inception through June 30, 2021 or for the year ended June 30, 2022.\nFinancing Activities\nDuring the period from inception through June 30, 2021, or for the year ended June 30, 2022 we generated $0 cash from our financing activities.\nWe are dependent upon the receipt of capital investment or other financing to fund our ongoing operations and to execute our business plan of seeking a combination with a private operating company. In addition, we are dependent upon our controlling shareholder to provide continued funding and capital resources. If continued funding and capital resources are unavailable at reasonable terms, we may not be able to implement our plan of operations.\nLiquidity and Capital Resources\nAt June 30, 2022, we had cash of $0, no assets, no operating business or other source of income.\nWe are now focused raising debt and/or equity financing to meet ongoing operating expenses and attempting to merge with another entity with experienced management and opportunities for growth in return for shares of our common stock to create value for our shareholders. There is no assurance that this series of events will be satisfactorily completed.\nCRITICAL ACCOUNTING POLICIES\nAll companies are required to include a discussion of critical accounting policies and estimates used in the preparation of their financial statements. On an on-going basis, we evaluate our critical accounting policies and estimates. We base our estimates on historical experience and on various other assumptions that we believe to be reasonable under the circumstances, the results of which form our basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Actual results may differ from these estimates under different assumptions or conditions.\nOur significant accounting policies are described in Note 2 to our Financial Statements on page 18 These policies were selected because they represent the more significant accounting policies and methods that are broadly applied in the preparation of our financial statements. However, it should be noted that we intend to acquire a new operating business. The critical accounting policies and estimates for such new operations will, in all likelihood, be significantly different from our current policies and estimates.\nInflation\nIn the opinion of management, inflation has not and will not have a material effect on our operations in the immediate future.\nManagement will continue to monitor inflation and evaluate the possible future effects of inflation on our business and operations.\nOff-Balance Sheet Arrangements\nPer SEC regulations, we are required to disclose our off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, such as changes in financial condition, revenues, expenses, results of operations,\nliquidity, capital expenditures, or capital resources that are material to investors. As of June 30, 2022 and 2021, we have no off-balance sheet arrangements.\nRecently Issued Accounting Pronouncements\nManagement has evaluated other recently issued accounting pronouncements and does not believe that any of these pronouncements will have a significant impact on our financial statements and related disclosures. ITEM 7A: QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nNot required ITEM 8: FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA ITEM 9: CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone. ITEM 9A: CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nNone.\nManagements Annual Report on Internal Control over Financial Reporting\nManagement is responsible for the preparation of our financial statements and related information. Management uses its best judgment to ensure that the financial statements present accurately, in material respects, our financial position and results of operations in fairness and conformity with generally accepted accounting principles.\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting as defined in the Exchange Act. These internal controls are designed to provide reasonable assurance that the reported financial information is presented fairly, that disclosures are adequate, and that the assumptions and opinions in the preparation of financial statements are reasonable. There are inherent limitations in the effectiveness of any system of internal controls, including the possibility of human error and overriding of controls. Consequently, an ineffective internal control system can only provide reasonable, not absolute, assurance with respect to reporting financial information.\nOur internal control over financial reporting includes policies and procedures that: (i) pertain to maintaining records that, in reasonable detail, accurately and fairly reflect our transactions; (ii) provide reasonable assurance that transactions are recorded as necessary for preparation of our financial statements in accordance with generally accepted accounting principles and that the receipts and expenditures of company assets are made in accordance with our managements and directors authorization; and (iii) provide reasonable assurance regarding the prevention or timely detection of unauthorized acquisition, use, or disposition of assets that could have a material effect on our financial statements.\nWe conducted an evaluation of the effectiveness of our internal control over financial reporting, based on the framework in Internal Control Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) and published in 2013, and subsequent guidance prepared by COSO specifically for smaller public companies. Based on that evaluation, management concluded that our internal control over financial reporting was not effective as of June 30, 2022.\nA significant deficiency is a deficiency, or combination of deficiencies in internal control over financial reporting, that adversely affects the entitys ability to initiate, authorize, record, process, or report financial data reliably in accordance with generally accepted accounting principles such that there is more than a remote likelihood that a misstatement of the entitys financial statements that is more than inconsequential will not be prevented or detected by the entitys internal control. A material weakness is a deficiency or a combination of deficiencies in internal control over financial reporting such that there is a reasonable possibility that a material misstatement of the annual or interim financial statements will not be prevented or detected on a timely basis. Management identified the following material weakness and significant deficiencies in its assessment of the effectiveness of internal control over financial reporting as of June 30, 2022:\n·\nThe Company did not maintain effective controls over certain aspects of the financial reporting process because we lacked personnel with accounting expertise and an adequate supervisory review structure that is commensurate with our financial reporting requirements.\n·\nMaterial Weakness - Inadequate segregation of duties.\nWe expect to be materially dependent on a third party that can provide us with accounting consulting services for the foreseeable future. Until such time as we have a chief financial officer with the requisite expertise in U.S. GAAP, there are no assurances that the material weaknesses and significant deficiencies in our disclosure controls and procedures and internal control over financial reporting will not result in errors in our financial statements, which could lead to a restatement of those financial statements. Our management does not expect that our disclosure controls and procedures or our internal controls will prevent all error and all fraud. A control system, no matter how well conceived and maintained, can provide only reasonable, not absolute, assurance that the objectives of the control system are met. Further, the design of a control system must account for resource constraints. In addition, the benefits of controls must be considered relative to their costs. Due to the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, can and will be detected.\nChanges in Internal Controls over Financial Reporting\nThere have been no changes in our internal control over financial reporting during the period ended June 30, 2022 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. Item 9B: OTHER INFORMATION\nNone.\nItem 9C: DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot Applicable.\nREPORT OF INDEPENDENT REGISTERED\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Stockholders\nEntertainment Holdings, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of Entertainment Holdings, Inc. (the Company) as of June 30, 2022 and 2021, and the related statements of operations, stockholders deficit, and cash flows for the year ended June 30, 2022 and from June 30, 2021 (inception) through June 30, 2021, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of June 30, 2022 and 2021, and the results of its operations and its cash flows for the year ended June 30, 2022 and from June 30, 2021 (inception) through June 30, 2021, in conformity with accounting principles generally accepted in the United States of America.\nConsideration of the Companys Ability to Continue as a Going Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. The Company has no operations which raises substantial doubt about its ability to continue as a going concern. Managements plans in regard to these matters are described in Note 3. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\n/s/ Pinnacle Accountancy Group of Utah\nWe have served as the Companys auditor since 2021.\nPinnacle Accountancy Group of Utah\n(a dba of Heaton & Company, PLLC)\nPCAOB ID: 6117\nFarmington, Utah\nDecember 6, 2022\nEntertainment Holdings, Inc.\nBalance Sheets\nASSETS\nJune 30,\nJune 30,\nCURRENT ASSETS\nCash\n$\n-\n-\nTOTAL ASSETS\n$\n-\n-\nCURRENT LIABILITIES\nAccounts payable and accrued expenses\n$\n14,538\n10,458\nAccounts Payable - related party\n12,728\n-\nTotal Current Liabilities\n27,266\n10,458\nTotal Liabilities\n27,266\n10,458\nSTOCKHOLDERS' DEFICIT\nConvertible Preferred stock: 100,000,000 shares authorized, at $0.0001 par value, 0 issued and outstanding.\n-\n-\nCommon stock: 500,000,000 shares authorized, at $0.0001 par value, 88,992,975 issued and outstanding.\n8,899\n8,899\nAdditional paid-in capital\n(19,357)\n(19,357)\nAccumulated deficit\n(16,807)\n-\nTotal Stockholders' Deficit\n(27,266)\n(10,458)\nTOTAL LIABILITIES AND STOCKHOLDERS' DEFICIT\n$\n-\n-\nThe accompanying notes are an integral part of these financial statements.\nEntertainment Holdings, Inc.\nStatements of Operations\nFor the Year Ended\nFrom inception (June 30, 2021) through June 30, 2021\nJune 30,\nREVENUES\nRevenues\n$\n-\n$\n-\nOPERATING EXPENSES\nProfessional fees\n14,488\n-\nGeneral and administrative\n2,320\n-\nTotal Operating Expenses\n16,808\n-\nOPERATING LOSS\n(16,808)\n-\nProvision for income taxes\n-\n-\nNET LOSS\n$\n(16,808)\n$\n-\nBASIC AND DILUTED LOSS PER SHARE\n$\n(0.00)\n$\n(0.00)\nBASIC AND DILUTED WEIGHTED AVERAGE\nNUMBER OF SHARES OUTSTANDING\n88,992,975\n88,992,975\nThe accompanying notes are an integral part of these financial statements.\nEntertainment Holdings, Inc.\nStatement of Stockholders' Deficit\nFrom Inception on June 30, 2021 Through June 30, 2022\nAdditional\nTotal\nCommon Stock\nPaid-In\nAccumulated\nStockholders'\nShares\nAmount\nCapital\nDeficit\nDeficit\nBalance, June 30, 2021 (Inception)\n-\n$\n-\n$\n-\n$\n-\n$\n-\nMerger recapitalization\n88,992,975\n8,899\n(19,357)\n-\n(10,458)\nNet income (loss)\n-\n-\n-\n-\n-\nBalance, June 30, 2021\n88,992,975\n$\n8,899\n$\n(19,357)\n$\n-\n$\n(10,458)\nNet loss\n-\n-\n-\n(16,808)\n(16,808)\nBalance, June 30, 2022\n88,992,975\n$\n8,899\n$\n(19,357)\n$\n(16,808)\n$\n(27,266)\nThe accompanying notes are an integral part of these financial statements.\nEntertainment Holdings, Inc.\nStatements of Cash Flows\nFor the Year Ended\nFrom inception (June 30, 2021) through\nJune 30,\nJune 30,\nCASH FLOWS FROM OPERATING ACTIVITIES\nNet loss\n$\n(16,808)\n$\n-\nAdjustments to reconcile net loss to net cash\nused by operating activities:\nChanges in operating assets and liabilities\nAccounts payable and accrued expenses\n4,080\n-\nRelated parties accounts payable\n12,728\n-\nNet Cash Used in Operating Activities\n-\n-\nCASH FLOWS FROM INVESTING ACTIVITIES\n-\n-\nCASH FLOWS FROM FINANCING ACTIVITIES\n-\n-\nNET CHANGES IN CASH\n-\n-\nCASH AT BEGINNING OF PERIOD\n-\n-\nCASH AT END OF PERIOD\n$\n-\n$\n-\nSUPPLEMENTAL DISCLOSURES OF CASH FLOW INFORMATION\nCASH PAID FOR:\nInterest\n$\n-\n$\n-\nIncome Taxes\n$\n-\n$\n-\nNON-CASH INVESTING AND FINANCING ACTIVITIES\nLiabilities acquired in reverse merger\n$\n-\n$\n10,458\nThe accompanying notes are an integral part of these financial statements.\nENTERTAINMENT HOLDINGS, INC.\nNOTES TO THE FINANCIAL STATEMENTS\nFOR THE YEAR ENDED JUNE 30, 2022 AND\nTHE PERIOD FROM INCEPTION (JUNE 30, 2021) THROUGH JUNE 30, 2021\nNOTE 1 - NATURE OF OPERATIONS\nOur predecessor issuer was incorporated on June 15, 1998, as XRX International Entertainment Holding Group, Inc. and continued under that name until June 30, 2021. From that date forward, the Company has been operating under the name of Entertainment Holdings, Inc.\nReorganization Activities:\nDomiciliary Merger: On June 14, 2021, the predecessor issuer, XRX International Entertainment Holding Group, Inc. of Florida, completed a domiciliary merger into Traveler Holdings, Inc. of Oklahoma, with the Oklahoma company being the survivor under the name Traveler Holdings, Inc.\nHolding Company Parent/Subsidiary Formation: On June 30, 2021, Entertainment Holdings, Inc. an Oklahoma Corporation became the parent/successor issuer pursuant to Section 1081(g) of the Oklahoma General Corporation Act under an executed agreement titled Agreement and Plan of Reorganization (Parent Subsidiary Formation) which was executed by Traveler Holdings, Inc. (OK), Entertainment Holdings, Inc. (OK), and Expedition Holdings, Inc. (OK). Under the terms of the Agreement, Traveler Holdings, Inc. (OK) merged into Expedition Holdings, Inc. (OK) and Traveler Holdings, Inc. (OK). ceased to exist, wherein Expedition Holdings, Inc. (OK) became the survivor and successor under Section 1088 of the Oklahoma Act, having acquired all of Traveler Holdings, Inc.s (OK) assets, rights financial statements, obligations, and liabilities as the constituent or resulting corporation. Entertainment Holdings, Inc. (OK) became the parent and the holding company of Expedition Holdings, Inc. (OK) under the Parent Subsidiary Formation which was in compliance with Section 1081(g) of the Oklahoma General Corporation Act.\nUpon consummation of the Parent Subsidiary Formation, each issued and outstanding equity of the former Traveler Holdings, Inc. (OK) was transmuted into and represented the identical equity structure of XRX International Entertainment Holding Group, Inc. (FL) that existed prior to the domiciliary change and immediately prior to the Reorganization (on a share-for-share basis) having the same designations, rights, powers and preferences, and qualifications, limitations and restrictions. Upon consummation of the Agreement, Entertainment Holdings, Inc. (OK), was the issuer since the former Traveler Holdings, Inc. (OK) equity structure was transmuted pursuant to Section 1081(g) as the current issued and outstanding equities of Entertainment Holdings, Inc. (OK). The subsidiary, Expedition Holdings, Inc. was divested on September 30, 2021 and therefore is no longer consolidated into Entertainment Holdings, Inc. The shareholders of the Company became the shareholders of the former XRX International Entertainment Holding Group, Inc. (FL).\nAs a result of this reorganization, the resulting reorganized Company name became Entertainment Holdings, Inc. (XRXH, Company,, we,, or us). Our fiscal year end is June 30.\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nUse of Estimates and Assumptions\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States (\"GAAP\") requires management to make estimates and assumptions that affect (i) the reported amounts of assets and liabilities, (ii) the disclosure of contingent assets and liabilities known to exist as of the date the financial statements are published, and (iii) the reported amount of net revenues and expenses recognized during the periods presented. Adjustments made with respect to the use of estimates often relate to improved information not previously available. Uncertainties with respect to such estimates and assumptions are inherent in the preparation of financial statements; accordingly, actual results could differ from these estimates.\nCash and Cash Equivalents\nThe Company considers all highly liquid investments with an original maturity of six months or less to be cash equivalents.\nIncome Taxes\nWe account for income taxes under the asset and liability method. Deferred tax assets and liabilities are recognized for future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which the temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date. Valuation allowances are recorded, when necessary, to reduce deferred tax assets to the amount expected to be realized.\nENTERTAINMENT HOLDINGS, INC.\nNOTES TO THE FINANCIAL STATEMENTS\nFOR THE YEAR ENDED JUNE 30, 2022 AND\nTHE PERIOD FROM INCEPTION (JUNE 30, 2021) THROUGH JUNE 30, 2021\nAs a result of the implementation of certain provisions of ASC 740, Income Taxes (\"ASC 740\"), which clarifies the accounting and disclosure for uncertainty in tax positions, as defined, ASC 740 seeks to reduce the diversity in practice associated with certain aspects of the recognition and measurement related to accounting for income taxes. We adopted the provisions of ASC 740 and have analyzed filing positions in each of the federal and state jurisdictions where we are required to file income tax returns, as well as all open tax years in these jurisdictions. We have identified the U.S. federal as our \"major\" tax jurisdictions. However, we have certain tax attribute carryforwards which will remain subject to review and adjustment by the relevant tax authorities until the statute of limitations closes with respect to the year in which such attributes are utilized.\nBasic and Diluted Loss Per Share\nBasic loss per share is computed using the weighted average number of shares outstanding during the period. Diluted loss per share has not been provided as it would be anti-dilutive. The Company does not have any potentially dilutive common shares outstanding as of June 30, 2022 or 2021.\nStock-Based Compensation\nThe Company accounts for share-based compensation under the provisions of ASC 718, Compensation-Stock Compensation. Under the fair value recognition provisions, stock-based compensation expense for employees and non-employees is measured at the grant date fair value on the grant date. Share-based compensation for all stock-based awards to employees and directors is recognized as an expense over the requisite service period, which is generally the vesting period.\nFair Value of Financial Instruments\nThe Company's financial instruments consist primarily of accounts payable and accrued expenses along with accounts payable - related party. The carrying amounts of such financial instruments approximate their respective estimated fair value due to the short-term maturities and approximate market interest rates of these instruments.\nThe Company adopted ASC Topic 820, Fair Value Measurements (\"ASC Topic 820\"), which defines fair value, establishes a framework for measuring fair value, and expands disclosures about fair value measurements. The standard provides a consistent definition of fair value which focuses on an exit price that would be received upon sale of an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. The standard also prioritizes, within the measurement of fair value, the use of market-based information over entity-specific information and establishes a six-level hierarchy for fair value measurements based on the nature of inputs used in the valuation of an asset or liability as of the measurement date.\nThe three-level hierarchy for fair value measurements is defined as follows:\n·\nLevel 1 - inputs to the valuation methodology are quoted prices (unadjusted) for identical assets or liabilities in active markets; liabilities in active markets;\n·\nLevel 2 - inputs to the valuation methodology include quoted prices for similar assets and liabilities in active markets, and inputs that are observable for the asset or liability other than quoted prices, either directly or indirectly, including inputs in markets that are not considered to be active; or directly or indirectly including inputs in markets that are not considered to be active;\n·\nLevel 3 - inputs to the valuation methodology are unobservable and significant to the fair value measurement\nRecent Accounting Pronouncements\nThe Company has evaluated other recently issued accounting pronouncements and does not believe that any of these pronouncements will have a significant impact on our financial statements and related disclosures.\nNOTE 3 - GOING CONCERN\nThe Company has not yet achieved profitable operations, has accumulated losses, has a working capital deficiency and expects to incur further losses in the development of its business, all of which raise substantial doubt about the Company's ability to continue as a going concern. The Company's ability to continue as a going concern is dependent upon its ability to generate future profitable operations and/or to obtain the necessary financing to meet its obligations and repay its liabilities arising from normal business operations when they come due. Management has no formal plan in place to address this concern but considers that the Company will be able to obtain additional\nENTERTAINMENT HOLDINGS, INC.\nNOTES TO THE FINANCIAL STATEMENTS\nFOR THE YEAR ENDED JUNE 30, 2022 AND\nTHE PERIOD FROM INCEPTION (JUNE 30, 2021) THROUGH JUNE 30, 2021\nfunds by equity financing and/or related party advances, however, there is no assurance of additional funding being available or on terms acceptable to the Company.\nNOTE 4 - RELATED PARTY TRANSACTIONS\nAs of June 30, 2022, our sole officer and director, G. Reed Petersen, has paid various expenses on behalf of the Company, totaling $12,728.\nAs the Companys office space needs are limited at the current time, Mr. Petersen is currently providing space to the Company at no cost.\nNOTE 5 - EQUITY\nThe total number of shares of stock which the corporation shall have authority to issue is 600,000,000 shares, of which 500,000,000 shares of $0.0001 par value shall be designated as Common Stock and 100,000,000 shares of $0.0001 shall be designated as Convertible Preferred Stock. The Preferred Stock authorized by these Articles of Incorporation may be issued in one or more series. The Board of Directors of the Corporation is authorized to determine or alter the rights, preferences, privileges, and restrictions granted or imposed upon any wholly unissued series of Preferred Stock, and within the limitations or restrictions stated in any resolution or resolutions of the Board of Directors originally fixing the number of shares constituting any series, to increase or decrease (but not below the number of shares of any such series then outstanding) the number of shares of any such series subsequent to the issue of shares of that series, to determine the designation and par value of any series and to fix the numbers of shares of any series.\nCommon Stock and Preferred Stock\nThe Company has authorized 500,000,000 common shares with a par value of $0.0001 per share. Each common share entitles the holder to one vote, in person or proxy, on any matter on which action of the stockholders of the corporation is sought.\nWe have authorized 100,000,000 shares of Convertible Preferred Stock, $0.0001 par value (the \"Preferred Stock\").\nWe designated 1,000,000 shares of Series A Convertible Preferred Stock but have no issued or outstanding Preferred Stock of the Company as of June 30, 2022.\nAs of June 30, 2022 there are no dividends due or payable on the Series A Convertible Preferred Stock. Any future terms with respect to dividends shall be determined by the Board consistent with the Corporations Certificate of Incorporation (Certificate). Any and all such future terms concerning dividends shall be reflected in an amendment to the Certificate, which the Board shall promptly file or cause to be filed. All shares of the Series A Preferred Stock shall rank pari passu with the Companys common stock and the Series A Preferred shall have no liquidation preference over any other class of stock.\nEach holder of outstanding shares of Series A Convertible Preferred Stock shall be entitled to the number of votes equal to one hundred (100) votes for each share held of record on all matters submitted to a vote of the shareholders. Except as provided by law, or by the provisions establishing any other series of Preferred Stock, holders of Series A Convertible Preferred Stock and of any other outstanding series of Preferred Stock shall vote together with the holders of Common Stock as a single class.\nEach holder of shares of Series A Convertible Preferred Stock may, at any time and from time to time, convert (an Optional Conversion) each of their shares of Series A Convertible Preferred Stock into one fully paid and nonassessable share of Common Stock. In the event of a reverse split or a forward split shall occur, then in each instance the Conversion Rate shall be adjusted such that the number of shares issued upon conversion of one share of Series A Convertible Preferred Stock will equal the number of shares of Common Stock that would otherwise be issued but for such Event.\nNOTE 6 - INCOME TAXES\nThe Company recognizes interest accrued related to unrecognized tax benefits in interest expense and penalties in operating expenses. The Company had no accruals for interest and penalties since inception.\nFuture tax benefits which may arise as a result of these losses have not been recognized in these financial statements, as their realization is determined not likely to occur and accordingly, the Company has recorded a valuation allowance for the deferred tax asset relating to these tax losses.\nENTERTAINMENT HOLDINGS, INC.\nNOTES TO THE FINANCIAL STATEMENTS\nFOR THE YEAR ENDED JUNE 30, 2022 AND\nTHE PERIOD FROM INCEPTION (JUNE 30, 2021) THROUGH JUNE 30, 2021\nThe Companys federal income tax returns since inception remain subject to examination by the Internal Revenue Service as of May 31, 2022.\nThe income tax provision differs from the amount of income tax determined by applying the Federal income tax at the expected rate of 21% due to the following:\nFrom Inception on June 30, 2021 through the\nYear Ended\nJune 30,\nYear Ended\nJune 30,\nNet loss\n$(16,808)\n$-\nLoss on settlement of debt\n-\n-\nStock issued for services\n-\n-\nValuation allowance\n16,808\n-\nNet provision for Federal income taxes\n$-\n$-\nNet deferred tax assets are comprised as follows:\nDeferred tax asset attributable to:\nNet operating loss carryover\n$3,529\n$-\nLess: valuation allowance\n(3,529)\n-\nNet deferred tax asset\n$-\n$-\nAs of June 30, 2022 and 2021, the Company has taxable net loss carryovers of approximately $16,808 and $0, respectively, that may be offset against future taxable income.\nNOTE 7 - SUBSEQUENT EVENTS\nThe Company has evaluated subsequent events occurring from June 30, 2022 through the date these financial statements were issued and noted there were no transactions that required disclosure.\nPART III ITEM 10: DIRECTORS AND EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nDirectors and Executive Officers\nThe following table sets forth the names, ages, and positions with us for each of our directors and officers as June 30, 2022:\nName\nAge\nPosition\nG. Reed Petersen\nPresident, Director, Secretary and Treasurer\nG. Reed Petersen, President, Director, Secretary, and Treasurer\nMr. G Reed Petersen, our sole officer and director, was appointed as President, Director, Secretary, and Treasurer on June 30, 2022. He is the sole officer and director of our Company.\nG. Reed Petersen, age 76, and a resident of the State of Nevada, has been a private investor since 1995. From January 2016 until November 29, 2016, Mr. Peterson was the controlling stockholder and sole executive officer and director of Allied Ventures Holding Corp., which at the time was inactive and deemed to be a public shell company. In connection with the change of control, Mr. Petersen sold all his shares to the new control group for approximately $75,000.00, and Allied changed its name to Longwen Group Corp. Mr. Petersen was the controlling stockholder and sole officer and director of Kreido Biofuels, Inc., which at the time was inactive and deemed to be a public shell company, from November 2017 to June 5, 2018, when he sold control of that company for $320,000. Mr. Petersen gained control of a small public company, whereafter he redomiciled the corporation to Nevada, and changed the name to Revival Inc. In June 2019, he was involved with the acquisition of a private company by Revival Inc. while he was President. Mr. Petersen retained his 660,001 shares of common stock in Revival but otherwise received no consideration for the change of control. After his resignation as president, this company, now Farmhouse Inc. completed an S-1 offering. Mr. Petersen is the promotor of our Company as defined in Item 401(g). Within the past ten years, Mr. Petersen has not been involved in any legal proceeding identified in Item 401(F) of Regulation S-K.\nMr. Petersen is currently the Director of Victoria Lake, Inc., an Oklahoma Company, having no relation to or with the Company, with its respective Form 10 undergoing current comments by the SEC. The Company has never been a successor issuer of Victoria Lake, Inc. Mr. Petersen has been the sole director and shareholder holding 32% of Victoria Lake, Inc.s outstanding common shares, since he acquired its predecessor issuer, Lake Victoria Mining Company, Inc. on February 10, 2021. Victoria Lake, Inc. is the successor issuer of Lake Victoria Mining Company, Inc. since the two companies executed and entered into a parent subsidiary formation on May 7, 2021 Mr. Petersen is currently the Director of Myson, Inc., an Oklahoma Company with a Form 10 undergoing current comments by the SEC. Mr. Petersen has been the sole director and majority shareholder holding 99% of Myson, Inc.s outstanding shares, since he acquired its predecessor issuer Myson Group, Inc. on June 20, 2021. Myson, Inc. is the successor issuer of Myson Group, Inc. since the two companies executed and entered into a parent subsidiary formation on July 8, 2021.\nCONFLICTS OF INTEREST - GENERAL\nOur directors and officers are, or may become, in their individual capacities, officers, directors, controlling shareholder and/or partners of other entities engaged in a variety of businesses. Thus, there exist potential conflicts of interest including, among other things, time, efforts and corporation opportunity, involved in participation with such other business entities. While our sole officer and director of our business is engaged in business activities outside of our business, he devotes to our business such time as he believes to be necessary. At this time, G.Reed Petersen has conflicts of interest with Victoria Lake, Inc. and Myson, Inc., of which he is director and president of both companies. There exist specific conflicts of interest between Mr. Petersen, the above companies, and our Company. Our Company and the above listed companies are held and controlled by Mr. Petersen as shell companies that will seek to acquire target operating businesses at a future date. At that time, Mr. Petersen will have to use his discretion and sound judgment in matching our Company with the right operating business and may weight the use of any corporate opportunity to choose one of the other companies as a more viable candidate.\nCONFLICTS OF INTEREST - CORPORATE OPPORTUNITIES\nPresently no requirement contained in our Articles of Incorporation, Bylaws, or minutes which requires officers and directors of our business to disclose to us business opportunities which come to their attention. Our officers and directors do, however, have a fiduciary duty of loyalty to us to disclose to us any business opportunities which come to their attention, in their capacity as an officer and/or director or otherwise. Excluded from this duty would be opportunities which the person learns about through his involvement as an officer\nand director of another company. We have no intention of merging with or acquiring an affiliate, associate person or business opportunity from any affiliate or any client of any such person.\nCOMMITTEES OF THE BOARD OF DIRECTORS\nThe Board of the Company currently has no committees, as there is at this time only one director of the Company. ITEM 11: EXECUTIVE COMPENSATION\nAs of the date of this filing, Mr. G. Reed Petersen was our sole director and officer.\nExecutive compensation during the period ended June 30, 2022 was as follows:\nNAME AND PRINCIPAL POSITION\nYEAR\nSALARY\nBONUS\nSTOCK AWARDS\nOPTIONS AWARDS\nNONQUALIFIED DEFERRED COMPENS-\nALL OTHER COMP\nTOTAL\n($)\n($)\n($)\n($)\nATION ($)\n($)\nG. Reed Petersen,\n$\n-\n$\n-\n$\n-\n$\n-\n$\n-\n$\n-\n$\n-\nPresident, Director, Secretary, & Treasurer\n$\n-\n$\n-\n$\n-\n$\n-\n$\n-\n$\n-\n$\n- ITEM 12: SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT\nThe following tables set forth as of June 30, 2022 the number and percentage of the outstanding shares of common stock, which according to the information available to us, were beneficially owned by:\n(i)\neach person who is currently a director,\n(ii)\neach executive officer,\n(iii)\nall current directors and executive officers as a group, and\n(iv)\neach person who is known by us to own beneficially more than 5% of our outstanding common stock.\nExcept as otherwise indicated, the persons named in the table have sole voting and dispositive power with respect to all shares beneficially owned, subject to community property laws where applicable.\nOFFICERS AND DIRECTORS\nTitle of\nClass\nName and Address of Beneficial Owner\nAmount and Nature of Beneficial Owner\nPercent of Class Outstanding (2)\nCommon Shares\nG. Reed Petersen, (1) (2)\nPresident, Director, Secretary, and Treasure\n78,000,000\n%\nCommon Shares\nAll Directors and Executive Officers as a Group (1 person)\n78,000,000\n%\n(1)\nThe address of each person listed above, unless otherwise indicated, is c/o Entertainment Holdings, Inc. 3625 Cove Point Dr., Salt Lake City, Utah 84109.\n(2)\nG. Reed Petersen is the Trustee of the G. Reed Petersen Revocable Trust, which is the owner of the above common shares.\nGREATER THAN 5% STOCKHOLDERS\nTitle of\nClass\nName and Address of Beneficial Owner\nAmount and Nature of Beneficial Owner\nPercent of Class Outstanding (2)\nCommon Shares\nG. Reed Petersen Revocable Trust,\nDirect Owner (1) (2)\n78,000,000\n%\n(1)\nThe address of each person listed above, unless otherwise indicated, is c/o Entertainment Holdings, Inc. 3625 Cove Point Dr., Salt Lake City, Utah 84109.\n(2)\nG. Reed Petersen is the Trustee of the G. Reed Petersen Revocable Trust.\nRule 13d-3 under the Securities Exchange Act of 1934 governs the determination of beneficial ownership of securities. That rule provides that a beneficial owner of a security includes any person who directly or indirectly has or shares voting power and/or investment power with respect to such security. Rule 13d-3 also provides that a beneficial owner of a security includes any person who has the right to acquire beneficial ownership of such security within sixty days, including through the exercise of any option, warrant or conversion of a security. Any securities not outstanding which are subject to such options, warrants or conversion privileges are deemed to be outstanding for the purpose of computing the percentage of outstanding securities of the class owned by such person. Those securities are not deemed to be outstanding for the purpose of computing the percentage of the class owned by any other person. Included in this table are only those derivative securities with exercise prices that we believe have a reasonable likelihood of being in the money within the next sixty days.\nAs of the date of this filing and since June 30, 2022, there have been no issuances of any class of stock, or any other security. ITEM 13: CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS\nAs the Companys office space needs are limited at the current time, G. Reed Petersen is currently providing space to the Company at no cost.\nStock Options\nThe Company has no stock option plan at this time.\nITEM 15: Exhibits, Financial Statement Schedule\nEXHIBITS\nExhibit No.\nDescription\n3(i).1\nArticles of Incorporation (Oklahoma) - Entertainment Holdings, Inc.. - 6.30.2021\nIncorporated by refence (see 10-12G filed 7/30/2021)\n3(i).2\nBylaws - 6.30.2021\nIncorporated by refence (see 10-12G filed 7/30/2021)\n3(i).3\nCertificate of Designation - 6.30. 2021 - Series A\nIncorporated by refence (see 10-12G filed 7/30/2021)\n31.1\nCertification pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\nAttached\n32.1\nCertification pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\nAttached\nSIGNATURES\nPursuant to the requirements of the securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized.\nENTERTAINMENT HOLDINGS, INC.\nDate: December 15, 2022/s/ Reed Petersen\n--------------------------------\nReed Petersen\nPresident, Secretary, Treasurer and\nDirector  ITEM 15: Exhibits, Financial Statement Schedule\nEXHIBITS\nExhibit No.\nDescription\n3(i).1\nArticles of Incorporation (Oklahoma) - Entertainment Holdings, Inc.. - 6.30.2021\nIncorporated by refence (see 10-12G filed 7/30/2021)\n3(i).2\nBylaws - 6.30.2021\nIncorporated by refence (see 10-12G filed 7/30/2021)\n3(i).3\nCertificate of Designation - 6.30. 2021 - Series A\nIncorporated by refence (see 10-12G filed 7/30/2021)\n31.1\nCertification pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\nAttached\n32.1\nCertification pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\nAttached\nSIGNATURES\nPursuant to the requirements of the securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized.\nENTERTAINMENT HOLDINGS, INC.\nDate: December 15, 2022/s/ Reed Petersen\n--------------------------------\nReed Petersen\nPresident, Secretary, Treasurer and\nDirector"
}