{
    "cik": "1879293",
    "company": "Myson, Inc.",
    "filing_type": "10-K",
    "filing_date": "2022-10-28",
    "period_of_report": "2022-07-31",
    "sic": "3567",
    "state_of_inc": "OK",
    "state_location": "UT",
    "fiscal_year_end": "0731",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1879293/0001493152-22-029818-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1879293/000149315222029818/form10-k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1879293/0001493152-22-029818.txt",
    "filename": "1879293_10K_2022_0001493152-22-029818.htm",
    "content": "ITEM 1. DESCRIPTION OF BUSINESS\nForward-Looking Statements\nCertain statements, other than purely historical information, including estimates, projections, statements relating to our business plans, objectives, and expected operating results, and the assumptions upon which those statements are based, are forward-looking statements. These forward-looking statements generally are identified by the words believes, project, expects, anticipates, estimates, intends, strategy, plan, may, will, would, will be, will continue, will likely result, and similar expressions. Forward-looking statements are based on current expectations and assumptions that are subject to risks and uncertainties which may cause actual results to differ materially from the forward-looking statements. Our ability to predict results or the actual effect of future plans or strategies is inherently uncertain. Factors which could have a material adverse effect on our operations and future prospects include, but are not limited to: changes in economic conditions, legislative/regulatory changes, availability of capital, interest rates, competition, and generally accepted accounting principles. These risks and uncertainties should also be considered in evaluating forward-looking statements and undue reliance should not be placed on such statements.\nGeneral Overview\nWe were incorporated on July 8, 2021 as an Oklahoma corporation and formed for the purpose of effecting a merger, capital stock exchange, asset acquisition, stock purchase, reorganization or similar business combination with one or more businesses. We have not selected any specific business combination target and we have not, nor has anyone on our behalf, engaged in any substantive discussions, directly or indirectly, with any business combination target with respect to an initial business combination with us. We intend to effectuate our initial business combination using our capital stock, debt or a combination of cash, stock and debt.\nOn May 11, 2022, G. Reed Petersen Irrevocable Trust (the Seller), agreed to sell all 1,000 issued and outstanding Series A Preferred Shares of the Company to Reddington Partners LLC (the Purchaser), thus constituting a change of control of the Company, for $495,000, pursuant to a Stock Purchase Agreement (the Stock Purchase Agreement). The Preferred Shares were convertible into 10,000,000 common shares which, upon conversion, represent approximately 98.7% of the Companys outstanding common shares.\nThe sale of the Shares to the Purchaser was completed on May 17, 2022. As part of the Stock Purchase Agreement, G. Reed Petersen agreed to resign as the Companys sole officer and director; and the change of management was completed on June 5, 2022. On June 6, 2022, Henrik Rouf became the Companys sole officer and director.\nCurrent Business\nWe have neither engaged in any operations nor generated any operating revenues to date. We are currently a shell, as that term is defined pursuant to Rule 12b-2 of the Securities Exchange Act of 1934. Our only activities for the period from July 8, 2021 (inception) through July 31, 2022 were organizational activities, preparing and filing a Form 10 with the SEC, and then identifying a target company for a business combination. We will not generate any operating revenues until after completion of our initial business combination. There has been no significant change in our financial or trading position and no material adverse change has occurred since the date of our audited financial statements. We expect to incur increased expenses as a result of being a public company (for legal, financial reporting, accounting and auditing compliance), as well as for due diligence expenses.\nEmployees\nWe have no full-time employees. Our sole officer and director works without compensation, devoting such hours as are required for corporate compliance and searching for a suitable acquisition or acquisitions. ITEM 1A. RISK FACTORS\nWe are a smaller reporting company as defined by Rule 12b-2 of the Securities Exchange Act of 1934 and, as such, are not required to provide the information under this Item. Item 1B. UNRESOLVED STAFF COMMENTS\nNone. ITEM 2. PROPERTIES\nWe do not own or lease any property. ITEM 3. LEGAL PROCEEDINGS\nWe know of no material, existing or pending legal proceedings against us, nor are we involved as a plaintiff in any material proceeding or pending litigation. There are no proceedings in which any of our directors, officers or affiliates, or any registered or beneficial shareholder, is an adverse party or has a material interest adverse to our company. ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\nPART II ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nMarket Information\nOur common stock is quoted under the symbol MYSN on the OTCPINK, operated by OTC Markets Group, Inc.. The criteria for being quoted on OTCPINK include that we remain current in our SEC reporting.\nOur shares are subject to Section 15(g) and Rule 15g-9 of the Securities and Exchange Act, commonly referred to as the penny stock rule. The rule defines penny stock to be any equity security that has a market price less than $5.00 per share, subject to certain exceptions. These rules may restrict the ability of broker-dealers to trade or maintain a market in our common stock and may affect the ability of shareholders to sell their shares. Broker-dealers who sell penny stocks to persons other than established customers and accredited investors must make a special suitability determination for the purchase of the security. Accredited investors, in general, include individuals with assets in excess of $1,000,000 (not including their personal residence) or annual income exceeding $200,000 or $300,000 together with their spouse, and certain institutional investors. The rules require the broker-dealer to receive the purchasers written consent to the transaction prior to the purchase and require the broker-dealer to deliver a risk disclosure document relating to the penny stock prior to the first transaction. A broker-dealer also must disclose the commissions payable to both the broker-dealer and the registered representative, and current quotations for the security. Finally, monthly statements must be sent to customers disclosing recent price information for the penny stocks.\nAs of October 20, 2022, there were approximately 659 holders of record of our common stock, although there may be other persons who are beneficial owners of our common stock held in street name. The transfer agent and registrar for our common stock is Transfer Online, 512 SE Salmon Street, Portland, OR, 97214.\nDividend Policy\nWe have never paid any cash dividends and intend, for the foreseeable future, to retain any future earnings for the development of our business. Our Board of Directors will determine our future dividend policy on the basis of various factors, including our results of operations, financial condition, capital requirements and investment opportunities.\nRECENT ISSUANCES OF UNREGISTERED SECURITIES\nOn June 8, 2022, Reddington Partners LLC converted their Series A Preferred Shares into 10,000,000 common shares; and as of the date hereof, there are no Preferred Shares issued and outstanding.\nOther than as disclosed above, we did not sell any equity securities which were not registered under the Securities Act during the year ended July 31, 2022 that were not otherwise disclosed on our quarterly reports on Form 10-Q or our current reports on Form 8-K filed during the year ended July 31, 2022.\nISSUER REPURCHASES OF EQUITY SECURITIES\nNone ITEM 6. [RESERVED] ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nResults of Operations for the Years Ended July 31, 2022 and 2021\nRevenue\nWe did not recognize any revenue for the years ended July 31, 2022 and 2021.\nGeneral and administrative\nGeneral and administrative expense was $65,570 and $101 for the years ended July 31, 2022 and 2021, respectively. Expenses in the current fiscal year were for accounting fees, transfer agent fees, edgarization fees and postage expenses, primarily related to the costs of maintaining our company current with the transfer agent and with our filing obligations with the Securities and Exchange Commission. We also incurred expenses related to the notice of corporate action filed with FINRA to effect a reverse split and name change. As the Company was formed on July 8, 2021, we only had $101 of expense as of July 31, 2021.\nNet Loss\nFor the year ended July 31, 2022, we had a net loss of $65,570 as compared to a net loss of $101 for year ended July 31, 2021.\nLiquidity and Financial Condition\nOperating Activities\nCash used by operating activities was $65,288 for the year ended July 31, 2022, compared to cash used for operating activities of $101 for the year ended July 31, 2021.\nInvesting Activities\nWe used $0 for investing activities for the years ended July 31, 2022 and 2021.\nFinancing Activities\nNet cash provided by financing activities was $65,288 for year ended July 31, 2022, compared to $101 for the year ended July 31, 2021. During the year ended July 31, 2022, we received $27,639 that was contributed by the former majority shareholder and $37,649 of cash advances from the current majority shareholder.\nOff-Balance Sheet Arrangements\nWe have no off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources that is material to stockholders.\nCritical Accounting Policies\nRefer to Note 2 of our financial statements contained elsewhere in this Form 10-K for a summary of our critical accounting policies. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nSmaller reporting companies are not required to provide the information required by this Item. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nMYSON, INC.\nReport of Independent Registered Public Accounting Firm PCAOB ID 5041\nBalance Sheets as of July 31, 2022 and 2021\nStatements of Operations for the Years Ended July 31, 2022 and 2021\nStatement of Changes in Stockholders Deficit for the Years Ended July 31, 2022 and 2021\nStatements of Cash Flows for the Years Ended July 31, 2022 and 2021\nNotes to Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the shareholders and the board of directors of Myson, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of Myson, Inc. (the Company) as of July 31, 2022 and 2021, the related statement of operations, stockholders equity (deficit), and cash flows for the period July 8, 2021 (Inception) through July 31, 2021 and through July 31, 2022, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of July 31, 2022 and 2021, and the results of its operations and its cash flows for the period July 8, 2021 (Inception) through July 31, 2021 and through July 31, 2022, in conformity with accounting principles generally accepted in the United States.\nSubstantial Doubt about the Companys Ability to Continue as a Going Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 3 to the financial statements, the Company has suffered recurring losses from operations and has a significant accumulated deficit. In addition, the Company continues to experience negative cash flows from operations. These factors raise substantial doubt about the Companys ability to continue as a going concern. Managements plans in regard to these matters are also described in Note 3. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audit provides a reasonable basis for our opinion.\n/s/ BF Borgers CPA PC\nBF Borgers CPA PC (PCAOB ID 5041)\nWe have served as the Companys auditor since\nLakewood, CO\nOctober 28, 2022\nMYSON, INC.\nBALANCE SHEETS\nJuly 31, 2022 July 31, 2021\nASSETS\nCurrent Assets:\nCash $ - $ -\nTotal Current Assets - -\nTotal Assets $ - $ -\nLIABILITIES AND STOCKHOLDERS DEFICIT\nCurrent Liabilities:\nAccounts payable $ 282 $ -\nLoan payable - related party 37,649 -\nTotal Current Liabilities 37,931 -\nStockholders Deficit:\nPreferred stock, $0.00001 par value, 20,000,000 shares authorized - -\nSeries A Preferred stock, $0.00001 par value, 1,000,000 shares designated, -0- and 1,000 shares issued and outstanding, respectively - -\nPreferred stock, value - -\nCommon stock, $0.00001 par value, 480,000,000 shares authorized; 10,133,284 and 133,284 shares issued and outstanding, respectively\nAdditional paid in capital 27,639\nAccumulated deficit (65,671 ) (101 )\nTotal stockholders deficit (37,931 ) -\nTotal Liabilities and Stockholders Deficit $ - $ -\nThe accompanying notes are an integral part of these financial statements.\nMYSON, INC.\nSTATEMENTS OF OPERATIONS\nFor the Years Ended\nJuly 31,\nOperating expenses:\nGeneral and administrative 65,570\nTotal operating expenses 65,570\nLoss from operations (65,570 ) (101 )\nNet Loss $ (65,570 ) $ (101 )\nLoss per share, basic & diluted $ (0.04 ) $ (0.00 )\nWeighted average shares outstanding, basic & diluted 1,612,736 133,284\nThe accompanying notes are an integral part of these financial statements.\nMYSON, INC.\nSTATEMENT OF CHANGES IN STOCKHOLDERS DEFICIT\nFOR THE YEARS ENDED JULY 31, 2022 AND 2021\nShares Amount Shares Amount Capital Deficit Deficit\nCommon Stock Series A\nPreferred Stock Additional Paid in Accumulated Total Stockholders\nShares Amount Shares Amount Capital Deficit Deficit\nBalances, July 31, 2020 133,284 $ 1 1,000 $ - $ 100 $ $ 101\nNet loss - - - - - (101 ) (101 )\nBalances, July 31, 2021 133,284 1,000 - (101 ) -\nContributions to capital - - - - 27,639 - 27,639\nPreferred shares converted to common shares 10,000,000 (1,000 ) - (100 ) - -\nNet loss - - - - - (65,570 ) (65,570 )\nBalances, July 31, 2022 10,133,284 $ 101 - $ - $ 27,639 $ (65,671 ) $ (37,931 )\nThe accompanying notes are an integral part of these financial statements.\nMYSON, INC.\nSTATEMENTS OF CASH FLOWS\nFor the Years Ended\nJuly 31,\nCash Flows from Operating Activities:\nNet loss $ (65,570 ) $ (101 )\nAdjustments to reconcile net loss to net cash used in Operating activities:\nChanges in Operating Assets and Liabilities:\nAccounts payable -\nNet cash used by operating activities (65,288 ) (101 )\nCash Flows from Financing Activities:\nLoan payable - related party 37,649 -\nContributions to capital by controlling shareholder 27,639\nNet cash provided by financing activities 65,288\nNet change in cash - -\nCash, at beginning of year - -\nCash, at end of year $ - $ -\nSupplemental Non-Cash Disclosure:\nCash paid for interest $ - $ -\nCash paid for taxes $ - $ -\nThe accompanying notes are an integral part of these financial statements.\nMYSON, INC.\nNOTES TO FINANCIAL STATEMENTS\nJULY 31, 2022\nNOTE 1 - NATURE OF OPERATIONS\nMyson, Inc. (Myson, or the Company) is an Oklahoma corporation formed on July 8, 2021. The Company was formed for the purpose of entering into a merger, capital stock exchange, asset acquisition, stock purchase, reorganization or similar business combination with one or more businesses (a Business Combination). The Company is not limited to a particular industry or geographic region for purposes of consummating a Business Combination. The Company is an early stage and emerging growth company and, as such, the Company is subject to all of the risks associated with early stage and emerging growth companies.\nAs of July 31, 2022, the Company has not commenced any operations. All activity for the period from July 8, 2021 (inception) through July 31, 2022 relates to the Companys formation and the filing of its Registration Statement on Form 10, which was effective on October 23, 2021, and the search for a prospective initial Business Combination. The Company will not generate any operating revenues until after the completion of its initial Business Combination, at the earliest.\nOn May 11, 2022, G. Reed Petersen Irrevocable Trust (the Seller), agreed to sell all 1,000 issued and outstanding Series A Preferred Shares of the Company to Reddington Partners LLC (the Purchaser), thus constituting a change of control of the Company, for $495,000, pursuant to a Stock Purchase Agreement (the Stock Purchase Agreement). The Preferred Shares were convertible into 10,000,000 common shares which, upon conversion, represent approximately 98.7% of the Companys outstanding common shares. On June 8, 2022, Reddington Partners LLC converted their Series A Preferred Shares into 10,000,000 common shares, and there are no Preferred Shares currently issued and outstanding.\nThe sale of the Shares to the Purchaser was completed on May 17, 2022. As part of the Stock Purchase Agreement, G. Reed Petersen agreed to resign as the Companys sole officer and director; and the change of management was completed on June 5, 2022. On June 6, 2022, Henrik Rouf became the Companys sole officer and director.\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBasis of Presentation\nThe accounting and reporting policies of the Company conform to U.S. generally accepted accounting principles (US GAAP).\nUse of estimates\nThe preparation of financial statements in conformity with generally accepted accounting principles requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results may differ from those estimates.\nCash and Cash Equivalents\nThe Company considers all cash accounts, which are not subject to withdrawal restrictions or penalties, and all highly liquid debt instruments purchased with a maturity of three months or less as cash and cash equivalents. The carrying amount of financial instruments included in cash and cash equivalents approximates fair value because of the short maturities for the instruments held. The Company had no cash equivalents as of July 31,2022 and July 31, 2021.\nBasic and Diluted Earnings Per Share\nNet income (loss) per common share is computed pursuant to ASC 260-10-45, Earnings per Share-Overall-Other Presentation Matters. Basic net income (loss) per common share is computed by dividing net income (loss) by the weighted average number of shares of common stock outstanding during the period. Diluted net income (loss) per common share is computed by dividing net income (loss) by the weighted average number of shares of common stock and potentially outstanding shares of common stock during the period. As of July 31, 2022 and 2021, we had 0 and 10,000,000 potentially dilutive shares of common stock from convertible preferred stock. Potentially dilutive shares are not included in the loss per share as their inclusion would be anti-dilutive due to the Companys net loss.\nRecent Accounting Pronouncements\nThe Company has implemented all new accounting pronouncements that are in effect. These pronouncements did not have any material impact on the financial statements unless otherwise disclosed, and the Company does not believe that there are any other new accounting pronouncements that have been issued that might have a material impact on its financial position or results of operations.\nNOTE 3 - GOING CONCERN\nThese financial statements have been prepared in accordance with generally accepted accounting principles applicable to a going concern, which assumes that the Company will be able to meet its obligations and continue its operations for its next fiscal year. Realization values may be substantially different from carrying values as shown and these financial statements do not give effect to adjustments that would be necessary to the carrying values and classification of assets and liabilities should the Company be unable to continue as a going concern. At July 31, 2022, the Company has not yet achieved profitable operations, has accumulated losses of $65,671 since its inception, has no working capital, and expects to incur further losses in the development of its business, all of which raise substantial doubt about the Companys ability to continue as a going concern. The Companys ability to continue as a going concern is dependent upon its ability to generate future profitable operations and/or to obtain the necessary financing to meet its obligations and repay its liabilities arising from normal business operations when they come due. Management has no formal plan in place to address this concern but considers that the Company will be able to obtain additional funds by equity financing and/or related party advances, however, there is no assurance of additional funding being available or on terms acceptable to the Company.\nNOTE 4 - RELATED PARTY TRANSACTIONS\nDuring the year ended July 31, 2022, the previous majority shareholder paid $27,639 of expenses on behalf of the Company for which there is no expectation for reimbursement. The amount has been accounted for as contributed capital.\nDuring the fourth quarter of the year ended July 31, 2022, Reddington Partners LLC, the majority shareholder, advanced the Company $37,649 to pay for general operating expenses. The advances are non-interest bearing and due on demand.\nOn June 8, 2022, the Reddington Partners LLC converted the Series A Preferred Shares into 10,000,000 common shares.\nNOTE 5 - COMMON STOCK\nThe Company has authorized 480,000,000 shares of common stock, par value $0.00001.\nEffective February 24, 2022, the Company effectuated a 1 for 10,000 reverse stock split. All share numbers throughout these financial statements have been retroactively restated.\nRefer to Note 4 for stock transaction with a related party.\nNOTE 6 - PREFERRED STOCK\nThe Company has authorized 20,000,000 shares of preferred stock, par value $0.00001. The Preferred Stock authorized by these Articles of Incorporation may be issued in one or more series. The Board of Directors of the Corporation is authorized to determine or alter the rights, preferences, privileges, and restrictions granted or imposed upon any wholly unissued series of Preferred Stock, and within the limitations or restrictions stated in any resolution or resolutions of the Board of Directors originally fixing the number of shares constituting any series, to increase or decrease (but not below the number of shares of any such series then outstanding) the number of shares of any such series subsequent to the issue of shares of that series, to determine the designation and par value of any series and to fix the numbers of shares of any series.\nOf the authorized preferred stock 1,000 shares have been designated as Series A Convertible Preferred Stock. Each share of Series A Convertible Preferred Stock is convertible into 10,000 shares of common stock and has 100,000 voting rights per share. There are no Preferred Shares issued and outstanding.\nRefer to Note 4 for stock transaction with a related party.\nNOTE 7 - INCOME TAX\nDeferred taxes are provided on a liability method whereby deferred tax assets are recognized for deductible temporary differences and operating loss and tax credit carry forwards and deferred tax liabilities are recognized for taxable temporary differences. Temporary differences are the differences between the reported amounts of assets and liabilities and their tax bases. Deferred tax assets are reduced by a valuation allowance when, in the opinion of management, it is more likely than not that some portion or all of the deferred tax assets will not be realized. Deferred tax assets and liabilities are adjusted for the effects of changes in tax laws and rates on the date of enactment. The U.S. federal income tax rate of 21% is being used.\nThe provision for Federal income tax consists of the following July 31:\nSCHEDULE OF PROVISION FEDERAL FOR INCOME TAXES\nFederal income tax benefit attributable to:\nCurrent Operations $ 13,770 $ -\nLess: valuation allowance (13,770 ) -\nNet provision for Federal income taxes $ - $ -\nThe cumulative tax effect at the expected rate of 21% of significant items comprising our net deferred tax amount is as follows:\nSCHEDULE OF DEFERRED TAX ASSETS\nDeferred tax asset attributable to:\nNet operating loss carryover $ 13,770 $ -\nLess: valuation allowance (13,770 ) -\nNet deferred tax asset $ - $ -\nAt July 31, 2022, the Company had net operating loss carry forwards of approximately $13,770 that maybe offset against future taxable income. No tax benefit has been reported in the July 31, 2022 or 2021 financial statements since the potential tax benefit is offset by a valuation allowance of the same amount.\nOn December 22, 2017, the U.S. government enacted comprehensive tax legislation commonly referred to as the Tax Cut and Jobs Act (the Tax Act). The Tax Act establishes new tax laws that affects 2018 and future years, including a reduction in the U.S. federal corporate income tax rate to 21% effective January 1, 2018. For certain deferred tax assets and deferred tax liabilities.\nDue to the change in ownership provisions of the Tax Reform Act of 1986, net operating loss carry forwards for Federal income tax reporting purposes are subject to annual limitations. Should a change in ownership occur, net operating loss carry forwards may be limited as to use in future years.\nASC Topic 740 provides guidance on the accounting for uncertainty in income taxes recognized in a companys financial statements. Topic 740 requires a company to determine whether it is more likely than not that a tax position will be sustained upon examination based upon the technical merits of the position. If the more-likely-than-not threshold is met, a company must measure the tax position to determine the amount to recognize in the financial statements.\nThe Company includes interest and penalties arising from the underpayment of income taxes in the statements of operations in the provision for income taxes. As of July 31, 2022, the Company had no accrued interest or penalties related to uncertain tax positions.\nNOTE 8 - SUBSEQUENT EVENTS\nManagement has evaluated subsequent events pursuant to the requirements of ASC Topic 855, from the balance sheet date through the date the financial statements were issued and has determined that there are no material subsequent events. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURES\nNone ITEM 9A. CONTROLS AND PROCEDURES\nManagements Report Disclosure Controls and Procedures\nWe carried out an evaluation, under the supervision and with the participation of our management, including our principal executive officer and principal financial officer, of the effectiveness of our disclosure controls and procedures (as defined in Exchange Act Rules 13a-15(e) and 15d-15(e)). Based upon that evaluation, our principal executive officer and principal financial officer concluded that, as of the end of the period covered in this report, our disclosure controls and procedures were ineffective to ensure that information required to be disclosed in reports filed under the Securities Exchange Act of 1934, as amended, is recorded, processed, summarized and reported within the required time periods specified in the Commissions rules and forms and is accumulated and communicated to our management, including our principal executive officer and principal financial officer, as appropriate to allow timely decisions regarding required disclosure.\nOur principal executive officer and principal financial officer does not expect that our disclosure controls and procedures or our internal controls will prevent all error or fraud. A control system, no matter how well conceived and operated, can provide only reasonable, not absolute, assurance that the objectives of the control system are met. Further, the design of a control system must reflect the fact that there are resource constraints and the benefits of controls must be considered relative to their costs. Due to the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, have been detected. During the fourth quarter of the fiscal year ended July 31, 2022, we carried out an evaluation, under the supervision and with the participation of our principal executive officer and principal financial officer, of the effectiveness of the design and operation of our disclosure controls and procedures. Based on that evaluation and due to the identified material weaknesses discussed below, our principal executive officer and principal financial officer concluded that our disclosure controls and procedures were ineffective as of the end of the period covered by this report.\nTo address the material weaknesses, we performed additional analysis and other post-closing procedures in an effort to ensure our financial statements included in this annual report have been prepared in accordance with generally accepted accounting principles. Accordingly, management believes that the financial statements included in this report fairly present in all material respects our financial condition, results of operations and cash flows for the periods presented.\nManagements Report on Internal Control over Financial Reporting\nInternal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act) is a process designed by, or under the supervision of, our principal executive and principal financial officers, and effected by our board of directors, management and other personnel, to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. The management is responsible for establishing and maintaining adequate internal control over our financial reporting. Under the supervision and with the participation of our management, including our principal executive officer and principal financial officer, we conducted an evaluation of the effectiveness of our internal control over financial reporting using the Internal Control - Integrated Framework (2013) developed by the Committee of Sponsoring Organizations of the Treadway Commission. Based on this evaluation, our Chief Executive Officer and Chief Financial Officer have concluded that our internal control over financial reporting was not effective as of July 31, 2022.\nWe are aware of the following material weaknesses in internal control that could adversely affect the Companys ability to record, process, summarize and report financial data:\n● Due to our size and limited resources, we currently do not employ the appropriate accounting personnel to ensure (a) we maintain proper segregation of duties, (b) that all transactions are entered timely and accurately, and (c) we properly account for complex or unusual transactions\n● Due to our size and limited resources, we have not properly documented a complete assessment of the effectiveness of the design and operation of our internal control over financial reporting.\nInherent limitations on effectiveness of controls\nInternal control over financial reporting has inherent limitations, which include but is not limited to the use of independent professionals for advice and guidance, interpretation of existing and/or changing rules and principles, segregation of management duties, scale of organization, and personnel factors. Internal control over financial reporting is a process, which involves human diligence and compliance and is subject to lapses in judgment and breakdowns resulting from human failures. Internal control over financial reporting also can be circumvented by collusion or improper management override. Because of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements on a timely basis, however these inherent limitations are known features of the financial reporting process and it is possible to design into the process safeguards to reduce, though not eliminate, this risk. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation. Projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nChanges in Internal Control over Financial Reporting\nThere have been no changes in our internal controls over financial reporting that occurred during the fourth quarter of the fiscal year ended July 31, 2022, that have materially or are reasonably likely to materially affect, our internal controls over financial reporting. ITEM 9B. OTHER INFORMATION\nNone\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS.\nNone.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nAll directors of our company hold office until the next annual meeting of the security holders or until their successors have been elected and qualified. The officers of our company are appointed by our board of directors and hold office until their death, resignation or removal from office. Our directors and executive officers, their ages, positions held, and duration as such, are as follows:\nName Age Position with the Company Notes\nHenrik Rouf Chief Executive Officer, Chief Financial Officer Secretary & Director Appointed June 6, 2022\nG. Reed Petersen Former President, Secretary & Director Resigned June 6, 2022\nHenrik Rouf, Director, Secretary & Chief Executive Officer, Mr. Rouf is an international financier who has over 30 years of experience in the global financial services industry as a securities professional. From 1996 through 2003, Mr. Rouf was Co-Founder and Managing Partner of Impact Capital in San Francisco, in charge of the private placement division of the company. From 1991 through 1996, Mr. Rouf was Senior Portfolio Manager of PVH Fund Managers, a London-based hedge fund. Mr. Rouf started his career in 1986 with Den Danske Bank in Copenhagen, Denmark. In early 2004, he launched a new Beverly Hills-based Merchant Bank, PacificWave Partners, serving as President and overseeing that companys overall investment banking practice, including origination, structuring and financing of both privately-held and publicly traded emerging growth companies in the North America, Asia and Europe. PacificWave Partners has a representative office in Luxembourg.\nFamily Relationships\nThere are no arrangements or understandings with any of our principal stockholders, customers, suppliers, or any other person, pursuant to which our sole director and executive officer was appointed.\nInvolvement in Certain Legal Proceedings\nTo the best of our knowledge, our sole director and executive officers has not, during the past ten years:\n1. been convicted in a criminal proceeding or been subject to a pending criminal proceeding (excluding traffic violations and other minor offences);\n2. had any bankruptcy petition filed by or against the business or property of the person, or of any partnership, corporation or business association of which he was a general partner or executive officer, either at the time of the bankruptcy filing or within two years prior to that time;\n3. been subject to any order, judgment, or decree, not subsequently reversed, suspended or vacated, of any court of competent jurisdiction or federal or state authority, permanently or temporarily enjoining, barring, suspending or otherwise limiting, his involvement in any type of business, securities, futures, commodities, investment, banking, savings and loan, or insurance activities, or to be associated with persons engaged in any such activity;\n4. been found by a court of competent jurisdiction in a civil action or by the SEC or the Commodity Futures Trading Commission to have violated a federal or state securities or commodities law, and the judgment has not been reversed, suspended, or vacated;\n5. been the subject of, or a party to, any federal or state judicial or administrative order, judgment, decree, or finding, not subsequently reversed, suspended or vacated (not including any settlement of a civil proceeding among private litigants), relating to an alleged violation of any federal or state securities or commodities law or regulation, any law or regulation respecting financial institutions or insurance companies including, but not limited to, a temporary or permanent injunction, order of disgorgement or restitution, civil money penalty or temporary or permanent cease-and-desist order, or removal or prohibition order, or any law or regulation prohibiting mail or wire fraud or fraud in connection with any business entity; or\n6. been the subject of, or a party to, any sanction or order, not subsequently reversed, suspended or vacated, of any self-regulatory organization (as defined in Section 3(a)(26) of the Exchange Act (15 U.S.C. 78c(a)(26)), any registered entity (as defined in Section 1(a)(29) of the Commodity Exchange Act (7 U.S.C. 1(a)(29)), or any equivalent exchange, association, entity or organization that has disciplinary authority over its members or persons associated with a member.\nDirector Independence\nWe currently act with one director, Henrik Rouf.\nCode of Ethics\nThe Company has not yet adopted a Code of Ethics. ITEM 11. EXECUTIVE COMPENSATION\nThe table below summarizes all compensation awarded to, earned by, or paid to each named executive officer for our last two completed fiscal years for all services rendered to us.\nSUMMARY COMPENSATION TABLE\nName and Principal Position Year Salary ($) Bonus ($) Stock\nAwards ($)\nOption\nAwards ($)\nNon-\nEquity\nIncentive\nPlan\nCompensa- tion\n($)\nChange in\nPension\nValue and\nNonqualified\nDeferred\nCompensation\nEarnings\n($)\nAll Other\nCompensation\n($)\nTotal\n($)\nHenrik Rouf - Chief Executive Officer, Chief Financial Officer Secretary $ 0 N/A N/A N/A N/A N/A N/A $ 0\n& Director $ 0 N/A N/A N/A N/A N/A N/A $ 0\nG. Reed Petersen - Former President, Secretary $ 0 N/A N/A N/A N/A N/A N/A $ 0\n& Director $ 0 N/A N/A N/A N/A N/A N/A $ 0\nOther than as set out below, there are no arrangements or plans in which we provide pension, retirement or similar benefits for directors or executive officers. Our directors and executive officers may receive share options at the discretion of our board of directors in the future. We do not have any material bonus or profit-sharing plans pursuant to which cash or non-cash compensation is or may be paid to our directors or executive officers, except that share options may be granted at the discretion of our board of directors.\nStock Option Grants\nWe have not granted any stock options to the executive officers since our inception.\nOutstanding Equity Awards at Fiscal Year End\nFor the year ended July 31, 2022, no director or executive officer has received compensation from us pursuant to any compensatory or benefit plan. There is no plan or understanding, express or implied, to pay any compensation to any director or executive officer pursuant to any compensatory or benefit plan.\nCompensation of Directors\nNo member of our Board of Directors received any compensation for his services as a director during the years ended July 31, 2022 and 2021. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe following table sets forth, as of October 20, 2022, information regarding the beneficial ownership of each class of our voting securities by: (i) our officers and directors; (ii) all of our officers and directors as a group; and (iii) each person known by us to beneficially own 5% or more of any class of our outstanding voting securities. Generally, a person is deemed to be a beneficial owner of a security if that person has or shares the power to dispose or to direct the disposition of such security. A person is also deemed to be a beneficial owner of any securities of which the person has the right to acquire beneficial ownership within 60 days.\nName and Address of Beneficial Owner Title of Class Amount and\nNature of\nBeneficial\nOwnership(1)\nPercent of\nClass(2)\nHenrik Rouf (1) Common stock 10,000,000 98.7 %\nAll officers and director as a group (1 person) Common stock 10,000,000 98.7 %\n(1) Mr. Rouf is the 100% owner of Reddington Partners LLC.\n(2) Percentage ownership of common stock is based on 10,133,284 shares of our common stock. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS AND DIRECTOR INDEPENDENCE\nDuring the year ended July 31, 2022, the previous majority shareholder paid $27,639 of expenses on behalf of the Company for which there is no expectation for reimbursement. The amount has been accounted for as contributed capital.\nDuring the fourth quarter of the year ended July 31, 2022, Reddington Partners LLC, the majority shareholder, advanced the Company $37,649 to pay for general operating expenses. The advances are non-interest bearing and due on demand.\nOn June 8, 2022, Reddington Partners LLC converted its Series A Preferred Shares into 10,000,000 common shares. ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES\nThe aggregate fees billed for the most recently completed fiscal year ended July 31, 2022 and 2021 for professional services rendered by the principal accountant for the audit of our annual financial statements and review of the financial statements included in our quarterly reports on Form 10-Q and services that are normally provided by the accountant in connection with statutory and regulatory filings or engagements for these fiscal periods were as follows:\nYear Ended\nJuly 31, 2022 July 31, 2021\nAudit Fees $ 5,500 $ -\nAudit Related Fees - -\nTax Fees - -\nAll Other Fees - -\nTotal $ 5,500 $ -\nOur board of directors pre-approves all services provided by our independent auditors. All of the above services and fees were reviewed and approved by the board of directors either before or after the respective services were rendered.\nOur board of directors has considered the nature and amount of fees billed by our independent auditors and believes that the provision of services for activities unrelated to the audit is compatible with maintaining our independent auditors independence.\nPART IV ITEM 15. EXHIBITS\nExhibit Number\nExhibit Description\n31.1\nSection 302 Certification under Sarbanes-Oxley Act of 2002.\n32.1\nSection 906 Certification under Sarbanes-Oxley Act of 2002.\n(101)\nInteractive Data File (Form 10-K for the Year Ended July 31, 2022)\n101.INS\nInline XBRL Instance Document\n101.SCH\nInline XBRL Taxonomy Extension Schema Document.\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document.\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document.\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document.\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document.\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101).\nITEM 16. FORM 10-K SUMMARY\nNone\nSIGNATURES\nPursuant to the requirements of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nMYSON, INC.\nDated: October 28, 2022 /s/ Henrik Rouf\nHenrik Rouf\nDirector, CEO and CFO (principal executive, accounting and financial officer)"
}