{
    "cik": "1880249",
    "company": "Perfect Solutions Group, Inc.",
    "filing_type": "10-K",
    "filing_date": "2022-10-28",
    "period_of_report": "2022-07-31",
    "sic": "6770",
    "state_of_inc": "NVType",
    "state_location": "M0",
    "fiscal_year_end": "0731",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1880249/0001599916-22-000274-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1880249/000159991622000274/psgi_10ko.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1880249/0001599916-22-000274.txt",
    "filename": "1880249_10K_2022_0001599916-22-000274.htm",
    "content": "Item 1. Business.\n(a) Business Development\nPerfect Solutions Group, Inc. was incorporated by Jeffrey DeNunzio on June 29, 2021 in the State of Nevada. Jeffrey DeNunzios role was limited to that of an Incorporator.\nOn June 29, 2021, Jeffrey DeNunzio appointed Paul Moody as Chief Executive Officer, Chief Financial Officer, and Director of Perfect Solutions Group, Inc.\nOn September 7, 2021, the Company filed restated articles of incorporation.\nOn September 8, 2021, the Company entered into a Agreement and Plan of Merger, whereas it agreed to, and subsequently participated in, a Nevada holding company reorganization pursuant to NRS 92A.180, NRS 92A.200, NRS 92A.230 and NRS 92A.250 (Reorganization). The constituent corporations in the Reorganization were ALL-Q-TELL Corporation (ALLQ or Predecessor), Perfect Solutions Group, Inc. (Successor), and Perfect Solutions Merger Sub, Inc. (Merger Sub). At the time, Paul Moody was, the sole director/officer of each constituent corporation in the Reorganization.\nPerfect Solutions Group, Inc. issued 1,000 common shares of its common stock to Predecessor and Merger Sub issued 1,000 shares of its common stock to Perfect Solutions Group, Inc. immediately prior to the Reorganization. As such, immediately prior to the merger, Perfect Solutions Group, Inc. became a wholly owned direct subsidiary of ALL-Q-TELL Corporation and Merger Sub became a wholly owned and direct subsidiary of Perfect Solutions Group, Inc.\nPursuant to the above, on September 8, 2021, ALL-Q-TELL Corporation filed Articles of Merger with the Nevada Secretary of State. The merger became effective on September 15, 2021 at 4:00 PM EST (Effective Time). At the Effective Time, Predecessor was merged with and into Merger Sub (the Merger), and Predecessor became the surviving corporation. Each share of Predecessor common stock issued and outstanding immediately prior to the Effective Time was converted into one validly issued, fully paid and non-assessable share of Perfect Solutions Group, Inc.s (Successors) common stock.\nThe Company believes that the Reorganization, deemed effective on September 15, 2021, was not a transaction of the type described in subparagraph (a) of Rule 145 under the Securities Act of 1933 and the consummation of the Reorganization will not be deemed to involve an offer, offer to sell, offer for sale or sale within the meaning of Section 2(3) of the Securities Act of 1933. The Reorganization was consummated without the vote or consent of the Companys stockholders. In addition, the provisions of NRS 92A.180 did not provide a stockholder of the Company with appraisal rights in connection with the Reorganization. The Company believes that in the absence of any right of any of the Companys stockholders to vote with respect to the Reorganization or to insist that their shares be purchased for fair value, the Reorganization could not be deemed to involve an offer offer to sell; or sale within the meaning of Section 2(3) of the Securities Act of 1933.\nOn September 15, 2021, after the completion of the Holding Company Reorganization, we cancelled all of the stock we held in ALL-Q-TELL Corporation resulting in ALL-Q-TELL Corporation as a stand-alone company. Pursuant to the holding company merger agreement and effects of merger, all of the assets and liabilities, if any, remain with ALL-Q-TELL Corporation after the Reorganization. Paul Moody, whom at the time was the Director of ALL-Q-TELL Corporation, did not discover any assets of ALL-Q-TELL Corporation from the time he was appointed Director until the completion of the Reorganization and subsequent separation of ALL-Q-TELL Corporation as a stand-alone company.\nGiven that the former business plan and objectives of ALL-Q-TELL Corporation (ALLQ) and the present day business plan and objectives of Perfect Solutions Group, Inc. (PSGI) substantially differ from one another, we conducted the corporate separation with ALL-Q-TELL Corporation immediately after the effective time of the Reorganization in order to avoid any shareholder confusion. The former business plan of ALLQ (to operate sleep diagnostic machines and also provide diagnostic services to hospitals on a contractual basis) under the leadership of its former directors, does not, in any way, represent the current day blank check business plan of Perfect Solutions Group, Inc. It is our belief that ALLQ was a shell company at the time of the Reorganization. The result of corporate separation ameliorated shareholder confusion about our identity and/or corporate objectives. Furthermore, we wanted to continue trading in the OTC MarketPlace.\nThe corporate actions taken by the Company, including, but not limited to, the corporate structuring of the transactions, was deemed, in the discretion of our sole director, to be for the benefit of the corporation and its shareholders. Former shareholders of ALLQ are now the shareholders of PSGI. Each and every shareholder of ALLQ became a shareholder of PSGI with each share of capital stock of ALLQ held by former ALLQ shareholder becoming an equivalent amount of capital stock held in PSGI. The former shareholders of ALLQ now have the opportunity to benefit under our business plan and we have the opportunity to grow organically from our shareholder base and new leadership.\nPSGI began a quoted market in its common stock on November 19, 2021 when FINRA issued and released the ticker symbol PSGI into the marketplace for Perfect Solutions Group, Inc. The announcement of our Predecessors corporate action was posted on the FINRA daily list on November 18, 2021. The Market Effective date was November 19, 2021. The Company was assigned a CUSIP Number by CUSIP Global Services for its common stock of 71373M101 as obtained from Global Services on September 17, 2021 upon the effectiveness of the Corporate Action.\nThe Company intends to serve as a vehicle to affect an asset acquisition, merger, exchange of capital stock or other business combination with a domestic or foreign business.\nOn March 18, 2022, the Company entered into a Share Purchase Agreement (the Agreement) by and among CRS Consulting, LLC (CRS), and White Knight Co., Ltd., a Japan Company (WKC), pursuant to which, on March 21, 2022, (Closing Date), CRS sold 10,000 shares of the Companys Series Z Preferred Stock, representing approximately 94.58% voting control of the Company; 10,000 shares of Series Z Preferred Stock were transferred to WKC. WKC paid consideration of $60 for every share of Preferred Series Z Stock acquired (the Purchase Price). The consummation of the transaction contemplated by the Agreement resulted in a change in control of the Company, with WKC becoming the Companys largest controlling stockholder.\nOn the Closing Date, March 21, 2022, Paul Moody resigned as the Companys Chief Executive Officer, Chief Financial Officer, President, Secretary, Treasurer, and Director.\nOn the Closing Date, Mr. Koichi Ishizuka was appointed as the Companys Chief Executive Officer, Chief Financial Officer, President, Secretary, Treasurer, and Director. Mr. Ishizukas appointment as Director was effective upon the 10th day after the mailing of the Companys information statement on Schedule 14f-1 to the Companys stockholders. The resignation of Mr. Moody was not the result of any disagreement with the Company on any matter relating to its operations, policies, or practices.\nThe Company continues to intend to serve as a vehicle to affect an asset acquisition, merger, exchange of capital stock or other business combination with a domestic or foreign business. As of the date of this report, the Company had not yet commenced any such operations.\nThe Company has elected July 31st as its year end.\nWe use home office space of our sole officer and director at no cost.\nThe Company has been engaged in organizational efforts and obtaining initial financing. The Company seeks to serve as a vehicle to pursue a business combination and has made no efforts thus far to identify a possible business combination. As a result, the Company has not conducted negotiations or entered into a letter of intent concerning any target business. The business purpose of the Company is to seek the acquisition of or merger with an existing company.\nThe Company is an emerging growth company (EGC), that is exempt from certain financial disclosure and governance requirements for up to five years as defined in the Jumpstart Our Business Startups Act (the JOBS Act), that eases restrictions on the sale of securities; and increases the number of shareholders a company must have before becoming subject to the U.S. Securities and Exchange Commissions (SECs) reporting and disclosure rules (See Emerging Growth Companies Section Below).\n(b) Business Summary\nThe Company, based on proposed business activities, is a \"blank check\" company. The U.S. Securities and Exchange Commission (the SEC) defines those companies as \"any development stage company that is issuing a penny stock, within the meaning of Section 3 (a)(51)-1 of the Securities Exchange Act of 1934, as amended (the Exchange Act), and that has no specific business plan or purpose, or has indicated that its business plan is to engage in a merger or acquisition with an unidentified company or companies or other entity or person.\" Under SEC Rule 12b-2 under the Exchange Act, the Company also qualifies as a shell company, because it has no or nominal assets (other than cash) and no or nominal operations. Many states have enacted statutes, rules and regulations limiting the sale of securities of \"blank check\" companies in their respective jurisdictions. Management does not intend to undertake any efforts to cause a market to develop in our securities, either debt or equity.\nThe Company intends to comply with the periodic reporting requirements of the Exchange Act for so long as it is subject to those requirements.\nThe Companys current business plan is to serve as a vehicle to investigate and, if such investigation warrants, acquire a target company or business seeking the perceived advantages of being a publicly held corporation. The Companys principal business objective for the next 12 months and beyond such time will be to achieve long-term growth potential through a combination with a business rather than immediate, short-term earnings. The Company will not restrict its potential candidate target companies to any specific business, industry or geographical location and, thus, may acquire any type of business. The company may merge with or acquire another company in which the promoters, management, or promoters or managements affiliates or associates, directly or indirectly, have an ownership interest.\nA business combination would help us grow and cease to be a shell company.\nThe analysis of new business opportunities will be undertaken by, or under the supervision of, Koichi Ishizuka, the sole officer and director of the Registrant. As of this date, the Company has not entered into any definitive agreement with any party, nor have there been any specific discussions with any potential business combination candidate regarding business opportunities for the Company. The Registrant has unrestricted flexibility in seeking, analyzing and participating in potential business opportunities. In its efforts to analyze potential acquisition targets, the Registrant will consider the following kinds of factors:\n(a) Potential for growth, indicated by new technology, anticipated market expansion or new products;\n(b) Competitive position as compared to other firms of similar size and experience within the industry segment as well as within the industry as a whole;\n(c) Strength and diversity of management, either in place or scheduled for recruitment;\n(d) Capital requirements and anticipated availability of required funds, to be provided by the Registrant or from operations, through the sale of additional securities, through joint ventures or similar arrangements or from other sources;\n(e) The cost of participation by the Registrant as compared to the perceived tangible and intangible values and potentials;\n(f) The extent to which the business opportunity can be advanced;\n(g) The accessibility of required management expertise, personnel, raw materials, services, professional assistance and other required items; and,\n(h) Other relevant factors.\nIn applying the foregoing criteria, no one of which will be controlling, management will attempt to analyze all factors and circumstances and make a determination based upon reasonable investigative measures and available data. Potentially available business opportunities may occur in many different industries, and at various stages of development, all of which will make the task of comparative investigation and analysis of such business opportunities extremely difficult and complex. Due to the Registrant's limited capital available for investigation, the Registrant may not discover or adequately evaluate adverse facts about the opportunity to be acquired.\n- 1 -\nAdditionally, Perfect Solutions Group, Inc. will continue to be an insignificant participant in the business of seeking mergers with and acquisitions of business entities. A large number of established and well-financed entities, including venture capital firms, are active in mergers and acquisitions of companies which may be a merger or acquisition candidate for Perfect Solutions Group, Inc. Nearly all such entities have significantly greater financial resources, technical expertise and managerial capabilities than Perfect Solutions Group, Inc. and, consequently, we will be at a competitive disadvantage in identifying possible business opportunities and successfully completing a business combination. Moreover, Perfect Solutions Group, Inc. will also compete with numerous other small public companies in seeking merger or acquisition candidates.\nSecurity holders who received securities from us when we became a shell company are considered underwriters in connection with any resale of those securities until one year from the date Form 10 information has publicly filed, as specified in Rule 144(i). Shares of our common stock which are not registered with the Securities and Exchange Commission, but are currently held by shareholders, cannot be sold under the exemptions from registration provided by Rule 144 under or Section 4(1) of the Securities Act (Rule 144) so long as the Company is designated a shell company and for 12 months after it ceases to be a shell company, provided the Company otherwise is in compliance with the applicable rules and regulations. Compliance with the criteria for securing exemptions under federal securities laws and the securities laws of the various states is extremely complex, especially in respect of those exemptions affording flexibility and the elimination of trading restrictions in respect of securities received in exempt transactions and subsequently disposed of without registration under the Securities Act or state securities laws.\nIf the Company engages in a registration statement offering our securities for sale as a blank check company or with a company that would still be considered a shell company or blank check company, our securities will require registration subject to Rule 419. The Securities and Exchange Commission has adopted a rule (Rule 419) which defines a blank check company as (i) a development stage company, that is (ii) offering penny stock, as defined by Rule 3a51-1, and (iii) that has no specific business plan or purpose or has indicated that its business plan is to engage in a merger or acquisition with an unidentified company or companies. Should we file a registration statement offering of our securities for sale before we complete a business combination with an operating company, the Company would be considered a blank check company within the meaning of Rule 419 and any sales of the stock issued in the offering would require a registration under the Securities Act of 1933, as amended, furthermore, the registered securities and the proceeds from an offering subject to Rule 419 require the following:\na) Deposit and investment of proceeds\nAll offering proceeds, after deduction of cash paid for underwriting commissions, underwriting expenses and dealer allowances, and amounts permitted to be released to the registrant shall be deposited promptly into the escrow or trust account; provided, however, that no deduction may be made for underwriting commissions, underwriting expenses or dealer allowances payable to an affiliate of the registrant.\nb) Deposit of securities\nAll securities issued in connection with the offering, whether or not for cash consideration, and any other securities issued with respect to such securities, including securities issued with respect to stock splits, stock dividends, or similar rights, shall be deposited directly into the escrow or trust account promptly upon issuance. The identity of the purchaser of the securities shall be included on the stock certificates or other documents evidencing such securities.\nc) Release of deposited and funds securities\nPost-effective amendment for acquisition agreement. Upon execution of an agreement(s) for the acquisition(s) of a business(es) or assets that will constitute the business (or a line of business) of the registrant and for which the fair value of the business(es) or net assets to be acquired represents at least 80 percent of the maximum offering proceeds, including proceeds received or to be received upon the exercise or conversion of any securities offered, but excluding amounts payable to non-affiliates for underwriting commissions, underwriting expenses, and dealer allowances, the registrant shall file a post-effective amendment disclosing the entire transaction.\nIf we publicly offer any securities as a condition to the closing of any acquisition or business combination while we are a blank check or shell company, we will have to fully comply with SEC Rule 419 and deposit all funds in escrow pending advice about the proposed transaction to our stockholders fully disclosing all information required by Regulation 14 of the SEC and seeking the vote and agreement of investment of those stockholders to whom such securities were offered; if no response is received from these stockholders within 45 days thereafter or if any stockholder elects not to invest following our advice about the proposed transaction, all funds that must be held in escrow by us under Rule 419, as applicable, will be promptly returned to any such stockholder. All securities issued in any such offering will likewise be deposited in escrow, pending satisfaction of the foregoing conditions. In addition, if we enter into a transaction with a company that would still be considered a shell company or blank check company, the exemption from registration available from Rule 144, for the resales of our securities by our shareholders, would not be available to us.\nIn addition, the ability to register or qualify for sale any shares of stock for both initial sale and secondary trading would be limited because a number of states have enacted regulations pursuant to their securities or \"blue-sky\" laws restricting or, in some instances, prohibiting, the sale of securities of \"blank check\" issuers, such as the Company, within that state. In addition, many states, while not specifically prohibiting or restricting \"blank check\" companies, may not register the shares for sale in their states. Because of such regulations and other restrictions, the Company's selling efforts, if any, and any secondary market which may develop, may only be conducted in those jurisdictions where an applicable exemption is available or a blue sky application has been filed and accepted or where the shares have been registered thus limiting the issuers ability to complete this offering type.\n- 2 -\nForm of Acquisition\nThe manner in which the Registrant participates in an opportunity will depend upon the nature of the opportunity, the respective needs and desires of the Registrant and the promoters of the opportunity, and the relative negotiating strength of the Registrant and such promoters.\nIt is likely that the Registrant will acquire its participation in a business opportunity through the issuance of common stock or other securities of the Registrant. Although the terms of any such transaction cannot be predicted, it should be noted that in certain circumstances the criteria for determining whether or not an acquisition is a so-called \"tax free\" reorganization under Section 368(a)(1) of the Internal Revenue Code of 1986, as amended (the \"Code\") depends upon whether the owners of the acquired business own 80% or more of the voting stock of the surviving entity. If a transaction were structured to take advantage of these provisions rather than other \"tax free\" provisions provided under the Code, all prior stockholders would in such circumstances retain 10% or less of the total issued and outstanding shares of the surviving entity.\nOur management anticipates that we will likely be able to affect only one business combination, due primarily to our limited financing.\nWe anticipate difficulty in obtaining financing from other sources since we have no income and zero cash reserves. We are presently reliant on capital contributions towards expenses from our sole officer and director, Koichi Ishizuka. Our sole officer and director has not guaranteed that he will continue to support our capital needs. Therefore, we may not have the ability to continue as a going concern.\nThe present stockholders of the Registrant will likely not have control of a majority of the voting securities of the Registrant following a reorganization transaction. As part of such a transaction, all, or a majority of, the Registrant's directors (currently we have one director) may resign and one or more new directors may be appointed without any vote by stockholders.\nThe Company anticipates that prior to consummating any acquisition or merger, the Company, if required by relevant state laws and regulations, will seek to have the transaction approved by stockholders in the appropriate manner. Certain types of transactions may be entered into solely by Board of Directors approval without stockholder approval.\nUnder Nevada law, certain actions that would routinely be taken at a meeting of stockholders, may be taken by written consent of stockholders having not less than the minimum number of votes that would be necessary to authorize or take the action at a meeting of stockholders. Thus, if stockholders holding a majority of the outstanding shares decide by written consent to consummate an acquisition or a merger, minority stockholders would not be given the opportunity to vote on the issue. If stockholder approval is required, the Board will have discretion to consummate the transaction by written consent if it is determined to be in the Companys best interest to do so. Regardless of whether an acquisition or merger is approved by Board action alone, by written consent or by holding a stockholders' meeting, the Company will provide to its stockholders complete disclosure documentation concerning the potential target including requisite financial statements. This information will be disseminated by proxy statement in the event a stockholders' meeting is held, or by an information statement if the action is taken by written consent.\nIt is anticipated that the investigation of specific business opportunities and the negotiation, drafting and execution of relevant agreements, disclosure documents and other instruments will require substantial management time and attention and substantial cost for accountants, attorneys and others. We estimate such cost to be approximately $15,000. If a decision is made not to participate in a specific business opportunity, the costs theretofore incurred in the related investigation might not be recoverable. Furthermore, even if an agreement is reached for the participation in a specific business opportunity, the failure to consummate that transaction may result in the loss to the Company of the related costs incurred.\nWe presently have no employees apart from our management, which consists of one person, our sole officer and director, Mr. Koichi Ishizuka. Our sole officer and director is engaged in outside business activities and anticipates that he will devote to our business approximately five (5) hours per week until the acquisition of a successful business opportunity has been identified. We expect no significant changes in the number of our employees other than such changes, if any, incident to a business combination.\nFurthermore, the analysis of new business opportunities will be undertaken by, or under the supervision of, Koichi Ishizuka, the sole officer and director of the Company, who is not a professional business analyst and in all likelihood will not be experienced in matters relating to the target business opportunity. The inexperience of Mr. Ishizuka and the fact that the analysis and evaluation of a potential business combination is to be taken under his supervision may adversely impact the Companys ability to identify and consummate a successful business combination. There is no guarantee that Mr. Ishizuka will be able to identify a business combination target that is suitable for the Company. Koichi Ishizuka, the sole officer and director of the company, may hire third parties to conduct an analysis for a target company or any other business opportunities.\n(c) Reports to security holders.\n(1) The Company is not required to deliver an annual report to security holders and at this time does not anticipate the distribution of such a report.\n(2) The Company will file reports with the SEC. The Company will be a reporting company and will comply with the requirements of the Exchange Act.\n(3) The public may read and copy any materials the Company files with the SEC in the SEC's Public Reference Section, Room 1580, 100 F Street N.E., Washington, D.C. 20549. The public may obtain information on the operation of the Public Reference Section by calling the SEC at 1-800-SEC-0330. Additionally, the SEC maintains an Internet site that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC, which can be found at http://www.sec.gov.\nEmerging Growth Company\nWe are an emerging growth company under the JOBS Act. We shall continue to be deemed an emerging growth company until the earliest of:\n(a) the last day of the fiscal year of the issuer during which it had total annual gross revenues of $1,070,000,000 (as such amount is indexed for inflation every 5 years by the Commission to reflect the change in the Consumer Price Index for All Urban Consumers published by the Bureau of Labor Statistics, setting the threshold to the nearest 1,000,000) or more;\n(b) the last day of the fiscal year of the issuer following the fifth anniversary of the date of the first sale of common equity securities of the issuer pursuant to an effective IPO registration statement;\n(c) the date on which such issuer has, during the previous 3-year period, issued more than $1,000,000,000 in non-convertible debt; or\n(d) the date on which such issuer is deemed to be a large accelerated filer, as defined in section 240.12b-2 of title 17, Code of Federal Regulations, or any successor thereto.\nAs an emerging growth company, we are exempt from Section 404(b) of Sarbanes Oxley. Section 404(a) requires Issuers to publish information in their annual reports concerning the scope and adequacy of the internal control structure and procedures for financial reporting. This statement shall also assess the effectiveness of such internal controls and procedures. Section 404(b) requires that the registered accounting firm shall, in the same report, attest to and report on the assessment on the effectiveness of the internal control structure and procedures for financial reporting.\nAs an emerging growth company, we are also exempt from Section 14A (a) and (b) of the Securities Exchange Act of 1934 which require the shareholder approval of executive compensation and golden parachutes.\nWe have elected to use the extended transition period for complying with new or revised accounting standards under Section 102(b)(2) of the Jobs Act, that allows us to delay the adoption of new or revised accounting standards that have different effective dates for public and private companies until those standards apply to private companies. As a result of this election, our financial statements may not be comparable to companies that comply with public company effective dates.\n- 3 - Item 1A. Risk Factors.\nThe Company qualifies as a smaller reporting company, as defined by Item 10 of Regulation S-K and, thus, is not required to provide the information required by this Item. Item 1B. Unresolved Staff Comments.\nNone. Item 2. Properties.\nWe neither rent nor own any properties. We currently have no policy with respect to investments or interests in real estate, real estate mortgages or securities of, or interests in, persons primarily engaged in real estate activities. We currently utilize the home office space and equipment of our management at no cost. Item 3. Legal Proceedings.\nFrom time to time, we may become party to litigation or other legal proceedings that we consider to be a part of the ordinary course of our business. We are not currently involved in legal proceedings that could reasonably be expected to have a material adverse effect on our business, prospects, financial condition, or results of operations. To the best of our knowledge, no adverse legal activity is anticipated or threatened. Item 4. Mine Safety Disclosures.\nNot applicable.\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities.\nMarket Information\nOur Common Stock is quoted and traded on the over-the-counter market (the OTC Markets) in the Pink Open® Market (the Pink Market) under the symbol PSGI. There is currently a limited trading market in the Companys shares of Common Stock.\nSet forth below are the range of high and low bid closing bid prices for the periods indicated as reported by the OTC Markets Group Inc. The market quotations reflect inter-dealer prices, without retail mark-up, mark-down, or commissions and may not necessarily represent actual transactions.\nPerfect Solutions Group, Inc. was incorporated on June 29, 2021 in the State of Nevada. Perfect Solutions Group, Inc. began a quoted market in its common stock on November 19, 2021 when FINRA issued and released the ticker symbol PSGI into the marketplace for Perfect Solutions Group, Inc.\nQuarter Ended High Bid Low Bid\nJuly 31, 2022 $0.128 $0.014\nApril 30, 2022 $0.25 $0.02\nJanuary 31, 2022 $0.02 $0.0001\nHolders\nAs of the date of this Annual Report, we have 573,271,545 shares of Common Stock, $0.0001 par value, issued and outstanding and 10,000 shares of Series Z Preferred Stock, $0.0001 par value, issued and outstanding. Shares of Series Z Preferred Stock have no conversion rights to any other class, and every vote of Series Z Preferred Stock has voting rights equal to 1,000,000 votes of Common Stock.\nAs of the date of this Annual Report, we have approximately 116 shareholders of record of our Common Stock. This is inclusive of Cede and Co., which is deemed to be one shareholder of record. For further clarification, Cede & Co. is currently defined by the NASDAQ, as a Nominee name for The Depository Trust Company, a large clearing house that holds shares in its name for banks, brokers and institutions in order to expedite the sale and transfer of stock.\nAs of the date of this Annual Report, we have 1 shareholder of record holding shares of Preferred Stock. This is our controlling shareholder, White Knight Co., Ltd., a Japan Company. Koichi Ishizuka owns and controls White Knight Co., Ltd.\nVoting\nEach share of common stock has voting rights of one vote per share.\nSeries Z Preferred Stock has no conversion rights to any other class, and every vote of Series Z Preferred Stock has voting rights equal to 1,000,000 votes of Common Stock.\nDividends and Share Repurchases\nWe have not paid any dividends to our stockholders. There are no restrictions, which would limit our ability to pay dividends on common equity or that are likely to do so in the future.\nIssuer Purchases of Equity Securities\nNone.\nEquity Compensation Plan Information\nWe do not have any equity compensation plans, either approved or not approved, by our security holders.\nRecent Sales of Unregistered Securities; Uses of Proceeds from Registered Securities\nNone.\nPurchases of Equity Securities by the Issuer and Affiliated Purchasers\nNone.\n- 4 - Item 6. Selected Financial Data.\nAs a smaller reporting company, we are not required to provide the information required by this Item. Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations.\nWe are currently investigating and, if such investigation warrants, looking to acquire or merge with a target company or business seeking the perceived advantages of being a publicly held corporation. We are an emerging growth company (EGC) that is exempt from certain financial disclosure and governance requirements for up to five years as defined in the Jumpstart Our Business Startups Act (the JOBS Act), that eases restrictions on the sale of securities; and increases the number of shareholders a company must have before becoming subject to the U.S. Securities and Exchange Commissions (SECs) reporting and disclosure rules (See Emerging Growth Companies section above). Our principal business objective for the next 12 months and beyond such time will be to achieve long-term growth potential through a combination with a business rather than immediate, short-term earnings. We will not restrict our potential candidate target companies to any specific business, industry or geographical location and, thus, may acquire any type of business.\nThe risks we may face if the target business we may intend to merge with is financially unstable include but are not limited to difficulty in achieving future financing, continuing operations, bankruptcy, litigation, and increasing business operations on a limited or no budget.\nWe, the registrant, will not pay a cash finders fee for the consummation of any business acquisition the Company makes pursuant to its current business plan. Additionally, at this time we do not plan to issue securities as a finders fee.\nWe have elected to use the extended transition period for complying with new or revised accounting standards under Section 102(b)(2) of the Jobs Act, that allows us to delay the adoption of new or revised accounting standards that have different effective dates for public and private companies until those standards apply to private companies. As a result of this election, our financial statements may not be comparable to companies that comply with public company effective dates.\nWe do not currently engage in any business activities that provide cash flow. The costs of investigating and analyzing business combinations for the next 12 months and beyond such time will be paid with money in our treasury or with additional amounts, as necessary, to be loaned to or invested in us by our management or other potential investors.\nAt this time, we are entirely reliant upon cash contributions made by our sole officer and director to pay for any and all expenses.\nDuring the next 12 months we anticipate incurring costs related to:\n(i) filing of Exchange Act reports (legal, accounting and auditing fees) in the amount of approximately $5,000; and\n(ii) costs relating to consummating an acquisition in the amount of approximately $10,000 to pay for legal fees and audit fees.\nWe believe we will be able to meet the costs of filing Exchange Act reports during the next 12 months through use of funds to be loaned to or invested in us by Mr. Koichi Ishizuka, our sole officer and director. However, there is no guarantee that such additional funds will be made available to us or on terms that are favorable to us. If we enter into a business combination with a target entity, we will require the target company to pay the acquisition related fees and expenses as a condition precedent to such an agreement. To date, we have had no discussions with our sole officer and director, Mr. Koichi Ishizuka, regarding funding and no funding commitment for future expenses has been obtained. If in the future we need funds to pay expenses, we will consider these and other yet to be identified options for raising funds and/or paying expenses. Obviously, if Mr. Ishizuka, does not loan to or invest sufficient funds in us, then we will not be able to meet our SEC reporting obligations and will not be able to attract a private company with which to combine.\nWe have negative working capital, a stockholder deficit, and have no source of revenues. These conditions raise substantial doubt about our ability to continue as a going concern. Going forward, we will be devoting our efforts to locating merger candidates. Our ability to continue as a going concern is dependent upon our ability to develop additional sources of capital, locate and complete a merger with another company, and ultimately, achieve profitable operations.\nThe Company may consider a business which has recently commenced operations, is in need of additional funds for expansion into new products or markets, is seeking to develop a new product or service, or is an established business which may be experiencing financial or operating difficulties and is in need of additional capital. Our management believes that the public company status that results from a combination with the Company will provide such company greater access to the capital markets, increase its visibility in the investment community, and offer the opportunity to utilize its stock to make acquisitions. However, there is no assurance that the Company will have greater access to capital due to its public company status, and therefore a business combination with an operating company in need of additional capital may expose the Company to additional risks and challenges. In the alternative, a business combination may involve the acquisition of, or merger with, a company which does not need substantial additional capital, but which desires to establish a public trading market for its shares, while avoiding, among other things, the time delays, significant expense, and loss of voting control which may occur in a public offering.\n- 5 -\nWe have, and will continue to have, no capital with which to provide the owners of business entities with any cash or other assets. However, we offer owners of target businesses the opportunity to acquire a controlling ownership interest in a reporting company without the time required to become a reporting company by other means. Nevertheless, upon affecting an acquisition or merger with us, there will be costs and time required by the target business to provide comprehensive business and financial disclosure, such as the terms of the transaction and a description of the business and management of the target business, among other things, and will include audited consolidated financial statements of the Company giving effect to the business combination, as part of a filing on Form 8-K.\nOur sole officer and director has not had any preliminary contact or discussions with any representative of any other entity regarding a business combination with us. Any target business that is selected may be a financially unstable company or an entity in its early stages of development or growth, including entities without established records of sales or earnings. In that event, we will be subject to numerous risks inherent in the business and operations of financially unstable and early stage or potential emerging growth companies. In addition, we may affect a business combination with an entity in an industry characterized by a high level of risk, and, although our management will endeavor to evaluate the risks inherent in a particular target business, there can be no assurance that we will properly ascertain or assess all significant risks.\nOur management anticipates that we will likely be able to affect only one business combination, due primarily to our limited financing. This lack of diversification should be considered a substantial risk in investing in us, because it will not permit us to offset potential losses from one venture against gains from another.\nCurrent economic and financial conditions are volatile and affect the selection of a business combination and increase the complex ability of the Companys goals. Business and consumer concerns over the economy, geopolitical issues, the availability and cost of credit, the U.S. financial markets and the national debt have contributed to this volatility. These factors, combined with declining and failing businesses, reduced consumer confidence and increased unemployment, have caused a global slowdown. We cannot accurately predict how long these current economic conditions will persist; whether the economy will deteriorate further and how we will be affected.\nBecause of general economic conditions, rapid technological advances being made in some industries, and shortages of available capital, our management believes that there are the perceived benefits of becoming a publicly traded corporation. Such perceived benefits of becoming a publicly traded corporation include, among other things, facilitating or improving the terms on which additional equity financing may be obtained, providing liquidity for the principals of and investors in a business, creating a means for providing incentive stock options or similar benefits to key employees, and offering greater flexibility in structuring acquisitions, joint ventures and the like through the issuance of stock. Potentially available business combinations may occur in many different industries and at various stages of development, all of which will make the task of comparative investigation and analysis of such business opportunities extremely difficult and complex.\nWe intend to search for a target business combination by contacting various sources including, but not limited to, our affiliates, lenders, investment banking firms, private equity funds, financial advisors and similar persons, accounting firms and attorneys notwithstanding us contacting any business directly. The approximate number of persons or entities that will be contacted is unknown and dependent on whether any opportunities are presented by the sources that we contact. However, there is no assurance that we will locate a target company for a business combination.\nLiquidity\nWe have no known demands or commitments and are not aware of any events or uncertainties as of July 31, 2022 and July 31, 2021 that will result in or that are reasonably likely to materially increase or decrease our current liquidity.\nCapital Resources.\nWe had no material commitments for capital expenditures as of July 31, 2022 and July 31, 2021.\nOff Balance Sheet Arrangements.\nWe do not have any off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources that is material to investors. Item 7A. Quantitative and Qualitative Disclosures about Market Risk.\nWe qualify as a smaller reporting company, as defined by Item 10 of Regulation S-K and, thus, are not required to provide the information required by this Item.\n- 6 - Item 8. Financial Statements and Supplementary Data.\nPerfect Solutions Group, Inc.\nFINANCIAL STATEMENTS\nPages\nReport of Independent Registered Public Accounting Firm (PCAOB FIRM ID 5041)\nBalance Sheets\nStatements of Operations\nStatements of Changes in Stockholders Deficit\nStatements of Cash Flows\nNotes to Financial Statements -F8\n- -\nReport of Independent Registered Public Accounting Firm\nTo the shareholders and the board of directors of Perfect Solutions Group, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of Perfect Solutions Group, Inc. (the \"Company\") as of July 31, 2022 and 2021, the related statements of operations, stockholders' equity (deficit), and cash flows for the years then ended, and the related notes (collectively referred to as the \"financial statements\"). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of July 31, 2022 and 2021, and the results of its operations and its cash flows for the years then ended, in conformity with accounting principles generally accepted in the United States.\nSubstantial Doubt about the Companys Ability to Continue as a Going Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 3 to the financial statements, the Companys significant operating losses raise substantial doubt about its ability to continue as a going concern. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (\"PCAOB\") and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audit provides a reasonable basis for our opinion.\n/s/ BF Borgers CPA PC\nBF Borgers CPA PC\nWe have served as the Company's auditor since 2021\nLakewood, CO\nOctober 28, 2022\n- -\nPerfect Solutions Group, Inc.\nBalance Sheet\nJuly 31, 2022\nJuly 31, 2021\nTOTAL ASSETS $ - $ -\nLIABILITIES AND STOCKHOLDERS DEFICIT\nCURRENT LIABILITIES\nAccrued Expenses $ - $ 3,750\nTOTAL LIABILITIES $ - $ 3,750\nStockholders Equity (Deficit)\nPreferred stock ($0.0001 par value, 100,000,000 shares authorized as of July 31, 2022 and $0.0001 par value, 5,000,000 shares authorized as of July 31, 2021); 10,000 and 0 issued and outstanding as of July 31, 2022 and July 31, 2021, respectively)\n-\nCommon stock ($0.0001 par value, 1,400,000,000 shares authorized as of July 31, 2022 and $0.0001 par value, 200,000,000 shares authorized as of July 31, 2021); 573,271,545 and 0 issued and outstanding as of July 31, 2022 and July 31, 2021, respectively)\n57,327\n-\nAdditional paid-in capital\n(39,518)\nAccumulated deficit\n(17,810)\n(4,710)\nTotal Stockholders Equity (Deficit)\n-\n(3,750)\nTOTAL LIABILITIES & STOCKHOLDERS EQUITY (DEFICIT) $ - $ -\nThe accompanying notes are an integral part of these audited financial statements.\n- -\nPerfect Solutions Group Inc.\nStatements of Operations\nYear Ended\nJuly 31, 2022\nFor the Period June 29, 2021 (Inception) to July 31, 2021\nOperating Expenses\nGeneral and administrative expenses $ 13,100\n$ 4,710\nTotal Operating Expenses\n13,100\n4,710\nNet Income/ Loss $ (13,100)\n$ (4,710)\nBasic and Diluted net loss per common share $ (0.00)\n$\n(0.00)\nWeighted average number of common shares outstanding\n502,682,798\n-\nThe accompanying notes are an integral part of these audited financial statements.\n- -\nPerfect Solutions Group, Inc.\nStatement of Changes in Stockholders' Deficit\nFor the Period from June 29, 2021 (Inception) to July 31, 2022\nCommon Shares\nPar Value Common Shares Series Z Preferred Shares\nPar Value Preferred Shares\nAdditional Paid-in Capital\nAccumulated Deficit\nTotal\nDate of inception June 29, 2021\n- $ -\n-\n$\n-\n$ - $ - $ -\nExpenses paid on behalf of the company and contributed to capital\n-\n-\n-\n-\n-\nNet loss\n-\n- -\n-\n-\n(4,710)\n(4,710)\nBalances, July 31, 2021\n- $ -\n-\n$\n- $ $ (4,710) $ (3,750)\nCommon shares issued in reorganization\n573,271,545\n57,327\n-\n-\n(57,327)\n-\n-\nPreferred shares issued in reorganization\n-\n-\n10,000\n(1)\n-\n-\nExpenses paid on behalf of the Company and contributed to capital\n-\n-\n-\n-\n16,850\n-\n16,850\nNet loss\n-\n- -\n-\n-\n(13,100)\n(13,100)\nBalances, July 31, 2022\n573,271,545 $ 57,327\n10,000\n$\n$ (39,518) $ (17,810) $ -\nThe accompanying notes are an integral part of these audited financial statements.\n- -\nPerfect Solutions Group, Inc.\nStatements of Cash Flows\nYear Ended July 31, 2022\nFor the Period\nJune 29, 2021\n(Inception) to\nJuly 31, 2021\nCASH FLOWS FROM OPERATING ACTIVITIES\nNet loss $ (13,100) $ (4,710)\nChanges in current assets and liabilities:\nAccrued expenses\n(3,750)\n3,750\nNet cash used in operating activities\n(16,850)\n(960)\nCASH FLOWS FROM FINANCING ACTIVITIES\nExpenses contributed to capital $ 16,850 $\nNet cash used in financing activities\n16,850\nNet change in cash $ - $ -\nBeginning cash balance\n-\n-\nEnding cash balance $ - $ -\nSUPPLEMENTAL DISCLOSURE OF CASH FLOW INFORMATION:\nInterest paid $ - $ -\nIncome taxes paid $ - $ -\nThe accompanying notes are an integral part of these financial statements.\n- -\nPerfect Solutions Group, Inc.\nNotes to the Audited Financial Statements\nNote 1 - Organization and Description of Business\nPerfect Solutions Group, Inc. was incorporated by Jeffrey DeNunzio on June 29, 2021 in the State of Nevada. Jeffrey DeNunzios role was limited to that of an Incorporator.\nOn June 29, 2021, Jeffrey DeNunzio appointed Paul Moody as Chief Executive Officer, Chief Financial Officer, and Director of Perfect Solutions Group, Inc.\nOn September 7, 2021, the Company filed restated articles of incorporation.\nOn September 15, 2021, Perfect Solutions, Inc. completed a holding company merger with ALL-Q-Tell Corporation. All the former shareholders of ALL-Q-Tell Corporation became the shareholders of Perfect Solutions Group, Inc. with each shareholder holding an equivalent economic interest as they held in All-Q-Tell Corporation. CRS Consulting, LLC, a Wyoming LLC owned and controlled by Jeffrey DeNunzio, Thomas DeNunzio and Paul Moody, became the Companys controlling shareholder, owning 10,000 shares of Series Z Preferred Stock. Series Z Preferred Stock has no conversion rights to any other class, and every vote of Series Z Preferred Stock has voting rights equal to 1,000,000 votes of Common Stock.\nOn March 18, 2022, the Company entered into a Share Purchase Agreement (the Agreement) by and among CRS Consulting, LLC (CRS), and White Knight Co., Ltd., a Japan Company (WKC), pursuant to which, on March 21, 2022, (Closing Date), CRS sold 10,000 shares of the Companys Series Z Preferred Stock, representing approximately 94.58% voting control of the Company; 10,000 shares of Series Z Preferred Stock were transferred to WKC. WKC paid consideration of $60 for every share of Preferred Series Z Stock acquired (the Purchase Price). The consummation of the transaction contemplated by the Agreement resulted in a change in control of the Company, with WKC becoming the Companys largest controlling stockholder.\nOn the Closing Date, March 21, 2022, Mr. Paul Moody resigned as the Companys Chief Executive Officer, Chief Financial Officer, President, Secretary, Treasurer. In addition, Mr. Moody resigned as Director on the Closing Date and his resignation was effective upon the 10th day after the mailing of the Companys information statement on Schedule 14f-1 to the Companys stockholders. On the Closing Date, Mr. Koichi Ishizuka was appointed as the Companys Chief Executive Officer, Chief Financial Officer, President, Secretary, Treasurer, and Director. Mr. Ishizukas appointment as Director was effective upon the 10th day after the mailing of the Companys information statement on Schedule 14f-1 to the Companys stockholders. The resignation of Mr. Moody was not the result of any disagreement with the Company on any matter relating to its operations, policies, or practices. There is no arrangement or understanding among the newly appointed officers and directors or any other person pursuant to which they were appointed as a director and officer of the Company.\nThe Company intends to serve as a vehicle to affect an asset acquisition, merger, exchange of capital stock or other business combination with a domestic or foreign business. As of July 31, 2022, the Company had not yet commenced any operations.\nThe Company has elected July 31st as its year end.\nNote 2 - Summary of Significant Accounting Policies\nBasis of Presentation\nThis summary of significant accounting policies is presented to assist in understanding the Company's financial statements. These accounting policies conform to accounting principles, generally accepted in the United States of America, and have been consistently applied in the preparation of the financial statements.\nUse of Estimates\nThe preparation of financial statements in conformity with generally accepted accounting principles requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. In the opinion of management, all adjustments necessary in order to make the financial statements not misleading have been included. Actual results could differ from those estimates.\nCash and Cash Equivalents\nThe Company considers all highly liquid investments with an original maturity of three months or less when purchased to be cash equivalents. Cash and cash equivalents as of July 31, 2022 and July 31, 2021 were $0 for both periods.\nIncome Taxes\nThe Company accounts for income taxes under ASC 740, Income Taxes. Under the asset and liability method of ASC 740, deferred tax assets and liabilities are recognized for the future tax consequences attributable to differences between the financial statements carrying amounts of existing assets and liabilities and their respective tax bases. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period the enactment occurs. A valuation allowance is provided for certain deferred tax assets if it is more likely than not that the Company will not realize tax assets through future operations. No deferred tax assets or liabilities were recognized as of July 31, 2022.\nBasic Earnings (Loss) Per Share\nThe Company computes basic and diluted earnings (loss) per share in accordance with ASC Topic 260, Earnings per Share. Basic earnings (loss) per share is computed by dividing net income (loss) by the weighted average number of common shares outstanding during the reporting period. Diluted earnings (loss) per share reflects the potential dilution that could occur if stock options and other commitments to issue common stock were exercised or equity awards vest resulting in the issuance of common stock that could share in the earnings of the Company.\nThe Company does not have any potentially dilutive instruments as of July 31, 2022 and, thus, anti-dilution issues are not applicable.\n- -\nFair Value of Financial Instruments\nThe Companys balance sheet includes certain financial instruments. The carrying amounts of current assets and current liabilities approximate their fair value because of the relatively short period of time between the origination of these instruments and their expected realization.\nASC 820, Fair Value Measurements and Disclosures, defines fair value as the exchange price that would be received for an asset or paid to transfer a liability (an exit price) in the principal or most advantageous market for the asset or liability in an orderly transaction between market participants on the measurement date. ASC 820 also establishes a fair value hierarchy that distinguishes between (1) market participant assumptions developed based on market data obtained from independent sources (observable inputs) and (2) an entitys own assumptions about market participant assumptions developed based on the best information available in the circumstances (unobservable inputs). The fair value hierarchy consists of three broad levels, which gives the highest priority to unadjusted quoted prices in active markets for identical assets or liabilities (Level 1) and the lowest priority to unobservable inputs (Level 3). The three levels of the fair value hierarchy are described below:\n- Level 1 - Unadjusted quoted prices in active markets that are accessible at the measurement date for identical, unrestricted assets or liabilities.\n- Level 2 - Inputs other than quoted prices included within Level 1 that are observable for the asset or liability, either directly or indirectly, including quoted prices for similar assets or liabilities in active markets; quoted prices for identical or similar assets or liabilities in markets that are not active; inputs other than quoted prices that are observable for the asset or liability (e.g., interest rates); and inputs that are derived principally from or corroborated by observable market data by correlation or other means.\n- Level 3 - Inputs that are both significant to the fair value measurement and unobservable.\nFair value estimates discussed herein are based upon certain market assumptions and pertinent information available to management as of July 31, 2022. The respective carrying value of certain on-balance-sheet financial instruments approximated their fair values due to the short-term nature of these instruments. These financial instruments include accrued expenses.\nRelated Parties\nThe Company follows ASC 850, Related Party Disclosures, for the identification of related parties and disclosure of related party transactions.\nShare-Based Compensation\nASC 718, Compensation - Stock Compensation, prescribes accounting and reporting standards for all share-based payment transactions in which employee services are acquired. Transactions include incurring liabilities, or issuing or offering to issue shares, options, and other equity instruments such as employee stock ownership plans and stock appreciation rights. Share-based payments to employees, including grants of employee stock options, are recognized as compensation expense in the financial statements based on their fair values. That expense is recognized over the period during which an employee is required to provide services in exchange for the award, known as the requisite service period (usually the vesting period).\nThe Company accounts for stock-based compensation issued to non-employees and consultants in accordance with the provisions of ASC 505-50, Equity - Based Payments to Non-Employees. Measurement of share-based payment transactions with non-employees is based on the fair value of whichever is more reliably measurable: (a) the goods or services received; or (b) the equity instruments issued. The fair value of the share-based payment transaction is determined at the earlier of performance commitment date or performance completion date.\nThe Company had no stock-based compensation plans as of July 31, 2022.\nThe Companys stock-based compensation for the periods ended July 31, 2022 and July 31, 2021 was $0 for both periods.\nRecently Issued Accounting Pronouncements\nIn February 2016, the FASB issued ASU 2016-02, Leases (Topic 842). ASU 2016-02 is amended by ASU 2018-01, ASU2018-10, ASU 2018-11, ASU 2018-20 and ASU 2019-01, which FASB issued in January 2018, July 2018, July 2018, December 2018 and March 2019, respectively (collectively, the amended ASU 2016-02). The amended ASU 2016-02 requires lessees to recognize on the balance sheet a right-of-use asset, representing its right to use the underlying asset for the lease term, and a lease liability for all leases with terms greater than 12 months. The recognition, measurement, and presentation of expenses and cash flows arising from a lease by a lessee have not significantly changed from current GAAP. The amended ASU 2016-02 retains a distinction between finance leases (i.e. capital leases under current GAAP) and operating leases. The classification criteria for distinguishing between finance leases and operating leases will be substantially similar to the classification criteria for distinguishing between capital leases and operating leases under current GAAP. The amended ASU 2016-02 also requires qualitative and quantitative disclosures designed to assess the amount, timing, and uncertainty of cash flows arising from leases. A modified retrospective transition approach is permitted to be used when an entity adopts the amended ASU 2016-02, which includes a number of optional practical expedients that entities may elect to apply.\nWe have no assets and or leases and do not believe we will be impacted in the foreseeable future by the newly adopted accounting standard(s) mentioned above.\nThe Company has implemented all new accounting pronouncements that are in effect and that may impact its financial statements and does not believe that there are any other new pronouncements that have been issued that might have a material impact on its financial position or results of operations.\nNote 3 - Going Concern\nThe Companys financial statements are prepared in accordance with generally accepted accounting principles applicable to a going concern that contemplates the realization of assets and liquidation of liabilities in the normal course of business.\nThe Company demonstrates adverse conditions that raise substantial doubt about the Company's ability to continue as a going concern for one year following the issuance of these financial statements. These adverse conditions are negative financial trends, specifically operating loss, working capital deficiency, and other adverse key financial ratios.\nThe Company has not established any source of revenue to cover its operating costs. Management plans to fund operating expenses with related party contributions to capital. There is no assurance that management's plan will be successful. The financial statements do not include any adjustments relating to the recoverability and classification of recorded assets, or the amounts and classification of liabilities that might be necessary in the event that the Company cannot continue as a going concern.\nNote 4 - Income Taxes\nThe Company has not recognized an income tax benefit for its operating losses generated based on uncertainties concerning its ability to generate taxable income in future periods. The tax benefit for the period presented is offset by a valuation allowance established against deferred tax assets arising from the net operating losses, the realization of which could not be considered more likely than not. In future periods, tax benefits and related deferred tax assets will be recognized when management considers realization of such amounts to be more likely than not. As of July 31, 2022, the Company has incurred a net loss of approximately $17,810 which resulted in a net operating loss for income tax purposes. The loss results in a deferred tax asset of approximately $3,740 at the effective statutory rate of 21%. The deferred tax asset has been offset by an equal valuation allowance. Given our inception on June 29, 2021, and our fiscal year end of July 31, 2022, we have completed only two taxable fiscal years.\nPotential benefits of income tax losses are not recognized in the accounts until realization is more likely than not. In assessing the realization of deferred tax assets, management considers whether it is more likely than not that some portion or all of the deferred tax assets will be realized. The ultimate realization of deferred tax assets is dependent upon the generation of future taxable income during the periods in which those temporary differences become deductible. The Company has incurred a net operating loss carryforward of $17,810 which begins expiring in 2036. The Company has adopted ASC 740, Accounting for Income Taxes, as of its inception. Pursuant to ASC 740 the Company is required to compute tax asset benefits for non-capital losses carried forward. The potential benefit of the net operating loss has not been recognized in these financial statements because the Company cannot be assured it is more likely than not it will utilize the loss carried forward in future years.\nSignificant components of the Companys deferred tax assets are as follows:\nJuly 31,\nDeferred tax asset, generated from net operating loss\n$ 3,740\n$\nValuation allowance\n(3,740)\n(989)\n$ -\n$ -\nThe reconciliation of the effective income tax rate to the federal statutory rate is as follows:\nFederal income tax rate 21.0%\n21.0 %\nIncrease in valuation allowance (21.0%)\n(21.0 %)\nEffective income tax rate 0.0%\n0.0 %\nDue to the change in ownership provisions of the Tax Reform Act of 1986, net operating loss carryforwards for Federal income tax reporting purposes are subject to annual limitations. Should a change in ownership occur, net operating loss carryforwards may be limited as to use in future years.\nNote 5 - Commitments and Contingencies\nThe Company follows ASC 450-20, Loss Contingencies, to report accounting for contingencies. Liabilities for loss contingencies arising from claims, assessments, litigation, fines and penalties and other sources are recorded when it is probable that a liability has been incurred and the amount of the assessment can be reasonably estimated. There were no commitments or contingencies as of July 31, 2022.\nNote 6 - Shareholder Equity\nPreferred Stock\nThe authorized preferred stock of the Company consists of 100,000,000 shares with a par value of $0.0001. Of the 100,000,000 shares of Preferred Stock, 1,000,000 are designated as Series Z Preferred Stock. Series Z Preferred Stock has no conversion rights to any other class, and every vote of Series Z Preferred Stock has voting rights equal to 1,000,000 votes of Common Stock. There were 10,000 and 0 shares of preferred stock issued and outstanding as of July 31, 2022 and July 31, 2021, respectively.\nOn September 15, 2021, Perfect Solutions, Inc. completed a holding company merger with ALL-Q-Tell Corporation. All the former shareholders of ALL-Q-Tell Corporation became the shareholders of Perfect Solutions Group, Inc. with each shareholder holding an equivalent economic interest as they held in All-Q-Tell Corporation. CRS Consulting, LLC, a Wyoming LLC owned and controlled by Jeffrey DeNunzio, Thomas DeNunzio and Paul Moody, became the Companys controlling shareholder, owning 10,000 shares of Series Z Preferred Stock. Series Z Preferred Stock has no conversion rights to any other class, and every vote of Series Z Preferred Stock has voting rights equal to 1,000,000 votes of Common Stock.\nOn March 18, 2022, the Company entered into a Share Purchase Agreement by and among CRS Consulting, LLC (CRS), and White Knight Co., Ltd., a Japan Company (WKC), pursuant to which, on March 21, 2022, CRS sold 10,000 shares of the Companys Series Z Preferred Stock, representing approximately 94.58% voting control of the Company; 10,000 shares of Series Z Preferred Stock were transferred to WKC. WKC paid consideration of $60 for every share of Preferred Series Z Stock acquired. The consummation of the transaction contemplated by the Agreement resulted in a change in control of the Company, with WKC becoming the Companys largest controlling stockholder.\nCommon Stock\nThe authorized common stock of the Company consists of 1,400,000,000 shares with a par value of $0.0001. There were 573,271,545 and 0 shares of common stock issued and outstanding as of July 31, 2022 and July 31, 2021, respectively.\nOn September 15, 2021, Perfect Solutions, Inc. completed a holding company merger with ALL-Q-Tell Corporation. All the former shareholders of ALL-Q-Tell Corporation became the shareholders of Perfect Solutions Group, Inc. with each shareholder holding an equivalent economic interest as they held in All-Q-Tell Corporation.\nAdditional Paid-In Capital\nThe Companys sole officer and director, Koichi Ishizuka, paid expenses on behalf of the company totaling $5,850 during the period ended July 31, 2022.\nThe Companys former sole officer and director, Paul Moody, paid expenses on behalf of the company totaling $11,000 during the period ended July 31, 2022.\nThe Companys former sole officer and director, Paul Moody, paid expenses on behalf of the company totaling $960 during the period ended July 31, 2021.\nThe $17,810 in total payments are considered contributions to the company with no expectation of repayment and are posted as additional paid-in capital.\nNote 7 - Related-Party Transactions\nOffice Space\nWe utilize the home office space and equipment of our management at no cost.\nNote 8 - Subsequent Events\nManagement has reviewed financial transactions for the Company subsequent to the period ended July 31, 2022 and has found that there was nothing material to disclose.\n- - Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure.\nNone. Item 9A Controls and Procedures.\nEvaluation of Disclosure Controls and Procedures\nWe maintain disclosure controls and procedures, as such term is defined in Rule 13a-15e and Rule 15d-15(e) under the Exchange Act that are designed to ensure that information required to be disclosed in our reports filed under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in the SEC's rules and forms, and that such information is accumulated and communicated to our management, which at this time consists solely of our officer and director, Koichi Ishizuka.\nAs of July 31, 2022, the end of the year covered by this Report, we carried out an evaluation, under the supervision of Mr. Ishizuka, our Chief Executive Officer and Chief Financial Officer, of the effectiveness of the design and the operation of our disclosure controls and procedures. Mr. Ishizuka concluded that the disclosure controls and procedures were not effective as of the end of the year covered by this Report due to material weaknesses identified below.\nManagements Annual Report on Internal Control Over Financial Reporting\nOur management, comprised solely of Koichi Ishizuka, is responsible for establishing and maintaining adequate internal control over our financial reporting (as defined in Rule 13a-15(f) under the Exchange Act). Internal control over financial reporting is a process, including policies and procedures, designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external reporting purposes in accordance with U.S. generally accepted accounting principles. Our management assessed our internal control over financial reporting using the criteria in Internal Control - Integrated Framework (2013), issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). A system of internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. Because of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements.\nBased on our evaluation under the framework in COSO, our management concluded that our internal control over financial reporting was ineffective as of July 31, 2022 based on such criteria. Deficiencies existed in the design or operation of our internal control over financial reporting that adversely affect our internal controls and that may be considered material weaknesses. A material weakness is a significant deficiency, or combination of deficiencies, in internal control over financial reporting that results in more than a remote likelihood that a material misstatement of the annual or interim financial statements will not be prevented or detected. As a result of the determination that there was a lack of resources to provide segregation of duties consistent with control objectives, the lack of a formal audit committee, and the lack of a formal review process that includes multiple levels of review over financial disclosure and reporting processes, management has determined that material weaknesses existed as of July 31, 2022.\nThe weaknesses and the related risks are not uncommon in a company of our size because of the limitations in the size and number of our staff. To address these material weaknesses, and subject to the receipt of additional financing or cash flows, we intend to undertake remediation measures to address the material weaknesses described in this Report, including implementing procedures pursuant to which we can ensure segregation of duties and hire additional resources to ensure appropriate review and oversight.\nA control system, no matter how well conceived and operated, can provide only reasonable, not absolute, assurance that the objectives of the control system are met under all potential conditions, regardless of how remote, and may not prevent or detect all errors and all fraud. Because of the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues, if any, within the Company have been detected. These inherent limitations include the realities that judgments in decision-making can be faulty and that breakdowns can occur because of a simple error or mistake. Our internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles.\nAuditors Report on Internal Control Over Financial Reporting\nThis Report does not include an attestation report of our independent registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by our independent registered public accounting firm pursuant to the rules of the SEC that permit us to provide only managements report in this Report.\nChanges in Internal Control Over Financial Reporting\nThere have been no changes in our internal control over financial reporting (as that term is defined in Rules 13(a)-15(f) and 15(d)-15(f) of the Exchange Act) that have occurred during the fourth quarter ended July 31, 2022 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. Item 9B. Other Information.\nNone.\n- 7 -\nPART III Item 10. Directors, Executive Officers and Corporate Governance.\nEach of our directors holds office until the next annual meeting of our stockholders or until his successor has been elected and qualified, or until his death, resignation, or removal. Our executive officers are appointed by our board of directors and hold office until their death, resignation, or removal from office.\nOur current executive officers and directors and additional information concerning them are as follows:\nName\nAge\nPosition(s)\nKoichi Ishizuka\nChief Executive Officer, Chief Financial Officer, President, Secretary, Treasurer, and Director\nBusiness Experience\nThe following is a brief account of the education and business experience of our executive officers and directors during at least the past five years, indicating their principal occupation during the period, the name and principal business of the organization by which they were employed, and certain of their other directorships:\nKoichi Ishizuka, Chief Executive Officer, Chief Financial Officer, President, Secretary, Treasurer, and Director\nMr. Koichi Ishizuka attended the University of Aoyama Gakuin where he received his MBA in 2004. Several years later in 2011 he graduated from the Advanced Management Program at Harvard School of Business. Following Mr. Ishizukas formal education, he took a position as the head of marketing with Thomson Reuters, a mass media and information firm. Thereafter, he served as the CEO of Xinhua Finance Japan in 2006, Fate Corporation in 2008, and LCA Holdings., Ltd in 2009. Currently, Mr. Ishizuka serves as the Chief Executive Officer of OFF Line Co., Ltd., Photozou Co., Ltd., Photozou Holdings, Inc., Photozou Koukoku Co., Ltd., Off Line International, Inc. and OFF Line Japan Co., Ltd. He has held the position of CEO with OFF Line Co., Ltd. since 2013, Photozou Co., Ltd since 2016, Photozou Holdings, Inc since 2017, Photozou Koukoku Co., Ltd. since 2017, Zentrum Holdings, Inc. (formerly known as Off Line International, Inc.) since 2019 and OFF Line Japan Co., Ltd. since 2018. On November 18, 2020 he was appointed as Chief Financial Officer and Director, and on December 28, 2021 he was appointed Chief Executive Officer, of Next Meats Holdings, Inc.; he holds both positions to this date. Koichi Ishizuka also has an equity interest in Next Meats Holdings, Inc. Koichi Ishizuka is also Chief Financial Officer of Next Meats Co., Ltd., a Japanese alternative meat company. Since its inception on April 14, 2021, Koichi Ishizuka has served as CEO of WB Burgers Japan Co., Ltd., a Japanese Company. On May 7, 2021, Mr. Koichi Ishiukza was appointed as the Chief Executive Officer, Chief Financial Officer, President, Secretary, Treasurer, and Director of Business Solutions Plus, Inc., which is now known as WB Burgers Asia, Inc. On July 23, 2021, Mr. Ishizuka was appointed as Chief Executive Officer, Chief Financial Officer, President, Treasurer and Director of Dr. Foods, Inc. (formerly known as Catapult Solutions, Inc.). On March 21, 2022, Mr. Ishizuka was appointed as the Chief Executive Officer, Chief Financial Officer, President, Secretary, Treasurer, and Director of Perfect Solutions Group, Inc.\n- 8 -\nCommittees of the Board\nWe currently do not have nominating, compensation, or audit committees, or committees performing similar functions, nor do we have a written nominating, compensation, or audit committee charter. Our board of directors, comprised solely of Koichi Ishizuka, believes that it is not necessary to have such committees given our current size and the limited scope of our business. Currently, our board of directors is performing the functions of such committees.\nIn lieu of an Audit Committee, our board of directors, comprised solely of Koichi Ishizuka, is responsible for reviewing and making recommendations concerning the selection of outside auditors, reviewing the scope, results, and effectiveness of the annual audit of our financial statements and other services provided by our independent registered public accounting firm. Our board of directors, our Chief Executive Officer, and our Chief Financial Officer, all of whom are Koichi Ishizuka, review our internal accounting controls, practices, and policies.\nAudit Committee Financial Expert\nOur board of directors, comprised solely of Koichi Ishizuka, has determined that we do not have a board member that qualifies as an audit committee financial expert as defined in Item 407(d)(5) of Regulation S-K . We believe that given our current size and the limited scope of our business, retaining an independent director who would qualify as an audit committee financial expert would be overly costly and burdensome. We will consider establishing an Audit Committee, and identifying an individual to serve as an independent director and as the audit committee financial expert when so required.\nInvolvement in Certain Legal Proceedings\nNone of our executive officers and directors, comprised solely of Koichi Ishizuka, have been involved in or a party to any of the following events or actions during the past ten years:\n1. Any petition under the federal bankruptcy laws or any state insolvency laws filed by or against, or an appointment of a receiver, fiscal agent, or similar officer by a court for the business or property of such person, a partnership in which such person was a general partner at or within two years before the time of such filing, or any corporation or business association of which such person was an executive officer either at or within two years prior to the time of such filing;\n2. Any conviction in a criminal proceeding or being subject to a pending criminal proceeding (excluding traffic violations and other minor offenses);\n3. Being subject to any order, judgment, or decree, not subsequently reversed, suspended, or vacated, of any court of competent jurisdiction, permanently or temporarily enjoining, such person from, or otherwise limiting, the following activities: (i) acting as a futures commission merchant, introducing broker, commodity trading advisor, commodity pool operator, floor broker, leverage transaction merchant, any other person regulated by the Commodity Futures Trading Commission, or an associated person of any of the foregoing, or as an investment advisor, underwriter, broker or dealer in securities, or as an affiliated person, director, or employee of any investment company, bank, savings and loan association, or insurance company, or engaging in or continuing any conduct or practice in connection with such activity; (ii) engaging in any type of business practice; or (iii) engaging in any activity in connection with the purchase or sale of any security or commodity or in connection with any violation of federal or state securities laws or federal commodities laws;\n4. Being the subject of any order, judgment or decree, not subsequently reversed, suspended or vacated, of any federal or state authority barring, suspending or otherwise limiting for more than 60 days the right of such person to engage in any activity described in paragraph (3)(i) above, or to be associated with persons engaged in any such activity;\n5. Being found by a court of competent jurisdiction (in a civil action) or the SEC to have violated a Federal or State securities law, and the judgment has not been subsequently reversed, suspended, or vacated;\n6. Being found by a court of competent jurisdiction in a civil action or by the Commodity Futures Trading Commission to have violated any Federal commodities law, and the judgment in such civil action or finding by the Commodity Futures Trading Commission has not been subsequently reversed, suspended, or vacated;\n7. Being the subject of, or a party to, any Federal or State judicial or administrative order, judgment, decree, or finding, not subsequently reversed, suspended or vacated, relating to an alleged violation of :(i) any Federal or State securities or commodities law or regulation; (ii) any law or regulation respecting financial institutions or insurance companies including, but not limited to, a temporary or permanent injunction, order of disgorgement or restitution, civil money penalty or temporary or permanent cease-and-desist order, or removal or prohibition order; or (iii) any law or regulation prohibiting mail or wire fraud or fraud in connection with any business entity; or\n8. Being the subject of, or a party to, any sanction or order, not subsequently reversed, suspended, or vacated, of any self-regulatory organization (as defined in Section 3(a)(26) of the Exchange Act (15 U.S.C. 78c(a)(26))), any registered entity (as defined in Section 1(a)(29) of the Commodity Exchange Act (7 U.S.C. 1(a)(29))), or any equivalent exchange, association, entity or organization that has disciplinary authority over its members or persons associated with a member.\nCode of Ethics\nWe have not adopted a formal Code of Ethics. We only have one employee, our sole officer and director, Koichi Ishizuka. In the event we commence operations, or the number of employees, number of officers, and/or number of directors increases in the future, we may take actions to adopt a formal Code of Ethics.\nNomination of Directors\nAs of July 31, 2022, we had not effected any material changes to the procedures by which our stockholders may recommend nominees to our board of directors. We do not have any defined policy or procedural requirements for stockholders to submit recommendations or nominations for directors. Our board of directors believes that, given the stage of our development, a specific nominating policy would be premature and of little assistance until our business operations develop to a more advanced level. We do not currently have any specific or minimum criteria for the election of nominees to our board of directors and we do not have any specific process or procedure for evaluating such nominees. Our board of directors will assess all candidates, whether submitted by management or future stockholders, and make recommendations for election or appointment.\nA stockholder who wishes to communicate with our board of directors may do so by directing a written request addressed to the Company with the address appearing on the first page of this Report.\nDelinquent Section 16(a) Reports\nSection 16(a) of the Exchange Act requires the Companys executive officers, directors, and persons who beneficially own more than ten percent of a registered class of the Companys equity securities, to file with the SEC initial reports of ownership and reports of changes in ownership of the Companys common stock. Such officers, directors, and persons are required by SEC regulation to furnish the Company with copies of all Section 16(a) forms that they file with the SEC.\nBased solely on a review of the copies of such forms that were received by the Company, the Company is not aware of any failures to file reports or report transactions in a timely manner during the year ended July 31, 2022.\nFamily Relationships\nThere are no family relationships among our directors or executive officers. We have only one officer and director at this time.\nArrangements\nThere are no arrangements or understandings between an executive officer or director and any other person pursuant to which he was selected as an executive officer or director.\n- 9 - Item 11. Executive Compensation.\nThe table below summarizes all compensation awarded to, earned by, or paid to our named executive officers, which is defined as follows: (i) all individuals serving as our principal executive officer during the year ended July 31, 2021 and or July 31, 2022; (ii) each of our two most highly compensated executive officers who were serving as executive officers at the end of the year ended July 31, 2021 and or July 31, 2022; and (iii) up to two additional individuals for whom disclosure would have been required but for the fact that the individual was not serving as an executive officer as of the end of the year ended July 31, 2021 and or July 31, 2022.\nName and\nprincipal position\nFiscal Year Ended July 31, Salary\n($)\nBonus\n($)\nStock\nAwards\n($)\nOption\nAwards\n($)\nNon-Equity\nIncentive Plan\nCompensation\n($)\nNonqualified\nDeferred\nCompensation\nEarnings ($)\nAll Other\nCompensation\n($)\nTotal\n($)\nPaul Moody, Former President, CEO, CFO, and Director 0 0\n0 0\nKoichi Ishizuka, President, CEO, CFO, and Director 0 0\n0 0\nOutstanding Equity Awards at Fiscal Year-End\nWe had no outstanding equity awards at the year ended July 31, 2022.\nPotential Payments Upon Termination or Change-of-Control\nNone of our named executive officers are entitled to any payments upon termination or change-of-control.\nRetirement or Similar Benefit Plans\nThere are no arrangements or plans in which we provide retirement or similar benefits for our directors or executive officers.\nEmployment Agreements\nWe have no employment agreements with any of our named executive officers.\nCompensation of Directors\nWe did not pay any of our directors any compensation during the fiscal year ended July 31, 2022, whether in their capacity as a named executive officer or as a director.\n- 10 - Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nThe following table sets forth, as of the date of this Annual Report, the number of shares of common stock and or preferred stock owned of record and beneficially by executive officers, directors and persons who beneficially own more than 5% of the outstanding shares of our common and or preferred stock.\nAs of of the date of this Annual Report, 573,271,545 shares of Common Stock and 10,000 shares of Preferred Series Z Stock are issued and outstanding. Series Z Preferred Stock has no conversion rights to any other class, and every share of Series Z Preferred Stock held has voting rights equal to 1,000,000 votes of Common Stock.\nName and Address of Beneficial Owner\nAmount and Nature of\nBeneficial Ownership (Common Shares)\nPercentage\nof Class (Common)\nAmount and Nature of\nBeneficial Ownership (Preferred Shares)\nPercentage of Class\n(Preferred)\nTotal Voting Percentage\nOfficers and Directors\nKoichi Ishizuka (1)\n3F Ks Minamiaoyama\n6-6-20 Minamiaoyama,\nMinato-ku, Tokyo, Japan\n0%\n10,000\n100%\n94.58%\n5% or Greater Shareholders\nWhite Knight Co., Ltd. (2)\n3F Ks Minamiaoyama\n6-6-20 Minamiaoyama,\nMinato-ku, Tokyo, Japan\n0%\n10,000\n100%\n94.58%\nMaori, Inc. (3)\nCalles Central Y Primira Avendia 8 Edificio 61E\nSane Jose\nCosta Rica\n178,000,000\n31.05%\n0%\n1.68%\nJohn H. Jochem Residuary Trust (4)\n32974 LBJ FWY STE #401\nDallas, TX 75234\n85,000,000\n14.83%\n0%\n0.80%\nNqtel, Inc. (5)\n1606 Banbury Lane\nCarrollton, TX 75006\n50,000,000\n8.72%\n0%\n0.47%\nTotal Voting Percentage (5% or greater shareholders and Officers/ Directors as a group)\n97.55%\n_________________________________________\n1 Koichi Ishizuka serves as Chief Executive Officer, Chief Financial Officer, President, Secretary, Treasurer and Director of the Company. The row for Koichi Ishizuka includes his indirect ownership in the Company via White Knight Co., Ltd., holding 10,000 shares of Series Z Preferred Stock.\n2 The majority shareholder of the Issuer, White Knight Co., Ltd., is a Japan Corporation owned and controlled by Koichi Ishizuka, our sole officer and director.\n3 The control person of Maori, Inc. is Hunter Jochem. Maori, Inc., and the controller of Maori, Inc., have no affiliation with the company.\n4 The control person of the John H. Jochem Residuary Trust is Hunter Jochem. The John H. Jochem Residuary Trust, and the controller of the John H. Jochem Trust, have no affiliation with the Company.\n5 The control person of Nqtel, Inc. is Jeffrey Parlin. Nqtel, Inc., and the controller of Nqtel, Inc., have no affiliation with the Company.\nChanges in Control\nWe do not know of any arrangements that may, at a subsequent date, result in a change in control. Item 13. Certain Relationships and Related Transactions.\nThe Companys sole officer and director, Koichi Ishizuka, paid expenses on behalf of the company totaling $5,850 during the period ended July 31, 2022.\nThe Companys former sole officer and director, Paul Moody, paid expenses on behalf of the company totaling $11,000 during the period ended July 31, 2022.\nThe Companys former sole officer and director, Paul Moody, paid expenses on behalf of the company totaling $960 during the period ended July 31, 2021.\nThe $17,810 in total payments are considered contributions to the company with no expectation of repayment and are posted as additional paid-in capital.\nWe utilize the home office space and equipment of our management at no cost.\n- 11 -\nDirector Independence\nWe are not listed on any exchange that requires directors to be independent. We have not:\n· Established our own definition for determining whether our directors or nominees for directors are independent, nor have we adopted any other standard of independence employed by any national securities exchange or inter-dealer quotation system, though our current directors would not be deemed to be independent under any applicable definition given that they are officers of the Company; nor\n· Established any committees of our board of directors. Item 14. Principal Accounting Fees and Services.\nBelow is the approximate aggregate amount of fees billed for professional services rendered by our principal accountants with respect to the year ended July 31, 2022, and July 31, 2021 respectively.\nAudit and review fees BF Borgers CPA PC $ 9,350 $ 3,250\nAudit-related fees\n-\n-\nTax fees\n-\n-\nAll other fees\n-\n-\nTotal\n$ 9,350 $ 3,250\nPre-Approval Policies and Procedures\nCurrently, we do not have a separately designed Audit Committee. Instead, our entire board of directors performs those functions. Accordingly, our board of directors was response for pre-approving all services provided by our independent registered public accounting firm. The above fees were reviewed and approved by our board of directors before the services were rendered.\n- 12 -\nPART IV Item 15. Exhibits, Financial Statement Schedules.\n(a) Financial Statements\n1. Our financial statements are listed in the index under Item 8 of this document; and\n2. All financial statement schedules are omitted because they are not applicable, not material or the required information is shown in the financial statements or notes thereto.\n(b) Exhibits required by Item 601 of Regulation S-K.\nExhibit No.\nDescription\n3.1\nRestated Articles of Incorporation (1)\n3.2\nBy-laws (1)\nCertification of the Companys Principal Executive and Principal Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002, with respect to the registrants report on Form 10-K for the year ended July 31, 2022. (2)\nCertification of the Companys Principal Executive and Principal Financial Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002, with respect to the registrants report on Form 10-K for the year ended July 31, 2022. (2)\n101.INS\nInline XBRL Instance Document (the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document). (2)\n101.SCH\nInline XBRL Taxonomy Extension Schema Document. (2)\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document. (2)\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document. (2)\n101.LAB\nInline XBRL Taxonomy Extension Labels Linkbase Document. (2)\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document. (2)\nCover Page Interactive Data File (embedded within the Inline XBRL document). (2)\n(1) Filed as an exhibit to the Company's Form 10-12G/A, as filed with the SEC on January 19, 2022, and incorporated herein by this reference.\n(2) Filed herewith.\nItem 16. Form 10-K Summary.\nNone.\nSignatures\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nPerfect Solutions Group, Inc.\nBy: /s/ Koichi Ishizuka\nKoichi Ishizuka\nChief Executive Officer\n(Principal Executive Officer and Principal Financial Officer)\nDated: October 28, 2022\nIn accordance with the Exchange Act, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nBy: /s/ Koichi Ishizuka\nKoichi Ishizuka\nChief Executive Officer, and Chief Financial Officer\n(Principal Executive Officer and Principal Financial Officer)\nDated: October 28, 2022\n- 13 -"
}