{
    "cik": "1882078",
    "company": "Arisz Acquisition Corp.",
    "filing_type": "10-K",
    "filing_date": "2023-12-19",
    "period_of_report": "2023-09-30",
    "sic": "6770",
    "state_of_inc": null,
    "state_location": "NY",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1882078/0001213900-23-096598-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1882078/000121390023096598/f10k2023_ariszacq.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1882078/0001213900-23-096598.txt",
    "filename": "1882078_10K_2023_0001213900-23-096598.htm",
    "content": "ITEM 1. BUSINESS\nIntroduction\nWe are a blank check company incorporated on July 21, 2021 as a Delaware corporation and formed for the purpose of effecting a merger, capital stock exchange, asset acquisition, stock purchase, reorganization or similar business combination with one or more businesses, which we refer to throughout this report as our initial business combination.\nThe Registration Statement for our initial public offering was declared effective on November 17, 2021 (the Initial Public Offering, or IPO). On November 22, 2021, we consummated our Initial Public Offering of 6,000,000 units (the Units) at $10.00 per Unit Each Unit consists of one share of common stock, $0.0001 par value (the Common Stock), one right to receive one-twentieth (1/20) of a share of Common Stock upon the consummation of an initial business combination and one redeemable warrant entitling the holder thereof to purchase three-fourths (3/4) of a share of Common Stock at a price of $11.50 per whole share. The Units were sold at an offering price of $10.00 per Unit, generating gross proceeds of $60,000,000. The Company granted the underwriters a 45-day option to purchase up to 900,000 additional Units to cover over-allotments, if any. The Company incurred offering costs of $5,587,733, of which $2,587,500 was for deferred underwriting commissions. On November 22, 2021, the over-allotment option was exercised in full.\nOn November 22, 2021, simultaneously with the consummation of the IPO, the Company completed the private sale (the Private Placement) of 193,889 units and 60,000 units, respectively (the Private Units) to Arisz Investments LLC, the Companys sponsor (the Sponsor) and Chardan Capital Markets, LLC, generating total proceeds of $2,538,886.\nThe closing of the issuance and sale of the additional Units (the Over-Allotment Option Units) occurred on November 24, 2021. The total aggregate issuance by the Company of 900,000 units at a price of $10.00 per unit resulted in total gross proceeds of $9,000,000. On November 24, 2021, simultaneously with the sale of the Over-Allotment Option Units, the Company consummated the private sale of an additional 13,500 Private Units and 9,000 Private Units to the sponsor and Chardan Capital Markets, LLC, respectively, generating gross proceeds of $225,000. The Private Units were issued pursuant to Section 4(a)(2) of the Securities Act of 1933, as amended, as the transactions did not involve a public offering.\nA total of $69,000,000 of the net proceeds from the sale of Units in the IPO (including the Over-Allotment Option Units) and the Private Placements on November 22, 2021 and November 24, 2021, were placed in a trust account (the Trust Account), located in the United States and held as cash items or may be invested in U.S. government securities, within the meaning set forth in Section 2(a)(16) of the Investment Company Act, with a maturity of 185 days or less, or in any open-ended investment company that holds itself out as a money market fund meeting the conditions of Rule 2a-7 of the Investment Company Act, as determined by us, until the earlier of: (i) the consummation of a Business Combination or (ii) the distribution of the funds in the Trust Account to our stockholders.\nIf we are unable to complete an initial business combination by February 22, 2024 subject to additional extension elected by the Sponsor (unless such date is further extended by a shareholder vote in accordance with our governing documents), we will (i) cease all operations except for the purpose of winding up, (ii) as promptly as reasonably possible but not more than ten business days thereafter, redeem 100% of the outstanding public shares for a pro rata portion of the funds held in the trust account, which redemption will completely extinguish public stockholders rights as stockholders (including the right to receive further liquidation distributions, if any), subject to applicable law, and (iii) as promptly as reasonably possible following such redemption, subject to the approval of our remaining holders of common stock and our board of directors, dissolve and liquidate, subject (in the case of (ii) and (iii) above) to our obligations under Delaware law to provide for claims of creditors and the requirements of other applicable law. Holders of rights or warrants will receive no proceeds in connection with the liquidation with respect to such rights or warrants, which will expire worthless. In connection with our redemption of 100% of our outstanding public shares, each holder will receive an amount equal to (1) the number of public shares being converted by such public holder divided by the total number of public shares multiplied by (2) the amount then in the trust account (initially $10.00 per share), which includes the deferred underwriting commission, plus a pro rata portion of any interest earned on the funds held in the trust account and not previously released to us or necessary to pay our taxes (subject in each case to our obligations under Delaware law to provide for claims of creditors).\nMerger Agreement\nOn January 21, 2022, Arisz entered into that certain Agreement and Plan of Merger (as amended, supplemented or otherwise modified from time to time, the Merger Agreement), by and between Arisz and Finfront Holding Company, a Cayman Islands exempted company (BitFuFu), pursuant to which (a) Arisz will form BitFuFu Inc., a Cayman Islands exempted company, as its wholly owned subsidiary (Purchaser), (b) Purchaser will form Boundary Holding Company, a Cayman Islands exempted company, as its wholly owned subsidiary (Merger Sub), (c) Arisz will be merged with and into Purchaser (the Redomestication Merger), with Purchaser surviving the Redomestication Merger, and (d) Merger Sub will be merged with and into BitFuFu (the Acquisition Merger), with BitFuFu surviving the Acquisition Merger as a direct wholly owned subsidiary of Purchaser (collectively, the Business Combination). Following the Business Combination, Purchaser will be a publicly traded company listed on a stock exchange in the United States. On April 4, 2022, each of Arisz and BitFuFu entered into that certain Amendment to the Merger Agreement pursuant to which, among other things, the parties clarified certain Cayman Island corporate law matters by mutual agreement.\nFinfront Holding Company operates under the trade name of BitFuFu, is a fast-growing digital asset mining service and world-leading cloud-mining service provider, dedicated to fostering a secure, compliant, and transparent blockchain infrastructure. BitFuFu provides a variety of stable and intelligent digital asset mining solutions, including one-stop cloud-mining services and miner hosting services to institutional customers and individual digital asset enthusiasts.\nIn consideration of the Acquisition Merger, Purchaser will issue 150,000,000 ordinary shares (the Closing Payment Shares) with a deemed price per share US$10.00 (Aggregate Stock Consideration) to the shareholders of BitFuFu. The Aggregate Stock Consideration consists of 7,500,000 Class A ordinary shares and 142,500,000 Class B ordinary shares of Purchaser.\nThe Merger Agreement originally provided that the closing of the Business Combination shall occur no later than July 31, 2022 (the Outside Date) and that the Outside Date may be extended upon the written agreement of Arisz and BitFuFu.\nOn July 14, 2022, each of Arisz, BitFuFu, the Purchaser and Ariszs Sponsor (along with any assignee of Ariszs Sponsor, the Buyer) entered into a backstop agreement (the Backstop Agreement) whereby, in connection with the Business Combination, the Buyer has agreed to subscribe for and purchase no less than US$1.25 million worth of shares of Ariszs common stock par value $0.0001 per share, or Purchasers Class A ordinary shares.\nOn October 10, 2022, Arisz and BitFuFu entered into an amendment to the Merger Agreement to provide, among other things: 1) for a loan from BitFuFu to Arisz in the amount of $2,220,000 (the Loan) for the purpose of funding Ariszs extension of the time to consummate a business combination and for working capital purposes, and 2) remove all existing restrictions on 400,000 shares issued to our initial stockholders that are currently subject to transfer restrictions, so that such shares are freely tradeable upon the Closing. The Loan was to be funded in three equal installments of $740,000 on each of October 26, 2022, January 26, 2023 and April 26, 2023.\nOn October 10, 2022, Arisz issued an unsecured promissory note to BitFuFu (the BitFuFu Note) for the amount of the Loan at an interest rate of 3.5% per annum and is due on October 26, 2023. Arisz may elect to issue a number of unregistered shares of its common stock, valued for these purposes at $10.00 per share, the aggregate value of which shall be equal to the outstanding principal amount of the Loan to the BitFuFu or its designee on or prior to the October 26, 2023 in lieu of paying all outstanding principal under this Note.\nOn October 13, 2022, the parties to the Backstop Agreement entered into a new backstop agreement substantially on the same terms as the Backstop Agreement with the only substantive additional terms being that: 1) the subscription amount is $2.0 million worth of shares and 2) the termination date is the earlier of: (i) the date agreed by the parties thereto in writing and (ii) the date that the Merger Agreement is terminated, on its terms.\nOn October 24, 2022, Arisz received $740,000, the first installment of the Loan, from BitFuFu.\nOn November 9, 2022, Arisz deposited $690,000 into the Trust Account (representing $0.10 per each share of redeemable common stock) to extend the time for Arisz to complete the Business Combination by three months until February 22, 2023.\nOn January 20, 2023, Arisz received $740,000, the second installment of the Loan, from BitFuFu.\nOn February 7, 2023, the Company notified the trustee of its intent to extend the time available to the Company to consummate a business combination from February 22, 2023 to May 22, 2023 (the February 2023 Extension). The February 2023 Extension was the second and last of up to two three-month extensions permitted under Ariszs governing documents. On February 9, 2023, Arisz deposited $690,000 into the Trust Account (representing $0.10 per each share of redeemable common stock) to extend the time for Arisz to complete the Business Combination by three months until May 22, 2023.\nOn April 24, 2023, Arisz and BitFuFu entered into Amendment No. 3 to the Merger Agreement to provide, among other things: 1) to reduce the amount of the Loan from $2,220,000 to $1,930,000 for the purpose of funding Ariszs extension of the time to consummate a business combination and for working capital purposes and 2) that the third installment of the loan will be in the amount of $450,000. On April 25, 2023, Arisz received $450,000, the third installment of the Loan, from BitFuFu.\nOn May 11, 2023, Arisz held a special meeting of stockholders to consider, among other things, proposals to amend Ariszs charter in order to extend the time it has to complete its initial business combination up to nine (9) times with each extension allowing for an additional one (1) month period from May 22, 2023 to February 22, 2024, provided that Arisz contributes to the Trust Account $120,000 for each one-month extension, paid on a month-to-month and as-needed basis. At the special meeting, the requisite number of stockholders voted in favor of these proposals.\nIn connection with the special meeting, 3,745,635 shares of Common Stock were tendered for redemption. As a result, approximately $39.18 million (approximately $10.46 per share) was removed from the Trust Account to pay such holders, without taking into account additional allocation of payments to cover any tax obligation of Arisz, such as franchise taxes, but not including any excise tax, since that date.\nIn connection with the special meeting, in each of May, June, July, August, September, October and November 2023, Arisz timely deposited $120,000 into Ariszs Trust Account, thereby extending the date by which an initial business combination may be consummated. As of the date hereof, Arisz has until January 22, 2024 to consummate its initial business combination, unless the Sponsor elects to further extend, to as late as February 22, 2024.\nOn July 28, 2023, Arisz and BitFuFu entered into Amendment No. 4 to the Merger Agreement (Amendment No. 4) to provide, among other things: (1) that the Outside Date for the completion of the Corporations business combination, as defined therein be extended from August 1, 2023 to November 17, 2024 and (2) for an amendment to the loan installment of $360,000 to be extended on each of August 2, 2023, November 2, 2023, February 2, 2024, May 2, 2024 and August 2, 2024 to be used to cover the extension costs, and the remaining balance of each loan installment to be used for working capital. In accordance therewith, on July 28, 2023, Arisz and BitFuFu amended and restated the BitFuFu Note.\nWe expect to continue to incur significant costs in the pursuit of our acquisition plans. We cannot assure you that our plans to complete the Business Combination will be successful.\nIn consideration of the Acquisition Merger, Purchaser will issue 150,000,000\nWe are a blank check company incorporated on July 21, 2021 as a Delaware corporation and formed for the purpose of effecting a merger, capital stock exchange, asset acquisition, stock purchase, reorganization or similar business combination with one or more businesses, which we refer to throughout this report as our initial business combination.\nOur Sponsor and Competitive Advantages\nOur Sponsor is an affiliate of M.S.Q. Ventures Inc (MSQ), a research-driven advisory firm with deep domain expertise in life sciences. MSQ exclusively focuses on integration for emerging life sciences companies that discover, develop and commercialize innovative therapeutics-focused products. Through MSQs deep sector knowledge, strong network and regional expertise, MSQ provides comprehensive advisory services and solutions to streamline the most complex global projects. MSQs core capabilities include the development of partnership strategy and execution, non-deal roadshow planning and execution, and key opinion leader (KOL) interviews. MSQ assists companies in increasing visibility within the investment community and educating investors and executives on opportunities offered by these companies. Since 2016, the MSQ team has met with a substantial number of companies in North America and Europe to evaluate various partnership options and to conduct one-on-one partnership meetings and KOL interviews.\nMSQ has instituted a strategy of identifying transformational innovations across the life sciences space. We will benefit from MSQs expertise and resources, specifically in identifying scientific programs that have the potential to disrupt the current standard of care in their respective areas. MSQ actively analyzes asymmetric risk/reward opportunities in North America and Europe and focuses on recognizing synergies across global markets and companies for its clients. Our specific therapeutic areas of focus include (but not limited to) oncology, dermatology, orphan diseases, gene/cell therapy and related areas.\nOur Board of Director and Management Team\nOur officers, directors and strategic advisors consist of seasoned investors and industry executives with an extensive track record of identifying, investing, building, operating and advising leading businesses. In particular, the team possesses a deep understanding of the healthcare industry, the evolution of these sectors and market opportunities.\nEcho Hindle-Yang has been our Chief Executive Officer since inception and became chairwoman of our board of directors upon consummation of our IPO. Ms. Hindle-Yang has more than 20 years of extensive experience of leading complex organizations, managing transactions for fortune 500 global companies and founding new ventures to resolve unmet market needs. More recently, Ms. Hindle-Yangs focus has largely been within the healthcare industry, where she has advised global pharmaceutical and medical device companies in North America and Europe on their corporate strategy endeavors, financing paths, portfolio optimization and acquisition opportunities. In 2016, Ms. Hindle-Yang founded M.S.Q. Ventures, a New York-based advisory firm that focuses on integration for emerging life sciences companies. From 2011 to 2015, Ms. Hindle-Yang served as Chief Operation Officer at Playbutton LLC where she managed the companys business strategy, marketing, finance operations including IPOs and acquisitions. In 2010, Ms. Hindle-Yang joined Gerber Scientific Inc as director of global strategy and operations in charge of leading a brand-new global team to focus on overseas expansion and operations. Ms. Hindle-Yang holds an MBA from Duke University with a health sector management certificate. Currently Ms. Hindle-Yang is serving on the DukeNY Board.\nMarc Estigarribia has been our Chief Financial Officer since inception. Mr. Estigarribia has been the Managing Director and Head of Origination and Engagement at MSQ Ventures since May 2016, where he has led the companys client origination and engagement effort in the life science industry. Mr. Estigarribia maintains a deep network of global relationships with strategic partners and investors within the life science industry. Between September 2015 and April 2016, Mr. Estigarribia served as vice president senior research analyst at Chardan. Mr. Estigarribia was responsible for equity stock coverage of the Technology, TMT industry with a main vertical focus on Internet of Things (IOT/M2M) Machine-to-Machine Communications (M2M) including Robotics, Artificial Intelligence and Semiconductors. Between March 2013 and August 2015, Mr. Estigarribia served as senior investment banking associate at Wellington Shields. Mr. Estigarribia worked with both public and private growth companies to help provide capital raising, merger & acquisition, and strategic financial advisory services in all facets of the capital structure - Private Equity, Senior Debt, Mezzanine Debt, Unitranche, Equity, IPOs, Secondary Offerings, and Private Placements. Between April 2011 and March 2013, Mr. Estigarribia served as CFO at Rubin Singer, a start-up company in the Luxury Goods Fashion industry where Mr. Estigarribia managed cash flow, capital formation and investment advisory for this start-up company in the Luxury Goods Fashion industry. Mr. Estigarribia also maintained constant communication flow with both existing and prospective equity and debt investors, and internal management board-team, while enhancing strategic relationships. Between July 1996 and March 2011, Mr. Estigarribia served as a sell-side Equity Research Analyst at Citigroup. Mr. Estigarribias responsibilities covered 70% of the teams total coverage for telecommunication services and media companies in Latin America. Mr. Estigarribia initiated and launched the numerous reports within the wireless and media sectors between 2000 and 2003. Through these roles, Mr. Estigarribia has developed and maintained relationships with top tier institutional investors. Mr. Estigarribia obtained his MBA degree in 1995 from NYU Stern School of Business and his BS in Economics from Binghamton University, State University of New York.\nNick He has been a member of our board of directors since November 17, 2021. Since January 2017, Mr. He has been the Founder and the Chief Executive Officer of GPS Renting, a privately held real estate investment firm with brokerage and property management services which brings cutting-edge mobile technology, strategic planning, and extensive real estate experience to serve clients. Between April 2012 and November 2016, Mr. He started as a strategy and product planer and became the senior program manager lead when he left Microsoft. Mr. He was responsible for product strategies, including, but not limited to Market opportunity & Business Plan, Growth strategy, Turnaround Strategy at Microsoft. Between May 2008 and September 2008, Mr. He served as summer associate consultant at McKinsey & Co. where Mr. He led the Financial Analysis and Planning project which analysis of technology spending and recommended a 5-year investment strategy. Mr. He obtained his MBA degree focusing on strategy and marketing in 2009 from Duke University Fuqua School of Business.\nRushi Trivedi, PhD has been a member of our board of directors since November 17, 2021. Since 2019, Dr. Trivedi has been founder of RepliGene Life Sciences, a company that specializes in the production of Cell and Gene Therapy adducts. Dr. Trivedi focuses on unmet clinical needs and assists in bringing the next generation Cell and Gene Therapies to the market. Between June 2015 and April 2019, Dr. Trivedi served as strategy consultant at McKinsey & Company where Dr. Trivedi gained extensive experience in M&A, business development, due diligence, portfolio management and asset integration while drawing heavily from his background in oncology and drug development to serve clients in these topics across pharma, medical technology tech, and private equity. Dr. Trivedi is a widely published scientist with over 400 citations in leading peer-reviewed journals. Dr. Trivedi obtained his Doctor of Philosophy in Biochemistry and Molecular Biology from Stowers Institute of Medical Research and University of Kansas Medical Center in 2015, and his MS in Medicinal and Pharmaceutical Chemistry from University of Kansas in 2009, and his BS in Pharmaceutical Sciences from Purdue University in 2007.\nDr. Romain Guerel has been a member of our board of directors since November 17, 2021. Since March 2020, Dr. Guerel is the founder and CEO of MSolution Consulting. The consulting company provides project management consultancy for European and North American companies. Starting March 2019, Dr. Guerel has been elected as an executive board member of a French International School where he has in charge with other 7 board members of all administrative and strategic decisions on behalf of the parents committee. From September 2012 to February 2020, Dr. Guerel worked as a director for Century 3 Project Management Company where he was in charge on multiple management projects for Fortune 500 companies. From 2001 to 2012, Dr. Guerel was the co-founder and Managing Director of Capital Resources where he was in charge of raising funds for high-end real estate projects. Dr. Guerel obtained his Doctor of Philosophy in Management from HKUST Business School in 2011, and has Master of Laws degrees in Commercial French law and International law from the Law School of Nice Sophia Antipolis.\nThe past performance of our management team, or advisor or their respective affiliates is not a guarantee either (i) of success with respect to any business combination we may consummate or (ii) that we will be able to identify a suitable candidate for our initial business combination. No member of our management team has had management experience with special purpose acquisition corporations in the past. You should not rely on the historical record of our management teams or advisors or their respective affiliates performance as indicative of our future performance.\nCompetition\nIn identifying, evaluating and selecting a target business for our initial business combination, we may encounter intense competition from other entities having a business objective similar to ours, including other blank check companies, private equity groups and leveraged buyout funds, and operating businesses seeking strategic business combinations. Many of these entities are well established and have extensive experience identifying and effecting business combinations directly or through affiliates. Moreover, many of these competitors possess greater financial, technical, human and other resources than we do. Our ability to acquire larger target businesses will be limited by our available financial resources. This inherent limitation gives others an advantage in pursuing the initial business combination of a target business. Furthermore, our obligation to pay cash in connection with our public stockholders who exercise their redemption rights may reduce the resources available to us for our initial business combination and our outstanding warrants, and the future dilution they potentially represent, may not be viewed favorably by certain target businesses. Either of these factors may place us at a competitive disadvantage in successfully negotiating an initial business combination.\nEmployees\nWe currently have two officers. These individuals are not obligated to devote any specific number of hours to our matters but they intend to devote as much of their time as they deem necessary, in the exercise of their respective business judgement, to our affairs until we have completed our initial business combination. The amount of time they will devote in any time period will vary based on whether a target business has been selected for our initial business combination and the stage of the initial business combination process we are in. We do not intend to have any full-time employees prior to the completion of our initial business combination. We do not have an employment agreement with any member of our management team.\nFor additional discussion of the general development of our business, see our final prospectus on Form 424B4 filed with the SEC on November 19, 2021 along with our other filings made with the SEC. ITEM 1A. RISK FACTORS\nIn addition to the risk factors set forth below, the Risks Factors beginning on page 31 of the Companys final prospectus on Form 424B4 filed with the SEC on November 19, 2021, are incorporated herein by reference.\nWe have identified material weaknesses in our internal control over financial reporting as of September 30, 2023. If we are unable to develop and maintain an effective system of internal control over financial reporting, we may not be able to accurately report our financial results in a timely manner, which may adversely affect investor confidence in us and materially and adversely affect our business and operating results.\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with GAAP. Our management is likewise required, on a quarterly basis, to evaluate the effectiveness of our internal controls and to disclose any changes and material weaknesses identified through such evaluation in those internal controls. A material weakness is a deficiency, or a combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of our annual or interim financial statements will not be prevented or detected on a timely basis.\nAs discussed in elsewhere in this Report under Controls and Procedures, our management has concluded that, as of September 30, 2023, we had material weaknesses in our internal control over financial reporting related to our review controls.\nEffective internal controls are necessary for us to provide reliable financial reports and prevent fraud. Any failure to maintain such internal control could adversely impact our ability to report our financial position and results from operations on a timely and accurate basis. If our financial statements are not accurate, investors may not have a complete understanding of our operations. Likewise, if our financial statements are not filed on a timely basis, we could be subject to sanctions or investigations by the stock exchange on which our common stock is listed, the SEC or other regulatory authorities. In either case, there could result a material adverse effect on our business. Failure to timely file will cause us to be ineligible to utilize short form registration statements on Form S-3, which may impair our ability to obtain capital in a timely fashion to execute our business strategies or issue shares to effect an acquisition. Ineffective internal controls could also cause investors to lose confidence in our reported financial information, which could have a negative effect on the trading price of our stock.\nWe continue to evaluate steps to remediate the identified material weaknesses. These remediation measures may be time consuming and costly and there is no assurance that these initiatives will ultimately have the intended effects. If we identify any new material weaknesses in the future, any such newly identified material weakness could limit our ability to prevent or detect a misstatement of our accounts or disclosures that could result in a material misstatement of our annual or interim financial statements. In such case, we may be unable to maintain compliance with securities law requirements regarding timely filing of periodic reports in addition to applicable stock exchange listing requirements, investors may lose confidence in our financial reporting and our stock price may decline as a result. We cannot assure you that the measures we have taken to date, or any measures we may take in the future, will be sufficient to avoid potential future material weaknesses.\nWe can give no assurance that the measures we have taken and plan to take in the future will remediate the material weakness identified or that any additional material weaknesses or restatements of financial results will not arise in the future due to a failure to implement and maintain adequate internal control over financial reporting or circumvention of these controls. In addition, even if we are successful in strengthening our controls and procedures, in the future those controls and procedures may not be adequate to prevent or identify irregularities or errors or to facilitate the fair presentation of our financial statements.\nEven though we converted the securities in the Trust Account into an interest-bearing demand deposit account at a bank, we still may be determined to be an investment company under the Investment Company Act, in which case the Company would wind down and we would not be able to complete our business combination. In addition, to the conversion to cash may limit the interest income available for payment of taxes and dissolution expenses or for distribution to public stockholders.\nThe funds in the Trust Account had, since our IPO, been invested only in U.S. government treasury obligations with maturities of 185 days or less or in certain money market funds meeting certain conditions under Rule 2a-7 under the Investment Company Act, which invest solely in U.S. government treasury obligations. However, to mitigate the risk of us being deemed to be an unregistered investment company (including under the subjective test of Section 3(a)(1)(A) of the Investment Company Act) and thus subject to regulation under the Investment Company Act, we instructed Continental Stock Transfer & Trust Company, the trustee with respect to the Trust Account, to liquidate the U.S. government treasury obligations or money market funds held in the Trust Account, prior to November 17, 2023, and thereafter to hold all funds in the Trust Account as cash items in an interest-bearing demand deposit account at a bank until the earlier of the consummation of our initial business combination or the liquidation of the Company.\nOn March 30, 2022, the SEC issued proposed rules relating to, among other matters, the extent to which special purpose acquisition companies like ours could become subject to regulation under the Investment Company Act. The SECs current policy position, consistent with these proposed rules, is that, for special purpose acquisition companies like ours to be exempt from the definition of investment company under Section 3(a)(1)(A) of the Investment Company Act, they must satisfy certain conditions that limit a companys duration, asset composition, business purpose and activities\nThe SEC has indicated that it believes that there are serious questions concerning the applicability of the Investment Company Act to special purpose acquisition companies. It is possible that a claim could be made that we have been operating as an unregistered investment company.\nIf we were determined to be an unregistered investment company, despite the change in investments in the Trust Account, the trustee could be required to liquidate the Trust Account, in which case the business of the Company would be discontinued and the Company wound down, and we would not be able to complete an initial business combination. If we are unable to complete our initial business combination, our public stockholders may receive only their pro rata portion of the funds in the Trust Account that are available for distribution to public stockholders, our warrants will expire worthless and our public stockholders would not have any opportunity to participate in any potential appreciation in the value of their public shares that might be created by an initial business combination.\nIn addition, prior to November 17, 2023, the Company converted its investments in the Trust Account into cash, which will remain in the Trust Account. While we maintain the funds in the Trust Account in cash in an interest-bearing demand deposit account, we may receive lower interest on the funds held in such deposit account (as compared to investing such funds in interest-bearing U.S. government securities); however, we cannot assure you that such rate on the deposit account will not decrease or increase significantly. Furthermore, interest previously earned on the funds held in the Trust Account still may be released to pay taxes of the Company. As a result, holding all funds in the Trust Account in cash items may reduce the dollar amount our public stockholders would receive upon any redemption of the public shares or our liquidation.\nWe may not be able to complete the Business Combination since such initial business combination may be subject to U.S. foreign investment regulations and review by a U.S. government entity such as the Committee on Foreign Investment in the United States (CFIUS), or ultimately prohibited.\nCertain of our directors are citizens of countries other than the United States. In addition, Finfront HoldingCompany, operating under the trade name of BitFuFu, is an exempted company incorporated in the Cayman Islands with limited liability, with subsidiaries in Singapore and the United States. While we believe that the nature of Ariszs business, and the nature of the businesses of BitFuFu should not make the transaction subject to U.S. foreign regulations or review by a U.S. government entity, it is possible that the Business Combination may be subject to CFIUS review, the scope of which was expanded by the Foreign Investment Risk Review Modernization Act of 2018 (FIRRMA), to include certain non-passive, non-controlling investments in sensitive U.S. businesses and certain acquisitions of real estate even with no underlying U.S. business. FIRRMA, and subsequent implementing regulations that are now in force, also subjects certain categories of investments to mandatory filings. If the Business Combination falls within CFIUSs jurisdiction, we may determine that we are required to make a mandatory filing or that we will submit a voluntary notice to CFIUS, or to proceed with the Business Combination without notifying CFIUS and risk CFIUS intervention, before or after closing the Business Combination. CFIUS may decide to block or delay the Business Combination, impose conditions to mitigate national security concerns with respect to the Business Combination or order us to divest all or a portion of a U.S. business of the combined company without first obtaining CFIUS clearance, which may limit the attractiveness of or prevent us from consummating the Business Combination.\nMoreover, the process of government review, whether by the CFIUS or otherwise, could be lengthy and we have limited time to complete the Business Combination. If we fail to complete an initial business combination by February 24, 2024 (if the Sponsor elects to extend the consummation deadline to that date as described herein), then because the review exceeds such timeframe or because our initial business combination is ultimately prohibited by CFIUS or another U.S. government entity, we may be required to liquidate, unless Arisz seeks further stockholder approval to amend the Current Charter to extend the date by which an initial business combination may be consummated.\nIf we liquidate, our public shareholders may only receive $10.00 per share, and our warrants and rights will expire worthless. This will also cause you to lose the investment opportunity in a target company and the chance of realizing future gains on your investment through any price appreciation in the combined company. ITEM 1B. UNRESOLVED STAFF COMMENTS\nNot applicable. ITEM 2. PROPERTIES\nOur executive offices are located at C/O MSQ Ventures, 12 E 49th St, 17th floor, New York, 10017 New York, and our telephone number is 212-845-9945.\nCommencing on the date our securities were first listed on Nasdaq, we have agreed to pay Arisz Investments LLC, our sponsor a total of $10,000 per month for office space, utilities and secretarial and administrative support. We consider our current office space adequate for our current operations. ITEM 3. LEGAL PROCEEDINGS\nWe may be subject to legal proceedings, investigations and claims incidental to the conduct of our business from time to time. We are not currently a party to any material litigation or other legal proceedings brought against us. We are also not aware of any legal proceeding, investigation or claim, or other legal exposure that has a more than remote possibility of having a material adverse effect on our business, financial condition or results of operations. ITEM 4. MINE SAFETY DISCLOSURES\nNot Applicable.\npart II ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nOur units began to trade on The Nasdaq Global Market, or Nasdaq, under the symbol ARIZU on or about November 22, 2021. The common stock, rights and redeemable warrants comprising the units began separate trading on December 9, 2021, under the symbols ARIZ, ARIZR, and ARIZW, respectively.\nHolders of Record\nAs of December 18, 2023, there were 5,155,754 shares of our common stock issued and outstanding held by approximately 18 stockholders of record, and there were 1,746,683 shares of our common stock issued and outstanding held by our Sponsor. The number of record holders was determined from the records of our transfer agent and does not include beneficial owners of shares of common stock whose shares are held in the names of various security brokers, dealers, and registered clearing agencies.\nDividends\nWe have not paid any cash dividends on our common stock to date and do not intend to pay cash dividends prior to the completion of an initial business combination. The payment of cash dividends in the future will be dependent upon our revenues and earnings, if any, capital requirements and general financial condition subsequent to completion of a business combination. The payment of any dividends subsequent to a business combination will be within the discretion of our board of directors at such time. It is the present intention of our board of directors to retain all earnings, if any, for use in our business operations and, accordingly, our board of directors does not anticipate declaring any dividends in the foreseeable future. In addition, our board of directors is not currently contemplating and does not anticipate declaring any share dividends in the foreseeable future. Further, if we incur any indebtedness, our ability to declare dividends may be limited by restrictive covenants we may agree to in connection therewith.\nSecurities Authorized for Issuance Under Equity Compensation Plans\nNone.\nRecent Sales of Unregistered Securities\nThere were no unregistered securities to report which have not been previously included in a Quarterly Report on Form 10-Q or a Current Report on Form 8-K.\nPurchases of Equity Securities by the Issuer and Affiliated Purchasers\nNone. ITEM 6. [RESERVED] ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nReferences to the Company, Arisz, our, us or we refer to Arisz Acquisition Corp. The following discussion and analysis of the Companys financial condition and results of operations should be read in conjunction with the unaudited interim condensed financial statements and the notes thereto contained elsewhere in this report. Certain information contained in the discussion and analysis set forth below includes forward-looking statements that involve risks and uncertainties.\nWe are a blank check company formed under the laws of the State of Delaware on July 21, 2021. We were formed for the purpose of entering into a merger, share exchange, asset acquisition, stock purchase, recapitalization, reorganization or other similar business combination.\nOn January 21, 2022, Arisz entered into that certain Agreement and Plan of Merger (as amended, supplemented or otherwise modified from time to time, the Merger Agreement), by and between Arisz and Finfront Holding Company, a Cayman Islands exempted company (BitFuFu), pursuant to which (a) Arisz will form BitFuFu Inc., a Cayman Islands exempted company, as its wholly owned subsidiary (Purchaser), (b) Purchaser will form Boundary Holding Company, a Cayman Islands exempted company, as its wholly owned subsidiary (Merger Sub), (c) Arisz will be merged with and into Purchaser (the Redomestication Merger), with Purchaser surviving the Redomestication Merger, and (d) Merger Sub will be merged with and into BitFuFu (the Acquisition Merger), with BitFuFu surviving the Acquisition Merger as a direct wholly owned subsidiary of Purchaser (collectively, the Business Combination). Following the Business Combination, Purchaser will be a publicly traded company listed on a stock exchange in the United States. On April 4, 2022, each of Arisz and BitFuFu entered into that certain Amendment to the Merger Agreement pursuant to which, among other things, the parties clarified certain Cayman Island corporate law matters by mutual agreement.\nIn consideration of the Acquisition Merger, Purchaser will issue 150,000,000 ordinary shares (the Closing Payment Shares) with a deemed price per share US$10.00 (Aggregate Stock Consideration) to the shareholders of BitFuFu. The Aggregate Stock Consideration consists of 7,500,000 Class A ordinary shares and 142,500,000 Class B ordinary shares of Purchaser.\nOn October 10, 2022, Arisz issued an unsecured promissory note to BitFuFu (the BitFuFu Note) for the amount of the Loan at an interest rate of 3.5% per annum and is due on October 26, 2023. Arisz may elect to issue a number of unregistered shares of its common stock, valued for these purposes at $10.00 per share, the aggregate value of which shall be equal to the outstanding principal amount of the Loan to the BitFuFu or its designee on or prior to the October 26, 2023 in lieu of paying all outstanding principal under this Note.\nOn April 19, 2023, Arisz filed with the SEC, and mailed to its stockholders of record as of April 6, 2023, a notice of meeting, proxy statement and proxy card, with respect to a special meeting of Arisz stockholders to be held on May 11, 2023, and which included proposals to amend Ariszs charter in order to extend the time it has to complete its initial business combination up to nine (9) times with each extension allowing for an additional one (1) month period from May 22, 2023 to February 22, 2024, provided that Arisz contributes to the Trust Account $120,000 for each one-month extension, paid on a month-to-month and as-needed basis.\nOn May 11, 2023, Arisz held a special meeting of stockholders to consider, among other things, proposals to amend Ariszs charter in order to extend the time it has to complete its initial business combination up to nine (9) times with each extension allowing for an additional one (1) month period from May 22, 2023 to February 22, 2024, provided that Arisz contributes to the Trust Account $120,000 for each one-month extension, paid on a month-to-month and as-needed basis. At the special meeting, the requisite number of stockholders voted in favor of these proposals.\nIn connection with the special meeting, 3,745,635 shares of Common Stock were tendered for redemption. As a result, approximately $39.18 million (approximately $10.46 per share) was removed from the Trust Account to pay such holders, without taking into account additional allocation of payments to cover any tax obligation of Arisz, such as franchise taxes, but not including any excise tax, since that date.\nOn July 28, 2023, Arisz and BitFuFu entered into Amendment No. 4 to the Merger Agreement (Amendment No. 4) to provide, among other things: (1) that the Outside Date for the completion of the Corporations business combination, as defined therein be extended from August 1, 2023 to November 17, 2024 and (2) for an amendment to the loan installment of $360,000 to be extended on each of August 2, 2023, November 2, 2023, February 2, 2024, May 2, 2024 and August 2, 2024 to be used to cover the extension costs, and the remaining balance of each loan installment to be used for working capital. In accordance therewith, on July 28, 2023, Arisz and BitFuFu amended and restated the BitFuFu Note.\nWe expect to continue to incur significant costs in the pursuit of our acquisition plans. We cannot assure you that our plans to complete the Business Combination will be successful.\nResults of Operations\nWe have neither engaged in any operations nor generated any operating revenues to date. Our only activities from inception through September 30, 2023 were organizational activities and those necessary to prepare for our initial public offering (IPO), and, after our IPO, searching for a target business to acquire. We do not expect to generate any operating revenues until after the completion of our initial Business Combination. We expect to generate non-operating income in the form of interest income on marketable securities held after the IPO. We expect that we will incur increased expenses as a result of being a public company (for legal, financial reporting, accounting and auditing compliance), as well as for due diligence expenses in connection with searching for, and completing, a Business Combination.\nFor the year ended September 30, 2023, we had net income of $1,216,880, which consisted of interest earned on marketable securities of $2,386,358, offset by general and administrative expenses of $585,514, franchise tax expense of $40,000, interest expense on Bitfufu loan of $51,229 and income tax expense of $492,735.\nFor the year ended September 30, 2022, we had a net loss of $255,901, which consisted of interest earned on marketable securities of $418,075, offset by general and administrative expenses of $544,157, franchise tax expense of $53,194 and income tax expense of $76,625.\nCash used in operating activities was $842,563 and $484,814 for the year ended September 30, 2023 and 2022, respectively.\nLiquidity and Going Concern\nAs of September 30, 2023, we had marketable securities held in the Trust Account of $34,107,463 consisting investments in money market funds that invest in U.S. government securities with a maturity of 185 days or less. Interest income on the balance in the Trust Account may be used by us to pay taxes. Through September 30, 2023, we withdraw $483,833 from interest earned on the Trust Account to pay our taxes. We intend to use substantially all of the funds held in the Trust Account, to acquire a target business and to pay our expenses relating thereto. To the extent that our capital stock is used in whole or in part as consideration to effect a Business Combination, the remaining funds held in the Trust Account will be used as working capital to finance the operations of the target business. Such working capital funds could be used in a variety of ways including continuing or expanding the target business operations, for strategic acquisitions and for marketing, research and development of existing or new products. Such funds could also be used to repay any operating expenses or finders fees which we had incurred prior to the completion of our Business Combination if the funds available to us outside of the Trust Account were insufficient to cover such expenses.\nAs of September 30, 2023, we had cash of $215,059 and a working capital deficit of $2,911,056 (excluding income tax and franchise tax payable). In connection with the shareholder special meeting on May 11, 2023, in each of May, June, July, August, September, October and November 2023, the Company deposited $120,000 per deposit into the Trust Account to extend the time for Arisz to complete the Business Combination until January 22, 2024. It is uncertain that the Company will be able consummate a Business Combination by the extended date (or February 22, 2024 if the Sponsor elects to extend the consummation deadline). Moreover, Arisz may need to obtain additional financing either to complete its Business Combination or because it becomes obligated to redeem a significant number of public shares upon consummation of its Business Combination, in which case the Company may issue additional securities or incur debt in connection with such Business Combination. If a Business Combination is not consummated by February 22, 2024, there will be a mandatory liquidation and subsequent dissolution.\nUntil consummation of the Business Combination, we intend to use the funds held outside the Trust Account for identifying and evaluating prospective acquisition candidates, performing business due diligence on prospective target businesses, traveling to and from the offices, plants or similar locations of prospective target businesses, reviewing corporate documents and material agreements of prospective target businesses, selecting the target business to acquire and structuring, negotiating and consummating the Business Combination. If our estimate of the costs of identifying a target business, undertaking in-depth due diligence and negotiating a Business Combination are less than the actual amount necessary to do so, we may have insufficient funds available to operate our business prior to our Business Combination. In this event, our officers, directors or their affiliates may, but are not obligated to, loan us funds as may be required. If we consummate an initial Business Combination, we would repay such loaned amounts out of the proceeds of the Trust Account released to us upon consummation of the Business Combination. In the event that a Business Combination does not close, we may use a portion of the working capital held outside the Trust Account to repay such loaned amounts, but no proceeds from our Trust Account would be used for such repayment. The terms of such loans by our initial shareholders, officers and directors, if any, have not been determined and no written agreements exist with respect to such loans.\nWe expect to continue to incur significant professional costs to remain as a publicly traded company and to incur significant transaction costs in pursuit of the consummation of a Business Combination. In connection with the Companys assessment of going concern considerations in accordance with Financial Accounting Standard Boards Accounting Standards Update (ASU) 2014-15, Disclosures of Uncertainties about an Entitys Ability to Continue as a Going Concern, management has determined that the liquidity concern raise substantial doubt about the Companys ability to continue as a going concern. There is no assurance that the Companys plans to consummate a Business Combination will be successful within the Combination Period (by February 22, 2024). As a result, management has determined that such an additional condition also raises substantial doubt about the Companys ability to continue as a going concern. The financial statement does not include any adjustments that might result from the outcome of this uncertainty.\nOff-Balance Sheet Financing Arrangements\nWe have no obligations, assets or liabilities, which would be considered off-balance sheet arrangements as of September 30, 2023. We do not participate in transactions that create relationships with unconsolidated entities or financial partnerships, often referred to as variable interest entities, which would have been established for the purpose of facilitating off-balance sheet arrangements. We have not entered into any off-balance sheet financing arrangements, established any special purpose entities, guaranteed any debt or commitments of other entities, or purchased any non-financial assets.\nContractual Obligations\nWe do not have any long-term debt, capital lease obligations, operating lease obligations or long-term liabilities, other than described below.\nUpon closing of a Business Combination, the underwriters will be entitled to a deferred fee of $0.375 per public share, or $2,587,500 in the aggregate. The deferred fee will become payable to the underwriters from the amounts held in the Trust Account solely in the event that we complete a Business Combination, subject to the terms of the underwriting agreement. The underwriters will also be entitled to 51,750 common shares, to be issued if the Company closes a Business Combination.\nWe engaged a legal counsel firm for legal advisory services, and the legal counsel agreed to defer their fees in excess of $200,000. The deferred fee will become payable in the event that the Company completes a Business Combination. As of September 30, 2023 and December 31, 2022, the Company had deferred legal fees of approximately $1.62 million and none, respectively, in connection with such services.\nCritical Accounting Policies\nThe preparation of financial statements and related disclosures in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, disclosure of contingent assets and liabilities at the date of the financial statements, and income and expenses during the period reported. Actual results could materially differ from those estimates. We have identified the following critical accounting policies:\nCommon stock Subject to Possible Redemption\nWe account for our common stock subject to possible redemption in accordance with the guidance in Accounting Standards Codification (ASC) Topic 480, Distinguishing Liabilities from Equity. Common stock subject to mandatory redemption is classified as a liability instrument and is measured at fair value. Conditionally redeemable common stock (including common stock that feature redemption rights that is either within the control of the holder or subject to redemption upon the occurrence of uncertain events not solely within the Companys control) is classified as temporary equity. At all other times, common stock is classified as stockholders equity. The Companys common stock features certain redemption rights that are considered to be outside of the Companys control and subject to occurrence of uncertain future events. Accordingly, common stock subject to possible redemption is presented at redemption value as temporary equity, outside of the stockholders deficit section of the Companys balance sheet. The Company recognizes changes in redemption value immediately as they occur and adjusts the carrying value of redeemable common stock to equal the redemption value at the end of each reporting period. Increases or decreases in the carrying amount of shares of redeemable common stock are affected by charges against additional paid-in capital or accumulated deficit if additional paid-in capital is zero.\nNet Income (Loss) per Share\nThe Company complies with accounting and disclosure requirements of FASB ASC 260, Earnings Per Share. The statements of operations include a presentation of income (loss) per redeemable share and income (loss) per non-redeemable share following the two-class method of income per share. In order to determine the net income (loss) attributable to both the redeemable shares and non-redeemable shares, the Company first considered the undistributed income (loss) allocable to both the redeemable shares and non-redeemable shares and the undistributed income (loss) is calculated using the total net loss less any dividends paid. The Company then allocated the undistributed income (loss) ratably based on the weighted average number of shares outstanding between the redeemable and non-redeemable shares. Any remeasurement of the accretion to redemption value of the common shares subject to possible redemption was considered to be dividends paid to the public shareholders.\nWarrants\nThe Company accounts for warrants as either equity-classified or liability-classified instruments based on an assessment of the warrants specific terms and applicable authoritative guidance in Financial Accounting Standards Board (FASB) ASC 480, Distinguishing Liabilities from Equity (ASC 480), and ASC 815, Derivatives and Hedging (ASC 815). The assessment considers whether the warrants are freestanding financial instruments pursuant to ASC 480, whether they meet the definition of a liability pursuant to ASC 480, and whether the warrants meet all of the requirements for equity classification under ASC 815, including whether the warrants are indexed to the Companys own common stock and whether the warrant holders could potentially require net cash settlement in a circumstance outside of the Companys control, among other conditions for equity classification. This assessment, which requires the use of professional judgment, is conducted at the time of warrant issuance and as of each subsequent quarterly period end date while the warrants are outstanding. Consequently, the Company accounts for warrants as equity-classified instruments.\nFor issued or modified warrants that meet all of the criteria for equity classification, the warrants are required to be recorded as a component of equity at the time of issuance. For issued or modified warrants that do not meet all the criteria for equity classification, the warrants are required to be recorded as liabilities at their initial fair value on the date of issuance, and each balance sheet date thereafter. Changes in the estimated fair value of the warrants are recognized as a non-cash gain or loss on the statements of operations.\nOffering Costs\nOffering costs consist of underwriting, legal, accounting, registration and other expenses incurred through the balance sheet date that are directly related to the IPO. The Company complies with the requirements of ASC 340-10-S99-1 and SEC Staff Accounting Bulletin Topic 5A - Expenses of Offering. Offering costs are allocated between public shares and public rights based on the estimated fair values of public shares and public rights at the date of issuance.\nRecent Accounting Standards\nIn August 2020, the Financial Accounting Standards Board (FASB) issued Accounting Standards Update (ASU) 2020-06, Debt-Debt with Conversion and Other Options (Subtopic 470-20) and Derivatives and Hedging-Contracts in Entitys Own Equity (Subtopic 815-40) (ASU 2020-06), to simplify accounting for certain financial instruments. ASU 2020-06 eliminates the current models that require separation of beneficial conversion and cash conversion features from convertible instruments and simplifies the derivative scope exception guidance pertaining to equity classification of contracts in an entitys own equity. The new standard also introduces additional disclosures for convertible debt and freestanding instruments that are indexed to and settled in an entitys own equity. ASU 2020-06 amends the diluted earnings per share guidance, including the requirement to use the if-converted method for all convertible instruments. The amendments are effective for smaller reporting companies for fiscal years beginning after December 15, 2023, including interim periods within those fiscal years. The Company is currently assessing the impact, if any, that ASU 2020-06 would have on its financial position, results of operations or cash flows.\nManagement does not believe that any recently issued, but not yet effective, accounting standards, if currently adopted, would have a material effect on our financial statements. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nAs a smaller reporting company, we are not required to make disclosures under this Item. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nThis information appears following Item 15 of this Report and is included herein by reference. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone. ITEM 9A. CONTROLS AND PROCEDURES.\nEvaluation of Disclosure Controls and Procedures\nDisclosure controls are procedures that are designed with the objective of ensuring that information required to be disclosed in our reports filed under the Exchange Act, such as this Report, is recorded, processed, summarized, and reported within the time period specified in the SECs rules and forms. Disclosure controls are also designed with the objective of ensuring that such information is accumulated and communicated to our management, including the chief executive officer and chief financial officer, as appropriate to allow timely decisions regarding required disclosure. Our management evaluated, with the participation of our current chief executive officer and chief financial officer (our Certifying Officers), the effectiveness of our disclosure controls and procedures as of September 30, 2023, pursuant to Rule 13a-15(b) under the Exchange Act. Based upon that evaluation, our Certifying Officers concluded that, as of September 30, 2023, our disclosure controls and procedures were not effective because of material weaknesses in our control environment which resulted in inadequate oversight over the accounting for interest earned on investments held in the Trust Account.\nA material weakness, as defined in the SEC regulations, is a deficiency, or combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of the companys annual or interim financial statements will not be prevented or detected on a timely basis. In light of this material weakness, we performed additional analysis as deemed necessary to ensure that our financial statements were prepared in accordance with U.S. GAAP.\nManagement plans to remediate the material weakness by enhancing our processes to identify and appropriately apply applicable accounting requirements and increased communication among our personnel and third-party professionals with whom we consult regarding accounting applications. The elements of our remediation plan can only be accomplished over time, and we can offer no assurance that these initiatives will ultimately have the intended effects. For a discussion of managements consideration of the material weakness identified related to our accounting for interest earned on investments held in the Trust Account, see Note 2-Restatement of Previously Issued Financial Statements to the accompanying financial statements.\nManagements Report on Internal Controls Over Financial Reporting\nThis Annual Report on Form 10-K does not include a report of managements assessment regarding internal control over financial reporting or an attestation report of our independent registered public accounting firm due to a transition period established by rules of the SEC for newly public companies.\nChanges in Internal Control over Financial Reporting\nThere were no changes in our internal control over financial reporting (as such term is defined in Rules 13a-15(f) and 15d-15(f) of the Exchange Act) that occurred during the fiscal year ended September 30, 2023 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. ITEM 9B. OTHER INFORMATION\nNot applicable.\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable.\npart III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe following table sets forth information about our directors and executive officers.\nName\nAge\nPosition\nEcho Hindle-Yang\nChairman of the Board of Directors and Chief Executive Officer\nMarc Estigarribia\nChief Financial Officer\nRushi Trivedi\nDirector\nRomain Guerel\nDirector\nNick He\nDirector\nEcho Hindle-Yang has been our Chief Executive Officer since inception and became chairwoman of our board of directors upon consummation of our IPO. Ms. Hindle-Yang has more than 20 years of extensive experience of leading complex organizations, managing transactions for fortune 500 global companies and founding new ventures to resolve unmet market needs. More recently, Ms. Hindle-Yangs focus has largely been within the healthcare industry, where she has advised global pharmaceutical and medical device companies in North America and Europe on their corporate strategy endeavors, financing paths, portfolio optimization and acquisition opportunities. In 2016, Ms. Hindle-Yang founded M.S.Q. Ventures, a New York-based advisory firm that focuses on integration for emerging life sciences companies. From 2011 to 2015, Ms. Hindle-Yang served as Chief Operation Officer at Playbutton LLC where she managed the companys business strategy, marketing, finance operations including IPOs and acquisitions. In 2010, Ms. Hindle-Yang joined Gerber Scientific Inc as director of global strategy and operations in charge of leading a brand-new global team to focus on overseas expansion and operations. Ms. Hindle-Yang holds an MBA from Duke University with a health sector management certificate. Currently Ms. Hindle-Yang is serving on the DukeNY Board.\nMarc Estigarribia has been our Chief Financial Officer since inception. Mr. Estigarribia has been the Managing Director and Head of Origination and Engagement at MSQ Ventures since May 2016, where he has led the companys client origination and engagement effort in the life science industry. Mr. Estigarribia maintains a deep network of global relationships with strategic partners and investors within the life science industry. Between September 2015 and April 2016, Mr. Estigarribia served as vice president senior research analyst at Chardan. Mr. Estigarribia was responsible for equity stock coverage of the Technology, TMT industry with a main vertical focus on Internet of Things (IOT/ M2M) Machine-to-Machine Communications (M2M) including Robotics, Artificial Intelligence and Semiconductors. Between March 2013 and August 2015, Mr. Estigarribia served as senior investment banking associate at Wellington Shields. Mr. Estigarribia worked with both public and private growth companies to help provide capital raising, merger & acquisition, and strategic financial advisory services in all facets of the capital structure - Private Equity, Senior Debt, Mezzanine Debt, Unitranche, Equity, IPOs, Secondary Offerings, and Private Placements. Between April 2011 and March 2013, Mr. Estigarribia served as CFO at Rubin Singer, a start-up company in the Luxury Goods Fashion industry where Mr. Estigarribia managed cash flow, capital formation and investment advisory for this start-up company in the Luxury Goods Fashion industry. Mr. Estigarribia also maintained constant communication flow with both existing and prospective equity and debt investors, and internal management board-team, while enhancing strategic relationships. Between July 1996 and March 2011, Mr. Estigarribia served as a sell-side Equity Research Analyst at Citigroup. Mr. Estigarribias responsibilities covered 70% of the teams total coverage for telecommunication services and media companies in Latin America. Mr. Estigarribia initiated and launched the numerous reports within the wireless and media sectors between 2000 and 2003. Through these roles, Mr. Estigarribia has developed and maintained relationships with top tier institutional investors. Mr. Estigarribia obtained his MBA degree in 1995 from NYU Stern School of Business and his BS in Economics from Binghamton University, State University of New York.\nNick He has been a member of our board of directors since November 17, 2021. Since January 2017, Mr. He has been the Founder and the Chief Executive Officer of GPS Renting, a privately held real estate investment firm with brokerage and property management services which brings cutting-edge mobile technology, strategic planning, and extensive real estate experience to serve clients. Between April 2012 and November 2016, Mr. He started as a strategy and product planer and became the senior program manager lead when he left Microsoft. Mr. He was responsible for product strategies, including, but not limited to Market opportunity & Business Plan, Growth strategy, Turnaround Strategy at Microsoft. Between May 2008 and September 2008, Mr. He served as summer associate consultant at McKinsey & Co. where Mr. He led the Financial Analysis and Planning project which analysis of technology spending and recommended a 5-year investment strategy. Mr. He obtained his MBA degree focusing on strategy and marketing in 2009 from Duke University Fuqua School of Business.\nRushi Trivedi, PhD has been a member of our board of directors since November 17, 2021. Since 2019, Dr. Trivedi has been founder of RepliGene Life Sciences, a company that specializes in the production of Cell and Gene Therapy adducts. Dr. Trivedi focuses on unmet clinical needs and assists in bringing the next generation Cell and Gene Therapies to the market. Between June 2015 and April 2019, Dr. Trivedi served as strategy consultant at McKinsey & Company where Dr. Trivedi gained extensive experience in M&A, business development, due diligence, portfolio management and asset integration while drawing heavily from his background in oncology and drug development to serve clients in these topics across pharma, medical technology tech, and private equity. Dr. Trivedi has published widely in leading peer-reviewed journals. Dr. Trivedi obtained his Doctor of Philosophy in Biochemistry and Molecular Biology from Stowers Institute of Medical Research and University of Kansas Medical Center in 2015, and his MS in Medicinal and Pharmaceutical Chemistry from University of Kansas in 2009, and his BS in Pharmaceutical Sciences from Purdue University in 2007.\nDr. Romain Guerel has been a member of our board of directors since November 17, 2021. Since March 2020, Dr. Guerel is the founder and CEO of MSolution Consulting. The consulting company provides project management consultancy for European and North American companies. Starting March 2019, Dr. Guerel has been elected as an executive board member of a French International School where he has in charge with other 7 board members of all administrative and strategic decisions on behalf of the parents committee. From September 2012 to February 2020, Dr. Guerel worked as a director for Century 3 Project Management Company where he was in charge on multiple management projects for Fortune 500 companies. From 2001 to 2012, Dr. Guerel was the co-founder and Managing Director of Capital Resources where he was in charge of raising funds for high-end real estate projects. Dr. Guerel obtained his Doctor of Philosophy in Management from HKUST Business School in 2011, and has Master of Laws degrees in Commercial French law and International law from the Law School of Nice Sophia Antipolis.\nNumber, terms of office and appointment of officers and directors\nOur board of directors is divided into three classes with only one class of directors being elected in each year and each class serving a three-year term. The term of office of the first class of directors will expire at our first annual meeting of stockholders. The term of office of the second class of directors, will expire at the second annual meeting. The term of office of the third class of directors, will expire at our third annual meeting of stockholders. We may not hold an annual meeting of stockholders until after we consummate our initial business combination.\nOur officers are appointed by the board of directors and serve at the discretion of the board of directors, rather than for specific terms of office. Our board of directors is authorized to appoint persons to the offices set forth in our bylaws as it deems appropriate. Our bylaws provide that our directors may consist of a chairman of the board, and that our officer may consist of chief executive officer, president, chief financial officer, executive vice president(s), vice president(s), secretary, treasurer and such other officers as may be determined by the board of directors.\nExecutive Compensation\nNo executive officer has received any cash compensation for services rendered to us. Commencing on the date of our IPO prospectus through the completion of our initial business combination with a target business, we will pay to Arisz Investment LLC, a fee of $10,000 per month for providing us with office space and certain office and secretarial services. However, pursuant to the terms of such agreement, our sponsor agreed to defer the payment of such monthly fee. Any such unpaid amount will accrue without interest and be due and payable no later than the date of the consummation of our initial business combination. Other than the $10,000 per month administrative fee, no compensation or fees of any kind, including finders fees, consulting fees and other similar fees, will be paid to our insiders or any of the members of our management team, for services rendered prior to or in connection with the consummation of our initial business combination (regardless of the type of transaction that it is). However, such individuals will receive reimbursement for any out-of-pocket expenses incurred by them in connection with activities on our behalf, such as identifying potential target businesses, performing business due diligence on suitable target businesses and business combinations as well as traveling to and from the offices, plants or similar locations of prospective target businesses to examine their operations. There is no limit on the amount of out-of-pocket expenses reimbursable by us; provided, however, that to the extent such expenses exceed the available proceeds not deposited in the Trust Account and the interest income earned on the amounts held in the trust account, such expenses would not be reimbursed by us unless we consummate an initial business combination.\nAfter our initial business combination, members of our management team who remain with us may be paid consulting, management or other fees from the combined company with any and all amounts being fully disclosed to stockholders, to the extent then known, in the proxy solicitation materials furnished to our stockholders. It is unlikely the amount of such compensation will be known at the time of a stockholder meeting held to consider our initial business combination, as it will be up to the directors of the post-combination business to determine executive and director compensation. In this event, such compensation will be publicly disclosed at the time of its determination in a Current Report on Form 8-K, as required by the SEC.\nDirector independence\nNasdaq listing standards require that within one year of the listing of our securities on the Nasdaq Global Market we have at least three independent directors and that a majority of our board of directors be independent. An independent director is defined generally as a person other than an officer or employee of the company or its subsidiaries or any other individual having a relationship which in the opinion of the companys board of directors, would interfere with the directors exercise of independent judgment in carrying out the responsibilities of a director. Our Board of Directors had determined that each of Rushi Trivedi, Romain Guerel and Nick He is an independent director as defined in the Nasdaq listing standards and applicable SEC rules. Our independent directors will have regularly scheduled meetings at which only independent directors are present.\nWe will only enter into a business combination if it is approved by a majority of our independent directors. Additionally, we will only enter into transactions with our officers and directors and their respective affiliates that are on terms no less favorable to us than could be obtained from independent parties. Any related-party transactions must be approved by our audit committee and a majority of disinterested directors.\nAudit Committee\nEffective as of the date of our IPO prospectus, we established an audit committee of the board of directors, which consists of Rushi Trivedi, Romain Guerel and Nick He, each of whom is an independent director. Nick He serves as chairman of the audit committee.\nThe audit committees duties, which are specified in our Audit Committee Charter, include, but are not limited to:\n● reviewing and discussing with management and the independent registered public accounting firm the annual audited financial statements, and recommending to the board whether the audited financial statements should be included in our Form 10-K;\n● discussing with management and the independent registered public accounting firm significant financial reporting issues and judgments made in connection with the preparation of our financial statements;\n● discussing with management major risk assessment and risk management policies;\n● monitoring the independence of the independent registered public accounting firm;\n● verifying the rotation of the lead (or coordinating) audit partner having primary responsibility for the audit and the audit partner responsible for reviewing the audit as required by law;\n● reviewing and approving all related-party transactions;\n● inquiring and discussing with management our compliance with applicable laws and regulations;\n● pre-approving all audit services and permitted non-audit services to be performed by our independent registered public accounting firm, including the fees and terms of the services to be performed;\n● appointing or replacing the independent registered public accounting firm;\n● determining the compensation and oversight of the work of the independent registered public accounting firm (including resolution of disagreements between management and the independent registered public accounting firm regarding financial reporting) for the purpose of preparing or issuing an audit report or related work;\n● establishing procedures for the receipt, retention and treatment of complaints received by us regarding accounting, internal accounting controls or reports which raise material issues regarding our financial statements or accounting policies; and\n● approving reimbursement of expenses incurred by our management team in identifying potential target businesses.\nFinancial Experts on Audit Committee\nThe audit committee will at all times be composed exclusively of independent directors who are financially literate as defined under the Nasdaq listing standards. The Nasdaq listing standards define financially literate as being able to read and understand fundamental financial statements, including a companys balance sheet, income statement and cash flow statement.\nIn addition, we must certify to Nasdaq that the committee has, and will continue to have, at least one member who has past employment experience in finance or accounting, requisite professional certification in accounting, or other comparable experience or background that results in the individuals financial sophistication. The board of directors has determined that Nick He qualifies as an audit committee financial expert, as defined under rules and regulations of the SEC.\nCompensation Committee\nEffective as of the date of our IPO prospectus, we established a compensation committee of the board of directors consisting of Rushi Trivedi, Romain Guerel and Nick He, each of whom is an independent director. Rushi Trivedi serves as chairman of the compensation committee.\nWe adopted a compensation committee charter, which details the principal functions of the compensation committee, including:\n● reviewing and approving on an annual basis the corporate goals and objectives relevant to our Chief Executive Officers compensation, evaluating our Chief Executive Officers performance in light of such goals and objectives and determining and approving the remuneration (if any) of our Chief Executive Officers based on such evaluation;\n● reviewing and approving the compensation of all of our other executive officers and reviewing and making recommendations with respect to all non-executive officer compensation;\n● reviewing our executive compensation policies and plans;\n● implementing and administering our incentive compensation equity-based remuneration plans;\n● assisting management in complying with our proxy statement and annual report disclosure requirements;\n● approving all special perquisites, special cash payments and other special compensation and benefit arrangements for our executive officers and employees;\n● producing a report on executive compensation to be included in our annual proxy statement; and\n● reviewing, evaluating and recommending changes, if appropriate, to the remuneration for directors.\nThe charter also provides that the compensation committee may, in its sole discretion, retain or obtain the advice of a compensation consultant, legal counsel or other adviser and will be directly responsible for the appointment, compensation and oversight of the work of any such adviser. However, before engaging or receiving advice from a compensation consultant, external legal counsel or any other adviser, the compensation committee will consider the independence of each such adviser, including the factors required by Nasdaq and the SEC.\nDirector nominations\nWe do not have a standing nominating committee, though we intend to form a corporate governance and nominating committee as and when required to do so by law or Nasdaq rules. In accordance with Rule 5605(e)(2) of the Nasdaq rules, a majority of the independent directors may recommend a director nominee for selection by the board of directors. The board of directors believes that the independent directors can satisfactorily carry out the responsibility of properly selecting or approving director nominees without the formation of a standing nominating committee. Rushi Trivedi, Romain Guerel and Nick He will participate in the consideration and recommendation of director nominees. In accordance with Rule 5605(e)(1)(A) of the Nasdaq rules, all such directors are independent. As there is no standing nominating committee, we do not have a nominating committee charter in place.\nThe board of directors will also consider director candidates recommended for nomination by our stockholders during such times as they are seeking proposed nominees to stand for election at the next annual meeting of stockholders (or, if applicable, a special meeting of stockholders). Our stockholders that wish to nominate a director for election to the Board should follow the procedures set forth in our bylaws.\nWe have not formally established any specific, minimum qualifications that must be met or skills that are necessary for directors to possess. In general, in identifying and evaluating nominees for director, the board of directors considers educational background, diversity of professional experience, knowledge of our business, integrity, professional reputation, independence, wisdom, and the ability to represent the best interests of our stockholders.\nDirector Compensation\nNo director will receive cash compensation for serving on our board. Prior to the closing of the offering, the Sponsor transferred an aggregate of 57,500 insider shares to the directors.\nCompensation Committee Interlocks and Insider Participation\nWe may not have a compensation committee in place prior to the completion of our initial business combination. Any executive compensation matters that arise prior to the time we have a compensation committee in place will be determined by our independent directors. None of our directors who currently serve as members of our compensation committee is, or has at any time in the past been, one of our officers or employees. None of our executive officers currently serves, or in the past year has served, as a member of the compensation committee of any other entity that has one or more executive officers serving on our board of directors. None of our executive officers currently serves, or in the past year has served, as a member of the board of directors of any other entity that has one or more executive officers serving on our compensation committee.\nCode of ethics\nEffective upon consummation of our IPO, we adopted a code of ethics that applies to all of our executive officers, directors and employees. The code of ethics codifies the business and ethical principles that govern all aspects of our business.\nConflicts of interest\nInvestors should be aware of the following potential conflicts of interest:\n● None of our officers and directors is required to commit their full time to our affairs and, accordingly, they may have conflicts of interest in allocating their time among various business activities.\n● In the course of their other business activities, our officers and directors may become aware of investment and business opportunities which may be appropriate for presentation to our company as well as the other entities with which they are affiliated. Thus, our officers and directors may have conflicts of interest in determining to which entity a particular business opportunity should be presented.\n● Our officers and directors may in the future become affiliated with entities, including other blank check companies, engaged in business activities similar to those intended to be conducted by our company.\n● Unless we consummate our initial business combination, our officers, directors and other insiders will not receive reimbursement for any out-of-pocket expenses incurred by them to the extent that such expenses exceed the amount of available proceeds not deposited in the Trust Account.\n● The insider shares beneficially owned by our officers and directors will be released from escrow only if our initial business combination is successfully completed. Additionally, if we are unable to complete an initial business combination within the required time frame, our officers and directors will not be entitled to receive any amounts held in the trust account with respect to any of their insider shares or private units. Furthermore, Arisz Investment LLC has agreed that the private units will not be sold or transferred by it until after we have completed our initial business combination. For the foregoing reasons, our board may have a conflict of interest in determining whether a particular target business is an appropriate business with which to effect our initial business combination.\nIn general, officers and directors of a corporation incorporated under the laws of the State of Delaware are required to present business opportunities to a corporation if:\n● the corporation could financially undertake the opportunity;\n● the opportunity is within the corporations line of business; and\n● it would not be fair to the corporation and its stockholders for the opportunity not to be brought to the attention of the corporation.\nAccordingly, as a result of multiple business affiliations, our officers and directors may have similar legal obligations relating to presenting business opportunities meeting the above-listed criteria to multiple entities. Furthermore, our certificate of incorporation provides that the doctrine of corporate opportunity will not apply with respect to any of our officers or directors in circumstances where the application of the doctrine would conflict with any fiduciary duties or contractual obligations they may have. In order to minimize potential conflicts of interest which may arise from multiple affiliations, our officers and directors (other than our independent directors) have agreed to present to us for our consideration, prior to presentation to any other person or entity, any suitable opportunity to acquire a target business, until the earlier of: (1) our consummation of an initial business combination and (2) February 22, 2024 (unless such date is further extended by a shareholder vote in accordance with our governing documents). This agreement is, however, subject to any pre-existing fiduciary and contractual obligations such officer or director may from time to time have to another entity. Accordingly, if any of them becomes aware of a business combination opportunity which is suitable for an entity to which he or she has pre-existing fiduciary or contractual obligations, he or she will honor his or her fiduciary or contractual obligations to present such business combination opportunity to such entity, and only present it to us if such entity rejects the opportunity. We do not believe, however, that the pre-existing fiduciary duties or contractual obligations of our officers and directors will materially undermine our ability to complete our business combination because in most cases the affiliated companies are closely held entities controlled by the officer or director or the nature of the affiliated companys business is such that it is unlikely that a conflict will arise.\nSection 16(a) Beneficial Ownership Reporting Compliance\nSection 16(a) of the Securities Exchange Act of 1934, as amended, or the Exchange Act, requires our executive officers, directors and persons who beneficially own more than 10% of a registered class of our equity securities to file with the Securities and Exchange Commission initial reports of ownership and reports of changes in ownership of our shares of common stock and other equity securities. These executive officers, directors, and greater than 10% beneficial owners are required by SEC regulation to furnish us with copies of all Section 16(a) forms filed by such reporting persons.\nBased solely on our review of such forms furnished to us and written representations from certain reporting persons, we believe that all filing requirements applicable to our executive officers, directors and greater than 10% beneficial owners were filed in a timely manner. ITEM 11. EXECUTIVE COMPENSATION\nEmployment Agreements\nWe have not entered into any employment agreements with our executive officers and have not made any agreements to provide benefits upon termination of employment.\nExecutive Officers and Director Compensation\nOther than the $10,000 per month administrative fee paid to the Arisz Investments LLC, our Sponsor, over which Echo Hindle-Yang is the managing member, no executive officer has received any cash compensation for services rendered to us. No compensation of any kind, including any finders fee, reimbursement, consulting fee or monies in respect of any payment of a loan, will be paid by us to our Sponsor, officers or directors or any affiliate of our Sponsor, officers or directors, prior to, or in connection with any services rendered in order to effectuate, the consummation of our initial business combination (regardless of the type of transaction that it is). However, these individuals will be reimbursed for any out-of-pocket expenses incurred in connection with activities on our behalf such as identifying potential target businesses and performing due diligence on suitable business combinations. Our audit committee will review on a quarterly basis all payments that were made to our Sponsor, officers or directors or our or their affiliates. Any such payments prior to an initial business combination will be made using funds held outside the trust account. Other than quarterly audit committee review of such payments, we do not expect to have any additional controls in place governing our reimbursement payments to our directors and executive officers for their out-of-pocket expenses incurred in connection with identifying and consummating an initial business combination.\nCompensation Committee Interlocks and Insider Participation\nNone of our officers currently serves, or in the past year has served, as a member of the compensation committee of any entity that has one or more officers serving on our board of directors. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe following table sets forth as of December 18, 2023 the number of shares of common stock beneficially owned by (i) each person who is known by us to be the beneficial owner of more than five percent of our issued and outstanding shares of common stock (ii) each of our officers and directors; and (iii) all of our officers and directors as a group. As of December 18, 2023, we had 5,155,754 shares of common stock, issued and outstanding.\nUnless otherwise indicated, we believe that all persons named in the table have sole voting and investment power with respect to all shares of common stock beneficially owned by them. The following table does not reflect record of beneficial ownership of any shares of common stock issuable upon exercise of the warrants or conversion of rights, as the warrants are not exercisable, and the rights are not convertible within 60 days of December 18, 2023.\nName and Address of Beneficial Owner(1)\nNumber of\nShares\nBeneficially\nOwned(2)(3)\nPercentage of\nOutstanding\nShares\nEcho Hindle-Yang(4)\n1,786,683\n34.7 %\nMarc Estigarribia\n10,000\n* %\nRushi Trivedi\n2,500\n* %\nRomain Guerel\n2,500\n* %\nNick He\n2,500\n* %\nAll officers and directors as a group\n1,804,183\n35.0 %\n(5 individuals)\nArisz Investment LLC(5)\n1,746,683\n33.9 %\n* Less than one percent.\n(1) Unless otherwise indicated, the business address of each of the following entities or individuals is C/O MSQ Ventures, 12 E 49th St, 17th floor, New York, NY 10017.\n(2) Interests shown consist solely of insider shares, classified as shares of common stock. Reflects the transfer of an aggregate of 57,500 insider shares to the directors by the Sponsor prior to the consummation of the offering.\n(3) Does not include beneficial ownership of any shares of common stock underlying outstanding private rights, private warrants, and the Unit Purchase Option as such shares are not issuable within 60 days of the date of this report\n(4) Consists of (i) 40,000 shares of Common Stock held by Echo Hindle-Yang, (ii) 207,389 shares of Common Stock underlying the private placement units held directly by Arisz Investment LLC, and (iii) 1,539,294 shares of Common Stock held by Arisz Investment LLC (of which 76,142 shares were sold by Arisz Investment LLC in connection with the companys initial business combination but have not been transferred as of the date hereof). Ms. Hindle-Yang is the manager of Arisz Investment LLC and has voting and dispositive control over the shares of Common Stock held by Arisz Investment LLC over which Echo Hindle-Yang has voting and dispositive power. Ms. Hindle-Yang disclaims beneficial ownership of such shares, except to the extent of her pecuniary interest therein.\n(5) Consists of (i) 207,389 shares of Common Stock underlying the private placement units held directly by Arisz Investment LLC and (ii) 1,539,294 shares of Common Stock held directly by Arisz Investment LLC (of which 76,142 shares were sold by Arisz Investment LLC in connection with the companys initial business combination but have not been transferred as of the date hereof). Echo Hindle-Yang is the manager of Arisz Investment LLC and therefore has voting and dispositive control over the shares of Common Stock and Common Stock held by Arisz Investment LLC. Our Chairman and Chief Executive Officer has voting and dispositive power over the shares owned by Arisz Investment LLC. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nFounder Shares\nOn August 5, 2021, our Sponsor purchased 1,437,500 founder shares for an aggregate purchase price of $25,000. On October 29, 2021, we effected a 1.2-for-1.0 stock split of our common stock, resulting in our sponsor holding an aggregate of 1,725,000 insider shares. The number of founder shares issued was determined based on the expectation that such founder shares would represent approximately 20% of the outstanding shares upon completion of our IPO (excluding the shares of common stock issued to the representative or its designees, the placement units and securities underlying the placement units and assuming the initial stockholders do not purchase units in the IPO). As of September 30, 2023, the Sponsor owned 1,943,889 shares of common stock. As the underwriters over-allotment option has been exercised in full, none of the shares of Common Stock held by the Sponsor are subject to forfeiture.\nThe initial stockholders have agreed not to transfer, assign or sell any of their founder shares (or shares of common stock issuable upon conversion thereof) until the earlier to occur of: (A) six months after the completion of the initial Business Combination and (B) subsequent to the initial Business Combination, if the reported last sale price of the common stock equals or exceeds $12.50 per share (as adjusted for stock splits, stock dividends, reorganizations, recapitalizations and the like) for any 20 trading days within any 30-trading day period commencing after the initial Business Combination.\nPromissory Note - Related Party\nOn August 5, 2021, the Sponsor issued to us an unsecured promissory note, pursuant to which we may borrow up to an aggregate principal amount of $300,000, to be used for payment of costs related to the Initial Public Offering. The note was non-interest bearing and payable on the earlier of the consummation of the Initial Public Offering or the date on which we determine not to proceed with the Initial Public Offering. Concurrently with the IPO, the Company repaid the outstanding balance of $105,000 to the Sponsor.\nRelated Party Loans\nIn order to finance transaction costs in connection with a Business Combination, the Sponsor or an affiliate of the Sponsor, or our officers and directors may, but are not obligated to, loan us funds as may be required (Working Capital Loans). Such Working Capital Loans would be evidenced by promissory notes. The notes would either be repaid upon consummation of a Business Combination, without interest, or, at the lenders discretion, up to $1,500,000 of notes may be converted upon consummation of a Business Combination into additional Placement Units at a price of $10.00 per Unit. In the event that a Business Combination does not close, we may use a portion of proceeds held outside the Trust Account to repay the Working Capital Loans, but no proceeds held in the Trust Account would be used to repay the Working Capital Loans. As of September 30, 2023, there was no amount outstanding under any Working Capital Loan.\nAdministrative Services Arrangement\nOur financial advisor has agreed, commencing from the date that our securities are first listed on NASDAQ through the earlier of our consummation of a Business Combination and its liquidation, to make available to us certain general and administrative services, including office space, utilities and administrative services, as we may require from time to time. We have agreed to pay the Sponsor $10,000 per month for these services.\nGeneral\nOur Sponsor, officers and directors, or any of their respective affiliates, will be reimbursed for any out-of-pocket expenses incurred in connection with activities on our behalf such as identifying potential target businesses and performing due diligence on suitable business combinations. Our audit committee will review on a quarterly basis all payments that were made to our Sponsor, officers or directors or our or their affiliates and will determine which expenses and the amount of expenses that will be reimbursed. There is no cap or ceiling on the reimbursement of out-of-pocket expenses incurred by such persons in connection with activities on our behalf.\nOther than the payment to our Sponsor of $10,000 per month for office space, utilities and secretarial and administrative support, no compensation of any kind, including finders, consulting or other similar fees, will be paid to any of our existing stockholders, officers, directors or any of their respective affiliates, prior to, or for any services they render in order to effectuate the consummation of an initial business combination.\nRelated Party Policy\nOur Code of Ethics, which we adopted on November 17, 2021, requires us to avoid, wherever possible, all related party transactions that could result in actual or potential conflicts of interests, except under guidelines approved by the board of directors (or the audit committee). Related-party transactions are defined as transactions in which (1) the aggregate amount involved will or may be expected to exceed $120,000 in any calendar year, (2) we or any of our subsidiaries is a participant, and (3) any (a) executive officer, director or nominee for election as a director, (b) greater than 5% beneficial owner of our common stock, or (c) immediate family member, of the persons referred to in clauses (a) and (b), has or will have a direct or indirect material interest (other than solely as a result of being a director or a less than 10% beneficial owner of another entity). A conflict of interest situation can arise when a person takes actions or has interests that may make it difficult to perform his or her work objectively and effectively. Conflicts of interest may also arise if a person, or a member of his or her family, receives improper personal benefits as a result of his or her position.\nIn addition, our audit committee, pursuant to a written charter that we adopted on November 17, 2021, is responsible for reviewing and approving related party transactions to the extent that we enter into such transactions. An affirmative vote of a majority of the members of the audit committee present at a meeting at which a quorum is present will be required in order to approve a related party transaction. A majority of the members of the entire audit committee will constitute a quorum. Without a meeting, the unanimous written consent of all of the members of the audit committee will be required to approve a related party transaction. A form of the audit committee charter that we adopted on November 17, 2021, is filed as an exhibit to the registration statement of which our IPO prospectus is a part. We also require each of our directors and executive officers to complete a directors and officers questionnaire that elicits information about related party transactions.\nThese procedures are intended to determine whether any such related party transaction impairs the independence of a director or presents a conflict of interest on the part of a director, employee or officer.\nTo further minimize conflicts of interest, we have agreed not to consummate an initial business combination with an entity that is affiliated with any of our Sponsor, officers or directors unless we, or a committee of independent directors, have obtained an opinion from an independent investment banking firm or another independent entity that commonly renders valuation opinions that our initial business combination is fair to our company from a financial point of view. Furthermore, no finders fees, reimbursements, consulting fee, monies in respect of any payment of a loan or other compensation will be paid by us to our Sponsor, officers or directors or any affiliate of our Sponsor, officers or directors prior to, for services rendered to us prior to, or in connection with any services rendered in order to effectuate, the consummation of our initial business combination (regardless of the type of transaction that it is). However, the following payments will be made to our Sponsor, officers or directors, or our or their affiliates, none of which will be made from the proceeds of our public offering held in the trust account prior to the completion of our initial business combination:\n● Repayment of up to an aggregate of $300,000 in loans made to us by our Sponsor to cover offering-related and organizational expenses;\n● Payment to our financial advisor of $10,000 per month for office space, utilities and secretarial and administrative support;\n● Reimbursement for any out-of-pocket expenses related to identifying, investigating and completing an initial business combination; and\n● Repayment of non-interest bearing loans which may be made by our Sponsor or an affiliate of our Sponsor or certain of our officers and directors to finance transaction costs in connection with an intended initial business combination, the terms of which (other than as described above) have not been determined nor have any written agreements been executed with respect thereto. Up to $1,500,000 of such loans may be convertible into units, at a price of $10.00 per unit at the option of the lender, upon consummation of our initial business combination. The units would be identical to the placement units.\nOur audit committee will review on a quarterly basis all payments that were made to our Sponsor, officers, directors or our or their affiliates.\nDirector Independence\nNasdaq listing standards require that a majority of our board of directors be independent. For a description of the director independence, see - Part III, Item 10 - Directors, Executive Officers and Corporate Governance. ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES.\nThe following is a summary of fees paid or to be paid to Marcum LLP, or Marcum, for services rendered.\nAudit Fees. Audit fees consist of fees for professional services rendered for the audit of our year-end financial statements and services that are normally provided by Marcum in connection with regulatory filings. The aggregate fees of Marcum for professional services rendered for the audit of our annual financial statements, review of the financial information included in our Forms 8-K for the respective periods and other required filings with the SEC totaled $100,950 and $85,000 for the year ended September 30, 2023 and 2022, respectively. The above amounts include interim procedures and audit fees, as well as attendance at audit committee meetings.\nAudit-Related Fees. Audit-related fees consist of fees billed for assurance and related services that are reasonably related to performance of the audit or review of our financial statements and are not reported under Audit Fees. These services include attest services that are not required by statute or regulation and consultations concerning financial accounting and reporting standards. We did not pay Marcum for any audit-related fees for the years ended September 30, 2023 and 2022.\nTax Fees. We did not pay Marcum for tax return services, planning and tax advice for the years ended September 30, 2023 and 2022.\nAll Other Fees. We did not pay Marcum for any other services for the years ended September 30, 2023 and 2022.\nPre-Approval Policy\nOur audit committee was formed upon the consummation of our initial public offering. As a result, the audit committee did not pre-approve all of the foregoing services, although any services rendered prior to the formation of our audit committee were approved by our board of directors. Since the formation of our audit committee, and on a going-forward basis, the audit committee has and will pre-approve all auditing services and permitted non-audit services to be performed for us by our auditors, including the fees and terms thereof (subject to the de minimis exceptions for non-audit services described in the Exchange Act which are approved by the audit committee prior to the completion of the audit).\npart IV ITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n(a) The following documents are filed as part of this Form 10-K:\n(1)\nFinancial Statements:\nPage\nReport of Independent Registered Public Accounting Firm\nBalance Sheets\nStatements of Operations\nStatements of Changes in Stockholders Equity(Deficit)\nStatements of Cash Flows\nNotes to Financial Statements\n(2) Financial Statement Schedules:\nNone.\n(3) Exhibits\nThe following exhibits are filed with this report. Exhibits which are incorporated herein by reference can be obtained from the SECs website at sec.gov.\nExhibit No.\nDescription\n1.1\nUnderwriting Agreement, Dated November 17, 2021, by and between the Registrant and Chardan Capital Markets, LLC as representative of the several underwriters (incorporated by reference to Exhibit 1.1 filed with the Form 8-K filed by the Registrant on November 23, 2021).\n3.1\nAmended and Restated Certificate of Incorporation (incorporated by reference to Exhibit 3.1 filed with the Form 8-K filed by the Registrant on November 23, 2021).\n3.2\nForm of Amended and Restated Bylaws (incorporated by reference to Exhibit 3.4 filed with the Form S-1/A filed by the Registrant on August 12, 2021).\n3.3\nAmended and Restated Certificate of Incorporation (incorporated by reference to Exhibit 3.1 filed with the Form 8-K filed by the Registrant on November 23, 2021) as amended by Amendment to the Amended and Restated Certificate of Incorporation of Arisz Acquisition Corp. (incorporated by reference to Exhibit 3.1 filed with the Form 8-K filed by the Registrant on May 15, 2023).\n4.1\nSpecimen Unit Certificate (incorporated by reference to Exhibit 4.1 filed with the Form S-1/A filed by the Registrant on November 12, 2021).\n4.2\nSpecimen Common Stock Certificate (incorporated by reference to Exhibit 4.2 filed with the Form S-1/A filed by the Registrant on November 12, 2021).\n4.3\nSpecimen Rights Certificate (incorporated by reference to Exhibit 4.3 filed with the Form S-1/A filed by the Registrant on November 12, 2021).\n4.4\nSpecimen Warrant Certificate (incorporated by reference to Exhibit 4.4 filed with the Form S-1/A filed by the Registrant on November 12, 2021).\n4.5\nWarrant Agreement, dated November 17, 2021, by and between the Registrant and Continental Stock Transfer & Trust Company, LLC (incorporated by reference to Exhibit 4.2 filed with the Form 8-K filed by the Registrant on November 23, 2021).\n4.6\nRights Agreement, dated November 17, 2021, by and between the Registrant and Continental Stock Transfer & Trust Company (incorporated by reference to Exhibit 4.1 filed with the Form 8-K filed by the Registrant on November 23, 2021).\n4.7\nUnit Purchase Option, dated November 17, 2021, issued by the Registrant to Chardan Capital Markets, LLC (incorporated by reference to Exhibit 4.3 filed with the Form 8-K filed by the Registrant on November 23, 2021).\n4.8*\nDescription of Securities\n10.1\nLetter Agreement, dated November 17, 2021, by and among the Registrant, its officers and directors, and certain other stockholders party thereto (incorporated by reference to Exhibit 10.1.1 filed with the Form 8-K filed by the Registrant on November 23, 2021).\n10.1\nLetter Agreement, dated November 17, 2021, by and among the Registrant and the Sponsor (incorporated by reference to Exhibit 10.1.2 filed with the Form 8-K filed by the Registrant on November 23, 2021).\n10.2\nSubscription Agreement, dated November 17, 2021, by and between the Registrant and the Sponsor (incorporated by reference to Exhibit 10.5 filed with the Form 8-K filed by the Registrant on November 23 2021).\n10.3\nSubscription Agreement, dated November 17, 2021, by and between the Registrant and Chardan Capital Markets LLC(incorporated by reference to Exhibit 10.6 filed with the Form 8-K filed by the Registrant on November 23, 2021).\n10.4\nInvestment Management Trust Agreement, dated November 17, 2021, by and between the Registrant and Continental Stock Transfer & Trust Company (incorporated by reference to Exhibit 10.2 filed with the Form 8-K filed by the Registrant on November 23, 2021).\n10.5\nStock Escrow Agreement, dated November 17, 2021, by and among the Registrant, Continental Stock Transfer & Trust Company and the initial stockholders of the Company (incorporated by reference to Exhibit 10.3 filed with the Form 8-K filed by the Registrant on November 23, 2021).\n10.6\nRegistration Rights Agreement, dated November 17, 2021, by and among the Registrant, the Sponsor, and certain other stockholders party thereto (incorporated by reference to Exhibit 10.4 filed with the Form 8-K filed by the Registrant on November 23, 2021).\n10.7\nAdministrative Support Agreement, dated November 17, 2021, by and between the Registrant and Arisz LP, LLC (incorporated by reference to Exhibit 10.8 filed with the Form 8-K filed by the Registrant on J November 23, 2021).\n10.8\nForm of Indemnity Agreement, dated November 17, 2021, by and between the Registrant and each of its officers and directors (incorporated by reference to Exhibit 10.7 filed with the Form 8-K filed by the Registrant on November 23, 2021).\n10.9\nAgreement and Plan of Merger dated as of January 21, 2022, by and between the Registrant and Finfront Holding Company (incorporated by reference to Exhibit 2.1 filed with the Form 8-K filed by the Registrant on January 26, 2022).\n10.10\nForm of PIPE Subscription Agreement (incorporated by reference to Exhibit 10.1 filed with the Form 8-K filed by the Registrant on January 26, 2022).\n10.11\nSponsor Support Agreement dated January 21, 2022, by and among the Registrant, Finfront Holding Company and certain stockholders (incorporated by reference to Exhibit 10.2 filed with the Form 8-K filed by the Registrant on January 26, 2022).\n10.12\nCompany Shareholder Support Agreement dated January 21, 2022 by and among Finfront Holding Company, the Registrant and certain stockholders (incorporated by reference to Exhibit 10.3 filed with the Form 8-K filed by the Registrant on January 26, 2022).\n10.13\nForm of Lock-Up Agreement (incorporated by reference to Exhibit 10.4 filed with the Form 8-K filed by the Registrant on January 26, 2022).\n10.14\nForm of Amended and Restated Registration Rights Agreement (incorporated by reference to Exhibit 10.5 filed with the Form 8-K filed by the Registrant on January 26, 2022).\n10.15\nAmended and Restated Subscription Agreements, by and between the Registrant and Arisz Investment LLC and by and between the Registrant and Chardan Capital Markets, LLC (incorporated by reference to Exhibit 10.6 filed with the Form 8-K filed by the Registrant on January 26, 2022).\n10.16\nAmendment to Agreement and Plan of Merger dated April 4, 2022 by and between the Registrant and Finfront Holding Company(incorporated by reference to Exhibit 2.1 filed with the Form 8-K filed by the Registrant on April 5, 2022).\n10.17\nJoinder Agreement, dated as of April 4, 2022, by and among the Registrant, Finfront Holding Company, Bitfufu Inc. and Boundary Holding Company (incorporated by reference to Exhibit 10.1 filed with the Form 8-K filed by the Registrant on April 5, 2022).\n10.18\nAmendment No. 2 to Agreement and Plan of Merger dated October 10, 2022 by and between the Registrant and Finfront Holding Company (incorporated by reference to Exhibit 2.1 filed with the Form 8-K filed by the Registrant on October 14, 2022).\n10.19\nPromissory Note dated October 10, 2022, from the Registrant to Finfront Holding Company (incorporated by reference to Exhibit 10.1 filed with the Form 8-K filed by the Registrant on October 14, 2022).\n10.20\nBackstop Agreement, dated as of October 13, 2022 by and among the Registrant, Finfront Holding Company, Bitfufu Inc. and Arisz Investment LLC, Exhibit 10.2 (incorporated by reference to Exhibit 10.2 filed with the Form 8-K filed by the Registrant on October 14, 2022).\n10.21\nAmendment No. 3 to Merger Agreement dated April 24, 2023 by and between Arisz and Finfront Holding Company (incorporated by reference to Exhibit 2.1 filed with the Form 8-K filed by the Registrant on May 5, 2023).\n10.22\nAmendment No. 4 to Merger Agreement dated July 28, 2023 by and between Arisz and Finfront Holding Company (incorporated by reference to Exhibit 2.1 filed with the Form 8-K filed by the Registrant on August 3, 2023).\n10.23\nAmended and Restated Promissory Note (incorporated by reference to Exhibit 10.1 filed with the Form 8-K filed by the Registrant on August 3, 2023).\n10.24\nAmendment to the Investment Management Trust Agreement (incorporated by reference to Exhibit 10.1 filed with the Form 8-K filed by the Registrant on May 15, 2023).\n14.1\nForm of Code of Ethics (incorporated by reference to Exhibit 14 filed with the Registration Statement on Form S-1/A filed by the Registrant on November 12, 2021)\n21.1^\nList of Subsidiaries\n31.1*\nCertification of Principal Executive Officer Pursuant to Rules 13a-14(a) and 15d-14(a) under the Securities Exchange Act of 1934, as Adopted Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002. Certification of Principal Executive Officer Pursuant to Rules 13a-14(a) and 15d-14(a) under the Securities Exchange Act of 1934, as Adopted Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n31.2*\nCertification of Principal Financial Officer Pursuant to Rules 13a-14(a) and 15d-14(a) under the Securities Exchange Act of 1934, as Adopted Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002. Certification of Principal Financial Officer Pursuant to Rules 13a-14(a) and 15d-14(a) under the Securities Exchange Act of 1934, as Adopted Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n32*\nCertification of Principal Executive Officer and Principal Financial Officer Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002. Certification of Principal Executive Officer and Principal Financial Officer Pursuant to 18 U.S.C. Section 1350, as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n97.1*\nArisz Acquisition Corp. Clawback Policy\n101.INS*\nInline XBRL Instance Document.\n101.SCH*\nInline XBRL Taxonomy Extension Schema Document.\n101.CAL*\nInline XBRL Taxonomy Extension Calculation Linkbase Document.\n101.DEF*\nInline XBRL Taxonomy Extension Definition Linkbase Document.\n101.LAB*\nInline XBRL Taxonomy Extension Label Linkbase Document.\n101.PRE*\nInline XBRL Taxonomy Extension Presentation Linkbase Document.\n104*\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101).\n* Filed herewith.\n^ Not applicable\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Exchange Act of 1934, the registrant caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nARISZ ACQUISITION CORP.\nDated: December 18, 2023 By: /s/ Fang Hindle-Yang\nName:\nFang Hindle-Yang\nTitle: Chief Executive Officer and Chairman\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/ Fang Hindle-Yang\nChief Executive Officer and Chairman\nDecember 18, 2023\nFang Hindle-Yang\n(Principal Executive Officer)\n/s/ Marc Estigarribia\nChief Financial Officer\nDecember 18, 2023\nMarc Estigarribia\n(Principal Accounting and Financial Officer)\n/s/ Romain Guerel\nDirector\nDecember 18, 2023\nRomain Guerel\n/s/ Rushi Trivedi\nDirector\nDecember 18, 2023\nRushi Trivedi\n/s/ Nick He\nDirector\nDecember 18, 2023\nNick He\nARISZ ACQUISITION CORP.\nPage(s)\nReport of Independent Registered Public Accounting Firm - Marcum LLP (PCAOB ID # 688)\nFinancial Statements:\nBalance Sheets\nStatements of Operations\nStatements of Changes in Stockholders Equity(Deficit)\nStatements of Cash Flows\nNotes to Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Stockholders and Board of Directors of Arisz Acquisition Corp.\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of Arisz Acquisition Corp. (the Company) as of September 30, 2023 and 2022, the related statements of operations, change in stockholders equity (deficit) and cash flows for each of the two years in the period ended September 30, 2023, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of September 30, 2023 and 2022, and the results of its operations and its cash flows for each of the two years in the period ended September 30, 2023, in conformity with accounting principles generally accepted in the United States of America.\nRestatement of the 2022 Financial Statements\nAs discussed in Note 2 to the financial statements, the accompanying financial statements as of September 30, 2022 and for the year then have been restated.\nExplanatory Paragraph - Going Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As more fully described in Note 1 to the financial statements, the Company has a significant working capital deficiency, has incurred significant costs and needs to raise additional funds to meet its obligations and sustain its operations. Additionally, the Companys business plan is dependent on the completion of a business combination. These conditions raise substantial doubt about the Companys ability to continue as a going concern. Managements plans in regard to these matters are also described in Note 1. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Company's internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\n/s/ Marcum llp\nMarcum llp\nWe have served as the Companys auditor since 2021 (such date takes into account the acquisition of certain assets of Friedman LLP by Marcum LLP effective September 1, 2022)\nEast Hanover, NJ\nDecember 18, 2023\nARISZ ACQUISITION CORP.\nBALANCE SHEETS\nSeptember 30,\nSeptember 30,\n(Restated)\nAssets\nCurrent assets:\nCash $ 215,059 $ 173,789\nPrepaid expenses 21,896 16,836\nTotal Current Assets 236,955 190,625\nInvestments held in Trust Account 34,107,463 69,418,075\nTotal Assets $ 34,344,418 $ 69,608,700\nLiabilities, Temporary Equity, and Stockholders Deficit\nCurrent liabilities:\nAccounts payable and accrued expenses $ 324,851 $ 103,063\nInterest payable to Bitfufu 51,229 -\nFranchise tax payable 20,000 46,800\nIncome tax payable 162,383 76,625\nExcise tax payable 391,931 -\nPromissory note - Bitfufu 2,380,000 -\nTotal Current Liabilities 3,330,394 226,488\nDeferred underwriting fee payable 2,587,500 2,587,500\nTotal Liabilities 5,917,894 2,813,988\nCommitments and Contingencies (Note 7)\nCommon stock subject to possible redemption, 3,154,365 shares and 6,900,000 shares at redemption value of $10.81 per share and $10.06 per share as of September 30, 2023 and 2022, respectively 34,107,463 69,418,075\nStockholders Deficit\nCommon stock, $0.0001 par value; 15,000,000 shares authorized; 2,001,389 shares (1) (excluding 3,154,365 shares and 6,900,000 shares subject to possible redemption at September 30, 2023 and 2022, respectively) issued and outstanding\nAccumulated deficit (5,681,139 ) (2,623,563 )\nTotal Stockholders Deficit (5,680,939 ) (2,623,363 )\nTotal Liabilities, Temporary Equity, and Stockholders Deficit $ 34,344,418 $ 69,608,700\n(1) Shares were retroactively restated to reflect a 1.2-for-1.0 stock split occurred in October 2021.\nThe accompanying notes are an integral part of these financial statements.\nARISZ ACQUISITION CORP.\nSTATEMENTS OF OPERATIONS\nFor the Year\nEnded\nSeptember 30, 2023 For the Year\nEnded\nSeptember 30,\n2022 (Restated)\nGeneral and administrative expenses $ 585,514 $ 544,157\nFranchise tax expense 40,000 53,194\nLoss from Operations (625,514 ) (597,351 )\nOther income:\nInterest earned on investments held in Trust Account 2,386,358 418,075\nOther expense:\nInterest on Bitfufu loan 51,229 -\nIncome before income taxes 1,709,615 (179,276 )\nIncome tax expense 492,735 76,625\nNet income (loss) $ 1,216,880 $ (255,901 )\nBasic and diluted weighted average shares outstanding, common stock subject to possible redemption\n5,432,532 5,893,151\nBasic and diluted net income per share, common stock subject to possible redemption\n$ 0.36 0.58\nBasic and diluted weighted average shares outstanding, non-redeemable common stock\n2,001,389 1,961,132\nBasic and diluted net loss per share, non-redeemable common stock\n$ (0.36 ) $ (1.89 )\nThe accompanying notes are an integral part of these financial statements.\nARISZ ACQUISITION CORP.\nSTATEMENTS OF CHANGES IN STOCKHOLDERS EQUITY (DEFICIT)\nFor the Year Ended September 30, 2023\nAdditional\nTotal\nCommon Stock Paid-in Accumulated Stockholders\nShares(1) Amount Capital Deficit Deficit\nBalance as of September 30, 2022 (As restated) 2,001,389 $ 200 $ -\n$ (2,623,563\n) $ (2,623,363 )\nAdditional deposits to Trust Account for extension - -\n-\n(1,980,000 ) (1,980,000 )\nRemeasurement of common stock to redemption value - -\n-\n(2,386,358 ) (2,386,358 )\nReimbursement from Trust for franchise and income taxes\n483,833 483,833\nExcise tax imposed on common stock redemptions\n(391,931 ) (391,931 )\nNet income - -\n-\n1,216,880 1,216,880\nBalance as of September 30, 2023 2,001,389 $ 200 $ -\n$ (5,681,139 ) $ (5,680,939 )\nFor the Year Ended September 30, 2022 (Restated)\nCommon stock Additional\nPaid-in Accumulated Total\nStockholders\nEquity\nShares(1) Amount Capital Deficit\n(Deficit)\nBalance as of September 30, 2021 1,725,000 $ 172 $ 24,828 $ (490 ) $ 24,510\nSale of public units in initial public offering 6,900,000 68,999,310 -\n69,000,000\nSale of private placement units 276,389 2,763,858 -\n2,763,886\nSale of unit purchase option to underwriter - -\n-\nUnderwriter commissions - -\n(4,312,500 ) -\n(4,312,500 )\nOffering costs - -\n(425,383 ) -\n(425,383 )\nReclassification of common stock subject to redemption (6,900,000 ) (690 ) (59,614,295 ) -\n(59,614,985 )\nAllocation of offering costs to common stock subject to redemption - -\n4,760,749 -\n4,760,749\nRemeasurement of common stock to redemption value - -\n(12,196,667 ) (2,367,172 ) (14,563,839 )\nNet loss - -\n-\n(255,901 ) (255,901 )\nBalance as of September 30, 2022 2,001,389 $ 200 $ -\n$ (2,623,563 ) $ (2,623,363 )\n(1) Shares were retroactively restated to reflect a 1.2-for-1.0 stock split occurred in October 2021.\nThe accompanying notes are an integral part of these financial statements.\nARISZ ACQUISITION CORP.\nSTATEMENTS OF CASH FLOWS\nFor the Year\nEnded\nSeptember 30,\nFor the Year\nEnded\nSeptember 30,\n(Restated)\nCash Flows from Operating Activities:\nNet income (loss) $ 1,216,880 $ (255,901 )\nAdjustments to reconcile net income (loss) to net cash used in operating activities:\nInterest earned on investments held in Trust Account (2,386,358 ) (418,075 )\nChanges in operating assets and liabilities:\nPrepaid expenses (5,059 ) (16,836 )\nAccounts payable and accrued expenses 221,787 82,573\nInterest payable\t \t \t 51,229 -\nIncome tax payable 85,758 76,625\nFranchise tax payable (26,800 ) 46,800\nNet cash used in operating activities (842,563 ) (484,814 )\nCash Flows from Investing Activities:\nCash deposited in Trust Account for extension (1,980,000 ) -\nCash withdrawn from Trust Account to pay franchise tax and income taxes 483,833 -\nCash withdrawn from Trust Account for public stockholder redemptions 39,193,137 -\nPurchase of investment held in Trust Account -\n(69,000,000 )\nNet cash provided by (used in) investing activities 37,696,970 (69,000,000 )\nCash Flows from Financing Activities:\nProceeds from sale of public units through public offering -\n69,000,000\nProceeds from sale of private placement units -\n2,763,886\nProceeds from sale of unit purchase option -\nProceeds from issuance of promissory note to Bitfufu 2,380,000 -\nPayment to redeemed public stockholders (39,193,137 ) -\nRepayment of promissory note to related party -\n(105,000 )\nPayment of underwriters commissions -\n(1,725,000 )\nPayment of deferred offering costs -\n(350,383 )\nNet cash provided by (used in) financing activities (36,813,137 ) 69,583,603\nNet Change in Cash 41,270 98,789\nCash - Beginning of the Year 173,789 75,000\nCash - End of the Year $ 215,059 $ 173,789\nSupplemental Disclosure of Non-cash Financing Activities\nInitial classification of common stock subject to redemption $ -\n$ 59,614,985\nDeferred underwriting fee $ -\n$ 2,587,500\nRemeasurement of common stock to redemption value $ 3,882,526 $ 14,563,839\nThe accompanying notes are an integral part of these financial statements.\nARISZ ACQUISITION CORP.\nNOTES TO FINANCIAL STATEMENTS\nNote 1 - Organization and Business Operation\nArisz Acquisition Corp. (Arisz or the Company) is a blank check company incorporated as a Delaware corporation on July 21, 2021. The Company was formed for the purpose of effecting a merger, share exchange, asset acquisition, share purchase, reorganization or similar business combination with one or more businesses or entities (Business Combination). The Company has selected September 30 as its fiscal year end.\nAs of September 30, 2023, the Company had not commenced any operations. All activities through September 30, 2023 have been limited to organizational activities as well as activities related to the Initial Public Offering (IPO as defined below in Note 3). The Company will not generate any operating revenues until after the completion of a Business Combination, at the earliest. The Company will generate non-operating income in the form of interest income from the proceeds derived from the IPO.\nThe Companys sponsor is Arisz Investments LLC (the Sponsor), a Delaware limited liability company affiliated with the Companys Chairman and Chief Executive Officer.\nOn January 21, 2022, Arisz entered into a merger agreement with Finfront Holding Company, a Cayman Islands exempted company (the BitFuFu), pursuant to which (a) Arisz agreed to form BitFuFu Inc., a Cayman Islands exempted company, as its wholly owned subsidiary (Purchaser or PubCo), (b) Purchaser would form Boundary Holding Company, a Cayman Islands exempted company, as its wholly owned subsidiary (Merger Sub), (c) Arisz will be merged with and into Purchaser (the Redomestication Merger), with Purchaser surviving the Redomestication Merger, and (d) Merger Sub will be merged with and into BitFuFu (the Acquisition Merger), with the Company surviving the Acquisition Merger as a direct, wholly owned subsidiary of Purchaser (collectively, the Business Combination). Following the Business Combination, Purchaser will be a publicly traded company listed on a stock exchange in the United States. On April 4, 2022, each of Arisz and BitFuFu entered into that certain Amendment to the Merger Agreement pursuant to which, among other things, the parties clarified certain Cayman Island corporate law matters by mutual agreement.\nOn July 14, 2022, each of Arisz, BitFuFu, the Purchaser and Ariszs Sponsor (along with any assignee of Ariszs Sponsor, the Buyer) entered into a backstop agreement (the Backstop Agreement) whereby, in connection with the Business Combination, the Buyer has agreed to subscribe for and purchase no less than US$1.25 million worth of shares of Arisz common stock par value $0.0001 per share or Purchasers Class A ordinary shares.\nOn October 10, 2022, Arisz and BitFuFu entered into an amendment to the Merger Agreement to provide, among other things: 1) for a loan from BitFuFu to Arisz in the amount of $2,220,000 (the Loan) for the purpose of funding Ariszs extension of the time to consummate a business combination and for working capital purposes, and 2) remove all existing restrictions on 400,000 Insider Shares that are currently subject to transfer restrictions, so that such shares are freely tradeable upon the Closing. The Loan will be funded in three equal installments of $740,000 on each of October 26, 2022, January 26, 2023 and April 26, 2023, and 3) extend the Outside Date to August 1, 2023.\nOn October 10, 2022, Arisz issued an unsecured promissory note to BitFuFu for the amount of the Loan at an interest rate of 3.5% per annum and is due on October 26, 2023. Arisz may elect to issue a number of unregistered shares of its common stock, valued for these purposes at $10.00 per share, the aggregate value of which shall be equal to the outstanding principal amount of the Loan.\nOn October 13, 2022, the parties to the Backstop Agreement entered into a new backstop agreement substantially on the same terms as the Backstop Agreement with the only substantive additional terms being that: 1) the subscription amount is $2.0 million worth of shares and 2) the termination date is the earlier of: (i) the date agreed by the parties thereto in writing and (ii) the date that the Merger Agreement is terminated, on its terms.\nOn October 24, 2022, Arisz received $740,000, the first installment of the Loan, from BitFuFu.\nOn November 9, 2022, Arisz deposited $690,000 into the Trust Account (representing $0.10 per each share of redeemable common stock) to extend the time for Arisz to complete the Business Combination by three months until February 22, 2023.\nOn January 20, 2023, Arisz received $740,000, the second installment of the Loan, from BitFuFu.\nOn February 7, 2023, the Company notified the trustee of its intent to extend the time available to the Company to consummate a business combination from February 22, 2023 to May 22, 2023 (the Extension). The Extension is the second of up to two three-month extensions permitted under Ariszs governing documents.\nOn February 9, 2023, Arisz deposited $690,000 into the Trust Account (representing $0.10 per each share of redeemable common stock) to extend the time for Arisz to complete the Business Combination by three months until May 22, 2023.\nOn April 19, 2023, Arisz filed with the SEC, and mailed to its stockholders of record as of April 6, 2023, a notice of meeting, proxy statement and proxy card, with respect to a special meeting of Arisz stockholders to be held on May 11, 2023, and which included proposals to amend Ariszs charter in order to extend the time it has to complete its initial business combination up to nine (9) times with each extension allowing for an additional one (1) month period from May 22, 2023 to February 22, 2024, provided that Arisz contributes to the Trust Account $120,000 for each one-month extension, paid on a month-to-month and as-needed basis.\nOn April 24, 2023, Arisz and BitFuFu entered into Amendment No. 3 to the Merger Agreement to provide, among other things: 1) to reduce the amount of the Loan from $2,220,000 to $1,930,000 for the purpose of funding Ariszs extension of the time to consummate a business combination and for working capital purposes and 2) that the third installment of the loan will be in the amount of $450,000.\nOn April 25, 2023, Arisz received $450,000, the third installment of the Loan, from BitFuFu.\nOn May 11, 2023, Arisz held a special meeting of stockholders to consider, among other things, proposals to amend Ariszs charter in order to extend the time it has to complete its initial business combination up to nine (9) times with each extension allowing for an additional one (1) month period from May 22, 2023 to February 22, 2024, provided that Arisz contributes to the Trust Account $120,000 for each one-month extension, paid on a month-to-month and as-needed basis. At the special meeting, the requisite number of stockholders voted in favor of these proposals. Accordingly, in connection with the first one (1) month period extension, the Sponsor will deposit $120,000 into Ariszs trust account prior to May 22, 2023, on behalf of Arisz.\nIn connection with the special meeting, 3,745,635 shares of common stock were tendered for redemption. As a result, approximately $39.18 million (approximately $10.46 per share) will be removed from the Companys trust account to pay such holders, without taking into account additional allocation of payments to cover any tax obligation of the Company, such as franchise taxes, but not including any excise tax, since that date. Following redemptions, the Company has 5,155,754 shares of common stock outstanding, and approximately $33.02 million remained in the Companys Trust Account.\nIn connection with the special meeting, in each of May, June, July, August, September, October, November and December 2023, Arisz timely deposited $120,000 into Ariszs trust account, thereby extending the date by which an initial business combination may be consummated. As such, Arisz has until January 22, 2024 to consummate its initial business combination, unless the Sponsor elects to further extend, to as late as February 22, 2024.\nOn July 28, 2023, Arisz and BitFuFu entered into Amendment No. 4 to the Merger Agreement (Amendment No. 4) to provide, among other things: (1) that the Outside Date for the completion of the Corporations business combination, as defined therein be extended from August 1, 2023 to November 17, 2024 and (2) for an amendment to the loan installment of $360,000 to be extended on each of August 2, 2023, November 2, 2023, February 2, 2024, May 2, 2024 and August 2, 2024) to be used to cover the extension costs, and the remaining balance of each loan installment to be used for working capital. In accordance therewith, on July 28, 2023, Arisz and the Company amended and restated the BitFuFu Note.\nFinancing\nThe registration statement for the Companys IPO became effective on November 17, 2021. On November 22, 2021 the Company consummated the IPO of 6,000,000 units (which did not include the exercise of the over-allotment option by the underwriters in the IPO) at an offering price of $10.00 per unit (the Public Units), generating gross proceeds of $60,000,000. Simultaneously with the IPO, the Company sold to its Sponsor and Chardan Capital Markets LLC (Chardan) (and/or their designees) 253,889 units at $10.00 per unit (the Private Units) in a private placement generating total gross proceeds of $2,538,886, which is described in Note 4.\nConcurrently, the Company repaid $105,000 to the Sponsor, under related party loan evidenced by promissory note issued on August 5, 2021.\nThe Company granted the underwriters a 45-day option to purchase up to 900,000 additional Units to cover over-allotments, if any. On November 24, 2021, the underwriters fully exercised the over-allotment option and purchased 900,000 units (the Over-allotment Units) at a price of $10.00 per Unit, generating gross proceeds of $9,000,000. Upon the closing of the Over-allotment on November 24, 2021, the Company consummated the sale of additional 22,500 Private Units (the Additional Private Units) with the Sponsor and Chardan at a price of $10.00 per Private Unit, generating total proceeds of $225,000.\nTransaction costs amounted to $5,587,733, consisting of $1,725,000 of underwriting fees, $2,587,500 of deferred underwriting fees (payable only upon completion of a Business Combination) and $1,275,233 of other offering costs.\nTrust Account\nUpon closing of the IPO, the Private Units, the sale of the Over-allotment Units and the sale of the Additional Private Units, a total of $69,000,000 ($10.00 per Unit) was placed in a U.S.-based trust account (the Trust Account) with Continental Stock Transfer & Trust acting as trustee and can be invested only in U.S. government treasury bills with a maturity of 180 days or less or in money market funds meeting certain conditions under Rule 2a-7 under the Investment Company Act and that invest only in direct U.S. government treasury obligations. These funds will not be released until the earlier of the completion of the initial Business Combination and the liquidation due to the Companys failure to complete a Business Combination within the applicable period of time. The proceeds deposited in the Trust Account could become subject to the claims of the Companys creditors, if any, which could have priority over the claims of the Companys public stockholders. In addition, interest income earned on the funds in the Trust account may be released to the Company to pay its income or other tax obligations. With these exceptions, expenses incurred by the Company may be paid prior to a business combination only from the net proceeds of the IPO and private placement not held in the Trust Account.\nBusiness Combination\nPursuant to NASDAQ listing rules, the Companys initial Business Combination must occur with one or more target businesses having an aggregate fair market value equal to at least 80% of the value of the funds in the Trust account (excluding any taxes payable on the income earned on the Trust account), which the Company refers to as the 80% test, at the time of the execution of a definitive agreement for its initial business combination, although the Company may structure a business combination with one or more target businesses whose fair market value significantly exceeds 80% of the trust account balance. If the Company is no longer listed on NASDAQ, it will not be required to satisfy the 80% test.\nThe public shares subject to redemption will be recorded at a redemption value and classified as temporary equity upon the completion of the IPO in accordance with the Accounting Standards Codification (ASC) Topic 480 Distinguishing Liabilities from Equity. In such case, the Company will proceed with a Business Combination if the Company has net tangible assets of at least $5,000,001 upon such consummation of a Business Combination and, if the Company seeks stockholder approval, a majority of the shares voted are voted in favor of the Business Combination. If a stockholder vote is not required by law and the Company does not decide to hold a stockholder vote for business or other legal reasons, the Company will, pursuant to its Amended and Restated Certificate of Incorporation (the Amended and Restated Certificate of Incorporation), conduct the redemptions pursuant to the tender offer rules of the U.S. Securities and Exchange Commission (SEC) and file tender offer documents with the SEC prior to completing a Business Combination. If, however, stockholder approval of the transaction is required by law, or the Company decides to obtain stockholder approval for business or legal reasons, the Company will offer to redeem shares in conjunction with a proxy solicitation pursuant to the proxy rules and not pursuant to the tender offer rules. Additionally, each public stockholder may elect to redeem their public shares irrespective of whether they vote for or against the proposed transaction. If the Company seeks stockholder approval in connection with a Business Combination, the Companys Sponsor and any of the Companys officers or directors that may hold Insider Shares (as defined in Note 5) (the Initial Stockholders) and Chardan have agreed (a) to vote their Insider Shares, Private Shares (as defined in Note 4) and any public shares purchased during or after the IPO in favor of approving a Business Combination and (b) not to convert any shares (including the Insider Shares) in connection with a stockholder vote to approve, or sell the shares to the Company in any tender offer in connection with, a proposed Business Combination.\nThe Company will provide its holders of the outstanding public shares (the Public Stockholders) with the opportunity to redeem all or a portion of their public shares upon the completion of a Business Combination either (i) in connection with a stockholder meeting called to approve the Business Combination or (ii) by means of a tender offer. The decision as to whether the Company will seek stockholder approval of a Business Combination or conduct a tender offer will be made by the Company, solely in its discretion. The Public Stockholders will be entitled to redeem their public shares for a pro rata portion of the amount then in the Trust Account (initially anticipated to be $10.00 per public share, plus any pro rata interest earned on the funds held in the Trust Account and not previously released to the Company to pay its franchise and income tax obligations). If the Company seeks stockholder approval of a Business Combination and it does not conduct redemptions pursuant to the tender offer rules, the Amended and Restated Certificate of Incorporation provides that a public stockholder, together with any affiliate of such stockholder or any other person with whom such stockholder is acting in concert or as a group (as defined under Section 13 of the Securities Exchange Act of 1934, as amended (the Exchange Act)), will be restricted from redeeming its shares with respect to more than an aggregate of 20% or more of the public shares, without the prior consent of the Company.\nThe Initial Stockholders and Chardan have agreed (a) to waive their redemption rights with respect to the Insider Shares, Private Shares, Underwriter Shares and public shares held by them in connection with the completion of a Business Combination and (b) not to propose, or vote in favor of, an amendment to the Amended and Restated Certificate of Incorporation that would affect the substance or timing of the Companys obligation to redeem 100% of its public shares if the Company does not complete a Business Combination, unless the Company provides the public stockholders with the opportunity to redeem their public shares in conjunction with any such amendment.\nThe Company initially has 18 months from the closing of the IPO to consummate a Business Combination. If the Company anticipates that it may not be able to consummate initial business combination within 18 months, the Companys insiders or their affiliates may, but are not obligated to, extend the period of time to consummate a business combination up to nine (9) times with each extension allowing for an additional one (1) month period from May 22, 2023 to February 22, 2024 (the Combination Period). In connection with the special meeting, in each of May, June, July, August, September, October, November and December 2023, Arisz timely deposited $120,000 into Ariszs trust account, thereby extending the business combination period to January 22, 2024, unless the Sponsor elects to further extend, to as late as February 22, 2024.\nLiquidation\nIf the Company is unable to complete a Business Combination within the Combination Period, the Company will (i) cease all operations except for the purpose of winding up, (ii) as promptly as reasonably possible but not more than ten business days thereafter, redeem the public shares, at a per-share price, payable in cash, equal to the aggregate amount then on deposit in the Trust Account including interest (which interest shall be net of taxes payable, and less certain amount of interest to pay dissolution expenses) divided by the number of then outstanding Public Shares, which redemption will completely extinguish public stockholders rights as stockholders (including the right to receive further liquidating distributions, if any), subject to applicable law, and (iii) as promptly as reasonably possible following such redemption, subject to the approval of the Companys remaining stockholders and the Companys board of directors, dissolve and liquidate, subject in each case to the Companys obligations under Delaware law to provide for claims of creditors and the requirements of other applicable law.\nThe Sponsor and Chardan have agreed to waive their liquidation rights with respect to the Insider Shares and Private Shares if the Company fails to complete a Business Combination within the Combination Period. However, if the Sponsor or underwriters acquires public shares in or after the IPO, such public shares will be entitled to liquidating distributions from the Trust Account if the Company fails to complete a Business Combination within the Combination Period. The underwriters have agreed to waive their rights to their deferred underwriting commission (see Note 6) held in the Trust Account in the event the Company does not complete a Business Combination within in the Combination Period and, in such event, such amounts will be included with the other funds held in the Trust Account that will be available to fund the redemption of the Public Shares. In the event of such distribution, it is possible that the per share value of the assets remaining available for distribution will be less than $10.00.\nIn order to protect the amounts held in the Trust Account, the Sponsor has agreed to be liable to the Company if and to the extent any claims by a vendor for services rendered or products sold to the Company, or a prospective target business with which the Company has discussed entering into a transaction agreement, reduce the amount of funds in the Trust Account to below $10.00 per Public Share, except as to any claims by a third party who executed a valid and enforceable agreement with the Company waiving any right, title, interest or claim of any kind they may have in or to any monies held in the Trust Account and except as to any claims under the Companys indemnity of the underwriters of IPO against certain liabilities, including liabilities under the Securities Act of 1933, as amended (the Securities Act). Moreover, in the event that an executed waiver is deemed to be unenforceable against a third party, the Sponsor will not be responsible to the extent of any liability for such third party claims.\nLiquidity and Going Concern\nAs of September 30, 2023, we had cash of $215,059 and a working capital deficit of $2,911,056 (excluding income tax and franchise tax payable). In connection with the shareholder special meeting on May 11, 2023, in each of May, June, July, August, September, October, November and December 2023, the Company deposited $120,000 per deposit into the Trust Account to extend the time for Arisz to complete the Business Combination until January 22, 2024. It is uncertain that the Company will be able consummate a Business Combination by the extended date (or February 22, 2024 if the Sponsor elects to extend the consummation deadline). Moreover, Arisz may need to obtain additional financing either to complete its Business Combination or because it becomes obligated to redeem a significant number of public shares upon consummation of its Business Combination, in which case the Company may issue additional securities or incur debt in connection with such Business Combination. If a Business Combination is not consummated by February 22, 2024, there will be a mandatory liquidation and subsequent dissolution.\nIn connection with the Companys assessment of going concern considerations in accordance with Financial Accounting Standard Boards Accounting Standards Update (ASU) 2014-15, Disclosures of Uncertainties about an Entitys Ability to Continue as a Going Concern, management has determined that if the Company is unable to complete a Business Combination by February 22, 2024, then the Company will cease all operations except for the purpose of liquidating. The date for liquidation and subsequent dissolution as well as liquidity concerns raise substantial doubt about the Companys ability to continue as a going concern. No adjustments have been made to the carrying amounts of assets or liabilities should the Company be required to liquidate.\nRisks and Uncertainties\nIn February 2022, an armed conflict escalated between Russia and Ukraine. The sanctions announced by the United States and other countries against Russia and Belarus following Russias invasion of Ukraine to date include restrictions on selling or importing goods, services, or technology in or from affected regions and travel bans and asset freezes impacting connected individuals and political, military, business, and financial organizations in Russia and Belarus. The United States and other countries could impose wider sanctions and take other actions should the conflict further escalate. Separately, in October 2023, Israel and certain Iranian-backed Palestinian forces began an armed conflict in Israel, the Gaza Strip, and surrounding areas, which threatens to spread to other Middle Eastern countries including Lebanon and Iran.\nAs a result of the ongoing Russia/Ukraine, Hamas/Israel conflicts and/or other future global conflicts, the Companys ability to consummate a Business Combination, or the operations of a target business with which the Company ultimately consummates a Business Combination, may be materially and adversely affected. In addition, the Companys ability to consummate a transaction may be dependent on the ability to raise equity and debt financing which may be impacted by these events, including as a result of increased market volatility, or decreased market liquidity in third-party financing being unavailable on terms acceptable to the Company or at all. The impact of this action and potential future sanctions on the world economy and the specific impact on the Companys financial position, results of operations or ability to consummate a Business Combination are not yet determinable. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nInflation Reduction Act of 2022\nOn August 16, 2022, the Inflation Reduction Act of 2022 (the IR Act) was signed into federal law. The IR Act provides for, among other things, a new U.S. federal 1% excise tax on certain repurchases (including redemptions) of stock by publicly traded domestic (i.e., U.S.) corporations and certain domestic subsidiaries of publicly traded foreign corporations. The excise tax is imposed on the repurchasing corporation itself, not its shareholders from which shares are repurchased. The amount of the excise tax is generally 1% of the fair market value of the shares repurchased at the time of the repurchase. However, for purposes of calculating the excise tax, repurchasing corporations are permitted to net the fair market value of certain new stock issuances against the fair market value of stock repurchases during the same taxable year. In addition, certain exceptions apply to the excise tax. The U.S. Department of the Treasury (the Treasury) has been given authority to provide regulations and other guidance to carry out and prevent the abuse or avoidance of the excise tax. The IR Act applies only to repurchases that occur after December 31, 2022.\nAny redemption or other repurchase that occurs after December 31, 2022, in connection with a Business Combination, extension vote or otherwise, may be subject to the excise tax. Whether and to what extent the Company would be subject to the excise tax in connection with a Business Combination, extension vote or otherwise would depend on a number of factors, including (i) the fair market value of the redemptions and repurchases in connection with the Business Combination, extension or otherwise, (ii) the structure of a Business Combination, (iii) the nature and amount of any PIPE or other equity issuances in connection with a Business Combination (or otherwise issued not in connection with a Business Combination but issued within the same taxable year of a Business Combination) and (iv) the content of regulations and other guidance from the Treasury. In addition, because the excise tax would be payable by the Company and not by the redeeming holder, the mechanics of any required payment of the excise tax have not been determined. The foregoing could cause a reduction in the cash available on hand to complete a Business Combination and in the Companys ability to complete a Business Combination.\nAt this time, it has been determined that the IR Act tax provisions would have an impact to the Companys fiscal 2023 tax provision as there were redemptions by the public stockholders in May 2023; as a result, the Company recorded a $391,931 excise tax liability as of September 30, 2023. The Company will continue to monitor for updates to the Companys business along with guidance issued with respect to the IR Act to determine whether any adjustments are needed to the Companys tax provision in future periods.\nNote 2 - Restatement of Previously Issued Financial Statements\nDuring the preparation of this Annual Report on Form 10-K, the Company determined that it had not appropriately accounted for interest earned on investments held in Trust Account under accounting principles generally accepted in the United States of America (U.S. GAAP). Interest income was recorded based on actual cash receipts instead of on an accrual basis resulting in an understatement of Investments held in Trust Account in prior periods. Additionally, the interest earned on investments held in Trust Account, income tax provision, net income(loss), income tax payable, common stock subject to possible redemption and accumulated deficit accounts were misstated.\nIn accordance with Staff Accounting Bulletin (SAB) 99, Materiality, and SAB 108, Considering the Effects of Prior Year Misstatements when Quantifying Misstatements in Current Year Financial Statements, the Company evaluated the materiality of the errors from qualitative and quantitative perspectives, individually and in aggregate, and concluded that the errors were material to the Financial Statements for the fiscal year ended September 30, 2022, and the quarters ended December 31, 2022, March 31, 2023, and June 30, 2023. Management restated the impacted financial statements for the fiscal year ended September 30, 2022, and the quarter ended December 31, 2022, the quarter and six-months ending March 31, 2023, and the quarter and nine-months ending June 30, 2023. Refer to Note 12 for restated annual and quarterly financial statements.\nNote 3 - Significant Accounting Policies\nBasis of Presentation\nThe accompanying audited financial statements are presented in U.S. Dollars and in conformity the U.S. GAAP and pursuant to the rules and regulations of the SEC. Accordingly, they include all of the information and footnotes required by the U.S. GAAP. In the opinion of management, all adjustments (consisting of normal accruals) considered for a fair presentation have been included.\nEmerging Growth Company Status\nThe Company is an emerging growth company, as defined in Section 2(a) of the Securities Act of 1933, as amended, (the Securities Act), as modified by the Jumpstart Our Business Startups Act of 2012, (the JOBS Act), and it may take advantage of certain exemptions from various reporting requirements that are applicable to other public companies that are not emerging growth companies including, but not limited to, not being required to comply with the auditor attestation requirements of Section 404 of the Sarbanes-Oxley Act, reduced disclosure obligations regarding executive compensation in its periodic reports and proxy statements, and exemptions from the requirements of holding a nonbinding advisory vote on executive compensation and stockholder approval of any golden parachute payments not previously approved.\nFurther, Section 102(b)(1) of the JOBS Act exempts emerging growth companies from being required to comply with new or revised financial accounting standards until private companies (that is, those that have not had a Securities Act registration statement declared effective or do not have a class of securities registered under the Exchange Act) are required to comply with the new or revised financial accounting standards. The JOBS Act provides that a company can elect to opt out of the extended transition period and comply with the requirements that apply to non-emerging growth companies but any such an election to opt out is irrevocable. The Company has elected not to opt out of such extended transition period which means that when a standard is issued or revised and it has different application dates for public or private companies, the Company, as an emerging growth company, can adopt the new or revised standard at the time private companies adopt the new or revised standard. This may make comparison of the Companys financial statements with another public company which is neither an emerging growth company nor an emerging growth company which has opted out of using the extended transition period difficult or impossible because of the potential differences in accounting standards used.\nUse of Estimates\nIn preparing these financial statements in conformity with U.S. GAAP, the Companys management makes estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported expenses during the reporting period.\nMaking estimates requires management to exercise significant judgment. It is at least reasonably possible that the estimate of the effect of a condition, situation or set of circumstances that existed at the date of the financial statements, which management considered in formulating its estimate, could change in the near term due to one or more future confirming events. Accordingly, the actual results could differ significantly from those estimates.\nCash and Cash Equivalents\nThe Company considers all short-term investments with an original maturity of three months or less when purchased to be cash equivalents. The Company had $215,059 and $173,789 in cash as of September 30, 2023 and September 30, 2022, respectively. The Company did not have any cash equivalents for both fiscal years.\nInvestments held in Trust Account\nAs of September 30, 2023 and 2022, the Companys portfolio of investments is comprised of money market funds that invest in U.S. government securities.\nWhen the Companys investments held in the Trust Account are comprised of money market funds, the investments are recognized at fair value. Investments in money market funds are presented on the balance sheets at fair value at the end of each reporting period. Gains and losses resulting from the change in fair value of these securities is included in interest earned on investments held in the Trust Account in the accompanying statements of operations.\nOffering Costs\nThe Company complies with the requirements of ASC 340-10-S99-1 and SEC Staff Accounting Bulletin Topic 5A - Expenses of Offering. Offering costs $5,587,733 consisting primarily of underwriting, legal, accounting, registration and other expenses incurred through the balance sheet date that are directly related to the IPO and charged to shareholders equity upon the completion of the IPO.\nWarrants\nThe Company accounts for warrants as either equity-classified or liability-classified instruments based on an assessment of the warrants specific terms and applicable authoritative guidance in Financial Accounting Standards Board (FASB) ASC 480 Distinguishing Liabilities from Equity (ASC 480) and ASC 815, Derivatives and Hedging (ASC 815). The assessment considers whether the warrants are freestanding financial instruments pursuant to ASC 480, whether they meet the definition of a liability pursuant to ASC 480, and whether the warrants meet all of the requirements for equity classification under ASC 815, including whether the warrants are indexed to the Companys own common stock and whether the warrant holders could potentially require net cash settlement in a circumstance outside of the Companys control, among other conditions for equity classification. This assessment, which requires the use of professional judgment, is conducted at the time of warrant issuance and as of each subsequent quarterly period end date while the warrants are outstanding.\nFor issued or modified warrants that meet all of the criteria for equity classification, the warrants are required to be recorded as a component of equity at the time of issuance. For issued or modified warrants that do not meet all the criteria for equity classification, the warrants are required to be recorded as liabilities at their initial fair value on the date of issuance, and each balance sheet date thereafter. Changes in the estimated fair value of the warrants are recognized as a non-cash gain or loss on the statements of operations. Management concluded that warrants to be issued pursuant to the warrant agreement qualify for equity accounting treatment.\nCommon Stock Subject to Possible Redemption\nThe Company accounts for its common stock subject to possible redemption in accordance with the guidance in ASC Topic 480, Distinguishing Liabilities from Equity. Common stock subject to mandatory redemption (if any) are classified as a liability instrument and are measured at fair value. Conditionally redeemable common stock (including common stock that feature redemption rights that is either within the control of the holder or subject to redemption upon the occurrence of uncertain events not solely within the Companys control) is classified as temporary equity. At all other times, common stock is classified as stockholders equity. The Companys common stock features certain redemption rights that are considered to be outside of the Companys control and subject to occurrence of uncertain future events. Accordingly, shares of common stock subject to possible redemption are presented at redemption value of $10.81 and $10.06 per share, as of September 30, 2023 and 2022, respectively, as temporary equity, outside of the stockholders deficit section of the Companys balance sheet. The Company recognizes changes in redemption value immediately as they occur and adjusts the carrying value of redeemable common stock to equal the redemption value at the end of each reporting period. Increases or decreases in the carrying amount of shares of redeemable common stock are affected by charges against additional paid in capital or accumulated deficit if additional paid-in capital is zero.\nConcentration of Credit Risk\nFinancial instruments that potentially subject the Company to concentration of credit risk consist of a cash account in a financial institution and money market funds held in the Trust Account. The Company has not experienced losses on this account and management believes the Company is not exposed to significant risks on such account.\nFair Value of Financial Instruments\nThe fair value of the Companys assets and liabilities, which qualify as financial instruments under ASC 825, Financial Instruments, approximates the carrying amounts represented in the accompanying balance sheet, primarily due to their short-term nature.\nNet Income (Loss) per Share\nThe Company complies with accounting and disclosure requirements of FASB ASC 260, Earnings Per Share. The statements of operations include a presentation of income (loss) per redeemable share and income (loss) per non-redeemable share following the two-class method of income per share. In order to determine the net income (loss) attributable to both the redeemable shares and non-redeemable shares, the Company first considered the undistributed income (loss) allocable to both the redeemable shares and non-redeemable shares and the undistributed income (loss) is calculated using the total net loss less any dividends paid. The Company then allocated the undistributed income (loss) ratably based on the weighted average number of shares outstanding between the redeemable and non-redeemable shares. Any remeasurement of the accretion to redemption value of the common shares subject to possible redemption was considered to be dividends paid to the public shareholders. As of September 30, 2023, the Company did not have any dilutive securities and other contracts that could, potentially, be exercised or converted into ordinary shares and then share in the earnings of the Company. As a result, diluted loss per share is the same as basic loss per share for the period presented.\nThe net income (loss) per share presented in the statements of operations is based on the following:\nFor the Year\nEnded\nSeptember 30,\nFor the Year\nEnded\nSeptember 30,\n(Restated)\nNet income (loss)\n$ 1,216,880\n$ (255,901 )\nRemeasurement of common stock to redemption value(1)\n(3,882,526 )\n(14,563,839 )\nNet loss including remeasurement of common stock to redemption value\n$ (2,665,646 )\n$ (14,819,740 )\nFor the Year Ended\nSeptember 30,\nRedeemable\nshares Non-redeemable\nshares\nBasic and diluted net income (loss) per share:\nNumerators:\nAllocation of net loss including remeasurement of common stock $ (1,947,991 ) $ (717,655 )\nRemeasurement of common stock to redemption value(1) 3,882,526 -\nAllocation of net income (loss) $ 1,934,535 $ (717,655 )\nDenominators:\nWeighted-average shares outstanding 5,432,532 2,001,389\nBasic and diluted net income (loss) per share\n$ 0.36 $ (0.36 )\nFor the Year Ended\nSeptember 30,\n2022 (Restated)\nRedeemable\nshares Non-redeemable\nshares\nBasic and diluted net income (loss) per share:\nNumerators:\nAllocation of net loss including remeasurement of common stock $ (11,119,406 ) $ (3,700,334 )\nRemeasurement of common stock to redemption value(1) 14,563,839 -\nAllocation of net income (loss) $ 3,444,433 $ (3,700,334 )\nDenominators:\nWeighted-average shares outstanding 5,893,151 1,961,132\nBasic and diluted net income/(loss) per share\n$ 0.58 $ (1.89 )\n(1) The remeasurement amount includes funds deposited into the Trust Account to extend the time for the Company to complete the Business Combination and franchise and income taxes paid out of the Trust Account.\nIncome Taxes\nThe Company accounts for income taxes under ASC 740, Income Taxes (ASC 740). ASC 740 requires the recognition of deferred tax assets and liabilities for both the expected impact of differences between the financial statement and tax basis of assets and liabilities and for the expected future tax benefit to be derived from tax loss and tax credit carry forwards. ASC 740 additionally requires a valuation allowance to be established when it is more likely than not that all or a portion of deferred tax assets will not be realized.\nASC 740 also clarifies the accounting for uncertainty in income taxes recognized in an enterprises financial statements and prescribes a recognition threshold and measurement process for financial statement recognition and measurement of a tax position taken or expected to be taken in a tax return. For those benefits to be recognized, a tax position must be more-likely-than-not to be sustained upon examination by taxing authorities. ASC 740 also provides guidance on derecognition, classification, interest and penalties, accounting in interim period, disclosure and transition.\nThe Company recognizes accrued interest and penalties related to unrecognized tax benefits as income tax expense. There were no unrecognized tax benefits and no amounts accrued for interest and penalties as of September 30, 2023. The Company is currently not aware of any issues under review that could result in significant payments, accruals or material deviation from its position.\nThe Company has identified the United States and the State of New York as its only major tax jurisdictions.\nThe Company may be subject to potential examination by federal and state taxing authorities in the areas of income taxes. These potential examinations may include questioning the timing and amount of deductions, the nexus of income among various tax jurisdictions and compliance with federal and state tax laws. The Companys management does not expect that the total amount of unrecognized tax benefits will materially change over the next twelve months.\nRecent Accounting Standards\nIn August 2020, FASB issued Accounting Standards Update (ASU) 2020-06, Debt-Debt with Conversion and Other Options (Subtopic 470-20) and Derivatives and Hedging-Contracts in Entitys Own Equity (Subtopic 815-40) (ASU 2020-06) to simplify accounting for certain financial instruments. ASU 2020-06 eliminates the current models that require separation of beneficial conversion and cash conversion features from convertible instruments and simplifies the derivative scope exception guidance pertaining to equity classification of contracts in an entitys own equity. The new standard also introduces additional disclosures for convertible debt and freestanding instruments that are indexed to and settled in an entitys own equity. ASU 2020-06 amends the diluted earnings per share guidance, including the requirement to use the if-converted method for all convertible instruments. The amendments are effective for smaller reporting companies for fiscal years beginning after December 15, 2023, including interim periods within those fiscal years. The Company is currently assessing the impact, if any, that ASU 2020-06 would have on its financial position, results of operations or cash flows.\nManagement does not believe that any recently issued, but not effective, accounting standards, if currently adopted, would have a material effect on the Companys financial statements.\nNote 4 - Initial Public Offering\nPursuant to the IPO on November 22, 2021, the Company sold 6,000,000 Units at $10.00 per Public Unit, generating gross proceeds of $60,000,000. The Company granted the underwriters a 45-day option to purchase up to 900,000 additional Units to cover over-allotments, if any. On November 24, 2021, the underwriters fully exercised the over-allotment option and purchased 900,000 units at a price of $10.00 per Unit, generating gross proceeds of $9,000,000. Each Public Unit consists of one share of common stock (Public Share), one right (Public Right) and one redeemable warrant (Public Warrant). Each Public Right will convert into one-twentieth (1/20) of one share of common stock upon the consummation of a Business Combination. Each whole Public Warrant entitles the holder to purchase three-fourths (3/4) of one share of common stock at a price of $11.50 per whole share, subject to adjustment. The warrants will become exercisable on the later of 30 days after the completion of the Companys initial Business Combination or 15 months from the closing of the IPO, and will expire five years after the completion of the Companys initial Business Combination or earlier upon redemption or liquidation.\nAll of the 6,900,000 Public Shares sold as part of the Public Units in the IPO contain a redemption feature which allows for the redemption of such Public Shares if there is a stockholder vote or tender offer in connection with the Business Combination and in connection with certain amendments to the Companys amended and restated certificate of incorporation, or in connection with the Companys liquidation. In accordance with the SEC and its staffs guidance on redeemable equity instruments, which has been codified in ASC 480-10-S99, redemption provisions not solely within the control of the Company require common stock subject to redemption to be classified outside of permanent equity.\nThe Companys redeemable common stock is subject to SEC and its staffs guidance on redeemable equity instruments, which has been codified in ASC 480-10-S99. If it is probable that the equity instrument will become redeemable, the Company has the option to either accrete changes in the redemption value over the period from the date of issuance (or from the date that it becomes probable that the instrument will become redeemable, if later) to the earliest redemption date of the instrument or to recognize changes in the redemption value immediately as they occur and adjust the carrying amount of the instrument to equal the redemption value at the end of each reporting period. The Company has elected to recognize the changes immediately. The accretion or remeasurement is treated as a deemed dividend (i.e., a reduction to retained earnings, or in absence of retained earnings, additional paid-in capital).\nAs of September 30, 2023 and 2022, the shares of common stock subject to possible redemption reflected on the balance sheets are reconciled in the following table.\nGross proceeds $ 69,000,000\nLess:\nProceeds allocated to Public Warrants (6,658,288 )\nProceeds allocated to Public Rights (2,726,727 )\nOffering costs of Public Shares (4,760,749 )\nPlus:\nRemeasurement of carrying value to redemption value 14,563,839\nCommon stock subject to possible redemption at September 30, 2022 $ 69,418,074\nRemeasurement of carrying value to redemption value 3,882,526\nRedemption of Public Shares (39,193,137 )\nCommon stock subject to possible redemption at September 30, 2023\t $ 34,107,463\nNote 5 - Private Placement\nSimultaneously with the closing of the IPO, the Sponsor and Chardan (and/or their designees) purchased an aggregate of 253,889 Private Units at a price of $10.00 per Private Unit for an aggregate purchase price of $2,538,886 in a private placement. Upon the closing of the Over-allotment on November 24, 2021, the Company consummated the sale of additional 22,500 Private Units with the Sponsor and Chardan at a price of $10.00 per Private Unit, generating total proceeds of $225,000. The Private Units are identical to the Public Units except with respect to certain registration rights and transfer restrictions. The proceeds from the Private Units were added to the proceeds from the IPO to be held in the Trust Account. If the Company does not complete a Business Combination within the Combination Period, the proceeds from the sale of the Private Units will be used to fund the redemption of the Public Shares (subject to the requirements of applicable law), and the Private Units and all underlying securities will expire worthless.\nNote 6 - Related Party Transactions\nInsider Shares\nOn August 5, 2021, the Company issued 1,437,500 shares of common stock to the Initial Stockholders (the Insider Shares) for an aggregated consideration of $25,000. On October 29, 2021, the Company effected a 1.2-for-1.0 stock split of common stock, resulting in the Sponsor holding an aggregate of 1,725,000 Insider Shares, for approximately $0.014 per share, of which, up to 225,000 shares were subject to forfeiture by the Initial Stockholders to the extent that the underwriters over-allotment is not exercised in full, so that the Initial Stockholders will collectively own 20% of the Companys issued and outstanding shares after the IPO. As the over-allotment option was fully exercised on November 24, 2021, no portion of the Insider Shares were subject to forfeiture.\nThe Initial Stockholders have agreed, subject to certain limited exceptions, not to transfer, assign or sell any of their Insider Shares until, with respect to 50% of the Insider Shares, the earlier of six months after the consummation of a Business Combination and the date on which the closing price of the common stock equals or exceeds $12.50 per share (as adjusted for stock splits, stock dividends, reorganizations, recapitalizations and the like) for any 20 trading days within a 30-trading day period commencing after a Business Combination and, with respect to the remaining 50% of the Insider Shares, until the six months after the consummation of a Business Combination, or earlier, in either case, if, subsequent to a Business Combination, the Company completes a liquidation, merger, stock exchange or other similar transaction which results in all of the Companys stockholders having the right to exchange their shares of common stock for cash, securities or other property.\nPromissory Note - Related Party\nOn August 5, 2021, the Sponsor agreed to loan the Company up to an aggregate amount of $300,000 to be used, in part, for transaction costs incurred in connection with the IPO (the Promissory Note). The Promissory Note is unsecured, interest-free and due on the earlier of March 31, 2022 or the closing the IPO. Concurrently with the IPO, the Company repaid the outstanding balance of $105,000 to the Sponsor.\nAdministrative Services Agreement\nThe Company entered into an administrative services agreement with the Sponsor pursuant to which the Company pays a total of $10,000 per month for office space, administrative and support services. Upon completion of the initial Business Combination or liquidation, the Company will cease paying these monthly fees. However, pursuant to the terms of such agreement, the Sponsor agreed to defer the payment of such monthly fee. Any such unpaid amount will accrue without interest and be due and payable no later than the date of the consummation of the initial Business Combination. For the years ended September 30, 2023 and 2022, the Company incurred $120,000 and $100,000 respectively, in fees for these services, of which $220,000 and $100,000 were included in accounts payable and accrued expenses in the accompanying balance sheets September 30, 2023 and 2022, respectively.\nNote 7 - Commitments and Contingencies\nRegistration Rights\nThe holders of the insider shares, the private units, securities underlying the Unit Purchase Option and any units that may be issued upon conversion of working capital loans or extension loans (and any securities underlying the private units or units issued upon conversion of the working capital loans or extension loans) will be entitled to registration rights pursuant to a registration rights agreement signed prior to or on the effective date of IPO requiring the Company to register such securities for resale. The holders of these securities are entitled to make up to two demands, excluding short form demands, that the Company register such securities. In addition, the holders have certain piggy-back registration rights with respect to registration statements filed subsequent to the completion of the initial business combination. The Company will bear the expenses incurred in connection with the filing of any such registration statements.\nRight of First Refusal\nThe Company has granted Chardan for a period of 24 months after the date of the consummation of the Companys Business Combination, a right of first refusal to act as book-running manager, with at least 30% of the economics, for any and all future public and private equity and debt offerings.\nUnderwriting Agreement\nThe Company has granted Chardan, the representative of the underwriters, a 45-day option from the date of this prospectus to purchase up to 900,000 additional Units to cover over-allotments, if any, at the IPO price less the underwriting discounts and commissions.\nThe underwriters were paid a cash underwriting discount of 2.5% of the gross proceeds of the IPO (including the exercise of the over-allotment option), or $1,725,000. In addition, the underwriters will be entitled to a deferred fee of 3.75% of the gross proceeds of the IPO (including the exercise of the over-allotment option), or $2,587,500, which will be paid upon the closing of a Business Combination from the amounts held in the Trust Account, subject to the terms of the underwriting agreement. The underwriters will also be entitled to 0.75% of the gross proceeds of the IPO in the form of common stock of the Company at a price of $10.00 per share, to be issued if the Company closes a Business Combination.\nUnit Purchase Option\nThe Company sold to Chardan (and/or its designees), for $100, an option (the Unit Purchase Option) to purchase 115,000 units (as the over-allotment option was fully exercised on November 24, 2021) exercisable at $11.50 per Unit (or an aggregate exercise price of $1,322,500) commencing on the later of six months from the effective date of the registration statement related to the IPO and the consummation of a Business Combination. The Unit Purchase Option may be exercised for cash or on a cashless basis, at the holders option, and expires five years from the effective date of the registration statement related to the IPO. The Units issuable upon exercise of the Unit Purchase Option are identical to those offered in the IPO. The Company accounts for the Unit Purchase Option, inclusive of the receipt of $100 cash payment, as an expense of the IPO resulting in a charge directly to stockholders equity. The option and the underlying securities that may be issued upon exercise of the option, have been deemed compensation by FINRA and are therefore subject to a 180-day lock-up pursuant to Rule 5110(e)(1) of FINRAs NASDAQ Conduct Rules. Additionally, the option may not be sold, transferred, assigned, pledged or hypothecated for a one-year period (including the foregoing 180-day period) following the date of IPO except to any underwriter and selected dealer participating in the IPO and their bona fide officers or partners. The Unit Purchase Option grants to holders demand and piggy back rights for periods of five and seven years, respectively, from the effective date of the registration statement with respect to the registration under the Securities Act of the securities directly and indirectly issuable upon exercise of the Unit Purchase Option. The Company will bear all fees and expenses attendant to registering the securities, other than underwriting commissions which will be paid for by the holders themselves.\nDeferred Legal Fees\nThe Company engaged a legal counsel firm for legal advisory services, and the legal counsel agreed to defer their fees in excess of $200,000. The deferred fee will become payable in the event that the Company completes a Business Combination. As of September 30, 2023 and December 31, 2022, the Company had deferred legal fees of approximately $1.62 million and none, respectively, in connection with such services.\nNote 8 - Stockholders Equity\nCommon Stock - The Company is authorized to issue 15,000,000 shares of common stock with a par value of $0.0001 per share. Holders of the common stock are entitled to one vote for each share. On October 29, 2021, the Company effected a 1.2-for-1.0 stock split of common stock, resulting in the Sponsor holding an aggregate of 1,725,000 Insider Shares, for approximately $0.014 per share. The stock split was retroactively reflected in the financial statements. As of September 30, 2023, there were 2,001,389 shares of common stock issued and outstanding (excluding 3,154,365 shares subject to possible redemption).\nRights - Each holder of a right will receive one-twentieth (1/20) of one share of common stock upon consummation of a Business Combination, even if the holder of such right redeemed all shares held by it in connection with a Business Combination. No fractional shares will be issued upon conversion of the rights. No additional consideration will be required to be paid by a holder of rights in order to receive its additional shares upon consummation of a Business Combination, as the consideration related thereto has been included in the Unit purchase price paid for by investors in the Initial Public Offering. If the Company enters into a definitive agreement for a Business Combination in which the Company will not be the surviving entity, the definitive agreement will provide for the holders of rights to receive the same per share consideration the holders of the common stock will receive in the transaction on an as-converted into common stock basis and each holder of a right will be required to affirmatively convert its rights in order to receive 1/20 share underlying each right (without paying additional consideration). The shares issuable upon conversion of the rights will be freely tradable (except to the extent held by affiliates of the Company).\nIf the Company is unable to complete a Business Combination within the Combination Period and the Company liquidates the funds held in the Trust Account, holders of rights will not receive any of such funds with respect to their rights, nor will they receive any distribution from the Companys assets held outside of the Trust Account with respect to such rights, and the rights will expire worthless. Further, there are no contractual penalties for failure to deliver securities to the holders of the rights upon consummation of a Business Combination. Additionally, in no event will the Company be required to net cash settle the rights. Accordingly, holders of the rights might not receive the shares of common stock underlying the rights.\nWarrants - Each redeemable warrant entitles the holder thereof to purchase three-fourths (3/4) of one share of common stock at a price of $11.50 per full share and will become exercisable on the later of the completion of an initial Business Combination and 12 months from the closing of the IPO. However, no public warrants will be exercisable for cash unless the foregoing, if a registration statement covering the issuance of the common stock issuable upon exercise of the public warrants is not effective within 90 days from the closing of the Companys initial Business Combination, warrant holders may, until such time as there is an effective registration statement and during any period when we shall have failed to maintain an effective registration statement, exercise warrants on a cashless basis pursuant to an available exemption from registration under the Securities Act. If an exemption from registration is not available, holders will not be able to exercise their warrants on a cashless basis. The warrants will expire five years from the closing of the Companys initial Business Combination at 5:00 p.m., New York City time or earlier redemption.\nIn addition, if (x) the Company issues additional shares of common stock or equity-linked securities for capital raising purposes in connection with the closing of the Companys initial Business Combination at an issue price or effective issue price of less than $9.50 per share (with such issue price or effective issue price to be determined in good faith by our board of directors), (y) the aggregate gross proceeds from such issuances represent more than 60% of the total equity proceeds, and interest thereon, available for the funding of the Companys initial Business Combination, and (z) the volume weighted average trading price of the Companys common stock during the 20 trading day period starting on the trading day prior to the day on which the Company consummates its initial Business Combination (such price, the Market Price) is below $9.50 per share, the exercise price of the warrants will be adjusted (to the nearest cent) to be equal to 115% of the Market Price, and the $16.50 per share redemption trigger price described below will be adjusted (to the nearest cent) to be equal to 165% of the Market Value.\nThe Company may redeem the outstanding warrants:\n● in whole and not in part;\n● at a price of $0.01 per warrant;\n● upon a minimum of 30 days prior written notice of redemption, which the Company refers to as the 30-day redemption period;\n● if, and only if, the last reported sale price of the Companys common stock equals or exceeds $16.50 per share (as adjusted for stock splits, stock dividends, reorganizations, recapitalizations and the like) for any 20 trading days within a 30-trading day period ending on the third trading day prior to the date on which the Company sends the notice of redemption to the to the warrant holders.\nIf the Company calls the Public Warrants for redemption, management will have the option to require all holders that wish to exercise the Public Warrants to do so on a cashless basis, as described in the warrant agreement. In such event, each holder would pay the exercise price by surrendering the whole warrants for that number of shares of common stock equal to the quotient obtained by dividing (x) the product of the number of shares of common stock underlying the warrants, multiplied by the difference between the exercise price of the warrants and the fair market value (defined below) by (y) the fair market value. The fair market value shall mean the average reported last sale price of the common stock for the 10 trading days ending on the third trading day prior to the date on which the notice of redemption is sent to the holders of warrants.\nExcept as described above, no warrants will be exercisable and the Company will not be obligated to issue common stock unless at the time a holder seeks to exercise such warrant, a prospectus relating to the common stock issuable upon exercise of the warrants is current and the common stock have been registered or qualified or deemed to be exempt under the securities laws of the state of residence of the holder of the warrants. Under the terms of the warrant agreement, the Company has agreed to use its best efforts to meet these conditions and to maintain a current prospectus relating to the common stock issuable upon exercise of the warrants until the expiration of the warrants. However, the Company cannot assure that it will be able to do so and, if the Company does not maintain a current prospectus relating to the common stock issuable upon exercise of the warrants, holders will be unable to exercise their warrants and the Company will not be required to settle any such warrant exercise. If the prospectus relating to the common stock issuable upon the exercise of the warrants is not current or if the common stock is not qualified or exempt from qualification in the jurisdictions in which the holders of the warrants reside, the Company will not be required to net cash settle or cash settle the warrant exercise, the warrants may have no value, the market for the warrants may be limited and the warrants may expire worthless.\nThe private warrants have terms and provisions that are identical to those of the warrants being sold as part of the units in the IPO except that the private warrants will be entitled to registration rights. The private warrants (including the common stock issuable upon exercise of the private warrants) will not be transferable, assignable or salable until 30 days after the completion of our initial business combination except to permitted transferees.\nNote 9 - Fair Value Measurements\nThe fair value of the Companys financial assets and liabilities reflects managements estimate of amounts that the Company would have received in connection with the sale of the assets or paid in connection with the transfer of the liabilities in an orderly transaction between market participants at the measurement date. In connection with measuring the fair value of its assets and liabilities, the Company seeks to maximize the use of observable inputs (market data obtained from independent sources) and to minimize the use of unobservable inputs (internal assumptions about how market participants would price assets and liabilities). The following fair value hierarchy is used to classify assets and liabilities based on the observable inputs and unobservable inputs used in order to value the assets and liabilities:\nLevel 1:\nQuoted prices in active markets for identical assets or liabilities. An active market for an asset or liability is a market in which transactions for the asset or liability occur with sufficient frequency and volume to provide pricing information on an ongoing basis.\nLevel 2:\nObservable inputs other than Level 1 inputs. Examples of Level 2 inputs include quoted prices in active markets for similar assets or liabilities and quoted prices for identical assets or liabilities in markets that are not active.\nLevel 3:\nUnobservable inputs based on our assessment of the assumptions that market participants would use in pricing the asset or liability.\nThe following tabled present information about the Companys assets that are measured at fair value on a recurring basis at September 30, 2023 and 2022 indicates the fair value hierarchy of the valuation inputs the Company utilized to determine such fair value.\nSeptember 30,\nQuoted\nPrices in\nActive\nMarkets\n(Level 1) Significant\nOther\nObservable\nInputs\n(Level 2) Significant\nOther\nUnobservable\nInputs\n(Level 3)\nAssets\nTrust Account - U.S. Treasury Securities Money Market Fund $ 34,107,463 $ 34,107,463 -\n-\nSeptember 30,\n(Restated) Quoted\nPrices in\nActive\nMarkets\n(Level 1) Significant\nOther\nObservable\nInputs\n(Level 2) Significant\nOther\nUnobservable\nInputs\n(Level 3)\nAssets\nTrust Account - U.S. Treasury Securities Money Market Fund $ 69,418,075 $ 69,418,075 -\n-\nNote 10 - Income Taxes\nThe Companys net deferred tax assets are as follows:\nSeptember 30,\nSeptember 30,\n(Restated)\nDeferred tax asset\nNet operating loss carryforward $ -\n$ -\nStartup/Organization Expenses 121,704 20,294\nTotal deferred tax asset 121,704 20,294\nValuation allowance (121,704 ) (20,294 )\nDeferred tax asset, net of allowance $ -\n$ -\nThe income tax provision consists of the following:\nFor the\nYear Ended\nSeptember 30,\nFor the\nYear Ended\nSeptember 30,\n(Restated)\nFederal\nCurrent $ 492,735 $ 76,625\nDeferred (101,410 ) (20,294 )\nState\nCurrent $ -\n$ -\nDeferred -\n-\nChange in valuation allowance 101,410 20,294\nIncome tax provision $ 492,735 $ 76,625\nA reconciliation of the Companys statutory income tax rate to the Companys effective income tax rate is as follows (in thousands):\nFor the\nYear ended\nSeptember 30,\nFor the\nYear ended\nSeptember 30,\n(Restated)\nIncome at U.S. statutory rate 21.00 % 21.00 %\nState taxes, net of federal benefit 0.00 % 0.00 %\nTransaction costs 1.89 % (52.42 )%\nChange in valuation allowance 5.93 % (11.30 )%\n28.82 % (42.72 )%\nAs of September 30, 2023, the Company did not have any U.S. federal and state net operating loss carryovers available to offset future taxable income.\nIn assessing the realization of the deferred tax assets, management considers whether it is more likely than not that some portion of all of the deferred tax assets will not be realized. The ultimate realization of deferred tax assets is dependent upon the generation of future taxable income during the periods in which temporary differences representing net future deductible amounts become deductible. Management considers the scheduled reversal of deferred tax liabilities, projected future taxable income and tax planning strategies in making this assessment. After consideration of all of the information available, management believes that significant uncertainty exists with respect to future realization of the deferred tax assets and has therefore established a full valuation allowance. The changes in the valuation allowance were $101,410 and $20,294 for the year ended September 30, 2023 and 2022, respectively.\nThe provisions for U.S. federal income taxes were $492,735 and $76,625 for the years ended September 30, 2023 and 2022, respectively. The Companys tax returns for the year ended September 30, 2023, 2022 and 2021 remain open and subject to examination.\nNote 11 - Promissory Note to BitFuFu\nPursuant to the Merger Agreement, on October 10, 2022, the Company issued an unsecured promissory note to BitFuFu (BitFufu Note) up to an aggregate amount of $2,220,000 at an interest rate of 3.5% per annum and is due initially on October 26, 2023, and subsequently extended to November 17, 2024 (see Note 1). Arisz may elect to issue a number of unregistered shares of its common stock, valued for these purposes at $10.00 per share, the aggregate value of which shall be equal to the outstanding principal amount of the Loan to the BitFuFu or its designee in lieu of paying all outstanding principal under BitFufu Note upon the maturity date. On April 24, 2023, Arisz and BitFuFu entered into Amendment No. 3 to the Merger Agreement to provide, among other things, to reduce the amount of the Loan from $2,220,000 to $1,930,000 for the purpose of funding Ariszs extension of the time to consummate a business combination and for working capital purposes.\nOn July 28, 2023, Arisz and BitFuFu entered into Amendment No. 4 to the Merger Agreement to provide, among other things, to increase the amount of the Loan from $1,930,000 to $4,180,000 for the purpose of funding Ariszs extension of the time to consummate a business combination and for working capital purposes. The maturity date of the BitFufu Note was extended to November 17, 2024.\nAs of September 30, 2023, $2,380,000 of the BitFufu Note was outstanding with an accrued interest of $51,229.\nNote 12 - Restatement of Previously Issued Financial Statements\nThe following tables present the impact of the restatement adjustments disclosed in Note 2 - Restatement of Previously Issued Financial Statements, to the previously reported financial information as of and for the fiscal year ended September 30, 2022, and quarters ended December 31, 2022, March 31, 2023, and June 30, 2023. Restated Statements of Stockholders Deficit are not presented as all impacted items on those statements, Net Income (Loss), Accumulated Deficit, and Total Stockholders Deficit, are presented within the following tables.\nARISZ ACQUISITION CORP.\nRESTATED BALANCE SHEET\n(AUDITED)\nSeptember 30, 2022\nPreviously\nReported Adjustments Restated\nAssets\nCurrent assets:\nCash $ 173,789 $ -\n$ 173,789\nPrepaid expenses 16,836 -\n16,836\nTotal Current Assets 190,625\n190,625\nInvestments held in Trust Account 69,286,800 131,275 69,418,075\nTotal Assets $ 69,477,425 $ 131,275 $ 69,608,700\nLiabilities, Temporary Equity, and Stockholders Deficit\nCurrent liabilities:\nAccounts payable and accrued expenses $ 103,063 $ -\n$ 103,063\nFranchise tax payable 46,800 -\n46,800\nIncome tax payable 49,057 27,568 76,625\nTotal Current Liabilities 198,920 27,568 226,488\nDeferred underwriting fee payable 2,587,500 -\n2,587,500\nTotal Liabilities 2,786,420 27,568 2,813,988\nCommitments and Contingencies\nCommon stock subject to possible redemption, 6,900,000 shares at redemption value of $10.06 per share 69,286,800 131,275 69,418,075\nStockholders Deficit\nCommon stock, $0.0001 par value; 15,000,000 shares authorized; 2,001,389 shares (excluding 6,900,000 shares subject to possible redemption) issued and outstanding -\nAccumulated deficit (2,595,995 ) (27,568 ) (2,623,563 )\nTotal Stockholders Deficit (2,595,795 ) (27,568 ) (2,623,363 )\nTotal Liabilities, Temporary Equity, and Stockholders Deficit $ 69,477,425 $ 131,275 $ 69,608,700\nARISZ ACQUISITION CORP.\nRESTATED STATEMENT OF OPERATIONS\n(AUDITED)\nFor the Year Ended\nSeptember 30, 2022\nPreviously\nReported Adjustments Restated\nGeneral and administrative expenses $ 544,157 $ -\n$ 544,157\nFranchise tax expense 53,194 -\n53,194\nLoss from Operations (597,351 ) -\n(597,351 )\nOther income:\nInterest earned on investments held in Trust Account 286,800 131,275 418,075\nIncome before income taxes (310,551 ) 131,275 (179,276 )\nIncome tax provision (49,057 ) (27,568 ) (76,625 )\nNet loss $ (359,608 ) $ 103,707 $ (255,901 )\nBasic and diluted weighted average shares outstanding, common stock subject to possible redemption\n5,893,151 -\n5,893,151\nBasic and diluted net income per share, common stock subject to possible redemption\n$ 0.57 $ 0.01 $ 0.58\nBasic and diluted weighted average shares outstanding, non-redeemable common stock\n1,961,132 -\n1,961,132\nBasic and diluted net loss per share, non-redeemable common stock\n$ (1.88 ) $ (0.01 ) $ (1.89 )\nARISZ ACQUISITION CORP.\nRESTATED STATEMENT OF CASH FLOWS\n(AUDITED)\nFor the Year Ended\nSeptember 30, 2022\nPreviously\nReported Adjustments Restated\nCash Flows from Operating Activities:\nNet loss $ (359,608 ) $ 103,707 $ (255,901 )\nAdjustments to reconcile net income (loss) to net cash used in operating activities:\nInterest earned on investments held in Trust Account (286,800 ) (131,275 ) (418,075 )\nChanges in operating assets and liabilities:\nPrepaid expenses (16,836 ) -\n(16,836 )\nAccounts payable and accrued expenses 82,573 -\n82,573\nIncome tax payable 49,057 -\n49,057\nFranchise tax payable 46,800 27,568 76,625\nNet cash used in operating activities (484,814 ) -\n(484,814 )\nCash Flows from Investing Activities:\nPurchase of investment held in Trust Account (69,000,000 ) -\n(69,000,000 )\nNet cash used in investing activities (69,000,000 ) -\n(69,000,000 )\nCash Flows from Financing Activities:\nProceeds from sale of public units through public offering 69,000,000 -\n69,000,000\nProceeds from sale of private placement units 2,763,886 -\n2,763,886\nProceeds from sale of unit purchase option -\nRepayment of promissory note to related party (105,000 ) -\n(105,000 )\nPayment of underwriters commissions (1,725,000 ) -\n(1,725,000 )\nPayment of deferred offering costs (350,383 ) -\n(350,383 )\nNet cash provided by financing activities 69,583,603 -\n69,583,603\nNet Change in Cash 98,789 -\n98,789\nCash, Beginning of the Year 75,000 -\n75,000\nCash, End of the Year $ 173,789 $ -\n$ 173,789\nSupplemental Disclosure of Non-cash Financing Activities\nInitial classification of common stock subject to redemption $ 59,614,985 $ -\n$ 59,614,985\nDeferred underwriting fee $ 2,587,500 $ -\n$ 2,587,500\nRemeasurement of common stock to redemption value $ 14,432,564 $ 131,275 $ 14,563,839\nARISZ ACQUISITION CORP.\nRESTATED CONDENSED BALANCE SHEET\n(UNAUDITED)\nDecember 31, 2022\nPreviously\nReported Adjustments Restated\nAssets\nCurrent assets:\nCash $ 165,606 $ -\n$ 165,606\nPrepaid expenses 11,145 -\n11,145\nTotal Current Assets 176,751 -\n176,751\nInvestments held in Trust Account 70,463,045 226,316 70,689,361\nTotal Assets $ 70,639,796 $ 226,316 $ 70,866,112\nLiabilities, Temporary Equity, and Stockholders Deficit\nCurrent liabilities:\nAccounts payable and accrued expenses $ 221,982 $ -\n$ 221,982\nInterest payable 4,825 -\n4,825\nFranchise tax payable 58,800 -\n58,800\nIncome tax payable 148,310 19,959 168,269\nPromissory note - Bitfufu 740,000 -\n740,000\nTotal Current Liabilities 1,173,917 19,959 1,193,876\nDeferred underwriting fee payable 2,587,500 -\n2,587,500\nTotal Liabilities 3,761,417 19,959 3,781,376\nCommitments and Contingencies\nCommon stock subject to possible redemption, 6,900,000 shares at redemption value of $10.24 per share 70,463,045 226,316 70,689,361\nStockholders Deficit\nCommon stock, $0.0001 par value; 15,000,000 shares authorized; 2,001,389 shares (excluding 6,900,000 shares subject to possible redemption) issued and outstanding -\nAccumulated deficit (3,584,866 ) (19,959 ) (3,604,825 )\nTotal Stockholders Deficit (3,584,666 ) (19,959 ) (3,604,625 )\nTotal Liabilities, Temporary Equity, and Stockholders Deficit $ 70,639,796 $ 226,316 $ 70,866,112\nARISZ ACQUISITION CORP.\nRESTATED CONDENSED STATEMENTS OF OPERATIONS\n(UNAUDITED)\nFor the Three Months Ended\nDecember 31, 2022\nPreviously\nReported Adjustments Restated\nGeneral and administrative expenses $ 187,618 $ -\n$ 187,618\nFranchise tax expense 12,000 -\n12,000\nLoss from Operations (199,618 ) -\n(199,618 )\nOther income:\nInterest earned on investments held in Trust Account 486,246 95,041 581,287\nIncome before income taxes 286,628 95,041 381,669\nIncome tax provision (99,253 ) (19,959 ) (119,212 )\nNet Income $ 187,375 $ 75,082 $ 262,457\nBasic and diluted weighted average shares outstanding, common stock subject to possible redemption\n6,900,000 -\n6,900,000\nBasic and diluted net income per share, common stock subject to possible redemption\n$ 0.06 $ 0.01 $ 0.07\nBasic and diluted weighted average shares outstanding, non-redeemable common stock\n2,001,389 -\n2,001,389\nBasic and diluted net loss per share, non-redeemable common stock\n$ (0.11 ) $ -\n$ (0.11 )\nARISZ ACQUISITION CORP.\nRESTATED CONDENSED STATEMENT OF CASH FLOWS\n(UNAUDITED)\nFor the Three Months Ended\nDecember 31, 2022\nPreviously\nReported Adjustments Restated\nCash Flows from Operating Activities:\nNet income $ 187,375 $ 75,082 $ 262,457\nAdjustments to reconcile net income (loss) to net cash used in operating activities:\nInterest earned on investments held in Trust Account (486,246 ) (95,041 ) (581,287 )\nChanges in operating assets and liabilities:\nPrepaid expenses 5,691 -\n5,691\nAccounts payable and accrued expenses 118,919 -\n118,919\nInterest payable 4,825 -\n4,825\nIncome tax payable 99,253 19,959 119,212\nFranchise tax payable 12,000 -\n46,800\nNet cash used in operating activities (58,183 ) -\n(58,183 )\nCash Flows from Investing Activities:\nCash deposited in Trust Account for extension (690,000 ) -\n(690,000 )\nNet cash provided by (used in) investing activities (690,000 ) -\n(690,000 )\nCash Flows from Financing Activities:\nProceeds from issuance of promissory note to Bitfufu 740,000 -\n740,000\nNet cash provided by (used in) financing activities 740,000 -\n740,000\nNet Change in Cash (8,183 ) -\n(8,183 )\nCash, Beginning of the Period 173,789 -\n173,789\nCash, End of the Period $ 165,606 $ -\n$ 165,606\nSupplemental Disclosure of Non-cash Financing Activities\nDeferred underwriting fee $ 2,587,500 $ -\n$ 2,587,500\nRemeasurement of common stock to redemption value $ 1,176,246 $ 95,041 $ 1,271,287\nARISZ ACQUISITION CORP.\nRESTATED CONDENSED BALANCE SHEET\n(UNAUDITED)\nMarch 31, 2023\nPreviously Reported Adjustments Restated\nAssets\nCurrent assets:\nCash $ 7,409 $ -\n$ 7,409\nPrepaid expenses 64,061 -\n64,061\nTotal Current Assets 71,470 -\n71,470\nInvestments held in Trust Account 71,752,184 271,857 72,024,041\nTotal Assets $ 71,823,654 $ 271,857 $ 72,095,511\nLiabilities, Temporary Equity, and Stockholders Deficit\nCurrent liabilities:\nAccounts payable and accrued expenses $ 186,748 $ -\n$ 186,748\nInterest payable 16,179 -\n16,179\nFranchise tax payable 24,100 -\n24,100\nIncome tax payable 244,419 29,522 273,941\nPromissory note - Bitfufu 1,480,000 -\n1,480,000\nTotal Current Liabilities 1,951,446 29,522 1,980,968\nDeferred underwriting fee payable 2,587,500 -\n2,587,500\nTotal Liabilities 4,538,946 29,522 4,568,468\nCommitments and Contingencies\nCommon stock subject to possible redemption, 6,900,000 shares at redemption value of $10.44 per share 71,752,184 271,857 72,024,041\nStockholders Deficit\nCommon stock, $0.0001 par value; 15,000,000 shares authorized; 2,001,389 shares (excluding 6,900,000 shares subject to possible redemption) issued and outstanding -\nAccumulated deficit (4,467,676 ) (29,522 ) (4,497,198 )\nTotal Stockholders Deficit (4,467,476 ) (29,522 ) (4,496,998 )\nTotal Liabilities, Temporary Equity, and Stockholders Deficit $ 71,823,654 $ 271,857 $ 72,095,511\nARISZ ACQUISITION CORP.\nRESTATED CONDENSED STATEMENTS OF OPERATIONS\n(UNAUDITED)\nFor the Three Months Ended\nMarch 31, 2023\nPreviously Reported Adjustments Restated\nGeneral and administrative expenses $ 141,380 $ -\n$ 141,380\nFranchise tax expense 12,100 -\n12,100\nLoss from Operations (153,480 ) -\n(153,480 )\nOther income:\nInterest earned on investments held in Trust Account 704,974 45,541 750,515\nIncome before income taxes 551,494 45,541 597,035\nIncome tax provision (145,166 ) (9,564 ) (154,730 )\nNet Income $ 406,328 $ 35,977 $ 442,305\nBasic and diluted weighted average shares outstanding, common stock subject to possible redemption\n6,900,000 -\n6,900,000\nBasic and diluted net income per share, common stock subject to possible redemption\n$ 0.09 $ -\n$ 0.09\nBasic and diluted weighted average shares outstanding, non-redeemable common stock\n2,001,389 -\n2,001,389\nBasic and diluted net loss per share, non-redeemable common stock\n$ (0.10 ) $ -\n$ (0.10 )\nARISZ ACQUISITION CORP.\nRESTATED CONDENSED STATEMENTS OF OPERATIONS\n(UNAUDITED)\nFor the Six Months Ended\nMarch 31, 2023\nPreviously\nReported Adjustments Restated\nGeneral and administrative expenses $ 328,998 $ -\n$ 328,998\nFranchise tax expenses 24,100 -\n24,100\nLoss from Operations (353,098 ) -\n(353,098 )\nOther income:\nInterest earned on investments held in Trust Account 1,191,220 140,582 1,331,802\nIncome before income taxes 838,122 140,582 978,704\nIncome tax provision (244,419 ) (29,522 ) (273,941 )\nNet Income $ 593,703 $ 111,060 $ 704,763\nBasic and diluted weighted average shares outstanding, common stock subject to possible redemption\n6,900,000 -\n6,900,000\nBasic and diluted net income per share, common stock subject to possible redemption\n$ 0.15 $ 0.01 $ 0.16\nBasic and diluted weighted average shares outstanding, non-redeemable common stock\n2,001,389 -\n2,001,389\nBasic and diluted net loss per share, non-redeemable common stock\n$ (0.21 ) $ -\n$ (0.21 )\nARISZ ACQUISITION CORP.\nRESTATED CONDENSED STATEMENT OF CASH FLOWS\n(UNAUDITED)\nFor the Six Months Ended\nMarch 31, 2023\nPreviously\nReported Adjustments Restated\nCash Flows from Operating Activities:\nNet income $ 593,703 $ 111,060 $ 704,763\nAdjustments to reconcile net income (loss) to net cash used in operating activities:\nInterest earned on investments held in Trust Account (1,191,220 ) (140,582 ) (1,331,802 )\nChanges in operating assets and liabilities:\nPrepaid expenses (47,225 ) -\n(47,225 )\nAccounts payable and accrued expenses 83,685\n83,685\nInterest payable\t \t \t 16,179 -\n16,179\nIncome tax payable 195,362 29,522 224,884\nFranchise tax payable (22,700 ) -\n(22,700 )\nNet cash used in operating activities (372,216 ) -\n(372,216 )\nCash Flows from Investing Activities:\nCash deposited in Trust Account for extension (1,380,000 ) -\n(1,380,000 )\nCash withdrawn from Trust Account to pay franchise tax and income taxes 105,836 -\n105,836\nNet cash provided by (used in) investing activities (1,274,164 ) -\n(1,274,164 )\nCash Flows from Financing Activities:\nProceeds from issuance of promissory note to Bitfufu 1,480,000 -\n1,480,000\nNet cash provided by financing activities 1,480,000 -\n1,480,000\nNet Change in Cash (166,380 ) -\n(166,380 )\nCash, Beginning of the Period 173,789 -\n173,789\nCash, End of the Period $ 7,409 $ -\n$ 7,409\nSupplemental Disclosure of Non-cash Financing Activities\nRemeasurement of common stock to redemption value $ 2,465,384 $ 140,582 $ 2,605,966\nARISZ ACQUISITION CORP.\nRESTATED CONDENSED BALANCE SHEET\n(UNAUDITED)\nJune 30, 2023\nPreviously Reported Adjustments Restated\nAssets\nCurrent assets:\nCash $ 158,698 $ -\n$ 158,698\nPrepaid expenses 46,720 -\n46,720\nTotal Current Assets 205,418 -\n205,418\nInvestments held in Trust Account 33,185,036 129,527 33,314,563\nTotal Assets $ 33,390,454 $ 129,527 $ 33,519,981\nLiabilities, Temporary Equity, and Stockholders Deficit\nCurrent liabilities:\nAccounts payable and accrued expenses $ 283,584 $ -\n$ 283,584\nInterest payable 31,756 -\n31,756\nFranchise tax payable 13,900 -\n13,900\nIncome tax payable 45,554 (367 ) 45,187\nExcise tax payable 391,931 -\n391,931\nPromissory note - Bitfufu 1,930,000 -\n1,930,000\nTotal Current Liabilities 2,696,725 (367 ) 2,696,358\nDeferred underwriting fee payable 2,587,500 -\n2,587,500\nTotal Liabilities 5,284,225 (367 ) 5,283,858\nCommitments and Contingencies\nCommon stock subject to possible redemption, 3,154,365 shares at redemption value of $10.56 per share 33,185,036 129,527 33,314,563\nStockholders Deficit\nCommon stock, $0.0001 par value; 15,000,000 shares authorized; 2,001,389 shares (excluding 3,154,365 shares subject to possible redemption) issued and outstanding -\nAccumulated deficit (5,079,007 ) (5,078,640 )\nTotal Stockholders Deficit (5,078,807 ) (5,078,440 )\nTotal Liabilities, Temporary Equity, and Stockholders Deficit $ 33,390,454 $ 129,527 $ 33,519,981\nARISZ ACQUISITION CORP.\nRESTATED CONDENSED STATEMENTS OF OPERATIONS\n(UNAUDITED)\nFor the Three Months Ended\nJune 30, 2023\nPreviously\nReported Adjustments Restated\nGeneral and administrative expenses $ 188,542 $ -\n$ 188,542\nFranchise tax expense 9,800 -\n9,800\nLoss from Operations (198,342 ) -\n(198,342 )\nOther income:\nInterest earned on investments held in Trust Account 763,986 (142,330 ) 621,656\nIncome before income taxes 565,644 (142,330 ) 423,314\nIncome tax provision (159,055 ) 29,889 (129,166 )\nNet Income $ 406,589 $ (112,441 ) $ 294,148\nBasic and diluted weighted average shares outstanding, common stock subject to possible redemption 4,800,798 - 4,800,798\nBasic and diluted net income per share, common stock subject to possible redemption\n$ 0.10 $ (0.03 ) $ 0.07\nBasic and diluted weighted average shares outstanding, non-redeemable common stock\n2,001,389 -\n2,001,389\nBasic and diluted net loss per share, non-redeemable common stock\n$ (0.03 ) $ -\n$ (0.03 )\nARISZ ACQUISITION CORP.\nRESTATED CONDENSED STATEMENTS OF OPERATIONS\n(UNAUDITED)\nFor the Nine Months Ended\nJune 30, 2023\nPreviously\nReported Adjustments Restated\nGeneral and administrative expenses $ 517,538 $ -\n$ 517,538\nFranchise tax expense 33,900 -\n33,900\nLoss from Operations (551,438 ) -\n(551,438 )\nOther income:\nInterest earned on investments held in Trust Account 1,955,206 (1,748 ) 1,953,458\nIncome before income taxes 1,403,768 (1,748 ) 1,402,020\nIncome tax provision (403,474 ) (403,107 )\nNet Income $ 1,000,294 $ (1,381 ) $ 998,913\nBasic and diluted weighted average shares outstanding, common stock subject to possible redemption 6,200,266 - 6,200,266\nBasic and diluted net income per share, common stock subject to possible redemption\n$ 0.24 $ -\n$ 0.24\nBasic and diluted weighted average shares outstanding, non-redeemable common stock\n2,001,389 -\n2,001,389\nBasic and diluted net loss per share, non-redeemable common stock\n$ (0.25 ) $ -\n$ (0.25 )\nARISZ ACQUISITION CORP.\nRESTATED CONDENSED STATEMENT OF CASH FLOWS\n(UNAUDITED)\nFor the Nine Months Ended\nJune 30, 2023\nPreviously\nReported Adjustments Restated\nCash Flows from Operating Activities:\nNet income $ 1,000,294 $ (1,381 ) $ 998,913\nAdjustments to reconcile net income (loss) to net cash used in operating activities:\nInterest earned on investments held in Trust Account (1,955,206 ) 1,748 (1,953,458 )\nChanges in operating assets and liabilities:\nPrepaid expenses (29,884 ) -\n(29,884 )\nAccounts payable and accrued expenses 180,520 - 180,520\nInterest payable 31,756 -\n31,756\nIncome tax payable (3,503 ) (367 ) (3,870 )\nFranchise tax payable (32,900 ) -\n(32,900 )\nNet cash used in operating activities (808,923 ) -\n(808,923 )\nCash Flows from Investing Activities:\nCash deposited in Trust Account for extension (1,620,000 ) -\n(1,620,000 )\nCash withdrawn from Trust Account to pay franchise tax and income taxes 483,832 -\n483,832\nCash withdrawn from Trust Account for public stockholder redemptions 39,193,137 -\n39,193,137\nNet cash provided by investing activities 38,056,969 -\n38,056,969\nCash Flows from Financing Activities:\nProceeds from issuance of promissory note to Bitfufu 1,930,000 -\n1,930,000\nPayment to redeemed public stockholders (39,193,137 ) - 39,193,137\nNet cash used in financing activities (37,263,137 ) -\n(37,263,137 )\nNet Change in Cash (15,091 ) -\n(15,091 )\nCash, Beginning of the Period 173,789 -\n173,789\nCash, End of the Period $ 158,698 $ -\n$ 158,698\nSupplemental Disclosure of Non-cash Financing Activities\nRemeasurement of common stock to redemption value $ 3,091,374 $ (1,748 ) $ 3,089,625\nNote 13 - Subsequent Events\nThe Company evaluated subsequent events and transactions that occurred after the balance sheet date through the date that the financial statements were issued. Other than described below, the Company did not identify any other subsequent events that would have required adjustment or disclosure in the financial statements.\nOn October 18, 2023, November 17, 2023 and December 18, 2023, Arisz deposited $120,000 each time into the Trust Account to extend the period of time Arisz has to complete a business combination from October 22, 2023 to January 22, 2024.\nOn October 30, 2023, Arisz received $450,000, the fifth installment of the Loan, from BitFuFu.\nOn November 15, 2023, Arisz entered into Amendment No. 1 to the Investment Management Trust Agreement, dated as of November 17, 2021, by and between the Company and Continental Stock Transfer & Trust Company, to allow for the funds in the Trust Account to be held in an interest-bearing bank demand deposit account.\nIn addition, in order to mitigate the potential risks of being deemed to have been operating as an unregistered investment company for purposes of the Investment Company Act of 1940, as amended (the Investment Company Act), the Company has determined to instruct Continental Stock Transfer & Trust Company, to liquidate the U.S. government treasury obligations and money market funds held in the Trust Account and to hold all funds in the Trust Account in cash in an interest-bearing bank demand deposit account until the earlier of consummation of the Companys initial business combination or liquidation.\n0.36 0.58 0.36 1.89\n0.36 0.36\n0.58 1.89\n0.01 0.57 0.58\n0.01 1.88 1.89\n0.01 0.06 0.07\n0.11 0.11\n0.09 0.09\n0.10 0.10\n0.01 0.15 0.16\n0.21 0.21\n0.03 0.07 0.10\n0.03 0.03\n0.24 0.24\n0.25 0.25\nfalse FY\n2022-10-01 2023-09-30\nariz:CommonStockParValue00001PerShareMember\n2022-10-01 2023-09-30\nariz:WarrantsMember\n2022-10-01 2023-09-30\nariz:RightMember\n2022-10-01 2023-09-30\nariz:UnitsEachConsistingOfOneShareOfCommonStockOneRightAndOneWarrantMember\n2022-10-01 2023-09-30\n2023-12-18\n2023-03-31\n2023-09-30\n2022-09-30\n2021-10-01 2022-09-30\nariz:CommonStockSubjectToPossibleRedemptionMember\n2022-10-01 2023-09-30\nariz:CommonStockSubjectToPossibleRedemptionMember\n2021-10-01 2022-09-30\nariz:NonredeemableCommonStockMember\n2022-10-01 2023-09-30\nariz:NonredeemableCommonStockMember\n2021-10-01 2022-09-30\nus-gaap:CommonStockMember\n2022-09-30\nus-gaap:AdditionalPaidInCapitalMember\n2022-09-30\nus-gaap:RetainedEarningsMember\n2022-09-30\nus-gaap:CommonStockMember\n2022-10-01 2023-09-30\nus-gaap:AdditionalPaidInCapitalMember\n2022-10-01 2023-09-30\nus-gaap:RetainedEarningsMember\n2022-10-01 2023-09-30\nus-gaap:CommonStockMember\n2023-09-30\nus-gaap:AdditionalPaidInCapitalMember\n2023-09-30\nus-gaap:RetainedEarningsMember\n2023-09-30\nus-gaap:CommonStockMember\n2021-09-30\nus-gaap:AdditionalPaidInCapitalMember\n2021-09-30\nus-gaap:RetainedEarningsMember\n2021-09-30\n2021-09-30\nus-gaap:CommonStockMember\n2021-10-01 2022-09-30\nus-gaap:AdditionalPaidInCapitalMember\n2021-10-01 2022-09-30\nus-gaap:RetainedEarningsMember\n2021-10-01 2022-09-30\n2022-07-14\nus-gaap:CommonClassAMember\n2022-07-14\nariz:BitFuFuMember\n2022-10-10\nariz:LoanMember\n2022-10-26 2022-10-26\n2022-10-10\nus-gaap:CommonStockMember\n2023-09-30\n2022-10-13\nariz:LoanMember\n2022-10-24 2022-10-24\nariz:AriszMember\n2022-11-09\nariz:LoanMember\n2023-01-20 2023-01-20\n2023-02-09\nariz:BusinessCombinationMember\n2023-09-30\nsrt:MaximumMember\n2023-04-24\nsrt:MinimumMember\n2023-04-24\n2023-04-24\nariz:BitFuFuMember\n2023-04-25\n2023-05-11 2023-05-11\n2023-05-22\n2023-07-28 2023-07-28\nus-gaap:IPOMember\n2021-11-22 2021-11-22\nus-gaap:IPOMember\n2021-11-22\nariz:SponsorAndChardanCapitalMarketsLLCMember\n2022-10-01 2023-09-30\nariz:SponsorAndChardanCapitalMarketsLLCMember\n2023-09-30\n2021-08-05 2021-08-05\nus-gaap:OverAllotmentOptionMember\n2022-10-01 2023-09-30\nus-gaap:OverAllotmentOptionMember\n2021-11-24 2021-11-24\nus-gaap:OverAllotmentOptionMember\n2021-11-24\nariz:PrivateUnitsMember\n2021-11-24 2021-11-24\nariz:PrivateUnitsMember\n2021-11-24\nariz:BusinessCombinationMember\n2022-10-01 2023-09-30\nus-gaap:OverAllotmentOptionMember\n2023-09-30\nariz:PublicSharesMember\n2022-10-01 2023-09-30\nsrt:ScenarioForecastMember ariz:BusinessCombinationMember\n2024-01-22\nariz:PublicSharesMember\n2023-09-30\n2023-05-11\ncountry:US\n2022-10-01 2023-09-30\nus-gaap:IPOMember\n2023-09-30\nariz:RedeemableSharesMember\n2022-10-01 2023-09-30\nariz:NonRedeemableSharesMember\n2022-10-01 2023-09-30\nariz:RedeemableSharesMember\n2021-10-01 2022-09-30\nariz:NonRedeemableSharesMember\n2021-10-01 2022-09-30\nus-gaap:OverAllotmentOptionMember\n2021-11-22 2021-11-22\nus-gaap:IPOMember\n2022-10-01 2023-09-30\n2022-09-29\nus-gaap:PrivatePlacementMember\n2022-10-01 2023-09-30\nus-gaap:PrivatePlacementMember\n2023-09-30\nariz:SponsorAndChardanMember\n2021-11-24 2021-11-24\nariz:SponsorAndChardanMember\n2021-11-24\nariz:InsiderSharesMember\n2021-08-05\nariz:InsiderSharesMember\n2021-08-05 2021-08-05\nariz:InsiderSharesMember\n2021-10-29\nariz:InsiderSharesMember\n2021-10-29 2021-10-29\nus-gaap:IPOMember\n2021-10-29 2021-10-29\nariz:InsiderSharesMember\n2022-10-01 2023-09-30\nus-gaap:IPOMember\n2021-08-05 2021-08-05\nus-gaap:IPOMember\n2021-08-05\nariz:ChardanMember ariz:UnitPurchaseOptionMember\n2022-10-01 2023-09-30\nariz:UnitPurchaseOptionMember\n2023-09-30\n2022-12-31\n2021-10-29 2021-10-29\n2021-10-29\nus-gaap:WarrantMember\n2023-09-30\nus-gaap:WarrantMember\n2022-10-01 2023-09-30\nus-gaap:FairValueInputsLevel1Member\n2023-09-30\nus-gaap:FairValueInputsLevel2Member\n2023-09-30\nus-gaap:FairValueInputsLevel3Member\n2023-09-30\nus-gaap:FairValueInputsLevel1Member\n2022-09-30\nus-gaap:FairValueInputsLevel2Member\n2022-09-30\nus-gaap:FairValueInputsLevel3Member\n2022-09-30\n2022-10-10 2022-10-10\n2023-04-24 2023-04-24\nsrt:MinimumMember\n2023-07-28 2023-07-28\nsrt:MaximumMember\n2023-07-28 2023-07-28\nariz:PromissoryNoteMember\n2022-10-01 2023-09-30\nariz:RestatedMember\n2022-10-01 2023-09-30\nsrt:ScenarioPreviouslyReportedMember\n2022-09-30\nariz:AdjustmentsMember\n2022-09-30\nariz:RestatedMember\n2022-09-30\nsrt:ScenarioPreviouslyReportedMember\n2022-12-31\nariz:AdjustmentsMember\n2022-12-31\nariz:RestatedMember\n2022-12-31\nsrt:ScenarioPreviouslyReportedMember\n2023-03-31\nariz:AdjustmentsMember\n2023-03-31\nariz:RestatedMember\n2023-03-31\nsrt:ScenarioPreviouslyReportedMember\n2023-06-30\nariz:AdjustmentsMember\n2023-06-30\nariz:RestatedMember\n2023-06-30\nsrt:ScenarioPreviouslyReportedMember\n2021-10-01 2022-09-30\nariz:AdjustmentsMember\n2021-10-01 2022-09-30\nariz:RestatedMember\n2021-10-01 2022-09-30\nsrt:ScenarioPreviouslyReportedMember ariz:CommonStockSubjectToPossibleRedemptionMember\n2021-10-01 2022-09-30\nariz:AdjustmentsMember ariz:CommonStockSubjectToPossibleRedemptionMember\n2021-10-01 2022-09-30\nariz:RestatedMember ariz:CommonStockSubjectToPossibleRedemptionMember\n2021-10-01 2022-09-30\nsrt:ScenarioPreviouslyReportedMember ariz:NonredeemableCommonStockMember\n2021-10-01 2022-09-30\nariz:AdjustmentsMember ariz:NonredeemableCommonStockMember\n2021-10-01 2022-09-30\nariz:RestatedMember ariz:NonredeemableCommonStockMember\n2021-10-01 2022-09-30\nsrt:ScenarioPreviouslyReportedMember\n2022-10-01 2022-12-31\nariz:AdjustmentsMember\n2022-10-01 2022-12-31\nariz:RestatedMember\n2022-10-01 2022-12-31\nsrt:ScenarioPreviouslyReportedMember ariz:CommonStockSubjectToPossibleRedemptionMember\n2022-10-01 2022-12-31\nariz:AdjustmentsMember ariz:CommonStockSubjectToPossibleRedemptionMember\n2022-10-01 2022-12-31\nariz:RestatedMember ariz:CommonStockSubjectToPossibleRedemptionMember\n2022-10-01 2022-12-31\nsrt:ScenarioPreviouslyReportedMember ariz:NonredeemableCommonStockMember\n2022-10-01 2022-12-31\nariz:AdjustmentsMember ariz:NonredeemableCommonStockMember\n2022-10-01 2022-12-31\nariz:RestatedMember ariz:NonredeemableCommonStockMember\n2022-10-01 2022-12-31\nsrt:ScenarioPreviouslyReportedMember\n2023-01-01 2023-03-31\nariz:AdjustmentsMember\n2023-01-01 2023-03-31\nariz:RestatedMember\n2023-01-01 2023-03-31\nsrt:ScenarioPreviouslyReportedMember ariz:CommonStockSubjectToPossibleRedemptionMember\n2023-01-01 2023-03-31\nariz:AdjustmentsMember ariz:CommonStockSubjectToPossibleRedemptionMember\n2023-01-01 2023-03-31\nariz:RestatedMember ariz:CommonStockSubjectToPossibleRedemptionMember\n2023-01-01 2023-03-31\nsrt:ScenarioPreviouslyReportedMember ariz:NonredeemableCommonStockMember\n2023-01-01 2023-03-31\nariz:AdjustmentsMember ariz:NonredeemableCommonStockMember\n2023-01-01 2023-03-31\nariz:RestatedMember ariz:NonredeemableCommonStockMember\n2023-01-01 2023-03-31\nsrt:ScenarioPreviouslyReportedMember\n2022-10-01 2023-03-31\nariz:AdjustmentsMember\n2022-10-01 2023-03-31\nariz:RestatedMember\n2022-10-01 2023-03-31\nsrt:ScenarioPreviouslyReportedMember ariz:CommonStockSubjectToPossibleRedemptionMember\n2022-10-01 2023-03-31\nariz:AdjustmentsMember ariz:CommonStockSubjectToPossibleRedemptionMember\n2022-10-01 2023-03-31\nariz:RestatedMember ariz:CommonStockSubjectToPossibleRedemptionMember\n2022-10-01 2023-03-31\nsrt:ScenarioPreviouslyReportedMember ariz:NonredeemableCommonStockMember\n2022-10-01 2023-03-31\nariz:AdjustmentsMember ariz:NonredeemableCommonStockMember\n2022-10-01 2023-03-31\nariz:RestatedMember ariz:NonredeemableCommonStockMember\n2022-10-01 2023-03-31\nsrt:ScenarioPreviouslyReportedMember\n2023-04-01 2023-06-30\nariz:AdjustmentsMember\n2023-04-01 2023-06-30\nariz:RestatedMember\n2023-04-01 2023-06-30\nsrt:ScenarioPreviouslyReportedMember ariz:CommonStockSubjectToPossibleRedemptionMember\n2023-04-01 2023-06-30\nariz:AdjustmentsMember ariz:CommonStockSubjectToPossibleRedemptionMember\n2023-04-01 2023-06-30\nariz:RestatedMember ariz:CommonStockSubjectToPossibleRedemptionMember\n2023-04-01 2023-06-30\nsrt:ScenarioPreviouslyReportedMember ariz:NonredeemableCommonStockMember\n2023-04-01 2023-06-30\nariz:AdjustmentsMember ariz:NonredeemableCommonStockMember\n2023-04-01 2023-06-30\nariz:RestatedMember ariz:NonredeemableCommonStockMember\n2023-04-01 2023-06-30\nsrt:ScenarioPreviouslyReportedMember\n2022-10-01 2023-06-30\nariz:AdjustmentsMember\n2022-10-01 2023-06-30\nariz:RestatedMember\n2022-10-01 2023-06-30\nsrt:ScenarioPreviouslyReportedMember ariz:CommonStockSubjectToPossibleRedemptionMember\n2022-10-01 2023-06-30\nariz:AdjustmentsMember ariz:CommonStockSubjectToPossibleRedemptionMember\n2022-10-01 2023-06-30\nariz:RestatedMember ariz:CommonStockSubjectToPossibleRedemptionMember\n2022-10-01 2023-06-30\nsrt:ScenarioPreviouslyReportedMember ariz:NonredeemableCommonStockMember\n2022-10-01 2023-06-30\nariz:AdjustmentsMember ariz:NonredeemableCommonStockMember\n2022-10-01 2023-06-30\nariz:RestatedMember ariz:NonredeemableCommonStockMember\n2022-10-01 2023-06-30\nsrt:ScenarioPreviouslyReportedMember\n2021-09-30\nariz:AdjustmentsMember\n2021-09-30\nariz:RestatedMember\n2021-09-30\nus-gaap:SubsequentEventMember\n2023-10-18\nus-gaap:SubsequentEventMember\n2023-11-17\nus-gaap:SubsequentEventMember\n2023-10-30\nus-gaap:SubsequentEventMember\n2023-12-18\nxbrli:shares\niso4217:USD\niso4217:USD\nxbrli:shares\nxbrli:pure"
}