{
    "cik": "1883835",
    "company": "PLASMA INNOVATIVE INC.",
    "filing_type": "10-K",
    "filing_date": "2023-10-30",
    "period_of_report": "2023-08-31",
    "sic": "2836",
    "state_of_inc": "NV",
    "state_location": "PA",
    "fiscal_year_end": "0831",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1883835/0001520138-23-000465-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1883835/000152013823000465/pmin-20220831_10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1883835/0001520138-23-000465.txt",
    "filename": "1883835_10K_2023_0001520138-23-000465.htm",
    "content": "Item 1. Business\nDESCRIPTION OF BUSINESS\nCompany Overview\nWe were incorporated on July 22, 2021. Plasma Innovative Inc., a Nevada corporation, is an emerging cold plasma application company. We intend to use our proprietary, cold plasma technology to treat crops and plant seeds for agriculture. We believe that treated seeds yield healthier and more productive plants and crops. One of our directors has spent the last 16 years testing and developing this technology, which has been assigned to the Company.\nSince our inception, we have undertaken the following operations:\n➢ On August 6, 2021, we entered into the Technology Assignment Agreement (described below) with Mr. Hanliang Shao, our director, pursuant to which we acquired certain cold plasma technology used in our business.\n➢ On or about August 19, 2021, we completed the private placement of 1,300,000 shares of our common stock at a price of $0.10 per share for a total offering of $130,000.\n➢ We have made preliminary contact with the Pennsylvania Department of Agriculture, who in turn have introduced us to the director of a large university in Pennsylvania. We are hopeful that we may be able to collaborate with this and other universities so as to reach local farmers, nurseries, greenhouses and seed companies.\n➢ In early 2022, we began collaborating with a Chinese plasma company to apply our technology for the reduction of chemicals and pesticides on herbs and teas grown in China (See Recent Events below).\nAs of the date of this filing, we have begun the assembly and construction of our initial cold plasma processing unit which we will use for test purposes.\nTechnology Assignment Agreement\nAs mentioned above, on August 6, 2021, we entered into the Technology Assignment Agreement with Mr. Shao, our former director. Pursuant to the agreement, Mr. Shao conveyed to us all of rights, titles and interests in and to three separate technologies. In exchange, Mr. Shao will earn 4,000,000 shares of our common stock upon the filing of a patent for the three technologies with the US Patent and Trademark Office (USPTO) which relate to our plasma process. In addition, Mr. Shao shall be entitled to receive a total of 2,000,000 additional shares of our common stock issuable monthly over a three (3) year period beginning with the month of August 2021 (Term) at the rate of 55,556 shares per month, except in final month, the amount shall be 55,540, provided that during the Term, he does not breach the confidentiality and non-compete covenants contained in the agreement. Mr. Shao was entitled 111,112 shares of common stock at $0.001 par value under the agreement for the months of September 2021 and October 2021, which were issued in January 2022 at a value of $111. Mr. Shao passed away on November 20, 2021. On December 20, 2021, the Company entered into a Continuation of Technology Assignment Agreement with Ping Wu, Tian Yang, Jun Shao, Yu Shao, Chunni Shao, and Dongni Shao (collectively, the Shao Heirs). Pursuant to this agreement, Mr. Tian Yang was appointed by the Shao Heirs to be the recipient and record holder of the shares of common stock issuable under the Technology Assignment Agreement. As one of our key researchers and founders passed away, our business execution met big impact.\nDescription of Plasma in General and Cold Plasma\nPlasma is called the fourth state of matter after gas, solid and liquid. It was identified by Sir William Crooks in 1879. Plasma is roughly defined as a collection of equal positive and negative charge carriers and has zero total charge. It is actually a partially ionized gas, which may be a gaseous complex composed of electrons, ions of any polarity, gaseous atoms and molecules in any high-energy. It is estimated that outside of our planetary system, 99% of the universe is in a plasma state, that is, the earth is also surrounded by a layer of natural plasma called the ionosphere. Lightning, comet tails, and northern lights are also natural plasmas.\nPlasma and is generally distinguished by temperature, meaning hot plasma in contrast with cold plasma. The temperature of hot plasma ranges from several thousand degrees to one hundred thousand degrees, while the temperature of cold plasma is room temperature.\nHot plasma typically is generated by an arc discharge at a pressure equal to or higher than the atmospheric pressure. Highly widespread in nature (in the form of comets, galaxies, flashes, lightning), they are characterized by a high frequency of collision between electrons and gas molecules and a high gas temperature of many thousands of degrees.\nLow-pressure cold plasma technology also is referred to as vacuum plasma technology. This technology has its origin in the processing of semiconductor materials and printed circuit boards. Cold plasma also has been used recently to inactivate contaminating microbes on meats, poultry, fruits, and vegetables.\nDescription of Our Technology\nMr. Shao, our former director, spent a number of years developing the application of cold plasma for the agriculture industry. In 2015, through his own internal testing, he discovered that cold plasma can interact with living organisms (biomolecules), thereby enabling living organisms (biomolecules) to obtain energy. Our process applies radio-frequency lighting supplied by the plasma source in a low-pressure vacuum environment to affect the seeds at the molecular level. The process occurs in a bacteria free environment with no emissions of any kind. Mr. Shaos internal tests have indicated that radio-frequency lighting creates a photochemical reaction of seeds on the molecular level, similar to the impact of sunlight on a seed or plant. In sum, the plasma energy is transported and stored into the cells of the seeds. The stored energy increases the metabolic activity in the seed. The result of the metabolic activity is the permeability of the seed surface increases which allows for a greater uptake and retention of water and nutrients. Our process does not involve genetic modification of seeds. As the plant life cycle develops from seed to yield bearing plants, our internal tests have indicated that the plants are healthier, demonstrating superior qualities over conventional, untreated seeds.\nThese qualities include;\n● Increased crop yields. Our internal tests have indicated plant yield increases of between 6-8% on average and crop dependent. Increased plant yields result in greater profit for growers.\n● Reduced fertilizer use. Our seeds become charged with energy, as a result, we will recommend a reduction of fertilizer of approximately 20% because of the seed treated to become more viable per our internal tests. This advantage has an ecological and cost benefit. Reduced fertilizer has a favorable impact on the environment causing less fertilizer runoff in rivers, streams and lakes with a concomitant cost saving to the grower.\n● Reduced need for pesticides. Because our process delivers a healthier plant which in turn is more disease resistant, we will recommend a reduction of 20% in pesticides per our internal tests. Similar to fertilizer use, reduced chemical inputs yield an ecological and cost benefit.\n● Greater ability to withstand stresses. Again, a healthier plant is better able to withstand stress from drought, frost and heat. This means that crop damage can be minimized during unseasonal weather conditions resulting in a cost benefit to the grower.\n● Improved germination rate. Our germination rates range from 90% to 98% crop dependent compared to normal germination rates of 85%-90% crop dependent per our internal tests. This means that fewer seeds die in the planting and grow process. This benefit in turn produces higher annual yields separate from the plant yield increase discussed above.\nAlthough the favorable characteristics of our plasma process described above have been supported by our own internal testing, the results have not been corroborated by third party, independent tests.\nInitial and Future Processing Plants.\nWe have begun assembly of our initial processing plant. The initial plant will be a test plant and thus smaller than a fully operational plant. The test plant will be assembled at our facilities located at our facility in 523 School House Rd., Kennett Square, PA 19348. For our test unit, we will purchase off the shelf components provided by a number of suppliers, including a plasma power supply and vacuum pump. We have designed other components which will be fabricated by third parties and assembled at our facility. We intend to purchase or design similar but larger components for our fully operational plants which we likewise will assemble at our facility.\nThe below picture depicts a replica of a full production unit.\n(picture #1)\nThe process is as follows:\n- Seeds are poured into the vertical, intake cannister (top right in picture #1), which drop into a conveyer belt housed in the horizontal cannister (see conveyer belt depicted in picture #2 below),\n(picture #2)\n- The equipment is locked and the vacuum pump is engaged to replace the air in the chamber;\n- The plasma power supply is engaged at pre-determined parameters and the seeds enter the plasma chamber on the conveyor belt,\n- After a brief period of plasma contact (10-20 seconds), the seed drop into the vertical, output cannister (bottom left in picture #1), the plasma power is turned off and the treatment ends.\n- The entire process occurs within 6-8 minutes.\nThe process described above will treat roughly 44 pounds of seeds per application using a full production unit.\nOur Growth Strategy\nWe intend to initially market our technologies to farmers, nurseries, greenhouses and seed companies in close proximity to our facilities in Pennsylvania. We will invite potential users to our facility to conduct a test runs on various crops and plants. In order to facilitate that process, we will contact agriculture departments at major universities with the hopes of establishing collaborative testing of our technology. We believe favorable arrangements with these agriculture departments will lead to introductions to major farmers, nurseries and greenhouses in the area or state.\nDuring the testing period, we expect to process a small quantity of seeds of various crops and plants per user and then have the user plant and cultivate the seeds in a comparative setting against their conventional or control methods. We expect the grow cycle to occur at the users location. We will require all test participants to provide us with a range of data points during certain times during the grow cycle. These data points will include germination rates, height, diameter, color, weight and yields of plants.\nWe believe a test period to run between 3 to 6 months which represents the growth cycle through harvest of various crops and plants. Following the harvests, we will analyze the data independently and with the test participant. Once the test period concludes, we are hopeful to enter into a processing arrangement with test participants whereby we process their seeds at an agreed fee based on the number of seed pounds processed. However, at this time, we do not have any fee arrangements and can not predict the fee that we be able to charge to our customers.\nIn addition to developing direct relationships with local farmers, nurseries, greenhouses and seed companies discussed above, in 2023 after the test equipment is constructed, we intend to:\n■ Collaborate with agriculture departments at various universities. We intend to contact various universities in the Northeast so as to use and test our technology in a controlled environment (ie against conventional measures). Many farmers and growers rely on university agriculture departments to assess new technologies. In addition, university agriculture departments provide entry to local farmer cooperatives. Cooperatives generally consist of the larger growers in the area that pool their buying and selling resources. We believe that favorable test results from university agriculture departments will cause us to penetrate the local market.\n■ Expand to other geographical regions in the US. We will attempt to replicate these efforts in other agricultural regions in the United States, with a particular emphasis on those regions that have longer growing seasons found in southern states, particularly Florida and western states, particularly, California and Arizona.\nArrangement with Pietro Industries Inc.\nOn August 8, 2021, the Company signed Joint and Evaluation Agreement with Pietro Industries Inc. for the purpose of jointly testing, evaluating and optimizing various technologies and process to verify the feasibility of mushroom stump processing at a commercial scale. The parties also signed an agreement allowing the Company to use the premises at 523 School House Rd., Kennett Square, PA 19348 in connection with the Joint and Evaluation Agreement. On September 18, 2021 but effective August 28, 2021, the Company and Pietro signed a termination agreement which ended the Office Space Using Agreement and Joint Testing and Evaluation Agreement. On that same date, Pietro agreed to allow the Company to use 1,000 square feet at its premises month to month on a rent free basis.\nRecent Events.\nIn January 2022, the Company began collaborating with a Chinese plasma company to determine the effectiveness of the Companys cold plasma technology in reducing common chemicals and pesticides used in growing herbs in China. In March 2022, the Company conducted tests using its technology on several Chinese herbs supplied by the Chinese company (Initial Test) and the processed herbs were then shipped back to the Chinese company. The Chinese company tested the processed herbs and informed the Company the processed herbs had a substantial reduction in the chemicals and pesticides.\nFollowing the Initial Test, in August and September 2022, the Chinese company sent an additional 10 herbs for processing. The Company expects to complete the processing during November 2022. It has required that the Chinese company a complete chemical analysis of the herbs pre and post treatment. In addition, in October 2022, the Company entered into an agreement with the Chinese plasma company to further explore the use of the technology for Chinese herbs and teas. Under the agreement, the parties will attempt to mutually agree on the testing protocols and the equipment design for a new plasma plant. If the parties reach an agreement on such plans, the Chinese company will pay the company the sum of $10,000 as an upfront fee. In addition, the Chinese company will pay for all costs associated with the design, assembly and production of the new plasma plant. Once the plant is operational, the Company will be entitled to receive 20% of all service fees received by the Chinese company for the treatment of herbs using the technology.\nCompetition and Our Competitive Strengths.\nWhile the Company believes that there is no similar commercialized application of cold plasma for plant and crop seeds, it believes that it nonetheless will face competition in the agriculture market from other products, such as biologic products. Agricultural biologicals are a diverse group of products derived from naturally occurring microorganisms, plant extracts, beneficial insects or other organic matter. They are seed treatment systems that are derived from natural materials like plant extracts to improve the crop yield and ensures nutrient growth of the plant. They also are the substitutes of harmful chemicals that damage the environment. Agricultural biologicals are not only eco- friendly but also helps the farmers to grow healthier and nutritious food. Agricultural biologicals are used to replace the chemicals in farming to prevent the crops from diseases, weeds etc. to maintain crop health. Multiple companies are working for the development of highly performing agricultural products such as pesticides and fertilizers.\nThey are typically broken down into two or three major categories according to their use in agriculture:\n● Biostimulants (plant growth/productivity enhancement products),\n● Biopesticides (plant protection or biocontrol products), and\n● Biofertility (plant nutrition products).\nHowever these products are generally one use specific, meaning these products can treat one specific type of disease. In addition, they are significantly more expensive than conventional fertilizer and pesticides.\nKey players operating in global agricultural biologicals market include BASF SE(Germany), Vegalab S.A.(US), Isagro S.P.A.(Italy), Evogene Ltd(Israel), Syngenta Crop Protection AG(Switzerland), Marrone Bio Innovations(US), UPL(India), Bayer AG(Germany), Valent Biosciences, Lallemand Inc., Koppert Biological Systems, Valagro S.P.A., Novozymes, CBF China Biofertilizers AG, Biolchim SPA, Symborg, Bienvenido, Andermatt Biocontrol AG, Verdesian Life Sciences., SEIPASA, Biobest Group NV, The DOW Chemical Company, Arysta Lifescience Limited, Certis USA LLC.\nRegulatory Matters\nAs mentioned hereinabove, the unit operates under low vacuum, so any emissions are internally contained. Because the process involves no chemical reactions and no emissions, there are no requirement for federal/state/local approvals for our process or products, including any environmental approvals. Because low energy plasmas do require high voltage power supplies, we will conform to standard local safety measures and regulations.\nWe are unaware of and do not anticipate having to expend significant resources to comply with any governmental regulations. We are subject to the laws and regulations of those jurisdictions in which we plan to conduct our business, which are generally applicable to business operations, such as business licensing requirements, income taxes and payroll taxes. In general, the development and operation of our business is not subject to special regulatory and/or supervisory requirements.\nEmployees\nAs of the date of this Prospectus, we have no full time employees. Our officers and directors each will spend between 15 to 40 hours per week on the affairs of the Company, depending on the circumstances. However, each officer and director will have other business interest and thus, certain conflicts may arise from time to time regarding their allocation of time between the business of the Company and such other business interests. Currently, we have not entered into an employment agreement with any of our officers. The Company presently does not have pension, health, annuity, insurance, stock options, profit sharing or similar benefit plans; however, the Company may adopt plans in the future. During the next 3 to 12 months, we intend to hire an intern familiar with cold plasma to assist with our applications and a bookkeeper for our operations. Apart from that hire, management does not plan to hire additional employees at this time.\nProperties\nOur corporate offices are located at 523 School House Road, Kennett Square, PA 19348. The lease began on August 1, 2021, is month to month and is rent free. The principal of the lessor is a business associate of Mr. Yang.\nOur Intellectual Property.\nWe intend to file for patent protection in the United States on certain aspects of our technology involving the rationality of the working gas inlet and making the glow discharge more uniform. At the present time, we have not prepared the patent application. Any application filed will be for a utility invention patent. The term for a utility patent in the United States is 20 years. We have not made a determination whether we will file for patent protection in any foreign jurisdictions. We can not guarantee that we will receive a patent in the United States or elsewhere from any patent application.\nPresently, however, we do not have any patents protecting our technology. Instead, we rely on trade secrets and know-how using the process developed by our former director, Mr. Shao. There is no assurance that others will not independently develop the same or similar technology or obtain unauthorized access to our trade secrets, know-how and other unpatented technology. To protect our rights in these areas, we require all future employees that work on our premises to enter into strict confidentiality agreements. Presently, however, we have no paid employees. These agreements may not provide meaningful protection for our unpatented technology in the event of an unauthorized use, misappropriation or disclosure. While we have attempted to protect the unpatented proprietary technology that we develop or acquire, and will continue to attempt to protect future proprietary technology through patents, copyrights and trade secrets, we believe that our success will depend, to a large extent, upon continued innovation and technological expertise.\nIn general, the level of protection afforded by a patent is directly proportional to the ability of the patent owner to protect and enforce those rights through legal action. Since our financial resources are limited, and patent litigation can be both expensive and time consuming, there can be no assurance that we will be able to successfully prosecute an infringement claim in the event that a competitor develops a technology or introduces a product that infringes on one or more of our patents or patent applications. There can be no assurance that our competitors will not independently develop other technologies that render our proposed products obsolete. In general, we believe the best protection of our proprietary technology will come from market position, technical innovation, speed-to-market, and product performance. There is no assurance that we will realize any benefit from our intellectual property rights.\nProduct Liability.\nDue to nature of the Companys business, the Company may face claims for product liability resulting from the failure of its cold plasma technology. Presently, the Company does not maintain any product liability insurance to cover any claims for any process failures. Item 1A. Risk Factors\nSmaller reporting companies are not required to provide the information required by this Item 1A. Item 1B. Unresolved Staff Comments\nNone. Item 2. Properties\nThe Company does not own any real property. Our corporate offices are located at 523 School House Road, Kennett Square, PA 19348. The lease began on August 1, 2021, is month to month and is rent free. The principal of the lessor is a business associate of Mr. Yang. Item 3. Legal Proceedings\nThere are presently no pending legal proceedings to which the Company or any of its property is subject, or any material proceedings to which any director, officer or affiliate of the Company, any owner of record or beneficially of more than five percent of any class of voting securities is a party or has a material interest adverse to the Company, and no such proceedings are known to the Company to be threatened or contemplated against it. Item 4. Mine Safety Disclosures\nNone.\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nMarket Information\nWhile the Company is quoted on OTC Markets under the ticker symbol PMIN, there is no active trading in our common stock, and such may never develop.\nAuthorized Capital Stock\nOur authorized capital stock consists of 65,000,000 shares of common stock, $0.001 par value per share and 10,000,000 shares of preferred stock, $0.001 par value per share. As of the date of this annual report, there are 15,466,668 shares of our common stock issued and outstanding and no shares of preferred stock issued and outstanding.\nDividend Policy\nThe Company has not declared or paid any cash dividends on its Common Stock and does not intend to declare or pay any cash dividend in the foreseeable future. The payment of dividends, if any, is within the discretion of the Board of Directors and will depend on the Companys earnings, if any, its capital requirements and financial condition and such other factors as the Board of Directors may consider.\nSecurities Authorized for Issuance under Equity Compensation Plans\nThe Company does not have any equity compensation plans or any individual compensation arrangements with respect to its Common Stock or Preferred Stock. The issuance of any of our Common Stock or Preferred Stock is within the discretion of our Board of Directors, which has the power to issue any or all of our authorized but unissued shares without stockholder approval.\nRecent Sales of Unregistered Securities\nNone\nIssuer Purchases of Equity Securities\nNone. Item 6.\nSmaller reporting companies are not required to provide the information required by this Item 6. Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations\nCertain statements made in this report on Form 10-k are forward-looking statements regarding the plans and objectives of management for future operations. Such statements involve known and unknown risks, uncertainties, and other factors that may cause actual results, performance, or achievements of the registrant to be materially different from any future results, performance, or achievements expressed or implied by such forward-looking statements. The forward-looking statements included herein are based on current expectations that involve numerous risks and uncertainties. The Companys plans and objectives are based, in part, on assumptions involving the continued expansion of business. Assumptions relating to the foregoing involve judgments with respect to, among other things, future economic, competitive, and market conditions and future business decisions, all of which are difficult or impossible to predict accurately and many of which are beyond the control of the Company. Although the Company believes its assumptions underlying the forward-looking statements are reasonable, any of the assumptions could prove inaccurate and, therefore, there can be no assurance the forward-looking statements included in this report will prove to be accurate. In light of the significant uncertainties inherent in the forward-looking statements included herein, the inclusion of such information should not be regarded as a representation by the registrant or any other person that the objectives and plans of the registrant will be achieved.\nSubstantial risks exist with respect to an investment in the Company. These factors include, but are not limited to:\n● We have incurred significant losses and expect to incur future losses;\n● We have limited operating history and limited business growth;\n● Potential significant dilution resulting from the issuance of new securities for any funding, debt conversion or any business combination.\nDescription of Business\nPlasma Innovative Inc., a Nevada corporation, was incorporated on July 22, 2021. We are an emerging cold plasma application company. We intend to use our proprietary, cold plasma technology to treat crops and plant seeds for agriculture. We believe that treated seeds yield healthier and more productive plants and crops. Our former director has spent the last 16 years testing and developing this technology, which has been assigned to the Company.\nPlasma is called the fourth state of matter after gas, solid, and liquid. Sir William Crooks identified it in 1879. Plasma is roughly defined as a collection of equally positive and negative charge carriers and has zero total charge. Mr. Shao, our former director, had spent a number of years developing the application of cold plasma for the agriculture industry. In 2015, through his own internal testing, he discovered that cold plasma could interact with living organisms (biomolecules), thereby enabling living organisms (biomolecules) to obtain energy. Our process applies radio-frequency lighting supplied by the plasma source in a low-pressure vacuum environment to affect the seeds at the molecular level. As the plant life cycle develops from seed to yield-bearing plants, our internal tests have indicated that the plants are healthier, demonstrating superior qualities over conventional, untreated seeds.\nAlthough the favorable characteristics of our plasma process have been supported by our own internal testing, the results have not been corroborated by third-party, independent tests.\nAs the founder and key researcher Mr. Shao passed away, Management is rethinking of the Marketing strategy of our technologies and timeline to farmers, nurseries, and greenhouses close to our facilities in Pennsylvania and collaborate with agriculture departments at various universities to expand the business.\nRESULTS OF OPERATIONS\nFor the years ended August 31, 2023 and 2022, we did not recognize any revenues from operations.\nFor the years ended August 31, 2023 and 2022, we had a net loss from operations of $37,584 and $54,913, respectively, related to administrative expenses which consist primarily of professional fees.\nWe will continue to explore and advance the potential collaborations with agriculture departments of large universities within the State of Pennsylvania. We are hopeful that these universities will participate in the testing of our technology, which we believe will lead to a prospective client base of larger farmers greenhouses and nurseries in the area and state.\nNet Loss\nFor the years ended August 31, 2023 and 2022, the Company had a net loss of $37,584 and $54,913, respectively, for the reasons discussed above.\nLiquidity and Capital Resource\nThe Company had $45,449 and $82,773 in working capital as of August 31, 2023 and 2022, respectively.\nOur primary uses of cash have been for operations. The main sources of cash have been from the private placement of our common stock. The following trends are reasonably likely to result in a material decrease in our liquidity over the near to long term:\n☐ The need for additional equipment,\n☐ Development of a Company website,\n☐ Increases in advertising and marketing in order to attempt to generate more revenues, and\n☐ The cost of being a public company.\nOff-Balance Sheet Arrangements\nThe Company does not have any off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on the Companys financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures, or capital resources that is material to investors.\nContractual Obligations\nNone.\nItem 3. Quantitative and Qualitative Disclosures about Market Risk.\nAs a smaller reporting company as defined by Item 10 of Regulation S-K, the Company is not required to provide information required by this Item.\nItem 4. Controls and Procedures.\nEvaluation of Disclosure Controls and Procedures\nIn connection with the preparation of this annual report, an evaluation was carried out by the Companys management, with the participation of the principal executive officer, of the effectiveness of the Companys disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) under the Exchange Act (Exchange Act) as of August 31, 2023. Disclosure controls and procedures are designed to ensure that information required to be disclosed in reports filed or submitted under the Exchange Act is recorded, processed, summarized, and reported within the time periods specified in the Commissions rules and forms, and that such information is accumulated and communicated to management, including the principal executive officer, to allow timely decisions regarding required disclosures.\nBased on that evaluation, the Companys management concluded, as of the end of the period covered by this report, that the Companys disclosure controls and procedures were not effective in recording, processing, summarizing, and reporting information required to be disclosed, within the time periods specified in the Commissions rules and forms, and that such information was not accumulated and communicated to management, including the principal executive officer and the principal financial officer, to allow timely decisions regarding required disclosures.\nChange in Internal Control over Financial Reporting\nDuring the year ended August 31, 2023, there have been no changes in internal control over financial reporting that have materially affected or are reasonably likely to materially affect our internal control over financial reporting.\nReport of Independent Registered Public Accounting Firm\nTo the shareholders and the board of directors of Plasma Innovative Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheet of Plasma Innovative Inc. (the Company) as of August 31, 2023, the related statement of operations, stockholders equity (deficit), and cash flows for the year then ended, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of August 31, 2023, and the results of its operations and its cash flows for the year then ended, in conformity with accounting principles generally accepted in the United States.\nSubstantial Doubt about the Companys Ability to Continue as a Going Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 2 to the financial statements, the Companys significant operating losses raise substantial doubt about its ability to continue as a going concern. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audit provides a reasonable basis for our opinion.\n/s BF Borgers CPA PC\nBF Borgers CPA PC (PCAOB ID 5041)\nWe have served as the Companys auditor since 2023\nLakewood, CO\nOctober 27, 2023\nJACK SHAMA, CPA, MA\n1498 East 32nd Street\nBrooklyn, NY 11234\n631-318-0351\nTo the shareholders and the board of directors of Plasma Innovative Inc.\nReport of Independent Registered Public Accounting Firm.\nOpinion on the financial statements.\nI have audited the accompanying balance sheet of Plasma Innovative Inc. and the related statements of income, stockholders equity, cash flows, including the related notes and any related schedules for the years ended August 31, 2022, and August 31, 2021. In my opinion the financial statements present fairly in all material respects the financial position of the company as of August 31, 2022, and August 31, 2021 and the results of its operations and its cash flows for the years then ended in conformity with accounting principles generally accepted in the United States of America.\nGoing concern matters.\nThe accompanying financial statements have been prepared assuming that the company will continue as a going concern. As discussed in Note 2 to the financial statements, the company has incurred losses, and has an accumulated deficit which raises substantial doubt about its ability to continue as a going concern. Managements plans concerning these matters are also described in Note 2. The financial statements do not include any adjustments that might result from the outcome of this uncertainty\nBasis for opinion.\nThese financial statements are the responsibility of the companys management. My responsibility is to express an opinion on the financial statements based on my audit. I am a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the company in accordance with the US federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB. I conducted my audit in accordance with the standards of the PCAOB. Those standards require that I plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. My audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. I believe my audit provides a reasonable basis for my opinion.\nCritical audit matters.\nCritical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved my especially challenging, subjective, or complex judgments. I have determined that there are no critical audit matters to report.\nThe company is not required to have, nor was I engaged to perform, an audit of its internal control over financial reporting. As part of my audit, I am required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the companys internal control over financial reporting. Accordingly, I express no such opinion.\nJack Shama, CPA\nOctober 27, 2023\nI have served as the companys auditor since March 2022.\nFinancial Information\nItem 1. Financial Statements (Audited)\nPLASMA INNOVATIVE INC.\nBALANCE SHEET\n(AUDITED)\nAugust 31,\nAugust 31,\nASSETS\nCurrent Assets\nCash and cash equivalents $ 6,449 $ 86,139\nShort-term investments 40,000 -\nTotal Current Assets 46,449 86,139\nProperty, Plant and Equipment, net 1,029\nTotal Assets $ 47,218 $ 87,168\nLIABILITIES AND STOCKHOLDERS EQUITY\nCurrent liabilities\nAccount payable 1,000 3,366\nTotal Current Liabilities 1,000 3,366\nTotal Liabilities 1,000 3,366\nStockholders Equity\nPreferred stock, par value $0.001; 10,000,000 shares authorized; 0 shares issued and outstanding - -\nCommon stock, par value $0.001; 65,000,000 shares authorized, 15,466,668 shares issued and outstanding 15,467 15,467\nAdditional paid in capital 124,700 124,700\nAccumulated deficit (93,949 ) (56,365 )\nTotal Stockholders Equity 46,218 83,802\nTotal Liabilities and Stockholders Equity $ 47,218 $ 87,168\nSee accompanying notes to the financial statements.\nPLASMA INNOVATIVE INC.\nSTATEMENT OF OPERATIONS\n(AUDITED)\nAugust 31,\nAugust 31,\nOperating expenses\nGeneral and administrative expenses $ 37,855 $ 54,953\nTotal operating expenses 37,855 54,953\nNet Loss from operations (37,855 ) (54,953 )\nInterest income\nLoss before income tax (37,584 ) (54,913 )\nProvision for income taxes - -\nNet loss (37,584 ) (54,913 )\nNet Loss Per Share: Basic and Diluted $ (0.00 ) $ (0.00 )\nWeighted Average Number of Shares Outstanding: Basic and Diluted 15,466,668 15,466,668\nSee accompanying notes to the financial statements.\nPLASMA INNOVATIVE INC.\nSTATEMENT OF CHANGES IN STOCKHOLDERS EQUITY\n(AUDITED)\nFor the year ended August 31, 2023 and 2022\nAdditional Accumulated Total\nCommon Stock Paid-in\nStockholders\nShares Amount Capital Deficit Equity\nBalance, August 31, 2021 15,355,556 $ 15,356 $ 124,700 $ (1,452 ) $ 138,604\nNet Loss - - - (54,913 ) (54,913 )\nShares issued for intangible assets at 0.001 per share on January 16, 2022 111,112 - -\nBalance, August 31, 2022 15,466,668 15,467 124,700 (56,365 ) 83,802\nNet loss - - - (37,584 ) (37,584 )\nBalance, August 31, 2023 15,466,668 $ 15,467 $ 124,700 $ (93,949 ) $ 46,218\nSee accompanying notes to the financial statements.\nPLASMA INNOVATIVE INC.\nSTATEMENT OF CASH FLOWS\n(AUDITED)\nAugust 31,\nAugust 31,\nCASH FLOWS FROM OPERATING ACTIVITIES:\nNet loss for the period $ (37,584 ) $ (54,913 )\nAdjustments to reconcile net loss to net cash provided by operating activities:\nShares issued for Director compensations -\nAccount payable increase (2,366 ) 3,366\nDepreciation expense\nPrepaid expense decrease - 11,000\nNet Cash Used in Operating Activities (39,690 ) (40,176 )\nCASH FLOWS FROM INVESTING ACTIVITIES:\nInvestment in short-term investments (40,000 ) -\nPurchase of property, plant, and equipment - (1,289 )\nNet Cash used in Investing Activities (40,000 ) (1,289 )\nNET DECREASE IN CASH (79,690 ) (41,465 )\nCash, beginning of the year 86,139 127,604\nCash, end of the year $ 6,449 $ 86,139\nSUPPLEMENTAL CASH FLOW INFORMATION:\nCash paid for interest $ - $ -\nCash paid for income tax $ - $ -\nNON-CASH FINANCING AND IVESTING ACTIVITIES:\nCommon stock issued for services $ - $ 111\nSee accompanying notes to the financial statements.\nPLASMA INNOVATIVE INC.\nNOTES TO FINANCIAL STATEMENTS\nNOTE 1 - ORGANIZATION AND NATURE OF BUSINESS\nPlasma Innovative Inc. (the Company, we, us or our) was incorporated on July 22, 2021, under the law of the State of Nevada for the purpose of researching, developing, designing, manufacturing, and distributing cold plasma equipment for application in the agriculture industry.\nNOTE 2 - GOING CONCERN\nThe accompanying financial statements were prepared assuming the Company will continue as a going concern, which contemplates continuity of operations, realization of assets, and liquidation of liabilities in the normal course of business. The Company had a net loss of $37,584 and $54,913 for the year ended August 31, 2023 and 2022, respectively. Accumulated deficit was $93,949 and $56,365 at the end of December 31, 2023 and 2022, respectively. The historical operating results indicate the Company has recurring losses from operations which raise substantial doubt about the Companys ability to continue as a going concern.\nNOTE 3 - BASIS OF PRESENTATION AND SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBasis of Presentation\nThe accompanying financial statements have been prepared in accordance with generally accepted accounting principles in the United States of America.\nUse of Estimates\nThe preparation of financial statements in conformity with generally accepted accounting principles requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date the financial statements and the reported amount of revenues and expenses during the reporting period. Although these estimates are based on managements knowledge of current events and actions management may undertake in the future, actual results may ultimately differ from those estimates and such differences may be material to our consolidated financial statements.\nCash and Short-term investments\nThe Company considers all short-term, highly liquid investments, including certificates of deposit (CDs) purchased with an original maturity of three months or less at the date of purchase, to be cash equivalents.\nThe Company classifies its certificates of deposit as cash and cash equivalents or short-term investments and reassesses the appropriateness of the classification of its investments at the end of each reporting period. Certificates of deposit held for investment with an original maturity greater than three months are carried at amortized cost and reported as short-term investments on the consolidated balance sheets.\nThe Company had $6,449 and $86,139 of cash as of August 31, 2023 and 2022, respectively. As of August 31, 2023, the Company had $40,000 in certificates of deposit (CD). These cash deposits are deposited at a bank that is a member of the Certificate of Deposit Account Registry Service (CDARS), will be mature at January 13, 2024. The Company had no CDs at the end of August 31, 2022.\nProperty and Equipment\nProperty and equipment are stated at cost, less accumulated depreciation. Major repairs and improvements that significantly extend original useful lives or improve productivity are capitalized and depreciated over the period benefited. Maintenance and repairs are expensed as incurred. When property and equipment are retired or otherwise disposed of, the related cost and accumulated depreciation are removed from the respective accounts, and any gain or loss is included in operations.\nThe Company had property and equipment of $769 and $1,029 as of August 31, 2023 and 2022, respectively.\nDepreciation, Amortization, and Capitalization\nThe Company records depreciation and amortization when appropriate using straight-line balance method over the estimated useful life of the assets. The Company establishes a capitalization policy for its assets based on the dollar amount that is more than $1,000 in value or if its estimated useful life exceeds one year.\nThe Company had depreciation expense of $260 and $260 for the year ended August 31, 2023 and 2022, respectively.\nFair Value of Financial Instruments\nASC Topic 820 Fair Value Measurements and Disclosures establishes a three-tier value hierarchy, which prioritizes the inputs in measuring fair value. The hierarchy prioritizes the inputs into three levels based on the extent to which inputs used in measuring fair value are observable in the market.\nThese tiers include:\nLevel 1: defined as observable inputs such as quoted prices in active markets.\nLevel 2: defined as inputs other than quoted prices in active markets that are either directly or indirectly observable; and\nLevel 3: defined as unobservable inputs in which little or no market data exists, therefore requiring an entity to develop its own assumptions.\nImpairment of Long-lived Assets\nIn accordance with FASB ASC 360-10, Accounting for the Impairment or Disposal of Long-lived Assets, long-lived assets such as property and equipment are reviewed for impairment whenever events or changes in circumstances indicate that the carrying value of an asset may not be recoverable, or it is reasonably possible that these assets could become impaired as a result of technological or other changes. The determination of recoverability of assets to be held and used is made by comparing the carrying amount of an asset to future undiscounted cash flow to be generated by the asset.\nIncome Taxes\nIncome taxes are computed using the asset and liability method. Under the asset and liability method, deferred income tax assets and liabilities are determined based on the differences between the financial reporting and tax bases of assets and liabilities and are measured using the currently enacted tax rates and law. A valuation allowance is provided for the amount of deferred tax assets that, based on available evidence, are not expected to be realized.\nComprehensive Income\nComprehensive income is defined as all changes in stockholders equity (deficit), exclusive of transactions with owners, such as capital investments. Compressive income includes net income or loss, changes in certain assets, and liabilities that are reported directly in equity such as translation adjustments on investments. In foreign subsidiaries and unrealized gains (losses) on available-for-sale securities. As of August 31, 2023, there were no differences between our comprehensive loss and net loss.\nBasic Income (Loss) Per Share\nThe Company computes income (loss) per share in accordance with FASB ASC 260 Earnings per Share. Basic loss per share is computed by dividing net income (loss) available to common shareholders by the weighted average number of outstanding shares during the period. Diluted income (loss) per share gives effect to all dilutive potential common shares outstanding during the period. Dilutive loss per share excludes all potential common shares if their effects is anti-dilutive. As of August 31, 2023, there were no potentially dilutive debt or equity instruments issued or outstanding.\nRecent Accounting Pronouncements\nAs of August 31, 2023, and for the period then ended, there were no recently adopted accounting standards that had a material impact on the Companys financial statements. There were no recently issued accounting standards not yet adopted which would have a material effect on the Companys financial statements.\nNOTE 4 - COMMITMENTS AND CONTINGENCIES\nOn August 8, 2021, the Company entered into an Office Space Using Agreement with Pietro Industries Inc. (Pietro) for its office building located in 523 School House Road, Kennett Square, PA 19348. The agreement was to terminate on July 31, 2022.\nOn September 18, 2021, but effective August 28, 2021, the Company and Pietro signed a termination agreement which effectively terminated the Office Space Using Agreement, and a separate Joint Testing and Evaluation Agreement are terminated and no longer in force or effect. On that same date, Pietro agreed to allow the Company to use 1,000 square feet at its premises month to month on a rent-free basis.\nNOTE 5 - COMMON STOCK\nThe Company has 75,000,000 shares of stock authorized, including 65,000,000 common stock, $0.001 par value per share and 10,000,000 preferred stocks, $0.001 par value per share. There were 15,466,668 shares of common stock issued and outstanding as of August 31, 2023.\nOn August 6, 2021, the Company entered into the Technology Assignment Agreement with Hanliang Shao, a former director of the Company. Pursuant to the agreement, Mr. Saho conveyed to the Company all his rights, titles and interests in and to three separate technologies. In exchange, Mr. Shao will earn 4,000,000 shares of Companys common stock upon the filing of a patent with the US Patent and Trademark Office (USPTO). In addition, Mr. Shao shall be entitled to receive a total of 2,000,000 additional shares of Company common stock issuable monthly over a three (3) year period beginning with the month of August 2021 (Term) at the rate of 55,556 shares per month, except in final month, the amount will be 55,540, provided that during the Term, the assignee does not breach the confidentiality and non-compete covenants contained in the agreement. Mr. Shao has entitled 111,112 shares of common stock at $0.001 par value under the agreement for the months of September 2021 and October 2021, which were issued in January 2022 at a value of $111. Mr. Shao passed away on November 20, 2021. On December 20, 2021, the Company entered into a Continuation of Technology Assignment Agreement with Ping Wu, Tian Yang, Jun Shao, Yu Shao, Chunni Shao, and Dongni Shao (collectively, the Shao Heirs). Pursuant to this agreement, Mr. Tian Yang was appointed by the Shao Heirs to be the recipient and record holder of the Earned Shares and remaining Shares (as defined in the original Technology Assignment Agreement).\nNOTE 6 - INCOME TAX\nThe Company is subject to U.S. income tax rate of 21% and files U.S. federal income tax return. As of August 31, 2023 and 2022, the U.S. entity had net operating loss (NOL) carry forwards for income tax purposes of $37,584 and $56,365. The NOL arising in tax years beginning after 2017 may reduce 80% of a taxpayers taxable income, and be carried forward indefinitely. However, the Coronavirus Aid, Relief and Economic Security Act (the CARES Act) passed in March 2020, provides tax relief to both corporate and noncorporate taxpayers by adding a five-year carryback period and temporarily repealing the 80% limitation for NOLs arising in 2018, 2019 and 2020. Management believes the realization of benefits from these losses remains uncertain due to the parent Companys limited operating history and continuing losses. Accordingly, a 100% deferred tax asset valuation allowance was provided.\nThe following table reconciles the U.S. statutory rate to the Companys effective tax rates for the year ended August 31, 2023 and 2022:\nSchedule of effective tax rates\nUS federal statutory rates (21 %) (21 %)\nChange in valuation allowance 21 % 21 %\nEffective tax rate $ - $ -\nThe provision for income tax expense (benefit) for the years ended August 31, 2023 and 2022 consisted of the following:\nSchedule of income tax expense (benefit)\nIncome tax expense - current $ - $ -\nIncome tax benefit - deferred 7,893 11,532\nIncrease in valuation allowance (7,893 ) (11,532 )\nTotal income tax expense $ - $ -\nThe Companys net deferred tax assets as of August 31, 2023 and 2022 are as follows:\nSchedule of net deferred tax assets\nDeferred tax asset\nNet operating loss $ 19,729 $ 11,836\nLess: valuation allowance (19,729 ) (11,836 )\nNet Deferred tax asset $ - $ -\nNOTE 7 - SUBSEQUENT EVENTS\nIn accordance with SFAS 165 (ASSC 855-10) the Company has analyzed its operations subsequent to August 31, 2023 to the date these financial statements were issued, and has determined that it does not have any material subsequent events to disclose in these financial statements.\nItem 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone.\nItem 9A. Controls and Procedures\nEvaluation of Disclosure Controls and Procedures\nIn connection with the preparation of this annual report, an evaluation was carried out by the Companys management, with the participation of the principal executive officer and the principal financial officer, of the effectiveness of the Companys disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) under the Exchange Act (Exchange Act) as of August 31, 2023. Disclosure controls and procedures are designed to ensure that information required to be disclosed in reports filed or submitted under the Exchange Act is recorded, processed, summarized, and reported within the time periods specified in the Commissions rules and forms, and that such information is accumulated and communicated to management, including the principal executive officer and the principal financial officer, to allow timely decisions regarding required disclosures.\nBased on that evaluation, the Companys management concluded, as of the end of the period covered by this report, that the Companys disclosure controls and procedures were not effective in recording, processing, summarizing, and reporting information required to be disclosed, within the time periods specified in the Commissions rules and forms, and that such information was not accumulated and communicated to management, including the principal executive officer and the principal financial officer, to allow timely decisions regarding required disclosures.\nManagements Report on Internal Control over Financial Reporting\nThe management of the Company is responsible for establishing and maintaining adequate internal control over financial reporting. The Companys internal control over financial reporting is a process, under the supervision of the principal executive officer and the principal financial officer, designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of the Companys financial statements for external purposes in accordance with United States generally accepted accounting principles (GAAP). Internal control over financial reporting includes those policies and procedures that:\n● Pertain to the maintenance of records that in reasonable detail accurately and fairly reflect the transactions and dispositions of the Companys assets;\n● Provide reasonable assurance that transactions are recorded as necessary to permit preparation of the financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures are being made only in accordance with authorizations of management and the board of directors; and\n● Provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the Companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions or that the degree of compliance with the policies or procedures may deteriorate.\nThe Companys management conducted an assessment of the effectiveness of our internal control over financial reporting as of August 31, 2023, based on criteria established in Internal Control - Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013) as set forth in its Internal Control - Integrated Framework. This assessment identified material weaknesses in internal control over financial reporting. A material weakness is a control deficiency, or a combination of deficiencies in internal control over financial reporting that creates a reasonable possibility that a material misstatement in annual or interim financial statements will not be prevented or detected on a timely basis. Since the assessment of the effectiveness of our internal control over financial reporting did identify a material weakness, management considers its internal control over financial reporting to be ineffective.\nManagement has concluded that our internal control over financial reporting had the following material deficiencies:\n● We were unable to maintain segregation of duties within our business operations due to our reliance on a single individual fulfilling the role of sole officer and director.\n● Lack of a functioning audit committee due to a lack of a majority of independent members and a lack of a majority of outside directors on our Board of Directors, resulting in ineffective oversight in the establishment and monitoring of required internal control and procedures.\nThese control deficiencies to our 2023 interim or annual financial statements could have resulted in a material misstatement that might have been prevented or detected by a segregation of duties. Accordingly, we have determined that this control deficiency constitutes a material weakness.\nTo the extent reasonably possible, given our limited resources, our goal is, upon consummation of a merger with a private operating company, to separate the responsibilities of principal executive officer and principal financial officer, intending to rely on two or more individuals. We will also seek to expand our current board of directors to include additional individuals willing to perform directorial functions. Since the recited remedial actions will require that we hire or engage additional personnel, this material weakness may not be overcome in the near term due to our limited financial resources. Until such remedial actions can be realized, we will continue to rely on the advice of outside professionals and consultants.\nThis annual report does not include an attestation report of our registered public accounting firm regarding our internal controls over financial reporting. Managements report was not subject to attestation by our registered public accounting firm pursuant to Section 404(c) of the Sarbanes-Oxley Act that permit us to provide only managements report in this annual report.\nChanges in Internal Controls over Financial Reporting\nDuring the year ended August 31, 2023, other than the change in ownership, there has been no change in internal control over financial reporting that has materially affected or is reasonably likely to materially affect our internal control over financial reporting.\nItem 9B. Other Information\nNone\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections.\nNot applicable.\nPART III\nItem 10. Directors, Executive Officers and Corporate Governance\nThe following table sets forth the name, age, and position of sole executive officers and directors. Executive officers are elected annually by our Board of Directors. Each executive officer holds his office until he resigns, is removed by the Board, or his successor is elected and qualified. Directors are elected annually by our stockholders at the annual meeting. Each director holds his office until his successor is elected and qualified or his earlier resignation or removal.\nNAME\nAGE\nPOSITION\nZhi Yang\nChairman and Chief Executive Officer\nZhi Yang has been our Chairman of the Board and Director since inception (July 22, 2021). For the past 5 years, Mr. Yang has been a business consultant and more recently, in 2017, he founded a mushroom growing company in the Peoples Republic of China (PRC). Mr. Yang received an Master Degree in Law from China University of Political Science and Law (PRC) and received a LLM in Law from Temple University. Mr. Yang is a founder of the Company brings a wide range of business experience to our board of directors.\nFamily Relationships\nThere are no family relationships among our directors or officers.\nInvolvement in Legal Proceedings\nTo the best of our knowledge, none of our directors or executive officers, during the past ten years, has been convicted in a criminal proceeding, excluding traffic violations or similar misdemeanors, or has been a party to any judicial or administrative proceeding during the past five years that resulted in a judgment, decree or final order enjoining the person from future violations of, or prohibiting activities subject to, federal or state securities laws, or a finding of any violation of federal or state securities laws, except for matters that were dismissed without sanction or settlement. Except as set forth in our discussion below in Certain Relationships and Related Transactions, none of our directors, director nominees or executive officers has been involved in any transactions with us or any of our directors, executive officers, affiliates or associates which are required to be disclosed pursuant to the rules and regulations of the Securities and Exchange Commission.\nDirector Independence\nOur Board of Directors is currently composed of one member, whom does not qualify as an independent director in accordance with the published listing requirements of the NASDAQ Global Market (the Company has no plans to list on the NASDAQ Global Market). The NASDAQ independence definition includes a series of objective tests, such as that the directors are not, and have not been for at least three years, one of our employees and that neither the Director, nor any of their family members have engaged in various types of business dealings with us. In addition, our board of directors has not made a subjective determination as to our director that no relationship exist which, in the opinion of our board of directors, would interfere with the exercise of independent judgment in carrying out the responsibilities of a director, though such subjective determination is required by the NASDAQ rules. Had our board of directors made these determinations, our board of directors would have reviewed and discussed information provided by our director and us with regard to our directors business and personal activities and relationships as they may relate to us and our management.\nCode of Ethics\nWe currently do not have a code of ethics that applies to our officers, employees and directors, including our Chief Executive Officer and Chief Financial Officer; however, we intend to adopt one in the near future.\nConflicts of Interest\nSince we do not have an audit or compensation committee comprised of independent directors, the functions that would have been performed by such committees are performed by our directors. The Board of Directors has not established an audit committee and does not have an audit committee financial expert, nor has the Board established a nominating committee. The Board is of the opinion that such committees are not necessary since the Company is an early-stage company, and to date, such directors have been performing the functions of such committees. Thus, there is a potential conflict of interest in that our Directors and Officers have the authority to determine issues concerning management compensation, nominations, and audit issues that may affect management decisions.\nIn addition, our Officers have committed to spend a sufficient amount of time and attention to the affairs of the Company to fulfill their respective officer responsibilities. In this regard, generally, each officer or director will spend between 15 to 40 hours per week on the affairs of the Company, depending on the circumstances. Therefore, we may face conflicts of interest between the time and attention each officer or director devotes to the Company and that of their other business interests.\nOther than as described above, we are not aware of any other conflicts of interest of our executive Officers and Directors.\nInvolvement in Certain Legal Proceedings\nThere are no legal proceedings that have occurred since our incorporation concerning our Officers or Directors, or control persons which involved a criminal conviction, a criminal proceeding, an administrative or civil proceeding limiting ones participation in the securities or banking industries, or a finding of securities or commodities law violations.\nOur Officers and Directors have not received monetary compensation since our inception to the date of this prospectus. We currently do not pay any compensation to our Directors serving on our Board of Directors.\nItem 11. Executive Compensation\nSummary Executive Compensation Table\nThe following table reflects the Summary Compensation for our named executive officer for fiscal years ended August 31, 2022 and 2021, respectively. For such periods, there were no bonus, non-equity plan compensation, nonqualified compensation earnings or other compensation other than as stated below for the named executive officers.\nName and principal position (a) Year Salary\n($) Stock Awards\nShares\n($) Total\n($)\nZhi Yang 0\nChief Executive Officer and 0\nChief Financial Officer\nEmployment Agreements\nThe Company does not have any employment or other compensation agreement with its executive officers. Moreover, there are no agreements or understandings for any of our executive officers or directors to resign at the request of another person and no officer or director is acting on behalf of nor will any of them act at the direction of any other person.\nGrants of Plan-Based Awards\nNo plan-based awards were granted to any of our named executive officers during the interim fiscal year ended August 31, 2023.\nOutstanding Equity Awards at Interim Fiscal Year End\nNo stock or stock option awards were granted to any other officer of the Company as at August 31, 2023.\nOption Exercises and Stock Vested\nNo option to purchase our capital stock was exercised by any of our named executive officers, nor was any restricted stock held by such executive officers vested during the interim fiscal period ended August 31, 2023.\nPension Benefits\nNo named executive officers received or held pension benefits during the interim fiscal period ended August 31, 2023.\nItem 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nThe following table sets forth certain information, as of the date hereof, with respect to the beneficial ownership of the outstanding common stock by (i) any holder of more than five percent (5%); (ii) each of our executive officers and directors; and (iii) our directors and executive officers as a group. Except as otherwise indicated, each of the stockholders listed below has sole voting and investment power over the shares beneficially owned. The information is based on 15,466,668 shares of common stock issued and outstanding as of this date.\nName and Address of Amount and\nNature of\nBeneficial Percent of\nBeneficial Owner Ownership (1) Class\nZhi Yang (2)\nChairman of Board and Chief Executive Officer 14,000,000 90.52 %\nAll officers and directors as a group (1 person) 14,000,000 90.52 %\n(1) Beneficial Ownership is determined in accordance with the rules of the SEC and generally includes voting or investment power with respect to securities. Each of the beneficial owners listed above has ownership of and voting power and investment power with respect to our Common Stock. For each beneficial owner above, any options or rights exercisable or receivable within 60 days have been included in the denominator.\n(2) The address of each shareholder is the address of the Company.\nItem 13. Certain Relationships and Related Transactions, and Director Independence.\nOn July 22, 2021, we issued a total of 14,000,000 shares of common stock to Mr. Yang for the sum of $10,000, the development of our business plan and the formation of our company. Mr. Yang is our Chief Executive Officer, Chairman and founder.\nOn August 6, 2021, we entered into the Technology Assignment Agreement with Mr. Shao, our former director. Pursuant to the agreement, Mr. Shao conveyed to us all of rights, titles and interests in and to three separate technologies. In exchange, Mr. Shao will earn 4,000,000 shares of our common stock upon the filing of a patent for the three technologies with the US Patent and Trademark Office (USPTO). In addition, Mr. Shao shall be entitled to receive a total of 2,000,000 additional shares of our common stock issuable monthly over a three (3) year period beginning with the month of August 2021 (Term) at the rate of 55,556 shares per month (except in final month, the amount shall be 55,540), provided that during the Term, he does not breach the confidentiality and non-compete covenants contained in the agreement. Mr. Shao was entitled 111,112 shares of common stock at $0.001 par value under the agreement for the months of September 2021 and October 2021, which were issued in January 2022 at a value of $111. Mr. Shao passed away on November 20, 2021. On December 20, 2021, the Company entered into a Continuation of Technology Assignment Agreement with Ping Wu, Tian Yang, Jun Shao, Yu Shao, Chunni Shao, and Dongni Shao (collectively, the Shao Heirs). Pursuant to this agreement, Mr. Tian Yang was appointed by the Shao Heirs to be the recipient and record holder of the shares of common stock issuable under the Technology Assignment Agreement.\nOn September 8, 2021, Zhi Yang, our founder and Chairman, provided us with a written support letter, whereby he promised to loan us up to $200,000 as necessary to cover our operating costs. Interest on any loan will accrue at the rate of 3% per annum and this promise to loan was extended for one year on June 30, 2023. Additional loan terms, if any, will be established at the time of the loan.\nOther than stated above, none of the following persons has any direct or indirect material interest in any transaction to which we are a party since inception or in any proposed transaction to which we are proposed to be a party which in either case of $50,000 (or 1% of the average of the Companys assets for the past 2 fiscal years):\n● Any of our directors or officers;\n● Any proposed nominee for election as our director;\n● Any person who beneficially owns or directly or indirectly, shares carrying more than 10% of the voting rights attached to our shares;\n● Any relative or spouse of any of the foregoing persons, or any relative of such spouse, who has the same house as such person or who is a director or officer of any parent or subsidiary of our company.\nOur Common Stock is quoted on OTC Markets. In determining whether our directors are independent, we refer to NASDAQ Stock Market Rule 4200(a) (15) which indicates that a director is not considered to be independent if he or she also is an executive officer or employee of the corporation. Based on those widely-accepted criteria, we have determined that our sole director, Zhi Yang, is not independent as he also serves as the sole officer of the Company.\nItem 14. Principal Accountant Fees and Services.\nBF Borgers CPA PC is the Companys current independent registered public accounting firm.\n(1) Audit Fees\nThe aggregate fees billed for each of the last two fiscal years for professional services rendered by the principal accountant for our audit of annual financial statements and review of financial statements included in our quarterly reports or services that are normally provided by the accountant in connection with statutory and regulatory filings or engagements for those fiscal years were:\n$ 9,000\n$ 5,000\n(2) Audit-Related Fees\nThe aggregate fees billed in each of the last two fiscal years for assurance and related services by the principal accountants that are reasonably related to the performance of the audit or review of our financial statements and are not reported in the preceding paragraph:\n$\n$\n(3) Tax Fees\nThe aggregate fees billed in each of the last two fiscal years for professional services rendered by the principal accountant for tax compliance, tax advice, and tax planning were:\n$\n$\n(4) All Other Fees\nThe aggregate fees billed in each of the last two fiscal years for the products and services provided by the principal accountant, other than the services reported in paragraphs (1), (2), and (3) were:\n$\n$\nThe percentage of hours expended on the principal accountants engagement to audit our financial statements for the most recent fiscal year that were attributed to work performed by persons other than the principal accountants full time, permanent employees was 0%.\nAudit Committees Pre-Approval Process\nThe Board of Directors acts as the audit committee of the Company, and accordingly, all services are approved by all the members of the Board of Directors.\nItem 15. Exhibits, Financial Statement Schedules.\n(b) Index to Exhibits required by Item 601 of Regulation S-K.\nExhibit\nDescription\n31.1\nCertification of the Principal Executive and Financial Officer pursuant to Rule 13(a)-14(a) of the Securities Exchange Act of 1934+\n32.1\nCertification of the Companys Principal Executive Officer and Principal Financial pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002+\n101.INS\nXBRL INSTANCE DOCUMENT*\n101.SCH\nXBRL TAXONOMY EXTENSION SCHEMA DOCUMENT*\n101.CAL\nXBRL TAXONOMY CALCULATION LINKBASE DOCUMENT*\n101.DEF\nXBRL TAXONOMY DEFINITION LINKBASE DOCUMENT*\n101.LAB\nXBRL TAXONOMY LABEL LINKBASE DOCUMENT*\n101.PRE\nXBRL TAXONOMY PRESENTATION LINKBASE DOCUMENT*\n+ In accordance with SEC Release 33-8238, Exhibit 32.1 is being furnished and not filed.\nItem 16. Form 10-K Summary.\nAs permitted, the registrant has elected not to supply a summary of information required by Form 10-K.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nPlasma Innovative Inc.\n/s/ Zhi Yang\nZhi Yang\nChief Executive Officer\n(Principal Executive Officer)\nChief Financial Officer\n(Principal Financial and Accounting Officer)\nChairman\nDated: October 30, 2023   Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone. Item 9A. Controls and Procedures\nEvaluation of Disclosure Controls and Procedures\nIn connection with the preparation of this annual report, an evaluation was carried out by the Companys management, with the participation of the principal executive officer and the principal financial officer, of the effectiveness of the Companys disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) under the Exchange Act (Exchange Act) as of August 31, 2023. Disclosure controls and procedures are designed to ensure that information required to be disclosed in reports filed or submitted under the Exchange Act is recorded, processed, summarized, and reported within the time periods specified in the Commissions rules and forms, and that such information is accumulated and communicated to management, including the principal executive officer and the principal financial officer, to allow timely decisions regarding required disclosures.\nBased on that evaluation, the Companys management concluded, as of the end of the period covered by this report, that the Companys disclosure controls and procedures were not effective in recording, processing, summarizing, and reporting information required to be disclosed, within the time periods specified in the Commissions rules and forms, and that such information was not accumulated and communicated to management, including the principal executive officer and the principal financial officer, to allow timely decisions regarding required disclosures.\nManagements Report on Internal Control over Financial Reporting\nThe management of the Company is responsible for establishing and maintaining adequate internal control over financial reporting. The Companys internal control over financial reporting is a process, under the supervision of the principal executive officer and the principal financial officer, designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of the Companys financial statements for external purposes in accordance with United States generally accepted accounting principles (GAAP). Internal control over financial reporting includes those policies and procedures that:\n● Pertain to the maintenance of records that in reasonable detail accurately and fairly reflect the transactions and dispositions of the Companys assets;\n● Provide reasonable assurance that transactions are recorded as necessary to permit preparation of the financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures are being made only in accordance with authorizations of management and the board of directors; and\n● Provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the Companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions or that the degree of compliance with the policies or procedures may deteriorate.\nThe Companys management conducted an assessment of the effectiveness of our internal control over financial reporting as of August 31, 2023, based on criteria established in Internal Control - Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013) as set forth in its Internal Control - Integrated Framework. This assessment identified material weaknesses in internal control over financial reporting. A material weakness is a control deficiency, or a combination of deficiencies in internal control over financial reporting that creates a reasonable possibility that a material misstatement in annual or interim financial statements will not be prevented or detected on a timely basis. Since the assessment of the effectiveness of our internal control over financial reporting did identify a material weakness, management considers its internal control over financial reporting to be ineffective.\nManagement has concluded that our internal control over financial reporting had the following material deficiencies:\n● We were unable to maintain segregation of duties within our business operations due to our reliance on a single individual fulfilling the role of sole officer and director.\n● Lack of a functioning audit committee due to a lack of a majority of independent members and a lack of a majority of outside directors on our Board of Directors, resulting in ineffective oversight in the establishment and monitoring of required internal control and procedures.\nThese control deficiencies to our 2023 interim or annual financial statements could have resulted in a material misstatement that might have been prevented or detected by a segregation of duties. Accordingly, we have determined that this control deficiency constitutes a material weakness.\nTo the extent reasonably possible, given our limited resources, our goal is, upon consummation of a merger with a private operating company, to separate the responsibilities of principal executive officer and principal financial officer, intending to rely on two or more individuals. We will also seek to expand our current board of directors to include additional individuals willing to perform directorial functions. Since the recited remedial actions will require that we hire or engage additional personnel, this material weakness may not be overcome in the near term due to our limited financial resources. Until such remedial actions can be realized, we will continue to rely on the advice of outside professionals and consultants.\nThis annual report does not include an attestation report of our registered public accounting firm regarding our internal controls over financial reporting. Managements report was not subject to attestation by our registered public accounting firm pursuant to Section 404(c) of the Sarbanes-Oxley Act that permit us to provide only managements report in this annual report.\nChanges in Internal Controls over Financial Reporting\nDuring the year ended August 31, 2023, other than the change in ownership, there has been no change in internal control over financial reporting that has materially affected or is reasonably likely to materially affect our internal control over financial reporting. Item 9B. Other Information\nNone\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections.\nNot applicable.\nPART III Item 10. Directors, Executive Officers and Corporate Governance\nThe following table sets forth the name, age, and position of sole executive officers and directors. Executive officers are elected annually by our Board of Directors. Each executive officer holds his office until he resigns, is removed by the Board, or his successor is elected and qualified. Directors are elected annually by our stockholders at the annual meeting. Each director holds his office until his successor is elected and qualified or his earlier resignation or removal.\nNAME\nAGE\nPOSITION\nZhi Yang\nChairman and Chief Executive Officer\nZhi Yang has been our Chairman of the Board and Director since inception (July 22, 2021). For the past 5 years, Mr. Yang has been a business consultant and more recently, in 2017, he founded a mushroom growing company in the Peoples Republic of China (PRC). Mr. Yang received an Master Degree in Law from China University of Political Science and Law (PRC) and received a LLM in Law from Temple University. Mr. Yang is a founder of the Company brings a wide range of business experience to our board of directors.\nFamily Relationships\nThere are no family relationships among our directors or officers.\nInvolvement in Legal Proceedings\nTo the best of our knowledge, none of our directors or executive officers, during the past ten years, has been convicted in a criminal proceeding, excluding traffic violations or similar misdemeanors, or has been a party to any judicial or administrative proceeding during the past five years that resulted in a judgment, decree or final order enjoining the person from future violations of, or prohibiting activities subject to, federal or state securities laws, or a finding of any violation of federal or state securities laws, except for matters that were dismissed without sanction or settlement. Except as set forth in our discussion below in Certain Relationships and Related Transactions, none of our directors, director nominees or executive officers has been involved in any transactions with us or any of our directors, executive officers, affiliates or associates which are required to be disclosed pursuant to the rules and regulations of the Securities and Exchange Commission.\nDirector Independence\nOur Board of Directors is currently composed of one member, whom does not qualify as an independent director in accordance with the published listing requirements of the NASDAQ Global Market (the Company has no plans to list on the NASDAQ Global Market). The NASDAQ independence definition includes a series of objective tests, such as that the directors are not, and have not been for at least three years, one of our employees and that neither the Director, nor any of their family members have engaged in various types of business dealings with us. In addition, our board of directors has not made a subjective determination as to our director that no relationship exist which, in the opinion of our board of directors, would interfere with the exercise of independent judgment in carrying out the responsibilities of a director, though such subjective determination is required by the NASDAQ rules. Had our board of directors made these determinations, our board of directors would have reviewed and discussed information provided by our director and us with regard to our directors business and personal activities and relationships as they may relate to us and our management.\nCode of Ethics\nWe currently do not have a code of ethics that applies to our officers, employees and directors, including our Chief Executive Officer and Chief Financial Officer; however, we intend to adopt one in the near future.\nConflicts of Interest\nSince we do not have an audit or compensation committee comprised of independent directors, the functions that would have been performed by such committees are performed by our directors. The Board of Directors has not established an audit committee and does not have an audit committee financial expert, nor has the Board established a nominating committee. The Board is of the opinion that such committees are not necessary since the Company is an early-stage company, and to date, such directors have been performing the functions of such committees. Thus, there is a potential conflict of interest in that our Directors and Officers have the authority to determine issues concerning management compensation, nominations, and audit issues that may affect management decisions.\nIn addition, our Officers have committed to spend a sufficient amount of time and attention to the affairs of the Company to fulfill their respective officer responsibilities. In this regard, generally, each officer or director will spend between 15 to 40 hours per week on the affairs of the Company, depending on the circumstances. Therefore, we may face conflicts of interest between the time and attention each officer or director devotes to the Company and that of their other business interests.\nOther than as described above, we are not aware of any other conflicts of interest of our executive Officers and Directors.\nInvolvement in Certain Legal Proceedings\nThere are no legal proceedings that have occurred since our incorporation concerning our Officers or Directors, or control persons which involved a criminal conviction, a criminal proceeding, an administrative or civil proceeding limiting ones participation in the securities or banking industries, or a finding of securities or commodities law violations.\nOur Officers and Directors have not received monetary compensation since our inception to the date of this prospectus. We currently do not pay any compensation to our Directors serving on our Board of Directors. Item 11. Executive Compensation\nSummary Executive Compensation Table\nThe following table reflects the Summary Compensation for our named executive officer for fiscal years ended August 31, 2022 and 2021, respectively. For such periods, there were no bonus, non-equity plan compensation, nonqualified compensation earnings or other compensation other than as stated below for the named executive officers.\nName and principal position (a) Year Salary\n($) Stock Awards\nShares\n($) Total\n($)\nZhi Yang 0\nChief Executive Officer and 0\nChief Financial Officer\nEmployment Agreements\nThe Company does not have any employment or other compensation agreement with its executive officers. Moreover, there are no agreements or understandings for any of our executive officers or directors to resign at the request of another person and no officer or director is acting on behalf of nor will any of them act at the direction of any other person.\nGrants of Plan-Based Awards\nNo plan-based awards were granted to any of our named executive officers during the interim fiscal year ended August 31, 2023.\nOutstanding Equity Awards at Interim Fiscal Year End\nNo stock or stock option awards were granted to any other officer of the Company as at August 31, 2023.\nOption Exercises and Stock Vested\nNo option to purchase our capital stock was exercised by any of our named executive officers, nor was any restricted stock held by such executive officers vested during the interim fiscal period ended August 31, 2023.\nPension Benefits\nNo named executive officers received or held pension benefits during the interim fiscal period ended August 31, 2023. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nThe following table sets forth certain information, as of the date hereof, with respect to the beneficial ownership of the outstanding common stock by (i) any holder of more than five percent (5%); (ii) each of our executive officers and directors; and (iii) our directors and executive officers as a group. Except as otherwise indicated, each of the stockholders listed below has sole voting and investment power over the shares beneficially owned. The information is based on 15,466,668 shares of common stock issued and outstanding as of this date.\nName and Address of Amount and\nNature of\nBeneficial Percent of\nBeneficial Owner Ownership (1) Class\nZhi Yang (2)\nChairman of Board and Chief Executive Officer 14,000,000 90.52 %\nAll officers and directors as a group (1 person) 14,000,000 90.52 %\n(1) Beneficial Ownership is determined in accordance with the rules of the SEC and generally includes voting or investment power with respect to securities. Each of the beneficial owners listed above has ownership of and voting power and investment power with respect to our Common Stock. For each beneficial owner above, any options or rights exercisable or receivable within 60 days have been included in the denominator.\n(2) The address of each shareholder is the address of the Company. Item 13. Certain Relationships and Related Transactions, and Director Independence.\nOn July 22, 2021, we issued a total of 14,000,000 shares of common stock to Mr. Yang for the sum of $10,000, the development of our business plan and the formation of our company. Mr. Yang is our Chief Executive Officer, Chairman and founder.\nOn August 6, 2021, we entered into the Technology Assignment Agreement with Mr. Shao, our former director. Pursuant to the agreement, Mr. Shao conveyed to us all of rights, titles and interests in and to three separate technologies. In exchange, Mr. Shao will earn 4,000,000 shares of our common stock upon the filing of a patent for the three technologies with the US Patent and Trademark Office (USPTO). In addition, Mr. Shao shall be entitled to receive a total of 2,000,000 additional shares of our common stock issuable monthly over a three (3) year period beginning with the month of August 2021 (Term) at the rate of 55,556 shares per month (except in final month, the amount shall be 55,540), provided that during the Term, he does not breach the confidentiality and non-compete covenants contained in the agreement. Mr. Shao was entitled 111,112 shares of common stock at $0.001 par value under the agreement for the months of September 2021 and October 2021, which were issued in January 2022 at a value of $111. Mr. Shao passed away on November 20, 2021. On December 20, 2021, the Company entered into a Continuation of Technology Assignment Agreement with Ping Wu, Tian Yang, Jun Shao, Yu Shao, Chunni Shao, and Dongni Shao (collectively, the Shao Heirs). Pursuant to this agreement, Mr. Tian Yang was appointed by the Shao Heirs to be the recipient and record holder of the shares of common stock issuable under the Technology Assignment Agreement.\nOn September 8, 2021, Zhi Yang, our founder and Chairman, provided us with a written support letter, whereby he promised to loan us up to $200,000 as necessary to cover our operating costs. Interest on any loan will accrue at the rate of 3% per annum and this promise to loan was extended for one year on June 30, 2023. Additional loan terms, if any, will be established at the time of the loan.\nOther than stated above, none of the following persons has any direct or indirect material interest in any transaction to which we are a party since inception or in any proposed transaction to which we are proposed to be a party which in either case of $50,000 (or 1% of the average of the Companys assets for the past 2 fiscal years):\n● Any of our directors or officers;\n● Any proposed nominee for election as our director;\n● Any person who beneficially owns or directly or indirectly, shares carrying more than 10% of the voting rights attached to our shares;\n● Any relative or spouse of any of the foregoing persons, or any relative of such spouse, who has the same house as such person or who is a director or officer of any parent or subsidiary of our company.\nOur Common Stock is quoted on OTC Markets. In determining whether our directors are independent, we refer to NASDAQ Stock Market Rule 4200(a) (15) which indicates that a director is not considered to be independent if he or she also is an executive officer or employee of the corporation. Based on those widely-accepted criteria, we have determined that our sole director, Zhi Yang, is not independent as he also serves as the sole officer of the Company. Item 14. Principal Accountant Fees and Services.\nBF Borgers CPA PC is the Companys current independent registered public accounting firm.\n(1) Audit Fees\nThe aggregate fees billed for each of the last two fiscal years for professional services rendered by the principal accountant for our audit of annual financial statements and review of financial statements included in our quarterly reports or services that are normally provided by the accountant in connection with statutory and regulatory filings or engagements for those fiscal years were:\n$ 9,000\n$ 5,000\n(2) Audit-Related Fees\nThe aggregate fees billed in each of the last two fiscal years for assurance and related services by the principal accountants that are reasonably related to the performance of the audit or review of our financial statements and are not reported in the preceding paragraph:\n$\n$\n(3) Tax Fees\nThe aggregate fees billed in each of the last two fiscal years for professional services rendered by the principal accountant for tax compliance, tax advice, and tax planning were:\n$\n$\n(4) All Other Fees\nThe aggregate fees billed in each of the last two fiscal years for the products and services provided by the principal accountant, other than the services reported in paragraphs (1), (2), and (3) were:\n$\n$\nThe percentage of hours expended on the principal accountants engagement to audit our financial statements for the most recent fiscal year that were attributed to work performed by persons other than the principal accountants full time, permanent employees was 0%.\nAudit Committees Pre-Approval Process\nThe Board of Directors acts as the audit committee of the Company, and accordingly, all services are approved by all the members of the Board of Directors. Item 15. Exhibits, Financial Statement Schedules.\n(b) Index to Exhibits required by Item 601 of Regulation S-K.\nExhibit\nDescription\n31.1\nCertification of the Principal Executive and Financial Officer pursuant to Rule 13(a)-14(a) of the Securities Exchange Act of 1934+\n32.1\nCertification of the Companys Principal Executive Officer and Principal Financial pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002+\n101.INS\nXBRL INSTANCE DOCUMENT*\n101.SCH\nXBRL TAXONOMY EXTENSION SCHEMA DOCUMENT*\n101.CAL\nXBRL TAXONOMY CALCULATION LINKBASE DOCUMENT*\n101.DEF\nXBRL TAXONOMY DEFINITION LINKBASE DOCUMENT*\n101.LAB\nXBRL TAXONOMY LABEL LINKBASE DOCUMENT*\n101.PRE\nXBRL TAXONOMY PRESENTATION LINKBASE DOCUMENT*\n+ In accordance with SEC Release 33-8238, Exhibit 32.1 is being furnished and not filed.\nItem 16. Form 10-K Summary.\nAs permitted, the registrant has elected not to supply a summary of information required by Form 10-K.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nPlasma Innovative Inc.\n/s/ Zhi Yang\nZhi Yang\nChief Executive Officer\n(Principal Executive Officer)\nChief Financial Officer\n(Principal Financial and Accounting Officer)\nChairman\nDated: October 30, 2023"
}