{
    "cik": "1887912",
    "company": "Welsis Corp.",
    "filing_type": "10-K",
    "filing_date": "2023-11-20",
    "period_of_report": "2023-09-30",
    "sic": "8000",
    "state_of_inc": "WY",
    "state_location": "Z2",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1887912/0001683168-23-008323-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1887912/000168316823008323/welsis_i10k-093023.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1887912/0001683168-23-008323.txt",
    "filename": "1887912_10K_2023_0001683168-23-008323.htm",
    "content": "Item 1. Description of Business\nGENERAL INFORMATION ABOUT OUR COMPANY\nWelsis Corp. was incorporated in the State of Wyoming and established on August 16, 2021. The Company has no revenue and has incurred losses since inception. We are a development stage startup company that is currently providing an online psychological help services, which are also known as teletherapy or telepsychology services. We have purchased the telehealth platform, delivering on-demand professional psychological consultations anytime, anywhere, via mobile devices, the internet, video and phone calls. Our solution connects consumers with our board-certified specialists. Our website and mobile application prototype known as Psychologist-24 are already functional and ready for the first clients but still need additional extension and improvement as they have limited functionality and we are going to expand and develop it.\nOur website address is https://psychologist-24.com/.\nOur mobile application address in Play Market is https://play.google.com/store/apps/details?id=com.psychologist24 /.\nWe provide counseling and psychological services for adolescents (from 14 years) and adults, for men and women, therapy for individuals, couples and families. Also we plan to provide our services to specific communities, for example to the corporative sector of business in a form of corporate group sessions or individual ones. We believe that any consumer, who has different kind of problems and need the help and professional consultation with our specialists according to his needs, also such as employer, who is interested in a better approach to the psychological climate in his company is our potential client.\nOur business office is located at Bulevar Mihajla Pupina 115 Belgrade, Serbia 11070. Our telephone number is +13855009709 and our email address is info@psychologist-24.com. Item 1A. Risk Factors.\nNot required for Smaller reporting companies. Item 1B. Unresolved Staff Comments.\nNot required for Smaller reporting companies. Item 2. Properties.\nCurrently we dont own any properties. Our business office is located at Bulevar Mihajla Pupina 115 Belgrade, Serbia 11070. This address was provided by sole officer and president, Dusan Zindovic. Our telephone number is +13855009709. Item 3. Legal Proceedings.\nWe are not currently a party to any legal proceedings, and we are not aware of any pending or potential legal actions. Item 4. Mine Safety Disclosures.\nNot Applicable.\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters, and Issuer Purchases of Equity Securities.\nThe company stock is not trading at the moment.\nRegistered Holders of our Common Stock\nAs of September 30, 2023, there were approximately 38 record owners of our common stock including director.\nDividends\nThe Company has never declared or paid cash dividends on its common stock and does not anticipate paying cash dividends in the foreseeable future.\nRecent Sales of Unregistered Securities\nDuring our fiscal years ended September 30, 2023 and 2022, we had no sales of unregistered shares.\nIssuer Purchases of Equity Securities\nDuring the fiscal year ended September 30, 2023, and 2022 the Company did not repurchase any shares of its Common Stock. Item 6. [Reserved] Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations\nWe are a development stage corporation with limited operations and no revenues from our business operations. Our auditors have issued a going concern opinion. This means that our auditors believe there is substantial doubt that we can continue as an on-going business for the next twelve months. We do not anticipate that we will generate significant revenues until we have raised the funds necessary to conduct a marketing program.\nPLAN OF OPERATION\nFISCAL YEAR ENDED SEPTEMBER 30, 2023 COMPARED TO FISCAL YEAR ENDED SEPTEMBER 30, 2022.\nOur net loss for the fiscal year ended September 30, 2023 was $41,068 compared to a net loss of $42,785 during the fiscal year ended September 30, 2022. In September 30, 2023 the Company had revenues of $15,900. In September 30, 2022 the Company had not generated any revenue.\nExpenses incurred were $41,068 during fiscal year ended September 30, 2023 compared to $42,785 during fiscal year ended September 30, 2022.\nThe number of shares outstanding was 2,752,667 for the fiscal years ended September 30, 2023 and September 30, 2022.\nLIQUIDITY AND CAPITAL RESOURCES\nFISCAL YEAR ENDED September 30, 2023 and 2022.\nAs of September 30, 2023, our total assets were $33,167 consisting of capital raised from issuance of common stock and website development.\nAs of September 30, 2022, our total assets were $50,036.\nCash Flows from Operating Activities\nWe have not generated positive cash flows from operating activities. For the fiscal year ended September 30, 2023, net cash flows used in operating activities was $37,072. For the fiscal year ended September 30, 2022, net cash flows used in operating activities was $38,789.\nCash Flows from Investing Activities\nWe have not generated positive cash flows from investing activities. For the fiscal year ended September 30, 2023, net cash flows used in investing activities was $23,333. For the fiscal year ended September 30, 2022, net cash flows used in investing activities was $31,333.\nCash Flows from Financing Activities\nWe have financed our operations primarily from either advances from our sole executive or the issuance of equity. For the fiscal year ended September 30, 2023, net cash provided by financing activities was $51,536. For the fiscal year ended September 30, 2022, net cash from financing activities was $88,825.\nOFF-BALANCE SHEET ARRANGEMENTS\nWe have no off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources.\nGOING CONCERN\nThere is no historical financial information about us upon which to base an evaluation of our performance. We are in start-up stage operations and have not generated any revenues. We cannot guarantee we will be successful in our business operations. Our business is subject to risks inherent in the establishment of a new business enterprise, including limited capital resources and possible cost overruns due to price and cost increases in services and products.\nWe have no assurance that future financing will be available to us on acceptable terms. If financing is not available on satisfactory terms, we may be unable to continue, develop or expand our operations. Equity financing could result in additional dilution to existing shareholders.\nThe extent of the impact of the coronavirus (COVID-19) outbreak on the financial performance of the Company will depend on future developments, including the duration and spread of the outbreak and related advisories and restrictions and the impact of COVID-19 on the overall economy, all of which are highly uncertain and cannot be predicted. If the overall economy is impacted for an extended period, the Companys future operating results may be materially adversely affected.\nCritical Accounting Policies\nThe discussion and analysis of our financial condition and results of operations are based upon our financial statements, which have been prepared in accordance with the accounting principles generally accepted in the United States of America. Preparing financial statements requires management to make estimates and assumptions that affect the reported amounts of assets, liabilities, and expenses. These estimates and assumptions are affected by managements application of accounting policies. We believe that understanding the basis and nature of the estimates and assumptions involved with the following aspects of our financial statements is critical to an understanding of our financial statements.\nUse of Estimates\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements. The estimates and judgments will also affect the reported amounts for certain expenses during the reporting period. Actual results could differ from these good faith estimates and judgments. Item 7A. Quantitative and Qualitative Disclosures about Market Risk\nNot applicable to smaller reporting companies. Item 8. Financial Statements and Supplementary Data\nThe Companys Financial Statements required by Item 8, together with the reports thereon of the Independent Registered Public Accounting Firm are set forth on pages through of this report and are incorporated by reference in this Item 8. Item 9. Changes in and Disagreements with Accounting and Financial Disclosures.\nNone. Item 9A. Controls and Procedures.\nDisclosure Controls and Procedures\nDisclosure controls and procedures are designed to ensure that information required to be disclosed in the reports filed or submitted under the Exchange Act is recorded, processed, summarized and reported, within the time period specified in the SECs rules and forms, and that such information is accumulated and communicated to management, including the CEO and CFO, as appropriate, to allow timely decisions regarding required disclosures. Our management necessarily applied its judgment in assessing the costs and benefits of such controls and procedures, which, by their nature, can provide only reasonable assurance regarding managements control objectives.\nOur management, with the participation of our CEO, evaluated the effectiveness of the design and operation of our disclosure controls and procedures as of the end of the period covered by this Report. Based upon this evaluation, our CEO concluded that our disclosure controls and procedures were not effective because of the identification of a material weakness in our internal control over financial reporting which is described below.\nManagements Report on Internal Control Over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Exchange Rule 13a-15(f). Our internal control over financial reporting is a process designed to provide reasonable assurance to our management and board of directors regarding the reliability of financial reporting and the preparation of the financial statements for external purposes in accordance with U.S. GAAP.\nOur internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of our assets; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with U.S. GAAP and our receipts and expenditures are being made only in accordance with authorizations of our management and directors; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of our assets that could have a material effect on our financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. All internal control systems, no matter how well designed, have inherent limitations, including the possibility of human error and the circumvention of overriding controls. Accordingly, even effective internal control over financial reporting can provide only reasonable assurance with respect to financial statement preparation. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nOur management assessed the effectiveness of our internal control over financial reporting as of September 30, 2023. In making this assessment, it used the criteria set forth by the Committee of Sponsoring Organizations of the Tread way Commission (COSO) in Internal Control-Integrated Framework (2013). Based on this evaluation, management concluded that that our internal control over financial reporting was not effective as of September 30, 2023. Our CEO concluded we have a material weakness due to lack of segregation of duties, a limited corporate governance structure, and a lack of a formal management review process over preparation of financial information. A material weakness is a deficiency, or a combination of control deficiencies, in internal control over financial reporting such that there is a reasonable possibility that a material misstatement of our annual or interim financial statements will not be prevented or detected on a timely basis.\nOur size has prevented us from being able to employ sufficient resources to enable us to have an adequate level of supervision and segregation of duties within our system of internal control. Therefore, while there are some compensating controls in place, it is difficult to ensure effective segregation of accounting and financial reporting duties. Management reported the following material weaknesses:\n· Lack of segregation of duties in certain accounting and financial reporting processes including the initiation, processing, recording and approval of disbursements;\n· Our corporate governance responsibilities are performed by the Board of Directors, none of whom are independent under applicable standards; we do not have an audit committee or compensation committee. Our Board of Directors acts primarily by written consent without meetings which results in several of our corporate governance functions not being performed concurrent (or timely) with the underlying transactions, including evaluation of the application of accounting principles and disclosures.\n· Certain reports that we prepare, and accounting and reporting conclusions reached in connection with the financial statement preparation process are not subjected to a formal review process that includes multiple levels of review and are not submitted timely to the Board of Directors for review or approval; and\nWhile we strive to segregate duties as much as practicable, there is an insufficient volume of transactions at this point in time to justify additional full-time staff. We believe that this is typical in many development stage companies. We may not be able to fully remediate the material weakness until we commence operations at which time, we would expect to hire more staff. We will continue to monitor and assess the costs and benefits of additional staffing.\nThis Annual Report does not include an attestation report of our registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by our registered public accounting firm pursuant to the SEC rules that permit us to provide only managements report in this Annual Report.\nChanges in Internal Control Over Financial Reporting\nThere were no changes in our internal control over financial reporting that occurred during the quarter ended September 30, 2023, that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting. Item 9B. Other Information.\nNone.\nItem 9C. Disclosures Regarding Foreign Jurisdictions that Prevent Inspections.\nNot Applicable.\nPART III Item 10. Directors, Executive Officers, and Corporate Governance.\nDirectors of the corporation are elected by the stockholders to a term of 1 (one) year and serve until a successor is elected and qualified. Officers of the corporation are appointed by the Board of Directors to a term of one year and serves until a successor is duly appointed and qualified, or until he or she is removed from office. The Board of Directors has no nominating, auditing or compensation committees.\nOur executive officer and director, his name, age, and his positions as of the date of this prospectus are as follows:\nName and Address of Executive\nOfficer and/or Director\nAge\nPosition\nDusan Zindovic\nBulevar Mihajla Pupina 115, Belgrade,\nSerbia 11070\nPresident, Chief Financial Officer, Chief Executive Officer and Sole Director\nThereby, Mr. Dusan Zindovic is currently the Sole Officer/Director and control person of Welsis Corp.\nResume\nDusan Zindovic, Age 30\nMr. Dusan Zindovic has served as the Companys President, Chief Executive Officer, Secretary, Treasurer and a Director since June 20, 2023.\nMr. Zindovic, age 30, has the leading experience across several industries including technology, IT, development of start up projects, software and services, and public accounting. During his working experience he was successful inventor, project and product manager and business consultant.\nMr Zindovics extensive experience in project management and execution capabilities will provide valuable insights and guidance to the company as we seek to execute our growth strategy.\nCommittees of the Board\nOur Company currently does not have nominating, compensation or audit committees or committees performing similar functions, nor does our Company have a written nominating, compensation or audit committee charter. Our director believes that it is not necessary to have such committees, at this time, because the functions of such committees can be adequately performed by the sole director.\nOur Company does not have any defined policy or procedural requirements for shareholders to submit recommendations or nominations for Directors. The sole director believes that, given the stage of our development, a specific nominating policy would be premature and of little assistance until our business operations develop to a more advanced level. Our Company does not currently have any specific or minimum criteria for the election of nominees to the sole director and we do not have any specific process or procedure for evaluating such nominees. The sole director, will assess all candidates, whether submitted by management or shareholders, and make recommendations for election or appointment.\nA shareholder who wishes to communicate with our sole director may do so by directing a written request addressed to our president and director, at the address appearing on the first page of this Prospectus.\nCorporate Governance\nThe Company promotes accountability for adherence to honest and ethical conduct; endeavors to provide full, fair, accurate, timely and understandable disclosure in reports and documents that the Company files with the Securities and Exchange Commission (the SEC) and in other public communications made by the Company; and strives to be compliant with applicable governmental laws, rules and regulations. The Company has not formally adopted a written code of business conduct and ethics that governs the Companys employees, officers and directors as the Company is not required to do so.\nIn lieu of an Audit Committee, the Companys sole director is responsible for reviewing and making recommendations concerning the selection of outside auditors, reviewing the scope, results and effectiveness of the annual audit of the Company's financial statements and other services provided by the Companys independent public accountants. The sole director reviews the Company's internal accounting controls, practices and policies.\nSection 16(a) Beneficial Ownership Reporting Compliance\nIn the event that we register under the Securities Exchange Act of 1934 (the Exchange Act or 1934 Act), Section 16(a) of that act will require our directors and executive officers, and persons who own more than ten percent of our common stock, to file with the Securities and Exchange Commission initial reports of ownership and reports of changes of ownership of our common stock. Officers, directors and greater than ten percent stockholders will be required by SEC regulation to furnish us with copies of all Section 16(a) forms they file.\nWe intend to ensure to the best of our ability that all Section 16(a) filing requirements applicable to our officers, directors and greater than ten percent beneficial owners are complied with in a timely fashion.\nCode of Business Conduct\nWe have not adopted a Code of Business Conduct within the meaning of Item 406(b) of Regulation S-K.\nBoard Committees\nWe do not have any Board Committees. Item 11. Executive Compensation.\nThe table below summarizes the total compensation earned by each of our named executive Officers (NEOs) for each of the fiscal years listed.\nSUMMARY COMPENSATION TABLE\nManagement Compensation\nThe following tables set forth certain information about compensation paid, earned or accrued for services by our sole officer and director from our inception on August 16, 2021 until September 30, 2023:\nName and\nPrincipal\nPosition\nYears\nSalary\n($)\nBonus\n($)\nStock\nAwards\n($)\nOption\nAwards\n($)\nNon-Equity\nIncentive Plan\nCompensation\n($)\nNonqualified\nDeferred\nCompensation\n($)\nAll Other\nCompensation\n($)\nTotal\n($)\nDusan Zindovic, President,\n7,200\n7,200\nCEO, CFO\n7,200\n7,200\nOn September 1, 2021, we have executed a consulting agreement for monthly services with our officer and director under which he is entitled to $600 monthly compensation. Agreement is filed as Exhibit 10.1 to this Registration Statement. However, this amount is being deferred as liability to the company until the Company raises funds in this offering. In the future, we may approve payment of salaries for officers and directors, but currently, no such plans have been approved. We also do not currently have any benefits, such as health or life insurance, available to our employees.\nCompensation of Directors\nDirectors are permitted to receive fixed fees and other compensation for their services as directors. The Board of Directors has the authority to fix the compensation of directors. No amounts have been paid to, or accrued to, our director in such capacity.\nStock Plan\nWe have not adopted a stock plan but may do so in the future.\nDirector Independence\nOur securities are not currently traded on any public exchange and as such, we are not currently subject to corporate governance standards of listed companies, which require, among other things, that the majority of the board of directors be independent. We are not currently subject to corporate governance standards defining the independence of our directors, and we have chosen to define an independent director in accordance with the NASDAQ Global Markets requirements for independent directors.\nUnder the NASDAQ rules, our current director does not qualify as an independent director. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matter.\nSECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT\nDirectors and Executive Officers\nThe following table sets forth the beneficial ownership (and the percentages of outstanding shares represented by such beneficial ownership) as of September 30, 2023, of (i) each director, (ii) the current NEOs named in the Summary Compensation Table contained in this Form 10-K and (iii) all current directors and executive officers as a group. Except as otherwise indicated, we believe that the beneficial owners of the common stock listed below, based on information provided by such owners, have sole investment and voting power with respect to such shares, subject to community property laws where applicable. Persons, who have the power to vote or dispose of common stock of the Company, either alone or jointly with others, are deemed to be beneficial owners of such common stock.\nDusan Zindovic, President, CEO, CFO and Chairman of the Board. 2,000,000 shares\nCertain Stockholders\nThe following table sets forth certain information with respect to each person known by us to be the beneficial owner of five percent or more of either class of the Companys outstanding common stock. The content of this table is based upon the most current information contained in Schedules 13D or 13G filings with the SEC, unless more recent information was obtained.\nDusan Zindovic, President, CEO, CFO and Chairman of the Board. 73%\nThis percentage is calculated based on the outstanding shares of 2,752,667 as of September 30, 2023. Item 13. Certain Relationships and Related Transactions, and Director Independence.\nCERTAIN RELATIONSHIPS AND RELATED PARTY TRANSACTIONS\nThe following table sets forth certain information concerning the number of shares of our common stock owned beneficially as of September 30, 2023 by: (i) each person (including any group) known to us to own more than five percent (5%) of any class of our voting securities, (ii) our director, and or (iii) our officer. Unless otherwise indicated, the stockholder listed possesses sole voting and investment power with respect to the shares shown.\nTitle of Class Name and Address\nof\nBeneficial Owner\nAmount and\nNature of\nBeneficial\nOwnership\nPercentage\nof\nCommon Stock\nCommon Dusan Zindovic 2,000,000 73%\nCommon All Officers and Directors as a Group (1 person) 2,000,000 73%\nFuture Sales by Existing Shareholders\nA total of 2,000,000 common shares at $0.0001 per share have been issued to our sole stockholder. They are restricted securities, as that term is defined in Rule 144 of the Rules and Regulations of the SEC promulgated under the Act. Under Rule 144, such shares can be publicly sold, subject to volume restrictions and certain restrictions on the manner of sale, commencing six months after their acquisition.\nAny sale of shares held by the existing stockholder (after applicable restrictions expire) and/or the sale of shares purchased in this offering (which would be immediately resalable after the offering), may have a depressive effect on the price of our common stock in any market that may develop, of which there can be no assurance. Item 14. Principal Accountant Fees and Services.\nFEES TO THE COMPANYS AUDITORS\nSet forth below is a summary of certain fees paid to our independent audit BF Borgers CPA PC, Independent registered public accountants for services for the fiscal years 2023 and 2022, respectively.\nFee Category Fiscal Year\nFiscal Year\nAudit Fees $ 10,800 $ 11,940\nTax Fees - -\nAll Other Fees - -\nTotal $ 10,800 $ 11,940\nAudit Fees\nAudit fees were for professional services rendered in connection with the audit of our annual financial statements set forth in our Annual Reports on Form 10-K, the review of our quarterly financial statements set forth in our Quarterly Reports on Form 10-Q and consents for other SEC filings.\nAudit-Related Fees\nAudit-related fees consist of fees billed for professional services for consultation on accounting matters.\nApproval of Services Provided by Independent Registered Public Accounting Firm\nThe Board of Directors has considered whether the services provided under other non-audit services are compatible with maintaining the auditors independence and has determined that such services are compatible. The Board of Directors has adopted policies and procedures for pre-approving all non-audit work performed by the external auditors. The Board of Directors will annually pre-approve services in specified accounting areas. The Board of Directors also annually approves the budget for the annual generally accepted accounting principles (GAAP) audit.\nPART IV Item 15. Exhibit and Financial Statement Schedules.\n(a) (1) Financial Statements\nThe following documents are filed as part of this report:\nThe Financial Statements of Welsis Corp. at September 30, 2023 and 2022, and for each of the two fiscal years in the period ended September 30, 2023, together with the reports of the Independent Registered Public Accounting Firms, are set forth on pages through of this Report.\n(2) Not applicable.\n(3) Exhibits\n31.1\nCertification of the Chief Executive Officer pursuant to Section 302 of Sarbanes-Oxley Act of 2002.\n31.2\nCertification of the Chief Financial Officer pursuant to Section 302 of Sarbanes-Oxley Act of 2002.\n32.1\nCertification of the Companys Principal Executive Officer and Principal Financial pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n101.INS\nInline XBRL Instance Document (the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document)\n101.SCH\nInline XBRL Taxonomy Extension Schema Document\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document\nCover Page Interactive Data File (embedded within the Inline XBRL document)\nItem 16. Form 10-K Summary.\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized on November 20, 2023.\nWELSIS CORP.\nBy: /s/ Dusan Zindovic\nDusan Zindovic\nPresident and Chief Executive Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities indicated on November 20, 2023.\nSignature\nTitle\n/s/ Dusan Zindovic\nPresident, Secretary, Treasurer, Principal Executive Officer,\nDusan Zindovic\nPrincipal Financial Officer and Principal Accounting Officer and\nSole Director\nWELSIS CORP.\nReport of Independent Registered Accounting Firm\nBalance Sheets as of September 30, 2023 and September 30, 2022\nStatements of Operations for the Years ended September 30, 2023 and September 30, 2022\nStatements of Stockholders Deficit for the Years ended September 30, 2023 and September 30, 2022\nStatements of Cash Flows for the Year ended September 30, 2023 and September 30, 2022\nNotes to the Financial Statements\nReport of Independent Registered Public Accounting Firm\nTo the shareholders and the board of directors of Welsis Corp.\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of Welsis Corp. as of September 30, 2023 and 2022, the related statements of operations, stockholders' equity (deficit), and cash flows for the years then ended, and the related notes (collectively referred to as the \"financial statements\"). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of September 30, 2023 and 2022, and the results of its operations and its cash flows for the years then ended, in conformity with accounting principles generally accepted in the United States.\nSubstantial Doubt about the Companys Ability to Continue as a Going Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 2 to the financial statements, the Companys operating losses raise substantial doubt about its ability to continue as a going concern. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (\"PCAOB\") and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audit provides a reasonable basis for our opinion.\n/s/ BF Borgers CPA PC\nBF Borgers CPA PC (PCAOB ID 5041)\nWe have served as the Company's auditor since\nLakewood, CO\nNovember 17, 2023\nWELSIS CORP.\nBALANCE SHEETS\nSeptember 30,\nSeptember 30,\nASSETS\nCurrent Assets\nEscrow Account $ 9,834 $ 18,703\nTotal Current Assets 9,834 18,703\nNon-Current Intangible Assets\nMobile Application and Website Development 23,333 31,333\nTotal Non-Current Intangible Assets 23,333 31,333\nTotal Assets $ 33,167 $ 50,036\nLIABILITIES\nCurrent Liabilities\nAccounts Payable $ 75,500 $ 68,300\nInterest Payable 8,325 4,329\nAccounts Payable - Director loan 27,315 14,312\nTotal Current liabilities 111,140 86,941\nLong term liabilities\nNotes Payable 40,000 40,000\nTotal long term liabilities 40,000 40,000\nTotal Liabilities 151,140 126,941\nStockholders Equity\nCommon stock, $0.0001 par value, 75,000,000 shares authorized; 2,752,667 shares issued and outstanding September 30, 2023 and September 30, 2022 respectively;\nAdditional paid-in-capital 22,504 22,504\nAccumulated deficit (140,753 ) (99,685 )\nTotal Stockholders Equity (117,973 ) (76,905 )\nTotal Liabilities and Stockholders Equity $ 33,167 $ 50,036\nSee accompanying notes, which are an integral part of these financial statements\nWELSIS CORP.\nSTATEMENTS OF OPERATIONS\nFor the years ended\nSeptember 30,\nFor the years ended\nSeptember 30,\nREVENUE $ 15,900 $ -\nOPERATING EXPENSES\nGeneral and Administrative Expenses 56,968 42,785\nTOTAL OPERATING EXPENSES (56,968 ) (42,785 )\nNET INCOME (LOSS) FROM OPERATIONS (41,068 ) (42,785 )\nPROVISION FOR INCOME TAXES - -\nNET INCOME (LOSS) $ (41,068 ) $ (42,785 )\nNET LOSS PER SHARE; BASIC AND DILUTED $ (0.00 ) $ (0.00 )\nWEIGHTED AVERAGE NUMBER OF SHARES OUTSTANDING: BASIC AND DILUTED 2,752,667 2,140,278\nSee accompanying notes, which are an integral part of these financial statements\nWELSIS CORP.\nSTATEMENT OF STOCKHOLDERS DEFICIT\nFOR THE YEARS ENDED SEPTEMBER 30, 2023 & SEPTEMBER 30, 2022\nCommon Stock Additional\nPaid-in\nDeficit Total\nStockholders\nShares Amount Capital Accumulated Equity\nInception, August 16, 2021 - $ - $ - $ - $ -\nShares issued for cash at $0.0001 per share on August 18, 2021 2,000,000 - -\nNet loss for the year ended September 30, 2021 - - - (56,899 ) (56,899 )\nBalance, September 30, 2021 2,000,000 $ 200 $ - $ (56,899 ) $ (56,699 )\nShares issued for cash at $0.03 per share during June - September 2022 752,667 22,504 - 22,580\nNet loss for the year ended September 30, 2022 - - - (42,785 ) (42,785 )\nBalance, September 30, 2022 2,752,667 $ 276 $ 22,504 $ (99,685 ) $ (76,905 )\nNet loss for the year ended September 30, 2023 - - - (41,068 ) (41,068 )\nBalance, September 30, 2023 2,752,667 $ 276 $ 22,504 $ (140,753 ) $ (117,973 )\nSee accompanying notes, which are an integral part of these financial statements\nWELSIS CORP.\nSTATEMENTS OF CASH FLOWS\nFor the year ended\nSeptember 30,\nFor the year ended\nSeptember 30,\nCASH FLOWS FROM OPERATING ACTIVITIES\nNet income (loss)\n$ (41,068 )\n$ (42,785 )\nInterest payable\n3,996\n3,996\nCASH FLOWS USED IN OPERATING ACTIVITIES\n(37,072 )\n(38,789 )\nCASH FLOWS USED IN INVESTING ACTIVITIES\nMobile application and website\n(23,333 )\n(31,333 )\nCASH FLOWS USED IN INVESTING ACTIVITIES\n(23,333 )\n(31,333 )\nCASH FLOWS FROM FINANCING ACTIVITIES\nProceeds from sale of common stock\n-\n22,580\nAccounts payable -Director loan\n13,003\n14,212\nAccounts payable\n7,200\n12,700\nNote payable\n31,333\n39,333\nCASH FLOWS PROVIDED BY FINANCING ACTIVITIES\n$ 51,536\n$ 88,825\nNet increase in cash and equivalents\n$ (8,869 )\n$ 18,703\nCash and equivalents at beginning of the period\n18,703\n-\nCash and equivalents at end of the period\n$ 9,834\n$ 18,703\nSupplemental cash flow information:\nCash paid for:\nInterest\n$ -\n$ -\nTaxes\n$ -\n$ -\nSee accompanying notes, which are an integral part of these financial statements\nWELSIS CORP.\nNOTES TO THE AUDITED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED SEPTEMBER 30, 2023 and 2022\nNote 1 - ORGANIZATION AND NATURE OF BUSINESS\nWelsis Corp. (referred as the Company, we, our) was Incorporated in the State of Wyoming and established on August 16, 2021. We are a development-stage company formed to commence operations concerned with the virtual psychological therapy that is also known as teletherapy or telepsychology services. We have developed a full business plan. Our Company provides counseling and psychological services for adolescents (from 14 years) and adults, for men and women, therapy for individuals, couples and families. Also we plan to provide our services to specific communities, for example to the corporative sector of business in a form of corporate group sessions or individual ones. We have purchased a website and a working prototype of online services mobile platform application known as Psychologist-24.\nOur business office is located at Bulevar Mihajla Pupina 115 Belgrade, Serbia 11070. Our telephone number is +13855009709.\nNote 2 - GOING CONCERN\nThe accompanying financial statements have been prepared in conformity with generally accepted accounting principles in the United States of America (GAAP), which contemplate continuation of the Company as a going concern. The Company has an accumulated deficit of $140,753 as of September 30, 2023. The Company currently has losses and has not completed its efforts to establish a stabilized source of revenues sufficient to cover operating costs over an extended period of time. Therefore, there is substantial doubt about the Companys ability to continue as a going concern. Management anticipates that the Company will be dependent, for the near future, on additional investment capital to fund operating expenses. The Company intends to position itself so that it will be able to raise additional funds through the capital markets. In light of managements efforts, there are no assurances that the Company will be successful in this or any of its endeavors or become financially viable and continue as a going concern.\nNote 3 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBasis of presentation\nThe accompanying financial statements have been prepared in accordance with generally accepted accounting principles in the United States of America. The Companys year-end is September 30.\nRevenue\nIn accordance with ASC 606, revenue is measured based on a consideration specified with a customer and recognized when we satisfy the performance obligation specified with a customer.\nDuring the year ended September 30, 2023, we generated total revenue of $15,900.\nUse of Estimates\nThe preparation of financial statements in conformity with US GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date the financial statements and the reported amount of revenues and expenses during the reporting period. Actual results could differ from those estimates.\nFair Value of Financial Instruments\nFASB ASC Topic 820, Fair Value Measurement, defines fair value as the exchange price that would be received for an asset or paid to transfer a liability in the principal or most advantageous market for the asset or liability in an orderly transaction between market participants on the measurement date. The standards apply to recurring and nonrecurring fair value measurements of financial and non-financial assets and liabilities. The Company determines the fair values of its assets and liabilities based on a fair value hierarchy that includes three levels of inputs that may be used to measure fair value.\nThe three levels are defined as follows:\nLevel 1: defined as observable inputs such as quoted prices in active markets;\nLevel 2: defined as inputs other than quoted prices in active markets that are either directly or indirectly observable; and\nLevel 3: defined as unobservable inputs in which little or no market data exists, therefore requiring an entity to develop its own assumptions.\nDue to its short-term nature, the carrying value of cash, director loans and issuance of common stock approximated fair value at September 30, 2023.\nIncome Taxes\nThe Company is a C Corporation under the Internal Revenue Code and a similar section of the state code.\nAll income tax amounts reflect the use of the liability method under accounting for income taxes. Income taxes are provided for the tax effects of transactions reported in the financial statements and consist of taxes currently due plus deferred taxes arising primarily from differences between financial and tax reporting purposes. Current year expense represents the amount of income taxes paid, payable or refundable for the period.\nDeferred income taxes, net of appropriate valuation allowances, are determined using the tax rates expected to be in effect when the taxes are actually paid. Valuation allowances are recorded against deferred tax assets when it is more likely than not that such assets will not be realized. When an uncertain tax position meets the more likely than not recognition threshold, the position is measured to determine the amount of benefit or expense to recognize in the financial statements.\nThe Companys income tax returns are subject to review and examination by federal, state and local governmental authorities. As of September 30, 2023, our September 30, 2022 tax return was open to examination with federal, state and local governmental authorities. To the extent penalties and interest are incurred through an examination, they would be included as part of operations in the statement of operations.\nLong-Lived Assets - Intangible Assets\nWe account for our intangible assets in accordance with ASC Subtopic 350-30, General Intangibles Other Than Goodwill, and ASC Subtopic 360-10-05, Accounting for the Impairment or Disposal of Long-Lived Assets. ASC Subtopic 350-30 requires assets to be measured based on the fair value of the consideration given or the fair value of the assets (or net assets) acquired, whichever is more clearly evident and, thus, more reliably measurable. Further, ASC Subtopic 350-30 requires an intangible asset to be amortized over its useful life and for the useful life to be evaluated every reporting period to determine whether events or circumstances warrant a revision to the remaining period of amortization. If the estimate of useful life is changed the remaining carrying amount of the intangible asset is amortized prospectively over the revised remaining useful life. Costs of internally developing, maintaining, or restoring intangible assets are recognized as an expense when incurred.\nBasic Income (Loss) Per Share\nThe Company computes income (loss) per share in accordance with FASB ASC 260 Earnings per Share. Basic loss per share is computed by dividing net income (loss) available to common shareholders by the weighted average number of outstanding common shares during the period. Diluted income (loss) per share gives effect to all dilutive potential common shares outstanding during the period. Dilutive loss per share excludes all potential common shares if their effect is anti-dilutive. As of September 30, 2023 there were no potentially dilutive debt or equity instruments issued or outstanding.\nComprehensive Income\nComprehensive income is defined as all changes in stockholders equity, exclusive of transactions with owners, such as capital investments. Comprehensive income includes net income or loss, changes in certain assets and liabilities that are reported directly in equity such as translation adjustments on investments in foreign subsidiaries and unrealized gains (losses) on available-for-sale securities. As of September 30, 2023 were no differences between our comprehensive loss and net loss.\nRecent Accounting Pronouncements\nWe have reviewed all the recently issued, but not yet effective, accounting pronouncements and we do not believe any of these pronouncements will have a material impact on the Company.\nRisks and Uncertainties\nThe ultimate impact of the COVID-19 pandemic on the Companys operations is unknown and will depend on future developments, which are highly uncertain and cannot be predicted with confidence, including the duration of the COVID-19 outbreak, new information which may emerge concerning the severity of the COVID-19 pandemic, and any additional preventative and protective actions that governments, or the Company, may direct, which may result in an extended period of continued business disruption, reduced customer traffic and reduced operations. Any resulting financial impact cannot be reasonably estimated at this time but is anticipated to have a material adverse impact on our business, financial condition and results of operations.\nManagement expects that its business will be impacted to some degree, but the significance of the impact of the COVID-19 outbreak on the Companys business and the duration for which it may have an impact cannot be determined at this time.\nNote 4- COMMON STOCK\nThe Company has 75,000,000, $0.0001 par value shares of common stock authorized.\nOn August 18, 2021 the Company issued 2,000,000 shares of common stock to the CEO at $0.0001 per share.\nThere were 2,000,000 shares of common stock issued and outstanding as of September 30, 2021.\nDuring the period ended September 30, 2022 the Company issued 752,667 shares of common stock to 37 shareholders for cash proceeds of $22,580 at $0.03 per share.\nThere were 2,752,667 shares of common stock issued and outstanding as of September 30, 2023 and 2022.\nVoting Common Stock\nAll shares of common stock have voting rights and are identical. All holders of shares of voting common stock shall at every meeting of the stockholders be entitled to one vote for each share of the capital stock held by such stockholder.\nNon-voting Common Stock\nAll of the other terms of the Non-Voting Common Stock shall be identical to the Voting Common Stock, except for the right of first refusal that attaches to the Non-Voting Common Stock, as explained in the Companys Bylaws.\nNote 5 - COMMITMENTS AND CONTINGENCIES\nIn the normal course of business, the Company may become a party to litigation matters involving claims against it. At September 30, 2023, there are no current matters that would have a material effect on the Companys financial position or results of operations.\nThe extent of the impact of the coronavirus (COVID-19) outbreak on the financial performance of the Company will depend on future developments, including the duration and spread of the outbreak and related advisories and restrictions and the impact of COVID-19 on the overall economy, all of which are highly uncertain and cannot be predicted. If the overall economy is impacted for an extended period, the Companys future operating results may be materially and adversely affected.\nNote 6 - INTANGIBLE ASSETS\nThe Company purchased and possesses an asset in a form of the website and mobile application with online psychological help services. The Company purchased the website and mobile application for $40,000 and is amortizing the asset straight-line over its five year useful life or $8,000 per year.\nBalances as of September 30, 2023 and September 30, 2022 are as follows:\nSchedule of intangible assets September 30, 2023 September 30, 2022\nIntangible Assets Purchased $ 31,333 $ 39,333\nAccumulated Amortization (8,000 ) (8,000 )\nNet Book Value $ 23,333 $ 31,333\nNote 7 - RELATED PARTY TRANSACTIONS\nOur sole officer and director, is the only related party with whom the Company had transactions with during the period from inception on August 16, 2021 through September 30, 2023. During the year ended September 30, 2023, the director paid $27,315 for operating expenses on behalf of the Company and as of September 30, 2023 and September 30, 2022 the Company owed the director $27,315 and $14,312, respectively for these advances. The amounts due to the related party are unsecured and non-interest bearing with no set terms of repayment.\nThe sole officer and director currently devotes approximately thirty hours per week to manage our affairs. Under a Consulting Agreement, our officer and director is entitled to $600 per month in cash compensation but this amount is being deferred until the Company is in a position to start payments. In addition, the director is reimbursed for any out-of-pocket expenses that he incurs on our behalf. During the year ended September 30, 2023, the director earned $7,200 of compensation and as of September 30, 2022 the Company owed the director $7,200 for accrued wages.\nNote 8 - INCOME TAXES\nAs of September 30, 2023, the Company had net operating loss carry forwards of approximately $29,558 that may be available to reduce future years' taxable income in varying amounts through 2041.\nFuture tax benefits which arise as a result of these losses have not been recognized in these financial statements, as their realization is determined not likely to occur and accordingly, the Company has recorded a valuation allowance for the deferred tax asset relating to these tax loss carry-forwards.\nThe 21% tax rate provision for Federal income tax consists of the following:\nSchedule of income tax expense\nSeptember 30,\nSeptember 30,\nFederal income tax benefit attributable to:\nCurrent operations\n$ (29,558 )\n$ (20,934 )\nRelated party accruals\n-\n-\nLess: change in valuation allowance\n29,558\n20,934\nNet provision for Federal income taxes\n$ -\n$ -\nThe cumulative tax effect at the expected rate of 21% of significant items comprising our net deferred tax amount is as follows:\nSchedule of deferred taxes\nSeptember 30,\nSeptember 30,\nDeferred tax asset attributable to:\nNet operating loss carry over\n$ 8,624\n$ 8,985\nRelated party accruals\n-\n-\nLess: valuation allowance\n(8,624 )\n(8,985 )\nNet deferred tax asset\n$ -\n$ -\nNote 9 - SUBSEQUENT EVENTS\nIn accordance with SFAS 165 (ASC 855-10) the Company has analyzed its operations subsequent to September 30, 2023 to the date these financial statements were issued and has determined that it does not have any material subsequent events to disclose in these financial statements.\nManagement expects that its business will be impacted to some degree, but the significance of the impact of the COVID-19 outbreak on the Companys business and the duration for which it may have an impact cannot be determined at this time."
}