{
    "cik": "1892316",
    "company": "Longduoduo Co Ltd",
    "filing_type": "10-K",
    "filing_date": "2023-11-14",
    "period_of_report": "2023-06-30",
    "sic": "8000",
    "state_of_inc": "NV",
    "state_location": "F4",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1892316/0001213900-23-086498-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1892316/000121390023086498/f10k2023_longduoduo.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1892316/0001213900-23-086498.txt",
    "filename": "1892316_10K_2023_0001213900-23-086498.htm",
    "content": "Item 1. Business\nCorporate Structure\nLongduoduo Company Limited (Longduoduo) was incorporated in the State of Nevada on October 25, 2021. Longduoduos principal corporate address is 419, Floor 4, Comprehensive Building, Second Light Hospital, Ordos Street, Yuquan District, Hohhot, Inner Mongolia, China, 010000. Our telephone number is +86 (0472) 510 4980. Our registered agent for service of process is Incorp Services, Inc., 3773 Howard Hughes Pkwy, Suite 500S, Las Vegas Nevada 89169-6014. Our website address is www.longduoduo.net. Our website and the information contained on, or that can be accessed through, the website is not deemed to be incorporated by reference in, and is not considered part of, this prospectus, and the inclusion of our website address in this prospectus is an inactive textual reference only. You should not rely on any such information in making your decision whether to purchase our common stock.\nLongduoduo through its operating subsidiaries, which are headquartered in Hohhot, Ordos, Baotou and Ulanqab of China, is engaged in the business of providing comprehensive and high-quality preventive healthcare solutions and agent sales of preventive healthcare solutions. Through third-party healthcare service providers, we provide a wide range of comprehensive preventive healthcare services including disease screening, healthcare treatments, healthcare products and other services. The Company mainly focus on prevention of myocardial infarction, cerebral infarction, hemiplegia, and cardiovascular and cerebrovascular diseases. Our customers are primarily individual customers who have been introduced by our other customers and our sales agents. Longduoduo also focus on agent sales of healthcare services and products. Longduoduo currently has 65 full-time employees.\nThe following chart describes our current corporate structure:\nLongduoduo Company Limited (Hong Kong) (Longduoduo HK), was established on July 26, 2021 under the laws of Hong Kong. On October 26, 2021, Longduoduo issued 30,000,000 shares of its common stock to the original shareholders of Longduoduo HK, in exchange for 100% of the outstanding shares of Longduoduo HK (the Share Exchange).\nLongduoduo Health Technology Company Limited (Longduoduo Health Technology), a privately held Limited Company, registered in Inner Mongolia, China on August 20, 2020. On August 16, 2021, Longduoduo HK acquired 100% of Longduoduo Health Technology from the original shareholders of Longduoduo Health Technology.\nInner Mongolia Qingguo Health Consulting Company Limited (Qingguo), a privately held Limited Company, registered in Inner Mongolia, China on June 18, 2020. On September 8, 2020, Longduoduo Health Technology acquired 90% of Qingguo from the original shareholders of Qingguo.\nInner Mongolia Rongbin Health Consulting Company Limited (Rongbin), a privately held Limited Company, registered in Inner Mongolia, China on March 18, 2021. Longduoduo Health Technology has controlled 80% of Rongbin since inception.\nInner Mongolia Chengheng Health Consulting Company Limited (Chengheng), a privately held Limited Company, registered in Inner Mongolia, China on April 9, 2021. Longduoduo Health Technology has controlled 80% of Chengheng since inception.\nInner Mongolia Tianju Health Consulting Company Limited (Tianju), a privately held Limited Company registered in Inner Mongolia, China on July 5, 2021. Longduoduo Health Technology has controlled 51% of Tianju since inception.\nThe transactions summarized above are treated in our financial statements as a corporate restructuring (reorganization) of entities under common control, as each of the seven entities have at all times been under the control of Mr. Zhang Liang. Therefore, in accordance with ASC 805-50-45-5, the current capital structure has been retroactively presented in prior periods as if such structure existed at that time and the entities under common control are presented on a combined basis for all periods. Since all of the subsidiaries were under common control for all periods presented, the results of these subsidiaries are included in the Companys financial statements for all periods.\nOur Business\nOur operating subsidiaries, Longduoduo Health Technology, Qingguo, Rongbin, Chengheng and Tianju, through third-party healthcare service providers, provide comprehensive and high-quality preventive healthcare solutions, and also provide agent sales of preventive healthcare solutions. These preventive healthcare solutions include a wide range of comprehensive preventive healthcare services, including disease screening, healthcare treatments, healthcare products and other services. The Company mainly focuses on prevention of myocardial infarction, cerebral infarction, hemiplegia, and cardiovascular and cerebrovascular diseases.\nOur operating subsidiaries cooperate with our third-party healthcare service providers such as hospitals to serve customers located in Hohhot, Ordos, Baotou and Ulanqab of China. We believe that by building a network of third-party healthcare service providers, product suppliers and our sales agents, we can offer a broader array of products and services to potential customers. Working with our third-party healthcare service providers, the Company provides preventive healthcare solutions including the below:\n● Meridian-regulating and Consciousness-restoring Iatrotechnics- a traditional Chinese medicine treatment that is anti-thrombotic to prevent and treat cardiovascular and cerebrovascular diseases.\n● Double Blood Purification - treatment for cardiovascular and cerebrovascular diseases that involves the removal of pathogens and toxins from the blood through physical means such as filtration.\n● Immunological Ozonated Autohemotherapy; the Third-generation Ozone Therapy Device - Autologous Blood Immunotherapy - prevention and treatment of cardiovascular and cerebrovascular diseases relying on the use of an ozone therapy device to remove pathogens and toxins from the blood.\n● PRP (platelet-rich plasma) - prevention and treatment of joint inflammation and injury through the use of platelet rich plasma.\n● Relaxation therapy - a traditional Chinese medicine treatment that is used to treat joint function limitation caused by soft tissue adhesion such as periarthritis of shoulder\n● Vegetative Nerve Regulation - a treatment to treat neck, shoulder, back and leg pain\n● Microwave Therapy - through the use of specific equipment, heat is provided deep into the skin to reduce inflammation, detumescence, relieve pain and improve tissue blood circulation, prevent and cure lumbar muscle strain, arthritis, periarthritis of shoulder and other diseases.\nAll medical services above are provided by our healthcare service providers that are licensed medical institutions such as hospitals or medical clinics. These medical services are provided directly to our customer by our healthcare service providers, and our healthcare service providers bear the risk in medical procedures.\nOur operating subsidiaries have contracted with six third-party healthcare service providers. The contracts are set out below:\n● Leasing and Cooperation Agreement, dated March 26, 2021 and expiring on March 31, 2026, by and between Inner Mongolia Qinguo Health Consulting Co., Ltd. and Hohhot Aihua Traditional Chinese Medicine Hospital, which is located in Hohhot. Under the terms of this agreement, Hohhot Aihua Traditional Chinese Medicine Hospital offers services such as Immunological Ozonated Autohemotherapy, Meridian-regulating and Consciousness-restoring Iatrotechnics, PRP, Relaxation therapy, Vegetative Nerve Regulation (anterior) and other conventional therapies.\n● Leasing and Cooperation Agreement, dated October 15, 2020 and expiring on October 15, 2025, by and between Longduoduo Health Technology Co., Ltd and Batou Jinshi Zhongyi Nephropathy Hospital, which is located in Baotou. Under the terms of this agreement, Batou Jinshi Zhongyi Nephropathy Hospital offers services such as Meridian-regulating and Consciousness-restoring Iatrotechnics, Double Blood Purification and Immunological Ozonated Autohemotherapy etc.\n● Cooperation Agreement, dated May 29, 2021 and expiring on May 28, 2026, by and between Inner Mongolia Chengheng Health Consulting Co., Ltd and Zhongyi Hospital Branch of Inner Mongolia Jiuzun Health Examination Co., Ltd, which is located in Ordos. Under the terms of this agreement, Zhongyi Hospital Branch of Inner Mongolia Jiuzun Health Examination Co., Ltd offers services such as the Third-generation Ozone Therapy Device - Autologous Blood Immunotherapy etc.\n● Leasing and Cooperation Agreement, dated June 20, 2021 and expiring on June 19, 2022, by and between Longduoduo Health Technology Co., Ltd and Ulanqab Mengzhong Rehabilitation TCM Hospital Co., Ltd, which is located in Ulanqab. Under the terms of this agreement, Ulanqab Mengzhong Rehabilitation TCM Hospital Co., Ltd offers services such as Immunological Ozonated Autohemotherapy, Meridian-regulating and Consciousness-restoring Iatrotechnics, PRP, Relaxation therapy, Vegetative Nerve Regulation and other conventional therapies.\n● Cooperation Contract for Microwave Therapy, dated March 28, 2021 and expiring on March 28, 2024, by and between Inner Mongolia Rongbin Health Consulting Co., Ltd and Wu Yumei, which is located in Baotou. Under the terms of this agreement, Wu Yumei offers services such as Microwave Therapy.\n● Cooperation Agreement, dated September 5, 2021 and expiring on September 4, 2026, by and between Longduoduo Health Technology Co., Ltd and Ordos Xinhai Yihecheng Mengzhongyi Hospital, which is located in Ordos. Under the terms of this agreement, Ordos Xinhai Yihecheng Mengzhongyi Hospital offers +services such as Immunological Ozonated Autohemotherapy, 2000ml Immunological Ozonated Autohemotherapy and Meridian-regulating and Consciousness-restoring Iatrotechnics etc.\nOur operating subsidiaries pay service fees to these third-party healthcare service providers based on the number of health products, medical examinations and the services they provide for our customers. We carefully select our third-party healthcare service provider based on our internal assessment of the quality of the providers institution and staff. We assess potential third-party healthcare service providers and chose future third-party healthcare service providers that fit our business based on the following points:\n● Services-whether service providers provide the required or complementary services, the venue & qualifications for the cooperation programs as well as the management of medical quality & safety, medical staff, medicines and consumables etc;\n● Location- whether the venue is convenient for our customers.\n● Price- whether the medical examination and treatment price is acceptable.\n● Reputation-whether the providers have a good reputation.\n● Equipment-whether the provider possess advanced medical equipment.\nFrom June of 2023, the Company began to engage in agent sales business and focused on the sales of preventive healthcare solutions from our providers. Our operating subsidiaries have contracted with Inner Mongolia Honghai Health Management Co., LTD (Honghai). The contracts are set out below:\nSales Agency Agreements, dated June 20, 2023 and expiring on June 20, 2026, by and between Longduoduo Health Technology Co., Ltd, Inner Mongolia Rongbin Health Consulting Co., Ltd, Inner Mongolia Chengheng Health Consulting Co., Ltd, Inner Mongolia Qinguo Health Consulting Co., Ltd, Inner Mongolia Tianju Health Consulting Company Limited and Inner Mongolia Honghai Health Management Co., LTD. Under the terms of these agreements, our operating subsidiaries provide agent sales of Honghais preventive healthcare solutions such as Immunological Ozonated Autohemotherapy, 2000ml Immunological Ozonated Autohemotherapy and Meridian-regulating and Consciousness-restoring Iatrotechnics etc.\nIn the long run, by leveraging our growing network of medical centers, large and loyal customer base, established demographic and disease information database, we plan to expand the scope of our service offerings and ultimately establish our company as a leading health management service provider and sales agency in China. We intend to achieve our goal by implementing the following strategies:\n● further expanding our product offerings;\n● continuing to expand our network coverage nationwide; and\n● further upgrading our service standards to enhance the customer experience.\nThe successful execution of our business plan is subject to risks and uncertainties related to our business and industry, including those relating to our ability to:\n● maintain and enhance the recognition and reputation of our Longduoduo brand;\n● compete effectively;\n● manage our growth or execute our strategies effectively;\n● provide superior customer experience and offer services at attractive prices to meet customer needs and preferences;\n● manage and expand our relationships with suppliers and third-party service providers; and\n● secure and retain the services of qualified personnel.\nWe face significant competition from two main types of competitors: the medical examination departments of major public hospitals and private medical examination companies. Some of our current or future competitors may have longer operating histories, greater brand recognition, better supplier relationships, larger customer bases or greater financial, technical or marketing resources than we do. There is no assurance that we will be able to successfully compete against these larger and better funded competitors.\nOur performance will be largely dependent on the talents and efforts of highly skilled individuals. Future success depends on our continuing ability to identify, hire, develop, motivate and retain highly qualified personnel for all areas of our organization. Competition for such qualified employees is intense. If we do not succeed in attracting excellent personnel or in retaining or motivating them, we may be unable to grow effectively.\nWe rely on our third-party healthcare service providers to provide services to our customers under cooperation arrangements with us. We require and expect these third-party healthcare service providers to possess the licenses and qualifications that are required for their operations and to adhere to certain performance standards both in terms of customer service and the quality of the medical care that they provide. We generally do not have control over the quality of service or medical care that these third-parties provide. They may not at all times possess the permits or qualifications required by laws and regulations or may fail to meet other regulatory requirements for their operations. In addition, they may engage in conduct which our customers find unacceptable, including providing poor service, mishandling sensitive personal healthcare information and committing medical malpractice.\nOperating Licenses\nOur products and services are subject to regulation by governmental agencies in the PRC and Inner Mongolia Province. Business and company registrations are certified on a regular basis and must be in compliance with the laws and regulations of the PRC and provincial and local governments and industry agencies, which are controlled and monitored through the issuance of licenses. Our licenses include:\n● Longduoduo Health Technologys operating license enables us to undertake medical information consulting services, corporate management consulting, health management consulting services and so on. The registration number is 91150104MA0QTDXG5T, which is valid from August 20, 2020, and expires on August 19, 2050.\n● Qingguos operating license enables us to undertake sales of food, health management consulting services; medical information consulting services and so on. The registration number is 91150104MA13Q5X152, which is valid from June 18, 2020, with no expiration date.\n● Rongbins operating license enables us to undertake medical information consulting services, corporate management consulting, health management consulting services and so on. The registration number is 91150207MA13UKC301, which is valid from March 18, 2021, and expires on March 17, 2051.\n● Chenghengs operating license enables us to undertake medical information consulting services, corporate management consulting, health management consulting services and so on. The registration number is 91150602MA7YN4JE2Q, which is valid from April 09, 2021, and expires on April 08, 2051.\n● Tianjus operating license enables us to undertake sales of class I medical equipment, pre-packaged food, hygiene products, cosmetics, and disinfection products; health management consulting services; medical information consulting services; software development; biotechnology promotion services; beauty services (excluding medical beauty), technical services, and technology Consultation; leasing of medical equipment. The registration number is 91150902MA7YPWL408, which is valid from July 5, 2021 to July 4, 2051.\nCompetition\nWe face significant competition from two main types of competitors: the medical examination departments of major public hospitals and private medical examination companies. The private medical examination market is further segmented into (i) large national companies; (ii) regional providers; (iii) numerous local independent medical examination centers located in nearly every city in China; and other sales agencies of health services.\nWe believe our primary competitive advantages over our competitors include:\n● strong sales and marketing efforts; and\n● the innovation of the market business idea and flexible management mechanism.\nWe believe that we are well-positioned to effectively compete on the basis of the factors listed above. However, some of our current or future competitors may have longer operating histories, greater brand recognition, better supplier relationships, larger customer bases or greater financial, technical or marketing resources than we do. There is no assurance that we will be able to successfully compete against these larger and better funded competitors.\nIncome Taxes\nUnited States\nLongduoduo Company Limited is subject to a tax rate of 21% in the United States of America.\nHong Kong\nLongduoduo HK was incorporated in Hong Kong and is subject to Hong Kong profits tax. Longduoduo HK is subject to Hong Kong taxation on its activities conducted in Hong Kong and income arising in or derived from Hong Kong. The applicable statutory tax rate is 16.5%. The Company did not have any income (loss) subject to the Hong Kong profits tax.\nChina\nLongduoduo Health Technology and subsidiaries are subject to a 25% standard enterprise income tax in the PRC. There was no provision for income taxes for the year ended June 30, 2023 and 2022.\nEmployees\nThe Company has 65 full-time employees. Of those 65, Qingguo has 15 full-time employees, Rongbin has 21 full-time employees, Chengheng has 9 full-time employees, Tianju has 10 full-time employees and Longduoduo Health Technology has 10 full-time employees.\nThe Companys employees include 19 with management responsibilities, 17 with administrative and operations responsibilities, and 29 responsible for customer services.\nAll of our employees are located in the PRC. None of our employees are represented by a labor union or similar collective bargaining organization. Item 1A. Risk Factors.\nAn investment in our common stock involves a high degree of risk. You should carefully consider the following risk factors and other information in this 10K before deciding to invest in our Company. If any of the following risks actually occur, our business, financial condition and results of operations could be seriously harmed. As a result, the trading price of our common stock could decline and you could lose all or part of your investment.\nRisks Related to Our Business\nOur independent registered public accounting firm has expressed substantial doubt about our ability to continue as a going concern.\nThe Companys operations have been financed primarily by advances and loans from related parties and proceeds from sales of shares. Zhang Liang was the primary sources of financing for the early operations of the entity. Nevertheless, there can be no assurance that we would be able to raise the additional funding needed to implement our business plans or cover unanticipated costs.\nSince we are an early stage company, have not generated significant revenues and have experienced recurring losses, an investment in the shares offered herein is highly risky and could result in a complete loss of your investment if we are unsuccessful in implementing our business plans.\nFurther, we cannot guarantee that we will be successful in realizing sufficient revenues or in achieving or sustaining positive cash flows at any time in the future. Any such failure could result in the possible closure of our business or force us to seek additional financing through loans or additional sales of our equity securities to continue business operations, which could dilute the value of any shares you purchase.\nChanges in United States and China relations, as well as relations with other countries, and/or regulations may adversely impact our business, our operating results, our ability to raise capital and the market price of our shares.\nThe U.S. government, including the SEC, has made statements and taken certain actions that led to changes to United States and international relations, and will impact companies with connections to the United States or China, including imposing several rounds of tariffs affecting certain products manufactured in China, imposing certain sanctions and restrictions in relation to China and issuing statements indicating enhanced review of companies with significant China-based operations. It is unknown whether and to what extent new legislation, executive orders, tariffs, laws or regulations will be adopted, or the effect that any such actions would have on companies with significant connections to the U.S. or to China, our industry or on us. Any unfavorable government policies on cross-border relations and/or international trade, including increased scrutiny on companies with significant China-based operations, capital controls or tariffs, may affect our ability to raise capital and the market price of our shares.\nFurthermore, the SEC has issued statements primarily focused on companies with significant China-based operations, such as us. For example, on July 30, 2021, Gary Gensler, Chairman of the SEC, issued a Statement on Investor Protection Related to Recent Developments in China, pursuant to which Chairman Gensler stated that he has asked the SEC staff to engage in targeted additional reviews of filings for companies with significant China-based operations. The statement also addressed risks inherent in companies with a Variable Interest Entity, or a VIE structure. We do not have a VIE structure and are not in an industry that is subject to foreign ownership limitations by China. Further, we believe that we have robust disclosures relating to our operations in China, including the relevant risks noted in Chairman Genslers statement. However, it is possible that the Companys periodic reports and other filings with the SEC may be subject to enhanced review by the SEC and this additional scrutiny could affect our ability to effectively raise capital in the United States.\nIn response to the SECs July 30 statement, the China Securities Regulatory Commission (CSRC) announced on August 1, 2021, that it is our belief that Chinese and U.S. regulators shall continue to enhance communication with the principle of mutual respect and cooperation, and properly address the issues related to the supervision of China-based companies listed in the U.S. so as to form stable policy expectations and create benign rules framework for the market. While the CSRC will continue to collaborate closely with different stakeholders including investors, companies, and relevant authorities to further promote transparency and certainty of policies and implementing measures, it emphasized that it has always been open to companies choices to list their securities on international or domestic markets in compliance with relevant laws and regulations.\nIf any new legislation, executive orders, tariffs, laws and/or regulations are implemented, if existing trade agreements are renegotiated or if the U.S. or Chinese governments take retaliatory actions due to the recent U.S.-China tension, such changes could have an adverse effect on our business, financial condition and results of operations, our ability to raise capital and the market price of our shares.\nCOVID-19 has adversely impacted our business and may further impact our business, financial results and liquidity for an unknown period of time.\nThe COVID-19 pandemic has led government and other authorities to impose measures intended to control its spread, including restrictions on freedom of movement, gatherings of large numbers of people, and temporary closure of business operations. With respect to the Longduoduo business, the primary adverse result of the COVID-19 pandemic has been a serious interruption from time to time caused by temporary closure of business operations, especially the third-party healthcare service providers who were required to temporarily close. In particular, as our third-party healthcare service provider are the key to patients treatment, our inability to supply third-party healthcare services due to COVID-19 restrictions seriously delayed the growth of our business.\nIn response to COVID-19, we took steps to reduce operating costs and improve efficiency, including slowing down our business plan. The interruption of our third-party healthcare services supply and the steps we took to reduce the risk to our employees from COVID-19 both negatively impacted our schedule for achieving development of our business.\nSince December 2022, many of the restrictive measures previously adopted by the PRC governments at various levels to control the spread of the COVID-19 virus have been revoked or replaced with more flexible measures. The revocation or replacement of the restrictive measures to contain the COVID-19 pandemic could have a positive impact on the Companys normal operations.\nWe are unable to predict the extent to which the pandemic and related impacts may adversely impact our business operations, financial performance, consolidated results of operations and consolidated financial position in the future or interfere with the achievement of our strategic objectives.\nWe rely on third party providers to provide our offered services and could be liable and suffer reputational harm if a third-party service provider provides inferior service or harms a customer, which may have a material adverse effect on our business, financial condition, results of operations and prospects.\nWe rely on our third-party healthcare service providers to provide services to our customers under cooperation arrangements with us. We require and expect these third-party healthcare service providers to possess the licenses and qualifications that are required for their operations and to adhere to certain performance standards both in terms of customer service and the quality of the medical care that they provide. We generally do not have control over the quality of service or medical care that these third-parties provide. They may not at all times possess the permits or qualifications required by laws and regulations or may fail to meet other regulatory requirements for their operations. In addition, they may engage in conduct which our customers find unacceptable, including providing poor service, mishandling sensitive personal healthcare information and committing medical malpractice. We could be exposed to reputational harm and possible liability as a result of our having serviced a customer through a third-party service provider that performs unsatisfactorily, which may result in a materially adverse effect on our business, financial condition, results of operations and prospects.\nA computer system failure, security breach or a breach of data privacy or security obligations may disrupt our business, damage our reputation and adversely affect our results of operations, financial condition and cash flows.\nWe rely on computer and information systems and internet and network connectivity to conduct a large portion of our business operations. This includes the need to securely store, process and transmit confidential information, including personal information. In many cases this also includes transmission and processing to or through commercial customers, business partners and third-party service providers. The introduction of new technologies, computer system failures, cyber-crime attacks or security or privacy breaches may materially disrupt our business operations, damage our reputation, result in regulatory and litigation exposure, investigation and remediation costs, and materially and adversely affect our results of operations, financial condition and cash flows.\nThe information security risk that we face includes the risk of malicious outside forces using public networks and other methods, including social engineering and the exploitation of targeted offline processes, to attack our systems and information. It also includes inside threats, both malicious and accidental. For example, human error and lack of sufficiently automated processing can result in improper information exposure or use. We also face risk in this area due to our reliance in many cases on third-party systems, all of which may face cyber and information security risks of their own. Third-party administrators or distribution partners used by us or our subsidiaries may not adequately secure their own information systems and networks, or may not adequately keep pace with the dynamic changes in this area. Potential bad actors that target us and our applicable third parties may include, but are not limited to, criminal organizations, foreign government bodies, political factions, and others. There is no guarantee that the measures that we take will be sufficient to stop all types of attacks or mitigate all types of information security or privacy risks.\nIf we fail to maintain adequate processes and controls or if we or our business partners fail to comply with relevant laws and regulations, policies and procedures, misappropriation or intentional or unintentional inappropriate disclosure or misuse of personal information or other confidential information could occur. Such control inadequacies or non-compliance could cause disrupted operations and misstated or unreliable financial data, materially damage our reputation or lead to increased regulatory scrutiny or civil or criminal penalties or litigation, which, in turn, could have a material adverse effect on our business, financial condition and results of operations. In addition, we analyse personal information and customer data to better manage our business, subject to applicable laws and regulations and other restrictions. It is possible that additional regulatory or other restrictions regarding the use of such techniques may be imposed. Such restrictions and obligations could have material impacts on our business, financial conditions and/or results of operations.\nWe operate in a competitive environment and competing facilities and services could harm our business, financial condition, results of operations and prospects.\nThere are numerous hospitals and private clinics providing medical examination services and, at the high end of the market, many Chinese hospitals have VIP wards that cater to affluent customers. We face significant competition from two main types of competitors: the medical examination departments of major public hospitals and private medical examination companies. The private preventive healthcare market is further segmented into large franchise companies, regional providers and numerous local independent medical examination centers located in nearly every city in China. We compete primarily on the basis of price, quality of service, convenience, location, brand recognition and reputation. We do not have the same level of brand recognition as some of the medical examination centers of large public hospitals, and in some regional markets our brand is not as established and our geographical coverage is not as extensive as that of our private competitors. Furthermore, we lack the equipment necessary for certain highly technical medical tests. Many competing hospitals that are government-owned are exempt from income taxes on their medical income, which provides them with a significant competitive advantage over us. Furthermore, competing hospitals, clinics or other facilities may commence new operations or expand existing operations, which would increase their competitive position and potentially erode our business, financial condition, results of operations and prospects.\nWe have incurred significant net losses and we may continue to experience significant losses in the future.\nWe have incurred significant net losses since our inception. We had net income of $21,085 and net loss of $7,563,565 in the 2023 and 2022 fiscal years, respectively. We had an accumulated deficit of $7,885,080 as of June 30, 2023. We cannot assure you that we will be able to generate net profits or positive cash flow from operating activities in the future. The deficit occurred because the company paid a lot of marketing expense to exploit the market and expand our scale. We intend to continue to exploit the market and expand our nationwide network coverage. As a result of these planned expenditures, we believe that we may incur net losses or modest income for some time in the future.\nWe may not be able to effectively control and manage our planned growth.\nWe have limited operational, administrative and financial resources, which may be inadequate to sustain the growth we want to achieve. If our business and markets grow and develop, it will be necessary for us to finance and manage expansion accordingly. In addition, we may face challenges in managing our expanding service offerings. Such growth would place increased demands on our existing management, employees and facilities. Our failure to meet these demands could interrupt or adversely affect our operations and cause administrative inefficiencies. Additionally, failure to execute our planned growth strategy could have a material adverse effect on our financial condition and results of operation.\nExpansion of our healthcare services could be affected by the expansion of government-sponsored social medical insurance available to the Chinese population that is not available now.\nMost government-sponsored social medical insurance in China does not cover medical examinations. In certain locations where government-sponsored social medical insurance covers medical examinations, we have cooperating hospitals that are qualified institutions under such insurance coverage. Currently, most of our individual customers pay directly for medical examinations. If government-sponsored social medical insurance is further expanded to cover medical examinations in more geographical locations, and Longduoduo does not become a qualified institution for such coverage, certain of our customers may discontinue or terminate their relationship with us, and certain individual customers may opt to use other medical institutions covered by such medical insurance rather than pay for our services. As a result, the expansion of government-sponsored social medical insurance could materially and adversely affect our business, financial condition and results of operations.\nAdditional capital, if needed, may not be available on acceptable terms, if at all, and any additional financing may be on terms adverse to your interests.\nWe may need additional cash to fund our operations. Our capital needs will depend on numerous factors, including market conditions and our profitability. We cannot be certain that we will be able to obtain additional financing on favorable terms, if at all. If additional financing is not available when required or is not available on acceptable terms, we may be unable to fund expansion, successfully promote our brand name, develop or enhance our services, take advantage of business opportunities, or respond to competitive pressures or unanticipated requirements, any of which could seriously harm our business and reduce the value of your investment.\nIf we are able to raise additional funds if and when needed by issuing additional equity securities, you may experience significant dilution of your ownership interest and holders of these new securities may have rights senior to yours as a holder of our common stock. If we obtain additional financing by issuing debt securities, the terms of those securities could restrict or prevent us from declaring dividends and could limit our flexibility in making business decisions. In this case, the value of your investment could be reduced.\nThere is no assurance that we will be able to obtain additional funding if it is needed, or that such funding, if available, will be obtainable on terms and conditions favorable to or affordable by us. If we cannot obtain needed funds, we may be forced to curtail our activities.\nRisks Relating to our Management\nThe loss of the services of any of our officers or our failure to timely identify and retain competent personnel could negatively impact our ability to develop our products and sales.\nThe development of our business will continue to place a significant strain on our limited personnel, management, and other resources. Our future success depends upon the continued services of our executive officers, Zhang Liang, our President and Chairman of the Board of Director, Zhou Hongxiao, Chief Executive Officer (CEO), Secretary and director, and our Chief Financial Officer, Kang Liping. They are developing our business, which will depend on our ability to identify and retain competent employees with the skills required to execute our business objectives. The loss of the services of any of our officers or our failure to timely identify and retain competent personnel could negatively impact our ability to develop our products and services, which could adversely affect our financial results and impair our growth.\nIf we are unable to hire, retain or motivate qualified personnel, consultants, independent contractors, and advisors, we may not be able to grow effectively.\nOur performance will be largely dependent on the talents and efforts of highly skilled individuals. Future success depends on our continuing ability to identify, hire, develop, motivate and retain highly qualified personnel for all areas of our organization. Competition for such qualified employees is intense. If we do not succeed in attracting excellent personnel or in retaining or motivating them, we may be unable to grow effectively. In addition, all future success depends largely on our ability to retain key consultants and advisors. We cannot assure that any skilled individual will agree to become an employee, consultant, or independent contractor of Longduoduo Company Limited. Our inability to retain their services could negatively impact our business and our ability to execute our business strategy.\nOur internal controls over financial reporting may not be effective and our independent registered public accounting firm may not be able to certify as to their effectiveness, which could have a significant and adverse effect on our business and reputation.\nAs a new public reporting company, we will be in a continuing process of developing, establishing, and maintaining internal controls and procedures that will allow our management to report on, and our independent registered public accounting firm to attest to, our internal controls over financial reporting if and when required to do so under Section 404 of the Sarbanes-Oxley Act of 2002. Although our independent registered public accounting firm is not required to attest to the effectiveness of our internal control over financial reporting pursuant to Section 404(b) of the Sarbanes-Oxley Act until the date we are no longer an emerging growth company, our management will be required to report on our internal controls over financial reporting under Section 404. If we fail to achieve and maintain the adequacy of our internal controls, we would not be able to conclude on an ongoing basis that we have effective internal controls over financial reporting in accordance with Section 404. At such time, our independent registered public accounting firm may issue a report that is adverse in the event it is not satisfied with the level at which our controls are documented, designed or operating. Moreover, our testing, or the subsequent testing by our independent registered public accounting firm that must be performed may reveal other material weaknesses or that the material weaknesses have not been fully remediated. If we do not remediate our material weaknesses, or if other material weaknesses are identified or we are not able to comply with the requirements of Section 404 in a timely manner, our reported financial results could be materially misstated or could subsequently require restatement, we could receive an adverse opinion regarding our internal controls over financial reporting from our independent registered public accounting firm and we could be subject to investigations or sanctions by regulatory authorities, which would require additional financial and management resources, and the market price of our stock could decline.\nOur board of directors acts as our compensation committee, which presents the risk that compensation and benefits paid to those executive officers who are board members and other officers may not be commensurate with our financial performance.\nA compensation committee consisting of independent directors is a safeguard against self-dealing by company executives. Our board of directors, which consists of two officers and two independent members, acts as the compensation committee for the Company and determines the compensation and benefits of our executive officers, will administer our employee stock and benefit plans, and reviews policies relating to the compensation and benefits of our employees. Our lack of an independent compensation committee presents the risk that an executive officer on the board may have influence over his or her personal compensation and may obtain benefits levels that may not be commensurate with our financial performance.\nLimitations on director and officer liability and indemnification of our Companys officers and directors by us may discourage shareholders from bringing a lawsuit against an officer or director.\nOur Companys certificate of incorporation and bylaws provide, with certain exceptions as required by governing state law, that a director or officer shall not be personally liable to us or our shareholders for breach of fiduciary duty as a director or officer, except for acts or omissions which involve intentional misconduct, fraud or knowing violation of law, or unlawful payments of dividends. These provisions may discourage shareholders from bringing a lawsuit against a director or officer for breach of fiduciary duty and may reduce the likelihood of derivative litigation brought by shareholders on the Companys behalf against a director or officer.\nOur management has limited experience managing a public company.\nAt the present time, our management has limited experience in managing a public company. This may hinder our ability to establish effective controls and systems and comply with all applicable requirements associated with being a public company. If compliance problems result, these problems could have a material adverse effect on our business, financial condition or results of operations. As a public company, we will incur significant legal, accounting and other expenses that we did not incur as a private company. In addition, the Sarbanes-Oxley Act of 2002, or Sarbanes-Oxley Act, and the Dodd-Frank Act of 2010, as well as rules subsequently implemented by the SEC, have imposed various requirements on public companies, including requiring changes in corporate governance practices. Our management and other personnel will need to devote a substantial amount of time to our new compliance requirements. Moreover, these requirements will increase our legal, accounting and financial compliance costs and will make some activities more time-consuming and costly. For example, we expect it will be difficult and expensive for us to obtain director and officer liability insurance. These requirements could also make it more difficult for us to attract and retain qualified persons to serve on our board of directors, our board committees or as executive officers.\nWe may have difficulty establishing adequate management, legal and financial controls in the PRC.\nWe may have difficulty in hiring and retaining a sufficient number of qualified employees to serve as our management staff. As a result of these factors, we may experience difficulty in establishing management, legal and financial controls, collecting financial data and preparing financial statements, books of account and corporate records and instituting business practices that meet western standards. Therefore, we may, in turn, experience difficulties in implementing and maintaining adequate internal controls as will be required under Section 404 of the Sarbanes Oxley Act of 2002.\nRisks Related to Doing Business in the PRC\nFailure to comply with any PRC laws and regulations may adversely affect our business, investments and results of operations.\nOur China operations are subject to PRC laws and regulations including but not limited to the laws and regulations on taxation, employment and social welfare, product quality and consumer protection, foreign investment, foreign exchange, online trading and E-commerce, food business and so on. Compliance with, and monitoring of, applicable laws and regulations may be difficult, time consuming and costly. A failure to comply with applicable laws or regulations, as interpreted and applied, could have a material adverse effect on our business and results of operations.\nChanges in the policies of the PRC government could have an adverse effect on our business.\nPolicies of the PRC government can have significant effects on the economic conditions in the PRC. Although the PRC government has been pursuing economic reform policies and transitioning to a market-oriented economy, there is no assurance that the government will continue to pursue such policies or that such policies may not be significantly altered, especially in the event of a change in leadership, social or political disruption, or other circumstances affecting the PRCs political, economic and social conditions. Further, regulatory agencies in China may periodically, and sometimes abruptly with little to no advance notice, change their enforcement practices. Therefore, prior enforcement activity, or lack of enforcement activity, is not necessarily predictive of future actions. Our business could be adversely affected by changes in PRC government policies, including but not limited to changes in policies relating to taxation, currency conversion, imports and exports, and ownership of private enterprises.\nUncertainties with respect to the PRC legal system, including uncertainties regarding the enforcement of laws, and sudden or unexpected changes in laws and regulations in China could adversely affect us and limit the legal protections available to you and us.\nOur operating subsidiaries are incorporated under and governed by the laws of the PRC. The PRC legal system is based on written statutes. Prior court decisions may be cited for reference but have limited precedential value. In 1979, the PRC government began to promulgate a comprehensive system of laws and regulations governing economic matters in general, such as foreign investment, corporate organization and governance, commerce, taxation and trade. As a significant part of our business is conducted in China, our operations are principally governed by PRC laws and regulations. However, since the PRC legal system continues to evolve rapidly, the interpretations of many laws, regulations and rules are not always uniform and enforcement of these laws, regulations and rules involves uncertainties, which may limit legal protections available to us. Uncertainties due to evolving laws and regulations could also impede the ability of a China-based company, such as our company, to obtain or maintain permits or licenses required to conduct business in China. In the absence of required permits or licenses, governmental authorities could impose material sanctions or penalties on us. In addition, some regulatory requirements issued by certain PRC government authorities may not be consistently applied by other PRC government authorities (including local government authorities), thus making strict compliance with all regulatory requirements impractical, or in some circumstances impossible. For example, our PRC subsidiary may have to resort to administrative and court proceedings to enforce the legal protection that we enjoy either by law or contract. However, since PRC administrative and court authorities have discretion in interpreting and implementing statutory and contractual terms, it may be more difficult to predict the outcome of administrative and court proceedings and the level of legal protection we enjoy than in more developed legal systems. Furthermore, the PRC legal system is based in part on government policies and internal rules, some of which are not published on a timely basis or at all and may have retroactive effect. As a result, we may not be aware of our violation of these policies and rules until sometime after the violation. Such uncertainties, including uncertainty over the scope and effect of our contractual, property (including intellectual property) and procedural rights, could materially and adversely affect our business and impede our ability to continue our operations.\nIntellectual property rights and confidentiality protections in China may also not be as effective as in the United States or other countries. In addition, we cannot predict the effects of future developments in the PRC legal system on our business operations, including the promulgation of new laws, or changes to existing laws or the interpretation or enforcement thereof. These uncertainties could limit the legal protections available to us and our investors, including you. Moreover, any litigation in China may be protracted and result in substantial costs and diversion of our resources and management attention.\nThe PRC government has significant oversight and discretion over the conduct of our business and may intervene or influence our operations as the government deems appropriate to further regulatory, political and societal goals. The PRC government has recently published new policies that significantly affected certain industries such as the education and internet industries, and we cannot rule out the possibility that it will in the future release regulations or policies regarding our industry that could adversely affect our business, financial condition and results of operations. Furthermore, the PRC government has recently indicated an intent to exert more oversight and control over securities offerings and other capital markets activities that are conducted overseas and foreign investment in China-based companies. Any such intervention in or influence on our business operations or action to exert more oversight and control over securities offerings and other capital markets activities, once taken by the PRC government, could adversely affect the business, financial condition and results of operations and the value of China-based companies, or significantly limit or completely hinder our ability to offer or continue to offer securities to investors and cause the value of such securities to significantly decline or in extreme cases, become worthless.\nPRC regulation of loans to, and direct investments in, PRC entities by offshore holding companies may delay or prevent us from using our capital reserves to make loans or additional capital contributions to our PRC operating subsidiaries.\nAs an offshore holding company with PRC subsidiaries, we may transfer funds to our PRC subsidiaries or finance our operating entity by means of loans or capital contributions. Any capital contributions or loans that we, as an offshore entity, make to our Companys PRC subsidiaries, are subject to PRC regulations. Any loans to our PRC subsidiaries, which are foreign-invested enterprises, cannot exceed statutory limits based on the difference between the amount of our investments and registered capital in such subsidiaries, and shall be registered with SAFE, or its local counterparts. Furthermore, any capital increase contributions we make to our PRC subsidiaries, which are foreign-invested enterprises, are subject to the requirement of making necessary filings in FICMIS, and registration with other government authorities in China. We may not be able to obtain these government registrations or approvals on a timely basis, if at all. If we fail to obtain such approvals or make such registration, our ability to make equity contributions or provide loans to our Companys PRC subsidiaries or to fund their operations may be negatively affected, which may adversely affect their liquidity and ability to fund their working capital and expansion projects and meet their obligations and commitments. As a result, our liquidity and our ability to fund and expand our business may be negatively affected.\nBecause our principal assets are located outside of the United States and because all of our directors and all our officers reside outside of the United States, it may be difficult for you to use the United States Federal securities laws to enforce your rights against us and our officers or to enforce judgments of United States courts against us or them in the PRC.\nAll of our present officers and directors reside outside of the United States. In addition, our operating subsidiaries, Longduoduo Health Technology, Qingguo, Rongbin, Chengheng and Tianju are located in the PRC and substantially all of their assets are located outside of the United States. It may therefore be difficult for investors in the United States to enforce their legal rights based on the civil liability provisions of the United States Federal securities laws against us in the courts of either the United States or the PRC and, even if civil judgments are obtained in courts of the United States, to enforce such judgments in PRC courts. Further, it is unclear if extradition treaties now in effect between the United States and the PRC would permit effective enforcement against us or our officers and directors of criminal penalties, under the United States Federal securities laws or otherwise.\nThe recent joint statement by the SEC and PCAOB and the Holding Foreign Companies Accountable Act all call for additional and more stringent criteria to be applied to emerging market companies upon assessing the qualification of their auditors, especially the non-U.S. auditors who are not inspected by the PCAOB. Furthermore, on June 22, 2021, the U.S. Senate passed the Accelerating Holding Foreign Companies Accountable Act, which amended the HFCA Act and requires the SEC to prohibit an issuers securities from trading on any U.S. stock exchanges if its auditor is not subject to PCAOB inspections for two consecutive years instead of three. These developments could add uncertainties to our business operations.\nOn April 21, 2020, SEC Chairman Jay Clayton and PCAOB Chairman William D. Duhnke III, along with other senior SEC staff, released a joint statement highlighting the risks associated with investing in companies based in or have substantial operations in emerging markets including China. The joint statement emphasized the risks associated with lack of access for the PCAOB to inspect auditors and audit work papers in China and higher risks of fraud in emerging markets.\nOn May 18, 2020, Nasdaq filed three proposals with the SEC to (i) apply minimum offering size requirement for companies primarily operating in Restrictive Market, (ii) adopt a new requirement relating to the qualification of management or board of director for Restrictive Market companies, and (iii) apply additional and more stringent criteria to an applicant or listed company based on the qualifications of the companys auditors.\nOn May 20, 2020, the U.S. Senate passed the Holding Foreign Companies Accountable Act requiring a foreign company to certify it is not owned or controlled by a foreign government if the PCAOB is unable to audit specified reports because the company uses a foreign auditor not subject to PCAOB inspection. If the PCAOB is unable to inspect the companys auditors for three consecutive years, the issuers securities will be prohibited to trade on a national securities exchange or in the over the counter trading market in the U.S. On December 18, 2020, the Holding Foreign Companies Accountable Act was signed into law.\nOn March 24, 2021, the SEC announced that it had adopted interim final amendments to implement congressionally mandated submission and disclosure requirements of the Act. The interim final amendments will apply to registrants that the SEC identifies as having filed an annual report on Forms 10-K, 20-F, 40-F or N-CSR with an audit report issued by a registered public accounting firm that is located in a foreign jurisdiction and that the PCAOB has determined it is unable to inspect or investigate completely because of a position taken by an authority in that jurisdiction. The SEC will implement a process for identifying such a registrant and any such identified registrant will be required to submit documentation to the SEC establishing that it is not owned or controlled by a governmental entity in that foreign jurisdiction, and will also require disclosure in the registrants annual report regarding the audit arrangements of, and governmental influence on, such a registrant.\nOn June 22, 2021, the U.S. Congress passed the Accelerating Holding Foreign Companies Accountable Act, which amends the HFCA Act and require the SEC to prohibit an issuers securities from trading on any U.S. stock exchanges if its auditor is not subject to PCAOB inspections for two consecutive years. This reduced the time period before securities of non-compliant issuers may be prohibited from trading or delisted from three years to two years.\nOn September 22, 2021, the PCAOB adopted a final rule implementing the HFCAA, which provides a framework for the PCAOB to use when determining, as contemplated under the HFCAA, whether the Board is unable to inspect or investigate completely registered public accounting firms located in a foreign jurisdiction because of a position taken by one or more authorities in that jurisdiction.\nOn December 16, 2021, PCAOB issued a report on its determination that the PCAOB is unable to inspect or investigate completely PCAOB-registered public accounting firms headquartered in mainland China and in Hong Kong, a Special Administrative Region of the PRC, because of positions taken by PRC authorities in those jurisdictions. The PCAOB made these determinations pursuant to PCAOB Rule 6100, which provides a framework for how the PCAOB fulfills its responsibilities under the Holding Foreign Companies Accountable Act (the HFCAA). If the PCAOB is unable to inspect or investigate completely a registered public accounting firm headquartered in mainland China or Hong Kong because of a position taken by one or more authorities in mainland China or Hong Kong, investors are deprived of the benefits of such PCAOB inspections, which could cause investors to lose confidence in audit procedures and the quality of financial statements. In addition, under the HFCAA, a companys securities may be prohibited from trading on the U.S. stock exchanges or in the over the counter trading market in the U.S. if its auditor is not inspected by the PCAOB, and this ultimately could result in a companys common stock being delisted.\nThe financial statements in our annual report on Form 10-K for the year ended June 30, 2023 were audited by MICHAEL T. STUDER CPA P.C. (MTS CPA), a U.S.-based accounting firm that is registered with the PCAOB and can be inspected by the PCAOB. Our auditor is headquartered in New York, is subject to inspection by the PCAOB on a regular basis with the last inspection in 2022. We have no intention of dismissing MTS CPA in the future or of engaging any auditor not based in the U.S. and not subject to regular inspection by the PCAOB. There is no guarantee, however, that any future auditor engaged by the Company would remain subject to full PCAOB inspection during the entire term of our engagement.\nHowever, the recent developments would add uncertainties to our situation and we cannot assure you whether regulatory authorities would apply additional and more stringent criteria to us after considering the effectiveness of our auditors audit procedures and quality control procedures, adequacy of personnel and training, or sufficiency of resources, geographic reach or experience as it relates to the audit of our financial statements. It remains unclear what the SECs implementation process related to the June 2021 interim final amendments will entail or what further actions the SEC or the PCAOB will take to address these issues and what impact those actions will have on U.S. companies that have significant operations in the PRC and have securities listed on a U.S. stock exchange (including a national securities exchange or over-the-counter stock market). In addition, the June 2021 interim final amendments and any additional actions, proceedings, or new rules resulting from these efforts to increase U.S. regulatory access to audit information could create some uncertainty for investors, the market price of our common stock could be adversely affected, and we could be delisted if we and our auditor are unable to meet the PCAOB inspection requirement or being required to engage a new audit firm, which would require significant expense and management time.\nRestrictions contained in Chinese law on the ability of overseas securities regulators to collect information in China may deny investors in our Company the benefits of U.S. securities regulation.\nChina has often restricted U.S. regulators access to information and limited regulators ability to investigate or pursue remedies with respect to China-based issuers, generally citing to state secrecy and national security laws, blocking statutes, or other laws or regulations. In addition, according to Article 177 of the PRC Securities Law, which became effective in March 2020, no overseas securities regulator can directly conduct investigations or evidence collection activities within the PRC and no entity or individual in China may provide documents and information relating to securities business activities to overseas regulators without Chinese government approval. The SEC, U.S. Department of Justice, and other U.S. authorities face substantial challenges in bringing and enforcing actions against China-based issuers and their officers and directors. As a result, investors in our Company may not benefit from a regulatory environment that fosters effective enforcement of U.S. federal securities laws.\nAccording to Article 177, there are uncertainties as to the procedures and requisite timing for the U.S. securities regulatory agencies to conduct investigations and collect evidence within the territory of the PRC. If the U.S. securities regulatory agencies are unable to conduct such investigations, there exists a risk that they may determine to suspend or de-register our registration with the SEC and may also delist our securities from OTC Markets or other applicable trading market within the US.\nGovernmental control of currency conversion may affect the value of your investment.\nThe Peoples Republic of China (PRC) government imposes controls on the convertibility of Renminbi (RMB) into foreign currencies and, in certain cases, the remittance of currency out of the PRC. We receive substantially all of our revenues in RMB, which is currently not a freely convertible currency. Shortages in the availability of foreign currency may restrict our ability to remit sufficient foreign currency to pay dividends, or otherwise satisfy foreign currency dominated obligations. Under existing PRC foreign exchange regulations, payments of current account items, including profit distributions, interest payments and expenditures in connection with a commercial transaction, can be made in foreign currencies without prior approval from the PRC State Administration of Foreign Exchange by complying with certain procedural requirements. However, approval from appropriate governmental authorities is required where RMB is to be converted into foreign currency and remitted out of PRC to pay capital expenses such as the repayment of bank loans denominated in foreign currencies.\nThe PRC government also may at its discretion restrict access in the future to foreign currencies for current account transactions. If the foreign exchange control system prevents us from obtaining sufficient foreign currency to satisfy our currency demands, we may not be able to pay certain of our expenses as they come due, finance our cash requirements, service debt or make dividend or other distributions to our shareholders, all of which may adversely affect your investment.\nThe fluctuation of RMB may materially and adversely affect your investment.\nThe value of the RMB against the U.S. dollar and other currencies may fluctuate and is affected by, among other things, changes in the PRCs political and economic conditions. As we rely entirely on revenues earned in the PRC, any significant revaluation of RMB may materially and adversely affect our cash flows, revenues and financial condition. For example, to the extent that we need to convert U.S. dollars we receive from an offering of our securities into RMB for our operations, appreciation of the RMB against the U.S. dollar could have a material adverse effect on our business, financial condition and results of operations. Conversely, if we decide to convert our RMB into U.S. dollars for the purpose of making dividend payments on our common stock or for other business purposes and the U.S. dollar appreciates against the RMB, the U.S. dollar equivalent of the RMB we convert would be reduced. In addition, the depreciation of significant U.S. dollar denominated assets could result in a charge to our income statement and a reduction in the value of these assets.\nWe may become subject to a variety of laws and regulations in the PRC regarding privacy, data security, cybersecurity, and data protection. We may be liable for improper use or appropriation of personal information provided by our customers.\nWe may become subject to a variety of laws and regulations in the PRC regarding privacy, data security, cybersecurity, and data protection. These laws and regulations are continuously evolving and developing. The scope and interpretation of the laws that are or may be applicable to us are often uncertain and may be conflicting, particularly with respect to foreign laws. In particular, there are numerous laws and regulations regarding privacy and the collection, sharing, use, processing, disclosure, and protection of personal information and other user data. Such laws and regulations often vary in scope, may be subject to differing interpretations, and may be inconsistent among different jurisdictions.\nWe expect to obtain information about various aspects of our operations as well as regarding our employees and third parties. We also maintain information about various aspects of our operations as well as regarding our employees. The integrity and protection of our customer, employee and company data is critical to our business. Our customers and employees expect that we will adequately protect their personal information. We are required by applicable laws to keep strictly confidential the personal information that we collect, and to take adequate security measures to safeguard such information.\nThe PRC Criminal Law, as amended by its Amendment 7 (effective on February 28, 2009) and Amendment 9 (effective on November 1, 2015), prohibits institutions, companies and their employees from selling or otherwise illegally disclosing a citizens personal information obtained during the course of performing duties or providing services or obtaining such information through theft or other illegal ways.\nOn November 7, 2016, the Standing Committee of the PRC National Peoples Congress issued the Cyber Security Law of the PRC, or Cyber Security Law, which became effective on June 1, 2017. Pursuant to the Cyber Security Law, network operators must not, without users consent, collect their personal information, and may only collect users personal information necessary to provide their services. Providers are also obliged to provide security maintenance for their products and services and shall comply with provisions regarding the protection of personal information as stipulated under the relevant laws and regulations. We believe that we are in compliance with the Cyber Security Law, given that: (i) our products and services are sold offline; and (ii) we do not have an online platform.\nThe Civil Code of the PRC (issued by the PRC National Peoples Congress on May 28, 2020 and effective from January 1, 2021) provides the main legal basis for privacy and personal information infringement claims under the Chinese civil laws. PRC regulators, including the Cyberspace Administration of China, MIIT, and the Ministry of Public Security have been increasingly focused on regulation in the areas of data security and data protection.\nThe PRC regulatory requirements regarding cybersecurity are constantly evolving. For instance, various regulatory bodies in China, including the Cyberspace Administration of China, the Ministry of Public Security and the SAMR, have enforced data privacy and protection laws and regulations with varying and evolving standards and interpretations. In April 2020, the Chinese government promulgated Cybersecurity Review Measures, which came into effect on June 1, 2020. According to the Cybersecurity Review Measures, operators of critical information infrastructure must pass a cybersecurity review when purchasing network products and services which do or may affect national security.\nIn November 2016, the Standing Committee of Chinas National Peoples Congress passed Chinas first Cybersecurity Law (CSL), which became effective in June 2017. The CSL is the first PRC law that systematically lays out the regulatory requirements on cybersecurity and data protection, subjecting many previously under-regulated or unregulated activities in cyberspace to government scrutiny. The legal consequences of violation of the CSL include penalties of warning, confiscation of illegal income, suspension of related business, winding up for rectification, shutting down the websites, and revocation of business license or relevant permits. In April 2020, the Cyberspace Administration of China and certain other PRC regulatory authorities promulgated the Cybersecurity Review Measures, which became effective in June 2020. Pursuant to the Cybersecurity Review Measures, operators of critical information infrastructure must pass a cybersecurity review when purchasing network products and services which do or may affect national security. On July 10, 2021, the Cyberspace Administration of China issued a revised draft of the Measures for Cybersecurity Review for public comments (Draft Measures), which required that, in addition to operator of critical information infrastructure, any data processor carrying out data processing activities that affect or may affect national security should also be subject to cybersecurity review, and further elaborated the factors to be considered when assessing the national security risks of the relevant activities, including, among others, (i) the risk of core data, important data or a large amount of personal information being stolen, leaked, destroyed, and illegally used or exited the country; and (ii) the risk of critical information infrastructure, core data, important data or a large amount of personal information being affected, controlled, or maliciously used by foreign governments after listing abroad. The Cyberspace Administration of China has said that under the proposed rules companies holding data on more than 1,000,000 users must now apply for cybersecurity approval when seeking listings in other nations because of the risk that such data and personal information could be affected, controlled, and maliciously exploited by foreign governments, The cybersecurity review will also investigate the potential national security risks from overseas IPOs. We do not know what regulations will be adopted or how such regulations will affect us and the quotation of our securities on the OTC Pink Market. In the event that the Cyberspace Administration of China determines that we are subject to these regulations, quotation of our securities on the OTC may be prohibited and we may be subject to fines and penalties. We believe that we will not be subject to the cybersecurity review by the CAC, given that: (i) we are not an operator of critical information infrastructure or a data processor carrying out data processing activities that affect or may affect national security; (ii) we do not possess a large amount of personal information in our business operations; and (iii) data processed in our business does not have a bearing on national security and thus may not be classified as core or important data by the authorities. However, there remains uncertainty as to how the 2021 Measures will be interpreted or implemented and whether the PRC regulatory agencies, including the CAC, may adopt new laws, regulations, rules, or detailed implementation and interpretation related to the 2021 Measures. If any such new laws, regulations, rules, or implementation and interpretation comes into effect, we will take all reasonable measures and actions to comply and to minimize the adverse effect of such laws on us.\nOn June 10, 2021, the Standing Committee of the NPC promulgated the PRC Data Security Law, which became effective on September 1, 2021. The Data Security Law also sets forth the data security protection obligations for entities and individuals handling personal data, including that no entity or individual may acquire such data by stealing or other illegal means, and the collection and use of such data should not exceed the necessary limits The costs of compliance with, and other burdens imposed by, CSL and any other cybersecurity and related laws may limit the use and adoption of our products and services and could have an adverse impact on our business. Further, if the enacted version of the Measures for Cybersecurity Review mandates clearance of cybersecurity review and other specific actions to be completed by companies like us, we face uncertainties as to whether such clearance can be timely obtained, or at all. We believe that we are in compliance with the PRC Data Security Law, given that: (i) Collecting and possessing personal information in our business operations were authorized; and (ii) data processed in our business does not have a bearing on national security and thus may not be classified as core or important data by the authorities. However, there remains uncertainty as to whether the PRC regulatory agencies may adopt new laws, regulations, rules, or detailed implementation and interpretation. If any such new laws, regulations, rules, or implementation and interpretation comes into effect, we will take all reasonable measures and actions to comply and to minimize the adverse effect of such laws on us.\nWe cannot assure you that PRC regulatory agencies, including the CAC, would take the same view as we do, and there is no assurance that we can fully or timely comply with such laws. In the event that we are subject to any mandatory cybersecurity review and other specific actions required by PRC regulatory agencies, we face uncertainty as to whether any clearance or other required actions can be timely completed, or at all. Given such uncertainty, we may be further required to suspend our relevant business, shut down our website, or face other penalties, which could materially and adversely affect our business, financial condition, and results of operations.\nThe Chinese government can take regulatory actions and statements to regulate business operations in China with little to no advance notice at any time, including cracking down on illegal activities in the securities market, enhancing supervision over China-based companies listed overseas using variable interest entity structure, adopting new measures to extend the scope of cybersecurity reviews, and expanding the efforts in anti-monopoly enforcement. Rules and regulations and the enforcement or interpretation thereof in China can also change with little to no advance notice, and actions related to oversight and control over offerings that are conducted overseas in our China based entities could cause the value of Longduoduos securities to significantly decline or be worthless.\nThe Chinese government has taken and continues to take regulatory actions and statements to regulate over virtually every sector of the Chinese economy through regulation and state ownership, sometimes with very little advance notice. Our ability to operate through our subsidiaries in China may be harmed by changes in its laws and regulations, including those relating to taxation, environmental regulations, land use rights, cybersecurity, property and other matters. The central or local governments of these jurisdictions may impose new, stricter regulations or interpretations of existing regulations that would require additional expenditures and efforts on our part to ensure our compliance with such regulations or interpretations. Accordingly, government actions in the future, including any decision not to continue to support recent economic reforms and to return to a more centrally planned economy or regional or local variations in the implementation of economic policies, could result in a material change in our operations in China and could limit or completely hinder our ability to offer or continue to offer securities to investors or require us to divest ourselves of any interest we then hold in China properties or joint ventures. Any such actions (including divesture or similar actions) could result in a material adverse effect on us and on your investment in us and could render our securities and your investment in our securities worthless.\nAs such, the Companys business segments and entities may be subject to various government and regulatory interference in the provinces in which they operate. The Company could be subject to new regulation by various political and regulatory entities, including various local and municipal agencies and government sub-divisions. The Company may incur increased costs necessary to comply with existing and newly adopted laws and regulations or penalties for any failure to comply. As a result, the fast-changing rules and regulation could potentially impact our operation and profitability in China and as a result, cause the value of Longduoduos securities to significantly decline or even become worthless.\nIf the Administration of Overseas Offering and Listing by Domestic Companies (Draft for Comments) and the Administrative Measures for the Filing of Overseas Securities Offering and Listing by Domestic Companies (Draft for Comments) are adopted in their current form, we may be required to obtain the approval of the PRC government for a financing, a business combination, the issuance of our common stock upon exercise of rights, or maintaining our status as a publicly listed company outside China.\nThe M&A Rules include, among other things, provisions that purport to require that an offshore special purpose vehicle formed for the purpose of an overseas listing of securities in a PRC company obtain the approval of the CSRC prior to the listing and trading of such special purpose vehicles securities on an overseas stock exchange. On September 21, 2006, the CSRC published on its official website procedures regarding its approval of overseas listings by special purpose vehicles. However, substantial uncertainty remains regarding the scope and applicability of the M&A Rules to offshore special purpose vehicles.\nOn July 6, 2021, the General Office of the Central Committee of the Communist Party of China and the General Office of the State Council jointly issued the Opinions on Strictly Cracking Down on Illegal Securities Activities, or the Opinions, which emphasized the need to strengthen administration over illegal securities activities and supervision of overseas listings by China-based companies. The Opinions proposed promoting regulatory systems to deal with risks facing China-based overseas-listed companies, and provided that the State Council will revise provisions regarding the overseas issuance and listing of shares by companies limited by shares and will clarify the duties of domestic regulatory authorities.\nOn December 24, 2021, the State Council published the draft Administrative Provisions on the Overseas Issuance and Listing of Securities by Domestic Companies (Draft for Comments), or the Administrative Provisions, and the CSRC published the draft Measures for Record-filings of the Overseas Issuance and Listing of Securities by Domestic Companies (Draft for Comments), or the Administrative Measures, for public comment.\nPursuant to Article 2 of the Administrative Provisions, domestic enterprises that (i) offer shares, depository receipts, convertible notes or other equity securities overseas, or (ii) list securities on an overseas stock exchange, must complete record-filing procedures and report the relevant information to the CSRC. The CSRC shall determine the record-filing method.\nPursuant to the Article 2 of the Administrative Measures, domestic enterprises that directly or indirectly offer or list securities on an overseas stock exchange shall file with the CSRC within three business days after submitting their initial public offering and/or listing application documents. The requested filing documents include, but are not limited to: (1) a filing report and related undertakings; (2) regulatory opinions, filing or approval documents issued by the relevant authorities (if applicable); (3) security review opinions issued by the relevant authorities, if applicable; (4) a PRC legal opinion; and (5) a prospectus.\nOn December 27, 2021, the National Development and Reform Commission, or the NDRC, and the MOFCOM jointly promulgated the Special Administrative Measure (Negative List) for the Access of Foreign Investment (2021 Version), or the Negative List, which became effective on January 1, 2022. According to Article 6 of the Negative List, domestic enterprises engaging in businesses in which foreign investment is prohibited shall obtain approval from the relevant authorities before offering and listing their shares on an overseas stock exchange. In addition, certain foreign investors shall not be involved in the operation or management of the relevant enterprise, and shareholding percentage restrictions under relevant domestic securities investment management regulations shall apply to such foreign investors.\nIf the CSRC or another PRC regulatory body subsequently determines that its approval is needed for a securities offering by the Company, a business combination, the issuance of our common stock upon exercise of rights, or maintaining our status as a publicly listed company outside China, we may face approval delays, adverse actions or sanctions by the CSRC or other PRC regulatory agencies. In any such event, these regulatory agencies may delay a potential business combination, impose fines and penalties, limit our acquisitions and operations of a target business in China, or take other actions that could materially adversely affect our business, financial condition, results of operations, reputation and prospects, and or cause the value of our common stock to significantly decline or become worthless.\nRisks Relating to Our Common Stock\nWe are an emerging growth company and, as a result of the reduced disclosure and governance requirements applicable to emerging growth companies, our common stock may be less attractive to investors.\nWe are an emerging growth company, as defined in the JOBS Act, and we are eligible to take advantage of certain exemptions from various reporting requirements applicable to other public companies. We will remain an emerging growth company until the earliest to occur of: (i) the last day of the fiscal year in which we have at least $1.07 billion in annual revenue; (ii) the last day of the fiscal year in which we are deemed to be a large accelerated filer, as defined in Rule 12b-2 under the Exchange Act, which would occur if the market value of our Common Stock held by non-affiliates exceeded $700 million as of the last business day of the second fiscal quarter of such year; (iii) the date on which we have issued more than $1.0 billion in nonconvertible debt securities during the prior three-year period; and (iv) the last day of the fiscal year ending after the fifth anniversary of our initial public offering. The exemptions available to emerging growth companies include the right to present only two years of audited financial statements in our registration statements and annual reports, an exemption from the auditor attestation requirement of Section 404 of the Sarbanes-Oxley Act relating to internal controls, reduced disclosure about executive compensation arrangements, and no requirement to seek non-binding advisory votes on executive compensation or golden parachute arrangements. Some of these exemptions are also available to us as a smaller reporting company (i.e. a company with less than $250 million of its voting equity held by non-affiliates). We have elected to adopt these reduced disclosure requirements. We cannot predict if investors will find our common stock less attractive as a result of our taking advantage of these exemptions. If some investors find our common stock less attractive as a result of our choices, there may be a less active trading market for our common stock and our stock price may be more volatile.\nPursuant to Section 107(b) of the JOBS Act, we have elected to use the extended transition period for complying with new or revised accounting standards under Section 102(b)(2) of The JOBS Act. This election allows us to delay the adoption of new or revised accounting standards that have different effective dates for public and private companies until those standards apply to private companies. As a result, our financial statements may not be comparable to companies that comply with public company effective dates. The decision to opt out is irrevocable.\nBecause the worldwide market value of our common stock held by non-affiliates, or public float, was below $250 million on the last day of our second fiscal quarter, we are also a smaller reporting company as defined under the Exchange Act. Some of the foregoing reduced disclosure and other requirements are also available to us because we are a smaller reporting company and may continue to be available to us even after we are no longer an emerging growth company under the JOBS Act but remain a smaller reporting company under the Exchange Act. As a smaller reporting company, we are not required to:\n● have an auditor report on our internal control over financial reporting pursuant to Section 404(b) of the Sarbanes-Oxley Act;\n● present more than two years of audited financial statements in our registration statements and annual reports on Form 10-K; or\n● present any selected financial data in such registration statements and annual reports filings made by the Company.\nBecause we will be subject to penny stock rules, the level of trading activity in our stock may be reduced.\nIt is likely that our common stock will be classified as a penny stock when trading is initiated and for an indeterminate period thereafter. Penny stocks generally are equity securities with a price of less than $5.00 (other than securities registered on some national securities exchanges). Broker-dealer practices in connection with transactions in penny stocks are regulated by penny stock rules adopted by the Securities and Exchange Commission. The penny stock rules require a broker-dealer, prior to a transaction in a penny stock not otherwise exempt from the rules, to deliver a standardized risk disclosure document that provides information about penny stocks and the nature and level of risks in the penny stock market. The broker-dealer also must provide the customer with current bid and offer quotations for the penny stock, the compensation of the broker-dealer and its salesperson in the transaction, and, if the broker-dealer is the sole market maker, the broker-dealer must disclose this fact and the broker-dealers presumed control over the market, and monthly account statements showing the market value of each penny stock held in the customers account. In addition, broker-dealers who sell these securities to persons other than established customers and accredited investors must make a special written determination that the penny stock is a suitable investment for the purchaser and receive the purchasers written agreement to the transaction. Consequently, these requirements may have the effect of reducing the level of trading activity, if any, in the secondary market for a security subject to the penny stock rules. If a trading market does develop for our common stock, these regulations will likely be applicable, and investors in our common stock may find it difficult to sell their shares.\nFINRA sales practice requirements may limit a stockholders ability to buy and sell our stock.\nFINRA has adopted rules that require that in recommending an investment to a customer, a broker-dealer must have reasonable grounds for believing that the investment is suitable for that customer. Prior to recommending speculative low-priced securities to their non-institutional customers, broker-dealers must make reasonable efforts to obtain information about the customers financial status, tax status, investment objectives and other information. Under interpretations of these rules, FINRA believes that there is a high probability that speculative low-priced securities will not be suitable for at least some customers. FINRA requirements make it more difficult for broker-dealers to recommend that their customers buy our common stock, which may have the effect of reducing the level of trading activity in our common stock. As a result, fewer broker-dealers may be willing to make a market in our common stock, reducing a stockholders ability to resell shares of our common stock.\nShareholders do not have pre-emptive rights, which will cause them to experience dilution if we issue additional securities.\nAt any time or times, we may issue and sell additional shares of our authorized but previously unissued shares of common stock, preferred stock, or common stock warrants on such terms and conditions as our Board of Directors, in its sole discretion, may determine without consent of our shareholders. Our shareholders do not have pre-emptive rights to acquire additional shares should we in the future issue or sell additional securities. Thus, we are not required to offer any existing shareholder the right to purchase his or her pro rata portion of any future issuance of securities and, therefore, upon the issuance of any additional securities by us hereafter, our shareholders will not be able to maintain their then existing pro rata ownership in our outstanding shares of common stock, preferred stock, or common stock warrants without additional purchases of securities at the price then set internally by us.\nWe are unlikely to pay cash dividends in the foreseeable future.\nWe currently intend to retain any future earnings for use in the operation and expansion of our business. We do not expect to pay any cash dividends in the foreseeable future but will review this policy as circumstances dictate. Should we decide in the future to do so, as a holding company, our ability to pay dividends and meet other obligations depends upon the receipt of dividends or other payments from our operating subsidiaries. In addition, our operating subsidiaries, from time to time, may be subject to restrictions on their ability to make distributions to us, including as a result of restrictions on the conversion of local currency into U.S. dollars or other hard currency and other regulatory restrictions.\nOur insiders own the majority of the outstanding shares of our stock, and accordingly, will have control over stockholder matters, the Companys business and management.\nOne member of our Board of Directors owns, in aggregate, common stock representing 51.30% of the outstanding shares of our common stock. While he continues to hold the majority of the voting power in our Company, this director will have effective control over the Company. In particular, the director will have the ability to:\n● Elect or defeat the election of our directors;\n● Prevent amendment of our articles of incorporation or bylaws;\n● Prevent a merger, sale of assets or other corporate transaction; and\n● Affect the outcome of any other matter submitted to the shareholders for vote.\nMoreover, because of the significant ownership position held by our insiders, new investors will not be able to affect a change in the Companys business or management, and therefore, shareholders would be subject to decisions made by management and the majority shareholder.\nIn addition, sales of significant amounts of shares held by our directors and executive officers, or the prospect of these sales, could adversely affect the market price of our common stock. Managements stock ownership may discourage a potential acquirer from making a tender offer or otherwise attempting to obtain control of us, which in turn could reduce our stock price or prevent our shareholders from realizing a premium over our stock price. Item 1B. Unresolved Staff Comments\nNot applicable. Item 2. Properties.\nThe Company does not own any real property. We believe the premises we now have under lease will be adequate for our operations for the foreseeable future.\nOffice Leases\nIn April of 2021, Qingguo entered into an operating cooperation agreement with Hohhot Aihua Traditional Chinese Medicine Hospital. Under the terms Qingguo is able to use its office space (approximately 700 square meters) free of charge during the period between April 1, 2021 to March 31, 2026. On May 27, 2022, both sides renewed the agreement to lease this office space under non-cancellable operating lease agreements. Under terms of the lease agreement, from May 27, 2022, Qingguo is committed to make a lease payment of approximately $9,295 per year for 1 year.\nIn October of 2020, Longduoduo Health Technology entered into an operating cooperation agreement with Baotou Jins Traditional Chinese Medicine Nephropathy Hospital Co., Ltd. Under the terms, Longduoduo Health Technology is able to use its office space (approximately 1000 square meters) free of charge during the period between October 15, 2020 to October 15, 2025. On March 18, 2021, Longduoduo Health Technology entered into an assignment agreement with Rongbin, pursuant to which Longduoduo Health Technology transferred all the rights and obligations under the cooperation agreement to Rongbin.\nIn March of 2021, Chengheng leased an office space (approximately 1500 square meters) under an operating lease agreement from Wudun Qiqige. Under the terms of the agreement, Chengheng is committed to make lease payments of approximately RMB700,000 for the period between April 1, 2021 and March 31, 2023.\nOn April 4, 2023, Chengheng leased an office space (approximately 957 square meters) under an operating lease agreement from Jinrong Holding (Hainan) Group Co., LTD. Inner Mongolia branch. Under the terms of the agreement, Chengheng is committed to make lease payments of approximately RMB144,140 for the period between April 9, 2023 and April 8, 2024.\nIn June of 2021, Longduoduo Health Technology entered into a contract of Medical Technology Commissioned Service and the supplementary agreement with Ulanqab Mengzhong Rehabilitation TCM Hospital Co., Ltd. Under the terms, Longduoduo Health Technology is able to use its office space (approximately 600 square meters) free of charge during the period between June 20, 2021 and June 19, 2026. Item 3. Legal Proceedings.\nFrom time to time, we may become involved in legal proceedings or be subject to claims arising in the ordinary course of our business. We are not presently a party to any legal proceedings that in the opinion of our management, if determined adversely to us, would individually or taken together have a material adverse effect on our business, operating results, financial condition, or cash flows. Item 4. Mine Safety Disclosure\nNot applicable.\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities.\nMarket Information\nThe Companys common stock is quoted on the OTC Pink Market under the symbol LDDD. The quotations reported on the OTC Pink Market reflect inter-dealer prices without retail markup, markdown or commissions, and may not necessarily represent actual transactions.\nThe Companys common stock is thinly traded. The quoted bid and asked prices for the Common Stock vary significantly from week to week. An investor holding shares of the Companys Common Stock may find it difficult to sell the shares and may find it impossible to sell more than a small number of shares at the quoted bid price.\nHolders of Securities\nAs of the date of filing of this report, we had 50 shareholders of record and 30,005,008 outstanding shares of common stock, par value $0.001.\nThere are currently effective prospectuses that will permit the public resale of 14,607,993 shares of our common stock now held by shareholders.\nDividends\nWe have not declared or paid any cash dividends on our common stock since our inception, and our board of directors currently intends to retain all earnings for use in the business for the foreseeable future. Any future payment of dividends will depend upon our results of operations, financial condition, cash requirements and other factors deemed relevant by our board of directors. There are currently no restrictions that limit our ability to declare cash dividends on our common stock. The PRC government imposes controls on the convertibility of the RMB into foreign currencies and, in certain cases, the remittance of currency out of China. In addition, each of our subsidiaries in China is required to set aside at least 10% of its after-tax profits each year, if any, to fund a statutory reserve until such reserve reaches 50% of its registered capital. Each of such entities in China is also required to further set aside a portion of its after-tax profits to fund the employee welfare fund, although the amount to be set aside, if any, is determined at the discretion of its board of directors. Although the statutory reserves can be used, among other ways, to increase the registered capital and eliminate future losses in excess of retained earnings of the respective companies, the reserve funds are not distributable as cash dividends except in the event of liquidation.\nSecurities Authorized for Issuance Under Equity Compensation Plans\nWe have no equity compensation plans.\nSales of Unregistered Securities\nThe Company did not have any unregistered sales of equity securities during the fourth quarter of the fiscal year ended June 30, 2023.\nRepurchase of Equity Securities\nThe Company did not repurchase any of its equity securities that were registered under Section 12 of the Securities Act during the fiscal quarter ended June 30, 2023. Item 6. [Reserved] Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion and analysis of our financial condition and results of operations are based upon our consolidated financial statements and the notes thereto included elsewhere in this Annual Report on Form 10-K, which have been prepared in accordance with accounting principles generally accepted in the United States. The preparation of such financial statements requires us to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues, and expenses. On an ongoing basis, we evaluate these estimates, including those related to useful lives of real estate assets, bad debts, impairment, contingencies and litigation. We base our estimates on historical experience and on various other assumptions that are believed to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. There can be no assurance that actual results will not differ from those estimates. The analysis set forth below is provided pursuant to applicable SEC regulations and is not intended to serve as a basis for projections of future events. See Cautionary Statement Regarding Forward Looking Statements above.\nResults of Operations for the Years Ended June 30, 2023 and 2022\nThe following table shows key components of the results of operations during the years ended June 30, 2023 and 2022:\nFor the Years Ended\nJune 30, Change\n$ %\nTotal revenue $ 3,818,560 $ 3,237,993 $ 580,567 18 %\nCost of revenue 591,885 1,005,030 (413,145 ) (41 )%\nGross Profit 3,226,675 2,232,963 993,712 45 %\nTotal operating expenses 3,197,437 9,788,249 (6,590,812 ) 67 %\nIncome (loss) from operations 29,238 (7,555,286 ) 7,584,524 (100 )%\nOther income (expense) 2,093 (6,703 ) 8,796 (131 )%\nIncome (loss) before income taxes 31,331 (7,561,989 ) 7,593,320 (100 )%\nIncome taxes 10,246 1,576 8,670 550 %\nNet income (loss) 21,085 (7,563,565 ) 7,584,650 (100 )%\nDuring the year ended June 30, 2023, our revenue was total $3,818,560, of which $1,808,515 was attributable to the sale of healthcare services and healthcare products, primarily derived from sales of Immunological Ozonated Autohemotherapy, Meridian-regulating and Consciousness-restoring Iatrotechnics, Assay, PRP and other healthcare services, and $2,010,045 commission revenue was attributable to the service of sales agents. From June of 2023, the Company began to engage in agent sales business and focused on the sales of preventive healthcare solutions from our provider. As of June 30, 2023, we operate through five entities: Longduoduo Health Technology, Tianju, Qingguo, Rongbin and Chengheng, which are established in Ordos, Ulanqab, Huhhot, Baotou and Ordos, respectively, the four of largest cities in Inner Mongolia of China.\nCost of revenue mainly consists of our cost for third-party healthcare service providers who perform healthcare services for our customers and the cost of purchasing products. During the year ended June 30, 2023, our cost of revenue was $591,885, with the result that our gross profit was $3,226,675, a gross margin of more than 84.5%. Gross margin at that level was sufficient to operate profitably. However, we realized only $29,238 in income from operations for the year ended June 30, 2023 because the Company incurred significant marketing expense to in connection with establishing its brand as a new company. The Company will continue to invest heavily in advertising and promotion expenses in the near future as it continues to establish and expand its brand and products and services.\nOperating expenses consist primarily of advertising and promotion expenses, salaries and benefits, office expenses, professional fees and depreciation and amortization. Our operating expenses in fiscal year 2023 decreased by $6,590,812, primarily attributable to:\n● $1,464,450 in advertising and promotion expenses incurred in the year ended June 30, 2023, compared to $7,221,685 recorded in the year ended June 30, 2022. The decrease was primarily attributable to the fact that the fiscal 2022 expenses included service compensation of $5,824,728 incurred on July 26, 2021 when Longduoduo HK issued to 32 sales agents a total of 3,822 shares, which were exchanged for 11,457,985 common shares of Longduoduo upon the Share Exchange.\n● $142,447 in professional fees in the year ended June 30, 2023, compared to $120,000 in recorded in the year ended June 30, 2022. In both cases, the expense was primarily related to the Companys efforts to become a reporting company in the United States.\n● $756,913 in salaries and benefits expenses in the year ended June 30, 2023, compared to $662,813 in the year ended June 30, 2022. The increase in our labor costs was primarily caused by the company increasing the average wages paid to employees.\n● $701,862 in office expenses in the year ended June 30, 2023, compared to $1,634,646 in the year ended June 30, 2022. The decrease was mainly attributable to the fact that the fiscal 2022 expenses included service compensation of $914,000 incurred July 26, 2021 when Longduoduo HK issued to Eden Hall Global Capital Co., Ltd. a total of 600 shares, which were exchanged for 18,000,000 common shares of Longduoduo upon the Share Exchange.\nOur net income for the year ended June 30, 2023 was $21,085, compared to a net loss of $7,563,565 in the year ended June 30, 2022.\nOur reporting currency is the U.S. dollar. Our local currency, the Renminbi (RMB), is our functional currency. Results of operations and cash flow are translated at average exchange rates during the period being reported upon, and assets and liabilities are translated at the unified exchange rate as quoted by OANDA on the balance sheet date. Translation adjustments resulting from this process are included in other comprehensive income (loss). For the years ended June 30, 2023 and 2022, foreign currency translation adjustments of $46,099 and $34,745, respectively, have been reported as other comprehensive income in the consolidated statement of operations and comprehensive income (loss).\nLiquidity and Capital Resources\nAs of June 30, 2023, the Company had $1,136,562 in cash and cash equivalents. On the same date, we had a working capital deficit of $733,781, primarily because we had received $588,335 from customers as prepayment for future services and products but used the majority of the deposited sums to pay ongoing expenses and had only $68,341 in prepayments on our June 30, 2023 balance sheet. Going forward, we will strive to achieve a better balance of customer deposits and prepayments; but we will achieve that better balance only when profits from operations and funds from financing are adequate to support the expansion effort that will be necessary for successful operations.\nWe anticipate that our future liquidity requirements will arise from the need to fund our growth, pay current obligations and future capital expenditures. The primary sources of funding for such requirements are expected to be cash generated from operations and raising additional funds from a public offering and/or debt financing. We expect Zhang Liang, our President, to continue to provide support in the future, if needed. However, we can provide no assurances that we will be able to generate sufficient cash flows from operations and/or obtain additional financing on terms satisfactory to us, if at all, to remain a going concern.\nCash Flows\nThe following table summarizes our cash flows for the years ended June 30, 2023 and 2022.\nFor the Years Ended\nJune 30, Change\n$\nNet cash provided by operating activities $ 965,337 $ 28,572 $ 936,765\nNet cash used in investing activities (125,880 ) (111,882 ) (13,998 )\nNet cash provided by (used in) financing activities (143,333 ) 179,697 (323,030 )\nEffect of exchange rate fluctuation on cash and cash equivalents 83,766 (12,831 ) 96,597\nNet increase in cash and cash equivalents 779,890 83,556 696,334\nCash and cash equivalents, beginning of year 356,672 273,116 83,556\nCash and cash equivalents, end of year $ 1,136,562 $ 356,672 $ 779,890\nNet Cash Provided by Operating Activities\nFor the year ended June 30, 2023, we had cash provided by operating activities of $965,337, compared to $28,572 for the year ended June 30, 2022. Cash provided by operations during the year ended June 30, 2023 was primarily due to the fact that we increased our accounts payable by $1,050,336 during the year. In addition, we recorded non-cash expenses totaling $516,842, including $384,500 in stock-based compensation paid to sales agents.\nNet Cash Used in Investing Activities\nNet cash used in investing activities for the year ended June 30, 2023 was $125,880, compared to $111,882 for the year ended June 30, 2022. The cash was used for the purchase of fixed and intangible assets and office decoration.\nNet Cash Provided by Financing Activities\nNet cash used in financing activities for the year ended June 30, 2023 was $143,333 which was due to the repayment of a loan from a third party, compared to $179,697 in cash provided by financing activities during the year ended June 30, 2022, which due to loan from a third party and proceeds from shares issued.\nCritical Accounting Policies\nThe discussion and analysis of the Companys financial condition and results of operations is based upon its consolidated financial statements, which have been prepared in accordance with United States generally accepted accounting principles. The preparation of these financial statements requires us to make significant estimates and judgments that affect the reported amounts of assets, liabilities, revenues and expenses, and related disclosure of contingent assets and liabilities. These items are monitored and analyzed by management for changes in facts and circumstances, and material changes in these estimates could occur in the future. Changes in estimates are recorded in the period in which they become known. The Company bases its estimates on historical experience and various other assumptions that we believe to be reasonable under the circumstances. Actual results may differ from our estimates if past experience or other assumptions do not turn out to be substantially accurate.\nIn our preparation of the financial statements for the year ended June 30, 2023, there was no estimate made which was (a) subject to a high degree of uncertainty and (b) material to our results.\nTrends, Events and Uncertainties\nThere is substantial doubt about our ability to continue as a going concern as a result of our lack of significant revenues and recurring losses. If we are unable to generate significant revenue or secure additional financing, we may be required to cease or curtail our operations.\nThe COVID-19 pandemic has had a significant adverse impact and created many uncertainties related to our business, and we expect that it will continue to do so. The Company is experiencing challenges in sales, which have increased the Companys financial uncertainty. Our future business outlook and expectations are very uncertain due to the impact of the COVID-19 pandemic and are very difficult to quantify. It is difficult to assess or predict the impact of this unprecedented event on our business, financial results or financial condition. Factors that will impact the extent to which the COVID-19 pandemic affects our business, financial results and financial condition include: the duration, spread and severity of the pandemic; the actions taken to contain the virus or treat its impact, including government actions to mitigate the economic impact of the pandemic; and how quickly and to what extent normal economic and operating conditions can resume, including whether any future outbreaks interrupt the economic recovery.\nThe U.S. government, including the SEC, has made statements and taken actions that have led to changes in relations between the U.S. and China, and will impact companies with connections to the United States or China. Those actions by the U.S. government included imposing several rounds of tariffs affecting certain products manufactured in China and imposing sanctions and restrictions in relation to China. Actions by the SEC included issuing statements indicating that it would make enhanced review of companies with significant China-based operations. It is unknown whether and to what extent new legislation, executive orders, tariffs, laws or regulations will be adopted, or the effect that any such actions would have on U.S.-domiciled companies with significant connections to China, our industry or on us. Any unfavorable government policies on cross-border relations, including increased scrutiny on companies with significant China-based operations, capital controls or tariffs, may affect our ability to raise capital and the market price of our shares. If any new legislation, executive orders, tariffs, laws and/or regulations are implemented, if existing trade agreements are renegotiated or if the U.S. or Chinese governments take retaliatory actions due to the recent U.S.-China tensions, such changes could have an adverse effect on our business, financial condition and results of operations, our ability to raise capital and the market price of our shares. Changes in United States and China relations and/or regulations may adversely impact our business, our operating results, our ability to raise capital and the market price of our shares.\nOther than the factors listed above we do not know of any trends, events or uncertainties that have had or are reasonably expected to have a material impact on our net sales or revenues or income from continuing operations.\nRecent Accounting Pronouncements\nThere were no recent accounting pronouncements that we expect to have a material effect on the Companys financial position or results of operations. Please refer to Note 2 of our consolidated financial statements included in this annual report. Item 7A. Quantitative and Qualitative Disclosures about Market Risk.\nNot applicable. Item 8. Financial Statements and Supplementary Data.\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\nLONGDUODUO COMPANY LIMITED AND SUBSIDIARIES\nPage\nYears Ended June 30, 2023 and 2022\nReport of Independent Registered Public Accounting Firm (PCAOB ID 822) - year ended June 30, 2023 F - 2\nReport of Independent Registered Public Accounting Firm (PCAOB ID 2851) - year ended June 30, 2022 F - 3\nConsolidated Balance Sheets as of June 30, 2023 and 2022 F - 5\nConsolidated Statements of Operations and Comprehensive Income (Loss) for the years ended June 30, 2023 and 2022 F - 6\nConsolidated Statement of Changes in Deficit for the years ended June 30, 2023 and 2022 F - 7\nConsolidated Statements of Cash Flows for the years ended June 30, 2023 and 2022 F - 8\nNotes to Consolidated Financial Statements F - 9\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Stockholders of Longduoduo Company Limited:\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheet of Longduoduo Company Limited (the Company) as of June 30, 2023 and the related consolidated statements of operations and comprehensive income, changes in deficit, and cash flows for the year then ended, and the related notes (collectively referred to as the financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of June 30, 2023 and the results of its operations and cash flows for the year then ended in conformity with accounting principles generally accepted in the United States.\nExplanatory Paragraph Regarding Going Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As described in Note 2 to the consolidated financial statements, the Companys present financial situation raises substantial doubt about its ability to continue as a going concern. Managements plans in regard to this matter are also described in Note 2. These financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audit, we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audit provides a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit maters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nCommission Revenue\nThe Companys consolidated statement of operations for the year ended June 30, 2023 includes commission revenue of $2,010,045. Substantially all of the commission revenue was derived from a contract executed in June 2023 with a third-party healthcare provider. Under the contract, the Company refers customers to the third-party provider, which is wholly responsible for fulfillment of the services to the customer. The Company has no performance commitment or liability to the customer. The Company recognizes commission revenue upon acceptance of the customer contract by the third-party provider in an amount equal to the net of the gross amount received from the customer less the amount payable to the third-party provider.\nThe principal considerations for our determination that performing procedures relating to commission revenue is a critical audit matter are (i) the significant judgement by management to determine whether to account for the transactions in an agent or principal capacity and (ii) a high degree of auditor judgement, subjectivity, and effort in performing procedures relating to commission revenue.\nAddressing the matter involved performing procedures and evaluating audit evidence in connection with forming our overall opinion on the consolidated financial statements. These procedures included, among other things, evaluating the conclusions reached by management and reviewing both contracts with customers and the contract between the Company and the third-party provider.\n/s/ Michael T. Studer CPA P.C.\nMichael T. Studer CPA P.C.\nFreeport, New York\nNovember 14, 2023\nWe have served as the Companys auditor since 2023.\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Stockholders of Longduoduo Company Limited\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheet of Longduoduo Company Limited and subsidiaries (the Company) as of June 30, 2022, and the related consolidated statements of operations and comprehensive loss, changes in equity, and cash flows for the year then ended, and the related notes (collectively referred to as the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of June 30, 2022, and the results of its operations and its cash flows for the year then ended in conformity with accounting principles generally accepted in the United States of America.\nGoing Concern\nThe accompanying consolidated financial statements have been prepared assuming that the Company will continue as a going concern. As described in Note 2 to the financial statements, the Company has incurred recurring losses from operations and is in need of additional capital to grow its operations so that it can become profitable. These factors raise substantial doubt about the Companys ability to continue as a going concern. Managements plans with regard to these matters are described in Note 2. The accompanying consolidated financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on these consolidated financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audit included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audit also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audit provides a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the consolidated financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nRevenue recognition\nCritical Audit Matter Description\nAs described in Note 2 to the consolidated financial statements, the majority of the Companys revenue is derived from service revenues. The Company provides preventative healthcare consulting services. The sale of such services by the Company is considered complete when the service is provided at that time the sold healthcare package, ownership and risk of loss have been transferred to the customer.\nThe Company considers the contracts with healthcare service providers contain one performance obligation, and the Company is entitled to the consideration when performance obligation is satisfied at a point in time. The amount of revenue to be recognized is determined by the service contracts between the Company and the healthcare service providers. The Company recognizes revenue when the service is provided.\nThe principal considerations for our determination that performing procedures relating to revenue recognition, specifically the identification and evaluation of the timing and amount of revenue recognition, is a critical audit matter, involved judgment exercised by management in identifying and evaluating the performance obligation. Auditor judgement is involved in performing our audit procedures to evaluate whether the timing and amount of revenue recognition was appropriately stated.\nHow the Critical Audit Matter Will Be Addressed in the Audit\nOur audit procedures over determining the timing and amount of revenue recognition involved, among others, evaluation of managements assessment in regard to the identification of performance obligation of service revenue. We selected customer agreements and performed the following procedures:\n● Evaluated the terms and conditions of each selected contract and the appropriateness of the accounting treatment within the context of the five-step model prescribed by ASC 606, Revenue from Contracts with Customers, and evaluated whether managements conclusions were appropriate.\n● Tested the accuracy of managements calculation of revenue for the performance obligation.\n/s/ KCCW Accountancy Corp.\nWe have served as the Companys auditor since 2021.\nDiamond Bar, California\nOctober 13, 2022\nLONGDUODUO COMPANY LIMITED AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\nAs of June 30,\nAssets\nCurrent Assets:\nCash and cash equivalents $ 1,136,562 $ 356,672\nOther receivables 107,042 30,787\nPrepayments 68,341 33,837\nInventories 3,032\nTotal current assets 1,312,765 424,328\nProperty and equipment, net 152,719 109,233\nIntangible asset, net 3,828 -\nRight-of-use assets 13,470 77,106\nTotal assets $ 1,482,782 $ 610,667\nLiabilities and Deficit\nCurrent Liabilities:\nAccounts payable $ 1,044,247 $ 40,812\nDeferred revenue 588,335 788,649\nAccrued expenses 90,858 125,954\nDue to related parties 104,611 74,558\nLoan from third party -\n143,333\nSecurity deposits 54,992 329,180\nOther payables 84,015 90,162\nOperating lease liabilities, current 6,579 34,928\nOther current liabilities 72,909 2,444\nTotal current liabilities 2,046,546 1,630,020\nOperating lease liabilities, less current portion 6,891 2,986\nTotal liabilities 2,053,437 1,633,006\nDeficit:\nPreferred stock; $0.001 par value, 30,000,000 shares authorized, no shares issued and outstanding at June 30, 2023 and 2022 -\n-\nCommon stock; $0.001 par value, 500,000,000 shares authorized; 30,005,008 and 30,000,008 shares issued and outstanding at June 30, 2023 and 2022, respectively 30,005 30,000\nAdditional paid-in capital 7,246,729 6,862,234\nAccumulated deficit (7,885,080 ) (7,845,991 )\nAccumulated other comprehensive income 66,389 24,971\nTotal stockholders deficit (541,957 ) (928,786 )\nNon-controlling interests (28,698 ) (93,553 )\nTotal deficit (570,655 ) (1,022,339 )\nTotal liabilities and deficit $ 1,482,782 $ 610,667\nThe accompanying notes are an integral part of these consolidated financial statements.\nLONGDUODUO COMPANY LIMITED AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF OPERATIONS AND COMPREHENSIVE INCOME (LOSS)\nFor the Years Ended\nJune 30,\nRevenues:\nService revenue $ 1,799,901 $ 2,720,160\nProduct revenue 8,614 502,964\nCommission revenue 2,010,045 14,869\nTotal revenues 3,818,560 3,237,993\nCost of revenue:\nCost of service revenue 591,574 928,608\nCost of product revenue 76,422\nTotal cost of revenues 591,885 1,005,030\nGross profit 3,226,675 2,232,963\nSelling, general and administrative expenses 3,197,437 9,788,249\nIncome (Loss) from operations 29,238 (7,555,286 )\nOther income (expense) 2,093 (6,703 )\nIncome (loss) before provision for income taxes 31,331 (7,561,989 )\nProvision for income taxes 10,246 1,576\nNet income (loss) 21,085 (7,563,565 )\nLess: net income (loss) attributable to non-controlling interests 60,174 (46,200 )\nNet income (loss) attributable to common stockholders $ (39,089 ) $ (7,517,365 )\nComprehensive loss:\nNet income (loss) $ 21,085 $ (7,563,565 )\nForeign currency translation adjustment 46,099 34,745\nComprehensive income (loss) 67,184 (7,528,820 )\nLess: comprehensive income (loss) attributable to non-controlling interests 64,855 (42,708 )\nComprehensive income (loss) attributable to the common stockholders $ 2,329 $ (7,486,112 )\nBasic and diluted loss per share\n$ (0.001 ) $ (0.293 )\nWeighted average number of shares outstanding - basic and diluted\n30,018,056 25,616,907\nThe accompanying notes are an integral part of these consolidated financial statements.\nLONGDUODUO COMPANY LIMITED AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CHANGES IN DEFICIT\nFOR THE YEARS EDNED JUNE 30, 2023 AND JUNE 30, 2022\nCommon stock Additional\nAccumulated\nOther Total Non-\nNumber of Shares Amount Paid-in\nCapital Accumulated\nDeficit Comprehensive\nIncome Stockholder\nDeficit controlling Interests Total\nDeficit\nBalance at June 30, 2021 16,442,015 $16,442 $ (15,736) $ (328,626) $ (6,282) $ (334,202) $ (50,845) $ (385,047)\nStock-based compensation 13,257,993 13,258 6,725,870 -\n-\n6,739,128 -\n6,739,128\nShares issued for lease payment 210,000 106,470 -\n-\n106,680 -\n106,680\nShares issued for the payment of purchasing furniture 30,000 15,210 -\n-\n15,240 -\n15,240\nShares issued for cash 60,000 30,420 -\n-\n30,480 -\n30,480\nNet loss - -\n-\n(7,517,365 ) -\n(7,517,365 ) (46,200 ) (7,563,565 )\nForeign currency translation adjustment - -\n-\n-\n31,253 31,253 3,492 34,745\nBalance at June 30, 2022 30,000,008 $ 30,000 $ 6,862,234 $ (7,845,991 ) $ 24,971 $ (928,786 ) $ (93,553 ) $ (1,022,339 )\nStock-based compensation 5,000 384,495 -\n-\n384,500 -\n384,500\nNet income (loss) - -\n-\n(39,089 ) -\n(39,089 ) 60,174 21,085\nForeign currency translation adjustment - -\n-\n-\n41,418 41,418 4,681 46,099\nBalance at June 30, 2023 30,005,008 $ 30,005 $ 7,246,729 $ (7,885,080 ) $ 66,389 $ (541,957 ) $ (28,698 ) $ (570,655 )\nThe accompanying notes are an integral part of these consolidated financial statements\nLONGDUODUO COMPANY LIMITED AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nFor the Years Ended\nJune 30,\nCash Flows from Operating Activities\nNet income (loss)\n$ 21,085\n$ (7,563,565 )\nAdjustments to reconcile net income (loss) to net cash provided by operating activities:\nDepreciation\n67,738\n65,700\nOperating lease expense\n64,604\n88,300\nStock compensation expense\n384,500\n6,739,128\nChanges in operating assets and liabilities:\nOther receivables\n(78,477 )\n(23,762 )\nPrepayments\n(43,997 )\n(26,319 )\nInventories\n1,826\n(3,358 )\nDue from related parties\n(56,663 )\n11,966\nAccounts payable\n1,050,336\n(137,841 )\nDeferred revenue\n(145,760 )\n376,867\nAccrued expenses\n(32,595 )\n12,545\nDue to related parties\n77,564\n94,728\nSecurity deposits\n(274,188 )\n341,541\nOther payables\n(122,792 )\n93,041\nPayment of operating lease liabilities\n(21,575 )\n(34,081 )\nOther current liabilities\n73,731\n(6,318 )\nNet cash provided by operating activities\n965,337\n28,572\nCash Flows from Investing Activities\nPurchase of property, plant and equipment\n(120,127 )\n(111,882 )\nPurchase of intangible asset\n(5,753 )\n-\nNet cash used in investing activities\n(125,880 )\n(111,882 )\nCash Flows from Financing Activities\nShares issued for cash\n-\n30,982\nProceeds from short-term borrowing from third party\n(143,333 )\n148,715\nNet cash provided by (used in) Financing Activities\n(143,333 )\n179,697\nEffect of exchange rate fluctuation on cash and cash equivalents\n83,766\n(12,831 )\nNet increase in cash and cash equivalents\n779,890\n83,556\nCash and cash equivalents, beginning of year\n356,672\n273,116\nCash and cash equivalents, end of year\n$ 1,136,562\n$ 356,672\nSupplemental Non-Cash Investing and Financing Activities\nShare issuance for lease payment\n$ -\n$ 106,680\nShare issuance in exchange for equipment\n$ -\n$ 15,240\nRight-of-use assets obtained in exchange for new operating lease liabilities\n$ -\n$ 70,914\nSupplemental disclosure of cash flow information\nCash paid for income taxes\n$ 10,246\n$ 1,576\nCash paid for interest expense\n$ -\n$ -\nThe accompanying notes are an integral part of these consolidated financial statements.\nLONGDUODUO COMPANY LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEARS EDNED JUNE 30, 2023 AND JUNE 30, 2022\nNOTE 1. NATURE OF OPERATIONS AND BASIS OF PRESENTATION\nLongduoduo Company Limited (Longduoduo, together as a group with Longduoduos subsidiaries referred to as the Company or we) was incorporated in the State of Nevada on October 25, 2021. Acting in a principal capacity, the Company provides customers comprehensive and high-quality preventive healthcare solutions including a wide range of preventive healthcare services, including disease screening healthcare treatment, healthcare products and other services through a network of third-party healthcare service providers. In June 2023, the Company began to engage in agent sales of preventive healthcare solutions on behalf of third-party providers and earn commissions revenue.\nOn September 21, 2023, the Company implemented a 1-for-10 reverse split of its outstanding common stock, effective at the close of business on September 26, 2023. The accompanying financial statements have been adjusted to retroactively reflect this reverse stock split.\nLongduoduos subsidiaries include:\n● Longduoduo Company Limited (Hong Kong) (Longduoduo HK), which was established on July 26, 2021 under the laws of Hong Kong. On October 26, 2021, Longduoduo issued 30,000,008 shares of its common stock to the original shareholders of Longduoduo HK, in exchange for 100% of the outstanding shares of Longduoduo HK (the Share Exchange).\n● Longduoduo Health Technology Company Limited (Longduoduo Health Technology), a privately held Limited Company registered in Inner Mongolia, China on August 20, 2020. On August 16, 2021, Longduoduo HK acquired 100% of the ownership of Longduoduo Health Technology from the original shareholders of Longduoduo Health Technology.\n● Inner Mongolia Qingguo Health Consulting Company Limited (Qingguo), a privately held Limited Company registered in Inner Mongolia, China on June 18, 2020. On September 8, 2020, Longduoduo Health Technology acquired 90% of the ownership of Qingguo from the original shareholders of Qingguo.\n● Inner Mongolia Rongbin Health Consulting Company Limited (Rongbin), a privately held Limited Company registered in Inner Mongolia, China on March 18, 2021. Longduoduo Health Technology has controlled 80% of the ownership of Rongbin since established.\n● Inner Mongolia Chengheng Health Consulting Company Limited (Chengheng), a privately held Limited Company registered in Inner Mongolia, China on April 9, 2021. Longduoduo Health Technology has controlled 80% of the ownership of Chengheng since established.\n● Inner Mongolia Tianju Health Consulting Company Limited (Tianju), a privately held Limited Company registered in Inner Mongolia, China on July 5, 2021. Longduoduo Health Technology has controlled 51% of Tianju since inception.\nThe transactions summarized above are treated in the Companys financial statements as a corporate restructuring (reorganization) of entities under common control, as each of the seven entities have at all times been under the control of Mr. Zhang Liang. Therefore, in accordance with ASC 805-50-45-5, the current capital structure has been retroactively presented in prior periods as if such structure existed at that time, and the entities under common control are presented on a combined basis for all periods. Since all of the subsidiaries were under common control for all periods presented, the results of these subsidiaries are included in the Companys financial statements for all periods presented.\nLONGDUODUO COMPANY LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEARS EDNED JUNE 30, 2023 AND JUNE 30, 2022\nNOTE 2. SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nA. Going concern\nThe accompanying consolidated financial statements have been prepared assuming that the Company will continue as a going concern, which contemplates the realization of assets and liquidation of liabilities in the normal course of business. At June 30, 2023, the Company had negative working capital of $733,781 and negative stockholders equity of $570,655. For the years ended June 30, 2023 and June 30, 2022, the Company had net losses of $39,089 and $7,517,365, respectively. These factors among others raise substantial doubt about the ability of the Company to continue as a going concern for a reasonable period of time. The financial statements do not include any adjustments related to the recoverability and classification of assets or the amounts and classification of liabilities that might be necessary should the Company be unable to continue as a going concern.\nManagement plans to expand product offerings and to increase its number of customers in order to provide sufficient funds to continue operations as a going concern. However, there is no assurance that the Company will be successful in accomplishing its plans.\nB. Basis of presentation\nThe accompanying consolidated financial statements are expressed in U.S. Dollars and have been prepared on the accrual basis of accounting in accordance with accounting principles generally accepted in the United States of America (U.S. GAAP).\nC. Principles of consolidation\nThe consolidated financial statements include the accounts of Longduoduo and its subsidiaries. All significant inter-company accounts and transactions have been eliminated. The consolidated financial statements include 100% of assets, liabilities, and net income or loss of these subsidiaries.\nLongduoduos subsidiaries as of June 30, 2023 are listed as follows:\nName Place of\nIncorporation Attributable equity\ninterest % Authorized capital\nLongduoduo Company Limited Hong Kong HK$10,000\nLongduoduo Health Technology Company Limited China\nInner Mongolia Qingguo Health Consulting Company Limited China\nInner Mongolia Rongbin Health Consulting Company Limited China\nInner Mongolia Chengheng Health Consulting Company Limited China\nInner Mongolia Tianju Health Consulting Company Limited China\nD. Use of estimates\nThe preparation of consolidated financial statements in conformity with U.S. GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, disclosure of contingent assets and liabilities at the date of the financial statements, and the reported amounts of revenue and expenses during the reporting periods. Management makes these estimates using the best information available at the time the estimates are made; however, actual results could differ from those estimates. Significant items subject to such estimates and assumptions include the inventory valuation allowance and the treatment of the shares issued. These estimates are often based on complex judgments and assumptions that management believes to be reasonable but are inherently uncertain and unpredictable. Actual results could differ from these estimates.\nLONGDUODUO COMPANY LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEARS EDNED JUNE 30, 2023 AND JUNE 30, 2022\nE. Functional currency and foreign currency translation\nAn entitys functional currency is the currency of the primary economic environment in which it operates, normally that is the currency of the environment in which the entity primarily generates and expends cash. Managements judgment is essential to determine the functional currency by assessing various indicators, such as cash flows, sales price and market, expenses, financing and inter-company transactions and arrangements. The functional currency of the Company is the Chinese Renminbi (RMB), except the functional currency of Longduoduo HK is the Hong Kong Dollar and the functional currency of Longduoduo is the United States Dollar (US Dollars or $). The reporting currency of these consolidated financial statements is in US Dollars.\nThe financial statements of Longduoduos subsidiaries, which are prepared using the RMB, are translated into the Companys reporting currency, the US Dollar. Assets and liabilities are translated using the exchange rate at each reporting period end date. Revenue and expenses are translated using weighted average rates prevailing during each reporting period, and stockholders equity (deficit) is translated at historical exchange rates. Adjustments resulting from the translation are recorded as a separate component of accumulated other comprehensive income or expense.\nTransactions denominated in currencies other than the functional currency are translated into the functional currency at the exchange rates prevailing at the dates of the transactions. Foreign currency exchange gains and losses resulting from these transactions are included in operations.\nThe exchange rates used for foreign currency translation are as follows:\nFor the Years Ended\nJune 30,\n(USD to RMB/\nUSD to HKD)\n(USD to RMB/\nUSD to HKD)\nAssets and liabilities\nperiod end exchange rate\n7.2556/7.8361\n6.6977/7.8467\nRevenue and expenses\nperiod weighted average\n6.9526/7.8370\n6.4553/7.8046\nF. Concentration of credit risk\nThe Company maintains cash in state-owned banks in China. In China, the insurance coverage of each bank is RMB500,000 (approximately USD$69,000). As of June 30, 2023 and 2022, the Company had $606,483 and $93,510 cash in excess of the insured amount, respectively.\nFor the year ended June 30, 2023, one customer accounted for 99.9% of commission revenue. For the year ended June 30, 2022, no customer accounted for more than 10% of revenue.\nFor the years ended June 30, 2023 and 2022, the Company had four major suppliers that accounted for over 10% of its total cost of revenue.\nYear ended June 30,\nYear ended June 30,\nCost of revenue Percentage of\nCost of\nrevenue Cost of\nrevenue Percentage of\nCost of\nrevenue\nSupplier A $ 263,812 45 % $ 306,404 28 %\nSupplier B 90,380 15 % 227,615 21 %\nSupplier C 120,646 20 % 198,839 18 %\nSupplier D 53,419 9 % 127,848 12 %\nG. Cash and cash equivalents\nCash consists of cash on hand and bank deposits, which are unrestricted as to withdrawal and use. All highly liquid investments with original stated maturity of three months or less are classified as cash and cash equivalents. Cash equivalents approximate or equal fair value due to their short-term nature. The Companys cash and cash equivalents consist of cash on hand and cash in bank as of June 30, 2023 and 2022.\nLONGDUODUO COMPANY LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEARS EDNED JUNE 30, 2023 AND JUNE 30, 2022\nH. Property and equipment\nProperty and equipment are stated at cost. Expenditures for maintenance and repairs are charged to operations when incurred, while additions and betterments are capitalized. Depreciation is recorded on a straight-line basis over the useful lives of the assets. When assets are retired or disposed, the assets original cost and related accumulated depreciation are eliminated from those accounts and any gain or loss is reflected in income.\nThe Company capitalizes certain costs associated with the acquisition of software. Once the software is ready for its intended use, these costs are amortized on a straight-line basis over the softwares expected useful life.\nThe estimated useful lives for property and equipment categories are as follows:\nOffice equipment and furniture 3 years\nLeasehold Improvements 1-5 years\nI. Intangible Assets\nIntangible assets consist of software. Intangible assets are initially recognized at their respective acquisition costs. All of the Companys intangible assets have been determined to have finite useful lives and are, therefore, amortized using the straight-line method over their estimated useful lives:\nSoftware 3 years\nJ. Fair value measurements\nThe Company applies the provisions of the Financial Accounting Standards Board (FASB) Accounting Standards Codification (ASC) Section 820, Fair Value Measurements (ASC 820), for fair value measurements of financial assets and financial liabilities and for fair value measurements of nonfinancial items that are recognized or disclosed at fair value in the financial statements. ASC 820 also establishes a framework for measuring fair value and expands disclosures about fair value measurements.\nFair value is defined as the price that would be received when selling an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. In determining the fair value for the assets and liabilities required or permitted to be recorded, the Company considers the principal or most advantageous market in which it would transact, and it considers assumptions that market participants would use when pricing the asset or liability.\nASC 820 establishes a fair value hierarchy that requires an entity to maximize the use of observable inputs and minimize the use of unobservable inputs when measuring fair value. ASC 820 establishes three levels of inputs that may be used to measure fair value. The hierarchy gives the highest priority to unadjusted quoted prices in active markets for identical assets or liabilities (Level 1 measurements) and the lowest priority to measurements involving significant unobservable inputs (Level 3 measurements). The three levels of the fair value hierarchy are as follows:\nLevel 1: Unadjusted quoted prices in active markets that are accessible at the measurement date for identical, unrestricted assets or liabilities;\nLevel 2: Quoted prices, other than those in Level 1, in markets that are not active, or inputs that are observable, either directly or indirectly, for substantially the full term of the asset or liability,\nLevel 3: Prices or valuation techniques that require inputs that are both significant to the fair value measurement and unobservable (supported by little or no market activity).\nThere were no transfers between level 1, level 2 or level 3 measurements for the years ended June 30, 2023 and 2022.\nFinancial assets and liabilities of the Company are primarily comprised of cash and cash equivalents, other receivables, accounts payable, accrued expenses, due to related parties, loan from third party, security deposits and other payables. As of June 30, 2023 and 2022, the carrying values of these financial instruments approximated their fair values due to the short-term maturity of these instruments.\nLONGDUODUO COMPANY LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEARS EDNED JUNE 30, 2023 AND JUNE 30, 2022\nK. Segment information and geographic data\nThe Company is operating in one segment in accordance with the accounting guidance in FASB ASC Topic 280, Segment Reporting. The companys revenues are from customers in the Peoples Republic of China (PRC). Substantially all assets of the Company are located in the PRC.\nL. Revenue recognition\nThe Company adopted FASB ASC Section 606 - Revenue from Contracts with Customers. Under ASC 606, the Company recognizes revenue from the sales of products and services by applying the following steps: (1) identify the contract with a customer; (2) identify the performance obligations in the contract; (3) determine the transaction price; (4) allocate the transaction price to each performance obligation in the contract; and (5) recognize revenue when each performance obligation is satisfied.\nThe Company recognizes revenue when the amount of revenue can be reliably measured, it is probable that economic benefits will flow to the entity, and specific criteria have been met for each of the Companys activities as described below.\nService and Product Revenue\nThe Company sells healthcare packages, including healthcare consulting services and healthcare products. Customers may purchase a healthcare services package, or healthcare services combined with nutritional products. Currently all sales of products are bundled with healthcare services. The combination of services and products are generally capable of being distinct and accounted for as separate performance obligations. For the sale of healthcare packages that include services and products, the Company allocates revenues based on their relative selling prices.\nThe Company sells a healthcare service package to a customer, which represents the rights to services purchased by the Company. The delivery of a healthcare service package to a customer represents a separate performance obligation. The Companys policy is to recognize service revenue at that time when the healthcare service package has been sold, ownership and risk of loss have been transferred to the customer, and the service has been provided. Accordingly, revenue is recognized at the point in time when the service is provided. Service revenue is recognized when the healthcare service package has been delivered to the customer and there are no remaining performance obligations.\nManagement regularly reviews the sales returns and allowances based on historical experience. Any subsequent sales returns and cancellations are recognized upon notification from the customers. The liability for sales returns and allowances relating to the sale of healthcare service packages amounted to $15,406 and $4,817 as of June 30, 2023 and June 30, 2022, respectively. Managements provision for sales returns and allowances was 1.85% and 1.09%, respectively, of the total service revenue for the years ended June 30, 2023 and 2022.\nProduct revenue results from the sale of healthcare and nutritional products, including Collagen peptide, Calcium tablets and other products. The Company recognizes revenue when the product has been delivered and ownership and risk of loss have been transferred to the customer. The Company accepts returns provided the products are well packaged and can be resold. Management regularly reviews the sales returns and allowances based on historical experience. The liability for sales returns and allowances relating to the sale of healthcare products amounted to $229 and $997 as of June 30, 2023 and June 30, 2022, respectively. Managements provision for sales returns and allowances was 1.26% and 1.35%, respectively, of the total product revenue for the year ended June 30, 2023 and 2022.\nThe Company typically collects fees before delivery of healthcare packages. Amounts received from a customer before the delivery of the healthcare package are recorded as deferred revenue on the Consolidated Balance Sheets.\nCommission Revenue\nCommencing in the three months ended June 30, 2023, the Company started offering in a sales agent capacity healthcare service and product packages of a third-party provider. The third party is responsible for fulfillment of the services to the customer and the Company has no performance commitment or liability to the customer. The Company receives deposits from the customers, remits to the third-party provider the providers contracted amounts, and retains the remaining amounts as commission revenue. The commission revenue is recognized upon acceptance of the customer contract by the third-party provider and is presented on a net basis in the Statement of Operations and Comprehensive Income (Loss).\nCost of Revenues\nCost of service revenue consists primarily of the cost of healthcare service packages purchased from third party healthcare service providers to fulfill contracts with customers.\nCost of product revenue consists primarily of the cost of healthcare products purchased from suppliers. Cost of product revenue is recognized when the product has been delivered to the customer.\nLONGDUODUO COMPANY LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEARS EDNED JUNE 30, 2023 AND JUNE 30, 2022\nM. Income taxes\nThe Company follows FASB ASC Section 740, Income Taxes, which requires the recognition of deferred tax assets and liabilities for the expected future tax consequences of events that have been included in the financial statements or tax returns. Under this method, deferred income taxes are recognized for the tax consequences in future years of differences between the tax bases of assets and liabilities and their financial reporting amounts at each period end based on enacted tax laws and statutory tax rates applicable to the periods in which the differences are expected to affect taxable income. Valuation allowances are established, when necessary, to reduce deferred tax assets to the amount expected to be realized.\nASC 740-10-30 requires income tax positions to meet a more-likely-than-not recognition threshold to be recognized in the financial statements. Under ASC 740-10-30, tax positions that previously failed to meet the more-likely-than-not threshold should be recognized in the first subsequent financial reporting period in which that threshold is met.\nThe application of tax laws and regulations is subject to legal and factual interpretation, judgment and uncertainty. Tax laws and regulations themselves are subject to change as a result of changes in fiscal policy, changes in legislation, the evolution of regulations and court rulings. Therefore, the actual liability may be materially different from our estimates, which could result in the need to record additional tax liabilities or potentially reverse previously recorded tax liabilities or the deferred tax asset valuation allowance.\nAs a result of the implementation of ASC 740-10, the Company made a comprehensive review of its portfolio of tax positions in accordance with recognition standards established by ASC 740-10. The Company recognized no material adjustments to liabilities or shareholders equity as a result of the implementation.\nN. Earnings (loss) per share\nThe Company computes earnings (loss) per share (EPS) in accordance with ASC 260, Earnings Per Share. ASC 260 requires companies with complex capital structures to present basic and diluted EPS. Basic EPS is measured as net income (loss) divided by the weighted average common shares outstanding during the period.\nDiluted EPS is similar to basic EPS but presents the dilutive effect on a per share basis of contracts to issue common shares (e.g., convertible securities, options and warrants) as if they had been converted at the beginning of the periods presented, or issuance date, if later. The computation of diluted EPS includes the estimated impact of the exercise of contracts to purchase common stock using the treasury stock method and the potential shares of converted common stock associated with the convertible debt using the if-converted method. Potential common shares that have an anti-dilutive effect (i.e., those that increase earnings per share or decrease loss per share) are excluded from the calculation of diluted EPS. As of June 30, 2023 and 2022, the Company was not party to any contract to issue shares.\nO. Recently adopted accounting pronouncements\nWe do not believe that any recently issued but not yet effective accounting standards, if currently adopted, would have a material effect on the Companys consolidated financial position, statements of operations and cash flows.\nNOTE 3. PREPAYMENTS\nPrepayments primarily include prepaid expenses, equipment, leasing and products in advance to suppliers. As of June 30, 2023 and 2022, prepayments and deferred expenses were $68,341 and $33,837, respectively.\nLONGDUODUO COMPANY LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEARS EDNED JUNE 30, 2023 AND JUNE 30, 2022\nNOTE 4. PROPERTY AND EQUIPMENT\nAt June 30, 2023 and 2022, property and equipment, at cost, consisted of:\nJune 30, June 30,\nOffice equipment and furniture $ 204,645 $ 104,458\nLeasehold improvement 72,026 70,561\nTotal 276,671 175,019\nAccumulated depreciation 123,952 65,786\nTotal property and equipment, net $ 152,719 $ 109,233\nThe Company recorded depreciation expense of $67,738 for the year ended June 30, 2023, of which $59,745 was recorded as operating expense and $7,993 was recorded as cost of revenue.\nThe Company recorded depreciation expense of $65,700 for the year ended June 30, 2022, of which $59,937 was recorded as operating expense and $5,763 was recorded as cost of revenue.\nNOTE 5. LOAN FROM THIRD PARTY\nIn March 2022, the Company received advances from a third party, Jinrong Health Technology (Hainan) Co., Ltd. for working capital purposes. The loans were non-interest bearing and due on demand. The loans payable balance of $143,333 as of June 30, 2022 was repaid in the year ended June 30, 2023.\nNOTE 6. RELATED PARTY TRANSACTIONS\nDue to related parties\nDue to related parties consists of the following:\nName of related party June 30,\nJune 30,\nZhang Liang $ 69,419 $ 5,353\nZhou Hongxiao 35,192 69,205\nTotal $ 104,611 $ 74,558\nZhang Liang is the President, Chairman of the Board, director and a shareholder of Longduoduo, and Zhou Hongxiao is the CEO of Longduoduo. These advances due to related parties are unsecured, repayable on demand, and bear no interest.\nNOTE 7. INCOME TAXES\nUnited States\nLongduoduo is subject to the U.S. corporation tax rate of 21%.\nHong Kong\nLongduoduo HK was incorporated in Hong Kong and is subject to Hong Kong profits tax. Longduoduo HK is subject to Hong Kong taxation on its activities conducted in Hong Kong and income arising in or derived from Hong Kong. The applicable statutory tax rate is 16.5%. The Company did not have any income (loss) subject to the Hong Kong profits tax.\nChina\nLongduoduo Health Technology and subsidiaries are subject to a 25% standard enterprise income tax in the PRC. There was no provision for income taxes for the years ended June 30, 2023 and 2022.\nLONGDUODUO COMPANY LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEARS EDNED JUNE 30, 2023 AND JUNE 30, 2022\nA summary of income (loss) before income taxes for domestic and foreign locations for the years ended June 30, 2023 and 2022 is as follows:\nFor the year ended\nJune 30,\nUnited States $ (586,688 ) $ (146,606 )\nForeign 618,019 (7,415,383 )\nTotal Income (loss) before income taxes $ 31,331 $ (7,561,989 )\nThe difference between the U.S. federal statutory income tax rate and the Companys effective tax rate was as follows:\nFor the year ended\nJune 30, June 30,\nIncome tax (benefit) at USA statutory rate (21 )% (21 )%\nU.S. valuation allowance 21 % 21 %\nIncome tax (benefit) at USA effective rate (0 )% (0 )%\nThe difference between the PRC statutory income tax rate and the PRC effective tax rate was as follows:\nFor the year ended\nJune 30,\nIncome tax (benefit) at PRC statutory rate 25 % (25 )%\nUtilization of net operating loss carry forward (23 )% -\nPRC valuation allowance - 25 %\nIncome tax (benefit) at PRC effective rate 2 % (0 )%\nThe Company did not recognize deferred tax assets since it is not more likely than not that it will realize such deferred taxes. The deferred tax would apply to Longduoduo in the U.S. and Longduoduo Health Technology and subsidiaries in China.\nAs of June 30, 2023, Longduoduo Health Technology and its subsidiaries have total net operating loss carry forwards of approximately $349,976 in the PRC that expire through 2028. Due to the uncertainty of utilizing these carry forwards, the Company provided a 100% allowance on all deferred tax assets of approximately $87,494 and $238,921 related to its operations in the PRC as of June 30, 2023 and 2022, respectively. The PRC valuation allowance has decreased by $151,427 and increased by $165,008 for the years ended June 30, 2023 and 2022, respectively.\nThe Company has incurred losses from its United States operations during the year ended June 30, 2023 of approximately $586,688. The Companys United States operations consist solely of ownership of its foreign subsidiaries, and the losses arise from administration expenses. Accordingly, management provided a 100% valuation allowance of approximately $171,327 and $48,123 against the deferred tax assets related to the Companys United States operations as of June 30, 2023 and 2022, respectively, because the deferred tax benefits of the net operating loss carry forwards in the United States are not likely to be utilized. The US valuation allowance has increased by approximately $123,204 and $30,787 for the years ended June 30, 2023, and 2022, respectively.\nThe Company is subject to examination by the Internal Revenue Service (IRS) in the United States as well as by the taxing authorities in China, where the Company has significant business operations. The table below presents the earliest tax year that remains subject to examination by major jurisdiction.\nEarliest tax year that\nremains subject to examination\nU.S. Federal June 30, 2021\nChina June 30, 2020\nNOTE 8. LEASES\nOn March 31, 2021 the Company leased office space (approximately 1500 square meters) under a non-cancellable operating lease agreement with a third party Wudun Qiqige, in Ordos. Under the terms of the agreement, the Company was committed to make a one-time lease payment of $106,680, or RMB 700,000, for the lease period from April 1, 2021 to March 31, 2023.\nIn April 2021, Qingguo entered into an operating cooperation agreement with Hohhot Aihua Traditional Chinese Medicine Hospital. Under the terms Qingguo was able to use office space (approximately 700 square meters) free of charge during the period between April 1, 2021 to March 31, 2026. On May 27, 2022, the agreement was amended to provide for the lease of this office space under a non-cancellable operating lease agreement. Under terms of the lease agreement, from May 27, 2022, Qingguo was committed to make lease payments of approximately $9,295 per year for 1 year.\nLONGDUODUO COMPANY LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEARS EDNED JUNE 30, 2023 AND JUNE 30, 2022\nOn August 25, 2021 the Company leased a car under a non-cancellable operating lease agreement with a third party, Zhengzhou Zhengdong New District Yijiu Rental Car. Under the terms of the agreement, the Company was committed to make total lease payments of $74,946, or RMB 480,000, with lease payments of $3,123 per month for the lease period from August 25, 2021 to August 25, 2023. On December 1, 2022, the agreement was terminated.\nOn July 2, 2022 the Company leased a staff dormitory under a non-cancellable operating lease agreement with a third party, Xi Ling. Under the terms of the agreement, the Company is committed to make total lease payments of $21,912, or RMB 150,000, with lease payments of $7,304 per year for the lease period from July 2, 2022 to July 2, 2025.\nOn April 4, 2023, Chengheng leased office space (approximately 957 square meters) under an operating lease agreement with Jinrong Holding (Hainan) Group Co., LTD. Inner Mongolia branch. Under the terms of the agreement, Chengheng is committed to make lease payments of approximately $20,732 (RMB 144,140) for the period between April 9, 2023 and April 8, 2024.\nLeases with an initial term of 12 months or less are not recorded on the balance sheet. Operating lease cost is recognized as a single lease cost on a straight-line basis over the lease term and is recorded in selling, general and administrative expenses. For lease agreements entered into or reassessed after the adoption of Topic 842, the Company did not combine lease and non-lease components.\nMost leases do not include options to renew. The exercise of lease renewal options has to be agreed to by the lessors. The depreciable life of assets and leasehold improvements are limited by the term of leases, unless there is a transfer of title or purchase option reasonably certain of exercise. Lease expense is recognized on a straight-line basis over the term of the lease. Lease expense related to these noncancelable operating leases was $73,147 and $89,168 for the years ended June 30, 2023 and 2022, respectively.\nBalance sheet information related to the Companys leases is presented below:\nJune 30,\nJune 30,\nAssets\nOperating lease right of use assets $ 13,470 $ 77,106\nLiabilities\nOperating lease liabilities - current $ 6,579 $ 34,928\nOperating lease liabilities - non-current 6,891 2,986\nTotal Operating lease liabilities $ 13,470 $ 37,914\nOther information related to leases is presented below:\nFor the year ended\nJune 30,\nCash Paid for Amounts Included in Measurement of Liabilities:\nOperating cash flows used in operating leases $ 21,575 $ 34,081\nWeighted Average Remaining Lease Term:\nOperating leases 2 years 1.15 years\nWeighted Average Discount Rate\nOperating leases 4.75 % 4.75 %\nAs most of the Companys leases do not provide an implicit rate, the Company uses 1-5 years borrowing rate from bank of 4.75% based on the information available at commencement date in determining the present value of lease payments.\nMaturities of lease liabilities are as follows:\nFor the year ending June 30:\n$ 6,891\n6,891\nTotal lease payments 13,782\nLess: imputed interest (312 )\nTotal lease liabilities $ 13,470\nLONGDUODUO COMPANY LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEARS EDNED JUNE 30, 2023 AND JUNE 30, 2022\nNOTE 9. CONTINGENCIES\nContingencies\nCertain conditions may exist as of the date the consolidated financial statements are issued which may result in a loss to the Company but which will only be resolved when one or more future events occur or fail to occur. The Companys management and legal counsel assess such contingent liabilities, and such assessment inherently involves an exercise of judgment. In assessing loss contingencies related to legal proceedings that are pending against the Company or unasserted claims that may result in such proceedings, the Companys legal counsel evaluates the perceived merits of any legal proceedings or unasserted claims as well as the perceived merits of the amount of relief sought or expected to be sought.\nIf the assessment of a contingency indicates that it is probable that a material loss has been incurred and the amount of the liability can be estimated, then the estimated liability would be accrued in the Companys financial statements. If the assessment indicates that a potential material loss contingency is not probable but is reasonably possible, or is probable but cannot be estimated, then the nature of the contingent liability, together with an estimate of the range of possible loss if determinable and material would be disclosed.\nLoss contingencies considered to be remote by management are generally not disclosed unless they involve guarantees, in which case the guarantee would be disclosed.\nThe Company was not subject to any material loss contingency as of June 30, 2023 and 2022.\nNOTE 10. STOCKHOLDERS DEFICIT\nOn July 26, 2021, Longduoduo HK issued 600 shares, equivalent to 1,800,000 common shares of Longduoduo upon the Share Exchange, to Eden Hall Global Capital Cp., Ltd. for service compensation expense of $914,400.\nOn July 26, 2021, Longduoduo HK issued a total of 3,822 shares, or equivalent to 11,457,993 common shares of Longduoduo upon the Share Exchange, to 32 sales agents for service compensation expense of $5,824,728.\nOn July 26, 2021, Longduoduo HK issued 100 shares, or equivalent to 300,000 common shares of Longduoduo upon the Share Exchange, to Wudun Qiqige (see Note 8) for the lease payment of approximately $106,680, or RMB 700,000, for the payment of purchasing furniture of approximately $15,240, or RMB 100,000, and for cash of approximately $30,480, or RMB 200,000.\nOn February 20, 2023, the Company issued 5,000 common shares (valued at $384,500) to Kang Liping (Chief Financial Officer of the Company) as compensation.\nNOTE 11. BASIC AND DILUTED EARNINGS PER SHARE\nBasic net income (loss) per share is computed using the weighted average number of common shares outstanding during the period. Diluted net income (loss) per share is computed using the weighted average number of common shares and, if dilutive, potential common shares outstanding during the period. Potential common shares comprise shares issuable upon the exercise of share-based awards, using the treasury stock method. The reconciliation of the numerators and denominators of the basic and diluted earnings per share computations is shown as follows:\nFor the year ended\nJune 30,\nNumerator:\nNet loss attributable to common stockholders $ (39,089 ) $ (7,517,365 )\nDenominator:\nBasic and diluted weighted-average number of shares outstanding\n30,018,056 25,616,907\nNet loss per share:\nBasic and diluted\n$ (0.001 ) $ (0.293 )\nLONGDUODUO COMPANY LIMITED AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEARS EDNED JUNE 30, 2023 AND JUNE 30, 2022\nNOTE 12. NON-CONTROLLING INTERESTS\nQingguo, Chengheng, Rongbin and Tianju are the Companys majority-owned subsidiaries which are consolidated in the Companys financial statements with non-controlling interests recognized. The Company holds 90%, 80%, 80% and 51% interest of Qingguo, Chengheng, Rongbin and Tianju as of June 30, 2023, respectively.\nAs of June 30, 2023 and 2022, the non-controlling interests in the consolidated balance sheet was ($28,698) and ($93,553), respectively.\nFor year ended June 30, 2023, the comprehensive income attributable to common stockholders and non-controlling interests were $2,329 and $64,855, respectively.\nFor year ended June 30, 2022, the comprehensive loss attributable to common stockholders and non-controlling interests were $7,486,112 and $42,708, respectively.\nNOTE 13. SUBSEQUENT EVENTS\nOn September 21, 2023, the Company filed with the Nevada Secretary of State a Certificate of Change Pursuant to NRS 78.209. The Certificate of Change provided for a 1-for-10 reverse split of the Registrants outstanding common stock effective at the close of business on September 26, 2023. The Certificate of Change did not change the number of authorized shares of Common Stock, which remains 500,000,000 shares. No fractional shares were issued in connection with the reverse stock split; any fractional shares that resulted from the reverse split were rounded up to the nearest whole share. The accompanying financial statements have been adjusted to retroactively reflect this reverse stock split.\nManagement has evaluated subsequent events through the date which the consolidated financial statements were available to be issued. All subsequent events requiring recognition as of June 30, 2023 have been incorporated into these consolidated financial statements and there are no subsequent events that require disclosure in accordance with FASB ASC Topic 855, Subsequent Events. Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure.\nNone. Item 9A. Controls and Procedures.\nEvaluation of Disclosure Controls and Procedures\nOur management maintains disclosure controls and procedures, as defined in Rules 13a-15(e) and 15d-15(e) of the Securities Exchange Act of 1934, as amended (the Exchange Act), that are designed to provide reasonable assurance that the material information required to be disclosed by us in our periodic reports filed or submitted under the Exchange Act is recorded, processed, summarized, and reported within the time periods specified in the SECs rules and forms. Disclosure controls and procedures include, without limitation, controls and procedures designed to ensure that information required to be disclosed by us in the reports that we file or submit under the Exchange Act is accumulated and communicated to our management, including our Chief Executive Officer and Chief Financial Officer, to allow timely decisions regarding required disclosures.\nUnder the supervision and with the participation of our management team, including our Chief Executive Officer and Chief Financial Officer, we conducted an evaluation of our disclosure controls and procedures, as such term is defined under Rule 13a-15(e) and 15d-15(e) promulgated under the Securities Exchange Act of 1934, as amended, as of June 30, 2023. Based on this evaluation, we concluded that our disclosure controls and procedures have the following material weaknesses:\n● The relatively small number of employees who are responsible for accounting functions prevents us from segregating duties within our internal control system.\n● Our internal financial staff lack expertise in identifying and addressing complex accounting issues under U.S. Generally Accepted Accounting Principles.\n● Our Chief Financial Officer is not familiar with the accounting and reporting requirements of a U.S. public company.\n● We have not developed sufficient documentation concerning our existing financial processes, risk assessment and internal controls.\nBased on their evaluation, our Chief Executive Officer and Chief Financial Officer concluded that the Companys system of disclosure controls and procedures was not effective as of June 30, 2023 for the purposes described in this paragraph.\nManagements Report on Internal Control over Financial Reporting\nThe Companys management is responsible for establishing and maintaining adequate internal control over our financial reporting as defined in Rules 13a-15(f) and 15d-15(f) under the Securities Exchange Act. The Companys management is also required to assess and report on the effectiveness of the Companys internal control over financial reporting in accordance with Section 404 of the Sarbanes-Oxley Act of 2002 (Section 404). Internal control over financial reporting is a process to provide reasonable assurance regarding the reliability of the Companys financial reporting for external purposes in accordance with generally accepted accounting principles. Internal control over financial reporting includes policies and procedures that: (i) pertain to maintaining records that in reasonable detail accurately and fairly reflect the Companys transactions; (ii) provide reasonable assurance that transactions are recorded as necessary for preparation of the Companys financial statements and that receipts and expenditures of company assets are made in accordance with management authorization; and (iii) provide reasonable assurance that unauthorized acquisition, use or disposition of company assets that could have a material effect on our financial statements would be prevented or detected on a timely basis.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies and procedures may deteriorate.\nAs of June 30, 2023, our management, under the supervision of and with the participation of the Chief Executive Officer and the Chief Financial Officer, evaluated the effectiveness of our internal control over financial reporting as required by Rules 13a-15(c) and 15d-15(c) under the Exchange Act. In making this assessment, Management used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in Internal Control - Integrated Framework (1992), including the following five framework components: i) control environment, ii) risk assessment, iii) control activities, iv) information and communications, and v) monitoring. In the course of making our assessment of the effectiveness of internal controls over financial reporting, we identified four material weaknesses in our internal control over financial reporting. These material weaknesses consisted of the four material weaknesses identified above under the heading Evaluation of Disclosure Controls and Procedures.\nManagement does not believe that the current level of the Companys operations warrants a remediation of the weaknesses identified in this assessment. However, because of the above condition, managements assessment is that the Companys internal controls over financial reporting were not effective as of June 30, 2023.\nThis annual report does not include an attestation report of the Companys registered public accounting firm regarding internal control over financial reporting. The Companys internal control over financial reporting was not subject to attestation by the Companys registered public accounting firm as we are a smaller reporting company.\nOur management will continue to monitor and evaluate the effectiveness of its disclosure controls and procedures, as well as its internal control over financial reporting, on an ongoing basis, and is committed to taking further action and implementing additional improvements, as necessary and as funds allow. However, our management cannot guarantee that the measures taken or any future measures will remediate the material weaknesses identified or that any additional material weaknesses or significant deficiencies will not arise in the future due to a failure to implement and maintain adequate internal control over financial reporting. Notwithstanding the material weaknesses described above, our management believes that there are no material inaccuracies or omissions of material fact and, to the best of its knowledge, believes that the consolidated financial statements included in this annual report present fairly, in all material respects, our financial position, results of operations, and cash flows for the periods presented in conformity with accounting principles generally accepted in the United States.\nChanges in Internal Control over Financial Reporting\nNo changes in the Companys internal control over financial reporting has come to managements attention during the quarter ended June 30, 2023 that have materially affected, or are likely to materially affect, the Companys internal control over financial reporting. Item 9B. Other Information.\nNone.\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections.\nNot applicable.\nPART III Item 10. Directors, Executive Officers and Corporate Governance.\nName and Address*\nAge\nPosition/Title\nZhang Liang\nPresident and Chairman of the Board\nZhou Hongxiao\nChief Executive Officer and Director\nJin Guoqing\nDirector\nLi Zhijie\nDirector\nKang Liping\nChief Financial Officer\n* The business address for all directors and officers is 419, Floor 4, Comprehensive Building, Second Light Hospital, Ordos Street, Yuquan District, Hohhot, Inner Mongolia, China 010000.\nZhang Liang, President and Chairman of the Board\nMr. Zhang is our founder and has served as our president and director since the incorporation of the Company. From 2006 to 2008, Mr. Zhang was employed as Chief Executive Officer of the Digital Technology Company Limited, which is a technology company. Mr. Zhang served as Chief Executive Officer at Oasis Biotechnology Co., Ltd from 2008 to 2012. He served as the Chief Executive Officer at China-Italy FRP Co., Ltd. between 2013 and 2019. From 2020 until now, Mr. Zhang served as the President of Longduoduo Health Technology Co., Ltd. Mr. Zhang brings to the Board his expertise in business operations, company development, analysis and oversight, marketing including volume growth/program development, expense control, policy and procedure development and implementation, and process development to facilitate regulatory compliance. Mr. Zhang graduated from the Sichuan University in 2008, and majored in Business management. He also obtained a hotel management degree in 2005 from Sichuan University.\nZhou Hongxiao, Chief Executive Officer and Director\nMs. Zhou has served as our Chief Executive Officer (CEO) and director since the incorporation of the Company. Ms. Zhou was employed by Tianjin Aike Clothing Co., Ltd. from 2004 to 2016 and served as Marketing Manager. From 2017 to 2019, Ms. Zhou was employed by Tianyan Tea Industry Co., Ltd. and served as Chief Executive Officer. Ms. Zhou was employed by Longduoduo Health Technology Co., Ltd as CEO since 2020. Ms. Zhou is familiar with sales management and sales regulations and related laws. She is responsible for business operations, budget development, analysis and oversight, marketing including volume growth/program development; expense control, policy and procedure development and implementation, and process development to facilitate regulatory compliance. She is responsible for the overall operation of Longduoduo. M. Zhou brings to the Board her experience in business oversight and financial and budgetary matters. Ms. Zhou was awarded a bachelors degree by Inner Mongolia Radio and Television University in 2003. She obtained her Fine Chemical Industry College degree from Jilin Province Jilin City Institute of Technology in 1998.\nJin Guoqing, Director.\nMr. Jin has been employed by Shenzhen Zhigong Certified Public Accountants since 2011, and currently serves as Supervisor for that firm. Mr. Jin was awarded a Bachelors Degree by Guangdong University of Petrochemical Technology in 2008, and in 2011 earned a Collegiate Degree from the Universal College of Learning in New Zealand. Mr. Jin served as a member of the Board of Directors of JRSIS Health Care Corporation (OTC: JRSS) from 2018 to 2020.\nLi Zhijie, Director.\nMr. Li has been employed as an accountant by Baotou Cultural Industry Association, Baotou Education Bureau, Baotou Education Service Center, Inner Mongolia Actually Real Estate Development Group Co., Ltd. and Inner Mongolia No. 1 Pasture Food Co., Ltd. Mr. Li has also been employed as a legal advisor by the Baotou City Jiuyuan District Baiyin Shiller Sub-district Office in Erdaoxa Henan Village. Mr. Li was awarded a Master Degree in Law by the Inner Mongolia University. He is a member of the China Association for Promoting Democracy and CPPCC member of Kundulun District, Baotou. Mr. Li alse serves as Legal Director of the Inner Mongolia Shuoda Law Firm, President of Jiuyuan District Peoples Mediation Association in Baotou, and a member of the All China Lawyers Association.\nKang Liping, Chief Financial Officer\nMs. Kang has served as our Chief Financial Officer (CFO) since July 2021. Kang Liping was employed by Inner Mongolia Tiantai Technology Co., Ltd from 2020 to 2021 and served as accounting supervisor. From 2006 to 2016, Ms. Kang was employed by Inner Mongolia Guanhong Century Electronic Technology Co., Ltd. and served as accounting supervisor. Between 2017 to 2020, Ms. Kang served as accounting supervisor at Inner Mongolia Tiantai Technology Co., Ltd. Ms. Kang was awarded a bachelors degree with a major in Accounting by Inner Mongolia University of Technology in 2005.\nThere are no family relationships among any of our directors or executive officers.\nOur directors hold office until the next annual general meeting of our shareholders or until removed from office in accordance with our bylaws. Our officers are appointed by our board of directors and hold office until resignation or removal by the board.\nLegal Proceedings Involving Officers and Directors\nTo our knowledge, during the last ten years, none of our directors and executive officers (including those of our subsidiaries) has:\n● Had a bankruptcy petition filed by or against any business of which such person was a general partner or executive officer either at the time of the bankruptcy or within two years prior to that time.\n● Been convicted in a criminal proceeding or been subject to a pending criminal proceeding, excluding traffic violations and other minor offenses.\n● Been subject to any order, judgment, or decree, not subsequently reversed, suspended or vacated, of any court of competent jurisdiction, permanently or temporarily enjoining, barring, suspending or otherwise limiting his involvement in any type of business, securities or banking activities.\n● Been found by a court of competent jurisdiction (in a civil action), the SEC, or the Commodities Futures Trading Commission to have violated a federal or state securities or commodities law, and the judgment has not been reversed, suspended or vacated.\n● Been the subject of, or a party to, any sanction or order, not subsequently reverse, suspended or vacated, of any self-regulatory organization, any registered entity, or any equivalent exchange, association, entity or organization that has disciplinary authority over its members or persons associated with a member.\nBoard Committees\nAudit Committee\nOn March 2, 2023 the Board of Directors adopted the Charter of the Audit Committee of the Board of Directors of Longduoduo Company Limited. Jin Guoqing and Li Zhijie were appointed to serve as the initial members of the Audit Committee. Mr. Jin and Mr. Li are each an independent director. The Board of Directors has determined that Guoqing Jin is an audit committee financial expert, as defined in the Rules of the SEC, by reason of his experience as a public accountant in connection with financial statements prepared pursuant to accounting principles generally accepted in the United States.\nCompensation Committee\nWe do not presently have a compensation committee. Our Board of Directors currently acts as our compensation committee.\nNominating Committee\nWe do not presently have a nominating committee. Our Board of Directors currently acts as our nominating committee.\nCode of Ethics\nDue to the small number of members of our management, we do not presently have a code of ethics applicable to management.\nSection 16(a) Beneficial Ownership Reports Compliance\nNot applicable. Item 11. Executive Compensation.\nSummary Compensation Table\nThe following table sets forth all compensation awarded to, earned by, or paid by Longduoduo or its subsidiaries to its Chairman of the Board, Chief Executive Officer and Chief Financial Officer during the past two fiscal years. There was no officer or employee whose compensation for fiscal year 2023 exceeded $100,000.\nNon-Equity Non-qualified\nIncentive Deferred All\nName and Principal Year Ended Salary Bonus Stock Awards Option Awards Plan\nComp. Comp. Earnings Other Comp. Total\nPosition June 30 ($)* ($) ($) ($) ($) ($) ($) ($)\nZhang Liang 45,097 - - - - - - 45,097\nChairman of the Board 24,542 - - - - - - 24,542\nZhou Hongxiao 26,182 - - - - - - 26,182\nCEO 13,245 - - - - - - 13,245\nKang Liping 31,906 - - - - - - 31,906\nCFO 11,541 - - - - - - 11,541\nOutstanding Equity Awards\nThere were no unexercised options, stock that has not vested, or equity incentive plan awards for any officer or employee as of June 30, 2023 or 2022, respectively.\nEmployment Contracts, Termination of Employment, Change-in-Control Arrangements\nWe have entered into employment contracts with our executive officers under the term of salary disclosed on the summary compensation table. Each party to the contract may terminate the contract upon thirty days prior written notice. We have not entered into any other arrangements with our executive officers. There are no compensation plans or arrangements, including payments to be made by us, with respect to our officers, directors or consultants that would result from the resignation, retirement or any other termination of such directors, officers or consultants from us. There are no compensation arrangements for directors, officers, employees or consultants that would result from a change-in-control.\nCompensation of Directors\nWe have no formal plan for compensating our directors for their services in their capacity as directors. Directors are entitled to reimbursement for reasonable travel and other out-of-pocket expenses incurred in connection with attendance at meetings of our Board of Directors. The Board of Directors may award special remuneration to any director undertaking any special services on behalf of the Company other than services ordinarily required of a director. To date, we have paid no compensation to any person for services as a member of the Companys Board of Directors. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nThe following table sets forth information regarding the beneficial ownership of our common stock for (1) each person, or group of affiliated persons, known by us to beneficially own more than 5% of our common stock; (2) each of our named executive officers; (3) each of our directors; and (4) all of our executive officers and directors as a group.\nWe have determined beneficial ownership in accordance with the rules of the Securities and Exchange Commission. These rules generally attribute beneficial ownership of securities to persons who possess sole or shared voting power or investment power with respect to those securities. The person is also deemed to be a beneficial owner of any security of which that person has a right to acquire beneficial ownership within 60 days. Unless otherwise indicated, the persons or entities identified in this table have sole voting and investment power with respect to all shares shown as beneficially owned by them, subject to applicable community property laws. The address for each person listed in the table is c/o Longduoduo, 419, Floor 4, Comprehensive Building, Second Light Hospital, Ordos Street, Yuquan District, Hohhot, Inner Mongolia.\nThe percentage ownership information shown in the table below is calculated based on 30,005,008 shares of our common stock issued and outstanding as of the date of this report. We do not have any outstanding options, warrants or other securities exercisable for or convertible into shares of our common stock.\nExecutive Officers and Directors Amount of Beneficial\nOwnership of Common\nStock (1) Pre-Offering Percentage\nOwnership of Common\nStock Post-Offering Percentage\nOwnership of Common\nStock\nDirectors and Named Executive Officers:\nZhang Liang 15,392,015 51.30 % 51.30 %\nZhou Hongxiao - - % - %\nJin Guoqing - - % - %\nLi Zhijie - - % - %\nKang Liping 5,000 0.02 % 0.02 %\n- - -\nAll executive officers and directors as a group (5 persons) 15,397,015 51.32 % 51.32 %\n5% or Greater Shareholders\nLi Qiaozhen 1,595,502 5.32 % 5.32 %\nLiu Jiazhong 1,527,191 5.09 % 5.09 %\nGuo Xiaozhen 1,676,675 5.59 % 5.59 %\n(1) Beneficial ownership is determined in accordance with the rules of the SEC and includes voting or investment power with respect to the common stock. All shares represent only common stock held by shareholders as no options are issued or outstanding.\nWe are not aware of any contract or other arrangement the operation of which may at a subsequent date result in a change in control of our Company.\nRegistration Rights\nWe have registered for resale by security holders under the Securities Act 14,607,993 shares of our common stock owned of record by 48 shareholders. Item 13. Certain Relationships and Related Transactions, and Director Independence.\nOn October 26, 2021, Longduoduo acquired One Hundred Percent (100%) of the issued and outstanding capital stock of Longduoduo HK, a privately held limited liability company registered in Hong Kong for three hundred million (300,000,000) (pre-reverse-split) shares of our common stock. One of the shareholders of Longduoduo HK is now a director and President of Longduoduo: Zhang Liang, who received 153,920,147 shares of Longduoduo in the Share Exchange. The other 48 shareholders of Longduoduo HK received a total of 146,079,853 shares of Longduoduo in the Share Exchange.\nAs of June 30, 2023 and 2022, no amount was due to the Company from related parties.\nAs of June 30, 2023 and 2022, the amounts due to related parties consisted of the following:\nJune 30,\nName of related parties\nZhang Liang $ 69,419 $ 5,353\nZhou Hongxiao. 35,192 69,205\n$ 104,611 $ 74,558\nZhang Liang is the President, Chairman of the Board, director and a shareholder of Longduoduo, and Zhou Hongxiao is the CEO of Longduoduo. These advances due to related parties were unsecured, repayable on demand, and bear no interest.\nExcept as set forth above, there was no transaction in which a related person had a material interest during the past fiscal year nor any currently proposed transaction, in which the amount involved exceeded the lesser of $120,000 or one percent of our average total assets at the end of the two most recent fiscal years.\nDirector Independence\nThe Companys Board of Directors has determined that Jin Guoqing and Li Zhijie are independent directors, as independence is defined in the Rules of the NYSE American. Item 14. Principal Accounting Fees and Services.\nKCCW Accountancy Corp was engaged to serve as the Companys independent registered public accounting firm on September 13, 2021 and was terminated from that position on June 16, 2023.\nMichael T. Studer CPA P.C. was engaged to serve as the Companys independent registered public accounting firm on September 29, 2023.\nThe following table shows the fees that were billed for the audit and other services provided by KCCW Accountancy Corp with respect to the fiscal year ended June 30, 2022 and by Michael T. Studer CPA P.C. with respect to the fiscal year ended June 30, 2023.\nYear Ended\nJune 30,\nAudit fees\n$ 120,000\n$ 60,000\nAudit-related fees\n$\n$\nTax fees\n$\n$\nAll other fees\n$\n$\nOur Board of Directors pre-approves all audit and non-audit services performed by the Companys auditor and the fees to be paid in connection with such services.\nPART IV ITEM 15. EXHIBITS, FINANCIAL STATEMENTS SCHEDULES\nINDEX TO EXHIBITS\nExhibit No.\nDescription of Exhibit\n3.1(a)\nArticles of Incorporation of Registrant (1)\n3.1(b)\nCertificate of Change Pursuant to NRS 78.209 filed on September 21, 2023 (4)\n3.2\nBylaws of Registrant (1)\n4(iv)\nDescription of Common Stock\n21.1\nList of Company Subsidiaries (1)\n31.1\nCertification of Chief Executive Officer pursuant to Securities Exchange Act Rule 13a-14(a)/15d-14(a), as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n31.2\nCertification of Chief Financial Officer pursuant to Securities Exchange Act Rule 13a-14(a)/15d-14(a), as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n32.1\nCertification of Chief Executive Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n32.2\nCertification of Chief Financial Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n101.INS\nInline XBRL Instance Document\n101.SCH\nInline XBRL Taxonomy Extension Schema Document\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101)\n(1) Incorporated by reference to the Exhibits to the Registration Statement on Form S-1 filed with the Securities and Exchange Commission on November 10, 2021.\n(2) Incorporated by reference to the Exhibits to Amendment No. 1 to the Registration Statement on Form S-1 filed with the Securities and Exchange Commission on January 21, 2022.\n(3) Incorporated by reference to the Exhibits to Amendment No. 2 to the Registration Statement on Form S-1 filed with the Securities and Exchange Commission on April 18, 2022.\n(4) Incorporated by reference to the Exhibits to the Current Report on Form 8-K filed with the Securities and Exchange Commission on September 27, 2023.\nSIGNATURES\nIn accordance with Section 13 or 15(d) of the Exchange Act, the registrant caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nLONGDUODUO COMPANY LIMITED\nSignature\nTitle\nDate\n/s/ Zhou Hongxiao\nChief Executive Officer\nNovember 14, 2023\nZhou Hongxiao\n(Principal Executive Officer)\n/s/ Kang Liping\nChief Financial Officer\nNovember 14, 2023\nKang Liping\n(Principal Financial and Accounting Officer)\nIn accordance with the Exchange Act, this Report has been signed below on November 14, 2023 by the following persons, on behalf of the Registrant and in the capacities and on the dates indicated.\nSignature\nTitle\n/s/ Zhou Hongxiao\nChief Executive Officer; Director\nZhou Hongxiao\n/s/ Kang Liping\nChief Financial Officer\nKang Liping\n/s/ Zhang Liang\nDirector\nZhang Liang\n/s/ Jin Guoqing\nDirector\nJin Guoqing\n/s/ Li Zhijie\nDirector\nLi Zhijie\n0.001 0.293\n0.001 0.293 false FY\n2022-07-01 2023-06-30\n2023-11-15\n2022-12-31\n2023-06-30\n2022-06-30\nus-gaap:RelatedPartyMember\n2023-06-30\nus-gaap:RelatedPartyMember\n2022-06-30\n2021-07-01 2022-06-30\nus-gaap:CommonStockMember\n2021-06-30\nus-gaap:AdditionalPaidInCapitalMember\n2021-06-30\nus-gaap:RetainedEarningsMember\n2021-06-30\nus-gaap:AccumulatedOtherComprehensiveIncomeMember\n2021-06-30\nus-gaap:ParentMember\n2021-06-30\nus-gaap:NoncontrollingInterestMember\n2021-06-30\n2021-06-30\nus-gaap:CommonStockMember\n2021-07-01 2022-06-30\nus-gaap:AdditionalPaidInCapitalMember\n2021-07-01 2022-06-30\nus-gaap:RetainedEarningsMember\n2021-07-01 2022-06-30\nus-gaap:AccumulatedOtherComprehensiveIncomeMember\n2021-07-01 2022-06-30\nus-gaap:ParentMember\n2021-07-01 2022-06-30\nus-gaap:NoncontrollingInterestMember\n2021-07-01 2022-06-30\nus-gaap:CommonStockMember\n2022-06-30\nus-gaap:AdditionalPaidInCapitalMember\n2022-06-30\nus-gaap:RetainedEarningsMember\n2022-06-30\nus-gaap:AccumulatedOtherComprehensiveIncomeMember\n2022-06-30\nus-gaap:ParentMember\n2022-06-30\nus-gaap:NoncontrollingInterestMember\n2022-06-30\nus-gaap:CommonStockMember\n2022-07-01 2023-06-30\nus-gaap:AdditionalPaidInCapitalMember\n2022-07-01 2023-06-30\nus-gaap:RetainedEarningsMember\n2022-07-01 2023-06-30\nus-gaap:AccumulatedOtherComprehensiveIncomeMember\n2022-07-01 2023-06-30\nus-gaap:ParentMember\n2022-07-01 2023-06-30\nus-gaap:NoncontrollingInterestMember\n2022-07-01 2023-06-30\nus-gaap:CommonStockMember\n2023-06-30\nus-gaap:AdditionalPaidInCapitalMember\n2023-06-30\nus-gaap:RetainedEarningsMember\n2023-06-30\nus-gaap:AccumulatedOtherComprehensiveIncomeMember\n2023-06-30\nus-gaap:ParentMember\n2023-06-30\nus-gaap:NoncontrollingInterestMember\n2023-06-30\n2021-10-26\nlddc:LongduoduoHealthTechnologyCompanyLimitedMember\n2021-10-26\nlddc:LongduoduoHealthTechnologyCompanyLimitedMember\n2021-08-16\nlddc:QingguoMember\n2020-09-08\nlddc:RongbinMember\n2021-03-18\nlddc:ChenghengMember\n2021-04-09\nlddc:TianjuMember\n2021-07-05\nus-gaap:OtherCustomerMember\n2023-06-30\nus-gaap:OtherCustomerMember\n2022-06-30\nus-gaap:SalesReturnsAndAllowancesMember\n2022-07-01 2023-06-30\nus-gaap:SalesReturnsAndAllowancesMember\n2021-07-01 2022-06-30\nlddc:LongduoduoCompanyLimitedMember country:HK\n2022-07-01 2023-06-30\nlddc:LongduoduoHealthTechnologyCompanyLimitedMember country:CN\n2022-07-01 2023-06-30\nlddc:InnerMongoliaQingguoHealthConsultingCompanyLimitedMember country:CN\n2022-07-01 2023-06-30\nlddc:InnerMongoliaRongbinHealthConsultingCompanyLimitedMember country:CN\n2022-07-01 2023-06-30\nlddc:InnerMongoliaChenghengHealthConsultingCompanyLimitedMember country:CN\n2022-07-01 2023-06-30\nlddc:InnerMongoliaTianjuHealthConsultingCompanyLimitedMember country:CN\n2022-07-01 2023-06-30\nlddc:PeriodEndExchangeRateMember lddc:USDToRMBMember\n2023-06-30\nlddc:PeriodEndExchangeRateMember lddc:USDToHKDMember\n2023-06-30\nlddc:PeriodEndExchangeRateMember lddc:USDToRMBMember\n2022-06-30\nlddc:PeriodEndExchangeRateMember lddc:USDToHKDMember\n2022-06-30\nlddc:PeriodWeightedAverageMember lddc:USDToRMBMember\n2023-06-30\nlddc:PeriodWeightedAverageMember lddc:USDToHKDMember\n2023-06-30\nlddc:PeriodWeightedAverageMember lddc:USDToRMBMember\n2022-06-30\nlddc:PeriodWeightedAverageMember lddc:USDToHKDMember\n2022-06-30\nlddc:SupplierAMember\n2022-07-01 2023-06-30\nlddc:SupplierAMember\n2021-07-01 2022-06-30\nlddc:SupplierBMember\n2022-07-01 2023-06-30\nlddc:SupplierBMember\n2021-07-01 2022-06-30\nlddc:SupplierCMember\n2022-07-01 2023-06-30\nlddc:SupplierCMember\n2021-07-01 2022-06-30\nlddc:SupplierDMember\n2022-07-01 2023-06-30\nlddc:SupplierDMember\n2021-07-01 2022-06-30\nus-gaap:OfficeEquipmentMember\n2022-07-01 2023-06-30\nsrt:MinimumMember us-gaap:LeaseholdImprovementsMember\n2022-07-01 2023-06-30\nsrt:MaximumMember us-gaap:LeaseholdImprovementsMember\n2022-07-01 2023-06-30\nus-gaap:SoftwareDevelopmentMember\n2023-06-30\nlddc:ZhangLiangMember\n2022-07-01 2023-06-30\nlddc:ZhangLiangMember\n2021-07-01 2022-06-30\nlddc:ZhouHongxiaoMember\n2022-07-01 2023-06-30\nlddc:ZhouHongxiaoMember\n2021-07-01 2022-06-30\n2021-03-01 2021-03-31\n2021-04-01 2021-04-30\n2022-05-27 2022-05-27\n2022-05-27\n2021-08-25 2021-08-25\nlddc:OperatingLeaseAgreementsMember\n2021-08-25 2021-08-25\n2022-07-02 2022-07-02\n2023-04-04 2023-04-04\nsrt:MinimumMember\n2022-07-01 2023-06-30\nsrt:MaximumMember\n2022-07-01 2023-06-30\nlddc:EdenHallGlobalCapitalCpLtdMember\n2021-07-26\nlddc:EdenHallGlobalCapitalCpLtdMember\n2021-07-01 2021-07-26\nlddc:ThirtyTwoSalesAgentsMember\n2021-07-26\nlddc:ThirtyTwoSalesAgentsMember\n2021-07-01 2021-07-26\nlddc:WudunQiqigeMember\n2021-07-26\n2021-07-01 2021-07-26\nsrt:ChiefFinancialOfficerMember lddc:KangLipingMember\n2023-02-20\nlddc:QingguoMember\n2023-06-30\nlddc:ChenghengMember\n2023-06-30\nlddc:RongbinMember\n2023-06-30\nlddc:TianjuMember\n2023-06-30\nlddc:NonControllingInterestsMember\n2023-06-30\nlddc:NonControllingInterestsMember\n2022-06-30\nlddc:NonControllingInterestsMember\n2022-07-01 2023-06-30\nlddc:NonControllingInterestsMember\n2021-07-01 2022-06-30\nus-gaap:SubsequentEventMember\n2023-09-21\nxbrli:shares\niso4217:USD\niso4217:USD\nxbrli:shares\nxbrli:pure\niso4217:CNY\nutr:sqm"
}