{
    "cik": "1892922",
    "company": "Mars Acquisition Corp.",
    "filing_type": "10-K",
    "filing_date": "2023-12-28",
    "period_of_report": "2023-09-30",
    "sic": "6770",
    "state_of_inc": "E9",
    "state_location": "NY",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1892922/0001410578-23-002651-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1892922/000141057823002651/marx-20230930x10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1892922/0001410578-23-002651.txt",
    "filename": "1892922_10K_2023_0001410578-23-002651.htm",
    "content": "Item 1. Business.\nIntroduction\nMars Acquisition Corp. (Mars, we, or us) is a blank check company in the Cayman Islands on April 23, 2021 for the purpose of effecting a merger, capital stock exchange, asset acquisition, stock purchase, reorganization or similar business combination with one or more businesses. We have generated no operating revenues to date and we do not expect that we will generate operating revenues until we consummate the Business Combination or we identify an alternative business combination, which is sometimes referred to in this Annual Report as the Business Combination.\nOn September 5, 2023, a Business Combination Agreement was entered into by Mars and ScanTech Identification Beam Systems, LLC (ScanTech), among others. ScanTech is a leading global innovator, developing the most advanced non-intrusive fixed-gantry CT baggage and cargo logistics screening technology in the world. ScanTech utilizes proprietary artificial intelligence (AI) and machine learning capabilities to develop state-of-the-art computed tomography (CT) scanners that accurately and quickly detect hazardous and contraband materials. With a commitment to making the world a safer place, ScanTech develops systems, software, and artificial intelligence designed to protect the worlds most sensitive security checkpoints. While initially focused on the airline industry, the unmatched speed and accuracy of the companys fixed gantry solutions seek to revolutionize security operations capabilities worldwide, providing critical security measures to governments, businesses, and individuals across a diverse group of industries.\nInitial Public Offering and Private Placement\nOn February 16, 2023, Mars consummated its Initial Public Offering of 6,900,000 Units, including 900,000 Units that were issued pursuant to the underwriters full exercise of their over-allotment option. The Units were sold at a price of $10.00 per Unit, generating gross proceeds to Mars of $69,000,000.\nOn February 16, 2023, simultaneously with the IPO, Mars sold 391,000 Private Placement Units, including 36,000 Private Placement Units that were issued pursuant to the underwriters full exercise of the over-allotment option, at $10.00 per Unit, generating gross proceeds of $3,910,000 in the Private Placement. The proceeds from the Private Placement were added to the proceeds from the Initial Public Offering held in the Trust Account. Mars will have until 12 months (or 18 months as applicable) from the closing of this IPO to consummate a Business Combination. If Mars does not complete a Business Combination within the Combination Period, the Rights contained within the Private Placement Units will expire worthless.\nEach Unit consists of one Ordinary Share and one Right to receive two-tenths (2/10) of one Ordinary Share upon consummation of our initial Business Combination. The holder must hold Rights in multiples of five (5) in order to receive shares for all of their Rights upon closing of a Business Combination.\nSubject to waiver by agreement or limitations, holders of Ordinary Shares may demand that Mars redeem such shares for a pro rata portion of the cash held in the Trust Account including interest earned on the funds held in the Trust Account.\nBusiness Combination Agreement - Proposed Business Combination with ScanTech\nOn September 5, 2023, we entered into the Business Combination Agreement with ScanTech, a Delaware limited liability company; ScanTech AI Systems Inc., a Delaware corporation and a wholly owned subsidiary of Mars (Pubco); Mars Merger Sub I Corp., a Cayman Islands exempted company and a wholly owned subsidiary of Mars (Purchaser Merger Sub); Mars Merger Sub II LLC, a Delaware limited liability company and a wholly owned subsidiary of Pubco (Company Merger Sub); and Dolan Falconer in the capacity as the Seller Representative from and after the Effective Time for the ScanTech Holder Participants as of immediately prior to the Effective Date.\nThe Business Combination Agreement provides that, among other things and upon the terms and subject to the conditions thereof, among other things, upon Closing, (i) Purchaser Merger Sub will merge with and into Mars, with Mars continuing as the surviving entity (the Purchaser Merger), and, in connection therewith, each Ordinary Share issued and outstanding immediately prior to the Effective Time will be cancelled in exchange for the right of the holder thereof to receive, with respect to each Ordinary Share\nthat is not redeemed or converted in the Closing Redemption, one share of Pubco Common Stock; (ii) Company Merger Sub will merge with and into ScanTech, with ScanTech continuing as the surviving entity (the Company Merger, and together with the Purchaser Merger, the Mergers), and, in connection therewith, (A) the ScanTech Common LLC Units issued and outstanding immediately prior to the Effective Time will be cancelled in exchange for the right of the holders thereof to receive shares of Pubco Common Stock as set forth therein and (B) any Company Convertible Securities will be terminated; and (iii) as a result of the Mergers, Mars and ScanTech each will become wholly owned subsidiaries of Pubco, and Pubco will become a publicly traded company, all upon the terms and subject to the conditions set forth in the Business Combination Agreement and in accordance with the provisions of applicable law.\nPubco will apply for listing, to be effective upon the Closing (effectiveness of such listing is a condition to the Closing), of the shares of Pubco Common Stock on the Nasdaq Capital Market under the proposed symbol STAI. No securities of Mars will be traded following the consummation of the Business Consummation.\nMerger Consideration\nThe aggregate consideration to be paid to ScanTech shall be a number of shares of Pubco Common Stock with an aggregate value equal to One Hundred Ten Million U.S. Dollars ($110,000,000) minus the Closing Net Debt as set forth in the Business Combination Agreement. Additionally, after the Closing, subject to the terms and conditions set forth in the Business Combination Agreement, the ScanTech Holder Participants will have the contingent right to receive up to a number of shares of Pubco Common Stock equal to ten percent (10%) of the fully diluted shares of Pubco Common Stock outstanding immediately following the Closing (subject to adjustment based on stock splits and similar events) based on Pubcos achievement of certain milestones, including commercial milestones and revenue and EBITDA milestones, as more particularly set forth in the Business Combination Agreement.\nConditions to Closing\nThe Closing is subject to certain customary conditions, including, among other things, (i) approval by Mars shareholders of the Business Combination Agreement, (ii) approval by ScanTechs members of the Business Combination Agreement, (iii) the receipt, expiration or termination of applicable government approvals and consents, (iv) the absence of any legal restraints or injunctions enjoining or prohibiting the consummation of the Business Combination, (v) election or appointment of members of the board in accordance with the Business Combination Agreement, (vi) the effectiveness of a registration statement on Form S-4 to be filed by Pubco relating to the Business Combination, which will contain a proxy statement of Mars in connection with its solicitation of proxies for the vote by Mars shareholders in connection with the Business Combination and other matters as described in the Form S-4, (vii) the approval for listing on Nasdaq of the Pubco Common Stock to be issued in the Business Combination, (viii) completion of a recapitalization by ScanTech prior to the Closing, (iv) the accuracy of each partys representations and warranties, except generally as would not have a Material Adverse Effect and, in the case of certain fundamental representations, in all material respects, (x) compliance by each party with pre-closing covenants in all material respects, and (xi) completion and delivery of certain amendments, ancillary documents, and closing deliverables.\nCovenants, Representations and Warranties\nThe parties to the Business Combination Agreement have made covenants that are customary for transactions of this nature, including, among others, obligations on (i) the parties to conduct, as applicable, their respective businesses in the ordinary course and consistent with past practice through the Closing, (ii) the parties to not initiate any negotiations or enter into any agreements for certain alternative transactions, (iii) ScanTech to prepare and deliver to Mars certain audited financial statements of ScanTech, and (iv) Pubco, ScanTech and Mars to jointly prepare the Form S-4, and Pubco to file the Form S-4, and Mars to take certain other actions for Mars to obtain the requisite approval of Mars shareholders of certain proposals regarding the Business Combination.\nThe parties to the Business Combination Agreement have made representations and warranties that are customary for transactions of this nature. These representations and warranties, in certain cases, are subject to specified exceptions and materiality, Material Adverse Effect (as defined below), knowledge and other qualifications contained in the Business Combination Agreement or in information provided pursuant to certain disclosure schedules to the Business Combination Agreement. Material Adverse Effect as used in the Business Combination Agreement means, with respect to any specified person or entity, any fact, event, occurrence, change or effect that has had, or would reasonably be expected to have, individually or in the aggregate, a material adverse effect upon (i) the business, assets, liabilities, customer relationships, operations, results of operations or condition (financial or otherwise) of such person or entity and its subsidiaries, taken as a whole, or (ii) the ability of such person or entity or any of its subsidiaries on a timely basis to consummate the transactions contemplated by the Business Combination Agreement or the Ancillary Documents to which it is a party\nor bound or to perform its obligations hereunder or thereunder, in each case subject to certain customary exceptions set forth in the Business Combination Agreement. The representations and warranties of the respective parties to the Business Combination Agreement generally will not survive the Closing, and there are no indemnification rights for another partys breach thereof.\nTermination\nThe Business Combination Agreement may be terminated by either ScanTech or Mars under certain circumstances, including, among others, (i) by written consent of both Mars and ScanTech, (ii) by either ScanTech or Mars by written notice if any of closing conditions have not been satisfied or waived by January 31, 2024, (iii) by either ScanTech or Mars if the Business Combination is permanently enjoined, prohibited or prevented by the terms of a final, non-appealable governmental order, (iv) by either ScanTech or Mars if the other party has materially breached their respective representations or covenants under the Business Combination Agreement and has not timely cured such breach, (v) by either ScanTech or Mars if there is a Material Adverse Effect on the other party and the Material Adverse Effect has not been timely cured, (vi) by either ScanTech or Mars if Mars has held a shareholders meeting to approve the Business Combination and approval of the Business Combination has not been obtained by the requisite vote of the shareholders of Mars, and (vii) by either ScanTech or Mars if the ScanTech Holders do not approve the Business Combination.\nFollowing the termination of the Business Combination Agreement, there shall be no liability on the part of any party except for certain specified provisions that survive the termination.\nOur Management Team\nKarl Brenza has served as our Chief Executive Officer, Chief Financial Officer and director since Mars inception. He is a citizen of the United States and is based in New York, New York. Mr. Brenza has over 25 years of investment banking and financial advisory experience as well as significant operational and technology experience as a corporate executive. He has extensive blank-check/SPAC experience and completed some of the earliest blank-check/SPAC transactions. During his career, Mr. Brenza has completed a vast array of transactions in the areas of strategic advisory assignments, mergers, acquisitions, reverse merger transactions, IPOs, follow-on offerings, SPACs, PIPEs, fairness opinions and private financings of debt and equity. Mr. Brenza is currently serving as Senior Managing Director, Head of Capital Growth Advisory Group at Maxim Group, LLC and CFO of Omni ECom Acquisition Corp. Previously, Mr. Brenza served as CFO of First Breach, Inc, an ammunition components company from November 2021 to September 2022. In addition, from August 2018 to November 2021, he was Senior Managing Director, Investment Banking for Paulson Investment Company. From August 2018 to December 2019, he also served as the Head of US Operations for Jerash Holdings US, a Nasdaq-listed manufacturer of outdoor and action garments and sportswear. From 2008 to 2018, Mr. Brenza was Senior Managing Director and Head of the Capital Growth Advisory Group at Maxim Group, LLC. Mr. Brenza received an MBA with honors from Columbia Business School, a BS in Electrical Engineering from the University of Pennsylvania and has been a guest lecturer at the NYU Stern Graduate School of Business.\nXiaochen (Iris) Zhao has served as our Chief Operating Officer since Mars inception. She is a citizen of the Republic of Malta and is based in London, the United Kingdom. Ms. Iris Zhao has 10 years of experience in building and advising corporations through M&A and capital market transactions globally. Ms. Zhao is responsible for managing and coordinating companys investment, liquidity and asset liability management in order to optimize investment performance within the risk management guidelines. At the same time, to monitor companys portfolio of assets, devise strategies for growth, act as the liaison with investors, and recognize and avoid serious risks. Ms. Zhao is proficient in road-shows presentation, structuring and negotiating transactions and terms with international investment commUnities and corporate finance. Ms. Zhao was appointed as the Chief Investment Officer of Future Fintech Group Inc. (NASDAQ stock ticker: FTFT) in February 2020. Prior to that, she served as the Managing Partner of Wealth Index (Beijing) Fund Management Co., Ltd., which is a top financial advisory service corporation that focuses on financial advisory, private equities investment and investment banking businesses. From January 2011 to February 2019, Ms. Zhao was in charge of international business planning and developing, and investor relationships. Ms. Zhao has completed dozens of transactions in a wide range of transactions including IPOs, M&A transactions, RTOs, follow-on offerings, public and private fund raising, and PIPEs. In her early career, Ms. Zhao worked at SUNTV Video Ltd. As a Specialist in NYC. She brings experience in media, business negotiation, and is familiar with international business activities. Ms. Zhao studied Finance at New York City University and Montana State University. She received Bachelor of Science with the highest honor in Finance from Montana State University and was appointed to Beta Gamma Sigma, international association of Elite Business Schools. She received MBA from UP Diliman. Ms. Zhao is the Dame of Grace of the Order of Saint Lazarus of Jerusalem, and the first Commander of the Grand Priory of China. Ms. Zhao is Shanchun Huangs wife.\nShanchun Huang has served as our Chairman since Mars inception. He is a citizen of the Republic of Malta and is based in London, the United Kingdom. Mr. Huang has over 20 years of experience in the financial services and investment industry. He has provided financing solutions and advice for high-growth companies in China and successfully assisted 37 enterprises to complete fundraising and public offerings globally. Mr. Huang has served as the CEO and director of Future Fintech Group, Inc. a Nasdaq-listed company and a blockchain based e-commerce platform since March 2020. Most recently, Mr. Huang served as the president of Wealth Index (Beijing) Fund Management Co., Ltd., which provides private equity fund management service, from March 2011 to March 2020 and president of Wealth Index (Beijing) International Investment Consulting Co., Ltd., which provides investment management and consulting services for non-securities related business, from August 2004 to March 2020. From May 2001 to June 2004, Mr. Huang was the vice president of Zhejiang Geely Holding Group Corporation, a global leading automobile company headquartered in Hangzhou, China. Mr. Huang graduated from Hefei Staff University of Science and Technology in July 1986 majoring in news collection and editing. Mr. Huang is also a prolific writer and has published four books in finance and investment sector in China, namely How to Raise Money to Start a Business, the Road to Red Chips, Comparison and Research Among Global Capital Markets, and The Practice of Small and Medium Enterprises Listed Overseas and Hong Kong. Mr. Huang is the Knight Commander of Grace of the Order of Saint Lazarus of Jerusalem, and the first Grand Prior of the Grand Priory of China. Mr. Huang is our COO Xiaochen Zhaos husband.\nYenyou (Jeff) Zheng has served as an independent director since Mars inception. He is a citizen of Canada and is based in Vancouver, Canada. Dr. Zheng has over 20 years of experience in investment banking and financing industry. Dr. Zheng currently serves as the Director of Business Development of, and as a broker with, Craft Capital Management LLC and has served in such positions since September 2019. He is also currently an independent director of NovaBay Pharmaceuticals, Inc. (NYSE American: NBY) since September 2019. Prior to that, Dr. Zheng served as the Director of Business Development of Spartan Securities Group, Ltd. From 2014 to August 2019. Dr. Zhengs experience includes providing innovative financial solutions and consulting services for initial public offering underwriting and investment banking as well as corporate financing solutions with a particular focus on Chinese companies listed overseas. Dr. Zheng received a Ph.D. in physics from Flinders University of South Australia.\nJames Jenkins has served as an independent director since Mars inception. He is a citizen of the United States and is based in Rochester, New York. Mr. Jenkins currently serves as Chairman of the board of Lakeland Industries, Inc. (Nasdaq: Lake) and serves on its Audit, Nominating and Compensation Committees. He previously served on the board of Lakeland Industries, Inc. from 2012 to 2015 and was a member of the Audit and Corporate Governance Committees. He also served between November 2021 and April 2023 on the Board, Audit and Compensation Committees of OmniLit Acquisition Corp. (Nasdaq: OLITU), a SPAC that recently raised $143.75 million. Mr. Jenkins is a General Counsel and Vice President of Corporate Development at Transcat, Inc. (Nasdaq: TRNS) and has served in that position since September 2020. At Transcat he drives its acquisition strategy. Prior to that he served as a partner at Harter Secrest & Emery LLP, a regional law firm located in New York State. His practice focused in the areas of corporate governance and general corporate law matters, including initial and secondary public offerings, Private Placements, mergers and acquisitions, and securities law compliance. Mr. Jenkins joined Harter Secrest and Emery in 1989 as an associate and was elected a partner effective January 1, 1997. He is a Chambers rated attorney and served as a member of the firms Management Committee from January 2007 to January 2013. Mr. Jenkins holds a BA from Virginia Military Institute and a J.D. from West Virginia University College of Law.\nYang (Sean) Liu has served as an independent director since Mars inception. He is a citizen of the United States and is based in New York, New York. Mr. Liu is a seasoned executive with 16 years of experience in an array of industries including technologies, finance, investment banking and corporation. He has a proven record of driving growth within global organizations and management of public companies. Mr. Liu served as the Chairman of the board and the Chief Executive Officer at Color Star Technology Co. Ltd (Nasdaq stock ticker: CSCW), a Nasdaq company, from March 2019 to July 2020. Through a series of acquisitions and dispositions, he successfully transformed the company from a traditional Chinese manufacturer into a global technology company in education and entertainment. He also served as the CEO and Chairman at Wave Sync Corporation, an OTC technology company from July 2017 to August 2018. From 2015 to 2017, Mr. Liu worked as an IT Manager at UBS, overseeing regional production support and implementation coordination of its core capital market software platform. Mr. Liu received two M.S. degrees in financial mathematics and electrical engineering from New Mexico State University in the United States. He also received a B.S. Degree in Electronic Engineering from Tsinghua University in China.\nXin (Adam) He has served as an independent director since Mars inception. He is a citizen of Peoples Republic of China, a US permanent resident and is based in Chicago, Illinois. Mr. He has been a CFO for a Fortune Global 500 conglomerate, Wanda USA since May 2012. Mr. He played a key role in two prominent international projects - the development of a 101-story landmark Vista Tower in downtown Chicago and the acquisition of AMC Entertainment Inc, that he later led its IPO to NYSE in 2013. His diverse background across various industries came from his previous jobs as Financial Controller for NYSE listed Xinyuan Real Estate Co., auditor at Financial Service Office in Ernst & Young LLP in New York, and various leadership roles at Chinatex Corporation. Due to his exceptional public company management expertise, Mr. He was invited to serve as an independent board director at Energy Focus (Nasdaq: EFOI) from July 2014 to April 2015, iFresh Inc. (Nasdaq: IFMK) from December 2017 to April 2018, Professional Diversity Network (Nasdaq: IPDN) from January 2018 to March 2019, and Beijing Baosheng Media (Nasdaq: BAOS) from February 2021 to present. He is also deeply involved in a non-profit organization, as Vice Chair of the China General Chamber of Commerce Chicago, to bridge culture and business between US and China. His education and license strongly support this endeavor as he had obtained a Bachelor and Master of Science in Taxation from Central University of Finance and Economics in Beijing, and a Master of Science in Accounting from Seton Hall University in New Jersey. He is also a Certified Public Accountant both in China and in New York state.\nLack of Business Diversification\nFor an indefinite period of time after the completion of the Business Combination, the prospects for our success may depend entirely on the future performance of a single business. Unlike other entities that have the resources to complete business combinations with multiple entities in one or several industries, it is probable that we will not have the resources to diversify our operations and mitigate the risks of being in a single line of business. In addition, we intend to focus our search for the Business Combination in a single industry. By completing our business combination with only a single entity, our lack of diversification may:\n● subject us to numerous economic, competitive and regulatory developments, any or all of which may have a substantial adverse impact on the particular industry in which we operate after the Business Combination, and\n● cause us to depend on the marketing and sale of a single product or limited number of products or services.\nLimited Ability to Evaluate the Targets Management Team\nAlthough we have closely scrutinized the management of ScanTech as part of our diligence process, our assessment may not prove to be correct. In addition, the future management may not have the necessary skills, qualifications or abilities to manage a public company. It is currently contemplated that both Karl Brenza and James Jenkins will serve on the board of directors of Pubco following the Closing. Despite this fact, neither Messrs. Brenza nor Jenkins will devote their full efforts to our affairs to Pubco subsequent to Closing.\nFollowing the Closing, we may seek to recruit additional managers to supplement the incumbent management of Pubco. We cannot assure you that we will have the ability to recruit additional managers, or that additional managers will have the requisite skills, knowledge or experience necessary to enhance the incumbent management.\nShareholders May Not Have the Ability to Approve our Initial Business Combination\nWe may conduct redemptions without a shareholder vote pursuant to the tender offer rules of the SEC. However, we will seek shareholder approval if it is required by applicable law or stock exchange listing requirements, or we may decide to seek shareholder approval for business or other reasons. Presented in the table below is a graphic explanation of the types of initial business combinations we may consider and whether shareholder approval is currently required under the Companies Act for each such transaction.\nType of Transaction\nWhether Shareholder\nApproval is Required\nPurchase of assets\nNo\nPurchase of stock, shares or other equity interests of target not involving a merger with the company\nNo\nMerger of target into a subsidiary of the company\nNo\nMerger of the company with a target\nYes\nUnder Nasdaqs listing rules, shareholder approval would be required for the Business Combination if, for example:\n● we issue Ordinary Shares that will be equal to or in excess of 20% of the number of Ordinary Shares then issued and outstanding (other than in a public offering);\n● any of our directors, officers or substantial security holders (as defined by Nasdaq rules) has a 5% or greater interest, directly or indirectly, in the target business or assets to be acquired and the number of shares to be issued, or if the number of shares into which the securities may be convertible or exercisable, exceeds either (a) 1% of the number of Ordinary Shares or 1% of the voting power issued and outstanding before the issuance in the case of any of our directors and officers or (b) 5% of the number of Ordinary Shares or 5% of the voting power issued and outstanding before the issuance in the case of any substantial security holders; or\n● the issuance or potential issuance of Ordinary Shares will result in our undergoing a change of control.\nPermitted purchases and other transactions with respect to our securities\nIn the event we seek shareholder approval of our business combination and we do not conduct redemptions in connection with the Business Combination pursuant to the tender offer rules, the Sponsor, directors, officers, advisors or their affiliates may purchase shares or rights in privately negotiated transactions or in the open market either prior to or following the completion of the Business Combination. There is no limit on the number of securities such persons may purchase. Additionally, at any time at or prior to the Business Combination, subject to applicable securities laws (including with respect to material nonpublic information), our initial shareholders, directors, officers, advisors or their affiliates may enter into transactions with investors and others to provide them with incentives to acquire public shares, vote their public shares in favor of the Business Combination or not redeem their public shares. However, they are under no obligation to do so and they have no current commitments, plans or intentions to engage in such transactions and have not formulated any terms or conditions for any such transactions. None of the funds in the Trust Account will be used to purchase shares or rights in such transactions. They will be restricted from making any such purchases when they are in possession of any material non-public information not disclosed to the seller or if such purchases are prohibited by Regulation M under the Exchange Act. Such a purchase may include a contractual acknowledgement that such shareholder, although still the record holder of our shares is no longer the beneficial owner thereof and therefore agrees not to exercise its redemption rights.\nIn the event that the Sponsor, directors, officers, advisors or any of their affiliates purchase shares in privately negotiated transactions from public shareholders who have already elected to exercise their redemption rights or submitted a proxy to vote against the Business Combination, such selling shareholders would be required to revoke their prior elections to redeem their shares and any proxy to vote against the Business Combination. We do not currently anticipate that such purchases, if any, would constitute a tender offer subject to the tender offer rules under the Exchange Act or a going-private transaction subject to the going-private rules under the Exchange Act; however, if the purchasers determine at the time of any such purchases that the purchases are subject to such rules, the purchasers will be required to comply with such rules.\nThe purpose of such transaction could be to (i) vote in favor of the business combination and thereby increase the likelihood of obtaining shareholder approval of the Business Combination, (ii) reduce the number of public rights outstanding or vote such rights on any matters submitted to rightsholders for approval in connection with the Business Combination or (iii) satisfy a closing condition in an agreement with a target that requires us to have a minimum net worth or a certain amount of cash at the closing of the Business Combination, where it appears that such requirement would otherwise not be met. This may result in the completion of the Business Combination that may not otherwise have been possible.\nIn addition, if such purchases are made, the public float of our Ordinary Shares or public rights may be reduced and the number of beneficial holders of our securities may be reduced, which may make it difficult to maintain or obtain the quotation, listing or trading of our securities on a national securities exchange.\nThe Sponsor, the members of our management team and/or their affiliates anticipate that they may identify the shareholders with whom the Sponsor, the members of our management team or their affiliates may pursue privately negotiated transactions by either the shareholders contacting us directly or by our receipt of redemption requests submitted by shareholders following our mailing of tender offer or proxy materials in connection with the Business Combination. To the extent that the Sponsor, members of our management team, advisors or their affiliates enter into a private transaction, they would identify and contact only potential selling or\nredeeming shareholders who have expressed their election to redeem their shares for a pro rata share of the Trust Account or vote against the business combination. The price per share paid in any such transaction may be different than the amount per share a public shareholder would receive if it elected to redeem its shares in connection with the Business Combination. The Sponsor, members of our management team, advisors or their affiliates will be restricted from purchasing shares if such purchases do not comply with Regulation M under the Exchange Act and the other federal securities laws.\nAny purchases by the Sponsor, members of our management team and/or their affiliates who are affiliated purchasers under Rule 10b-18 under the Exchange Act will be restricted unless such purchases are made in compliance with Rule 10b-18, which is a safe harbor from liability for manipulation under Section 9(a)(2) and Rule 10b-5 of the Exchange Act. Rule 10b-18 has certain technical requirements that must be complied with in order for the safe harbor to be available to the purchaser. The Sponsor, members of our management team and/or their affiliates will be restricted from making purchases of Ordinary Shares if the purchases would violate Section 9(a)(2) or Rule 10b-5 of the Exchange Act.\nRedemption Rights for Public Shareholders upon Completion of our Initial Business Combination\nWe will provide our public shareholders with the opportunity to redeem all or a portion of their Ordinary Shares upon the completion of the Business Combination at a per-share price, payable in cash, equal to the aggregate amount then on deposit in the Trust Account, calculated as of two business days prior to the consummation of the Business Combination including interest earned on the funds held in the Trust Account and not previously released to us to pay our taxes, divided by the number of then issued and outstanding public shares, subject to the limitations described herein. The amount in the Trust Account is initially anticipated to be $10.20 per public share, plus any pro rata interest earned on the funds held in the Trust Account and not previously released to the Company to pay its tax obligations. The redemption rights will include the requirement that a beneficial holder must identify itself in order to validly redeem its shares. There will be no redemption rights upon completion of the Business Combination with respect to our rights. The Sponsor and members of our management team have entered into a letter agreement with us, pursuant to which they have agreed to waive their redemption rights with respect to any Founder Shares and public shares held by them in connection with the completion of the Business Combination. The holders of the representative shares have agreed to waive their redemption rights with respect to such shares in connection with the completion of the Business Combination.\nLimitation on Redemption upon Completion of our Initial Business Combination if we Seek Shareholder Approval\nNotwithstanding the foregoing redemption rights, if we seek shareholder approval of the Business Combination and we do not conduct redemptions in connection with the Business Combination pursuant to the tender offer rules, our amended and restated memorandum and articles of association provide that a public shareholder, together with any affiliate of such shareholder or any other person with whom such shareholder is acting in concert or as a group (as defined under Section 13 of the Exchange Act), will be restricted from redeeming its shares with respect to more than an aggregate of 15% of the shares sold in this offering, which we refer to as the Excess Shares, without our prior consent. We believe the restriction described above will discourage shareholders from accumulating large blocks of shares, and subsequent attempts by such holders to use their ability to redeem their shares as a means to force us or our management to purchase their shares at a significant premium to the then-current market price or on other undesirable terms. Absent this provision, a public shareholder holding more than an aggregate of 15% of the shares sold in this offering could threaten to exercise its redemption rights against a business combination if such holders shares are not purchased by us or our management at a premium to the then-current market price or on other undesirable terms. By limiting our public shareholders ability to redeem to no more than 15% of the shares sold in this offering, we believe we will limit the ability of a small group of shareholders to unreasonably attempt to block our ability to complete our business combination, particularly in connection with a business combination with a target that requires as a closing condition that we have a minimum net worth or a certain amount of cash. However, we would not be restricting our public shareholders ability to vote all of their shares (including Excess Shares) for or against our business combination.\nManner of Conducting Redemptions\nWe will provide our public shareholders with the opportunity to redeem all or a portion of their Ordinary Shares upon the completion of the Business Combination either (i) in connection with a general meeting called to approve the business combination or (ii) by means of a tender offer. The decision as to whether we will seek shareholder approval of a proposed business combination or conduct a tender offer will be made by us, solely in our discretion, and will be based on a variety of factors such as the timing of the transaction and whether the terms of the transaction would require us to seek shareholder approval under applicable law or stock\nexchange listing requirement. Under Nasdaq rules, asset acquisitions and share purchases would not typically require shareholder approval while direct mergers with our company where we do not survive and any transactions where we issue more than 20% of our issued and outstanding Ordinary Shares or seek to amend our amended and restated memorandum and articles of association would typically require shareholder approval. If we structure a business combination transaction with a target company in a manner that requires shareholder approval, we will not have discretion as to whether to seek a shareholder vote to approve the proposed business combination. We intend to conduct redemptions without a shareholder vote pursuant to the tender offer rules of the SEC unless shareholder approval is required by applicable law or stock exchange listing requirements or we choose to seek shareholder approval for business or other reasons. So long as we obtain, and maintain, a listing for our securities on Nasdaq, we will be required to comply with such rules.\nIf a shareholder vote is not required and we do not decide to hold a shareholder vote for business or other reasons, we will, pursuant to our amended and restated memorandum and articles of association:\n● conduct the redemptions pursuant to Rule 13e-4 and Regulation 14E of the Exchange Act, which regulate issuer tender offers; and\n● file tender offer documents with the SEC prior to completing the Business Combination which contain substantially the same financial and other information about the Business Combination and the redemption rights as is required under Regulation 14A of the Exchange Act, which regulates the solicitation of proxies.\nUpon the public announcement of our business combination, we and the Sponsor will terminate any plan established in accordance with Rule 10b5-1 to purchase Ordinary Shares in the open market if we elect to redeem our public shares through a tender offer, to comply with Rule 14e-5 under the Exchange Act.\nIn the event we conduct redemptions pursuant to the tender offer rules, our offer to redeem will remain open for at least 20 business days, in accordance with Rule 14e-1(a) under the Exchange Act, and we will not be permitted to complete the Business Combination until the expiration of the tender offer period. In addition, unless Mars Memorandum and Articles is amended, the tender offer will be conditioned on public shareholders not tendering more than a specified number of public shares which are not purchased by the Sponsor, which number will be based on the requirement that we may not redeem public shares in an amount that would cause our net tangible assets to be less than $5,000,001 upon consummation of the Business Combination (so that we do not then become subject to the SECs penny stock rules) or any greater net tangible asset or cash requirement which may be contained in the agreement relating to the Business Combination. If public shareholders tender more shares than we have offered to purchase, we will withdraw the tender offer and not complete the Business Combination.\nIf, however, shareholder approval of the transaction is required by applicable law or stock exchange listing requirement, or we decide to obtain shareholder approval for business or other reasons, we will, pursuant to our amended and restated memorandum and articles of association:\n● conduct the redemptions in conjunction with a proxy solicitation pursuant to Regulation 14A of the Exchange Act, which regulates the solicitation of proxies, and not pursuant to the tender offer rules; and\n● file proxy materials with the SEC.\nIn the event that we seek shareholder approval of the Business Combination, we will distribute proxy materials and, in connection therewith, provide our public shareholders with the redemption rights described above upon completion of the Business Combination.\nIf we seek shareholder approval, we will complete the Business Combination only if we receive affirmative votes of at least two-thirds (2/3) of the votes cast by the shareholders who, being entitled to do so, vote in person or by proxy at the shareholder meeting. A quorum for such meeting will consist of the holders present in person or by proxy of shares of outstanding capital stock of the company representing a majority of the voting power of all outstanding shares of capital stock of the company entitled to vote at such meeting. Our initial shareholders will count toward this quorum and pursuant to the letter agreement, the Sponsor, officers and directors have agreed to vote their Founder Shares and any public shares purchased during or after the IPO (including in open market and privately negotiated transactions) in favor of the Business Combination.\nAssuming a quorum is present at the shareholder meeting with 4,646,000 Ordinary Shares present, a two-thirds (2/3) majority of Ordinary Shares is required to approve the Business Combination, necessitating an affirmative vote of 3,097,333 Ordinary Shares to approve the Business Combination Agreement. Mars officers and directors, the Sponsor, and each transferee of Founder Shares have agreed to vote in favor of the Business Combination, collectively owning 2,116,000 Ordinary Shares, which represent approximately 23% of the currently outstanding Ordinary Shares. Therefore, an affirmative vote from an additional 981,333 holders of Ordinary Shares (equivalent to approximately 11% of the total outstanding Ordinary Shares), is required to approve the Business Combination.\nWe intend to give approximately 30 days (but not less than 10 days nor more than 60 days) prior written notice of any such meeting at which a vote shall be taken to approve the Business Combination. Each public shareholder may elect to redeem its public shares irrespective of whether they vote for or against the proposed transaction.\nUnless otherwise amended, the current Mars Memorandum and Articles of Association provide that in no event will we redeem our public shares in an amount that would cause our net tangible assets to be less than $5,000,001 upon consummation of the Business Combination (so that we do not then become subject to the SECs penny stock rules) or any greater net tangible asset or cash requirement which may be contained in the agreement relating to the Business Combination. For example, the proposed business combination may require: (i) cash consideration to be paid to the target or its owners; (ii) cash to be transferred to the target for working capital or other general corporate purposes; or (iii) the retention of cash to satisfy other conditions in accordance with the terms of the proposed business combination. In the event the aggregate cash consideration we would be required to pay for all Ordinary Shares that are validly submitted for redemption plus any amount required to satisfy cash conditions pursuant to the terms of the proposed business combination exceed the aggregate amount of cash available to us, we will not complete the business combination or redeem any shares, and all Ordinary Shares submitted for redemption will be returned to the holders thereof, and we instead may search for an alternative business combination.\nTendering Stock Certificates in Connection with a Tender Offer or Redemption Rights\nWe may require our public shareholders seeking to exercise their redemption rights, whether they are record holders or hold their shares in street name, to either tender their certificates to our transfer agent prior to the date set forth in the tender offer documents or proxy materials mailed to such holders, or up to two business days prior to the scheduled vote on the proposal to approve the business combination in the event we distribute proxy materials, or to deliver their shares to the transfer agent electronically using The Depository Trust Companys DWAC (Deposit/Withdrawal At Custodian) System, at the holders option. The tender offer or proxy materials, as applicable, that we will furnish to holders of our public shares in connection with the Business Combination will indicate whether we are requiring public shareholders to satisfy such delivery requirements, which will include the requirement that a beneficial holder must identify itself in order to validly redeem its shares. Accordingly, a public shareholder would have from the time we send out our tender offer materials until the close of the tender offer period, or up to two business days prior to the scheduled vote on the business combination if we distribute proxy materials, as applicable, to tender its shares if it wishes to seek to exercise its redemption rights. Given the relatively short exercise period, it is advisable for shareholders to use electronic delivery of their public shares.\nThere is a nominal cost associated with the above-referenced tendering process and the act of certificating the shares or delivering them through the DWAC System. The transfer agent will typically charge the tendering broker fee of approximately $80.00 and it would be up to the broker whether or not to pass this cost on to the redeeming holder. However, this fee would be incurred regardless of whether or not we require holders seeking to exercise redemption rights to tender their shares. The need to deliver shares is a requirement of exercising redemption rights regardless of the timing of when such delivery must be effectuated.\nThe foregoing is different from the procedures used by many blank check companies. In order to perfect redemption rights in connection with their business combinations, many blank check companies would distribute proxy materials for the shareholders vote on the Business Combination, and a holder could simply vote against a proposed business combination and check a box on the proxy card indicating such holder was seeking to exercise their redemption rights. After the business combination was approved, the company would contact such shareholder to arrange for them to deliver their certificate to verify ownership. As a result, the shareholder then had an option window after the completion of the business combination during which they could monitor the price of the companys shares in the market. If the price rose above the redemption price, they could sell their shares in the open market before actually delivering their shares to the company for cancellation. As a result, the redemption rights, to which shareholders were aware they needed to commit before the general meeting, would become option rights surviving past the completion of the business combination until the redeeming holder delivered its certificate. The requirement for physical or electronic delivery prior to the meeting ensures that a redeeming holders election to redeem is irrevocable once the business combination is approved.\nAny request to redeem such shares, once made, may be withdrawn at any time up to the date set forth in the tender offer materials or two business days prior to the scheduled date of the shareholder meeting set forth in our proxy materials, as applicable (unless we elect to allow additional withdrawal rights). Furthermore, if a holder of a public share delivered its certificate in connection with an election of redemption rights and subsequently decides prior to the applicable date not to elect to exercise such rights, such holder may simply request that the transfer agent return the certificate (physically or electronically). It is anticipated that the funds to be distributed to holders of our public shares electing to redeem their shares will be distributed promptly after the completion of the Business Combination.\nIf the Business Combination is not approved or completed for any reason, then our public shareholders who elected to exercise their redemption rights would not be entitled to redeem their shares for the applicable pro rata share of the Trust Account. In such case, we will promptly return any certificates delivered by public holders who elected to redeem their shares.\nIf the Business Combination is not completed, we may continue to try to complete a business combination with a different target before the February 16, 2024, or if we extend the period, by August 16, 2024.\nRedemption of Public Shares and Liquidation if no Initial Business Combination\nMars Memorandum and Articles of Association provide that we will have only 12 months from the consummation of the IPO (or 18 months as described elsewhere herein) to consummate an initial business combination. If we have not completed an initial business combination within 12 months from the consummation of this offering (or 18 months as described elsewhere herein), we will: (i) cease all operations except for the purpose of winding up; (ii) as promptly as reasonably possible but not more than ten business days thereafter, redeem the public shares, at a per-share price, payable in cash, equal to the aggregate amount then on deposit in the Trust Account, including interest earned on the funds held in the Trust Account and not previously released to us to pay our income taxes, if any (less up to $50,000 of interest to pay dissolution expenses), divided by the number of the then issued and outstanding public shares, which redemption will completely extinguish public shareholders rights as shareholders (including the right to receive further liquidation distributions, if any); and (iii) as promptly as reasonably possible following such redemption, subject to the approval of our remaining shareholders and our board of directors, liquidate and dissolve, subject in each case, to our obligations under Cayman Islands law to provide for claims of creditors and the requirements of other applicable law. There will be no redemption rights or liquidating distributions with respect to our rights, which will expire worthless if we fail to consummate an initial business combination within 12 months from the consummation of this offering (or 18 months as described elsewhere herein). Mars Memorandum and Articles of Association provides that, if we wind up for any other reason prior to the consummation of a business combination, we will follow the foregoing procedures with respect to the liquidation of the Trust Account as promptly as reasonably possible but not more than ten business days thereafter, subject to applicable Cayman Islands law.\nThe Sponsor and members of our management team have entered into a letter agreement with us, pursuant to which they have waived their rights to liquidating distributions from the Trust Account with respect to any Founder Shares held by them if we fail to complete a business combination within the Combination Period. However, if the Sponsor, directors or officers acquire Public Shares in or after this offering, they will be entitled to liquidating distributions from the Trust Account with respect to such Public Shares if we fail to complete a business combination within the Combination Period.\nThe Sponsor and members of our management team have agreed, pursuant to a written agreement with us, that they will not propose any amendment to Mars Memorandum and Articles of Association (i) to modify the substance or timing of our obligation to allow redemption in connection with the Business Combination or to redeem 100% of our public shares if we do not complete the Business Combination within the Combination Period, or (ii) with respect to any other provision relating to shareholders rights or pre-initial business combination activity, unless we provide our public shareholders with the opportunity to redeem their Ordinary Shares upon approval of any such amendment at a per-share price, payable in cash, equal to the aggregate amount then on deposit in the Trust Account, including interest earned on the funds held in the Trust Account and not previously released to us to pay our taxes, if any, divided by the number of then issued and outstanding public shares. However, unless otherwise amended, based on the current Mars Memorandum and Articles of Association, we may not redeem our public shares in an amount that would cause our net tangible assets to be less than $5,000,001 upon consummation of the Business Combination (so that we do not then become subject to the SECs penny stock rules) or any greater net tangible asset or cash requirement which may be contained in the agreement relating to the Business Combination. If this optional redemption right is exercised with respect to an excessive number of public shares, such that we cannot satisfy the net tangible asset requirement (described above), we would not proceed with the amendment or the related redemption of our public shares at such time.\nWe expect that all costs and expenses associated with implementing our plan of dissolution, as well as payments to any creditors, will be funded from amounts remaining out of the approximately $500,000 of proceeds held outside the Trust Account, although we cannot assure you that there will be sufficient funds for such purpose. However, if those funds are not sufficient to cover the costs and expenses associated with implementing our plan of dissolution, to the extent that there is any accrued interest in the Trust Account not required to pay our taxes as described herein, we may request the trustee to release to us an additional amount of up to $50,000 of such accrued interest to pay those costs and expenses.\nIf we were to expend all of the net proceeds of this offering and the sale of the Private Placement Units, other than the proceeds deposited in the Trust Account, and without taking into account interest, if any, earned on the Trust Account, the per-share redemption amount received by shareholders upon our dissolution would be approximately $10.20. The proceeds deposited in the Trust Account could, however, become subject to the claims of our creditors which would have higher priority than the claims of our public shareholders. We cannot assure you that the actual per-share redemption amount received by shareholders will not be substantially less than $10.20. While we intend to pay such amounts, if any, we cannot assure you that we will have funds sufficient to pay or provide for all creditors claims.\nAlthough we will seek to have all vendors, service providers (other than our independent auditors), prospective target businesses and other entities with which we do business execute agreements with us waiving any right, title, interest and claim of any kind in or to any monies held in the Trust Account for the benefit of our public shareholders, there is no guarantee that they will execute such agreements or even if they execute such agreements that they would be prevented from bringing claims against the Trust Account including but not limited to fraudulent inducement, breach of fiduciary responsibility or other similar claims, as well as claims challenging the enforceability of the waiver, in each case in order to gain an advantage with respect to a claim against our assets, including the funds held in the Trust Account. If any third party refuses to execute an agreement waiving such claims to the monies held in the Trust Account, our management will perform an analysis of the alternatives available to it and will only enter into an agreement with a third party that has not executed a waiver if management believes that such third partys engagement would be significantly more beneficial to us than any alternative. Examples of possible instances where we may engage a third party that refuses to execute a waiver include the engagement of a third-party consultant whose particular expertise or skills are believed by management to be significantly superior to those of other consultants that would agree to execute a waiver or in cases where management is unable to find a service provider willing to execute a waiver.\nIn addition, there is no guarantee that such entities will agree to waive any claims they may have in the future as a result of, or arising out of, any negotiations, contracts or agreements with us and will not seek recourse against the Trust Account for any reason. Our Sponsor has agreed that it will be liable to us if and to the extent any claims by a third party for services rendered or products sold to us, or by a prospective target business with which we have discussed entering into a transaction agreement, reduce the amount of funds in the Trust Account to below (i) $10.20 per public share or (ii) such lesser amount per public share held in the Trust Account as of the date of the liquidation of the Trust Account due to reductions in the value of the trust assets, in each case net of the amount of interest which may be withdrawn to pay taxes. This liability will not apply with respect to any claims by a third party who executed a waiver of any and all rights to seek access to the Trust Account nor will it apply to any claims under our indemnity of the underwriters of this offering against certain liabilities, including liabilities under the Securities Act. Moreover, in the event that an executed waiver is deemed to be unenforceable against a third party, then the Sponsor will not be responsible to the extent of any liability for such third party claims. We have not asked the Sponsor to reserve for such indemnification obligations, nor have we independently verified whether the Sponsor has sufficient funds to satisfy its indemnity obligations and believe that the Sponsors only assets are securities of our company. Therefore, we cannot assure you that the Sponsor would be able to satisfy those obligations. As a result, if any such claims were successfully made against the Trust Account, the funds available for the Business Combination and redemptions could be reduced to less than $10.20 per public share. In such event, we may not be able to complete the Business Combination, and you would receive such lesser amount per share in connection with any redemption of your public shares. None of our officers will indemnify us for claims by third parties including, without limitation, claims by vendors and prospective target businesses.\nIn the event that the proceeds in the Trust Account are reduced below (i) $10.20 per public share or (ii) such lesser amount per public share held in the Trust Account as of the date of the liquidation of the Trust Account due to reductions in the value of the trust assets, in each case net of the amount of interest which may be withdrawn to pay taxes, and the Sponsor asserts that it is unable to satisfy its indemnification obligations or that it has no indemnification obligations related to a particular claim, our independent directors would determine whether to take legal action against the Sponsor to enforce its indemnification obligations. While we currently expect that our independent directors would take legal action on our behalf against the Sponsor to enforce its indemnification obligations to us, it is possible that our independent directors in exercising their business judgment and subject to their fiduciary duties under Cayman Islands\nlaw may choose not to do so in any particular instance if, for example, the cost of such legal action is deemed by the independent directors to be too high relative to the amount recoverable or if the independent directors determine that a favorable outcome is not likely. If our independent directors choose not to enforce these indemnification obligations, the amount of funds in the Trust Account available for distribution to our public shareholders may be reduced below $10.20 per share.\nWe will seek to reduce the possibility that the Sponsor will have to indemnify the Trust Account due to claims of creditors by endeavoring to have all vendors, service providers (other than our independent auditors), prospective target businesses and other entities with which we do business execute agreements with us waiving any right, title, interest or claim of any kind in or to monies held in the Trust Account. Our sponsor will also not be liable as to any claims under our indemnity of the underwriters of this offering against certain liabilities, including liabilities under the Securities Act. We will have access to up to approximately $500,000 of proceeds held outside the Trust Account with which to pay any such potential claims. In the event that we liquidate and it is subsequently determined that the reserve for claims and liabilities is insufficient, shareholders who received funds from our Trust Account could be liable for claims made by creditors.\nIf we file a bankruptcy or winding-up petition or an involuntary bankruptcy or winding-up petition is filed against us that is not dismissed, the proceeds held in the Trust Account could be subject to applicable bankruptcy, insolvency or winding-up law, and may be included in our bankruptcy estate and subject to the claims of third parties with priority over the claims of our shareholders. To the extent any bankruptcy claims deplete the Trust Account, we cannot assure you we will be able to return $10.20 per share to our public shareholders. Additionally, if we file a bankruptcy or winding-up petition or an involuntary bankruptcy or winding-up petition is filed against us that is not dismissed, any distributions received by shareholders could be viewed under applicable debtor/creditor and/or bankruptcy, insolvency or winding-up laws as either a preferential transfer or a fraudulent conveyance. As a result, a bankruptcy court could seek to recover some or all amounts received by our shareholders. Furthermore, our board of directors may be viewed as having breached its fiduciary duty to our creditors and/or may have acted in bad faith, thereby exposing itself and our company to claims of punitive damages, by paying public shareholders from the Trust Account prior to addressing the claims of creditors. We cannot assure you that claims will not be brought against us for these reasons.\nOur public shareholders will be entitled to receive funds from the Trust Account only upon the earliest to occur of: (i) the completion of the Business Combination; (ii) the redemption of any public shares properly tendered in connection with a shareholder vote to amend our amended and restated memorandum and articles of association (A) to modify the substance or timing of our obligation to allow redemption in connection with the Business Combination or to redeem 100% of our public shares if we do not complete the Business Combination within the Combination Period, or (B) with respect to any other provision relating to shareholders rights or pre-initial business combination activity; and (iii) the redemption of all of our public shares if we have not completed our business combination within the Combination Period, subject to applicable law. In no other circumstances will a shareholder have any right or interest of any kind to or in the Trust Account. In the event we seek shareholder approval in connection with the Business Combination, a shareholders voting in connection with the Business Combination alone will not result in a shareholders redeeming its shares to us for an applicable pro rata share of the Trust Account. Such shareholder must have also exercised its redemption rights as described above. These provisions of our amended and restated memorandum and articles of association, like all provisions of our amended and restated memorandum and articles of association, may be amended by a special resolution passed by holders of at least two-thirds of our shareholders who, being entitled to do so, attend and vote at a general meeting for which notice specifying the intention to propose the resolution as a special resolution has been given, or by a unanimous written resolution of all of our shareholders.\nComparison of redemption or purchase prices in connection with the Business Combination and if we fail to complete the Business Combination.\nThe following table compares the redemptions and other permitted purchases of Public Shares that may take place in connection with the completion of the Business Combination and if we are unable to complete the Business Combination within the Combination Period.\nRedemptions in\nConnection with our\nInitial Business\nCombination\nOther Permitted\nPurchases of Public\nShares by our Affiliates\nRedemptions if we fail\nto\nComplete an Initial\nBusiness Combination\nCalculation of redemption price\nRedemptions at the time of the Business Combination may be made pursuant to a tender offer or in connection with a shareholder vote. The redemption price will be the same whether we conduct redemptions pursuant to a tender offer or in connection with a shareholder vote. In either case, our public shareholders may redeem their public shares for cash equal to the aggregate amount then on deposit in the Trust Account as of two business days prior to the consummation of the initial business combination (which is initially anticipated to be $10.20 per share), including interest (which interest shall be net of taxes payable) divided by the number of then outstanding public shares, subject to the limitation that no redemptions will take place if all of the redemptions would cause our net tangible assets to be less than $5,000,001 upon consummation of the Business Combination and any limitations (including but not limited to cash requirements) agreed to in connection with the negotiation of terms of a proposed business combination.\nIf we seek shareholder approval of the Business Combination, the Sponsor, directors, officers, advisors or their affiliates may purchase shares in privately negotiated transactions or in the open market either prior to or following completion of the Business Combination. Such purchases will only be made to the extent such purchases are able to be made in compliance with Rule 10b-18, which is a safe harbor from liability for manipulation under Section 9(a)(2) and Rule 10b-5 of the Exchange Act. None of the funds in the Trust Account will be used to purchase shares in such transactions.\nIf we are unable to complete the Business Combination within the Combination Period, we will redeem all public shares at a per-share price, payable in cash, equal to the aggregate amount then on deposit in the Trust Account (which is initially anticipated to be $10.20 per share), including interest (less up to $50,000 of interest to pay dissolution expenses, which interest shall be net of taxes payable) divided by the number of then outstanding public shares.\nImpact to remaining shareholders\nThe redemptions in connection with the Business Combination will reduce the book value per share for our remaining shareholders, who will bear the burden of interest withdrawn in order to pay taxes (to the extent not paid from amounts accrued as interest on the funds held in the Trust Account).\nIf the permitted purchases described above are made, there will be no impact to our remaining shareholders because the purchase price would not be paid by us.\nThe redemption of our public shares if we fail to complete the Business Combination will reduce the book value per share for the shares held by the Sponsor, who will be our only remaining shareholder after such redemptions.\nCompetition\nIf we succeed in effecting the Business Combination with ScanTech, there will be, in all likelihood, intense competition from competitors who are also engaged in the business of developing and manufacturing baggage and cargo logistics screening technologies. We cannot assure you that, subsequent to the Business Combination, we will have the resources or ability to compete effectively.\nCorporate Information\nOur principal executive office is located at Americas Tower, 1177 Avenue of The Americas, Suite 5100, New York, NY, 10036.\nEmployees\nWe have three executive officers, with the CEO and CFO roles being held by the same individual, while another holds the position of COO. These individuals are not obligated to devote any specific number of hours to our matters and intend to devote only as much time as they deem necessary to our affairs. The amount of time they will devote in any time period have been varied and will continue to vary based on the stage of the business combination process. The management has spent a significant amount of time investigating ScanTech, negotiating, and processing the Business Combination, subsequently dedicating more time to our affairs than they would have prior to identifying a suitable target business. We presently expect our executive officers to devote such amount of time as they reasonably believe is necessary to our business. We do not intend to have any full-time employees prior to the consummation of the Business Combination.\nReports to Security Holders\nWe have reporting obligations, including the requirement that we file annual, quarterly and current reports with the SEC. The SEC maintains an internet site that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC, located at http://sec.gov. In accordance with the requirements of the Exchange Act, our annual reports contain financial statements audited and reported on by our independent registered public accountants.\nWe are an emerging growth company, as defined in Section 2(a) of the Securities Act of 1933, as amended (the Securities Act), as modified by the Jumpstart Our Business Startups Act of 2012, or the JOBS Act. As such, we are eligible to take advantage of certain exemptions from various reporting requirements that are applicable to other public companies that are not emerging growth companies including, but not limited to, not being required to comply with the auditor attestation requirements of Section 404 of the Sarbanes-Oxley Act of 2002, or the Sarbanes-Oxley Act, reduced disclosure obligations regarding executive compensation in our periodic reports and proxy statements, and exemptions from the requirements of holding a non-binding advisory vote on executive compensation and stockholder approval of any golden parachute payments not previously approved. If some investors find our securities less attractive as a result, there may be a less active trading market for our securities and the prices of our securities may be more volatile.\nIn addition, Section 107 of the JOBS Act also provides that an emerging growth company can take advantage of the extended transition period provided in Section 7(a)(2)(B) of the Securities Act for complying with new or revised accounting standards. In other words, an emerging growth company can delay the adoption of certain accounting standards until those standards would otherwise apply to private companies. We intend to take advantage of the benefits of this extended transition period.\nWe will remain an emerging growth company until the earlier of: (1) the last day of the fiscal year: (a) following the fifth anniversary of the completion of our IPO; (b) in which we have total annual gross revenue of at least $1.07 billion; or (c) in which we are deemed to be a large accelerated filer, which means the market value of our Class A common stock that is held by non-affiliates exceeds $700 million as of the prior June 30; and (2) the date on which we have issued more than $1.0 billion in non-convertible debt securities during the prior three-year period. References herein to emerging growth company will have the meaning associated with it in the JOBS Act.\nAdditionally, we are a smaller reporting company as defined in Rule 10(f)(1) of Regulation S-K. Smaller reporting companies may take advantage of certain reduced disclosure obligations, including, among other things, providing only two years of audited financial statements. We will remain a smaller reporting company until the last day of the fiscal year in which: (1) the market value of our common stock held by non-affiliates equals or exceeds $250 million as of the end of the prior June 30th; or (2) our annual revenues\nequaled or exceeded $100 million during such completed fiscal year and the market value of our common stock held by non-affiliates equals or exceeds $700 million as of the prior June 30th. Item 1A. Risks Factors.\nAs a smaller reporting company, we are not required to provide the information otherwise required under this item. Item 1B. Unresolved Staff Comments.\nNone.\nItem 1C. Cybersecurity.\nNone. Item 2. Properties.\nWe currently maintain our executive offices at Americas Tower, 1177 Avenue of The Americas, Suite 5100, New York, NY 10036. We consider our current office space adequate for our current operations. We initially had an informal agreement to pay affiliates of the Sponsor for office space, utilities, secretarial, and administrative support; however, the affiliates have chosen not to seek compensation for such support. Item 3. Legal Proceedings.\nWe may be subject to legal proceedings, investigations and claims incidental to the conduct of our business from time to time. We are not currently a party to any material litigation or other legal proceedings brought against us. We are also not aware of any legal proceeding, investigation or claim, or other legal exposure that has a more than remote possibility of having a material adverse effect on our business, financial condition or results of operations. Item 4.Mine Safety Disclosures.\nNot Applicable.\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities.\n(a)Market Information.\nThe Units, Ordinary Shares and Rights are traded on Nasdaq under the symbols MARXU, MARX and MARXR, respectively. The Units, Ordinary Shares and Rights commenced public trading on February 16, 2023. Each Unit consists of one Ordinary Share and one Right to receive two-tenths (2/10) of one Ordinary Share upon consummation of Business Combination and no Mars securities will trade following the Closing.\n(b)Holders.\nOn September 30, 2023, there were outstanding 9,292,000 Ordinary Shares and there were 2 holders of record of Units, 9 holders of record of Ordinary Shares and 1 holders of record of Rights. The number of holders of record does not include a substantially greater number of street name holders or beneficial holders whose Units, Ordinary Shares, and Rights are held of record by banks, brokers and other financial institutions.\n(c)Dividends\nWe have not paid any cash dividends on our common stock to date and do not intend to pay cash dividends prior to the completion of the Business Combination. The payment of cash dividends in the future will be dependent upon our revenues and earnings, if any, capital requirements and general financial condition subsequent to completion of the Business Combination. Further, if we incur any indebtedness in connection with the Business Combination, our ability to declare dividends may be limited by restrictive covenants we may agree to in connection therewith.\n(d)Securities Authorized for Issuance Under Equity Compensation Plans.\nNone.\n(e)Performance Graph.\nNot applicable.\n(f)Recent Sales of Unregistered Securities; Use of Proceeds from Registered Offerings.\nOn February 16, 2023, Mars Acquisition Corp. consummated its IPO of 6,900,000 Units, including 900,000 additional Units issued pursuant to the exercise by the underwriter of its over-allotment option in full. Each Unit consists of one ordinary share, par value $0.000125 per share, of Mars and one Right to receive two-tenths (2/10) of one Ordinary Share upon the consummation of the Business Combination. The Units were sold at an offering price of $10.00 per Unit, generating total gross proceeds of $69,000,000.\nSimultaneously with the consummation of the IPO and the sale of the Units, Mars consummated the Private Placement of 391,000 Units, each Private Placement Unit consisting of one Ordinary Share and one Right, to the Sponsor at a price of $10.00 per Placement Unit, generating total proceeds of $3,910,000. The Private Placement Units (and the underlying securities) are identical to the Units sold in the IPO, except as otherwise disclosed in the Registration Statement. No underwriting discounts or commissions were paid with respect to such sale. The issuance of the Private Placement Units was made pursuant to the exemption from registration contained in Section 4(a)(2) of the Securities Act of 1933, as amended.\nAs of February 16, 2023, offering costs amounted to $4,398,891 consisting of $1,430,000 of cash underwriting fees, non-cash underwriting fees of $2,724,927 represented by the fair value of 276,000 representative shares issued to the underwriter, and $243,964 of other offering costs.\n(g)\nPurchases of Equity Securities by the Issuer and Affiliated Purchasers\nNone. Item 6. [Reserved].\nNot Applicable. Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations.\nReferences to the Company, us, our or we refer to Mars Acquisition Corp. The following discussion and analysis of our financial condition and results of operations should be read in conjunction with our financial statements and related notes included herein.\nCautionary Note Regarding Forward-Looking Statements\nAll statements other than statements of historical fact included in this Annual Report including, without limitation, statements under this Managements Discussion and Analysis of Financial Condition and Results of Operations regarding Mars financial position, business strategy and the plans and objectives of management for future operations, are forward- looking statements. When used in this Report, words such as anticipate, believe, estimate, expect, intend and similar expressions, as they relate to us or Mars\nmanagement, identify forward-looking statements. Such forward-looking statements are based on the beliefs of management, as well as assumptions made by, and information currently available to, Mars management. Actual results could differ materially from those contemplated by the forward- looking statements as a result of certain factors detailed in our filings with the SEC. All subsequent written or oral forward-looking statements attributable to us or persons acting on Marss behalf are qualified in their entirety by this paragraph.\nThe following discussion and analysis of our financial condition and results of operations should be read in conjunction with the financial statements and the notes thereto contained elsewhere in this Annual Report. Certain information contained in the discussion and analysis set forth below includes forward-looking statements that involve risks and uncertainties.\nOverview\nWe are a blank check company incorporated in the Cayman Islands on April 23, 2021 for the purpose of effecting a merger, capital stock exchange, asset acquisition, stock purchase, reorganization or similar business combination with one or more businesses.\nResults of Operations and Known Trends or Future Events\nWe have neither engaged in any operations nor generated any revenues to date. Our only activities since inception have been organizational activities and those necessary to prepare for the IPO, and activities related to identifying ScanTech as the target for the Business Combination. Since our IPO, we have not generated any operating revenues and do not intend to until after completion of the Business Combination, except for the non-operating income in the form of interest income on cash and cash equivalents held in the Trust Account.\nWe incurred expenses as a result of being a public company (for legal, financial reporting, accounting and auditing compliance), as well as expenses as we conducted due diligence on prospective business combination candidates, including ScanTech.\nWe expect to incur additional costs in the pursuit of the Business Combination. We cannot assure you that our plans to raise capital or to complete the Business Combination will be successful.\nLiquidity, Capital Resources Going Concern\nOur Registration Statement for the IPO was declared effective on February 13, 2023. On February 16, 2023, we consummated the IPO of 6,900,000 Units, including 900,000 additional Units issued pursuant to the full exercise by the underwriter of its over-allotment option, generating gross proceeds of $69,000,000.\nSimultaneously with the consummation of the IPO and the sale of the Units, Mars consummated the Private Placement of 391,000 Units, each Private Placement Unit consisting of one Ordinary Share and one Right, to our Sponsor, Mars Capital Holding Corporation, a British Virgin Islands business company with limited liability, at a price of $10.00 per Private Placement Unit, generating total proceeds of $3,910,000.\nFollowing the closing of the IPO on February 16, 2023, an amount of $70,380,000 ($10.20 per Unit) from the net proceeds of the sale of the Units in the IPO and the Private Placement was placed in the Trust Account. The funds held in the Trust Account may be invested in U.S. government securities, within the meaning set forth in Section 2(a)(16) of the Investment Company Act of 1940, as amended (the Investment Company Act), with a maturity of 185 days or less or in any open-ended investment company that holds itself out as a money market fund selected by us meeting the conditions of Rule 2a-7 of the Investment Company Act, as determined by the us, until the earlier of: (i) the completion of a Business Combination or (ii) the distribution of the Trust Account.\nWe intend to use substantially all of the funds held in the Trust Account, including any amounts representing interest earned on the Trust Account, to complete the Business Combination. To the extent that our capital stock or debt is used, in whole or in part, as consideration to complete the Business Combination, the remaining proceeds held in the Trust Account will be used as working capital to finance the operations of ScanTech, make other acquisitions and pursue our growth strategies.\nThe funds held outside the Trust Account have been used primarily used for legal, accounting, due diligence, travel and other expenses associated with structuring, negotiating and documenting the Business Combination, as well as legal and accounting fees related to regulatory reporting requirements. For the year ended September 30, 2023, we incurred expenses in the amount of $521,582.\nThe funds held outside of the Trust Account may not be sufficient to allow Mars to operate for at least the next 12 months from the issuance of the financial statements. We may need to raise additional capital through loans or additional investments from our Sponsor, an affiliate of our Sponsor, officers, directors, or third parties. In order to fund working capital deficiencies or finance transaction costs in connection with the Business Combination, our Sponsor or an affiliate of our Sponsor or certain of our officers and directors may, but are not obligated to, loan us funds on a non-interest bearing basis as may be required. If we complete the Business Combination, we would repay such loaned amounts. In the event that the Business Combination does not close, we may use a portion of the working capital held outside the Trust Account to repay such loaned amounts but no proceeds from our Trust Account would be used for such repayment. Other than as described above, the terms of such loans by our officers and directors, if any, have not been determined and no written agreements exist with respect to such loans. We do not expect to seek loans from parties other than our Sponsor or an affiliate of our Sponsor as we do not believe third parties will be willing to loan such funds and provide a waiver against any and all rights to seek access to funds in our Trust Account.\nIf we cannot complete the Business Combination by February 16, 2024, we will need to extend the period of time to consummate a business combination to August 16, 2024. We may need to obtain additional financing if we become obligated to redeem a significant number of our public shares upon the Extension or the completion of the Business Combination, in which case we may issue additional securities or incur debt in connection with the Extension or the Business Combination. If we are unable to complete the Extension or the Business Combination because we do not have sufficient funds available to us, we may be forced to cease operations and liquidate the Trust Account. In addition, following the Business Combination, if cash on hand is insufficient, we may need to obtain additional financing in order to meet our obligations.\nThere is no assurance that our plans to consummate the Business Combination will be successful within the Combination Period. As a result, there is substantial doubt about Mars ability to continue as a going concern within one year after the date that the financial statements are issued or are available to be issued.\nOff-Balance Sheet Financing Arrangements\nWe have no obligations, assets or liabilities, which would be considered off-balance sheet arrangements as of September 30, 2023. We do not participate in transactions that create relationships with unconsolidated entities or financial partnerships, often referred to as variable interest entities, which would have been established for the purpose of facilitating off-balance sheet arrangements. We have not entered into any off-balance sheet financing arrangements, established any special purpose entities, guaranteed any debt or commitments of other entities, or purchased any non-financial assets.\nContractual Obligations\nWe do not have any long-term debt obligations, capital lease obligations, operating lease obligations, purchase obligations or long-term liabilities.\nOur Sponsor, officers and directors, or any of their respective affiliates, will be reimbursed for any out-of-pocket expenses incurred in connection with activities on our behalf such as identifying potential target businesses and performing due diligence on suitable business combination targets. Our audit committee will review on a quarterly basis all payments that were made to our Sponsor, officers or directors or our or their affiliates and will determine which expenses and the amount of expenses that will be reimbursed. There is no cap or ceiling on the reimbursement of out-of-pocket expenses incurred by such persons in connection with activities on our behalf.\nIn addition, in order to finance transaction costs in connection with an intended business combination, our Sponsor or an affiliate of our Sponsor or certain of our officers and directors may, but are not obligated to, loan us funds as may be required. If we complete the Business Combination, we would repay such loaned amounts. In the event that the Business Combination does not close, we may use a portion of the working capital held outside the Trust Account to repay such loaned amounts, but no proceeds from our Trust Account would be used for such repayment. The terms of such loans by our officers and directors, if any, have not been determined and no written agreements exist with respect to such loans. We do not expect to seek loans from parties other than our Sponsor or an affiliate of our Sponsor as we do not believe third parties will be willing to loan such funds and provide a waiver against any and all rights to seek access to funds in our Trust Account.\nOur Sponsor has agreed (a) to waive its redemption rights with respect to any Founder Shares and Public Shares held by it in connection with the completion of a Business Combination and (b) not to propose an amendment to the Mars Memorandum and Articles of Association (i) to modify the substance or timing of Mars obligation to allow redemption in connection with the our initial Business Combination or to redeem 100% of the Public Shares if we do not complete a Business Combination within the Combination Period or (ii) with respect to any other provision relating to shareholders rights or pre-initial business combination activity, unless we provide the Public Shareholders with the opportunity to redeem their Public Shares upon approval of any such amendment at a per-share price, payable in cash, equal to the aggregate amount then on deposit in the Trust Account, including interest earned on the Trust account and not previously released to pay taxes, divided by the number of then issued and outstanding Public Shares.\nOur Sponsor has agreed to waive its rights to liquidating distributions from the Trust Account with respect to the Founder Shares it will receive if we fail to complete the Business Combination within the Combination Period. However, if the Sponsor or any of its respective affiliates acquire Public Shares, such Public Shares will be entitled to liquidating distributions from the Trust Account if we fail to complete the Business Combination within the Combination Period. In the event of such distribution, it is possible that the per share value of the assets remaining available for distribution will be less than the public offering price per Unit ($10.20).\nThe holders of the Founder Shares, Private Placement Units and Units that may be issued upon conversion of Working Capital Loans (and any shares of Ordinary Shares issuable upon the exercise of the Private Placement Right) will be entitled to registration rights pursuant to a registration rights agreement to signed prior to or on the effective date of the IPO requiring us to register such securities for resale. The holders of these securities will be entitled to make up to three demands, excluding short form registration demands, that we register such securities. In addition, the holders have certain piggy-back registration rights with respect to registration statements filed subsequent to completion of a business combination and rights to require us to register for resale such securities pursuant to Rule 415 under the Securities Act. However, the registration rights agreement provides that we will not be required to effect or permit any registration or cause any registration statement to become effective until the securities covered thereby are released from their lock-up restrictions. We will bear the expenses incurred in connection with the filing of any such registration statements.\nCritical Accounting Estimates\nThe preparation of financial statements and related disclosures in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, disclosure of contingent assets and liabilities at the date of the financial statements, and income and expenses during the periods reported. Actual results could materially differ from those estimates. We have identified the following critical accounting policies:\nRepresentative shares\nThe Company estimated the fair value of the representative shares issued as part of the Companys IPO. This estimate was derived by calculating a ratio of the individual share price to the overall unit price of other companies with similar equity structures. This ratio was applied to the Companys initial share price of $10.00 per unit. Any deviations or modifications to the fair value estimation process are disclosed in the financial statements to provide investors with insight into the potential impact on our financial condition and results of operations.\nOrdinary Shares Subject to Possible Redemption\nThe Company accounts for its Ordinary Shares subject to possible redemption in accordance with the guidance in ASC Topic 480 Distinguishing Liabilities from Equity. Conditionally redeemable Ordinary Shares (including Ordinary Shares that feature redemption rights that are either within the control of the holder or subject to redemption upon the occurrence of uncertain events not solely within Mars control) are classified as temporary equity. The Companys public shares feature certain redemption rights that are considered to be outside of Mars control and subject to occurrence of uncertain future events. Accordingly, as of September 30, 2023, Ordinary Shares subject to possible redemption are presented at redemption value of $10.52 per share as temporary equity, outside of the shareholders equity section of Mars balance sheet. The Company recognizes changes in redemption value immediately as they occur and adjusts the carrying value of redeemable Ordinary Shares to equal the redemption value at the end of each reporting period. Increases or decreases in the carrying amount of redeemable Ordinary Shares are affected by charges against additional paid in capital or accumulated deficit if additional paid in capital equals to zero. Item 7A. Quantitative and Qualitative Disclosures About Market Risk.\nAs a smaller reporting company, we are not required to provide the information otherwise required under this item. Item 8. Financial Statements and Supplementary Data.\nThis information appears following Item 16 of this Report and is incorporated herein by reference. Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure.\nNone. Item 9A. Controls and Procedures.\nDisclosure controls and procedures are controls and other procedures that are designed to ensure that information required to be disclosed in our reports filed or submitted under Securities Exchange Act of 1934, as amended is recorded, processed, summarized and reported within the time periods specified in the SECs rules and forms. Disclosure controls and procedures include, without limitation, controls and procedures designed to ensure that information required to be disclosed in our reports filed or submitted under the Exchange Act is accumulated and communicated to our management, including our Chief Executive Officer and Chief Financial Officer, to allow timely decisions regarding required disclosure.\nEvaluation of Disclosure Controls and Procedures\nAs required by Rules 13a-15 and 15d-15 under the Exchange Act, our Chief Executive Officer and Chief Financial Officer carried out an evaluation of the effectiveness of the design and operation of our disclosure controls and procedures as of September 30, 2023. Based upon their evaluation, our Chief Executive Officer and Chief Financial Officer concluded that our disclosure controls and procedures (as defined in Rules 13a-15 (e) and 15d-15 (e) under the Exchange Act) were effective as of such date.\nWe do not expect that our disclosure controls and procedures will prevent all errors and all instances of fraud. Disclosure controls and procedures, no matter how well conceived and operated, can provide only reasonable, not absolute, assurance that the objectives of the disclosure controls and procedures are met. Further, the design of disclosure controls and procedures must reflect the fact that there are resource constraints, and the benefits must be considered relative to their costs. Because of the inherent limitations in all disclosure controls and procedures, no evaluation of disclosure controls and procedures can provide absolute assurance that we have detected all our control deficiencies and instances of fraud, if any. The design of disclosure controls and procedures also is based partly on certain assumptions about the likelihood of future events, and there can be no assurance that any design will succeed in achieving its stated goals under all potential future conditions.\nManagements Report on Internal Control over Financial Reporting\nThis Annual Report does not include a report of managements assessment regarding internal control over financial reporting or an attestation report of the company's registered public accounting firm due to a transition period established by rules of the securities and exchange commission for newly public companies.\nChanges in Internal Control Over Financial Reporting\nDuring the most recently completed fiscal quarter, there has been no change in our internal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act) that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting. Item 9B. Other Information.\nNone.\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections.\nNot applicable.\nPART III Item 10. Directors, Executive Officers and Corporate Governance.\nDirectors and Executive Officers\nAs of September 30, 2023, Mars current directors and executive officers are as follows:\nName\nAge\nPosition\nKarl Brenza\nDirector, Chief Executive Officer and Chief Financial Officer\nXiaochen (Iris) Zhao\nDirector and Chief Operating Officer\nShanchun Huang\nChairman\nYenyou (Jeff) Zheng\nIndependent Director\nJames Jenkins\nIndependent Director\nYang (Sean) Liu\nIndependent Director\nXin (Adam) He\nIndependent Director\nKarl Brenza has served as our Chief Executive Officer, Chief Financial Officer and director since Mars inception. He is a citizen of the United States and is based in New York, New York. Mr. Brenza has over 25 years of investment banking and financial advisory experience as well as significant operational and technology experience as a corporate executive. He has extensive blank-check/SPAC experience and completed some of the earliest blank-check/SPAC transactions. During his career, Mr. Brenza has completed a vast array of transactions in the areas of strategic advisory assignments, mergers, acquisitions, reverse merger transactions, IPOs, follow-on offerings, SPACs, PIPEs, fairness opinions and private financings of debt and equity. Mr. Brenza is currently serving as Senior Managing Director, Head of Capital Growth Advisory Group at Maxim Group, LLC and CFO of Omni ECom Acquisition Corp. Previously, Mr. Brenza served as CFO of First Breach, Inc, an ammunition components company from November 2021 to September 2022. In addition, from August 2018 to November 2021, he was Senior Managing Director, Investment Banking for Paulson Investment Company. From August 2018 to December 2019, he also served as the Head of US Operations for Jerash Holdings US, a Nasdaq-listed manufacturer of outdoor and action garments and sportswear. From 2008 to 2018, Mr. Brenza was Senior Managing Director and Head of the Capital Growth Advisory Group at Maxim Group, LLC. Mr. Brenza received an MBA with honors from Columbia Business School, a BS in Electrical Engineering from the University of Pennsylvania and has been a guest lecturer at the NYU Stern Graduate School of Business.\nXiaochen (Iris) Zhao has served as our Chief Operating Officer since Mars inception. She is a citizen of the Republic of Malta and is based in London, the United Kingdom. Ms. Iris Zhao has 10 years of experience in building and advising corporations through M&A and capital market transactions globally. Ms. Zhao is responsible for managing and coordinating companys investment, liquidity and asset liability management in order to optimize investment performance within the risk management guidelines. At the same time, to monitor companys portfolio of assets, devise strategies for growth, act as the liaison with investors, and recognize and avoid serious risks. Ms. Zhao is proficient in road-shows presentation, structuring and negotiating transactions and terms with international investment commUnities and corporate finance. Ms. Zhao was appointed as the Chief Investment Officer of Future Fintech Group Inc. (NASDAQ stock ticker: FTFT) in February 2020. Prior to that, she served as the Managing Partner of Wealth Index (Beijing) Fund Management Co., Ltd., which is a top financial advisory service corporation that focuses on financial advisory, private equities investment and investment banking businesses. From January 2011 to February 2019, Ms. Zhao was in charge of international business planning and developing, and investor relationships. Ms. Zhao has completed dozens of transactions in a wide range of transactions including IPOs, M&A transactions, RTOs, follow-on offerings, public and private fund raising, and PIPEs. In her early career, Ms. Zhao worked at SUNTV Video Ltd. As a Specialist in NYC. She brings experience in media, business negotiation, and is familiar with international business activities. Ms. Zhao studied Finance at New York City University and Montana State University. She received Bachelor of Science with the highest honor in Finance from Montana State University and was appointed to Beta Gamma Sigma, international association of Elite Business Schools. She received MBA from UP Diliman. Ms. Zhao is the Dame of Grace of the Order of Saint Lazarus of Jerusalem, and the first Commander of the Grand Priory of China. Ms. Zhao is Shanchun Huangs wife.\nShanchun Huang has served as our Chairman since Mars inception. He is a citizen of the Republic of Malta and is based in London, the United Kingdom. Mr. Huang has over 20 years of experience in the financial services and investment industry. He has provided financing solutions and advice for high-growth companies in China and successfully assisted 37 enterprises to complete fundraising and public offerings globally. Mr. Huang has served as the CEO and director of Future Fintech Group, Inc. a Nasdaq-listed company and a blockchain based e-commerce platform since March 2020. Most recently, Mr. Huang served as the president of Wealth Index (Beijing) Fund Management Co., Ltd., which provides private equity fund management service, from March 2011 to March 2020 and president of Wealth Index (Beijing) International Investment Consulting Co., Ltd., which provides investment management and consulting services for non-securities related business, from August 2004 to March 2020. From May 2001 to June 2004, Mr. Huang was the vice president of Zhejiang Geely Holding Group Corporation, a global leading automobile company headquartered in Hangzhou, China. Mr. Huang graduated from Hefei Staff University of Science and Technology in July 1986 majoring in news collection and editing. Mr. Huang is also a prolific writer and has published four books in finance and investment sector in China, namely How to Raise Money to Start a Business, the Road to Red Chips, Comparison and Research Among Global Capital Markets, and The Practice of Small and Medium Enterprises Listed Overseas and Hong Kong. Mr. Huang is the Knight Commander of Grace of the Order of Saint Lazarus of Jerusalem, and the first Grand Prior of the Grand Priory of China. Mr. Huang is our COO Xiaochen Zhaos husband.\nYenyou (Jeff) Zheng has served as an independent director since Mars inception. He is a citizen of Canada and is based in Vancouver, Canada. Dr. Zheng has over 20 years of experience in investment banking and financing industry. Dr. Zheng currently serves as the Director of Business Development of, and as a broker with, Craft Capital Management LLC and has served in such positions since September 2019. He is also currently an independent director of NovaBay Pharmaceuticals, Inc. (NYSE American: NBY) since September 2019. Prior to that, Dr. Zheng served as the Director of Business Development of Spartan Securities Group, Ltd. From 2014 to August 2019. Dr. Zhengs experience includes providing innovative financial solutions and consulting services for initial public offering underwriting and investment banking as well as corporate financing solutions with a particular focus on Chinese companies listed overseas. Dr. Zheng received a Ph.D. in physics from Flinders University of South Australia.\nJames Jenkins has served as an independent director since Mars inception. He is a citizen of the United States and is based in Rochester, New York. Mr. Jenkins currently serves as Chairman of the board of Lakeland Industries, Inc. (Nasdaq: Lake) and serves on its Audit, Nominating and Compensation Committees. He previously served on the board of Lakeland Industries, Inc. from 2012 to 2015 and was a member of the Audit and Corporate Governance Committees. He also served between November 2021 and April 2023 on the Board, Audit and Compensation Committees of OmniLit Acquisition Corp. (Nasdaq: OLITU), a SPAC that recently raised $143.75 million. Mr. Jenkins is a General Counsel and Vice President of Corporate Development at Transcat, Inc. (Nasdaq: TRNS) and has served in that position since September 2020. At Transcat he drives its acquisition strategy. Prior to that he served as a partner at Harter Secrest & Emery LLP, a regional law firm located in New York State. His practice focused in the areas of corporate governance and general corporate law matters, including initial and secondary public offerings, Private Placements, mergers and acquisitions, and securities law compliance. Mr. Jenkins joined Harter Secrest and Emery in 1989 as an associate and was elected a partner effective January 1, 1997. He is a Chambers rated attorney and served as a member of the firms Management Committee from January 2007 to January 2013. Mr. Jenkins holds a BA from Virginia Military Institute and a J.D. from West Virginia University College of Law.\nYang (Sean) Liu has served as an independent director since Mars inception. He is a citizen of the United States and is based in New York, New York. Mr. Liu is a seasoned executive with 16 years of experience in an array of industries including technologies, finance, investment banking and corporation. He has a proven record of driving growth within global organizations and management of public companies. Mr. Liu served as the Chairman of the board and the Chief Executive Officer at Color Star Technology Co. Ltd (Nasdaq stock ticker: CSCW), a Nasdaq company, from March 2019 to July 2020. Through a series of acquisitions and dispositions, he successfully transformed the company from a traditional Chinese manufacturer into a global technology company in education and entertainment. He also served as the CEO and Chairman at Wave Sync Corporation, an OTC technology company from July 2017 to August 2018. From 2015 to 2017, Mr. Liu worked as an IT Manager at UBS, overseeing regional production support and implementation coordination of its core capital market software platform. Mr. Liu received two M.S. degrees in financial mathematics and electrical engineering from New Mexico State University in the United States. He also received a B.S. Degree in Electronic Engineering from Tsinghua University in China.\nXin (Adam) He has served as an independent director since Mars inception. He is a citizen of Peoples Republic of China, a US permanent resident and is based in Chicago, Illinois. Mr. He has been a CFO for a Fortune Global 500 conglomerate, Wanda USA since May 2012. Mr. He played a key role in two prominent international projects - the development of a 101-story landmark Vista Tower in downtown Chicago and the acquisition of AMC Entertainment Inc, that he later led its IPO to NYSE in 2013. His diverse background across various industries came from his previous jobs as Financial Controller for NYSE listed Xinyuan Real Estate Co.,\nauditor at Financial Service Office in Ernst & Young LLP in New York, and various leadership roles at Chinatex Corporation. Due to his exceptional public company management expertise, Mr. He was invited to serve as an independent board director at Energy Focus (Nasdaq: EFOI) from July 2014 to April 2015, iFresh Inc. (Nasdaq: IFMK) from December 2017 to April 2018, Professional Diversity Network (Nasdaq: IPDN) from January 2018 to March 2019, and Beijing Baosheng Media (Nasdaq: BAOS) from February 2021 to present. He is also deeply involved in a non-profit organization, as Vice Chair of the China General Chamber of Commerce Chicago, to bridge culture and business between US and China. His education and license strongly support this endeavor as he had obtained a Bachelor and Master of Science in Taxation from Central University of Finance and Economics in Beijing, and a Master of Science in Accounting from Seton Hall University in New Jersey. He is also a Certified Public Accountant both in China and in New York state.\nExecutive Officer and Director Compensation\nNo compensation of any kind, including finders, consulting or other similar fees, has been paid or will be paid to any of our existing shareholders, including our directors, or any of their respective affiliates, prior to, or for any services they render in order to effectuate, the consummation of the Business Combination. However, such individuals will be reimbursed for any out-of-pocket expenses incurred in connection with activities on our behalf such as identifying potential target businesses and performing due diligence on the Business Combination. There is no limit on the amount of these out-of-pocket expenses and there will be no review of the reasonableness of the expenses by anyone other than our board of directors and audit committee, which includes persons who may seek reimbursement, or a court of competent jurisdiction if such reimbursement is challenged.\nAfter the completion of the Business Combination, directors or members of our management team who remain with us may be paid consulting, management or other fees from the combined company. All these fees will be fully disclosed to shareholders, to the extent then known, in the tender offer materials or proxy solicitation materials furnished to our shareholders in connection with the Business Combination. It is unlikely the amount of such compensation will be known at the time, because the directors of the post-combination business will be responsible for determining executive officer and director compensation. Any compensation to be paid to our executive officers will be determined by a compensation committee constituted solely of independent directors.\nWe do not intend to take any action to ensure that members of our management team maintain their positions with us after the consummation of the Business Combination, although it is possible that some or all of our executive officers and directors may negotiate employment or consulting arrangements to remain with us after the Business Combination. The existence or terms of any such employment or consulting arrangements to retain their positions with us may influence our managements motivation in identifying or selecting a target business but we do not believe that the ability of our management to remain with us after the consummation of the Business Combination will be a determining factor in our decision to proceed with any potential business combination. We are not party to any agreements with our executive officers and directors that provide for benefits upon termination of employment.\nDirector Independence\nNasdaq requires that a majority of our board must be composed of independent directors. Currently, Yenyou (Jeff) Zheng, James Jenkins, Yang (Sean) Liu and Xin (Adam) He would each be considered an independent director under the Nasdaq listing rules, which is defined generally as a person other than an officer or employee of the company or its subsidiaries or any other individual having a relationship, which, in the opinion of the companys board of directors would interfere with the directors exercise of independent judgment in carrying out the responsibilities of a director. Our independent directors will have regularly scheduled meetings at which only independent directors are present.\nAny related-party transactions must also be approved by our audit committee and a majority of disinterested independent directors.\nThe Business Combination has been approved by a Special Committee comprised of Mars independent directors Messrs. Yenyou (Jeff) Zheng, James Jenkins, Yang (Sean) Liu and Xin (Adam) He. The Special Committee evaluated the Business\nCombination with ScanTech. The Special Committee also retained Network 1 Financial Securities, Inc. as its financial advisor and obtained a fairness opinion with respect to the valuation of ScanTech.\nAudit Committee\nUnder the Nasdaq listing standards and applicable SEC rules, we are required to have three members of the audit committee all of whom must be independent. We currently have an audit committee of the board of directors, which consists of Yenyou (Jeff) Zheng, James Jenkins and Xin (Adam) He, each of whom is an independent director under Nasdaqs listing standards. Xin (Adam) He is the Chairperson of the audit committee. The audit committees duties, which are specified in our Audit Committee Charter, include, but are not limited to:\n● reviewing and discussing with management and the independent auditor the annual audited financial statements, and recommending to the board whether the audited financial statements should be included in our Form 10-K;\n● discussing with management and the independent auditor significant financial reporting issues and judgments made in connection with the preparation of our financial statements;\n● discussing with management major risk assessment and risk management policies;\n● monitoring the independence of the independent auditor;\n● verifying the rotation of the lead (or coordinating) audit partner having primary responsibility for the audit and the audit partner responsible for reviewing the audit as required by law;\n● reviewing and approving all related-party transactions;\n● inquiring and discussing with management our compliance with applicable laws and regulations;\n● pre-approving all audit services and permitted non-audit services to be performed by our independent auditor, including the fees and terms of the services to be performed;\n● appointing or replacing the independent auditor;\n● determining the compensation and oversight of the work of the independent auditor (including resolution of disagreements between management and the independent auditor regarding financial reporting) for the purpose of preparing or issuing an audit report or related work;\n● establishing procedures for the receipt, retention and treatment of complaints received by us regarding accounting, internal accounting controls or reports which raise material issues regarding our financial statements or accounting policies; and\n● approving reimbursement of expenses incurred by our management team in identifying potential target businesses.\nFinancial Experts on Audit Committee\nThe audit committee will at all times be composed exclusively of independent directors who are financially literate as defined under Nasdaq listing standards. Nasdaq listing standards define financially literate as being able to read and understand fundamental financial statements, including a companys balance sheet, income statement and cash flow statement.\nIn addition, we must certify to Nasdaq that the committee has, and will continue to have, at least one member who has past employment experience in finance or accounting, requisite professional certification in accounting, or other comparable experience or background that results in the individuals financial sophistication. Xin (Adam) He is qualified as an audit committee financial expert, as defined under rules and regulations of the SEC.\nNominating Committee\nWe currently have a nominating committee of the board of directors, which consists of Yenyou (Jeff) Zheng, James Jenkins and Xin (Adam) He, each of whom is an independent director under Nasdaqs listing standards. Yenyou (Jeff) Zheng is the Chairperson of the nominating committee. The nominating committee is responsible for overseeing the selection of persons to be nominated to serve on our board of directors. The nominating committee considers persons identified by its members, management, shareholders, investment bankers and others.\nGuidelines for Selecting Director Nominees\nThe guidelines for selecting nominees, which are specified in the Nominating Committee Charter, generally provide that persons to be nominated:\n● should have demonstrated notable or significant achievements in business, education or public service;\n● should possess the requisite intelligence, education and experience to make a significant contribution to the board of directors and bring a range of skills, diverse perspectives and backgrounds to its deliberations; and\n● should have the highest ethical standards, a strong sense of professionalism and intense dedication to serving the interests of the shareholders.\nThe nominating committee will consider a number of qualifications relating to management and leadership experience, background and integrity and professionalism in evaluating a persons candidacy for membership on the board of directors. The nominating committee may require certain skills or attributes, such as financial or accounting experience, to meet specific board needs that arise from time to time and will also consider the overall experience and makeup of its members to obtain a broad and diverse mix of board members. The board of directors will also consider director candidates recommended for nomination by our shareholders during such times as they are seeking proposed nominees to stand for election at the next annual meeting of shareholders (or, if applicable, a special meeting of shareholders). Our shareholders that wish to nominate a director for election to the Board should follow the procedures set forth in our memorandum and articles of association. The nominating committee does not distinguish among nominees recommended by shareholders and other persons.\nCompensation Committee\nWe currently have a compensation committee of the board of directors, which consists of Yenyou (Jeff) Zheng, James Jenkins and Xin He, each of whom is an independent director under Nasdaqs listing standards. James Jenkins is the Chairperson of the compensation committee. The compensation committees duties, which are specified in our Compensation Committee Charter, include, but are not limited to:\n● reviewing and approving on an annual basis the corporate goals and objectives relevant to our Chief Executive Officers compensation, evaluating our Chief Executive Officers performance in light of such goals and objectives and determining and approving the remuneration (if any) of our Chief Executive Officers based on such evaluation;\n● reviewing and approving the compensation of all of our other executive officers;\n● reviewing our executive compensation policies and plans;\n● implementing and administering our incentive compensation equity-based remuneration plans;\n● assisting management in complying with our proxy statement and annual report disclosure requirements;\n● approving all special perquisites, special cash payments and other special compensation and benefit arrangements for our executive officers and employees;\n● if required, producing a report on executive compensation to be included in our annual proxy statement; and\n● reviewing, evaluating and recommending changes, if appropriate, to the remuneration for directors.\nAs of September 30, 2023, no compensation of any kind, including finders, consulting or other similar fees, has beeen paid to any of our existing shareholders, including our directors or any of their respective affiliates, prior to, or for any services they render in order to effectuate, the consummation of the Business Combination. Accordingly, it is likely that prior to the consummation of the Business Combination, the compensation committee will only be responsible for the review and recommendation of any compensation arrangements to be entered into in connection with the Business Combination.\nCode of Ethics\nWe have adopted a code of business conduct and ethics (the Code of Ethics) applicable to our directors, officers and employees. A copy of the Code of Ethics will be provided without charge upon request from us. If we decide to issue amendments to or waivers of certain provisions of our Code of Ethics, such amendment or waiver will be disclosed in a Current Report on Form 8-K.\nConflicts of Interest\nPotential investors should be aware of the following potential conflicts of interest:\n● None of our officers or directors is required to commit his or her full time to our affairs and, accordingly, may have conflicts of interest in allocating his or her time among various business activities.\n● In the course of their other business activities, our officers and directors may become aware of investment and business opportunities which may be appropriate for presentation to us as well as the other entities with which they are affiliated. Our management may have conflicts of interest in determining to which entity a particular business opportunity should be presented.\n● Mars will have until February 16, 2024 to consummate the Business Combination. However, if Mars anticipates that it may not be able to consummate the Business Combination within 12 months, Mars will, by resolution of Mars Board if requested by Sponsor, extend the period of time to consummate a business combination by an additional three months up to two times (for a total of 18 months to complete a business combination), subject to the Sponsor depositing additional funds into the Trust Account. Pursuant to Mars Memorandum and Articles and the trust agreement between Mars and Continental in connection with the IPO, in order to extend the time available for Mars to consummate the Business Combination by up to three months, the Sponsor or its affiliates or designees must deposit into the Trust Account $690,000 ($0.10 per share) on or prior to the date of the deadline. Mars may extend the time available for it to consummate the Business Combination for an additional three months twice, and each extension will require such an additional deposit into the Trust Account for an aggregate of $1,380,000.\n● The Sponsor or its affiliates or designees will receive non-interest bearing, unsecured promissory notes equal to the amount of any deposit into the Trust Account. If Mars does not complete a business combination, it will not repay such loan, except to the extent there are funds available outside the Trust Account to do so after provision for all liquidation expenses. If Mars completes the Business Combination, it would repay such loaned amounts out of the proceeds of the Trust Account released to Mars. The Sponsor and its affiliates or designees are not obligated to fund the Trust Account to extend the time for Mars to complete the Business Combination.\n● If the Business Combination is not approved, in accordance with Mars Memorandum and Articles, the 1,725,000 Ordinary Shares held by the Insiders, which were acquired prior to the IPO for an aggregate purchase price of $25,000, will be worthless (as the holders have waived liquidation rights with respect to such shares), as will the 391,000 Private Placement Units that were acquired simultaneously with the IPO and in connection with the exercise of the overallotment option, for an aggregate purchase price of $3,910,000. Irrespective of existing lock-up agreements that impose restrictions on the transfer of the Ordinary Shares and the Private Placement Units, such shares had an aggregate market value of approximately $21 million based on a price of $10.00 per share.\n● The Sponsor and our executive officers and directors are entitled to reimbursement of out-of-pocket expenses incurred by them in connection with certain activities on Mars behalf, such as identifying and investigating possible business targets and business combinations, only if Mars consummates the Business Combination, otherwise they will not have any claim against the Trust Account for reimbursement. As of September 30, 2023, $5,000 of such out-of-pocket expenses had been incurred.\n● Our officers and directors may have a conflict of interest with respect to evaluating the Business Combination if the retention or resignation of any such officers and directors is a condition to the Business Combination Agreement.\nUnder Cayman Islands law, directors and officers owe the following fiduciary duties:\n(i) duty to act in good faith in what the director or officer believes to be in the best interests of the company as a whole;\n(ii) duty to exercise powers for the purposes for which those powers were conferred and not for a collateral purpose;\n(iii) directors should not properly fetter the exercise of future discretion;\n(iv) duty to exercise powers fairly as between different sections of shareholders;\n(v) duty not to put themselves in a position in which there is a conflict between their duty to the company and their personal interests; and\n(vi) duty to exercise independent judgment.\nIn addition to the above, directors also owe a duty of care which is not fiduciary in nature. This duty has been defined as a requirement to act as a reasonably diligent person having both the general knowledge, skill and experience that may reasonably be expected of a person carrying out the same functions as are carried out by that director in relation to the company and the general knowledge skill and experience which that director has.\nAs set out above, directors have a duty not to put themselves in a position of conflict and this includes a duty not to engage in self-dealing, or to otherwise benefit as a result of their position. However, in some instances what would otherwise be a breach of this duty can be forgiven and/or authorized in advance by the shareholders provided that there is full disclosure by the directors. This can be done by way of permission granted in the memorandum and articles of association or alternatively by shareholder approval at general meetings.\nAccordingly, as a result of multiple business affiliations, our officers and directors may have similar legal obligations relating to presenting business opportunities to multiple entities. In addition, conflicts of interest may arise when our board evaluates a particular business opportunity. We cannot assure you that any of the above mentioned conflicts will be resolved in our favor. Furthermore, each of our officers and directors currently has and may in the future have fiduciary obligations to other businesses of which they are officers or directors. To the extent they identify business opportunities which may be suitable for the entities to which they owe fiduciary obligations, our officers and directors will honor those fiduciary obligations. Accordingly, it is possible they may not present opportunities to us that otherwise may be attractive to us unless the entities to which they owe fiduciary obligations and any successors to such entities have declined to accept such opportunities.\nIn order to minimize potential conflicts of interest which may arise from multiple corporate affiliations, each of our officers and directors has contractually agreed, pursuant to a written agreement with us, until the earliest of a business combination, our liquidation or such time as he ceases to be an officer or director, to present to our company for our consideration, prior to presentation to any other entity, any suitable business opportunity which may reasonably be required to be presented to us, subject to any fiduciary or contractual obligations he might have.\nBelow is a table summarizing the entities to which our officers and directors currently have fiduciary duties or contractual obligations which will take priority over us.\nIndividual(1)\nEntity\nEntitys Business\nAffiliation\nKarl Brenza\nOmni eCom Acquisition Corp.\ninvestment vehicle\nCFO\nMaxim Group, LLC\nInvestment banking\nHead of Capital Growth Advisory Group\nXiaochen Zhao\nFuture Fintech Group Inc. (2)\nBlockchain based e-commerce platform\nChief Investment Officer\nShanchun Huang\nFuture Fintech Group Inc. (2)\nBlockchain based e-commerce platform\nChief Executive Officer and Director\nYenyou Zheng\nCraft Capital Management LLC\nInvestment banking\nDirector of Business Development and broker\nNovaBay Pharmaceuticals, Inc.\nBiopharmaceutical company\nDirector\nJames Jenkins\nLakeland Industries, Inc.\nManufacturer of industrial protective clothing and accessories\nDirector\nTranscat, Inc.\nProvider of accredited calibration and laboratory instrument services and distributor of test, measurement and control instrumentation\nGeneral counsel and vice president\nOmniLit Acquisition Corp.\nSPAC\nDirector\nYang Liu\nFuture Fintech Group Inc. (2)\nBlockchain based ecommerce platform\nChief Operating Officer\nXin He\nWanda USA\nPrivate property developer and owner of Wanda cinemas\nChief Financial Officer\n(1)Each of the entities listed in this table has priority and preference relative to our company with respect to the performance by each individual listed in this table of his obligations and the presentation by each such individual of business opportunities.\n(2)Future Fintech Group Inc. has received a notice of delisting from Nasdaq, that it has until February 27, 2023 to regain compliance with the minimum bid price requirement. On July 3, 2023, the SEC announced settlement of charges against FTFT. None of Mr. Huang, Ms. Zhao and Mr. Liu was FTFTs officer when FTFT had SEC filings with materially inaccurate annual reports.\nTo further minimize conflicts of interest, we have agreed not to consummate an initial business combination with an entity that is affiliated with any of our initial shareholders, officers or directors unless we have obtained an opinion from an independent investment banking firm, or another independent entity that commonly renders valuation opinions, and the approval of a majority of our disinterested independent directors that the business combination is fair to our company (or shareholders) from a financial point of view. Notwithstanding the foregoing, our amended and restated memorandum and articles of association provides that we renounce our interest in any corporate opportunity offered to any director or officer unless such opportunity is expressly offered to such person solely in his or her capacity as a director or officer of our company and such opportunity is one we are legally and contractually permitted to undertake and would otherwise be reasonable for us to pursue.\nOur executive officers have agreed not to participate in the formation of any other special purpose acquisition company with a class of securities intended to be registered under the Exchange Act which has publicly filed a registration statement with the SEC until we have entered into a definitive agreement regarding the Business Combination or we have failed to complete the Business Combination within 12 months from the consummation of this offering (or 18 months as described elsewhere herein).\nOur officers and directors, as well as our initial shareholders, have agreed (i) to vote any shares owned by them in favor of any proposed business combination and (ii) not to redeem any shares in connection with a shareholder vote to approve a proposed initial business combination or any amendment to our charter documents prior to the consummation of the Business Combination or sell any shares to us in a tender offer in connection with a proposed initial business combination.\nLimitation on Liability and Indemnification of Officers and Directors\nMars Memorandum and Articles of Association provide that, subject to certain limitations, the company shall indemnify its directors and officers against all expenses, including legal fees, and against all judgments, fines and amounts paid in settlement and reasonably incurred in connection with legal, administrative or investigative proceedings. Such indemnity only applies if the person acted honestly and in good faith with a view to the best interests of the company and, in the case of criminal proceedings, the person\nhad no reasonable cause to believe that their conduct was unlawful. The decision of the directors as to whether the person acted honestly and in good faith and with a view to the best interests of the company and as to whether the person had no reasonable cause to believe that his conduct was unlawful and is, in the absence of fraud, sufficient for the purposes of the memorandum and articles of association, unless a question of law is involved. The termination of any proceedings by any judgment, order, settlement, conviction or the entering of a nolle prosequi does not, by itself, create a presumption that the person did not act honestly and in good faith and with a view to the best interests of the company or that the person had reasonable cause to believe that his conduct was unlawful.\nOn February 13, 2023, we have entered into agreements with our officers and directors to provide contractual indemnification in addition to the indemnification provided for in Mars Memorandum and Articles. As permitted by Mars Memorandum and Articles, we have purchased a policy of directors and officers liability insurance that insures our officers and directors against the cost of defense, settlement or payment of a judgment in some circumstances and insures us against our obligations to indemnify our officers and directors.\nThese provisions may discourage shareholders from bringing a lawsuit against our directors for breach of their fiduciary duty. These provisions also may have the effect of reducing the likelihood of derivative litigation against officers and directors, even though such an action, if successful, might otherwise benefit us and our shareholders. Furthermore, a shareholders investment may be adversely affected to the extent we pay the costs of settlement and damage awards against officers and directors pursuant to these indemnification provisions.\nWe believe that these provisions, the insurance and the indemnity agreements are necessary to attract and retain talented and experienced officers and directors.\nInsofar as indemnification for liabilities arising under the Securities Act may be permitted to directors, officers or persons controlling us pursuant to the foregoing provisions, we have been informed that in the opinion of the SEC such indemnification is against public policy as expressed in the Securities Act and is theretofore unenforceable. Item 11. Executive Compensation.\nExecutive Officer and Director Compensation\nNone of our officers has received any cash or in-kind compensation for services rendered to us. We initially had an informal agreement to pay affiliates of the Sponsor for office space, utilities, secretarial, and administrative support; however, the affiliates have chosen not to seek compensation for such support. No compensation of any kind, including any finders fee, reimbursement, consulting fee or monies in respect of any payment of a loan, has been or will be paid by us to the Sponsor, officers or directors or any affiliate of the Sponsor, officers or directors, prior to, or in connection with any services rendered in order to effectuate, the consummation of the Business Combination (regardless of the type of transaction that it is). However, these individuals will be reimbursed for any out-of-pocket expenses incurred in connection with activities on our behalf such as identifying potential target businesses and performing due diligence on suitable business combinations. Our audit committee will review on a quarterly basis all payments that were made to the Sponsor, officers or directors or our or their affiliates. Any such payments prior to the Business Combination will be made using funds held outside the Trust Account. Other than quarterly audit committee review of such payments, we do not expect to have any additional controls in place governing our reimbursement payments to our directors and executive officers for their out-of-pocket expenses incurred in connection with identifying and consummating an initial business combination.\nAfter the completion of the Business Combination, directors or members of our management team who remain with us may be paid consulting or management fees from the combined company. All of these fees will be fully disclosed to stockholders, to the extent then known, in the tender offer materials or proxy solicitation materials furnished to our stockholders in connection with a proposed initial business combination. We have not established any limit on the amount of such fees that may be paid by the combined company to our directors or members of management. It is unlikely the amount of such compensation will be known at the time of the Business Combination because the directors of the post-combination business will be responsible for determining officer and director compensation. Any compensation to be paid to our officers will be determined, or recommended to the board of directors for determination, either by a compensation committee constituted solely by independent directors or by a majority of the independent directors on our board of directors.\nWe do not intend to take any action to ensure that members of our management team maintain their positions with us after the consummation of the Business Combination, although it is possible that some or all of our officers and directors may negotiate\nemployment or consulting arrangements to remain with us after the Business Combination. The existence or terms of any such employment or consulting arrangements to retain their positions with us may influence our managements motivation in identifying or selecting a target business but we do not believe that the ability of our management to remain with us after the consummation of the Business Combination will be a determining factor in our decision to proceed with ScanTech. We are not party to any agreements with our officers and directors that provide for benefits upon termination of employment. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nThe following table sets forth information regarding the beneficial ownership of our Ordinary Shares as of the date of this Annual Report.\nUnless otherwise indicated, we believe that all persons named in the table have sole voting and investment power with respect to all Ordinary Shares beneficially owned by them.\nOn September 30, 2022, we issued 2,156,250 Ordinary Shares resulting in an aggregate of 2,156,250 Ordinary Shares outstanding, which we refer to throughout this prospectus as the Founder Shares, for an aggregate purchase price of $25,000, or approximately $0.012 per share. On May 31, 2021, we issued an aggregate of 1,250,000 Ordinary Shares, at par value $0.0001 to the Sponsor. On October 20, 2021, the Sponsor paid $16,375, or approximately $0.095 per share, for additional 173,125 Ordinary Shares, such that the Sponsor owned an aggregate of 1,423,125 Founder Shares, for approximately $0.012 per share. On the same day, our officers and directors also paid an aggregate purchase price of $8,500 for a total of 733,125 Founder Shares, for approximately $0.012 per share.\nOn December 1, 2022, we effectuated a share consolidation at a ratio of 1 for 1.25. Every 1.25 shares was consolidated into 1 share. The effects of this share consolidation were made retroactive to September 30, 2021. The share consolidation reduced the number of authorized shares from 1,000,000,000, par value $0.0001 to 800,000,000, par value $0.000125. It also reduced the number of outstanding shares from 2,156,250 shares to 1,725,000 shares, or approximately $0.014 per share.\nOn February 16, 2023, we consummated the IPO of 6,900,000 Units, including 900,000 additional Units issued pursuant to the full exercise by the underwriter of its over-allotment option, at a purchase price of $10.00 per Unit.\nSimultaneously with the consummation of the IPO and the sale of the Units, the Sponsor has purchased an aggregate of 391,000 Private Placement Units, including 36,000 Private Placement Units that were issued pursuant to the underwriters full exercise of the over-allotment option, for a purchase price of $10.00 per Private Placement Unit.\nThe following table presents the number of Ordinary Shares and percentage of Ordinary Shares as of September 30, 2023. The numbers and percentages presented include 9,292,000 Ordinary Shares, consisting of 6,900,000 shares from IPO, 391,000 shares from Private Placement, 276,000 representative shares, and 1,725,000 Founder Shares, issued and outstanding after this offering. Prior to the effective date of the registration statement, of which this prospectus is a part, the Sponsor will transfer certain Founder Shares to our directors and executive officers. Such transfers are reflected in the table below.\nApproximate\nAmount\nPercentage\nand\nof\nNature of\nOutstanding\nBeneficial\nOrdinary\nName and Address of Beneficial Owner(1)\nOwnership\nShares\nShanchun Huang\n1,529,500\n16.46\n%\nKarl Brenza\n345,000\n3.71\n%\nXiaochen (Iris) Zhao\n103,500\n1.11\n%\nYenyou (Jeff) Zheng\n51,750\n*\nYang Liu\n51,750\n*\nJames Jenkins\n17,250\n*\nXin He\n17,250\n*\nMars Capital Holding Corporation (2)\n1,529,500\n16.46\n%\nAll directors and executive officers (seven individuals) as a group\n2,116,000\n22.77\n%\n*\nLess than 1%.\n(1)Unless otherwise indicated, the business address of each of the individuals is c/o Mars Acquisition Corp., Americas Tower, 1177 Avenue of The Americas, Suite 5100, New York, NY, 10036.\n(2)Mars Capital Holding Corporation, the Sponsor, is the record holder of the shares reported herein. Mr. Huang, our Chairman, has voting and dispositive power over the shares held by the Sponsor through his position with Mars Capital Holding Corporation.\nOur initial shareholders beneficially own approximately 22.77% of the issued and outstanding Ordinary Shares. Because of the ownership block held by our initial shareholders, such individuals may be able to effectively exercise control over all matters requiring approval by our shareholders, including the election of directors and approval of significant corporate transactions other than approval of the Business Combination.\nThe holders of the Founder Shares have agreed: (A) to vote any shares owned by them in favor of any proposed initial business combination; and (B) not to redeem any shares in connection with a shareholder vote to approve the Business Combination or in connection with a tender offer.\nOur sponsor and our executive officers and directors are deemed to be our promoters as such term is defined under the federal securities laws.\nRestrictions on Transfers of Founder Shares and Private Placement Units\nThe Founder Shares, and Private Placement Units, and securities contained therein, are each subject to transfer restrictions pursuant to lock-up provisions in a letter agreement with us to be entered into by our Sponsor, officers and directors. Those lock-up provisions provide that such securities are not transferable or salable (i) in the case of the Founder Shares, until the earlier of (A) six months after the completion of the Business Combination or (B) subsequent to the Business Combination, (x) if the last sale price of the Ordinary Shares equals or exceeds $12.00 per share (as adjusted for share splits, share capitalizations, rights issuances, subdivisions, reorganizations, recapitalizations and the like) for any 20 trading days within any 30-trading day period commencing after the Business Combination, or (y) the date following the completion of the Business Combination on which we complete a liquidation, merger, share exchange, reorganization or other similar transaction that results in all of our shareholders having the right to exchange their Ordinary Shares for cash, securities or other property, and (ii) in the case of the Private Placement Units, including the component securities therein, until 30 days after the completion of the Business Combination, except in each case (a) to our officers or directors, any affiliates\nor family members of any of our officers or directors, any members of the Sponsor, or any affiliates of the Sponsor, (b) in the case of an individual, by gift to a member of the individuals immediate family or to a trust, the beneficiary of which is a member of the individuals immediate family or an affiliate of such person, or to a charitable organization; (c) in the case of an individual, by virtue of laws of descent and distribution upon death of the individual; (d) in the case of an individual, pursuant to a qualified domestic relations order; (e) in the event of our liquidation prior to our completion of the Business Combination; or (f) by virtue of the laws of the Cayman Islands or the Sponsors operating agreement upon dissolution of the Sponsor; provided, however, that in the case of clauses (a) through (e) or (f) these permitted transferees must enter into a written agreement agreeing to be bound by these transfer restrictions and by the same agreements entered into by the Sponsor with respect to such securities (including provisions relating to voting, the Trust Account and liquidation distributions described elsewhere in this Annual Report).\nRegistration Rights\nThe holders of the Founder Shares, Private Placement Units, shares issued to the underwriters at the IPO, and Units that may be issued on conversion of Working Capital Loans (and in each case holders of their component securities, as applicable) are entitled to registration rights pursuant to the applicable registration rights agreements that require us to register such securities for resale (in the case of the Founder Shares, only after conversion to the Ordinary Shares). The holders of these securities are entitled to make up to three demands, excluding short form demands, that we register such securities. In addition, the holders have certain piggy-back registration rights with respect to registration statements filed subsequent to our completion of the Business Combination and rights to require us to register for resale such securities pursuant to Rule 415 under the Securities Act. However, the registration rights agreement provides that we will not permit any registration statement filed under the Securities Act to become effective until termination of the applicable lock-up period, which occurs (i) in the case of the Founder Shares, on the earlier of (A) six months after the completion of the Business Combination or (B) subsequent to the Business Combination, (x) if the last sale price of Ordinary Shares equals or exceeds $12.00 per share (as adjusted for share splits, share capitalizations, rights issuances, subdivisions, reorganizations, recapitalizations and the like) for any 20 trading days within any 30-trading day period commencing after the Business Combination, or (y) the date following the completion of the Business Combination on which we complete a liquidation, merger, share exchange, reorganization or other similar transaction that results in all of our public shareholders having the right to exchange their Ordinary Shares for cash, securities or other property, and (ii) in the case of the Private Placement Units and Units that may be issued on conversion of Working Capital Loans, including the component securities therein, 30 days after the completion of the Business Combination. Notwithstanding the above, the shares to be issued to the underwriters in the IPO are further subject to the limitations on registration requirements imposed by FINRA Rule 5110(g)(8). We will bear the expenses incurred in connection with the filing of any such registration statements.\nChanges in Control\nNone. Item 13. Certain Relationships and Related Transactions, and Director Independence.\nOn May 31, 2021, Mars Capital Holding Corporation, the Sponsor, purchased an aggregate of 1,250,000 Founder Shares, for an aggregate offering price of $125 at par value of $0.0001. On October 20, 2021, the Sponsor purchased an additional 173,125 Founder Shares for an aggregate offering price of $16,375, such that the Sponsor owned an aggregate of 1,423,125 Founder Shares, for an average purchase price of approximately $0.012 per share.\nOn October 20, 2021, our officers and directors paid an aggregate purchase price of $8,500 for a total of 733,125 Founder Shares, for approximately $0.012 per share. On September 30, 2022, there were 2,156,125 Ordinary Shares outstanding.\nOn December 1, 2022, we effectuated a share consolidation at a ratio of 1 for 1.25. Every 1.25 shares was consolidated into 1 share. The effects of this share consolidation were made retroactive to September 30, 2021. The share consolidation reduced the number of authorized shares from 1,000,000,000, par value $0.0001 Explanatory Paragraph to 800,000,000, par value $0.000125. It also reduced the number of outstanding shares from 2,156,250 shares to 1,725,000 shares.\nSimultaneously with the consummation of the IPO and the sale of the Units, the Sponsor has purchased an aggregate of 391,000 Private Placement Units, including 36,000 Private Placement Units that were issued pursuant to the underwriters full exercise of the over-allotment option, for a purchase price of $10.00 per Private Placement Unit.\nThe Sponsor provided us with a loan for IPO expenses. The loan was non-interest bearing, unsecured, and was due on the closing of the Initial Public Offering. As of September 30, 2022, the outstanding balance of note payable to the affiliate was $228,246, and no interest was accrued. As of February 16, 2023, the Sponsor agreed to apply the Note in its entirety to the Private Placement with Mars, and the note was extinguished.\nWe initially had an informal agreement to pay affiliates of the Sponsor for office space, utilities, secretarial, and administrative support; however, the affiliates have chosen not to seek compensation for such support.\nThe Sponsor, and our executive officers and directors are entitled to reimbursement of out-of-pocket expenses incurred by them in connection with certain activities on Mars behalf, such as identifying and investigating possible business targets and business combinations, if Mars consummates the Business Combination. As of September 30, 2023, $5,000 of such out-of-pocket expenses had been incurred.\nIn addition, in order to finance transaction costs in connection the Business Combination, the Sponsor or an affiliate of the Sponsor or certain of our directors and officers may, but are not obligated to, loan us funds as may be required. If we complete the Business Combination, we may repay such loaned amounts out of the proceeds of the Trust Account released to us. Otherwise, such loans may be repaid only out of funds held outside the Trust Account. In the event that the Business Combination does not close, we may use a portion of the working capital held outside the Trust Account to repay such loaned amounts but no proceeds from our Trust Account would be used to repay such loaned amounts. Up to $1,500,000 of such loans may be convertible into Units, at a price of $10.00 per Unit at the option of the lender. The Units would be identical to the Private Placement Units. The terms of such loans, if any, have not been determined and no written agreements exist with respect to such loans. Prior to the completion of the Business Combination, we do not expect to seek loans from parties other than the Sponsor or an affiliate of the Sponsor as we do not believe third parties will be willing to loan such funds and provide a waiver against any and all rights to seek access to funds in our Trust Account.\nPursuant to the registration rights agreements we have or may entered into with our initial shareholders and holders of our Private Placement Units, Units that may be issued upon conversion of Working Capital Loans (including in each case the underlying securities), and shares issued to the underwriters at the IPO, we required to register certain securities for sale under the Securities Act. These holders will be entitled under the registration rights agreement to make up to three demands that we register certain of our securities held by them for sale under the Securities Act and to have the securities covered thereby registered for resale pursuant to Rule 415 under the Securities Act. In addition, these holders have the right to include their securities in other registration statements filed by us. However, the registration rights agreement provides that we will not permit any registration statement filed under the Securities Act to become effective until the securities covered thereby are released from their lock-up restrictions, as described herein. We will bear the costs and expenses of filing any such registration statements.\nRelated Party Policy\nOur Code of Ethics requires us to avoid, wherever possible, all related party transactions that could result in actual or potential conflicts of interests, except under guidelines approved by the board of directors (or the audit committee). Related-party transactions are defined as transactions in which (1) the aggregate amount involved will or may be expected to exceed $120,000 in any calendar year, (2) we or any of our subsidiaries is a participant, and (3) any (a) executive officer, director or nominee for election as a director, (b) greater than 5% beneficial owner of our Ordinary Shares, or (c) immediate family member, of the persons referred to in clauses (a) and (b), has or will have a direct or indirect material interest (other than solely as a result of being a director or a less than 10% beneficial owner of another entity). A conflict of interest situation can arise when a person takes actions or has interests that may make it difficult to perform his or her work objectively and effectively. Conflicts of interest may also arise if a person, or a member of his or her family, receives improper personal benefits as a result of his or her position.\nWe also require each of our directors and executive officers to annually complete a directors and officers questionnaire that elicits information about related party transactions.\nOur audit committee, pursuant to its written charter, is responsible for reviewing and approving related-party transactions to the extent we enter into such transactions. All ongoing and future transactions between us and any of our officers and directors or their respective affiliates will be on terms believed by us to be no less favorable to us than are available from unaffiliated third parties. Such transactions will require prior approval by our audit committee and a majority of our uninterested independent directors, or the members of our board who do not have an interest in the transaction, in either case who had access, at our expense, to our attorneys or\nindependent legal counsel. We will not enter into any such transaction unless our audit committee and a majority of our disinterested independent directors determine that the terms of such transaction are no less favorable to us than those that would be available to us with respect to such a transaction from unaffiliated third parties. Additionally, we require each of our directors and executive officers to complete a directors and officers questionnaire that elicits information about related party transactions.\nThese procedures are intended to determine whether any such related party transaction impairs the independence of a director or presents a conflict of interest on the part of a director, employee or officer.\nTo further minimize potential conflicts of interest, we have agreed not to consummate a business combination with an entity which is affiliated with any of our initial shareholders unless we obtain an opinion from an independent investment banking firm that the business combination is fair to our unaffiliated shareholders from a financial point of view. Furthermore, in no event will any of our existing officers, directors or initial shareholders, or any entity with which they are affiliated, be paid any finders fee, consulting fee or other compensation prior to, or for any services they render in order to effectuate, the consummation of a business combination. Item 14. Principal Accountant Fees and Services.\nOur independent public accounting firm is Freed Maxick CPAs, P.C. (Freed Maxick), 424 Main Street, Suite 800, Buffalo, NY 14202, PCAOB Auditor ID #317. The following is a summary of fees paid or to be paid to Freed Maxick for services rendered.\nAudit Fees. Audit fees consist of fees billed for professional services rendered for the audit of our year-end financial statements and services that are normally provided by Freed Maxick in connection with regulatory filings. The aggregate fees billed by Freed Maxick for professional services rendered for the audit of our annual financial statements, review of the financial information included in our Form 10-Q for the quarters ending December 31, 2022, March 31, 2023 and June 30, 2023, and other required filings with the SEC for the period from October 31, 2022 through September 30, 2023 totaled $65,750.\nAudit-Related Fees. Audit-related services consist of fees billed for assurance and related services that are reasonably related to performance of the audit or review of our financial statements and are not reported under Audit Fees. These services include attest services that are not required by statute or regulation and consultations concerning financial accounting and reporting standards. We did not pay Freed Maxick for consultations concerning financial accounting and reporting standards for the period from October 1, 2022 through September 30, 2023.\nTax Fees. We did not pay Freed Maxick for tax planning and tax advice for the period from October 1, 2022 through September 30, 2023.\nAll Other Fees. We did not pay Freed Maxick for other services for the period from October 1, 2022 through September 30, 2023.\nPre-Approval Policy\nOur audit committee was formed upon the consummation of our initial public offering. As a result, the audit committee did not pre-approve all of the foregoing services, although any services rendered prior to the formation of our audit committee were approved by our board of directors. Since the formation of our audit committee, and on a going-forward basis, the audit committee has and will pre-approve all auditing services and permitted non- audit services to be performed for us by our independent registered public accounting firm, including the fees and terms thereof (subject to the de minimis exceptions for non-audit services described in the Exchange Act which are approved by the audit committee prior to the completion of the audit).\nPART IV Item 15. Exhibit and Financial Statement Schedules.\n(a)The following documents are filed as part of this Annual Report:\n(1)\nFinancial Statements\nAudited Financial Statements of Mars Acquisition Corp.\nPage\nReport of Independent Registered Public Accounting Firm (PCAOB #317)\nBalance Sheets as of September 30, 2023 and 2022\nStatements of Operations for the Years Ended September 30, 2023 and 2022\nStatements of Changes in Shareholders Equity (Deficit) for the Years Ended September 30, 2023 and 2022\nStatements of Cash Flows for the Years Ended September 30, 2023 and 2022\nNotes to the Financial Statements\n(2)\nFinancial Statement Schedules All financial statement schedules are omitted because they are not applicable or the amounts are immaterial and not required, or the required information is presented in the financial statements and notes thereto beginning on page of this Report.\n(3)\nExhibits\nWe hereby file as part of this Annual Report on Form 10-K the exhibits listed in the attached Exhibit Index. Copies of such material can be obtained on the SEC website at www.sec.gov.\nExhibit No.\nDescription\n1.1\nUnderwriting Agreement (1)\n2.1\nBusiness Combination Agreement (2)\n3.1\nMemorandum and Articles of Association (1)\n3.2\nAmended and Restated Memorandum and Articles of Association (1)\n4.1\nSpecimen Unit Certificate (1)\n4.2\nSpecimen Ordinary Shares Certificate (1)\n4.3\nSpecimen Rights Certificate (1)\n4.4\nRight Agreement between Continental Stock Transfer & Trust Company, LLC and the Registrant (1)\n4.5*\nDescription of Securities\n10.1\nLetter Agreement among the Registrant and its officers, directors, and Mars Capital Holding Corporation (1)\n10.2\nPromissory Note, dated July 20, 2021, issued to Mars Capital Holding Corporation (1)\n10.3\nAmendment No. 1 to the Promissory Note, dated April 20, 2022 (1)\n10.4\nInvestment Management Trust Agreement between Continental Stock Transfer & Trust Company, LLC and the Registrant (1)\n10.5\nRegistration Rights Agreement between the Registrant and certain security holders (1)\n10.6\nSecurities Subscription Agreement between the Registrant, Mars Capital Holding Corporation, officers and directors (1)\n10.7\nPrivate Placement Units Purchase Agreement between the Registrant and Mars Capital Holding Corporation (1)\n10.8\nIndemnity Agreement (1)\nCode of Ethics (1)\n31.1*\nCertification of the Chief Executive Officer required by Rule 13a-14(a) or Rule 15d-14(a).\n31.2*\nCertification of the Chief Financial Officer required by Rule 13a-14(a) or Rule 15d-14(a).\n32.1**\nCertification of the Chief Executive Officer required by Rule 13a-14(b) or Rule 15d-14(b) and 18 U.S.C. 1350.\n32.2**\nCertification of the Chief Financial Officer required by Rule 13a-14(b) or Rule 15d-14(b) and 18 U.S.C. 1350.\n101.INS\nInline XBRL Instance Document\n101.SCH\nInline XBRL Taxonomy Extension Schema\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase\nCover Page Interactive Data File (formatted as inline XBRL and contained in Exhibit 101)\n*\nFiled herewith.\n**\nFurnished herewith.\n(1)\nIncorporated by reference to the Registrants Form S-1/A, filed with the Securities Exchange Commission on February 3, 2023.\n(2)\nIncorporated by reference to the Registrants Form 8-K, filed with the Securities Exchange Commission on September 4, 2023.\nItem 16. Form 10-K Summary.\nNot applicable.\nMARS ACQUISITION CORP.\nPage\nReport of Independent Registered Public Accounting Firm (PCAOB #317)\nAudited Financial Statements of Mars Acquisition Corp.\nBalance Sheets as of September 30, 2023 and 2022\nStatements of Operations for the Years Ended September 30, 2023 and 2022\nStatements of Changes in Shareholders Equity (Deficit) for the Years Ended September 30, 2023 and 2022\nStatements of Cash Flows for the Years Ended September 30, 2023 and 2022\nNotes to the Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Stockholders and the Board of Directors of Mars Acquisition Corp.\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of Mars Acquisition Corp. (the Company) as of September 30, 2023 and 2022, the related statements of operations, changes in shareholders equity (deficit) and cash flows for the years then ended, and the related notes to the financial statements (collectively, the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of September 30, 2023 and 2022, and the results of its operations and its cash flows for the years then ended, in conformity with accounting principles generally accepted in the United States of America.\nExplanatory Paragraph - Going Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 1 to the financial statements, the Companys business plan is dependent upon its completion of a business combination in less than 12 months from initial public offering. If the initial business combination is not completed before this time, the Company could be required to redeem all Ordinary Shares and would not have sufficient resources to continue operations. This condition raises substantial doubt about the Companys ability to continue as a going concern for a period of one year from the issuance date of the financial statement. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provides a reasonable basis for our opinion.\n/s/ Freed Maxick CPAs, P.C.\nWe have served as the Company's auditor since 2021.\nBuffalo, New York\nDecember 28, 2023\nMARS ACQUISITION CORP.\nBALANCE SHEETS\nSeptember 30, 2023\nSeptember 30, 2022\nASSETS\nCurrent Assets\nCash\n$\n178,793\n$\n-\nPrepaid expenses\n149,164\n-\nInvestments held in Trust Account\n72,587,820\n-\nDeferred offering costs associated with initial public offering\n-\n205,260\nTotal Assets\n$\n72,915,777\n$\n205,260\nLIABILITIES AND SHAREHOLDERS EQUITY (DEFICIT)\nCurrent Liabilities\nAccrued expenses\n$\n16,363\n$\n2,224\nNote payable - related party\n-\n228,246\nTotal Liabilities\n16,363\n230,470\nCOMMITMENTS AND CONTINGENCIES\nOrdinary shares subject to possible redemption, 6,900,000 shares at redemption value of $10.52 per share\n72,587,820\n-\nSHAREHOLDERS EQUITY (DEFICIT)\nOrdinary shares, $0.000125 par value; 800,000,000 shares authorized; 2,392,000 and 1,725,000 shares issued and outstanding, respectively(1)\nAdditional paid-in capital\n-\n24,784\nRetained earnings (accumulated deficit)\n311,295\n(50,210)\nTotal Shareholders Equity (Deficit)\n311,594\n(25,210)\nTotal Liabilities and Shareholders Equity (Deficit)\n$\n72,915,777\n$\n205,260\n(1) Excludes 6,900,000 shares subject to possible redemption as of September 30, 2023.\nThe accompanying notes are an integral part of these financial statements.\nMARS ACQUISITION CORP.\nSTATEMENTS OF OPERATIONS\nYear ended September 30,\nOperating Expenses\nGeneral and administrative costs\n$\n521,582\n$\n2,718\nNet loss from operations\n(521,582)\n(2,718)\nOther Income\nInvestment income on Trust Account\n2,207,820\n-\nTotal other income\n2,207,820\n-\nNet income (loss)\n$\n1,686,238\n$\n(2,718)\nWeighted average shares outstanding, basic and diluted\nRedeemable Ordinary Shares - basic and diluted\n4,272,329\n-\nNon-redeemable Ordinary Shares - basic and diluted\n2,059,414\n1,472,603\nBasic and diluted net income (loss) per share\nRedeemable Ordinary Shares - basic and diluted\n$\n0.27\n$\n(0.00)\nNon-redeemable Ordinary Shares - basic and diluted\n$\n0.27\n$\n(0.00)\nThe accompanying notes are an integral part of these financial statements.\nMARS ACQUISITION CORP.\nSTATEMENTS OF CHANGES IN SHAREHOLDERS EQUITY (DEFICIT)\nRETAINED\nADDITIONAL\nEARNINGS\nTOTAL\nORDINARY SHARES\nPAID-IN\n(ACCUMULATED\nSHAREHOLDERS\nSHARES\nAMOUNT\nCAPITAL\nDEFICIT)\nEQUITY (DEFICIT)\nBalance-September 30, 2021\n1,000,000\n$\n$\n-\n$\n(47,492)\n$\n(47,367)\nIssuance of Founder shares\n725,000\n24,784\n-\n24,875\nNet loss\n-\n-\n-\n(2,718)\n(2,718)\nBalance - September 30, 2022\n1,725,000\n24,784\n(50,210)\n(25,210)\nIssuance of Private Placement shares\n391,000\n3,909,951\n-\n3,910,000\nIssuance of representative shares\n276,000\n2,724,893\n-\n2,724,927\nFair value of rights\n-\n-\n876,833\n-\n876,833\nOffering costs\n-\n-\n(430,921)\n-\n(430,921)\nRemeasurement of Ordinary Shares subject to redemption\n-\n-\n(7,105,540)\n(1,324,733)\n(8,430,273)\nNet income\n-\n-\n-\n1,686,238\n1,686,238\nBalance - September 30, 2023\n2,392,000\n$\n$\n-\n$\n311,295\n$\n311,594\nThe accompanying notes are an integral part of these financial statements.\nMARS ACQUISITION CORP.\nSTATEMENTS OF CASH FLOWS\nYear ended September 30,\nCash flows from operating activities\nNet income (loss)\n$\n1,686,238\n$\n(2,718)\nAdjustments to reconcile net loss to net cash used in operating activities:\nGeneral and administrative costs paid by related party\n-\n2,718\nInvestment income received in Trust Account\n(2,207,820)\n-\nChange in operating assets and liabilities\nAccrued liabilities\n14,139\n-\nPrepaid Expenses\n(149,164)\n-\nNet cash used in operating activities\n(656,607)\n-\nCash flows from investing activities\nCash deposited in Trust Account\n(70,380,000)\n-\nNet cash used in investing activities\n(70,380,000)\n-\nCash flows from financing activities\nProceeds from note payable with related party\n41,213\n143,161\nPayment of deferred offering costs by related party\n-\n(168,036)\nExtinguishment of note payable with related party\n(269,459)\n-\nPayment of underwriting fee and other offering costs\n(1,466,354)\n-\nProceeds from sale of Units in IPO, including over-allotment\n69,000,000\n-\nProceeds from issuance of Founder shares\n3,910,000\n24,875\nNet cash provided by financing activities\n71,215,400\n-\nNet increase in cash\n178,793\n-\nCash- beginning of the year\n-\n-\nCash - end of the year\n$\n178,793\n$\n-\nSupplemental disclosure of noncash activities\nDeferred offering costs included in accrued expenses\n$\n-\n$\n2,224\nIssuance of representative shares\n$\n2,724,927\n$\n-\nReclassification of offering costs related to public shares\n$\n(243,964)\n$\n-\nRemeasurement adjustment on public shares subject to possible redemption\n$\n(8,430,273)\n$\n-\nThe accompanying notes are an integral part of these financial statements.\nMARS ACQUISITION CORP.\nNOTES TO THE FINANCIAL STATEMENTS\nNOTE 1 - DESCRIPTION OF ORGANIZATION AND BUSINESS OPERATIONS\nMars Acquisition Corp. (Mars) is a Cayman Islands exempted company incorporated as a blank check company on April 23, 2021. Mars was incorporated for the purpose of effecting a merger, share exchange, asset acquisition, share purchase, reorganization or similar business combination with one or more businesses (Business Combination). Although Mars is not limited to a particular industry or geographic region for purposes of consummating a Business Combination, Mars intends to focus on opportunities in cryptocurrency and blockchain, automobiles, healthcare, financial technology, cyber security, cleantech, software, Internet and artificial intelligence, specialty manufacturing and any other related technology innovations market. On September 5, 2023, a Business Combination Agreement was entered into by Mars and ScanTech Identification Beam Systems, LLC (ScanTech), among others (see Note 6).\nAt September 30, 2023, Mars had not yet commenced operations. All activity through September 30, 2023 relates to Mars formation and initial public offering (the Initial Public Offering or IPO), which is described below. Mars will not generate any operating revenues until after the completion of an initial Business Combination, at the earliest. Mars will generate non-operating income in the form of interest income from the proceeds derived from the Initial Public Offering. Mars has selected September 30 as its fiscal year end date.\nThe registration statement for Mars Initial Public Offering was declared effective on February 9, 2023. On February 16, 2023, Mars consummated its Initial Public Offering of 6,900,000 Units (Units and, with respect to the Ordinary Shares included in the Units being offered, the Public Shares) at $10.00 per Unit, including 900,000 Units that were issued pursuant to the underwriters full exercise of their over-allotment option, generating gross proceeds of $69,000,000.\nSimultaneously with the closing of the Initial Public Offering, Mars consummated the Private Placement (Private Placement) of 391,000 Units at a price of $10.00 per Unit to Mars sponsor, Mars Capital Holding Corporation, a British Virgin Islands company (Sponsor), generating gross proceeds of $3,910,000 (see Note 4).\nOffering costs amounted to $4,398,891 consisting of $1,430,000 of cash underwriting fees, non-cash underwriting fees of $2,724,927 represented by the fair value of 276,000 representative shares issued to the underwriter (see Note 6), and $243,964 of other offering costs.\nUpon the closing of the Initial Public Offering and Private Placement, $70,380,000 of the net proceeds of the sale of the Units in the Initial Public Offering and the Private Placement was placed in a Trust Account (the Trust Account) and may be invested by the trustee only in U.S. government treasury bills with a maturity of 185 days or less or in money market funds investing solely in U.S. Treasuries and meeting certain conditions under Rule 2a-7 under the Investment Company Act, and will not be released from the Trust Account until the earlier of: (i) the completion of a Business Combination or (ii) the distribution of the Trust Account.\nMars management has broad discretion with respect to the specific application of the net proceeds of its Initial Public Offering and Private Placement Units, although substantially all of the net proceeds are intended to be applied generally toward consummating a Business Combination. Mars initial Business Combination must be with one or more operating businesses or assets with a fair market value equal to at least 80% of the net assets held in the Trust Account (excluding taxes payable on interest earned in the Trust Account) at the time Mars signs a definitive agreement in connection with the initial Business Combination. However, Mars will only complete a Business Combination if the post-transaction company owns or acquires 50% or more of the outstanding voting securities of the target or otherwise acquires a controlling interest in the target sufficient for it not to be required to register as an investment company under the Investment Company Act 1940, as amended, or the Investment Company Act.\nMars will provide holders of its Public Shares (the Public Shareholders) with the opportunity to redeem all or a portion of their Public Shares upon the completion of a Business Combination either (i) in connection with a shareholder meeting called to approve the Business Combination or (ii) by means of a tender offer. The decision as to whether Mars will seek shareholder approval of a Business Combination or conduct a tender offer will be made by Mars, solely in its discretion. The Public Shareholders will be entitled to redeem their Public Shares for a pro rata portion of the amount then in the Trust Account (initially approximately $10.20 per share, plus any pro rata interest earned on the funds held in the Trust Account and not previously released to Mars to pay its tax obligations).\nIf a shareholder vote is not required and Mars does not decide to hold a shareholder vote for business or other legal reasons, Mars will, pursuant to its amended and restated memorandum and articles of association:\n(1) conduct the redemptions pursuant to Rule 13e-4 and Regulation 14E of the Exchange Act, which regulate issuer tender offers; and\n(2) file tender offer documents with the SEC prior to completing our initial Business Combination which contain substantially the same financial and other information about the initial Business Combination and the redemption rights as is required under Regulation 14A of the Exchange Act, which regulates the solicitation of proxies.\nSuch provisions may be amended if a special resolution passed by holders of at least two-thirds of our issued and outstanding Ordinary Shares who, being entitled to do so, attend and vote at a general meeting for which notice specifying the intention to propose the resolution as a special resolution has been given or by way of unanimous written resolution of all of our shareholders. Whether or not Mars maintains its registration under the Exchange Act or our listing on Nasdaq, Mars will provide its Public Shareholders with the opportunity to redeem their Public Shares by one of the two methods listed above. Upon the public announcement of our initial Business Combination, if Mars elects to conduct redemptions pursuant to the tender offer rules, Mars or our Sponsor will terminate any plan established in accordance with Rule 10b5-1 to purchase our Ordinary Shares in the open market, in order to comply with Rule 14e-5 under the Exchange Act.\nIn the event Mars conducts redemptions pursuant to the tender offer rules, our offer to redeem will remain open for at least 20 business days, in accordance with Rule 14e-1(a) under the Exchange Act, and Mars will not be permitted to complete its initial Business Combination until the expiration of the tender offer period. In addition, the tender offer will be conditioned on Public Shareholders not tendering more than a specified number of Public Shares, which number will be based on the requirement that we will only redeem our Public Shares so long as (after such redemption) our net tangible assets will be at least $5,000,001 either immediately prior to or upon consummation of our initial Business Combination and after payment of underwriters fees and commissions (so that we are not subject to the SECs penny stock rules) or any greater net tangible asset or cash requirement which may be contained in the agreement relating to our initial Business Combination. If the Public Shareholders tender more shares than Mars has offered to purchase, Mars will withdraw the tender offer and not complete the initial Business Combination.\nIf, however, shareholder approval of the transaction is required by law or stock exchange listing requirements, or Mars decides to obtain shareholder approval for business or other legal reasons, Mars will conduct the redemptions in conjunction with a proxy solicitation pursuant to Regulation 14A of the Exchange Act, which regulates the solicitation of proxies, and not pursuant to the tender offer rules; and file proxy materials with the SEC.\nNotwithstanding the foregoing, if Mars seeks shareholder approval of the Business Combination and Mars does not conduct redemptions pursuant to the tender offer rules, a Public Shareholder, together with any affiliate of such shareholder or any other person with whom such shareholder is acting in concert or as a group (as defined under Section 13 of the Securities Exchange Act of 1934, as amended (the Exchange Act)), will be restricted from redeeming its shares with respect to more than an aggregate of 15% of the Public Shares without the Mars prior written consent.\nMars will have only 12 months from the closing of this offering (or 18 months from the closing of this offering, if Mars extends the period of time to consummate a Business Combination) to complete its initial Business Combination. If Mars is unable to complete its initial Business Combination within such 12-month period (or 18-month period), Mars will: (i) cease all operations except for the purpose of winding up; (ii) as promptly as reasonably possible, but not more than ten business days thereafter, redeem the Public Shares, at a per-share price, payable in cash, equal to the aggregate amount then on deposit in the Trust Account including interest earned on the funds held in the Trust Account and not previously released to us to pay our income taxes (less up to $50,000 of interest to pay dissolution expenses), divided by the number of then outstanding Public Shares, which redemption will completely extinguish Public Shareholders rights as shareholders (including the right to receive further liquidating distributions, if any), subject to applicable law; and (iii) as promptly as reasonably possible following such redemption, subject to the approval of our remaining shareholders and our board of directors, dissolve and liquidate, subject in each case to our obligations under Cayman Islands law to provide for claims of creditors and the requirements of other applicable law.\nMars Sponsor, officers and directors have entered into a letter agreement with Mars, pursuant to which they have agreed to waive their redemption rights with respect to any Founder Shares and any Public Shares held by them in connection with the completion of our initial Business Combination. In addition, Mars initial shareholders have agreed to waive their rights to liquidating distributions from the Trust Account with respect to any Founder Shares held by them if Mars fails to complete its initial Business Combination within the prescribed time frame. However, if Mars Sponsor or any of its officers, directors or affiliates acquires Public Shares in or after this offering, they will be entitled to liquidating distributions from the Trust Account with respect to such Public Shares if Mars fails to complete its initial Business Combination within the prescribed time frame.\nLiquidity and managements plan\nIn connection with Marss assessment of going concern considerations in accordance with Accounting Standards Update (ASU) 2014-15, Disclosures of Uncertainties about an Entitys Ability to Continue as a Going Concern, management believes that the funds which Mars has available following the completion of the Initial Public Offering and Private Placement may not be enough to sustain operations for a period of one year from the issuance date of these financial statements. If Mars is unable to complete the Extension or the Business Combination due to a lack of sufficient funds, Mars may be forced to cease operations and liquidate the Trust Account. In addition, following the Business Combination, if cash on hand is insufficient, Mars may need to obtain additional financing in order to meet our obligations. There is no assurance that Mars plans to consummate a business combination will be successful within the Combination Period as described above. As a result, there is substantial doubt about the entitys ability to continue as a going concern within one year after the date that the financial statement are issued or are available to be issued. The financial statements do not include any adjustments that might result from the outcome of the uncertainty.\nNOTE 2 - SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBasis of presentation\nThe accompanying unaudited financial statements have been prepared in accordance with U.S. Generally Accepted Accounting Principles (GAAP) for interim financial information and pursuant to the rules and regulations of the SEC. In the opinion of management, all adjustments, consisting of normal recurring accruals, considered necessary for a fair presentation have been included. Operating results for the period from October 1, 2022 through September 30, 2023 are not necessarily indicative of the results that may be expected for the period ending September 30, 2023, or any future period.\nCash and cash equivalents\nMars considers all short-term investments with an initial maturity of three months or less when purchased to be cash equivalents. As of September 30, 2023 and September 30, 2022, there were $178,793 and $0 of cash and cash equivalents, respectively.\nInvestments in Trust Account\nThe funds held in the Trust Account can be invested in United States government treasury bills, notes or bonds having a maturity of 185 days or less or in money market funds meeting the applicable conditions under Rule 2a-7 promulgated under the Investment Company Act of 1940, as amended, until the earlier of the consummation of its first business combination and Mars failure to consummate a business combination within 12 months (or 18 months as applicable) from the consummation of the IPO.\nMars investments held in the Trust Account are classified as trading securities. Trading securities are presented on the balance sheet at fair value at the end of each reporting period. Gains and losses resulting from the change in fair value of investments held in Trust Account are included in investment income on Trust Account in the accompanying statements of operations. The estimated fair values of investments held in Trust Account are determined using available market information (see Note 8).\nAs of September 30, 2023 and September 30, 2022, Mars had $72,587,820 and $0 held in the Trust Account, respectively.\nEmerging growth company\nMars is an emerging growth company, as defined in Section 2(a) of the Securities Act of 1933, as amended, (the Securities Act), as modified by the Jumpstart our Business Startups Act of 2012, (the JOBS Act), and it may take advantage of certain exemptions from various reporting requirements that are applicable to other public companies that are not emerging growth companies including, but not limited to, not being required to comply with the auditor attestation requirements of Section 404 of the Sarbanes-Oxley Act, reduced disclosure obligations regarding executive compensation in its periodic reports and proxy statements, and exemptions from the requirements of holding a nonbinding advisory vote on executive compensation and shareholder approval of any golden parachute payments not previously approved.\nFurther, section 102(b)(1) of the JOBS Act exempts emerging growth companies from being required to comply with new or revised financial accounting standards until private companies (that is, those that have not had a Securities Act registration statement declared effective or do not have a class of securities registered under the Securities Act) are required to comply with the new or revised financial accounting standards. The JOBS Act provides that a company can elect to opt out of the extended transition period and comply with the requirements that apply to non-emerging growth companies but any such election to opt out is irrevocable. Mars has elected not to opt out of such extended transition period which means that when a standard is issued or revised and it has different application dates for public or private companies, Mars, as an emerging growth company, can adopt the new or revised standard at the time private companies adopt the new or revised standard. This may make comparison of Mars financial statements with another public company which is neither an emerging growth company nor an emerging growth company which has opted out of using the extended transition period difficult or impossible because of the potential differences in accountant standards used.\nUse of estimates\nThe preparation of financial statements in conformity with GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statement.\nMaking estimates requires management to exercise significant judgment. It is at least reasonably possible that the estimate of the effect of a condition, situation or set of circumstances that existed at the date of the financial statement, which management considered in formulating its estimate, could change in the near term due to one or more future confirming events. Accordingly, the actual results could differ significantly from those estimates.\nOrdinary shares subject to possible redemption\nThe Company accounts for its Ordinary Shares subject to possible redemption in accordance with the guidance in Accounting Standards Codification (ASC) Topic 480 Distinguishing Liabilities from Equity. Conditionally redeemable Ordinary Shares (including Ordinary Shares that feature redemption rights that are either within the control of the holder or subject to redemption upon the occurrence of uncertain events not solely within the Companys control) are classified as temporary equity. The Companys Public Shares feature certain redemption rights that are considered to be outside of the Companys control and subject to occurrence of uncertain future events. Accordingly, as of September 30, 2023, Ordinary Shares subject to possible redemption are presented at redemption value of $10.52 per share as temporary equity, outside of the shareholders equity section of the Companys balance sheet. The Company recognizes changes in redemption value immediately as they occur and adjusts the carrying value of redeemable Ordinary Shares to equal the redemption value at the end of each reporting period. Increases or decreases in the carrying amount of redeemable Ordinary Shares are affected by charges against additional paid in capital or retained earnings (accumulated deficit) if additional paid in capital equals to zero.\nOffering costs associated with the Initial Public Offering\nMars complies with the requirements of the Financial Accounting Standard Board (the FASB) ASC 340-10-S99-1 and SEC Staff Accounting Bulletin Topic 5A - Expenses of Offerings. Offering costs, consist of legal, accounting, underwriting fees and other costs incurred through the balance sheet date that are directly related to the Initial Public Offering, were charged to shareholders equity upon the completion of the Initial Public Offering.\nMars allocates offering costs between Public Shares, public warrants and public rights based on the estimated fair values of them at the date of issuance.\nDeferred offering costs\nDeferred offering costs consist of costs incurred in connection with preparation for the Initial Public Offering. These costs, together with the underwriting discounts and commissions, were be charged to additional paid in capital upon completion of the Initial Public Offering. As of September 30, 2022, Mars had deferred offering costs of $205,260. Upon consummation of the IPO on February 16, 2023, total offering costs related to the IPO were $4,398,891, and were allocated between the Public Shares and public rights based on their relative fair values at the date of issuance. Accordingly, $2,724,927 was allocated to the Public Shares and charged to temporary equity (see Note 3).\nIncome taxes\nMars complies with the accounting and reporting requirements of ASC Topic 740, Income Taxes, which requires an asset and liability approach to financial accounting and reporting for income taxes. Deferred income tax assets and liabilities are computed for differences between the financial statement and tax bases of assets and liabilities that will result in future taxable or deductible amounts, based on enacted tax laws and rates applicable to the periods in which the differences are expected to affect taxable income. Valuation allowances are established, when necessary, to reduce deferred tax assets to the amount expected to be realized.\nASC Topic 740 prescribes a recognition threshold and a measurement attribute for the financial statement recognition and measurement of tax positions taken or expected to be taken in a tax return. For those benefits to be recognized, a tax position must be more-likely-than-not to be sustained upon examination by taxing authorities.\nMars management determined that the Cayman Islands is the Mars only major tax jurisdiction. There is currently no taxation imposed on income by the Government of the Cayman Islands. In accordance with Cayman income tax regulations, income taxes are not levied on Mars. Consequently, income taxes are not reflected in the Mars financial statement. Mars management does not expect that the total amount of unrecognized tax benefits will materially change over the next twelve months.\nNet income (loss) per share\nMars complies with accounting and disclosure requirements of ASC Topic 260, Earnings Per Share. Net income (loss) per share is computed by dividing net loss by the weighted average number of Ordinary Shares outstanding during the period. Mars applies the two-class method in calculating income (loss) per ordinary share. At September 30, 2023 and September 30, 2022, Mars did not have any dilutive securities and other contracts that could, potentially, be exercised or converted into shares of Ordinary Shares and then shares in the earnings of Mars. As a result, diluted income (loss) per share is the same as basic income (loss) per share for the periods presented.\nThe following tables reflect the calculation of basic and diluted net income (loss) per ordinary share (in dollars, except per share amounts):\nFor the years ended September 30,\nOrdinary\nOrdinary\nOrdinary\nShares\nShares Not\nShares Not\nSubject to\nSubject to\nSubject to\nRedemption\nRedemption\nRedemption\nBasic and diluted net income (loss) per share\nNumerator:\nAllocation of net income (loss)\n$\n1,137,785\n$\n548,453\n$\n(2,718)\nDenominator\nBasic and diluted weighted average shares outstanding\n4,272,329\n2,059,414\n1,472,603\nBasic and diluted net income per share\n$\n0.27\n$\n0.27\n$\n(0.00)\nFair value of financial instruments\nSee Note 8 for discussion of short-term marketable securities. The fair value of Mars assets and liabilities, which qualify as financial instruments under ASC Topic 820, Fair Value Measurements and Disclosures, approximates the carrying amounts represented in the accompanying balance sheet, primarily due to their short-term nature.\nFair value is defined as the price that would be received for sale of an asset or paid to transfer of a liability, in an orderly transaction between market participants at the measurement date. US GAAP establishes a three-tier fair value hierarchy, which prioritizes the inputs used in measuring fair value. The hierarchy gives the highest priority to unadjusted quoted prices in active markets for identical assets or liabilities (Level 1 measurements) and the lowest priority to unobservable inputs (Level 3 measurements). These tiers include:\n● Level 1, defined as observable inputs such as quoted prices (unadjusted) for identical instruments in active markets;\n● Level 2, defined as inputs other than quoted prices in active markets that are either directly or indirectly observable such as quoted prices for similar instruments in active markets or quoted prices for identical or similar instruments in markets that are not active; and\n● Level 3, defined as unobservable inputs in which little or no market data exists, therefore requiring an entity to develop its own assumptions, such as valuations derived from valuation techniques in which one or more significant inputs or significant value drivers are unobservable.\nRecent accounting pronouncements\nManagement does not believe that any other recently issued, but not yet effective, accounting pronouncements, if currently adopted, would have an effect on the Mars financial statement.\nConcentration of credit risk\nFinancial instruments that potentially subject Mars to concentration of credit risk consist of cash accounts in a financial institution which, at times may exceed the federal depository insurance coverage of $250,000. Mars has not experienced losses on these accounts and management believes Mars is not exposed to significant risks on such accounts.\nNOTE 3 - INITIAL PUBLIC OFFERING\nOn February 16, 2023, Mars consummated its Initial Public Offering of 6,900,000 Units, including 900,000 Units that were issued pursuant to the underwriters full exercise of their over-allotment option. The Units were sold at a price of $10.00 per Unit, generating gross proceeds to Mars of $69,000,000.\nEach Unit consists of one ordinary share and one right to receive two-tenths (2/10) of one ordinary share upon consummation of our initial Business Combination (Right). The holder must hold Rights in multiples of 5 in order to receive shares for all of their Rights upon closing of a Business Combination (see Note 7).\nAll of the 6,900,000 public shares sold as part of the public Units in the Initial Public Offering contain a redemption feature which allows for the redemption of such public shares if there is a stockholder vote or tender offer in connection with the Business Combination and in connection with certain amendments to Mars amended and restated certificate of incorporation, or in connection with Mars liquidation. In accordance with the SEC and its staffs guidance on redeemable equity instruments, which has been codified in ASC 480-10-S99, redemption provisions not solely within the control of Mars require Ordinary Shares subject to redemption to be classified outside of permanent equity.\nAs of September 30, 2023, the Ordinary Shares subject to possible redemption reflected on the balance sheet are reconciled in the following table.\nGross proceeds\n$\n69,000,000\nProceeds allocated to public rights\n(876,833)\nOffering costs allocated to Ordinary Shares subject to possible redemption\n(3,965,620)\nRemeasurement of Ordinary Shares subject to possible redemption\n8,430,273\nOrdinary shares subject to possible redemption\n$\n72,587,820\nNOTE 4 - PRIVATE PLACEMENT\nOn February 16, 2023, Mars sold 391,000 Private Placement Units, including 36,000 Private Placement Units that were issued pursuant to the underwriters full exercise of the over-allotment option, at $10.00 per Unit, generating gross proceeds of $3,910,000 in the Private Placement. The proceeds from the Private Placement were added to the proceeds from the Initial Public Offering held in the Trust Account. Mars will have until 12 months (or 18 months as applicable) from the closing of this Initial Public Offering to consummate a Business Combination (the Combination Period). If Mars does not complete a Business Combination within the Combination Period, the Rights contained within the Private Placement Units will expire worthless.\nNOTE 5 - RELATED PARTY TRANSACTIONS\nFounder shares\nDuring the period ended September 30, 2021, Mars issued 1,000,000 shares to the Sponsor at par value (Founder Shares). On October 20, 2021, Mars issued an additional 138,500 Founder Shares to the Sponsor to bring the aggregate owned by the Sponsor up to 1,138,500 Founder Shares. On the same day, Mars issued 586,500 Founder Shares to officers and directors of Mars. As of September 30, 2023, and September 30, 2022, there were 1,725,000 Founder Shares outstanding.\nMars initial shareholders have agreed not to transfer, assign, or sell any of their Founder Shares until the earlier to occur of: (i) six months after the date of the consummation of our initial Business Combination; or (ii) the date on which Mars consummates a liquidation, merger, stock exchange, or other similar transaction that results in all of our shareholders having the right to exchange their shares for cash, securities, or other property. Any permitted transferees will be subject to the same restrictions and other agreements of our initial shareholders with respect to any Founder Shares. Notwithstanding the foregoing, if the closing price of our Ordinary Shares equals or exceeds $12.00 per share (as adjusted for stock splits, stock dividends, reorganizations, recapitalization, and the like) for any 20 trading days within any 30-trading day period commencing 60 days after our initial Business Combination, the Founder Shares will no longer be subject to such transfer restrictions.\nNote payable\nMars Sponsor had agreed to loan Mars up to $300,000 to be used for the payment of costs related to the Initial Public Offering (the Note). The Note was non-interest bearing, unsecured, and was due on the closing of the Initial Public Offering. As of September 30, 2022, the outstanding balance of note payable to the affiliate was $228,246, and no interest was accrued. As of February 16, 2023, the Sponsor agreed to apply the Note in its entirety to the Private Placement with Mars, and the note was extinguished.\nWorking capital loans\nIn order to finance transaction costs in connection with a Business Combination, the Sponsor or an affiliate of the Sponsor or certain of Mars directors and officers may, but are not obligated to, loan Mars funds as may be required (Working Capital Loans). If Mars completes a Business Combination, Mars would repay the Working Capital Loans out of the proceeds of the Trust Account released to Mars. Otherwise, the Working Capital Loans would be repaid only out of funds held outside the Trust Account. In the event that a Business Combination does not close, Mars may use a portion of proceeds held outside the Trust Account to repay the Working Capital Loans, but no proceeds held in the Trust Account would be used to repay the Working Capital Loans. Except for the foregoing, the terms of such Working Capital Loans, if any, have not been determined and no written agreements exist with respect to such loans. The Working Capital Loans would either be repaid upon consummation of a Business Combination, without interest, or, at the lenders discretion, up to $1,500,000 of such Working Capital Loans may be convertible into Units of the post-Business Combination entity at a price of $10.00 per Unit. The Units would be identical to the Private Placement Units.\nAdministrative service fee\nMars initially had an informal agreement (the Administrative Services Agreement) to pay affiliates of the Sponsor for office space, utilities, secretarial, and administrative support of $15,000 per month which was paid through May 2023 for a total of $60,000 during the year ended September 30, 2023. Subsequent to May 2023, we have not paid any amounts under this informal agreement and the affiliates have chosen not to seek compensation for such support.\nNOTE 6 - COMMITMENTS AND CONTINGENCIES\nRegistration rights\nThe holders of the Founder Shares and Private Placement Units are entitled to registration rights pursuant to a registration rights agreement signed February 16, 2023. The holders of these securities are entitled to make up to three demands, excluding short form demands, that Mars register such securities. In addition, the holders have certain piggy-back registration rights with respect to registration statements filed subsequent to the consummation of a Business Combination. Mars will bear the expenses incurred in connection with the filing of any such registration statements.\nUnderwriting agreement\nMars had engaged Maxim Group LLC (Maxim) as its underwriter. Mars granted the underwriters a 45-day option until March 26, 2023 to purchase up to 900,000 additional Units to cover over-allotments, if any, at the Initial Public Offering price less the underwriting discounts and commissions. On February 16, 2023, the underwriters fully exercised this option in respect of 900,000 Units.\nThe underwriters were entitled to an underwriting discount of $0.20 per Unit, or $1,380,000 in the aggregate, which was paid upon the closing of the Initial Public Offering.\nRepresentative shares\nMars has issued to Maxim and/or its designees, 276,000 shares of Ordinary Shares upon the consummation of the Initial Public Offering (the Representative Shares). Mars accounted for the Representative Shares as an offering cost associated with the Initial Public Offering, with a corresponding credit to shareholders equity. Mars estimated the fair value of the Representative Shares to be $2,724,927. Maxim has agreed not to transfer, assign, or sell any such shares until the completion of the Business Combination. In addition, Maxim has agreed: (i) to waive its redemption rights with respect to such shares in connection with the completion of the Business Combination; and (ii) to waive its rights to liquidating distributions from the Trust Account with respect to such shares if Mars fails to complete its Business Combination within 12 months (or 18 months, as applicable) from the closing of the Initial Public Offering.\nThe shares have been deemed compensation by FINRA and were therefore subject to a lock-up for a period of 180 days immediately following the date of the effectiveness of the registration statement of which this prospectus forms a part pursuant to Rule 5110(e)(1) of FINRAs NASD Conduct Rules. Pursuant to FINRA Rule 5110(e)(1), these securities were not to be the subject of any hedging, short sale, derivative, put, or call transaction that would result in the economic disposition of the securities by any person prior to August 8, 2023, nor were they sold, transferred, assigned, pledged, or hypothecated prior to August 8, 2023 except to any underwriter and selected dealer participating in the offering and their bona fide officers or partners.\nSubject to certain conditions, Mars granted Maxim, for a period beginning on February 16, 2023 and ending 12 months after the date of the consummation of the Business Combination, a right of first refusal to act as book-running managing underwriter or placement agent for any and all future public and private equity, equity-linked, convertible and debt offerings for Mars or any of its successors or subsidiaries. In accordance with FINRA Rule 5110(g)(6), such right of first refusal shall not have a duration of more than three years from February 9, 2023.\nBusiness Combination Agreement\nOn September 5, 2023, Mars entered into a Business Combination Agreement (the Business Combination Agreement) with ScanTech AI Systems Inc., a Delaware corporation and a wholly owned subsidiary of Mars (Pubco), Mars Merger Sub I Corp., a Cayman Islands exempted company and a wholly owned subsidiary of Mars (Purchaser Merger Sub), Mars Merger Sub II LLC, a Delaware limited liability company and a wholly owned subsidiary of Pubco (Company Merger Sub), ScanTech Identification Beam Systems, LLC, a Delaware limited liability company (ScanTech), and Dolan Falconer in the capacity as the representative (the Seller Representative). The aggregate consideration to be paid to ScanTech shall be a number of shares of Pubco Common Stock with an aggregate value equal to one hundred ten million U.S. Dollars ($110,000,000) minus the closing net debt as set forth in the Business Combination Agreement. Additionally, after the Closing, subject to the terms and conditions set forth in the Business Combination Agreement, the ScanTech Holder Participants will have the contingent right to receive up to a number of shares of Pubco Common Stock equal to ten percent (10%) of the fully diluted shares of Pubco Common Stock outstanding immediately following the Closing (subject to adjustment based on stock splits and similar events) based on Pubcos achievement of certain milestones, including commercial milestones and revenue and EBITDA milestones, as more particularly set forth in the Business Combination Agreement.\nThe Closing is subject to certain customary conditions. For a more detailed description of the Business Combination Agreement and the transactions contemplated therein, see Mars Current Report on Form 8-K filed with the SEC on September 8, 2023 (the Form 8-K).\nNOTE 7 - SHAREHOLDERS EQUITY\nOrdinary Shares  -  Mars is authorized to issue 800,000,000 Ordinary Shares with a par value of  $0.000125 per share. Holders of Mars Ordinary Shares are entitled to one vote for each share. As of September 30, 2023 and September 30, 2022, there were 2,392,000 and 1,725,000 Ordinary Shares outstanding, respectively.\nRights - Each holder of a Right will automatically receive two-tenths (2/10) of one share of Ordinary Shares upon consummation of a Business Combination, except in cases where Mars not the surviving company in a Business Combination, and even if the holder of such Right redeemed all shares of Ordinary Shares held by it in connection with a Business Combination. No additional consideration will be required to be paid by a holder of a Right in order to receive its additional shares upon consummation of a Business Combination, as the consideration related thereto has been included in the Unit purchase price paid for by investors in the Initial Public Offering. If Mars enters into a definitive agreement for a Business Combination in which Mars will not be the surviving entity, the definitive agreement will provide for the holders of Right to receive the same per share consideration the holders of shares of Ordinary Shares will receive in the transaction on an as-exchanged for Ordinary Shares basis, and each holder of a Right will be required to affirmatively exchange its Rights in order to receive the 2/10 share underlying each Right (without paying any additional consideration) upon consummation of a Business Combination. More specifically, the Rights holder will be required to indicate its election to exchange the Right for the underlying shares within a fixed period of time after which period the Rights will expire worthless.\nPursuant to the Rights agreement, a Rights holder may exchange Rights only for a whole number of shares of Ordinary Shares. This means that Mars will not issue fractional shares in connection with an exchange of Rights, and Rights may be exchanged only in multiples of 5 Rights (subject to adjustment for stock splits, stock dividends, reorganizations, recapitalization and the like). Fractional\nshares will either be rounded down to the nearest whole share or otherwise addressed in accordance with the applicable provisions of the Cayman Islands Law.\nIf Mars is unable to complete a Business Combination within the Combination Period and Mars liquidates the funds held in the Trust Account, holders of Rights will not receive any such funds with respect to their Rights, nor will they receive any distribution from Mars assets held outside of the Trust Account with respect to such Rights, and the Rights will expire worthless. Further, there are no contractual penalties for failure to deliver securities to holders of the Rights upon consummation of a Business Combination. Additionally, in no event will Mars be required to net cash settle the Rights. Accordingly, the Rights may expire worthless.\nNOTE 8 - FAIR VALUE MEASUREMENTS\nThe following table presents information about the Mars assets that are measured at fair value on a recurring basis at September 30, 2023 and indicates the fair value hierarchy of the valuation inputs Mars utilized to determine such fair value:\nDescription\nLevel\nSeptember 30, 2023\nSeptember 30, 2022\nAssets:\nMarketable securities held in Trust Account\n$\n72,587,820\n$\n-\nExcept for the foregoing, Mars does not have any assets measured at fair value on a recurring basis at September 30, 2023 and September 30, 2022, respectively.\nNOTE 9 - SUBSEQUENT EVENTS\nMars evaluated subsequent events and transactions that occurred after the balance sheet date, up to the date that the financial statements were issued. Mars did not identify any subsequent events that would have required adjustment or disclosure in the financial statements.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Act of 1934, the registrant has duly caused this Annual Report on Form 10-K to be signed on its behalf by the undersigned, thereunto duly authorized.\nDate: December 28, 2023\nMars Acquisition Corp.\nBy:\n/s/ Karl Brenza\nName:\nKarl Brenza\nTitle:\nChief Executive Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this Annual Report on Form 10-K has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nName\nPosition\nDate\n/s/ Karl Brenza\nChief Executive Officer\n(Principal Executive Officer) and Director\nDecember 28, 2023\nKarl Brenza\n/s/ Karl Brenza\nChief Financial Officer\n(Principal Financial and Accounting Officer)\nDecember 28, 2023\nKarl Brenza\n/s/ Xiaochen (Iris) Zhao\nChief Operating Officer\nDecember 28, 2023\nXiaochen (Iris) Zhao\n/s/ Shanchun Huang\nChairman\nDecember 28, 2023\nShanchun Huang\n/s/ Yenyou (Jeff) Zheng\nIndependent Director\nDecember 28, 2023\nYenyou (Jeff) Zheng\n/s/ James Jenkins\nIndependent Director\nDecember 28, 2023\nJames Jenkins\n/s/ Yang (Sean) Liu\nIndependent Director\nDecember 28, 2023\nYang (Sean) Liu\n/s/ Xin (Adam) He\nIndependent Director\nDecember 28, 2023\nXin (Adam) He"
}