{
    "cik": "1905956",
    "company": "TREASURE GLOBAL INC",
    "filing_type": "10-K",
    "filing_date": "2022-12-05",
    "period_of_report": "2022-06-30",
    "sic": "7389",
    "state_of_inc": "DE",
    "state_location": "NY",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1905956/0001575872-22-001246-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1905956/000157587222001246/tgl-20220630.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1905956/0001575872-22-001246.txt",
    "filename": "1905956_10K_2022_0001575872-22-001246.htm",
    "content": "Item 1.\nBusiness Item 1A.\nRisk Factors Item 1B.\nUnresolved Staff Comments\nNone. Item 2. Properties.\nOur principal executive offices are located at 276 5th Avenue, Suite 704 #739, New York, New York 10001 and\nNo.29, Jalan PPU 2A, Taman Perindustrian Pusat Bandar Puchong, 47100 Puchong, Selangor, Malaysia.\nWe lease and maintain our offices, and we\ncurrently do not own any real estate. Item 3. Legal Proceedings\nWe may be subject to legal disputes and subject to claims that arise in the ordinary course of business. We are not a party or subject to any pending legal proceedings the resolution of which is expected to have a material adverse effect on our business, operating results, cash flows or financial condition. Item 4. Mine Safety Disclosures\nNot applicable.\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities.\nMarket Information\nOur common stock is trading on the Nasdaq Capital Market under the symbol TGL.\nHolders\nAs\nof December 1, 2022, there were 26 stockholders of record of our common stock. Because many of our shares of common stock are held by brokers and other institutions on behalf of stockholders, this number is not representative of the total number of beneficial owners of our stock.\nDividends\nWe have never declared or paid any cash dividend on our common stock. We intend to retain any future earnings to finance the operation and expansion of our business and fund our share repurchase program, and we do not expect to pay cash dividends in the foreseeable future.\nSecurities Authorized for Issuance under Equity Compensation Plans\nWe have not adopted any equity compensation plans and do not anticipate adopting any equity compensation plans in the near future. Notwithstanding the foregoing, because the Company has limited cash resources at this time, it may issue shares or options to or enter into obligations that are convertible into shares of common stock with its employees and consultants as payment for services or as discretionary bonuses.\nRecent Sales of Unregistered Securities\nDuring the fiscal year ended June 30, 2022, the registrant has granted or issued the following securities of the registrant that were not registered under the Securities Act, as amended.\n(a) Issuance of Capital Stock\n.\nOn July 1, 2021, we issued 232,666 shares of our common stock to Exchange Listing LLC pursuant a consulting agreement.\nOn October 27, 2021, we issued 312,585 shares of our common stock to three individuals pursuant to a Share Swap Agreement, as amended in consideration for all of the equity of Gem Reward Sdn. Bhd.\nThe issuance of the capital stock listed above was deemed exempt from registration under Section 4(a)(2) of the Securities Act or Regulation D promulgated thereunder in that the issuance of securities were made to an accredited investor and did not involve a public offering. The recipient of such securities represented its intention to acquire the securities for investment purposes only and not with a view to or for sale in connection with any distribution thereof.\n(b) Warrants\n.\nOn July 1, 2021, we issued a five-year warrant to purchase 300,000 shares of our common stock to Exchange Listing, LLC pursuant to a consulting agreement dated July 1, 2021 between us and Exchange Listing, LLC. The warrant has an exercise price of $4.00 per share.\nThe issuance of the warrants listed above were deemed exempt from registration under Section 4(a)(2) of the Securities Act or Regulation D promulgated thereunder in that the issuance of securities were made to an accredited investor and did not involve a public offering. The recipient of such securities represented its intention to acquire the securities for investment purposes only and not with a view to or for sale in connection with any distribution thereof.\n(c) Option Grants\n.\nNone.\n(d) Issuance of Notes\n.\nOn July 10, 2021 we issued a Convertible Redeemable Note in the principal amount of $36,879.00 to Tan Ann Bee, an existing stockholder of the Company (the Bee Note). The Bee Note was due on the third anniversary of the issuance date and does not bear interest unless it has not been converted by the third anniversary of its issuance date, in which case it shall bear interest from the time of issuance at 12% per annum. The Bee Note is prepayable at any time. On June 30, 2021, the Securities Purchase Agreement related to the Bee Note was executed and on such date the Company received $36,879.00 for the purchase of the Bee Note. On August 11, 2022, we converted the Bee Note in full into 5,344 shares of our common stock.\nOn July 29, 2021 we issued a Convertible Redeemable Note in the principal amount of $236,462.52 to Kainan Resources Sdn Bhd, a Malaysian private limited company (the Kainan Note 2). The Kainan Note 2 was due on the third anniversary of the issuance date and does not bear interest unless it has not been converted by the third anniversary of its issuance date, in which case it shall bear interest from the time of issuance at 12% per annum. The Kainan Note 2 is prepayable at any time. On August 11, 2022, we converted the Kainan Note 2 in full into 34,270 shares of our common stock.\nOn September 22, 2021 we issued a Convertible Redeemable Note in the principal amount of $240,442.41 to Chuah Su Mei, an existing stockholder of the Company (the Chuah Note). The Chuah Note was due on the third anniversary of the issuance date and does not bear interest unless it has not been converted by the third anniversary of its issuance date, in which case it shall bear interest from the time of issuance at 12% per annum. On August 11, 2022, we converted the Chuah Note in full into 34,847 shares of our common stock.\nOn October 20, 2021 we issued a Convertible Redeemable Note in the principal amount of $120,235.66 to Click Development Berhad, a Malaysian company and an existing stockholder of the Company (the Click Note), also related party per Note 10 in the consolidated financial statements. The Click Note was due on the third anniversary of the issuance date and does not bear interest unless it has not been converted by the third anniversary of its issuance date, in which case it shall bear interest from the time of issuance at 12% per annum. The Click Note is prepayable at any time. On August 11, 2022, we converted the Click Note in full into 17,425 shares of our common stock.\nOn November 4, 2021 we issued a Convertible Redeemable Note in the principal amount of $120,555.15 to Whitney Tan Ann Nee , an existing stockholder of the Company (the Whitney Nee Note). The Whitney Nee Note was convertible by the Company in full, but not in part, into 17,472 shares of our common stock and such conversion is mandatory upon the listing of our shares of common stock on Nasdaq. The Whitney Nee Note is due on the third anniversary of the issuance date and does not bear interest unless it has not been converted by the third anniversary of its issuance date, in which case it shall bear interest from the time of issuance at 12% per annum. The Whitney Nee Note is prepayable at any time. On August 11, 2022, we converted the Whitney Nee Note in full into 17,472 shares of our common stock.\nOn November 4, 2021 we issued a Redeemable Convertible Note in the principal amount of $1,013,106.38 to Repro Solution Sdn Bhd, a Malaysian private limited company and an existing stockholder of the Company (the Repro Note 2). The Repro Note 2 is convertible by the Company in full, but not in part, into 146,827 shares of our common stock and such conversion is mandatory upon the listing of our shares of common stock on Nasdaq. The Repro Note 2 is due on the third anniversary of the issuance date and does not bear interest unless it has not been converted by the third anniversary of its issuance date, in which case it shall bear interest from the time of issuance at 12% per annum. The Repro Note 2 is prepayable at any time. On August 11, 2022, we converted the Repro Note 2 in full into 146,827 shares of our common stock.\nOn November 5, 2021 we issued a Convertible Redeemable Note in the principal amount of $108,590.73 to World Cloud Ventures Sdn Bhd, a Malaysian private company and an existing stockholder of the Company (the World Cloud Note, also related party per Note 10 in the consolidated financial statements The World Cloud Note was due on the third anniversary of the issuance date and does not bear interest unless it has not been converted by the third anniversary of its issuance date, in which case it shall bear interest from the time of issuance at 12% per annum. The World Cloud Note is prepayable at any time. Jau Long Jerry Ooi, a Vice President of the Company owns 50% of the equity of World Cloud Ventures Sdn. Bhd. On August 11, 2022, we converted the World Cloud Note in full into 15,738 shares of our common stock.\nOn January 3, 2022 we issued a Convertible Redeemable Note in the principal amount of $568,308.87 to Cloudmaxx Sdn Bhd, a Malaysian private company (the Cloudmaxx Note), also related party per Note 10 in the consolidated financial statements The Cloudmaxx Note was due on the third anniversary of the issuance date and does not bear interest unless it has not been converted by the third anniversary of its issuance date, in which case it shall bear interest from the time of issuance at 12% per annum. Jau Long Jerry Ooi, a Vice President of the Company owns 30% of the equity of Cloudmaxx Sdn. Bhd. On August 11, 2022, we converted the Cloudmaxx Note in full into 82,363 shares of our common stock.\nOn January 3, 2022 we entered into a Loan Agreement (the Tophill Loan Agreement 1) with Tophill Holding Sdn. Bhd (Tophill), pursuant to which Tophill provided us with a revolving loan facility to borrow up to RM 20,000,000 (approximately $4,800,000) at 3.5% per annum, which is payable on demand. On March 15, 2022 the Tophill Loan Agreement 1 was amended to provide that (i) all principal and accrued and unpaid interest outstanding under the Tophill Loan Agreement 1 on the closing of our initial public offering will automatically be converted into shares of our common stock at a conversion price that is equal to 80% of the initial public offering price and (ii) the Tophill Loan Agreement 1 terminates on the closing date of our initial public offering.\nOn May 13, 2022 we entered into an additional Loan Agreement (the Tophill Loan Agreement 2) with Tophill, pursuant to which Tophill provided us with a revolving loan facility to borrow up to RM 50,000,000 (approximately $11,900,000) with terms that are identical to the Tophill Loan Agreement 1, as amended.\nThe notes and loan described above was deemed exempt from registration in reliance on Section 4(a)(2) of the Securities Act or Regulation D promulgated thereunder in that the issuance of securities were made to an accredited investor and did not involve a public offering. The recipients of such securities represented its intention to acquire the securities for investment purposes only and not with a view to or for sale in connection with any distribution thereof.\nUse of Proceeds from our Initial Public Offering of Common Stock\nOn August 15, 2022, we closed our initial public offering, in which we sold and issued 2,300,000 shares of our common stock at a price to the public of $4.00 per share. We received $8,235,109.74 in net proceeds from our IPO after deducting underwriting discounts and commissions and other offering expenses.\nThe offer and sale of all of the shares of our common stock in our IPO were registered under the Securities Act pursuant to a registration statement on Form S-1 (File No. 333-264364), which was declared effective by the SEC on August 10, 2022.\nThere has been no material change in our planned use of the net proceeds from our IPO as described in our final prospectus filed pursuant to Rule 424(b)(4) under the Securities Act with the SEC on August 12, 2022.\nTransfer Agent\nThe transfer agent for the common stock is VStock Transfer LLC,\n18 Lafayette Place, Woodmere, New York, telephone\n(212) 828-8436. Item 6.\nThe Company is a smaller reporting company as defined by Rule 12b-2 of the Exchange Act and is not required to provide the information required under this item. Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations.\nThe following discussion and analysis of our results of operations and financial condition should be read together with our consolidated financial statements and the notes thereto and other financial information, which are included elsewhere in this Report.\nThis discussion contains forward-looking statements that involve risks and uncertainties. Factors that could cause or contribute to such differences include those identified below and those discussed in other sections of this Annual Report on Form 10-K. Our historical results are not necessarily indicative of the results that may be expected for any period in the future. Our financial statements have been prepared in accordance with U.S. GAAP. In addition, our financial statements and the financial information included in this Report reflect our organizational transactions and have been prepared as if our current corporate structure had been in place throughout the relevant periods.\nOverview\nTreasure Global Inc. (TGI, we, our, or the Company) is a holding company incorporated on March 20, 2020, under the laws of the State of Delaware. TGI has no substantive operations other than holding all of the outstanding shares of Gem Reward Sdn. Bhd. (GEM), which was established under the laws of the Malaysia on June 6, 2017, through a reverse recapitalization.\nPrior to March 11, 2021, TGI and GEM were separate companies under the common control of\nKok Pin Darren Tan, which resulted from Mr. Tans prior 100% ownership of TGI and his prior 100% voting and investment control over GEM pursuant to the Beneficial Shareholding Agreements. For a more detailed description of the Beneficial Shareholding Agreements and Mr. Tans common control over TGI and GEM see Prospectus Summary-Corporate Structure.\nOn March 11, 2021, TGI and GEM were reorganized into a parent subsidiary structure pursuant to the Share Swap Agreement in which TGI exchanged the Swap Shares for all equity of GEM. Pursuant to the Share Swap Agreement, the purchase and sale of the Swap Shares was completed on March 11, 2021, but the issuance of the Swap Shares did not occur until October 27, 2021 when TGI amended its certificate of incorporation to increase the number of its authorized common stock to a number that was sufficient to issue the Swap Shares. As a result of the Share Swap Agreement, (i) GEM became the 100% subsidiary of TGI and Kok Pin Darren Tan no longer had any control over the GEM ordinary shares and (ii) Kok Pin Darren Tan, the Initial GEM Shareholders and Chong Chan Sam Teo owned 100% of the shares of TGI common stock (Kok Pin Darren Tan owning approximately 97%). Subsequent to the date of the Share Swap Agreement, Kok Pin Darren Tan transferred 9,529,002 of his 10,000,000 shares of TGI common stock to 16 individuals and entities and currently owns less than 5% of our common stock.\nOn August 15, 2022, we had closed our initial underwritten public offering of 2,300,000 shares of common stock, par value $0.00001 per share, at $4.00 per share. Meanwhile we received net proceeds of approximately $8.2 million, net of underwriting discounts and commissions and fees, and other estimated offering expenses amounted to approximately $1.0 million.\nWe have created an innovative O2O e-commerce platform business model offering consumers and merchants instant rebates and affiliate cashback programs, while providing a seamless e-payment solution with rebates in both e-commerce (i.e., online) and physical retailers/merchant (i.e., offline) settings.\nOur proprietary product is an App branded ZCITY App, which was developed through GEM. The ZCITY App was successfully launched in Malaysia June 2020. GEM is equipped with the know-how and expertise to develop additional/add-on technology-based products and services to complement the ZCITY App, thereby growing its reach and user base.\nThrough simplifying a users e-payment gateway experience, as well as by providing great deals, rewards and promotions with every use, we aim to make the ZCITY App Malaysias top reward and loyalty platform. Our longer-term goal is for the ZCITY App and its ever-developing technology to become one of the most well-known commercialized applications more broadly in Southeast Asia and Japan.\nAs of December 5, 2022, we had over 2,312,114registered users and over 1,998 registered merchants.\nSEA consumers have access to a plethora of smart ordering, delivery and loyalty websites and apps, but in our experience, SEA consumers very rarely receive personalized deals based on their purchases and behavior.\nThe ZCITY App targets consumer through the provision of personalized deals based on consumers purchase history, location and preferences. Our technology platform allows us to identify the spending trends of our customers (the when, where, why, and how much). We are able to offer these personalized deals through the application of our proprietary artificial intelligence (or AI) technology that scours the available database to identify and create opportunities to extrapolate the greatest value from the data, analyze consumer behavior and roll out attractive rewards-based campaigns for targeted audiences. We believe this AI technology is currently a unique market differentiator for the ZCITY App.\nWe operate our ZCITY App on the hashtag: #RewardsOnRewards. We believe this branding demonstrates to users the ability to spend ZCITY App-based Reward Points (or RP) and ZCITY Cash Vouchers with discount benefits at checkout. Additionally, users can earn rewards from selected e-Wallet or other payment methods.\nZCITY App users do not require any on-going credit top-up or need to provide bank card number with their binding obligations. We have partnered with Malaysias leading payment gateway, IPAY88, for secure and convenient transactions. Users can use our secure platform and enjoy cashless shopping experiences with rebates when they shop with e-commerce and retail merchants through trusted and leading e-wallet providers such as Touchn Go eWallet, Boost eWallet, GrabPay eWallet and credit card/online banking like the FPX (the Malaysian Financial Process Exchange) as well as more traditional providers such as Visa and Mastercard.\nKey Factors that Affect Operating Results\nWe believe the key factors affecting our financial condition and results of operations include the following:\nOur Ability to Create Value for Our Users and Generate Revenue\nOur ability to create value for our users and generate our revenues from merchants is driven by the factors described below:\n·\nNumber and volume of transactions completed by our consumers\n. Consumers are attracted to ZCITY by the breadth of personalized deals/rewards and the interactive user experience our platform offers. The number and volume of transaction completed by our member consumers is affected by our ability to continue to enhance and expand our product and service offerings and improve the user experience.\n·\nEmpowering data and technology.\nOur ability to engage our member consumers and empower our merchants and their brands is affected by the breadth and depth of our data insights, such as the accuracy of our members shopping preferences, and our technology capabilities and infrastructure, and our continued ability to develop scalable services and upgrade our platform user experience to adapt to the quickly evolving industry trends and consumer preferences.\nOur Investment in User Base, Technology, People and Infrastructure\nWe have made, and will continue to make, significant investments in our platform to attract consumers and merchants, enhance user experience and expand the capabilities and scope of our platform. We expect to continue to invest in our research and development team as well as in our technology capabilities and infrastructure, which will lower our margins but deliver overall long-term growth.\nImpact of the COVID-19 Pandemic\nThe current outbreak of COVID-19 has globally resulted in the loss of life, business closures, restrictions on travel, and widespread cancellation of social gatherings. The extent to which the COVID-19 pandemic impacts our business will depend on future developments, which are highly uncertain and cannot be predicted at this time, including:\n·\nnew information which may emerge concerning the severity of the disease in Southeast Asia (or SEA);\n·\nthe duration and spread of the outbreak;\n·\nthe severity of travel restrictions imposed by geographic areas in which we operate, mandatory or voluntary business closures;\n·\nregulatory actions are taken in response to the pandemic, including MCOs, which may impact merchant operations, consumer and merchant pricing, and our product offerings;\n·\nother business disruptions that affect our workforce;\n·\nthe impact on capital and financial markets; and\n·\naction taken throughout the world, including in markets in which we operate, to contain the COVID-19 outbreak or treat its impact.\nIn addition, the current outbreak of COVID-19 has resulted in a widespread global health crisis and adversely affected global economies and financial markets, and similar public health threats could do so in the future. Such events have impacted, and could in the future impact, demand for merchants and consumer purchase patterns, which in turn, could adversely affect our revenue and results of operations.\nSince the onset of the COVID-19 pandemic in March 2020, all our merchant clients have been affected by COVID-19 measures for Food and Beverage (F&B) as these measures temporarily stopped restaurant dine-ins.\n·\nSome of our restaurant clients ceased operations permanently and many were closed since June 2020 without any notice of reopening their business to date.\n·\nWe may face continuing challenges to onboard new merchant clients.\nWith the ongoing COVID-19 pandemic, we also face challenges in our operation as follows:\n·\ndisruptions of operations in SEA where staff have had to work from home;\n·\non ground Marketing Strategic for new users onboard, is even more difficult; and\n·\nmarketing events being delayed.\nThe pandemic, however, has also created more advantages for us as follows:\n·\nusage of e-wallet technology has widened and become more common to the general public, people prefer to go cashless and utilize the Scan and Pay features ZCITY offers;\n·\nour teams have transitioned from on-ground marketing strategies to digital marketing strategies in order to maintain and boost user recruitment;\n·\nduring the pandemic lockdown phases, our business operations have carried on without significant disruption even as most all of our employees work remotely; and\n·\nwe have taken advantage of the push to digitalization posture taken by the Malaysian government, by providing a platform and channel to meet users daily essential payment needs such as processing bill payments, online shopping vouchers, gaming pin and e-wallet top-up vouchers.\nIn this regard, ZCITY has acted as an aggregator payment gateway, but not a digital wallet itself. We believe the business model has further enhanced user experience and reliance and developed user loyalty to our platform. We have experienced a slow-down in hiring new personnel. We believe this is due to a downturn in the available human capital in the employment market generally in Malaysia. However, with the existing talents in the organization, everyone is playing their role to fulfil the business needs while waiting for the vacancies to be filled. We have a detailed plan to attract suitable talents to join us.\nThe spread of COVID-19 has caused us to modify our business practices, including employee travel, employee work locations in certain cases, and cancellation of physical participation in certain meetings, events and conferences and further actions may be taken as required or recommended by government authorities or as we determine are in the best interests of our employees, customers and other business partners. The pandemic period is challenging, yet ZCITY is able to generate more sales revenue through virtual meetings and training to our business partners and potential markets. We are monitoring the global outbreak of the pandemic in SEA.\nBecause of the uncertainty surrounding the COVID-19 outbreak, the financial impact related to the outbreak of and response to the COVID-19 cannot be reasonably estimated at this time.\nInflation\nAlthough Malaysia is experiencing a high inflation rate, we do not believe that inflation has had a material adverse effect on our business as of June 30, 2022, but we will continue to monitor the effects of inflation on our business in future periods.\nSupply Chain Disruptions\nAlthough there have been global supply chain disruptions as a result of the COVID-19 pandemic or Russias recent invasion of Ukraine that may have affected the operations of some of our online or offline merchants, these disruptions have not had a material adverse effect on our business as of June 30, 2022, but we will continue to monitor the effects of supply chain disruptions on our business in future periods.,\nKey Operating Metrics\nOur management regularly reviews a number of metrics to evaluate our business, measures our performance, identifies trends, formulates financial projections and makes strategic decisions. The main metrics we consider, and our results for each quarter during the years ended June 30, 2021 and 2022, are set forth in the table below:\nFor the quarters ended\nDecember 31,\nMarch 31,\nJune 30,\nSeptember 30,\nDecember 31,\nMarch 31,\nJune 30,\nNumber of new registered user(1)\n44,532\n281,470\n262,784\n245,582\n288,540\n364,218\n466,534\nNumber of active users(2)\n42,225\n300,270\n347,596\n362,805\n421,287\n448,247\n443,430\nNumber of new participating merchants\n(1) Registered are persons who have registered on the ZCITY App.\n(2) Active users are users who have logged into the ZCITY App at least once.\nAs of\nAs of\nAs of\nAs of\nAs of\nAs of\nAs of\nDecember 31,\nMarch 31,\nJune 30,\nSeptember 30,\nDecember 31,\nMarch 31,\nJune 30,\nAccumulated registered users\n58,868\n340,338\n603,122\n848,704\n1,137,244\n1,501,462\n1,967,996\nAccumulated Participating merchants\n1,635\n1,905\n1,949\n1,964\n1,978\n1,985\nWe have experienced substantial growth in registered users and active users since we launched ZCITY platform in June 2020. As of June 30, 2022, we recorded 1,967,996 registered users and 443,430 active users from ZCITY platform. Our average percentage of growth of register and active users throughout the quarter ended June 30, 2022 since the establishment of the ZCITY platform was approximately 143.4% and 283.8%, respectively. However, the average percentage of growth of registered and active users decreased in the last five quarters from June 30, 2022 which was a result of the resurgence of the COVID-19 outbreak and the imposition by the Malaysian Government of a Movement Control Order (MCO)\nin May and June of 2021 as the majority of our participating merchants are restaurant owners or service providers and required the spending from our participating members to be in person. Despite the negative impact of the COVID-19 resurgence, we expect our product and loyalty program revenue to continue to grow in 2022 and beyond as a growing proportion of the Malaysian population have been fully vaccinated\nand we expect to continue to attract more people to engage with our platform.\nWe continuously monitor the development and participation of active users as a proportion of its total registered user base to ensure the effectiveness of our marketing and feature implantation strategies. Accordingly, the proportion of total registered users that we consider active users at the end of each quarter is as follows:\nStarting\nEnding\nTotal\nregistered\nusers\nTotal active\nusers\nTotal active\nusers\nto total\nregistered\nusers\nJuly 1, 2020\nSeptember 30, 2020\n14,336\n2,945\n20.5\n%\nOctober 1, 2020\nDecember 31, 2020\n58,868\n42,225\n71.7\n%\nJanuary 1, 2021\nMarch 31, 2021\n340,338\n300,270\n88.2\n%\nApril 1, 2021\nJune 30, 2021\n603,122\n347,596\n57.6\n%\nJuly 1, 2021\nSeptember 30, 2021\n848,704\n362,805\n42.7\n%\nOctober 1, 2021\nDecember 31, 2021\n1,137,244\n421,287\n37.0\n%\nJanuary 1, 2022\nMarch 31, 2022\n1,501,462\n448,247\n29.8\n%\nApril 1, 2022\nJune 30, 2022\n1,967,996\n443,430\n22.5\n%\nWe continuously monitor the development of the churn and retention rates of the active user base. Active users churn rate is the percentage of customers who had stop subscribing in our platform while retention rate is the percentage of customers who is retained in our platform. Accordingly, our churn and retention rates of the active user base at the end of each quarter is as follows:\nStarting\nEnding\nTotal active\nusers\nNew active\nusers\n(registered\nwithin the\nquarter)\nExisting active\nusers\nActive\nusers\nchurn\nrate\nActive users\nretention\nrate\nJuly 1, 2020\nSeptember 30, 2020\n2,945\n2,879\nN/A\nN/A\nOctober 1, 2020\nDecember 31, 2020\n42,225\n41,142\n1,083\n63.3\n%\n36.7\n%\nJanuary 1, 2021\nMarch 31, 2021\n300,270\n281,432\n18,838\n55.4\n%\n44.6\n%\nApril 1, 2021\nJune 30, 2021\n347,596\n262,780\n84,816\n71.8\n%\n28.2\n%\nJuly 1, 2021\nSeptember 30, 2021\n362,805\n245,580\n117,225\n66.3\n%\n33.7\n%\nOctober 1, 2021\nDecember 31, 2021\n421,287\n288,536\n132,751\n63.4\n%\n36.6\n%\nJanuary 1, 2022\nMarch 31, 2022\n448,247\n361,143\n87,104\n78.5\n%\n21.5\n%\nApril 1, 2022\nJune 30, 2022\n443,430\n368,390\n75,040\n83.3\n%\n16.7\n%\nThe retention rate and churn rate for our active users are calculated as follows:\nRetention rate of active users for any quarter\n=\nExisting active users\nTotal active users in the past quarter\nChurn rate of active users for any quarter\n=\nTotal active users from past quarter minus current quarter existing active users\nTotal active users in the past quarter\nOver the last 21 months, we have used different strategies to build and maintain our users and increase their engagement. Initially, we focused on mass marketing strategies to attract registered users. Subsequently, we have shifted to a more targeted approach focused on increasing user engagement and user spending.\nResults of Operation\nFor the years ended June 30, 2022 and 2021\nRevenue\nOur breakdown of revenues by categories for the years ended June 30, 2022 and 2021, respectively, is summarized below:\nFor the Years Ended June 30,\nChange\n%\n%\n%\nProduct and loyalty program revenue\n$\n79,409,756\n99.7\n%\n$\n13,889,370\n99.1\n%\n471.8\n%\nTransaction revenue\n53,667\n0.1\n%\n30,562\n0.2\n%\n75.6\n%\nAgent subscription revenue\n0.0\n%\n100,421\n0.7\n%\n(99.9\n)%\nMember subscription revenue\n211,441\n0.2\n%\n-\n-\n%\nTotal revenues\n$\n79,674,879\n100.0\n%\n$\n14,020,353\n100.0\n%\n468.3\n%\nTotal revenues increased by approximately $ 65.7 million or 468.3% to approximately $79.7 million for the year ended June 30, 2022 from approximately $14.0 million for the year ended June 30, 2021. The increase was mainly attributable to the exponential growth of the registered user from our O2O e-commerce platform known as ZCITY platforms as we had acquired 1,364,874 new registered users for year ended June 30, 2022 compared to 603,122 new registered users for the same period in 2021. The increase of registered users enhanced the traffic of our platform and allowed us to monetize our revenue streams including product revenue, loyalty program revenue, transaction revenue and member subscription revenue. The change for each revenue stream was as follows:\nProduct and loyalty program revenue\nProduct revenue was generated through sales of our e-voucher, health care products, and other products through our ZCITY platform while loyalty program revenue was recognized when our customers redeem their previously earned reward points from our loyalty program or upon expiration of the reward point. We have experienced significant growth in register users and active users since we launched our ZCITY platform in June 2020. As of June 30, 2022, we recorded 1,967,996 registered users and 443,430 active users from ZCITY platform. Our average percentage of growth of registered and active users throughout the quarter ended June 30, 2022 since the establishment of ZCITY platform was approximately 143.4% and 283.8%, respectively. However, the average percentage of growth of register and active user was decreased in last five quarters as of June 30, 2022 which was resulted from the resurgence of COVID-19 outbreak and MCO\nin May and June of 2021 as majority of our participated merchants are restaurant owners or service providers and required the spending from our participated members to be in person. Despite the negative impact of COVID-19 resurgence, we expect our product and loyalty program revenue continued to grow for 2022 and beyond as more population in the Malaysia have been fully vaccinated\nand we will continue to attract more people to engage with our platform.\nTransaction revenue\nThe transactions revenue primarily consists of fees charged to merchants for participating in our ZCITY platform upon successful sales transaction and payment service taken place between the merchants and their customers online. Our transaction revenue increased by approximately $23,000 or 75.6% to approximately $54,000 for the year ended June 30, 2022 from approximately $31,000 for the year ended June 30, 2021. The increase was mainly attributable to the fact that we engaged with 1,985 local merchants to connect them with their customers through our ZCITY platform as of June 30, 2022 compared to 1,905 as of June 30, 2021. Our average percentage of growth of new merchants was approximately 36.0% throughout the quarters as of June 30, 2022 since the establishment of ZCITY platform. Even though we experienced slowdown in adding new merchants to our platform during the last five quarters ended June 30, 2022, as a result of resurgence of COVID-19.\nAgent subscription revenue\nAgent subscription revenue primarily consists of fees charged to the agents in exchange for rights by introducing merchants to join our merchant network and to earn a future fixed percentage of commission fees upon completion of each sales transaction between the referred merchants and their customers. Agent subscription revenue decreased by $100,406 or 99.9% to $15 for the year ended June 30, 2022 from $100,421 for the year ended June 30, 2021. The decrease was mainly due to our shift of business strategies to Zmember subscription revenue which is a member oriented program designated to attract more customer to engage with our ZCITY platform.\nMember subscription revenue\nMember subscription revenue primarily consists of fees charged to customers who signed up for Zmember, a membership program that includes exclusive saving, bonus, and referral rewards.\nMember subscription revenue increased by 100.0% to $211,441 for the year ended June 30, 2022 as we launch the Zmember program for the year end June 30, 2022 to enhance our customer engagement with our ZCITY platform. As of June 30, 2022 we had 9,370 customers who subscribed to our Zmember program.\nCost of Revenue\nOur breakdown of cost of revenues by categories for the years ended June 30, 2022 and 2021, respectively, is summarized below:\nFor the Years Ended\nJune 30,\nChange\n%\nProduct and loyalty program revenue\n$\n79,198,691\n$\n13,880,408\n470.6\n%\nTotal cost of revenue\n$\n79,198,691\n$\n13,880,408\n470.6\n%\nCost of revenues mainly consist of the purchases of the gift card or E-voucher pin code, and health care product which is directly attributable to our product revenue. Total cost of revenue increased by approximately $65.3 million or 470.6% for the year ended June 30, 2022 compared with the same period in 2021. The increase was in line with our increase revenue.\nGross Profit\nOur gross profit from our major revenue categories is summarized as follows:\nFor the year\nEnded\nJune 30, 2022\nFor the year\nEnded\nJune 30, 2021\nChange\nPercentage\nChange\nProduct and loyalty program revenue\nGross profit\n$\n211,065\n$\n8,962\n$\n202,103\n2,255.1\n%\nGross margin\n0.3\n%\n0.1\n%\n0.2\n%\nTransaction revenue\nGross profit\n$\n53,667\n$\n30,562\n$\n23,105\n75.6\n%\nGross margin\n100.0\n%\n100.0\n%\n-\n%\nAgent subscription revenue\nGross profit\n$\n$\n100,421\n$\n(100,406\n)\n(99.9\n)%\nGross margin\n100.0\n%\n100.0\n%\n-\n%\nMember subscription revenue\nGross profit\n$\n211,441\n$\n-\n$\n211,441\n100.0\n%\nGross margin\n100.0\n%\n-\n%\n(100.0\n)%\nTotal\nGross profit\n$\n476,188\n$\n139,945\n$\n336,243\n240.3\n%\nGross margin\n0.6\n%\n1.0\n%\n(0.4\n)%\nGross profit for the year ended June 30, 2022 amounted to approximately $0.5 million as compared to approximately $0.1 million for the year ended June 30, 2021. Gross margin was approximately 0.6% and 1.0% for the years ended June 30, 2022 and 2021, respectively. The increase in gross profit was mainly due to increase of revenue in product and loyalty revenue and transaction revenue as result of exponential growth of registered users and active users for the year ended June 30, 2022. The decrease in gross margin was mainly due to the increase of product and loyalty program revenue which brought up the denominator of our gross profit and resulted in lower overall gross margin for the year ended June 30, 2022. In the year ended June 30, 2021, our agent subscription revenue had 100% gross margin and with lower denominator of our gross profit and resulted in higher overall gross margin for the year ended June 30, 2021. Our product and loyalty program gross margin increased from 0.1% for the year ended June 30, 2021 to 0.3% for the year ended June 30, 2022. As we had more member signed up our platform, we had slightly reducing our discount to attract users to sign up with our platform and resulted in higher product and loyalty program gross margin for the year ended June 30, 2022.\nOperating Expenses\nOur operating expenses consist of selling expenses, general and administrative expenses, research and development expenses, and stock-based compensation.\nSelling expenses\nSelling expenses amounted to approximately $6.3 million and $3.0 million for the years ended June 30, 2022 and 2021, respectively. Representing an increase of approximately $3.2 million or 107.1%. The increase was mainly due to increase in marketing and promotion expense of approximately $3.4 million related to promoting our ZCITY platform and eventually attracting more people to sign up as members. Marketing and promotion expense also consists of redemptions of reward points which is generated from non-spending related activities (registration as a new user, referral of a new user and Spin & Win eligibility to receive reward points) in exchange for discounted credit of purchasing our products upon conversion of using the reward points. For the years ended June 30, 2022 and 2021, we incurred approximately $2.8 million and $0.4 million, respectively, in marketing and promotion expense, and recognized the same amount of product revenue at the time of redemption of the non-spending related activities reward points by our customers.\nGeneral and administrative expense\nGeneral and administrative expenses amounted to approximately $2.8 million and $4.2 million for the years ended June 30, 2022 and 2021, respectively. Representing a decrease of approximately $1.5 million or 34.9%. The decrease was mainly due to decrease of approximately $2.4 million in professional/ consulting fees (including related parties) as we incurred less consulting fees related to early preparation of our initial public offering in the United States for the year ended June 30, 2022 as compared to the same period in 2021. The decrease was offset by an increase of approximately $0.6 million in salaries expenses as a result of expansion of our business operation after the launch of our ZCITY platform.\nResearch and development expenses\nResearch and development expense amounted to approximately $0.3 million and $0.4 million for the years ended June 30, 2022 and 2021, respectively, representing a decrease of approximately $0.1 million or 38.8%. The decrease was mainly due to our ZCITY platform becoming more sophisticated as less maintenance was required for the year ended June 30, 2022.\nStock-Based Compensation expenses\nStock-based compensation expenses amounted to approximately $1.3 million and $0 for the years ended June 30, 2022 and 2021, respectively, representing increase of approximately $1.3 million. The increase was mainly due to we engaged with Exchange Listing, LLC, to provide advisory service in capital market advisory, corporate governance, and organizational meeting related to our initial public offering in the United States.\nOther Expense, net\nOther expense, net amounted to approximately $1.5 million and $0.3 million for the years ended June 30, 2022 and 2021, respectively. Representing an increase of approximately $1.2 million or 374.3%. The increase was mainly attributable to the interest expense incurred as well as amortization of debt discount from convertible notes. For the year ended June 30, 2022, we incurred interest expense of approximately $0.3 million and amortization of debt discount of approximately $1.3 million. For the year ended June 30, 2021, we incurred interest expense of approximately $0.2 million and amortization of debt discount of approximately $0.2 million.\nProvision for Income Taxes\nProvision for income tax were amount to $15,600 and $2,000 for the years ended June 30, 2022 and 2021. The amount was attributable to tax imposed on Treasure Global Inc from the State of Delaware, as we are required to remit franchise tax to the State of Delaware on an annual basis.\nWe also were subject to controlled foreign corporations Subpart F income (Subpart F) tax, which is a tax primarily on passive income from controlled foreign corporations with a tax rate of 35%. In addition, the Tax Cuts and Jobs Act imposed a global intangible low-taxed income (GILTI) tax, which is a tax on certain off-shore earnings at an effective rate of 10.5% for tax years (50% deduction of the current enacted tax rate of 21%) with a partial offset for 80% foreign tax credits. If the foreign tax rate is 13.125% or higher, there will be no U.S. corporate tax after the 80% foreign tax credits are applied.\nFor the years ended June 30, 2022 and 2021, our foreign subsidiary did not generate any income that are subject to Subpart F tax and GILTI tax.\nNet Loss\nOur net loss increased by approximately $3.8 million from approximately $8.0 million for the year ended June 30, 2021 to approximately $11.7 million for the year ended June 30, 2022, predominately due to reasons as discussed above.\nLiquidity and Capital Resources\nIn assessing liquidity, we monitor and analyze cash on-hand and operating expenditure commitments. Our liquidity needs are to meet working capital requirements and operating expense obligations. To date, we financed our operations primarily through cash flows from contribution from shareholders, issuance of convertible notes, related party loans, and our completion of initial underwritten public offering.\nAs of June 30, 2022 and 2021, we had approximately $1.8 million and $2.8 million, respectively, in cash and cash equivalent which primarily consists of bank deposits, which are unrestricted as to withdrawal and use. We have a working capital deficit of approximately $15.9 million and $1.6 million at June 30, 2022 and June 30, 2021, respectively.\nSubsequent to June 30, 2022, we have additionally borrowed approximately $2.7 million under Tophill Loan Agreement 2 on terms identical to the Tophill Loan Agreement 1 which all principal and accrued and unpaid interest outstanding will automatically be converted into shares of our common stock at a conversion price that is equal to 80% of the initial public offering price.\nOn August 15, 2022, we had closed our initial underwritten public offering of 2,300,000 shares of common stock, par value $0.00001 per share, at $4.00 per share. We had received aggregate net proceeds from the closing of approximately $8.2 million, after deducting underwriting discounts and commissions and fees, and other estimated offering expenses which amounted to approximately $1.0 million.\nAfter the completion of the underwritten initial public offering, following the conversion of convertible notes payable, net of unamortized discounts to equity, we expect our working capital to change from a deficit of approximately $15.9 million to a positive working capital of approximately $5.6 million.\nDespite of receiving the net proceeds from our initial underwritten public offering,\nthe management is of the opinion that we will not have sufficient funds to meet the working capital requirements and debt obligations as they become due starting from one year from the date of this report due to our recurring loss. Therefore, the\nmanagement has determined there is substantial doubt about its ability to continue as a going concern. If we are unable to generate significant revenue, we may be required to curtail or cease its operations. Management is trying to alleviate the going concern risk through the following sources:\n●\nEquity financing to support its working capital;\n●\nOther available sources of financing (including debt) from Malaysian banks and other financial institutions; and\n●\nFinancial support and credit guarantee commitments from the Companys related parties.\nThe following summarizes the key components of our cash flows for the years ended June 30, 2022 and 2021:\nFor the Years Ended\nJune 30,\nJune 30,\nNet cash used in operating activities\n$\n(8,663,901\n)\n$\n(6,797,648\n)\nNet cash used in investing activities\n(311,739\n)\n(84,850\n)\nNet cash provided by financing activities\n8,163,893\n9,796,905\nEffect of exchange rate on cash and cash equivalents\n(186,419\n)\n(71,381\n)\nNet change in cash and cash equivalents\n$\n(998,166\n)\n$\n2,843,026\nOperating Activities\nNet cash used in operating activities for the year ended June 30, 2022 was approximately $8.7 million and were mainly comprised of the net loss of approximately $11.7 million, decrease of account payable (including related parties) of approximately $0.2 million as we had pay out some of the account payable balance to the third parties or related parties vendors timely, decrease of customer deposits, related parties of approximately $0.2 million as we had returned the deposit related to I.T professional service back to the related parties due to projects abandoned, and decrease of other payables, related parties as we paid out the remaining balance of professional fee incurred from two related parties of approximately $0.1 million. The net cash used in operating activities was mainly offset by amortization of debt discount of approximately $1.3 million, stock-based compensation of approximately $1.3 million, decrease of inventories of approximately $0.2 million as we improved our inventories turnover rate due to demand of our product, and the increase in other payables and accrued liability of approximately $0.7 million mainly related to the accrued professional expenses.\nNet cash used in operating activities for the year ended June 30, 2021 was approximately $6.8 million and were mainly comprised of the net loss of approximately $7.9 million, increase of inventories of approximately $0.4 million as we need to stock up the gift card or E-voucher after the launch of our ZCITY platform for resale and the increase in prepayments of approximately $0.2 million as our vendors required us to make more deposits to secure our E-voucher purchases. The net cash used in operating activities was mainly offset by the amortization of debt discount of approximately $0.2 million, the decrease in other receivable and other current assets of approximately $0.5 million as we collected back our security deposits during the period, the increase in accounts payable (including related parties) of approximately $0.2 million as we make more purchase on account, the increase in customer deposits (including related parties) of approximately $0.3 million as we collected customer deposit from third parties and related parties related to our I.T professional service, and the increase in other payables and accrued liabilities (including related party)\nof approximately $0.5 million mainly related to the accrued professional expenses\nInvesting Activities\nNet cash used in investing activities for the year ended June 30, 2022 was approximately $0.3 million, which was in respect of purchase of equipment for our operations.\nNet cash used in investing activities for the year ended June 30, 2021 was approximately $85,000, which was in respect of purchase of equipment for our operations.\nFinancing Activities\nNet cash provided by financing activities for the year ended June 30, 2022 was approximately $8.2 million, which were mainly comprised of proceeds received from the issuance of convertible note from third parties and related parties of approximately $8.6 million, and proceeds received from third parties loans of approximately $1.5 million, offset by repayment to related parties loan of approximately $1.8 million, and approximately $0.1 million payment of deferred offering costs.\nNet cash provided by financing activities for the year ended June 30, 2021 was approximately $9.8 million, which were mainly comprised of capital contributions received from the shareholders of approximately $0.2 million, proceeds received from the issuance of convertible note from third parties and related parties and senior note of approximately $5.5 million and proceeds borrowed from our related parties of approximately $4.0 million.\nOff-Balance Sheet Arrangements\nAs of June 30, 2022, we have no significant off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, changes in our financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources that are material to our stockholders.\nCritical Accounting Estimate\nOur financial statements and accompanying notes have been prepared in accordance with U.S. GAAP. The preparation of these financial statements and accompanying notes requires us to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues and expenses, and related disclosure of contingent assets and liabilities. We base our estimates on historical experience and on various other assumptions that are believed to be reasonable under the circumstances, the results of which form the basis of making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. We have identified certain accounting estimates that are significant to the preparation of our financial statements. These estimates are important for an understanding of our financial condition and results of operation. Certain accounting estimates are particularly sensitive because of their significance to financial statements and because of the possibility that future events affecting the estimate may differ significantly from managements current judgments. We believe the following critical accounting estimates involve the most significant estimates and judgments used in the preparation of our financial statements.\nThe preparation of consolidated financial statements in conformity with U.S. GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosures of contingent assets and liabilities as of the date of the consolidated financial statements and the reported amounts of revenues and expenses during the periods presented. Significant accounting estimates reflected in our consolidated financial statements include the estimated retail price per point and estimated breakage to calculate the revenue recognized in our loyalty program revenue, the useful lives of property and equipment, impairment of long-lived assets, allowance for doubtful accounts, realization of deferred tax assets and uncertain tax position, and fair value of our stock price to determine the\nbeneficial conversion feature (\"BCF\") within the convertible note\n. Actual results could differ from these estimates.\nAccounts receivable, net\nAccounts receivable are recorded at the invoiced amount less an allowance for any uncollectible accounts and do not bear interest, which are due after 30 days. Accounts receivable include money due from agent subscription revenue and sales of health care product on its Z-city platform. Management reviews the adequacy of the allowance for doubtful accounts on an ongoing basis, using historical collection trends and aging of receivables. Management also periodically evaluates individual customers financial condition, credit history, and the current economic conditions to make adjustments in the allowance when it is considered necessary. Account balances are charged off against the allowance after all means of collection have been exhausted and the potential for recovery is considered remote. Our management continues to evaluate the reasonableness of the valuation allowance policy and update it if necessary.\nOur allowance for accounts receivables were $227 and $25,690, as of June 30, 2022 and 2021, respectively,\nInventories\nInventories are stated at the lower of cost or net realizable value, cost being determined on a first-in-first-out method. Costs include gift card or E-voucher pin code which are purchased from our suppliers as merchandized goods or store credit, and healthcare products. Management compares the cost of inventories with the net realizable value and if applicable, an allowance is made for writing down the inventory to its net realizable value, if lower than cost. On an ongoing basis, inventories are reviewed for potential write-down for estimated obsolescence or unmarketable inventories which equals the difference between the costs of inventories and the estimated net realizable value based upon forecasts for future demand and market conditions. When inventories are written-down to the lower of cost or net realizable value, it is not marked up subsequently based on changes in underlying facts and circumstances. As of June 30, 2022 and 2021, impairments of inventories amounted to $8,805 and $0, respectively, were provided for E-vouchers.\nOther receivables and other current assets, net\nOther receivables and other current assets primarily include refundable advance to third party service provider and other deposits. Management regularly reviews the aging of receivables and changes in payment trends and records allowances when management believes collection of amounts due are at risk. Accounts considered uncollectable are written off against allowances after exhaustive efforts at collection are made. No allowance of other receivable and other current assets were recorded as of June 30, 2022 and 2021.\nPrepayments\nPrepayments and deposits are mainly cash deposited or advanced to suppliers for future inventory purchases. This amount is refundable and bears no interest. For any prepayments determined by management that such advances will not be in receipts of inventories, services, or refundable, we will recognize an allowance account to reserve such balances. Management reviews its prepayments on a regular basis to determine if the allowance is adequate, and adjusts the allowance when necessary. Delinquent account balances are written-off against allowance for doubtful accounts after management has determined that the likelihood of collection is not probable. Our management continues to evaluate the reasonableness of the valuation allowance policy and update it if necessary. No allowance of prepayments were recorded as of June 30, 2022 and 2021.\nImpairment for long-lived assets\nLong-lived assets, including property and equipment with finite lives are reviewed for impairment whenever events or changes in circumstances (such as a significant adverse change to market conditions that will impact the future use of the assets) indicate that the carrying value of an asset may not be recoverable. We assessed the recoverability of the assets based on the undiscounted future cash flows the assets are expected to generate and recognize an impairment loss when estimated undiscounted future cash flows expected to result from the use of the asset plus net proceeds expected from disposition of the asset, if any, are less than the carrying value of the asset. If an impairment is identified, we would reduce the carrying amount of the asset to its estimated fair value based on a discounted cash flows approach or, when available and appropriate, to comparable market values. No impairment for long-lived assets were recorded as of June 30, 2022 and 2021.\nRevenue recognition\nLoyalty program\n- Performance obligations satisfied over time\nOur Z-City reward loyalty program allows members to earn points on purchases that can be redeemed for rewards that include discounts on future purchases. When members purchase our product or make purchase with our participated vendor through Z-City, we allocate the transaction price between the product or service, and the reward points earned based on the relative stand-alone selling prices and expected point redemption. The portion allocated to the reward points is initially recorded as contract liability and subsequently recognized as revenue upon redemption or expiration.\nThe two primary estimates utilized to record the contract liability for reward points earned by members are the estimated retail price per point and estimated breakage. The estimated retail price per point is based on the actual historical retail prices of product purchased or service obtained through the redemption of reward points. We estimate breakage of reward points based on historical redemption rates. We continually evaluate its methodology and assumptions based on developments in retail price per point redeemed, redemption patterns and other factors. Changes in the retail price per point and redemption rates have the effect of either increasing or decreasing the contract liability through current period revenue by an amount estimated to represent the retail value of all points previously earned but not yet redeemed by loyalty program members as of the end of the reporting period.\nIncome taxes\nDeferred taxes are accounted for using the asset and liability method in respect of temporary differences arising from differences between the carrying amount of assets and liabilities in the consolidated financial statements and the corresponding tax basis used in the computation of assessable tax profit. In principle, deferred tax liabilities are recognized for all taxable temporary differences. Deferred tax assets are recognized to the extent that it is probable that taxable profit will be available against which deductible temporary differences can be utilized. Deferred tax is calculated using tax rates that are expected to apply to the period when the asset is realized or the liability is settled. Deferred tax is charged or credited in the income statement, except when it is related to items credited or charged directly to equity, in which case the deferred tax is also dealt with in equity. Deferred tax assets are reduced by a valuation allowance when, in the opinion of management, it is more likely than not that some portion or all of the deferred tax assets will not be realized. Current income taxes are provided for in accordance with the laws of the relevant taxing authorities.\nAn uncertain tax position is recognized as a benefit only if it is more likely than not that the tax position would be sustained in a tax examination, with a tax examination being presumed to occur. The amount recognized is the largest amount of tax benefit that is greater than 50% likely of being realized on examination. For tax positions not meeting the more likely than not test, no tax benefit is recorded.\nConvertible notes\nWe evaluate our convertible notes to determine if those contracts or embedded components of those contracts qualify as derivatives. The result of this accounting treatment is that the fair value of the embedded derivative is recorded at fair value each reporting period and recorded as a liability. In the event that the fair value is recorded as a liability, the change in fair value is recorded in the statements of operations as other income or expense.\nIn circumstances where the embedded conversion option in a convertible instrument is required to be bifurcated and there are also other embedded derivative instruments in the convertible instrument that are required to be bifurcated, the bifurcated derivative instruments are accounted for as a single, compound derivative instrument.\nIf the conversion features of conventional convertible debt provide for a rate of conversion that is below market value at issuance, this feature is characterized as a beneficial conversion feature (BCF). A BCF is recorded by us as a debt discount pursuant to ASC Topic 470-20 Debt with Conversion and Other Options. In those circumstances, the convertible debt is recorded net of the discount related to the BCF, and we amortize the discount to interest expense, over the life of the debt.\nRecent Accounting Pronouncements\nSee Note 2 of the notes to the consolidated financial statements included elsewhere in this report for a discussion of recently issued accounting standards. Item 7A. Quantitative and Qualitative Disclosures About Market Risk.\nThe Company is a smaller reporting company as defined by Rule 12b-2 of the Exchange Act and is not required to provide the information required under this item. Item 8. Financial Statements and Supplementary Data.\nTREASURE GLOBAL INC. AND SUBSIDIARY\nINDEX TO CONSOLIDATED FINANCIAL STATEMENTS\nPage\nReport of Independent Registered Public Accounting Firm (PCAOB ID: 711)\nConsolidated Balance Sheets as of June 30, 2022 and 2021\nConsolidated Statements of Operations and Comprehensive Loss for the years ended June 30, 2022 and 2021\nConsolidated Statements of Changes in Stockholders (Deficiency) Equity for the years ended June 30, 2022 and 2021\nConsolidated Statements of Cash Flows for the years ended June 30, 2022 and 2021\nNotes to Consolidated Financial Statements\n-\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and\nStockholders of Treasure Global Inc.\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheets of Treasure Global Inc.\n(the Company) as of\nJune 30, 2022 and 2021, and the related consolidated statements of operations and comprehensive loss, changes in stock\nholders\n(deficiency) equity and cash flows for each of the years in the two-year period ended June 30, 2022, and the related notes (collectively referred to as the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of June 30, 2022 and 2021, and the results of its operations and its cash flows for each of the years in the two-year period ended June 30, 2022, in conformity with accounting principles generally accepted in the United States of America.\nCorrection of Previously Issued Financial Statements\nAs discussed in note 2, the accompanying consolidated financial statements as of June 30, 2021 and for the year ended June 30, 2021\nhave been revised to correct the errors.\nExplanatory Paragraph - Going Concern\nThe accompanying consolidated financial statements have been prepared assuming the Company will continue as a going concern. As discussed in Note 3 to the consolidated financial statements, the Company has incurred recurring losses from operations, a working capital deficit and accumulated deficit at June 30, 2022\n. These factors raise substantial doubt about the Companys ability to continue as a going concern. Managements plans in regards to these matters are also described in Note\n3. These consolidated financial statements do not include any adjustments that might result from the outcome of these uncertainties. If the Company is unable to successfully obtain the necessary additional financial support as specified in Note 3, there could be a material adverse effect on the Company.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Companys management. Our responsibility is to express\nan\nopinion on the Companys consolidated financial statements\nbased on our audit. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (\"PCAOB\") and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the\npurpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly\n, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\n/s/ Friedman LLP\nWe have served as\nthe Companys auditor since 202\nNew York, New York\nDecember 5, 2022\nTREASURE GLOBAL INC. AND SUBSIDIARY\nCONSOLIDATED BALANCE SHEETS\nJune 30,\nJune 30,\n(As\nRevised)\nASSETS\nCURRENT ASSETS\nCash and cash equivalents\n$\n1,845,232\n$\n2,843,398\nAccounts receivable, net\n-\n83,917\nAccounts receivable, a related party\n-\n10,317\nAmount due from related parties\n-\n60,910\nInventories\n216,069\n392,764\nOther receivable and other current assets\n8,780\n14,812\nPrepayments\n203,020\n179,286\nTotal current assets\n2,273,101\n3,585,404\nOTHER ASSETS\nProperty and equipment, net\n337,645\n102,648\nDeferred offering costs\n93,536\n-\nTotal other assets\n431,181\n102,648\nTOTAL ASSETS\n$\n2,704,282\n$\n3,688,052\nLIABILITIES AND STOCKHOLDERS\nDEFICIENCY\nCURRENT LIABILITIES\nRelated party loan, current portion\n$\n4,505\n$\n5,011\nConvertible notes payable, net of unamortized discounts of $717,260 a\nnd $0 as of June 30, 2022 and 2021, respectively\n10,954,042\n-\nConvertible notes payable, related parties\n2,437,574\n-\nLoans from third parties\n1,417,647\n-\nAccount payable\n25,397\n44,987\nAccount payable, related parties\n14,326\n160,701\nCustomer deposits\n73,317\n146,479\nCustomer deposits, related parties\n-\n195,511\nContract liability\n56,757\n12,307\nOther payables and accrued liabilities\n1,161,860\n458,599\nOther\npayables, related parties\n-\n113,402\nAmount due to related parties\n2,060,088\n4,008,785\nIncome tax payables\n16,445\n2,000\nTotal current liabilities\n18,221,958\n5,147,782\nNON-CURRENT LIABILITIES\nRelated party loan, non-current portion\n13,883\n20,070\nSenior note\n65,000\n65,000\nConvertible notes payable, net of unamortized discounts of $0\nand $758,508\nas of June 30, 2022 and 2021, respectively\n-\n3,575,453\nConvertible notes\npayable, a\nrelated party\n-\n1,400,000\nTotal non-current liabilities\n78,883\n5,060,523\nTOTAL LIABILITIES\n18,300,841\n10,208,305\nCOMMITMENTS AND CONTINGENCIES\nSTOCKHOLDERS' DEFICIENCY\nCommon stock, par value $0.00001; 150,000,000 shares authorized, 10,545,251 and 10,312,585 shares\nissued and outstanding as of June 30, 2022 and 2021, respectively\nAdditional paid-in capital\n4,020,552\n1,504,950\nAccumulated deficit\n(19,715,740\n)\n(7,969,726\n)\nAccumulated other comprehensive income (loss)\n98,524\n(55,580\n)\nTOTAL STOCKHOLDERS' DEFICIENCY\n(15,596,559\n)\n(6,520,253\n)\nTOTAL LIABILITIES AND STOCKHOLDERS' DEFICIENCY\n$\n2,704,282\n$\n3,688,052\nThe accompanying notes are an integral part of these consolidated financial statements.\nTREASURE GLOBAL INC. AND SUBSIDIARY\nCONSOLIDATED STATEMENTS OF OPERATION AND COMPREHENSIVE LOSS\nFor the\nYears Ended June 30,\nREVENUES\n$\n79,674,879\n$\n14,020,353\nCOST OF REVENUES\n(79,198,691\n)\n(13,880,408\n)\nGROSS PROFIT\n476,188\n139,945\nSELLING\n(6,282,465\n)\n(3,034,197\n)\nGENERAL AND ADMINISTRATIVE\n(2,819,811\n)\n(4,264,265\n)\nRESEARCH AND DEVELOPMENT\n(266,716\n)\n(435,471\n)\nSTOCK-BASED COMPENSATION\n(1,283,994\n)\n-\nTOTAL OPERATING EXPENSES\n(10,652,986\n)\n(7,733,933\n)\nLOSS FROM OPERATIONS\n(10,176,798\n)\n(7,593,988\n)\nOTHER (EXPENSE) INCOME\nOther income, net\n54,854\n75,270\nInterest expense\n(341,609\n)\n(163,945\n)\nAmortization of debt discount\n(1,266,861\n)\n(238,917\n)\nTOTAL OTHER EXPENSE, NET\n(1,553,616\n)\n(327,592\n)\nLOSS BEFORE INCOME TAXES\n(11,730,414\n)\n(7,921,580\n)\nPROVISION FOR INCOME TAXES\n(15,600\n)\n(2,000\n)\nNET LOSS\n(11,746,014\n)\n(7,923,580\n)\nOTHER COMPREHENSIVE INCOME (LOSS)\nForeign currency translation adjustment\n154,104\n(43,145\n)\nCOMPREHENSIVE LOSS\n$\n(11,591,910\n)\n$\n(7,966,725\n)\nLOSS PER SHARE\nBasic and diluted\n$\n(1.12\n)\n$\n(0.77\n)\nWEIGHTED AVERAGE NUMBER OF COMMON SHARES OUTSTANDING\nBasic and diluted\n10,469,396\n10,312,585\nThe accompanying notes are an integral part of these consolidated financial statements.\nTREASURE GLOBAL INC. AND SUBSIDIARY\nCONSOLIDATED STATEMENTS OF CHANGE IN STOCKHOLDERS' (DEFICIENCY) EQUITY\nACCUMULATED\nTOTAL\nADDITIONAL\nOTHER\nSTOCKHOLDERS'\nCOMMON STOCK\nPAID IN\nACCUMULATED\nCOMPREHENSIVE\n(DEFICIENCY)\nNumber of shares\nPar value\nCAPITAL\nDEFICIT\n(LOSS) INCOME\nEQUITY\nBalance as of June 30, 2020\n10,312,585\n$\n$\n479,131\n$\n(46,146\n)\n$\n(12,435\n)\n$\n420,653\nCapital contributions\n-\n-\n240,754\n-\n-\n240,754\nBeneficial conversion feature from issuance of convertible note\n-\n-\n785,065\n-\n-\n785,065\nNet loss\n-\n-\n-\n(7,923,580\n)\n-\n(7,923,580\n)\nForeign currency translation adjustment\n-\n-\n-\n-\n(43,145\n)\n(43,145\n)\nBalance as of June 30, 2021\n10,312,585\n$\n$\n1,504,950\n$\n(7,969,726\n)\n$\n(55,580\n)\n$\n(6,520,253\n)\nBeneficial conversion feature from issuance of convertible note\n-\n-\n1,231,610\n-\n-\n1,231,610\nNet loss\n-\n-\n-\n(11,746,014\n)\n-\n(11,746,014\n)\nIssuance of common stock - non-employee stock compensation\n232,666\n1,283,992\n-\n-\n1,283,994\nForeign currency translation adjustment\n-\n-\n-\n-\n154,104\n154,104\nBalance as of June 30, 2022\n10,545,251\n$\n$\n4,020,552\n$\n(19,715,740\n)\n$\n98,524\n$\n(15,596,559\n)\nThe accompanying notes are an integral part of these consolidated financial statements.\nTREASURE GLOBAL INC. AND SUBSIDIARY\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nFor the Years Ended June 30,\n(As\nRevised)\nCASH FLOWS FROM OPERATING ACTIVITIES:\nNet loss\n$\n(11,746,014\n)\n$\n(7,923,580\n)\nAdjustments to reconcile net loss to net cash used in operating activities:\nDepreciation\n60,605\n9,627\nAmortization of debt discount\n1,266,861\n238,917\n(Recovery of) provision for doubtful accounts, net\n(24,953\n)\n28,216\nInventories impairment\n8,805\n-\nStock-based compensation\n1,283,994\n-\nChange in operating assets and liabilities\nAccounts receivables\n107,233\n(21,287\n)\nAccounts receivables, a related party\n10,116\n(10,372\n)\nInventories\n151,184\n(394,883\n)\nOther receivable and other current assets\n5,376\n468,313\nPrepayments\n(35,730\n)\n(180,091\n)\nAccounts payable\n(17,648\n)\n16,122\nAccounts payable, related parties\n(142,642\n)\n149,668\nCustomer deposits\n(67,237\n)\n147,270\nCustomer deposits, related parties\n(191,698\n)\n196,566\nContract liability\n47,066\n12,373\nOther payables and accrued liabilities\n719,184\n379,076\nOther\npayables, related parties\n(112,848\n)\n113,289\nIncome tax payables\n14,445\n(26,872\n)\nNet cash used in operating activities\n(8,663,901\n)\n(6,797,648\n)\nCASH FLOWS FROM INVESTING ACTIVITIES:\nPurchases of equipment\n(312,358\n)\n(84,850\n)\nProceeds from sale of equipment\n-\nNet cash used in investing activities\n(311,739\n)\n(84,850\n)\nCASH FLOWS FROM FINANCING ACTIVITIES:\nPayments of deferred offering costs\n(93,536\n)\n-\nCapital contributions\n-\n240,754\nPayments of related party loan\n(5,434\n)\n(2,416\n)\nProceeds from issuance of senior note\n-\n65,000\nProceeds from issuance of convertible notes\n7,587,150\n4,121,601\nProceeds from issuance of convertible notes, related parties\n1,037,574\n1,400,000\nRepayments from related parties\n59,722\n-\n(Repayment to) proceeds from related parties\n(1,898,578\n)\n3,971,966\nProceeds from third party loan\n1,476,995\n-\nNet cash provided by financing activities\n8,163,893\n9,796,905\nEFFECT OF EXCHANGE RATE ON CASH AND CASH EQUIVALENTS\n(186,419\n)\n(71,381\n)\n(DECREASE) INCREASE IN CASH AND CASH EQUIVALENTS\n(998,166\n)\n2,843,026\nCASH AND CASH EQUIVALENTS, beginning of year\n2,843,398\nCASH AND CASH EQUIVALENTS, end of year\n$\n1,845,232\n$\n2,843,398\nSUPPLEMENTAL CASH FLOWS INFORMATION\nIncome taxes paid\n$\n1,628\n$\n30,671\nInterest paid\n$\n291,433\n$\n93,191\nSUPPLEMENTAL NON-CASH FLOWS INFORMATION\nBeneficial conversion feature resulted from issuance of convertible note\n$\n1,231,610\n$\n785,065\nPurchase of equipment through financing with related party\n$\n-\n$\n27,632\nThe accompanying notes are an integral part of these consolidated financial statements.\nTREASURE GLOBAL INC. AND SUBSIDIARY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNote 1 - Nature of business and organization\nTreasure Global Inc. (TGI or the Company) is a holding company incorporated on March 20, 2020, under the laws of the State of Delaware. The Company has no substantive operations other than holding all of the outstanding shares of Gem Reward Sdn. Bhd. (GEM), which was established under the laws of the Malaysia on June 6, 2017, through a reverse recapitalization.\nOn March 11, 2021, TGI completed a reverse recapitalization (Reorganization) under common control of its then existing shareholders, who collectively owned all of the equity interests of GEM prior to the Reorganization through a Share Swap Agreement. GEM is under common control of the same shareholders of TGI through a beneficial ownership agreement, which results in the consolidation of GEM and has been accounted for as a Reorganization of entities under common control at carrying value. Before and after the Reorganization, the Company, together with its sole subsidiary is effectively controlled by the same shareholders, and therefore the Reorganization is considered as a recapitalization of entities under common control in accordance with Accounting Standards Codification (ASC) 805-50-25. The consolidation of the Company and its sole subsidiary have been accounted for at historical cost and prepared on the basis as if the aforementioned transactions had become effective as of the beginning of the first period presented in the accompanying consolidated financial statements in accordance with ASC 805-50-45-5.\nThe Company, through its wholly owned subsidiary, GEM, engages in the payment processing industry and operate an online-to-offline (O2O) e-commerce platform known as ZCITY. The Company has extensive business interests in creating an innovative O2O e-commerce platform with an instant rebate and affiliate cashback program business model, focusing on providing a seamless payment solution and capitalizing on big data using artificial intelligence technology. The Companys proprietary product is an internet application (or app) called ZCITY App. ZCITY App drives user app download and transactions by providing\ninstant rebate and cashback. The Company aims to transform and simplify a users e-payment gateway experience by providing great deals, rewards and promotions with every use in an effort to make it Malaysias top reward and payment gateway platform.\nThe accompanying consolidated financial statements reflect the activities of TGI and its wholly owned subsidiary, GEM.\nNote 2 - Revision of previously issued financial statements\nMisclassification of convertible notes payable, related parties\nIn May and June 2021, the Company issued\nvarious tranches of convertible notes payable (CNP) to 5 accredited investors which included 4\nthird parties and 1\nrelated parties as of June 30, 2021.\nThe purpose of the CNP offering was to raise funding for the Company to support its working capital and growth requirements prior to receipt of the initial public offering (IPO) proceeds. While the relationship between certain CNP holders and the Company was disclosed within the relevant Form S-1 filings, the Company unintentionally\nmisclassified\nthe related party\nbalances from the balances with third parties and the related\ndisclosure from the consolidated financial statements and associated notes for the year ended June 30, 2021, which also formed an integral part of the Companys Form S-1 filings. As a result, the Company unintentionally misclassified related parties CNPs together with third parties CNPs under non-current liabilities and the related disclosure as of and for the year ended June 30, 2021.\nMisclassification of other payable and accrued liability, related parties\nAs of and for the year ended June 30, 2021, due to the fact that the Company was a private company who did not possess adequate experience or qualification to establish an internal control function\nto properly identify its completed related party list. As a result, the Company unintentionally misclassified other payable and accrued liability, related parties together with third party other payables and accrued liabilities, and third party account payable under current liabilities and the related disclosure as of and for the year ended June 30, 2021. As of June 30, 2021, the balance outstanding from other payable and accrued liability, related parties was\nrelated to the consulting fee incurred from two related parties during the year ended June 30, 2021. Furthermore, the Company also identified additional related parties transactions in regards to consulting fees for the year ended June 30, 2021, and provided proper disclosure on Note 11.\nThe following tables summarize the effect of the revision on each financial statement line item as of the dates, and for the period, indicated:\nAs\nPreviously\nReported\nAdjustments\nAs Revised\nConsolidate balance sheet as of June 30, 2021\nCurrent liabilities:\nAccount payable\n$\n73,389\n$\n(28,402\n)\n$\n44,987\nOther payables and accrued liabilities\n543,599\n(85,000\n)\n458,599\nOther\npayables, related parties\n-\n113,402\n113,402\n$\n616,988\n$\n-\n$\n616,988\nNon-current liabilities:\nConvertible notes payable, net of unamortized discounts\n$\n4,975,453\n$\n(1,400,000\n)\n$\n3,575,453\nConvertible notes payable, related party\n-\n1,400,000\n1,400,000\n$\n4,975,453\n$\n-\n$\n4,975,453\nAs\nPreviously\nReported\nAdjustments\nAs Revised\nConsolidated statement of cash flow for the year ended June 30, 2021\nCash flows from operating activities:\nAccount payable\n$\n44,411\n$\n(28,289\n)\n$\n16,122\nOther payables and accrued liabilities\n464,076\n(85,000\n)\n379,076\nOther payables, related parties\n-\n113,289\n113,289\n$\n508,487\n$\n-\n$\n508,487\nCash flows from financing activities:\nProceeds from issuance of convertible notes\n$\n5,521,601\n$\n(1,400,000\n)\n$\n4,120,601\nProceeds from issuance of convertible notes, related parties\n-\n1,400,000\n1,400,000\n$\n5,521,601\n$\n-\n$\n5,521,601\nNote 3\n- Summary of significant accounting policies\nGoing concern\nIn assessing the Companys liquidity and substantial doubt about its ability to continue as a going concern, the Company monitors and analyzes cash on-hand and operating expenditure commitments. The Companys liquidity needs are to meet working capital requirements and operating expense obligations. To date, the Company financed its operations primarily through cash flows from contribution from shareholders, issuance of convertible note and related parties loans and its initial underwritten public offering.\nThe Companys management has considered whether there is substantial doubt about its ability to continue as a going concern due to (1) loss from operations of approximately $10.2 million for the year ended June 30, 2022, (2) accumulated deficit of approximately $19.7 million as of June 30, 2022; (3) the working capital deficit of approximately $15.9 million as of June 30, 2022; and (4) net operating cash outflow of approximately $8.7 million for the year ended June 30, 2022.\nSubsequent to June 30, 2022, t\nhe Company has drawn additional approximately $2.7\nmillion from Tophill Loan Agreement 2 (as defined in Note 16\n) on terms identical to the Tophill Loan Agreement 1 (as defined in Note 9\n) which all principal and accrued and unpaid interest outstanding will automatically be converted into shares of the Companys common stock at a conversion price that is equal to 80% of the initial underwritten public offering price. On August 15, 2022, 2,756,879 shares of the Companys common stock were\nconverted from the principal and the accumulated interest balance of the Tophill Loan Agreement 1 and Agreement 2.\nOn August 15, 2022, the Company closed its initial underwritten public offering of 2,300,000 shares of common stock, par value $0.00001 per share, at $4.00 per share. The Company received aggregate net proceeds from the closing of approximately $8.2 million, after deducting underwriting discounts and commissions and fees, and other estimated offering expenses.\nTREASURE GLOBAL INC. AND SUBSIDIARY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nAfter the completion of the initial underwritten public offering, as well as conversion of convertible note payable, net of unamortized discount amounted to approximately $13.4 million as of June 30, 2022, the Company expects its working capital to change from a deficit of approximately $15.9 million to a positive working capital of approximately $5.6 million.\nDespite of receiving the net proceeds from its initial underwritten public offering,\nthe Companys management is of the opinion that it will not have sufficient funds to meet the Companys working capital requirements and debt obligations as they become due starting from one year from the date of this report due to the recurring loss. Therefore, the\nmanagement has determined there is substantial doubt about its ability to continue as a going concern. If the Company is unable to generate significant revenue, the Company may be required to curtail or cease its operations. Management is trying to alleviate the going concern risk through the following sources:\n●\nEquity financing to support its working capital;\n●\nOther available sources of financing (including debt) from Malaysian banks and other financial institutions; and\n●\nFinancial support and credit guarantee commitments from the Companys related parties.\nBasis of presentation\nThe accompanying consolidated financial statements have been prepared in accordance with accounting principles generally accepted in the United States of America (U.S. GAAP).\nPrinciples of consolidation\nThe consolidated financial statements include the financial statements of the Company and its sole subsidiary. All transactions and balances among the Company and its subsidiary have been eliminated upon consolidation.\nSubsidiary is entity in which the Company, directly or indirectly, controls more than one half of the voting power; or has the power to govern the financial and operating policies, to appoint or remove the majority of the members of the board of directors, or to cast a majority of votes at the meeting of directors.\nEnterprise wide disclosure\nThe Companys chief operating decision-makers (i.e., chief executive officer and his direct reports) review financial information presented on a consolidated basis, accompanied by disaggregated information about revenues by different revenues streams for purposes of allocating resources and evaluating financial performance. There are no segment managers who are held accountable for operations, operating results and plans for levels or components below the consolidated unit level. Based on qualitative and quantitative criteria established by ASC 280, Segment Reporting, the Company considers itself to be operating within one reportable segment.\nUse of estimates\nThe preparation of consolidated financial statements in conformity with U.S. GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosures of contingent assets and liabilities as of the date of the consolidated financial statements and the reported amounts of revenues and expenses during the periods presented. Significant accounting estimates reflected in the Companys consolidated financial statements include allowance for doubtful accounts, allowance for inventories obsolescence, useful lives of property and equipment, impairment of long-lived assets, allowance for deferred tax assets, fair value of convertible note, fair value or valuation of warrants and uncertain tax position. Actual results could differ from these estimates.\nForeign currency translation and transaction\nTransactions denominated in currencies other than the functional currency are translated into the functional currency at the exchange rates prevailing at the dates of the transaction. Monetary assets and liabilities denominated in currencies other than the functional currency are translated into the functional currency using the applicable exchange rates at the balance sheet dates. The resulting exchange differences are recorded in the Consolidated Statements of Operations and Comprehensive Loss.\nThe reporting currency of the Company is United States Dollars (US$) and the accompanying consolidated financial statements have been expressed in US$. The Companys subsidiary in Malaysia conducts its businesses and maintains its books and record in the local currency, Malaysian Ringgit (MYR or RM), as its functional currency.\nTREASURE GLOBAL INC. AND SUBSIDIARY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn general, for consolidation purposes, assets and liabilities of its subsidiary whose functional currency is not US$ are translated into US$, in accordance with ASC Topic 830-30, Translation of Financial Statement\n, using the exchange rate on the balance sheet date. Revenues and expenses are translated at average rates prevailing during the period. The gains and losses resulting from translation of financial statements of foreign subsidiary are recorded as a separate component of accumulated other comprehensive gain or loss within the consolidated statements of changes in stockholders equity. Cash flows are also translated at average translation rates for the periods, therefore, amounts reported on the consolidated statement of cash flows will not necessarily agree with changes in the corresponding balances on the consolidated balance sheets.\nTranslation of foreign currencies into US$1 have been made at the following exchange rates for the respective periods:\nAs of\nJune 30,\nJune 30,\nPeriod-end MYR: US$1 exchange rate\n4.41\n4.15\nFor the years ended\nJune 30,\nPeriod-average MYR: US$1 exchange rate\n4.23\n4.13\nCash and cash equivalents\nCash is carried at cost and represent cash on hand, time deposits placed with banks or other financial institutions and all highly liquid investments with an original maturity of three months or less. Cash equivalents consist of funds received from customer, which funds were held at the third party platforms fund account and which are unrestricted and immediately available for withdrawal and use.\nAccounts receivable, net\nAccounts receivable are recorded at the invoiced amount less an allowance for any uncollectible accounts and do not bear interest, which are due after 30 days. Accounts receivable include money due from agent subscription and sales of health care product on its Z-city platform. Management reviews the adequacy of the allowance for doubtful accounts on an ongoing basis, using historical collection trends and aging of receivables. Management also periodically evaluates individual customers financial condition, credit history, and the current economic conditions to make adjustments in the allowance when it is considered necessary. Account balances are charged off against the allowance after all means of collection have been exhausted and the potential for recovery is considered remote. The Companys management continues to evaluate the reasonableness of the valuation allowance policy and update it if necessary. As of June 30, 2022 and 2021, the Company recorded $227 and $25,690 of allowance for doubtful account, respectively. For the years ended June 30, 2022 and 2021, the Company recovered doubtful account from account receivable amounted to $24,953 and $0, respectively.\nInventories\nInventories are stated at the lower of cost or net realizable value, cost being determined on a first-in-first-out method. Costs include gift card or E-voucher pin code which are purchased from the Companys suppliers as merchandized goods or store credit. Costs also included health care products which are purchased from the Companys suppliers as merchandized goods. Management compares the cost of inventories with the net realizable value and if applicable, an allowance is made for writing down the inventory to its net realizable value, if lower than cost. On an ongoing basis, inventories are reviewed for potential write-down for estimated obsolescence or unmarketable inventories which equals the difference between the costs of inventories and the estimated net realizable value based upon forecasts for future demand and market conditions. When inventories are written-down to the lower of cost or net realizable value, it is not marked up subsequently based on changes in underlying facts and circumstances.\nAs of June 30, 2022 and 2021, impairments of inventories amounted to $8,805 and $0, respectively, were provided for E-vouchers.\nTREASURE GLOBAL INC. AND SUBSIDIARY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nOther receivables and other current assets, net\nOther receivables and other current assets primarily include refundable advance to third party service provider and other deposits. Management regularly reviews the aging of receivables and changes in payment trends and records allowances when management believes collection of amounts due are at risk. Accounts considered uncollectable are written off against allowances after exhaustive efforts at collection are made. As of June 30, 2022 and 2021, no allowance for doubtful account was recorded.\nPrepayments\nPrepayments and deposits are mainly cash deposited or advanced to suppliers for future inventory purchases. This amount is refundable and bears no interest. For any prepayments determined by management that such advances will not be in receipts of inventories, services, or refundable, the Company will recognize an allowance account to reserve such balances. Management reviews its prepayments on a regular basis to determine if the allowance is adequate, and adjusts the allowance when necessary. Delinquent account balances are written-off against allowance for doubtful accounts after management has determined that the likelihood of collection is not probable. The Companys management continues to evaluate the reasonableness of the valuation allowance policy and update it if necessary. As of June 30, 2022 and 2021, there was no allowance for the doubtful accounts.\nProperty and equipment, net\nProperty and equipment are stated at cost less accumulated depreciation. Depreciation is computed using the straight-line method over the estimated useful lives of the assets with no residual value. The estimated useful lives are as follows:\nExpected useful lives\nComputer and office equipment\n5 years\nFurniture and fixtures\n3-5 years\nMotor vehicles\n5 years\nLeasehold improvement\n3 years\nThe cost and related accumulated depreciation of assets sold or otherwise retired are eliminated from the accounts and any gain or loss is included in the consolidated statements of operations and comprehensive loss. Expenditures for maintenance and repairs are charged to earnings as incurred, while additions, renewals and betterments, which are expected to extend the useful life of assets, are capitalized. The Company also re-evaluates the periods of depreciation to determine whether subsequent events and circumstances warrant revised estimates of useful lives.\nImpairment for long-lived assets\nLong-lived assets, including property and equipment with finite lives are reviewed for impairment whenever events or changes in circumstances (such as a significant adverse change to market conditions that will impact the future use of the assets) indicate that the carrying value of an asset may not be recoverable. The Company assesses the recoverability of the assets based on the undiscounted future cash flows the assets are expected to generate and recognize an impairment loss when estimated undiscounted future cash flows expected to result from the use of the asset plus net proceeds expected from disposition of the asset, if any, are less than the carrying value of the asset. If an impairment is identified, the Company would reduce the carrying amount of the asset to its estimated fair value based on a discounted cash flows approach or, when available and appropriate, to comparable market values.\nAs of June 30, 2022 and 2021, no impairment of long-lived assets was recognized.\nTREASURE GLOBAL INC. AND SUBSIDIARY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nDeferred offering costs\nDeferred offering costs represents costs associated with the Companys initial underwritten public offering on August 15, 2022. The Deferred offering costs would be netted against the proceeds received from the initial underwritten public offering.\nCustomer deposits\nCustomer deposits represent amounts advanced by customers on service order. Customer deposits are reduced when the related sale is recognized in accordance with the Companys revenue recognition policy.\nRevenue recognition\nThe Company adopted Accounting Standards Update (ASU) 2014-09, Revenue from Contracts with Customers (ASC Topic 606) for all periods presented. The core principle underlying the revenue recognition of this ASU allows the Company to recognize - revenue that represents the transfer of goods and services to customers in an amount that reflects the consideration to which the Company expects to be entitled in such exchange. This will require the Company to identify contractual performance obligations and determine whether revenue should be recognized at a point in time or over time, based on when control of goods and services transfers to a customer.\nTo achieve that core principle, the Company applies five-step model to recognize revenue from customer contracts. The five-step model requires that the Company (i) identify the contract with the customer, (ii) identify the performance obligations in the contract, (iii) determine the transaction price, including variable consideration to the extent that it is probable that a significant future reversal will not occur, (iv) allocate the transaction price to the respective performance obligations in the contract, and (v) recognize revenue when (or as) the Company satisfies the performance obligation.\nThe Company accounts for a contract with a customer when the contract is committed in writing, the rights of the parties, including payment terms, are identified, the contract has commercial substance and consideration is probable of substantially collection.\nRevenue recognition policies for each type of revenue stream are as follows:\nProduct Revenues\n- Performance obligations satisfied at a point in time\nThe Company primarily sells discounted gift cards (or E-vouchers) from retailers, health care products and computer products through individual order directly through the Companys online marketplace platform and its mobile application (Z-City). The Company accounts for the revenue generated from its sales of E-vouchers, health care products and computer products on a gross basis as the Company is acting as a principal in these transactions and is responsible for fulfilling the promise to provide the specified goods, which the Company has control of the goods and has the ability to direct the use of goods to obtain substantially all the benefits. In making this determination, the Company assesses whether it is primarily obligated in these transactions, is subject to inventory risk, has latitude in establishing prices, or has met several but not all of these indicators in accordance with ASC 606-10-55-36 through 40. The Company determined that it is primarily responsible for fulfilling the promise to provide the specified good as the Company directly purchases and pays for in full the applicable E-voucher, health care products and computer products from the vendors prior to posting of such products for sale on its online marketplace platform and prior to taking any orders for sales of such products. Meanwhile, the Company maintained an average daily inventory of approximately $0.5 million to support an average 2.4 days of sales during the year ended June 30, 2022, which demonstrate the Company had control over the products prior to selling it to the customers as the ownership of the products did not transferred momentarily to the customer after the Company purchased the products from vendors. In addition, the Company cannot return the products to the vendors due to lack of sales which demonstrated that the company is subject to inventory risk, and it has discretion in establishing the price of the products which has demonstrated that the Company has the ability to direct the use of that good or service and obtain substantially all of the remaining benefits. The Company also recognized a portion of the product revenues from health care products on a net basis as the product was dropped shipped from the vendors to customers directly which demonstrated that the Company did not had control of the products or bear any inventory risks.\nTREASURE GLOBAL INC. AND SUBSIDIARY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nThe Company recognizes the sales of E-vouchers, health care products, and computer products revenue when the control of the specified goods is transferred to its customer. No refund or return policy is provided to the customer. For the years ended June 30, 2022 and 2021, approximately $2.8 million and $0.4 million of product revenues are related to non-spending related activities with the same amount recorded as selling expenses, respectively.\nLoyalty Program\n- Performance obligations satisfied at a point in time\nThe Companys Z-City reward loyalty program allows members to earn points on purchases that can be redeemed for rewards that include discounts on future purchases. When members purchase the Companys product or make purchase with the Companys participated vendor through Z-City, the Company allocate the transaction price between the product and service, and the reward points earned based on the relative stand-alone selling prices and expected point redemption. The portion allocated to the reward points is initially recorded as contract liability and subsequently recognized as revenue upon redemption or expiration.\nThe two primary estimates utilized to record the contract liability for reward points earned by members are the estimated retail price per point and estimated breakage. The estimated retail price per point is based on the actual historical retail prices of product purchased or service obtained through the redemption of reward points. The Company estimate breakage of reward points based on historical redemption rates. The Company continually evaluates its methodology and assumptions based on developments in retail price per point redeemed, redemption patterns and other factors. Changes in the retail price per point and redemption rates have the effect of either increasing or decreasing the contract liability through current period revenue by an amount estimated to represent the retail value of all points previously earned but not yet redeemed by loyalty program members as of the end of the reporting period.\nTransactions Revenue\n- Performance obligations satisfied at a point in time\nThe transactions revenues primarily consist of fees charged to merchants for participating in Z-City upon successful sales transaction and payment service taken place between the merchants and their customers online.\nThe Company earns transaction revenue from merchants when transactions are completed on certain retail marketplaces. Such revenue is generally determined as a percentage based on the value of merchandise or services being sold by the merchants. In connection with the transaction revenue, the Company offers to share the profit of the transaction (agent commission) to the agents who has referred merchants to participating in Companys online marketplace platform and in Z-City. Transaction revenue is recognized, net of agent commission, in the consolidated statements of operations at the time when the underlying transaction is completed.\nAgent Subscription Revenue\n- Performance obligations satisfied at a point in time\nIn order to attract more merchants to join the Companys online marketplace and in Z-City, the Company provides a right to the agent, an individual or a merchant, to join the Zagent program and assist the Company to develop more merchants to join its merchant network. The agent subscription revenues primarily consist of fees charged to the agents in exchange for the right by introducing merchants to join the Companys merchant network and to earn a future fixed percentage of commission fee upon completion of each sales transaction. As the agent subscription fee is non-refundable, agent subscription revenue is recognized in the consolidated statements of operations at the time when an agent completed the Zagent program training and the remittance of payment of the subscription fee.\nMember Subscription Revenue\n- Performance obligations satisfied over time\nTREASURE GLOBAL INC. AND SUBSIDIARY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn order to attract more customer to engage with the Companys online marketplace and in Z-City, the Company provides membership subscription to the customers to join the Zmember program, a membership program that provides member with benefits which included exclusive saving, bonus, and referral rewards.\nMember subscription revenue primarily consist of fees charge to customers who sign up for Zmember. As the Company provided customers with 6 months member subscription service in general, member subscription revenue is recognized in the consolidated statement of operation over the time across the subscription period.\nDisaggregated information of revenues by products/services are as follows:\nFor the years ended\nJune 30,\nGift card or E-voucher revenue (1)\n$\n78,739,939\n$\n13,448,430\nHealth care products and computer products revenue (1)\n49,524\n350,455\nLoyalty program revenue (1)\n620,293\n90,485\nTransaction revenue (1)\n53,667\n30,562\nAgent subscription revenue (1)\n100,421\nMember subscription revenue (2)\n211,441\n-\nTotal revenues\n$\n79,674,879\n$\n14,020,353\n(1)\nRevenue recognized at a point in time.\n(2)\nRevenue recognized over time.\nCost of revenues\nCost of revenues sold mainly consists of the purchases of the gift card or E-voucher pin code, and health care products which is directly attributable to the sales of product on the Companys online marketplace platform.\nAdvertising costs\nAdvertising costs amounted to $4,224,710 and $1,855,000 for the years ended June 30, 2022 and 2021, respectively.\nOperating leases\nA lease for which substantially all the benefits and risks incidental to ownership remain with the lessor is classified by the lessee as an operating lease. All leases of the Company are currently classified as operating leases. The Company records the total expenses on a straight-line basis over the lease term.\nResearch and development\nResearch and development expenses include salaries and other compensation-related expenses to the Companys research and product development personnel, and related expenses for the Companys research and product development team. Research and development expenses amounted to $266,716 and $\n435,471 for the years ended June 30, 2022 and 2021, respectively.\nDefined contribution plan\nThe full-time employees of the Company are entitled to the government mandated defined contribution plan. The Company is required to accrue and pay for these benefits based on certain percentages of the employees respective salaries, subject to certain ceilings, in accordance with the relevant government regulations, and make cash contributions to the government mandated defined contribution plan. Total expenses for the plans were $139,595 and $65,025 for the years ended June 30, 2022 and 2021, respectively.\nTREASURE GLOBAL INC. AND SUBSIDIARY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nThe related contribution plans include:\n-\nSocial Security Organization (SOSCO) - 1.75% based on employees monthly salary capped of RM 4,000;\n-\nEmployees Provident Fund (EPF) - 12% based on employees monthly salary;\n-\nEmployment Insurance System (EIS) - 0.2% based on employees monthly salary capped of RM 4,000;\nIncome taxes\nThe Company accounts for income taxes in accordance with U.S. GAAP for income taxes. The charge for taxation is based on the results for the fiscal year as adjusted for items, which are non-assessable or disallowed. It is calculated using tax rates that have been enacted or substantively enacted by the balance sheet date.\nDeferred taxes are accounted for using the asset and liability method in respect of temporary differences arising from differences between the carrying amount of assets and liabilities in the consolidated financial statements and the corresponding tax basis used in the computation of assessable tax profit. In principle, deferred tax liabilities are recognized for all taxable temporary differences. Deferred tax assets are recognized to the extent that it is probable that taxable profit will be available against which deductible temporary differences can be utilized. Deferred tax is calculated using tax rates that are expected to apply to the period when the asset is realized or the liability is settled. Deferred tax is charged or credited in the income statement, except when it is related to items credited or charged directly to equity, in which case the deferred tax is also dealt with in equity. Deferred tax assets are reduced by a valuation allowance when, in the opinion of management, it is more likely than not that some portion or all of the deferred tax assets will not be realized. Current income taxes are provided for in accordance with the laws of the relevant taxing authorities.\nAn uncertain tax position is recognized as a benefit only if it is more likely than not that the tax position would be sustained in a tax examination, with a tax examination being presumed to occur. The amount recognized is the largest amount of tax benefit that is greater than 50% likely of being realized on examination. For tax positions not meeting the more likely than not test, no tax benefit is recorded. No penalties and interest incurred related to underpayment of income tax for years ended June 30, 2022 and 2021.\nThe Company is incorporated in the State of Delaware and is required to pay franchise taxes to the State of Delaware on an annual basis.\nThe Company conducts much of its business activities in Malaysia and is subject to tax in its jurisdiction. As a result of its business activities, the Company will file separate tax returns that are subject to examination by the foreign tax authorities.\nStock-Based Compensation\nThe Company recognizes compensation costs resulting from the issuance of stock-based awards to non-employee as an expense in the statements of operations over the requisite service period based on a measurement of fair value for each stock-based award. The fair value of each warrants and common stock granted are estimated as of the date of grant using the Black-Scholes-Merton option-pricing model. The fair value is amortized as compensation cost on a straight-line basis over the requisite service period of the awards. The Black-Scholes-Merton option-pricing model includes various assumptions, including the fair market value of the common stock of the Company, expected life of stock options, the expected volatility and the expected risk-free interest rate, among others. These assumptions reflect the Companys best estimates, but they involve inherent uncertainties based on market conditions generally outside the control of the Company.\nAs a result, if other assumptions had been used, stock-based compensation expense, as determined in accordance with authoritative guidance, could have been materially impacted. Furthermore, if the Company uses different assumptions on future grants, stock-based compensation expense could be materially affected in future periods.\nComprehensive income (loss)\nComprehensive income (loss) consists of two components, net loss and other comprehensive income (loss). Other comprehensive income (loss) refers to revenue, expenses, gains and losses that under GAAP are recorded as an element of stockholders equity but are excluded from net income. Other comprehensive income (loss) consists of a foreign currency translation adjustment resulting from the Company not using the U.S. dollar as its functional currencies.\nLoss per share\nThe Company computes earnings (loss) per share (EPS) in accordance with ASC 260, Earnings per Share. ASC 260 requires companies to present basic and diluted EPS. Basic EPS is measured as net income divided by the weighted average ordinary share outstanding for the period. Diluted EPS presents the dilutive effect on a per share basis of the potential ordinary shares (e.g., convertible securities, options and warrants) as if they had been converted at the beginning of the periods presented, or issuance date, if later. Potential ordinary shares that have an anti-dilutive effect (i.e., those that increase income per share or decrease loss per share) are excluded from the calculation of diluted EPS.\nTREASURE GLOBAL INC. AND SUBSIDIARY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFor the years ended June 30, 2022, and 2021 a total of 3,282,887 and 1,063,560 contingent shares to be issued to the convertible note holders are excluded in the diluted EPS calculation due to its anti-diluted effect, respectively.\nConvertible notes\nThe Company evaluates its convertible notes to determine if those contracts or embedded components of those contracts qualify as derivatives. The result of this accounting treatment is that the fair value of the embedded derivative is recorded at fair value each reporting period and recorded as a liability. In the event that the fair value is recorded as a liability, the change in fair value is recorded in the statements of operations as other income or expense.\nIn circumstances where the embedded conversion option in a convertible instrument is required to be bifurcated and there are also other embedded derivative instruments in the convertible instrument that are required to be bifurcated, the bifurcated derivative instruments are accounted for as a single, compound derivative instrument.\nIf the conversion features of conventional convertible debt provide for a rate of conversion that is below market value at issuance, this feature is characterized as a beneficial conversion feature (\"BCF\"). A BCF is recorded by the Company as a debt discount pursuant to ASC Topic 470-20 \"Debt with Conversion and Other Options.\" In those circumstances, the convertible debt is recorded net of the discount related to the BCF, and the Company amortizes the discount to interest expense, over the life of the debt.\nFair value measurements\nFair value is defined as the price that would be received for an asset, or paid to transfer a liability, in an orderly transaction between market participants at the measurement date. Valuation techniques maximize the use of observable inputs and minimize the use of unobservable inputs. When determining the fair value measurements for assets and liabilities, the Company considers the principal or most advantageous market in which it would transact and considers assumptions that market participants would use when pricing the asset or liability. The following summarizes the three levels of inputs required to measure fair value, of which the first two are considered observable and the third is considered unobservable:\nLevel 1 - Unadjusted quoted prices in active markets for identical assets or liabilities.\nLevel 2 - Observable inputs other than Level 1 prices, such as quoted prices for similar assets or liabilities; quoted prices in markets that are not active; or other inputs that are observable or can be corroborated by observable market data for substantially the full term of the assets or liabilities.\nLevel 3 - Unobservable inputs that are supported by little or no market activity and that are significant to the fair value of the assets or liabilities.\nThe fair value for certain assets and liabilities such as cash, accounts receivable, inventories, other receivables and other current assets, prepayments, accounts payable, customers deposits, other payables and accrued liabilities have been determined to approximate carrying amounts due to the short maturities of these instruments. The Company believes that its bank loans and convertible notes approximates fair value based on current yields for debt instruments with similar terms.\nRelated parties\nParties, which can be a corporation or individual, are considered to be related if the Company has the ability, directly or indirectly, to control the other party or exercise significant influence over the other party in making financial and operating decisions. Companies are also considered to be related if they are subject to common control or common significant influence.\nReclassification\nCertain items of current and non-current liabilities\nin the consolidated balance sheet and certain items of cash flows from financing activities in the consolidated statements of cash flows have been reclassified to conform to the consolidated financial statements for the current period. The reclassification has no impact on the Companys total current and non-current liabilities on its consolidated balance sheet, and net cash provided by financing activities on its consolidated statements of cash flows.\nRecent accounting pronouncements\nThe Company considers the applicability and impact of all accounting standards updates (ASUs). Management periodically reviews new accounting standards that are issued. Under the Jumpstart Our Business Startups Act of 2012, as amended (the JOBS Act), the Company meets the definition of an emerging growth company and has elected the extended transition period for complying with new or revised accounting standards, which delays the adoption of these accounting standards until they would apply to private companies.\nTREASURE GLOBAL INC. AND SUBSIDIARY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn February 2016, the FASB issued ASU No. 2016-02, Leases (Topic 842), to increase the transparency and comparability about leases among entities. The new guidance requires lessees to recognize a lease liability and a corresponding lease asset for virtually all lease contracts. It also requires additional disclosures about leasing arrangements. ASU 2016-02 is effective for interim and annual periods beginning after December 15, 2018, and requires a modified retrospective approach to adoption assuming the Company will remain an emerging growth company at that date. Early adoption is permitted. In September 2017, the FASB issued ASU No. 2017-13, which to clarify effective dates that public business entities and other entities were required to adopt ASC Topic 842 for annual reporting. A public business entity that otherwise would not meet the definition of a public business entity except for a requirement to include or the inclusion of its financial statements or financial information in another entitys filing with the SEC adopting ASC Topic 842 for annual reporting periods beginning after December 15, 2020, and interim reporting periods within annual reporting periods beginning after December 15, 2021. ASU No. 2017-13 also amended that all components of a leveraged lease be recalculated from inception of the lease based on the revised after-tax cash flows arising from the change in the tax law, including revised tax rates. The difference between the amounts originally recorded and the recalculated amounts must be included in income of the year in which the tax law is enacted. The Company has not early adopted this update and it became effective on July 1, 2022 after FASB delayed the effective date for emerging growth companies with ASU 2020-05.\nUpon adoption of this new standard on July 1, 2022, it resulted in the recording of right-of-use assets and lease liabilities of approximately $0.1 million.\nIn May 2019, the FASB issued ASU 2019-05, which is an update to ASU Update No. 2016-13, Financial Instruments-Credit Losses (Topic 326): Measurement of Credit Losses on Financial Instruments, which introduced the expected credit losses methodology for the measurement of credit losses on financial assets measured at amortized cost basis, replacing the previous incurred loss methodology. The amendments in Update 2016-13 added Topic 326, Financial Instruments-Credit Losses, and made several consequential amendments to the Codification. Update 2016-13 also modified the accounting for available-for-sale debt securities, which must be individually assessed for credit losses when fair value is less than the amortized cost basis, in accordance with Subtopic 326-30, Financial Instruments- Credit Losses-Available-for-Sale Debt Securities. The amendments in this Update address those stakeholders concerns by providing an option to irrevocably elect the fair value option for certain financial assets previously measured at amortized cost basis. For those entities, the targeted transition relief will increase comparability of financial statement information by providing an option to align measurement methodologies for similar financial assets. Furthermore, the targeted transition relief also may reduce the costs for some entities to comply with the amendments in Update 2016-13 while still providing financial statement users with decision-useful information. In November 2019, the FASB issued ASU No. 2019-10, which to update the effective date of ASU No. 2016-13 for private companies, not-for-profit organizations and certain smaller reporting companies applying for credit losses, leases, and hedging standard. The new effective date for these preparers is for fiscal years beginning after December 15, 2022. ASU 2019-05 is effective for the Company for annual and interim reporting periods beginning July 1, 2023 as the Company is qualified as an emerging growth company. The Company is currently evaluating the impact ASU 2019-05 may have on its consolidated financial statements.\nIn December 2019, the FASB issued ASU 2019-12, Income Taxes (Topic 740): Simplifying the Accounting for Income Taxes. The amendments in this Update simplify the accounting for income taxes by removing certain exceptions to the general principles in Topic 740. The amendments also improve consistent application of and simplify GAAP for other areas of Topic 740 by clarifying and amending existing guidance. For public business entities, the amendments in this Update are effective for fiscal years, and interim periods within those fiscal years, beginning after December 15, 2020. For all other entities, the amendments are effective for fiscal years beginning after December 15, 2021, and interim periods within fiscal years beginning after December 15, 2022. Early adoption of the amendments is permitted, including adoption in any interim period for (1) public business entities for periods for which financial statements have not yet been issued and (2) all other entities for periods for which financial statements have not yet been made available for issuance. An entity that elects to early adopt the amendments in an interim period should reflect any adjustments as of the beginning of the annual period that includes that interim period. Additionally, an entity that elects early adoption must adopt all the amendments in the same period. ASU 2019-12 is effective for the Company for annual and interim reporting periods beginning July 1, 2022 as the Company is qualified as an emerging growth company. The Company is currently evaluating the impact of this new standard on Companys consolidated financial statements and related disclosures.\nTREASURE GLOBAL INC. AND SUBSIDIARY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn August 2020, the FASB issued ASU 2020-06, Debt - Debt Conversion and Other Options (Subtopic 470-20) and Derivatives and Hedging - Contracts in Entitys Own Equity (Subtopic 815-40). The amendment in this Update is to address issues identified as a result of the complexity associated with applying generally accepted accounting principles (GAAP) for certain financial instruments with characteristics of liabilities and equity. For convertible instruments, the Board decided to reduce the number of accounting models for convertible debt instruments and convertible preferred stock. Limiting the accounting models results in fewer embedded conversion features being separately recognized from the host contract as compared with current GAAP. Convertible instruments that continue to be subject to separation models are (1) those with embedded conversion features that are not clearly and closely related to the host contract, that meet the definition of a derivative, and that do not qualify for a scope exception from derivative accounting and (2) convertible debt instruments issued with substantial premiums for which the premiums are recorded as paid-in capital. The amendments in this Update are effective for public business entities that meet the definition of a Securities and Exchange Commission (SEC) filer, excluding entities eligible to be smaller reporting companies as defined by the SEC, for fiscal years beginning after December 15, 2021, including interim periods within those fiscal years. For all other entities, the amendments are effective for fiscal years beginning after December 15, 2023, including interim periods within those fiscal years. Early adoption is permitted, but no earlier than fiscal years beginning after December 15, 2020, including interim periods within those fiscal years. The Board specified that an entity should adopt the guidance as of the beginning of its annual fiscal year. The Company has not early adopted this update and it will become effective on July 1, 2024 as the Company is qualified as an emerging growth company. The Company believes the adoption of this ASU would have a material effect on the Companys consolidated financial statements and related disclosures.\nIn October 2020, the FASB issued ASU 2020-08, Codification Improvements to Subtopic 310-20, Receivables-Nonrefundable Fees and Other Costs. The amendments in this Update represent changes to clarify the Codification. The amendments make the Codification easier to understand and easier to apply by eliminating inconsistencies and providing clarifications. ASU 2020-08 is effective for the Company for annual and interim reporting periods beginning January 1, 2021. Early adoption was permitted, including adoption in an interim period. All entities should apply the amendments in this Update on a prospective basis as of the beginning of the period of adoption for existing or newly purchased callable debt securities. These amendments do not change the effective dates for Update 2017-08. The adoption of this standard on July 1, 2021 did not have a material impact on its consolidated financial statements.\nIn October 2020, the FASB issued ASU 2020-10, Codification Improvements to Subtopic 205-10, presentation of financial statements. The amendments in this Update improve the codification by ensuring that all guidance that requires or provides an option for an entity to provide information in the notes to financial statements is codified in the disclosure section of the codification. That reduce the likelihood that the disclosure requirement would be missed. The amendments also clarify guidance so that an entity can apply the guidance more consistently. ASU 2020-10 is effective for the Company for annual and interim reporting periods beginning January 1, 2022. Early application of the amendments is permitted for any annual or interim period for which financial statements are available to be issued. The amendments in this Update should be applied retrospectively. An entity should apply the amendments at the beginning of the period that includes the adoption date. The adoption of this standard on July 1, 2021 did not have a material impact on its consolidated financial statements.\nExcept as mentioned above, the Company does not believe other recently issued but not yet effective accounting standards, if currently adopted, would have a material effect on the Companys consolidated balance sheets, statements of operations and comprehensive loss and statements of cash flows.\nNote 4\n- Accounts receivable, net\nAs of\nJune 30, 2022\nAs of\nJune 30,\nAccounts receivable\n$\n$\n109,607\nAllowance for doubtful accounts\n(227\n)\n(25,690\n)\nTotal accounts receivable, net\n$\n-\n$\n83,917\nTREASURE GLOBAL INC. AND SUBSIDIARY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nMovements of allowance for doubtful accounts are as follows:\nAs of\nJune 30,\nAs of\nJune 30,\nBeginning balance\n$\n25,690\n$\n-\nAddition (recovery)\n(24,953\n)\n28,216\nWrite off\n-\n(2,388\n)\nExchange rate effect\n(510\n)\n(138\n)\nEnding balance\n$\n$\n25,690\nNote 5\n-\nInventories\nInventories consist of the following:\nAs of\nJune 30,\nAs of\nJune 30,\nGift card (or E-voucher)\n$\n187,271\n$\n392,764\nNutrition products\n28,798\n-\nTotal\n$\n216,069\n$\n392,764\nNote 6\n-\nOther receivable and other current assets, net\nAs of\nJune 30,\nAs of\nJune 30,\nDeposits (1)\n$\n6,020\n$\n11,648\nPrepaid tax\n2,760\n2,452\nOthers\n-\nTotal other receivable and other current assets\n$\n8,780\n$\n14,812\nAllowance for doubtful account\n-\n-\nTotal other receivable and other current assets, net\n$\n8,780\n$\n14,812\n(1) The balance of deposits mainly represented deposit made by the Company to third party service provider, and security deposit consist of rent and utilities. As of June 30, 2022 and 2021, the Company did not record any allowance against doubtful receivables.\nNote 7\n-\nPrepayments\nAs of\nJune 30,\nAs of\nJune 30,\nDeposits to suppliers\n$\n203,020\n$\n179,286\nNote 8\n-\nProperty and equipment, net\nProperty and equipment, net consist of the following:\nTREASURE GLOBAL INC. AND SUBSIDIARY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nAs of\nJune 30,\nAs of\nJune 30,\nComputer and office equipment\n$\n151,205\n$\n17,273\nFurniture & fixtures\n76,148\n1,397\nMotor vehicle\n88,045\n93,555\nLeasehold improvement\n89,425\n-\nSubtotal\n404,823\n112,225\nLess: accumulated depreciation\n(67,178\n)\n(9,577\n)\nTotal\n$\n337,645\n$\n102,648\nDepreciation expense for the June 30, 2022 and 2021 amounted to $60,605 and $9,627, respectively.\nNote 9\n- Loans and notes\nLoans from third parties\nThe Company entered into a loan agreement with Aqtiq Solutions Sdn Bhd, a third party (the Agtiq Loan Agreement) dated June 27, 2022, pursuant to which Aqtiq Solutions Sdn Bhd provided the Company with a revolving loan facility to borrow up to RM 3,000,000 (approximately $0.7 million) bearing interest at 3.5% per annum, which is payable on demand. As of June 30, 2022, the Company had balance outstanding from this facility amounted to $668,923. On July 12, 2022, the Company has repaid the\nremaining\nbalance in full.\nThe Company entered into a loan agreement with Technovative Hub Sdn Bhd, a third party (the Technovative Loan Agreement) date June 27, 2022, pursuant to which Technovative Hub Sdn Bhd provided the Company with a revolving loan facility to borrow up to RM 4,000,000 (approximately $1.0 million) bearing interest at 3.5% per annum, which is payable on demand. As of June 30, 2022, the Company had balance outstanding form this facility amounted to $748,724. Subsequent to June 30, 2022, the Company had withdrew additional $567,215\nfrom this facility under the Technovative Loan Agreement and repaid the remaining balance in full on July 18, 2022.\nSenior Note\nOn June 30, 2021, the Company issued a 12% Redeemable Senior Note in the principal amount of $65,000 to Yong Kim Fong, a Malaysian citizen (the Fong Note). The Fong Note bears interest at 12.00% per annum and is due on the earlier of (x) the date on which our common stock is listed on Nasdaq and (y) July 1, 2024. The Fong Note is pre-payable in full, but not in part. As of June 30, 2022, the balance of the Fong Note is amounted to $65,000. On September 1, 2022, the Company has fully repaid the balance.\nConvertible Notes\nThe Company evaluated the convertible notes agreement under ASC 815 Derivatives and Hedging (ASC 815). ASC 815 generally requires the analysis embedded terms and features that have characteristics of derivatives to be evaluated for bifurcation and separate accounting in instances where their economic risks and characteristics are not clearly and closely related to the risks of the host contract. None of the embedded terms required bifurcation and liability classification.\nOn November 13, 2020, the Company issue a convertible note, to an accredited investor, in the aggregate principal amount of $2,123,600. Pursuant to the agreement, the note bear an interest rate of 13.33% per annum, payable (i) on December 31, 2020; (ii) during calendar year 2021, monthly on the last day of each month and (iii) during calendar years 2022 and 2023 until the Maturity Date, semiannually on each June 30 and December 31; provided that for calendar year 2023 the final interest payment date shall be the Maturity Date. The Company evaluated the convertible notes agreement under ASC 815, which generally requires the analysis embedded terms and features that have characteristics of derivatives to be evaluated for bifurcation and separate accounting in instances where their economic risks and characteristics are not clearly and closely related to the risks of the host contract. None of the embedded terms in the convertible notes required bifurcation and liability classification. However, the Company was required to determine if the debt contained a beneficial conversion feature (BCF), which is based on the intrinsic value on the date of issuance. The Company evaluated the convertible notes for a beneficial conversion feature in accordance with ASC 470-20 Debt with Conversion and Other Options. The Company determined that the conversion price ($4.00) was below the market price ($5.48) as per an enterprise per share value appraised from an independent third party, and the convertible notes contained a beneficial conversion feature. The Company recognized the intrinsic value of embedded conversion feature of $0 and $785,065 in the convertible notes as additional paid-in capital and reduced the carrying value of the convertible notes as a debt discount for the years ended June 30, 2022 and 2021, respectively.\nTREASURE GLOBAL INC. AND SUBSIDIARY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn addition, notes issuance costs in connection with this note amounted $212,360 and reduced\nthe carrying value of the convertible notes as a debt discount. The carrying value, net of debt discount, will be accreted over the term of the convertible notes from date of issuance to date of maturity using effective interest rate method. For the years ended June 30, 2022 and 2021, amortization of debt discount amounted to $466,232 and $238,917, respectively. As of June 30, 2022, convertible note balance from this accredited investor, net of unamortized discounts of $292,276 was amounted to $1,831,324.\nAs of June 30, 2021, convertible note balance from this accredited investor, net of unamortized discounts of $758,508 was amounted to $1,365,092.\nUpon completion of the Companys initial underwritten public offering on August 15, 2022, the above mentioned convertible note balance was converted into 530,900 shares of common stock. Meanwhile, additional 15,927 shares of common stock were\nissued to this accredited investor as success fees.\nOn January 3, 2022, the Company had entered into a loan agreement (the Tophill Loan Agreement 1) with a third party to borrow up to approximately $4.8 million with up to 3.5% per annum interest rate. The loan is due on demand together with interest accrued thereon. On March 14, 2022, the Company and above mentioned third party had made amendment to the Tophill Loan Agreement 1. Pursuant to the amendment, the aggregate outstanding principal amount of all Loans plus any accrued and unpaid interest (Loan balance) thereon as of the closing date of the IPO shall automatically converted into a number of shares of the Companys common stock equal to the Loan balance divided by 80% of the public offering price of the Companys common stock in the IPO; and the loan agreement shall terminate and no additional amounts under the loan agreement will be available to the Company and after taking into consideration the conversion of the Loan balance, no amount under any loan shall be outstanding. In addition, the Company entered into another Loan Agreement (the Tophill Loan Agreement 2) dated May 13, 2022 with Tophill, pursuant to which Tophill provided the company with a revolving loan facility to borrow up to RM 50,000,000 (approximately $11.9 million) bearing interest at 3.5% per annum, which is payable on demand. Meanwhile, the agreement provide that (i) all principal and accrued and unpaid interest outstanding under the Tophill Loan Agreement 2 on the closing of the Companys initial public offering will automatically be converted into shares of the Companys common stock at a conversion price that is equal to 80% of the initial public offering price and (ii) the Tophill Loan Agreement 2 terminates on the closing date of the Companys initial public offering. The Company evaluated the loan agreement under ASC 815, which generally requires the analysis embedded terms and features that have characteristics of derivatives to be evaluated for bifurcation and separate accounting in instances where their economic risks and characteristics are not clearly and closely related to the risks of the host contract. None of the embedded terms in the loan required bifurcation and liability classification. However, the Company was required to determine if the debt contained a beneficial conversion feature (BCF), which is based on the intrinsic value on the date of issuance. The Company evaluated the loan for a beneficial conversion feature in accordance with ASC 470-20 Debt with Conversion and Other Options. The Company determined that the conversion price ($4.38) was below the market price ($5.48) as per an enterprise per share value appraised from an independent third party, and the loan contained a beneficial conversion feature. The Company recognized the intrinsic value of embedded conversion feature of $1,231,610 and nil in the loan additional paid-in capital and reduced the carrying value of the loan as a debt discount for the years ended June 30, 2022 and 2021, respectively. The carrying value, net of debt discount, will be accreted over the term of the term of the loan from date of issuance to date of maturity using effective interest rate method, recorded as current liabilities. For the years ended June 30, 2022 and 2021, amortization of debt discount for the loan amounted to $800,629 and nil, respectively. As of June 30, 2022, the convertible note balance from Tophill Loan Agreement 1 and Agreement 2, net of unamortized discounts of $424,984, was amounted to $5,542,231. Subsequent to June 30, 2022, the Company has withdrew additional amount of approximately $2.7 million from this facility under the Tophill Loan Agreement 2. Upon completion of the Companys initial underwritten public offering on August 15, 2022, the remaining principal and accrued interest balance related to Tophill Loan Agreement 1 and Agreement 2 amounted to approximately $8.6 million was converted into 2,756,879 shares of common stock.\nIn May, and June 2021, the Company issue various batches of convertible notes to 5 accredited investors which included 4\nthird parties in the aggregate principal amount of $2,210,361 and 1\nrelated parties in the aggregate principal amount of $ 1,400,000 (see note 11). In July, September, October, and December 2021, the Company issue various batches of convertible notes to 7 accredited investors which included 3\nthird parties in the aggregate principal amount of $1,370,126 and 4\nrelated parties in the aggregate principal amount of $1,037,574\n.\nAs of June 30, 2022\n, the Company\naccumulatively\nissue various batches of convertible notes to 10\naccredited investors\nwhich included 5\nthird parties in the aggregate principal amount of $3,580,488 and 5\nrelated parties in the aggregate principal amount of $2,437,574 (see Note 11\n).\nPursuant to the agreement, the maturity date is 36 months after the issuance, provided that if an IPO listing is not successful, the accredited investors should be entitled to require the Company to redeem the convertible notes at the subscription/conversion of $6.90 per share along with interest payable at the rate of 12% per annum. The Company also evaluated the convertible notes agreement under ASC 815 and determined none of the embedded terms in the convertible notes required bifurcation and liability classification. However, the Company was required to determine if the debt contained a BCF and determined that the conversion price ($6.90) was above the market price ($5.48) as per an enterprise per share value appraised from an independent third party, and the convertible notes do not contain a beneficial conversion feature. As a result, the Company record the proceeds received from these convertible notes as a liability in its entirely. As of June 30, 2022, the convertible note balance from\nthird parties and related parties\naccredited investors was amounted to $3,580,488\na\nnd\n$\n2,437,574, respectively.\nUpon completion of the Companys initial underwritten public offering on August 15, 2022, the balance of these convertible notes as mentioned above was converted into 872,183 shares of common stock.\nTREASURE GLOBAL INC. AND SUBSIDIARY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nThe Company has convertible notes payable, net of unamortized discounts as follows:\nFace value of\nconvertible notes\npayable\nUnamortized\ndebt discounts\nConvertible\nnotes\npayable, net of\nunamortized\ndiscounts\nThird parties\nRelated parties\nJune 30, 2020 balance\n$\n-\n$\n-\n$\n-\n$\n-\n$\n-\nIssuance of convertible notes\n5,733,961\n(997,425\n)\n4,736,536\n3,336,536\n1,400,000\nAmortization of debt discounts\n-\n238,917\n238,917\n238,917\n-\nJune 30, 2021 balance\n5,733,961\n(758,508\n)\n4,975,453\n3,575,453\n1,400,000\nIssuance of convertible notes\n8,374,915\n(1,231,610\n)\n7,143,305\n6,105,731\n1,037,574\nAmortization of debt discounts\n-\n1,266,861\n1,266,861\n1,266,861\n-\nExchange rate effect\n-\n5,997\n5,997\n5,997\n-\nJune 30, 2022 balance\n$\n14,108,876\n$\n(717,260\n)\n$\n13,391,616\n$\n10,954,042\n$\n2,437,574\nFor the years ended June 30, 2022 and 2021, interest expenses related to the aforementioned convertible notes amounted to $340,277 and $163,158 respectively.\nNote 10\n- Other payables and accrued liabilities\nAs of\nJune 30,\nAs of\nJune 30,\nAccrued professional fees (i)\n$\n910,186\n$\n265,672\nAccrued promotion expenses (ii)\n41,476\n45,334\nAccrued payroll\n112,069\n76,282\nAccrued interest (iii)\n92,686\n70,223\nOthers\n5,443\n1,088\nTotal other payables and accrued liabilities\n$\n1,161,860\n$\n458,599\n(i)\nAccrued professional fees\nThe balance of accrued professional fees represented amount due to third parties service providers which include marketing consulting service, IT related professional service, audit fee, and consulting fee related to capital raising. In addition, the balance of accrued professional fees also consist of consulting fee which the Company agree to compensate the consultant by issuing 300,000 warrants exercisable for a period of 5 years at $4.00 per share. On August 15, 2022, the Company had issued the warrants to the consultant upon completion of its initial underwritten public offering. The value of the consulting fee was estimated by the fair value of the warrants which was determined by using the Black Scholes model using the following assumptions: (1) expected volatility of 49.0%, (2) risk-free interest rate of 0.89%, (3) expected life of 5.0 years, (4) exercise price of $4.0 and (5) estimated market price of $5.48 on July 1, 2020, the date of which the consulting agreement was entered. The consulting fee was estimated to be $856,170 for the year ended June 30, 2022.\n(ii)\nAccrued promotion expense\nThe balance of accrued promotion expense represented the balance of profit sharing payable to the Companys merchant and subscribed agents to promote business growth.\nTREASURE GLOBAL INC. AND SUBSIDIARY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\n(ii\ni)\nAccrued interest\nThe balance of accrued interest represented the balance of interest payable from convertible note aforementioned in Note 9\n.\nNote 11\n- Related Party balances and transactions\nRelated party balances\nAccount receivable, a related party\nName of Related Party\nRelationship\nNature\nAs of\nJune 30,\nAs of\nJune 30,\nEzytronic Sdn Bhd\nJau Long Jerry Ooi is the common shareholder\nSales of products\n$\n-\n$\n10,317\nAmount due from related parties\nName of Related\nParty\nRelationship\nNature\nAs of\nJune 30,\nAs of\nJune 30,\nMatrix Ideal Sdn Bhd\nYu Weng Lok is a common shareholder\nAdvance due on demand\n$\n-\n$\nTreasure Global, Inc (Cayman)\nRelative of Kok Pin Darren Tan is the shareholder of this Company\nAdvance due on demand\n-\n60,548\nTotal\n$\n-\n$\n60,910\nConvertible notes payable, related parties\nName of Related Party\nRelationship\nNature\nAs of\nJune 30,\nAs of\nJune 30,\n(As Revised)\nChuah Su Mei\nSpouse of Kok Pin Darren Tan, shareholder of TGI\nCLN\n$\n240,444\n$\n-\nClick Development\nBerhad\nShareholder of TGI\nCLN\n120,235\n-\nCloudmaxx Sdn Bhd\nJau Long Jerry Ooi and Kok Pin Darren Tan are common shareholder\nCLN\n568,305\n-\nV Capital Kronos\nBerhad\nShareholder of TGI, and Voon Him Victor Hoo is the common shareholder\nCLN\n1,400,000\n1,400,000\nWorld Cloud Ventures Sdn Bhd\nJau Long Jerry Ooi is the common shareholder\nCLN\n108,590\n-\nTotal\n$\n2,437,574\n$\n1,400,000\nConvertible notes payable, related parties-current portion\n$\n2,437,574\n$\n-\nConvertible notes\npayable, related parties\n-non-current portion\n$\n-\n$\n1,400,000\nPursuant to the convertible note agreement related to above convertible notes payable, related parties, the convertible note shall not be interest bearing if the Company completes its\ninitial underwritten public offering within the 36 months from the date of issuance of the convertible note\n, unless it has not been converted by the third anniversary of its issuance date, in which case it shall bear interest from the time of issuance at 12% per annum.\nAs the Company completed its initial underwritten public offering on August 15, 2022, no interest expenses pertained to above convertible notes payable, related parties were accrued for the years\nJune 30, 2022 and 2021.\nAccount payable, related parties\nName of Related Party\nRelationship\nNature\nAs of\nJune 30,\nAs of\nJune 30,\nEzytronic Sdn Bhd\nJau Long Jerry Ooi is the common shareholder\nPurchase of inventories\n$\n4,229\n$\nMatrix Ideal Sdn Bhd\nYu Weng Lok is a common shareholder\nPurchase of inventories\n-\n159,670\nThe Evolutionary Zeal Sdn Bhd\nShareholder of TGI\nPurchase of inventories\n9,034\n-\nWorld Cloud Ventures Sdn Bhd\nJau Long Jerry Ooi is a common shareholder\nPurchase of inventories\n1,063\nTotal\n$\n14,326\n$\n160,701\nCustomer deposits, related parties\nName of Related Party\nRelationship\nNature\nAs of\nJune 30,\nAs of\nJune 30,\nThe Evolutionary Zeal Sdn Bhd\nShareholder of TGI\nDeposit for I.T professional service\n$\n-\n$\n76,846\nClick Development\nBerhad\nShareholder of TGI\nDeposit for I.T professional service\n-\n76,846\nVICOMM\nResources Sdn Bhd\nShareholder of TGI\nDeposit for I.T professional service\n-\n41,819\nTotal\n$\n-\n$\n195,511\nOther payables, related parties\nName of Related Party\nRelationship\nNature\nAs of\nJune 30,\nAs of\nJune 30,\n(As Revised)\nV Capital Investment Limited\nVoon Him Victor Hoo, the Companys Chairman and Managing Director is the director of this entity. Consulting fees\n$\n-\n$\n85,000\nTrue Sight Sdn Bhd\nSu Huay Sue Chuah, the Companys Chief Marketing Officer is the shareholder of this entity\nConsulting fee\n-\n28,402\nTotal\n$\n-\n$\n113,402\nTREASURE GLOBAL INC. AND SUBSIDIARY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nAmount due to related parties\nName of Related Party\nRelationship\nNature\nAs of\nJune 30,\nAs of\nJune 30,\nChong Chan Sam Teo\nShareholder of TGI\nInterest-free loan, due on demand\n$\n197,480\n$\n209,839\nKok Pin Darren Tan*\nShareholder of TGI\nInterest-free loan, due on demand\n1,862,608\n2,103,692\nCloudmaxx Sdn Bhd\nJau Long Jerry Ooi and Kok Pin Darren Tan are common shareholder\nInterest-free loan, due on demand\n-\n289,303\nWorld Cloud Ventures Sdn Bhd\nJau Long Jerry Ooi is a common shareholder\nInterest-free loan, due on demand\n-\n1,405,951\nTotal\n$\n2,060,088\n$\n4,008,785\n*As of\nDecember\n, 2022, the Company has repaid $1,728,225 to Kok Pin Darren Tan.\nRelated party transaction\nRevenue from related parties\nName of Related Party\nRelationship\nNature\nFor the year ended June 30, 2022\nFor the year ended June 30, 2021\nEzytronic Sdn Bhd\nJau Long Jerry Ooi is a common shareholder\nSales of products\n$\n166,139\n$\n67,595\nMatrix Ideal Sdn Bhd\nYu Weng Lok is a common shareholder\nSales of products\n2,837\n-\nTotal\n$\n168,976\n$\n178,939\nPurchase from related parties\nName of Related Party\nRelationship\nNature\nFor the year ended June 30,\nFor the year ended June 30, 2021\nEzytronic Sdn Bhd\nJau Long Jerry Ooi is a common shareholder\nPurchase of products\n$\n54,328\n$\n19,269\nMatrix Ideal Sdn Bhd\nYu Weng Lok is a common shareholder\nPurchase of products\n-\n159,670\nWorld Cloud Ventures Sdn Bhd\nShareholder of TGI\nPurchase of Services\n48,259\n-\nThe Evolutionary Zeal Sdn Bh\nd\nJay Long Jerry Ooi is a common shareholder\nPurchase of products\n18,824\n-\nTotal\n$\n121,411\n$\n178,939\nConsulting fees from related parties\nName of Related Party\nRelationship\nNature\nFor the Year Ended\nJune 30,\nFor the Year Ended\nJune 30,\n(As Revised)\nV Capital Investme\nnt Limited\nVoon Him Victor Hoo, the Companys Chairman and Managing Director is the director of this entity beginning on June 1, 2021. Consulting fees\n$\n75,000\n$\n25,000\nTrue Sight Sdn Bhd\nSu Huay Sue Chuah, the Companys Chief Marketing Officer is a 40% shareholder of this entity\nConsulting fees\n615,367\n207,894\nTotal\n$\n690,367\n$\n232,894\nTREASURE GLOBAL INC. AND SUBSIDIARY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nRelated party loan\nOn December 7, 2020, the Company obtained right of use of a vehicle through signing a trust of deed with Chan Chong Sam Teo, the Chief Executive Officer and a shareholder of TGI. In return, the Company is obligated to remit monthly installment auto loan payment related to this vehicle on behalf of the related party mentioned above. The total amount of loan that the Company is entitled to repay is approximately $27,000 (RM 114,000\n). The auto loan bear 5.96% of interest rate per annum with 60 equal monthly installment payment due on the first of each month. As of June 30, 2022, such loan has an outstanding balance of $18,388, of which $13,883 due after 12 months period and classified as related party loan, non-current portion. The interest expense was $1,333 and $787 during the years ended June 30, 2022 and 2021\nNote 12\n-\nStockholders Deficiency\nCommon stock\nAs of June 30,\n2021, TGI is authorized to issue 10,000,000 shares having a par value of $0.00001 per share. In October 2021, TGI increased its authorized shares to 170,000,000 shares as part of the Reorganization with GEM, consisting of 150,000,000 shares of common stock with $0.00001 par value, and 20,000,000 shares of preferred stock with $0.00001 par value. The share capital increased of TGI presented herein is prepared on the basis as if the Reorganization became effective as of the beginning of the first period presented of shares capital of GEM.\nCapital contributions\nFor years ended June 30, 2022 and 2021, the Companys shareholders made capital contributions of $0 and $240,754 to the Company, respectively.\nBeneficial conversion feature from issuance of convertible note\nOn November 13, 2020, the Company issue a convertible note, to an accredited investor, in the aggregate principal amount of $2,123,600. The Company determined that convertible notes contained a beneficial conversion feature. As a result, the Company recognized the fair value of embedded conversion feature of $785,065 in the convertible notes as additional paid-in capital and reduced the carrying value of the convertible notes as a debt discount for year ended June 30, 2021.\nOn January 3, 2022 and May 13, 2022, the Company entered into 2 loan agreements which allow the third party to convert the loan balance into a number of shares of the Companys common stock as of the closing date of the IPO. As of June 30, 2022, the loan in the aggregate principal amount of $5,967,215. The Company determined that loan contained a beneficial conversion feature. As a result, the Company recognized the fair value of embedded conversion feature of $1,231,610 in the convertible notes\nas additional paid-in capital and reduced the carrying value of the convertible notes as a debt discount for the year ended June 30, 2022.\nCommon stock issued for consulting service\nIn July 2021 the Company signed a capital market advisory agreement (Agreement) with Exchange Listing, LLC (Consultant), to engage in advisory service in capital market advisory, corporate governance, and organizational meeting. The term of this Agreement shall commence on the execution date and shall continue until the later of nine months or until the Company is trading on a senior exchange or otherwise extended by both parties. The Company extended the contract term until the Company is trading on a senior exchange. Upon execution of this agreement, the Company will issue 300,000 warrants to the Consultant or its designees exercisable for a period of five years at $4.00 per share.\nThe fair value of the warrants is estimated as of the date of grant using\nthe Black-Scholes-Merton option-pricing model with the following assumptions: (1) expected volatility of 49.0%, (2) risk-free interest rate of 0.89%, (3) expected life of 5.0 years, (4) exercise price of $4.00 and (5) stock price of $5.48.\nOn August 15, 2022, the Company had issued the warrants to the Consultant upon completion of its initial underwritten public offering. Meanwhile, on the same date, the Consultant had exercised 157,143 warrants into the Companys common stock using cashless exercising method\n.\nTREASURE GLOBAL INC. AND SUBSIDIARY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn addition, the Company agrees to sell to the Consultant, or its designees shares of the Companys common stock which equivalents to 2% of the Companys fully - diluted shares outstanding, at $0.001 per share. The Company determined the fair value of the common stock issued to the Consultant by using the market price $5.48 per share as per an enterprise per share value appraised from an independent third party. For the year ended June 30, 2022, the Company has issued 232,666 shares of common stock to the Consultant and the stock-based compensation in connection with the service period of these shares amounted to $1,283,994. In August 2022, after completion of the Companys initial underwritten public offering, the Company had collectively issued 342,499 shares of common stock which equivalents to 2% of the Companys fully - diluted shares outstanding to the Consultant.\nNote 13\n- Income taxes\nThe United States and foreign components of loss before income taxes were comprised of the following:\nFor the years ended\nJune 30,\nTax jurisdictions from:\n- Local - United States\n$\n(3,541,832\n)\n$\n(3,557,326\n)\n- Foreign - Malaysia\n(8,188,582\n)\n(4,364,254\n)\nLoss before income tax\n$\n(11,730,414\n)\n$\n(7,921,580\n)\nThe provision for income taxes consisted of the following:\nFor the years ended\nJune 30,\nTax jurisdictions from:\n- Local - United States\n$\n15,600\n$\n2,000\n- Foreign - Malaysia\n-\n-\nProvision for income taxes\n$\n15,600\n$\n2,000\nUnited States of America\nTGI was incorporated in the State of Delaware and is subject to the tax laws of the United States of America. As of June 30, 2022, the operations in the United States of America incurred $1,543,542 of cumulative net operating losses which can be carried forward indefinitely to offset future taxable income. The deferred tax valuation allowance as of June 30, 2022 and 2021 were $324,144 and $747,038, respectively.\nTGI also subject to controlled foreign corporations Subpart F income (Subpart F) tax, which is a tax primarily on passive income from controlled foreign corporations with a tax rate of 35%. In addition, the Tax Cuts and Jobs Act imposed a global intangible low-taxed income (GILTI) tax, which is a tax on certain off-shore earnings at an effective rate of 10.5% for tax years (50% deduction of the current enacted tax rate of 21%) with a partial offset for 80% foreign tax credits. If the foreign tax rate is 13.125% or higher, there will be no U.S. corporate tax after the 80% foreign tax credits are applied.\nFor the years ended June 30, 2022 and 2021, the Companys foreign subsidiaries did not generate any income that are subject to Subpart F tax and GILTI tax.\nMalaysia\nGEM is governed by the income tax laws of Malaysia and the income tax provision in respect of operations in Malaysia is calculated at the applicable tax rates on the taxable income for the periods based on existing legislation, interpretations and practices in respect thereof. Under the Income Tax Act of Malaysia, enterprises that incorporated in Malaysia are usually subject to a unified 24% enterprise income tax rate while preferential tax rates, tax holidays and even tax exemption may be granted on case-by-case basis. As of June 30, 2022, the operations in the Malaysia incurred $12,631,440 of cumulative net operating losses which can be carried forward for a maximum period of seven consecutive years to offset future taxable income. The deferred tax valuation allowance as of June 30, 2022 and 2021 were $3,031,546 and $1,066,286, respectively.\nTREASURE GLOBAL INC. AND SUBSIDIARY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nThe following table reconciles the local (United States) statutory rates to the Companys effective tax rate for the periods indicated below:\nFor the years ended\nJune 30,\nU.S. statutory rate\n21.0\n%\n21.0\n%\nDifferential of Malaysia statutory tax rate\n2.1\n%\n3.0\n%\nChang in valuation allowance\n(15.9\n)%\n(24.0\n)%\nPermanent difference (1)\n(7.3\n)%\n(0.1\n)%\nEffective tax rate\n(0.1\n)%\n(0.1\n)%\n(1)\nPermanent difference consists of legal and professional fee\nnet with the IPO proceeds,\nwhich is non-deductible in the Companys tax return.\nThe following table sets forth the significant components of the aggregate deferred tax assets of the Company as of:\nAs of\nJune 30,\nAs of\nJune 30,\nDeferred tax assets:\nNet operating loss ca\nrry forwards in U.S.\n$\n324,144\n$\n747,038\nNet operating loss carry forwards in Malaysia\n3,031,546\n1,066,286\nStock based compensation\n179,796\n-\nAmortization of debt discount\n148,081\n-\nLess: valuation allowance\n(3,683,567\n)\n(1,813,324\n)\nDeferred tax assets\n$\n-\n$\n-\nUncertain tax positions\nThe Company evaluates each uncertain tax position (including the potential application of interest and penalties) based on the technical merits, and measure the unrecognized benefits associated with the tax positions. As of June 30, 2022 and 2021, the Company did not have any significant unrecognized uncertain tax positions. The Company did not incur interest and penalties tax for the years ended June 30, 2022 and 2021.\nNote 14\n-\nConcentrations of risks\n(a) Major customers\nFor the year ended June 30, 2022, no customer accounted for 10.0% or more of the Companys total revenues. For the year ended June 30, 2021, no customer accounted for 10.0% or more of the Companys total revenues.\nAs of June 30, 2022, no customer account for 10.0% or more of the total balance of accounts receivable. As of June 30, 2021, one customer accounted for 100% of the total balance of accounts receivable.\n(b) Major vendors\nFor the year ended June 30, 2022 one vendor accounted for approximately 95% of the Companys total purchases. For the year ended June 30, 2021, one vendor accounted for approximately 86.2% of the Companys total purchases.\nTREASURE GLOBAL INC. AND SUBSIDIARY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nAs of June 30, 2022, three vendors accounted for approximately 45.0%, 22.9%, and 10.9% of the total balance of accounts payable\n, respectively\n. As of June 30, 2021, three vendors accounted for approximately 38.7%, 16.6% and 14.0% of the total balance of accounts payable, respectively.\n(c) Credit risk\nFinancial instruments that potentially subject the Company to significant concentrations of credit risk consist primarily of cash. As of June 30, 2022 and 2021, $1,845,232 and $2,843,398 were deposited with financial institutions or fund received from customer being held in third party platforms fund account, respectively, $1,759,715 and $2,456,102 of these balances are not covered by deposit insurance. While management believes that these financial institutions are of high credit quality, it also continually monitors their credit worthiness.\nFinancial instruments that are potentially subject to credit risk consist principally of accounts receivable. The Company believes the concentration of credit risk in its account receivable is substantially mitigated by its ongoing credit evaluation process and relatively short collection terms. The Company does not generally require collateral from customers. The Company evaluates the need for an allowance for doubtful accounts based upon factors surrounding the credit risk of specific customers, historical trends and other information.\n(d) Exchange rate risk\nThe Company cannot guarantee that the current exchange rate will remain steady; therefore, there is a possibility that the Company could post the same amount of profit for two comparable periods and because of the fluctuating exchange rate actually post higher or lower profit depending on exchange rate of RM converted to US$ on that date. The exchange rate could fluctuate depending on changes in political and economic environments without notice.\nNote 15\n-\nCommitments and contingencies\nLease commitments\nThe Companys commitment for minimum lease payments under the remaining operating leases as of June 30, 2022 for the next five years is as follows:\nYears Ending\nJune 30,\nAmount\n$\n37,300\n37,300\n18,650\nTotal lease payments\n$\n93,250\nRent expense for the years ended June 30, 2022 and 2021 was $35,032 and $25,895, respectively.\nContingencies\nLegal\nFrom time to time, the Company is party to certain legal proceedings, as well as certain asserted and un-asserted claims. Amounts accrued, as well as the total amount of reasonably possible losses with respect to such matters, individually and in the aggregate, are not deemed to be material to the consolidated financial statements.\nCOVID-19\nSince the declaration of the COVID-19 a pandemic on March 11, 2020, by the World Health Organization or WHO, Malaysia has been put through various stages of lockdowns such as (1) full movement control orders (MCO), under which, quarantines, travel restrictions, and the temporary closure of stores and facilities in Malaysia were made mandatory, (2) MCO were eased to a Conditional Movement Control Order (CMCO) where most business sectors were allowed to operate under strict rules and Standard Operating Procedures mandated by the government of Malaysia and (3) CMCO were further relaxed to Recovery Movement Control Order (RMCO). On January 12, 2021, due to a resurgence of COVID-19 cases, the Malaysian government declared a state of emergency nationwide to combat COVID-19. Intermittent lockdowns were imposed in various states and districts in the country. February 2021 marked a significant month for Malaysia as all frontline staff of the country, which comprised those in healthcare, police, the Volunteers Department of Malaysia, the Fire and Rescue Department of Malaysia and civil defense sectors were vaccinated. On February 16, 2021, Prime Minister, Tan Sri Muhyiddin Yassin announced that a National COVID-19 Immunization Plan will be implemented for one year after February 2021, which 80% of the Malaysia population will be vaccinated to achieve herd immunization. On March 5, 2021, lockdowns in most part of the country was eased to a CMCO, nevertheless, COVID-19 cases in the country continue to rise. On May 12, 2021, Malaysia was again put under a full lockdown nationwide, until the earlier of (i) daily COVID-19 cases infection of the country fall below 4,000; (ii) intensive Unit Care, or ICU, wards start operating at a moderate level; or (iii) 10% of the Malaysian population is fully vaccinated. The country was administering over 400,000 doses of COVID-19 vaccines daily. On July 17, 2021, the full lockdown was slightly eased as 13.9% of the Malaysian population was fully vaccinated, with another 30% having received at least one dose of the vaccine. The COVID-19 situation in the country showed no sign of abating. Kuala Lumpur and Selangor remained the epicenter of the latest wave of infections. Total COVID-19 cases in the country surpassed the one million mark on July 25, 2021, and daily cases hit a record high of 24,599 on August 26, 2021. Despite the deteriorating COVID-19 state, the government lifted Kuala Lumpur from Enhanced Movement Control Order (EMCO) ahead of schedule and ended the nationwide state of emergency on August 1, 2021. Parliament met for the first time this year on July 26, 2021. Malaysia pressed on with its National COVID-19 Immunization Plan, fast inoculating its residents. COVID-19 infection started to drop below the 10,000 mark daily, beginning October 3, 2021. Effective October 11, 2021, interstate and international travel restrictions were lifted for residents who had been fully vaccinated against COVID-19 as the country achieved its target of inoculating 90% of its adult population. The government is preparing to shift into an endemic COVID-19 phase where it will not impose wide lockdowns even if cases rise. As of September 13, 2022, over 85% of the countrys population have been fully vaccinated\n.\nTREASURE GLOBAL INC. AND SUBSIDIARY\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nSubstantially all of the Companys revenues are concentrated in Malaysia. Consequently, the Companys results of operations will likely be adversely, and may be materially, affected, to the extent that the COVID-19 or any other epidemic harms the Malaysia and global economy in general. Any potential impact to the results will depend on, to a large extent, future developments and new information that may emerge regarding the duration and severity of the COVID-19 and the actions taken by government authorities and other entities to contain the COVID-19 or treat its impact, almost all of which are beyond the Companys control. Potential impacts include, but are not limited to, the following:\n●\ntemporary closure of offices, travel restrictions, financial impact of the Companys customers may be negatively affected, and could continue to negatively affect the demand for the Companys product;\n●\nthe Company may have to provide significant sales incentives to its customers during the outbreak, which may in turn materially adversely affect its financial condition and operating results; and\n●\nthe Company may experience a slow-down in hiring new personnel which may adversely impact on the Companys business operation.\nBecause of the uncertainty surrounding the COVID-19 outbreak, the financial impact related to the outbreak of and response to the COVID-19 cannot be reasonably estimated at this time.\n-\nSUBSEQUENT EVENTS\nThe Company evaluated all events and transactions that occurred after June 30, 2022 up through the date the Company issued these consolidated financial statements on December 5, 2022.\nIn July 2022, the Company has drawn additional approximately $2.7 million from Tophill Loan Agreement 2 (Agreement 2) on terms identical to the Tophill Loan Agreement 1 which all principal and accrued and unpaid interest outstanding will automatically be converted into shares of our common stock at a conversion price that is equal to 80% of the initial public offering price.\nUpon completion of the Companys initial underwritten public offering on August 15, 2022, the remaining principal and accrued interest balance related to Tophill Loan Agreement 1 and Agreement 2 amounted to approximately $8.6 million was converted into 2,756,879 shares of common stock with conversion price of $3.13.\nOn August 10, 2022, the Company entered into an underwriting agreement (the Underwriting Agreement) with EF Hutton, division of Benchmark Investments, LLC, as representative of the underwriters named on Schedule 1 thereto (the Representative), relating to the Companys initial public offering (the Offering) of 2,000,000 shares (the Firm Shares) of the Companys common stock, par value $0.00001 per share, at an Offering price of $4.00 per share. Pursuant to the Underwriting Agreement, in exchange for the representatives firm commitment to purchase the Shares, the Company agreed to sell the shares to the representative at a purchase price of $3.72 (93% of the public offering price per Share of $4.00); provided however, that with respect to shares that relate to investors sourced by the Company, the purchase price for such shares will be $3.86 per share (96.5% of the public offering price per Share of $4.00) and issue the underwriters warrants (the Representatives Warrants) to purchase an aggregate of 100,000 shares of the Companys common stock, which is equal to five percent (5%) of the shares sold in the Offering, excluding the over-allotment option, at an exercise price of $5.00, which is equal to 125% of the Offering price. The representatives warrant may be exercised beginning on February 10, 2023, until August 10, 2027. On August 11, 2022, the representative delivered an exercise notice to the Company which exercised its over-allotment option in full to purchase an additional 300,000 shares (the Option Shares and together with the Firm Shares, the Shares) under the Underwriting Agreement.\nAs of date of this report, the Company has received approximately $1.1 million\nupon the Representative exercised its over-allotment option.\nTREASURE GLOBAL INC. AND SUBSIDIARY\nNOTES TO CONSOLIDATED FINANCIAL\nSTATEMENTS\nOn August 15, 2022, the Company had closed its\ninitial\nunderwritten public offering of 2,300,000 shares of common stock, which included the full exercise of the underwriters over-allotment option, at a public prince of $4.00 per share. The Company received net proceeds of approximately $8.2 million, net of underwriting discounts and commissions and fees, and other estimated offering expenses amounted to approximately $1.0 million.\nMeanwhile the Company had issued\n4,175,889 shares of the Companys common stock to various third parties and related parties investor upon conversion of the convertible note payable balance.\nOn August 15, 2022, the Company had issued additional 109,833 shares of common stock to Exchange listing\n, LLC (Consultant) to\nensure that the Consultants total shares of the Companys common stock equivalents to 2% of the Companys fully - diluted shares outstanding in accordance with the capital market advisory agreement (Agreement) with the Consultant. In addition, the Company also issued 300,000 warrants to the Consultant or its designees exercisable for a period of five years at $4.00 per share upon completion of the Companys Offering. Meanwhile, on the same date, the Consultant had exercised all of its warrants on cashless basis and received 157,143 shares of the Companys common stock. Item 9. Changes in and Disagreements With Accountants on Accounting and Financial Disclosures\nNone. Item 9A. Controls and Procedures\nEvaluation of Disclosure Controls and Procedures\nOur disclosure controls and procedures are designed to ensure that the information we are required to disclose in reports that we file or submit under the Securities Exchange Act of 1934, as amended (the Exchange Act) is recorded, processed, summarized, and reported within the time periods specified in SEC rules and forms, and that such information is accumulated and communicated to our management to allow timely decisions regarding required disclosure.\nOur management, with the participation and supervision of our Chief Executive Officer and our Chief Financial Officer, have evaluated the effectiveness of our disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) under the Exchange Act) as of the end of the period covered by this annual report. Based on such evaluation, our Chief Executive Officer and Chief Financial Officer have concluded that as of such date, our disclosure controls and procedures were not, in design and operation, effective as of June 30, 2022 at a reasonable assurance level due to the material weaknesses in internal control over financial reporting described below:\n·\nwe did not have sufficient full-time personnel with appropriate levels of accounting knowledge and experience to monitor the daily recording of transactions, address complex United States of America generally accepted accounting principles (U.S. GAAP) accounting issues and to prepare and review financial statements and related disclosures under U.S. GAAP;\n·\nwe lack of a functional internal audit department or personnel that monitors the consistencies of the preventive internal control procedures and lack of adequate policies and procedures in internal audit function to ensure that our policies and procedures have been carried out as planned;\n·\nwe lack of proper procedures developed and implemented for IT risk assessment\nand vulnerability management\n;\n·\nwe lack of proper procedures developed and implemented for access to systems and date, which include user account management and password management;\n·\nwe lack of proper procedures developed and implemented for segregation of duties and related monitoring; and\n·\nwe lack of proper procedures identified related party transaction which lead to revision of previously issued financial statements (See Note 2 of the accompanying consolidated\nfinancial statement footnotes).\n·\nwe lack of proper procedures developed and implemented for third party IT service vendor risk assessment and management\n.\nA material weakness is a deficiency, or a combination of deficiencies, within the meaning of PCAOB Auditing Standard AS 2201, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of the Companys annual or interim financial statements will not be prevented or detected on a timely basis.\nFollowing the identification of the material weaknesses, we plan to take remedial measures including:\n·\nhiring more qualified accounting personnel with relevant U.S. GAAP and SEC reporting experience and qualifications to strengthen the financial reporting function and to set up a financial and system control framework;\n·\nimplementing regular and continuous U.S. GAAP accounting and financial reporting training programs for our accounting and financial reporting personnel;\n·\ndevelop policies and procedures for IT risk assessment;\n●\ndevelop policies and procedures for\nuser account management and password management compliance\n;\n●\ndevelop policies and procedures for IT risk assessment for segregation of duties and related monitoring;\n·\nestablishing internal audit function by engaging an external consulting firm to assist us with assessment of Sarbanes-Oxley Act compliance requirements and improvement of overall internal control; and\n·\nstrengthening corporate governance.\nEvaluation of Internal Controls over Financial Reporting\nThis annual report does not include a report of managements assessment regarding internal control over financial reporting or an attestation report of our registered public accounting firm due to a transition period established by the rules of the SEC for newly public companies.\nChanges in Internal Control Over Financial Reporting\nThere were no changes in our internal control over financial reporting identified in management's evaluation pursuant to Rules 13a-15(f) and 15d-15(f) under the Exchange Act during the quarter ended June 30, 2022 that materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. Item 9B. Other Information.\nNone.\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNot applicable.\nPART III Item 10. Directors, Executive Officers and Corporate Governance\nThe following are our executive officers and directors and their respective ages and positions as of December 5, 2022\n.\nName\nAge\nPosition\nVoon Him Victor Hoo\nChairman and Managing Director\nChong Chan Sam Teo\nChief Executive Officer, Director\nSu Chen Chanell Chuah\nChief Operating Officer\nYee Fei Jaylvin Chan\nChief Financial Officer\nSu Huay Sue Chuah\nChief Marketing Officer\nChen Hoe Samuel Sam\nChief Technology Officer\nJau Long Jerry Ooi\nVice President\nJoseph R. Bobby Banks\nDirector\nMarco Baccanello\nDirector\nJeremy Roberts\nDirector\nVoon Him Victor Hoo\nis our Chairman of the Board and Managing Director. Mr. Hoo is an investor, board member, venture capitalist with senior management experience and 15 years of cross continents experience that includes Asia, Australia, Europe, UK and US across diversified industries which encompasses IT, real estate, telecom, aerospace, security, defense, mining, HCM, fintech, blockchain, entertainment, hospitality and education. From 2013 to present Mr. Hoo has been the founder and executive chairman of V Capital Group (VCG), a business and technology consulting investment group. The group currently advises a portfolio of more than 30 public listed clients with total market capitalization in excess of $12 billion. From 2015 to 2017 Mr. Hoo was the Executive Chairman of the Pixie Group Limited, a consumer discretionary company listed on the Australian Stock Exchange. From 2013 to 2018 Mr. Hoo was the Chief Financial Officer, Chief Investor Relations Officer and Board member of Capital Investments Limited, an incubator fund manager. Mr. Hoo has a BA from University of Queensland in International Relations and Japanese; Postgraduate in Law from the University of London and an Oxford Blockchain Programme Certificate from Said Business School, Oxford University.\nChong Chan Sam Teo\nis our Chief Executive Officer and a Director. Mr. Teo is an experienced corporate strategist who has contributed to building high-performance teams through implementation of organizational innovation within multiple companies operating in the fintech and ecommerce fields. Prior to this role, Mr. Teo served as Chief Operations Officer of the Company from July 2020 to June 2021, where he, among other things, led sales and strategic business development. From March 2020 to June 2021, Mr. Teo was the Chief Executive Officer of GEM, leading GEM in strategic/tactical planning, forecasting, capital budgeting, and financial cost controls. Prior to that role, Mr. Teo served as Director of Business Development of GEM from May 2018 to February 2020, where he was in charge of sales and business development. From May 2016 to April 2018, Mr. Teo was the Managing Director of Modes Cube Sdn Bhd, leading its business delivery team. Mr. Teo earned a Bachelors degree in Quantity Survey from the Sheffield Hallam University in 2006, and received a Diploma in Quantity Survey from the Tunku Abdul Rahman College in 2004.\nSu Chen Chanell Chuah\nis our Chief Operating Officer. From 2020 to present Ms. Chuah has been Chief Operating Officer for GEM. At GEM, Ms. Chuah has, among other things, lead project management ensuring exchange listing related matters are executed according to plan; maintained liaison with exchange listing advisors counterpart to ensure corporate compliance elements are taken care of within the organization; ensured alignment of business directions/communication among internal and external stakeholders with regards to overall organization goals and plans and also the proprietary product planning. From 2016 to 2021 Ms. Chuah was the Chief Operating Officer for World Cloud Ventures Sdn Bhd. At World Cloud, Ms. Chuahs responsibilities were, among other things, project management for mobile app, i1happyhour; ensuring portal development, business development planning, marketing strategy planning and business readiness; leading the application of MSC status for the company under the product: i1happyhour and successfully getting the approval; project management for Loyalty Reward Program, Gem Reward, ensuring development of IT portal, business readiness, marketing readiness, business development, legal agreement matters and customer service and project management for e-commerce program, ze.la.fa covering the IT platform development, online seller recruitment, agreement preparation and customer service. Ms. Chuah earned a Bachelors of Business in Finance and Banking from Charles Stuart University in 2010.\nYee Fei Jaylvin Chan\nis our Chief Financial Officer. From 2020 to present Mr. Chan has been the Chief Financial Officer for GEM. At GEM Mr. Chan has, among other things, been a member of the involved in setting overall operational short- and long-term strategies and analyzing and reporting on trends, opportunities, risks and projections of future growth; lead the development and use of best-practice policies, practices, and tools that ensure a well-controlled yet flexible organization with strong fiscal management, project management, cross team communications and workflow and coordinated the development of the annual operating, capital, and program budgets, and reporting against the same. From 2019 to 2020 Mr. Chan was, among other things, the Group Finance Manager for Vettons Group of Companies. At Vettons, Mr. Chan supervised end-of-period processes and prepared an analysis of the periodical business performance, budgets, and forecasts and lead the Finance Department in the establishment of risk management procedures as well as the update of those procedures. From 2015 to 2019 Mr. Chan was a Vice President at TAEL Management. At TAEL, Mr. Chan was among other things, involved in several private equity investments, reported to Finance Director and advised the Investment Director on the structure of funding, strategies on the entering and exiting the deals and designed the valuation; and provided high level analytical support in areas of strategic financial importance. Mr. Chan is currently a Chartered Accountant registered with the Malaysian Institute of Accountants (MIA) and received a Bachelors degree in finance/accounting at University of Malaysia and is pursuing an MBA at the Open University of Malaysia.\nSu Huay Sue Chuah\nis our Chief Marketing Officer. From March 2021 to present Ms. Chuah has been the Chief Marketing Officer for GEM. At GEM, her responsibilities have been, among other things, to set marketing goals to establish strategic direction and plan positioning; plan, implement and manage marketing strategies; and contribute to the overall development of the company. From 2017 to 2021 Ms. Chuah was the Branding & Communication Director for Click Internet Traffic Sdn Bhd. At Click, Ms. Chuah, among other things, participated in the development of the brand marketing strategies in order to establish strategic direction and program positioning; defined the departmental vision to instill it in all levels of the marketing department to make up part of the working culture and oversaw the brand planning process inclusive of the definition of target consumers and the development of marketing mix and strategies. From 2016 to 2017, Ms. Chuah was the Brand Manager for Click and her key responsibilities were, among other things, to oversee a wide array of business functions including branding, communication channels, product development, online and offline promotions, and market research; team management and support their efforts and report to higher level and to identify how the brand is currently positioned in the market and identify future trends. Ms. Chuah received a Bachelors degree in Mass Communication from Limkokwing University College of Creative Technology in 2005.\nChen Hoe Samuel Sam\nis our Chief Technology Officer. From 2018 to 2020 Mr. Sam was the Senior Technical Manager for ARB Development SDN Bhd. At ARB Development, Mr. Sam, among other things, established the companys technical vision and lead all aspects of the companys technological development; directed the companys strategic direction, development and future growth and provided leadership to department to meet customers deadlines. In 2018 Mr. Sam was the Lead Programmer for World Cloud Ventures Sdn Bhd. At World Cloud. Mr. Sam, among other things, managed a team of programmers, to support and develop in-house software application; gathered requirements from management, and developed solutions; and embedded bidding feature for a membership mobile application. From 2017 to 2018 Mr. Sam was the Senior Manager for Tone Excel International Sdn Bhd. At Tone, Mr. Sam Managed internal MIS Team; worked with vendor to maintain in-house Hardware/Software/Network infrastructure; re-organized hosting server structure and removed redundant server; and worked with vendor to restructure current software framework to enable the System backbone support web application and mobile application. From 2015 to 2017, Mr. Sam was the Chief Technology Officer for Isynergy Universal Sdn Bhd. At Isynergy, Mr. Sam, among other things, setup an IT team to maintain and enhance their core business system (Software/Hardware); worked with CBO to carry out the new system development, integration and implementation; and worked with MIS Outsourcing Company to maintain in-house Hardware/Software/Email issue. Mr. Sam earned a Bachelors degree in Computer Science/Information Technology in 2004 and a Graduate diploma of Computer Science/Information Technology in 2003.\nJau Long Jerry Ooi\nis our Vice President. From 2017 to present, Mr. Ooi has been the Managing Director of Ezytronic Sdn Bhd, where he leads business development. Prior to that role, Mr. Ooi served as Sales & Marketing Manager of Ezytronic Sdn Bhd, where he was in charge of sales structure, marketing strategy, and team development. Mr. Ooi received a Diploma of Computer Science/Information Technology in 2002.\nJoseph R. Bobby Banks\nis a Director. Mr. Banks is a seasoned financial services executive. He previously worked in the New York and London offices of Goldman Sachs in the Corporate Finance, Mergers & Acquisitions and Communications, Media & Entertainment investment banking departments. Upon leaving Goldman Sachs, Mr. Banks joined JP Morgan Chase in their London Office as a Managing Director and Head of the Telecom and Media investment banking business in Europe, the Middle East and Africa (EMEA). He subsequently ran the Equity Capital Markets business for JP Morgan Chase also in EMEA. Mr. Banks has also worked in venture capital from 2014 to 2017 serving as Group Chief Financial Officer, Member of the Investment Committee, Chief Investor Relations Officer and Executive Board Member of Mountain Partners AG, a Zurich based venture capital firm. Since 2017, Mr. Banks has been an independent financial and strategy advisor to a number of companies across industries. Mr. Banks has a BA in Government from Dartmouth College and an MBA in Finance from the Wharton School at the University of Pennsylvania.\nMarco Baccanello\nis a Director. Mr. Baccanello is an experienced corporate finance executive with expertise in advising companies operating in a broad range of industries, particularly within the technology space, in early to late-stage financings, growth strategy and strategic disposals, restructurings and acquisitions. In addition, he has experience in the preparation of the listing and initial public offering documents for companies on NASDAQ and international exchanges, with an emphasis on funding requirements and regulatory filings. Mr. Baccanello also has developed acquisition and marketing strategies for multiple digital opportunities, focusing on content published to app stores, including rapidly growing digital businesses in the technology and gaming space. From 2016 to present, Mr. Baccanello is a member of the Corporate Development team where he leads and manages business plan developments. Prior to that role, he was the Chief Financial Officer of PlayJam from 2010 to 2016, where he planned, implemented and managed all the finance activities, including business planning, budgeting, forecasting and negotiations. Mr. Baccanellos experience as a former chartered accountant at PricewaterhouseCoopers and director of a private equity firm, specifically his expertise in managing growth businesses within the services, media and technology industries, make him a qualified director to serve on our Board. Mr. Baccanello earned a Bachelors degree in Economics at the University of Southampton.\nJeremy Roberts\nis a Director. Mr. Roberts is an experienced Corporate Financier with track-record of sourcing, structuring and negotiating and completing complex M&A deals and financings across a broad range of sectors and geographies. From 2013 to present Mr. Roberts has been the founder and Director of J and L Roberts Advisors in London, UK., a corporate consultancy firm. At J and L, Mr. Roberts has, among other things, advised family owners, High Net Worth Individuals, corporate and private equity groups on growth strategies and expansion; structuring and raising capital for various business ventures; as well as M&A assignments. From 2013 to 2014 he was the Managing Director and consultant for i76 Sp Zoo in Warsaw, Poland. At i76, he completed Ipopema 76s first acquisition: Impress Group from Constantia Industries and worked on post-acquisition and separation matters to post-acquisition optimize internal group structure. From 2011 to 2013 Mr. Roberts was a Principal at Corven Corporate Finance in London, UK. From 2002 to 2011, Mr. Roberts was a Director of Lansdowne Capital, an investment banking boutique, where he originated and executed transactions within the broader industrials sector. Between 2000 and 2002, Mr. Roberts was a Vice President in the investment banking division of Credit Suisse in London. Mr. Roberts earned a BSc in Economics and Politics from University of Bath in 1994.\nBoard Leadership Structure and Risk Oversight\nOur Board has responsibility for the oversight of our risk management processes and, either as a whole or through its committees, regularly discusses with management our major risk exposures, their potential impact on our business and the steps we take to manage them. The risk oversight process includes receiving regular reports from board committees and members of senior management to enable our Board to understand our risk identification, risk management, and risk mitigation strategies with respect to areas of potential material risk, including operations, finance, legal, regulatory, cybersecurity, strategic, and reputational risk.\nBoard of Directors\nOur business and affairs are managed under the direction of our Board. Our Board consists of five directors, three of whom qualify as independent under the listing standards of Nasdaq.\nDirectors serve until the next annual meeting and until their successors are elected and qualified. Officers are appointed to serve until their successors have been elected and qualified.\nDirector Independence\nOur board of directors are composed of a majority of independent directors as defined under the rules of Nasdaq. We use the definition of independence applied by Nasdaq to make this determination. Nasdaq Listing Rule 5605(a)(2) provides that an independent director is a person other than an officer or employee of the company or any other individual having a relationship which, in the opinion of the Companys Board, would interfere with the exercise of independent judgment in carrying out the responsibilities of a director. The Nasdaq listing rules provide that a director cannot be considered independent if:\n·\nthe director is, or at any time during the past three (3) years was, an employee of the company;\n·\nthe director or a family member of the director accepted any compensation from the company in excess of $120,000 during any period of twelve (12) consecutive months within the three (3) years preceding the independence determination (subject to certain exemptions, including, among other things, compensation for board or board committee service);\n·\nthe director or a family member of the director is a partner in, controlling shareholder of, or an executive officer of an entity to which the company made, or from which the company received, payments in the current or any of the past three fiscal years that exceed 5% of the recipients consolidated gross revenue for that year or $200,000, whichever is greater (subject to certain exemptions);\n·\nthe director or a family member of the director is employed as an executive officer of an entity where, at any time during the past three (3) years, any of the executive officers of the company served on the Remuneration Committee of such other entity; or\n·\nthe director or a family member of the director is a current partner of the companys outside auditor, or at any time during the past three (3) years was a partner or employee of the companys outside auditor, and who worked on the companys audit.\nUnder such definitions, our Board has undertaken a review of the independence of each director. Based on information provided by each director concerning his background, employment and affiliations, our Board has determined that Jeremy Roberts, Marco Baccanello and Joseph Bobby Banks are independent directors of the Company.\nCommittees of the Board of Directors\nOur Board has established an audit committee, a compensation committee and a nominating and corporate governance committee. The composition and responsibilities of each of the committees of our Board is described below. Members serve on these committees until their resignation or until as otherwise determined by our Board.\nAudit Committee\nWe have established an audit committee consisting of Marco Baccanello, Joseph Bobby Banks and Jeremy Roberts. Marco Baccanello is the Chairman of the audit committee. In addition, our Board has determined that Marco Baccanello is an audit committee financial expert within the meaning of Item 407(d) of Regulation S-K under the Securities Act of 1933, as amended, or the Securities Act. The audit committees duties, which are specified in our Audit Committee Charter, include, but are not limited to:\n·\nreviewing and discussing with management and the independent auditor the annual audited financial statements, and recommending to the board whether the audited financial statements should be included in our annual disclosure report;\n·\ndiscussing with management and the independent auditor significant financial reporting issues and judgments made in connection with the preparation of our financial statements;\n·\ndiscussing with management major risk assessment and risk management policies;\n·\nmonitoring the independence of the independent auditor;\n·\nverifying the rotation of the lead (or coordinating) audit partner having primary responsibility for the audit and the audit partner responsible for reviewing the audit as required by law;\n·\nreviewing and approving all related-party transactions;\n·\ninquiring and discussing with management our compliance with applicable laws and regulations;\n·\npre-approving all audit services and permitted non-audit services to be performed by our independent auditor, including the fees and terms of the services to be performed;\n·\nappointing or replacing the independent auditor;\n·\ndetermining the compensation and oversight of the work of the independent auditor (including resolution of disagreements between management and the independent auditor regarding financial reporting) for the purpose of preparing or issuing an audit report or related work;\n·\nestablishing procedures for the receipt, retention and treatment of complaints received by us regarding accounting, internal accounting controls or reports which raise material issues regarding our financial statements or accounting policies; and\n·\napproving reimbursement of expenses incurred by our management team in identifying potential target businesses.\nThe audit committee is composed exclusively of independent directors who are financially literate as defined under the Nasdaq listing standards. The Nasdaq listing standards define financially literate as being able to read and understand fundamental financial statements, including a companys balance sheet, income statement and cash flow statement.\nIn addition, the Company intends to certify to Nasdaq that the committee has, and will continue to have, at least one member who has past employment experience in finance or accounting, requisite professional certification in accounting, or other comparable experience or background that results in the individuals financial sophistication.\nCompensation Committee\nWe have established a compensation committee of the Board to consist of Joseph Bobby Banks, Jeremy Roberts and Marco Baccanello, each of whom is an independent director. Each member of our compensation committee is also a non-employee director, as defined under Rule 16b-3 promulgated under the Exchange Act, and an outside director, as defined pursuant to Section 162(m) of the Code. Joseph Bobby Banks is the chairman of the compensation committee. The compensation committees duties, which are specified in our Compensation Committee Charter, include, but are not limited to:\n·\nreviewing, approving and determining, or recommending to our board of directors regarding, the compensation of our executive officers;\n·\nadministering our equity compensation plans;\n·\nreviewing and approving, or recommending to our board of directors, regarding incentive compensation and equity compensation plans; and\n·\nestablishing and reviewing general policies relating to compensation and benefits of our employees.\nNominating and Corporate Governance Committee\nWe have established a nominating and corporate governance committee consisting of Jeremy Roberts, Joseph Bobby Banks and Marco Baccanello. Jeremy Roberts is the Chairman of the nominating and corporate governance committee. The nominating and corporate governance committees duties, which are specified in our Nominating and Corporate Governance Audit Committee Charter, include, but are not limited to:\n·\nidentifying, reviewing and evaluating candidates to serve on our board of directors consistent with criteria approved by our board of directors;\n·\nevaluating director performance on our board of directors and applicable committees of our board of directors and determining whether continued service on our board of directors is appropriate;\n·\nevaluating nominations by stockholders of candidates for election to our board of directors; and\n·\ncorporate governance matters.\nCode of Ethics\nOur Board plans to adopt a written code of business conduct and ethics (Code) that applies to our directors, officers and employees, including our principal executive officer, principal financial officer and principal accounting officer or controller, or persons performing similar functions. We intend to post on our website a current copy of the Code and all disclosures that are required by law in regard to any amendments to, or waivers from, any provision of the Code.\nFamily Relationships\nSu Chen Chanell Chuah, our Chief Operating Officer and Su Huay Sue Chuah, our Chief Marketing Officer are sisters.\nInvolvement in Certain Legal Proceedings\nNone of our other directors, executive officers, significant employees or control persons have been involved in any legal proceeding listed in Item 401(f) of Regulation S-K in the past 10 years.\nDelinquent Section 16(a) Reports\nSection 16(a) of the Exchange Act requires our directors and executive officers and persons who own more than 10% of a registered class of our equity securities (Ten Percent Holders) to file reports of beneficial ownership and changes in beneficial ownership with the SEC. To our knowledge, based solely on a review of the copies of such reports furnished to us, the following directors, executive officers and Ten Percent Holders did not comply with all Section 16(a) filing requirements during fiscal 2021 as follows: Our independent director, Joseph Bobby Banks has not yet filed his Form 3. Mr. Banks does not own any shares of our common stock. Item 11. Executive Compensation\nSummary Compensation Table\nThe following table illustrates the compensation paid by the Company to its executive officers. The disclosure is provided for the fiscal years ended June 30, 2022 and\n2021. We refer to these individuals as our named executive officers.:\nName and\nPrincipal Position\nFiscal Year Ended\nJune 30,\nSalary\n($)\nTotal\n($)\nChong Chan Sam Teo (2)\n$\n26,309\n$\n26,309\nChief Executive Officer\n$\n30,106\n$\n30,106\nVoon Him Victor Hoo\n$\n120,000\n$\n120,000\nChairman and Managing Director\n$\n10,000\n$\n10,000\nKok Pin Darren Tan (3)\n$\n-\n$\n-\nChief Executive Officer\n$\n22,881\n$\n22,881\n(1)\nSalaries were paid in Malaysian Ringgits, U.S. dollar amounts are approximate.\n(2)\nMr. Teo was appointed Chief Executive Officer on June 16, 2021.\n(3)\nMr. Tan was appointed Chief Executive Officer of the Company on July 1, 2020, and resigned on April 16, 2021.\n(4)\nMr. Chan was appointed Chief Financial Officer on October 20, 2020.\nNone of our other executives earned compensation in excess of $100,000 in fiscal years ended June 30, 2022 or 2021 and therefore pursuant to Instruction 1 to Item 402(m)(2) of Regulation S-K, only the compensation for our Chief Executive Officer and Chief Financial Officer is provided.\nEmployment Agreements.\nTeo Employment Agreement\n. Chong Chan Sam Teo, our Chief Executive Officer, and the Company entered into an Executive Employment Agreement dated as of July 1, 2020 (the Teo Employment Agreement), pursuant which Mr. Teo was appointed as our Chief Operating Officer. On June 16, 2021. Mr. Teo resigned as our Chief Operating Officer and was appointed Chief Executive Officer. Mr. Teo is still otherwise employed under the terms of the Teo Employment Agreement. The Teo Employment Agreement provides Mr. Teo with a basic salary of MYR 10,000 (approximately $2,408) per month, which was increased to MYR 10,500 per month on August 1, 2020, and benefits that are generally given to our senior executives. The Company or Mr. Teo may terminate the Teo\nEmployment Agreement with two months notice. Mr. Teo was also employed as the Chief Executive Officer of GEM since March 1, 2020 on identical terms.\nHoo Employment Agreement\n. Voon Him Victor Hoo, our Chairman and Managing Director, and the Company entered into an Executive Employment Agreement dated as of June 1, 2021 (the Hoo Employment Agreement), pursuant which Mr. Hoo was appointed as our Chairman and Managing Director. The Hoo Employment Agreement expired on June 14, 2022, and was extended on June 15, 2022, until June 14, 2023. Under the Hoo Employment Agreement Mr. Hoo is entitled to compensation of $10,000 per month. If Mr. Hoo terminates the Hoo Employment Agreement for any reason or the Company terminates the Hoo Employment Agreement due to a breach by Mr. Hoo, then the Company shall have no further obligation to compensate Mr. Hoo and all of Mr. Hoos rights under the contract shall be waived. The Company may extend the Hoo Employment Agreement after expiration in one year intervals.\nTan Employment Agreement\n. Kok Pin Darren Tan, our former Chief Executive Officer, and the Company entered into an Executive Employment Agreement dated as of July 1, 2020 (the Tan Employment Agreement). The Tan Employment Agreement provided Mr. Teo with a basic salary of MYR10,000 (approximately $2,408) per month, and benefits that are generally given to our senior executives. Mr. Tan resigned on April 16, 2021.\nOutstanding Equity Awards\nat June 30, 2022\nDuring the fiscal year ended June 30, 2022, we did not grant any stock options.\nDirector Compensation Table\nThe following table illustrates the compensation paid by the Company to its directors. Only the independent directors are entitled to receive board compensation. The disclosure is provided for the fiscal year ended June 30, 2022.\nName\nSalary per\ndirector\n($)\nTotal per\ndirector\n($)\nJoseph Bobby Banks and Jeremy Roberts all received identical compensation\n$\n54,000\n$\n54,000\nMarco Baccanello\n$\n124,000\n$\n124,000\nThe independent directors (Joseph Bobby Banks, Marco Baccanello and Jeremy Roberts) are entitled to receive $6,000 per month, commencing October 16, 2021, and will each be issued $300,000 in shares of our common stock to be issued in $60,000 installments on December 11, 2022, March 11, 2023, June 11, 2023, September 11, 2023, and December 11, 2023. The value of the shares will be based on the average closing price of our common stock as reported on Nasdaq for the last five (5) business days in November 2022.\nAs Chairman of the Audit Committee Mr. Baccanello also received $7,000 per month during the fiscal year ended June 30, 2022 for the establishment of the Audit Committee and its procedures and processes. Item 12. Security ownership Certain Beneficial Owners and Management\nThe table below sets forth information regarding the beneficial ownership of the common stock by (i) our directors and named executive officers; (ii) all the named executives and directors as a group and (iii) any other person or group that to our knowledge beneficially owns more than five percent of our outstanding shares of common stock.\nWe have determined beneficial ownership in accordance with the rules and regulations of the SEC. These rules generally provide that a person is the beneficial owner of securities if such person has or shares the power to vote or direct the voting thereof, or to dispose or direct the disposition thereof or has the right to acquire such powers within 60 days. Shares of common stock subject to options that are currently exercisable or exercisable within 60 days of December 1, 2022 are deemed to be outstanding and beneficially owned by the person holding the options. Shares issuable pursuant to stock options or warrants are deemed outstanding for computing the percentage ownership of the person holding such options or warrants, but are not deemed outstanding for computing the percentage ownership of any other person. Except as indicated by the footnotes below, we believe, based on the information furnished to us, that the persons and entities named in the table below will have sole voting and investment power with respect to all shares of common stock that they will beneficially own, subject to applicable community property laws. The percentage of beneficial ownership is based on 17,288,116\nshares of\ncommon stock outstanding on December 1, 2022.\nThe information contained in this table is as of December 1, 2022. At that date, 17,288,216 shares o\nf our common stock were outstanding.\nName and Address of\nBeneficial Owner(1)\nTitle\nCommon\nStock\nPercent of\nCommon\nStock\nOfficers and Directors\nChong Chan Sam Teo\nChief Executive Officer\n1,604,195\n9.3%\nVoon Him Victor Hoo(2)\nChairman and Managing Director\n1,702,899\n9.9%\nSu Chen Chanell Chuah\nChief Operating Officer\n476,000\n2.8%\nYee Fei Jaylvin Chan\nChief Financial Officer\n-\nSu Huay Sue Chuah\nChief Marketing Officer\n426,000\n2.5%\nChen Hoe Samuel Sam\nChief Technology Officer\n-\nJau Long Jerry Ooi\nVice President\n318,696\n1.8%\nJoseph R. Bobby Banks\nDirector\n-\nMarco Baccanello\nDirector\n-\nJeremy Roberts\nDirector\n-\nOfficers and Directors as a Group (total of 10 persons)\n4,527,720\n26.3\n%\n5% Stockholders\nChong Chan Sam Teo\n1,604,195\n9.3%\nV Capital Kronos Berhard\n1,702,899\n9.9%\nThe Evolutionary Zeal Sdn Bhd(3)\n1,500,000\n8.7%\nTophill Holdings Sdn. Bhd.\n2,756,879\n15.9%\n(1) Unless otherwise indicated, the principal address of the named directors and directors and 5% stockholders of the Company is care of\nTreasure Global Inc., 276 5th Avenue, Suite 704 #739, New York, New York 10001.\n(2) Held by V Capital Kronos Berhad, a company in which Voon Him Victor Hoo, our Chairman and Managing Director, is the majority shareholder.\n(3) Controlled by two individuals, Wan Zainudin bin Wan Ibrahim and Roslina binti Omar. Item 13. Certain Relationships and Related Party Transactions, and Director Independence\nOther than as disclosed below, and except for the regular salary and bonus payments made to our directors and officers in the ordinary course of business as described in Item 11. Executive Compensation, there have been no transactions since March 20, 2020, or any currently proposed transaction or series of similar transactions to which the Company was or is to be a party, in which the amount involved exceeds USD$120,000 and in which any current or former director or officer of the Company, any 5% or greater shareholder of the Company or any member of the immediate family of any such persons had or will have a direct or indirect material interest.\nSu Chen Chanell Chuah, our Chief Operating Officer and Su Huay Sue Chuah, our Chief Marketing Officer are sisters.\nJeremy Roberts and Marco Baccanello, both of whom are independent directors of the Company are also independent directors of VCI Global Limited, the parent of V Capital Kronos Berhad, an affiliate of the Company.\nAs of June 30, 2022, Kok Pin Darren Tan, the Companys former Chief Executive Officer, has loaned the Company $1,862,606, on an interest free basis. As of December 2, 2022, the Company has repaid\n$1,728,225 to Kok Pin Darren Tan.\nThe remaining amount outstanding is\npayable on demand.\nAs of June 30, 2022, Chong Chan Sam Teo, the Companys Chief Executive Officer, has loaned the Company $197,480 on an interest free basis.\nDuring the fiscal year ended\nJune 30, 2022, the Company fully repaid a $1,405,951 loan from World Cloud Ventures Sdn. Bhd. Jau Long Jerry Ooi, a Vice President of the Company owns 50% of the equity of World Cloud Ventures Sdn. Bhd. As of June 30, 2022, World Cloud Ventures Sdn. Bhd. was the holder of the World Cloud Note, which has subsequently been converted into shares of the Companys common stock.\nDuring the fiscal year ended June 30, 2022, the Company fully repaid a $289,303 loan from Cloudmaxx Sdn. Bhd. Jau Long Jerry Ooi, a Vice President of the Company owns 30% of the equity of Cloudmaxx Sdn. Bhd. As of June 30, 2022, Cloudmaxx Sdn. Bhd. was also the holder of the Cloudmaxx Note, which has subsequently been converted in full into shares of the Companys common stock.\nVoon Him Victor Hoo owns more than 50% of the equity of V Capital Kronos Berhad. V Capital Kronos Berhad owns 14.55% of our outstanding shares of common stock and as of June 30, 2022 was the holder of the V Capital Note\n, which has subsequently been converted in full into shares of the Companys common stock.\nDuring the fiscal year ended June 30, 2022, the Company paid $690,367 to True Sight for consulting services. Su Huay Sue Chuah, our Chief Marketing Officer is a 40% shareholder of True Sight Sdn Bhd. Item 14. Principal Accounting Fees and Services\nAudit and Non-Audit Fees\nThe aggregate fees billed for the most recently completed fiscal year ended June 30, 2022 and 2021 for professional services rendered by the principal accountant for the audit of our annual financial statements included in our annual report on Form 10-K and services that are normally provided by the accountant in connection with statutory and regulatory filings or engagements for these fiscal periods were as follows:\nJune 30, 2022\nJune 30, 2021\nAudit fees\n$\n270,969\n$\n-\nPART IV Item 15. Exhibits, Financial Statement Schedules.\n(a) The following documents are filed as part of this Annual Report:\n(1) The financial statements are filed as part of this Annual Report under Item 8. Financial Statements and Supplementary Data.\n(2) The financial statement schedules are omitted because they are either not applicable or the information required is presented in the financial statements and notes thereto under Item 8. Financial Statements and Supplementary Data.\n(3) The exhibits listed in the following Exhibit Index are filed, furnished or incorporated by reference as part of this Annual Report.\n(b)\nExhibits\nEXHIBIT INDEX\nExhibit No.\nDescription\n3.1*\nCertificate of Incorporation of the Registrant\n3.2*\nBylaws of the Registrant\n3.3*\nAmendment to Certificate of Incorporation of the Registrant\n4.1*\nForm of Underwriter Warrant\n10.1*\nBeneficial Shareholding Agreement dated June 5, 2017 among Kok Pin Darren Tan and two individuals.\n10.2*\nBeneficial Shareholding Agreement dated November 10, 2020 between Kok Pin Darren Tan and Chong Chan Sam Teo.\n10.3*\nShare Swap Agreement dated March 11, 2021 between the Registrant and certain individuals\n10.4*\nAmendment to Share Swap Agreement dated March 11, 2021 among the Registrant and certain individuals\n10.5*\nForm of Common Stock Securities Purchase Agreement\n10.6*\nForm of Convertible Promissory Note issued pursuant to a Securities Purchase Agreement\n10.7*\nInvestment Agreement dated November 1, 2020 between the Registrant and Space Capital Berhad\n10.8*\n13.33% Convertible Redeemable Note issued by the Registrant on November 13, 2020 to Space Capital Behard in the principal amount of $2,123,600\n10.9*\nCollaboration Agreement dated March 21, 2022 between GEM Reward SDN BHD and TNG Digital SDN BHD\n10.10*\nBusiness Partner Agreement dated February 8, 2022 between Public Bank and Gem Reward Sdn Bhd\n10.11*\nAgreement dated August 6, 2021 between iPay88 (M) Sdn. Bhd. and Gem Reward Sdn Bhd.\n10.12*\nPartnership Agreement dated as of December 16, 2021 between Gem Reward Sdn Bhd and Digi Telecommunications Sdn Bhd\n10.13*\nCollection Services Agreement dated as of August 11, 2021 between ATX Distribution Sdn Bhd and Gem Reward Sdn Bhd\n10.14*\nService Provider Agreement effective January 1, 2022 between Coup Marketing Asia Pacific Sdn. Bhd. d/b/a Pays Gift and Gem Reward Sdn. Bhd.\n10.15*\nReseller Agreement dated April 12, 2021 between MOL Accessportal Sdn. Bhd. d/b/a Razer Gold and Gem Reward Sdn. Bhd.\n10.16*\nMerchant Services Agreement dated August 17, 2021 between Morganfields and Gem Reward Sdn. Bhd.\n10.17*\nMerchant Services Agreement dated August 17, 2021 between The Alley and Gem Reward Sdn. Bhd.\n10.18*\nMerchant Services Agreement dated August 17, 2021 between Hui Lau Shan and Gem Reward Sdn. Bhd.\n10.19*\nEmployment Agreement dated July 1, 2020 between Chong Chan Sam Teo and the Registrant\n10.20*\nEmployment Agreement dated October 15, 2020 between Yee Fei Jaylvin Chan and the Registrant\n10.21*\nEmployment Agreement dated March 1, 2021 between Su Huay Sue Chuah and the Registrant\n10.22*\nEmployment Agreement dated June 1, 2021 between Voon Him Victor Hoo and the Registrant\n10.23*\nEmployment Agreement dated June 16, 2021 between Su Chen Chanell Chuah and the Registrant\n10.24*\nConsulting Agreement dated July 1, 2021 between Exchange Listing, LLC and the Registrant\n10.25**\nExtension of Voon Him Victor Hoo Employment Agreement dated June 15, 2022.\n21.1*\nList of Subsidiaries of the Company.\n31.1**\nCertification of Principal Executive Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n31.2**\nCertification of Principal Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n32.1***\nCertifications of the Chief Executive Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n32.2***\nCertifications of the Chief Executive Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\nThe following financial statements from the Company's Yearly Report on Form 10-K for the fiscal year ended June 30, 2022 formatted in Inline XBRL: (i) Consolidated Balance Sheets, (ii) Consolidated Statements of Operations, (iii) Consolidated Statements of Comprehensive Loss (iv) Consolidated Statements of Convertible Preferred Stock and Stockholders' Equity (Deficit), (v) Consolidated Statements of Cash Flows and (vi) Notes to Consolidated Financial Statements, tagged as blocks of text and including detailed tags.\n104**\nThe cover page from the Companys Annual Report on Form 10-K for the fiscal year ended June 30, 2022, formatted in Inline XBRL (included in Exhibit 101).\n* Incorporated by reference to the Companys Registration Statement on Form S-1 (No. 333-264364), filed on August 1, 2022.\n** Filed herewith\n*** Exhibits 32.1 and 32.2 are being furnished and shall not be deemed to be filed for purposes of Section 18 of the Exchange Act, or otherwise subject to the liability of that section, nor shall such exhibits be deemed to be incorporated by reference in any registration statement or other document filed under the Securities Act of 1933, as amended, or the Exchange Act, except as otherwise specifically stated in such filing.\nItem 16. Form 10-K Summary\nThe Company has elected not to include summary information.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Company has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nDate: December 5\n, 2022\nTREASURE GLOBAL INC.\nBy:\n/s/ Chong Chan Sam Teo\nChong Chan Sam Teo\nChief Executive Officer\nPOWER OF ATTORNEY\nEach individual person whose signature appears below hereby appoints Chong Chan Sam Teo as attorney-in-fact with full power of substitution, severally, to execute in the name and on behalf of each such person, individually and in each capacity stated below, one or more amendments to this annual report which amendments may make such changes in the report as the attorney-in-fact acting in the premises deems appropriate, to file any such amendment to the report with the SEC, and to take all other actions either of them deem necessary or advisable to enable the Company to comply with the rules, regulations and requirements of the SEC. Pursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Company and in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/ Chong Chan Sam Teo\nChief Executive Officer and Director\nDecember 5, 2022\nChong Chan Sam Teo\n(Principal Executive Officer)\n/s/ Yee Fei Jaylvin Chan\nChief Financial Officer\nDecember 5, 2022\nYee Fei Jaylvin Chan\n(Principal Financial And Accounting Officer)\n/s/ Voon Him Victor Hoo\nChairman of the Board and Managing Director\nDecember 5, 2022\nVoon Him Victor Hoo\n/s/ Joseph R. Bobby Banks\nDirector\nDecember 5, 2022\nJoseph R. Bobby Banks\n/s/ Marco Baccanello\nDirector\nDecember 5, 2022\nMarco Baccanello\n/s/ Jeremy Roberts\nDirector\nDecember 5, 2022\nJeremy Roberts"
}