{
    "cik": "1913838",
    "company": "VWF Bancorp, Inc.",
    "filing_type": "10-K",
    "filing_date": "2023-10-06",
    "period_of_report": "2023-06-30",
    "sic": "6036",
    "state_of_inc": null,
    "state_location": "OH",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1913838/0001558370-23-016274-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1913838/000155837023016274/vwfb-20230630x10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1913838/0001558370-23-016274.txt",
    "filename": "1913838_10K_2023_0001558370-23-016274.htm",
    "content": "ITEM 1.Business\nForward Looking Statements\nThis annual report contains forward-looking statements, which can be identified by the use of words such as such estimate, project, believe, intend, anticipate, plan, seek, expect, will, would, should, could or may, and words of similar meaning. These forward-looking statements include, but are not limited to:\n● statements of our goals, intentions and expectations;\n● statements regarding our business plans, prospects, growth and operating strategies;\n● statements regarding the quality of our loan and investment portfolios; and\n● estimates of our risks and future costs and benefits.\nThese forward-looking statements are based on current beliefs and expectations of our management and are inherently subject to significant business, economic and competitive uncertainties and contingencies, many of which are beyond our control. In addition, these forward-looking statements are subject to assumptions with respect to future business strategies and decisions that are subject to change. Accordingly, you should not place undue reliance on such statements. We are under no duty to and do not take any obligation to update any forward-looking statements after the date of this annual report.\nThe following factors, among others, could cause actual results to differ materially from the anticipated results or other expectations expressed in the forward-looking statements:\n● conditions relating to the COVID-19 pandemic, including the severity and duration of the associated economic slowdown either nationally or in our market areas, that are worse than expected;\n● general economic conditions, either nationally or in our market areas, that are worse than expected;\n● changes in the level and direction of loan delinquencies and write-offs and changes in estimates of the adequacy of the allowance for loan and lease losses;\n● our ability to access cost-effective funding;\n● fluctuations in real estate values and in the conditions of the residential real estate, commercial real estate, and agricultural real estate markets;\n● demand for loans and deposits in our market area;\n● our ability to implement and change our business strategies;\n● competition among depository and other financial institutions;\n● inflation and changes in the interest rate environment that reduce our margins and yields, the fair value of our financial instruments, or our level of loan originations, or increase the level of defaults, losses and prepayments within our loan portfolio;\n● adverse changes in the securities markets;\n● changes in laws or government regulations or policies affecting financial institutions, including changes in regulatory fees, capital requirements and insurance premiums;\n● changes in the quality or composition of our loan or investment portfolios;\n● technological changes that may be more difficult or expensive than expected;\n● the inability of third-party providers to perform as expected;\n● a failure or breach of our operational or information security systems or infrastructure, including cyberattacks;\n● our ability to manage market risk, credit risk and operational risk;\n● our ability to enter new markets successfully and capitalize on growth opportunities;\n● changes in consumer spending, borrowing and savings habits;\n● changes in accounting policies and practices, as may be adopted by the bank regulatory agencies, the Financial Accounting Standards Board, the Securities and Exchange Commission or the Public Company Accounting Oversight Board;\n● our ability to retain key employees;\n● material weakness or significant deficiency in our internal controls over financial reporting; and\n● changes in the financial condition, results of operations or future prospects of issuers of securities that we own.\nBecause of these and a wide variety of other uncertainties, our actual future results may be materially different from the results indicated by these forward-looking statements.\nVWF Bancorp, Inc.\nVWF Bancorp, Inc. (VWF Bancorp, the Company or we) was incorporated in February 2022 to become the holding company for Van Wert Federal Savings Bank (Van Wert Federal or the Bank) upon the conversion of Van Wert Federal from the mutual form of organization to the stock form of organization (the Conversion). The Conversion was completed on July 13, 2022. In connection with the Conversion, the Company sold 1,922,924 shares of common stock at a price of $10.00 per share.\nThe Company is a registered savings and loan holding company subject to comprehensive regulation and examination by the Board of Governors of the Federal Reserve System (the Federal Reserve Board). The Company conducts its operations primarily through its wholly owned subsidiary, Van Wert Federal Savings Bank, a federally-chartered savings bank. The Companys principal office is located at 976 South Shannon Street, Van Wert, Ohio 45891, and our telephone number at that address is (419) 238-9662. Our website address is www.vanwertfederal.com. Information on our website is not and should not be considered a part of this annual report.\nVan Wert Federal Savings Bank\nVan Wert Federal is a federally-chartered savings bank headquartered in Van Wert, Ohio. Our business consists primarily of taking deposits from the general public and investing those deposits, together with funds generated from operations, in one- to four-family residential mortgage loans secured by properties located in our primary market area. To a significantly lesser extent, we also originate commercial real estate loans, agricultural real estate loans, construction\nand land loans, commercial and industrial loans, home equity lines of credit, and consumer loans. In recent years, we have increased, at a managed pace and consistent with what we believe to be conservative underwriting standards, our originations of higher yielding commercial real estate and commercial and industrial loans. Our primary revenue source is interest income earned on loans and investments. Noninterest income is not a significant revenue source.\nVan Wert Federal is subject to comprehensive regulation and examination by the Office of the Comptroller of the Currency (the OCC) and the Federal Deposit Insurance Corporation (the FDIC) and is a member of the Federal Home Loan Bank system.\nNew President and Chief Executive Officer\nAs previously reported, the Company announced that Michael D. Cahill, CPA, became a consultant to the Bank effective October 1, 2022. He served as a consultant for the remainder of the calendar year and the Company and Bank appointed him to serve as President and Chief Executive Officer effective January 1, 2023. He was also appointed as a director of the Company and Bank effective January 1, 2023.\nNew Chief Financial Officer and Treasurer\nAs previously reported, on March 8, 2023, the Company and Bank appointed Richard W. Brackin, CPA, to serve as Chief Financial Officer and Treasurer effective April 17, 2023.\nMarket Area\nWe consider Van Wert County, located in northwest Ohio, to be our primary market area for originating loans and gathering deposits. Our sole office is located in Van Wert, which is the county seat. Van Wert is located approximately 35 miles east of Ft. Wayne, Indiana, and approximately 35 miles west of Lima, Ohio.\nVan Wert County is primarily rural, but it has a mix of manufacturing and agriculture. Major manufacturers include Tenneco, Inc. and Danfoss, which are major employers. Other major employers are Braun Industries, Central Mutual Insurance Company, Cooper Farms, Van Wert County Hospital, and local school districts. Agricultural production is primarily focused on corn, soybeans and wheat.\nCompetition\nWe face strong competition within our primary market area of Van Wert County both in making loans and attracting retail deposits. Our market area includes large money center and regional banks, community banks and savings institutions, and credit unions. We also face competition for loans from mortgage banking firms, consumer finance companies, credit unions, and fintech companies and, with respect to deposits, from money market funds, brokerage firms, mutual funds and insurance companies. At June 30, 2023 (the most recent date for which FDIC data is publicly available), we were ranked 1st among the eight FDIC-insured financial institutions with offices in Van Wert County, with a market share of deposits of 19.14%.\nLending Activities\nGeneral. Our loan portfolio consists primarily of residential mortgage loans. To a substantially lesser extent, we also originate commercial real estate loans, agricultural real estate loans, construction and land loans, commercial and industrial loans, home equity lines of credit, and consumer loans. We originate loans for retention in our portfolio and generally do not sell loans. In recent years, we have increased our focus on originating higher yielding commercial real estate loans and commercial and industrial loans, and we intend to continue that focus after the conversion and stock offering. We offer both adjustable-rate and fixed-rate residential mortgage loans. However, historically a significant majority of the residential real estate loans which we have originated are long-term, fixed-rate loans that generally conform to secondary market guidelines.\nCommercial real estate loans and commercial and industrial loans have not historically comprised a significant portion of our total loan portfolio. While we expect that one- to four-family residential real estate lending will continue to be an emphasis of our lending operations, we intend to increase our emphasis on commercial real estate loans and commercial and industrial loans in an effort to increase the yield on our loan portfolio and diversify our loan portfolio.\nLoan Portfolio Composition. The following table sets forth the composition of our loan portfolio by type of loan at the dates indicated. There were no loans held-for-sale at any date indicated.\nAt June 30,\nAmount\nPercent\nAmount\nPercent\n(Dollars in thousands)\nReal estate loans:\nCommercial real estate\n$\n6,010\n6.7\n%\n$\n5,136\n6.2\n%\nResidential real estate\n65,857\n73.4\n65,638\n79.8\nMultifamily\n0.8\n0.9\nAgricultural real estate\n4,045\n4.5\n3,451\n4.2\nConstruction and land\n8,567\n9.5\n6,007\n7.3\nHome equity line of credit\n0.4\n0.3\nCommercial and industrial\n3,399\n3.8\n0.4\nConsumer\n0.9\n0.9\nTotal loans\n89,722\n100.00\n%\n82,267\n100.00\n%\nLess:\nUndisbursed loans in process\n8,203\n4,324\nNet deferred loan costs, premium and discounts\nAllowance for loan losses\nTotal loans receivable, net\n$\n81,208\n$\n77,710\nContractual Maturities. The following table sets forth the contractual maturities of our total loan portfolio at June 30, 2023. Demand loans, loans having no stated repayment schedule or maturity, and overdraft loans are reported as being due in one year or less. Because the tables present contractual maturities and do not reflect repricing or the effect of prepayments, actual maturities may differ.\nHome\nCommercial\nEquity\nCommercial\nResidential\nMultifamily\nAgricultural\nConstruction\nand\nLines of\nReal Estate\nReal Estate\nReal Estate\nReal Estate\nand Land\nIndustrial\nCredit\nConsumer\nTotal\n(In thousands)\nDue During the Years Ending June 30,\n$\n$\n$\n-\n$\n-\n$\n$\n2,400\n$\n-\n$\n$\n2,476\n-\n-\n2,200\n-\n-\n3,178\n-\n-\n-\n4,500\n-\n5,418\n2027 to 2028\n-\n-\n-\n1,903\n2029 to 2033\n1,926\n8,080\n-\n-\n-\n-\n10,696\n2034 to 2038\n16,364\n-\n-\n-\n18,729\n2039 and beyond\n1,818\n40,218\n3,280\n1,075\n-\n-\n47,322\nTotal\n$\n6,010\n$\n65,857\n$\n$\n4,045\n$\n8,567\n$\n3,399\n$\n$\n$\n89,722\nThe following table sets forth our fixed and adjustable-rate loans at June 30, 2023 that are contractually due after June 30, 2024.\nDue After June 30, 2024\nFixed\nAdjustable\nTotal\n(In thousands)\nReal estate loans:\nCommercial real estate\n$\n2,488\n$\n3,522\n$\n6,010\nResidential real estate\n55,705\n10,152\n65,857\nMultifamily\n-\nAgricultural real estate\n3,391\n4,045\nConstruction and land\n3,709\n4,858\n8,567\nHome equity lines of credit (HELOC)\n-\nCommercial and industrial loans\n2,529\n3,399\nConsumer loans\n-\nTotal loans\n$\n69,666\n$\n20,056\n$\n89,722\nResidential Mortgage Lending. At June 30, 2023 we had $65.8 million of loans secured by residential real estate, or 73.4% of total loans. The significant majority of our one- to four-family residential real estate loans are secured by properties located in our primary market area. At June 30, 2023, $2.4 million, or 3.6% of residential mortgage loans, were secured by non-owner occupied properties. Approximately one-quarter of that amount represent loans secured by properties occupied by a family member of the borrower.\nOur one- to four-family residential real estate loans are generally underwritten to secondary market guidelines. We offer both fixed-rate and adjustable rate residential mortgage loans for terms up to 30 years. Adjustable rate loans are tied to the National Average Contract Mortgage Rate published by the Federal Housing Finance Agency. For adjustable rate loans, the interest rate is fixed for the initial terms of five, seven or 10 years, and then adjusts yearly thereafter with an annual rate cap of 2% and a lifetime rate cap of 6%. We generally limit the loan-to-value ratios of our residential mortgage loans to 80% (90% for borrowers with a FICO credit score of 720 or higher and 95% with private mortgage insurance) of the purchase price or appraised value, whichever is lower.\nWe do not offer interest only residential mortgage loans, where the borrower pays interest for an initial period, after which the loan converts to a fully amortizing loan. We also do not offer loans that provide for negative amortization of principal, such as Option ARM loans, where the borrower can pay less than the interest owed on the loan, resulting in an increased principal balance during the life of the loan. We do not currently offer subprime loans on one- to four-family residential real estate loans (i.e., generally loans to borrowers with credit scores less than 620).\nAt June 30, 2023, multi-family residential mortgage loans was an immaterial portion of our loan portfolio.\nCommercial Real Estate Loans. At June 30, 2023, we had $6.0 million in commercial real estate loans, or 6.7% of total loans. Our commercial real estate loans are generally secured primarily by owner-occupied properties including warehouses and offices. We generally do not originate commercial loans secured by strip shopping malls or restaurants. Substantially all of our commercial real estate loans are adjustable rate loans with the interest rate tied to the National Average Contract Mortgage Rate. The interest rate is fixed for the initial term of five years, and then adjusts yearly thereafter. Commercial real estate loans generally have terms up to 20 years. We generally limit the loan-to-value ratios of our commercial mortgage loans to 80% (75% for non-owner occupied properties) of the purchase price or appraised value, whichever is lower.\nAt June 30, 2023, our largest commercial real estate loan was for $849,000, none of which had been disbursed.\nWe consider a number of factors in originating commercial real estate loans. We evaluate the qualifications and financial condition of the borrower, including credit history, profitability and expertise, as well as the value and condition of the property securing the loan. When evaluating the qualifications of the borrower, we consider the financial resources of the borrower, the borrowers experience in owning or managing similar property and the borrowers payment history with us and other financial institutions. In evaluating the property securing the loan, the factors we consider include the net operating income of the mortgaged property before debt service and depreciation, the ratio of the loan amount to the appraised value of the mortgaged property, and the debt service coverage ratio (the ratio of net operating income to debt service). Generally, we require that the debt service coverage ratio be at least 1.15x. The significant majority of our commercial real estate loans are appraised by outside independent appraisers approved by the board of directors. Personal guarantees are generally obtained from the principals of commercial real estate borrowers.\nAgricultural Real Estate Loans. At June 30, 2023, we had $4.0 million in agricultural real estate loans, or 4.5% of total loans. These loans are secured by agricultural land. The interest rate is fixed for the initial term of five or seven years, and then adjusts yearly thereafter. Agricultural real estate loans generally have terms up to 25 years. We generally limit the loan-to-value ratios of our agricultural real estate loans to 75% of the purchase price or appraised value, whichever is lower.\nAt June 30, 2023, our largest agricultural real estate loan had an outstanding balance of $760,000. At June 30, 2023, this loan was performing according to its original terms.\nWe consider a number of factors in originating agricultural real estate loans. We evaluate the qualifications and financial condition of the borrower, including credit history, profitability and expertise, as well as the value and condition of the property securing the loan. When evaluating the qualifications of the borrower, we consider the financial resources of the borrower, the borrowers experience in agriculture and the borrowers payment history with us and other financial institutions. In evaluating the property securing the loan, the factors we consider include the net operating income of the mortgaged property before debt service and depreciation, the ratio of the loan amount to the appraised value of the mortgaged property, and the debt service coverage ratio (the ratio of net operating income to debt service). Generally, we require that the debt service coverage ratio be at least 1.15x. The significant majority of our agricultural real estate loans are appraised by outside independent appraisers approved by the board of directors. Personal guarantees are generally obtained from the principals of agricultural real estate borrowers.\nConstruction and Land Loans. At June 30, 2023, we had $8.6 million in construction and land loans, or 9.5% of total loans. We make residential construction loans, primarily to individuals for the construction of their primary residences and to contractors and builders of single-family homes. We generally work with a limited number of builders with whom we have had a successful track record. We do not make speculative residential construction loans, which are construction loans to a builder where there is not a contract in place for the purchase of the home at the time the construction loan is originated. Our residential construction loans are structured as construction/permanent loans where after a one year construction period the loan converts to a permanent residential mortgage loan. Our residential construction loans are underwritten to the same guidelines for permanent residential mortgage loans. At June 30, 2023, our largest residential construction loan was for $576,000, of which $308,000 has been disbursed.\nWe make commercial construction loans, which are structured as construction/permanent loans where after a one year construction period the loan converts to a permanent commercial mortgage loan. Our commercial construction loans are underwritten to the same guidelines for commercial mortgage loans. At June 30, 2023, our largest commercial construction loan was for $4.5 million (representing a 16% participation interest), none of which had been dispersed.\nConstruction loans generally can be made with a maximum loan-to-value ratio of 90% (residential properties) and 75% (commercial properties) of the estimated appraised market value upon completion of the project. Before making a commitment to fund a construction loan, we require an appraisal of the property by an independent licensed appraiser. We also generally require inspections of the property before disbursements of funds during the term of the construction loan.\nCommercial and Industrial Loans. At June 30, 2023, commercial and industrial loans amounted to $3.3 million, or 3.8% of total loans. Commercial and industrial loans include both term loans and lines of credit. Term loans\nare generally fixed rate, five year balloon loans with generally 15-year amortization schedules. Lines of credit are based on the prime rate and with terms of 18 to 24 months. These loans are generally secured by business assets, such as equipment and accounts receivable. Depending on the collateral used to secure the loans, commercial loans are made in amounts of up to 90% of the value of the collateral securing the loan.\nWhen making commercial loans, we consider the financial statements of the borrower, our lending history with the borrower, the debt service capabilities and global cash flows of the borrower and other guarantors, the projected cash flows of the business and the value of the collateral, accounts receivable, inventory and equipment.\nAt June 30, 2023, our largest commercial and industrial loan totaled $2.0 million and is secured by a UCC filing on all business assets. At June 30, 2023, this loan was performing according to its original terms.\nHome Equity Lines of Credit. At June 30, 2023, the outstanding balance of home equity lines of credit was $355,000, or 0.4% of total loans. The interest rate for home equity lines of credit are based on the prime rate. There is a 10 year draw period followed by a 10 year repayment period. The loan to value ratio is generally up to 80%, taking into account any superior mortgage on the collateral property. Generally, all applicants for a home equity line of credit are required to have a FICO credit score of at least 720.\nConsumer Loans. At June 30, 2023, consumer loans were $801,000, or 0.9% of total loans. Our consumer loan portfolio generally consists of loans secured predominately by automobiles and trucks (new and used), trailers, and other consumer assets. Consumer loans have fixed interest rates and terms up to five years, with loan to value ratios up to 90%.\nLoan Underwriting Risks\nCommercial Real Estate Loans and Agricultural Real Estate Loans. Loans secured by commercial real estate or agricultural real estate generally have larger balances and involve a greater degree of risk than one- to four-family residential real estate loans. The primary concern in commercial real estate lending and agricultural real estate lending is the borrowers creditworthiness and the feasibility and cash flow potential of the underlying business. Payments on loans secured by income producing properties often depend on successful operation and management of the properties. As a result, repayment of such loans may be subject, to a greater extent than residential real estate loans, to adverse conditions in the real estate market or the economy. To monitor cash flows on income properties, we require borrowers and loan guarantors to provide quarterly, semi-annual or annual financial statements, depending on the size of the loan, on commercial real estate loans. In reaching a decision on whether to make a commercial real estate loan, we consider and review a global cash flow analysis of the borrower and consider the net operating income of the property, the borrowers expertise, credit history and profitability and the value of the underlying property. We have generally required that the properties securing these real estate loans have an aggregate debt service ratio, including the guarantors cash flows and the borrowers other projects, of at least 1.15x. An environmental phase one report is obtained when the possibility exists that hazardous materials may have existed on the site, or the site may have been impacted by adjoining properties that handled hazardous materials.\nIf we foreclose on a commercial real estate loan or an agricultural real estate loan, the marketing and liquidation period to convert the real estate asset to cash can be lengthy with substantial holding costs. In addition, vacancies, deferred maintenance, repairs and market stigma can result in prospective buyers expecting sale price concessions to offset their real or perceived economic losses for the time it takes them to return the property to profitability. Depending on the individual circumstances, initial charge-offs and subsequent losses on commercial real estate loans can be unpredictable and substantial.\nCommercial and Industrial Loans. Unlike residential real estate loans, which generally are made on the basis of the borrowers ability to make repayment from his or her employment or other income, and which are secured by real property whose value tends to be more easily ascertainable, commercial and industrial loans are of higher risk and typically are made on the basis of the borrowers ability to make repayment from the cash flows of the borrowers business, and the collateral securing these loans may fluctuate in value. Our commercial and industrial loans are originated primarily based on the identified cash flows of the borrower and secondarily on the underlying collateral\nprovided by the borrower. Collateral for commercial and industrial loans typically consists of equipment, accounts receivable, or inventory. Credit support provided by the borrower for most of these loans is based on the liquidation of the pledged collateral and enforcement of a personal guarantee, if any. Further, any collateral securing such loans may depreciate over time, may be difficult to appraise and may fluctuate in value. As a result, the availability of funds for the repayment of commercial and industrial loans may depend substantially on the success of the business itself.\nConstruction and Land Loans. Our construction loans are based upon estimates of costs and values associated with the completed project. Underwriting is focused on the borrowers financial strength, credit history and demonstrated ability to produce a quality product and effectively market and manage their operations.\nConstruction lending involves additional risks when compared with permanent lending because funds are advanced upon the security of the project, which is of uncertain value before its completion. Because of the uncertainties inherent in estimating construction costs, as well as the market value of the completed project and the effects of governmental regulation of real property, it is relatively difficult to evaluate accurately the total funds required to complete a project and the related loan-to-value ratio. In addition, generally during the term of a construction loan, interest may be funded by the borrower or disbursed from an interest reserve set aside from the construction loan budget. These loans often involve the disbursement of substantial funds with repayment substantially dependent on the success of the ultimate project and the ability of the borrower to sell or lease the property or obtain permanent take-out financing, rather than the ability of the borrower or guarantor to repay principal and interest. If the appraised value of a completed project proves to be overstated, we may have inadequate security for the repayment of the loan upon completion of construction of the project and may incur a loss. Land loans have substantially similar risks.\nBalloon Loans. Although balloon mortgage loans may reduce to an extent our vulnerability to changes in market interest rates because they reprice at the end of the term, the ability of the borrower to renew or repay the loan and the marketability of the underlying collateral may be adversely affected if the value of the real estate or other collateral decline before the expiration of the term of the loan or if there is a rising interest rate environment.\nConsumer Loans. Consumer loans may entail greater risk than residential real estate loans, particularly in the case of consumer loans that are unsecured or secured by assets that depreciate rapidly. Repossessed collateral for a defaulted consumer loan may not provide an adequate source of repayment for the outstanding loan and a small remaining deficiency often does not warrant further substantial collection efforts against the borrower. Consumer loan collections depend on the borrowers continuing financial stability, and therefore are likely to be adversely affected by various factors, including job loss, divorce, illness or personal bankruptcy. Furthermore, the application of various federal and state laws, including federal and state bankruptcy and insolvency laws, may limit the amount that can be recovered on such loans.\nLoan Originations, Purchases and Sales\nWe originate loans through employee marketing and advertising efforts, our existing customer base, walk-in customers and referrals from customers.\nWe generally do not sell the loans we originate, but retain them in our loan portfolio.\nAt June 30, 2023, our largest purchased participation interest had an outstanding balance of $4.5 million, representing a 16% participation interest in a $28.0 million commercial construction loan to construct a 240-unit market rate apartment complex in West Lafayette, Indiana, none of which had been dispersed at June 30, 2023.\nLoan Approval Procedures and Authority\nOur lending is subject to written, non-discriminatory underwriting standards and origination procedures. Decisions on loan applications are made on the basis of detailed applications submitted by the prospective borrower and property valuations. Our policies require that for all real estate loans that we originate, property valuations must be performed by outside independent state-licensed appraisers approved by our board of directors. The loan applications are\ndesigned primarily to determine the borrowers ability to repay the requested loan, and the more significant items on the application are verified through use of credit reports, financial statements and tax returns.\nBy law, the aggregate amount of loans that we are permitted to make to any one borrower or a group of related borrowers is generally limited to 15% of Van Wert Federals unimpaired capital and surplus (25% if the amount in excess of 15% is secured by readily marketable collateral or 30% for certain residential development loans). At June 30, 2023, our largest credit relationship to one borrower had an outstanding balance of $3.0 million and is secured by commercial and residential real estate. At June 30, 2023, this loan was performing according to its original terms.\nWe have a Management Loan Committee for consumer loans, which consists of our Chairman of the Board, President and Chief Executive Officer, Senior Lending Officer, and various lending staff. The Management Loan Committee may approve all loans up to $350,000. All loans that exceed this limit are reviewed by the Management Loan Committee and, if approved following the review, are submitted to the Board of Directors for final approval.\nGenerally, we require property and extended coverage casualty insurance in amounts at least equal to the principal amount of the loan or the value of improvements on the property, depending on the type of loan. In addition, we require an escrow for flood insurance (where appropriate) and generally require an escrow for required property taxes and insurance. On occasion, we allow borrowers to pay their own taxes and property and casualty insurance as long as proof of payment is provided.\nWe have a separate policy for commercial loans wherein loans up to $500,000 are approved by the Senior Lending Officer and Chief Risk Officer. Loans over $500,000 up to $1,000,000 are approved by the Commercial Loan Committee consisting of the President and CEO and two outside loan committee members with over a combined 60 years of commercial lending experience. All commercial loans over $1.0 million are approved by the full board.\nDelinquencies, Classified Assets and Nonperforming Assets\nDelinquency Procedures. When a borrower fails to make a required monthly payment on a loan, we mail a notice to the borrower and attempt to contact the borrower by phone. All delinquent loans are reported to the board of directors each month. After 90 days delinquent the loan is transferred to the appropriate collections personnel. Our policies provide that a late notice be sent each month that the loan is past due. Once the loan is considered in default, generally at 90 days past due, a letter is generally sent to the borrower explaining that the entire balance of the loan is due and payable, the loan is placed on non-accrual status, and additional efforts are made to contact the borrower. If the borrower does not respond, we generally initiate foreclosure proceedings when the loan is 120 days past due. If the loan is reinstated, foreclosure proceedings will be discontinued and the borrower will be permitted to continue to make payments. In certain instances, we may modify the loan or grant a limited exemption from loan payments to allow the borrower to reorganize his or her financial affairs.\nWhen we acquire real estate as a result of foreclosure or by deed in lieu of foreclosure, the real estate is classified as other real estate owned until it is sold. The real estate is recorded at estimated fair value at the date of acquisition, less estimated costs to sell, and any write-down resulting from the acquisition is charged to the allowance for loan losses. Subsequent decreases in the value of the property are charged to operations. After acquisition, all costs in maintaining the property are expensed as incurred. Costs relating to the development and improvement of the property, however, are capitalized to the extent of estimated fair value less estimated costs to sell. At June 30, 2023, we had no real estate acquired as a result of foreclosure or by deed in lieu of foreclosure.\nTroubled Debt Restructurings. We occasionally modify loans to extend the term or make other concessions to help a borrower stay current on his or her loan and to avoid foreclosure. We consider modifications only after analyzing the borrowers current repayment capacity, evaluating the strength of any guarantors based on documented current financial information, and assessing the current value of any collateral pledged. We generally do not forgive principal or interest on loans, but may do so if it is in our best interest and increases the likelihood that we can collect the remaining principal balance. We may modify the terms of loans to lower interest rates (which may be at below market rates), to provide for fixed interest rates on loans where fixed rates are otherwise not available, to provide for longer amortization schedules, or to provide for interest-only terms. These modifications are made only when a workout plan has been\nagreed to by the borrower that we believe is reasonable and attainable and in our best interests. At June 30, 2023, we had a commercial real estate loan which was classified as a troubled debt restructuring, with an outstanding balance of $38,000.\nDelinquent Loans. The following table sets forth our loan delinquencies, including non-accrual loans, by type and amount at the dates indicated.\nAt June 30,\n30-59\n60-89\n90 Days\n30-59\n60-89\n90 Days\nDays\nDays\nor More\nDays\nDays\nor More\nPast Due\nPast Due\nPast Due\nPast Due\nPast Due\nPast Due\n(In thousands)\nReal estate loans:\nCommercial real estate\n$\n-\n$\n-\n$\n-\n$\n-\n$\n-\n$\n-\nResidential real estate\n-\n-\nMultifamily\n-\n-\n-\n-\n-\n-\nAgricultural real estate\n-\n-\n-\n-\n-\n-\nConstruction and land\n-\n-\n-\n-\n-\n-\nHome equity lines of credit (HELOC)\n-\n-\n-\n-\n-\n-\nCommercial and industrial loans\n-\n-\n-\n-\n-\n-\nConsumer loans\n-\n-\n-\n-\n-\n-\nTotal\n$\n-\n$\n$\n$\n-\n$\n$\nNon-Performing Assets. The following table sets forth information regarding our non-performing assets at the dates indicated. Non-accrual loans, including non-accruing troubled debt restructurings, totaled $304,000 and $226,000 at June 30, 2023 and June 30, 2022, respectively.\nAt June 30,\n(Dollars in thousands)\nNon-accrual loans:\nReal estate loans:\nCommercial\n$\n-\n$\n-\nResidential\nAgricultural\n-\n-\nConstruction and land\n-\n-\nCommercial and industrial loans\n-\n-\nHome equity lines of credit (HELOC)\n-\n-\nConsumer\n-\n-\nTotal non-accrual loans\n$\n$\nAccruing loans past due 90 days or more:\nReal estate loans:\nCommercial\n-\n-\nResidential\n-\nAgricultural\n-\n-\nConstruction and land\n-\n-\nCommercial and industrial loans\n-\n-\nHome equity line of credit (HELOC)\n-\n-\nConsumer\n-\n-\nTotal accruing loans past due 90 days or more\n-\nTotal nonperforming loans\nReal estate owned\n-\n-\nOther nonperforming assets\n-\n-\nTotal non-performing assets\n$\n$\nTroubled debt restructurings:\nCommercial\n$\n-\n$\n-\nResidential\n-\n-\nAgricultural\n-\n-\nConstruction and land\nCommercial and industrial loans\n-\n-\nHome equity lines of credit (HELOC)\n-\n-\nConsumer\n-\n-\nTotal troubled debt restructurings\n$\n$\nTotal non-performing loans to total loans\n0.34\n%\n0.44\n%\nTotal non-performing loans to total assets\n0.18\n%\n0.24\n%\nTotal non-performing assets to total assets\n0.18\n%\n0.24\n%\nTotal non-performing loans and troubled debt restructurings to total loans\n0.38\n%\n0.49\n%\nTotal non-performing loans and troubled debt restructurings to total assets\n0.21\n%\n0.27\n%\nClassified Assets. Federal regulations provide that loans and other assets of lesser quality should be classified as substandard, doubtful or loss. An asset is considered substandard if it is inadequately protected by the current net worth and paying capacity of the obligor or of the collateral pledged, if any. Substandard assets include those\ncharacterized by the distinct possibility that the insured institution will sustain some loss if the deficiencies are not corrected. Assets classified as doubtful have all of the weaknesses inherent in those classified substandard, with the added characteristic that the weaknesses present make collection or liquidation in full, on the basis of currently existing facts, conditions, and values, highly questionable and improbable. Assets classified as loss are those considered uncollectible and of such little value that their continuance as assets without the establishment of a specific allowance for loan losses is not warranted. Assets that do not currently expose the insured institution to sufficient risk to warrant classification in one of the aforementioned categories but possess weaknesses are designated as special mention.\nWhen an insured institution classifies problem assets as either substandard or doubtful, it may establish general allowances in an amount deemed prudent by management to cover losses that were both probable and reasonable to estimate. General allowances represent allowances which have been established to cover accrued losses associated with lending activities that were both probable and reasonable to estimate, but which, unlike specific allowances, have not been allocated to particular problem assets. When an insured institution classifies problem assets as loss, it is required either to establish a specific allowance for losses equal to 100% of that portion of the asset so classified or to charge-off such amount. An institutions determination as to the classification of its assets and the amount of its valuation allowances is subject to review by the regulatory authorities, which may require the establishment of additional general or specific allowances.\nIn connection with the filing of our periodic regulatory reports and according to our classification of assets policy, we regularly review the problem loans in our portfolio to determine whether any loans require classification according to applicable regulations. If a problem loan deteriorates in asset quality, the classification is changed to substandard, doubtful or loss depending on the circumstances and the evaluation. Generally, loans 90 days or more past due are placed on nonaccrual status and classified substandard.\nOur classified and special mention assets at the dates indicated were as follows:\nAt June 30,\n(In thousands)\nClassified Assets:\nSubstandard\n$\n$\nDoubtful\n-\nLoss\n-\n-\nTotal\n$\n$\nSpecial mention\n$\n$\nOther Loans of Concern. At June 30, 2023, except for loans included in the above table, there were no other loans of concern for which we had information about possible credit problems of borrowers that caused us to have serious doubts about the ability of the borrowers to comply with present loan repayment terms and that may result in disclosure of such loans in the future.\nAllowance for Loan and Lease Losses\nThe allowance for loan losses is maintained at a level which, in managements judgment, is adequate to absorb probable credit losses inherent in the loan portfolio. The amount of the allowance is based on managements evaluation of the collectability of the loan portfolio, including the nature of the portfolio, credit concentrations, trends in historical loss experience, specific impaired loans, and economic conditions. Allowances for impaired loans are generally determined based on collateral values or the present value of estimated cash flows. Because of uncertainties associated with regional economic conditions, collateral values, and future cash flows on impaired loans, it is reasonably possible that managements estimate of probable credit losses inherent in the loan portfolio and the related allowance may change materially in the near-term. The allowance is increased by a provision for loan losses, which is charged to expense and reduced by full and partial charge-offs, net of recoveries. Changes in the allowance relating to impaired loans are charged or credited to the provision for loan losses. Managements periodic evaluation of the adequacy of the allowance\nis based on various factors, including, but not limited to, managements ongoing review and grading of loans, facts and issues related to specific loans, historical loan loss and delinquency experience, trends in past due and non-accrual loans, existing risk characteristics of specific loans or loan pools, the fair value of underlying collateral, current economic conditions and other qualitative and quantitative factors which could affect potential credit losses. The Company has decided to increase its allowance for loan and lease losses for commercial loans due to the increased focus on this type of lending. Historic measures of the Bank do not reflect this risk, so regional data on banks is used in determining this allowance amount. This will lead to higher provision costs in the next several years as this allowance for loan losses is built.\nAs an integral part of their examination process, the OCC will periodically review our allowance for loan and losses, and as a result of such reviews, we may determine to adjust our allowance for loan losses. However, the OCC is not directly involved in the process for establishing the allowance for loan losses as the process is our responsibility and any increase or decrease in the allowance is the responsibility of management.\nThe following table sets forth activity in our allowance for loan and lease losses for the periods indicated.\nAt or For the Years Ended June 30,\n(Dollars in thousands)\nAllowance for loan and lease losses at beginning of year\n$\n$\nProvision for loan losses\n-\nCharge-offs:\nReal estate loans:\nCommercial\n-\n-\nResidential\n-\n-\nAgricultural\n-\n-\nConstruction and land\n-\n-\nCommercial and industrial loans\n-\n-\nHome equity lines of credit (HELOC)\n-\n-\nConsumer loans\n-\n-\nTotal charge-offs\n-\n-\nRecoveries:\nReal estate loans:\nCommercial\n-\n-\nResidential\n-\n-\nAgricultural\n-\n-\nConstruction and land\n-\n-\nCommercial and industrial loans\n-\n-\nHome equity lines of credit (HELOC)\n-\n-\nConsumer loans\n-\n-\nTotal recoveries\n-\n-\nNet (charge-offs) recoveries\n-\n-\nAllowance for loan losses at end of year\n$\n$\nAllowance for loan losses to non-performing loans at end of year\n86.62\n%\n62.04\n%\nAllowance for loan losses to total loans outstanding at end of year\n0.29\n%\n0.27\n%\nNet charge-offs (recoveries) to average loans outstanding during the year\n0.00\n%\n0.00\n%\nAllocation of Allowance for Loan and Lease Losses. The following tables set forth the allowance for loan losses allocated by loan category and the percent of the allowance in each category to the total allocated allowance at the\ndates indicated. The allowance for loan losses allocated to each category is not necessarily indicative of future losses in any particular category and does not restrict the use of the allowance to absorb losses in other categories.\nAt June 30,\nPercent of\nPercent of\nPercent of\nPercent of\nAllowance to\nLoans in\nAllowance to\nLoans in\nTotal\nCategory to\nTotal\nCategory to\nAmount\nAllowance\nTotal Loans\nAmount\nAllowance\nTotal Loans\n(Dollars in thousands)\nReal estate loans:\nCommercial\n$\n10.4\n%\n6.7\n%\n$\n9.3\n%\n6.2\n%\nResidential\n63.7\n73.4\n79.8\n79.8\nMultifamily\n0.7\n0.8\n0.9\n0.9\nAgricultural\n6.5\n4.5\n6.2\n4.2\nConstruction and land\n4.7\n9.5\n2.5\n7.3\nHome equity lines of credit (HELOC)\n13.2\n0.4\n0.6\n0.3\nCommercial and industrial loans\n0.3\n3.8\n0.3\nConsumer\n0.5\n0.9\n0.5\n0.9\nTotal allocated allowance\n$\n%\n%\n$\n%\n%\nUnallocated allowance\n-\n-\nTotal allowance for loan losses\n$\n$\nAlthough we believe that we use the best information available to establish the allowance for loan losses, future adjustments to the allowance for loan losses may be necessary and results of operations could be adversely affected if circumstances differ substantially from the assumptions used in making the determinations. Because future events affecting borrowers and collateral cannot be predicted with certainty, the existing allowance for loan losses may not be adequate and management may determine that increases in the allowance are necessary if the quality of any portion of our loan portfolio deteriorates as a result. Furthermore, as an integral part of its examination process, the OCC will periodically review our allowance for loan losses. The OCC may have judgments different than those of management, and we may determine to increase our allowance as a result of these regulatory reviews. Any material increase in the allowance for loan losses may adversely affect our financial condition and results of operations.\nInvestment Activities\nGeneral. The goals of our investment policy is to maximize portfolio yield over the long term in a manner that is consistent with minimizing risk, meeting liquidity needs, meeting pledging requirements, and meeting asset/liability management and interest rate risk strategies. Subject to loan demand and our interest rate risk analysis, we expect to increase the balance of our investment securities portfolio when we have excess liquidity.\nOur investment policy was adopted by the board of directors and is reviewed annually by the board of directors. All investment decisions are made by our Asset/Liability Committee according to board-approved policies. An investment schedule detailing the investment portfolio is reviewed at least monthly by the board of directors.\nOur current investment policy permits, with certain limitations, investments in: U.S. Treasury securities; securities issued by the U.S. government and its agencies or government sponsored enterprises including mortgage-backed securities and collateralized mortgage obligations issued by Fannie Mae, Ginnie Mae, and Freddie Mac; corporate and municipal bonds; asset-backed securities; certificates of deposit in other financial institutions; federal funds and money market funds, among other investments.\nAt June 30, 2023, our investment portfolio consisted of securities and obligations issued by U.S. government-sponsored enterprises as well as state and municipal securities. At June 30, 2023, we also owned $397,000 of Federal Home Loan Bank of Cincinnati stock. As a member of Federal Home Loan Bank of Cincinnati, we are required to purchase stock in the Federal Home Loan Bank of Cincinnati, which is carried at cost and classified as a restricted investment.\nAt June 30, 2023, all of our investment securities are carried at fair value through accumulated other comprehensive income.\nFor additional information regarding our investment securities portfolio, see Note 3 to the notes to financial statements.\nSources of Funds\nGeneral. Deposits have traditionally been our primary source of funds for use in lending and investment activities. We may also use borrowings to supplement cash flow needs, lengthen the maturities of liabilities for interest rate risk purposes and to manage the cost of funds. In addition, we receive funds from scheduled loan payments, investment maturities, loan prepayments, retained earnings and income on earning assets. While scheduled loan payments and income on earning assets are relatively stable sources of funds, deposit inflows and outflows can vary widely and are influenced by prevailing interest rates, market conditions and levels of competition.\nDeposits. Our deposits are generated primarily from our primary market area. We offer a selection of deposit accounts, including savings accounts, checking accounts, certificates of deposit and individual retirement accounts. Deposit account terms vary, with the principal differences being the minimum balance required, the amount of time the funds must remain on deposit and the interest rate.\nInterest rates paid, maturity terms, service fees and withdrawal penalties are established on a periodic basis. Deposit rates and terms are based primarily on current operating strategies and market rates, liquidity requirements, rates paid by competitors and growth goals. We rely upon personalized customer service, long-standing relationships with customers, and our favorable reputation in the community to attract and retain local deposits. We also seek to obtain deposits from our commercial loan customers.\nThe flow of deposits is influenced significantly by general economic conditions, changes in money market and other prevailing interest rates and competition. The variety of deposit accounts offered allows us to be competitive in obtaining funds and responding to changes in consumer demand. Based on experience, we believe that our deposits are relatively stable. However, the ability to attract and maintain deposits and the rates paid on these deposits, has been and will continue to be significantly affected by market conditions. The Company chose to utilize brokered deposits in March of 2023 to ensure appropriate liquidity during an uncertain banking environment. While the Company did slightly increase deposits during this period, given uncertainty of liquidity in the banking industry and to manage interest rate risk, these deposits will continue to be utilized. These totaled $10.1 million at June 30, 2023.\nThe following table sets forth the distribution of total deposits, by account type, at the dates indicated.\nAt June 30,\nAverage\nAverage\nAmount\nPercent\nRate\nAmount\nPercent\nRate\n(Dollars in thousands)\nNoninterest-bearing demand deposits\n$\n3,247\n2.7\n%\n-\n%\n$\n2,554\n2.3\n%\n-\n%\nInterest-bearing demand deposits\n23,304\n19.4\n0.99\n23,483\n21.4\n0.01\nSavings deposits\n42,020\n35.0\n0.51\n48,736\n44.3\n0.02\nCertificates of deposit\n51,420\n42.9\n1.74\n35,217\n32.0\n0.75\nTotal\n$\n119,991\n100.0\n%\n1.08\n$\n109,990\n100.0\n%\n0.25\n%\nAt June 30, 2023 and June 30, 2022, the aggregate amount of all uninsured deposits (deposits in excess of the Federal Deposit Insurance limit of $250,000 per account) was $23.0 million and $21.9 million, respectively. At June 30, 2023 and June 30, 2022, the aggregate amount of all uninsured certificates of deposit was $5.7 million and $3.1 million,\nrespectively. At June 30, 2023 and June 30, 2022, we had no deposits that were uninsured for any reason other than being in excess of the Federal Deposit Insurance Corporation limit.\nThe following table sets forth the maturity of our uninsured certificates of deposit at June 30, 2023.\nAt June 30,\n(In thousands)\nMaturity Period:\nThree months or less\n$\n-\nOver three months through six months\nOver six months through 12 months\n1,068\nOver 12 months\n3,711\nTotal\n$\n5,716\nBorrowings. We may obtain advances from the Federal Home Loan Bank of Cincinnati upon the security of our capital stock in it and our one- to four-family residential real estate portfolio. We may utilize these advances for asset/liability management purposes and for additional funding for our operations. Such advances may be made under several different credit programs, each of which has its own interest rate and range of maturities. At June 30, 2022, we had outstanding advances of $6.2 million from the Federal Home Loan Bank of Cincinnati. At June 30, 2023, based on available collateral and our ownership of Federal Home Loan Bank of Cincinnati common stock, we had access to up to an additional $38.9 million of advances from the Federal Home Loan Bank of Cincinnati.\nWe also enrolled to participate in the Bank Term funding Program created on March 12, 2023 by the Federal Reserve. Any amounts drawn can be refinanced at any time with a term of one year from the date of the initial draw or one year from the latest date of refinancing, whichever is later. The program is set to end on March 11, 2024. Thus, the longest term available would be through March 10, 2025. At June 30, 2023 we had not pledged any collateral to the program but eligible collateral available to pledge was approximately $27.1 million, creating an additional ability to draw of the same amount.\nPersonnel\nAs of June 30, 2023, we had 26 full-time employees and 1 part-time employee. Our employees are not represented by any collective bargaining group. Management believes that we have good working relations with our employees.\nSubsidiary Activities\nVan Wert Federal is the wholly-owned subsidiary of VWF Bancorp. Van Wert Federal has no subsidiaries.\nRegulation and Supervision\nGeneral\nAs a federal savings association (the term savings association includes a federal savings bank), Van Wert Federal is subject to examination and regulation by the OCC, and is also subject to examination by the FDIC. This regulation and supervision establishes a comprehensive framework of activities in which an institution may engage and is intended primarily for the protection of the FDICs deposit insurance fund and depositors, and not for the protection of security holders. Van Wert Federal also is a member of and owns stock in the Federal Home Loan Bank of Cincinnati, which is one of the 11 regional banks in the Federal Home Loan Bank System.\nUnder this system of regulation, the regulatory authorities have extensive discretion in connection with their supervisory, enforcement, rulemaking and examination activities and policies, including rules or policies that: establish minimum capital levels; restrict the timing and amount of dividend payments; govern the classification of assets;\ndetermine the adequacy of loan loss reserves for regulatory purposes; and establish the timing and amounts of assessments and fees. Moreover, as part of their examination authority, the banking regulators assign numerical ratings to banks and savings institutions relating to capital, asset quality, management, liquidity, earnings and other factors. The receipt of a less than satisfactory rating in one or more categories may result in enforcement action by the banking regulators against a financial institution. A less than satisfactory rating may also prevent a financial institution, such as Van Wert Federal or its holding company, from obtaining necessary regulatory approvals to access the capital markets, pay dividends, acquire other financial institutions or establish new branches.\nIn addition, we must comply with significant anti-money laundering and anti-terrorism laws and regulations, Community Reinvestment Act laws and regulations, and fair lending laws and regulations. Government agencies have the authority to impose monetary penalties and other sanctions on institutions that fail to comply with these laws and regulations, which could significantly affect our business activities, including our ability to acquire other financial institutions or expand our branch network.\nVWF Bancorp is a savings and loan holding company subject to the rules and regulations of the Federal Reserve Board. It is required to file certain reports with the Federal Reserve Board and is subject to examination by the enforcement authority of the Federal Reserve Board. VWF Bancorp is also subject to the rules and regulations of the Securities and Exchange Commission under the federal securities laws. Effective June 23, 2023, the Bank elected to operate as a covered savings association (CSA). A CSA has the same rights and privileges as a national bank that has its main office situated in the same location as the home office of the CSA and is subject to the same duties, restrictions, penalties, liabilities, conditions, and limitations that would apply to such a national bank.\nAny change in applicable laws or regulations, whether by the OCC, the FDIC, the Federal Reserve Board or Congress, could have a material adverse impact on the operations and financial performance of VWF Bancorp and Van Wert Federal.\nSet forth below is a brief description of material regulatory requirements that are applicable to Van Wert Federal and VWF Bancorp. The description is limited to certain material aspects of the statutes and regulations addressed, and is not intended to be a complete description of such statutes and regulations and their effects on Van Wert Federal and VWF Bancorp.\nFederal Banking Regulation\nBusiness Activities. A federal association derives its lending and investment powers from the Home Owners Loan Act, as amended, and applicable federal regulations. Under these laws and regulations, Van Wert Federal may invest in mortgage loans secured by residential and commercial real estate, commercial business and consumer loans, certain types of debt securities and certain other assets, subject to applicable limits. Van Wert Federal may also establish subsidiaries that may engage in certain activities not otherwise permissible for Van Wert Federal to engage in directly, including real estate investment and securities and insurance brokerage.\nCapital Requirements. Federal regulations require federally insured depository institutions to meet several minimum capital standards: a common equity Tier 1 capital to risk-weighted assets ratio of 4.5%, a Tier 1 capital to risk-weighted assets ratio of 6.0%, a total capital to risk-weighted assets of 8.0%, and a 4.0% Tier 1 capital to adjusted average total assets leverage ratio.\nCommon equity Tier 1 capital is generally defined as common stockholders equity and retained earnings. Tier 1 capital is generally defined as common equity Tier 1 and additional Tier 1 capital. Additional Tier 1 capital includes certain noncumulative perpetual preferred stock and related surplus and minority interests in equity accounts of consolidated subsidiaries. Total capital includes Tier 1 capital (common equity Tier 1 capital plus additional Tier 1 capital) and Tier 2 capital. Tier 2 capital is comprised of capital instruments and related surplus, meeting specified requirements, and may include cumulative preferred stock and long-term perpetual preferred stock, mandatory convertible securities, intermediate preferred stock and subordinated debt. Also included in Tier 2 capital is the allowance for loan losses limited to a maximum of 1.25% of risk-weighted assets and, for institutions that have exercised an opt-out election regarding the treatment of Accumulated Other Comprehensive Income (AOCI), up to 45% of net\nunrealized gains on available-for-sale equity securities with readily determinable fair market values. Institutions that have not exercised the AOCI opt-out have AOCI incorporated into common equity Tier 1 capital (including unrealized gains and losses on available-for-sale-securities). Van Wert Federal exercised its AOCI opt-out election. Calculation of all types of regulatory capital is subject to deductions and adjustments specified in the regulations.\nIn determining the amount of risk-weighted assets for purposes of calculating risk-based capital ratios, all assets, including certain off-balance sheet assets (e.g., recourse obligations, direct credit substitutes, residual interests) are multiplied by a risk weight factor assigned by the regulations based on the risks believed inherent in the type of asset. Higher levels of capital are required for asset categories believed to present greater risk. For example, a risk weight of 0% is assigned to cash and U.S. government securities, a risk weight of 50% is generally assigned to prudently underwritten first lien one- to four-family residential real estate loans, a risk weight of 100% is assigned to commercial and consumer loans, a risk weight of 150% is assigned to certain past due loans and a risk weight of between 0% to 600% is assigned to permissible equity interests, depending on certain specified factors.\nIn addition to establishing the minimum regulatory capital requirements, the regulations limit capital distributions and certain discretionary bonus payments to management if the institution does not hold a capital conservation buffer consisting of 2.5% of common equity Tier 1 capital to risk-weighted assets above the amount necessary to meet its minimum risk-based capital requirements. The capital conservation buffer requirement was phased in beginning January 1, 2016 at 0.625% of risk-weighted assets and increasing each year until fully implemented at 2.5% of risk-weighted assets on January 1, 2019.\nThe federal banking agencies have developed a Community Bank Leverage Ratio (CBLR) (the ratio of Tier 1 capital to average total consolidated assets) for financial institutions with assets of less than $10 billion that meet certain qualifying criteria. A qualifying community bank that exceeds this ratio will be deemed compliant with all other capital requirements, including the capital requirements to be considered well capitalized under Prompt Corrective Action statutes. The federal banking agencies may consider a financial institutions risk profile when evaluating whether it qualifies as a community bank for purposes of the capital ratio requirement. The federal banking agencies must set the minimum Community Bank Leverage Ratio at not less than 8% and not more than 10%, and as of January 1, 2023, it is set at 9%. Van Wert Federal has elected to be subject to the CBLR framework. At June 30, 2023, Van Wert Federals CBLR was 20.57%.\nLoans-to-One Borrower. Generally, a federal savings association may not make a loan or extend credit to a single or related group of borrowers in excess of 15% of unimpaired capital and surplus. An additional amount may be loaned, equal to 10% of unimpaired capital and surplus, if the loan is secured by readily marketable collateral, which generally does not include real estate. At June 30, 2023, Van Wert Federal complied with the loans-to-one borrower limitations.\nQualified Thrift Lender Test. Prior to its CSA election, Van Wert Federal had to satisfy the qualified thrift lender, or QTL, test. Under the QTL test, it must maintain at least 65% of its portfolio assets in qualified thrift investments (primarily residential mortgages and related investments, including mortgage-backed securities) in at least nine months of the most recent 12-month period. Portfolio assets generally means total assets of a savings association, less the sum of specified liquid assets up to 20% of total assets, goodwill and other intangible assets, and the value of property used in the conduct of the savings associations business.\nVan Wert Federal also may satisfy the QTL test by qualifying as a domestic building and loan association as defined in the Internal Revenue Code of 1986, as amended. This test generally requires a savings association to have at least 75% of its deposits held by the public and earn at least 25% of its income from loans and U.S. government obligations. Alternatively, a savings association can satisfy this test by maintaining at least 60% of its assets in cash, real estate loans and U.S. Government or state obligations.\nA savings association that fails the qualified thrift lender test must operate under specified restrictions set forth in the Home Owners Loan Act. The Dodd-Frank Act made noncompliance with the QTL test subject to agency enforcement action for a violation of law. At June 30, 2023, Van Wert Federal complied with the qualified thrift lender\ntest, with a percentage of qualified thrift investments to total assets of approximately 80.0%. Beginning on June 23, 2023, Van Wert Federal no longer had to follow the qualified thrift lender test.\nCapital Distributions. Federal regulations govern capital distributions by a federal savings association, which include cash dividends, stock repurchases and other transactions charged to its capital account. A federal savings association must file an application with the OCC for approval of a capital distribution if:\n● the total capital distributions for the applicable calendar year exceed the sum of the savings associations net income for that year to date plus its retained net income for the preceding two years;\n● the savings association would not be at least adequately capitalized following the distribution;\n● the distribution would violate any applicable statute, regulation, agreement or regulatory condition; or\n● the savings association is not eligible for expedited treatment of its filings, generally due to an unsatisfactory CAMELS rating or being subject to a cease and desist order or formal written agreement that requires action to improve the institutions financial condition.\nEven if an application is not otherwise required, every savings association that is a subsidiary of a savings and loan holding company, such as Van Wert Federal, must still file a notice with the Federal Reserve Board at least 30 days before the board of directors declares a dividend or approves a capital distribution.\nA notice or application related to a capital distribution may be disapproved if:\n● the savings association would be undercapitalized following the distribution;\n● the proposed capital distribution raises safety and soundness concerns; or\n● the capital distribution would violate a prohibition contained in any statute, regulation or agreement.\nIn addition, an insured depository institution may not make any capital distribution if, after making such distribution, the institution would fail to meet any applicable regulatory capital requirement. A federal savings association also may not make a capital distribution that would reduce its regulatory capital below the amount required for the liquidation account established in connection with its conversion to stock form.\nCommunity Reinvestment Act and Fair Lending Laws. All federal savings associations have a responsibility under the Community Reinvestment Act and related regulations to help meet the credit needs of their communities, including low- and moderate-income borrowers. In connection with its examination of a federal savings association, the OCC is required to assess the federal savings associations record of compliance with the Community Reinvestment Act. A savings associations failure to comply with the provisions of the Community Reinvestment Act could, at a minimum, result in denial of certain corporate applications such as branches or mergers, or in restrictions on its activities. In addition, the Equal Credit Opportunity Act and the Fair Housing Act prohibit lenders from discriminating in their lending practices on the basis of characteristics specified in those statutes. The failure to comply with the Equal Credit Opportunity Act and the Fair Housing Act could result in enforcement actions by the OCC, as well as other federal regulatory agencies and the Department of Justice.\nThe Community Reinvestment Act requires all institutions insured by the Federal Deposit Insurance Corporation to publicly disclose their rating. Van Wert Federal received a satisfactory Community Reinvestment Act rating in its most recent federal examination.\nTransactions with Related Parties. A federal savings associations authority to engage in transactions with its affiliates is limited by Sections 23A and 23B of the Federal Reserve Act and federal regulations. An affiliate is generally a company that controls, or is under common control with, an insured depository institution such as Van Wert Federal.\nVWF Bancorp is an affiliate of Van Wert Federal because of its control of Van Wert Federal. In general, transactions between an insured depository institution and its affiliates are subject to certain quantitative limits and collateral requirements. In addition, federal regulations prohibit a savings association from lending to any of its affiliates that are engaged in activities that are not permissible for bank holding companies and from purchasing the securities of any affiliate, other than a subsidiary. Finally, transactions with affiliates must be consistent with safe and sound banking practices, not involve the purchase of low-quality assets and be on terms that are as favorable to the institution as comparable transactions with non-affiliates.\nVan Wert Federals authority to extend credit to its directors, executive officers and 10% stockholders, as well as to entities controlled by such persons, is currently governed by the requirements of Sections 22(g) and 22(h) of the Federal Reserve Act and Regulation O of the Federal Reserve Board. Among other things, these provisions generally require that extensions of credit to insiders:\n● be made on terms that are substantially the same as, and follow credit underwriting procedures that are not less stringent than, those prevailing for comparable transactions with unaffiliated persons and that do not involve more than the normal risk of repayment or present other unfavorable features; and\n● not exceed certain limitations on the amount of credit extended to such persons, individually and in the aggregate, which limits are based, in part, on the amount of Van Wert Federals capital.\nIn addition, extensions of credit in excess of certain limits must be approved by Van Wert Federals board of directors. Extensions of credit to executive officers are subject to additional limits based on the type of extension involved.\nEnforcement. The OCC has primary enforcement responsibility over federal savings associations and has authority to bring enforcement action against all institution-affiliated parties, including directors, officers, stockholders, attorneys, appraisers and accountants who knowingly or recklessly participate in wrongful action likely to have an adverse effect on a federal savings association. Formal enforcement action by the OCC may range from the issuance of a capital directive or cease and desist order to removal of officers and/or directors of the institution and the appointment of a receiver or conservator. Civil penalties cover a wide range of violations and actions, and range up to $25,000 per day, unless a finding of reckless disregard is made, in which case penalties may be as high as $1 million per day. The FDIC also has the authority to terminate deposit insurance or recommend to the OCC that enforcement action be taken with respect to a particular savings association. If such action is not taken, the FDIC has authority to take the action under specified circumstances.\nStandards for Safety and Soundness. Federal law requires each federal banking agency to prescribe certain standards for all insured depository institutions. These standards relate to, among other things, internal controls, information systems and audit systems, loan documentation, credit underwriting, interest rate risk exposure, asset growth, compensation and other operational and managerial standards as the agency deems appropriate. Interagency guidelines set forth the safety and soundness standards that the federal banking agencies use to identify and address problems at insured depository institutions before capital becomes impaired. If the appropriate federal banking agency determines that an institution fails to meet any standard prescribed by the guidelines, the agency may require the institution to submit to the agency an acceptable plan to achieve compliance with the standard. If an institution fails to meet these standards, the appropriate federal banking agency may require the institution to implement an acceptable compliance plan. Failure to implement such a plan can result in further enforcement action, including the issuance of a cease and desist order or the imposition of civil money penalties.\nInterstate Banking and Branching. Federal law permits well capitalized and well managed holding companies to acquire banks in any state, subject to Federal Reserve Board approval, certain concentration limits and other specified conditions. Interstate mergers of banks are also authorized, subject to regulatory approval and other specified conditions. In addition, among other things, amendments made by the Dodd-Frank Act permit banks to establish de novo branches on an interstate basis provided that branching is authorized by the law of the host state for the banks chartered by that state.\nPrompt Corrective Action. Federal law requires, among other things, that federal bank regulators take prompt corrective action with respect to institutions that do not meet minimum capital requirements. For this purpose, the law establishes five capital categories: well capitalized, adequately capitalized, undercapitalized, significantly undercapitalized and critically undercapitalized. Under the regulations, as amended effective January 1, 2015 to incorporate the previously mentioned amendments to the regulatory capital requirements, an institution is deemed to be well capitalized if it has a total risk-based capital ratio of 10.0% or greater, a Tier 1 risk-based capital ratio of 8.0% or greater, a leverage ratio of 5.0% or greater and a common equity Tier 1 ratio of 6.5% or greater. An institution is adequately capitalized if it has a total risk-based capital ratio of 8.0% or greater, a Tier 1 risk-based capital ratio of 6.0% or greater, a leverage ratio of 4.0% or greater and a common equity Tier 1 ratio of 4.5% or greater. An institution is undercapitalized if it has a total risk-based capital ratio of less than 8.0%, a Tier 1 risk-based capital ratio of less than 6.0%, a leverage ratio of less than 4.0% or a common equity Tier 1 ratio of less than 4.5%. An institution is deemed to be significantly undercapitalized if it has a total risk-based capital ratio of less than 6.0%, a Tier 1 risk-based capital ratio of less than 4.0%, a leverage ratio of less than 3.0% or a common equity Tier 1 ratio of less than 3.0%. An institution is considered to be critically undercapitalized if it has a ratio of tangible equity (as defined in the regulations) to total assets that is equal to or less than 2.0%.\nFederal law and regulations also specify circumstances under which a federal banking agency may reclassify a well-capitalized institution as adequately capitalized and may require an institution classified as less than well capitalized to comply with supervisory actions as if it were in the next lower category.\nThe OCC may order savings associations that have insufficient capital to take corrective actions. For example, a savings association that is categorized as undercapitalized is subject to growth limitations and is required to submit a capital restoration plan, and a holding company that controls such a savings association is required to guarantee that the savings association complies with the restoration plan. A significantly undercapitalized savings association may be subject to additional restrictions. Savings associations deemed by the OCC to be critically undercapitalized would be subject to the appointment of a receiver or conservator.\nAt June 30, 2023, Van Wert Federal met the criteria for being considered well capitalized. In addition, as set forth above, a qualifying community bank, such as Van Wert Federal, that exceeds the Community Bank Leverage Ratio is considered well capitalized under the Prompt Corrective Action statutes. Van Wert Federal has elected to be subject to the Community Bank Leverage Ratio framework. At June 30, 2023, Van Wert Federal exceeded the required Community Bank Leverage Ratio.\nInsurance of Deposit Accounts. Van Wert Federal is a member of the Deposit Insurance Fund, which is administered by the FDIC. Its deposit accounts are insured by the FDIC, generally up to a maximum of $250,000 per depositor.\nThe FDIC imposes deposit insurance assessments against all insured depository institutions. An institutions assessment rate depends upon the perceived risk of the institution to the Deposit Insurance Fund, with institutions deemed less risky paying lower rates. Currently, assessments for institutions of less than $10 billion of total assets are based on financial measures and supervisory ratings derived from statistical models estimating the probability of failure within three years. That system was effective July 1, 2016 and replaced a system under which each institution was assigned to a risk category. Assessment rates (inclusive of possible adjustments) currently range from 1.5 to 30 basis points of each institutions total assets less tangible capital. The current scale, also effective July 1, 2016, is a reduction from the previous range of 2.5 to 45 basis points. The FDIC may increase or decrease the range of assessments uniformly, except that no adjustment can deviate more than two basis points from the base assessment rate without notice and comment rulemaking. The existing system represents a change, required by the Dodd-Frank Act, from the FDICs prior practice of basing the assessment on an institutions aggregate deposits.\nThe FDIC has the authority to increase insurance assessments. A significant increase in insurance premiums would have an adverse effect on the operating expenses and results of operations of Van Wert Federal. We cannot predict what deposit insurance assessment rates will be in the future.\nInsurance of deposits may be terminated by the FDIC upon a finding that an institution has engaged in unsafe or unsound practices, is in an unsafe or unsound condition to continue operations or has violated any applicable law, regulation, rule, order or condition imposed by the FDIC. We do not know of any practice, condition or violation that might lead to termination of deposit insurance for Van Wert Federal.\nPrivacy Regulations. Federal regulations generally require that Van Wert Federal disclose its privacy policy, including identifying with whom it shares a customers non-public personal information, to customers at the time of establishing the customer relationship and annually thereafter. In addition, Van Wert Federal is required to provide its customers with the ability to opt-out of having their personal information shared with unaffiliated third parties and not to disclose account numbers or access codes to non-affiliated third parties for marketing purposes. Van Wert Federal has a privacy protection policy in place and believes that such policy is in compliance with the regulations.\nUSA Patriot Act. Van Wert Federal is subject to the USA PATRIOT Act, which gives federal agencies additional powers to address terrorist threats through enhanced domestic security measures, expanded surveillance powers, increased information sharing, and broadened anti-money laundering requirements. The USA PATRIOT Act contains provisions intended to encourage information sharing among bank regulatory agencies and law enforcement bodies and imposes affirmative obligations on financial institutions, such as enhanced recordkeeping and customer identification requirements.\nProhibitions Against Tying Arrangements. Federal savings associations are prohibited, subject to some exceptions, from extending credit to or offering any other service, or fixing or varying the consideration for such extension of credit or service, on the condition that the customer obtain some additional service from the institution or its affiliates or not obtain services of a competitor of the institution.\nOther Regulations\nInterest and other charges collected or contracted for by Van Wert Federal are subject to state usury laws and federal laws concerning interest rates. Loan operations are also subject to state and federal laws applicable to credit transactions, such as the:\n● Home Mortgage Disclosure Act of 1975, requiring financial institutions to provide information to enable the public and public officials to determine whether a financial institution is fulfilling its obligation to help meet the housing needs of the community it serves;\n● Equal Credit Opportunity Act, prohibiting discrimination on the basis of race, creed or other prohibited factors in extending credit;\n● Fair Credit Reporting Act of 1978, governing the use and provision of information to credit reporting agencies; and\n● Rules and regulations of the various federal and state agencies charged with the responsibility of implementing such federal and state laws.\nThe deposit operations of Van Wert Federal also are subject to, among others, the:\n● Right to Financial Privacy Act, which imposes a duty to maintain confidentiality of consumer financial records and prescribes procedures for complying with administrative subpoenas of financial records;\n● Check Clearing for the 21st Century Act (also known as Check 21), which gives substitute checks, such as digital check images and copies made from that image, the same legal standing as the original paper check; and\n● Electronic Funds Transfer Act and Regulation E promulgated thereunder, which govern automatic deposits to and withdrawals from deposit accounts and customers rights and liabilities arising from the use of automated teller machines and other electronic banking services.\nFederal Home Loan Bank System\nVan Wert Federal is a member of the Federal Home Loan Bank of Cincinnati, which is one of 11 regional Federal Home Loan Banks in the Federal Home Loan Bank System. The Federal Home Loan Bank of Cincinnati provides a central credit facility primarily for its member institutions. Members of the Federal Home Loan Bank of Cincinnati are required to acquire and hold shares of capital stock in the Federal Home Loan Bank of Cincinnati. Van Wert Federal complied with this requirement at June 30, 2023. Based on redemption provisions of the Federal Home Loan Bank of Cincinnati, the stock has no quoted market value and is carried at cost. Van Wert Federal reviews for impairment, based on the ultimate recoverability, the cost basis of the Federal Home Loan Bank of Cincinnati stock. At June 30, 2023, no impairment has been recognized.\nHolding Company Regulation\nVWF Bancorp is a unitary savings and loan holding company subject to regulation and supervision by the Federal Reserve Board. The Federal Reserve Board has enforcement authority over VWF Bancorp and its non-savings institution subsidiaries. Among other things, this authority permits the Federal Reserve Board to restrict or prohibit activities that are determined to be a risk to Van Wert Federal.\nAs a savings and loan holding company, VWF Bancorps activities are limited to those activities permissible by law for financial holding companies (if VWF Bancorp makes an election to be treated as a financial holding company and meets the other requirements to be a financial holding company) or multiple savings and loan holding companies. VWF Bancorp does not intend to make an election to be treated as a financial holding company. A financial holding company may engage in activities that are financial in nature, incidental to financial activities or complementary to a financial activity. Such activities include lending and other activities permitted for bank holding companies under Section 4(c)(8) of the Bank Holding Company Act, insurance and underwriting equity securities. Multiple savings and loan holding companies are authorized to engage in activities specified by federal regulation, including activities permitted for bank holding companies under Section 4(c)(8) of the Bank Holding Company Act.\nFederal law prohibits a savings and loan holding company, directly or indirectly, or through one or more subsidiaries, from acquiring more than 5% of another savings institution or savings and loan holding company without prior written approval of the Federal Reserve Board, and from acquiring or retaining control of any depository institution not insured by the FDIC. In evaluating applications by holding companies to acquire savings institutions, the Federal Reserve Board must consider such things as the financial and managerial resources and future prospects of the company and institution involved, the effect of the acquisition on and the risk to the federal deposit insurance fund, the convenience and needs of the community and competitive factors. A savings and loan holding company may not acquire a savings institution in another state and hold the target institution as a separate subsidiary unless it is a supervisory acquisition under Section 13(k) of the Federal Deposit Insurance Act or the law of the state in which the target is located authorizes such acquisitions by out-of-state companies.\nSavings and loan holding companies historically have not been subject to consolidated regulatory capital requirements. The Dodd-Frank Act requires the Federal Reserve Board to establish minimum consolidated capital requirements for all depository institution holding companies that are as stringent as those required for the insured depository subsidiaries. However, legislation was enacted in May 2018 that required the Federal Reserve Board to amend its Small Bank Holding Company exemption from consolidated holding company capital requirements to generally extend its applicability to bank and savings and loan holding companies of up to $3.0 billion in assets. Regulations implementing this amendment were effective in August 2018. Consequently, savings and loan holding companies of under $3.0 billion in consolidated assets remain exempt from consolidated regulatory capital requirements, unless the Federal Reserve determines otherwise in particular cases.\nThe Dodd-Frank Act extended the source of strength doctrine to savings and loan holding companies. The Federal Reserve Board has promulgated regulations implementing the source of strength policy that require holding companies to act as a source of strength to their subsidiary depository institutions by providing capital, liquidity and other support in times of financial stress.\nThe Federal Reserve Board has issued a policy statement regarding the payment of dividends and the repurchase of shares of common stock by bank holding companies and savings and loan holding companies. In general, the policy provides that dividends should be paid only out of current earnings and only if the prospective rate of earnings retention by the holding company appears consistent with the organizations capital needs, asset quality and overall financial condition. Regulatory guidance provides for prior regulatory consultation with respect to capital distributions in certain circumstances such as where the companys net income for the past four quarters, net of dividends previously paid over that period, is insufficient to fully fund the dividend or the companys overall rate of earnings retention is inconsistent with the companys capital needs and overall financial condition. The ability of a holding company to pay dividends may be restricted if a subsidiary bank becomes undercapitalized. The policy statement also states that a holding company should inform the Federal Reserve Board supervisory staff before redeeming or repurchasing common stock or perpetual preferred stock if the holding company is experiencing financial weaknesses or if the repurchase or redemption would result in a net reduction, at the end of a quarter, in the amount of such equity instruments outstanding compared with the beginning of the quarter in which the redemption or repurchase occurred. These regulatory policies may affect the ability of VWF Bancorp to pay dividends, repurchase shares of common stock or otherwise engage in capital distributions.\nPrior to its CSA election, in order for VWF Bancorp to be regulated as savings and loan holding company by the Federal Reserve Board, rather than as a bank holding company, Van Wert Federal had to qualify as a qualified thrift lender under federal regulations or satisfy the domestic building and loan association test under the Internal Revenue Code of 1986, as amended. Under the qualified thrift lender test, a savings institution is required to maintain at least 65% of its portfolio assets (total assets less: (i) specified liquid assets up to 20% of total assets; (ii) intangible assets, including goodwill; and (iii) the value of property used to conduct business) in certain qualified thrift investments (primarily residential mortgages and related investments, including certain mortgage-backed and related securities) in at least nine out of each 12 month period. Beginning June 23, 2023, Van Wert Federal no longer had to follow the qualified thrift lender test.\nFederal Securities Laws\nVWF Bancorp common stock is registered with the Securities and Exchange Commission. VWF Bancorp is subject to the information, proxy solicitation, insider trading restrictions and other requirements under the Securities Exchange Act of 1934, as amended.\nShares of common stock purchased by persons who are not affiliates of VWF Bancorp may be resold without registration under the Securities Act of 1933. Shares purchased by an affiliate of VWF Bancorp are subject to the resale restrictions of Rule 144 under the Securities Act of 1933. If VWF Bancorp meets the current public information requirements of Rule 144 under the Securities Act of 1933, each affiliate of VWF Bancorp that complies with the other conditions of Rule 144, including those that require the affiliates sale to be aggregated with those of other persons, would be able to sell in the public market, without registration, a number of shares not to exceed, in any three-month period, the greater of 1% of the outstanding shares of VWF Bancorp, or the average weekly volume of trading in the shares during the preceding four calendar weeks.\nSarbanes-Oxley Act of 2002\nThe Sarbanes-Oxley Act of 2002 is intended to improve corporate responsibility, to provide for enhanced penalties for accounting and auditing improprieties at publicly traded companies and to protect investors by improving the accuracy and reliability of corporate disclosures required under the federal securities laws. We have policies, procedures and systems designed to comply with these regulations, and we review and document such policies, procedures and systems to ensure continued compliance with these regulations.\nChange in Control Regulations\nUnder the Change in Bank Control Act, a federal statute, no person may acquire control of a savings and loan holding company such as VWF Bancorp unless the Federal Reserve Board has been given 60 days prior written notice and has not issued a notice disapproving the proposed acquisition, taking into consideration certain factors, including the financial and managerial resources of the acquirer and the competitive effects of the acquisition. Control, as defined under federal law, means ownership, control of or holding irrevocable proxies representing more than 25% of any class of voting stock, control in any manner of the election of a majority of the institutions directors, or a determination by the regulator that the acquiror has the power, directly or indirectly, to exercise a controlling influence over the management or policies of the institution. Acquisition of more than 10% of any class of a savings and loan holding companys voting stock constitutes a rebuttable determination of control under the regulations under certain circumstances including where, as is the case with VWF Bancorp, the issuer has registered securities under Section 12 of the Securities Exchange Act of 1934.\nIn addition, federal regulations provide that no company may acquire control of a savings and loan holding company without the prior approval of the Federal Reserve Board. Any company that acquires such control becomes a savings and loan holding company subject to registration, examination and regulation by the Federal Reserve Board.\nEmerging Growth Company Status\nVWF Bancorp is an emerging growth company. For as long as it qualifies as an emerging growth company, it may choose to take advantage of exemptions from various reporting requirements applicable to other public companies but not emerging growth companies, including, but not limited to, reduced disclosure obligations regarding executive compensation in our periodic reports and proxy statements, and exemptions from the requirements of holding a non-binding advisory vote on executive compensation. As an emerging growth company, VWF Bancorp is not subject to Section 404(b) of the Sarbanes-Oxley Act of 2002, which would require that our independent auditors audit our internal control over financial reporting. In addition, as an emerging growth company, we have elected to take advantage of the extended transition periods for adopting new or revised financial accounting standards until the date they are required to be adopted by private companies (however, if any new or revised financial accounting standards would not apply to private companies, we would not be able to delay their adoption). Accordingly, our financial statements may not be comparable to those of public companies that adopt new or revised financial accounting standards as of an earlier date. Investors may find our common stock less attractive since we have chosen to rely on these exemptions. If some investors find our common stock less attractive as a result of any choices to reduce future disclosure, there may be a less active trading market for our common stock and the price of our common stock may be more volatile.\nVWF Bancorp will cease to be an emerging growth company upon the earliest of: (i) the end of the fiscal year following the fifth anniversary of the completion of the conversion and offering; (ii) the first fiscal year after our annual gross revenues are $1.07 billion (adjusted for inflation) or more; (iii) the date on which we have, during the previous three-year period, issued more than $1.0 billion in non-convertible debt securities; or (iv) the end of any fiscal year in which the market value of our common stock held by non-affiliates exceeded $700 million at the end of the second quarter of that fiscal year. We expect to lose our status as an emerging growth company effective June 30, 2027, which is the end of the fiscal year following the fifth anniversary of the completion date of the Conversion.\nTaxation\nFederal Taxation\nGeneral. VWF Bancorp and Van Wert Federal are subject to federal income taxation in the same general manner as other corporations, with some exceptions discussed below. The following discussion of federal taxation is intended only to summarize material federal income tax matters and is not a comprehensive description of the tax rules applicable to VWF Bancorp and Van Wert Federal.\nMethod of Accounting. For federal income tax purposes, Van Wert Federal currently reports its income and expenses on the accrual method of accounting and uses a tax year ending December 31 for filing its federal income tax\nreturns. The Small Business Protection Act of 1996 eliminated the use of the reserve method of accounting for bad debt reserves by savings institutions, effective for taxable years beginning after 1995.\nMinimum Tax. The alternative minimum tax (AMT) for corporations has been repealed for tax years beginning after December 31, 2017. Any unused minimum tax credit of a corporation may be used to offset regular tax liability for any tax year. In addition, a portion of unused minimum tax credit was refundable in 2018 through 2021. The refundable portion is 100% for the tax years beginning after December 31, 2018 of the excess of the minimum tax credit for the year over any credit allowable against regular tax for that year. At June 30, 2023, Van Wert Federal had no minimum tax credit carryforward.\nNet Operating Loss Carryovers. Generally, a corporation may carry forward net operating losses generated in tax years beginning after December 31, 2017 indefinitely and can offset up to 80% of taxable income. However, net operating losses generated in tax years beginning in 2018, 2019 and 2020 can be carried back five years and are 100% deductible for tax years ending in 2018, 2019 and 2020. At June 30, 2023, Van Wert Federal generated an NOL that will be carried forward.\nCapital Loss Carryovers. Generally, a corporation may carry back capital losses to the preceding three taxable years and forward to the succeeding five taxable years. Any capital loss carryback or carryover is treated as a short-term capital loss for the year to which it is carried. As such, it is grouped with any other capital losses for the year to which carried and is used to offset any capital gains. Any undeducted loss remaining after the five-year carryover period is not deductible. At June 30, 2023, Van Wert Federal had no capital loss carryovers.\nCorporate Dividends. VWF Bancorp may generally exclude from our income 100% of dividends received from Van Wert Federal as a member of the same affiliated group of corporations.\nAudit of Tax Returns. Van Wert Federals federal income tax returns have not been audited in the most recent five-year period.\nState Taxation\nVan Wert Federal is subject to Ohio taxation in the same general manner as other financial institutions. In particular, Van Wert Federal files a consolidated Ohio Financial Institutions Tax (FIT) return. The FIT is based upon the net worth of the consolidated group. For Ohio FIT purposes, savings institutions are currently taxed at a rate equal to 0.8% of taxable net worth, capped at 14% of the institutions total assets.\nAs a Maryland business corporation, VWF Bancorp is required to file an annual report with and pay personal property taxes to the State of Maryland. ITEM 1A.Risk Factors\nNot applicable, as VWF Bancorp is a smaller reporting company. ITEM 1B.Unresolved Staff Comments\nNone. ITEM 2.Properties\nAt June 30, 2023, the net book value of our properties (including furniture, fixtures and equipment) was $1.4 million. We operate from our sole office located at 976 South Shannon Street, Van Wert, Ohio, which we own. We believe that our current facility is adequate to meet our present and foreseeable needs in Van Wert. We also own vacant land in Van Wert which may be used for future expansion. We currently do not have any plans or understandings to expand our office network.\nThe bank has entered into a lease at 202 West Berry Street, Suite 100, Fort Wayne, Indiana with the lease expected to commence when occupancy takes place. This is currently estimated as January 1, 2024. The lease is for 4,198 square feet that will contain a small branch and the commercial banking operations of the Company. The lease has an initial term of 10 years with two 5-year options, plus a right of first refusal on space within the same building.\nThe bank is leasing temporary space at the Electric Works complex at 1690 Broadway Building 19, Fort Wayne, Indiana. This was a 3-month lease and ends on September 30, 2023. It is expected that the Company will enter into a short-term extension on this space or another space in the vicinity to bridge the gap until the permanent space is ready for occupancy. ITEM 3.Legal Proceedings\nPeriodically, we are involved in claims and lawsuits, such as claims to enforce liens, condemnation proceedings on properties in which we hold security interests, claims involving the making and servicing of real property loans and other issues incident to our business. At June 30, 2023, we were not a party to any pending legal proceedings that we believe would have a material adverse effect on our financial condition, results of operations or cash flows. ITEM 4.Mine Safety Disclosures\nNot applicable.\nPART II ITEM 5.Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nVWF Bancorps common stock had been quoted on the OTCQB Market operated by OTC Markets Group under the symbol VWFB since July 14, 2022. Effective June 30, 2023, VWF Bancorps common stock is quoted on the OTCQX Market operated by OTC Markets Group under the symbol VWFB. As of June 30, 2023, we had 282 stockholders of record (excluding the number of persons or entities holding stock in street name through various brokerage firms), and 1,922,924 shares of common stock outstanding. There is currently limited trading volume for VWF Bancorps common stock.\nVWF Bancorp has not paid any cash dividends to our stockholders. The payment and amount of any dividend payments is subject to statutory and regulatory limitations, and depends upon a number of factors, including the following: regulatory capital requirements; our financial condition and results of operations; tax considerations; and general economic conditions.\nThere were no sales of unregistered securities or repurchases of shares of common stock during the year ended June 30, 2023. ITEM 6.[Reserved] ITEM 7.Managements Discussion and Analysis of Financial Condition and Results of Operations\nThis discussion and analysis reflects our consolidated financial statements and other relevant statistical data, and is intended to enhance your understanding of our financial condition and results of operations. The information in this section has been derived from the consolidated financial statements, which appear elsewhere in this annual report. You should read the information in this section in conjunction with the other business and financial information provided in this annual report.\nOverview\nOur business consists primarily of taking deposits from the general public and investing those deposits, together with funds generated from operations, in residential real estate loans and, to a lesser extent, commercial real estate loans, agricultural mortgage loans, construction loans, commercial and industrial loans, home equity lines of credit, and consumer loans. We also invest in securities, which have historically consisted primarily of mortgage-backed securities and obligations issued by U.S. government sponsored enterprises, state and municipal securities. We offer a variety of deposit accounts including checking accounts, savings accounts and certificate of deposit accounts. Van Wert Federal is subject to comprehensive regulation and examination by the OCC.\nOur results of operations depend primarily on our net interest income. Net interest income is the difference between the interest income we earn on our interest-earning assets and the interest we pay on our interest-bearing liabilities. Our results of operations also are affected by our provisions for loan losses, non-interest income and non-interest expense. Non-interest income currently consists primarily of service charges on deposit accounts, other service charges and fees, and income from bank owned life insurance. Non-interest expense currently consists primarily of expenses related to salaries and employee benefits, occupancy and equipment, data processing, contract services, director fees, and other expenses.\nWe invest in bank owned life insurance to provide us with a funding source to offset some costs of our benefit plan obligations. Bank owned life insurance provides us with non-interest income that is nontaxable. Federal regulations generally limit our investment in bank owned life insurance to 25% of our Tier 1 capital plus our allowance for loan losses. At June 30, 2023, our investment in bank owned life insurance was $5.2 million, which was within this investment limit.\nOur results of operations also may be affected significantly by general and local economic and competitive conditions, changes in market interest rates, governmental policies and actions of regulatory authorities.\nBusiness Strategy\nOur principal objective is to build long-term value for our stockholders by operating a profitable community-oriented financial institution dedicated to meeting the banking needs of our customers by emphasizing personalized and efficient customer service. Highlights of our current business strategy include:\n● Continue to focus on originating residential mortgage loans for retention in our portfolio. We are primarily a residential mortgage loan lender for borrowers in our primary market area. At June 30, 2023, $65.8 million, or 73.4% of our total loan portfolio, consisted of residential mortgage loans. We expect that residential mortgage lending will remain our primary lending activity.\n● Grow and diversify our loan portfolio prudently by increasing originations of commercial real estate loans and commercial and industrial loans. Although we intend to continue our historical focus on the origination of residential mortgage loans, we intend to prudently increase our originations of commercial real estate loans and commercial and industrial loans in order to diversify our loan portfolio and increase yield. At June 30, 2023, commercial real estate loans amounted to $6.0 million, or 6.7% of total loans, and commercial and industrial loans amounted to $3.4 million, or 3.8% of total loans.\nCommercial real estate loans and commercial and industrial loans have higher credit risk than one- to four-family residential mortgage loans.\n● Maintain our strong asset quality through conservative loan underwriting. We intend to maintain strong asset quality through what we believe are our conservative underwriting standards and credit monitoring processes. At June 30, 2023, our nonperforming assets and troubled debt restructurings totaled $342,000, or 0.38% of total loans.\n● Continue to grow low-cost core deposits. We consider our core deposits to include statement savings accounts, money market accounts, other savings deposits and checking accounts. We will continue our efforts to increase our core deposits to provide a stable source of funds to support loan growth at costs consistent with improving our interest rate spread and net interest margin. Core deposits totaled $68.6 million, or 57.1% of total deposits, at June 30, 2023.\n● Remain a community-oriented institution and relying on high quality service to maintain and build a loyal local customer base. We were established in 1889 and have been operating continuously in Van Wert since that time. Through the goodwill we have developed over years of providing timely, efficient banking services, we believe that we have been able to attract a loyal base of local retail customers on which we hope to continue to build our banking business.\n● Grow organically and through opportunistic acquisitions or branching. We intend to grow our balance sheet organically on a managed basis. In addition to organic growth, we may also consider expansion opportunities in our market area or in contiguous markets that we believe would enhance both our franchise value and stockholder returns. These opportunities may include acquiring other financial institutions and/or establishing loan production offices, establishing new, or de novo, branch offices and/or acquiring branch offices. We have no current plans or intentions regarding any such expansion activities.\nWe intend to continue to pursue these business strategies, subject to changes necessitated by future market conditions, regulatory restrictions and other factors.\nCritical Accounting Policies and Use of Critical Accounting Estimates\nThe discussion and analysis of the financial condition and results of operations are based on our financial statements, which are prepared in conformity with GAAP. The preparation of these financial statements requires management to make estimates and assumptions affecting the reported amounts of assets and liabilities, disclosure of contingent assets and liabilities, and the reported amounts of income and expenses. We consider the accounting policies discussed below to be critical accounting policies. The estimates and assumptions that we use are based on historical experience and various other factors and are believed to be reasonable under the circumstances. Actual results may differ from these estimates under different assumptions or conditions, resulting in a change that could have a material impact on the carrying value of our assets and liabilities and our results of operations.\nThe Jumpstart Our Business Startups Act of 2012 contains provisions that, among other things, reduce certain reporting requirements for qualifying public companies. As an emerging growth company we may delay adoption of new or revised accounting pronouncements applicable to public companies until such pronouncements are made applicable to private companies. We intend to take advantage of the benefits of this extended transition period. Accordingly, our financial statements may not be comparable to companies that comply with such new or revised accounting standards.\nThe following represent our critical accounting policies:\nAllowance for Loan Losses. The allowance for loan losses is the estimated amount considered necessary to cover inherent, but unconfirmed, credit losses in the loan portfolio at the balance sheet date. The allowance is established through the provision for losses on loans which is charged against income. In determining the allowance for loan losses, management makes significant estimates and has identified this policy as one of our most critical accounting policies.\nManagement performs a quarterly evaluation of the allowance for loan losses. Consideration is given to a variety of factors in establishing this estimate including, but not limited to, current economic conditions, delinquency statistics, geographic and industry concentrations, the adequacy of the underlying collateral, the financial strength of the borrower, results of internal loan reviews and other relevant factors. This evaluation is inherently subjective as it requires material estimates that may be susceptible to significant change.\nThe analysis has two components, specific and general allowances. The specific percentage allowance is for unconfirmed losses related to loans that are determined to be impaired. Impairment is measured by determining the present value of expected future cash flows or, for collateral-dependent loans, the fair value of the collateral adjusted for market conditions and selling expenses. If the fair value of the loan is less than the loans carrying value, a charge is recorded for the difference. The general allowance, which is for loans reviewed collectively, is determined by segregating the remaining loans by type of loan, risk weighting (if applicable) and payment history. We also analyze historical loss experience, delinquency trends, general economic conditions and geographic and industry concentrations. This analysis establishes historical loss percentages and qualitative factors that are applied to the loan groups to determine the amount of the allowance for loan losses necessary for loans that are reviewed collectively. The qualitative component is critical in determining the allowance for loan losses as certain trends may indicate the need for changes to the allowance for loan losses based on factors beyond the historical loss history. Not incorporating a qualitative component could misstate the allowance for loan losses. Actual loan losses may be significantly more than the allowances we have established which could result in a material negative effect on our financial results.\nAs the Company continues to focus on increasing commercial real estate loans and commercial and industrial loans, and without much historical data for which to rely upon, the Company has elected to reserve 1.25% of all outstanding balances on new commercial real estate and commercial and industrial loans until such time that the Company has sufficient historical data to rely upon. The 1.25% was derived from FDIC call report data of peer banks within the geographical market.\nDeferred Tax Assets. We use the asset and liability method of accounting for income taxes. Under this method, deferred tax assets and liabilities are recognized for the future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. Deferred tax assets are reduced by a valuation allowance when it is more likely than not that some portion of the deferred tax asset will not be realized. We exercise significant judgment in evaluating the amount and timing of recognition of the resulting tax liabilities and assets. These judgments require us to make projections of future taxable income. The judgments and estimates we make in determining our deferred tax assets, which are inherently subjective, are reviewed on a continual basis as regulatory and business factors change. Determining the proper valuation allowance for deferred taxes is critical in properly valuing the deferred tax asset and the related recognition of income tax expense or benefit. Any reduction in estimated future taxable income may require us to record a valuation allowance against our deferred tax assets.\nFair Value Measurements. The fair value of a financial instrument is defined as the amount at which the instrument could be exchanged in a current transaction between willing parties, other than in a forced or liquidation sale. We estimate the fair value of a financial instrument and any related asset impairment using a variety of valuation methods. Where financial instruments are actively traded and have quoted market prices, quoted market prices are used for fair value. When the financial instruments are not actively traded, other observable market inputs, such as quoted prices of securities with similar characteristics, may be used, if available, to determine fair value. When observable market prices do not exist, we estimate fair value. These estimates are subjective in nature and imprecision in estimating these factors can impact the amount of gain or loss recorded. For a detailed description of the fair values measured at each level of the fair value hierarchy and the methodology we utilize, see note 13 of the notes to financial statements.\nSelected Financial Data\nThe following selected consolidated financial data sets forth certain financial highlights of the Company and should be read in conjunction with the audited consolidated financial statements and related notes included elsewhere in this Annual Report on Form 10-K.\nAt June 30,\n(In thousands)\nSelected Financial Condition Data:\nTotal assets\n$\n165,969\n$\n149,563\nCash and due from banks\n5,516\n36,712\nInterest-bearing time deposits\n-\n1,470\nAvailable-for-sale securities\n70,585\n24,494\nLoans, net\n81,208\n77,710\nPremises and equipment, net\n1,409\n1,372\nFederal Home Loan Bank stock\n1,013\nBank owned life insurance\n5,223\n5,112\nTotal deposits\n119,992\n109,990\nTotal borrowings\n6,200\n-\nTotal equity\n38,498\n23,367\nFor the Years Ended\nJune 30,\n(In thousands)\nSelected Operating Data:\nInterest income\n$\n5,054\n$\n3,200\nInterest expense\nNet interest income\n4,274\n2,875\nProvision for loan losses\n-\nNet interest income after provision for loan losses\n4,233\n2,875\nNon-interest income\nNon-interest expense\n5,170\n3,132\nLoss before income taxes\n(729)\n(40)\nProvision for income taxes (benefit)\n(183)\n(31)\nNet loss\n$\n(546)\n$\n(9)\nAt or For the Years Ended\nJune 30,\nPerformance Ratios:\nReturn on average assets\n(0.36)\n%\n(0.01)\n%\nReturn on average equity\n(1.52)\n%\n(0.04)\n%\nInterest rate spread (1)\n2.74\n%\n2.14\n%\nNet interest margin (2)\n2.93\n%\n2.19\n%\nNon-interest expense to average assets\n3.42\n%\n2.27\n%\nEfficiency ratio (3)\n115.35\n%\n101.29\n%\nAverage interest-earning assets to average interest-bearing liabilities\n134.44\n%\n124.42\n%\nCapital Ratios:\nAverage equity to average assets\n23.71\n%\n17.95\n%\nTier 1 capital to risk-weighted assets (4)\n24.91\n%\n17.51\n%\nAsset Quality Ratios:\nAllowance for loan and lease losses as a percentage of total loans\n0.29\n%\n0.27\n%\nAllowance for loan losses as a percentage of non-performing loans\n86.62\n%\n61.91\n%\nAllowance for loan losses as a percentage of non-accrual loans\n86.62\n%\n98.62\n%\nNon-accrual loans as a percentage of total loans\n0.34\n%\n0.27\n%\nNet (charge-offs) recoveries as a percentage of average outstanding loans during the year\n0.00\n%\n0.00\n%\nNon-performing loans as a percentage of total loans\n0.34\n%\n0.44\n%\nNon-performing loans as a percentage of total assets\n0.18\n%\n0.24\n%\nTotal non-performing assets as a percentage of total assets\n0.18\n%\n0.24\n%\nOther Data:\nNumber of offices\nNumber of full-time employees\nNumber of part-time employees\n(1) Represents the difference between the weighted average yield on interest-earning assets and the weighted average cost of interest-bearing liabilities.\n(2) Represents net interest income as a percentage of average interest-earning assets.\n(3) Represents noninterest expenses divided by the sum of net interest income and noninterest income.\n(4) Van Wert Federal has adopted the community bank leverage ratio (CBLR) framework for measuring regulatory capital adequacy, which became effective January 1, 2020. The CBLR is the ratio of Tier 1 capital to average assets. To be considered well capitalized under the CBLR framework, Van Wert Federal was required to have a CBLR ratio of at least 9.0% at June 30, 2023 and 2022, respectively.\nComparison of Financial Condition at June 30, 2023 and June 30, 2022\nTotal Assets. Total assets were $166.0 million at June 30, 2023, an increase of $16.4 million, or 11.0%, over the $149.6 million at June 30, 2022. The increase is part of the Companys growth plans and was largely concentrated to growth in available-for-sale debt securities, a year over year increase of $46.0 million, that were funded primarily with cash on hand, a year over year decrease of $31.1 million. The source of the cash was the public offering during the mutual conversion that closed on July 13, 2022.\nCash and Due from Banks. Cash and due from banks decreased by $31.1 million, or -85.0%, to $5.5 million at June 30, 2023 from $36.7 million at June 30, 2022. The decrease was due primarily to funding purchases of available-for-sale debt securities and loan growth.\nInterest Bearing Time Deposits. Interest-bearing time deposits were $0 at June 30, 2023, a decrease of 100.0%, or $1.5 million, from June 30, 2022. Certificates of deposit maturing during the year were not renewed as management invested the proceeds from these securities into higher yielding investments.\nInvestment Securities. Investment securities increased $46.0 million, or 188.2%, to $70.6 million at June 30, 2023 from $24.5 million at June 30, 2022. Aggregate securities purchases of $51.7 million during the year ended June 30, 2023, were funded through cash on hand, calls, maturities and repayments of $4.6 million, FHLB borrowings of $6.2 million, and brokered deposits of $10.1 million. The increase in investment securities is part of a forward-looking investment strategy to increase the number of variable rate investments financed by fixed rate deposit instruments, which will ultimately provide a more balanced interest rate risk profile.\nThe $1.0 million decline in the fair value of the investment securities was primarily attributable to the increases in interest rates in the economy. As the interest rates increased, the fair value of the securities declined. The unrealized losses are recorded to equity, net of tax, as management has determined that there are no credit quality concerns with the issuers of the securities and there is no intent to sell the securities and, as a result, the fair value is expected to recover as the securities approach their maturity dates.\nThe yield on our investment securities increased to 3.22% for the year ended June 30, 2023 from 1.29% for the year ended June 30, 2022.\nNet Loans. Net loans increased by $3.5 million, or 4.5%, to $81.2 million at June 30, 2023 from $77.7 million at June 30, 2022. During the year ended June 30, 2023, loan originations totaled $21.6 million, comprised of $6.7 million of loans secured by one- to four-family residential real estate, $2.3 million secured by commercial real estate, $3.4 million of commercial and industrial loans, $7.5 million of construction and land loans, $1.2 secured by agricultural real estate and $444,000 of consumer loans.\nDuring the year ended June 30, 2023, residential real estate loans increased $219,000, or 0.3%, to $65.9 million at June 30, 2023, construction loans increased $2.6 million, or 42.6%, to $8.6 million at June 30, 2023, commercial and industrial loans increased $3.0 million, or 902.5%, to $3.3 million at June 30, 2023, agricultural real estate loans increased $594,000, or 17.2%, to a total of $4.0 million at June 30, 2023, and commercial real estate loans increased $874,000, or 17.0% to $6.0 million at June 30, 2023. Increases in loan balances reflect our strategy to grow our loan portfolio, continuing to focus on owner-occupied one-to-four family residential real estate loans, while increasing our emphasis on commercial real estate loans and commercial and industrial loans. Management intends to continue to pursue growth in these loan segments in future periods.\nSuch growth has been achieved amid strong competition for one- to four-family residential mortgage loans in our market area. Management intends to continue this activity in future periods.\nDeposits. Deposits increased by $10.0 million, or 9.1%, to $120.0 million at June 30, 2023 from $110.0 million at June 30, 2022. Core deposits (defined as all deposits other than certificates of deposit) decreased $6.2 million, or 8.3%, to $68.6 million at June 30, 2023 from $74.8 million at June 30, 2022. This is not unexpected in a rates up environment as historically, core deposits shift to time deposits in an effort to lock in higher rates for a fixed period of time. Certificates of deposit increased $16.2 million, or 46.0%, to $51.4 million at June 30, 2023 from $35.2 million at June 30, 2022. Of the $16.2 million increase, $10.1 million was from the addition of contractual intermediate callable deposits (‘brokered deposits). These deposits have a time period of 5 years with a callable feature after 6 months. The addition of these deposits was part of managements strategy to fund variable rate investments with fixed rate funding. The callable feature allows for interest rate risk protection in rates down environment.\nDuring the year ended June 30, 2023, management continued its strategy of pursuing growth in demand accounts and other lower cost core deposits, in part by enhancing products and services offered, including mobile banking. Management intends to continue its efforts to increase core deposits, with an emphasis on growth in consumer and business demand deposits.\nFHLB Borrowings. FHLB borrowings increased $6.2 million, or 100%, to $6.2 million at June 30, 2023. There were no borrowings at June 30, 2022. These borrowings were short-term in nature (less than one year maturity) and are being used as part of managements overall growth strategy.\nTotal Equity. Total equity increased $15.1 million, or 64.8%, to $38.5 million at June 30, 2023 from $23.4 million at June 30, 2022. The increase resulted from $16.3 million net proceeds of the capital raised through the conversion, which was partially offset by a net loss of $545,000, and a $757,000 decrease in accumulated other comprehensive income comprised of the unrealized losses, net of tax, on the investment securities portfolio and the valuation gain on the defined benefit plan, net of tax.\nAverage Balances and Yields. The following table sets forth average balance sheets, average yields and costs, and certain other information for the years indicated. No tax-equivalent yield adjustments have been made, as the effects are immaterial. Average balances are calculated using month-end actual balances, rather than daily average balances. We believe the use of month-end actual balances is representative of our operations. Non-accrual loans are included in average balances only. Average yields include the effect of deferred fees, discounts, and premiums that are amortized or accreted to interest income or interest expense. Deferred loan fees are immaterial.\nFor the Years Ended June 30,\nAverage\nAverage\nOutstanding\nOutstanding\nBalance\nInterest\nYield/Rate\nBalance\nInterest\nYield/Rate\n(Dollars in thousands)\nInterest-earning assets:\nLoans\n$\n79,393\n$\n2,872\n3.62\n%\n$\n80,751\n$\n2,733\n3.38\n%\nInvestment securities\n46,107\n1,484\n3.22\n%\n26,725\n1.29\n%\nInterest-bearing deposits and other\n20,552\n3.40\n%\n23,606\n0.51\n%\nTotal interest-earning assets.\n146,052\n5,054\n3.46\n%\n131,082\n3,200\n2.44\n%\nNon-interest earning assets\n5,275\n6,967\nAllowance for loan losses\n(229)\n(223)\nTotal assets\n$\n151,098\n$\n137,826\nInterest-bearing liabilities:\nInterest-bearing demand\n$\n24,645\n0.41\n%\n$\n21,736\n0.01\n%\nSavings and money market accounts\n45,921\n0.14\n%\n46,522\n0.02\n%\nCertificates of deposit\n37,625\n1.57\n%\n37,096\n0.84\n%\nTotal deposits\n108,191\n0.70\n%\n105,354\n0.31\n%\nBorrowings\n5.64\n%\n-\n-\n-\n%\nTotal interest-bearing liabilities\n108,634\n0.72\n%\n105,354\n0.31\n%\nNoninterest-bearing liabilities\n6,634\n7,731\nTotal liabilities\n115,268\n113,085\nEquity\n35,830\n24,741\nTotal liabilities and equity\n$\n151,098\n$\n137,826\nNet interest income\n$\n4,274\n-\n$\n2,875\nNet interest rate spread (1)\n2.74\n%\n-\n2.14\n%\nNet interest-earning assets (2)\n$\n37,418\n$\n25,728\nNet interest margin (3)\n-\n2.93\n%\n-\n2.19\n%\nAverage interest-earning assets to interest-bearing liabilities .\n134.44\n%\n124.42\n%\n(1) Net interest rate spread represents the difference between the weighted average yield on interest-earning assets and the weighted average rate of interest-bearing liabilities.\n(2) Net interest-earning assets represent total interest-earning assets less total interest-bearing liabilities.\n(3) Net interest margin represents net interest income divided by average total interest-earning assets.\nRate/Volume Analysis\nThe following table presents the effects of changing rates and volumes on our net interest income for the periods indicated. The rate column shows the effects attributable to changes in rate (changes in rate multiplied by prior volume). The volume column shows the effects attributable to changes in volume (changes in volume multiplied by prior rate). The total column represents the sum of the prior columns. For purposes of this table, changes attributable to both rate and volume, which cannot be segregated, have been allocated proportionately based on the changes due to rate and the changes due to volume. There were no out-of-period items or adjustments required to be excluded from the table below.\nYear Ended June 30, 2023 vs. 2022\nIncrease (Decrease) Due to\nTotal\nIncrease\nVolume\nRate\n(Decrease)\n(In thousands)\nInterest-earning assets:\nLoans\n$\n(46)\n$\n$\nInvestment securities\nOther interest-earning assets\n(16)\nTotal interest-earning assets\n1,389\n1,577\nInterest-bearing liabilities:\nInterest-bearing demand\n-\nSavings and money market accounts\n-\nCertificates of deposit\nTotal deposits\nBorrowings\n-\n-\n-\nTotal interest-bearing liabilities\nChange in net interest income\n$\n$\n$\n1,160\nComparison of Operating Results for the Years Ended June 30, 2023 and June 30, 2022\nGeneral. Net loss for the year ended June 30, 2023, was $545,000, a decrease of $536,000, compared to net loss of $9,000 for the year ended June 30, 2022. The increase in net loss was primarily due to a $2.0 million increase in noninterest expenses, which included certain one-time expenses as noted in the noninterest expense section below, and was partially offset by a $1.4 million increase in net interest income. In the original prospectus related to the conversion and public offering, the Company estimated it would incur $3.1 million in expenses related to the termination of its defined benefit plan. These expenses were expected to be incurred in the 3rd calendar quarter of 2022. Due to the timing involved in the termination of this plan, these expenses related to this termination have totaled $1.1 million this fiscal year. The final expenses will not be known until the expected final termination late in calendar year 2023.\nInterest Income. Interest income increased $1.9 million, or 58.0%, to $5.1 million for the year ended June 30, 2023, from $3.2 million for the year ended June 30, 2022. This increase was attributable to a $1.1 million, or 328.5%, increase in interest on investment securities, a $577,000, or 478.0%, increase in interest on interest-bearing deposits and other, and a $139,000, or 5.1%, increase in interest on loans..\nThe average balance of loans during the year ended June 30, 2023, decreased by $1.4 million, or 1.7%, from the balance for the year ended June 30, 2022, while the average yield on loans increased by 24 basis points to 3.62% for the year ended June 30, 2023 from 3.38% for the year ended June 30, 2022.\nThe average balance of investment securities increased $19.4 million, or 72.5%, to $46.1 million for the year ended June 30, 2023 from $26.7 million for the year ended June 30, 2022, while the average yield on investment securities increased by 193 basis points to 3.22% for the year ended June 30, 2023 from 1.29% for the year ended\nJune 30, 2022. The increase in average yield on securities resulted from the effects of managements purchasing of higher yielding variable rate securities during the fourth quarter of the fiscal year.\nThe average balance of other interest-bearing deposits, comprised primarily of certificates of deposit in other financial institutions, overnight deposits and stock in the Federal Home Loan Bank, decreased $3.0 million, or -12.9%, for the year ended June 30, 2023, while the average yield increased 289 basis points, to 3.40% for the year ended June 30, 2023 from 0.51% for the year ended June 30, 2022, reflecting the rise in the interest rate environment.\nInterest Expense. Total interest expense increased $456,000, or 140.4%, to $780,000 for the year ended June 30, 2023 from $325,000 for the year ended June 30, 2022. The increase was primarily due to an increase of 41 basis points in the average cost of deposits to 0.72% for the year ended June 30, 2023, from 0.31% for the year ended June 30, 2022, reflecting how management has had to increase the offered rates to be competitive in the current rising interest rate environment.\nNet Interest Income. Net interest income increased $1.3 million, or 47.2%, to $4.2 million for the year ended June 30, 2023 compared to $2.9 million for the year ended June 30, 2022. The increase reflected an increase in the interest rate spread to 2.74% for the year ended June 30, 2023, 2.14% for the year ended June 30, 2022. Our net interest margin increased to 2.93% for the year ended June 30, 2023, from 2.19% for the year ended June 30, 2022. The interest rate spread and net interest margin were impacted by the addition of variable rate securities that benefited from the rising interest rate environment throughout the year.\nProvision for Loan Losses. Based on an analysis of the factors described in Critical Accounting Policies-Allowance for Loan Losses, management concluded that a provision for loan losses of $40,000 was required for the year ended June 30, 2023. No provision was required for the year ended June 30, 2022. The allowance for loan losses was $263,000 and $223,000 at June 30, 2023 and 2022, respectively, and represented 0.29% of total loans at June 30, 2023, and 0.27% of total loans at June 30, 2022. The determination over the adequacy of the allowance for loan losses was due primarily to the low balances of nonperforming loans, delinquent loans and no net charge-offs in both periods.\nTotal nonperforming loans were $304,000 at June 30, 2023, compared to $360,000 at June 30, 2022. Classified loans totaled $67,000 at June 30, 2023, compared to $123,000 at June 30, 2022, and total loans past due greater than 30 days were $734,000 and $307,000 at those respective dates. As a percentage of nonperforming loans, the allowance for loan losses was 86.6% at June 30, 2023 compared to 62.0% at June 30, 2022.\nThe allowance for loan losses reflects the estimate management believes to be appropriate to cover incurred probable losses which were inherent in the loan portfolio at June 30, 2023 and 2022. While management believes the estimates and assumptions used in the determination of the adequacy of the allowance are reasonable, such estimates and assumptions could be proven incorrect in the future, and the actual amount of future provisions may exceed the amount of past provisions, and the increase in future provisions that may be required may adversely impact the Companys financial condition and results of operations. In addition, bank regulatory agencies periodically review the allowance for loan losses and may require an increase in the provision for possible loan losses or the recognition of loan charge-offs, based on judgments different than those of management.\nNon-Interest Income. Non-interest income totaled $208,000 for the year ended June 30, 2023, a decrease of $9,000, or -3.8%, from $217,000 for the year ended June 30, 2022. The decrease was primarily due to normal fluctuations in the volume of fees on loans and deposits.\nNoninterest Expense. Noninterest expense increased $2.0 million, or 65.1%, to $5.2 million for the year ended June 30, 2023, compared to $3.1 million for the year ended June 30, 2022. The increase reflects $651,000, or 43.8%, increase in salaries and employee benefits, primarily attributable to additional hiring to support the strategic growth plans of the Company and a one-time expense of $226,000 for a contract termination, a $309,000, or 146.4%, increase in professional services due primarily to increased costs of operating and the reporting requirements of a public stock company. There were also certain one-time expenses incurred during the year ended June 30, 2023 totaling $1.4 million. Those expenses consisted of $1.1 million for pension plan withdrawal expenses associated with withdrawing from the\nmultiemployer plan, $263,000 employee related expenses, which include the above-mentioned contract termination, $102,000 of IT and software related expenses, and $5,000 of marketing and branding expenses.\nNoninterest expense can be expected to increase because of costs associated with operating as a public company and increased compensation costs related to possible implementation of one or more stock-based benefit plans, if approved by our stockholders.\nFederal Income Taxes. Federal income taxes decreased by $152,000, or 483.2%, to a $183,000 benefit for the year ended June 30, 2023, compared to tax benefit of $31,000 for the year ended June 30, 2022. The decrease in the federal income tax provision was due primarily to a $688,000, or 1699.0% increase in pretax loss.\nManagement of Market Risk\nGeneral. Our most significant form of market risk is interest rate risk because, as a financial institution, the majority of our assets and liabilities are sensitive to changes in interest rates. Therefore, a principal part of our operations is to manage interest rate risk and limit the exposure of our financial condition and results of operations to changes in market interest rates. All directors participate in discussions during the regular board meetings evaluating the interest rate risk inherent in our assets and liabilities, and the level of risk that is appropriate. These discussions take into consideration our business strategy, operating environment, capital, liquidity and performance objectives consistent with the policy and guidelines approved by them.\nOur asset/liability management strategy attempts to manage the impact of changes in interest rates on net interest income, our primary source of earnings. Among the techniques we are using to manage interest rate risk are:\n● maintaining capital levels that exceed the thresholds for well-capitalized status under federal regulations;\n● maintaining a high level of liquidity;\n● growing our volume of core deposit accounts;\n● managing our investment securities portfolio so as to reduce the average maturity and effective life of the portfolio; and\n● continuing to diversify our loan portfolio by adding more commercial-related loans, which typically have shorter maturities and/or balloon payments.\nBy following these strategies, we believe that we are better positioned to react to increases and decreases in market interest rates.\nWe have not engaged in hedging activities, such as engaging in futures or options. We do not anticipate entering into similar transactions in the future.\nEconomic Value of Equity. We also compute amounts by which the net present value of our assets and liabilities (economic value of equity or EVE) would change in the event of a range of assumed changes in market interest rates. This model uses a discounted cash flow analysis and an option-based pricing approach to measure the interest rate sensitivity of net portfolio value. The model estimates the economic value of each type of asset, liability and off-balance sheet contract under the assumptions that the United States Treasury yield curve increases instantaneously by 100, 200, 300 and 400 basis point increments or decreases instantaneously by 100 or 200 basis point increments, with changes in interest rates representing immediate and permanent, parallel shifts in the yield curve.\nThe following table sets forth, at June 30, 2023, the calculation of the estimated changes in our EVE that would result from the designated immediate changes in the United States Treasury yield curve.\nAt June 30, 2023\nEstimated Increase (Decrease) in\nEVE as a Percentage of Present\nEVE\nValue of Assets (3)\nChange in Interest\nIncrease\nRates (basis points)\nEstimated\n(Decrease)\n(1)\nEVE (2)\nAmount\nPercent\nEVE Ratio (4)\n(basis points)\n(Dollars in thousands)\n$\n24,770\n$\n(6,690)\n(21.26)\n%\n16.62\n%\n(255)\n26,050\n(5,410)\n(17.20)\n%\n17.09\n%\n(208)\n27,452\n(4,008)\n(12.74)\n%\n17.59\n%\n(158)\n29,032\n(2,428)\n(7.72)\n%\n18.15\n%\n(102)\n-\n31,460\n-\n-\n%\n19.17\n%\n-\n(100)\n32,213\n2.39\n%\n19.14\n%\n(3)\n(200)\n33,235\n1,775\n5.64\n%\n19.21\n%\n(1) Assumes an immediate uniform change in interest rates at all maturities.\n(2) EVE is the discounted present value of expected cash flows from assets, liabilities and off-balance sheet contracts.\n(3) Present value of assets represents the discounted present value of incoming cash flows on interest-earning assets.\n(4) EVE Ratio represents EVE divided by the present value of assets.\nThe table above indicates that at June 30, 2023, we would have experienced a 12.7% decrease in EVE in the event of an instantaneous parallel 200 basis point increase in market interest rates and a 5.6% increase in EVE in the event of an instantaneous 200 basis point decrease in market interest rates.\nChange in Net Interest Income. The following table sets forth, at June 30, 2023, the calculation of the estimated changes in our net interest income (NII) that would result from the designated immediate changes in the United States Treasury yield curve.\nAt June 30, 2023\nChange in Interest Rates\n(basis points) (1)\nNII Year 1 Forecast\nYear 1 Change from Level\n(Dollars in thousands)\n+400\n$\n4,558\n4.28\n%\n+300\n4,534\n3.73\n%\n+200\n4,433\n1.42\n%\n+100\n4,267\n(2.38)\n%\nLevel\n4,371\n-\n(100)\n4,159\n(4.85)\n%\n(200)\n3,922\n(10.27)\n%\n(1) Assumes an immediate uniform change in interest rates at all maturities.\nThe table above indicates that at June 30, 2023, we would have experienced an 1.4% increase in NII in the event of an instantaneous parallel 200 basis point increase in market interest rates and a 10.3% decrease in NII in the event of an instantaneous 200 basis point decrease in market interest rates.\nCertain shortcomings are inherent in the methodologies used in the above interest rate risk measurement. Modeling changes in EVE and NII require making certain assumptions that may or may not reflect the manner in which actual yields and costs respond to changes in market interest rates. For instance, the EVE and NII tables presented above assume that the composition of our interest-sensitive assets and liabilities existing at the beginning of a period remains constant over the period being measured and assumes that a particular change in interest rates is reflected uniformly across the yield curve regardless of the duration or repricing of specific assets and liabilities. However, the shape of the yield curve changes constantly and the value and pricing of our assets and liabilities, including our deposits, may not\nclosely correlate with changes in market interest rates. Accordingly, although the EVE and NII tables may provide an indication of our interest rate risk exposure at a particular point in time and in the context of a particular yield curve, such measurements are not intended to and do not provide a precise forecast of the effect of changes in market interest rates on EVE and NII and will differ from actual results.\nEVE and net interest NII calculations also may not reflect the fair values of financial instruments. For example, decreases in market interest rates can increase the fair values of our loans, deposits and borrowings.\nLiquidity and Capital Resources\nLiquidity describes our ability to meet the financial obligations that arise in the ordinary course of business. Liquidity is primarily needed to meet the borrowing and deposit withdrawal requirements of our customers and to fund current and planned expenditures. Our primary sources of funds are deposits, principal and interest payments on loans and securities, and proceeds from maturities of securities. We also have the ability to borrow from the Federal Home Loan Bank of Cincinnati. At June 30, 2023, we had outstanding borrowings of $6.2 million from the Federal Home Loan Bank of Cincinnati. At June 30, 2023, we had the capacity to borrow an additional $38.8 million from the Federal Home Loan Bank of Cincinnati.\nWhile maturities and scheduled amortization of loans and securities are predictable sources of funds, deposit flows and loan prepayments are greatly influenced by general interest rates, economic conditions, and competition. Our most liquid assets are cash and short-term investments. The levels of these assets are dependent on our operating, financing, lending, and investing activities during any given period.\nOur cash flows are comprised of three primary classifications: cash flows from operating activities, cash flows from investing activities, and cash flows from financing activities. For further information, see the statements of cash flows contained in the financial statements appearing elsewhere in this annual report.\nWe are committed to maintaining a strong liquidity position. We monitor our liquidity position on a daily basis. We anticipate that we will have sufficient funds to meet our current funding commitments. Based on our deposit retention experience and current pricing strategy, we anticipate that a significant portion of maturing time deposits will be retained.\nAt June 30, 2023, Van Wert Federals Tier 1 leverage capital was $41.3 million, or 24.9% of adjusted assets. Accordingly, it was categorized as well-capitalized at June 30, 2023 under the community bank leverage ratio framework. Management is not aware of any conditions or events since the most recent notification that would change our category. For further information, see note 9 to the notes to financial statements.\nOff-Balance Sheet Arrangements. At June 30, 2023, we had $11.0 million of outstanding commitments to originate loans. Certificates of deposit that are scheduled to mature in less than one year from June 30, 2023 totaled $24.8 million at June 30, 2023. Management expects that a substantial portion of the maturing certificates of deposit will be renewed. However, if a substantial portion of these deposits is not retained, we may utilize Federal Home Loan Bank of Cincinnati advances or raise interest rates on deposits to attract new accounts, which may result in higher levels of interest expense.\nRecent Accounting Pronouncements\nFor a discussion of the impact of recent accounting pronouncements, see Note 1 of the notes to financial statements appearing elsewhere in this annual report.\nImpact of Inflation and Changing Prices\nThe financial statements and related data presented in this prospectus have been prepared according to GAAP which require the measurement of financial position and operating results in terms of historical dollars without considering changes in the relative purchasing power of money over time due to inflation. The primary impact of\ninflation on our operations is reflected in increased operating costs. Unlike most industrial companies, virtually all of the assets and liabilities of a financial institution are monetary in nature. As a result, interest rates, generally, have a more significant impact on a financial institutions performance than does inflation. Interest rates do not necessarily move in the same direction or to the same extent as the prices of goods and services. ITEM 7A.Quantitative and Qualitative Disclosures About Market Risk\nThe information regarding this Item is contained in Item 7 under the heading Management of Market Risk. ITEM 8.Financial Statements and Supplementary Data\nReport of Independent Registered Public Accounting Firm and Financial Statements\nJune 30, 2023 and 2022\nVWF Bancorp, Inc.\nJune 30, 2023 and 2022\nContents\nReports of Independent Registered Public Accounting Firm\nFinancial Statements\nConsolidated Balance Sheets\nConsolidated Statements of Operations\nConsolidated Statements of Comprehensive Loss\nConsolidated Statements of Changes in Equity\nConsolidated Statements of Cash Flows\nNotes to Consolidated Financial Statements\nReport of Independent Registered Public Accounting Firm0F\nTo the Shareholders, Board of Directors, and Audit Committee\nVWF Bancorp, Inc.\nVan Wert, Ohio\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheets of VWF Bancorp, Inc. (the Company) as of June 30, 2023 and 2022, the related consolidated statements of operations, comprehensive loss, shareholders equity, and cash flows for the years then ended and the related notes (collectively referred to as the financial statements). In our opinion, the consolidated financial statements referred to above present fairly, in all material respects, the financial position of the Company as of June 30, 2023 and 2022, and the results of its operations and its cash flows for each of the years ended June 30, 2023 and 2022, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits.\nWe are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures include examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audit.\n/s/ FORVIS, LLP\nWe have served as the Companys auditor since 2022.\nPCAOB ID 686\nFort Wayne, Indiana\nOctober 6, 2023\nVWF Bancorp, Inc.\nConsolidated Balance Sheets\nJune 30, 2023 and 2022\nJune 30,\nAssets\nCash and due from banks\n$\n5,515,728\n$\n36,711,842\nInterest-bearing time deposits\n-\n1,470,000\nAvailable-for-sale debt securities\n70,585,194\n24,494,410\nLoans, net of allowance for loan losses of $263,422 at June 30, 2023 and $222,884 June 30, 2022 respectively\n81,208,395\n77,710,188\nPremises and equipment\n1,409,347\n1,371,634\nFederal Home Loan Bank stock\n396,800\n1,012,900\nBank owned life insurance\n5,223,496\n5,112,083\nAccrued interest receivable\n498,807\n219,195\nOther assets\n1,131,536\n1,460,297\nTotal assets\n$\n165,969,303\n$\n149,562,549\nLiabilities and Shareholders' Equity\nLiabilities\nDeposits\nDemand\n$\n26,551,336\n$\n26,037,580\nSavings and money market\n42,019,749\n48,735,574\nTime\n51,420,496\n35,217,055\nTotal deposits\n119,991,581\n109,990,209\nAdvances from the Federal Home Loan Bank\n6,200,000\n-\nAdvances from borrowers for taxes and insurance\n628,795\n615,735\nStock subscription proceeds in escrow\n-\n15,315,230\nAccrued interest payable and other liabilities\n650,927\n274,269\nTotal liabilities\n127,471,303\n126,195,443\nCommitments and Contingencies\nShareholders' Equity\nPreferred stock, $0.01 par value, 1,000,000 shares authorized, none issued\n-\n-\nCommon stock, $0.01 par value, 14,000,000 shares authorized, 1,922,924 issued at June 30, 2023\n19,229\n-\nAdditional paid-in capital\n17,875,071\n-\nUnearned ESOP\n(1,461,422)\n-\nRetained earnings\n24,916,481\n25,461,865\nAccumulated other comprehensive loss\n(2,851,359)\n(2,094,759)\nTotal shareholders' equity\n38,498,000\n23,367,106\nTotal liabilities and shareholders' equity\n$\n165,969,303\n$\n149,562,549\nSee Notes to Financial Statements\nVWF Bancorp, Inc.\nConsolidated Statements of Operations\nYears Ended June 30, 2023 and 2022\nYear Ended\nJune 30,\nInterest Income\nLoans\n$\n2,871,985\n$\n2,732,588\nInvestment securities\n1,484,124\n346,359\nInterest-bearing deposits and other\n698,147\n120,795\nTotal interest income\n5,054,256\n3,199,742\nInterest Expense\nDeposits\n755,095\n324,550\nFederal Home Loan Bank advances\n25,180\nTotal interest expense\n780,275\n324,551\nNet Interest Income\n4,273,981\n2,875,191\nProvision for Loan Losses\n40,538\n-\nNet Interest Income After Provision for Loan Losses\n4,233,443\n2,875,191\nNoninterest Income\nBank owned life insurance\n111,413\n108,280\nOther income\n96,785\n108,224\nTotal noninterest income\n208,198\n216,504\nNoninterest Expense\nSalaries and employee benefits\n2,137,516\n1,486,427\nPension plan withdrawal\n1,051,820\n-\nDirectors fees\n158,550\n165,500\nOccupancy and equipment\n284,211\n181,984\nData processing fees\n259,984\n235,855\nFranchise taxes\n160,040\n147,429\nFDIC insurance premiums\n48,809\n33,600\nProfessional services\n519,617\n210,852\nLoss on sale of investment securities\n-\n291,198\nOther\n549,191\n379,322\nTotal noninterest expense\n5,169,738\n3,132,167\nLoss before income taxes\n(728,097)\n(40,472)\nProvision for income taxes (benefits)\n(182,713)\n(31,329)\nNet Loss\n$\n(545,384)\n$\n(9,143)\nLoss per share-basic and diluted\n$\n(0.31)\nN/A\nWeighted-average shares outstanding-basic and diluted\n1,773,056\nN/A\nSee Notes to Financial Statements\nVWF Bancorp, Inc.\nConsolidated Statements of Comprehensive Loss\nYears Ended June 30, 2023 and 2022\nYear Ended\nJune 30,\nNet loss\n$\n(545,384)\n$\n(9,143)\nOther comprehensive loss:\nNet unrealized losses on available-for-sale securities\n(1,040,054)\n(2,847,815)\nReclassification adjustment for realized loss on sale of securities\n-\n291,198\nChange in funded status of defined benefit plan\n82,233\n-\nTax benefit\n201,221\n536,890\nOther comprehensive loss\n(756,600)\n(2,019,727)\nComprehensive loss\n$\n(1,301,984)\n$\n(2,028,870)\nSee Notes to Financial Statements\nVWF Bancorp, Inc.\nConsolidated Statements of Shareholders Equity\nYears Ended June 30, 2023 and 2022\nAccumulated\nUnearned\nOther\nCommon\nAdditional\nESOP\nRetained\nComprehensive\nShareholders'\nStock\nPaid-in Capital\nShares\nEarnings\nLoss\nEquity\nBalance at July 1, 2021\n$\n-\n$\n-\n$\n-\n$\n25,471,008\n$\n(75,032)\n$\n25,395,976\nNet loss\n-\n-\n-\n(9,143)\n-\n(9,143)\nOther comprehensive loss\n-\n-\n-\n-\n(2,019,727)\n(2,019,727)\nBalance at June 30, 2022\n$\n-\n$\n-\n$\n-\n$\n25,461,865\n$\n(2,094,759)\n$\n23,367,106\nBalance at July 1, 2022\n$\n-\n$\n-\n$\n-\n$\n25,461,865\n$\n(2,094,759)\n$\n23,367,106\nProceeds from issuance of shares\n19,229\n17,845,597\n(1,538,339)\n-\n-\n16,326,487\nESOP shares committed to be released\n-\n29,474\n76,917\n-\n-\n106,391\nNet loss\n-\n-\n-\n(545,384)\n-\n(545,384)\nOther comprehensive loss\n-\n-\n-\n-\n(756,600)\n(756,600)\nBalance at June 30, 2023\n$\n19,229\n$\n17,875,071\n$\n(1,461,422)\n$\n24,916,481\n$\n(2,851,359)\n$\n38,498,000\nSee Notes to Financial Statements\nVWF Bancorp, Inc.\nConsolidated Statements of Cash Flows\nYears Ended June 30, 2022 and 2021\nYear Ended\nJune 30,\nOperating Activities\nNet loss\n$\n(545,384)\n$\n(9,143)\nItems not requiring (providing) cash:\nDepreciation and amortization\n66,412\n64,094\nAmortization of premiums and discounts\n51,449\n93,954\nDeferred income taxes\n(175,944)\n(37,031)\nProvision for loan losses\n40,538\n-\nLoss on sale of investment securities\n-\n291,198\nIncrease in cash surrender value of bank-owned life insurance\n(111,413)\n(108,280)\nESOP compensation expense\n165,046\n-\nChanges in:\nAccrued interest receivable\n(279,612)\n(26,177)\nOther assets and liabilities\n1,106,162\n(806,282)\nNet cash provided by (used in) operating activities\n317,254\n(537,667)\nInvesting Activities\nNet change in interest-bearing time deposits\n1,470,000\n3,420,000\nPurchases of available-for-sale securities\n(51,735,943)\n(12,659,684)\nProceeds from sales of available-for-sale securities\n-\n9,708,443\nProceeds from calls, maturities and paydowns of available-for-sale securities\n4,553,656\n4,041,482\nNet change in loans\n(3,538,745)\n(3,325,981)\nPurchase of premises and equipment\n(104,125)\n(14,562)\nProceeds from redemption of FHLB stock\n616,100\n-\nNet cash (used in) provided by investing activities\n(48,739,057)\n1,169,698\nFinancing Activities\nNet increase in deposit accounts\n10,001,372\n9,067,319\nProceeds from FHLB advances\n6,200,000\n-\nNet change in advances by borrowers for taxes and insurance\n13,060\n36,423\nProceeds from stock subscriptions held in escrow\n-\n15,315,230\nProceeds from issuance of common stock\n1,011,257\n-\nNet cash provided by financing activities\n17,225,689\n24,418,972\n(Decrease) Increase in Cash and Cash Equivalents\n(31,196,114)\n25,051,003\nCash and Cash Equivalents, Beginning of Period\n36,711,842\n11,660,839\nCash and Cash Equivalents, End of Period\n$\n5,515,728\n$\n36,711,842\nSupplemental Disclosure of Cash Flow Information\nCash paid during the period for:\nInterest on deposits\n$\n724,613\n$\n324,553\nSupplemental Disclosure of Noncash Financing Activities\nTransfers from stock subscriptions to common stock and additional paid-in capital\n$\n15,315,230\n-\nSee Notes to Financial Statements\nNote 1:Nature of Operations and Summary of Significant Accounting Policies\nPrinciples of Consolidation\nThe consolidated financial statements as of and for the year ended June 30, 2023 include the accounts of VWF Bancorp, Inc. (VFW Bancorp or the Company) and its wholly-owned subsidiary, Van Wert Federal Savings Bank (Van Wert Federal or the Bank). All intercompany transactions and balances have been eliminated in consolidation. The financial statements as of and for the year ended June 30, 2022 represent the Bank only, as the conversion to stock form, including the formation of VWF Bancorp, was completed on July 13, 2022. References herein to the Company for periods prior to the completion of the stock conversion should be deemed to refer to the Bank.\nNature of Operations\nVWF Bancorp, Inc., a Maryland corporation and registered savings and loan holding company, was incorporated on February 25, 2022, to serve as the savings and loan holding company for Van Wert Federal in connection with the Banks conversion from the mutual form of organization to the stock form of organization (the Conversion). The Conversion was completed on July 13, 2022. The Companys shares began trading on the OTCQB under symbol VWFB on July 14, 2022. VWFB shares began trading on OTCQX on June 30, 2023. In connection with the Conversion, the Company acquired 100% ownership of the Bank and the Company offered and sold 1,922,924 shares of its common stock at $10.00 per share, for gross offering proceeds of $19,229,000. The cost of the conversion and issuance of common stock was approximately $1,364,000, which was deducted from the gross offering proceeds. The Banks employee stock ownership plan purchased 153,834 shares of the common stock sold by the Company, which was 8% of the 1,922,924 shares of common stock issued by the Company. The ESOP purchased the shares using a loan from the Company. The Company contributed $8,932,000 of the net proceeds from the offering to the Bank, loaned $1,538,000 of the net proceeds to the ESOP and retained approximately $7,394,000 of the net proceeds.\nFollowing the Conversion, voting rights in the Company are held and exercised exclusively by the shareholders of the Company. Deposit account holders continue to be insured by the FDIC. The Bank may not pay a dividend on its capital stock if the effect thereof would cause retained earnings to be reduced below regulatory capital requirements. In addition, the Company is subject to certain regulations related to the payment of dividends and the repurchase of its capital stock. The Conversion was accounted for as a change in corporate form with the historic basis of the Banks assets, liabilities and equity unchanged as a result.\nThe Bank, which is the sole subsidiary of the Company, is a federally chartered mutual thrift engaged primarily in the business of making residential mortgage loans, commercial loans and accepting deposits. Its operations are conducted through its office located in Van Wert, Ohio. The Bank faces competition from other financial institutions and is subject to the regulation of certain federal and state agencies and undergoes periodic examinations by those regulatory authorities. Effective June 23, 2023, the Bank elected to operate as a covered savings association (CSA). A CSA has the same rights and privileges as a national bank that has its main officed situated in the same location as the home office of the CSA and is subject to the same duties, restrictions, penalties, liabilities, conditions, and limitations that would apply to such a national bank.\nUse of Estimates\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates.\nMaterial estimates that are particularly susceptible to significant change relate to the determination of the allowance for loan losses, valuation of deferred tax assets and fair values of financial instruments.\nCash Equivalents\nThe Company considers all liquid investments with original maturities of three months or less to be cash equivalents. At June 30, 2023 none of the Companys cash accounts at nonfederal government or nongovernmental agencies exceeded FDIC insurance limits.\nInterest-bearing Time Deposits in Banks\nInterest-bearing time deposits have original maturities greater than one year and are carried at cost.\nDebt Securities\nDebt securities held by the Bank generally are classified and recorded in the financial statements as follows:\nClassified as\nDescription\nRecorded at\nHeld to maturity (HTM)\nCertain debt securities that management has the positive intent and ability to hold to maturity\nAmortized cost\nTrading\nSecurities that are bought and held principally for the purpose of selling in the near term and, therefore, held for only a short period of time\nFair value, with changes in fair value included in earnings\nAvailable for sale (AFS)\nSecurities not classified as HTM or trading\nFair value, with unrealized gains and losses excluded from earnings and reported in other comprehensive income\nPurchase premiums and discounts are recognized in interest income using the interest method over the terms of the securities, identified as the call date as to premiums and maturity date as to discounts. Gains and losses on the sale of securities are recorded on the trade date and are determined using the specific identification method.\nWhen the fair value of securities is below amortized cost, the Banks accounting treatment for an other-than-temporary impairment (OTTI) is as follows:\nAccounting Treatment for OTTI\nComponents\nCircumstances of Impairment\nCredit\nRemaining\nConsiderations\nComponent\nPortion\nNot intended for sale and more likely than not that the Bank will not have to sell before recovery of cost basis\nRecognized in earnings\nRecognized in other comprehensive income\nIntended for sale or more likely than not that the Bank will be required to sell before recovery of cost basis\nRecognized in earnings\nFor held-to-maturity debt securities, the amount of OTTI recorded in other comprehensive income for the noncredit portion of a previous OTTI is amortized prospectively over the remaining life of the security on the basis of the timing of future estimated cash flows of the security.\nWhen a credit loss component is separately recognized in earnings, the amount is identified as the total of principal cash flows not expected to be received over the remaining term of the security, as projected based on cash flow projections.\nThe Company recognized no other-than-temporary impairments on debt securities in 2023 or 2022.\nLoans\nLoans that management has the intent and ability to hold for the foreseeable future or until maturity or payoff are reported at their outstanding principal balances adjusted for unearned income, charge-offs, the allowance for loan losses and any unamortized deferred fees or costs on originated loans and unamortized premiums or discounts on purchased loans.\nFor loans amortized at cost, interest income is accrued based on the unpaid principal balance. Loan origination fees, net of certain direct origination costs, as well as premiums and discounts, are deferred and amortized as a level yield adjustment over the respective term of the loan.\nFor all loan portfolio segments except residential and consumer loans, the Company promptly charges-off loans, or portions thereof, when available information confirms that specific loans are uncollectible based on information that includes, but is not limited to, (1) the deteriorating financial condition of the borrower, (2) declining collateral values, and/or (3) legal action, including bankruptcy, that impairs the borrowers ability to adequately meet its obligations. For impaired loans that are considered to be solely collateral dependent, a partial charge-off is recorded when a loss has been confirmed by an updated appraisal or other appropriate valuation of the collateral.\nThe Company charges-off residential and consumer loans, or portions thereof, when the Company reasonably determines the amount of the loss. The Company adheres to delinquency thresholds established by applicable regulatory guidance to determine the charge-off timeframe for these loans. Loans at these delinquency thresholds for which the Company can clearly document that the loan is both well-secured and in the process of collection, such that collection will occur regardless of delinquency status, need not be charged off.\nFor all classes, all interest accrued but not collected for loans that are placed on nonaccrual or charged off is reversed against interest income. The interest on these loans is accounted for on the cash basis or cost recovery method, until qualifying for return to accrual. Loans are returned to accrual status when all the principal and interest amounts contractually due are brought current and future payments are reasonably assured. Nonaccrual loans are returned to accrual status when, in the opinion of management, the financial position of the borrower indicates there is no longer any reasonable doubt as to the timely collection of interest or principal. The Company requires a period of satisfactory performance of not less than six months before returning a nonaccrual loan to accrual status.\nWhen cash payments are received on impaired loans in each loan class, the Company records the payment as interest income unless collection of the remaining recorded principal amount is doubtful, at which time payments are used to reduce the principal balance of the loan. Troubled debt restructured loans recognize interest income on an accrual basis at the renegotiated rate if the loan is in compliance with the modified terms, no principal reduction has been granted and the loan has demonstrated the ability to perform in accordance with the renegotiated terms for a period of at least six months.\nAllowance for Loan Losses\nThe allowance for loan losses is established as losses are estimated to have occurred through a provision for loan losses charged to income. Loan losses are charged against the allowance when management believes the uncollectability of a loan balance is confirmed. Subsequent recoveries, if any, are credited to the allowance.\nThe allowance for loan losses is evaluated on a regular basis by management and is based upon managements periodic review of the collectability of the loans in light of historical experience, the nature and volume of the loan portfolio, adverse situations that may affect the borrowers ability to repay, estimated value of any underlying collateral and prevailing economic conditions. When historical data is not available, management relies upon available peer data. This evaluation is inherently subjective as it requires estimates that are susceptible to significant revision as more information becomes available.\nThe allowance consists of allocated and general components. The allocated component relates to loans that are classified as impaired. For those loans that are classified as impaired, an allowance is established when the discounted\ncash flows (or collateral value or observable market price) of the impaired loan is lower than the carrying value of that loan. The general component covers nonimpaired loans and is based on historical charge-off experience by segment. The historical loss experience is determined by portfolio segment and is based on the actual loss history experienced by the Company over the prior three years. Management believes the three-year historical loss experience methodology is appropriate in the current economic environment. Other adjustments (qualitative/environmental considerations) for each segment may be added to the allowance for each loan segment after an assessment of internal or external influences on credit quality that are not fully reflected in the historical loss or risk rating data.\nA loan is considered impaired when, based on current information and events, it is probable that the Company will be unable to collect the scheduled payments of principal or interest when due according to the contractual terms of the loan agreement. Factors considered by management in determining impairment include payment status, collateral value and the probability of collecting scheduled principal and interest payments when due, based on the loans current payment status and the borrowers financial condition, including available sources of cash flows. Loans that experience insignificant payment delays and payment shortfalls generally are not classified as impaired. Management determines the significance of payment delays and payment shortfalls on a case-by-case basis, taking into consideration all of the circumstances surrounding the loan and the borrower, including the length of the delay, the reasons for the delay, the borrowers prior payment record and the amount of the shortfall in relation to the principal and interest owed. Impairment is measured on a loan-by-loan basis for non-homogenous type loans such as commercial, non-owner-occupied residential, multi-family, nonresidential and construction loans by either the present value of expected future cash flows discounted at the loans effective interest rate, the loans obtainable market price or the fair value of the collateral if the loan is collateral dependent. For impaired loans where the Company utilizes the discounted cash flows to determine the level of impairment, the Company includes the entire change in the present value of cash flows as bad debt expense.\nThe fair values of collateral dependent impaired loans are based on independent appraisals of the collateral. In general, the Company acquires an updated appraisal upon identification of impairment and annually thereafter for commercial, commercial real estate and multi-family loans. If the most recent appraisal is over a year old, and a new appraisal is not performed, due to lack of comparable values or other reasons, the existing appraisal is utilized and discounted based on the age of the appraisal, condition of the subject property and overall economic conditions. After determining the collateral value as described, the fair value is calculated based on the determined collateral value less selling expenses. The potential for outdated appraisal values is considered in our determination of the allowance for loan losses through our analysis of various trends and conditions including the local economy, trends in charge-offs and delinquencies, etc. and the related qualitative adjustments assigned by the Company.\nSegments of loans with similar risk characteristics are collectively evaluated for impairment based on the segments historical loss experience adjusted for changes in trends, conditions and other relevant factors that affect repayment of the loans. Accordingly, the Company does not separately identify individual consumer and residential loans for impairment measurements, unless such loans are the subject of a restructuring agreement due to financial difficulties of the borrower.\nIn the course of working with borrowers, the Company may choose to restructure the contractual terms of certain loans. In this scenario, the Company attempts to work out an alternative payment schedule with the borrower in order to optimize collectability of the loan. Any loans that are modified are reviewed by the Company to identify if a troubled debt restructuring (TDR) has occurred, which is when, for economic or legal reasons related to a borrowers financial difficulties, the Company grants a concession to the borrower that it would not otherwise consider. Terms may be modified to fit the ability of the borrower to repay in line with the borrowers current financial status, and the restructuring of the loan may include the transfer of assets from the borrower to satisfy the debt, a modification of loan terms or a combination of the two. If such efforts by the Company do not result in a satisfactory arrangement, the loan is referred to legal counsel, at which time foreclosure proceedings are initiated. At any time prior to a sale of the property at foreclosure, the Company may terminate foreclosure proceedings if the borrower is able to work out a satisfactory payment plan.\nIt is the Companys policy that any restructured loans on nonaccrual status prior to being restructured remain on nonaccrual status until six months of satisfactory borrower performance, at which time management would consider its\nreturn to accrual status. If a loan was accruing at the time of restructuring, the Company reviews the loan to determine if it is appropriate to continue the accrual of interest on the restructured loan.\nWith regard to determination of the amount of the allowance for credit losses, troubled debt restructured loans are considered to be impaired. As a result, the determination of the amount of impaired loans for each portfolio segment within troubled debt restructurings is the same as detailed previously.\nPremises and Equipment\nDepreciable assets are stated at cost less accumulated depreciation. Depreciation is charged to expense using the straight-line method over the estimated useful lives of the assets.\nFederal Home Loan Bank Stock\nFederal Home Loan Bank (FHLB) stock is a required investment for institutions that are members of the FHLB system and the transfer of the stock is substantially restricted. The required investment in the common stock is based on a predetermined formula. FHLB stock is carried at cost less an impairment, which approximates fair value. FHLB stock is evaluated for impairment on an annual basis.\nBank Owned Life Insurance\nThe Company has purchased life insurance on certain employees. Bank owned life insurance is recorded at the amount that can be realized under the insurance contract at the balance sheet date, which is the cash surrender value adjusted for other charges or other amounts due that are probable at settlement.\nForeclosed Assets Held for Sale\nAssets acquired through, or in lieu of, loan foreclosure are held for sale and are initially recorded at fair value less cost to sell at the date of foreclosure, establishing a new cost basis. Subsequent to foreclosure, valuations are periodically performed by management and the assets are carried at the lower of carrying amount or fair value less cost to sell. Revenue and expenses from operations and changes in the valuation allowance are included in net income or expense from foreclosed assets.\nAt June 30, 2023 and 2022, there were no foreclosed residential real estate properties recorded as a result of obtaining physical possession of the property.\nAt June 30, 2023, there were no loans secured by residential real estate property for which formal foreclosure proceeds are in process. At June 30, 2022, the Company had one loan of $39,000 secured by residential real estate in process of foreclosure, subsequent to that date, the buyer brought the loan current and the foreclosure process has ceased.\nIncome Taxes\nThe Company accounts for income taxes in accordance with income tax accounting guidance (ASC 740, Income Taxes). The income tax accounting guidance results in two components of income tax expense: current and deferred. Current income tax expense reflects taxes to be paid or refunded for the current period by applying the provisions of the enacted tax law to the taxable income or excess of deductions over revenues. The Company determines deferred income taxes using the liability (or balance sheet) method. Under this method, the net deferred tax asset or liability is based on the tax effects of the differences between the book and tax basis of assets and liabilities, and enacted changes in tax rates and laws are recognized in the period in which they occur.\nDeferred income tax expense results from changes in deferred tax assets and liabilities between periods. Deferred tax assets are reduced by a valuation allowance if, based on the weight of evidence available, it is more likely than not that some portion or all of a deferred tax asset will not be realized.\nTax positions are recognized if it is more likely than not, based on the technical merits, that the tax position will be realized or sustained upon examination. The term more likely than not means a likelihood of more than 50 percent; the terms examined and upon examination also include resolution of the related appeals or litigation processes, if any. A tax position that meets the more-likely-than-not recognition threshold is initially and subsequently measured as the largest amount of tax benefit that has a greater than 50 percent likelihood of being realized upon settlement with a taxing authority that has full knowledge of all relevant information. The determination of whether or not a tax position has met the more-likely-than-not recognition threshold considers the facts, circumstances and information available at the reporting date and is subject to managements judgment.\nIf necessary, the Company recognizes interest and penalties on income taxes as a component of income tax expense.\nWith a few exceptions, the Company is no longer subject to examination by tax authorities for calendar years before 2020. As of June 30, 2023, the Company had no material uncertain income tax positions.\nEmployee Stock Ownership Plan (ESOP)\nThe cost of shares issued to the Employee Stock Ownership Plan (ESOP), but not yet allocated to participants, is shown as a reduction of shareholders equity. Compensation expense is based on the average fair value of shares as they are committed to be released to participant accounts.\nLoss Per Share\nBasic earnings (loss) per share is calculated by dividing net income (loss) by the weighted-average number of common shares outstanding during the year. Unallocated common shares held by the ESOP are shown as a reduction in shareholders equity and are excluded from weighted-average common shares outstanding for both basic and diluted earnings per share calculations until they are committed to be released.\nThe Company had no dilutive or potentially dilutive securities during the year ended June 30, 2023.\nComprehensive Loss\nComprehensive income (loss) consists of net income (loss) and other comprehensive income (loss), net of applicable income taxes. Other comprehensive income (loss) includes unrealized appreciation (depreciation) on available-for-sale securities and, if necessary, unrealized appreciation (depreciation) on available-for-sale securities for which a portion of an other-than-temporary impairment has been recognized in income and changes in the funded status of the defined benefit pension plan.\nAccumulated other comprehensive loss consists of the cumulative unrealized gains and losses on available-for-sale securities, and the cumulative unrealized gain or loss for the funded status of the defined benefit plan pension plan liability, net of tax.\nRevenue Recognition\nThe Company accounts for revenue recognition in accordance with Accounting Standards Update (ASU) 2014-09 \"Revenue from Contracts with Customers\" (Accounting Standards Codification (ASC) 606). ASC 606 provides that an entity should recognize revenue to depict the transfer of promised goods and services to customers in an amount that reflects the consideration to which the entity expects to be entitled in exchange for those goods or services. Interest income, net securities gains (losses) and income from bank-owned life insurance are not included within the scope of ASC 606. For the revenue streams in the scope of ASC 606, service charges on deposits and electronic banking fees, there are no significant judgments related to the amount and timing of revenue recognition. All of the Companys in scope revenue from contracts with customers is recognized within other noninterest income.\nDeposit Services. The Company generates revenues through fees charged to depositors related to deposit account maintenance fees, overdrafts, ATM fees, wire transfers and additional miscellaneous services provided at the request of the depositor. For deposit-related services, revenue is recognized when performance obligations are satisfied, which is, generally, at a point in time.\nNote 2:Future Change in Accounting Principle\nThe FASB issued ASU No. 2016- 13, Financial Instruments-Credit Losses (Topic 326). The ASU introduced a new credit loss model, the current expected credit loss model (CECL), which requires earlier recognition of credit losses, while also providing additional transparency about credit risk.\nThe CECL model utilizes a lifetime expected credit loss measurement objective for the recognition of credit losses for loans, held-to-maturity securities and other receivables at the time the financial asset is originated or acquired. The expected credit losses are adjusted each period for changes in expected lifetime credit losses. For available-for-sale securities where fair value is less than cost, credit-related impairment, if any, will be recognized in an allowance for credit losses and adjusted each period for changes in expected credit risk. This model replaces the multiple existing impairment models, which generally require that a loss be incurred before it is recognized. The CECL model represents a significant change from existing practice and may result in material changes to the Companys accounting for financial instruments. The Company is evaluating the effect ASU 2016-13 will have on its financial statements and related disclosures. The impact of the ASU will depend upon the state of the economy and the nature of our portfolios at the date of adoption. The new standard is effective for the Company for fiscal years beginning after December 15, 2022 (July 1, 2023 as to the Company), including interim periods within those fiscal years. The Company has not yet adopted ASU 2016-13 but is currently evaluating several CECL estimation methodologies and models, with a primary focus on the Scaled CECL Allowance for Losses Estimator (SCALE) Method and the Weighted-Average Remaining Maturity (WARM) method, and the quantitative impact the effect ASU 2016-13 will have on its financial statements and related disclosures. The effect is not yet known or reasonably estimable.\nNote 3:Debt Securities\nThe amortized cost and fair values, together with gross unrealized gains and losses of securities are as follows:\nGross\nGross\nAmortized\nUnrealized\nUnrealized\nApproximate\nCost\nGains\nLosses\nFair Value\nAvailable-for-sale Securities:\nJune 30, 2023\nU.S. Government agencies\n$\n7,000,000\n$\n1,410\n$\n471,900\n$\n6,529,510\nMortgage-backed Government\nSponsored Enterprises (GSEs)\n31,081,408\n2,153,110\n28,929,259\nCollateralized mortgage obligations (CMOs)\n30,633,725\n12,253\n261,388\n30,384,590\nSubordinated debt\n1,000,000\n-\n139,530\n860,470\nState and political subdivisions\n4,561,709\n-\n680,344\n3,881,365\n$\n74,276,842\n$\n14,624\n$\n3,706,272\n$\n70,585,194\nGross\nGross\nAmortized\nUnrealized\nUnrealized\nApproximate\nCost\nGains\nLosses\nFair Value\nAvailable-for-sale Securities:\nJune 30, 2022\nU.S. Government agencies\n$\n6,000,000\n$\n-\n$\n318,720\n$\n5,681,280\nMortgage-backed Government\nSponsored Enterprises (GSEs)\n17,022,130\n8,405\n1,629,577\n15,400,958\nState and political subdivisions\n4,123,874\n-\n711,702\n3,412,172\n$\n27,146,004\n$\n8,405\n$\n2,659,999\n$\n24,494,410\nThe amortized cost and fair value of available-for-sale securities at June 30, 2023, by contractual maturity, are shown below. Expected maturities will differ from contractual maturities because issuers may have the right to call or prepay obligations with or without call or prepayment penalties:\nJune 30, 2023\nAvailable-for-sale\nAmortized\nFair\nCost\nValue\nWithin one year\n$\n-\n$\n-\nOne to five years\n7,421,837\n6,920,950\nFive to ten years\n3,446,953\n2,967,503\nAfter ten years\n1,692,919\n1,382,892\n12,561,709\n11,271,345\nMortgage-backed GSE's and CMO's\n61,715,133\n59,313,849\nTotals\n$\n74,276,842\n$\n70,585,194\nThe carrying value of securities pledged as collateral, to secure public deposits and for other purposes, was $7,201,000 and $4,652,000 at June 30, 2023 and 2022, respectively.\nProceeds from sales of securities totaled $9,708,000 during the fiscal year ended June 30, 2022. Such sales resulted in realized losses of $291,000. There were no sales of securities during the fiscal year ended June 30, 2023.\nCertain investments in debt securities are reported in the financial statements at an amount less than their historical cost. Total fair value of these investments at June 30, 2023 and 2022, was $61,878,925 and $22,516,560, which is approximately 88 percent and 92 percent, respectively, of the fair value of the Companys total investment portfolio. These declines primarily resulted from changes in market interest rates.\nBased on evaluation of available evidence, including recent changes in market interest rates and information obtained from regulatory filings, management believes the declines in fair value for these securities are temporary.\nShould the impairment of any of these securities become other than temporary, the cost basis of the investment will be reduced and the resulting loss recognized in net income in the period the other-than-temporary impairment is identified.\nThe following tables show the Companys investments gross unrealized losses and fair value of the Companys investments with unrealized losses that are not deemed to be other-than-temporarily impaired, aggregated by investment\nclass and length of time that individual securities have been in a continuous unrealized loss position at June 30, 2023 and 2022:\nJune 30, 2023\nLess than 12 Months\n12 Months or More\nTotal\nFair\nUnrealized\nFair\nUnrealized\nFair\nUnrealized\nDescription of Securities\nValue\nLosses\nValue\nLosses\nValue\nLosses\nU.S. Government agencies\n$\n-\n$\n-\n$\n5,528,100\n$\n471,900\n$\n5,528,100\n$\n471,900\nMortgage-backed Government\nSponsored Enterprises (GSEs)\n17,561,545\n278,848\n11,312,858\n1,874,262\n28,874,403\n2,153,110\nCollateralized mortgage obligations\n22,734,587\n261,388\n-\n-\n22,734,587\n261,388\nSubordinated debt\n860,470\n139,530\n-\n-\n860,470\n139,530\nState and political subdivisions\n448,750\n8,324\n3,432,615\n672,020\n3,881,365\n680,344\nTotal temporarily impaired securities\n$\n41,605,352\n$\n688,090\n$\n20,273,573\n$\n3,018,182\n$\n61,878,925\n$\n3,706,272\nJune 30, 2022\nLess than 12 Months\n12 Months or More\nTotal\nFair\nUnrealized\nFair\nUnrealized\nFair\nUnrealized\nDescription of Securities\nValue\nLosses\nValue\nLosses\nValue\nLosses\nU.S. Government agencies\n$\n5,681,280\n$\n318,720\n$\n-\n$\n-\n$\n5,681,280\n$\n318,720\nMortgage-backed Government\nSponsored Enterprises (GSEs)\n8,327,314\n802,556\n5,095,794\n827,021\n13,423,108\n1,629,577\nState and political subdivisions\n1,856,557\n347,775\n1,555,615\n363,927\n3,412,172\n711,702\nTotal temporarily impaired securities\n$\n15,865,151\n$\n1,469,051\n$\n6,651,409\n$\n1,190,948\n$\n22,516,560\n$\n2,659,999\nU.S. Government Agencies and State and Political Subdivisions and Subordinated Debt\nUnrealized losses on these securities have not been recognized into income because the issuers bonds are of high credit quality, values have only been impacted by changes in interest rates since the securities were purchased, and the Company has the intent and ability to hold the securities for the foreseeable future. The fair value is expected to recover as the bonds approach the maturity date. Because the decline in market value is attributable to changes in market interest rates, and not credit quality, and because the Company typically does not intend to sell the investments and it is not more likely than not the Company will be required to sell the investments before recovery of their amortized cost basis, which may be maturity, the Company does not consider those investments to be other-than-temporarily impaired at June 30, 2023\nMortgage-backed GSEs, Collateralized Mortgage Obligations\nThe unrealized losses on the Companys investment in residential mortgage-backed securities and collateralized mortgage obligations were caused by changes in interest rates and illiquidity. The Company expects to recover the amortized cost basis over the term of the securities. Because the decline in market value is attributable to changes in interest rates and illiquidity, and not credit quality, and because the Company does not intend to sell the investments and it is not more likely than not the Company will be required to sell the investments before recovery of their amortized cost basis, which may be maturity, the Company does not consider those investments to be other-than-temporarily impaired at June 30, 2023.\nNote 4:Loans and Allowance for Loan Losses\nCategories of loans at June 30 include:\nJune 30,\nReal estate loans:\nCommercial\n$\n6,009,615\n$\n5,136,407\nResidential\n65,857,446\n65,638,154\nMultifamily\n688,393\n718,911\nAgricultural\n4,044,648\n3,450,672\nConstruction and land\n8,567,060\n6,006,613\nHome equity line of credit (HELOC)\n355,296\n264,421\nCommercial and industrial\n3,398,557\n339,094\nConsumer\n801,476\n713,323\nTotal loans\n89,722,491\n82,267,595\nLess:\nUndisbursed loans in process\n8,202,918\n4,324,320\nNet deferred loan fees\n47,756\n10,203\nAllowance for loan losses\n263,422\n222,884\nNet loans\n$\n81,208,395\n$\n77,710,188\nThe following tables present the activity in the allowance for loan losses based on portfolio segment for the years ended June 30, 2023 and 2022.\nBalance\nProvision (credit)\nBalance\nJuly 1, 2022\nfor loan losses\nCharge-offs\nRecoveries\nJune 30, 2023\nReal estate loans:\nCommercial\n$\n20,643\n$\n6,736\n$\n-\n$\n-\n$\n27,379\nResidential\n177,830\n(10,116)\n-\n-\n167,714\nMultifamily\n1,926\n(140)\n-\n-\n1,786\nAgricultural\n13,868\n3,223\n-\n-\n17,091\nConstruction and land\n5,477\n7,014\n-\n-\n12,491\nHome equity line of credit (HELOC)\n1,306\n33,473\n-\n-\n34,779\nCommercial and industrial\n-\n-\nConsumer\n1,125\n-\n-\n1,300\nTotal loans\n$\n222,884\n$\n40,538\n$\n-\n$\n-\n$\n263,422\nBalance\nProvision (credit)\nBalance\nJuly 1, 2021\nfor loan losses\nCharge-offs\nRecoveries\nJune 30, 2022\nReal estate loans:\nCommercial\n$\n27,506\n$\n(6,863)\n$\n-\n$\n-\n$\n20,643\nResidential\n176,498\n1,332\n-\n-\n177,830\nMultifamily\n-\n1,926\n-\n-\n1,926\nAgricultural\n8,334\n5,534\n-\n-\n13,868\nConstruction and land\n7,723\n(2,246)\n-\n-\n5,477\nHome equity line of credit (HELOC)\n-\n-\n1,306\nCommercial and industrial\n1,437\n(728)\n-\n-\nConsumer\n-\n-\n1,125\nTotal loans\n$\n222,884\n$\n-\n$\n-\n$\n-\n$\n222,884\nThe following tables present the balance in the allowance for loan losses and the recorded investment in loans based on portfolio segment and impairment method as of June 30, 2023 and 2022:\nAllowance for loan losses\nLoans\nEnding balance, evaluated for impairment\nEnding balance, evaluated for impairment\nIndividually\nCollectively\nIndividually\nCollectively\nJune 30, 2023\nReal estate loans:\nCommercial\n$\n-\n$\n27,379\n$\n-\n$\n6,009,615\nResidential\n167,707\n304,096\n65,553,350\nMultifamily\n-\n1,786\n-\n688,393\nAgricultural\n-\n17,091\n-\n4,044,648\nConstruction and land\n-\n12,491\n-\n8,567,060\nHome equity line of credit (HELOC)\n-\n34,779\n-\n355,296\nCommercial and industrial\n-\n-\n3,398,557\nConsumer\n-\n1,300\n-\n801,476\nTotal loans\n$\n$\n263,415\n$\n304,096\n$\n89,418,395\nJune 30, 2022\nReal estate loans:\nCommercial\n$\n-\n$\n20,643\n$\n-\n$\n5,136,407\nResidential\n2,734\n175,096\n359,263\n65,278,891\nMultifamily\n-\n1,926\n-\n718,911\nAgricultural\n-\n13,868\n-\n3,450,672\nConstruction and land\n-\n5,477\n-\n6,006,613\nHome equity line of credit (HELOC)\n-\n1,306\n-\n264,421\nCommercial and industrial\n-\n-\n339,094\nConsumer\n-\n1,125\n-\n713,323\nTotal loans\n$\n2,734\n$\n220,150\n$\n359,263\n$\n81,908,332\nThe Company has adopted a standard loan grading system for all non-residential real estate loans. Loan grades are numbered 1 through 8. Grades 1 through 3 are considered satisfactory grades. The grade of 4, Monitor, represents loans requiring more than normal attention. The grade of 5, Special Mention, represents loans of lower quality and is considered criticized. The grades of 6, or Substandard, and 7, Doubtful, refer to loans that are classified.\nPass (1-3) Loans of reasonable credit strength and repayment ability providing a satisfactory credit risk.\nMonitor (4)\nLoans requiring more than normal attention resulting from underwriting weaknesses as to repayment terms, loan structure, financial and/or documentation exceptions.\nSpecial Mention (5)\nLoans which may include the characteristics of the Monitor classification, problems that need to be addresses by both the lender and the borrower.\nSubstandard (6)\nLoans which may include the characteristics of the Special Mention classification, but also reflects financial and other problems that might result in some loss at a future date and/or reliance upon collateral for ultimate collection.\nDoubtful (7) Loans for which some loss is anticipated, but the timing and amount of the loss is not definite.\nLoss (8) Loans considered non-bankable assets which may or may not have some salvage value.\nRisk characteristics of each loan portfolio segment are described as follows:\nCommercial Real Estate\nThese loans are generally secured by owner-occupied commercial real estate including warehouses and offices. The main risks are changes in the value of the collateral and changes in the economy or borrowers business operations. Management specifically considers unemployment and changes in real estate values in the Companys market area.\nResidential Real Estate\nThese loans include first liens, junior liens and construction loans on 1-4 family residential real estate (both owner and non-owner occupied). The main risks for these loans are changes in the value of the collateral and stability of the local economic environment and its impact on the borrowers employment. Management specifically considers unemployment and changes in real estate values in the Companys market area.\nMultifamily\nThese loans include loans on residential real estate secured by property with five or more units. The main risks are changes in the value of the collateral, ability of borrowers to collect rents, vacancy and changes in the tenants employment status. Management specifically considers unemployment and changes in real estate values in the Companys market area.\nAgriculture Real Estate\nThese loans include loans on farm ground, vacant land for development and loans on commercial real estate. The main risks are changes in the value of the collateral and changes in the economy or borrowers business operations. Management specifically considers unemployment and changes in real estate values in the Companys market area.\nConstruction and Land Real Estate\nThese loans include construction loans for 1-4 family residential and commercial properties (both owner and non-owner occupied) and first liens on land. The main risks for construction loans include uncertainties in estimating costs of construction and in estimating the market value of the completed project. The main risks for land loans are\nchanges in the value of the collateral and stability of the local economic environment. Management specifically considers unemployment and changes in real estate values in the Companys market area.\nHELOC\nThese loans are generally secured by owner-occupied 1-4 family residences. The main risks for these loans are changes in the value of the collateral and stability of the local economic environment and its impact on the borrowers employment. Management specifically considers unemployment and changes in real estate values in the Companys market area.\nCommercial and Industrial\nThe commercial and industrial portfolio includes loans to commercial customers for use in financing working capital needs, equipment purchases and expansions. The loans in this category are repaid primarily from the cash flow of a borrowers principal business operation. Credit risk in these loans is driven by creditworthiness of the borrower and the economic conditions that impact the cash flow stability from business operations.\nConsumer Loans\nThese loans include vehicle loans, share loans and unsecured loans. The main risks for these loans are the depreciation of the collateral values (vehicles) and the financial condition of the borrowers. Major employment changes are specifically considered by management.\nInformation regarding the credit quality indicators most closely monitored for other than residential real estate loans by class as of June 30, 2023 and 2022, follows:\nSpecial\nPass\nMonitor\nMention\nSubstandard\nDoubtful\nTotal\nJune 30, 2023\nReal estate loans:\nCommercial\n$\n5,868,689\n$\n140,926\n$\n-\n$\n-\n$\n-\n$\n6,009,615\nMultifamily\n688,393\n-\n-\n-\n-\n688,393\nAgricultural\n3,822,067\n222,581\n-\n-\n-\n4,044,648\nConstruction and land\n5,254,192\n3,274,936\n-\n37,932\n-\n8,567,060\nCommercial and industrial\n3,398,557\n-\n-\n-\n-\n3,398,557\nConsumer\n801,476\n-\n-\n-\n-\n801,476\nTotal loans\n$\n19,833,374\n$\n3,638,443\n$\n-\n$\n37,932\n$\n-\n$\n23,509,749\nJune 30, 2022\nReal estate loans:\nCommercial\n$\n4,963,148\n$\n173,259\n$\n-\n$\n-\n$\n-\n$\n5,136,407\nMultifamily\n718,911\n-\n-\n-\n-\n718,911\nAgricultural\n3,212,171\n238,501\n-\n-\n-\n3,450,672\nConstruction and land\n79,160\n5,887,572\n-\n39,881\n-\n6,006,613\nCommercial and industrial\n304,607\n34,487\n-\n-\n-\n339,094\nConsumer\n713,323\n-\n-\n-\n-\n713,323\nTotal loans\n$\n9,991,320\n$\n6,333,819\n$\n-\n$\n39,881\n$\n-\n$\n16,365,020\nThe following tables present the credit risk profile of the Companys residential real estate loan portfolio based on internal rating category and payment activity as of June 30, 2023 and 2022:\nPerforming\nNonperforming\nTotal\nJune 30, 2023\nReal estate loans:\nResidential\n$\n65,553,350\n$\n304,096\n$\n65,857,446\nHome equity line of credit (HELOC)\n355,296\n-\n355,296\n$\n65,908,646\n$\n304,096\n$\n66,212,742\nPerforming\nNonperforming\nTotal\nJune 30, 2022\nReal estate loans:\nResidential\n$\n65,412,572\n$\n225,582\n$\n65,638,154\nHome equity line of credit (HELOC)\n264,421\n-\n264,421\n$\n65,676,993\n$\n225,582\n$\n65,902,575\nThe Company evaluates the loan risk grading system definitions and allowance for loan losses methodology on an ongoing basis. No significant changes were made to either during the past year.\nThe following tables present the Companys loan portfolio aging analysis of the recorded investment in loans as of June 30, 2023 and 2022:\nJune 30, 2023\nGreater Than\nTotal Loans >\n30-59 Days\n60-89 Days\n90 Days\nTotal\nTotal Loans\n90 Days &\nPast Due\nPast Due\nPast Due\nPast Due\nCurrent\nReceivable\nAccruing\nReal estate loans:\nCommercial\n$\n-\n$\n-\n$\n-\n$\n-\n$\n6,009,615\n$\n6,009,615\n$\n-\nResidential\n-\n616,352\n117,395\n733,747\n65,123,699\n65,857,446\n-\nMultifamily\n-\n-\n-\n-\n688,393\n688,393\n-\nAgricultural\n-\n-\n-\n-\n4,044,648\n4,044,648\n-\nConstruction and land\n-\n-\n-\n-\n8,567,060\n8,567,060\n-\nHELOC\n-\n-\n-\n-\n355,296\n355,296\n-\nCommercial and industrial\n-\n-\n-\n-\n3,398,557\n3,398,557\n-\nConsumer\n-\n-\n-\n-\n801,476\n801,476\n-\nTotal\n$\n-\n$\n616,352\n$\n117,395\n$\n733,747\n$\n88,988,744\n$\n89,722,491\n$\n-\nJune 30, 2022\nGreater Than\nTotal Loans >\n30-59 Days\n60-89 Days\n90 Days\nTotal\nTotal Loans\n90 Days &\nPast Due\nPast Due\nPast Due\nPast Due\nCurrent\nReceivable\nAccruing\nReal estate loans:\nCommercial\n$\n-\n$\n-\n$\n-\n$\n-\n$\n5,136,407\n$\n5,136,407\n$\n-\nResidential\n-\n89,856\n217,019\n306,875\n65,331,279\n65,638,154\n133,681\nMultifamily\n-\n-\n-\n-\n718,911\n718,911\n-\nAgricultural\n-\n-\n-\n-\n3,450,672\n3,450,672\n-\nConstruction and land\n-\n-\n-\n-\n6,006,613\n6,006,613\n-\nHELOC\n-\n-\n-\n-\n264,421\n264,421\n-\nCommercial and industrial\n-\n-\n-\n-\n339,094\n339,094\n-\nConsumer\n-\n-\n-\n-\n713,323\n713,323\n-\nTotal\n$\n-\n$\n89,856\n$\n217,019\n$\n306,875\n$\n81,960,720\n$\n82,267,595\n$\n133,681\nA loan is considered impaired when, based on current information and events, it is probable that the Company will be unable to collect the scheduled payments of principal or interest when due according to the contractual terms of the loan agreement.\nInformation on impaired loans as of and for the years ended June 30, 2023 and 2022 is as follows.\nAs of and for the year ended June 30, 2023\nUnpaid\nAverage Balance of\nInterest\nRecorded\nPrincipal\nSpecific\nImpaired\nIncome\nBalance\nBalance\nAllowance\nLoans\nRecognized\nLoans without a specific valuation allowance:\nReal estate\nResidential\n$\n243,764\n$\n243,764\n$\n-\n$\n248,057\n$\n7,456\nLoans with a specific valuation allowance:\nReal estate\nResidential\n60,332\n60,332\n61,670\n3,886\nTotals\n$\n304,096\n$\n304,096\n$\n$\n309,727\n$\n11,342\nAs of and for the year ended June 30, 2022\nUnpaid\nAverage Balance of\nInterest\nRecorded\nPrincipal\nSpecific\nImpaired\nIncome\nBalance\nBalance\nAllowance\nLoans\nRecognized\nLoans without a specific valuation allowance:\nReal estate\nResidential\n$\n296,204\n$\n296,204\n$\n-\n$\n301,041\n$\n6,005\nLoans with a specific valuation allowance:\nReal estate\nResidential\n63,059\n63,059\n2,734\n64,319\n4,028\nTotals\n$\n359,263\n$\n359,263\n$\n2,734\n$\n365,360\n$\n10,033\nNonaccrual loans as of June 30, 2023 and 2022 are as follows:\nJune 30,\nResidential real estate loans\n$\n304,096\n$\n225,582\nTotal nonaccrual\n$\n304,096\n$\n225,582\nThere were no significant loans modified in a troubled debt restructuring during the years ended June 30, 2023 and 2022. There were no troubled debt restructurings modified in the past 12 months that subsequently defaulted for the years ended June 30, 2023 and 2022.\nNote 5:Premises and Equipment\nMajor classifications of premises and equipment, stated at cost, at June 30, 2023 and 2022, are as follows:\nLand\n$\n572,183\n$\n558,183\nBuildings and improvements\n1,357,006\n1,324,017\nFurniture and equipment\n1,099,722\n1,060,167\nIT equipment and improvements\n65,741\n48,160\n3,094,652\n2,990,527\nLess accumulated depreciation\n1,685,305\n1,618,893\nNet premises and equipment\n$\n1,409,347\n$\n1,371,634\nNote 6:Time Deposits\nTime deposits in denominations of $250,000 or more were $5,716,000 and $3,062,000 at June 30, 2023 and 2022, respectively.\nAt June 30, 2023, the scheduled maturities of time deposits were as follows:\nMaturing year ending June 30,\n$\n24,807,064\n10,037,822\n2,664,914\n2,360,870\n11,549,826\nThereafter\n-\n$\n51,420,496\nNote 7:Borrowings\nThe Company had outstanding borrowings comprised solely of advances from the Federal Home Loan Bank (FHLB) totaling $6,200,000, at a variable rate of 5.19 percent, as of June 30, 2023, which were scheduled to mature within one year. The Company had no FHLB advances outstanding as of June 30, 2022.\nBased on collateral pledged, consisting of all shares of FHLB stock owned and a blanket pledge of approximately $63,155,000 and $79,927,000 of its qualifying mortgage loans as of June 30, 2023 and 2022, respectively, the Company was eligible to borrow up to an additional $38,835,000 as of June 30, 2023.\nNote 8:Income Taxes\nThe provision for income taxes includes these components:\nTaxes currently payable\n$\n(6,769)\n$\n5,702\nDeferred income taxes\n(175,944)\n(37,031)\nIncome tax expense (benefit)\n$\n(182,713)\n$\n(31,329)\nA reconciliation of the federal income tax expense (benefit) at the statutory rate to the Companys actual income tax expense (benefit) is shown below:\nComputed at statutory rate (21%)\n$\n(152,900)\n$\n(8,499)\nIncrease (decrease) resulting from:\nBank-owned life insurance\n(23,397)\n(22,739)\nESOP\n17,982\n-\nNontaxable interest income on municipal securities\n(9,070)\n(9,139)\nOther\n(15,328)\n9,048\nActual income tax benefit\n$\n(182,713)\n$\n(31,329)\nThe composition of the Companys net deferred tax asset at June 30, 2023 and 2022, is as follows:\nDeferred tax assets\nAllowance for loan losses\n$\n55,319\n$\n46,806\nUnrealized losses on available-for-sale securities\n775,246\n556,835\nNet operating loss carryforward\n86,723\n-\nOther\n70,283\n66,939\nDeferred tax assets\n987,571\n670,580\nDeferred tax liabilities\nDepreciation\n(27,640)\n(37,090)\nFederal Home Loan Bank stock dividends\n(83,328)\n(151,242)\nDefined benefit pension plan\n(17,290)\n-\nDeferred tax liabilities\n(128,258)\n(188,332)\nNet deferred tax asset\n$\n859,313\n$\n482,248\nRetained earnings at both June 30, 2023 and 2022, includes approximately $1.8 million for which no deferred federal income tax liability has been recognized. This amount represents an allocation of income to bad debt deductions for tax purposes only. Reduction of amounts so allocated for purposes other than tax bad debt losses or adjustments arising from carryback of net operating losses would create income for tax purposes only, which would be subject to the then-current corporate income tax rate. The deferred income tax liability on the preceding amount that would have been recorded if it was expected to reverse into taxable income in the foreseeable future was approximately $375,000 at June 30, 2023 and 2022. The Company has approximately $413,000 of net operating loss carryforwards at June 30, 2023 that do not expire.\nNote 9:Regulatory Matters\nThe Company is subject to various regulatory capital requirements administered by the federal banking agencies. Failure to meet minimum capital requirements can initiate certain mandatory and possibly additional discretionary actions by regulators that, if undertaken, could have a direct material effect on the Companys financial statements. Under capital adequacy guidelines and the regulatory framework for prompt corrective action, the Company must meet specific capital guidelines that involve quantitative measures of the Companys assets, liabilities and certain off-balance-sheet items as calculated under U.S. GAAP reporting requirements and regulatory capital standards. The Companys capital amounts and classification are also subject to qualitative judgments by the regulators about components, risk weightings and other factors. Furthermore, the Companys regulators could require adjustments to regulatory capital not reflected in these financial statements.\nOn November 13, 2019, the federal regulators finalized and adopted a regulatory capital rule establishing a new community bank leverage ratio (CBLR), which became effective on January 1, 2020. The intent of the CBLR is to provide a simple alternative measure of capital adequacy for electing qualifying depository institutions and depository institution holding companies, as directed under the Economic Growth, Regulatory Relief, and Consumer Protection Act. If a qualifying depository institution, or depository institution holding company, elects to use such measure, such institution or holding company will be considered well capitalized if its ratio of Tier 1 capital to average total consolidated assets (i.e., leverage ratio) exceeds 9 percent, subject to a limited two quarter grace period, during which the leverage ratio cannot go 100 basis points below the then applicable threshold, and will not be required to calculate and report risk-based capital ratios. In April 2020, under the Coronavirus Aid, Relief, and Economic Security Act (CARES Act), the 9 percent leverage ratio threshold was temporarily reduced to 8 percent in response to the COVID-19 pandemic. The threshold increased to 8.5 percent in 2021 and returned to 9 percent in 2022. The Company elected to begin using the CBLR for the first quarter of 2020. The Companys CBLR was 20.57 percent and 17.54 percent as of June 30, 2023 and 2022, respectively. Management believes, as of June 30, 2023, that the Company met all capital adequacy requirements to which it is subject.\nNote 10:Related Party Transactions\nThe Companys loans outstanding to certain of its executive officers, directors and their related interests, as of June 30, 2023 and 2022, and activity within those years, was as follows:\nBalance at beginning of year\n$\n4,151,000\n$\n5,154,000\nLoans disbursed\n60,000\n2,000,000\nRepayments\n(445,000)\n(3,003,000)\nBalance at end of year\n$\n3,766,000\n$\n4,151,000\nAt June 30, 2023 and 2022, respectively, $997,000 and $2,200,000, of the related party loan balance was committed and undispersed. In managements opinion, such loans and other extensions of credit and deposits were made in the ordinary course of business and were made on substantially the same terms (including interest rates and collateral) as those prevailing at the time for comparable transactions with other persons. Further, in managements opinion, these loans did not involve more than normal risk of collectability or present other unfavorable features.\nDeposits from related parties held by the Company at June 30, 2023 and 2022, totaled approximately $2,405,000 and $2,394,000, respectively.\nNote 11:Loss Per Share\nBasic loss per common share is computed based upon 1,922,924 common shares outstanding during the year, less 149,868 weighted-average shares in the Companys ESOP that are unallocated and not committed to be released.\nNote 12: Employee Benefits\nPentegra Multi-Employer Plan\nThe Company participated in a multi-employer defined benefit pension fund through Pentegra Retirement Services (Plan) for periods through December 31, 2022. Effective January 1, 2023, the Company withdrew from the Plan. More specifically, the plan number is 333 and the employer ID number is 13-5645888. This benefit plan is a full service, multiple employer defined benefit pension plan operating under the Employee Retirement Income and Security Act of 1974 (ERISA). The most recent financial statements were issued as of June 30, 2021 and show net assets available for the payment of benefits as $3.97 billion versus the present value of accumulated plan benefits of $5.27 billion. Therefore, the Plan was underfunded by $1.30 billion as of this date. Beginning in fiscal year 2008 the required annual participant contributions have been increased to fund the shortfall over a period of seven years, although participating employers had the option to fund a portion of their shortfall over a 15-year period for the 2010-2012 plan years (not elected by Van Wert). There are no collective bargaining agreements in place that require contributions to the Company Plan.\nThe Plan is a single plan under Internal Revenue Code Section 413(c) and, as a result, all of the assets stand behind all of the liabilities. Accordingly, under the Plan contributions made by a participating employer may be used to provide benefits to participants of other participating employers.\nThe Plan had been maintained for all full-time employees who have been employed for a period longer than one year. In March 2016, the Company froze its participation in the Plan for new employees and curtailed future benefits for existing employees. Current costs are funded as incurred. The Companys contributions to the fund are based on covered employees ages and salaries. Pension expense was approximately $96,000 for the fiscal year ended June 30, 2022.\nManagement elected to withdraw from the Plan effective January 1, 2023. The Company incurred a charge in connection with the withdrawal. Pension expense was approximately $1,120,000 and $96,000 for the fiscal years ended June 30, 2023 and 2022, respectively, with the increase due to the withdrawal charge.\nDefined Benefit Pension Plan\nIn connection with the withdrawal from the Pentegra Plan effective January 1, 2023, the Company established the Van Wert Federal Savings Bank Defined Benefit Plan (the DB Plan) as a qualified successor plan. The Company contributed $4,978,000 to the DB Plan and the DB Plan had benefit obligations of $5,008,000 at inception. As permitted under the DB Plan, the Company elected to terminate the DB Plan effective July 1, 2023. Pursuant to the DB Plan termination, all obligations due to the DB Plan participants will be satisfied during the year ended June 30, 2024.\nInformation about the DB Plans funded status and pension cost follows:\nChange in benefit obligation:\nBeginning of the year\n$\n-\nBenefit obligation upon transfer from Pentegra plan - projected\n5,007,614\nService cost\n16,000\nInterest cost\n83,992\nActuarial gain\n(86,514)\nBenefits paid\n(97,520)\nAdministrative expenses\n(28,725)\nNet periodic pension cost\n4,894,847\nChange in plan assets:\nBeginning of the year\n-\nTransfer from Pentegra plan\n4,977,837\nActual return on assets\n77,696\nAdministrative expenses\n(28,725)\nBenefits paid\n(97,520)\nEnd of the year\n4,929,288\nFunded status at June 30, 2023\n$\n34,441\nAmounts recognized in accumulated other comprehensive loss not yet recognized as components of net periodic benefit cost consist of the following:\nNet gain\n$\n82,333\nPrior service cost\n-\n$\n82,333\nInformation for the pension plan with respect to benefit obligation and plan assets is as follows:\nProjected benefit obligation\n$\n4,894,847\nFair value of plan assets\n$\n4,929,288\nComponents of net periodic benefit cost:\nService cost\n$\n16,000\nInterest cost\n83,992\nExpected return on plan assets\n(81,877)\nNet periodic pension cost\n18,115\nRecognition of underfunded pension\nbenefit obligation at transition\n29,777\nExpense recognized\n$\n47,892\nSignificant assumptions include the following:\nWeighed-average assumptions used to determine benefit obligation:\nDiscount rate\n5.80%\nWeighted average assumptions used to determine benefit cost:\nDiscount rate\n5.09%\nExpected return on plan assets\n5.00%\n401(k) Plan\nThe Company sponsors a 401(k) profit sharing plan covering substantially all employees. Employees are eligible to participate once they have reached age 21 and have completed 90 days of service. The Company will make matching contributions up to 6 percent of an employees compensation once the employee has completed 12 months of service. The Companys expense relative to the plan totaled approximately $68,000 and $60,000 for the years ended June 30, 2023 and 2022, respectively.\nSalary Continuation Plan\nOn August 1, 2016, the Company entered into a salary continuation plan with the Companys former President to provide additional retirement benefits for the life of the former President, with a guaranteed payout period of 15 years. The plan is intended to be an unfunded, non-qualified deferred compensation plan. The Companys expense (benefit) relative to the plan totaled approximately $(9,000) and $10,000 for the years ended June 30, 2023 and 2022, respectively. The Companys liability related to the plan totaled approximately $155,000 and $177,000 as of June 30, 2023 and 2022, respectively.\nEmployee Stock Ownership Plan (ESOP)\nThe Company established the ESOP in July 2022 in connection with the Conversion and the ESOP acquired 153,834 shares. The ESOP borrowed from the Company to purchase the shares of the Companys common stock at $10.00 per share. The Company will make annual contributions to the ESOP and the ESOP uses funds it receives to repay the loan. When loan payments are made, ESOP shares are allocated to participants based on relative compensation and expense is recorded.\nInformation related to the ESOP as of and during the year ended June 30, 2023 is as follows:\nShares committed to be released to participants\n7,692\nShares allocated to participants\n-\nUnreleased shares\n146,142\nTotal\n153,834\nFair value of unreleased shares\n$\n1,899,846\nThe Company recognized expense related to the ESOP totaling approximately $165,000 during the year ended June 30, 2023.\nNote 13:Disclosures about Fair Value of Assets and Liabilities\nFair value is the exchange price that would be received to sell an asset or paid to transfer a liability (exit price) in the principal or most advantageous market for the asset or liability in an orderly transaction between market participants at the measurement date. Fair value measurements must maximize the use of observable inputs and minimize the use of unobservable inputs. There is a hierarchy of three levels of inputs that may be used to measure fair value:\nLevel 1\nQuoted prices (unadjusted) for identical assets or liabilities in active markets that the entity has the ability to access as of the measurement date.\nLevel 2\nSignificant other observable inputs other than Level 1 prices such as quoted prices for similar assets or liabilities; quoted prices in markets that are not active; or other inputs that are observable or can be corroborated by observable market data.\nLevel 3\nSignificant unobservable inputs that reflect an entitys own assumptions about the assumptions that market participants would use in pricing an asset or liability.\nRecurring Measurements\nThe following table presents the fair value measurements of assets recognized in the accompanying balance sheets measured at fair value on a recurring basis and the level within the fair value hierarchy in which the fair value measurements fall at June 30, 2023 and 2022:\nFair Value Measurements Using\nQuoted Prices in\nSignificant\nActive Markets for\nSignificant Other\nUnobservable\nFair\nIdentical Assets\nObservable Inputs\nInputs\nValue\n(Level 1)\n(Level 2)\n(Level 3)\nJune 30, 2023\nU.S. Government agencies\n$\n6,529,510\n$\n-\n$\n6,529,510\n$\n-\nMortgage-backed GSEs\n28,929,259\n-\n28,929,259\n-\nCollateralized mortgage obligations\n30,384,590\n-\n30,384,590\n-\nSubordinated debt\n860,470\n-\n860,470\n-\nState and political subdivisions\n3,881,365\n-\n3,881,365\n-\nJune 30, 2022\nU.S. Government agencies\n$\n5,681,280\n$\n-\n$\n5,681,280\n$\n-\nMortgage-backed GSEs\n15,400,958\n-\n15,400,958\n-\nState and political subdivisions\n3,412,172\n-\n3,412,172\n-\nFollowing is a description of the valuation methodologies used for assets measured at fair value on a recurring basis and recognized in the accompanying balance sheets, as well as the general classification of such assets pursuant to the valuation hierarchy. There are no liabilities measured at fair value on a recurring basis. There have been no significant changes in the valuation techniques during the year ended June 30, 2023.\nAvailable-for-sale Securities\nWhere quoted market prices are available in an active market, securities are classified within Level 1 of the valuation hierarchy. If quoted market prices are not available, then fair values are estimated by using quoted prices of securities with similar characteristics or independent asset pricing services and pricing models, the inputs of which are market-based or independently sourced market parameters, including, but not limited to, yield curves, interest rates, volatilities, prepayments, defaults, cumulative loss projections and cash flows. Such securities are classified in Level 2\nof the valuation hierarchy. In certain cases where Level 1 or Level 2 are not available, securities are classified within Level 3 of the hierarchy. The Company had no Level 3 securities.\nNonrecurring Measurements\nAt June 30, 2023, the Company had one loan measured at fair value with a carrying value of $60,000, which is classified within Level 3 of the fair value hierarchy. The fair value of the loan is estimated using third-party appraisals of the collateral, less estimated costs to sell. The Company had no assets or liabilities measured at fair value on a nonrecurring basis at June 30, 2022.\nThe estimated fair values of the Companys financial instruments not carried at fair value on the consolidated balance sheets are as follows:\nCarrying\nFair\nFair Value Measurements Using\nValue\nValue\n(Level 1)\n(Level 2)\n(Level 3)\nJune 30, 2023\nFinancial assets:\nCash and due from banks\n$\n5,515,728\n$\n5,515,728\n$\n5,515,728\n$\n-\n$\n-\nLoans, net\n81,208,395\n73,268,657\n-\n-\n73,268,657\nFHLB Stock\n396,800\n396,800\n-\n396,800\n-\nAccrued interest receivable\n498,807\n498,807\n498,807\n-\n-\nFinancial liabilities:\nDeposits\n119,991,581\n120,415,085\n68,571,085\n-\n51,844,000\nBorrowings\n6,200,000\n6,191,000\n-\n-\n6,191,000\nAccrued interest payable\n55,667\n55,667\n55,667\n-\n-\nJune 30, 2022\nFinancial assets:\nCash and due from banks\n$\n36,711,842\n$\n36,711,842\n$\n36,711,842\n$\n-\n$\n-\nInterest-bearing time deposits\n1,470,000\n1,470,000\n1,470,000\n-\n-\nLoans, net\n77,710,188\n73,828,181\n-\n-\n73,828,181\nFHLB Stock\n1,012,900\n1,012,900\n-\n1,012,900\n-\nAccrued interest receivable\n219,195\n219,195\n219,195\n-\n-\nFinancial liabilities:\nDeposits\n109,990,209\n109,936,154\n74,773,154\n-\n35,163,000\nAccrued interest payable\n-\n-\nLimitations: Fair value estimates are made at a specific point in time, based on relevant market information and information about the financial instrument. These estimates do not reflect any premium or discount that could result from offering for sale at one time the Companys entire holdings of a particular financial instrument. Fair value estimates may not be realizable in an immediate settlement of the instrument. In some instances, there are no quoted market prices for the Companys various financial instruments, in which case fair values may be based on estimates using present value or other valuation techniques, or based on judgments regarding future expected loss experience, current economic conditions, risk characteristic of the financial instruments, or other factors. Those techniques are significantly affected by the assumptions used, including the discount rate and estimate of future cash flows. Subsequent changes in assumptions could significantly affect the estimates.\nNote 14: Commitments and Credit Risks\nCommitments to originate loans are agreements to lend to a customer as long as there is no violation of any condition established in the contract. Commitments generally have fixed expiration dates or other termination clauses and may require payment of a fee. Since a portion of the commitments may expire without being drawn upon, the total\ncommitment amounts do not necessarily represent future cash requirements. Each customers creditworthiness is evaluated on a case-by-case basis. The amount of collateral obtained, if deemed necessary, is based on managements credit evaluation of the counterparty. Collateral held varies, but may include accounts receivable, inventory, property, plant and equipment, commercial real estate and residential real estate.\nLines of credit are agreements to lend to a customer as long as there is no violation of any condition established in the contract. Lines of credit generally have fixed expiration dates. Since a portion of the line may expire without being drawn upon, the total unused lines do not necessarily represent future cash requirements. Each customers creditworthiness is evaluated on a case-by-case basis. The amount of collateral obtained, if deemed necessary, is based on managements credit evaluation of the counterparty. Collateral held varies but may include accounts receivable, inventory, property, plant and equipment, commercial real estate and residential real estate.\nManagement uses the same credit policies in granting lines of credit as it does for on-balance-sheet instruments:\nJune 30,\nCommitments to originate loans\n$\n7,028,000\n$\n278,000\nUndisbursed balance of loans closed\n3,994,000\n6,457,000\nTotal\n$\n11,022,000\n$\n6,735,000\nNote 15:Accumulated Other Comprehensive Loss\nThe components of accumulated other comprehensive income (loss), included in equity, are as follows at June 30, 2023 and 2022:\nAccumulated other comprehensive loss at June 30, 2022\n$\n(2,094,759)\nUnrealized gains (losses) on available for sale securities\n(1,040,054)\nUnrealized valuation gain on defined benefit obligation\n82,333\nTax benefit from unrealized gains (losses)\n201,121\nNet current period other comprehensive loss\n(756,600)\nAccumulated other comprehensive loss at June 30, 2023\n$\n(2,851,359)\nAccumulated other comprehensive loss at June 30, 2021\n$\n(75,032)\nOther comprehensive loss before reclassification\n(2,249,773)\nAmounts reclassified from accumulated other comprehensive loss\n230,046\nNet current period other comprehensive loss\n(2,019,727)\nAccumulated other comprehensive loss at June 30, 2022\n$\n(2,094,759)\nThe following are significant amounts reclassified out of accumulated other comprehensive loss for the year ended June 30, 2022:\nAmount Reclassified from Accumulated Other Comprehensive Loss For the Year Ended June 30, 2022\nUnrealized losses on available-for-sale securities\n$\n291,198\nTax effect\n(61,152)\nTotal security reclassifications for the period\n$\n230,046\nNote 16:Risks and Uncertainties\nCertain economic uncertainties have arisen resulting from the current inflationary environment and rising interest rate environment which may negatively affect the financial position, results of operations and cash flows of the Company and in particular the collectability of the loan portfolio. The duration of these uncertainties and the ultimate financial effects cannot fully be reasonably estimated at this time.\nNote 17:Conversion to Stock Form\nOn March 3, 2022, the Board of Directors of the Bank adopted a plan of conversion. The plan of conversion was subject to the approval of the Federal Deposit Insurance Corporation and the Office of the Comptroller of the Currency, and the approval by the affirmative vote of at least a majority of the total votes eligible to be cast by the voting members of the Bank at a special meeting. The plan of conversion provided for the Bank to convert into a stock savings bank structure with the establishment of a stock holding company (VWF Bancorp, Inc.), as parent of the Bank. The Bank converted to the stock form of ownership, followed by the issuance of all of the Banks outstanding stock to VWF Bancorp, Inc. Pursuant to the plan of conversion, the Bank determined the total offering value and number of shares of common stock based upon an independent appraisers valuation.\nVWF Bancorp, Inc. is organized as a corporation under the laws of the State of Maryland and owns all of the outstanding common stock of the Bank as of completion of the conversion.\nAt the completion of the conversion to stock form, the Bank established a liquidation account in the amount of retained earnings contained in the final prospectus. The liquidation account will be maintained for the benefit of eligible savings account holders who maintain deposit accounts in the Bank after conversion.\nThe conversion was accounted for as a change in corporate form with the historic basis of the Banks assets, liabilities and equity unchanged as a result. In accordance with OCC regulations, at the time of the conversion, the Bank established a liquidation account. The liquidation account must be maintained for the benefit of eligible account holders and supplemental eligible account holders who continue to maintain their accounts at the Bank after the conversion. The liquidation account will be reduced annually to the extent that eligible holders and supplemental eligible account holders have reduced their qualifying deposits. Subsequent increases will not restore an eligible account holders or supplemental eligible account holders interest in the liquidation account. In the event of a complete liquidation by the Bank, and only in such event, each eligible account holder and supplemental eligible account holder will be entitled to receive a distribution from the liquidation account in an amount proportionate to the adjusted qualifying account balances then held. The Bank may not pay dividends if those dividends would reduce equity capital below the required liquidation account amount.\nVWF Bancorp, Inc. is an emerging growth company, and, for as long as it continues to be an emerging growth company, it may choose to take advantage of exemptions from various reporting requirements applicable to other public\ncompanies but not to emerging growth companies. VWF Bancorp, Inc. uses the extended transition period to delay adoption of new or revised accounting pronouncements applicable to public companies until such pronouncements are made applicable to private companies. Accordingly, its financial statements may not be comparable to the financial statements of public companies that comply with such new or revised accounting standards.\nNote 18: Condensed Financial Information (Parent Company Only)\nPresented below is condensed financial information as to financial condition, results of operations and cash flows of the Company:\nCondensed Balance Sheet\nJune 30,\nAssets\nCash and due from banks\n$\n7,374,159\nInvestment in Van Wert Federal Savings Bank\n31,202,165\nOther assets\n61,500\nTotal assets\n38,637,824\nLiabilities and Shareholders' Equity\nLiabilities\nAccrued interest payable and other liabilities\n139,824\nShareholders' Equity\n38,498,000\nTotal liabilities and shareholders' equity\n$\n38,637,824\nCondensed Statement of Operations\nFor the Year Ended June 30,\nJune 30,\nOperating Income\n$\n-\nGeneral, Adminstrative and Other Expenses\nSalaries and employee benefits\n123,291\nProfessional services\n142,840\nTotal\n266,131\nLoss before income tax benefit and equity in loss of subsidiary\n(266,131)\nIncome tax benefits\n(61,500)\nLoss before equity in loss of subsidiary\n(204,631)\nEquity in loss of Van Wert Federal Savings Bank\n(340,753)\nNet Loss\n$\n(545,384)\nCondensed Statement of Cash Flows\nFor the Year Ended June 30,\nJune 30,\nOperating Activities\nNet loss\n$\n(545,384)\nItems not requiring (providing) cash:\nEquity in loss of subsidiary\n340,753\nShares allocated to ESOP\n106,391\nNet change in other assets and liabilities\n78,325\nNet cash used in operating activities\n(19,915)\nInvesting Activities\nInvestment in subsidiary\n(8,932,413)\nFinancing Activities\nProceeds from issuance of common stock\n16,326,487\nNet change in cash and cash equivalents\n7,374,159\nCash and cash equivalents at beginning of year\n-\nCash and cash equivalents at end of year\n$\n7,374,159\nNote 19:Subsequent Events\nSubsequent events have been evaluated through October 6, 2023, which is the date the financial statements were issued. ITEM 9.Changes In and Disagreements With Accountants on Accounting and Financial Disclosure\nNone. ITEM 9A.Controls and Procedures\nDisclosure Controls and Procedures\nAn evaluation was performed under the supervision and with the participation of the Companys management, including the President and Chief Executive Officer and the Chief Financial Officer and Treasurer, of the effectiveness of the design and operation of the Companys disclosure controls and procedures (as defined in Rule 13a-15(e) and 15d-15(e) promulgated under the Securities and Exchange Act of 1934, as amended) as of June 30, 2023. These disclosure controls and procedures are designed with the objective of ensuring that information required to be disclosed in our reports filed under the Securities and Exchange Act of 1934, as amended, such as this report, is recorded, processed, summarized, and reported within the time periods specified in the SECs rules and forms. Disclosure controls and procedures are also designed with the objective of ensuring that such information is accumulated and communicated to the Companys management, including the President and Chief Executive Officer and the Chief Financial Officer and Treasurer, as appropriate, to allow timely decisions regarding the required disclosure. Based on that evaluation, the Companys management, including the President and Chief Executive Officer and the Chief Financial Officer and Treasurer, concluded that the Companys disclosure controls and procedures were ineffective as of June 30, 2023.\nInternal Controls Over Financial Reporting\nManagements Annual Report on Internal Control Over Financial Reporting\nThe Companys management, including the President and Chief Executive Officer and the Chief Financial Officer and Treasurer, is responsible for establishing and maintaining adequate internal control over the Companys financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) under the Securities and Exchange Act of 1934, as amended). Internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of the Companys financial reporting and the preparation of financial statements for external purposes in accordance with GAAP. Because of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nAs of June 30, 2023, the Companys management, including the Companys principal executive officer and principal financial officer, has assessed the effectiveness of its internal control over financial reporting using the criteria set forth in the Committee of Sponsoring Organizations of the Treadway Commission in Internal Control-Integrated Framework (2013). Based on the assessment using those criteria, management identified material weaknesses related to the Companys internal control over financial reporting and, as such, concluded that the Companys internal control over financial reporting was ineffective as of June 30, 2023. A material weakness is a deficiency, or combination of deficiencies, in internal control over financial reporting, such that there is a reasonable possibility that a material misstatement of the annual or interim financial statements would not be prevented or detected on a timely basis. The following material weaknesses were identified in the Companys internal control over financial reporting:\n● The Companys control environment failed to demonstrate a commitment to attract, develop, and retain competent individuals in the area of internal control over financial reporting. The material weakness did not result in a misstatement.\n● The Company failed to design and maintain effective controls over segregation of duties with respect to the review, posting and approval of journal entries. The material weakness did not result in a misstatement.\n● The Company failed to design and maintain effective controls over the timely preparation and review of account reconciliations. The material weakness did not result in a misstatement.\n● The Company failed to fully evaluate ASU2016-13 and the quantitative impacts of the adoption of that standard. The standard was to be adopted as of July 1, 2023 and would not have impacted financial results as of June 30, 2023. As such, the material weakness did not result in a misstatement.\nAttestation Report of the Registered Public Accounting Firm\nThis report does not include an attestation report of the Companys independent registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by the Companys independent registered public accounting firm pursuant to the rules of the SEC that permit the Company to provide only the managements report in this report.\nChanges in Internal Control Over Financial Reporting\nDuring the quarter ended June 30, 2023, there were no changes in the Companys internal control over financial reporting that have materially affected, or are reasonably likely to materially affect, the Companys internal control over financial reporting. The Company appointed a new President and Chief Executive Officer on January 1, 2023 and a new Chief Financial Officer and Treasurer on April 17, 2023 and the Companys management intends to continue to develop and implement its internal controls over financial reporting. Management is currently working on new and enhanced controls, however, the controls have not been designed and/or operated for a sufficient amount of time to conclude that the material weaknesses have been remediated. We will continue to monitor the effectiveness of these controls and will make any further changes management determines appropriate. ITEM 9B.Other Information\nNone.\nITEM 9C.Disclosure Regarding Foreign Jurisdictions That Prevent Inspections\nNot applicable.\nPART III ITEM 10.Directors, Executive Officers and Corporate Governance\nThe information relating to the directors and officers of the Company, information regarding compliance with Section 16(a) of the Exchange Act and information regarding the audit committee and audit committee financial expert is incorporated herein by reference to the Companys Definitive Proxy Statement for the 2023 Annual Meeting of Stockholders (the Proxy Statement) under the captions Proposal 1-Election of Directors, Executive Officers, Section 16(a) Beneficial Ownership Reporting Compliance, Nominating Committee Procedures-Procedures to be Followed by Stockholders, Corporate Governance-Committees of the Board of Directors and -Audit Committee is incorporated herein by reference.\nThe Company has adopted a code of ethics that applies to its principal executive officer, the principal financial officer and principal accounting officer. The Code of Ethics is posted on the Van Wert Federals Internet Web site. ITEM 11.Executive Compensation\nThe information regarding executive compensation, compensation committee interlocks and insider participation is incorporated herein by reference to the Proxy Statement under the captions Executive Officers-Executive Compensation and Director Compensation. ITEM 12.Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\n(a) Securities Authorized for issuance under Stock-Based Compensation Plans\nNone.\n(b) Security Ownership of Certain Beneficial Owners\nInformation required by this item is incorporated herein by reference to the section captioned Stock Ownership in the Proxy Statement.\n(c) Security Ownership of Management\nInformation required by this item is incorporated herein by reference to the section captioned Stock Ownership in the Proxy Statement.\n(d) Changes in Control\nManagement of the Company knows of no arrangements, including any pledge by any person or securities of the Company, the operation of which may at a subsequent date result in a change in control of the registrant. ITEM 13.Certain Relationships and Related Transactions, and Director Independence\nThe information relating to certain relationships and related transactions and director independence is incorporated herein by reference to the Proxy Statement under the captions Transactions with Related Persons and Proposal 1 - Election of Directors. ITEM 14.Principal Accountant Fees and Services\nThe information relating to the principal accounting fees and expenses is incorporated herein by reference to the Proxy Statement under the captions Proposal III-Ratification of Independent Registered Public Accounting Firm-Audit Fees and -Pre-Approval of Services by the Independent Registered Public Accounting Firm.\nPART IV ITEM 15.Exhibits and Financial Statement Schedules\n3.1\nArticles of Incorporation of VWF Bancorp, Inc. (incorporated by reference to Exhibit 3.1 of the Companys Registration Statement on Form S-1 filed March 11, 2022)\n3.2\nBylaws of VWF Bancorp, Inc. (incorporated by reference to Exhibit 3.2 of the Companys Registration Statement on Form S-1 filed March 11, 2022)\n4.1\nForm of Common Stock Certificate of VWF Bancorp, Inc. (incorporated by reference to Exhibit 4 of the Companys Registration Statement on Form S-1 filed March 11, 2022)\n4.2\nDescription of Securities of VWF Bancorp, Inc. Registered Under Section 12 of the Securities Exchange Act of 1934 (incorporated by reference to Exhibit 4.2 of the Companys Annual Report on Form 10-K filed September 28, 2022)\n10.1\nExecutive Agreement with Gary L. Clay (incorporated by reference to Exhibit 10.2 of the Companys Current Report on Form 8-K filed July 18, 2022)\n10.2\nSalary Continuation Agreement for Gary L. Clay (incorporated by reference to Exhibit 10.7 of the Companys Registration Statement on Form S-1 filed March 11, 2022)\n10.3\nVan Wert Federal Savings Bank Split Dollar Life Insurance Plan (incorporated by reference to Exhibit 10.5 of the Companys Registration Statement on Form S-1 filed March 11, 2022)\n10.4\nForm of Van Wert Federal Savings Bank Split Dollar Life Insurance Plan Participation Agreement for Certain Executive Officers and Directors (incorporated by reference to Exhibit 10.6 of the Companys Registration Statement on Form S-1 filed March 11, 2022)\n10.5\nEmployment Agreement with Michael D. Cahill (incorporated by reference to Exhibit 10.2 of the Companys Current Report on Form 8-K filed October 3, 2022)\n10.6\nEmployment Agreement with Richard W. Brackin (incorporated by reference to Exhibit 10.1 of the Companys Current Report on Form 8-K filed April 21, 2023\n10.7\nChange in Control Agreement with Andrew D. Holy (incorporated by reference to Exhibit 10.1 of the Companys Current Report on Form 8-K filed August 1, 2023)\n21.1\nSubsidiaries of VWF Bancorp, Inc. (incorporated by reference to Exhibit 21 of the Companys Registration Statement on Form S-1 filed March 11, 2022)\n31.1*\nCertification of President and Chief Executive Officer pursuant to Rule 13a-14(a) of the Securities Exchange Act of 1934, as amended, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n31.2*\nCertification of Chief Financial Officer pursuant to Rule 13a-14(a) of the Securities Exchange Act of 1934, as amended, as adopted pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n32.1*\nCertification of President and Chief Executive Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n32.2*\nCertification of Chief Financial Officer pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\nThe following materials from the Companys Annual Report on Form 10-K for the fiscal year ended June 30, 2022, formatted in XBRL: (i) Balance Sheets, (ii) Statements of Operations, (iii) Statements of Comprehensive Income (Loss), (iv) Changes in Stockholders Equity, (v) Statements of Cash Flows and (vi) Notes to the Financial Statements (embedded within the Inline XBRL document)\nCover Page Interactive Data File (embedded within the Inline XBRL document)\n* Filed concurrently herewith\nIndicates a management contract or compensatory plan or arrangement\nITEM 16.Form 10-K Summary\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nVWF BANCORP, INC.\nDate: October 6, 2023\nBy:\n/s/ Michael D. Cahill\nMichael D. Cahill\nPresident and Chief Executive Officer\n(Duly Authorized Representative)\nPursuant to the requirements of the Securities Exchange of 1934, this report has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated.\nSignatures\nTitle\nDate\n/s/ Michael D. Cahill\nDirector, President and Chief Executive Officer\n(Principal Executive Officer)\nOctober 6, 2023\nMichael D. Cahill\n/s/ Richard W. Brackin\nTreasurer and Chief Financial Officer\n(Principal Financial and Accounting Officer)\nOctober 6, 2023\nRichard W. Brackin\n/s/ Gary L. Clay\nDirector (Chairman of the Board)\nOctober 6, 2023\nGary L. Clay\n/s/ Jon Bagley\nDirector\nOctober 6, 2023\nJon Bagley\n/s/ Charles F. Koch\nDirector\nOctober 6, 2023\nCharles F. Koch\n/s/ Michael Keysor\nDirector\nOctober 6, 2023\nMichael Keysor\n/s/ Thomas Turnwald\nDirector\nOctober 6, 2023\nThomas Turnwald"
}