{
    "cik": "1916879",
    "company": "VECTOR 21 HOLDINGS, INC.",
    "filing_type": "10-K",
    "filing_date": "2023-10-30",
    "period_of_report": "2023-06-30",
    "sic": "6770",
    "state_of_inc": "DE",
    "state_location": "CO",
    "fiscal_year_end": "0630",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1916879/0001065949-23-000084-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1916879/000106594923000084/vhld-20230630.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1916879/0001065949-23-000084.txt",
    "filename": "1916879_10K_2023_0001065949-23-000084.htm",
    "content": "ITEM 1. BUSINESS.\nGENERAL\nThe following is a summary of some of the information contained in this document. Unless the context requires otherwise, references in this document to our Company, us, we, our, or the Company are to Vector 21 Holdings, Inc.\nDESCRIPTION OF BUSINESS\nVector 21 Holdings, Inc., a Delaware corporation, (Vector 21, the Company, We\", \"Us\" or Our) is a publicly quoted shell company seeking to merge with an entity with experienced management and opportunities for growth in return for shares of our common stock to create values for our shareholders. No potential merger candidate has been identified at this time.\nVector 21 was incorporated in Delaware on March 5, 2021.\nIMPACT OF COVID-19\nWe have only limited operations at this time and consequently have not been directly impacted by the COVID-19 outbreak at this time. However, the detrimental effect of the COVID-19 outbreak on the economy as a whole may have a detrimental impact on our ability to raise funding and commence operations for the foreseeable future.\nIMPACT OF UKRAINIAN CONFLICT\nWe have not commenced operations as yet and consequently have not been directly impacted by the Ukrainian conflict at this time currently, we do not believe that the conflict between Ukraine and Russia will have any direct impact on our operations, financial condition or financial reporting. We believe the conflict will have only a general impact on our operations in the same manner as it is having a general impact on all business operations resulting from international sanction and embargo regulations, possible shortages of goods and goods incorporating parts that may be supplied from the Ukraine or Russia, supply chain challenges, and the international and domestic inflationary results of the conflict and government spending for and funding of their response. We do not believe we will be targeted for cyber-attacks. We have no operations in the countries directly involved in the conflict or that are specifically impacted by any of the sanctions and embargoes, we do not believe that the conflict will have any impact on our internal control over financial reporting. Other than general securities market trends, we do not have reason to believe that investors will evaluate the company as having special risks or exposures related to the Ukrainian conflict.\nREPORT TO SECURITY HOLDERS\nUpon effectiveness of this Registration Statement, we will be subject to the reporting requirements of Section 12(g) of the Exchange Act, and as such, we intend to file all required disclosures.\nYou may read and copy any materials we file with the SEC in the SECs Public Reference Section, Room 1580, 100 F Street N.E., Washington, D.C. 20549. You may obtain information on the operation of the Public Reference Section by calling the SEC at 1-800-SEC-0330. Additionally, the SEC maintains an Internet site that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC, which can be found at http://www.sec.gov.\nJUMPSTART OUR BUSINESS STARTUPS ACT\nWe qualify as an emerging growth company as defined in Section 101 of the Jumpstart our Business Startups Act (JOBS Act) as we did not have more than $1.07 billion in annual gross revenues and did not have such amount as of June 30, 2023, our last fiscal year.\nWe may lose our status as an emerging growth company on the last day of our fiscal year during which (i) our annual gross revenue exceeds $1.07 billion or (ii) we issue more than $1.0 billion in non-convertible debt in a three-year period. We will lose our status as an emerging growth company if at any time we are deemed to be a large accelerated filer. We will lose our status as an emerging growth company on the last day of our fiscal year following the fifth anniversary of the date of the first sale of common equity securities pursuant to an effective registration statement.\nAs an emerging growth company, we may take advantage of specified reduced reporting and other burdens that are otherwise applicable to generally reporting companies. These provisions include:\n- A requirement to have only two years of audited financial statement and only two years of related Management Discussion and Analysis Disclosures:\n- Reduced disclosure about the emerging growth companys executive compensation arrangements; and\n- No non-binding advisory votes on executive compensation or golden parachute arrangements.\nAs an emerging growth company, we are exempt from Section 404(b) of the Sarbanes-Oxley Act of 2002 and Section 14A(a) and (b) of the Securities Exchange Act of 1934. Such sections are provided below:\nSection 404(b) of the Sarbanes-Oxley Act of 2002 requires a public companys auditor to attest to, and report on, managements assessment of its internal controls.\nSections 14A(a) and (b) of the Securities and Exchange Act, implemented by Section 951 of the Dodd-Frank Act, require companies to hold shareholder advisory votes on executive compensation and golden parachute compensation.\nWe have already taken advantage of these reduced reporting burdens in this Form 10-K, which are also available to us as a smaller reporting company as defined under Rule 12b-2 of the Securities Exchange Act of 1934, as amended (the Exchange Act).\nAs long as we qualify as an emerging growth company, we will not be required to comply with the requirements of Section 404(b) of the Sarbanes-Oxley Act of 2002 and Section 14A(a) and (b) of the Securities Exchange Act of 1934.\nIn addition, Section 107 of the JOBS Act also provides that an emerging growth company can take advantage of the extended transition period provided in Section 7(a)(2)(B) of the Securities Act of 1933, as amended (the Securities Act) for complying with new or revised accounting standards. We are choosing to irrevocably opt in to the extended transition period for complying with new or revised accounting standards under Section 102(b)(2) of the JOBS Act.\nCURRENT BUSINESS\nVector 21 Holdings, Inc., a Delaware corporation, (Vector 21, the Company, We\", \"Us\" or Our) is a publicly quoted shell company seeking to merge with an entity with experienced management and opportunities for growth in return for shares of our common stock to create values for our shareholders. No potential merger candidate has been identified at this time.\nHistory\nVector 21 was incorporated in Delaware on March 5, 2021.\nEffective April 28, 2021, following a corporate reorganization as described below (‘the Holding Company Reorganization or ‘the reverse recapitalization), Vector 21 became the reorganized successor to Momentum Biofuels, Inc. (Predecessor Company), a publicly quoted holding company that ceased trading in 2012.\nReorganization into a Holding Company Structure for Vector 21 Holdings, Inc., reorganization successor to Momentum Biofuels, Inc.\nEffective March 10, 2021, Momentum Biofuels, Inc. (Momentum Biofuels Colorado), a Colorado corporation, redomiciled to Delaware by merging with its wholly owned subsidiary, Momentum Biofuels, Inc., a Delaware corporation.\nMomentum Biofuels Colorado ceased to exist as an independent legal entity following its merger with Momentum Biofuels Delaware.\nPursuant to the Delaware Holding Company formation statute, DGCL Section 251(g), Momentum Biofuels Delaware entered into an Agreement and Plan of Merger and Reorganization into a Holding Company with Vector 21 Holdings, Inc. (Vector 21) and MBF Ops, Inc. (MBF Ops.), both wholly-owned subsidiaries of Momentum Biofuels Delaware, effective April 28, 2021.\nThe Agreement and Plan of Merger and Reorganization into a Holding Company provided for the merger of Momentum Biofuels Delaware with, and into MBF Ops., with MBF Ops. being the surviving corporation in the merger, as a subsidiary to Vector 21.\nMomentum Biofuels Delaware ceased to exist as an independent legal entity following its merger with MBF Ops.\nThe shareholders of Momentum Biofuels Delaware were converted, by the holding company reorganization, under the Agreement, to shareholders of Vector 21 on a one for one basis pursuant to the Agreement and the Delaware Statute Sec. 251(g).\nMBF Ops., the surviving company of the merger with Momentum Biofuels Delaware, became a wholly-owned subsidiary of Vector 21, the holding company.\nVector 21 became the parent holding company resulting under the Agreement, pursuant to Delaware General Corporation Law section 251(g), with its wholly owned subsidiary company, MBF Ops, the surviving company of the merger with Momentum Biofuels Delaware.\nAs a result of the Holding Company Reorganization, shareholders in the publicly quoted Momentum Biofuels Delaware, formerly the shareholders of Momentum Biofuels Colorado as of the date of the reorganization, became shareholders in the publicly quoted Vector 21.\nMBF Ops, being the direct successor by the merger with Momentum Biofuels Delaware, became a subsidiary company of Vector 21.\nDisposal of MBF Ops.\nEffective June 28, 2021, Vector 21 disposed of 100% of the issued share capital of its sole subsidiary company, MBF Ops., to an unrelated third party. We made a $1,000 payment in cash to the Purchaser as an incentive to assume ownership and the Board authorized and approved to issue 50,000 (post-split) shares of our common stock to MBF Ops, Inc. as additional capital in the former subsidiary company which had no ongoing business or assets at the time of divestiture. These shares of common stock were approved in Board Minutes. The shares were issued in August 2021.\nThe Holding Company Reorganization has been accounted for so as to reflect the fact that both Momentum Biofuels Delaware and Vector 21 were under common control at the date of the Holding Company Reorganization.\nReverse and Forward Stock Splits\nEffective May 13, 2021, we completed:\n- a reverse stock split of our outstanding common stock, $0.0001 par value, on a one (1) post-split share for eight thousand (8,000) pre-split shares basis, and subsequently\n- a forward stock split of our post reverse split outstanding common stock, $0.0001 par value, on a one hundred (100) post-split shares for one (1) pre-split share basis.\nAs a result of the one (1) for eight thousand (8,000) reverse stock split described above, the number of issued and outstanding shares of the Companys common stock was reduced from 123,224,444 to 15,403. No fractional shares were issued in connection with the reverse stock split. Instead, a holder of record of common stock who would otherwise be entitled to a fraction of a share was, in lieu thereof, entitled to receive a whole share of common stock. Consequently 1,069 additional shares were issued in respect of fractional shares and therefore a total of 16,472 shares of common stock were issued and outstanding after the reverse split.\nAs a result of the one hundred (100) post-split shares for one (1) forward stock split described above, the number of issued and outstanding shares of the Companys common stock was increased from 16,472 to 1,647,200.\nA total of 1,697,200 shares of common stock are currently outstanding on the date of the filing.\nGeneral Business Plan\nOur business plan to seek a merger has many uncertainties which pose risks to investors.\nWe intend to seek, investigate and, if such investigation warrants, acquire an interest in business opportunities presented to us by persons or firms which desire to seek the advantages of an issuer who has complied with the Securities Act of 1934 (the 1934 Act). We will not restrict our search to any specific business, industry or geographical location, and we may participate in business ventures of virtually any nature. This discussion of our proposed business is purposefully general and is not meant to be restrictive of our unlimited discretion to search for and enter into potential business opportunities. We anticipate that we may be able to participate in only one potential business venture because of our lack of financial resources. We may seek a business opportunity with entities which have recently commenced operations, or that desire to utilize the public marketplace in order to raise additional capital in order to expand into new products or markets, to develop a new product or service, or for other corporate purposes. All of these activities have risk to investors including dilution and management.\nWe expect that the selection of a business opportunity will be complex. Due to general economic conditions, rapid technological advances being made in some industries and shortages of available capital, we believe that there are numerous firms seeking the benefits of an issuer who has complied with the 1934 Act. Such benefits may include facilitating or improving the terms on which additional equity financing may be sought, providing liquidity for incentive stock options or similar benefits to key employees, providing liquidity (subject to restrictions of applicable statutes) for all stockholders and other factors. Potentially, available business opportunities may occur in many different industries and at various stages of development, all of which will make the task of comparative investigation and analysis of such business opportunities extremely difficult and complex. We have, and will continue to have, essentially no assets to provide the owners of business opportunities. However, we will be able to offer owners of acquisition candidates the opportunity to acquire a controlling ownership interest in an issuer who has complied with the 1934 Act without incurring the cost and time required to conduct an initial public offering.\nThe analysis of new business opportunities will be undertaken by, or under the supervision of, our Board of Directors. We intend to concentrate on identifying preliminary prospective business opportunities which may be brought to our attention through present associations of our director, professional advisors or by our stockholders. In analyzing prospective business opportunities, we will consider such matters as (i) available technical, financial and managerial resources; (ii) working capital and other financial requirements; (iii) history of operations, if any, and prospects for the future; (iv) nature of present and expected competition; (v) quality, experience and depth of management services; (vi) potential for further research, development or exploration; (vii) specific risk factors not now foreseeable but that may be anticipated to impact the proposed activities of the company; (viii) potential for growth or expansion; (ix) potential for profit; (x) public recognition and acceptance of products, services or trades; (xi) name identification; and (xii) other factors that we consider relevant. As part of our investigation of the business opportunity, we expect to meet personally with management and key personnel. To the extent possible, we intend to utilize written reports and personal investigation to evaluate the above factors.\nWe will not acquire or merge with any company for which audited financial statements cannot be obtained within a reasonable period of time after closing of the proposed transaction, as required by SEC Rules and Regulations.\nAcquisition Interest\nIn implementing a structure for a particular business acquisition, we may become a party to a merger, consolidation, reorganization, joint venture, or licensing agreement with another company or entity. We may also acquire stock or assets of an existing business. Upon consummation of a transaction, it is probable that our present management and stockholders will no longer be in control of us. In addition, our directors may, as part of the terms of the acquisition transaction, resign and be replaced by new directors without a vote of our stockholders, or sell their stock in us. Any such sale will only be made in compliance with the securities laws of the United States and any applicable state.\nIt is anticipated that any securities issued in any such reorganization would be issued in reliance upon exemption from registration under application federal and state securities laws. In some circumstances, as a negotiated element of the transaction, we may agree to register all or a part of such securities immediately after the transaction is consummated or at specified times thereafter. If such registration occurs, it will be undertaken by the surviving entity after it has successfully consummated a merger or acquisition and is no longer considered an inactive company.\nThe issuance of substantial additional securities and their potential sale into any trading market which may develop in our securities may have a depressive effect on the value of our securities in the future. There is no assurance that such a trading market will develop.\nWhile the actual terms of a transaction cannot be predicted, it is expected that the parties to any business transaction will find it desirable to avoid the creation of a taxable event and thereby structure the business transaction in a so-called tax-free reorganization under Sections 368(a)(1) or 351 of the Internal Revenue Code (the Code). In order to obtain tax-free treatment under the Code, it may be necessary for the owner of the acquired business to own 80% or more of the voting stock of the surviving entity. In such event, our stockholders would retain less than 20% of the issued and outstanding shares of the surviving entity. This would result in significant dilution in the equity of our stockholders.\nWith respect to any merger or acquisition, and depending upon, among other things, the target companys assets and liabilities, our stockholders will in all likelihood hold a substantially lesser percentage ownership interest in us following any merger or acquisition. The percentage ownership may be subject to significant reduction in the event we acquire a target company with assets and expectations of growth. Any merger or acquisition can be expected to have a significant dilutive effect on the percentage of shares held by our stockholders.\nWe will participate in a business opportunity only after the negotiation and execution of appropriate written business agreements. Although the terms of such agreements cannot be predicted, generally we anticipate that such agreements will (i) require specific representations and warranties by all of the parties; (ii) specify certain events of default; (iii) detail the terms of closing and the conditions which must be satisfied by each of the parties prior to and after such closing; (iv) outline the manner of bearing costs, including costs associated with the Companys attorneys and accountants; (v) set forth remedies on defaults; and (vi) include miscellaneous other terms.\nAs stated above, we will not acquire or merge with any entity which cannot provide independent audited financial statements within a reasonable period of time after closing of the proposed transaction. If such audited financial statements are not available at closing, or within time parameters necessary to insure our compliance within the requirements of the 1934 Act, or if the audited financial statements provided do not conform to the representations made by that business to be acquired, the definitive closing documents will provide that the proposed transaction will be voidable, at the discretion of our present management. If such transaction is voided, the definitive closing documents will also contain a provision providing for reimbursement for our costs associated with the proposed transaction.\nCompetition\nWe believe we are an insignificant participant among the firms which engage in the acquisition of business opportunities. There are many established venture capital and financial concerns that have significantly greater financial and personnel resources and technical expertise than we have. In view of our limited financial resources and limited management availability, we will continue to be at a significant competitive disadvantage compared to our competitors.\nInvestment Company Act 1940\nAlthough we will be subject to regulation under the Securities Act of 1933, as amended, and the 1934 Act, we believe we will not be subject to regulation under the Investment Company Act of 1940 (the 1940 Act) insofar as we will not be engaged in the business of investing or trading in securities. In the event we engage in business combinations that result in us holding passive investment interests in a number of entities, we could be subject to regulation under the 1940 Act. In such event, we would be required to register as an investment company and incur significant registration and compliance costs. We have obtained no formal determination from the SEC as to our status under the 1940 Act and, consequently, any violation of the 1940 Act would subject us to material adverse consequences. We believe that, currently, we are exempt under Regulation 3a-2 of the 1940 Act.\nIntellectual Property\nWe have not and do not own any intellectual property.\nEmployees\nWe presently have no full-time executive, operational or clerical staff.\nWe operate with three directors and two officers who provide their services to us on a part time basis:\nCalvin D. Smiley, Sr. is our Chief Executive Officer, President, Acting Chief Financial Officer and a director;\nMichael A. Littman is our secretary and director; and\nRedgie Green is a director.\nRevenue\nWe have not recorded any revenues for the years ended June 30, 2023 and 2022 through the date of the filing.\nFactors Effecting Future Performance\nOur goal is to obtain debt and/or equity finance to meet our ongoing operating expenses and attempt to merge with another entity with experienced management and opportunities for growth in return for shares of our common stock to create value for our shareholders.\nAlthough there is no assurance that this series of events will be successfully completed, we believe we can successfully complete an acquisition or merger which will enable us to continue as a going concern.\nAny acquisition or merger will most likely be dilutive to our existing stockholders.\nThe factors affecting our future performance are listed and explained below under the section Risk Factors below: ITEM 1A. RISK FACTORS.\nFORWARD LOOKING STATEMENTS\nTHIS DOCUMENT INCLUDES FORWARD-LOOKING STATEMENTS, INCLUDING, WITHOUT LIMITATION, STATEMENTS RELATING TO VECTORS PLANS, STRATEGIES, OBJECTIVES, EXPECTATIONS, INTENTIONS AND ADEQUACY OF RESOURCES. THESE FORWARD-LOOKING STATEMENTS INVOLVE KNOWN AND UNKNOWN RISKS, UNCERTAINTIES, AND OTHER FACTORS THAT MAY CAUSE OUR COMPANYS ACTUAL RESULTS, PERFORMANCE OR ACHIEVEMENTS TO BE MATERIALLY DIFFERENT FROM ANY FUTURE RESULTS, PERFORMANCE OR ACHIEVEMENTS EXPRESSED OR IMPLIED BY THE FORWARD-LOOKING STATEMENTS. THESE FACTORS INCLUDE, AMONG OTHERS, THE FOLLOWING: OUR ABILITY TO IMPLEMENT OUR BUSINESS STRATEGY; ABILITY TO OBTAIN ADDITIONAL FINANCING; VECTORS LIMITED OPERATING HISTORY; UNKNOWN LIABILITIES ASSOCIATED WITH FUTURE ACQUISITIONS; ABILITY TO MANAGE GROWTH; SIGNIFICANT COMPETITION; ABILITY TO ATTRACT AND RETAIN TALENTED EMPLOYEES; AND FUTURE GOVERNMENT REGULATIONS; AND OTHER FACTORS DESCRIBED IN THIS FILING OR IN OTHER VECTOR FILINGS WITH THE SECURITIES AND EXCHANGE COMMISSION. SAXON IS UNDER NO OBLIGATION TO PUBLICLY UPDATE OR REVISE ANY FORWARD-LOOKING STATEMENTS, WHETHER AS A RESULT OF NEW INFORMATION, FUTURE EVENTS OR OTHERWISE.\nOur plan of operation is to obtain debt or equity finance to meet our ongoing operating expenses and attempt to relist our shares of common stock on the Pink Sheets and then merge with another entity with experienced management and opportunities for growth in return for shares of our common stock to create value for our shareholders. There can be no assurance that any of the events can be successfully completed, that our shares of common stock will be relisted on the Pink Sheets, any such business will be identified or that any stockholder will realize any return on their shares after such a transaction has been completed. In particular, there is no assurance that any such business\nwill be located or that any stockholder will realize any return on their shares after such a transaction. Any merger or acquisition completed by us can be expected to have a significant dilutive effect on the percentage of shares held by our current stockholders.\nWe believe we are an insignificant participant among the firms which engage in the acquisition of business opportunities. There are many established venture capital and financial concerns that have significantly greater financial and personnel resources and technical expertise than we have. In view of our limited financial resources and limited management availability, we will continue to be at a significant competitive disadvantage compared to our competitors.\nYou should be aware that there are various risks associated with our business, including the risks discussed below. You should carefully consider these risk factors, as well as the other information contained in this Annual Report, in evaluating our business and us.\nOur business is to seek to raise the debt and, or, equity to meet our ongoing operating expenses and attempt to relist our shares of common stock on the Pink Sheets and to merge with another entity with experienced management and opportunities for growth in return for shares of our common stock to create value for our shareholders. There can be no assurance that this series of events will be successfully completed or that any stockholder will realize any return on their shares after the new business plan has been implemented.\nRISK FACTORS RELATING TO OUR COMPANY\nWE HAVE A SHAREHOLDERS DEFICIT, HAVE INCURRED SIGNIFICANT LOSSES AND ANTICIPATE FUTURE LOSSES\nDuring the year ended June 30, 2023, we incurred losses of $34,269, resulting in an accumulated deficit of $17,764,968 and a stockholders deficit of $91,726.\nFuture losses are likely to occur as, until we have opportunities for growth in return for shares of our common stock to create value for our shareholders as we have no sources of income to meet our operating expenses. As a result of these, among other factors, we received from our registered independent public accountants in their report for the financial statements for the year ended June 30, 2023, an explanatory paragraph stating that there is substantial doubt about our ability to continue as a going concern.\nOUR EXISTING FINANCIAL RESOURCES ARE INSUFFICIENT TO MEET OUR ONGOING OPERATING EXPENSES\nWe have no sources of income at this time and no existing cash balances to meet our ongoing operating expenses. In the short term, unless we are able to raise additional debt and/or equity we shall be unable to meet our ongoing operating expenses. On a longer-term basis, we intend to raise the debt and/or equity to meet our ongoing operating expenses and merge with another entity with experienced management and opportunities for growth in return for shares of our common stock to create value for our shareholders. There can be no assurance that this series of events will be successfully completed.\nWE INTEND TO PURSUE THE ACQUISITION OF AN OPERATING BUSINESS\nOur sole strategy is to acquire an operating business. Successful implementation of this strategy depends on our ability to identify a suitable acquisition candidate, acquire such company on acceptable terms and integrate its operations. In pursuing acquisition opportunities, we compete with other companies with similar strategies. Competition for acquisition targets may result in increased prices of acquisition targets and a diminished pool of companies available for acquisition. Acquisitions involve a number of other risks, including risks of acquiring undisclosed or undesired liabilities, acquired in-process technology, stock compensation expense, diversion of management attention, potential disputes with the seller of one or more acquired entities and possible failure to retain key acquired personnel. Any acquired entity or assets may not perform relative to our expectations. Our ability to meet these challenges has not been established.\nSCARCITY OF, AND COMPETITION FOR, BUSINESS OPPORTUNITIES AND COMBINATIONS\nWe believe we are an insignificant participant among the firms which engage in the acquisition of business opportunities. There are many established venture capital and financial concerns that have significantly greater financial and personnel resources and technical expertise than we have. Nearly all such entities have significantly greater financial resources, technical expertise and managerial capabilities than us and, consequently, we will be at a competitive disadvantage in identifying possible business opportunities and successfully completing a business combination. Moreover, we will also compete in seeking merger or acquisition candidates with numerous other small public companies. In view of our limited financial resources and limited management availability, we will continue to be at a significant competitive disadvantage compared to our competitors.\nWE HAVE NOT EXECUTED ANY FORMAL AGREEMENT FOR A BUSINESS COMBINATION OR OTHER TRANSACTION AND HAVE ESTABLISHED NO STANDARDS FOR BUSINESS COMBINATIONS\nWe have not executed any formal arrangement, agreement or understanding with respect to engaging in a merger with, joint venture with or acquisition of a private or public entity. There can be no assurance that we will be successful in identifying and evaluating suitable business opportunities or in concluding a business combination. We have not identified any particular industry or specific business within an industry for evaluation. There is no assurance we will be able to negotiate a business combination on terms favorable, if at all. We have not established a specific length of operating history or specified level of earnings, assets, net worth or other criteria which we will require a target business opportunity to have achieved, and without which we would not consider a business combination. Accordingly, we may enter into a business combination with a business opportunity having no significant operating history, losses, limited or no potential for earnings, limited assets, negative net worth or other negative characteristics.\nWE MAY BE NEGATIVELY AFFECTED BY THE COVID-19 PANDEMIC\nWe have not commenced operations as yet and consequently have not been directly impacted by the Covid-19 outbreak at this time. However, the detrimental effect of the Covid-19 outbreak on the economy as a whole may have a detrimental impact on our ability to raise funding and identify an entity to merge with for the foreseeable future. We are unable to predict with any certainty the ultimate impact Covid-19 outbreak on our plans at this time.\nWE MAY BE NEGATIVELY AFFECTED BY ADVERSE GENERAL ECONOMIC CONDITIONS\nCurrent conditions in domestic and global economies are extremely uncertain. Adverse changes may occur as a result of softening global economies, wavering consumer confidence caused by the threat of terrorism and war, and other factors capable of affecting economic conditions. Such changes could have a material adverse effect on our business, financial condition, and results of operations.\nBECAUSE OUR PRINCIPAL SHAREHOLDER CONTROLS OUR ACTIVITIES, HE MAY CAUSE US TO ACT IN A MANNER THAT IS MOST BENEFICIAL TO HIMSELF AND NOT TO OTHER SHAREHOLDERS WHICH COULD CAUSE US NOT TO TAKE ACTIONS THAT OUTSIDE INVESTORS MIGHT VIEW FAVORABLY.\nOur principal shareholder owns approximately 56% of our outstanding common stock. As a result, he effectively controls all matters requiring stockholder approval, including the election of directors, the approval of significant corporate transactions, such as mergers and related party transaction. This insider also has the ability to delay or perhaps even block, by his ownership of our stock, an unsolicited tender offer. This concentration of ownership could have the effect of delaying, deterring or preventing a change in control of our Company that you might view favorably.\nOUR DIRECTORS MAY HAVE CONFLICTS OF INTEREST WHICH MAY NOT BE RESOLVED FAVORABLY TO US.\nCertain conflicts of interest may exist between our directors and us. Our Directors have other business interests to which they devote their attention and may be expected to continue to do so although management time should be devoted to our business. As a result, conflicts of interest may arise that can be resolved only through exercise of such judgment as is consistent with fiduciary duties to us. See \"Directors and Executive Officers\" (page 32 below), and \"Conflicts of Interest.\" (Page 33 below).\nWE MAY DEPEND UPON OUTSIDE ADVISORS; WHO MAY NOT BE AVAILABLE ON REASONABLE TERMS AND AS NEEDED.\nTo supplement the business experience of our officers and directors, we may be required to employ accountants, technical experts, appraisers, attorneys, or other consultants or advisors. Our Board without any input from stockholders will make the selection of any such advisors. Furthermore, it is anticipated that such persons may be engaged on an \"as needed\" basis without a continuing fiduciary or other obligation to us. In the event we consider it necessary to hire outside advisors, we may elect to hire persons who are affiliates, if they are able to provide the required services.\nWE ARE A REPORTING COMPANY.\nWe are subject to the reporting requirements under the Securities and Exchange Act of 1934, Section 13a, due to the effectiveness of our Registration Statement on Form 10 under Section 12(g) which became effective. As a result, stockholders will have access to the information required to be reported by publicly held companies under the Exchange Act and the regulations thereunder. As a result, we will be subject to legal and accounting expenses that private companies are not subject to and this could affect our ability to generate operating income.\nWE ARE AN EMERGING GROWTH COMPANY, AND ANY DECISION ON OUR PART TO COMPLY ONLY WITH CERTAIN REDUCED DISCLOSURE REQUIREMENTS APPLICABLE TO EMERGING GROWTH COMPANIES COULD MAKE OUR COMMON STOCK LESS ATTRACTIVE TO INVESTORS.\nWe are an emerging growth company, as defined in the JOBS Act, and, for as long as we continue to be an emerging growth company, we expect and fully intend to take advantage of exemptions from various reporting requirements applicable to other public companies but not to emerging growth companies, including, but not limited to, not being required to comply with the auditor attestation requirements of Section 404 of the Sarbanes-Oxley Act of 2002, reduced disclosure obligations regarding executive compensation in our periodic reports and proxy statements, and exemptions from the requirements of holding a nonbinding advisory vote on executive compensation and shareholder approval of any golden parachute payments not previously approved. We could be an emerging growth company for up to five years, or until the earliest of (i) the last day of the first fiscal year in which our annual gross revenues exceed $1.07 billion, (ii) the date that we become a large accelerated filer as defined in Rule 12b-2 under the Exchange Act, which would occur if the market value of our common stock that is held by non-affiliates exceeds $700 million as of the last business day of our most recently completed second fiscal quarter, or (iii) the date on which we have issued more than $1 billion in non-convertible debt during the preceding three year periods.\nIn addition, Section 107 of the JOBS Act also provides that an emerging growth company can take advantage of the extended transition period provided in Section 7(a)2(B) of the Securities Act for complying with new or revised accounting standards. In other words, an emerging growth company can delay the adoption of certain accounting standards until those standards would otherwise apply to private companies. We have elected to opt in to the extended transition period for complying with the revised accounting standards. We have elected to rely on these exemptions and reduced disclosure requirements applicable to emerging growth companies and expect to continue to do so.\nWE MAY NOT BE ABLE TO MEET THE FILING AND INTERNAL CONTROL REPORTING REQUIREMENTS IMPOSED BY THE SEC WHICH MAY RESULT IN A DECLINE IN THE PRICE OF OUR COMMON SHARES AND AN INABILITY TO OBTAIN FUTURE FINANCING.\nAs directed by Section 404 of the Sarbanes-Oxley Act, as amended by SEC Release No. 33-8934 on June 26, 2008, the SEC adopted rules requiring each public company to include a report of management on the companys internal controls over financial reporting in its annual reports. In addition, the independent registered public accounting firm auditing a companys financial statements may have to also attest to and report on managements assessment of the effectiveness of the companys internal controls over financial reporting. We may be required to include a report of management on its internal control over financial reporting. The internal control report must include a statement:\nOf managements responsibility for establishing and maintaining adequate internal control over its financial reporting;\nOf managements assessment of the effectiveness of its internal control over financial reporting as of year-end; and\nOf the framework used by management to evaluate the effectiveness of our internal control over financial reporting.\nFurthermore, our independent registered public accounting firm may be required to file its attestation on whether it believes that we have maintained, in all material respects, effective internal control over financial reporting.\nREPORTING REQUIREMENTS UNDER THE EXCHANGE ACT AND COMPLIANCE WITH THE SARBANES-OXLEY ACT OF 2002, INCLUDING ESTABLISHING AND MAINTAINING ACCEPTABLE INTERNAL CONTROLS OVER FINANCIAL REPORTING, ARE COSTLY AND MAY INCREASE SUBSTANTIALLY.\nThe rules and regulations of the SEC require a public company to prepare and file periodic reports under the Exchange Act, which will require that the Company engage legal, accounting, auditing and other professional services. The engagement of such services is costly. Additionally, the Sarbanes-Oxley Act of 2002 (the Sarbanes-Oxley Act) requires, among other things, that we design, implement and maintain adequate internal controls and procedures over financial reporting. The costs of complying with the Sarbanes-Oxley Act and the limited technically qualified personnel we have, may make it difficult for us to design, implement and maintain adequate internal controls over financial reporting. In the event that we fail to maintain an effective system of internal controls or discover material weaknesses in our internal controls, we may not be able to produce reliable financial reports or report fraud, which may harm our overall financial condition and result in loss of investor confidence and a decline in our share price.\nAs a public company, we will be subject to the reporting requirements of the Exchange Act, the Sarbanes-Oxley Act, the Dodd-Frank Act of 2010 and other applicable securities rules and regulations. Despite recent reforms made possible by the JOBS Act, compliance with these rules and regulations will nonetheless increase our legal and financial compliance costs, make some activities more difficult, time-consuming or costly and increase demand on our systems and resources, particularly after we are no longer an emerging growth company. The Exchange Act requires, among other things, that we file annual, quarterly, and current reports with respect to our business and operating results.\nWe are working with our legal, accounting and financial advisors to identify those areas in which changes should be made to our financial and management control systems to manage our growth and our obligations as a public company. These areas include corporate governance, corporate control, disclosure controls and procedures and financial reporting and accounting systems. We have made, and will continue to make, changes in these and other areas. However, we anticipate that the expenses that will be required in order to adequately prepare for being a public company could be material. We estimate that the aggregate cost of increased legal services; accounting and audit functions; personnel, such as a chief financial officer familiar with the obligations of public company reporting; consultants to design and implement internal controls; and financial printing alone will be a few hundred thousand dollars per year and could be several hundred thousand dollars per year. In addition, if and when we retain\nindependent directors and/or additional members of senior management, we may incur additional expenses related to director compensation and/or premiums for directors and officers liability insurance, the costs of which we cannot estimate at this time. We may also incur additional expenses associated with investor relations and similar functions, the cost of which we also cannot estimate at this time. However, these additional expenses individually, or in the aggregate, may also be material.\nIn addition, being a public company could make it more difficult or more costly for us to obtain certain types of insurance, including directors and officers liability insurance, and we may be forced to accept reduced policy limits and coverage or incur substantially higher costs to obtain the same or similar coverage. The impact of these events could also make it more difficult for us to attract and retain qualified persons to serve on our board of directors, our board committees or as executive officers.\nThe increased costs associated with operating as a public company may decrease our net income or increase our net loss and may cause us to reduce costs in other areas of our business or increase the prices of our products or services to offset the effect of such increased costs. Additionally, if these requirements divert our managements attention from other business concerns, they could have a material adverse effect on our business, financial condition and results of operations.\nTHE JOBS ACT ALLOWS US TO DELAY THE ADOPTION OF NEW OR REVISED ACCOUNTING STANDARDS THAT HAVE DIFFERENT EFFECTIVE DATES FOR PUBLIC AND PRIVATE COMPANIES.\nSince we have elected to use the extended transition period for complying with new or revised accounting standards under Section 102(b)(1) of the JOBS Act, this election allows us to delay the adoption of new or revised accounting standards that have different effective dates for public and private companies until those standards apply to private companies. As a result of this election, our financial statements may not be comparable to companies that comply with public company effective dates.\nWE HAVE A MATERIAL WEAKNESS IN OUR CONTROLS AND PROCEDURES\nWe have conducted an evaluation of our internal control over financial reporting based on the framework in Internal Control Integrated Framework issued by the Committee of Sponsoring Organizations for the Treadway Commission (COSO) and published in 2013, and subsequent guidance prepared by COSO specifically for smaller public companies. Based on that evaluation, management concluded that our internal control over financial reporting was not sufficient as of June 30, 2023, for the reasons discussed below:\nA significant deficiency is a deficiency, or combination of deficiencies in internal control over financial reporting, that adversely affects the entitys ability to initiate, authorize, record, process, or report financial data reliably in accordance with generally accepted accounting principles such that there is more than a remote likelihood that a misstatement of the entitys financial statements that is more than inconsequential will not be prevented or detected by the entitys internal control.\nA material weakness is a deficiency or a combination of deficiencies in internal control over financial reporting such that there is a reasonable possibility that a material misstatement of the annual or interim consolidated financial statements will not be prevented or detected on a timely basis.\nManagement identified the following material weakness and significant deficiencies in its assessment of the effectiveness of internal control over financial reporting as of June 30, 2023:\n● The Company did not maintain effective controls over certain aspects of the financial reporting process because we lacked personnel with accounting expertise to meet our financial reporting requirements.\n● Material Weakness - Inadequate segregation of duties.\nThe management of the Company believes that these material weaknesses will remain until such time that the Company has the resources to increase the number of personnel committed to the performance of its financial duties that such weaknesses can be specifically addressed. This will include, but not limited to, the following:\n● Hiring of additional personnel to adequately segregate financial reporting duties.\n● The retention of outside consultants to review our controls and procedures.\nIF WE PURSUE OUR OBJECTIVES OF EXPANDING OUR OPERATIONS THROUGH ACQUISITIONS, WE MAY BE UNABLE TO SUCCESSFULLY MANAGE THOSE ACQUISITIONS.\nIn connection with our anticipated acquisitions and new market expansion, we may face risks commonly encountered with growth through acquisitions and expansions. These risks include the incurrence of higher than anticipated capital expenditures and operating expenses, the adverse impact on our ongoing business resulting from greater attention of management to the acquired businesses or new market operations and difficulties encountered in integrating the operations and personnel of the acquired business. There can be no assurance that we will be successful in overcoming these risks or any other problems encountered with acquisitions or expansions. To the extent the Company does not successfully avoid or overcome the risks or problems related to its acquisitions or expansions, the Company's results of operations and financial condition could be adversely affected.\nTo the extent that the Company expands into new markets or through acquisition, it will need to employ or consult with personnel that are knowledgeable in such markets. In addition, the success of any particular acquisition may be significantly dependent on retaining key members of the acquired company's existing management. There can be no assurance that the Company will be able to employ or retain the necessary personnel, that the Company will be able to successfully implement its management process and culture with local management or that the Company's expansion efforts will be successful.\nWE ARE DEPENDENT ON THE EFFORTS OF OUR MANAGEMENT TEAM TO CONTINUE OUR OPERATIONS.\nThe Company's future success depends on the continued services of its executive and senior officers, especially our President, Calvin D. Smiley, Sr. and our Secretary, Michael A. Littman. The loss of the services of one or more key personnel could have a material adverse effect upon the Company's operations. The Company's success also depends on its ability to attract and retain qualified personnel. There can be no assurances that the Company will be successful in attracting and retaining such personnel.\nWE HAVE AGREED TO INDEMNIFICATION OF OFFICERS AND DIRECTORS AS IS PROVIDED BY DELAWARE STATUTES.\nDelaware General Corporation Laws provide for the indemnification of our directors, officers, employees, and agents, under certain circumstances, against attorneys fees and other expenses incurred by them in any litigation to which they become a party arising from their association with or activities on our behalf. We will also bear the expenses of such litigation for any of our directors, officers, employees, or agents, upon such persons promise to repay us therefore if it is ultimately determined that any such person shall not have been entitled to indemnification. This indemnification policy could result in substantial expenditures by us that we will be unable to recoup.\nOUR DIRECTORS LIABILITY TO US AND STOCKHOLDERS IS LIMITED.\nDelaware General Corporation Laws exclude personal liability of our directors and our stockholders for monetary damages for breach of fiduciary duty except in certain specified circumstances. Accordingly, we will have a much more limited right of action against our directors that otherwise would be the case. This provision does not affect the liability of any director under federal or applicable state securities laws.\nWe have no full-time employees which may impede our ability to carry on our business. Our officers are independent consultants who devote up to 10 hours per week to Company business. The lack of full-time employees\nmay very well prevent the Companys operations from being efficient, and may impair the business progress and growth, which is a risk to any investor.\nRISKS RELATED TO OUR SECURITIES\nTHERE IS A VERY LIMITED TRADING MARKET FOR OUR COMMON STOCK AND INVESTORS ARE NOT ASSURED OF THE OPPORTUNITY TO SELL THEIR STOCK, SHOULD THEY DESIRE TO DO SO.\nOur common stock currently trades on the OTC Pink Sheets as VHLD as unsolicited and we will need to file a 15c2-11 through a Broker-Dealer upon any merger or commencement of business before quotations of our stock may resume. Note that stock has traded in very limited quantities in the past few years. We believe a significant factor in the limited market is our limited capitalization and liquidity, results of operation and the characterization of our stock as a penny stock. We hope to remedy our financial condition and results of operation in the future. This, in turn, may assist us in obtaining listing of our stock on the OTCQB, Nasdaq or NYSE/American Exchange. However, there is no assurance that any of these objectives will be met or that the market will ever increase to a point where investors could sell their stock at a desirable price, should they desire to do so.\nREDUCTION OF PERCENTAGE SHARE OWNERSHIP FOLLOWING BUSINESS COMBINATION AND DILUTION TO STOCKHOLDERS\nOur primary plan of operation is based upon a business combination with a private concern which, in all likelihood, would result in us issuing securities to stockholders of such private company. The issuance of previously authorized and unissued shares of our common stock would result in reduction in percentage of shares owned by present and prospective stockholders and may result in a change in control or management. In addition, any merger or acquisition can be expected to have a significant dilutive effect on the percentage of the shares held our stockholders.\nTHE REGULATION OF PENNY STOCKS BY SEC AND NASD MAY HAVE AN EFFECT ON THE TRADABILITY OF OUR SECURITIES.\nOur securities currently trade on the OTC PINK as VHLD as unsolicited. Our shares are subject to a Securities and Exchange Commission rule that imposes special sales practice requirements upon broker-dealers who sell such securities to persons other than established customers or accredited investors. For purposes of the rule, the phrase \"accredited investors\" means, in general terms, institutions with assets in excess of $5,000,000, or individuals having a net worth in excess of $1,000,000 or having an annual income that exceeds $200,000 (or that, when combined with a spouse's income, exceeds $300,000).\nFor transactions covered by the rule, the broker-dealer must make a special suitability determination for the purchaser and receive the purchaser's written agreement to the transaction prior to the sale. Consequently, the rule may affect the ability of broker-dealers to sell our securities and also may affect the ability of purchasers in this offering to sell their securities in any market that might develop therefore.\nIn addition, the Securities and Exchange Commission has adopted a number of rules to regulate \"penny stocks.\" Such rules include Rules 3a51-1, 15g-1, 15g-2, 15g-3, 15g-4, 15g-5, 15g-6, 15g-7, and 15g-9 under the Securities and Exchange Act of 1934, as amended. Because our securities constitute \"penny stocks\" within the meaning of the rules, the rules would apply to us and to our securities. The rules may further affect the ability of owners of Shares to sell our securities in any market that might develop for them.\nShareholders should be aware that, according to Securities and Exchange Commission, the market for penny stocks has suffered in recent years from patterns of fraud and abuse. Such patterns include (i) control of the market for the security by one or a few broker-dealers that are often related to the promoter or issuer; (ii) manipulation of prices through prearranged matching of purchases and sales and false and misleading press releases; (iii) \"boiler room\" practices involving high-pressure sales tactics and unrealistic price projections by inexperienced sales persons; (iv) excessive and undisclosed bid-ask differentials and markups by selling broker-dealers; and (v) the wholesale dumping of the same securities by promoters and broker-dealers after prices have been manipulated to a desired\nconsequent investor losses. Our management is aware of the abuses that have occurred historically in the penny stock market. Although we do not expect to be in a position to dictate the behavior of the market or of broker-dealers who participate in the market, management will strive within the confines of practical limitations to prevent the described patterns from being established with respect to our securities.\nThe shares of our common stock may be thinly traded on the Pink Sheets, meaning that the number of persons interested in purchasing our shares of common stock at or near ask prices at any given time may be relatively small or non-existent. This situation is attributable to a number of factors, including the fact that we are a small company which is relatively unknown to stock analysts, stock brokers, institutional investors and others in the investment community that generate or influence sales volume, and that even if we came to the attention of such persons, they tend to be risk-averse and would be reluctant to follow an unproven, early stage company such as ours or purchase or recommend the purchase of our shares of common stock until such time as we became more seasoned and viable. As a consequence, there may be periods of several days or more when trading activity in our shares of common stock is minimal or non-existent, as compared to a seasoned issuer which has a large and steady volume of trading activity that will generally support continuous sales without an adverse effect on Securities price.\nOUR STOCK IS GOING TO BE CLASSIFIED UNDER THE SHELL STATUS OF RULE 144(i) AND WILL NOT BE TRADEABLE EXCEPT UNDER LIMITED CIRCUMSTANCES.\nUntil and unless the Company meets certain criteria under Rule 144(i), our shares will not be tradeable for 1 year after we are no longer a shell defined as having minimal operations, and cash assets only, unless we file and pursue to effectiveness an Offering Statement on Form 1-A or a Registration Statement on Form S-1. We also must remain current in our SEC filings under Section 13(a) of the Securities Exchange Act.\nOUR STOCK WILL IN ALL LIKELIHOOD BE THINLY TRADED AND AS A RESULT YOU MAY BE UNABLE TO SELL AT OR NEAR ASK PRICES OR AT ALL IF YOU NEED TO LIQUIDATE YOUR SHARES.\nWe cannot give you any assurance that a broader or more active public trading market for our shares of Common Stock will develop or be sustained, or that any trading levels will be sustained. Due to these conditions, we can give investors no assurance that they will be able to sell their shares of common stock at or near ask prices or at all if you need money or otherwise desire to liquidate your shares of common stock of our Company.\nRULE 144 SALES IN THE FUTURE MAY HAVE A DEPRESSIVE EFFECT ON OUR STOCK PRICE.\nAll of the outstanding shares of common stock held by our present officers, directors, and affiliate stockholders are \"restricted securities\" within the meaning of Rule 144 under the Securities Act of 1933, as amended. As restricted shares, these shares may be resold only pursuant to an effective registration statement or under the requirements of Rule 144 or other applicable exemptions from registration under the Act and as required under applicable state securities laws. We are registering all of our outstanding shares so officers, directors and affiliates will be able to sell their shares if this Registration Statement becomes effective. Rule 144 provides in essence that a person who has held restricted securities for one year may, under certain conditions, sell every three months, in brokerage transactions, a number of shares that does not exceed the greater of 1.0% of a company's outstanding common stock or the average weekly trading volume during the four calendar weeks prior to the sale. There is no limit on the amount of restricted securities that may be sold by a nonaffiliate after the owner has held the restricted securities for a period of two years. A sale under Rule 144 or under any other exemption from the Act, may have a depressive effect upon the price of the common stock in any market that may develop.\nRULE 144 MAY NOT BE AVAILABLE FOR RESALES DUE TO THE FACT THAT THE COMPANY IS AND HAS BEEN A SHELL.\nThe availability of Rule 144 for resales of shares issued while the company is a shell company or thereafter is restricted even after the expiration of that one-year period. Rule 144(i)(2) provides that the Rule 144 exemption is available to a shareholder of any public company that was a shell company only if the company is current in all of its periodic reports required to be filed with the SEC during the 12 months before the date of the shareholders resale. This condition to the availability of Rule 144 must be satisfied regardless of the time that has elapsed since\nthe public company ceased to be a shell company and regardless of when the shares were issued. The SEC has made it clear that this condition must be satisfied even regarding shares issued by the public company long after it ceases to be a shell company. If this condition is not satisfied at the time a shareholder wishes to sell (because, for example, the company did not timely file a Form 10-Q), Rule 144 will not be available; and in the absence of a resale registration covering the sale, the shareholder would not be able to sell into the market.\nTHE PRICE OF OUR COMMON STOCK COULD BE HIGHLY VOLATILE.\nOur shares of common stock are listed on the Over-the-Counter Bulletin Board. It is likely that our common stock will be subject to price volatility, low volumes of trades and large spreads in bid and ask prices quoted by market makers. Due to the low volume of shares traded on any trading day, persons buying or selling in relatively small quantities may easily influence prices of our common stock. This low volume of trades could also cause the price of our stock to fluctuate greatly, with large percentage changes in price occurring in any trading day session. Holders of our common stock may also not be able to readily liquidate their investment or may be forced to sell at depressed prices due to low volume trading. If high spreads between the bid and ask prices of our common stock exist at the time of a purchase, the stock would have to appreciate substantially on a relative percentage basis for an investor to recoup their investment. Broad market fluctuations and general economic and political conditions may also adversely affect the market price of our common stock. No assurance can be given that an active market in our common stock will be sustained. If an active market does not continue, holders of our common stock may be unable to readily sell the shares they hold or may not be able to sell their shares at all.\nLOSS OF CONTROL BY OUR PRESENT MANAGEMENT AND STOCKHOLDERS MAY OCCUR UPON ISSUANCE OF ADDITIONAL SHARES.\nWe may issue further shares as consideration for the cash or assets or services out of our authorized but unissued common stock that would, upon issuance, represent a majority of our voting power and equity. The result of such an issuance would be those new stockholders and management would control us, and persons unknown could replace our management at this time. Such an occurrence would result in a greatly reduced percentage of ownership of us by our current shareholders.\nIF THE REGISTRATION OF OUR COMMON STOCK IS REVOKED IN THE FUTURE, OUR BUSINESS OPPORTUNITIES WILL CEASE TO EXIST.\nIn the event our securities registration was to be revoked, we would not have the ability to raise money through the issuance of shares and would lose the ability to continue the business plan set out in this filing. Common stock issued and outstanding at that time would no longer be tradable.\nWE DO NOT ANTICIPATE PAYING CASH DIVIDENDS ON OUR COMMON STOCK.\nWe do not anticipate paying any cash dividends on our common stock in the foreseeable future.\nWE MAY BE UNSUCCESSFUL IN FINDING A MERGER THAT CAN BE ACCOMPLISHED WITH POSITIVE LONG-TERM RESULTS.\nThe business of selecting and entering into a merger is fraught with all kinds of issues. For instance, the business may need capital that is never achieved, the management is not capable of carrying the business forward successfully, the business plan is ill conceived, and not executed, or competitive factors cause business failure. There are many other factors in addition to these, as may have been discussed above in Risk Factors which could cause our company to fail and the investors capital will be at risk. ITEM 1B. UNRESOLVED STAFF COMMENTS.\nNONE. ITEM 2. PROPERTIES.\nWe do not own or lease any properties.\nOur mailing address is 12136 West Bayaud Avenue, Suite 300, Lakewood, CO 80228.\nOur transfer agent is Mountain Share Transfer, LLC, 2030 Powers Ferry Rd., SE, #212, Atlanta, GA 30339. Their telephone number is 404-474-3110. ITEM 3. LEGAL PROCEEDINGS.\nWe are not currently involved in any litigation that we believe could have a material adverse effect on our financial condition or results of operations. There is no action, suit, proceeding, inquiry or investigation before or by any court, public board, government agency, self-regulatory organization or body pending or, to the knowledge of the executive officers of our company or any of our subsidiaries, threatened against or affecting our company, our common stock, any of our subsidiaries or of our companies or our subsidiaries officers or directors in their capacities as such, in which an adverse decision could have a material adverse effect. We anticipate that we (including current and any future subsidiaries) will from time to time become subject to claims and legal proceedings arising in the ordinary course of business. It is not feasible to predict the outcome of any such proceedings and we cannot assure that their ultimate disposition will not have a materially adverse effect on our business, financial condition, cash flows or results of operations. ITEM 4. MINE SAFETY DISCLOSURE.\nNot applicable.\nPART II ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES.\nMarket Price and Stockholder Matters\nShares of our common stock trade on the OTC PINK and quotations for the common stock are listed by the OTC Markets under the symbol \"VHLD.\" On July 6, 2021, our stock symbol changed from MMBFD to VHLD after a holding company reorganization.\nThe following table sets forth for the respective periods indicated the prices of our common stock in this market as reported and summarized by the National Quotation Bureau. Such prices are based on inter-dealer bid and asked prices, without markup, markdown, commissions, or adjustments and may not represent actual transactions.\nDuring the fiscal years ended June 30, 2023 and 2022, we had a trading history as follows:\nHIGH LOW\nQuarter Ended:\nSeptember 30, 2021 $ 0.1301 $ 0.1301\nDecember 31, 2021 $ 0.3001 $ 0.3001\nMarch 31, 2022 $ 0.3110 $ 0.3110\nJune 30, 2022 $ 0.3020 $ 0.3020\nSeptember 30, 2022 $ 0.0327 $ 0.0327\nDecember 31, 2022 $ 0.0362 $ 0.0362\nMarch 31, 2023 $ 0.2880 $ 0.2880\nJune 30, 2023 $ 0.0020 $ 0.0020\nLast Reported Price\nOn October 23, 2023, the last reported bid price of our shares of common stock reported on the expert market was $0.0171 per share.\nRecord Holders\nThere were 417 holders of record as of October 23, 2023. In many instances, a registered stockholder is a broker or other entity holding shares in street name for one or more customers who beneficially own the shares.\nDividend Policy\nWe have never paid cash dividends and have no plans to do so in the foreseeable future. Our future dividend policy will be determined by our board of directors and will depend upon a number of factors, including our financial condition and performance, our cash needs and expansion plans, income tax consequences, and the restrictions that applicable laws, any future preferred stock instruments, and any future credit arrangements may then impose.\nPenny Stock.\nPenny Stock Regulation Broker-dealer practices in connection with transactions in \"penny stocks\" are regulated by certain penny stock rules adopted by the Securities and Exchange Commission. Penny stocks generally are equity securities with a price of less than $5.00. Excluded from the penny stock designation are securities registered on certain national securities exchanges or quoted on NASDAQ, provided that current price and volume information with respect to transactions in such securities is provided by the exchange/system or sold to established customers or accredited investors.\nThe penny stock rules require a broker-dealer, prior to a transaction in a penny stock not otherwise exempt from the rules, to deliver a standardized risk disclosure document that provides information about penny stocks and the risks in the penny stock market. The broker-dealer also must provide the customer with current bid and offer quotations for the penny stock, the compensation of the broker-dealer and its salesperson in connection with the transaction, and the monthly account statements showing the market value of each penny stock held in the customer's account. In addition, the penny stock rules generally require that prior to a transaction in a penny stock, the broker-dealer must make a special written determination that the penny stock is a suitable investment for the purchaser and receive the purchaser's written agreement to the transaction.\nThese disclosure requirements may have the effect of reducing the level of trading activity in the secondary market for a stock that becomes subject to the penny stock rules. As our securities have become subject to the penny stock rules, investors may find it more difficult to sell their securities.\nSecurities Authorized for Issuance Under Equity Compensation Plans\nNone.\nRecent Sales of Unregistered Securities.\nNone.\nExemption from Registration Claimed\nThe transactions were exempt from Registration under Section 4(a)2 of the Securities Act of 1933.\nIssuer Purchases of Equity Securities\nWe did not repurchase any shares of our common stock during the years ended June 30, 2023 and 2022. ITEM 6. RESERVED. ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS.\nForward-Looking Statements and Associated Risks.\nThis Form 10-K contains certain statements that are forward-looking within the meaning of the Private Securities Litigation Reform Act of 1995. For this purpose, any statements contained in this Form 10-K that are not statements of historical fact may be deemed to be forward-looking statements. Without limiting the foregoing, words such as may, will, expect, believe, anticipate, estimate, or continue, or comparable terminology are intended to identify forward-looking statements. These statements by their nature involve substantial risks and uncertainties, and actual results may differ materially depending on a variety of factors, many of which are not within our control. These factors include but are not limited to economic conditions generally and in the industries in which we may participate; competition within our chosen industry, including competition from much larger competitors; technological advances and failure to successfully develop business relationships.\nBased on our financial history since inception, our auditor has expressed substantial doubt as to our ability to continue as a going concern. As reflected in the accompanying financial statements, as of June 30, 2023, we had an accumulated deficit totaling $17,764,968. This raises substantial doubt about our ability to continue as a going concern.\nPlan of Operation\nOur plan of operations is to raise debt and/or equity to meet our ongoing operating expenses and seek to merge with another entity with experienced management and opportunities for growth in return for shares of our common stock to create value for our shareholders. There can be no assurance that we will successfully complete this series of transactions. In particular, there is no assurance that any stockholder will realize any return on their shares after such a transaction. Any merger or acquisition completed by us can be expected to have a significant dilutive effect on the percentage of shares held by our current stockholders.\nAs of June 30, 2023 and 2022, our cash balances were $325 and $0, respectively.\nOur principal shareholder has indicated his intention to provide such funds as may be required for the Company to become, and remain, a fully reporting public company while seeking to create value for shareholders by merging with another entity with experienced management and opportunities for growth in return for shares of its common stock. Such intentions do not represent a binding commitment by the principal shareholder and there is no guarantee that our two principal shareholders will be able to provide the funding necessary to achieve this objective.\nWe currently believe that our principal shareholder will be able to provide us with the funding necessary to effect our business plan to merge with another entity. However, while our principal shareholder has indicated his intention to provide us with sufficient funding to achieve this objective, there is no guarantee that he will be able to provide funding necessary to enable us to merge with another entity.\nIf we are unable to obtain the necessary funding from our principal shareholder, we anticipate facing major challenges in raising the necessary funding to effect our business plan to merge with another entity. Raising debt or equity funding for small publicly quoted, penny stock, shell companies is always extremely challenging.\nWe may face a number of obstacles in our attempt to raise funding to achieve our objective of merging with a yet to be identified company or group. One of those is Rule 419, under the Securities Act of 1933.\nRule 419 defines a \"blank check company\" as a company that: i. Is a development stage company that has no specific business plan or purpose or has indicated that its business plan is to engage in a merger or acquisition with an unidentified company or companies, or other entity or person; and ii. Is issuing \"penny stock,\" as defined in Rule 3a51-1 under the Securities Exchange Act of 1934.\nWe are a shell company but deemed a blank check company for purposes of capital raising, and therefore, in order to raise funds, we must comply with the requirements of Rule 419 for public offerings which includes restrictive escrow and other provisions. These provisions will make it difficult, if not impossible, for us to raise funds for the company.\nTherefore, because of these difficulties in raising funding in penny stock or shell companies, if our principal shareholder is unable to provide us with the funding required to merge with another entity, it is very likely that we will be unable to implement our business plan to merge with another entity to create value for all of our shareholders.\nWe believe we are an insignificant participant among the firms which engage in the acquisition of business opportunities. There are many established venture capital and financial concerns that have significantly greater financial and personnel resources and technical expertise than we have. In view of our limited financial resources and limited management availability, we will continue to be at a significant competitive disadvantage compared to our competitors.\nWe intend to seek, investigate and, if such investigation warrants, acquire an interest in business opportunities presented to us by persons or firms which desire to seek the advantages of an issuer who has complied with the Securities Act of 1934 (the 1934 Act). We will not restrict our search to any specific business, industry or geographical location, and we may participate in business ventures of virtually any nature. This discussion of our proposed business is purposefully general and is not meant to be restrictive of our virtually unlimited discretion to search for and enter into potential business opportunities. We anticipate that we may be able to participate in only one potential business venture because of our lack of financial resources.\nWe may seek a business opportunity with entities which have recently commenced operations, or that desire to utilize the public marketplace in order to raise additional capital in order to expand into new products or markets, to develop a new product or service, or for other corporate purposes. We may acquire assets and establish wholly owned subsidiaries in various businesses or acquire existing businesses as subsidiaries.\nWe expect that the selection of a business opportunity will be complex and risky. Due to general economic conditions, rapid technological advances being made in some industries and shortages of available capital, we believe that there are numerous firms seeking the benefits of an issuer who has complied with the 1934 Act. Such benefits may include facilitating or improving the terms on which additional equity financing may be sought, providing liquidity for incentive stock options or similar benefits to key employees, providing liquidity (subject to restrictions of applicable statutes) for all stockholders and other factors. Potentially, available business opportunities may occur in many different industries and at various stages of development, all of which will make the task of comparative investigation and analysis of such business opportunities extremely difficult and complex. We have, and will continue to have, essentially no assets to provide the owners of business opportunities. However, we will be able to offer owners of acquisition candidates the opportunity to acquire a controlling ownership interest in an issuer who has complied with the 1934 Act without incurring the cost and time required to conduct an initial public offering.\nThe analysis of new business opportunities will be undertaken by, or under the supervision of, our sole director. We intend to concentrate on identifying preliminary prospective business opportunities which may be brought to our attention through present associations of our director, professional advisors or by our stockholders. In analyzing prospective business opportunities, we will consider such matters as (i) available technical, financial and managerial resources; (ii) working capital and other financial requirements; (iii) history of operations, if any, and prospects for the future; (iv) nature of present and expected competition; (v) quality, experience and depth of management services; (vi) potential for further research, development or exploration; (vii) specific risk factors not now foreseeable but that may be anticipated to impact the proposed activities of the company; (viii) potential for growth or expansion; (ix) potential for profit; (x) public recognition and acceptance of products, services or trades; (xi) name identification; and (xii) other factors that we consider relevant. As part of our investigation of the business opportunity, we expect to meet personally with management and key personnel. To the extent possible, we intend to utilize written reports and personal investigation to evaluate the above factors.\nWe will not acquire or merge with any company for which audited financial statements cannot be obtained within a reasonable period of time after closing of the proposed transaction.\nRESULTS OF OPERATIONS FOR THE YEARS ENDED JUNE 30, 2023 AND 2022\nWe are a publicly quoted shell company seeking to merge with other entities with experienced management and opportunities for growth in return for shares of our common stock to create values for our shareholders. No potential merger candidate has been identified at this time.\nRevenue\nWe recognized no revenue during the years ended June 30, 2023 or 2022 as we had no revenue generating activities during these periods.\nGeneral and Administrative Expenses\nDuring the year ended June 30, 2023, we incurred general and administrative expenses of $33,999, comprising accounting fees of $13,150, share transfer agent fees of $7,845, OTC market fees of $5,958, audit fees of $3,750, SEC filing fees of $2,338, State filing fees of $758 and other fees totaling $200.\nDuring the year ended June 30, 2022, we incurred general and administrative expenses of $39,794, comprising audit fees of $12,000, accounting fees of $11,150, OTC market fees of $6,042, share transfer agent fees of $6,005, SEC filing fees of $2,667, legal fees of $1,000, state filing fees of $450 and other fees totaling $480.\nThe $5,795 decrease in general and administrative expenses between the two years reflected a $8,250 decrease in audit fees partially offset by a $4,039 increase in other general and administrative expenses largely relating to accounting and share transfer agent fees.\nOperating Loss\nDuring the year ended June 30, 2023, we incurred an operating loss of $33,999 compared to an operating loss of $39,794 during the year ended June 30, 2022, a decrease of $5,795, due to the factors discussed above.\nInterest Expense - Related Party\nDuring the year ended June 30, 2023, we incurred interest expense at 6% on a related party loan of $9,000 commencing January 1, 2023. No interest expense was incurred during the year ended June 30, 2022.\nLoss before Income Tax\nDuring the year ended June 30, 2023, we incurred a net loss before income taxes of $34,269 as compared to a net loss of $39,794 in the year ended June 30, 2022, a decrease of $5,525, due to the factors discussed above.\nProvision for Income Tax\nNo provision for income taxes was recorded during the years ended June 30, 2023 and 2022 as we incurred taxable losses in both years.\nNet Loss\nDuring the period ended June 30, 2023, we incurred a net loss of $34,269 as compared to a net loss of $39,794 during the year ended June 30, 2022, a decrease of $5,525, due to the factors discussed above.\nCASH FLOW\nAs of June 30, 2023, we did not have any revenue generating activities or other sources of income and we had total liabilities of $92,051 and a shareholders deficit of $91,726.\nConsequently, we are now dependent on raising additional equity and/or debt to meet our ongoing operating expenses. There is no assurance that we will be able to raise the necessary equity and/or debt that we will need to fund our ongoing operating expenses.\nIt is our current intention to seek to raise debt and/or equity financing to meet ongoing operating expenses and attempt to merge with another entity with experienced management and opportunities for growth in return for shares of our common stock to create value for our shareholders. There is no assurance that this series of events will be satisfactorily completed.\nFuture losses are likely to occur as, until we are able to merge with another entity with experienced management and opportunities for growth in return for shares of our common stock to create value for our shareholders, we have no sources of income to meet our operating expenses.\nFor The Year Ended For The Year Ended\nJune 30, 2023 June 30, 2022\nNet Cash Used in Operating Activities $ (16,803 ) $ (40,390 )\nNet Cash Used in Investing Activities - -\nNet Cash Provided by Financing Activities 17,128 40,390\nNet Movement in Cash and Cash Equivalents $ 325 $ -\nOperating Activities\nDuring the year ended June 30, 2023, we incurred a net loss of $34,269 which was reduced for cash flow purposes by an increase in accounts payable of $11,508, and a decrease in prepaid expenses of $5,958, resulting in net cash of $16,803 being used in operations.\nDuring the year ended June 30, 2022, we incurred a net loss of $39,794 which was increased for cash flow purposes by an increase in accounts payable of $5,362 and decreased by cash flow purposed by an increase in prepaid expenses of $5,958, resulting in net cash of $40,390 being used in operations.\nInvesting Activities\nDuring the years ended June 30, 2023 and 2022, we had no investing activities.\nFinancing Activities\nDuring the year ended June 30, 2023, we received $17,128 by way of an advance under notes payable - related party resulting in a total of $17,128 being generated from financing operations.\nDuring the year ended June 30, 2022, we received $40,390 by way of an advance under loan payable - related party resulting in a total of $40,390 being generated from financing operations.\nWe are dependent upon the receipt of capital investment or other financing to fund our ongoing operations and to execute our business plan to become a profitable real estate development company seeking to develop or redevelop residential, commercial or mixed used properties. In addition, we are dependent upon our controlling shareholder to provide continued funding and capital resources. If continued funding and capital resources are unavailable at reasonable terms, we may not be able to implement our plan of operations.\nCRITICAL ACCOUNTING POLICIES\nAll companies are required to include a discussion of critical accounting policies and estimates used in the preparation of their financial statements. On an on-going basis, we evaluate our critical accounting policies and estimates. We base our estimates on historical experience and on various other assumptions that we believe to be reasonable under the circumstances, the results of which form our basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Actual results may differ from these estimates under different assumptions or conditions.\nOur significant accounting policies are described in Note 3 of our Financial Statements on page. These policies were selected because they represent the more significant accounting policies and methods that are broadly applied in the preparation of our financial statements.\nInflation\nIn the opinion of management, inflation has not and will not have a material effect on our operations in the immediate future.\nManagement will continue to monitor inflation and evaluate the possible future effects of inflation on our business and operations.\nOff-Balance Sheet Arrangements\nPer SEC regulations, we are required to disclose our off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, such as changes in financial condition, revenues, expenses, results of operations, liquidity, capital expenditures, or capital resources that are material to investors. As of June 30,2023, we have no off-balance sheet arrangements.\nShare-based Compensation\nThe cost of equity instruments issued to employees and non-employees in return for goods and services is measured by the grant date fair value of the equity instruments issued in accordance with ASC 718, Compensation - Stock Compensation. The related expense is recognized as services are rendered or vesting periods elapse.\n.\nRecently Issued Accounting Pronouncements\nWe have reviewed all the recently issued, but not yet effective, accounting pronouncements and do not believe any of these pronouncements will have a material impact on our financial statements. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK.\nWe are a smaller reporting company as defined by Rule 12b-2 of the Securities Act of 1934 and are not required to provide the information under this item. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA.\nVECTOR 21 HOLDINGS, INC.\nAUDITED FINANCIAL STATEMENTS\nFor the years ended June 30, 2023 and 2022\nPAGE\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM PCAOB ID No. 0666200001\nBALANCE SHEETS AS OF JUNE 30, 2023 AND 2022\nSTATEMENTS OF OPERATIONS FOR THE YEARS ENDED JUNE 30, 2023 AND 2022\nSTATEMENTS OF CHANGES IN SHAREHOLDERS DEFICIT FOR THE YEARS ENDED JUNE 30, 2023 AND 2022\nSTATEMENTS OF CASH FLOWS FOR THE YEARS ENDED JUNE 30, 2023 AND 2022\nNOTES TO THE AUDITED FINANCIAL STATEMENTS FOR THE YEARS ENDED JUNE 30, 2023 AND 2022\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo The Board of Directors and Shareholders\nVector 21 Holdings, Inc.\nW. Bayaud Ave,, Suite 300\nLakewood, CO 80228\nOpinion on the financial statements\nWe audited the accompanying balance sheets of Vector 21 Holdings, Inc., (the Company) as of June 30, 2023 and 2022 and the related statements of operations, stockholders equity and cash flows for years then ended and the related notes (collectively referred to as financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of June 30, 2023 and 2022, and the results of its operation, stockholders equity and cash flows for the years then ended, in conformity with accounting principles generally accepted in the United States of America.\nGoing Concern\nThe Companys financial statements are prepared using the generally accepted accounting principles applicable to a going concern, which contemplates the realization of assets and liquidation of the liabilities in the normal course of business. The Company has an accumulated deficit of $17,764,968 as of June 30, 2023. These factors as discussed in Note 2 of the financial statements raise substantial doubt about the Companys ability to continue as a going concern. Management's plans in regard to these matters are also described in Note 2. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nBasis of Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (\"PCAOB\") and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits. we are required to obtain an understanding of internal control over financial reporting not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nCritical audit matters arising from the current period of the financial statements that were communicated or required to be communicated to the audit committee and that (1) relate to accounts or disclosure that are material to the financial statements and (2) involve especially challenging, subjective, or complex judgements. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit below, providing separate opinions on the critical audit matters or the accounts or disclosures to which they relate.\nThere are no critical audit matters.\nWe have served as the Companys auditor since 2021.\nM. S. Madhava Rao, Chartered Accountant\nBangalore, India\nOctober 27, 2023\nVECTOR 21 HOLDINGS, INC.\nBALANCE SHEETS\n(Audited)\nFOR THE YEARS ENDED JUNE 30,\nASSETS\nCurrent Assets\nCash and cash equivalents $ 325 $ -\nPrepaid expenses -\n5,958\nTotal Current Assets 5,958\nTotal Assets $ 325 $ 5,958\nLIABILITIES AND SHAREHOLDERS' DEFICIT\nCurrent Liabilities\nAccounts payable and accruals $ 33,912 $ 22,404\nLoan payable- related party 7,759 41,011\nPromissory note- related party 50,380 -\nTotal Current Liabilities 92,051 63,415\nTotal Liabilities 92,051 63,415\nCommitments and Contingencies (Note 9)\nShareholders' Deficit\nCommon stock, $0.0001 par value, 500,000,000 shares authorized, 1,697,200 shares issued and outstanding, as of June 30, 2023 and 2022\nAdditional paid in capital 17,673,072 17,673,072\nAccumulated deficit (17,764,968 ) (17,730,699 )\nTotal Shareholders' Deficit (91,726 ) (57,457 )\nTotal Liabilities and Shareholders' Deficit $ 325 $ 5,958\nThe accompanying notes are an integral part of these audited financial statements.\nVECTOR 21 HOLDINGS, INC.\nSTATEMENTS OF OPERATIONS\n(Audited)\nFOR THE YEARS ENDED JUNE 30,\nREVENUE $ -\n$ -\nEXPENSES\nGeneral and administrative expenses 33,999 39,794\nTotal Operating Expenses 33,999 39,794\nOPERATING LOSS (33,999 ) (39,794 )\nOTHER INCOME (EXPENSE)\nInterest expense - related party (270 ) -\nTotal Other Income (Expense) (270 ) -\nLOSS BEFORE TAXES (34,269 ) (39,794 )\nTAXES -\n-\nNET LOSS $ (34,269 ) $ (39,794 )\nWeighted average shares outstanding- basic and diluted\n1,697,200 1,690,506\nNet loss per share - basic and diluted\n$ (0.02 ) $ (0.02 )\nThe accompanying notes are an integral part of these audited financial statements.\nVECTOR 21 HOLDINGS, INC.\nSTATEMENTS OF CHANGES IN SHAREHOLDERS' DEFICIT\nFOR THE YEARS ENDED JUNE 30, 2023 AND 2022\n(Audited)\nCommon Shares Common Shares to be Issued Additional Paid-in Accumulated\nShares Amount Shares Amount Capital Deficit Total\nBalance at June 30, 2021 1,647,200 $ 165 50,000 $ 12,500 $ 17,660,577 $ (17,690,905 ) $ (17,663 )\nIssuance of shares as compensation for sale of subsidiary company 50,000 (50,000 ) (12,500 ) 12,495 -\n-\nNet loss for the year - -\n- -\n-\n(39,794 ) (39,794 )\nBalance at June 30, 2022 1,697,200 $ 170 -\n$ -\n$ 17,673,072 $ (17,730,699 ) $ (57,457 )\nNet loss for the year - -\n- -\n-\n(34,269 ) (34,269 )\nBalance at June 30, 2023 1,697,200 $ 170 -\n$ -\n$ 17,673,072 $ (17,764,968 ) $ (91,726 )\nThe accompanying notes are an integral part of these audited financial statements.\nVECTOR 21 HOLDINGS, INC.\nSTATEMENTS OF CASH FLOWS\n(Audited)\nFOR THE YEARS ENDED\nJUNE 30,\nCash Flows from Operating Activities:\nNet Loss $ (34,269 ) $ (39,794 )\nAdjustments to reconcile net loss to net cash from operating activities: - -\nChanges in working capital items:\nPrepaid Expenses 5,958 (5,958 )\nAccounts Payable & Accruals 11,508 5,362\nNet Cash Flows Used in Operating Activities (16,803 ) (40,390 )\nCash Flows from Financing Activities\nLoan Payable- Related Party 7,858 40,390\nAdvances Under Promissory Note - Related Party 9,270 -\nNet Cash Flows from Financing Activities 17,128 40,390\nNet increase (decrease) in Cash: $ 325 $ -\nCash, beginning of period: -\n-\nCash, end of period: $ 325 $ -\nSupplemental Disclosures of Cash Flow Information:\nCash paid for interest $ -\n$ -\nCash paid for income tax $ -\n$ -\nNon-Cash Investing and Financing Activities\nConversion of loan payable - related party to Promissory Note Payable - Related Party $ 41,110 $ -\nThe accompanying notes are an integral part of these audited financial statements.\nVECTOR 21 HOLDINGS, INC.\nNOTES TO AUDITED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED JUNE 30, 2023 AND 2022\nNOTE 1. NATURE OF OPERATIONS\nNature of Business\nVector 21 Holdings, Inc., a Delaware corporation, (Vector 21, the Company, We\", \"Us\" or Our) is a publicly quoted shell company seeking to merge with an entity with experienced management and opportunities for growth in return for shares of our common stock to create values for our shareholders. No potential merger candidate has been identified at this time.\nHistory\nVector 21 was incorporated in Delaware on March 5, 2021.\nEffective April 28, 2021, following a corporate reorganization as described below (‘the Holding Company Reorganization or ‘the reverse recapitalization), Vector 21 became the reorganized successor to Momentum Biofuels, Inc. (Predecessor Company), a publicly quoted holding company that ceased trading in 2012.\nReorganization into a Holding Company Structure for Vector 21 Holdings, Inc., reorganization successor to Momentum Biofuels, Inc.\nEffective March 10, 2021, Momentum Biofuels, Inc. (Momentum Biofuels Colorado), a Colorado corporation, redomiciled to Delaware by merging with its wholly owned subsidiary, Momentum Biofuels, Inc., a Delaware corporation.\nMomentum Biofuels Colorado ceased to exist as an independent legal entity following its merger with Momentum Biofuels Delaware.\nPursuant to the Delaware Holding Company formation statute, DGCL Section 251(g), Momentum Biofuels Delaware entered into an Agreement and Plan of Merger and Reorganization into a Holding Company with Vector 21 Holdings, Inc. (Vector 21) and MBF Ops, Inc. (MBF Ops.), both wholly-owned subsidiaries of Momentum Biofuels Delaware, effective April 28, 2021.\nThe Agreement and Plan of Merger and Reorganization into a Holding Company provided for the merger of Momentum Biofuels Delaware with, and into MBF Ops., with MBF Ops. being the surviving corporation in the merger, as a subsidiary to Vector 21.\nMomentum Biofuels Delaware ceased to exist as an independent legal entity following its merger with MBF Ops.\nThe shareholders of Momentum Biofuels Delaware were converted, by the holding company reorganization, under the Agreement, to shareholders of Vector 21 on a one for one basis pursuant to the Agreement and the Delaware Statute Sec. 251(g).\nMBF Ops., the surviving company of the merger with Momentum Biofuels Delaware, became a wholly-owned subsidiary of Vector 21, the holding company.\nVector 21 became the parent holding company resulting under the Agreement, pursuant to Delaware General Corporation Law section 251(g), with its wholly owned subsidiary company, MBF Ops, the surviving company of the merger with Momentum Biofuels Delaware.\nAs a result of the Holding Company Reorganization, shareholders in the publicly quoted Momentum Biofuels Delaware, formerly the shareholders of Momentum Biofuels Colorado as of the date of the reorganization, became shareholders in the publicly quoted Vector 21.\nMBF Ops, being the direct successor by the merger with Momentum Biofuels Delaware, became a subsidiary company of Vector 21.\nDisposal of MBF Ops.\nEffective June 28, 2021, Vector 21 disposed of 100% of the issued share capital of its sole subsidiary company, MBF Ops., to an unrelated third party. We made a $1,000 payment in cash and promised to issue 50,000 post-split shares of our common stock to the company (MBF) as capital for the subsidiary company which had no ongoing business or assets and outstanding liabilities of $1,130,842. These shares of common stock have been issued to the Purchaser as of the date of these financial statements.\nThe Holding Company Reorganization has been accounted for so as to reflect the fact that both Momentum Biofuels Delaware and Vector 21 were under common control at the date of the Holding Company Reorganization.\nReverse and Forward Stock Splits\nEffective May 13, 2021, we completed:\n- a reverse stock split of our outstanding common stock, $0.0001 par value, on a one (1) post-split share for eight thousand (8,000) pre-split shares basis, and subsequently\n- a forward stock split of our post reverse split outstanding common stock, $0.0001 par value, on a one hundred (100) post-split shares for one (1) pre-split share basis.\nAs a result of the one (1) for eight thousand (8,000) reverse stock split described above, the number of issued and outstanding shares of the Companys common stock was reduced from 123,224,444 to 15,403. No fractional shares were issued in connection with the reverse stock split. Instead, a holder of record of common stock who would otherwise be entitled to a fraction of a share was, in lieu thereof, entitled to receive a whole share of common stock. Consequently 1,069 additional shares were issued in respect of fractional shares and therefore a total of 16,472 shares of common stock were issued and outstanding after the reverse split.\nAs a result of the one hundred (100) post-split shares for one (1) forward stock split described above, the number of issued and outstanding shares of the Companys common stock increased from 16,472 to 1,647,200.\nA total of 1,697,200 shares of common stock are currently outstanding on the date of the filing.\nImpact of the COVID-19 Pandemic\nWe have not commenced operations as yet and consequently have not been directly impacted by the Covid-19 outbreak at this time. However, the detrimental effect of the Covid-19 outbreak on the economy as a whole may have a detrimental impact on our ability to raise funding and identify an entity to merge with for the foreseeable future. We are unable to predict with any certainty the ultimate impact Covid-19 outbreak on our plans at this time.\nImpact of the Ukrainian Conflict\nWe have not commenced operations as yet and consequently have not been directly impacted by the Ukrainian conflict at this time currently, we do not believe that the conflict between Ukraine and Russia will have any direct impact on our operations, financial condition or financial reporting. We believe the conflict will have only a general impact on our operations in the same manner as it is having a general impact on all business operations resulting from international sanction and embargo regulations, possible shortages of goods and goods incorporating parts that may be supplied from the Ukraine or Russia, supply chain challenges, and the international and domestic inflationary results of the conflict and government spending for and funding of their response. We do not believe we\nwill be targeted for cyber-attacks. We have no operations in the countries directly involved in the conflict or that are specifically impacted by any of the sanctions and embargoes, we do not believe that the conflict will have any impact on our internal control over financial reporting. Other than general securities market trends, we do not have reason to believe that investors will evaluate the company as having special risks or exposures related to the Ukrainian conflict.\nInflation\nWe anticipate that our business and financial position will be impacted by the current inflationary environment. To the extent that we use borrowed funds, we believe costs will increase for us. Access to capital will be impacted by increased interest rates and may affect our ability to obtain capital. Inflation will also have an impact on the cost of supplies of goods and services that we use with the consequence of an adverse impact on our operating costs.\nNOTE 2. GOING CONCERN\nOur financial statements are prepared using accounting principles generally accepted in the United States of America (GAAP) applicable to a going concern, which contemplate the realization of assets and the liquidation of liabilities in the normal course of business. We have no ongoing business or income and for the year ended June 30, 2023 we incurred a loss of $34,269 and had an accumulated deficit of $17,764,968 as of June 30, 2023. These conditions raise substantial doubt about our ability to continue as a going concern. The financial statements do not include any adjustments to reflect the possible future effects on the recoverability and classification of assets or the amounts and classification of liabilities that may result from the outcome of these uncertainties. Our ability to continue as a going concern is dependent upon our ability to raise additional debt or equity funding to meet our ongoing operating expenses and ultimately in merging with another entity with experienced management and profitable operations. No assurances can be given that we will be successful in achieving these objectives.\nNOTE 3. SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBasis of Presentation\nThis summary of significant accounting policies is presented to assist in the understanding of the financial statements. These policies conform to GAAP and have been consistently applied. The Company has selected June 30 as its financial year end.\nUse of Estimates\nThe preparation of financial statements in conformity with GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates.\nCash and Cash Equivalents:\nWe maintain cash balances in a non-interest-bearing account that currently does not exceed federally insured limits. For the purpose of the statements of cash flows, all highly liquid investments with a maturity of three months or less are considered to be cash equivalents. As of June 30, 2023 and 2022, our cash balances were $325 and $0 respectively.\nFair Value Measurements:\nASC Topic 820, Fair Value Measurements and Disclosures (\"ASC 820\"), provides a comprehensive framework for measuring fair value and expands disclosures which are required about fair value measurements. Specifically, ASC 820 sets forth a definition of fair value and establishes a hierarchy prioritizing the inputs to valuation techniques, giving the highest priority to quoted prices in active markets for identical assets and liabilities and the lowest priority to unobservable value inputs. ASC 820 defines the hierarchy as follows:\nLevel 1 - Quoted prices are available in active markets for identical assets or liabilities as of the reported date. The types of assets and liabilities included in Level 1 are highly liquid and actively traded instruments with quoted prices, such as equities listed on the New York Stock Exchange.\nLevel 2 - Pricing inputs are other than quoted prices in active markets but are either directly or indirectly observable as of the reported date. The types of assets and liabilities in Level 2 are typically either comparable to actively traded securities or contracts or priced with models using highly observable inputs.\nLevel 3 - Significant inputs to pricing that are unobservable as of the reporting date. The types of assets and liabilities included in Level 3 are those with inputs requiring significant management judgment or estimation, such as complex and subjective models and forecasts used to determine the fair value of financial transmission rights.\nOur financial instruments consist of our prepaid expenses, accounts payable and accruals, loan payable- related party and promissory note- related party. The carrying amount of our prepaid expenses, accounts payable and accruals, loan payable- related party and promissory note- related party approximates their fair values because of the short-term maturities of these instruments.\nRelated Party Transactions:\nA related party is generally defined as (i) any person that holds 10% or more of our membership interests including such person's immediate families, (ii) our management, (iii) someone that directly or indirectly controls, is controlled by or is under common control with us, or (iv) anyone who can significantly influence our financial and operating decisions. A transaction is considered to be a related party transaction when there is a transfer of resources or obligations between related parties. See Notes 6 and 7 below for details of related party transactions in the period presented.\nLeases:\nWe determine if an arrangement is a lease at inception. Operating leases are included in operating lease right-of-use (ROU) as assets, operating lease non-current liabilities, and operating lease current liabilities in our balance sheet. Finance leases are property and equipment, other current liabilities, and other non-current liabilities in the balance sheet.\nROU assets represent the right to use an asset for the lease term and lease liability represent the obligation to make lease payment arising from the lease. Operating lease ROU assets and liabilities are recognized at the commencement date based on the present value of lease payments over lease term. As most of the leases doesnt provide an implicit rate. We generally use the incremental borrowing rate on the estimated rate of interest for collateralized borrowing over a similar term of the lease payments at commencement date. The operating ROU asset also includes any lease payments made and exclude lease incentives. Lease expense for lease payment is recognized on a straight-line basis over lease term.\nThe Company was not party to any lease transaction during the years ended June, 30 2023 and 2022.\nIncome Taxes:\nThe provision for income taxes is computed using the asset and liability method, under which deferred tax assets and liabilities are recognized for the expected future tax consequences of temporary differences between the financial reporting and tax bases of assets and liabilities, and for operating losses and tax credit carry-forwards. Deferred tax assets and liabilities are measured using the currently enacted tax rates that apply to taxable income in effect for the years in which those tax assets are expected to be realized or settled. We record a valuation allowance to reduce deferred tax assets to the amount that is believed more likely than not to be realized.\nUncertain Tax Positions:\nWe evaluate tax positions in a two-step process. We first determine whether it is more likely than not that a tax position will be sustained upon examination, based on the technical merits of the position. If a tax position meets the more-likely-than-not recognition threshold, it is then measured to determine the amount of benefit to recognize in the financial statements. The tax position is measured as the largest amount of benefit that is greater than 50% likely of being realized upon ultimate settlement. We classify gross interest and penalties and unrecognized tax benefits that are not expected to result in payment or receipt of cash within one year as long-term liabilities in the financial statements.\nRevenue Recognition:\nRevenues are recognized when control of the promised goods or services are transferred to a customer, in an amount that reflects the consideration that the Company expects to receive in exchange for those goods or services. The Company applies the following five steps in order to determine the appropriate amount of revenue to be recognized as it fulfills its obligations under each of its agreements:\nStep 1: Identify the contract(s) with customers\nStep 2: Identify the performance obligations in the contract\nStep 3: Determine the transaction price\nStep 4: Allocate the transaction price to performance obligations\nStep 5: Recognize revenue when the entity satisfies a performance obligation\nAs the Company had no business operations during the years ended June 30, 2023 and 2022, we have not identified specific planned revenue streams.\nDuring the years ended June 30, 2023 and 2022, we did not recognize any revenue.\nAdvertising Costs:\nWe expense advertising costs when advertisements occur. No advertising costs were incurred during the years ended June 30, 2023 and 2022.\nStock-Based Compensation:\nThe cost of equity instruments issued to employees and non-employees in return for goods and services is measured by the grant date fair value of the equity instruments issued in accordance with ASC 718, Compensation - Stock Compensation. The related expense is recognized as services are rendered or vesting periods elapse.\nNet Loss per Share Calculation:\nBasic earnings (loss) per common share (\"EPS\") is computed by dividing net income (loss) available to common stockholders by the weighted-average number of common shares outstanding for the period. Diluted earnings (loss) per share is computed by dividing net income (loss) by the weighted average shares outstanding, assuming all dilutive potential common shares were issued. Dilutive loss per share excludes all potential common shares if their effect is anti-dilutive. No potentially dilutive debt or equity instruments were issued or outstanding during the years ended June 30, 2023 and 2022.\nRecently Accounting Pronouncements:\nWe have reviewed all the recently issued, but not yet effective, accounting pronouncements and do not believe any of these pronouncements will have a material impact on our financial statements.\nNOTE 4. PREPAID EXPENSES\nAs of June 30, 2023 and 2022, the balance of prepaid expenses totaled $0 and $5,958, respectively. The balance at June 30, 2022 related to the annual disclosure and news service subscription for OTC Markets which will be amortized monthly over the course of the year commencing July 1, 2022.\nNOTE 5. ACCOUNTS PAYABLE AND ACCRUALS\nAs of June 30, 2023 and 2022, the balance of accounts payable and accrued expenses was $33,912 and $22,404, respectively.\nAs of June 30, 2023, $29,262 the balance was due to our share transfer agent and $4,650 related to accounting fees.\nAs of June 30, 2022, the entire balance of $21,417 was due to our share transfer agent and the balance of $987 related to filing fees.\nNOTE 6. LOAN PAYABLE - RELATED PARTY\nAs of June 30, 2023, and 2022, the balance outstanding under the loan payable - related party was $7,759 and $41,011, respectively.\nDuring the year ended June 30, 2023, one of our directors, who is also our principal shareholder, advanced to us $7,858 by way of a loan to finance our working capital requirements.\nThe loan is unsecured, interest free and due on demand.\nAs further discussed in Note 7. Promissory Notes - Related Parties below, in December 2022, $41,110 of this loan balance was converted into a Promissory Note - Related Party.\n.\nNOTE 7. PROMISSORY NOTES - RELATED PARTIES\nAs of June 30, 2023, and 2022, the balance outstanding under promissory notes - related parties was $50,380 and $0, respectively. The balance at June 30, 2023 included accrued interest of $270.\nWe entered into a Promissory Note (Note 1) with Legacy Technology Holdings, Inc. for $9,000 due on demand for advances totaling $9,000 made in November 2022. Note 1 incurred no interest unless it defaults after demand and thereafter at 12% per annum. It is unsecured. Our directors, Calvin D. Smiley, Sr. and Redgie Green are also directors of Legacy Technology Holdings, Inc. and Mr. Green is the CEO/President of Legacy Technology Holdings, Inc.\nWe also entered into a further Promissory Note (Note 2) in the amount of $41,110 with Michael A Littman, an affiliate of our principal shareholder, Michael A Littman Atty Defined Benefit Plan in respect of funds he had already advanced to us as further discussed in Note 6. Loan Payable - Related Party above. Note 2 is due on demand and bears no interest unless demand is made and then the default rate is 12% per annum. It is unsecured.\nEffective February 23, 2023, Note 1 with Legacy Technology Holdings, Inc. was amended such that, commencing January 1, 2023, the Note incurred interest of 6% per year, and was given a maturity date of August 31, 2023.\nNOTE 8. INCOME TAXES\nWe did not provide any current or deferred US federal income tax provision or benefit for the years ending June 30, 2023 and 2022 as we incurred tax losses during both of these years.\nWhen it is more likely than not, that a tax asset cannot be realized through future income, we must record an allowance against any future potential future tax benefit. We have provided a full valuation allowance against the net deferred tax asset, consisting of net operating loss carry forwards, because management has determined that it is\nmore likely than not that we will not earn income sufficient to realize the deferred tax assets during the carry forward periods.\nThe Company has not taken a tax position that, if challenged, would have a material effect on the financial statements for the years ended June 30, 2023 and 2022 as defined under ASC 740, \"Accounting for Income Taxes.\" We did not recognize any adjustment to the liability for uncertain tax position and therefore did not record any adjustment to the beginning balance of the accumulated deficit on the balance sheet.\nThe provision for income taxes differs from the amount computed by applying the statutory federal income tax rate to income before provision for income taxes.\nThe sources and tax effects of the differences for the periods presented are as follows:\nFor The Year ended June 30, 2023 For The Year ended June 30, 2022\nStatutory U.S. Federal Income Tax Rate 21 % 21 %\nState Income Taxes 5 % 5 %\nChange in Valuation Allowance (26 )% (26 )%\nEffective Income Tax Rate 0 % 0 %\nA reconciliation of the income taxes computed at the statutory rate is as follows:\nFor The Year ended June 30, 2023 For The Year ended June 30, 2022\nTax credit (expense) at statutory rate (26%) $ 8,910 $ 10,346\nIncrease in valuation allowance (8,910 ) (10,346 )\nNet deferred tax assets $ -\n$ -\nAs of June 30, 2023, the Company had a federal net operating loss carryforward of approximately $95,000. The federal net operating loss carryforward do not expire but may only be used against taxable income to 80%. No tax benefit has been reported in the financial statements. The annual offset of this carryforward loss against any future taxable profits may be limited under the provisions of Internal Revenue Code Section 381 upon any future change(s) in control of the Company.\nNOTE 9. COMMITMENTS & CONTINGENCIES\nLegal Proceedings\nWe were not subject to any legal proceedings during the years ended June 30, 2023 and 2022, and, to the best of our knowledge, no legal proceedings are pending or threatened.\nContractual Obligations\nWe are not party to any contractual obligations at this time.\nNOTE 10. SHAREHOLDERS DEFICIT\nCommon Stock\nAs of June 30, 2023, we were authorized to issue 500,000,000 shares of common stock with a par value of $0.0001.\nNo shares of common stock were issued during the year ended June 30, 2023.\nDuring year ended June 30, 2022, we issued 50,000 shares of common stock, valued at $12,500 as partial consideration of the sale our former subsidiary company.\nAs of June 30, 2023 and June 30, 2022, 1,697,200 shares of common stock were issued and outstanding.\nWarrants\nNo warrants were issued or outstanding during the years ended June 30, 2023 and 2022.\nStock Options\nWe currently have no stock option plan.\nNo stock options were issued or outstanding during the years ended June 30, 2023 and 2022.\nNOTE 11. SUBSEQUENT EVENTS\nThe Company evaluated subsequent events after June 30, 2023, in accordance with FASB ASC 855 Subsequent Events, through the date of the issuance of these financial statements and has determined there have been no subsequent event for which disclosure is required. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE.\nNone. ITEM 9A. CONTROLS AND PROCEDURES.\nEvaluation of Disclosure Controls and Procedures\nOur management conducted an evaluation, with the participation of our Chief Executive Officer, who is our principal executive officer, and our Chief Financial Officer, who is our principal financial and accounting officer, of the effectiveness of our disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934, as amended (the Exchange Act)) as of the end of the period covered by this Annual Report on Form 10-K. Based on that evaluation, we concluded that because of the material weakness and significant deficiencies in our internal control over financial reporting described below, our disclosure controls and procedures were not effective as of June 30, 2023.\nManagements Annual Report on Internal Control over Financial Reporting\nManagement is responsible for the preparation of our financial statements and related information. Management uses its best judgment to ensure that the financial statements present accurately, in material respects, our financial position and results of operations in fairness and conformity with generally accepted accounting principles.\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting as defined in the Exchange Act. These internal controls are designed to provide reasonable assurance that the reported financial information is presented fairly, that disclosures are adequate, and that the assumptions and opinions in the preparation of financial statements are reasonable. There are inherent limitations in the effectiveness of any system of internal controls, including the possibility of human error and overriding of controls. Consequently, an ineffective internal control system can only provide reasonable, not absolute, assurance with respect to reporting financial information.\nOur internal control over financial reporting includes policies and procedures that: (i) pertain to maintaining records that, in reasonable detail, accurately and fairly reflect our transactions; (ii) provide reasonable assurance that transactions are recorded as necessary for preparation of our financial statements in accordance with generally accepted accounting principles and that the receipts and expenditures of company assets are made in accordance with our managements and directors authorization; and (iii) provide reasonable assurance regarding the prevention or timely detection of unauthorized acquisition, use, or disposition of assets that could have a material effect on our financial statements.\nWe conducted an evaluation of the effectiveness of our internal control over financial reporting, based on the framework in Internal Control Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) and published in 2013, and subsequent guidance prepared by COSO specifically for smaller public companies. Based on that evaluation, management concluded that our internal control over financial reporting was not effective as of June 30, 2023 for the reasons discussed below.\nA significant deficiency is a deficiency, or combination of deficiencies in internal control over financial reporting, that adversely affects the entitys ability to initiate, authorize, record, process, or report financial data reliably in accordance with generally accepted accounting principles such that there is more than a remote likelihood that a misstatement of the entitys financial statements that is more than inconsequential will not be prevented or detected by the entitys internal control. A material weakness is a deficiency or a combination of deficiencies in internal control over financial reporting such that there is a reasonable possibility that a material misstatement of the annual or interim consolidated financial statements will not be prevented or detected on a timely basis. Management identified the following material weakness and significant deficiencies in its assessment of the effectiveness of internal control over financial reporting as of June 30, 2023:\n● Lack of a functioning audit committee and lack of a majority of outside directors on our board of directors,\nresulting in ineffective oversight in the establishment and monitoring of required internal controls and procedures;\n● Inadequate segregation of duties consistent with control objectives;\n● Insufficient written policies and procedures for accounting and financial reporting with respect to the requirements and application of US GAAP and SEC disclosure requirements; and\n● Ineffective controls over period end financial disclosure and reporting processes.\nThere are no assurances that the material weaknesses and significant deficiencies in our disclosure controls and procedures and internal control over financial reporting will not result in errors in our financial statements, which could lead to a restatement of those financial statements. Our management does not expect that our disclosure controls and procedures or our internal controls will prevent all error and all fraud. A control system, no matter how well conceived and maintained, can provide only reasonable, not absolute, assurance that the objectives of the control system are met. Further, the design of a control system must account for resource constraints. In addition, the benefits of controls must be considered relative to their costs. Due to the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues and instances of fraud, if any, can and will be detected.\nThis Form 10-K does not include an attestation report from our registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by the Companys registered public accounting firm pursuant to rules of the Commission that permit us to provide only managements report in this annual report on Form 10-K.\nChanges in Internal Controls over Financial Reporting\nThere have been no changes in our internal control over financial reporting the year ended June 30, 2023 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. ITEM 9B. OTHER INFORMATION.\nNone.\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS.\nNot applicable.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE.\nDirectors and Executive Officers\nThe following table sets forth the names, ages, and positions with us for each of our directors and officers as of June 30, 2023:\nName Age Position Since\nCalvin Smiley CEO/President, Director, Acting CFO\nMichael A. Littman Secretary/ Director\nRedgie Green Director\nCalvin D. Smiley, Sr., Chief Executive Officer, President, Acting Chief Financial Officer and Director\nMr. Smiley has been Chief Executive Officer, President, Acting Chief Financial Officer and Director since March 5, 2021 (Inception).\nMr. Smiley has more than 30 years in the broadcasting and cable television industries. He has been a director of Bio Lab Naturals, Inc. since February 2020. He was appointed the Chief Executive Officer, President and a Director of the Nexhorizon, Inc. in October 2006. He previously had co-founded Sunrise Broadband Group, Inc. from 2004 through 2006. From 2001 to 2003, he was a telecommunications consultant and began work to develop the Sunrise business strategy. Mr. Smiley held various executive positions with TCOM Ventures Corporation headquartered in Englewood, Colorado. From 2000 to 2001 he served as a director, President and CEO of TCOM Ventures, with a business focus to use a digital wireless platform to provide broadband services to customers of acquired rural ISPs and competitive local exchange carriers (CLECs). From 1998 to 1999, he co-founded and served as President of Communicast, Inc., a successful turn-key marketing and advertising sales company which developed revenues for rural cable television systems, wireless providers and independent television stations.\nHe was CEO and Director of 30 DC, Inc. 30DC Merger Co., 30 Opsco, Inc. from 2021 until its reorganization into Apogee 21 Holdings Inc. in 2022 and Apogee 21 Holdings, Inc., Perigee Holdings, Inc., CRWG Merger Co, and Crowdgather, Inc. (of Delaware) since 2022. He has been a Director of Legacy Technology Holdings, Inc. since 2022.\nHe became a Director and CEO of Crowdgather, Inc. and CRWG Merger Co. in 2021 until reorganized into Perigee Holdings, Inc. in 2022 and He became a Director of Vapor Hub International, Inc. (of Delaware), VH Merger Co., reorganized into Asberry 22 Holdings, Inc. since 2022 until 2023. Mr. Smiley also served as President and Director of JV Group, Inc. from April 2021 until November 2021.\nMichael A. Littman, Secretary and Director\nMr. Littman was appointed Secretary and Director on March 5, 2021 (Inception).\nMichael A. Littman, (J.D. 1973 Stetson College of Law) (Eckerd College 1970 B.A.) served as house counsel for Chicago Title Insurance Company 1973 - 1975 in the Denver office. Increasing securities matters in the real estate syndication business led to a Securities practice emphasis since 1981, to where the practice has been exclusively corporate securities practice for public companies. Career experience includes commercial litigation, public and private offerings, mergers and acquisitions, mortgage banking, REO management, bankruptcy reorganizations, and private corporate restructuring.\nHe has filed and brought effective IPO's and Secondary Registrations with SEC. He handled quarterly and annual reporting with the SEC for over 50 public reporting companies. He has acted as securities counsel in acquisitions and mergers of public companies and in acquisitions of private companies by public companies in conjunction with recapitalizations. He has handled duties of getting companies cleared for trading with FINRA, and its predecessor NASD, for over 65 companies. He has acted as legal counsel for companies and\nindividuals in civil proceedings with the SEC. He has handled private placements of securities including Memorandum drafting for over 50 Private Placements.\nHe has negotiated PIPEs and convertible debt situations for clients, from the public/private company side, and occasionally from the funder's side. He was a Panel Speaker for the IQPC PIPEs conferences (January 2007, July 2007 and January 2008).\nHe has 45 years of legal experience in representing companies in the industry fields of software, oil and gas, real estate, mining, nutritional supplements, energy saving technology, publishing, and manufacturing.\nHe was Secretary and Director of JV Group, Inc. (April-November 2021). Mr. Littman was Secretary and Director of Crowdgather, Inc., CRWG Merger Co., and Crowdgather, Inc. (of Delaware) since 2021 to 2022 which all were reorganized into Perigee Holdings, Inc. in 2022 serving until 2023 He was Secretary and Director of 30DC, Inc., 30DC Merger Co., 30 Opsco, Inc., until they were reorganized into Apogee 21 Holdings, Inc since November 2021, serving until 2023. He was also Secretary and Director of Vapor Hub International, Inc. (of Delaware), VH Merger Co., until reorganized into Asberry 22 Holdings, Inc. in 2022. He remained an officer and director of Asberry 22 Holdings, Inc. until 2023.\nRedgie Green, Director\nMr. Green was appointed Director on March 5, 2021 (Inception).\nMr. Green was Chief Executive Officer and director of Canning Street Corp. since September 15, 2020 (Inception) to 2022, and was a director and Chief Executive Officer of Alexandria Advantage Warranty Company (its predecessor company) from December 9, 2019 to September 30, 2020 which was reorganized into Global Innovative Platforms, Inc. Mr. Green was a director and officer of Fuquan Financial Co (fka Southwestern Water Exploration, Inc.) from February 2017 through March 7, 2018, a director of Golden Dragon Holding Corp. from 2006 to 2014, President and Chief Executive Officer (until 2014) and a Director of Legacy Technology Holdings, Inc. since October 2010, a Director of Momentum BioFuels, Inc. (predecessor to Vector 21 Holdings, Inc.) since May 2012. Mr. Green was co-owner and operator of Green's B&R Enterprises, a wholesale donut baker from 1983 to 1990. He has been an active investor in small capital and high-tech adventures since 1987. Mr. Green was a director of IntreOrg Systems, Inc. from March 2008 until October 2017 and of International Paintball, Inc. from 2008 to 2012. He was CEO and director of Capital Franchising Inc. from 2012 to 2014 and then again, he was an officer and director from 2014 to 2015 (as Jubilee 4Gold, Inc.). He was the President and director of Strategic Pharma Information Sciences, Inc. from May 2017 to January 2018. He has been President and Director of Legacy Technology Holdings, Inc. since 2014. He has been a Director of Medical Innovation Holdings, Inc. since February 5, 2019. He was appointed Interim CEO of Medical Innovation Holdings, Inc. on May 7, 2019. He was a Director of 30DC, Inc., 30DC Merger Co. and 30 Opsco, Inc. from June 2021 until the reorganization into Apogee 21 Holdings, Inc.in 2022. He was a Director of Crowdgather, Inc., CRWG Merger Co., and Crowdgather, Inc. (of Delaware) since 2021 until reorganization into Perigee Holdings Inc. in 2022, and CEO and Director of Vapor Hub International, Inc. VH Merger Co from 2022 until reorganized into Asberry 22 Holdings, Inc in 2022 and he served until 2023. Mr. Green has also been CEO and a director of Saxon Capital Group, Inc. (fka Atlas Technology Group, Inc.) since July 2021. Mr. Green also served as Director of JV Group, Inc. until November 2021. Mr. Green has been a Director of Apogee 21 Holdings, Inc. and Perigree 22 Holdings, Inc. since November 2021. He has been a director of Legacy Technology Holdings, Inc. since 2015. He has been a Director and CEO of Solanbridge, Inc. since September 22, 2021. He is also CEO and Director of Annabidiol, Inc. since 2019 and Jagged Edge Mountain Gear, Inc. since 2021. Mr. Green was a Director of TPT Strategic, Inc. from 2018-2020. He has also been a Director of Qlinks America, Inc. since 2021.\nNo family relationships exist between any of the officers or Directors of the Company.\nCONFLICTS OF INTEREST - GENERAL.\nOur directors and officers are, or may become, in their individual capacities, officers, directors, controlling shareholder and/or partners of other entities engaged in a variety of businesses. Thus, there exist potential conflicts of interest including, among other things, time, efforts and corporation opportunity, involved in participation with\nsuch other business entities. While our sole officer and director of our business is engaged in business activities outside of our business, he devotes to our business such time as he believes to be necessary.\nCONFLICTS OF INTEREST - CORPORATE OPPORTUNITIES\nPresently no requirement contained in our Articles of Incorporation, Bylaws, or minutes which requires officers and directors of our business to disclose to us business opportunities which come to their attention. Our officers and directors do, however, have a fiduciary duty of loyalty to us to disclose to us any business opportunities which come to their attention, in their capacity as an officer and/or director or otherwise. Excluded from this duty would be opportunities which the person learns about through his involvement as an officer and director of another company. We have no intention of merging with or acquiring an affiliate, associate person or business opportunity from any affiliate or any client of any such person.\nCOMMITTEES OF THE BOARD OF DIRECTORS\nIn the ordinary course of business, the board of directors maintains a compensation committee and an audit committee.\nThe primary function of the compensation committee is to review and make recommendations to the board of directors with respect to the compensation, including bonuses, of our officers and to administer the grants under our stock option plan.\nThe functions of the audit committee are to review the scope of the audit procedures employed by our independent auditors, to review with the independent auditors our accounting practices and policies and recommend to whom reports should be submitted, to review with the independent auditors their final audit reports, to review with our internal and independent auditors our overall accounting and financial controls, to be available to the independent auditors during the year for consultation, to approve the audit fee charged by the independent auditors, to report to the board of directors with respect to such matters and to recommend the selection of the independent auditors.\nIn the absence of a separate audit committee our board of directors functions as audit committee and performs some of the same functions of an audit committee, such as recommending a firm of independent certified public accountants to audit the annual financial statements; reviewing the independent auditors independence, the financial statements and their audit report; and reviewing management's administration of the system of internal accounting controls.\n(REMAINDER OF PAGE LEFT BLANK INTENTIONALLY) ITEM 11. EXECUTIVE COMPENSATION.\nSummary of Executives and Director Compensation Table\nExecutive compensation during the years ended June 30, 2023 and 2022 was as follows:\nNAME AND PRINCIPAL POSITION YEAR SALARY BONUS STOCK AWARDS OPTIONS\nAWARDS ($)\nNONQUALIFIED DEFERRED COMPENS-\nATION ($)\nALL OTHER COMP TOTAL\nCalvin D. Smiley, Sr., Chief Executive Officer, President,\nActing Chief Financial Officer, and\nDirector $ 0 $ 0 $ 0 $ 0 $ 0 $ 0 $ 0\n$ 0 $ 0 $ 0 $ 0 $ 0 $ 0 $ 0\nMichael A. Littman,\nSecretary and Director $ 0 $ 0 $ 0 $ 0 $ 0 $ 0 $ 0\n$ 0 $ 0 $ 0 $ 0 $ 0 $ 0 $ 0\nRedgie Green,\nDirector $ 0 $ 0 $ 0 $ 0 $ 0 $ 0 $ 0\n$ 0 $ 0 $ 0 $ 0 $ 0 $ 0 $ 0 ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS.\nThe following table sets forth as of June 30, 2023 the number and percentage of the outstanding shares of common stock 1,697,200, which according to the information available to us, were beneficially owned by:\n(i) each person who is currently a director,\n(ii) each executive officer,\n(iii) all current directors and executive officers as a group, and\n(iv) each person who is known by us to own beneficially more than 5% of our outstanding common stock.\nExcept as otherwise indicated, the persons named in the table have sole voting and dispositive power with respect to all shares beneficially owned, subject to community property laws where applicable.\nTitle of Class\nName and Address of\nBeneficial Owners (1)\nAmount and Nature\nof Beneficial Ownership\nPercent of Class (2)\nCommon\nCalvin D. Smiley, Sr., Chief Executive Officer, President, Acting Chief Financial Officer and Director\n%\nCommon\nMichael A. Littman, Secretary and Director (3)\n875,000\n51.55 %\nCommon\nRedgie Green, Director\n%\nAll directors and officers as a group\n875,000\n51.55 %\nNo other shareholder owns 5% or more\n(1) 12136 West Bayaud Avenue, Suite 300, Lakewood, CO 80228\n(2) Based on 1,697,200 common shares issued and outstanding as of October 23, 2023.\n(3) Through Michael A. Littman ATTY, Defined Benefit Plan of which he is Trustee.\nAs of the date of this filing and since June 30, 2023, there have been no issuances of any other class of stock, warrants, options or any other security. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE.\nOur Director, Mr. Littman, controls the common stock through his Defined Benefit Plan, owning 875,000 shares of common stock.\nWe entered into a Promissory Note (Note 1) with Legacy Technology Holdings, Inc. for $9,000 due on demand for advances totaling $9,000 made in November 2022. Note 1 incurred no interest unless it defaults after demand and thereafter at 12% per annum. It is unsecured. Our directors, Calvin D. Smiley, Sr. and Redgie Green are also directors of Legacy Technology Holdings, Inc. and Mr. Green is the CEO/President of Legacy Technology Holdings, Inc.\nWe also entered into a further Promissory Note (Note 2) in the amount of $41,110 with Michael A Littman, an affiliate of our principal shareholder, Michael A Littman Atty Defined Benefit Plan in respect of funds he had already advanced to us as further discussed in Note 6. Loan Payable - Related Party above. Note 2 is due on demand and bears no interest unless demand is made and then the default rate is 12% per annum. It is unsecured.\nEffective February 23, 2023, Note 1 with Legacy Technology Holdings, Inc. was amended such that, commencing January 1, 2023, the Note incurred interest of 6% per year, and was given a maturity date of August 31, 2023. ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES.\nThe following is a summary of the fees billed to the Company by its independent registered Public Accounting firm for the years ended June 30, 2023 and 2022:\nFor The Year Ended June 30, 2023 For The Year\nEnded June 30, 2022\nAudit fees $ 3,750 $ 12,000\nAudit related fees - -\nAll other fees - -\nTax fees - -\nTotal $ 3,750 $ 12,000\nAudit Fees. Audit fees consist of fees for the audit of our annual financial statements or services that are normally provided in connection with statutory and regulatory annual and quarterly filings or engagements.\nAudit-Related Fees. Audit-related fees consist of fees for accounting, assurance and related services that are reasonably related to the performance of the audit or review of our financial statements and are not reported as Audit Fees.\nTax Fees. Tax fees consist of fees for tax compliance services, tax advice and tax planning.\nAll Other Fees. Any other fees not included in Audit Fees, Audit-Related Fees, or Tax Fees.\nPART IV ITEM 15. EXHIBIT AND FINANCIAL STATEMENT SCHEDULES.\nThe following exhibits are incorporated into this Form 10-K Annual Report:\nExhibit No.\nDescription\n2.1\nAmended Agreement and Plan of Merger and Reorganization into a Holding Company Structure (1)\n2.2\nShare Purchase Agreement (2)\n3(i).1\nCertificate of Incorporation (1)\n3(i).2\nCertificate of Amendment of Certificate of Incorporation (1)\n3(ii).3\nBylaws of Vector 21 Holdings, Inc. (1)\n4.1\nConvertible Promissory Note - Michael A. Littman (1)\n4.2\nConvertible Promissory Note - Legacy Technology Holdings, Inc. (1)\n31.1\nCertification of Chief Executive Officer and Acting Chief Financial Officer Pursuant to Rule 13a-14(a) or 15d-14(a) of the Securities Exchange Act of 1934*\n32.1\nCertification of Chief Executive Officer and Acting Chief Financial Officer under Section 1350 as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002*\n101.INS\nInline XBRL Instance Document - the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document. *\n101.SCH\nXBRL Taxonomy Extension Schema Document *\n101.CAL\nXBRL Taxonomy Extension Calculation Linkbase Document *\n101.DEF\nXBRL Taxonomy Extension Definition Linkbase Document *\n101.LAB\nXBRL Taxonomy Extension Label Linkbase Document *\n101.PRE\nXBRL Taxonomy Extension Presentation Linkbase Document *\nCover Page Interactive Data File (formatted as Inline XBRL and contained within Exhibit 101) *\n_________________________________\n* Filed Herewith\n(1) Incorporated by reference from the exhibits included in the Companys Form 10-12g filed with the SEC dated December 14, 2022.\nITEM 16. FORM 10-K SUMMARY\nNot applicable.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities and Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nOctober 30, 2023 VECTOR 21 HOLDINGS, INC.\n/s/ Calvin D. Smiley, Sr.\nCalvin D. Smiley, Sr.,\nChief Executive Officer and Director\n(Principal Executive Officer)\n/s/ Calvin D. Smiley, Sr.\nCalvin D. Smiley, Sr.,\nActing Chief Financial Officer and Director\n(Principal Accounting Officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nOctober 30, 2023 /s/ Calvin D. Smiley, Sr.\nCalvin D. Smiley, Sr.,\nChief Executive Officer, Acting Chief Financial Officer and Director\nOctober 30, 2023 /s/ Michael A. Littman\nMichael A. Littman, Secretary and Director\nOctober 30, 2023 /s/ Redgie Green\nRedgie Green, Director\n0.02 0.02\nfalse FY\n2022-07-01 2023-06-30\n2022-12-31\n2023-10-23\n2023-06-30\n2022-06-30\nus-gaap:RelatedPartyMember\n2023-06-30\nus-gaap:RelatedPartyMember\n2022-06-30\n2021-07-01 2022-06-30\nus-gaap:CommonStockMember\n2021-06-30\nvhld:CommonSharesToBeIssuedMember\n2021-06-30\nus-gaap:AdditionalPaidInCapitalMember\n2021-06-30\nus-gaap:RetainedEarningsMember\n2021-06-30\n2021-06-30\nus-gaap:CommonStockMember\n2021-07-01 2022-06-30\nvhld:CommonSharesToBeIssuedMember\n2021-07-01 2022-06-30\nus-gaap:AdditionalPaidInCapitalMember\n2021-07-01 2022-06-30\nus-gaap:RetainedEarningsMember\n2021-07-01 2022-06-30\nus-gaap:CommonStockMember\n2022-06-30\nvhld:CommonSharesToBeIssuedMember\n2022-06-30\nus-gaap:AdditionalPaidInCapitalMember\n2022-06-30\nus-gaap:RetainedEarningsMember\n2022-06-30\nus-gaap:CommonStockMember\n2022-07-01 2023-06-30\nvhld:CommonSharesToBeIssuedMember\n2022-07-01 2023-06-30\nus-gaap:AdditionalPaidInCapitalMember\n2022-07-01 2023-06-30\nus-gaap:RetainedEarningsMember\n2022-07-01 2023-06-30\nus-gaap:CommonStockMember\n2023-06-30\nvhld:CommonSharesToBeIssuedMember\n2023-06-30\nus-gaap:AdditionalPaidInCapitalMember\n2023-06-30\nus-gaap:RetainedEarningsMember\n2023-06-30\n2021-06-01 2021-06-28\n2021-06-28\nvhld:RelatedPartyTransactionsMember\n2023-06-30\n2022-12-01 2022-12-31\n2022-11-30\nvhld:LegacyTechnologyHoldingsIncMember\n2022-11-30\nvhld:LegacyTechnologyHoldingsIncMember\n2023-06-30\nvhld:MichaelALittmanMember\n2023-06-30\nvhld:PromissoryNoteMember\n2023-06-30\nvhld:PromissoryNoteMember\n2023-02-23\nvhld:PromissoryNoteMember\n2023-02-23 2023-02-23\niso4217:USD\nxbrli:shares\niso4217:USD\nxbrli:shares\nxbrli:pure"
}