{
    "cik": "1935033",
    "company": "KEEMO Fashion Group Ltd",
    "filing_type": "10-K",
    "filing_date": "2023-10-25",
    "period_of_report": "2023-07-31",
    "sic": "5130",
    "state_of_inc": "NV",
    "state_location": "F4",
    "fiscal_year_end": "0731",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1935033/0001493152-23-038190-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1935033/000149315223038190/form10-k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1935033/0001493152-23-038190.txt",
    "filename": "1935033_10K_2023_0001493152-23-038190.htm",
    "content": "ITEM 1. BUSINESS\nOverview\nKeemo Fashion Group Limited, a Nevada corporation (the Company) was incorporated under the laws of the State of Nevada on April 22, 2022.\nKEEMO Fashion Group Limited is a company that operates in the apparel and garment trade industry through wholesaling mens and womens apparel to retailers in Asian countries. At present, the Company has primarily focused its efforts on attracting small to medium apparel and garment retailers by wholesaling low to mid-range apparel and garments. We do not maintain and operate any production and manufacturing of apparel facility or machine and equipment.\nThe Companys executive office is located at 69, Wanke Boyu, Xili Liuxin 1st Rd, Nanshan District, Shenzhen, Guangdong 518052, China.\nDescription of Business\nKeemo Fashion Group Limited, a Nevada corporation (the Company) was incorporated under the laws of the State of Nevada on April 22, 2022.\nOn April 22, 2022 Ms. Liu Lu was appointed as Chief Executive Officer, President, Secretary, Treasurer, and Director.\nPrimarily, the products that we carry are targeted towards customers, both men and women, from 18 to 40 years of age. It is the companys belief that the products we wholesale have an appealing presentation, cover a diverse range of clothing and garment types, are stylish for any occasion (including casual, work, and dressy), and they are offered at accessible price points. We believe that this combination of factors will assist our growth moving forward and that we have the opportunity to capture a significant portion of the growing apparel and garment market in Asian countries specifically.\nAt present, the Company sells all of its products through word-of-mouth and utilization of our sole officers business network and various connections. Ms. Liu, our sole officer and director, has broad knowledge and experience in marketing strategies and promotional activities. She is familiar with marketing execution and promotional marketing methodology, which she intends to utilize to assist the Company to gain market awareness and locate potential distributors as precisely and efficiently as possible.\nBusiness Model\nThe Company currently primarily sources mid-priced womens semi-formal apparel, which the company believes potentially has a higher gross profit margin compared to low-priced apparel. Inventory is presently selected at the discretion of our sole officer and director, and based upon recommendations from the suppliers regarding the latest fashion trends and styles, as well as what types of clothing are currently the most sought after by consumers. The Company also performs internal analysis to compare the profit margins of various types of clothing and, accordingly, seeks to primarily acquire inventory that has the greatest profit margin.\nAt present, when identifying potential customers, the Company targets small size apparel retailers, especially home-based e-commerce retailers. In the opinion of the Companys sole officer and director, this market is easier to penetrate as our officer and director believes that many small size apparel retailers are just side or part time businesses for the business owner. As such, the business owners might face the problem of lack of capacity to arrange the logistics and filter the correct apparel in term of trend and quality.\nThe Company adopts what is commonly referred to as a virtual network business structure, as the Company only maintains internal procurement, sales, marketing, operational, accounting and finance functions, whereby the Company relies on suppliers for other crucial function such as production and packaging, storage, courier inward and outward, etc. However, in some instances the Company does take physical possession of inventory. In most cases, the Company purchases inventory from the suppliers, and this inventory is then held at the suppliers warehouse, although the product is owned by the Company at this time, and delivery from the warehouse is arranged by the Company through a courier service. In some instances, the Company will take possession of the inventory and store apparel at the Companys office, and from that point courier service to the purchaser is arranged. There is no formal method of determination as to what items will be stored in the suppliers warehouse versus what items will be stored at the Companys office.\nSales and Marketing\nKEEMO Fashion Group Limited plans to penetrate the marketplace and attract customers by building our brand image through print ads, and possibly online paid advertisements, to create brand awareness. We have prepared our corporate website (https://keemofashiongroup.wixsite.com/keemo-fashion-group) to market our Company and we utilize search engine marketing to improve the number of distributors who can find and view our website. Finally, we also have yet unidentified plans to market our Company through social networking websites. All the above marketing plans have not yet been determined in sufficient detail to outline at this time, nor do we have a definitive timeline for when our marketing strategy will be completed, and as such all of our marketing endeavors remain under development.\nEmployees and Function\nCurrently, we have one employee which is our President and Sole Director, Ms. Liu Lu. Currently, Ms. Liu has the flexibility to work on our business up to 30 hours per week but is prepared to devote more time if necessary. The Company intends to hire more employees who possess industry-related experience to assist in the development and execution of our business operations.\nWe do not presently have pension, health, annuity, insurance, stock options, profit sharing, or similar benefit plans; however, we may adopt plans in the future. There are presently no personal benefits available to our employee, Officer and/or Director.\nCompetition\nKEEMO Fashion Group Limited plans to operate in a mature and competitive industry. We consider our focus to be on distributors in China first. Competition in the apparel and garment industry, with a focus on low to mid-range priced products, is very intense in China. We face competition from various specialized and retail-based wholesalers, from different provinces and cities, which supply similar mens and womens apparel and garment products to those that we offer. We also face competition from e-commerce-based wholesalers, many of whom have exposure in various China whole websites and B2B platform, such as Alibaba, DHgate, AliExpress, and Global Sources. These competitors generate significant traffic and have established brand recognition and financial resources manufacturing capacity, well established business models and distribution channels and branding.\nDespite intense competition, our director is confident in the Companys ability to develop and enlarge our market share in China through, at present, the various relationships of the Companys sole Officer and Director.\nEnforcement of Civil Liabilities under United States Federal Securities Laws\nWe are a Nevada corporation and most of our operations are and will be located outside of the United States and our sole officer and director resides outside the United States. Moreover, a majority of our assets are located outside the United States. Since a majority of the assets owned by us are located outside the United States, any judgment obtained in the United States against us may not be collectible within the United States. There is no treaty between the United States and China providing for the reciprocal recognition and enforcement of judgments in civil and commercial matters and a final judgment for the payment of money rendered by any federal or state court in the United States based on civil liability, whether or not predicated solely upon the federal securities laws, would, therefore, not be automatically enforceable in China. Under the PRC Civil Procedures Law, foreign shareholders may originate actions based on PRC law against us in the PRC, if they can establish sufficient nexus to the PRC for a PRC court to have jurisdiction, and meet other procedural requirements, including, among others, the plaintiff must have a direct interest in the case, and there must be a concrete claim, a factual basis and a cause for the suit.\nThere is uncertainty as to whether the courts of China would (1) recognize or enforce judgments of United States courts obtained against us or our directors or officers predicated upon the civil liability provisions of the securities laws of the United States or any state in the United States, or (2) entertain original actions brought in each respective jurisdiction against us or our directors or officers predicated upon the securities laws of the United States or any state in the United States.\nThe recognition and enforcement of foreign judgments are provided for under the PRC Civil Procedures Law. PRC courts may recognize and enforce foreign judgments in accordance with the requirements of the PRC Civil Procedures Law based either on treaties between China and the country where the judgment is made or on principles of reciprocity between jurisdictions. China does not have any treaties or other form of reciprocity with the United States that provide for the reciprocal recognition and enforcement of foreign judgments. In addition, according to the PRC Civil Procedures Law, courts in China will not enforce a foreign judgment against us or our directors and officers if they decide that the judgment violates the basic principles of PRC law or national sovereignty, security or public interest. As a result, it is uncertain whether and on what basis a PRC court would enforce a judgment rendered by a court in the United States. Under the PRC Civil Procedures Law, foreign shareholders may originate actions based on PRC law against us in the PRC, if they can establish sufficient nexus to the PRC for a PRC court to have jurisdiction, and meet other procedural requirements, including, among others, the plaintiff must have a direct interest in the case, and there must be a concrete claim, a factual basis and a cause for the suit.\nIn addition, it will be difficult for U.S. shareholders to originate actions against us in China in accordance with PRC laws because we are incorporated under the laws of State of Nevada and it will be difficult for U.S. shareholders, holding our common stock, to establish a connection to China for a PRC court to have jurisdiction as required under the PRC Civil Procedures Law. ITEM 1A. RISK FACTORS\nWe are a smaller reporting company as defined by Rule 12b-2 of the Securities Exchange Act of 1934 and are not required to provide the information under this item. ITEM 1B. UNRESOLVED STAFF COMMENTS\nWe are a smaller reporting company as defined by Rule 12b-2 of the Securities Exchange Act of 1934 and are not required to provide the information under this item. ITEM 2. DESCRIPTION OF PROPERTY\nWe do not own any real estate or other properties. Our office is located at 69 Wanke Boyu, Xili Liuxin 1st Rd, Nanshan District, Shenzhen, Guangdong 518052, China.\nThe Company utilizes home office space of its management at no cost. The companys home office space is 34.78 square meters or approximately 374 square feet. There is no agreement pertaining to utilizing the home office space of management, and management is free to discontinue providing the office space at any time and without notice. The Company does not own, rent, or lease any properties. ITEM 3. LEGAL PROCEEDINGS\nFrom time to time, we may become involved in various lawsuits and legal proceedings which arise in the ordinary course of business. Litigation is subject to inherent uncertainties, and an adverse result in these or other matters may arise from time to time that may harm our business. There are currently no pending legal proceedings or claims that we believe will have a material adverse effect on our business, financial condition or operating results. None of our directors, officers or affiliates is involved in a proceeding adverse to our business or has a material interest adverse to our business. ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable. ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY AND RELATED STOCKHOLDER MATTERS\nHolders\nAs of July 31, 2023, we have 31 shareholders on record of our common stock.\nTransfer Agent and Registrar\nThe transfer agent for our capital stock is Transfer Online, Inc, with an address at 512 SE Salmon St., Portland, OR 97214, United States and telephone number is +1 (503) 227-2950.\nPenny Stock Regulations\nThe Securities and Exchange Commission has adopted regulations which generally define penny stock to be an equity security that has a market price of less than $5.00 per share. Our Common Stock, when and if a trading market develops, may fall within the definition of penny stock and be subject to rules that impose additional sales practice requirements on broker-dealers who sell such securities to persons other than established customers and accredited investors (generally those with assets in excess of $1,000,000, or annual incomes exceeding $200,000 individually, or $300,000, together with their spouse).\nFor transactions covered by these rules, the broker-dealer must make a special suitability determination for the purchase of such securities and have received the purchasers prior written consent to the transaction. Additionally, for any transaction, other than exempt transactions, involving a penny stock, the rules require the delivery, prior to the transaction, of a risk disclosure document mandated by the Securities and Exchange Commission relating to the penny stock market. The broker-dealer also must disclose the commissions payable to both the broker-dealer and the registered representative, current quotations for the securities and, if the broker-dealer is the sole market-maker, the broker-dealer must disclose this fact and the broker-dealers presumed control over the market. Finally, monthly statements must be sent disclosing recent price information for the penny stock held in the account and information on the limited market in penny stocks. Consequently, the penny stock rules may restrict the ability of broker-dealers to sell our Common Stock and may affect the ability of investors to sell their Common Stock in the secondary market.\nIn addition to the penny stock rules promulgated by the Securities and Exchange Commission, the Financial Industry Regulatory Authority (FINRA) has adopted rules that require that in recommending an investment to a customer, a broker-dealer must have reasonable grounds for believing that the investment is suitable for that customer. Prior to recommending speculative low-priced securities to their non-institutional customers, broker-dealers must make reasonable efforts to obtain information about the customers financial status, tax status, investment objectives and other information. Under interpretations of these rules, FINRA believes that there is a high probability that speculative low-priced securities will not be suitable for at least some customers. The FINRA requirements make it more difficult for broker-dealers to recommend that their customers buy our common stock, which may limit the investors ability to buy and sell our stock.\nDividends\nAny future determination as to the declaration and payment of dividends on shares of our Common Stock will be made at the discretion of our board of directors out of funds legally available for such purpose. We are under no contractual obligations or restrictions to declare or pay dividends on our shares of Common Stock. In addition, we currently have no plans to pay such dividends. Our board of directors currently intends to retain all earnings for use in the business for the foreseeable future.\nRecent Sales of Unregistered Securities\nNo securities have been sold by the Company during the period covered by this Form 10-K.\nPurchases of Equity Securities by the Registrant and Affiliated Purchasers\nWe have not repurchased any shares of our common stock during the fiscal year ended July 31, 2023.\nOther Stockholder Matters\nNone. ITEM 6. SELECTED FINANCIAL DATA\nWe are a smaller reporting company as defined by Rule 12b-2 of the Securities Exchange Act of 1934 and are not required to provide the information under this item. ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion and analysis of our results of operations and financial condition for fiscal year ended July 31, 2023 should be read in conjunction with our financial statements and the notes to those financial statements that are included elsewhere in this report. Some of the information contained in this managements discussion and analysis or set forth elsewhere in this Annual Report, including information with respect to our plans and strategy for our business and related financing, includes forward looking statements that involve risks, uncertainties and assumptions. As a result of many factors, including those factors set forth in the Risk Factors section in Form S-1/A registration statement, filed on May 12, 2023, our actual results could differ materially from the results described in or implied by the forward-looking statements contained in this Annual Report.\nOverview\nWe, KEEMO Fashion Group Limited, a Nevada corporation (the Company) was incorporated under the laws of the State of Nevada on April 22, 2022.\nKEEMO Fashion Group Limited is headquartered in Shenzhen, People Republic of China (herein referred as (China). We primarily operate in men and women apparel and garment trading business, focusing on wholesaling to distributors mainly based in Asian countries, sourcing directly from manufacturers in China. We do not maintain and operate any production and manufacturing of apparel facility or machine and equipment.\nThe Companys executive office is located at 69, Wanke Boyu, Xili Liuxin 1st Rd, Nanshan District, Shenzhen, Guangdong 518052, China.\nOur cash and cash equivalents are $28,743 as of July 31, 2023. Our cash balance is not sufficient to fund our limited levels of operations for any period of time. In order to continue our current business plan and increase our current level of operations for the next twelve-month period, we require further funding.\nFor the year ended July 31, 2023, the Company incurred a net loss of $22,196 and used cash in operating activities of $17,837 and borrowed $14,647 from our director. These conditions raise substantial doubt about the Companys ability to continue as a going concern. The ability to continue as a going concern is dependent upon the Companys profit generating operations in the future and/or obtaining the necessary financing to meet its obligations and repay its liabilities arising from normal business operations when they become due. These consolidated financial statements do not include any adjustments to the recoverability and classification of recorded asset amounts and classification of liabilities that might be necessary should the Company be unable to continue as a going concern.\nThe Company expects to finance its operations primarily through cash flow from revenue and continuing financial support from a shareholder. In the event that we require additional funding to finance the growth of the Companys current and expected future operations as well as to achieve our strategic objectives, the shareholder has indicated the intent and ability to provide additional financing.\nNo assurance can be given that any future financing, if needed, will be available or, if available, that it will be on terms that are satisfactory to the Company. Even if the Company is able to obtain additional financing, if needed, it may contain undue restrictions on its operations, in the case of debt financing, or cause substantial dilution for its stockholders, in the case of equity financing.\nResults of operations for the year ended July 31, 2023\nRevenues\nFor the years ended July 31, 2023, the Company has generated a revenue of $16,945. The revenue was generated through wholesaling mens and womens apparel and garments to retailers.\nFrom April 22, 2022 (Date of Inception) to July 31, 2022, the Company has generated a revenue of $15,636. The revenue was generated through wholesaling mens and womens apparel and garments to retailers.\nGeneral and Administrative Expenses\nFor the years ended July 31, 2023, the Company incurred general and administrative expenses of $30,605. These were primarily comprised of audit fees, stock and registrar fees, legal fees, bank charges and other professional fees.\nFrom April 22, 2022 (Date of Inception) to July 31, 2022, the Company incurred general and administrative expenses of $24,591. These were primarily comprised of legal and professional fees, company incorporation fees and audit fees.\nNet Loss\nFor the years ended July 31, 2023, the Company incurred a net loss of $22,196.\nFrom April 22, 2022 (Date of Inception) to July 31, 2022, the Company incurred a net loss of $16,574.\nLiquidity and Capital Resources\nThe Companys cash and cash equivalents has increased by $10,663, from $18,080 as of July 31, 2022 to $28,743 as of July 31, 2023. The accompanying financial statements have been prepared on a going concern basis, which contemplates the realization of assets and the settlement of liabilities and commitments in the normal course of business.\nCash Used in Operating Activities\nFor the year ended July 31, 2023, the Company has used $17,837 in operating activities, which was primarily attributable to net loss from operation, increase in accounts receivable, increase in prepayment, increase in inventories, increase in the amount due to our director, Ms. Liu Lu and increase in other accruals.\nFrom April 22, 2022 (Date of Inception) to July 31, 2022, the Company has received $14,480 from operating activities, which was primarily attributable to net loss from operation and increase in inventories, increase in the amount due to our director, Ms. Liu Lu and increase in other accruals.\nCash Provided by Financing Activities\nOn April 22, 2022, our sole officer and director, Liu Lu, purchased 3,600,000 shares of restricted common stock at a purchase price of $0.001 (par value). The $3,600 in proceeds went directly to the Company to be used for working capital.\nFor the year ended July 31, 2023, the Company received $28,500 from financing activities primarily from issuance of shares of common stock pursuant to our initial public offering closing at July 26, 2023.\nFrom April 22, 2022 (Date of Inception) to April 30, 2022, the Company received $3,600 from financing cash flow consists of issuance of shares of common stock pursuant to our public offering.\nOff-Balance Sheet Arrangement\nWe have no significant off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial condition, changes in our financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources that are material to our stockholders as of July 31, 2023.\nContractual Obligation\nAs a smaller reporting company, we are not required to provide the aforementioned information. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nWe are a smaller reporting company as defined by Rule 12b-2 of the Securities Exchange Act of 1934 and are not required to provide the information under this item. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nThe financial statements required by this item are located following the signature page of this Annual Report. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNot Applicable ITEM 9A. CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nWe conducted an evaluation under the supervision and with the participation of our management, including our Chief Executive Officer, of the effectiveness of the design and operation of our disclosure controls and procedures. The term disclosure controls and procedures, as defined in Rules 13a-15(e) and 15d-15(e) under the Securities and Exchange Act of 1934, as amended (Exchange Act), means controls and other procedures of a company that are designed to ensure that information required to be disclosed by the company in the reports it files or submits under the Exchange Act is recorded, processed, summarized and reported, within the time periods specified in the Securities and Exchange Commissions rules and forms. Disclosure controls and procedures also include, without limitation, controls and procedures designed to ensure that information required to be disclosed by a company in the reports that it files or submits under the Exchange Act is accumulated and communicated to the companys management, including its principal executive and principal financial officers, or persons performing similar functions, as appropriate, to allow timely decisions regarding required disclosure. Based on this evaluation, our Chief Executive Officer concluded as of July 31, 2023, that our disclosure controls and procedures were not effective. The matters involving internal controls and procedures that our management considered to be material weaknesses under the standards of the Public Company Accounting Oversight Board were: (1) lack of a functioning audit committee due to a lack of a majority of independent members and a lack of a majority of outside directors on our board of directors, resulting in ineffective oversight in the establishment and monitoring of required internal controls and procedures; (2) inadequate segregation of duties and effective risk assessment ; (3) insufficient written policies and procedures for accounting and financial reporting with respect to the requirements and application of both US GAAP and SEC guidelines; and (4) lack of internal audit function due to the fact that the Company lacks qualified resources to perform the internal audit functions properly and that the scope and effectiveness of the internal audit function are yet to be developed. The aforementioned material weaknesses were identified by our Chief Executive Officer in connection with the review of our financial statements as of July 31, 2023.\nManagement believes that the material weaknesses set forth in items (2) and (3) above did not have an effect on our financial results. However, management believes that the lack of a functioning audit committee and the lack of a majority of outside directors on our board of directors results in ineffective oversight in the establishment and monitoring of required internal controls and procedures, which could result in a material misstatement in our financial statements in future periods.\nManagements Report on Internal Control Over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act. Our internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. The internal controls for the Company are provided by executive managements review and approval of all transactions. Our internal control over financial reporting also includes those policies and procedures that:\n● Pertain to the maintenance of records that in reasonable detail accurately and fairly reflect the transactions and dispositions of the assets of the Company;\n● Provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with accounting principles generally accepted in the United States of America and that receipts and expenditures of the Company are being made only in accordance with authorizations of management and directors of the Company; and\n● Provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of the Companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nManagement assessed the effectiveness of the Companys internal control over financial reporting as of July 31, 2023. In making this assessment, management used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission in Internal Control-Integrated Framework. Managements assessment included an evaluation of the design of our internal control over financial reporting and testing of the operational effectiveness of these controls.\nBased on this assessment, management has concluded that as of July 31, 2023, our internal control over financial reporting was not effective to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with U.S. generally accepted accounting principles. In an effort to remediate the identified material weaknesses and other deficiencies and enhance our internal controls, we have initiated, or plan to initiate, the following series of measures:\nWe will increase our personnel resources and technical accounting expertise within the accounting function. We will create a position to segregate duties consistent with control objectives. And, we plan to appoint one or more outside directors to our board of directors who shall be appointed to an audit committee resulting in a fully functioning audit committee who will undertake the oversight in the establishment and monitoring of required internal controls and procedures such as reviewing and approving estimates and assumptions made by management when funds are available to us.\nWe anticipate that these initiatives will be at least partially, if not fully, implemented by the end of fiscal year 2024.\nChanges in Internal Control over Financial Reporting\nThere was no change in our internal controls over financial reporting that occurred during the period covered by this Report, which has materially affected, or is reasonably likely to materially affect, our internal controls over financial reporting:\nThis annual report does not include an attestation report of the Companys registered independent public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by the Companys registered independent public accounting firm pursuant to rules of the Securities and Exchange Commission that permit the Company to provide only managements report in this Annual Report on Form 10-K. ITEM 9B. OTHER INFORMATION\nNone.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nSet forth below are the present directors and executive officers of the Company. Note that there are no other persons who have been nominated or chosen to become directors nor are there any other persons who have been chosen to become executive officers. There are no arrangements or understandings between any of the directors, officers and other persons pursuant to which such person was selected as a director or an officer. Directors are elected to serve until the next annual meeting of stockholders and until their successors have been elected and have qualified. Officers are appointed to serve until the meeting of the board of directors following the next annual meeting of stockholders and until their successors have been elected and qualified.\nName\nAge\nPositions and Offices\nLiu Lu\nChief Executive Officer, President, Secretary, Treasurer, Director\nLiu Lu - Chief Executive Officer, President, Secretary, Treasurer, Director\nIn 2017, Ms. Liu graduated from the Sichuan University, Undergraduate Program for Specialty in Computer Science and Technology. From July 2017 to present, Ms. Liu works in the promotional department at the Tencent Interactive Entertainment Group, which is a division of Tencent Holdings that publishes and develops video games for multiple platforms. From July 2017 to August 2017, she was responsible for three initiatives, which are event planning, content operation, and market promotional and platform collaboration for the project Deformers, a PC game. Regarding event planning, she handled event execution and post-event analysis. For content operation, she handled the official website construction, content creation, and content planning. For market promotion and platform collaboration, she handled marketing of the game, which involved collaboration with different online and media platforms. From August 2018 until present, Ms. Liu has been mainly responsible for the project Rocket League, which is an online game. She mainly responsible on the resource allocation, event planning and execution, post-event analysis and the user operation. Ms. Lius position at Tencent Holdings is a full-time job, to which she devotes approximately 45 hours per week.\nIn April 2022, Ms. Liu founded KEEMO Fashion Group Limited, and as a result of her promotional, organizational, and marketing experience, it is the determination of the board that she serves as our Chief Executive Officer, President, Secretary, Treasurer, and Director.\nCorporate Governance\nThe Company promotes accountability for adherence to honest and ethical conduct; endeavors to provide full, fair, accurate, timely and understandable disclosure in reports and documents that the Company files with the Securities and Exchange Commission and in other public communications made by the Company; and strives to be compliant with applicable governmental laws, rules and regulations. The Company has not formally adopted a written code of business conduct and ethics that governs the Companys employees, officers and Directors as the Company is not required to do so.\nIn lieu of an Audit Committee, the Companys Board of Directors, is responsible for reviewing and making recommendations concerning the selection of outside auditors, reviewing the scope, results and effectiveness of the annual audit of the Companys financial statements and other services provided by the Companys independent public accountants. The Board of Directors and the Chief Executive Officer of the Company review the Companys internal accounting controls, practices and policies.\nCommittees of the Board\nOur Company currently does not have nominating, compensation, or audit committees or committees performing similar functions nor does our Company have a written nominating, compensation or audit committee charter. Our Director(s) believe that it is not necessary to have such committees, at this time, because the Directors can adequately perform the functions of such committees.\nAudit Committee Financial Expert\nOur Board of Directors has determined that we do not have a board member that qualifies as an audit committee financial expert as defined in Item 407(D)(5) of Regulation S-K, nor do we have a Board member that qualifies as independent as the term is used in Item 7(d)(3)(iv)(B) of Schedule 14A under the Securities Exchange Act of 1934, as amended, and as defined by Rule 4200(a)(14) of the FINRA Rules.\nWe believe that our Director(s) are capable of analyzing and evaluating our financial statements and understanding internal controls and procedures for financial reporting. The Director(s) of our Company does not believe that it is necessary to have an audit committee because management believes that the Board of Directors can adequately perform the functions of an audit committee. In addition, we believe that retaining an independent Director who would qualify as an audit committee financial expert would be overly costly and burdensome and is not warranted in our circumstances given the stage of our development and the fact that we have not generated any positive cash flows from operations to date.\nInvolvement in Certain Legal Proceedings\nOur Directors and our Officers have not been involved in any of the following events during the past ten years:\n1. bankruptcy petition filed by or against any business of which such person was a general partner or executive officer either at the time of the bankruptcy or within two years prior to that time;\n2. any conviction in a criminal proceeding or being subject to a pending criminal proceeding (excluding traffic violations and other minor offenses);\n3. being subject to any order, judgment, or decree, not subsequently reversed, suspended or vacated, of any court of competent jurisdiction, permanently or temporarily enjoining, barring, suspending or otherwise limiting his/her involvement in any type of business, securities or banking activities; or\n4. being found by a court of competent jurisdiction (in a civil action), the Commission or the Commodity Futures Trading Commission to have violated a federal or state securities or commodities law, and the judgment has not been reversed, suspended, or vacated.\n5. Such person was found by a court of competent jurisdiction in a civil action or by the Commission to have violated any Federal or State securities law, and the judgment in such civil action or finding by the Commission has not been subsequently reversed, suspended, or vacated;\n6. Such person was found by a court of competent jurisdiction in a civil action or by the Commodity Futures Trading Commission to have violated any Federal commodities law, and the judgment in such civil action or finding by the Commodity Futures Trading Commission has not been subsequently reversed, suspended or vacated;\n7. Such person was the subject of, or a party to, any Federal or State judicial or administrative order, judgment, decree, or finding, not subsequently reversed, suspended or vacated, relating to an alleged violation of: (i) Any Federal or State securities or commodities law or regulation; or(ii) Any law or regulation respecting financial institutions or insurance companies including, but not limited to, a temporary or permanent injunction, order of disgorgement or restitution, civil money penalty or temporary or permanent cease-and-desist order, or removal or prohibition order; or(iii) Any law or regulation prohibiting mail or wire fraud or fraud in connection with any business entity; or\n8. Such person was the subject of, or a party to, any sanction or order, not subsequently reversed, suspended or vacated, of any self-regulatory organization (as defined in Section 3(a)(26) of the Exchange Act (15 U.S.C. 78c(a)(26))), any registered entity (as defined in Section 1(a)(29) of the Commodity Exchange Act (7 U.S.C. 1(a)(29))), or any equivalent exchange, association, entity or organization that has disciplinary authority over its members or persons associated with a member.\nIndependence of Directors\nWe are not required to have independent members of our Board of Directors, and do not anticipate having independent Directors until such time as we are required to do so.\nCode of Ethics\nWe have not adopted a formal Code of Ethics. The Board of Directors evaluated the business of the Company and the number of employees and determined that since the business is operated by a small number of persons, general rules of fiduciary duty and federal and state criminal, business conduct and securities laws are adequate ethical guidelines. In the event our operations, employees and/or Directors expand in the future, we may take actions to adopt a formal Code of Ethics.\nShareholder Proposals\nOur Company does not have any defined policy or procedural requirements for shareholders to submit recommendations or nominations for Directors. The Board of Directors believes that, given the stage of our development, a specific nominating policy would be premature and of little assistance until our business operations develop to a more advanced level. Our Company does not currently have any specific or minimum criteria for the election of nominees to the Board of Directors and we do not have any specific process or procedure for evaluating such nominees. The Board of Directors will assess all candidates, whether submitted by management or shareholders, and make recommendations for election or appointment.\nA shareholder who wishes to communicate with our Board of Directors may do so by directing a written request addressed to our Sole Officer and Director, Liu Lu, at the address appearing on the first page of this Registration Statement.\nSECTION 16(A) BENEFICIAL OWNERSHIP REPORTING COMPLIANCE\nSection 16(a) of the Securities Exchange Act requires our executive officers and directors, and persons who own more than 10% of our common stock, to file reports regarding ownership of, and transactions in, our securities with the Securities and Exchange Commission and to provide us with copies of those filings. Based solely on our review of the copies of such forms furnished to us and written representations by our officers and directors regarding their compliance with applicable reporting requirements under Section 16(a) of the Exchange Act, we believe that all Section 16(a) filing requirements for our executive officers, directors and 10% stockholders were met during the year ended July 31, 2023. ITEM 11. EXECUTIVE COMPENSATION\nMANAGEMENT COMPENSATION\nThe following tables set forth certain information about compensation paid, earned or accrued for services by our Executive Officer from July 31, 2022 to July 31, 2023:\nSummary Compensation Table\nSummary Compensation Table\nName\nand\nprincipal\nposition\n(a)\nYear\nended\nJuly 31\n(b) Salary ($)\n(c) Bonus ($)\n(d) Stock Compensation ($)\n(e) Option\nAwards ($)\n(f) Non-Equity\nIncentive\nPlan\nCompensation ($)\n(g) Nonqualified\nDeferred\nCompensation\nEarnings ($)\n(h) All Other\nCompensation ($)\n(i) Total ($)\n(j)\nLiu Lu,\nChief Executive Officer, President, Secretary, Treasurer, Director\n$ - - - - - - - $ -\nStock Option Grants\nWe have not granted any stock options to our executive officers since our incorporation.\nEmployment Agreements\nWe do not have an employment or consulting agreement with any officers or Directors.\nCompensation Discussion and Analysis\nDirector Compensation\nOur Board of Directors does not currently receive any consideration for their services as members of the Board of Directors. The Board of Directors reserves the right in the future to award the members of the Board of Directors cash or stock-based consideration for their services to the Company, which awards, if granted shall be in the sole determination of the Board of Directors.\nExecutive Compensation Philosophy\nOur Board of Directors determines the compensation given to our executive officers in their sole determination. Our Board of Directors reserves the right to pay our executive or any future executives a salary, and/or issue them shares of common stock in consideration for services rendered and/or to award incentive bonuses which are linked to our performance, as well as to the individual executive officers performance. This package may also include long-term stock-based compensation to certain executives, which is intended to align the performance of our executives with our long-term business strategies. Additionally, while our Board of Directors has not granted any performance base stock options to date, the Board of Directors reserves the right to grant such options in the future, if the Board in its sole determination believes such grants would be in the best interests of the Company.\nIncentive Bonus\nThe Board of Directors may grant incentive bonuses to our executive officer and/or future executive officers in its sole discretion, if the Board of Directors believes such bonuses are in the Companys best interest, after analyzing our current business objectives and growth, if any, and the amount of revenue we are able to generate each month, which revenue is a direct result of the actions and ability of such executives.\nLong-term, Stock Based Compensation\nIn order to attract, retain and motivate executive talent necessary to support the Companys long-term business strategy we may award our executive and any future executives with long-term, stock-based compensation in the future, at the sole discretion of our Board of Directors, which we do not currently have any immediate plans to award. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nAs of July 31, 2023, the Company has 5,500,000 shares of common stock issued and outstanding, which number of issued and outstanding shares of common stock have been used throughout this report.\nName and Address of\nBeneficial Owner Shares of\nCommon\nStock\nBeneficially\nOwned Common\nStock Voting\nPercentage\nBeneficially\nOwned Voting\nShares of\nPreferred\nStock Preferred\nStock Voting\nPercentage\nBeneficially\nOwned Total Voting\nPercentage\nBeneficially\nOwned\nExecutive Officers and Directors\nLiu Lu\nChief Executive Officer, President, Secretary, Treasurer and Director 3,600,000 65 % - - 65 %\n5% or Greater Shareholders - - - - -\n*Officers and or Directors who may hold a 5% or greater controlling interest in the Company are included above, but only under the subtitle, Executive Officers and Directors.\nBeneficial ownership has been determined in accordance with Rule 13d-3 under the Exchange Act. Under this rule, certain shares may be deemed to be beneficially owned by more than one person (if, for example, persons share the power to vote or the power to dispose of the shares). In addition, shares are deemed to be beneficially owned by a person if the person has the right to acquire shares (for example, upon exercise of an option or warrant) within 60 days of the date as of which the information is provided. In computing the percentage ownership of any person, the amount of shares is deemed to include the amount of shares beneficially owned by such person by reason of such acquisition rights. As a result, the percentage of outstanding shares of any person as shown in the following table does not necessarily reflect the persons actual voting power at any particular date. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, DIRECTOR INDEPENDENCE\nOn April 23, 2022, we issued 3,600,000 shares of our common stock to Ms. Liu Lu, our Chief Executive Officer, President, Secretary, Treasurer, and Director in consideration of $3,600, or $0.001 per share.\nIn regards to the above transaction we claim an exemption from registration afforded by Regulation S of the Securities Act of 1933, as amended (Regulation S) for the above sale of stock since the sale of stock was made to a non-U.S. person (as defined under Rule 902 section (k)(2)(i) of Regulation S), pursuant to offshore transactions, and no directed selling efforts were made in the United States by the issuer, a distributor, any of their respective affiliates, or any person acting on behalf of any of the foregoing.\nAs of July 31, 2022, our sole director, Ms. Liu Lu, advanced $25,758 to the Company, which is unsecured and non-interest bearing, and payable upon demand. Proceeds from the offering herein will not be used to repay the loan to Ms. Liu Lu.\nAs of October 31, 2022, the sole director of the Company advanced $26,958 to the Company, which is unsecured and non-interest bearing with no fixed terms of repayment.\nAs of January 31, 2023, the sole director of the Company advanced $30,419 to the Company, which is unsecured and non-interest bearing with no fixed terms of repayment.\nOn July 26, 2023, we issued 1,900,000 shares of our common stock in consideration of $28,500, or $0.015 per share through initial public offering.\nReview, Approval and Ratification of Related Party Transactions\nGiven our small size and limited financial resources, we have not adopted formal policies and procedures for the review, approval or ratification of transactions, such as those described above, with our executive officer(s), Director(s) and significant stockholders. We intend to establish formal policies and procedures in the future, once we have sufficient resources and have appointed additional Directors, so that such transactions will be subject to the review, approval or ratification of our Board of Directors, or an appropriate committee thereof. On a moving forward basis, our Directors will continue to approve any related party transaction. ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES\nAudit Fees\nThe following table sets forth the aggregate fees billed to the Company by its independent registered public accounting firms for the fiscal years ended July 31, 2023 and 2022. We have engaged JP Centurion & Partners PLT as our independent registered public accounting firm since August 17, 2022.\nACCOUNTING FEES AND SERVICES\nAudit fees $ 17,100 $ 7,500\nAudit-related fees - -\nTax fees - -\nAll other fees - -\nTotal $ 17,100 $ 7,500\nThe category of Audit fees includes fees for our annual audit, quarterly reviews and services rendered in connection with regulatory filings with the SEC, such as the issuance of comfort letters and consents.\nThe category of Audit-related fees includes employee benefit plan audits, internal control reviews and accounting consultation.\nThe category of Tax services includes tax compliance, tax advice, tax planning.\nThe category of All other fees generally includes advisory services related to accounting rules and regulations.\nAll of the professional services rendered by principal accountants for the audit of our annual financial statements that are normally provided by the accountant in connection with statutory and regulatory filings or engagements for last two fiscal years were approved by our board of directors.\nPART IV ITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n(a) Financial Statements\nThe following are filed as part of this report:\nFinancial Statements\nThe following financial statements of Keemo Fashion Group Limited and Report of Independent Registered Public Accounting Firm are presented in the F pages of this Report:\nPage\nAudited Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nCONSOLIDATED BALANCE SHEETS\nCONSOLIDATED STATEMENTS OF OPERATIONS AND COMPREHENSIVE LOSS\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS EQUITY\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS -\n(b) Exhibits\nThe following exhibits are filed herewith:\n31.1\nRule 13(a)-14(a)/15(d)-14(a) Certification of principal executive officer, principal financial officer*\n32.1\nSection 1350 Certification of principal executive officer, principal financial officer and principal accounting officer*\n101.INS*\nInline XBRL Instance Document\n101.SCH*\nInline XBRL Taxonomy Extension Schema Document\n101.CAL*\nInline XBRL Taxonomy Extension Calculation Linkbase\n101.DEF*\nInline XBRL Taxonomy Extension Definition Linkbase\n101.LAB*\nInline XBRL Taxonomy Extension Labels Linkbase\n101.PRE*\nInline XBRL Taxonomy Extension Presentation Linkbase\n104*\nCover Page Interactive Data File (embedded within the Inline XBRL document)\n*Filed herewith\nITEM 16. FORM 10-K SUMMARY\nAs permitted, the registrant has elected not to supply a summary of information required by Form 10-K.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this Report to be signed on its behalf by the undersigned, thereunto duly authorized.\nKeemo Fashion Group Limited\nDate: October 25, 2023 By: /s/ Liu Lu\nLiu Lu\nChief Executive Officer, President, Secretary, Treasurer, and Director\n(Principal Executive Officer, Principal Financial Officer, Principal Accounting Officer)\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Registrant, and in the capacities and on the dates indicated:\nSignature\nTitle\nDate\n/s/ Liu Lu\nChief Executive Officer, President, Secretary, Treasurer, Director\nLiu Lu\n(Principal Executive Officer, Principal Financial Officer and Principal Accounting Officer)\nOctober 25, 2023\nKeemo Fashion Group Limited\nPage\nAudited Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM (PCAOB ID: 6723)\nCONSOLIDATED BALANCE SHEETS\nCONSOLIDATED STATEMENTS OF OPERATIONS AND COMPREHENSIVE LOSS\nCONSOLIDATED STATEMENTS OF CHANGES IN STOCKHOLDERS EQUITY\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS -\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nThe Board of Directors and Stockholders of\nKeemo Fashion Group Limited\nWanke Boyu\nXili Liuxin 1st Rd\nNanshan District, Shenzhen\nGuangdong\nChina.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of KEEMO Fashion Group Limited (the ‘Company) as of July 31, 2023 and 2022, and the related consolidated statements of operations and comprehensive loss, stockholders equity, and cash flows for the each of two years in the year ended of July 31, 2023 and 2022, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of July 31, 2023 and 2022, and the results of its operations and its cash flows for the each of two years in the year ended July 31, 2023 and 2022, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\nGoing Concern\nThe accompanying financial statements have been prepared assuming that the Company will continue as a going concern. As discussed in Note 2 to the financial statements, for the financial year ended July 31, 2023, the Companys losses from operations, accumulated deficit, net current liabilities, and negative operating cash flows raise substantial doubt about its ability to continue as a going concern. Managements plans regarding those matters also are described in Note 2. The financial statements do not include any adjustments that might result from the outcome of this uncertainty.\nCritical Audit Matters\nCritical audit matters are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to those charged with governance and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgements. We determined that there are no critical matters.\n/s/ JP CENTURION & PARTNERS PLT\nJP CENTURION & PARTNERS PLT (ID: 6723)\nWe have served as the Companys auditor since 2022.\nKuala Lumpur, Malaysia\nOctober 25, 2023\nItem 1. Financial Statements\nKEEMO FASHION GROUP LIMITED\nCONSOLIDATED BALANCE SHEETS\nAS OF JULY 31, 2023 AND 2022\n(Currency expressed in United States Dollars (US$), except for number of shares)\nAs of\nJuly 31, 2023 As of July 31, 2022\n(Audited) (Audited)\nASSETS\nCURRENT ASSETS\nCash and cash equivalents $ 28,743 $ 18,080\nAccounts receivable 6,954 -\nInventories 3,405 2,504\nPrepayment 3,933 -\nTOTAL CURRENT ASSETS 43,035 20,584\nTOTAL ASSETS $ 43,035 $ 20,584\nLIABILITIES AND STOCKHOLDERS EQUITY\nCURRENT LIABILITIES\nAmount due to a director 40,405 25,758\nOther accruals 9,300 7,800\nTOTAL CURRENT LIABILITIES 49,705 33,558\nTOTAL LIABILITIES $ 49,705 $ 33,558\nSTOCKHOLDERS EQUITY\nCommon stock - Par value $ 0.001; Authorized: 75,000,000 shares; Issued and outstanding: 5,500,000 and 3,600,000 as of July 31, 2023 and July 31, 2022 respectively $ 5,500 $ 3,600\nAdditional paid in capital 26,600 -\nAccumulated deficit (38,770 ) (16,574 )\nTOTAL STOCKHOLDERS EQUITY $ (6,670 ) $ (12,974 )\nTOTAL LIABILITIES AND STOCKHOLDERS EQUITY $ 43,035 $ 20,584\nSee accompanying notes to consolidated financial statements.\nKEEMO FASHION GROUP LIMITED\nCONSOLIDATED STATEMENTS OF OPERATIONS AND COMPREHENSIVE LOSS\nFOR THE YEARS ENDED JULY 31, 2023 AND 2022\n(Currency expressed in United States Dollars (US$), except for number of shares)\nFor the Years Ended July 31,\n(Audited) (Audited)\nREVENUE $ 16,945 $ 15,636\nCOST OF REVENUE (8,594 ) (7,619 )\nGROSS PROFIT 8,351 8,017\nGENERAL AND ADMINISTRATIVE EXPENSES (30,605 ) (24,591 )\nLOSS FROM OPERATIONS (22,254 ) (16,574 )\nOTHER INCOME -\nLOSS FROM OPERATIONS BEFORE INCOME TAX (22,196 ) (16,574 )\nINCOME TAX EXPENSES - -\nNET LOSS (22,196 ) (16,574 )\nOTHER COMPREHENSIVE LOSS - -\nTOTAL COMPREHENSIVE LOSS $ (22,196 ) $ (16,574 )\nNET LOSS PER SHARE - BASIC AND DILUTED $ (0.01 ) $ (0.00 )\nWEIGHTED AVERAGE NUMBER OF COMMON SHARES OUTSTANDING, BASIC AND DILUTED 4,048,641 3,600,000\nSee accompanying notes to consolidated financial statements.\nKEEMO FASHION GROUP LIMITED\nCONSOLIDATED STATEMENTS OF CHANGES IN STOCKHOLDERS EQUITY\nFOR THE YEARS ENDED JULY 31, 2023 AND 2022\n(Currency expressed in United States Dollars (US$), except for number of shares)\nCOMMON STOCK ADDITIONAL\nNumber of\nshares Amount PAID-IN CAPITAL ACCUMULATED DEFICIT TOTAL EQUITY\nBalance as of April 22, 2022 (Date of Inception) - $ - $ - $ - $ -\nIssuance of share capital, founders shares 3,600,000 3,600 - - 3,600\nNet loss - - - (16,574 ) (16,574 )\nBalance as of July 31, 2022 3,600,000 3,600 - (16,574 ) (12,974 )\nBalance 3,600,000 3,600 - (16,574 ) (12,974 )\nIssuance of share 1,900,000 1,900 26,600 - 28,500\nNet loss - - - (22,196 ) (22,196 )\nBalance as of July 31, 2023 5,500,000 5,500 26,600 (38,770 ) (6,670 )\nBalance 5,500,000 5,500 26,600 (38,770 ) (6,670 )\nSee accompanying notes to consolidated financial statements.\nKEEMO FASHION GROUP LIMITED\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nFOR THE YEARS ENDED JULY 31, 2023 AND 2022\n(Currency expressed in United States Dollars (US$), except for number of shares)\nFor the Years Ended July 31,\n(Audited) (Audited)\nCASH FLOWS FROM OPERATING ACTIVITIES:\nNet loss $ (22,196 ) $ (16,574 )\nChanges in operating assets and liabilities:\nAccounts receivable (6,954 ) -\nPrepayment (3,933 )\nInventories (901 ) (2,504 )\nAmount due to a director 14,647 25,758\nOther accruals 1,500 7,800\nNet cash flows (used in)/from operating activities (17,837 ) 14,480\nCASH FLOWS FROM FINANCING ACTIVITY:\nProceeds from issuance of share 28,500 3,600\nNet cash flows provided by financing activity 28,500 3,600\nEffect of exchange rate changes in cash and cash equivalents - -\nNet changes in cash and cash equivalents 10,663 18,080\nCash and cash equivalents, beginning of year 18,080 -\nCASH AND CASH EQUIVALENTS, END OF YEAR $ 28,743 $ 18,080\nSUPPLEMENTAL CASH FLOWS INFORMATION\nIncome taxes paid $ - $ -\nInterest paid $ - $ -\nSee accompanying notes to consolidated financial statements.\nKEEMO FASHION GROUP LIMITED\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED JULY 31, 2023 AND 2022\n(Currency expressed in United States Dollars (US$), except for number of shares)\n1. ORGANIZATION AND BUSINESS BACKGROUND\nKEEMO Fashion Group Limited, a Nevada corporation, (herein referred as the Company) was incorporated under the laws of the State of Nevada on April 22, 2022.\nKEEMO Fashion Group Limited is headquartered in Shenzhen, People Republic of China (herein referred as (China). We primarily operate in men and women apparel and garment trading business, focusing on wholesaling to distributors mainly based in Asian countries, sourcing directly from manufacturers in China. We do not maintain and operate any production and manufacturing of apparel facility or machine and equipment.\nThe Companys executive office is located at 69, Wanke Boyu, Xili Liuxin 1st Rd, Nanshan District, Shenzhen, Guangdong 518052, China.\n2. SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nBasis of Presentation\nThe accompanying consolidated financial statements of the Company are prepared pursuant to the rules and regulations of the U.S. Securities and Exchange Commission (SEC) and in accordance with generally accepted accounting principles in the United States of America (US GAAP). The Company has adopted July 31 as its fiscal year end.\nGoing Concern\nFor the year ended July 31, 2023, the Company incurred a net loss of $22,196 and used cash in operating activities of $17,837. As of July 31, 2023, the current liabilities of the Company exceeded its current assets by $6,670 and has a shareholders deficits of $6,670. These conditions raise substantial doubt about the Companys ability to continue as a going concern. The ability to continue as a going concern is dependent upon the Companys profit generating operations in the future and/or obtaining the necessary financing to meet its obligations and repay its liabilities arising from normal business operations when they become due. These financial statements do not include any adjustments to the recoverability and classification of recorded asset amounts and classification of liabilities that might be necessary should the Company be unable to continue as a going concern. The Company expects to finance its operations primarily through cash flow from revenue and continuing financial support from a shareholder. In the event that we require additional funding to finance the growth of the Companys current and expected future operations as well as to achieve our strategic objectives, the shareholder has indicated the intent and ability to provide additional financing.\nUse of Estimates\nManagement uses estimates and assumptions in preparing these financial statements in accordance with US GAAP. Those estimates and assumptions affect the reported amounts of assets and liabilities, the disclosure of contingent assets and liabilities in the balance sheets, and the reported revenue and expenses during the periods reported. Actual results may differ from these estimates.\nCash and Cash Equivalents\nCash and cash equivalents are carried at cost and represent cash on hand, demand deposits placed with banks or other financial institutions and all highly liquid investments with an original maturity of three months or less as of the purchase date of such investments.\nRevenue Recognition\nRevenue is generated through wholesale business of men and women apparel and garment to customer. Revenue is recognized when a customer obtains control of promised goods or services and is recognized in an amount that reflects the consideration that the Company expects to receive in exchange for those goods or services. In addition, the standard requires disclosure of the nature, amount, timing, and uncertainty of revenue and cash flows arising from contracts with customers. The amount of revenue that is recorded reflects the consideration that the Company expects to receive in exchange for those goods and services. The Company applies the following five-step model in order to determine this amount:\n(i) identification of the promised goods and services in the contract;\n(ii) determination of whether the promised goods and services are performance obligations, including whether they are distinct in the context of the contract;\n(iii) measurement of the transaction price, including the constraint on variable consideration;\n(iv) allocation of the transaction price to the performance obligations; and\n(v) recognition of revenue when (or as) the Company satisfies each performance obligation.\nThe Company adopted ASU 2014-09, Revenue from Contracts with Customers (Topic 606). Under Topic 606, the Company records revenue when persuasive evidence of an arrangement exists, delivery has occurred, the fee is fixed or determinable and collectability is probable. The Company records revenue from the wholesale of goods upon the delivery of men and women apparel and garment to the customer.\nCost of Revenue\nCost of revenue includes the purchase cost of raw materials for manufacturing and distribute to customers and packing materials. It includes purchasing and receiving costs, internal transfer costs, other costs of distribution network, opening and closing inventory net off discount received and return outwards in cost of revenue.\nEarnings Per Share\nThe Company reports earnings per share in accordance with ASC Topic 260 Earnings Per Share, which requires presentation of basic and diluted earnings per share in conjunction with the disclosure of the methodology used in computing such earnings per share. Basic earnings per share excludes dilution and is computed by dividing income available to common stockholders by the weighted average common shares outstanding during the period. Diluted earnings per share takes into account the potential dilution that could occur if securities or other contracts to issue common stock were exercised and converted into common stock. Further, if the number of common shares outstanding increases as a result of a stock dividend or stock split or decreases as a result of a reverse stock split, the computations of a basic and diluted earnings per share shall be adjusted retroactively for all periods presented to reflect that change in capital structure.\nThe Companys basic earnings per share is computed by dividing the net income available to holders by the weighted average number of the Companys ordinary shares outstanding. Diluted earnings per share reflects the amount of net income available to each ordinary share outstanding during the period plus the number of additional shares that would have been outstanding if potentially dilutive securities had been issued.\nIncome Taxes\nThe Company accounts for income taxes using the asset and liability method prescribed by ASC Topic 740 Income Taxes. Under this method, deferred tax assets and liabilities are determined based on the difference between the financial reporting and tax bases of assets and liabilities using enacted tax rates that will be in effect in the years in which the differences are expected to reverse. The Company records a valuation allowance to offset deferred tax assets if based on the weight of available evidence, it is more-likely-than-not that some portion, or all, of the deferred tax assets will not be realized. The effect on deferred taxes of a change in tax rates is recognized as income or loss in the period that includes the enactment date.\nNew U.S. federal tax legislation, commonly referred to as the Tax Cuts and Jobs Act (the U.S. Tax Reform), was signed into law on December 22, 2017. The U.S. Tax Reform modified the U.S. Internal Revenue Code by, among other things, reducing the statutory U.S. federal corporate income tax rate from 35% to 21% for taxable years beginning after December 31, 2017; limiting and/or eliminating many business deductions; migrating the U.S. to a territorial tax system with a one-time transaction tax on a mandatory deemed repatriation of previously deferred foreign earnings of certain foreign subsidiaries; subject to certain limitations, generally eliminating U.S. corporate income tax on dividends from foreign subsidiaries; and providing for new taxes on certain foreign earnings. Taxpayers may elect to pay the one-time transition tax over eight years, or in a single lump-sum payment.\nRelated Parties\nParties, which can be a corporation or individual, are considered to be related if the Company has the ability, directly or indirectly, to control the other party or exercise significant influence over the other party in making financial and operating decisions. Companies are also considered to be related if they are subject to common control or common significant influence.\nFair Value Measurement\nAccounting Standards Codification (ASC) Topic 820 Fair Value Measurements and Disclosures (ASC Topic 820), which defines fair value, establishes a framework for measuring fair value and expands disclosures about fair value measurements. The statement clarifies that the exchange price is the price in an orderly transaction between market participants to sell the asset or transfer the liability in the market in which the reporting entity would transact for the asset or liability, that is, the principal or most advantageous market for the asset or liability. It also emphasizes that fair value is a market-based measurement, not an entity-specific measurement, and that market participant assumptions include assumptions about risk and effect of a restriction on the sale or use of an asset.\nThis ASC establishes a fair value hierarchy that prioritizes the inputs to valuation techniques used to measure fair value. The hierarchy gives the highest priority to unadjusted quoted prices in active markets for identical assets or liabilities (Level 1 measurements) and the lowest priority to unobservable inputs (Level 3 measurements). The three levels of the fair value hierarchy are described below:\nLevel 1: Unadjusted quoted prices in active markets that are accessible at the measurement date for identical, unrestricted assets or liabilities;\nLevel 2: Quoted prices in markets that are not active, or inputs that are observable, either directly or indirectly, for substantially the full term of the asset or liability; and\nLevel 3: Prices or valuation techniques that require inputs that are both significant to the fair value measurement and unobservable (supported by little or no market activity).\nRecently Issued and Adopted Accounting Standards\nIn June 2016, the FASB issued ASU 2016-13, Measurement of Credit Losses on Financial Instruments (Topic 326). ASU 2016-13 requires entities to use a forward-looking approach based on current expected credit losses (CECL) to estimate credit losses on certain types of financial instruments, including trade receivables. This may result in the earlier recognition of allowances for losses. ASU 2016-13 is effective for the Company beginning January 1, 2023, and early adoption is permitted. The Company does not believe the potential impact of the new guidance and related codification improvements will be material to its financial position, results of operations and cash flows.\nThe Company reviews new accounting standards as issued. Management has not identified any other new standards that it believes will have a significant impact on the Companys present or future financial statements.\n3. INVENTORIES\nAs of July 31, 2023 and 2022, the Company inventories consist of following:\nSCHEDULE OF INVENTORIES\nAs of\nJuly 31, 2023\nAs of\nJuly 31, 2022\nFinished goods $ 3,405 $ 2,504\nTotal inventories $ 3,405 $ 2,504\nNo allowance has been provided for the period ended July 31, 2023.\n4. PREPAYMENT\nAs of July 31, 2023 and 2022, prepayment consist of following:\nSCHEDULE OF PREPAYMENT\nAs of\nJuly 31, 2023\nAs of\nJuly 31, 2022\nOther professional fee $ 3,933 $ -\nTotal prepayment $ 3,933 $ -\n5. AMOUNT DUE TO A DIRECTOR\nSCHEDULE OF AMOUNT DUE TO A DIRECTOR\nAs of\nJuly 31, 2023\nAs of\nJuly 31, 2022\nAmount due to a director $ 40,405 $ 25,758\nAs of July 31, 2023, the sole director of the Company advanced $40,405 to the Company, which is unsecured and non-interest bearing with no fixed terms of repayment.\nOur director, Ms. Liu Lu, has not been compensated for the services.\n6. OTHER ACCRUALS\nSCHEDULE OF OTHER ACCRUALS\nAs of\nJuly 31, 2023\nAs of\nJuly 31, 2022\nAccrued expenses $ 9,300 $ 7,800\nTotal other accruals $ 9,300 $ 7,800\nAccrued expenses for the years ended July 31, 2023 and 2022 consist of accrued audit fees, transfer agent fee and other professional fee.\n7. SHAREHOLDERS EQUITY\nOn April 22, 2022, upon the incorporation of the Company, Liu Lu, subscribed to 3,600,000 shares of common stock at par value of $0.001 per share for a total subscription value of $3,600.\nOn 26 July, 2023, the Company issued 1,900,000 shares of common stock being sold at $0.015 per share for a total of $28,500 through initial public offering.\nAs of July 31, 2023, the Company has 5,500,000 shares of common stock issued and outstanding.\nThe Company has 75,000,000 shares of commons stock authorized.\n8. INCOME TAX\nThe loss from operation before income tax of the Company for the years ended July 31, 2023 and 2022 were comprised of the following:\nSCHEDULE OF LOSS FROM OPERATION BEFORE INCOME TAX\nFor the years ended July 31\nTax jurisdictions from:\n- Local $ (22,196 ) $ (16,574 )\nLoss before income taxes $ (22,196 ) $ (16,574 )\nUnited States of America\nThe Company is registered in the State of Nevada and is subject to the tax laws of the United States of America. As of July 31, 2023, the operations in the United States of America incurred $38,770 of cumulative net operating losses (NOLs) which can be carried forward to offset future taxable income, at the tax rate of 21%. The NOL carry forwards begin to expire in 2043, if unutilized. The Company has provided for a full valuation allowance of approximately $8,142 against the deferred tax assets on the expected future tax benefits from the net operating loss carryforwards as the management believes it is more likely than not that these assets will not be realized in the future.\nThe following table sets forth the significant components of the aggregate deferred tax assets of the Company as of July 31, 2023 and July 31, 2022:\nSCHEDULE OF COMPONENTS OF AGGREGATE DEFERRED TAX ASSETS\nAs of July 31\nDeferred tax assets:\nNet operating loss carryforwards $ $\n- United States of America 8,142 3,481\nLess: valuation allowance (8,142 ) (3,481 )\nDeferred tax assets $ - $ -\nManagement believes that it is more likely than not that the deferred tax assets will not be fully realizable in the future. Accordingly, the Company provided for a full valuation allowance against its deferred tax assets of $8,142 as of July 31, 2023.\n9. CONCENTRATION OF RISK\nCustomer Concentration\nFor the year ended July 31, 2023, the Company generated total revenue of $16,945, of which two customers accounted for 100% of the Companys revenue. The Company has accounts receivable of $6,954 from one of the customers.\nFor the year ended July 31, 2022, the Company generated total revenue of $15,636, of which two customers accounted for the Companys entire revenue.\nSCHEDULE OF CONCENTRATION OF RISK\nFor the year ended July 31\n2022\nRevenues Percentage of\nrevenues\nAccounts\nreceivable, trade\nCustomer A $ - $ 8,059 - % 52 % $ - $ -\nCustomer B - 7,577 - % 48 % - -\nCustomer C 9,991 - 59 % - % - -\nCustomer D 6,954 - 41 % - % 6,954 -\nTotal $ 16,945 $ 15,636 100 % 100 % $ 6,954 $ -\nSupplier Concentration\nFor the year ended July 31, 2023, the Company incurred cost of revenue of $8,594, accounted by two vendors. For the year ended July 31, 2022, the Company incurred cost of revenue of $7,619 solely accounted by a single vendor.\nFor the year ended July 31\n2022\nCost of revenue Percentage of\nCost of revenue\nAccounts\npayable, trade\nVendor A $ 2,292 $ 7,619 27 % 100 % $ - $ -\nVendor B 6,302 - 73 % - % - -\nTotal $ 8,594 $ 7,619 100 % 100 % $ - $ -\n10. SEGMENT REPORTING\nASC 280, Segment Reporting establishes standards for reporting information about operating segments on a basis consistent with the Companys internal organization structure as well as information about services categories, business segments and major customers in financial statements. The Company has single reportable segment based on business unit, apparel and garment trading business and two reportable segments based on country, United States and Non-United States.\nIn accordance with the Segment Reporting Topic of the ASC, the Companys chief operating decision maker has been identified as the Chief Executive Officer and President, who reviews operating results to make decisions about allocating resources and assessing performance for the entire Company. Existing guidance, which is based on a management approach to segment reporting, establishes requirements to report selected segment information quarterly and to report annually entity-wide disclosures about products and services, major customers, and the countries in which the entity holds material assets and reports revenue. All material operating units qualify for aggregation under Segment Reporting due to their similar customer base and similarities in economic characteristics; nature of products and services; and procurement, manufacturing and distribution processes.\nSCHEDULE OF SEGMENT REPORTING\nFor the Year Ended and As of July 31, 2023\nBy Business Unit Apparel & Garment Trading Business Total\nRevenue $ 16,945 $ 16,945\nCost of revenue (8,594 ) (8,594 )\nGeneral and administrative expenses (30,605 ) (30,605 )\nLoss from operations (22,254 ) (22,254 )\nTotal assets $ 43,035 $ 43,035\nCapital expenditure $ - $ -\nFor the Year Ended and As of July 31, 2022\nBy Business Unit Apparel & Garment Trading Business Total\nRevenue $ 15,636 $ 15,636\nCost of revenue (7,619 ) (7,619 )\nGeneral and administrative expenses (24,591 ) (24,591 )\nLoss from operations (16,574 ) (16,574 )\nTotal assets $ 20,584 $ 20,584\nCapital expenditure $ - $ -\nBy Country United States Non-United States Total\nFor the Year Ended and\nAs of July 31, 2023\nBy Country United States Non-United States Total\nRevenue $ - $ 16,945 $ 16,945\nCost of revenue - (8,594 ) (8,594 )\nGeneral and administrative expenses - (30,605 ) (30,605 )\nLoss from operations - (22,254 ) (22,254 )\nTotal assets $ - $ 43,035 $ 43,035\nCapital expenditure $ - $ - $ -\nBy Country United States Non-United States Total\nFor the Year Ended and\nAs of July 31, 2022\nBy Country United States Non-United States Total\nRevenue $ - $ 15,636 $ 15,636\nCost of revenue - (7,619 ) (7,619 )\nGeneral and administrative expenses - (24,591 ) (24,591 )\nLoss from operations - (16,574 ) (16,574 )\nTotal assets $ - $ 20,584 $ 20,584\nCapital expenditure $ - $ - $ -\n11. GOING CONCERN\nFor the year ended July 31, 2023, the Company incurred a net loss of $22,196 and used cash in operating activities of $17,837. As of July 31, 2023, the current liabilities of the Company exceeded its current assets by $6,670 and has a shareholders deficits of $6,670. These conditions raise substantial doubt about the Companys ability to continue as a going concern. The ability to continue as a going concern is dependent upon the Companys profit generating operations in the future and/or obtaining the necessary financing to meet its obligations and repay its liabilities arising from normal business operations when they become due. These financial statements do not include any adjustments to the recoverability and classification of recorded asset amounts and classification of liabilities that might be necessary should the Company be unable to continue as a going concern. The Company expects to finance its operations primarily through cash flow from revenue and continuing financial support from a shareholder. In the event that we require additional funding to finance the growth of the Companys current and expected future operations as well as to achieve our strategic objectives, the shareholder has indicated the intent and ability to provide additional financing.\n12. SUBSEQUENT EVENTS\nIn accordance with ASC Topic 855, Subsequent Events, which establishes general standards of accounting for and disclosure of events that occur after the balance sheet date but before financial statements are issued, the Company has evaluated all events or transactions that occurred after July 31, 2023 up through the date the Company presented these audited financial statements. During the period, the Company did not have any material recognizable subsequent events."
}