{
    "cik": "1938109",
    "company": "Pineapple Financial Inc.",
    "filing_type": "10-K",
    "filing_date": "2023-12-14",
    "period_of_report": "2023-08-31",
    "sic": "6199",
    "state_of_inc": null,
    "state_location": "Z4",
    "fiscal_year_end": null,
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1938109/0001493152-23-044927-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1938109/000149315223044927/form10-k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1938109/0001493152-23-044927.txt",
    "filename": "1938109_10K_2023_0001493152-23-044927.htm",
    "content": "ITEM 1. BUSINESS\nGeneral\nWe are a Canadian-based mortgage technology and brokerage company that provides mortgage brokerage services and technology solutions to Canadian mortgage agents, brokers, sub-brokers, brokerages and consumers. Through data-driven systems together with cloud-based tools, we believe we offer competitive advantages in the Canadian mortgage industry relative to alternative mortgage broker arrangements.\nWe also provide back office services, together with pre-underwriting support services (collectively the Brokerage Services) to Canadian mortgage brokerages (the Brokerages). In connection with the provision of the Brokerage Services, we employ and engage several licensed mortgage brokers and agents (collectively, Field Agents). We have a total of full-time employed staff of 55. In addition, we also enter into affiliation agreements with certain licensed mortgage brokers (collectively, Affiliate Brokers and, together with Field Agents and Brokerages, the Users), pursuant to which the Company and the Affiliate Broker enter into an affiliation relationship with the intention of jointly marketing mortgage brokerage and other financial services as affiliated entities, sometimes referred to as white labelling, which allows the Affiliate Broker to sell a mortgage that is branded with its company name to its own client base.\nOur services distribution and fee structure for each stream is detailed hereunder:\n1. The fee for the subscription service revenue stream is $117 for use of our platforms by our agents to complete the mortgage deal from initiation to funding by the lender partner and is about 3% of total gross revenue.\n2. Our pre-risk assessment services revenue is about 1.3% of our total gross revenue and the structure for this service is $390 per deal for a mortgage funded amount of $390,000 and over. For a mortgage funded amount under $390,000 the fee is $273.\n3. The balance of our total gross revenue at 95% comes from our lender partner service commissions and the structure varies by rate and amount based on the season, special promotions at that particular time, bonus applicable, funded volume, etc. The lender partners comprise of banks, trust companies, mortgage loan companies, building societies and other lending financial institutions, including but not limited to the Bank of Nova Scotia (Scotiabank), Manulife Bank of Canada, Toronto-Dominion Bank (TD Bank), The Mortgage Alliance Company of Canada Inc. (MCAP), First National Financial LP, Home Trust Company, The Equitable Trust Company (Equitable Bank), ICICI Bank Canada and Desjardins Mortgage Financing Services.\nWe currently operate exclusively in Canada, specifically in the provinces of Ontario, Newfoundland and Labrador, New Brunswick, Nova Scotia, British Columbia, Prince Edward Island and Alberta. We launched our first brokerage in Ontario in November 2016. We have been approved by each of the applicable provincial mortgage regulators to operate in 11 provinces and territories namely Alberta, British Columbia, New Brunswick, Newfoundland and Labrador, Northwest Territories, Nova Scotia, Nunavut, Prince Edward Island, Quebec, and Yukon, and 2 provinces to follow are Manitoba and Saskatchewan. We launched our first brokerage office in Alberta on July 1, 2021. We also launched our first brokerage office in Newfoundland and Labrador, Nova Scotia, New Brunswick, and Prince Edward Island on May 4, 2022. Thereafter, we expect to open our first British Columbia brokerage office and our first Quebec brokerage office sometime in late 2022 or early 2023. We provide our Brokerage Services to both residential and commercial mortgage opportunities and, in each case, through a proprietary technology called MyPineapple, as discussed in further detail below.\nMyPineapple\nAt the heart of our Brokerage Services is an innovative technology system, MyPineapple, that provides real time data management and reporting, lead generation opportunities, customer relationship management, deal processing, education and knowledge center, payroll, regulatory compliance, data analytics, document collection and storage, automated onboarding, lender access, back office support and direct underwriting support, all in one. MyPineapple offers network management capabilities for Users, including hundreds of qualified Field Agents, to create an efficient marketplace for the provision of mortgage lending and insurance industry services. MyPineapple integrates directly with Salesforce, Equifax, OneSpan, G Suite and Filogix and manages Users day-to-day business through automated triggers and tasks, ensuring nothing falls through the cracks. Backed by Salesforce, pursuant to the Salesforce Agreement (defined herein), and built with proprietary code deep data analytics, MyPineapple syncs up with Users calendar and emails, produces robust reporting, advanced analytics, and real-time notifications on marketing communications, and more. MyPineapple is a sophisticated and fundamental tool for revenue growth and relationship development. It plays a significant role in what we believe makes our Brokerage Services distinct and cutting-edge.\nMyPineapple was created to address key issues within the mortgage brokerage industry. We built MyPineapple to create a long-term competitive advantage relative to traditional service providers, who have comparatively high-touch, labor intensive and costly operations. We believe that, through MyPineapple, we are able to deliver faster services and with fewer errors. Our MyPineapple platform is completely automated, simplifying the mortgage process while providing efficiencies to and alleviating pressure on Users staff in completing traditional administrative tasks, which in turn reduces the Users cost structure and results in increased profit margins and scalability. MyPineapple reduces manual processes through robust quality control mechanisms, logistics management capabilities, capacity planning tools and end-to-end transaction management. MyPineapple also includes a leading education technology platform, which enables Users to continuously stay informed and educated on what mortgage solutions and market conditions could impact Canadian consumers.\nOur primary objectives and goals include, but are not limited to, the following:\n● Grow our mortgage broker distribution channel to gain further market share and consumer adoption, including increasing organic (non-acquisition related) market share and to achieve growth on the number of mortgages funded annually;\n● Become the go-to mortgage experience platform for mortgage agents, lenders and homebuyers;\n● For Pineapple Insurance to provide an insurance option for all our mortgage approvals;\n● To ensure that we are providing a well-rounded and custom-tailored approach to insurance solutions that may best suit the clients needs;\n● To leverage the power of our growing database and brand recognition to open further insurance opportunity channel; and\nStreamline the insurance approval and application process for mortgage clients using technology.\nServices and Products\nBrokerage Services\nThe following is a detailed description of the Brokerages Services that we offer:\n1. Mortgage Brokering: We employ and engage a number of licensed Field Agents who originate clients, provide mortgage consultation services, advise clients on the various mortgage products offered by financial institutions in Canada, offer clients access to rate information and mortgage options from a range of lenders, including major banks and lending institutions and assist clients in selecting the most appropriate and effective mortgage solution for their particular needs.\n2. Technology: MyPineapple is a full spectrum, robust and comprehensive technology system, which allows Users to conduct their brokerage services more effectively and efficiently. Amongst other things, MyPineapple syncs up with Users calendar and emails, produces robust reporting, advanced analytics, and real-time notifications for email opens, and link clicks. MyPineapple also provides Users with cloud storage. We also provide marketing support to Users in order to systematically manage the marketing process, segmentation and client conversions. We ensure that all clients stay well informed with highly relevant information; it also increases the conversion ratios and engagement metric for its Users. This provides Users the ability to focus on higher probability clients and deliver a high level of value and service while the system manages the relationship with others.\n3. Back Office Support Services: Through MyPineapple, we offer our Users back office support services, including digital and automated onboarding and set up, loan packaging and processing, digital document collection and client portals, loan maintenance activities, payroll, lender communication, reporting requirements for regulators and business management, cloud services, expense collections, document preparation, compliance, training, administration and marketing.\n4. Pre-Underwriting Support: Technology enabled and together with back-office support, we offer our Users pre-underwriting support services that establish appropriate qualifying processes in a mortgage application, providing borrowers a digital environment ensuring mortgage agents has the necessary data and providing borrowers with an instant pre-qualification. We use our diverse exposure to the mortgage industry to save Users from spending valuable resources on mortgage applications that have fewer chances of reaching approval. In particular, we offer our Users the following pre-underwriting services, aimed at speeding up the underwriting process and helping mortgage lenders make accurate decisions:\n● Credit Review: We verify all information that is supplied by the client in vital loan documents and other personal information. Thereafter, we meticulously review client credit records and tax return documents to ensure the client has the required financial stability to make monthly payments for the mortgage. We follow checklist-based system to ensure that all the critical aspects pertaining to underwriting are covered.\n● Data Validation: Our pre-underwriting support services include recording and digitizing our findings in the data validation process. By digitizing these vital information sets about the client, we are able to establish the accuracy and speed needed to expedite the underwriting process.\n● Fraud Analysis and Compliance: We pride ourselves in diligently checking for identity fraud and ensuring that applications are compliant and contain complete information. Our mortgage experts have the experience and acumen to spot missing or mala fide information. This obviates the need for the underwriter to send client files back for incomplete information and thereby speeds up the underwriting process. Our fraud analysis encompasses all aspects of the client file review process including running third-party reports. This ensures the underwriter has to focus only on decision-making.\n● Appraisal Ordering and Review: We take charge of title ordering and dispatching verified property information to the appraiser to boost the turnaround times of the appraisal process. Once the appraisal is over, we carefully review the appraisal report to ensure that the process has been completed in a fair and error-free manner.\n● Data Analytics: Through MyPineapple, we are able to use data to analyze customer benefit opportunities as they become available. In particular, MyPineapple allows us to utilize the data that has been acquired through the mortgage approval process along with real time real estate and credit data to thereby reduce costs and overall debt process timelines.\nInsurance Products\nPineapple Insurance Inc. (Pineapple Insurance) is a wholly owned subsidiary of Pineapple Financial Inc. This entity is to serve the insurance needs of our brand mortgage brokers and agents across Canada. Pineapple Insurance is to act as an Managing General Agent (MGA) supported by Industrial Alliance. This entity will create both a revenue channel and retention strategy for borrowers that live within our database. This will also allow a growth opportunity and an overall holistic financial services opportunity for us. We are currently in the early stages of development of Pineapple Insurance Inc. Operational infrastructure and a budget has been prepared alongside technology modifications to our MyPineapple system in order to manage the delivery of this product. We have also created a sales and marketing plan alongside assets and materials, which will be used for initial launch. Our next steps are staffing and human capital requirements in order to execute on the business plan and goals of developing Pineapple Insurance.\nPineapple Insurance provides the following services:\n● We will complete a needs analysis on each client to ensure the most suitable product to meet both their needs and their goals. In our product suite, we will offer term life insurance which will provide a low-cost coverage at a fixed rate of payments for a limited period of time for the life of the mortgage. The goal of this product is to ensure that in the event of the insurers untimely death with their term policy their beneficiaries will be covered in the amount of the policy during the life of the term. No insurance will be paid to the beneficiary should the insured pass away after the end of the term or if the insured did not make the required payments.\n● Whole Life Insurance is a life insurance policy which is guaranteed to remain in force for the insureds entire lifetime, provided required premiums are paid, or to the maturity date. In addition to paying a death benefit, whole life insurance also contains a savings component in which cash value may accumulate on a tax-advantaged basis. The policies can be leveraged as collateral or an asset with our lenders through the Company.\n● For both our personal and our business clients, we offer permanent life insurance policies, which offer a death benefit and cash value. The death benefit is money that is paid to your beneficiaries when you pass away. Cash value is a separate savings component that you may be able to access while you are still alive. Permanent insurance can help cover the business owner for their entire life. And unlike term insurance, it includes the potential for a cash accumulation fund. Investments in the fund are tax-preferred, including at death when the tax-free death benefit is paid out to a named beneficiary. An additional benefit of permanent life insurance is that allocating funds in a corporation away from taxable investments to a permanent life insurance policy can help reduce overall annual taxable investment income. Permanent life insurance lasts from the time you buy a policy to the time you pass away, as long as you pay the required premiums. The policies can be leveraged as collateral or an asset with our lenders through the Company.\n● Critical Illness Insurance provides additional coverage for medical emergencies like heart attacks, strokes, or cancer. Because these emergencies or illnesses often incur greater-than-average medical costs, these policies pay out cash to help cover those overruns where traditional health insurance may fall short and help cover living expenses while the client recovers. These policies come at a relatively low cost. However, the instances that they will cover are generally limited to a few illnesses or emergencies. The key element is to ensure that the mortgagor does not fall behind in their mortgage payments.\n● Credit Insurance is a type of life insurance that can cover the remaining amount of your loan in the event of your death. Your insurance company will use the death benefit to pay down or pay off the remaining balance on the loan, up to a maximum amount outlined in the certificate of insurance. The money from your death benefit will go to your creditor. The money will not go to your family or beneficiaries.\nWe offer a wide range of investment options to suit clients risk tolerance and investment preferences. A financial advisor will review and assess the needs of each client to determine the short- and long-term goals for financial success. Such options may include segregated funds or mutual funds for registered (registered education savings plans (RESPs), registered retirement savings plans (RRSPs), tax-free savings accounts (TFSAs), etc.) and non-registered accounts. A segregated fund, or seg fund, is a type of investment fund administered by Canadian insurance companies in the form of individual, variable life insurance contracts offering certain guarantees to the policyholder such as reimbursement of capital upon death and mutual funds. As a regulatory requirement, all Canadian mortgage approvals being presented by the mortgage broker channel must include the option for a client to consider an insurance option in an effort to protect the liability in the case of death or disability. Pineapple Insurance Inc. will be presenting this insurance option for a client to accept or not via the products that we have available. This will be presented to all mortgage approvals being offered via our parent company, Pineapple Financial Inc.\nAs a complementary service to our parent company, Pineapple Financial Inc., this insurance subsidiary was created to easily serve the needs of the homeowners whose mortgages originate with us. With any mortgage product in Canada, an insurance component is a requirement, hence the diversification and business development into insurance.\nOur insurance services identified above currently are provided by a third-party insurance company, Industrial Alliance Inc., with whom we are affiliated as a managing general agent (MGA). We, therefore, act as an agent earning commissions from the premiums charged by the insurance company.\nWe believe the material steps for Pineapple Insurance to grow form its early stages of development are as follow:\n1. To introduce the services offered by Industrial Alliance and to serve the Users on our platform, MyPineapple, is to market these services, create a knowledge base for them to understand and pass on the learning to their customers, create a support structure for both Users and Users customers.\n2. Set up an internal infrastructure for the management and offering of these services i.e. hire a senior management person to manage the operational affairs and thereafter additional personnel, as needed when the business grows. The additional personnel will be mostly sales commissionable personnel with a retainer.\nThe costs we anticipate relate to mostly the marketing efforts undertaken, human capital which will be a fixed cost for the senior person and variable for additional personnel. As we develop and progress this business, it is anticipated that our major expenses will be payroll, marketing, and platform development. We have identified approximately 15% of the use of the proceeds from the shares offering to be dedicated to developing this business.\nThe timeline we feel to grow this subsidiary would be approximately 12 to 36 months depending upon the marketing efforts, acceptance of the products and services offered by Industrial Alliance, the prices / premiums for these products and services, and the understanding of the products because of the many variations that are inherent in the insurance products and services.\nInsurTech\nMyPineapple is a key reason for our success and has the ability to drive interested and timely insurance prospects to a replicated module that we have built in order to streamline and manage the customer flow for insurance products. The process is designed to create a unique synchronicity between the client obtaining a mortgage approval and insurance approval.\nCombined, the simplicity of the two platforms with its connectivity and integrations will allow Pineapple Insurance to successfully process and approve insurance applications.\nWe have also created client segmentations and retention programs to ensure that we can maximize our database of over 150,000 potential clients.\nGrowth Strategy\nBrokerage Services\nWe aim to gain further market share and consumer adoption by focusing on the following areas of growth:\n1. Increase Agent Revenue From Optimized Analytics: We will continue to analyze past borrower data to determine opportunities to beneficially re-service them in the future, potentially creating revenue generating activities and significantly enhancing the borrower experience.\n2. Added Product Suite - Insurance. As discussed above, we are establishing an insurance channel that provides borrowers with a full suite of insurance products, which we believe will increase revenue.\n3. National Expansion: We expect to continue to expand our business and operations into current jurisdictions along with new provinces such as British Colombia and Quebec.\n4. Borrower-Facing Technology. We believe MyPineapple will be a marketplace where clients can select from a variety of mortgage products that will suit their individual needs while tracking the progress and status of the transaction for the life of the mortgage and beyond.\nInsurance Products\nIn order to achieve our objectives and goals, Pineapple Insurance will focus on four main areas:\n1. Insurance originations: Our files will be obtained exclusively through the Pineapple Financial referral network. This will be achieved through technology integration where Pineapple Insurance agents are immediately notified of a mortgage approval which requires an insurance option. Our agents will be highly trained in an effort to service the growth of our referral network. Consistency in service level and approach is key to building our brand.\n2. Emphasizing core values: Servicing our clients, maintaining relationships, ongoing and continued support, education and training, ongoing lines of communication between mortgage agent and insurance agent and ensuring a smooth and efficient closing process. We expect our agents to conduct themselves with the highest level of professionalism and carry out the fundamental and core values of Pineapple Insurance at all times.\n3. Hiring and training insurance agents: We will follow and adhere to strict hiring and training policies as set out in our training manuals. Development of education and training programs working in conjunction with our partners. Ensuring that we are consistently working on recruiting top performing insurance agents that will be able to meet the growth and scale of the needs of the Company.\n4. Technologies and relationship management tools: We will be replicating and customizing our robust MyPineapple system for data transfer and client management. This will be broken into the following areas:\n● Operational Excellence: notifying insurance agents at the optimal time to increase conversion metrics and customer satisfaction. Integration of client data so the process is convenient for all involved parties. Visibility of status and automations of workflow and requirements;\n● Client Relationship Management (CRM): Advancing client relationships towards application indication, application completion and client retention; and\n● Acquisition: marketing funnels to leverage the overall database and identity opportunities from older missed opportunities.\nMarkets for our Services\nBrokerage Services\nThe clients for our Brokerage Services include mortgage agents, brokers, sub-brokers, brokerages and consumers. Our customer activity is intrinsically linked to the health of the real estate or commercial markets generally, particularly in Canada.\nStrong housing demand during 2020, 2021 and the first quarter of 2022 positively impacted the seasonal variations. With the onset of inflationary pressures around the globe, not only the seasonality but the normal trends of the housing markets have declined with the increase of interest rates. Although our business may be negatively impacted, we believe our multiple channels of revenue helps to mitigate any such impact.\nOn April 7, 2022, the 2022 budget was released by the Government of Canada which focuses on affordable housing alternatives for Canadians and additional tax measures to assist first time home buyers. With the continual influx of new immigrants as proposed by the Government of Canada; the renewed demand in home renovations and refurbishments; the users becoming more knowledgeable about additional use of their home equity, and other varying and creative measures, we plan to capitalize on these growth initiatives into the future.\nInsurance Products\nThe insurance market for Pineapple Insurance is focused around growth in the Canadian mortgage landscape as well as market share growth for Pineapple Financial.\n● Real estate investors: we are able to consolidate multiple mortgage amounts into one insurance policy to help minimize risk if an investor has multiple properties.\n● Residential Home purchase: with Canadian housing prices hitting all-time highs, we will help clients provide insurance to fill the gap between their current coverage and the mortgage amount\n● Refinance: can help clients reduce existing coverage or apply/consolidate if they require additional coverage.\n● Reverse Mortgage: these clients can use the income from the reverse mortgage to help plan their final expense through insurance as well as enrich their retirement years.\n● Switch: transferring to another lender at renewal. The insurance we offer is not tied to the lender directly and can assist clients in locking in their rates long term when they can still qualify for insurance\n● Renovation and construction: Clients will be able to access their cash values in their permanent insurance policies to help fund their renovations and construction projects. If additional financing is required, we can provide the added insurance coverage needed.\n● Self-Employed: As large numbers of Canadians move into business for themselves, we have found a great need for an insurance product that can suit their needs since they generally do not have a company benefits plan. Income protection will also be a key component of our business here.\n● Commercial Mortgages: We can provide the proper insurance to clients for the right amount of coverage and timeline for one or multiple investors. Coverages can go up to $20 million.\n● Private Lending: Customized insurance can be provided to private lenders who may have a different set of circumstances in terms of investment type and timeline horizon.\n● High Risk Health & Uninsurable: We can offer guaranteed issue insurance to clients who may have declining health or were previously declined for insurance in the past.\nPineapple Financial Inc. and Mortgage Market Dependency\nWe take a long-term view to manage and measure the success of our ongoing business strategy. In this regard, our principal focus is on market share growth. We seek to achieve increased market share irrespective of residential and commercial mortgage origination market conditions. Market share growth can be achieved through both the onboarding of new Users to MyPineapple and by increasing market share within its existing Users, including recently onboarded Users.\nWe are confident in our ability to increase the number of Field Agents using MyPineapple in conducting their brokerage services primarily due to the efficiency that MyPineapple brings to the mortgage brokerage process. From August 1, 2022 to August 1, 2023, our active users increased at a rate of 9.35%.\nThe mortgage market and residential and commercial mortgage originations are subject to the influence of many external factors, such as broader economic conditions and fluctuating interest rates, over which we have no control. We believe we have substantial growth opportunities to expand our market share within our existing total addressable market. In particular, we expect to have access to more opportunities in the commercial mortgage segment through our partnership with MCommercial. Additionally, we expect to gain access to greater market share opportunities as we continue to develop MyPineapple and improve the efficiency of the mortgage approval process.\nIndustry Overview\nThe Canadian Mortgage and Mortgage Brokerage Industry\nAccording to the Bank of Canada, as of May 1, 2022, Canadas chartered banks held over $1.523 trillion of residential mortgages (which amount does not include mortgages held by provincially regulated entities such as credit unions or mortgage investment corporations). Mortgage lenders typically offer a range of products, with options for fixed or variable rates, varying terms and amortization periods, as well as differing ancillary terms for pre-payment, incentives or other matters. Interest rates are typically renegotiated every three (3) years. While mortgage lenders post both fixed and variable interest rates at which the lender offers mortgages of varying terms, typically most lenders are willing to negotiate interest rates lower than those posted, a practice referred to as discounting. The practice began in Canada in the early 1990s and is considered the norm in todays mortgage market. The practice of discounting permits mortgage lenders to improve their ability to price discriminate and offer different rates to different borrowers based on their willingness to pay. Price discrimination allows lenders to increase their profits through negotiating different rates with individual borrowers instead of offering a blanket reduction in rates. The advent of price discrimination in the Canadian mortgage market has increased the importance of the mortgage broker in the lending negotiation process. In return for a fee (paid by the lending institution), the mortgage broker is typically able to negotiate a better rate than the consumer, or to efficiently reduce the time and effort required to be applied by the consumer to achieve similar results. Mortgage brokers are provincially regulated and subject to training and licensing requirements. See Regulatory Environment for details. However, there are relatively few barriers to entry in the mortgage brokerage market. Nevertheless, the ability of a given mortgage broker to erode lender price discrimination and secure rates at the lower end of the range at which lenders are prepared to lend is dependent upon a number of factors. While experience and negotiating ability are relevant factors, a key factor in the potential success of a mortgage broker in securing advantageous rates is the bargaining power of the mortgage broker, which varies directly with the volume of mortgages the broker is able to place with lenders.\nIndustry Growth Strategy\nOur overall aim has been to increase market share through organic (non-acquisition related) means and to achieve growth on the number of mortgages funded annually. In an effort to accomplish our growth goals, we maintain a consistent, focus on recruiting Field Agents and overall Users. We have employed a significant number of recruiters which has resulted in growth rate than most of our competitors. Secondly, with ongoing concentrated efforts towards recruiting, it has allowed us to gain a strong understanding of the competitive models that exist and also to continually enhance our offerings in the most effective way to recruit and retain qualified Field Agents. Additionally, through MyPineapple, we are able to support Field Agents growth in sales volume, productivity and efficiency in delivering mortgage solutions and increasing corporate revenue. Our aim has always been to have the leading model on which to recruit and support Field Agents, based on offering them a superior value-proposition.\nCompetitive Conditions\nMortgage Brokerage Market Conditions\nEffective January 1, 2018, the Office of the Superintendent of Financial Institutions Canada (OSFI) adopted Guideline B-20 - Residential Mortgage Underwriting Practices and Procedures (the Guideline B-20). The revised Guideline B-20 applies to all federally regulated financial institutions. The changes to Guideline B-20 reinforce OSFIs expectation that federally regulated mortgage lenders remain vigilant in their mortgage underwriting practices. As Guideline B-20 made mortgage borrowing more difficult for many Canadians, management believes more Canadians may have turned to mortgage brokers to help navigate the complex rules. Management expects that mortgage brokers will increase their market share in the coming years due to the following factors:\n● Mortgage regulations: Mortgage regulations have become more stringent in recent years, affecting the number of individuals that can qualify for conventional bank mortgages. As a result, these individuals are turned away from banks and seek out mortgage brokers for assistance in obtaining a mortgage.\n● Additional Offerings: With new products to offer, mortgage brokers will tend to appeal to a larger demographic/population base and also retain clients more effectively.\n● Conditioning and Habits: Twenty years ago, only a minimal percentage of the Canadian population used mortgage brokers, as brokers were viewed generally as a last resort to obtaining a mortgage. Over the years, this perception has shifted, and Canadians are now using mortgage brokers to obtain better mortgage rates and to save money. The generation that was reaching a home-buying age when brokers had little or no market share is aging and continually being replaced by younger, mortgage broker friendly Canadians.\n● Complexity of Mortgages: Many consumers are not sufficiently financially literate to ask the right questions when applying for a loan at a bank. As financial products become more complicated, more Canadians seek assistance to understand the complexities and alternatives.\n● Increased Broker Business Sophistication: As mortgage broker business sophistication increases, the Company expects the volume of renewal business funded by mortgage brokers to increase.\n● Interest Rates May Increase: As interest rates have been at historical lows for a significant period, many believe that interest rates will increase in years to come. In a higher interest rate environment, the Company anticipates that a growing proportion of consumers will likely shop for the best mortgage opportunities, driving the more conservative single-bank mortgage consumers to use mortgage brokers.\n● Technology: By utilizing MyPineapple and other available technologies, mortgage brokers have the ability to access client demographic and credit information and quickly and efficiently disseminate credit applications to various lenders across Canada. Technology provides the mortgage broker and clients with the ability to efficiently access home specific and third-party data such as appraisals, credit reports and related credit application information in a highly efficient and cost-effective manner.\nPrimary Competitors\nOur primary competitors consist of the following 3 categories:\n1. Traditional Mortgage Brokerages: These mortgage companies provide clients a more traditional way of obtaining mortgages by sourcing business through referrals while processing loan applications with limited access to technology and face-to-face meetings. As many of these organizations have been operating for decades, they have had time to cultivate relationships and build strong portfolios of customers. They access Canadas leading lenders for their products and services. Examples are: Dominion Lending Centres (TSX: DLCG), Verico, Mortgage Alliance and Centum.\n2. Digital Mortgage Companies: A fairly new breed of mortgage company that is sprouting from the digital evolution currently taking place in our landscape. These companies are focused on a direct-to-consumer model by offering a digital mortgage experience, however, they are still using a more traditional structure in the back office to fund mortgage solutions through Canadas largest lenders. Examples are: Nesto, Homewise and Motus Bank.\n3. Mortgage Technology Providers: These are companies that provide software and technology solutions to some of the traditional mortgage brokerages and companies that have not invested or developed their own technology solutions. The providers are typically focused on specific problems and providing solutions to segments of mortgage workflow. They can be expensive and difficult for traditional companies to implement. Examples are: Finmo, Lenders and Lender Spotlight.\nCompetitive Advantages\nWe compete with a number of mortgage brokerage companies. However, we offer competitive advantages relative to alternative mortgage broker arrangements as a result of the following:\n● Debt Consolidation: As personal debt levels continue to grow, we offer a unique opportunity of allowing potential borrowers access to their home equity to consolidate debts at lower interest rates. Interest only payments will provide lower and more flexible payment terms which will free clients cash flow for savings and help them establish better control over their personal finances.\n● Residential Home Purchase: With access to Canadas top lenders, we can help our clients find a mortgage solution best suited for their individual needs. Our Field Agents are trained at finding a mortgage solution that fits into a clients overall wealth plan and helps the client obtain the lowest overall cost of borrowing.\n● Refinance: We will encourage and assist clients to either take equity out of their homes or refinance into lower interest rates.\n● Switch: We allow clients to easily transfer to another lender upon renewal.\n● Renovation and Construction: With homebuyers seeing historic appreciation in home values the market has seen the move up buyer decide to stay and renovate existing property with the equity they have quickly grown. This has provided an opportunity for us to focus on providing the short-term financing required for such home renovation projects, while the major banks have slowly pulled out or limited their exposure in this area with government regulations changes to the home equity line of credit program.\n● Self Employed: As large numbers of Canadians move into business for self, we have found an increase demand for a mortgage product that can suit their needs. Typically these borrowers have good credit ratings and assets but cant verify their income through traditional means such as tax filings and pay stubs.\n● Damaged Credit: Damaged or challenged credit files are something that needs a financing solution. We take a holistic approach in determining the risk as it maps out a solution. Mortgages for these types of clients will need to improve their situation either by increasing cash flow, reducing debt load or increasing income potential. We will ask referring brokers to maintain close relationships with these clients to work on rehabilitation.\n● Private Lending: With exclusive access and expertise in private lending, we can ensure clients have knowledge of all available resources in the market.\n● Technology: We are able to provide advanced technology solutions to differentiate us from our competitors, including:\na) Data Analytics - Optimized Retention - Enhanced Customer Experience: As a data driven mortgage company MyPineapple harnesses the power of data which we acquire through the mortgage process and use it to help make meaningful decisions which save the client money, time and improve the customer experience.\nb) Unique Customer Profiling - Optimized Retention: Using a proprietary scoring and profiling process, we are able to uniquely segment clients and provide most televant information and resources to them at a meaningful point in the mortgage process.\nc) Internal Processing Centre - Focused Team - Increased Productivity: Having an internal underwriting and mortgage processing center allows us increased conversion, higher funding ratios and maximize productivity of our Field Agents.\nd) Actionable Signals - Marketing Efforts - Focused Engagement: Driving real-time signals to our Field Agents when conversion opportunities present themselves.\ne) Knowledge Transfer - Increased Accuracy - Performance: Comprehensive education technologies platform allows us to align the right product to the right lender and client.\nf) Data Integrity - Optimized Decision Making: We have built safeguards to ensure data integrity and accuracy.\ng) Lead Generation and Market Segmentation: MyPineapple quickly segments leads for personalized marketing. It then markets on behalf of the agent, turning cold leads into warm leads for faster customer acquisition. Field Agents receive real-time notifications for email, as well as reminders and scripts to ensure nothing is missed.\nh) Automated Triggers and Enhanced Workflow --MyPineapple directly syncs to calendars and emails. Tasks can easily be inputted into the system and email reminders ensure Field Agents remember to follow up. Intuitive automation then kicks in to guide Field Agents and all stakeholders through the entire process.\ni) Live Community via Chatter: MyPineapple connects Field Agents directly to the underwriting team, as well as other agents throughout the organization. This creates a support network, sense of work community and ultimately accelerates the response time.\nj) Online database of educational tools known as KNOWLEDGE - This online information resource is an online library with over 2000 resources, containing training videos that cover everything, from lender guidelines, sales and marketing tips, to deals training and more.\nk) Advanced Analytics and Reporting Features that turn data into actionable insights - This maximizes opportunity and creates lifetime customer value which lowers acquisition costs and significantly increases revenue.\nSpecialized Skill and Knowledge\nOur business requires specialized skills and knowledge, which include, but are not limited to, expertise related to mortgage underwriting, mortgage originations, private lending, business development, marketing and business strategy development. Our executive and management team has a strong background and significant experience and expertise in these areas. Our team also possesses specialized skills in data architecture, software development, programming and coding, finance and accounting, automations and process, training and education. Additionally, we currently rely upon, and expect to continue to rely upon, various legal and financial advisors and consultants and others in the operation and management of our business.\nIntangible Assets\nOur business is substantially dependent on our proprietary technology platform, MyPineapple, which it licenses from Salesforce. While the Company has not registered any intellectual property rights with respect to MyPineapple, it relies on trade secrets to protect the applicable proprietary information. Additionally, MyPineapple has been built through various development partners, such that no single developer has access to the complete technological architecture. See Business -- Material Contracts for more information on the Salesforce Agreement\nAdditionally, we rely on confidentiality agreements with its employees, consultants and advisors to protect its trade secrets and other proprietary information. Nonetheless, these agreements may not effectively prevent disclosure of confidential information and may not provide an adequate remedy in the event of unauthorized disclosure of confidential information. If we are not able to adequately prevent disclosure of trade secrets and other proprietary information, the value of its business could be significantly diminished.\nMaterial Contracts\nSalesforce Agreement\nIn connection with the development of MyPineapple, we entered into a licensing agreement with Salesforce.com, Inc. dated (NYSE: CRM) December 1, 2020 (the Salesforce Agreement) and expires on November 30, 2023. Salesforce is a cloud-based software company headquartered in San Francisco, California. It provides customer relationship management software and applications focused on sales, customer service, marketing automation, analytics, and application development. Pursuant to the Salesforce Agreement, we are licensed to use the Salesforce software as the platform or infrastructure on which we build the various applications such as MyPineapple. The applications we develop on this platform are the core that drive the operational software and applications used by Field Agents to initiate and process mortgage originations, which is the primary basis of our revenue generation. The Company is billed annually at a rate of $500,172 per year, which was during the year ended August 31, 2023\nAffiliation Agreements\nWe enter into affiliation agreements with Affiliate Brokers, pursuant to which we and the Affiliate Broker enter into an affiliation relationship with the intention of jointly marketing mortgage brokerage and other financial services as affiliated entities, sometimes referred to as white labelling, which allows the Affiliate Broker to sell a mortgage that is branded with its company name to its own client base. Pursuant to these affiliation agreements, we generally receive a fixed commission from the Affiliate Broker for any mortgage transaction where the Affiliate Broker has acted as the mortgage broker for the borrower. In general, these affiliation agreements have an indefinite term and may be terminated by either party upon thirty days written notice.\nChanges to Contracts\nThe Company does not expect its business to be affected in the current financial year by renegotiation or termination of contracts or sub-contracts.\nRegulatory Environment\nBrokerage License Requirements\nIn order to operate its mortgage broker business, we must remain duly licensed as a mortgage broker to deal and trade in mortgages in accordance with the Mortgage Brokerages, Lenders and Administrators Act, 2006 (Ontario), as amended (the MBLA Act). We have had our mortgage brokerage license since November 2016 and it has been renewed each year without issue. We will be subject to similar legislation and license requirements in the other provinces in Canada where we intend to expand.\nIn accordance with the MBLA Act, individuals, including directors, officers, partners, directors and officers of corporate partners, employees or agents of a mortgage brokerage company, such as the Company, who are engaged in dealing mortgages or trading in mortgages on its behalf must obtain a mortgage broker or mortgage agent license. A mortgage broker or agent license authorizes an individual to work for only the mortgage brokerage company named under the license. An individual cannot be licensed to work for more than one mortgage brokerage company. The Superintendent of Financial Services will use the information obtained in a mortgage broker license application to determine whether an applicant meets the prescribed eligibility requirements and is suitable for a license. The applicant will be required to submit documents to support certain pieces of information about the business.\n● Application Process. The application must be completed and submitted to certain regulatory authorities in the provinces and territories of Canada (each a Regulatory Authority), such as the Financial Services Regulatory Authority Ontario. The Regulatory Authority will send to the applicant an email acknowledgement upon receipt of the application. The Regulatory Authority will advise the applicant if the application is in order to proceed to the next step in the process. In the next step, the applicant will prepare and submit the application to license the mortgage brokerages principal broker and prepare and submit the online declarations for all the directors/officers/partners via The Regulatory Authoritys online licensing system. All directors and officers of the mortgage brokerage company applicant (DOPs) are required to provide confirmation of their suitability for licensing of the mortgage brokerage. A mortgage brokerages license can only be approved or issued when all the declarations from DOPs are received and reviewed by the Regulatory Authority. Once the brokerages license has been approved an email will be sent to the principal broker to indicate the brokerages license number. No paper license will be issued. At this point, the brokerage may prepare and submit applications to license its other brokers and agents via the online licensing system.\n● Fraud Prevention Measures. FSRA is required to maintain a public registry of licensed mortgage brokerages. Consistent with FSRAs role in protecting the public interest FSRA collaborates with other organizations, including other regulators, fraud prevention organizations and law enforcement agencies.\n● Fees and Renewal. Fees are payable in respect of all applications for licenses, other than for the mortgage brokerages principal broker. The fees are based on a one-year cycle. The fee due is prorated based on when the application is submitted. To simplify the payment and reconciliation process, mortgage brokerages are also required to submit fees on behalf of their agents and brokers. These fees are paid electronically when the mortgage brokerage submits license applications for its brokers and agents through the online licensing system. Once licensed, every mortgage brokerage must pay a regulatory fee in respect of each new one-year cycle. This fee is due every year on March 31. The mortgage brokerage must also pay fees on behalf of each agent and broker, other than the principal broker, when renewing their broker or agent licenses for the same one-year cycle.\nInsurance Regulation\nPineapple Insurance is subject to federal, as well as provincial and territorial, regulation in Canada in the provinces and territories in which they underwrite insurance/reinsurance. The Office of the Superintendent of Financial Institutions (OSFI) is the federal regulatory body that, under the Insurance Companies Act (Canada) (the Insurance Companies Act), prudentially regulates federal Canadian and non-Canadian insurance and reinsurance companies operating in Canada. Pineapple Insurance is licensed to carry on insurance business by OSFI and in each province and territory.\nUnder the Insurance Companies Act, Pineapple Insurance is required to maintain an adequate amount of capital in Canada, calculated in accordance with a test promulgated by OSFI called the Minimum Capital Test. Under the Insurance Companies Act, approval of the Minister of Finance (Canada) is required in connection with certain acquisitions of shares of, or control of, Canadian insurance companies such as Pineapple Insurance, and notice to and/or approval of OSFI is required in connection with the payment of dividends by or redemption of shares by Canadian insurance companies such as Pineapple Insurance.\nOther Regulations\nIn addition, the Company must comply with all federal, provincial and municipal laws that affect a Canadian business including employment, workers compensation, insurance, corporate, and tax laws and regulations.\nBankruptcy and Similar Procedures\nThe Company has not had any bankruptcy (whether voluntary or otherwise), receivership or other similar proceedings instituted by it or against it since its incorporation nor are any such proceedings being contemplated or threatened in the foreseeable future.\nMaterial Restructuring Transactions\nPineapple has not completed any material restructuring transactions since incorporation.\nIncorporation\nThe Company was incorporated under the OBCA on October 16, 2015 under the name 2487269 Ontario Limited (doing business under the name of Capital Lending Centre). The Companys head office is located at Unit 200, 111 Gordon Baker Road, North York, Ontario M2H 3R1 and its registered and records office is located at 67 Mowat Avenue Suite 122, Toronto, Ontario M6K 3E3. On June 16, 2021, the Company changed its name to Pineapple Financial Inc.\nCorporate Structure\nThe Company has two wholly owned subsidiaries: Pineapple Insurance Inc. (Pineapple Insurance) and Pineapple National Inc. (Pineapple National). Pineapple Insurance was incorporated under the OBCA on December 14, 2016, under the name CLC Insurance Inc. and changed its name to Pineapple Insurance Inc. on July 12, 2021. Pineapple Insurance has a registered and records office located at Suite 200, 111 Gordon Baker Road, Suite 200, North York, Ontario M2H 3R1. Pineapple National was incorporated under the Canada Business Corporations Act on November 9, 2021, with a registered and records office located at 10th Floor, 595 Howe Street, Vancouver, British Columbia V6C 2T5. ITEM 1A. RISK FACTORS\nRisks Related to the Company\nWe are dependent on the residential real estate market.\nOur financial performance is closely connected to the strength of the residential real estate market, which is subject to a number of general business and macroeconomic conditions beyond our control.\nMacroeconomic conditions that could adversely impact the growth of the real estate market and have a material adverse effect on our business include, but are not limited to, economic slowdown or recession, increased unemployment, increased energy costs, reductions in the availability of credit or higher interest rates, increased costs of obtaining mortgages, an increase in foreclosure activity, inflation, disruptions in capital markets, declines in the stock market, adverse tax policies or changes in other regulations, lower consumer confidence, lower wage and salary levels, war or terrorist attacks, natural disasters or adverse weather events, or the public perception that any of these events may occur. Unfavorable general economic conditions, such as a recession or economic slowdown, in the United States, Canada or other markets the Company enters and operates within could negatively affect the affordability of, and consumer demand for, its services which could have a material adverse effect on its business and profitability.\nIn addition, federal and state governments, agencies and government-sponsored entities could take actions that result in unforeseen consequences to the real estate market or that otherwise could negatively impact the Companys business. Some of the above-mentioned economic factors and conditions are currently adversely affecting Pineapple as the Users and consumer sentiment has waned and has precipitated fears of a possible economic recession. In the event of a continuing market downturn, our results of operations could be adversely affected by those factors in many ways, including making it more difficult for us to raise funds if necessary, and our stock price may further decline.\nThe real estate market is substantially reliant on the monetary policies of the federal government and its agencies and is particularly affected by the policies of the Bank of Canada, which regulates the supply of money and credit in Canada, which in turn impacts interest rates. The Companys revenues could be negatively impacted by a rising interest rate environment. As mortgage rates rise, the number of home sale transactions may decrease as potential home sellers choose to stay with their lower mortgage rate rather than sell their home and pay a higher mortgage rate with the purchase of another home. Due to a prospective higher debt assumption with the rise in interest rates, homeowners also may choose to not participate in refinancing or other similar mortgage financing activity that would create revenue for Pineapple. Potential home buyers may choose to rent rather than pay higher mortgage rates. Changes in the interest rate environment and mortgage market are beyond the Companys control, are difficult to predict and could have a material adverse effect on its business and profitability.\nWe may not be able to secure additional capital and achieve adequate liquidity to grow and compete.\nWe will require additional capital to operate, grow and compete, and failure to obtain such additional capital could limit our operations and our growth. When such additional capital is required, we will need to pursue various financing transactions or arrangements, which may include debt financing, equity financing or other means. Additional financing may not be available when needed or, if available, the terms of such financing might not be favorable to us and might involve substantial dilution to existing shareholders. In addition, debt and other debt financing may involve a pledge of assets and may be senior to interests of equity holders. We may incur substantial costs in pursuing future capital requirements, including investment banking fees, legal fees, accounting fees, securities law compliance fees, printing and distribution expenses and other costs. The ability to obtain needed financing may be impaired by such factors as the capital markets (both generally and in the mortgage brokerage industry in particular), our status as a relatively new enterprise with a limited history and/or the loss of key management personnel.\nWe have a limited operating history and, therefore, cannot accurately project our revenues and operating expenses.\nWe have a relatively limited operating history. As such, we will be subject to all of the business risks and uncertainties associated with any new business enterprise, including under-capitalization, cash shortages, limitations with respect to personnel, financial and other resources. Although we possess an experienced management team, there is no assurance that we will be successful in achieving a return on shareholders investment and the likelihood of our success must be considered in light of the problems, expenses, difficulties, complications and delays frequently encountered in connection with the establishment of any business. There is no assurance that we can continue to generate revenues, operate profitably, or provide a return on investment, or that we will successfully implement our business and growth plans. An investment in our securities carries a high degree of risk and should be considered speculative by investors. Prospective investors should consider any purchase of our securities in light of the risks, expenses and problems frequently encountered by all companies in the early stages of their corporate development.\nWe may continue to incur substantial losses and negative operating cash flows and may not achieve or maintain positive cash flow or profitability in the future.\nOur financial statements have been prepared on a going concern basis under which an entity is considered to be able to realize its assets and satisfy its liabilities in the ordinary course of business. Our future operations are dependent upon the identification and successful completion of equity or debt financings and the continued achievement of profitable operations at an indeterminate time in the future. There can be no assurances that we will be successful in completing equity or debt financings or in achieving profitability. The financial statements do not give effect to any adjustments relating to the carrying values and classifications of assets and liabilities that would be necessary should we be unable to continue as a going concern.\nCurrency exchange rates fluctuations could adversely affect our operating results.\nThe Company is exposed to the effects of fluctuations in currency exchange rates, Our functional currency is in Canadian dollars (CAD) and our presentation currency is in US dollars (USD). Due to the currency exchange rates fluctuations between the two currencies, there is a risk the companys operations and profitability may be affected during the translation. Currently the company does not have many international transactions and the fluctuations are mostly limited to the financial statements currency translation adjustments relating to the movements. The financial statements contain a line disclosing this translation amount.\nOur operating results may be subject to seasonality and vary significantly among quarters during each calendar year, making meaningful comparisons of successive quarters difficult.\nSeasons and weather traditionally impact the real estate industry in the jurisdictions where we operate. Continuous poor weather or natural disasters negatively impact listings and sales. Spring and summer seasons historically reflect greater sales periods in comparison to fall and winter seasons. We have historically experienced lower revenues during the fall and winter seasons, as well as during periods of unseasonable weather, which reduces the Companys operating income, net income, operating margins and cash flow.\nReal estate listings precede sales and a period of poor listings activity will negatively impact revenue. Past performance in similar seasons or during similar weather events can provide no assurance of future or current performance, and macroeconomic shifts in the markets we serve can conceal the impact of poor weather or seasonality.\nHome sales in successive quarters can fluctuate widely due to a wide variety of factors, including holidays, national or international emergencies, the school year calendars impact on timing of family relocations, interest rate changes, speculation of pending interest rate changes and the overall macroeconomic market. Our revenue and operating margins each quarter will remain subject to seasonal fluctuations, poor weather and natural disasters and macroeconomic market changes that may make it difficult to compare or analyze our financial performance effectively across successive quarters.\nOur growth strategy may not achieve the anticipated results.\nOur future growth, profitability and cash flows depend upon our ability to successfully implement our growth strategy, which, in turn, is dependent upon a number of factors, including our ability to:\n● expand our customer base;\n● increase and retain more qualified agents;\n● expand into additional jurisdictions;\n● support growth of existing customers;\n● continued financial strength and health;\n● diversify into additional related businesses;\n● improve our technological capabilities;\n● ensure skilled and well-trained employees and agents;\n● enhance our platforms; and\n● selectively pursue acquisitions.\nThere can be no assurance that we can successfully achieve any or all of the above initiatives in the manner or time period that we expect. Further, achieving these objectives will require investments which may result in short-term costs without generating any current revenue and therefore may be dilutive to our earnings. We cannot provide any assurance that we will realize, in full or in part, the anticipated benefits we expect our strategy will achieve. The failure to realize those benefits could have a material adverse effect on our business, financial condition and results of operations.\nWe may be unable to effectively manage rapid growth in our business.\nWe anticipate that growth in demand for our services will place significant demands on our operational infrastructure. The scalability and flexibility of our platform depends on the functionality of our technology and network infrastructure and its ability to handle increased traffic and demand for bandwidth. We anticipate that growth in the number of customers using our platform and the number of requests processed through our platform will increase the amount of data that we process. Any problems with the transmission of increased data and requests could result in harm to our brand or reputation. Moreover, as our business grows, we will need to devote additional resources to improving our operational infrastructure and continuing to enhance its scalability in order to maintain the performance of our platform.\nAs we grow, we will be required to continue to improve our operational and financial controls and reporting procedures and we may not be able to do so effectively. Furthermore, some members of our management do not have significant experience managing a large national business operation, so our management may not be able to manage such growth effectively. In managing our growing operations, we are also subject to the risks of over-hiring and/or overcompensating our employees and over-expanding our operating infrastructure. As a result, we may be unable to manage our expenses effectively in the future, which may negatively impact our gross profit or operating expenses.\nAs we continue to grow and develop the infrastructure of a public company, we must effectively integrate, develop and motivate a growing number of new employees. In addition, we must preserve our ability to execute quickly, further developing our platform and implementing new features and initiatives. As a result, we may find it difficult to maintain our corporate culture, which could limit our ability to innovate and operate effectively. Any failure to preserve our culture could also negatively affect our ability to recruit and retain personnel, to continue to perform at current levels or to execute on our business strategy effectively and efficiently.\nTo grow our business, we will continue to depend on relationships with third parties, such as insurance companies, financial institutions and lenders.\nTo grow our business, we will continue to depend on relationships with third parties, such as insurance companies, financial institutions and lenders. Identifying partners, and negotiating and documenting relationships with them, requires significant time and resources. Our competitors may be effective in providing incentives to third parties to favor their products or services over ours. In addition, acquisitions our partners by our competitors could result in a decrease in the number of our current and potential customers, as our partners may no longer facilitate the adoption of our applications by potential customers. Although we do maintain a few fixed-term contracts with lending partners, we cannot assure you that we can renew them once they expire, or we can renew them with the term we desire. Even though our business does not substantially depend on any particular third-party lending partner, if we are unsuccessful in establishing and maintaining our relationships with third parties, or if these third parties are unable or unwilling to provide services to us, our ability to compete in the marketplace or to generate revenue could be impaired, and its results of operations may suffer. Even if we are successful, we cannot be sure that these relationships will result in increased customer usage of its services or increased revenue.\nOur insurance business is highly regulated, and statutory and regulatory changes may materially adversely affect our business, financial condition and results of operations.\nLife insurance statutes and regulations are generally designed to protect the interests of the public and policyholders. Those interests may conflict with the interests of our shareholders. Federal and provincial insurance laws regulate all aspects of our Canadian insurance business. Changes to federal or provincial statutes and regulations may be more restrictive than current requirements or may result in higher costs, which could materially adversely affect our business, financial condition and results of operations. If the Office of the Superintendent of Financial Institutions (OFSI) determines that our corporate actions do not comply with applicable Canadian law, Pineapple Insurance could face sanctions or fines, and be subject to increased capital requirements or other requirements. If OSFI determines Pineapple Insurance is not receiving adequate support from Pineapple under applicable Canadian law, Pineapple Insurance may be subject to increased capital requirements or other requirements deemed appropriate by OSFI.\nIf there are extraordinary changes to Canadian statutory or regulatory requirements, we may be unable to fully comply with or maintain all required insurance licenses and approvals and the regulatory authorities could preclude or temporarily suspend us from carrying on some or all of our insurance activities or impose fines or penalties on us, which could materially adversely affect our business, financial condition and results of operations. We cannot predict with certainty the effect any proposed or future legislation or regulatory initiatives may have on the conduct of our business.\nWe may be subject to fraudulent activity that may negatively impact our operating results, brand and reputation.\nFraudulent activity could negatively impact our operating results, brand, and reputation, and cause the use of our products and services to decrease. We are subject to the risk of fraudulent activity associated with handling borrower or lending partner information. Our resources, technologies and fraud detection tools may be insufficient to accurately detect and prevent fraud. A significant increase in fraudulent activities could negatively impact our brands and reputation, discourage lending partners from collaborating with us, reduce the total amount of loans originated by lending partners, and lead us to take additional steps to reduce fraud risk, which could increase our costs. High profile fraudulent activity could even lead to regulatory intervention and may divert our managements attention and cause us to incur additional expenses and costs. Although we have not experienced any material business or reputational harm as a result of fraudulent activities in the past, we cannot rule out the possibility that fraudulent activities may materially and adversely affect our business, financial condition, and results of operations in the future.\nWe may experience security breaches that could result in the loss or misuse of data, which could harm our business and reputation.\nWe operate in an industry that is prone to cyber attacks. Failure to prevent or mitigate security breaches and improper access to or disclosure of our data or customer data, could result in the loss or misuse of such data, which could harm our business and reputation. The security measures we have integrated into our internal networks and platform, which are designed to prevent or minimize security breaches, may not function as expected or may not be sufficient to protect our internal networks and platform against certain attacks. In addition, techniques used to sabotage or to obtain unauthorized access to networks in which data is stored or through which data is transmitted change frequently. As a result, we may be unable to anticipate these techniques or implement adequate preventative measures to prevent an electronic intrusion into our networks.\nIf a security breach were to occur, as a result of third-party action, employee error, breakdown of our internal security processes and procedures, malfeasance or otherwise, and the confidentiality, integrity or availability of our customers data was disrupted, we could incur significant liability to our customers, and our platform may be perceived as less desirable, which could negatively affect our business and damage our reputation.\nOur platform may be subject to distributed denial of service attacks (DDoS), a technique used by hackers to take an internet service offline by overloading its servers, and we cannot guarantee that applicable recovery systems, security protocols, network protection mechanisms and other procedures are or will be adequate to prevent network and service interruption, system failure or data loss. In addition, computer malware, viruses, and hacking and phishing attacks by third parties are prevalent in our industry.\nMoreover, our platform could be breached if vulnerabilities in our platform or third-party applications are exploited by unauthorized third parties or due to employee error, breakdown of our internal security processes and procedures, malfeasance, or otherwise. Further, third parties may attempt to fraudulently induce employees or customers into disclosing sensitive information such as user names, passwords or other information or otherwise compromise the security of our internal networks and electronic systems in order to gain access to our data or our customers data. Since techniques used to obtain unauthorized access change frequently and the size and severity of DDoS attacks and security breaches are increasing, we may be unable to implement adequate preventative measures or stop DDoS attacks or security breaches while they are occurring.\nAny actual or perceived DDoS attack or security breach could damage our reputation and brand, expose us to a risk of litigation and possible liability and require us to expend significant capital and other resources to respond to and/or alleviate problems caused by the DDoS attack or security breach. Some jurisdictions have enacted laws requiring companies to notify individuals and authorities of data security breaches involving certain types of personal or other data and our agreements with certain customers and partners require us to notify them in the event of a security incident. Any of these events could harm our reputation or subject us to significant liability, and materially and adversely affect our business and financial results.\nOur software systems may contain errors, defects or security vulnerabilities that could interrupt operations or materially impact our ability to originate, monitor or service customer accounts or comply with contractual obligations.\nWe are dependent upon the successful and uninterrupted functioning of our computer and data processing systems and software including MyPineapple as well as the customized software developed by us as part of our third-party underwriting services. These software and systems may contain errors, defects, security vulnerabilities or software bugs that are difficult to detect and correct, particularly when first introduced or when new versions or enhancements are released.\nThe failure or unavailability of these systems could interrupt operations or materially impact our ability to originate, monitor or service customer accounts or comply with contractual obligations to third parties. If sustained or repeated, a system failure or loss of data could negatively affect our operating results. In addition, we depend on automated software to match the terms of our liabilities and asset maturities. If such software fails or is unavailable on a prolonged basis, we could be required to manually complete such activities, which could have a material adverse effect on our business, financial condition and results of operations.\nSince our customers use our services for decisions that are critical to their financial well-being, errors, defects, security vulnerabilities, service interruptions or software bugs in our platform could result in losses to our customers. Customers may seek significant compensation from us for any losses they suffer or cease conducting business with us altogether. Further, a customer could share information about bad experiences on social media, which could result in damage to our reputation and loss of future sales. There can be no assurance that provisions typically included in our agreements with our customers that attempt to limit its exposure to claims would be enforceable or adequate or would otherwise protect us from liabilities or damages with respect to any particular claim. Even if not successful, a claim brought against us by any of our customers would likely be time-consuming and costly to defend and could seriously damage its reputation and brand, making it harder for us to sell its solutions.\nIf we fail to protect the privacy and personal information of our customers, agents or employees, we may be subject to legal claims, government action and damage to its reputation.\nOur operations are dependent on our information systems and the information collected, processed, stored, and handled by these systems. We rely heavily on our computer systems to manage our platform. Throughout our operations, we receive, retain and transmit certain confidential information, including personally identifiable information that our customers provide to purchase services, interact with our personnel, or otherwise communicate with us. In addition, for these operations, we depend in part on the secure transmission of confidential information over public networks. Our information systems are subject to damage or interruption from power outages, facility damage, computer and telecommunications failures, computer viruses, internet access failures, security breaches, including credit card or personally identifiable information breaches, coordinated cyber-attacks, vandalism, catastrophic events and human error. Although we deploy a layered approach to address information security threats and vulnerabilities, including ones from a cyber security standpoint, designed to protect confidential information against data security breaches, a compromise of our information security controls or of those businesses with whom we interact, which results in confidential information being accessed, obtained, damaged, or used by unauthorized or improper persons, could harm our reputation and expose us to regulatory actions and claims from customers and other persons, any of which could adversely affect our business, financial position, and results of operations. Because the techniques used to obtain unauthorized access, disable or degrade service, or sabotage systems change frequently and may not immediately produce signs of intrusion, we may not be able to anticipate these techniques or to implement adequate preventative measures. In addition, a security breach could require that we expend substantial additional resources related to the security of information systems and disrupt our businesses.\nWe may need to develop new products and services and rapid technological change could harm our business, results of operations and financial condition.\nWe operate in a competitive industry characterized by rapid technological change and evolving industry standards. Our ability to attract new customers and generate revenue from existing customers will depend largely on its ability to anticipate industry standards and trends, respond to technological advances in its industry, and to continue to enhance existing services or to design and introduce new services on a timely basis to keep pace with technological developments and its customers increasingly sophisticated needs. The success of any enhancement or new services depends on several factors, including the timely completion and market acceptance of the enhancement or new services. Any new service we develop or acquires might not be introduced in a timely or cost-effective manner and might not achieve the broad market acceptance necessary to generate significant revenue. If any of our competitors implements new technologies before we are able to implement them, those competitors may be able to provide more effective services than us at lower prices. Any delay or failure in the introduction of new or enhanced services could harm our business, results of operations and financial condition.\nOur services are expected to embody complex technology that may not meet those standards, changes and preferences. Our ability to design, develop and commercially launch new services depends on a number of factors, including, but not limited to, its ability to design and implement solutions and services at an acceptable cost and quality, its ability to attract and retain skilled technical employees, the availability of critical components from third parties, and its ability to successfully complete the development of services in a timely manner. There is no guarantee that we will be able to respond to market demands. If we are unable to effectively respond to technological changes, or fails or delays to develop services in a timely and cost-effective manner, its services may become obsolete, and we may be unable to recover its development expenses which could negatively impact sales, profitability and the continued viability of its business.\nThe failure by us to sustain or increase its current level of mortgage origination from independent mortgage brokers could have a material adverse effect on our business, financial condition and results of operations.\nOur mortgage operations are dependent on a network of mortgage brokers. The mortgage brokers with whom we do business with are not contractually obligated to do business with us. Further, our competitors also have relationships with the same brokers and actively compete with us in our efforts to expand our broker network and originate mortgage loans. We may find it difficult to attract new mortgage business from this network of brokers, or sustain current levels, to meet our needs. The failure by us to sustain or increase its current level of mortgage origination from these sources could have a material adverse effect on our business, financial condition and results of operations.\nIncreases in interest rates may have an adverse effect on our business, financial condition and results of operations and on the amount of cash available for dividends to shareholders.\nRising interest rates generally reduce the demand for credit, including mortgages, increase the cost of borrowing and may discourage potential borrowers from purchasing new properties, refinancing their existing mortgages or obtaining cash to retire other debt. Consequently, we may originate fewer mortgages, or a lower dollar amount of mortgages, in a period of rising interest rates. Increases in interest rates may also cause a lack of liquidity among Pineapples institutional investors, potentially reducing the number of mortgages such purchasers would otherwise buy. Increases in interest rates may have an adverse effect on our business, financial condition and results of operations and on the amount of cash available for dividends to shareholders. However, rising interest rates may also result in a decrease in prepayments on mortgages, which could result in an increase in the number of mortgages under our administration which would increase the amount of funds received from servicing these mortgages. We believe rising interest rates are currently at a stage that is close to its maturity level and that core inflation is being contained with the prices of the goods such as groceries and natural gas not decreasing. As a result, we believe that the Bank of Canada intends to bring core inflation down to a manageable level and is looking at increasing the interest rates further. If the cycle is almost at maturity, as we believe it is, however, it may take six to nine months to stabilize and possibly a year to return to pre-Covid 19 levels.\nIn periods of declining interest rates, prepayments on mortgages tend to increase as a result of borrowers taking advantage of lower interest rates to refinance higher interest rate mortgages, or as a result of borrowers purchasing new properties and prepaying their existing mortgages. However, a reduction in the number of mortgages under our administration would result in a decrease in the amount of funds received from servicing these mortgages and may have an adverse effect on our business, financial condition and results of operations and on the amount of cash available for dividends to shareholders.\nIf any of information from third parties is misrepresented and the misrepresentation is not detected before mortgage funding, the value of the mortgage may be significantly lower than expected.\nUpon originating a new mortgage application, we assess and determine which institutional or non- institutional mortgage provider would accept the application. This application is then submitted as soon as practical for final approval and underwriting. These mortgages are then deemed to be placed with said lending institution. We place the mortgages that we originate as soon as is practicable after committing to the mortgages. Mortgage placements are made under agreements with institutional investors and securitization conduits which are, in many respects, favorable to the mortgage purchaser. When placing mortgages, we make a variety of customary representations and warranties regarding itself, our mortgage origination activities and the mortgages that are placed. These representations and warranties survive for the life of the mortgages and relate to, among other things, compliance with laws, mortgage underwriting and origination practices and standards, the accuracy and completeness of information in the mortgage documents and mortgage files, and the characteristics and enforceability of the mortgages. In many cases, these provisions do not have any cure periods and are not subject to any materiality threshold.\nThrough our mortgage origination and underwriting processes, we attempt to verify that our mortgages are originated and underwritten in accordance with the applicable requirements and comply with representations and warranties made by us. There can be no assurance, however, that we will not make mistakes or that certain employees or brokers will not deliberately violate our underwriting or other policies, and breaches of representations and warranties may occur from time to time.\nWhen we send mortgage originations to the lender partners to be funded, we rely heavily upon information supplied by third parties including the information contained in the mortgage application, property appraisal, title information and employment and income documentation. If any of this information is misrepresented and the misrepresentation is not detected before mortgage funding, the value of the mortgage may be significantly lower than expected. Whether the mortgage applicant, the mortgage broker, another third party or one of our employees makes a misrepresentation, we generally bear the risk of loss associated with the misrepresentation. A mortgage subject to a misrepresentation may be unsaleable in the ordinary course of business or may be subject to repurchase or substitution if it is sold before detection of the misrepresentation or may require us to indemnify the mortgage purchaser. The persons and entities that made a misrepresentation are often difficult to locate and it may be difficult to collect from them any monetary losses we may have suffered. While we have controls and processes designed to help it identify misrepresented information in its mortgage origination operations, there can be no assurance these controls and processes have detected or will detect all misrepresented information.\nGlobal economy risk may negatively impact our business operations and our ability to raise capital.\nThe mortgage financing industry in Canada continued to benefit from historically low and stable interest rates in the past as homeowners took advantage of these rates with purchasing, repurchasing, and refinancing. Due to global inflationary pressures, Central banks all over the world are adjusting the interest rates upward to address this. There is a risk that an increase in interest rates could slow the pace of property sales and adversely affect growth in the mortgage market, which could adversely affect our operations and stated growth initiatives. A decline in general economic conditions could also cause default rates to increase as creditworthiness decreases for borrowers. This could have a material adverse effect on our business, financial condition and results of operations and on the amount of cash available for dividends to shareholders.\nIn addition, there are economic trends and factors that are beyond our control, which may affect our operations and business. Such trends and factors include adverse changes in the conditions in the specific markets for our services, the conditions in the broader market for residential mortgages and the conditions in the domestic or global economy generally. Although our performance is affected by the general condition of the economy, not all of its service areas are affected equally. It is not possible for management to accurately predict economic fluctuations and the impact of such fluctuations on performance. There is no guarantee that the revenue, asset and profit growth that we have historically generated will continue or that any of our targets for distributable cash or other performance expectations will be achieved.\nThe volatility of global capital markets over the past several years has generally made the raising of capital by equity or debt financing more difficult. We may be dependent upon capital markets to raise additional financing in the future. As such, we are subject to liquidity risks in meeting its operating expenditure requirements and future cost requirements in instances where adequate cash positions are unable to be maintained or appropriate financing is unavailable. These factors may impact the ability to raise equity or obtain loans and other credit facilities in the future and on terms favorable to us and our management. If these levels of volatility persist or if there is a further economic slowdown, our operations, our ability to raise capital and the trading price of our securities could be adversely impacted.\nInflationary pressure on the global and Canadian markets have caused upward pressure on interest rates impacting mortgage qualification and eligibility. This pressure has immediately impacted Canadian borrowers ability to get approved for financing, which in turn has created a decrease in total loan originations. There is currently no indication as to when this inflationary pressure will ease or whether that would change the current environment that has led to our recent growth.\nA decline in the global macroeconomic outlook, including as a result of Russias invasion of Ukraine and the threat, or outbreak of more widespread armed conflict in Eastern Europe would cause financial market activity to continue to decrease, which could negatively affect the Companys revenues.\nThe current year has been marked by significant market volatility and uncertainty. We believe that continued economic growth will be dependent on a number of factors, including, but not limited to, the continued positive trajectory of the course of the pandemic, a moderation of the pace of inflation and supply chain issues that developed during 2021, and the nature, magnitude, and duration of hostilities stemming from Russias invasion of Ukraine, including the effects of sanctions and retaliatory cyber attacks on the world economy and markets. Beginning in November 2021, Russia began to amass troops along the Ukrainian border, heightening military tensions in Eastern Europe. In February 2022, Russia sent troops into pro-Russian separatist regions in Ukraine. The U.S. and/or other countries, including Canada and Israel may impose sanctions or other restrictive actions against governmental or other entities in Russia. The long-term impacts of the conflict between these nations remains uncertain.\nWidespread concern or doubts in the market about the pace or ability of normal economic activity to resume, the potential for prolonged conflict in Ukraine or the broader outbreak of armed conflict in Eastern Europe, the pace, impact, or effectiveness of the actions by governments and centrals banks intended to manage the rate of inflation through interest rate increases and the termination of the quantitative easing program, or the efficacy or adequacy of government measures enacted to support the domestic and global economy, could erode the outlook for macroeconomic conditions, economic growth, and business confidence, which could negatively impact the Company.\nThe current levels of volatility in global markets due to market participants reactions to, and uncertainty surrounding, the magnitude and timing of government and central bank action to be taken in response to heightened inflation, as well as Russias invasion of Ukraine. This volatility has resulted in a decline in the level of activity in the financial markets. Continued market volatility or uncertainty related to actions taken or to be taken by central banks, a decline in the global macroeconomic outlook, including as a result of Russias invasion of Ukraine and the threat, or outbreak of more widespread armed conflict in Eastern Europe would cause financial market activity to continue to decrease, which could negatively affect the Companys revenues. In addition, global macroeconomic conditions and Canadian, Israeli and U.S. financial markets remain vulnerable to the potential risks posed by exogenous shocks, which could include, among other things, political or social unrest or financial uncertainty in the United States and the European Union, complications involving terrorism and armed conflicts around the world, or other challenges to global trade or travel.\nIn addition, the current outbreak of COVID-19, and any future emergence and spread of similar pathogens, could have a material adverse impact on global economic conditions, which may adversely impact: the market price of the Common Shares, our operations, our ability to raise debt or equity financing, and the operations of our business partners, contractors and service providers.\nChanges in regulatory legislation or the interpretation thereof, or the introduction of any new regulatory requirements could have a negative effect on us and our operating results.\nWe are currently regulated under mortgage broker, lending and other legislation in all of the jurisdictions in which it conducts business and is licensed or registered in those jurisdictions where licensing or registration is required by law. Changes in regulatory legislation or the interpretation thereof, or the introduction of any new regulatory requirements could have a negative effect on us and our operating results. There are different regulatory and registration requirements in each of the jurisdictions in Canada. We are registered in the jurisdictions in which we conduct business, however, we may voluntarily seek additional registration in respect of its activities or from time to time regulators may adopt a different view that may require us to seek additional registration. Failure to be appropriately registered could result in enforcement action and potential interruption of certain of our servicing or other activities and may result in a default under servicing agreements. This could have a material adverse effect on our business, financial condition and results of operations.\nThe real estate brokerage industry is highly competitive which could have a material adverse effect on our business, financial condition and results of operations..\nOur products compete with those offered by banks, insurance companies, trust companies and other financial services companies. Some of these competitors are better capitalized, hold a larger percentage of the Canadian mortgage market, have greater financial, technical and marketing resources than we do and have greater name recognition than the Pineapple brand. We experience competition in all aspects of our business, including price competition. If price competition increases, we may not be able to raise the interest rates we charge in response to a rising cost of funds or may be forced to lower the interest rates that we are able to charge borrowers, which has the potential to reduce the value of the mortgages we place with institutional mortgage purchasers or securitization vehicles. Price-cutting or discounting may reduce profits. This could have a material adverse effect on our business, financial condition and results of operations and on the amount of cash available for dividends to shareholders.\nA failure in the demand for its services to materialize as a result of competition, technological change or other factors could have a material adverse effect on our business, results of operations and financial condition.\nMarket opportunity estimates and growth forecasts, whether obtained from third-party sources or developed internally, are subject to significant uncertainty and are based on assumptions and estimates that may not prove to be accurate. Our estimates and forecasts relating to the size and expected growth of its target market, market demand and adoption, capacity to address this demand, and pricing may prove to be inaccurate. We must rely largely on its own market research to forecast sales as detailed forecasts are not generally obtainable from other sources. A failure in the demand for its services to materialize as a result of competition, technological change or other factors could have a material adverse effect on our business, results of operations and financial condition.\nReputation loss may result in decreased customer confidence and an impediment to our overall ability to advance its services with customers, thereby having a material adverse impact on our financial performance, financial condition, cash flows and growth prospects.\nReputational damage can result from the actual or perceived occurrence of any number of events, and could include any negative publicity, whether true or not. The increased usage of social media and other web-based tools used to generate, publish and discuss user-generated content and to connect with other users has made it increasingly easier for individuals and groups to communicate and share opinions and views, whether true or not. Reputation loss may result in decreased customer confidence and an impediment to our overall ability to advance its services with customers, thereby having a material adverse impact on our financial performance, financial condition, cash flows and growth prospects.\nThe Companys intellectual property rights are valuable, and any failure or inability to protect them could adversely affect its business.\nOur commercial success depends to a significant degree upon its ability to develop new or improved technologies, instruments and services, and to obtain patents and/or industrial designs, where appropriate, or other intellectual property rights or statutory protection for these technologies and products in Canada and the United States. Despite devoting resources to the research and development of proprietary technology, we may not be able to develop new technology that is patentable or protectable. Further, patents issued to us, if any, could be challenged, held invalid or unenforceable, or be circumvented and may not provide us with necessary or sufficient protection or a competitive advantage. Competitors and other third parties may be able to design around our intellectual property or develop a technology forward platform similar to its platform that is not within the scope of such intellectual property. Our inability to secure its intellectual property rights may have a materially adverse effect on its business and results of operations. It is imperative that appropriate licensing agreements be negotiated with thirds parties to ensure protection of all applicable intellectual property.\nProsecution and protection of the intellectual property rights sought can be costly and uncertain, often involve complex legal and factual issues and consume significant time and resources. The laws of certain countries may not protect intellectual property rights to the same extent as the laws of Canada or the United States.\nWe depend on highly skilled personnel to grow and operate its business. If we are not able to hire, retain, and motivate our key personnel, our business may be adversely affected.\nOur success is currently largely dependent on the performance of its directors and officers. The loss of the services of any of these persons could have a materially adverse effect on our business and prospects. There is no assurance we can maintain the services of its directors, officers or other qualified personnel required to operate our business. As our business activity grows, we will require additional key financial, administrative, and technology personnel as well as additional agents and operations staff. There can be no assurance that these efforts will be successful in attracting, training and retaining qualified personnel as competition for persons with these skill sets increase. If we are not successful in attracting, training and retaining qualified personnel, the efficiency of its operations could be impaired, which could have an adverse impact on our operations and financial condition. In addition, the COVID-19 pandemic may cause us to have inadequate access to an available skilled workforce and qualified personnel, which could have an adverse impact on our financial performance and financial condition.\nIt may be difficult to enforce civil liabilities under Canadian securities laws.\nWe and/or our directors and officers may be subject to a variety of civil or other legal proceedings, with or without merit. From time to time in the ordinary course of its business, we may become involved in various legal proceedings, including commercial, employment and other litigation and claims, as well as governmental and other regulatory investigations and proceedings. Such matters can be time-consuming, divert managements attention and resources and cause us to incur significant expenses. Furthermore, because litigation is inherently unpredictable, the results of any such actions may have a material adverse effect on our business, operating results or financial condition.\nWe have assets located outside of Canada, and therefore it may be difficult to enforce judgments obtained by the Company in foreign jurisdictions by Canadian courts. Similarly, to the extent that our assets are located outside of Canada, investors may have difficulty collecting from us any judgments obtained in Canadian courts and predicated on the civil liability provisions of applicable securities legislation. Furthermore, we may be subject to legal proceedings and judgments in foreign jurisdictions and it may be difficult for U.S. stockholders to effect service of process against the officers of the Company.\nFuture acquisitions could result in potentially dilutive issuances of equity securities, the incurrence of debt, contingent liabilities and/or amortization expenses related to goodwill and other intangible assets, which could materially adversely affect our business, results of operations and financial condition.\nIf appropriate opportunities present themselves, we may complete acquisitions that we believe are strategic. We currently have no understandings, commitments or agreements with respect to any material acquisition and no other material acquisition is currently being pursued. There can be no assurance that we will be able to identify, negotiate or finance future acquisitions successfully, or to integrate such acquisitions with our current business. The process of integrating an acquired company or assets into the Company may result in unforeseen operating difficulties and expenditures and may absorb significant management attention that would otherwise be available for ongoing development of our business. Future acquisitions could result in potentially dilutive issuances of equity securities, the incurrence of debt, contingent liabilities and/or amortization expenses related to goodwill and other intangible assets, which could materially adversely affect our business, results of operations and financial condition.\nFailure to implement required new or improved controls, or difficulties encountered in their implementation, could harm our results of operations or cause us to fail to meet our reporting obligations.\nEffective internal controls are necessary for us to provide reliable financial reports and to help prevent fraud. Although we will undertake a number of procedures and will implement a number of safeguards, in each case, in order to help ensure the reliability of its financial reports, including those imposed on us under Canadian securities law, we cannot be certain that such measures will ensure that we will maintain adequate control over financial processes and reporting. Failure to implement required new or improved controls, or difficulties encountered in their implementation, could harm our results of operations or cause it to fail to meet its reporting obligations. If we or our auditors discover a material weakness, the disclosure of that fact, even if quickly remedied, could reduce the markets confidence in our consolidated financial statements and materially adversely affect the trading price of our Common Shares.\nOur management will ensure the accounting cycle, payroll administration, operational activities, and financial reporting controls to assess internal control risks and to ensure proper internal control is in place. The potential risk that flows from the identified deficiencies and weaknesses is the risk of potential fraud. However, the risk of fraud is considered low as management anticipates taking a number of measures as stated above to mitigate the potential risk of fraud, including without limitation: (i) all purchase and payment, including payroll, must be authorized by management; (ii) all capital expenditures must be preapproved by management; (iii) all source documents in any other language other than English must be translated and scanned for accounting entries and recordkeeping purposes; (iv) and almost all of our cash will be deposited with a Canadian bank in Ontario, Canada. Bank statements will be reviewed by the CFO of Pineapple regularly. Our management and Board will continue to monitor our operations of, evaluate the internal controls, and develop measures in the future to mitigate any potential risks and weaknesses.\nCanada does not have a system of exchange controls, and control of the Company by non-Canadians may be subject to review and further government action.\nCanada has no system of exchange controls. There are no Canadian governmental laws, decrees, or regulations relating to restrictions on the repatriation of capital or earnings of the Company to non-resident investors. There are no laws in Canada or exchange control restrictions affecting the remittance of dividends, profits, interest, royalties and other payments by the Company to non-resident holders of the Common Shares, except as discussed below under Certain Canadian Federal Income Tax Consequences to Holders of our Common Shares that are Non-Resident in Canada.\nThere are no limitations under the laws of Canada or in the organizing documents of the Company on the right of foreigners to hold or vote securities of the Company, except that the Investment Canada Act may require that a non-Canadian not acquire control of the Company without prior review and approval by the Minister of Innovation, Science and Economic Development. The acquisition of one-third or more of the voting shares of the Company would give rise a rebuttable presumption of the acquisition of control, and the acquisition of more than fifty percent of the voting shares of the Company would be deemed to be an acquisition of control. In addition, the Investment Canada Act provides the Canadian government with broad discretionary powers in relation to national security to review and potentially prohibit, condition or require the divestiture of, any investment in the Company by a non-Canadian, including non-control level investments. Non-Canadian generally means an individual who is neither a Canadian citizen nor a permanent resident of Canada within the meaning of the Immigration and Refugee Protection Act (Canada) who has been ordinarily resident in Canada for not more than one year after the time at which he or she first became eligible to apply for Canadian citizenship, or a corporation, partnership, trust or joint venture that is ultimately controlled by non-Canadians. ITEM 1B. UNRESOLVED STAFF COMMENTS\nNot applicable.\nITEM IC. CYBERSECURITY\nNot applicable. ITEM 2. PROPERTIES\nOur principal executive offices are located at Unit 200, 111 Gordon Baker Road, North York, Ontario M2H 3R1. The Company leases all its office premises in Ontario, Canada. The Company extended the current premises of 4,894 sq. ft. lease to January 1, 2030 and acquired additional premises of 8,368 square feet adjacent to the current office premises with the same landlord. The additional premises lease also expires on January 1, 2030. The total area of use by The Company is 13,262 sq. ft. The Company recognized a right-of-use asset and corresponding lease liability in respect of this lease. Our registered and records office is located at 67 Mowat Avenue, Suite 122, Toronto, Ontario M6K 3E3. We believe that our current office space will be adequate for the foreseeable future. ITEM 3. LEGAL PROCEEDINGS\nFrom time to time, we may become involved in various lawsuits and legal proceedings, which arise in the ordinary course of business. Litigation is subject to inherent uncertainties, and an adverse result in these or other matters may arise from time to time that may harm our business. We are currently not aware of any such legal proceedings or claims that will have, individually or in the aggregate, a material adverse effect on our business, financial condition or operating results. ITEM 4. MINE SAFETY DISCLOSURES\nNot applicable.\nPART II ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nMarket Information\nOur common shares are listed on the NYSE American under the symbol PAPL.\nShareholders\nAs of December 12, 2023, we had 90 shareholders of record. This does not include shares held in the name of a broker, bank, or other nominees (typically referred to as being held in street name).\nUse of Proceeds from Registered Offering\nOn November 3, 2023, we completed the initial public offering, or IPO, of our common shares pursuant to which we issued and sold 875,000 common shares at a price to the public of $4.00 per share. All of the common shares issued and sold in our IPO were registered under the Securities Act pursuant to a registration statement on Form S-1 (Registration No. 333-268636), which was declared effective by the SEC on October 12, 2023. We received net proceeds of approximately $2.76 million, after deducting underwriting discounts and commissions and offering expenses borne by us. None of the expenses incurred by us were direct or indirect payments to any of (i) our directors or officers or their associates, (ii) persons owning 10% or more of our common shares, or (iii) our affiliates. There has been no material change in the planned use of proceeds from our IPO as described in our final prospectus filed with the SEC on November 2, 2023 pursuant to Rule 424(b)(4). EF Hutton, division of Benchmark Investments, LLC, acted as representative of the underwriters of the offering. The offering commenced on October 31, 2023 and did not terminate before all securities registered in the registration statement were sold.\nDividend Policy\nWe have not, since the date of our incorporation, declared or paid any dividends or other distributions on our Common Shares, and do not currently have a policy with respect to the payment of dividends or other distributions. We do not currently pay dividends and do not intend to pay dividends in the foreseeable future. The declaration and payment of any dividends in the future is at the discretion of the Board and will depend on numerous factors, including compliance with applicable laws, financial performance, working capital requirements of the Company and its subsidiaries, as applicable and such other factors as its directors consider appropriate..\nUnregistered Sales of Equity Securities\nNot applicable. ITEM 6. [RESERVED]\nNot applicable. ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITIONS AND RESULTS OF OPERATIONS.\nPlease read the following managements discussion and analysis of our financial condition and results of operations, along with our consolidated financial statements and the related notes and other information included in this Annual Report on Form 10-K. It is important to note that this discussion and analysis contain forward-looking statements with certain risks and uncertainties. These risks and uncertainties could cause our results to differ materially from anticipated in these forward-looking statements. You can find more information about these risks and uncertainties under the heading Special Note Regarding Forward-Looking Statements in Part I and elsewhere in this Form 10-K.\nSpecial Note Regarding Forward-Looking Statements\nThis Form 10-K includes forward-looking statements that entail potential risks and uncertainties. These statements are usually identified by the use of specific terminology such as anticipate, believe, could, estimate, expect, intend, may, plan, potential, predict, project, should, target, will, would and other comparable terminology. All the statements in this Form 10-K that are not about historical facts, including those related to our future operations, financial position, Revenue, projected costs, strategy, plans, management objectives, and expected market growth, are forward-looking. While reading this Form 10-K, you should know that these statements do not guarantee our performance or results. They include known and unknown risks, uncertainties, and assumptions, as mentioned under the Risk Factors section in this Form 10-K. We believe that these forward-looking statements are based on reasonable assumptions. Still, you must be aware that many factors, including those mentioned under the Risk Factors section in this Form 10-K, could affect our financial results or operations and cause actual results to differ from those stated in the forward-looking statements. These statements were made as of the date of this Form 10-K, and we are not obligated to update or revise any forward-looking statements made here to reflect any change in our expectations or any change in events, conditions, or circumstances on which these statements are based. All written or oral forward-looking statements made by us or on our behalf are qualified by the cautionary statements mentioned in this Form 10-K.\nObjective\nIn this section, we provide an analysis of the Companys financial condition, cash flows, and results of operations from managements perspective. We recommend you read this with the consolidated financial statements and notes in Part II, Item 8 of this Annual Report on Form 10K.\nExecutive Summary\nWe are a fintech company based in Ontario, Canada. Our tech-driven businesses are focused on mortgages and insurance. Our goal is to provide clients with an industry-leading experience through our trusted digital solutions that are simple and fast.\nRecent Developments\nBusiness Trends\nThroughout 2022 and 2023, the Bank of Canada raised the prime rate several times to curb inflationary pressures. Consequently, the mortgage interest rates increased significantly, leading to a considerable shrinkage in the mortgage origination market from 2022 to 2023. The rise in mortgage interest rates, alongside the economic uncertainty, has resulted in a reduced demand for mortgage originations.\nSummary of the Year Ended August 31, 2023.\nDuring the period under review, we generated $ 1.399 billion in residential mortgage loans compared to $1.790 billion in the previous financial year, which ended on August 31, 2022. This amount represents a decrease of $386.00 million or 21.63% compared to the same period that ended on August 31, 2022. Our Net Loss stood at $2.874 million, a lower Net Loss compared to the $3,015 million recorded in the same period on August 31, 2022. We also generated loss $1.239 million of Adjusted EBITDA, which represents a decrease of $ 0.376 million, or 23.26%, compared to the $1.615 million generated in the same period on August 31, 2022. For more information on Adjusted EBITDA, please refer to the Non-GAAP Financial Measures section.\nNon-GAAP Financial Measures\nWe provide investors with additional information in addition to our GAAP results. We do this by disclosing our non-GAAP financial measures: Adjusted Revenue, adjusted net (Loss) income, adjusted diluted (Loss) earnings per share, and adjusted EBITDA. These measures, which GAAP does not calculate, are believed to be useful by management in providing investors with useful information regarding the performance and value of our business. Our non-GAAP financial measures serve as performance indicators unaffected by fluctuations in certain costs or other items. While other companies may define these measures differently, they allow for better comparisons of general operating performance from period to period. It is important to note that our non-GAAP financial measures should not be viewed as substitutes for Revenue, net Income, or any other operating performance measure calculated by GAAP. Finally, we rely on these non-GAAP financial measures to plan and forecast for future periods.\nOur definition of Adjusted Revenue is the sum of all gross revenues. Similarly, we define Adjusted Net (Loss) Income as pre-tax earnings before accounting for share-based compensation expense, impairment loss on investments, accrual of legal fees and deferred tax accrual, and the applicable tax effects of these adjustments. We add back Salesforce expenses and capitalize them with a 20% depreciation rate. We also add deferred government grants in current Income to arrive at Adjusted EBITDA. Lastly, our definition of Adjusted Diluted (Loss) Earnings Per Share is derived after adjusting for the abovementioned items.\nOur definitions of each non-GAAP financial measure allow us to add back certain cash and non-cash charges and deduct certain gains included in calculating total revenues, net, and net Income attributable to Pineapple Financial Inc. or net Income. However, these expenses and gains vary greatly and are difficult to predict. From time to time in the future, we may include or exclude other items if we believe that doing so is consistent with providing useful information to investors.\nAlthough we use non-GAAP financial measures to evaluate our business performance, its important to note that they do not include certain necessary costs to operate our business. These measures can help demonstrate the long-term impact of our strategies. Still, they should not be considered an indication that our future results will be unaffected by unusual or non-recurring items. Its important to note that non-GAAP financial measures have limitations as analytical tools and should not be used in isolation or as a substitute for analyzing our results as reported under U.S. GAAP. These measures cannot be relied upon as a measure of discretionary cash available to invest in the growth of our business or as a measure of money available to us to meet our obligations.\nLimitations to our non-GAAP financial measures included, but are not limited to:\n(a) they do not reflect every cash expenditure, future requirements for capital expenditures or contractual commitments;\n(b) Adjusted EBITDA does not reflect the significant interest expense or the cash requirements necessary to service interest or principal payment on our debt;\n(c) although depreciation and amortization are non-cash charges, the assets being depreciated and amortized will often have to be replaced or require improvements in the future, and Adjusted Revenue, Adjusted Net Income (Loss) and Adjusted EBITDA do not reflect any cash requirement for such replacements or improvements; and\n(d) they are not adjusted for all non-cash income or expense items reflected in our Consolidated Statements of Cash Flows.\nTo better evaluate our operating performance, we utilize non-GAAP financial measures and other comparative tools, in addition to U.S. GAAP measurements, which address certain limitations. The reconciliation of our non-GAAP financial measures to their corresponding U.S. GAAP measures can be found below. Furthermore, our U.S. GAAP-based measures are available in the consolidated financial statements and related notes, which are included in Form 10-K.\nReconciliation of Adjusted Revenue to Total Revenue, net\nYear Ended August 31,\nTotal Revenue, net 2,502,264 3,600,851\nCommission expense 13,931,836 16,780,133\nGross Revenue 16,434,100 20,380,984\nReconciliation of Adjusted Net (Loss) Income to Net Income Attributable to Pineapple Financial Inc.\nYear Ended August 31,\nNet Income attributable to Pineapple Financial (2,809,036 ) (2,810,061 )\nShare-based compensation 33,091 723,217\nSalesforce expenses - net of depreciation 224,683 215,854\nGovernment based incentive 699,627 -\nDepreciation 441,159 255,871\nInvestment impairment 27,143 -\nLegal fee accrual 143,947 -\nAdjusted EBITDA (1,239,386 ) (1,615,119 )\nReconciliation of Adjusted Diluted Weighted Average Shares Outstanding to Diluted Weighted Average Shares Outstanding\nYear Ended August 31,\nWeighted average common shares outstanding 6,306,978 6,306,978\nAdjusted EBITDA (1,239,386 ) (1,615,119 )\nAdjusted Diluted (Loss)) Earning per share (0.20 ) (0.26 )\nKey Performance Indicators\nAs part of our business operations, we closely track several key performance indicators (KPIs) that help us measure our performance. We can evaluate our ability to generate Revenue by monitoring our loan production KPIs and comparing our performance to the mortgage origination market. Additionally, we use KPIs related to our technology setup and underwriting processes to assess our performance further.\nYear Ended August 31,\nMortgage volume 1,398,464,338 1,785,424,632\nSales revenue 15,026,896 19,497,519\nCommission expense 13,931,836 16,780,133\nNet sales revenue 1,095,060 2,717,385\nUnderwriting revenue 148,080 266,731\nSubscription revenue 736,708 616,734\nOther income 522,416 266,731\nDescription of Certain Components of Financial Data\nComponents of Revenue\nOur sources of Revenue include commissions from lenders, underwriting revenue, membership fees from mortgage agents, and other income.\nSales revenue\nSales Revenue is commission collected from financial institutions with whom it has contracts in place. The Company earns revenue based on a percentage of mortgage amount funded between individual referred by the Company and financial institutions funding the mortgage. We are an agent in these deals as we provide the platform for other parties to provide services to the end-user. For each contract with a customer, the Company identifies the contract with a customer; identifies the performance obligations in the contract; determines the transaction price to the separate performance obligations on the basis of the relative stand-alone selling price of each distinct good or service to be delivered; and recognizes revenue when or as each performance obligation is satisfied in a manner that depicts the transfer to the customer of the goods or services promised. The Company recognizes revenue when: a contract exists with a lender party and an agent broker, the contract identifies the use of the platform service to close a mortgage deal, the mortgage deal has been closed with the lending financial institution, and commissions paid by the lending financial institution based on various criteria of the mortgage deal including but not limited to interest rates available at that time, term, seasonality, collateral, income, purpose, etc. Revenue is measured at the fair value of the consideration received or receivable and represents amounts receivable for services provided in the normal course of business. Revenue is recognized at the end of the deal upon completion of all the actions listed above. A typical transaction attracts a commission fee payable to Pineapple Financial Inc.\nSubscription Revenue:\nUsers access and use our technology platform, MyPineapple, for a flat monthly service fee of $118. In exchange for this fee, users of MyPineapple have access to a network management system that allows them to perform back-office procedures more efficiently and effectively. This platform will enable them to process the deal described above prepare, and complete the package for submission to be funded by the financial institution. We have a strong user base, which has experienced significant growth since our inception. Revenue is recognized at the beginning of the month when a User is invoiced and pays the fee.\nUnderwriting Fee:\nUsers can optionally use our expert risk pre-assessment service, which assists them in pre-underwriting their loans before submission to a lender for approval and funding. This service significantly reduces the time for the lender partners assessment of the deal. For mortgages of $197,475 and less, we charge an underwriting fee of $276; for mortgages greater than $197,475, the Company charges an underwriting fee of $395. The Company has undertaken a special program to educate and inform Users of this service in further detail. Approximately 40% of the deals originated by Users are using this service. This program intends to further increase the number of deals and improve the services offered.\nOther Income:\nOther Income includes a technology setup fee and sponsorship fee.\nComponents of operating expenses\nOur operating expenses, as presented in the statement of operations data, include salaries, commissions and team member benefits, general and administrative expenses, marketing and advertising expenses, and others.\nSalaries and commissions and team member benefits\nAll payroll expenses include our team members salaries, commissions, and benefits.\nSelling, general and administrative expenses\nSelling, general and administrative expenses include software subscriptions, license fees, professional services, marketing expenses, and other operating expenses.\nShare-based compensation\nShare-based compensation comprises equity awards and is measured and expensed accordingly under Accounting Standards Codification (ASC) 718 Compensation-Stock Compensation.\nComparison of the years ended August 31, 2023 and 2022\nRevenue\nGross Revenue decreased from $20.381 million in the fiscal year ending August 31, 2022, to $16.434 million in the fiscal year ending August 31, 2023, representing a 19.37% decrease from year to year. To control high inflation, The Bank of Canada increased the interest rate from 2.5% as of September 01, 2022, to 5.00% as of August 31, 2023. This resulted in decreased real estate transactions and, eventually, in the mortgage business. The number of real estate transactions in Canada fell from 558,591 houses during the year ended August 31, 2022, to 441,536 houses during the year ended August 31, 2023, representing a 21.02% decrease.\nGross Profit Percentage\nPineapple Financials gross margin decreased to 15.23% during the year ended August 31, 2023, from 17.67% during the year ended August 31, 2022. This decrease was due to more volume by high-volume agents with low margins.\nCost of Revenue\nDuring the financial year that ended August 31, 2023, the cost of revenue decreased to $13.932 million from $16.780 million during the previous year that ended August 31, 2022. The decrease in the cost of Revenue is due to the decline in Revenue.\nSelling, General and Administrative Expenses.\nThe breakdown of selling, general and administrative expenses are as follows:\nYear Ended August 31,\nDescription\n($)\n($)\nIncrease/(Decrease)\n($)\nIncrease/(Decrease)\n(%)\nSoftware subscription 816,913 923,137 (106,224 ) (11.51 )\nAdvertising, marketing and promotions 649,934 795,588 (145,654 ) (18.31 )\nEvents and award shows 194,863 - 194,863 100.00\nOffice and general 183,868 259,480 (75,612 ) (29.14 )\nProfessional fee 661,265 243,100 418,165 172.01\nDues and subscriptions 58,366 174,743 (116,377 ) (66.60 )\nRent 165,751 150,141 15,610 10.40\nConsulting fee 210,063 146,554 63,509 43..34\nTravel 97,372 104,812 (7,440 ) (7.10 )\nDonations 46,002 61,206 (15,204 ) (24.84 )\nLease expense 7,534 63,425 (55,891 ) (88.12 )\nInsurance (80,934 ) 54,867 (135,801 ) (247.51 )\nRepair and maintenance 2,489 2,266 1,016.43\nUtilities 1,459 - 1,459 100.00\n3,014,945 2,977,277 37,668 1.27\nSelling, general and administrative expenses increased by $37,668 from $2,977,277 during the year ended August 31, 2022, to $3,014,945 during the year ended August 31, 2023. This increase represents a 1.27% increase.\nSoftware subscriptions decreased by $106,224, representing 11.51% from $923,137 during the year ended August 31, 2022, to $816,913. This is due to less reliance on third-party software as internal software develops more.\nAdvertising, marketing and promotions decreased from $795,588 to $649,934, representing a decrease of 18.31% during the year ended August 31, 2022 and August 31, 2023. This decrease is due to a depressed real estate market.\nOffice and general expenses decreased to $183,868 during the year ending August 31, 2023, from $259,480 during the year ended August 31, 2022. This represents a decrease of $75,611 or 29.14% yearly. This decrease is mainly due to reduced revenue.\nProfessional fees increased to $661,265 during the financial year ended August 31, 2023, from $243,100 during the year ended August 31, 2022. This 172.01% increase is due to the preparation of our initial public offering (IPO) expenses.\nDues and subscriptions decreased from $174,743 during the year ended August 31, 2022, to $58,366 for the year ended August 31, 2023, representing a 66.60% decrease.\nThe consulting fee was increased from $146,554 during the year ended August 31, 2022, to $210,063 during the year ended August 31, 2023. This 43.34% increase was due to hiring consultants for our IPO process.\nSalaries, Wages and benefits\nYear Ended August 31,\nDescription\n($)\n($)\nIncrease/(Decrease)\n($)\nIncrease/(Decrease)\n(%)\nSalaries, wages and benefits 2,330,127 2,360,344 (30,218 ) (1.28 )\nSalaries, wages and benefits remain almost the same during the year that ended August 31, 2023 compared to the previous year, which ended on August 31, 2022.\nDepreciation\nYear Ended August 31,\nDescription\n($)\n($)\nIncrease/(Decrease)\n($)\nIncrease/(Decrease)\n(%)\nDepreciation 441,159 255,871 185,287 72.41\nPineapple financial is actively investing in the development of its software. During the year under review, $1.300 million were added in intangible assets. This addition represents mostly the salaries, wages and benefits of our staff working on intangible asset. These additions are the main cause of increase of depreciation during the year ended August 31, 2023.\nShare-based compensation\nYear Ended August 31,\nDescription\n($)\n($)\nIncrease/(Decrease)\n($)\nIncrease/(Decrease)\n(%)\nShare-based compensation 33,091 723,217 (690,126 ) (95.42 )\nDuring the year ended August 31, 2023, no grant of options was granted.\nGovernment based incentive\nYear Ended August 31,\nDescription\n($)\n($)\nIncrease/(Decrease)\n($)\nIncrease/(Decrease)\n(%)\nGovernment based incentive (591,480 ) - 591,480 100.00\nDuring the year ended August 31, 2023, the Company claimed Scientific Research and Experimental Development (SR&ED) from the CRA for the years ending August 31, 2022 and August 31, 2021. These claims were approved and received during the year ended August 31, 2023.\nLiquidity and Capital Resources\nOur primary liquidity needs encompass working capital and capital expenditures, specifically those associated with technological enhancements, investments in skilled personnel, and marketing services. These three categories have constituted a significant portion of our liquidity and capital resource demands throughout the year. We primarily utilize cash on hand and cash flows generated from our operations to meet these requirements.\nThe following table summarizes our cash flows from operating, investing and financing activities:\nYear Ended August 31,\nDescription\n($)\n($)\nIncrease/(Decrease)\n($)\nCash (used) provided in operating activities (2,116,105 ) (1,834,909 ) (281,196 )\nCash (used) provided by financing activities 349,008 (61,470 ) 410,478\nCash (used) provided in investing activities (1,362,298 ) (1,052,932 ) (309,367 )\nCash at the end of the period 720,365 3,896,840 (3,176,475 )\nNet cash flow from (used in) operating activities\nYear Ended August 31,\nDescription\n($)\n($)\nOperating activities\nNet loss (2,809,036 ) (2,810,061 )\nAdjustments for the following non-cash items:\nDepreciation of property and equipment 67,311 42,218\nDepreciation of intangible assets 265,150 79,489\nDepreciation on right of use asset 108,335 90,049\nInterest expense on lease liability 56,316 32,017\nShare-based compensation 33,091 723,217\nWrite-down of investment 27,143 -\nNet changes in non-cash working capital balances:\nTrade and other receivables (26,242 ) (32,284 )\nPrepaid expenses and deposits 265,545 (336,360 )\nAccounts payable and accrued liabilities (174,795 ) 382,294\nIncome taxes receivable 71,078 (5,488 )\nDeferred Government Grant\n(2,116,105 ) (1,834,909 )\nOur primary source of cash flow comes from our core business operations.\nDuring the year ended August 31, 2023, the Companys net cash used in operating activities increased to $2,116,105 from $1,834,909 in the previous year. This increase of outflow of cash was primarily due to a net loss of $2,809,036. Additionally, prepaid expenses and deposits decreased by $601,905, and accounts payable and accrued liabilities were reduced by $557,089.\nNet cash flow from (used in) financing activities\nDuring the year ended August 31, 2023, the Company received $430,098 in financing from Easily Financing for working capital support. Additionally, the Company fulfilled its lease payments during the year.\nNet cash flow from (used in) investing activities\nThe Company invested $1,300,225 to develop software for quick and accurate mortgage application filling by field agents during the year ended August 31, 2023. These investments will help the company acquire more mortgage agents in the future.\nAs of August 31, 2023, the Companys cash balance was $720,365, a decrease from $3,896,839 on August 31, 2022.\nThe Companys capital structure comprises of contributed common shares, an accumulated deficit, additional paid-in capital, and other comprehensive losses. Its primary sources of liquidity are cash generated through operations and cash received from investors in exchange for the issuance of common shares. The business aims to meet all its financial and other obligations as they come due.\nFuture capital requirements will depend on various factors, including our investment in technology and growth rate. However, certain aspects, like interest rates and real estate markets, are beyond our control.\nThe following table presents our liquidity:\nYear Ended August 31,\nDescription\n($)\n($)\nCash and cash equivalents 720,365 3,896,839\nTrade and other receivables 758,988 33,119\nPrepaid expenses and deposit 218,150 483,695\nIncome tax receivable - 71,078\n1,697,503 4,484,731\nAs of August 31, 2023, Pineapple has a healthy liquidity position with $720,365 in cash and cash equivalents. The trade and other receivables, prepaid expenses and deposits indicate that the Company can meet its obligations. However, there was a decrease of $3,176,474 in cash and cash equivalents from August 31, 2022, to August 31, 2023. This was mainly due to the expansion of our operations and investment in technology. Additionally, the Canadian real estate market, inflation, and the continuous hike of interest rates by the Bank of Canada have also affected the Companys operations and impacted its liquidity.\nCritical Accounting Policies and Significant Judgments and Estimates\nThis managements discussion and analysis of the financial condition and results of operations is based on our financial statements, which have been prepared in accordance with U.S. GAAP. The preparation of these financial statements requires us to make estimates and assumptions that affect the reported amounts of assets and liabilities, disclosure of contingent assets and liabilities at the date of the financial statements, and the reported amounts of Revenue and expenses during the reported period. Per U.S. GAAP, we base our estimates on historical experience and various other assumptions we believe to be reasonable under the circumstances. Actual results may differ from these estimates if conditions differ from our assumptions. While our significant accounting policies are more fully described in Note 2 in the Notes to Financial Statements, we believe the following accounting policies are critical to making effective judgments and estimates in preparing our financial statements.\nRevenue Recognition\nThe Company has adopted ASC 606, Revenue from Contracts with Customers, which provides a single comprehensive model for revenue recognition. The core principle of the standard is that Revenue should be recognized when goods or services are transferred to customers at an amount that reflects the consideration to which the entity expects to be entitled in exchange for those goods or services. The standard introduced a new contract-based revenue recognition model with a measurement approach that is based on an allocation of the transaction price. It establishes a five-step model to account for Revenue arising from contracts with customers. Under this standard, Revenue is recognized at an amount that reflects the consideration to which an entity expects to be entitled in exchange for transferring goods or services to a customer. The standard requires entities to exercise judgement, taking into consideration all of the relevant facts and circumstances when applying each step of the model to contracts with customers. Additionally, the standard specifies the accounting for incremental costs of obtaining a contract and the costs directly related to fulfilling a contract.\nWhen the Company transfers goods or services to a customer, Revenue is recognized at an amount that reflects the consideration expected to be received.\nThe Company operates an online platform powered by Salesforce, that enables brokers and agents to efficiently close deals.\nThe Companys subsidiary, Pineapple Insurance Inc., generates Revenue by charging premiums for insurance policies and services. Pineapple Insurance is affiliated with a major insurance company, from which it earns commissions for providing services, primarily mortgage insurance. Mortgage insurance is a requirement for each mortgage. Pineapple Insurance acts as the agent that supplies insurance services to the consumer and is paid a commission from the premiums collected by the insurance company whose products and services it provides to the end consumer. Additionally, Pineapple Insurance has adopted ASC 606.\nBasis of presentation, functional and presentation currency\nThe Companys headquarters is in Ontario, Canada, and the functional currency is in Canadian Dollars (CAD) with the presentation currency being US Dollars (USD). The Companys subsidiaries have a functional currency of CAD and presentation currency of USD which have been applied consistently.\nThere will be a foreign currency translation undertaken to report under US GAAP which will be the basis of presentation.\nLease Accounting\nThe relevant criteria applicable is ASC 842. We assess at contract inception whether a contract is, or contains, a lease. That is, if the contract conveys the right to control the use of an identified asset for a period of time in exchange for consideration. We apply a single recognition and measurement approach for all leases, except for short-term leases and leases of low-value assets. We recognize lease liabilities to make lease payments and right-of-use assets representing the right to use the underlying assets.\nAt the commencement date of the lease, we recognize lease liabilities measured at the present value of lease payments to be made over the lease term. Lease payments include fixed payments (including in-substance fixed payments) less any lease incentives receivable, variable lease payments that depend on an index or a rate, and amounts expected to be paid under residual value guarantees. Lease payments also include the exercise price of a purchase option reasonably certain to be exercised by us and payments of penalties for terminating the lease, if the lease term reflects us exercising the option to terminate. Variable lease payments that do not depend on an index or a rate are recognized as expenses in the period in which the event or condition that triggers the payment occurs. In calculating the present value of lease payments, we use our incremental borrowing rate at the lease commencement date because the interest rate implicit in the lease is not readily determinable. After the commencement date, the amount of lease liabilities is increased to reflect the accretion of interest and reduced for the lease payments made. In addition, the carrying amount of lease liabilities is remeasured if there is a modification, a change in the lease term, a change in the lease payments (e.g., changes to future payments resulting from a change in an index or rate used to determine such lease payments) or a change in the assessment of an option to purchase the underlying asset.\nWe recognize right-of-use assets at the commencement date of the lease (i.e., the date the underlying asset is available for use). Right-of-use assets are measured at cost, less any accumulated depreciation and impairment losses, and adjusted for any remeasurement of lease liabilities. The cost of right-of-use assets includes the amount of lease liabilities recognized, initial direct costs incurred, and lease payments made at or before the commencement date less any lease incentives received. Right-of-use assets are depreciated on a straight-line basis over the shorter of the lease term and the estimated useful lives of the assets.\nInvestments\nWe invested in a commercial mortgage firm, MCommercial, based in Montreal and Toronto, Canada representing 5% of the total issued and outstanding shares. This strategic partnership allows Pineapple residential mortgage agents to have access to a leading commercial mortgage firm and experts, which will expand their product offerings, service levels and corporate Revenue through increased transactions.\nThe Company entered into a share purchase agreement with 9142-2964 Quebec Inc. pursuant to which the Company acquired five Class A Shares of 7326904 Canada Inc. (dba as Mortgage Alliance Corporation) (Alliance), representing 5% of the total issued and outstanding shares of Alliance. Alliance is a mortgage brokerage firm based in Ontario, Canada with locations in Calgary, Vancouver and Halifax. Both represent a total investment as of May 31, 2023 of $36,830.\nThe total amount of both investments was recorded at fair value, and any impairment loss is recognized in profit and loss account.\nShare Based Compensation\nStock-based compensation is accounted for based on the requirements of the Share-Based Payment Topic of ASC 718, Compensation - Stock Compensation (ASC 718), which requires recognition in the financial statements of the cost of employee, non-employee and director services received in exchange for an award of equity instruments over the period the employee, non-employee or director is required to perform the services in exchange for the award (presumptively, the vesting period). ASC 718 also requires measurement of the cost of employee, non-employee, and director services received in exchange for an award based on the grant-date fair value of the award.\nThe Company has a share option plan (the Plan) to attract, retain and motivate qualified directors, officers, employees, and consultants whose present and future contributions are important to the success of the Company by offering them an opportunity to participate in the Companys future performance through the award of share options.\nEach share option converts into one common share of Pineapple Financial Inc. on exercise. No amounts are paid or payable by the recipient on receipt of the option. The options carry neither right to dividends nor voting rights. Options may be exercised at any time from the date of vesting to the date of their expiry.\nIn 2017, the Plan was amended such that the total number of common shares reserved and available for grant and issuance pursuant to the Plan is to equal 10% of the issued and outstanding common shares of the Company.\nOptions granted on June 14, 2021, vest over a 2-year period whereby 25% of the options granted vested on the date of grant, and the remaining unvested options vest in equal installments every 6-months thereafter. The fair value of stock options granted was $1,317,155. A total stock-based compensation expense was recognized of $57,340 for the vested options (August 31, 2021 - $637,517).\nThe Chief Financial Officer was granted 63,821 Stock options on November 15, 2021 as part of his compensation package. The options vest over a 3-year period whereby 8,974 of the options granted vested on the grant date and the remaining unvested options vest in equal installments every 6-months thereafter. The fair value of the stock options granted was $141,885. The Chief Financial Officer options were forfeited and a recovery on stock-based compensation of $24,250 was recognized during the year ended August 31, 2023. For year ended August 31, 2023, stock-based compensation expense of $nil (August 31, 2022 - $85,700) was recognized.\nOn July 6, 2023, we completed a 1-for-3.9 reverse stock split, or the Reverse Split, effective immediately. Consequently, all the share numbers, shares prices, and exercise prices have been retroactively adjusted in these condensed interim consolidated financial statements for all periods presented.\nControls and Procedures\nAlthough we are currently not required to maintain an effective internal controls system, we have assessed and already started creating our internal controls as we have determined the need to maintain effective and controlled systems including but not limited to:\n● skilled staffing for financial, accounting and external reporting areas, including segregation of duties;\n● reconciliation of accounts as necessary to ensure correct classification, accurate recording and balancing of books;\n● proper recording of expenses, liabilities, and other accounting entries in the period to which they relate as per the matching principle;\n● maintaining a fixed assets register that identifies user, department, and detailed tracking;\n● evidence of internal review and approval of accounting transactions by 2 or more independent personnel;\n● documentation of processes, assumptions and conclusions underlying significant estimates; and\n● documentation of accounting policies and procedures.\nThe Company currently uses NetSuite, a proprietary financial accounting software from Oracle Corporation for recording, tracking and financial reporting. However, external resources may be required such as professional consultants to determine more specific internal controls to decrease exposure to erroneous financial reporting which the Company is significantly deficient to meet the necessary regulatory requirements and responsibilities, and ensure compliance in all respects thereby incurring significant expenses in meeting these needs. As of August 31, 2023, under the supervision and with the participation of our management, including our principal executive officer and principal financial officer, we conducted an evaluation of the effectiveness of our internal control over financial reporting and based on this assessment, our management concluded that, as of August 31, 2023, our internal controls over financial reporting lacked adequate segregation of duties within the accounting and system process, inadequate documentation to evidence the operation of controls, inconsistent procedures and approvals and insufficient written policies and procedures for accounting, IT and financial reporting and record keeping. We are implementing plans to improve such internal control.\nFinancial Instruments\nAs on August 31, 2023, the Companys financial instruments consist of cash, trade and other receivables, investments, accounts payable and accrued liabilities.\nAs per ASC 820, Fair value measurement establishes a fair value hierarchy based on the level of independence, objective evidence surrounding the inputs used to measure fair value. A financial instruments categorising within the fair value hierarchy is based upon the lowest level of input that is significant to the fair value measurement.\ni) Level 1 fair value measurements are those derived from quoted prices (unadjusted) in active markets for identical assets or liabilities;\nii) Level 2 fair value measurements are those derived from inputs other than quoted prices included within Level 1 that are observable for the asset or liability, either\ndirectly (i.e., as prices) or indirectly (i.e., derived from prices); and\niii) Level 3 fair value measurements are those derived from valuation techniques that include inputs for the asset or liability that are not based on observable market data (unobservable inputs).\nThe following table provides the fair values of the financial assets in the Companys consolidated statements of financial position, categorized by hierarchical levels and their related classifications.\nAs of August 31, 2023 Level Level Level Total\nAssets:\nCash 720,365\n720,365\nInvestment\n10,013 10,013\nRISKS AND UNCERTAINTIES\nThe Companys business is subject to numerous risks and uncertainties, including those described elsewhere in this MD&A, as well as general economic and market risks. These risk factors could materially affect the Companys future operating results and could cause actual events to differ materially from those described in forward-looking information relating to the Company. Item 7A. Quantitative and Qualitative Disclosures about Market Risk\nAs part of our regular business operations, we face various risks that can impact our profitability and operations. These risks can be broadly categorized as interest rate risk, credit risk, counterparty risk, and risks associated with the COVID-19 pandemic.\nInterest rate risk\nWe do not face interest rate risk as we do not have any variable-rate loans or borrowings.\nCredit risk\nCredit risk is the risk of financial loss to the Corporation if a counterparty to a financial instrument fails to meet its contractual obligations. The Corporations credit risk is mainly attributable to its cash and cash equivalents and trade and other receivables.\nThe Corporation has determined that its exposure to credit risk on its cash and cash equivalents is minimal as the Corporations cash and cash equivalents are held with financial institutions in Canada.\nOur primary source of credit risk relates to the possibility of Core Business Operations brokerages or other customers not paying receivables. Core Business Operations manages its credit risk by performing credit risk evaluations on its brokerages and agents and monitoring overdue trade and other receivables. As of August 31, 2023, $2,572 (August 31, 2022 $1,901) of our trade receivables are greater than 90 days outstanding. A decline in economic conditions or other adverse conditions experienced by brokerage and agents could impact the collectability of the Corporations accounts receivable.\nOur maximum exposure to credit risk approximates the carrying value of the assets on the Corporations consolidated statements of financial position.\nAugust 31,\nCash and cash equivalents 720,365 3,896,839\nTrade, other receivable and other assets 758,988 33,119\nNotes receivable 218,150 483,695\nIncome tax receivable - 71,078\n1,697,503 4,484,731\nLiquidity risk\nLiquidity risk is the risk that the Company will not be able to meet its financial obligations as they become due. The Companys approach in managing liquidity is to ensure, to the extent possible, that it will have sufficient liquidity to meet its liabilities when due, by continuously monitoring actual and forecasted cash flows. As of August 31, 2023, the Companys contractual cash flow obligations and their maturities are as follows:\nCash flow under contract. Within 1 year Greater than 1 year\nAccounts payable and accrued liabilities 605,318 605,318\nLease obligations 1,107,961 138,372 969,589\nShort term loans 430,098 430,098 ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA.\nThe Companys consolidated financial statements and report of independent registered public accounting firm MNP LLP with the PCAOB ID: 1930 is contained in pages through, which appear at the end of this Annual Report on Form 10-K. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS AND FINANCIAL DISCLOSURE.\nNone. ITEM 9A. CONTROLS AND PROCEDURES.\nEvaluation of Disclosure Controls and Procedures\nWe are transitioning to and will maintain disclosure controls and procedures that are designed to ensure that information required to be disclosed by us in reports that we file or submit under the Exchange Act is recorded, processed, summarized and timely reported as provided in SEC rules and forms and that such information is accumulated and communicated to our management, as appropriate, to allow for timely decisions regarding required disclosure. We will periodically review the design and effectiveness of our disclosure controls and procedures, including compliance with various laws and regulations that apply to our operations. We will make modifications to improve the design and effectiveness of our disclosure controls and procedures and may take other corrective action if our reviews identify a need for such modifications or actions. In designing and evaluating the disclosure controls and procedures, we recognize that any controls and procedures, no matter how well designed and operated, can provide only reasonable assurance of achieving the desired control objectives, and we will apply judgment in evaluating the cost-benefit relationship of possible controls and procedures. In addition, the design of any system of controls also is based in part upon certain assumptions about the likelihood of future events, and there can be no assurance that any design will succeed in achieving its stated goals under all potential future conditions; over time, controls may become inadequate because of changes in conditions, or the degree of compliance with policies or procedures may deteriorate. Because of the inherent limitations in a control system, misstatements due to error or fraud may occur and not be detected.\nManagements Report on Internal Control Over Financial Reporting\nThis Annual Report does not include a report of managements assessment regarding internal control over financial reporting due to a transition period established by the rules of the SEC for newly public companies.\nChanges in Internal Control Over Financial Reporting\nThere have been no changes in our internal control over financial reporting that occurred during our last fiscal quarter that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\nAttestation Report of Independent Registered Public Accounting Firm\nThis Annual Report does not include an attestation report of our registered independent public accounting firm regarding internal control over financial reporting due to an exemption established by the JOBS Act for emerging growth companies. ITEM 9B. OTHER INFORMATION.\nNone.\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS.\nNot applicable.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE.\nExecutive Officers and Directors\nThe following table sets forth the name, age and position of each of our executive officers, key employees and directors.\nName\nAge\nPosition(s)\nDate Appointed\nShubha Dasgupta\nChief Executive Officer and Director\nOctober 16, 2015\nSarfraz Habib\nChief Financial Officer\nApril 10, 2023\nChrista Mitchell\nChief Strategy Officer and Director\nApril 1, 2020\nKendall Marin\nPresident, COO, and Director\nOctober 16, 2015\nDrew Green\nChairman of the Board\nMay 6, 2019\nPaul Baron\nDirector\nAugust 19, 2016\nTasis Giannoukakis\nDirector\nAugust 19, 2016\nNima Besharat\nDirector\nMay 26, 2021\nShubha Dasgupta, Chief Executive Officer and Director\nSince entering the mortgage industry in 2008, Shubha has been focused on positively disrupting the sector by leveraging technology and putting people at the heart of the business. Shubhas unique vision and expertise have allowed him to build and grow the Company (formerly CLC Network), which now has over 500 brokers in its network. Under his leadership, the company has built a world-class proprietary data-driven Client Relationship Management (CRM) Platform, which is the first full-circle mortgage process for agents, offering a more personalized experience for clients. Shubhas deep understanding of business and industry trends, coupled with the ability to drive best-in-class customer experience and profitability have enabled him to infuse vision and purpose in his professional endeavors throughout his career. An award-winning executive and seasoned industry expert, Shubha was recognized among the 2020 Mortgage Global 100 top executives who are inciting positive change and growth within the field. Since 2018, he has also been featured for four consecutive years in the annual Canadian Mortgage Professionals Hot List which highlights the industrys top leaders. In 2021, he was appointed President of the Canadian Mortgage Brokers Association (CMBA) Ontario Board of Directors, after serving a second year on the Board of Directors. An active member in the Toronto community, Shubha is a philanthropic leader for various non-profit organizations. Since 2010, he has been a devoted advocate in the fight against cancer. Prior to joining the mortgage industry, he headed a group of volunteers for the Canadian Cancer Society for eight years. In 2017, he also co-founded CMI Cancer Fighters, a group of Canadian mortgage industry professionals dedicated to the fight against cancer on which he currently chairs.\nMr. Dasgupta has been the Chief Executive Officer and a director of the Company since October 16, 2015 and before that was a Mortgage Broker at Bedrock Financial Group between August 2008 and October 2016.\nSarfraz Habib, Chief Financial Officer\nSarfraz Habib is a finance executive with over 25 years of expertise in finance and accounting. As the current CFO of Pineapple, Sarfraz oversees the companys financial operations and strategy. He is an experienced professional in the finance and accounting arena, with a notable background working for several large publicly listed organizations. He has extensive knowledge of financial planning and analysis, budgeting, forecasting, and financial reporting. Sarfraz holds Chartered Accountant qualifications. Sarfrazs experience includes serving as Controller and a board member of Keystroke Group Inc., where he streamlined the companys accounting and finance processes and was twice awarded the Employee of the Year honors. In his current role at Pineapple, Sarfraz oversees all financial operations, including accounting, financial planning, and analysis.\nMr. Habib has been the Chief Financial Officer of the Company since April 10, 2023.\nChrista Mitchell, Chief Strategy Officer and Director\nAn established professional in the mortgage industry, Christa has more than 15 years of experience in sales, technology, and executive management. In previous roles at Mortgage Alliance, she succeeded in growing and managing a 90-members independently owned affiliate brokerage network and championing the companys enterprise technology platform, where she was responsible for sales, education and the support team. While Vice President of Operations at her previous position, she directed corporate administration, payroll systems, broker recognition and networking events. In 2020, she was recognized in the Canadian Mortgage Professionals annual ‘Women of Influence, which highlights female leaders who have been breaking down barriers in the mortgage industry and making it more inclusive. Christa brings over 15 years of sales, technology, and administrative experience in the mortgage industry. Most recently Christa excelled as the companys Vice President of Operations where she directed corporate administration, payroll systems, broker recognition and networking events.\nMs. Mitchell has been the Chief Strategy Officer and a director of the Company since April 2020. Before that, Ms. Mitchell was the Vice President of Operations and Vice President of Sales, Service and User Experience of Mortgage Alliance between September 2005 and March 2020.\nKendall Marin, President, Chief Operating Officer and Director\nMr. Marin has been the President and Chief Operating Officer and a director of the Company since October 16, 2015. Before that, Kendall was a Mortgage Broker for InTrend Mortgage Inc. between January 2012 and October 2015 and prior to that was a franchise owner at Property Guys between May 2010 and January 2013.\nKendall has been leading the growth of the company with regard to fine-tuning of business processes to ensure maximum productivity. His proven expertise, focus on excellence and dedication have enabled him to build and expand the Companys network, as well as the companys proprietary data-driven Client Relationship Management (CRM) platform.\nKendall has had a career both in the corporate world and as a seasoned entrepreneur. At the age of 16, he created his own entertainment and promotion company, which was highly successful in Toronto throughout the 2000s. Later on, when Kendall was ready to take on his next challenge, he joined Canadas top telecom company Bell, where he became the youngest Associate Director. In 2012, he made his debut in the mortgage industry where he has applied his leadership, organizational and management skills to a new industry.\nSince 2018, he has been featured for three consecutive years in the annual Canadian Mortgage Professionals Hot List which recognizes the industrys top leaders.\nDrew Green, Chairman of the Board\nDrew Green is President and Chief Executive Officer of INDOCHINO, growing the brand by over 600% between 2015- 2022, delivering nine figures in revenue in 2018, currently with 86 showrooms across North America and operations globally. Mr. Green has been recognized as Entrepreneur of the Year by Ernst & Young, US Retailer of the Year, Innovator of the Year, along with other awards during his career. At INDOCHINO, Mr. Green has established strategic capital from Madrona Venture Partners, Highland Consumer, Dayang Group, Mitsui & Co. (TSE: 8031) and Postmedia Network, (TSX: PNC.B) along with partnerships with the New York Yankees, Boston Red Sox, Nordstrom, and hundreds of National Basketball Association (NBA), Major League Baseball (MLB), National Football League (NFL), and National Hockey League (NHL) teams, athletes and celebrities.\nIn addition, Mr. Green is a Founder and Chairman of the Board of Directors of EMERGE Commerce Ltd. (TSXV: ECOM), a diversified, acquirer and operator of Direct to Consumer (DTC) e-commerce brands across North America. He also serves as Chairman of Real Luck Group Ltd. (TSXV: LUCK), a company that offers legal, real-money betting, live streams, and statistics on all major e-sports and sports on desktop and mobile devices and Chairman American Aires Inc. (CSE: WIFI) a Canadian-based nanotechnology company which has developed proprietary silicon-based microprocessors that reduce the harmful effects of electromagnetic radiation (EMR) along with being Chairman of Gravitas III (TSXV:TRIG.P). Through his family office DREWGREEN.CA INC., Mr. Green has become a mentor to dozens of Canadian entrepreneurs, becoming a founder, chairman, and/ or a shareholder in dozens of private and public companies that drive innovation and growth, including Riverdale Rentals, Pineapple Financial, Apollo Insurance, Parvis Invest (TSXV: PVIS), OR Collective, Yourika, Cloudrep AI and Between Co., a company founded by York University alumni.\nDrew served as a Director at The Scarborough Hospital Foundation for many years, and has established the Drew Green Thunderbird Award at the University of British Columbia and The Drew Green Lions Award at York University, providing student-athletes at both institutions with scholarships. He currently is a director on York Universitys Alumni Board, Canadas fourth-largest university, with approximately 55,700 students, 7,000 faculty and staff, and over 325,000 alumni worldwide.\nPaul Baron, Director\nPaul is a veteran Real Estate Executive with over 30 years of experience working with both residential and commercial properties. In his first year as a Sales Representative for Family Trust Realty, he sold 37 homes, quickly demonstrating both his sales smarts and entrepreneurial drive. He has held various positions with increasing responsibility and is currently the owner of Century 21 Leading Edge Realty, a real estate brokerage with nine offices, six satellite offices, and over 800 agents and employees. He is currently serving as the Central Brokerage Director on the Toronto Real Estate Boards (TREB) Board of Directors.\nMr. Baron has been a Director of the Company since August 19, 2016. Prior to his position with the Company, Mr. Baron was the President of Century 21 Leading Edge Reality Inc. since November 1994.\nTasis Giannoukakis, Director\nTasis is an owner, broker, and manager of Century 21 Leading Edge Realty, a real estate brokerage with nine offices, six satellite offices, and over 800 agents and employees. In 2019, his team had more sales than any other Century 21 franchise in Canada and broke into the companys worldwide top five. He has been with Century 21 Leading Edge Realty for over 20 years, and the firm continues its expansion through acquisitions of other firms to further solidify their position in the Canadian Real Estate market.\nMr. Giannoukakis has been a Director of the Company since August 19, 2016. Prior to such, he was a Broker/Owner of Century 21 Leading Edge Reality Inc. since August 2004.\nNima Besharat, Director\nNima currently serves as Director of Investment Banking at Gravitas Securities Inc., a Canadian leading full-service investment dealer where he helps with the advisory, restructuring, corporate finance, and mergers and acquisitions mandates across the firms platform. Gravitas Securities Inc. is a full-service investment dealer platform registered with Investment Industry Regulatory Organization of Canada (IIROC) and a member of Canadian Investor Protection Fund. Nima has experience in wealth management and asset management at Scotiabank (TSX: BNS) and TD Bank Group (TSX: TD).\nNima holds a Bachelor of Arts in Economics and History from Western University, a Bachelor of Laws (Hons.) from the University of Sheffield, a Master of Laws in International Business Law from Kings College London, University of London (Dr. Peter Dyne Scholar), and a Postgraduate Diploma in Legal Practice (Corporate Finance) from the University of Law (UK). Nima was called to the bar in Ontario in 2017. He has completed the Canadian Securities Course, Conduct and Practices Handbook Course, Chief Compliance Officers Qualifying Exam and the Partners, Directors and Senior Officers Course through the Canadian Securities Institute. Nima was nominated for the Investment Industry Association of Canada (IIAC) Top 40 Under 40 Award in 2020, recognizing professionals whose accomplishments have brought distinction to the investment/financial industry.\nDirectorships\nSome of the directors of the Company serve on the boards of directors of other reporting issuers (or the equivalent) in Canada or foreign jurisdictions. The following table lists the directors of the Company who serve on boards of directors of other reporting issuers (or the equivalent) and the identities of such reporting issuers (or the equivalent).\nName of Director\nReporting Issuers (or the Equivalent)\nDrew Green\nEMERGE Commerce Ltd.\nAmerican Aires Inc.\nReal Luck Group Ltd.\nParvis Invest Inc.\nGravitas III Capital Corp.\nThe Board has determined that these inter-locking directorships do not adversely impact the effectiveness of these directors on the Board or create any potential for conflicts of interest. However, certain of the Companys directors are, or may become, directors, officers or shareholders of other companies with businesses which may conflict with the Companys business.\nOrientation and Continuing Education\nThe Company has not yet established a formal orientation or education procedure for newly incoming directors. Board members are encouraged to communicate with management and auditors, to keep themselves current with industry trends and developments, and to attend related industry seminars. Board members have full access to the Companys records.\nFamily Relationships\nNone of our directors or executive officers has a family relationship as defined in Item 401 of Regulation S-K..\nDirector Assessment\nThe Board is responsible for ensuring that an appropriate system is in place to evaluate the effectiveness of the Board as a whole, the individual committees of the Board, and the individual members of the Board and such committees with a view of ensuring that they are fulfilling their respective responsibilities and duties. In connection with such evaluations, each director is required to provide his assessment of the effectiveness of the Board and each committee as well as the performance of the individual directors, annually. Such evaluations take into account the competencies and skills each director is expected to bring to his particular role on the Board or on a committee, as well as any other relevant factors.\nArrangements between Officers and Directors\nExcept as set forth herein, to our knowledge, there is no arrangement or understanding between any of our officers or directors and any other person pursuant to which the officer or director was selected to serve as an officer or director.\nInvolvement in Certain Legal Proceedings\nWe are not aware of any of our directors or officers being involved in any legal proceedings in the past ten years relating to any matters in bankruptcy, insolvency, criminal proceedings (other than traffic and other minor offenses), or being subject to any of the items set forth under Item 401(f) of Regulation S-K.\nBoard Committees\nOur Board directs the management of our business and affairs and conducts its business through meetings of the Board and its standing committees. As of the date hereof, the Board has established an Audit Committee, a Compensation Committee and a Nominating and Corporate Governance Committee. In addition, from time to time, special committees may be established under the direction of the board of directors when necessary to address specific issues.\nAudit Committee\nThe Company has formed an Audit Committee comprised of Paul Baron, Drew Green (Chair) and Tasis Giannoukakis. Our Board has affirmatively determined that each meets the definition of independent director under the listing rules of the NYSE American, and that they meet the independence standards under Rule 10A-3. Each member of our audit committee can read and understand fundamental financial statements in accordance with the SEC and the NYSE American audit committee requirements. In arriving at this determination, the Board has examined each audit committee members scope of experience and the nature of their prior and/or current employment.\nThe Audit Committee provides assistance to the Board in fulfilling its obligations relating to the integrity of the internal financial controls and financial reporting of the Company. The external auditors of the Company report directly to the Audit Committee. The Audit Committees primary duties and responsibilities set forth in the Audit Committees charter include the following: (i) reviewing and reporting to the Board on the annual audited financial statements (including the auditors report thereon) and unaudited interim financial statements and any related managements discussion and analysis, if any, and other financial disclosure related thereto that may be required to be reviewed by the Audit Committee pursuant to applicable legal and regulatory requirements; (ii) overseeing the audit function, including engaging in required discussions with the Companys external auditor and reviewing a summary of the annual audit plan, overseeing the independence of the Companys external auditor, overseeing the Companys internal auditor, and pre-approving any non-audit services to the Company; (iii) reviewing with management and the Companys external auditors the integrity of the internal controls over financial reporting and disclosure; (iv) reviewing management reports related to legal or compliance matters that may have a material impact on the Company and the effectiveness of the Companys compliance policies; and (v) maintaining, reviewing and updating the Companys whistleblowing procedures.\nRelevant Education and Experience\nEach proposed member of the Audit Committee has adequate education and experience that is relevant to their performance as an Audit Committee member and, in particular, the requisite education and experience that have provided the member with:\n(a) an understanding of the accounting principles used by the Company to prepare its financial statements and the ability to assess the general application of those principles in connection with estimates, accruals and reserves;\n(b) experience preparing, auditing, analyzing or evaluating financial statements that present a breadth and level of complexity of accounting issues that are generally comparable to the breadth and complexity of issues that can reasonably be expected to be raised by the Companys financial statements or experience actively supervising individuals engaged in such activities; and\n(c) an understanding of internal controls and procedures for financial reporting.\nFor a summary of the experience and education of the Audit Committee members see Directors and Executive Officers.\nAudit Committee Oversight\nAt no time since the commencement of the Companys financial year was a recommendation of the Audit Committee to nominate or compensate an external auditor not adopted by the Board.\nPre-Approval Policies and Procedures\nThe Audit Committee mandate requires that the Audit Committee pre-approve any retainer of the auditor of the Company to perform any non-audit services to the Company that it deems advisable in accordance with applicable legal and regulatory requirements and policies and procedures of the Board. The Audit Committee is permitted to delegate pre-approval authority to one of its members; however, the decision of any member of the Audit Committee to whom such authority has been delegated must be presented to the full Audit Committee at its next scheduled meeting.\nCompensation Committee\nThe Company has formed a Compensation Committee comprised of Drew Green, Paul Baron and Tasis Giannoukakis. Our Board has affirmatively determined that each satisfy the independence requirements defined under the applicable listing standards of the NYSE American, including the standards specific to members of a compensation committee and meet the independence standards under Rule 10A-3 under the Exchange Act. Our Compensation Committee assists the Board in reviewing and approving the compensation structure, including all forms of compensation, relating to our directors and executive officers. No officer may be present at any committee meeting during which such officers compensation is deliberated upon. The Compensation Committee is responsible for, among other things:\n● reviewing and approving to the Board with respect to the total compensation package for our most senior executive officers;\n● approving and overseeing the total compensation package for our executives other than the most senior executive officers;\n● reviewing and recommending to the Board with respect to the compensation of our directors;\n● reviewing periodically and approving any long-term incentive compensation or equity plans;\n● selecting compensation consultants, legal counsel or other advisors after taking into consideration all factors relevant to that persons independence from management; and\n● programs or similar arrangements, annual bonuses, employee pension and welfare benefit plans\nNominating and Corporate Governance Committee\nThe Company has formed a Nominating and Corporate Governance Committee comprised of three directors, Drew Green, Paul Baron and Tasis Giannoukakis, that satisfy the independence requirements for independence under the NYSE American listing standards and SEC rules and regulations. The Nominating and Corporate Governance Committee is responsible for overseeing the selection of persons to be nominated to serve on our Board. The Nominating and Corporate Governance Committee considers persons identified by its members, management, shareholders, investment bankers and others.\nCode of Business Code and Ethics Conduct\nOur Board has adopted a written Code of Ethics and Business Conduct which emphasizes the importance of matters relating to honest and ethical conduct, conflicts of interest, confidentiality of corporate information, protection and proper use of corporate assets and opportunities, compliance with applicable laws, rules and regulations and the reporting of any illegal or unethical behavior. A copy of the code posted on our website, gopineapple.com. In addition, we intend to post on our website all disclosures that are required by law or rules concerning any amendments to, or waivers from, any provision of the code.\nChanges in Nominating Procedures\nNone. ITEM 11. EXECUTIVE COMPENSATION\nSummary Compensation Table\nThe following table sets out the compensation paid or payable to the Named Executive Officers (NEO) of the Company during the last two fiscal years:\nName and Principal Position Year Salary ($) Bonus ($) Stock Awards ($) Option Awards ($) Non-Equity Incentive Plan Compensation ($) Nonqualified Deferred Compensation Earnings ($) All Other Compensation ($) Total ($)\nShubha Dasgupta, 188,256 $ $ 0 $ 0 $ 0 $ 0 $ 11,357 199,613\nChief Executive Officer 189,288\n11,357 200,645\nRupen Shah (1), 77,389 $ $ 0 $ 0 $ 0 $ 0 $ 1,508 78,897\nChief Financial Officer 185,344\n92,468\n6,625 284,437\nChrista Mitchell, 188,256 $ $ 0 $ 0 $ 0 $ 0 $ 11,357 199,613\nChief Strategy Officer 189,288 $ $ 0 $ 0 $ 0 $ 0 $ 11,357 200,645\nKendall Marin, President and 188,256 $ $ 0 $ $ 0 11,357 199,613\nChief Operating Officer 189,288 $ $ 0 $ 0 $ 0 $ 0 $ 11,357 200,645\n(1) Mr. Shah resigned as CFO of the Company in April 2023.\nOutstanding Equity Awards at 2023 Fiscal Year-End\nThe following table sets forth information concerning outstanding equity awards for each of the NEOs and directors as of the end of the fiscal year ended August 31, 2023.\nOption Awards Stock Awards\nName and Principal Position Number of Securities. Underlying Unexercised Options (#) Exercisable Weighted Average Option Exercise Price ($) Option Expiration Date Number of Shares or Units of Stock That Have Not Vested (#) Market Value of Shares or Units of Stock That Have Not Vested\nShubha Dasgupta, 126,652 $ 3.60 June 14, 2026 N/A N/A\nChief Executive Officer and Director\nTasis Giannoukakis, 10,214 $ 3.60 June 14, 2026 N/A N/A\nDirector\nDrew Green, 102,138 $ 3.60 June 14, 2026 N/A N/A\nChairman of the Board\nKendall Marin, 126,652 $ 3.60 June 14, 2026 N/A N/A\nPresident, Chief Operating Officer, and Director\nChrista Mitchell, 32,684 $ 3.60 June 14, 2026 N/A N/A\nChief Strategy Officer and Director\nPaul Baron, 10,214 $ 3.60 June 14, 2026 N/A N/A\nDirector\nNima Besharat, 157,136 $ 3.60 June 14, 2026 N/A N/A\nDirector\nCompensation Governance\nThe Company has not been a reporting issuer during any financial period to date. The significant elements of future compensation to be awarded or paid to the Companys directors and/or executive officers, including NEOs, once the Company becomes a reporting issuer is expected to consist primarily of management fees, stock options and cash bonuses. The amount to be paid for each element of compensation will not be based on any formula or specific objective criteria but is expected to be the result of a subjective determination of the Board in consideration of a number of factors, including, but not limited to: the overall financial and operating performance of the Company, each NEOs individual performance and contribution towards meeting corporate objectives, each NEOs level of responsibility, each NEOs length of service, industry comparable and the Companys ability to pay compensation. Payments may be made from time to time to executive officers, including Named Executive Officers, or companies they control for the provision of consulting or management services. Such services are paid for by the Company at competitive industry rates for work of a similar nature by reputable arms length services providers. Following the date of Listing, the Company expects to pay fees for management services pursuant to the terms of the agreement summarized under Employment, Consulting and Management Agreements below. Other than the Stock Option Plan, the Company has not established any other long-term incentive plan. Other than 2,206,189 Options under the Stock Option Plan, the Company has no stock options or other incentive securities outstanding; however, the Company may issue more stock options pursuant to its Stock Option Plan. See Stock Option Plan below and Options to Purchase Securities. In addition, it is anticipated that the Board may award bonuses, in its sole discretion, to executive officers, including NEOs, from time to time.\nIn assessing the compensation of its directors and executive officers, including the NEOs, the Company does not have in place any formal objectives, criteria or analysis. The general objectives of our compensation strategy are to: (a) compensate management in a manner that encourages and rewards a high level of performance and outstanding results with a view to increasing long term shareholder value; (b) align managements interests with the long term interests of shareholders; (c) provide a compensation package that is commensurate with other companies to enable us to attract and retain talent; and (d) ensure that the total compensation package is designed in a manner that takes into account the Companys financial condition and long term interests.\nCompensation payable to executive officers and directors is currently reviewed and recommended by the Board, on an annual basis. See Statement of Corporate Governance - Compensation. The Company has not established any specific performance criteria or goals to which total compensation or any significant element of total compensation to be paid to any NEO is dependent. Specifically, in the most recently completed financial year, no compensation was directly tied to a specific performance goal such as a milestone or the completion of a transaction, no significant events occurred that significantly affected compensation, and no peer group was formally used to determine compensation. NEOs performance is reviewed in light of the Companys objectives from time to time and such officers compensation is also compared to that of executive officers of companies of similar size and stage of development in the Companys industry. Though the Company does not have pre-existing performance criteria, objectives or goals, it is anticipated that, once the Company becomes a reporting issuer, the Board will review all compensation arrangements and policies in place and consider the adoption of formal compensation guidelines.\nDirector Compensation\nTo date, we have not compensated our directors for their service to the Company, except that Drew Green receives monthly compensation of $7,887 and Nima Besharat received monthly compensation of $3,943 until his compensation terminated in February 2022.\nExternal Management Companies\nOther than as disclosed below under Employment, Consulting and Management Agreements, the Company has not entered into any agreement with any external management company that employs or retains one or more of the NEOs or directors and, other than as disclosed below, the Company has not entered into any understanding, arrangement or agreement with any external management company to provide executive management services to the Company, directly or indirectly, in respect of which any compensation was paid by the Company.\nStock Options and Other Compensation Securities\nAs of the date of this prospectus, the Company has granted 628,510 Options under the Stock Option Plan to directors and/or NEOs of the Company, 62,820 of which were subsequently forfeited, and no other compensation securities were granted or issued to any director and/or NEO for services provided or to be provided, directly or indirectly, to the Company or any of its subsidiaries.\nDuring the year ended August 31, 2023 there was no exercise of Options granted under the Stock Option Plan or other rights to acquire securities of the Company by NEOs or directors of the Company.\nStock Option Plan\nOn June 14, 2021 the Board approved our 2487269 Ontario Ltd. Stock Option Plan (the Stock Option Plan). As of the date of this prospectus, there are 565,689 options outstanding under the Stock Option Plan.\nThe purpose of the Stock Option Plan is to provide the Company with a share-related mechanism to attract, retain and motivate qualified directors, officers, employees and consultants, to reward those individuals from time to time for their contributions toward the long-term goals of the Company and to enable and encourage those individuals to acquire Common Shares as long-term investments. The material features of the Stock Option Plan are reflected in the disclosure below.\nKey Terms\nSummary\nAdministration\nThe Stock Option Plan is administered by the Board, or such director or other senior officer of the Company as may be designated as administrator by the Board. The Board or such committee may make, amend and repeal at any time, and from time to time, such regulations not inconsistent with the Stock Option Plan.\nNumber of Common Shares\nThe maximum number of Common Shares issuable under the Stock Option Plan shall not exceed 10% of the number of Common Shares issued and outstanding as of each date on which the Board grants the Option (the Award Date) with certain limits on grants to Optionees (as defined in the Stock Option Plan), Optionees who are Insiders (as defined in the Stock Option Plan), Eligible Employees (as defined in the Stock Option Plan) and Optionees conducting Investor Relations Activities (as defined in the Stock Option Plan). The number of Common Shares underlying Options that have been cancelled, that have expired without being exercised in full, and that have been issued upon exercise of Options shall not reduce the number of Common Shares issuable under the Stock Option Plan and shall again be available for issuance thereunder.\nSecurities\nEach Option entitles the holder thereof (an Option Holder) to purchase one Common Share at an exercise price determined by the Board.\nParticipation\nAny director, senior officer, management company, employee or consultant of the Company (including any subsidiary of the Company), as the Board may determine.\nExercise Price\nThe exercise price of an option will be determined by the Board in its sole discretion, provided that the exercise price will not be less than the Discounted Market Price (as defined in the Stock Option Plan).\nExercise Period\nThe exercise period of an Option will be the period from and including the award date through to and including the expiry date that will be determined by the Board at the time of grant (the Expiry Date), provided that the Expiry Date of an Option will be no later than the fifth anniversary of the Award Date of the Option, provided that such date does not fall within a blackout period imposed by the Company, and any Options granted to any Optionee who is a Director, Eligible Employee, or other Optionee will expire within 12 months following the date that such Optionee ceases to be engaged in such role.\nCessation of Employment\nSubject to certain limitations, in the event that an Option Holder ceases to be a director of the Company or ceases to be employed by the Company, other than by reason of death, the Expiry Date of the Option will be 90 days after the date of such termination, except as otherwise provided in any employment contract. Notwithstanding the foregoing or any employment contract, in no event shall such right be extended beyond the Option Period or one year from the date of termination.\nIn the event that an Option Holder should die while he or she is still director, senior officer, management company, employee or consultant of the Company, the Expiry Date will be 12 months from the date of death of the Option Holder.\nAcceleration Events\nIf a third party makes a bona fide formal offer to the Company or its shareholders which would constitute an acceleration event, the Board may (i) permit the Option Holders to exercise their Options, as to all or any of such Options that have not previously been exercised (regardless of any vesting restrictions), but in no event later than the Expiry Date of the Option, so that the Option Holders may participate in such transaction; and (ii) require the acceleration of the time for the exercise of the Options and of the time for the fulfilment of any conditions or restrictions on such exercise.\nNotwithstanding any other provision of the Stock Option Plan or the terms of any Option, if at any time when Options remains unexercised and the Company completes any transaction which constitutes an acceleration event, all outstanding unvested Options will automatically vest.\nAny proposed acceleration of vesting provisions is subject to the policies and necessary approvals of the TSXV, if applicable.\nLimitations\nThe maximum number of Common Shares which may be issued, within any one-year period, to Insiders under the Stock Option Plan, together with any other share-based compensation arrangements of the Company, will be 10% of the total number of Common Shares issued and outstanding. The total number of Options awarded to any one individual in any twelve-month period will not exceed 5% of the issued and outstanding Common Shares of the Company at the Award Date unless the Company has obtained disinterested shareholder approval..\nThe total number of Options awarded to any one consultant of the Company in any twelve-month period will not exceed 2% of the issued and outstanding Common Shares of the Company at the Award Date unless consent is obtained as set forth in the Stock Option Plan.\nThe total number of Options awarded to all persons retained by the Company to provide Investor Relations Activities will not exceed 2% of the issued and outstanding Common Shares of the Company, in any twelve-month period, calculated at the Award Date unless consent is obtained as set forth in the Stock Option Plan. Options granted to persons retained to provide Investor Relations Activities will vest in stages over not less than twelve months with no more than one quarter of the options vesting in any three-month period.\nAmendments\nThe Board may from time to time, subject to applicable law and to the prior approval, if required, of the shareholders, relevant stock exchanges or any other regulatory body having authority over the Company or the Stock Option Plan, suspend, terminate or discontinue the Stock Option Plan at any time, or amend or revise the terms of the Stock Option Plan or of any Option granted under the Stock Option Plan and the Option Agreement relating thereto, provided that no such amendment, revision, suspension, termination or discontinuance shall in any manner adversely affect any Option previously granted to an Optionee under the Stock Option Plan without the consent of that Optionee.\nEmployment, Consulting and Management Agreements\nAs of the date hereof, other than as described below, the Company does not have any contract, agreement, plan or arrangement that provides for payments to the named executive officers (the NEOs) at, following, or in connection with any termination (whether voluntary, involuntary or constructive), resignation, retirement, a change in control of the Company or a change in a director or NEOs responsibilities.\nOn April 10, 2023, the Company entered into an executive employment agreement with Sarfraz Habib (the Sarfraz Employment Agreement) pursuant to which Mr. Habib agreed to serve as the Companys Chief Financial Officer. In consideration of the services provided by Mr. Habib, the Company agreed to pay a base salary of $133,668 per annum\nOn March 1, 2022, we entered into a Consulting Services Agreement with Kia Besharat, pursuant to which we pay a fee of $3,943 per month for broad financial and securities advisory services.\nWe have also entered into an agreement with Drew Green for board fees, pursuant to which we pay a fee of $7,887 per month.\nPension Plan Benefits\nThe Company does not anticipate having any deferred compensation plan or pension plan that provides for payments or benefits at, following or in connection with retirement. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe following table sets forth certain information regarding beneficial ownership of shares of our common shares as of December 12, 2023 by (i) each person known to beneficially own more than 5% of our outstanding common stock, (ii) each of our directors, (iii) each of our named executive officers and (iv) all of our directors and named executive officers as a group. Except as otherwise indicated, the persons named in the table below have sole voting and investment power with respect to all shares beneficially owned, subject to community property laws, where applicable.\nBeneficial Owner Shares(1) Percentage\nDirectors and Named Executive Officers\nShubha Dasgupta(2) 998,457 13.6 %\nSarfraz Habib - *\nChrista Mitchell(3) 275,735 3.8 %\nKendall Marin(4) 998,457 13.6 %\nDrew Green (5) 820,097 11.2 %\nPaul Baron (6) 74,317 1.0 %\nTasis Giannoukakis (7) 99,558 1.4 %\nNima Besharat (8) 208,439 2.8 %\nAll Directors and Officers as a group (8 persons) 3,475,460 44.2 %\n5% Stockholders\nProdigy Capital Corp. (9) 756,311 10.5 %\n* Represents beneficial ownership of less than 1%.\n(1) Based on 7,181,978 common shares outstanding.\n(2) Includes 126,652 options at an exercise price of $3.60 and 25,641 warrants to purchase common shares at an exercise price of CAD$2.93. The securities beneficially owned by Shubha Dasgupta are directly held by 5032771 Ontario Inc., an entity controlled by Mr. Dasgupta\n(3) Includes 32,684 options at an exercise price of $3.60 and 12,281 warrants to purchase common shares at an exercise price of CAD$2.93.\n(4) Includes 126,652 options at an exercise price of $3.60 and 25,651 warrants to purchase common shares at an exercise price of CAD$2.93.\n(5) Includes 102,138 options at an exercise price of $3.60 and 25,651 warrants to purchase common shares at an exercise price of CAD$2.93.The securities beneficially owned by Drew Green are directly held by DREWGREEN.CA INC., an entity controlled by Mr. Green.\n(6) Includes 10,214 options at an exercise price of $3.60.\n(7) Includes 10,214 options at an exercise price of $3.60.\n(8) Includes 157,136 options at an exercise price of $3.60 and 25,651 warrants to purchase common shares at an exercise price of CAD$2.93. The shares beneficially owned by Nima Besharat are directly held by Break Point Ventures Ltd., an entity controlled by Mr. Besharat.\n(9) Includes 38,262 warrants to purchase common shares at an exercise price of CAD$2.93. Kia Besharat, principal of Prodigy Capital Corp., has the power to vote or dispose of the shares held of record by Prodigy Capital Corp., and may be deemed to beneficially own those shares.\nSecurities Authorized for Issuance Under Equity Compensation Plans\nThe following table summarizes information about our equity compensation plans as of August 31, 2023.\nPlan Category Number of securities to\nbe issued upon exercise\nof outstanding options,\nwarrants and rights\n(a) Weighted average\nexercise price of\noutstanding options,\nwarrants and rights Number of securities remaining\navailable for future issuance under\nequity compensation plans\n(excluding securities reflected in\ncolumn (a))\nEquity compensation plans approved by security holder 2,218,677 $ 3.78 -\nEquity compensation plans not approved by security holder - -\nTotal 2,218,677 $ 3.78 ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nTransactions with Related Persons\nExcept as described below [ and except for employment arrangements which are described under Executive Compensation,] during the fiscal years ended August 31, 2023 and August 31, 2022, there have not been, nor are there currently proposed, any transaction in which we are or were a participant, the amount involved exceeds the lesser of $120,000 or 1% of the average of the total assets at August 31, 2023, and any of our directors, executive officers, holders of more than 5% of our common shares, or any immediate family member of any of the foregoing had or will have a direct or indirect material interest.\nRelated Person Transaction Policy\nWe expect to adopt a related person transaction policy that sets forth our procedures for the identification, review, consideration and approval or ratification of related person transactions. The policy will become effective immediately upon the execution of the underwriting agreement for this offering. For purposes of our policy only, a related person transaction is a transaction, arrangement or relationship, or any series of similar transactions, arrangements or relationships, in which we and any related person are, were or will be participants in which the amount involved exceeds the lesser of $120,000 or 1% of our total assets at year-end for our last two completed fiscal years. Transactions involving compensation for services provided to us as an employee or director are not covered by this policy. A related person is any executive officer, director or beneficial owner of more than 5% of any class of our voting securities, including any of their immediate family members and any entity owned or controlled by such persons.\nUnder the policy, if a transaction has been identified as a related person transaction, including any transaction that was not a related person transaction when originally consummated or any transaction that was not initially identified as a related person transaction prior to consummation, our management must present information regarding the related person transaction to our audit committee, or, if audit committee approval would be inappropriate, to another independent body of our Board, for review, consideration and approval or ratification. The presentation must include a description of, among other things, the material facts, the interests, direct and indirect, of the related persons, the benefits to us of the transaction and whether the transaction is on terms that are comparable to the terms available to or from, as the case may be, an unrelated third party or to or from employees generally. Under the policy, we will collect information that we deem reasonably necessary from each director, executive officer and, to the extent feasible, significant shareholder to enable us to identify any existing or potential related-person transactions and to effectuate the terms of the policy. In addition, under our code of business conduct and ethics, our employees and directors will have an affirmative responsibility to disclose any transaction or relationship that reasonably could be expected to give rise to a conflict of interest. In considering related person transactions, our audit committee, or other independent body of our Board, will take into account the relevant available facts and circumstances including, but not limited to:\n● the risks, costs and benefits to us;\n● the impact on a directors independence in the event that the related person is a director, immediate family member of a director or an entity with which a director is affiliated;\n● the availability of other sources for comparable services or products; and\n● the terms available to or from, as the case may be, unrelated third parties or to or from employees generally.\nThe policy requires that, in determining whether to approve, ratify or reject a related person transaction, our audit committee, or other independent body of our Board, must consider, in light of known circumstances, whether the transaction is in, or is not inconsistent with, our best interests and those of our shareholders, as our audit committee, or other independent body of our Board, determines in the good faith exercise of its discretion.\nDirector Independence\nThe NYSE American requires that a majority of our board of directors must be composed of independent directors, which is defined generally as a person other than an officer or employee of the company or its subsidiaries or any other individual having a relationship, which, in the opinion of the companys board of directors would interfere with the directors exercise of independent judgment in carrying out the responsibilities of a director. The Board has determined that Paul Baron, Tasis Giannoukakis, Drew Green and Nima Besharat are considered to be independent. Our Board currently consists of seven directors, four of whom are independent. we ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nThe following table sets forth the aggregate fees billed by MNP LLP as described below:\nAudit Fees $ 148,057 $ 73,660\nAudit Related Fees $ 39,040 $ -\nTax Fees $ 5,893 $ -\nAll Other Fees $ - $ -\nTotal $ 192,990 $ 73,660\nPre-Approval Policies and Procedures\nThe Audit Committee mandate requires that the Audit Committee pre-approve any retainer of the auditor of the Company to perform any non-audit services to the Company that it deems advisable in accordance with applicable legal and regulatory requirements and policies and procedures of the Board. The Audit Committee is permitted to delegate pre-approval authority to one of its members; however, the decision of any member of the Audit Committee to whom such authority has been delegated must be presented to the full Audit Committee at its next scheduled meeting\nPART IV ITEM 15. EXHIBIT AND FINANCIAL STATEMENT SCHEDULES\n(a) Financial Statements\nFor a list of the consolidated financial statements included herein, see Index to Consolidated Financial Statements on page of this Annual Report, which is incorporated into this Item by reference.\n(b) Exhibits\nExhibit No.\nDescription\n1.1\nUnderwriting Agreement between Pineapple Financial Inc and EF Hutton dated October 31, 2023, incorporated by reference to Exhibit 1.1 of the Current Report on Form 8-K filed with the Securities and Exchange Commission on November 6, 2023.\n3.1\nArticles of Continuance incorporated by reference to Exhibit 3.1 to the Companys Amendment to the Registration Statement on Form S-1 (No. 333-268636) filed with the Securities and Exchange Commission on September 28, 2023.\n3.2\nBylaws incorporated by reference to Exhibit 3.2 to the Companys Amendment to the Registration Statement on Form S-1 (No. 333-268636) filed with the Securities and Exchange Commission on September 28, 2023.\n10.1\nStock Option Plan incorporated by reference to Exhibit 10.1 to the Companys Amendment to the Registration Statement on Form S-1 (No. 333-268636) filed with the Securities and Exchange Commission on September 28, 2023.\n10.2\nSalesforce Agreement, between the Company and Salesforce.com, dated December 1, 2020, incorporated by reference to Exhibit 10.2 to the Companys Amendment to the Registration Statement on Form S-1 (No. 333-268636) filed with the Securities and Exchange Commission on September 28, 2023.\n10.3\nEmployment Agreement, dated April 4, 2023 between the Company and Sarfraz Habib incorporated by reference to Exhibit 10.3 to the Companys Amendment to the Registration Statement on Form S-1 (No. 333-268636) filed with the Securities and Exchange Commission on September 28, 2023.\n10.4\nForm of Mortgage Broker Affiliation Agreement incorporated by reference to Exhibit 10.4 to the Companys Amendment to the Registration Statement on Form S-1 (No. 333-268636) filed with the Securities and Exchange Commission on September 28, 2023.\n21.1\nList of Subsidiaries of the Registrant, incorporated by reference to Exhibit 21.1 to the Companys Amendment to the Registration Statement on Form S-1 (No. 333-268636) filed with the Securities and Exchange Commission on September 28, 2023.\n31.1\nCertification of Principal Executive Officer pursuant to Rules 13a-14(a) and 15d-14(a) of the Securities Exchange Act, as amended.\n31.2\nCertification of Principal Financial Officer pursuant to Rules 13a-14(a) and 15d-14(a) of the Securities Exchange Act, as amended.\n32.1\nCertification of Principal Executive Officer and Principal Financial Officer pursuant to Rules 13a-14(b) or 15d-14(b) of the Securities Exchange Act, as amended, and 18 U.S.C. Section 1350.\n101.INS\nInline XBRL Instance Document\n101.SCH\nInline XBRL Taxonomy Extension Schema Document\n101.CAL\nInline XBRL Taxonomy Extension Calculation Document\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document\nCover Page Interactive Data File (embedded within the Inline XBRL document)\nITEM 16. FORM 10-K SUMMARY\nNone.\nPineapple Financial Inc.\nConsolidated Financial Statements\nFor the Years Ended August 31, 2023 and 2022\n(Expressed in US Dollars)\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Shareholders of Pineapple Financial Inc.\nOpinion on the Consolidated Financial Statements\nWe have audited the accompanying consolidated balance sheets of Pineapple Financial Inc. (the Company) as of August 31, 2023 and 2022, and the related consolidated statements of operations and comprehensive loss, shareholders equity, and cash flows for each of the years in the two-year period ended August 31, 2023, and the related notes (collectively referred to as the consolidated financial statements).\nIn our opinion, the consolidated financial statements present fairly, in all material respects, the consolidated financial position of the Company as of August 31, 2023 and 2022, and the results of its consolidated operations and its consolidated cash flows for each of the years in the two-year period ended August 31, 2023, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys consolidated financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\nChartered Professional Accountants\nLicensed Public Accountants\nWe have served as the Companys auditor since 2020.\nMississauga, Canada\nDecember 14, 2023\nPineapple Financial Inc.\nConsolidated Balance Sheets\n(Expressed in US Dollars)\nAugust 31, 2023 August 31, 2022\nAs at:\nAssets\nCurrent assets\nCash\n$ 720,365 $ 3,896,839\nTrade and other receivables Note 13 758,988 33,119\nPrepaid expenses and deposits\n218,150 483,695\nIncome tax receivable\n- 71,078\nTotal current assets\n1,697,503 4,484,731\nInvestments Note 4 10,013 38,211\nRight-of-use asset Note 11 960,377 954,091\nProperty and equipment Note 5 242,091 247,665\nIntangible assets Note 6 1,718,954 702,388\nTotal Assets\n$ 4,628,938 $ 6,427,086\nLiabilities and Shareholders Equity\nCurrent liabilities\nAccounts payable and accrued liabilities\n$ 605,319 $ 780,113\nLoan Note 17 430,098\nCurrent portion of lease liability Note 11 138,372 2,024\nTotal current liabilities\n1,173,789 782,137\nDeferred government grant Note 13 699,627\nLease liability Note 11 969,589 1,018,561\nTotal liabilities\n$ 2,843,005 $ 1,800,698\nShareholders Equity\nCommon shares, no par value; unlimited authorized; 6,306,979 issued and outstanding as at August 31, 2023 and 2022 Note 7 4,903,031 4,903,031\nAdditional paid-in capital Note 8,9 2,955,944 2,922,853\nAccumulated other comprehensive loss\n(417,727 ) (353,218 )\nAccumulated deficit\n(5,655,315 ) (2,846,278 )\nTotal stockholders equity\n1,785,933 4,626,388\nTOTAL LIABILITIES AND STOCKHOLDERS\n$ 4,628,938 $ 6,427,086\nDescription of business (note 1)\nContingencies and commitments (note 18)\nSubsequent events (note 19)\nApproved on behalf of Board of Directors\nShuba Dasgupta\nDrew Green\nThe accompanying notes are an integral part of these consolidated financial statements\nPineapple Financial Inc.\nConsolidated Statements of Operations and Comprehensive Loss\n(Expressed in US Dollars)\nFor the year ended:\nAugust 31, 2023 August 31, 2022\nNet Revenue Note 16 $ 2,502,264 $ 3,600,851\nExpenses\nSelling, general and administrative Note 12 3,014,945 2,977,277\nSalaries, wages and benefits\n2,330,127 2,360,344\nInterest expense and bank charges\n56,316 94,202\nDepreciation Notes 5,6,11 441,159 255,871\nShare-based compensation Note 9 33,091 723,217\nGovernment based incentive Note 13 (591,480 ) -\nTotal expenses\n$ 5,284,158 $ 6,410,911\nLoss from operations\nWritedown of investment Note 4 (27,143 ) -\nLoss before income taxes\n$ (2,809,037 ) $ (2,810,061 )\nIncome taxes (recovery) expense Note 10 - -\nNet loss\n(2,809,037 ) (2,810,061 )\nForeign currency translation adjustment\n(64,509 ) (205,223 )\nNet loss and comprehensive loss\n$ (2,873,546 ) $ (3,015,284 )\nLoss per share - basic and diluted ($)\n$ (0.45 ) (0.45 )\nWeighted average number of common shares outstanding - basic and diluted\n6,306,979 6,306,979\nThe accompanying notes are an integral part of these consolidated financial statements\nPineapple Financial Inc.\nConsolidated Statement of Shareholders Equity\n(Expressed in US Dollars)\nCommon\nShares\n(note 7)\nAdditional\nPaid in\nCapital\n(note 8 and 9)\nAccumulated\nother\ncomprehensive\nloss\nAccumulated\n(deficit)\nearnings\nTotal\nshareholders\nequity\n$ $ $ $ $\nBalance, August 31, 2021 4,903,031 2,199,636 (147,995 ) (36,217 ) 6,918,455\nShare-based compensation - 723,217 - - 723,217\nForeign exchange translation - - (205,223 ) - (205,223 )\nNet loss - - - (2,810,061 ) (2,810,061 )\nBalance, August 31, 2022 4,903,031 2,922,853 (353,218 ) (2,846,278 ) 4,626,388\nBalance 4,903,031 2,922,853 (353,218 ) (2,846,278 ) 4,626,388\nShare-based compensation - 33,091 - - 33,091\nForeign exchange translation - - (64,509 ) - (64,509 )\nNet Loss - - - (2,809,037 ) (2,809,037 )\nBalance, August 31, 2023 4,903,031 2,955,944 (417,727 ) (5,655,315 ) 1,785,933\nBalance 4,903,031 2,955,944 (417,727 ) (5,655,315 ) 1,785,933\nThe accompanying notes are an integral part of these consolidated financial statements\nPineapple Financial Inc.\nConsolidated Statements of Cash Flows\n(Expressed in US Dollars)\nFor the years ended:\nAugust 31, 2023 August 31, 2022\nCash provided by (used for) the following activities\nOperating activities\nNet (loss) and comprehensive (loss)\n(2,809,037 ) (2,810,061 )\nAdjustments for the following non-cash items:\nDepreciation of property and equipment Note 5 67,674 42,218\nDepreciation of intangible assets Note 6 265,150 79,489\nDepreciation on right of use asset Note 11 108,335 90,049\nInterest expense on lease liability Note 11 56,316 32,017\nShare-based compensation Note 9 33,091 723,217\nWritedown of investment\n27,143 -\nNet changes in non-cash working capital balances:\nTrade and other receivables\n(26,242 ) (32,284 )\nPrepaid expenses and deposits\n265,545 (336,360 )\nAccounts payable and accrued liabilities\n(174,795 ) 382,294\nIncome taxes receivable\n70,715 (5,488 )\nNet cash used in operating activities\n(2,116,105 ) (1,834,909 )\nFinancing activities\nIssuance costs paid in connection with the private Proceeds from Loan Note 17 430,098 -\nLease payments Note 11 (81,090 ) (61,470 )\nNet cash provided by financing activity\n349,008 (61,470 )\nInvesting activities\nInvestments Note 4 - -\nAdditions to intangible assets Note 6 (1,300,225 ) (803,610 )\nAdditions to property and equipment Note 5 (62,073 ) (249,322 )\nNet cash used in investing activity\n(1,362,298 ) (1,052,932 )\nNet change in cash\n(3,129,395 ) (2,949,311 )\nEffect of changes in foreign exchange rates\n(47,079 ) (165,386 )\nCash, beginning of year\n3,896,839 7,011,535\nCash, end of year\n720,365 3,896,839\nSupplementary cash flow information:\nInterest paid\n- -\nIncome taxes paid\n- -\nThe accompanying notes are an integral part of these consolidated financial statements\nPineapple Financial Inc.\nNotes to the Consolidated Financial Statements\nFor the years ended August 31, 2023 and 2022\n(Expressed in US Dollars)\n1. Description of business\nPineapple Financial Inc. (the Company) is a leader in the Canadian mortgage industry, breaking the mould by focusing on both the long-term success of agents and brokerages, as well as the overall experience of homeowners. With 600 brokers within the network, the Company utilizes cutting-edge cloud-based tools and AI-driven systems to enable its brokers to help Canadians realize their ultimate dream, owning a home.\nThe Company was incorporated in 2006, under the Ontario Business Corporations Act. The Companys head office is located at 200-111 Gordon Baker Road, Toronto, Ontario, M2H 3R1 Canada and its securities are publicly listed on the New York Stock Exchange American (NYSEAmerican) under ticker PAPL. The Company completed an Initial Public Offering on October 31, 2023 for gross proceeds of $3,220,000 and the first day of trading was November 1, 2023.\nImpact from the global inflationary pressures leading to higher interest rates\nDuring the fiscal year, due to inflationary pressures that were felt around the globe, central banks all over the world increased interest rates steadily to reduce these pressures. The impact on the real estate market has been to reduce the price wars, bidding, and control over the runaway prices. This has led to modifications in all businesses associated with real estate including the Company. With the interest rates increases which reduces prices has led to reduced volume for the Company, seasonality kicked in which is the increase in financing that is experienced from March to October in Canada has offset the interest rates increase paradigm. It is unknown how long the increased interest rates will last. The Company determined that there were no material expectations of increased credit losses, and no material indicators of impairment of long-term assets.\n2. Significant accounting policies\nStatement of compliance\nThese consolidated financial statements have been prepared in accordance with United States Generally Accepted Accounting Principles (US GAAP).\nThe financial statements were authorized for issue by the Board of Directors on December 14, 2023.\nBasis of preparation, functional and presentation currency\nThe financial statements have been prepared in accordance with US GAAP applicable to a going concern, which contemplates the realization of assets and the satisfaction of liabilities in the normal course of business on the historical cost basis except for certain financial instruments that are measured at fair value, as explained in the accounting policies below. Historical cost is generally based on the fair value of the consideration given in exchange for assets. All financial information is in US Dollars (USD) as the Companys presentation currency and transactions are conducted in the functional currency of Canadian dollars (CAD).\nAdjustment for Reverse Stock Split\nIn July 2023, the Board approved a 1-for-3.9 reverse stock split, or the Reverse Split, which was implemented on July 14, 2023. Consequently, all the share numbers, shares prices, and exercise prices have been retroactively adjusted in these consolidated financial statements for all periods presented.\nOperating segments\nThe Company determines its reporting units in accordance with the Financial Accounting Standards Board (FASB) Accounting Standards Codification (ASC) 280, Segment Reporting. The Company evaluates a reporting unit by first identifying its operating segments under ASC 280. The Company operates as one operating segment which is reported in a manner consistent with the internal reporting provided to the chief operating decision-makers. The chief operating decision-makers are responsible for the allocation of resources and assessing the performance of the operating segment and have been identified as the CEO and CFO of the Company.\nPineapple Financial Inc.\nNotes to the Consolidated Financial Statements\nFor the years ended August 31, 2023 and 2022\n(Expressed in US Dollars)\n2. Significant accounting policies (continued from previous page)\nBasis of consolidation\nThe consolidated financial statements include the accounts of the Company, and its wholly owned subsidiary, Pineapple Insurance Inc and Pineapple National Inc. All transactions with the subsidiary and any intercompany balances, gains or losses have been eliminated upon consolidation. The subsidiary has a USD presentation currency, and the functional currency is in CAD, and accounting policies have been applied consistently to the subsidiary.\nASC 842 Leases\nAt inception of a contract, the Company assesses whether a contract is, or contains, a lease based on whether the contract conveys the right to control the use of an identified asset for a period of time in exchange for consideration. The Company recognizes a right-of-use asset and a lease liability at the lease commencement date. The right-of-use asset is initially measured based on the initial amount of the lease liability adjusted for any lease payments made at or before the commencement date, less any lease incentives received.\nThe right-of-use assets are depreciated to the earlier of the end of the useful life of the right-of-use asset or the lease term using the straight-line method. The lease term includes periods covered by an option to extend if the Company is reasonably certain to exercise that option. In addition, the right-of-use asset can be periodically reduced by impairment losses, if any, and adjusted for certain remeasurements of the lease liability. The lease liability is initially measured at the present value of the lease payments that are not paid at the commencement date, discounted using the interest rate implicit in the lease or, if that rate cannot be readily determined, the Companys incremental borrowing rate.\nThe Company recognized a lease liability and right-of-use asset for most leases and applied ASC 842. The lease liability was measured at the present value of the remaining lease payments, discounted using the Companys estimated incremental borrowing rate at the date of initial application, estimated to be 6%. Right-of-use assets were measured at an amount equal to the lease liability, adjusted by the amount of any prepaid or accrued lease payments relating to that lease recognized in the consolidated statement of financial position immediately before the date of initial application.\nFinancial instruments\nThe following table shows the classification categories under US GAAP ASC 825 for each class of the Companys financial assets and financial liabilities.\nAsset / liability:\nClassification:\nCash\nFVTPL\nTrade and other receivables\nAmortized cost\nInvestments\nFVTPL\nAccounts payable and accrued liabilities\nAmortized cost\nFinancial assets\nRecognition and initial measurement\nThe Company recognizes financial assets when it becomes party to the contractual provisions of the instrument. Financial assets are measured initially at their fair value plus, in the case of financial assets not subsequently measured at fair value through profit or loss, transaction costs that are directly attributable to their acquisition. Transaction costs attributable to the acquisition of financial assets subsequently measured at fair value through profit or loss are expensed in profit or loss when incurred.\nPineapple Financial Inc.\nNotes to the Consolidated Financial Statements\nFor the years ended August 31, 2023 and 2022\n(Expressed in US Dollars)\n2. Significant accounting policies (continued from previous page)\nClassification and subsequent measurement\nOn initial recognition, financial assets are classified and subsequently measured at amortized cost, fair value through other comprehensive income (FVOCI) or fair value through profit or loss (FVTPL). The Company determines the classification of its financial assets, together with any embedded derivatives, based on the business model for managing the financial assets and their contractual cash flow characteristics.\nFinancial assets are classified as follows:\n● Amortized cost - Assets that are held for collection of contractual cash flows where those cash flows are solely payments of principal and interest are measured at amortized cost. Interest revenue is calculated using the effective interest method and gains or losses arising from impairment, foreign exchange and derecognition are recognized in profit or loss. Financial assets measured at amortized cost are comprised of trade and other receivables.\n● Fair value through other comprehensive income - Assets that are held for collection of contractual cash flows and for selling the financial assets, and for which the contractual cash flows are solely payments of principal and interest, are measured at fair value through other comprehensive income. Interest income calculated using the effective interest method and gains or losses arising from impairment and foreign exchange are recognized in profit or loss. All other changes in the carrying amount of the financial assets are recognized in other comprehensive income. Upon derecognition, the cumulative gain or loss previously recognized in other comprehensive income is reclassified to profit or loss. The Company does not hold any financial assets measured at fair value through other comprehensive income.\n● Mandatorily at fair value through profit or loss - Assets that do not meet the criteria to be measured at amortized cost, or fair value through other comprehensive income, are measured at fair value through profit or loss. All interest income and changes in the financial assets carrying amount are recognized in profit or loss. Financial assets mandatorily measured at fair value through profit or loss are comprised of cash and investments.\n● Designated at fair value through profit or loss - On initial recognition, the Company may irrevocably designate a financial asset to be measured at fair value through profit or loss in order to eliminate or significantly reduce an accounting mismatch that would otherwise arise from measuring assets or liabilities, or recognizing the gains and losses on them, on different bases. All interest income and changes in the financial assets carrying amount are recognized in profit or loss. The Company does not hold any financial assets designated to be measured at fair value through profit or loss.\nContractual cash flow assessment\nThe cash flows of financial assets are assessed as to whether they are solely payments of principal and interest on the basis of their contractual terms. For this purpose, ‘principal is defined as the fair value of the financial asset on initial recognition. ‘Interest is defined as consideration for the time value of money, the credit risk associated with the principal amount outstanding, and other basic lending risks and costs. In performing this assessment, the Company considers factors that would alter the timing and amount of cash flows such as prepayment and extension features, terms that might limit the Companys claim to cash flows, and any features that modify consideration for the time value of money.\nPineapple Financial Inc.\nNotes to the Consolidated Financial Statements\nFor the years ended August 31, 2023 and 2022\n(Expressed in US Dollars)\n2. Significant accounting policies (continued from previous page)\nFinancial instruments (continued from previous page)\nImpairment\nThe Company recognizes a loss allowance for the expected credit losses associated with its financial assets, other than financial assets measured at fair value through profit or loss. Expected credit losses are measured to reflect a probability-weighted amount, the time value of money, and reasonable and supportable information regarding past events, current conditions, and forecasts of future economic conditions.\nThe Company applies the simplified approach for trade receivables. Using the simplified approach, the Company records a loss allowance equal to the expected credit losses resulting from all possible default events over the assets contractual lifetime\nThe Company assesses whether a financial asset is credit-impaired at the reporting date. Regular indicators that a financial instrument is credit-impaired include significant financial difficulties as evidenced through borrowing patterns or observed balances in other accounts and breaches of borrowing contracts such as default events or breaches of borrowing covenants. For financial assets assessed as credit- impaired at the reporting date, the Company continues to recognize a loss allowance equal to lifetime expected credit losses.\nFor financial assets measured at amortized cost, loss allowances for expected credit losses are presented in the statements of financial position as a deduction from the gross carrying amount of the financial asset.\nFinancial assets are written off when the Company has no reasonable expectations of recovering all or any portion thereof.\nDerecognition of financial assets\nThe Company derecognizes a financial asset when its contractual rights to the cash flows from the financial asset expire.\nFinancial liabilities\nRecognition and initial measurement\nThe Company recognizes a financial liability when it becomes party to the contractual provisions of the instrument. At initial recognition, the Company measures financial liabilities at their fair value plus transaction costs that are directly attributable to their issuance, except for financial liabilities subsequently measured at fair value through profit or loss for which transaction costs are immediately recorded in profit or loss.\nWhere an instrument contains both a liability and equity component, these components are recognized separately based on the substance of the instrument, with the liability component measured initially at fair value and the equity component assigned the residual amount.\nClassification and subsequent measurement\nSubsequent to initial recognition, all financial liabilities are measured at amortized cost using the effective interest rate method. Interest, gains and losses relating to a financial liability are recognized in profit or loss.\nDerecognition of financial liabilities\nThe Company derecognizes a financial liability only when its contractual obligations are discharged, cancelled or expire.\nPineapple Financial Inc.\nNotes to the Consolidated Financial Statements\nFor the years ended August 31, 2023 and 2022\n(Expressed in US Dollars)\n2. Significant accounting policies (continued from previous page)\nFinancial instruments (continued from previous page)\nImpairment of non-financial assets\nProperty and equipment, and intangible assets (other than goodwill) are tested for impairment when events or changes in circumstances indicate the carrying value may not be recoverable. When an indication of impairment is identified, the carrying value of the asset or group of assets is measured against the recoverable amount. The Company evaluates impairments losses, other than goodwill impairment, for potential reversals when events or circumstances warrant such consideration.\nFair value\nAssets and liabilities carried at fair value must be classified using a three-level hierarchy that reflects the significance and transparency of the inputs used in making the fair value measurements.\nLevel inputs are unadjusted quoted prices of identical instruments in active markets;\nLevel inputs other than quoted prices included in Level 1 that are observable for the asset or liability, either directly or indirectly; and\nLevel inputs that are not based on observable market data (unobservable data).\nDetermination of fair value and the resulting hierarchy requires the use of observable market data whenever available. The classification of a financial instrument in the hierarchy is based upon the lowest level of input that is significant to the measurement of fair value. Cash is recorded at fair value using level 1 inputs and investments are recorded at fair value using level 3 inputs. During the year, there were no transfers between the levels of fair value.\nIncome taxes\nThe liability method is used in accounting for income taxes. Deferred tax assets and liabilities are recorded for temporary differences between the tax basis of assets and liabilities and their reported amounts in the consolidated financial statements using the statutory tax rates in effect for the year in which the differences are expected to reverse. The effect on deferred tax assets and liabilities of a change in tax laws or rates is recorded in the results of operations in the period that includes the enactment date under the law.\nWe establish valuation allowances for deferred tax assets based on a more likely than not standard. Deferred income tax assets are evaluated quarterly to determine if valuation allowances are required or should be adjusted. The ability to realize deferred tax assets depends on the ability to generate sufficient taxable income within the carryback or carryforward periods provided for in the tax law for each applicable tax jurisdiction. The assessment regarding whether a valuation allowance is required or should be adjusted also considers all available positive and negative evidence factors. It is difficult to conclude a valuation allowance is not required when there is significant objective and verifiable negative evidence, such as cumulative losses in recent years. We utilize a rolling three years of actual and current year results as the primary measure of cumulative losses in recent years.\nIncome tax expense (benefit) for the year is allocated between continuing operations and other categories of income such as Other comprehensive income (loss). In periods in which there is a pre-tax loss from continuing operations and pre-tax income in another income category, the tax benefit allocated to continuing operations is determined by taking into account the pre-tax income of other categories. We record Global Intangible Low Tax Income (GILTI) as a current period expense when incurred.\nWe record uncertain tax positions on the basis of a two-step process whereby we determine whether it is more likely than not that the tax positions will be sustained based on the technical merits of the position, and for those tax positions that meet the more likely than not criteria, we recognize the largest amount of tax benefit that is greater than 50% likely to be realized upon ultimate settlement with the related tax authority. We record interest and penalties on uncertain tax positions in Income tax expense (benefit).\nPineapple Financial Inc.\nNotes to the Consolidated Financial Statements\nFor the years ended August 31, 2023 and 2022\n(Expressed in US Dollars)\n2. Significant accounting policies (continued from previous page)\nShare Capital\nCommon shares are classified as equity. Incremental costs directly attributable to the issuance of shares are recognized as a deduction from shareholders equity.\nEarnings per share\nThe Company calculates basic earnings per share amounts for earnings attributable to common shareholders. Basic earnings per share is calculated by dividing earnings attributable to common shareholders (the numerator) by the weighted average number of common shares outstanding (the denominator) during the year.\nFor the purpose of calculating diluted earnings per share, the Company adjusts the earnings attributable to common shareholders, and the weighted average number of common shares outstanding during the year, for the effects of all dilutive potential common shares. Potential common shares are treated as dilutive when, and only when, their conversion to common shares would decrease earnings per share or increase earnings per share from continuing operations.\nShare-based payment arrangements\nEquity-settled share-based payments to employees and others providing similar services are measured at the fair value of the equity instruments at the grant date. Details regarding the determination of the fair value of equity-settled share-based transactions are set out in Note 8.\nThe fair value determined at the grant date of the equity-settled share-based payments is expensed on a straight-line basis over the vesting period, based on the Companys estimate of equity instruments that will eventually vest, with a corresponding increase in equity. At the end of each reporting period, the Company revises its estimate of the number of equity instruments expected to vest. The impact of the revision of the original estimates, if any, is recognized in profit or loss such that the cumulative expense reflects the revised estimate, with a corresponding adjustment to the additional paid-in capital.\nEquity-settled share-based payment transactions with parties other than employees are measured at the fair value of the goods or services received, except where that fair value cannot be estimated reliably, in which case they are measured at the fair value of the equity instruments granted, measured at the date the entity obtains the goods or the counterparty renders the service.\nProperty and equipment\nProperty and equipment are recorded at cost, net of accumulated depreciation and accumulated impairment losses, if any. Cost includes all expenditures incurred to bring the assets to the location and condition necessary for them to be operated in the manner intended by management.\nDepreciation is calculated using the following terms and methods:\nSchedule of estimated useful life of property and equipment\nEquipment years Straight Line\nFurniture years Straight Line\nIT Equipment years Straight Line\nLeasehold Improvement years Straight Line\nLaptops years Straight Line\nAn item of equipment is derecognized upon disposal or when no future economic benefits are expected from its use. Any gain or loss arising on derecognition of the asset (calculated as the difference between the net disposal proceeds and the carrying value of the asset) is included in profit or loss in the year the asset is derecognized.\nPineapple Financial Inc.\nNotes to the Consolidated Financial Statements\nFor the years ended August 31, 2023 and 2022\n(Expressed in US Dollars)\n2. Significant accounting policies (continued from previous page)\nIntangible Assets\nIntangible assets acquired separately are measured on initial recognition at cost. The cost of intangible assets acquired in a business combination is their fair value at the date of acquisition. Following initial recognition, intangible assets are carried at cost less any accumulated depreciation and accumulated impairment losses.\nDevelopment costs for internally-generated intangible assets are capitalized when all of the following conditions are met:\n● The costs attributable to the asset can be measured reliably.\n● It is probable that the intangible asset will generate future economic benefits.\n● The Company can demonstrate the control and ability to use the intangible asset.\nThe amount initially recognized for internally-generated intangible assets is the sum of the expenditures incurred from the date when the intangible asset first meets the recognition criteria listed above. Where no internally-generated intangible asset can be recognized, development expenditures are charged to the consolidated statement of loss and comprehensive loss in the period in which the expense is incurred.\nIntangible assets with finite lives are amortised over the estimated useful economic life and assessed for impairment whenever there is an indication that the intangible asset may be impaired. The depreciation period and the depreciation method for an intangible asset with a finite useful life are reviewed at least at the end of each reporting period. Changes in the expected useful life or the expected pattern of consumption of future economic benefits embodied in the asset are considered to modify the depreciation period or method, as appropriate, and are treated as changes in accounting estimates. The depreciation expense on intangible assets with finite lives is recognised in the consolidated statements of operations and comprehensive loss and in the expense category that is consistent with the function of the intangible assets.\nIntangible assets with indefinite useful lives are not depreciated, but are tested for impairment annually, either individually or at the cash-generating unit level. The assessment of indefinite life is reviewed annually to determine whether the indefinite life continues to be supportable. If not, the change in useful life from indefinite to finite is made on a prospective basis.\nAn intangible asset is derecognised upon disposal (i.e., at the date the recipient obtains control) or when no future economic benefits are expected from its use or disposal. Any gain or loss arising upon derecognition of the asset (calculated as the difference between the net disposal proceeds and the carrying amount of the asset) is included in the consolidated statement of operations and comprehensive loss.\nIntangible assets are recorded at cost, net of accumulated depreciation and accumulated impairment losses, if any. Cost includes all expenditures incurred to bring the assets to the location and condition necessary for them to be operated in the manner intended by management.\nDepreciation is calculated using the following terms and methods:\nSchedule of estimated useful life of intangible assets\nSoftware years Straight Line\nAn intangible asset is derecognized upon disposal or termination. Any gain or loss arising on derecognition of the asset (calculated as the difference between the net disposal proceeds and the carrying value of the asset) is included in profit or loss in the year the asset is derecognized.\nRevenue recognition\nThe Company generates its revenue by charging commissions on mortgages that are applied for through the automation and digitalization process that the Company has in place.\nPineapple Financial Inc.\nNotes to the Consolidated Financial Statements\nFor the years ended August 31, 2023 and 2022\n(Expressed in US Dollars)\n2. Significant accounting policies (continued from previous page)\nRevenue recognition (continued)\nThe Company has adopted ASC 606 (Revenue from Contracts with Customers). The standard provides a single comprehensive model for revenue recognition. The core principle of the standard is that an entity shall recognize revenue to depict the transfer of promised goods or services to customers at an amount that reflects the consideration to which the entity expects to be entitled in exchange for those goods or services. The standard introduced a new contract-based revenue recognition model with a measurement approach that is based on an allocation of the transaction price. It establishes a five-step model to account for revenue arising from contracts with customers. Under ASC 606, revenue is recognized at an amount that reflects the consideration to which an entity expects to be entitled in exchange for transferring good or services to a customer. The standard requires entities to exercise judgement, taking into consideration all of the relevant facts and circumstances when applying each step of the model to contracts with customers. The standard also specifies the accounting for incremental costs of obtaining a contract and the costs directly related to fulfilling a contract.\nRevenue is recognized at an amount that reflects the consideration to which the Company is expected to be entitled in exchange for transferring goods or services to a customer.\nRendering of services - The Company hosts an online website, using Salesforce, that brokers and agents can utilize to close out deals.\nThe Companys subsidiary, Pineapple Insurance Inc., generates its revenue by charging premiums for insurance policies and services. Pineapple Insurance is associated with a major insurance company from which it earns commissions for the provision of these services, primarily mortgage insurance. Mortgage insurance is a requirement of each mortgage. Pineapple Insurance has also adopted ASC 606. Typically, Pineapple Insurance is the agent supplying insurance services to the consumer and paid a commission from the premiums collected by the insurance company whose products and services it provides to the end consumer.\nThe Company has three revenue streams:\na) Sales Revenue is commission collected from financial institutions with whom it has contracts in place. The Company earns revenue based on a percentage of mortgage amount funded between individual referred by the Company and financial institutions funding the mortgage. We are an agent in these deals as we provide the platform for other parties to provide services to the end-user. For each contract with a customer, the Company identifies the contract with a customer; identifies the performance obligations in the contract; determines the transaction price to the separate performance obligations on the basis of the relative stand-alone selling price of each distinct good or service to be delivered; and recognizes revenue when or as each performance obligation is satisfied in a manner that depicts the transfer to the customer of the goods or services promised. The Company recognizes revenue when: a contract exists with a lender party and an agent broker, the contract identifies the use of the platform service to close a mortgage deal, the mortgage deal has been closed with the lending financial institution, and commissions paid by the lending financial institution based on various criteria of the mortgage deal including but not limited to interest rates available at that time, term, seasonality, collateral, income, purpose, etc. Revenue is measured at the fair value of the consideration received or receivable and represents amounts receivable for services provided in the normal course of business. Revenue is recognized at the end of the deal upon completion of all the actions listed above. A typical transaction attracts a commission fee payable to Pineapple Financial Inc.\nb) Subscription Revenue is a flat fee that is charged to the brokers and agents for use of the platform. Revenue is recognized at the beginning of the month when an agent is invoiced and pays the fee.\nc) Underwriting Revenue is a flat fee charged for risk pre-assessment of the deal before it is submitted to the Lender Partner for funding. The flat fee is based on the amount of funded volume being financed in the deal. Revenue is recognized at the end of the deal upon completion of the actions listed in a).\nPineapple Financial Inc.\nNotes to the Consolidated Financial Statements\nFor the years ended August 31, 2023 and 2022\n(Expressed in US Dollars)\n2. Significant accounting policies (continued from previous page)\nPrincipal versus Agent considerations\nJudgement is required in determining whether the Company is a principal or agent in transactions with the lending financial institutions (Lender Partner). The Company evaluates the presentation of revenue on a gross basis, or a net basis based on whether the Company controls the service provided to the end user and are the principal (i.e., Gross) or the Company arranges the brokers to provide the service to the end user and are an agent ( i.e., Net). This determination impacts the presentation of the commission payable to the brokers.\nFor the transactions with the Lender partner our role is to provide instructions to the brokers on the information required from homeowners to complete a successful mortgage application that would be presented to the Lender partner to review and accept and pay a commission to Pineapple for facilitating a successful mortgage application. The Company concluded that the control of the mortgage application is with brokers as the ultimate information that is to be obtained from the homeowners to provide to the lender partner is controlled by the broker and the Company only facilitates the information transfer from the broker to the Lender partner to obtain mortgage for the homeowner as such the Company is an agent.\nProvisions\nA provision is recognized when the Company has a present legal or constructive obligation as a result of a past event, it is probable that an outflow of economic benefits will be required to settle the obligation, and the amount of the obligation can be reliably estimated. The amount of a provision is the best estimate of the consideration at the end of the reporting period. Provisions measured using estimated cash flows required to settle the obligation are determined by discounting the expected future cash flows at a pre-tax rate that reflects current market assessments of the time value of money and, where appropriate, the risks specific to the liability.\nA provision for onerous contracts is recognized when the expected benefits to be derived by the Company from a contract are lower than the unavoidable cost of meeting its obligations under the contract. The Company had no material provisions as at August 31, 2023 and 2022.\nPineapple Financial Inc.\nNotes to the Consolidated Financial Statements\nFor the years ended August 31, 2023 and 2022\n(Expressed in US Dollars)\n3. Significant accounting judgments, estimates and assumptions\nThe preparation of financial statements requires the directors and management to make judgments, estimates and assumptions that affect the application of policies and reported amounts of assets and liabilities, and revenue and expenses. Actual results may differ from these estimates. The estimates and underlying assumptions are reviewed on an ongoing basis. Revisions to accounting estimates are recognized in the period in which the estimate is revised if the revision affects only that period or in the period of the revision and future periods if the revision affects both current and future periods.\nThe following are the critical estimates and judgments applied by management that most significantly affect the Companys financial statements. Uncertainty about these assumptions and estimates could result in outcomes that require a material adjustment to the carrying amount of assets or liabilities affected in future periods.\nInvestments (level 3)\nWhere the fair values of financial assets and financial liabilities recorded on the statements of financial position, cannot be derived from active markets, they are determined using a variety of valuation techniques. The inputs to these models are derived from observable market data where possible; where observable market data is not available, Managements judgment is required to establish fair values.\nShare based compensation\nManagement is required to make certain estimates when determining the fair value of stock options awards, and the number of awards that are expected to vest. These estimates affect the amount recognized as stock-based compensation in the statements of income and comprehensive income based on estimates of volatility, forfeitures and expected lives of the underlying stock options which are at a maximum of 36 months vesting period.\nUseful life of Assets\nSignificant judgement is involved in determination of useful life for the property plant and equipment and intangible assets. Management assesses the reasonability of the useful life on an annual basis to record the depreciation of the intangibles and property plant and equipment.\n4. Investments\nDuring the year ended August 31, 2021, the Company purchased an investment in a private company. The Company holds a 5% interest with no significant influence. The investment is recorded at FVTPL using level 3 inputs. The valuation of the Companys investment is determined based on the most recent private placement financing completed by the investment and the reviewed financial information of the investment. As at August 31, 2023, the Company recognized an $27,143 (August 31, 2023 - $Nil) write down of investments in the consolidated statement of operations and comprehensive loss.\nPineapple Financial Inc.\nNotes to the Consolidated Financial Statements\nFor the years ended August 31, 2023 and 2022\n(Expressed in US Dollars)\n5. Property and Equipment\nThe Companys property and equipment consist of laptops, furniture and office equipment.\nSchedule of property and equipment\nProperty and equipment\nCost\nBalance, August 31, 2021 $ 67,377\nAdditions 249,322\nTranslation adjustment (19,700 )\nBalance, August 31, 2022 $ 296,999\nAdditions 62,073\nTranslation adjustment (9,789 )\nBalance, August 31, 2023 $ 349,283\nAccumulated depreciation\nBalance, August 31, 2021 $ 8,711\nDepreciation $ 42,218\nTranslation adjustment (1,595 )\nBalance, August 31, 2022 $ 49,334\nDepreciation 67,674\nTranslation adjustment (9,816 )\nBalance, August 31, 2023 $ 107,192\nNet carrying value\nAugust 31, 2022 $ 247,665\nAugust 31, 2023 $ 242,091\nPineapple Financial Inc.\nNotes to the Consolidated Financial Statements\nFor the years ended August 31, 2023 and 2022\n(Expressed in US Dollars)\n6. Intangible Assets\nThe intangible assets additions in current year are related to development costs capitalized for internally generated software with a useful life of 5 years.\nSchedule of cost and accumulated depreciation\nIntangible assets\nCost\nBalance, August 31, 2021 $ -\nAdditions 803,610\nTranslation adjustment (24,120 )\nBalance, August 31, 2022 $ 779,490\nAdditions 1,300,225\nTranslation adjustment (22,190 )\nBalance, August 31, 2023 $ 2,057,525\nAccumulated depreciation\nBalance, August 31, 2021 $ -\nDepreciation $ 79,489\nTranslation adjustment (2,387 )\nBalance, August 31, 2022 $ 77,102\nDepreciation $ 265,150\nTranslation adjustment (3,681 )\nBalance, August 31, 2023 $ 338,571\nNet carrying value\nAugust 31, 2022 $ 702,388\nAugust 31, 2023 $ 1,718,954\nPineapple Financial Inc.\nNotes to the Consolidated Financial Statements\nFor the years ended August 31, 2023 and 2022\n(Expressed in US Dollars)\n7. Share capital\nAuthorized share capital\nThe authorized share capital of the Company consists of an unlimited number of common shares with a nominal par value.\nSchedule of authorized share capital\n# $\nBalance, August 31, 2020 2,564,103\nIssue of common shares and warrants in connection with the private placement of Units 2,836,164 6,115,978\nIssue of common shares for consulting services received 906,712 2,833,478\nIssue of warrants for consulting services received\n-\nIssuance costs:\n-\n- paid in cash\n(1,003,373 )\n- paid by issuance of warrants\n(3,043,130 )\nBalance, August 31, 2021, 2022 and 2023 6,306,979 4,903,031\n(i) 2021 private placement\nIn 2021, the Company completed a private placement of 1,548,472 Units for aggregate proceeds of $1,973,047 (CAD $1.56 per Unit) and 1,287,692 Units for aggregate proceeds of $4,142,931 (CAD $3.94 per Unit) (the 2021 private placement). Each Unit consisted of one common share and one-half of one common share purchase warrant of Pineapple Financial Inc. Each warrant entitles the holder thereof to acquire one-half of one common share of the Company for a price of $2.42 and $6.01 for a period of 2 years from the date of the Liquidity Event; listing of the common shares of the Company on a public exchange, sale of substantially all the assets of the Company or a transfer of the shares of the Company.\nThe allocation of proceeds between common shares and warrants was made when the equity instruments were issued using a relative fair value method.\nThe Company completed a private placement of 2,836,164 units for aggregate proceeds of $7,538,024. There were two private placements one with the unit price of CAD $1.56 per unit and other for unit price of CAD $3.94. Each unit consisted of one common share and one-half warrant which entitles the holder to purchase a common share for 2 years at an exercise price of CAD $2.93 and CAD $7.29.\nPineapple Financial Inc.\nNotes to the Consolidated Financial Statements\nFor the years ended August 31, 2023 and 2022\n(Expressed in US Dollars)\n7. Share capital (continued from previous page)\n(ii) Issue of common shares for consulting services received\nThe Company entered into an arrangement with Gravitas Securities Inc. (Gravitas), a related party and shareholder, pursuant to which Gravitas agreed to act as an agent for and on behalf of the Company in connection with the 2021 private placement.\nIn 2021, the Company issued 906,712 common shares with a fair value of $2,833,478 for services received in obtaining subscriptions for the 2021 private placement.\nThe fair value of the services received could not be estimated reliably. Accordingly, the fair value of the services received, and the corresponding increase in equity, was measured by reference to the fair value of the common shares issued. The corresponding cost of the services received was recognized as an issuance cost directly in equity. In 2021, $212,963 was recognized as a deduction to common shares and $48,747 was recognized as a deduction to the common share purchase warrants reserve (Note 8). The issuance costs were allocated in the same proportion as how the proceeds from the 2021 private placement were allocated between common shares and warrants.\n(iii) Issuance costs paid in cash\nIn 2021, the Company paid a total $1,003,373 (2020 - $NIL) of cash issuance costs in connection with the 2021 private placement. The issuance costs were allocated in the same proportion as how the proceeds from the 2021 private placement were allocated between common shares and warrants. The issuance costs paid in cash include $788,185 (2020 - $NIL) paid to Gravitas in connection with the arrangement described in Note 7(ii).\nThe fair value of the warrants was estimated to be $0.27 using the Black-Scholes formula and the following inputs:\nSchedule of Fair Value of Warrants\nIssuance on March 29, 2021\nEstimated fair value per common share CAD $1.56\nExercise price of the warrant CAD $2.93\nExpected volatility of the underlying common share 100 %\nExpected life of the warrant 2.75 years\nExpected dividend yield 0.00 %\nRisk-free interest rate 0.42 %\nIssuance on April 21, 2021\nEstimated fair value per common share CAD $3.94\nExercise price of the warrant CAD $7.29\nExpected volatility of the underlying common share 100 %\nExpected life of the warrant 2.75 years\nExpected dividend yield 0.00 %\nRisk-free interest rate 0.45 %\nPineapple Financial Inc.\nNotes to the Consolidated Financial Statements\nFor the years ended August 31, 2023 and 2022\n(Expressed in US Dollars)\n8. Common share purchase warrants reserve\nSchedule of common share purchase warrants reserve\n# $\nBalance, August 31, 2020 and 2019\n- -\nIssue of common shares and warrants in connection with the private placement of Units\n1,418,903 1,422,045\nIssue of warrants for consulting services received\n234,086 258,400\nShare-based compensation expense\n- 567,938\nIssuance costs:\n- paid by issuance of warrants\n- (48,747 )\nBalance, August 31, 2021\n1,652,989 2,199,636\nShare-based compensation expense\n- 723,217\nBalance, August 31, 2022\n1,652,989 2,922,853\nShare-based compensation expense\n- 33,091\nBalance, August 31, 2023\n1,652,989 2,955,944\nIssue of warrants for consulting services received\nIn 2021, the Company issued 234,086 common share purchase warrants with an estimated fair value of $258,400 to consultants in connection with 2021 private placement of which:\n● Total of 100,651 common share purchase warrants entitle the holder thereof to acquire one common share of the Company for a price of CAD $2.93 for a period of 2 years from the date of Liquidity Event\n● Total of 133,435 common share purchase warrants entitle the holder thereof to acquire one common share of the Company for a price of CAD $7.29 for a period of 2 years from the date of Liquidity Event\nThe fair value of consulting services received, and the corresponding increase in equity, was measured by reference to the fair value of equity instruments granted.\nThe cost of the services received was recognized as an issuance cost directly in equity, of which $258,400 was recognized as a deduction to common shares (Note 7) and $60,122 was recognized as a deduction to the common share purchase warrants reserve. The issuance cost was allocated in the same proportion as how the proceeds from the 2018 private placement were allocated between common shares and warrants.\nThe following reconciles the warrants outstanding at the beginning and the end of the year:\nSchedule of Warrants Outstanding\nNumber of Warrants Weighted Average Exercise Price\n# $\nBalance, August 31, 2020 - -\nIssued during the year 1,652,988 3.94\nBalance, August 31, 2022 and 2023 1,652,988 3.94\nPineapple Financial Inc.\nNotes to the Consolidated Financial Statements\nFor the years ended August 31, 2023 and 2022\n(Expressed in US Dollars)\n9. Share-based benefits reserve\nThe Company has a share option plan (the Plan) to attract, retain and motivate qualified directors, officers, employees and consultants whose present and future contributions are important to the success of the Company by offering them an opportunity to participate in the Companys future performance through the award of share options.\nEach share option converts into one common share of Pineapple Financial Inc. on exercise. No amounts are paid or payable by the recipient on receipt of the option. The options carry neither rights to dividends nor voting rights. Options may be exercised at any time from the date of vesting to the date of their expiry.\nIn 2017, the Plan was amended such that the total number of common shares reserved and available for grant and issuance pursuant to the Plan is to equal 10% of the issued and outstanding common shares of the Company.\nOptions granted on June 14, 2021, vest over a 2-year period whereby 25% of the options granted vested on the date of grant, and the remaining unvested options vest in equal installments every 6-months thereafter. The fair value of stock options granted was $1,317,155. A total stock-based compensation expense was recognized of $57,340 for the vested options (August 31, 2021 - $637,517).\nThe Chief Financial Officer was granted 63,821 Stock options on November 15, 2021 as part of his compensation package. The options vest over a 3-year period whereby 8,974 of the options granted vested on the grant date and the remaining unvested options vest in equal installments every 6-months thereafter. The fair value of the stock options granted was $141,885. The Chief Financial Officer options were forfeited and a recovery on stock-based compensation of $24,250 was recognized during the year ended August 31, 2023. For year ended August 31, 2023, stock-based compensation expense of $nil (August 31, 2022 - $85,700) was recognized.\nThe following reconciles the options outstanding at the beginning and end of the year that were granted to eligible participants pursuant to the Plan:\nSchedule of Options Outstanding Granted\nNumber of Options Weighted Average Exercise Price\n# $\nBalance, August 31, 2021 565,689 3.72\nGranted during the year 62,821 3.82\nBalance, August 31, 2022 628,510 3.71\nForfieted during year (62,821 ) 3.82\nBalance, August 31, 2023 565,689 3.72\nExercisable, August 31, 2023 565,689 3.72\nThe Company used the Black-Scholes formula to estimate the fair value of share options granted during the year, based on the following inputs: Schedule of Fair Value Of Share Options Granted\nAugust 31,\nAugust 31,\nWeighted average estimated fair value per common share $ n/a\n3.00\nWeighted average exercise price of the share option $ n/a\n3.20\nWeighted average expected volatility of the underlying common share n/a\n100 %\nWeighted average expected life of the share option n/a\nyears\nWeighted average expected dividend yield n/a\n0 %\nWeighted average risk-free interest rate n/a\n1.48 %\nPineapple Financial Inc.\nNotes to the Consolidated Financial Statements\nFor the years ended August 31, 2023 and 2022\n(Expressed in US Dollars)\n10. Income taxes\nThe reconciliation of the combined federal and state income tax rate of 26.5% (2022 - 26.5%) to the effective tax rate is as follows:\nSchedule of Federal and State Income Tax Rate\nAugust 31, 2023 August 31, 2022\n$ $\n(Loss) before recovery of income taxes (2,809,037 ) (2,810,061 )\nExpected income tax (recovery) expense (744,395 ) (744,670 )\nNon-deductible expenses 45,338 197,240\nValuation Allowance 699,057 547,430\nIncome tax expense (recovery) - -\nDeferred income taxes\nThe following table summarizes the components of deferred tax:\nSchedule of Deferred Income Taxes\nAugust 31, 2023 August 31, 2022\nDeferred tax assets\nProperty and equipment - 18,760\nIntangible assets - 26,820\nFinance lease liabilities 293,610 270,460\nInvestments 3,930 -\nShare issuance costs 435,920 651,140\nOperating tax losses carried forward 1,844,180 853,230\nSR&ED Pool from T661 67,569 -\nCharitable donations carryforward 28,990 -\nTotal deferred tax assets 2,674,199 1,820,410\nValuation Allowance (2,266,630 ) (1,567,580 )\nTotal net deferred tax assets 407,569 252,830\nPineapple Financial Inc.\nNotes to the Consolidated Financial Statements\nFor the years ended August 31, 2023 and 2022\n(Expressed in US Dollars)\n10. Income taxes (continued from previous page)\nDeferred tax liabilities\nAugust 31, 2023 August 31, 2022\nProperty and equipment (41,190 ) -\nRight-of-use asset (254,500 ) (252,830 )\nIntangible Assets (110,960 ) -\nLoan (919 ) -\nTotal deferred tax liabilities (407,569 ) (252,830 )\nNet deferred tax liability - -\nThe Canadian non-capital losses carried forward expire in 2043. The remaining deductible temporary differences may be carried forward indefinitely.\nThe Company has adopted the provisions of ASC 740-10, which clarifies the accounting for uncertain tax positions. ASC 740-10 requires that the Company recognize the impact of a tax position in its financial statements if the position is more likely than not to be sustained upon examination based on the technical merits of the position. For the year ended August 31, 2023, the Company had no material unrecognized tax benefits, and based on the information currently available, no significant changes in unrecognized tax benefits are expected in the next 12 months.\n11. Right-of-use asset and lease liability\nThe Company leases all its office premises in Ontario and British Columbia, Canada. The Company extended the current Ontario premises of 4,894 sq. ft. lease to January 1, 2030, and acquired additional premises of 8,368 square feet adjacent to the current office premises with the same landlord. The additional premises lease also expires on January 1, 2030. The total area of use by The Company is 13,262 sq. ft. The Company acquired a 1,454 square feet premise lease in British Columbia commencing August 1, 2023 and expiring on July 31, 2028. The Company recognized a right-of-use asset and corresponding lease liability in respect of this lease. The lease liability was measured at the present value of the remaining lease payments, discounted using the Companys estimated incremental borrowing rate as at September 1, 2017 (date of initial application), estimated to be 6%. The right-of-use asset was measured at an amount equal to the lease liability, adjusted by the amount of any prepaid or accrued lease payments relating to that lease recognized in the interim condensed balance sheet immediately before the date of initial application.\nPineapple Financial Inc.\nNotes to the Consolidated Financial Statements\nFor the years ended August 31, 2023 and 2022\n(Expressed in US Dollars)\n11. Right-of-use asset and lease liability (continued from previous page)\nThe following schedule shows the movement in the Companys right-of-use asset:\nSchedule of Right-Of-Use Asset\nRight-of-use asset\nCost\nBalance, August 31, 2021 $ 297,723\nAdditions 786,800\nBalance, August 31, 2022 $ 1,084,523\nAdditions 141,799\nTranslation adjustment (48,601 )\nBalance, August 31, 2023 $ 1,177,721\nAccumulated Depreciation\nBalance, August 31, 2021 $ 40,383\nDepreciation 90,049\nBalance, August 31, 2022 $ 130,432\nDepreciation 108,335\nTranslation adjustment (21,423 )\nBalance, August 31, 2023 $ 217,344\nCarrying Amount\nAugust 31, 2022 $ 954,091\nAugust 31, 2023 $ 960,377\nPineapple Financial Inc.\nNotes to the Consolidated Financial Statements\nFor the years ended August 31, 2023 and 2022\n(Expressed in US Dollars)\n11. Right-of-use asset and lease liability (continued from previous page)\nThe following schedule shows the movement in the Companys lease liability during the year:\nSchedule of Lease Liability\nAugust 31, 2023 August 31, 2022\nBalance, beginning of year $ 1,020,585 $ 263,238\nAdditions 141,799 786,800\nInterest Expense 56,316 32,017\nLease payments (81,090 ) (61,470 )\nTranslation Adjustment (29,649 ) -\nBalance, end of year $ 1,107,961 $ 1,020,585\nCurrent 138,372 2,024\nNon-Current 969,589 1,018,561\n$ 1,107,961 $ 1,020,585\nThe following table provides a maturity analysis of the Companys lease liability. The amounts disclosed in the maturity analysis are the contractual undiscounted cash flows before deducting interest or finance charges:\nSchedule of Maturity Lease Liability\n$ 213,288\n217,856\n219,055\n216,476\n229,943\n201,891\n16,824\nTotal Lease liability\n$ 1,315,334\nPineapple Financial Inc.\nNotes to the Consolidated Financial Statements\nFor the years ended August 31, 2023 and 2022\n(Expressed in US Dollars)\n12. Expenses\nThe following table provides a breakdown of the selling, general and administrative expenses:\nSchedule of Selling, General and Administrative Expenses\nAugust 31, 2023 August 31, 2022\nSoftware Subscription 816,913 923,137\nMarketing, Advertising and promotions 649,934 795,588\nEvents and award shows 194,863 -\nOffice and generai 183,870 259,480\nProfessional fees 661,265 243,100\nDues and Subscriptions 58,366 174,743\nRent 165,750 150,141\nConsulting fees 210,063 146,554\nTravel 97,372 104,812\nDonations 46,002 61,206\nLease expense 7,534 63,425\nInsurance (80,934 ) 54,867\nRepair and maintenance 2,489\nUtilities 1,459 -\nSelling, general and administrative 3,014,945 2,977,277\n13. Deferred government grant\nThe Company was eligible for the Government of Canada SRED program and received $607,080 as at August 31, 2023 for the historical SRED claimed. The Company has accrued $710,320 of SRED receivable as at August 31, 2023 for the fiscal year 2023 SRED which is recognized in trades and other receivables in the consolidated balance sheet. A portion of the funds received is related to costs that have been capitalized for the development of internally generated software recognized as intangible asset in Note 6 as such $699,627 of the balance received and accrued is recognized as deferred government grant balance and will be recognized as recovery in the consolidated statement of operations and comprehensive loss over the useful life of the intangible assets. As at August 31, 2023, $591,480 ($Nil - August 31, 2022) has been recognized as recovery of operating expenses in the consolidated statements of operations and comprehensive loss.\n14. Related party transactions\nCompensation of key management personnel includes the CEO, COO, CSO, and CFO:\nSchedule of Related Party Transactions\nAugust 31, 2023 August 31, 2022\n$ $\nSalaries and Wages 522,916 776,615\nShare-based compensation 28,989 410,192\nPineapple Financial Inc.\nNotes to the Consolidated Financial Statements\nFor the years ended August 31, 2023 and 2022\n(Expressed in US Dollars)\n15. Risk management arising from financial instruments\na) Credit risk\nCredit risk is the risk of loss associated with a counterpartys inability to fulfill its payment obligations. The Companys principal financial assets that expose it to credit risk are cash and trade receivables. The Company mitigates this risk by monitoring the credit worthiness of its customers and holding cash at financial institutions.\nThe maximum credit exposure at August 31, 2023 is the carrying amount of cash and trade receivables. The Companys exposure to credit risk is considered to be low, given the size and nature of the various counterparties involved and their history of performance.\nThe Company has not historically incurred any significant credit loss in respect of its trade receivables. Based on consideration of all possible default events over the assets contractual lifetime, the expected credit loss in respect of the Companys trade receivables was minimal as at August 31, 2023 and 2022.\nb) Interest rate risk\nInterest rate risk is the risk that the fair value or future cash flows of a financial instrument will fluctuate due to changes in market interest rates. The Company does not have any interest-bearing debt.\nc) Liquidity risk\nLiquidity risk is the risk that the Company will not be able to meet its financial obligations as they become due. The Companys approach in managing liquidity is to ensure, to the extent possible, that it will have sufficient liquidity to meet its liabilities when due, by continuously monitoring actual and forecasted cash flows.\nd) Management of capital\nThe Companys objective of managing capital, comprising of shareholders equity, is to ensure its continued ability to operate as a going concern. The Company manages its capital structure and makes changes to it based on economic conditions.\nManagement and the Board of Directors review the Companys capital management approach on an ongoing basis and believe this approach, given the relative size of the Company, is reasonable. The Company is not subject to externally imposed capital requirements. The Companys capital management objectives, policies and processes have remained unchanged during the year ended August 31, 2023.\nPineapple Financial Inc.\nNotes to the Consolidated Financial Statements\nFor the years ended August 31, 2023 and 2022\n(Expressed in US Dollars)\n16. Disaggregation of Revenue\nSchedule of Disaggregation of Revenue\nAugust 31, 2023 August 31, 2022\n$ $\nSales revenue 15,026,896 19,497,519\nCommission expense 13,931,836 16,780,133\nNet sales revenue 1,095,060 2,717,385\nSubscription revenue 736,708 616,734\nOther revenue 332,448 -\nSponsorship revenue 189,968 -\nUnderwriting revenue 148,080 266,731\nTotal revenue 2,502,264 3,600,851\n17. Loan\nThe Company entered into a loan on July 31, 2023, with a one-year term and maturity date of July 31, 2024. The Company obtained a loan of $430,098 with an annual compounded interest rate of 12% per annum. The Company paid a 2% advance fee to obtain the loan as at August 31, 2023. The Company obtained the loan based on the qualified SRED amount to be obtained for fiscal year 2023 noted in Note 13. The Company recognized an interest and accretion expense of $8,643 which is recognized as part of interest expense and bank charges in statement of operations and comprehensive loss.\n18. Commitments and contingencies\nIn the ordinary course of operating, the Company may from time to time be subject to various claims or possible claims. Management believes that there are no claims or possible claims that if resolved would either individually or collectively result in a material adverse impact on the Companys financial position, results of operations, or cash flows. These matters are inherently uncertain, and managements view of these matters may change in the future.\nSee note 11 related to lease commitments.\n19. Subsequent Events\nThe Company was listed on the New York stock exchange (NYSE) subsequent to year under the ticker PAPL. The Company issued 875,000 shares on the initial public offering and received gross proceeds of $3,220,000 on closing of the public offering.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized, in City of North York, Province of Ontario, Canada on December 14, 2023.\nPINEAPPLE FINANCIAL INC.\nBy: /s/ Shubha Dasgupta\nShubha Dasgupta\nChief Executive Officer\nBy: /s/ Sarfraz Habib\nSarfraz Habib\nChief Financial Officer\nPursuant to the requirements of the Securities Act of 1933, this registration statement has been signed by the following persons in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/ Shubha Dasgupta\nChief Executive Officer\nDecember 14, 2023\nShubha Dasgupta\n(Principal Executive Officer)\n/s/ Sarfraz Habib\nChief Financial Officer\nDecember 14, 2023\nSarfraz Habib\n(Principal Accounting and Financial Officer)\n/s/ Kendall Marin\nPresident; Chief Operating Officer; and Director\nDecember 14, 2023\nKendall Marin\n/s/ Christa Mitchell\nChief Strategy Officer and Director\nDecember 14, 2023\nChrista Mitchell\n/s/ Drew Green\nChairman of the Board\nDecember 14, 2023\nDrew Green\n/s/ Paul Baron\nDirector\nDecember 14, 2023\nPaul Baron\n/s/ Tasis Giannoukakis\nDirector\nDecember 14, 2023\nTasis Giannoukakis\n/s/ Nima Besharat\nDirector\nDecember 14, 2023\nNima Besharat"
}