{
    "cik": "1967097",
    "company": "Atmos Energy Kansas Securitization I, LLC",
    "filing_type": "10-K",
    "filing_date": "2023-12-29",
    "period_of_report": "2023-09-30",
    "sic": null,
    "state_of_inc": "TX",
    "state_location": "TX",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/1967097/0001967097-23-000004-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/1967097/000196709723000004/aek-20230930.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/1967097/0001967097-23-000004.txt",
    "filename": "1967097_10K_2023_0001967097-23-000004.htm",
    "content": "ITEM 1. Business.\nOmitted pursuant to General Instruction J of Form 10-K. ITEM 1A. Risk Factors.\nOmitted pursuant to General Instruction J of Form 10-K. ITEM 1B. Unresolved Staff Comments.\nNot applicable. ITEM 2. Properties.\nOmitted pursuant to General Instruction J of Form 10-K. ITEM 3. Legal Proceedings.\nOmitted pursuant to General Instruction J of Form 10-K.\nPART II.  ITEM 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities.\nOmitted pursuant to General Instruction J of Form 10-K.  ITEM 7. Managements Discussion and Analysis of Financial Condition and Results of Operations.\nOmitted pursuant to General Instruction J of Form 10-K. ITEM 7A. Quantitative and Qualitative Disclosures about Market Risk.\nOmitted pursuant to General Instruction J of Form 10-K. ITEM 8. Financial Statements and Supplementary Data.\nOmitted pursuant to General Instruction J of Form 10-K. ITEM 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure.\nOmitted pursuant to General Instruction J of Form 10-K. ITEM 9A. Controls and Procedures.\nOmitted pursuant to General Instruction J of Form 10-K. ITEM 9B. Other Information.\nNot applicable.\nITEM 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections.\nNot applicable.\nPART III. ITEM 10. Directors, Executive Officers and Corporate Governance.\nAtmos Energy Kansas Securitization I, LLC (the Company) is a wholly-owned subsidiary of Atmos Energy Corporation (Atmos Energy). At least one manager of the Company must be an independent manager. The following are the executive officers and managers of the Company as of the date of this report:\nName Age Business Experience in Past Five Years\nJohn K. Akers 60 President, Chief Executive Officer, and Manager of the Company. He has served as Atmos Energys President and Chief Executive Officer since October 2019. He served as Executive Vice President of Atmos Energy from November 2018 through September 2019.\nChristopher T. Forsythe 52 Senior Vice President and Chief Financial Officer and Manager of the Company. He has served as Atmos Energys Senior Vice President and Chief Financial Officer since February 2017.\nKaren E. Hartsfield 53 Senior Vice President, General Counsel and Corporate Secretary of the Company. She has served as Atmos Energys Senior Vice President, General Counsel and Corporate Secretary since August 2017.\nOrlando C. Figueroa 64 Independent Manager of the Company. He has served as President of Citadel SPV since 2023 and Senior Managing Director and Co-Founder of Citadel SPV since 2014.\nCode of Conduct and Corporate Governance\nAtmos Energy has adopted a code of ethics which is represented by Atmos Energys Code of Conduct and applies to all of Atmos Energys subsidiaries. Atmos Energys Code of Conduct is posted on the Atmos Energy website at www.atmosenergy.com/company/corporate-responsibility-reports, and copies of this document are available upon request. ITEM 11. Executive Compensation.\nOther than the annual independent manager fee of $3,000, the Company does not pay any compensation to its executive officers or managers.\nInformation on executive compensation with respect to Atmos Energy is set forth in the Definitive Proxy Statement for Atmos Energys Annual Meeting of Shareholders on February 7, 2024 and is incorporated herein by this reference. ITEM 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nNone. ITEM 13. Certain Relationships and Related Transactions, and Director Independence.\nOrlando C. Figueroa is the independent manager of the Company and is the Senior Managing Director of Citadel SPV. ITEM 14. Principal Accountant Fees and Services.\nOmitted pursuant to General Instruction J of Form 10-K.\nSubstitute Information Provided in Accordance with General Instruction J(2) of Form 10-K:\nITEM 1112(b). Significant Obligors of Pool Assets (Financial Information).\nNone.\nITEM 1114(b)(2). Credit enhancement and other support, except for certain derivatives instruments (Financial Information).\nNone.\nITEM 1115(b). Certain Derivative Instruments (Financial Information).\nNone.\nITEM 1117. Legal Proceedings.\nThere are no legal or governmental proceedings pending against the Company, the sponsor, seller, trustee, or servicer, or of which any property of the foregoing is subject, that is material to the securitized utility tariff bondholders.\nU.S. Bank Trust Company, National Association, as trustee, has provided the following information:\nU.S. Bank National Association (U.S. Bank) and other large financial institutions have been sued in their capacity as trustee or successor trustee for certain residential mortgage backed securities (\"RMBS\") trusts. The complaints, primarily filed by investors or investor groups against U.S. Bank and similar institutions, allege the trustees caused losses to investors as a result of alleged failures by the sponsors, mortgage loan sellers and servicers to comply with the governing agreements for these RMBS trusts. Plaintiffs generally assert causes of action based upon the trustees purported failures to enforce repurchase obligations of mortgage loan sellers for alleged breaches of representations and warranties, notify security holders of purported events of default allegedly caused by breaches of servicing standards by mortgage loan servicers and abide by a heightened standard of care following alleged events of default.\nU.S. Bank denies liability and believes that it has performed its obligations under the RMBS trusts in good faith, that its actions were not the cause of losses to investors, that it has meritorious defenses, and it has contested and intends to continue contesting the plaintiffs claims vigorously. However, U.S. Bank cannot assure you as to the outcome of any of the litigation, or the possible impact of these litigations on the trustee or the RMBS trusts.\nOn March 9, 2018, a law firm purporting to represent fifteen Delaware statutory trusts (the DSTs) that issued securities backed by student loans (the Student Loans) filed a lawsuit in the Delaware Court of Chancery against U.S. Bank in its capacities as indenture trustee and successor special servicer, and three other institutions in their respective transaction capacities, with respect to the DSTs and the Student Loans. This lawsuit is captioned The National Collegiate Student Loan Master Trust I, et al. v. U.S. Bank National Association, et al., C.A. No. 2018-0167-JRS (Del. Ch.) (the NCMSLT Action). The complaint, as amended on June 15, 2018, alleged that the DSTs have been harmed as a result of purported misconduct or omissions by the defendants concerning administration of the trusts and special servicing of the Student Loans. Since the filing of the NCMSLT Action, certain Student Loan borrowers have made assertions against U.S. Bank concerning special servicing that appear to be based on certain allegations made on behalf of the DSTs in the NCMSLT Action.\nU.S. Bank has filed a motion seeking dismissal of the operative complaint in its entirety with prejudice pursuant to Chancery Court Rules 12(b)(1) and 12(b)(6) or, in the alternative, a stay of the case while other prior filed disputes involving the DSTs and the Student Loans are litigated. On November 7, 2018, the Court ruled that the case should be stayed in its entirety pending resolution of the first-filed cases. On January 21, 2020, the Court entered an order consolidating for pretrial purposes the NCMSLT Action and three other lawsuits pending in the Delaware Court of Chancery concerning the DSTs and the Student Loans, which remains pending.\nU.S. Bank denies liability in the NCMSLT Action and believes it has performed its obligations as indenture trustee and special servicer in good faith and in compliance in all material respects with the terms of the agreements governing the DSTs and that it has meritorious defenses. It has contested and intends to continue contesting the plaintiffs claims vigorously.\nITEM 1119. Affiliations and Certain Relationships and Related Transactions.\nThe Company is a wholly-owned subsidiary of Atmos Energy. Each of the sponsor, the servicer and the depositor may maintain other banking relationships in the ordinary course with U.S. Bank Trust Company, National Association, the trustee.\nITEM 1122. Compliance with Applicable Servicing Criteria.\nThe Report on Assessment of Compliance with Servicing Criteria for Asset-Backed Securities and the related attestation report for Atmos Energy are included as Exhibits 33.1 and 34.1, respectively, to this Form 10-K identified no material instances of noncompliance by Atmos Energy with the servicing criteria set forth in Item 1122(d) of Regulation AB.\nThe Report on Assessment of Compliance with Servicing Criteria for Asset-Backed Securities and the related attestation report for U.S. Bank Trust Company, National Association are included as Exhibits 33.2 and 34.2, respectively, to this Form 10-K identified no material instances of noncompliance by U.S. Bank Trust Company, National Association with the servicing criteria set forth in Item 1122(d) of Regulation AB.\nITEM 1123. Servicer Compliance Statement.\nThe servicer compliance statement is attached as Exhibit 35.1 to this Annual Report on Form 10-K.\nPART IV. ITEM 15. EXHIBITS, FINANCIAL STATEMENT SCHEDULES\na)The following is a list of documents filed as part of this Annual Report on Form 10-K:\n(1)Not applicable\n(2)Not applicable\n(3)See exhibits below.\nExhibit\nNumber Description Page Number or\nIncorporation by Reference to\n3.1 Certificate of Formation of Atmos Energy Kansas Securitization I, LLC Exhibit 3.1 to Atmos Energy Kansas Securitization I, LLCs Form SF-1 dated February 28, 2023 (File No. 333-270078-01)\n3.2 Amended and Restated Limited Liability Company Agreement of Atmos Energy Kansas Securitization I, LLC, dated as of May 26, 2023 Exhibit 3.3 to Atmos Energy Kansas Securitization I, LLCs Form SF-1/A dated May 30, 2023 (File No. 333-270078-01)\n4.1 Indenture by and among Atmos Energy Kansas Securitization I, LLC, U.S. Bank Trust Company, National Association, as Indenture Trustee, and U.S. Bank National Association, as Securities Intermediary (including the form of the Bonds and the Series Supplement), dated as of June 20, 2023 Exhibit 4.1 to Atmos Energy Kansas Securitization I, LLCs Form 8-K dated June 20, 2023 (File No. 333-270078-01)\n4.2 Series Supplement by and among Atmos Energy Kansas Securitization I, LLC and U.S. Bank Trust Company, National Association, as Indenture Trustee, and U.S. Bank National Association, as Securities Intermediary, dated as of June 20, 2023 Exhibit 4.2 to Atmos Energy Kansas Securitization I, LLCs Form 8-K dated June 20, 2023 (File No. 333-270078-01)\n10.1 Securitized Utility Tariff Property Servicing Agreement between Atmos Energy Kansas Securitization I, LLC and Atmos Energy Corporation, as Servicer, dated as of June 20, 2023 Exhibit 10.1 to Atmos Energy Kansas Securitization I, LLCs Form 8-K dated June 20, 2023 (File No. 333-270078-01)\n10.2 Securitized Utility Tariff Property Purchase and Sale Agreement between Atmos Energy Kansas Securitization I, LLC and Atmos Energy Corporation, as Seller, dated as of June 20, 2023 Exhibit 10.2 to Atmos Energy Kansas Securitization I, LLCs Form 8-K dated June 20, 2023 (File No. 333-270078-01)\n10.3 Administration Agreement between Atmos Energy Kansas Securitization I, LLC and Atmos Energy Corporation, as Administrator, dated as of June 20, 2023 Exhibit 10.3 to Atmos Energy Kansas Securitization I, LLCs Form 8-K dated June 20, 2023 (File No. 333-270078-01)\n31.1 Certification of Senior Officer in Charge of the Servicing Function of the Servicer Pursuant to Rule 13a-14(d)/15d-14(d)\n33.1 Report on assessment of compliance with servicing criteria for asset-backed issuers for Atmos Energy Corporation, as Servicer\n33.2 Report on assessment of compliance with servicing criteria for asset-backed issuers for U.S. Bank Trust Company, National Association, as Indenture Trustee\n34.1 Attestation report on assessment of compliance with servicing criteria for asset-backed securities of Ernst & Young LLP on behalf of Atmos Energy Corporation, as Servicer\n34.2 Attestation report on assessment of compliance with servicing criteria for asset-backed securities of Ernst & Young LLP on behalf of U.S. Bank Trust Company, National Association, as Indenture Trustee\n35.1 Servicer compliance statement of Atmos Energy Corporation, as Servicer\n104 Cover Page Interactive Data File (embedded within the Inline XBRL document and contained in\nExhibit 101)\nSupplemental information to be furnished with reports filed pursuant to Section 15(d) of the Act by Registrants which have not registered Securities pursuant to Section 12 of the Act.\nNo annual report, proxy statement, form of proxy or other proxy soliciting material has been sent to noteholders, and the registrant will not be sending an annual report or proxy material to its noteholders subsequent to the filing of this form.\nITEM 16. FORM 10-K SUMMARY\nNone.\nSignatures\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nDate: December 29, 2023\nAtmos Energy Kansas Securitization I, LLC\n(Issuing Entity)\nBy: Atmos Energy Corporation, as Servicer\n/s/ Christopher T. Forsythe\nChristopher T. Forsythe\nSenior Vice President and\nChief Financial Officer\n(Senior Officer in Charge of the Servicing Function)"
}