{
    "cik": "216877",
    "company": "PISMO COAST VILLAGE INC",
    "filing_type": "10-K",
    "filing_date": "2023-12-20",
    "period_of_report": "2023-09-30",
    "sic": "7000",
    "state_of_inc": "CA",
    "state_location": "CA",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/216877/0001513162-23-000162-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/216877/000151316223000162/pcv-20230930.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/216877/0001513162-23-000162.txt",
    "filename": "216877_10K_2023_0001513162-23-000162.htm",
    "content": "ITEM 1. BUSINESS.\nBUSINESS DEVELOPMENT\nPismo Coast Village, Inc., the \"Registrant\" or the \"Company,\" was incorporated under the laws of the State of California on April 2, 1975. The Company's sole business is owning and operating Pismo Coast Village RV Resort, a recreational vehicle resort (hereinafter the \"Resort\") in Pismo Beach, California. The Resort has continued to enhance its business by upgrading facilities and services to better serve customers.\nBUSINESS OF ISSUER\nThe company exclusively operates within the realm of owning and managing Pismo Coast Village RV Resort. Its revenue streams originate from camping site rentals, recreational vehicle storage, tow services, and retail sales through a general store. With all activities consolidated within this single industry segment, the company's financials and assets are entirely attributable to its Resort operations.\nPismo Coast Village RV Resort stands as a comprehensive, full-service facility featuring 400 spaces for recreational vehicles. The scope of resort operations encompasses site rentals, RV storage and tow services, a video arcade, laundromat, and various income sources linked to its overall functioning. The retail facet of the operations is represented by a general store. Additionally, the company hosts a recreation department that orchestrates activities and facilitates the rental of recreational equipment. In summary, the company's sole business focus is the ownership and operation of Pismo Coast Village RV Resort, showcasing a diverse range of offerings underpinned by a unified commitment to exceptional recreational experiences.\nPUBLIC AND SHAREHOLDER USERS\nThe present policy of the Company is to offer each shareholder the opportunity for 45 nights of free use of sites at the Resort; 25 nights may be used during prime time and 20 nights during non-prime time. The free use of sites by shareholders is managed by designating the nights of the year as prime time and non-prime time. A prime-time night is one that is most in demand, for example, Memorial Day Weekend and the period from June 1 until Labor Day. Non-prime time is that time with the least demand. Each shareholder is furnished annually a calendar that designates the prime and non-prime time nights; it also provides a schedule of when reservations can be made and the procedure for making reservations. Shareholder's free use of sites average approximately 21% to 24% annually (refer to Item 7. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS, page 9).\nSEASONAL ASPECTS OF BUSINESS\nThe business of the Company is seasonal and is concentrated during prime days of the year which are defined as follows: President's Day Weekend, Easter week, Memorial Day Weekend, summer vacation months, Labor Day, Thanksgiving Weekend and Christmas vacation.\nWORKING CAPITAL REQUIREMENTS\nBy accumulating reserves during the prime seasons, the Company is able generally to meet its working capital needs during the off-season. Industry practice is to accumulate funds during the prime season, and use such funds, as necessary, in the off-season. The Company has arranged, but not used, a $500,000 line of credit to ensure funds are available, if necessary, in the off-season.\nCOMPETITION\nThe Company faces competition from nine other RV parks within a five-mile radius, but its distinct advantage lies in being the sole property adjacent to the beach. Recognized as a recreational vehicle resort, it stands out for its upgraded facilities and amenities, including a restaurant, general store, satellite TV, high-speed wireless internet, a heated pool, miniature golf course, and a comprehensive recreational program. Industry travel guides consistently rate Pismo Coast Village RV Resort highly for its appearance, facilities, and recreational offerings, earning it the prestigious designation of \"Best of Pismo Beach - RV Resort\" in September 2023.\nIn the competitive tourist market of the Central Coast of California, the Resort actively collaborates with the City of Pismo Beach, Chamber of Commerce, Conference and Visitors Bureau, participating as major sponsors in joint events and advertising initiatives. Ongoing marketing efforts include placements in trade publications, industry directories, and collaboration with RV-related companies. Leveraging the effectiveness of its website and social media, the Resort successfully engages with its target audience.\nThe marketing strategy extends to groups and clubs, offering incentives such as group discounts, meeting facilities, and catering services. Despite a competitive landscape, the Company allocated $58,944 to its marketing plan for the fiscal year 2022-2023, demonstrating a commitment to sustained growth. Emphasizing customer service and high-quality recreational facilities, the Resort has cultivated a robust source of repeat business, underlining its success in building lasting relationships with patrons.\nENVIRONMENTAL REGULATION\nThe Company is affected by federal, state, and local antipollution laws and regulations. Due to the nature of its business operations (camping, RV storage and small retail store sales), the discharge of materials into the environment is not considered to be of a significant concern, and the EPA has not designated the Company as a potentially responsible party for cleanup of hazardous waste.\nThe main property of the Resort is located within the boundaries of those lands under the review and purview of the Coastal Commission of the State of California and the City of Pismo Beach. The water and sewer systems are serviced by the City of Pismo Beach. The Company was subject to state and federal regulations regarding the fiscal year 1996 reconstruction of an outflow structure that empties into Pismo Creek at the north boundary of the Resort. Because the Resort is within the wetlands area, the California Coastal Commission required permits for repair and construction to be reviewed by the following agencies: City of Pismo Beach, State Lands Commission, Regional Water Quality Board, State of California, California Department of Fish and Game, State Department of Parks and Recreation and the Army Corps of Engineers.\nEMPLOYEES\nAs of September 30, 2023, the Company employed approximately 60 people, with 12 of these on a part-time basis and 48 on a full-time basis. Due to the seasonal nature of the business, additional staff are needed during peak periods and fewer during the off-season. Staffing levels during the fiscal year ranged from approximately 60 employees to 71 employees. Management considers its labor relations to be good.\nADDITIONAL INFORMATION\nThe Company has remained conservative when considering rates and rate increases. As a result of experiencing increasing operational expenses and conducting a local comparative rate study, the Board of Directors (Board) voted to increase all trailer towing fees $10 per tow transfer effective August 1, 2022. The Board also voted at the September meeting to increase all nightly rates $5 per night effective October 1, 2023. It is anticipated the proposed rates will continue to market site usage at their highest value and not negatively impact the Company's ability to capture an optimum market share.\nREPORTS TO SECURITY HOLDERS\nPismo Coast Village, Inc. files quarterly reports, an annual report, and periodic reports, providing the public with current information about the Company and its operations with the Securities and Exchange Commission.\nThe Company makes available on its website, www.pismocoastvillage.com, access to its annual report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and all amendments to those reports as soon as reasonably practicable after such material is electronically filed with or furnished to the Securities and Exchange Commission.\nThe public may read and copy any materials filed with the Securities and Exchange Commission, on official business days during the hours of 10:00 a.m. to 3:00 p.m., at the SEC's Public Reference Room located at 100 F Street, N. E., Washington, D.C. 20549. Information on the operation of the Public Reference Room may be obtained by calling the SEC on 1-800-SEC-0330. The SEC maintains an internet site (http://www.sec.gov) that contains reports, proxy statements, and other information that the Company files electronically with the SEC. ITEM 1A. RISK FACTORS.\nA number of factors, many of which are common to the lodging industry and beyond our control, could affect our business, including the following:\nincreased gas prices.\nincreased competition from new resorts in our market.\nincreases in operating costs due to inflation, labor costs, workers' compensation and healthcare related costs, utility costs, insurance, and unanticipated costs such as acts of nature and their consequences and other factors that may not be offset by increased rates.\nchanges in interest rates, cost, and terms of debt financing.\nchanges in governmental laws and regulations, fiscal policies and zoning ordinances and the related costs of compliance with laws and regulations, fiscal policies, and ordinances.\nadverse effects of market conditions, which may diminish the desire for leisure travel; and\nadverse effects of a downturn in the leisure industry.\nThe leisure and travel business are seasonal and seasonal variations in revenue at our Resort can be expected to cause quarterly fluctuations in our revenue. Our revenue is generally highest in the third and fourth quarters. Quarterly revenue also may be harmed by events beyond our control, such as extreme weather conditions, terrorist attacks or alerts, contagious diseases, economic factors, and other considerations affecting travel. To the extent that cash flow from operations is insufficient during any quarter due to temporary or seasonal fluctuations in revenue, we have to rely on our short-term line of credit for operations. Recent events beyond our control, including an economic slowdown and extreme weather conditions 2Q2023, harmed the operating performance of the Central Coast leisure industry generally. If these or similar events occur again, our operating and financial results may be harmed by declines in average daily rates or occupancy.\nCarrying our outstanding debt may harm our business and financial results by:\nrequiring us to use a substantial portion of our funds from operations to make required payments on principal and interest, which will reduce the amount of cash available to us for our operations and capital expenditures, future business opportunities and other purposes.\nmaking us more vulnerable to economic and industry downturns and reducing our flexibility in responding to changing business and economic conditions.\nlimiting our ability to borrow more money for operations, capital expenditures or to finance acquisitions in the future; and\nrequiring us to sell one or more properties, possibly on disadvantageous terms, in order to make required payments of interest and principal.\nOur Resort has a need for renovations and potentially significant capital expenditures in connection with improvements, and the costs of such renovations or improvements may exceed our expectations.\nOccupancy and the rates, we are able to charge are often affected by the maintenance and capital improvements at a resort, especially in the event that the maintenance of improvements is not completed on schedule, or if the improvements result in the closure of the General Store or a significant number of sites. The costs of necessary capital expenditure could harm our financial condition and reduce amounts available for operations. These capital improvements may also give rise to additional risks including:\nconstruction cost overruns and delays.\na possible shortage of available cash to fund capital improvements and the related possibility that financing of these expenditures may not be available to us on favorable terms.\nuncertainties as to market demand or a loss of market demand after capital improvements have begun.\ndisruption in service and site availability causing reduced demand, occupancy, and rates; and\npossible environmental issues.\nWe rely on our executive officers and management team, the loss of whom could significantly harm our business.\nOn July 15, 2022, Ms. Lesley Marr began her career with Pismo Coast Village, Inc. as General Manager, and assumed full responsibility in that position on November 8, 2022. Our continued success depends, to a significant extent, on the efforts and abilities of our General Manager, Lesley Marr. Ms. Marr is important to our business and strategy and to the extent that were she to depart and is not replaced with an experienced substitute, Ms. Marrs departure could harm our operations, financial condition, and operating results.\nUninsured and underinsured losses could harm our financial condition, and the results of operations.\nIn the event of a catastrophic loss, our insurance coverage may not be sufficient to cover the full current market value or replacement cost of our lost properties. Should an uninsured loss or a loss in excess of insured limits occur, we could lose all or a portion of the capital we have invested in the Resort, as well as the anticipated future revenue from the Resort. In that event, we might nevertheless remain obligated for any notes payable or other financial obligations related to the property. Inflation, changes in building codes and ordinances, environmental considerations and other factors might also keep us from using insurance proceeds to replace or renovate the Resort after it has been damaged or destroyed. Under these circumstances, the insurance proceeds we receive might be inadequate to restore our economic position on the damaged or destroyed property. ITEM 1B. REMOVED AND RESERVED.\nITEM 1C. CYBERSECURITY.\nDisclosure of cybersecurity risk, management, & strategy\nCompuData Supports Pismo Coast Village through their Managed IT Services. This is done through patch management, a managed Network, Managed Security, and Managed 24/7 support. Pismo Coast Village has a comprehensive risk management process that all nodes on the network are set to follow. All external Vendors are SOC II compliant. Our users access all applications utilizing a two-factor authentication method at the Domain level and SSO for third Party applications.\nPismo Coast Village has not had a material or data breach. Our strategy is to mitigate risks preventatively. The is implemented through best-in-class cybersecurity strategies preventative measures carried out by our vendor CompuData. Our identifiable risk areas are twofold: First within accounting and second, within taking payments. Our accounting department is hosted on a cloud system utilizing SSL for access and encryption. Our Managed Services company, CompuData, manages risk and preventative cyber security to that server. Within our taking of payments, we are fully PCI compliant within our payment processing service, Clover. No Credit card information is stored or transferred outside of that system.\nWe engage a third-party Vendor as mentioned above, CompuData. Our vendors are whitelisted and are SOC II certified. Our Whitelisted Vendor applications are Newbook, Sage, Clover, and Office 365. ITEM 2. PROPERTIES.\nThe Company's principal asset consists of the Resort, which is located at 165 South Dolliver Street in Pismo Beach, California. The Resort is built on a 26-acre site and includes 400 campsites with full hookups and nearby restrooms with showers and common facilities, such as a video arcade, recreation hall, restaurant, general store, swimming pool, laundromat, and three playgrounds.\nIn 1980, the Company purchased a 2.1-acre parcel of real property located at 2250 22nd Street, Oceano, California, at a price of $66,564. The property is being used by the Company as a storage facility for recreational vehicles. The storage capacity of this lot is approximately 121 units. On October 20, 2014, the Company entered into a long-term lease with Verizon Wireless for the installation of a cell tower. The lease term is for five (5) years with up to four (4) additional five (5) year terms unless the lessee terminates the lease at the end of the current term.\nIn 1981, the Company exercised an option and purchased a 3.3-acre parcel located at 424 South Dolliver Street, Pismo Beach, California, at a price of $300,000. The property, which previously had been leased by the Company, is used primarily as a recreational vehicle storage yard. The storage capacity of this lot is approximately 120 units. On June 6, 2016, the Company entered into a long-term lease with Verizon Wireless for the installation of a cell tower. The lease term is for five (5) years with up to four (4) additional five (5) year terms unless the lessee terminates the lease at the end of the current term.\nIn 1988, the Company purchased approximately 0.6 acres of property at 180 South Dolliver Street, Pismo Beach, California, across the street from the main property, consisting of a large building with a storefront and one large maintenance bay in the rear. Also, on the property is a smaller garage-type building with three parking stalls. In April 2023, the Company entered into a long-term single tenant gross lease with Trailer Hitch RV. On December 31, 1998, the Company closed escrow on a parcel of property located at 1295 Sand Dollar Avenue, Oceano, California, to be developed as an additional RV storage facility. The 5.5-acre property is located adjacent to existing Company RV storage. On October 14, 1999, construction was completed, and the Company received County approval to occupy the premises. The property was purchased for $495,000, of which $395,000 was financed and paid in full in July 2000. Development cost amounted to $195,723 and was allocated from operational cash flow. The storage capacity for this property is approximately 408 units and is currently full.\nOn February 28, 2003, the Company closed escrow on a parcel of property to be developed as an additional RV storage facility. The 4.7-acre property is located on Fountain Avenue in Oceano, California, and was purchased for $650,000, of which $500,000 was financed. The note on this property was paid off in September 2005. The construction permit granted by the County of San Luis Obispo was contingent upon permit approval by the California Coastal Commission. In January 2006, the Commission denied the permit based on wetland conditions. The property is currently being considered for another use or possibly liquidation.\nDue to the continued demand for RV storage and the denial of the aforementioned permit, the Board of Directors elected to purchase additional property. On January 11, 2006, the Company closed escrow on a six-acre property located at 974 Sheridan Road, Arroyo Grande, California, previously developed as an RV storage facility. The purchase price was $2.1 million and included approximately 80 existing storage customers. This property had been permitted and developed the previous year and is considered in good condition with a capacity of approximately 229 units.\nOn April 6, 2006, the Company purchased the 2.2-acre property located at 2030 Front Street in Oceano, California, that it previously rented from Union Pacific Railroad for RV storage. The purchase price was $925,000 and the condition is considered good. The lot is operating at full capacity with 181 units.\nOn May 9, 2008, the Company closed escrow on a 19.55-acre property located at 2180 Arriba Place in Arroyo Grande, California, to be developed for RV storage. The purchase price was $3.1 million for the undeveloped land. The Company received a development permit through the County of San Luis Obispo Planning Commission. The development was completed in May 2010, and the storage capacity is expected to be approximately 900 units. On January 21, 2013, the Company entered into a long-term lease with Verizon Wireless for the installation of a cell tower. The lease term is for five (5) years with up to four (4) additional five (5) year terms unless the lessee terminates the lease at the end of the current term.\nOn May 20, 2015, the Company closed escrow on a one-acre property located at 2096 Nipomo Street in Oceano, California, to be developed as an RV Repair and Service facility. The purchase price was $425,000 and required the demolition of a two-story residence. The Company successfully expanded the usable property area by seeking road abandonment. On September 1, 2017, the Company received a Minor Use Permit with conditions from San Luis Obispo County. Construction was completed and the Certificate of Occupancy was received from the County of San Luis Obispo in March of 2021. On April 16, 2023, the Company entered into a long-term single tenant gross lease with Trailer Hitch RV.\nOn April 19, 2023, the Company closed escrow on a 19.55-acre property located at 255 N. Oak Glen Avenue in Nipomo, California, to be developed for RV storage. The purchase price was $1.2 million for the undeveloped land and was a cash purchase with no additional encumbrances to the Corporate. On April 1, 2023, the Company entered into a long-term lease with OUTFRONT Media for the existing billboard. The lease term is for ten (10) years.\nThere is no deferred maintenance on any of the Resort's facilities. The Company's facilities are in good condition and adequate to meet the needs of the shareholder users as well as the public users. The Company continues to develop sufficient revenue from general public sites sales to support a continued positive maintenance program and to meet the demands of shareholders use of free sites.\nManagement considers the Company's insurance policies offer adequate coverage for risk and liability exposure.\n1. TRAILER STORAGE LEASED YARDS\nIn 1986, the Company leased a parcel of land 100 feet wide by 960 feet long, located at 2030 Front Street in Oceano, California, from the Union Pacific Railroad Corporation. The property is being used by the Company as a storage facility for recreational vehicles. Capital improvements in the amount of $40,000 were made to this property, which provides storage for approximately 180 units. On July 29, 2005, Union Pacific Railroad Corporation sold the property to the Weyrick Family Trust, who, after entering into a five-year lease, agreed to sell the property to the Company for $925,000. This transaction was completed April 6, 2006.\nAssociated with the previously mentioned property, and included within the fenced storage perimeter, is the lease of a ten-foot by 960-foot section belonging to Union Pacific Railroad. This lease also allows for the Company's fence to encroach upon the lessor's property. This annual lease is currently $7,379, with a 3% automatic annual increase.\nIn 1991, the Company developed a lease for a five-acre RV storage lot at the Oceano Airport clear zone as storage for approximately 310 RVs. This lot, which is located at 1909 Delta Lane in Oceano, was developed to replace a 100-unit storage lot that was closed when the lease was not renewed. Construction was completed in January 1992 and capital improvements in the amount of $330,768 were made to this property of which $300,000 was financed and paid in full during fiscal year 1997. The original lease on the storage lot was for five years and the Company executed a third five-year option with the County of San Luis Obispo that expired December 31, 2006. In response to the Company's request for another five-year extension, the County has answered that, until the Oceano Airport Master Plan is updated, the lease will be a month-to-month holdover at $3,575 monthly.\nOn June 2, 2020, the San Luis Obispo County Board of Supervisors voted to approve a lease with the Company following the completion of the Oceano Drainage project. The initial lease term is for two years and may be extended for four additional and successive two-year terms. The lease was extended to June of 2022. The monthly lease is currently $3,924 with an annual adjustment based on the Consumer Price Index published in July.\nThe Resort leases out areas to other companies to ensure that the best service and equipment are available for guest use or creates cash flow for the Company. These areas are leased from the Company pursuant to the terms described in the leases.\n1. RECREATIONAL ARCADE AGREEMENT WITH COIN AMUSEMENTS, INC.\nThis agreement is dated November 1, 2021, and pursuant to this agreement, the Company granted Coin Amusements, Inc. the concession to operate various coin-operated game units at the Resort. The one-year term expires on October 31, 2023, and continued renewal is expected without significant impact.\n2. WASH MULTIFAMILY LAUNDRY SYSTEMS, GOLETA, CA\nThe seven-year lease that expired October 31, 2013, was renewed for another ten years effective September 1, 2016. The lease grants Wash Multifamily Laundry Systems (Wash) the right to place and service coin-operated laundry machines on the Resort. The agreement provides that 70% of the Lessee's gross income be paid to the Company as rent. Wash will replace 18 washers and 18 dryers with new equipment prior to Q3.\n3. PISMO COAST INVESTMENTS\nThe Company renewed a lease agreement with Ms. Jeanne Sousa, a California Corporations Licensed Broker, for the lease of a 200-square foot building at the Resort from which she conducts sales activities in the Company's stock. On November 11, 2022, the lease was renewed commencing January 1, 2023, and terminating December 31, 2025. Termination or cancellation may be made by either Lessor or Lessee by giving the other party sixty (60) days written notice.\n4. VERIZON WIRELESS\nThe Company entered into a lease with GTE Mobilnet of Santa Barbara Limited Partnership, d/b/a Verizon Wireless, for a 42-foot by 37-foot portion of the RV storage lot located at 2180 Arriba Place, Arroyo Grande, California, for the construction and operation of a cell tower communications facility. The term of the lease is for five years commencing on January 21, 2013. On June 1, 2020, an amendment to the agreement was signed by the Company and Airtouch Cellular d/b/a Verizon Wireless. The amendment set the rent to $2000 per month with an annual increase of 2%. The amendment also stipulated six renewable five-year terms.\nOn October 20, 2014, the Company entered into a second lease with GTE Mobilnet of Santa Barbara Limited Partnership, d/b/a Verizon Wireless, for a 40-foot by 40-foot portion of the RV storage lot located at 2250 22nd Street, Oceano, California, for the construction and operation of a cell tower communications facility. The term of the lease is for five years commencing on October 20, 2014, and ending on October 19, 2019. Continued renewal is expected without significant impact. The Lessee, upon the annual anniversary date of the agreement, may terminate provided that three (3) months prior notice is given to the Lessor.\nOn January 14, 2016, the Company entered into a third lease with GTE Mobilnet of Santa Barbara Limited Partnership, d/b/a Verizon Wireless, for the placement of a 22-foot-tall flagpole cell tower at 165 South Dolliver, Pismo Beach, California. The lease includes space for the flagpole and equipment enclosure, conduits, and right of way. The term of the lease is for five years commencing on January 14, 2016, and ending on January 13, 2021. Continued renewal is expected without significant impact. The Lessee, upon the annual anniversary date of the agreement, may terminate provided that three (3) months prior notice is given to the Lessor.\nOn June 6, 2016, the Company entered into a fourth lease with GTE Mobilnet of Santa Barbara Limited Partnership, d/b/a Verizon Wireless, for a 40-foot by 40-foot portion of the RV storage lot located at 424 South Dolliver Street, Pismo Beach, California, for the construction and operation of a cell tower communications facility. The term of the lease is for five years commencing on June 6, 2016, and ending on June 5, 2021. Continued renewal is expected without significant impact. The Lessee, upon the annual anniversary date of the agreement, may terminate provided that three (3) months prior notice is given to the Lessor.\n5. ROCK AND ROLL DINER OF OCEANO INC. d/b/a PISMO COAST VILLAGE GRILL\nThe Company entered into a lease with Mr. Marios Pouyioukkas, owner/operator of Rock and Roll Diner of Oceano Inc., for the lease of a 708-square foot space at the Resort from which the concessionaire operates the restaurant facilities as an independent food service operation. The term of the initial lease was from June 18, 2012, until December 31, 2013. The lease was renewed November 1, 2019, for a three-year period beginning January 1, 2020, expiring December 31, 2023. This lease has been renewed for one-year terms for the years 2023 and 2024. Termination or cancellation may be made by either Lessor or Lessee by giving the other party thirty (30) days written notice. ITEM 3. LEGAL PROCEEDINGS\nNo pending legal proceedings against the Company other than routine litigation incidental to the business. ITEM 4. (REMOVED AND RESERVED).\nPART II ITEM 5. MARKET FOR REGISTRANT'S COMMON EQUITY, RELATED STOCKHOLDER MATTERS\nAND ISSUER PURCHASES OF EQUITY SECURITIES.\na. MARKET INFORMATION\nThere is no market for the Company's common stock, and there are only limited or sporadic transactions in its stock. Ms. Jeanne E. Sousa, a licensed broker/dealer, handled sales of the Companys shares as Pismo Coast Investments. The last transaction the Company is aware of occurred September 28, 2023, at a price of $58,000 for one share conveyed. This price was used for the computation of aggregate market value of Company stock on page 2 of this Report.\nb. HOLDERS\nThe approximate number of holders of the Company's common stock on September 30, 2023, was 1,495.\nc. DIVIDENDS\nThe Company has paid no dividends since it was organized in 1975, and although there is no legal restriction impairing the right of the Company to pay dividends, the Company does not intend to pay dividends in the foreseeable future. The Company selects to invest its available working capital to enhance the facilities at the Resort or develop properties supporting the Resort operations.\nd. SECURITIES AUTHORIZED FOR ISSUANCE UNDER EQUITY COMPENSATION PLANS\nThe Company does not currently have securities authorized for issuance under equity compensation plans.\ne. RECENT SALES OF UNREGISTERED SECURITIES: USE OF PROCEEDS FROM REGISTERED SECURITIES\nThe Company does not have sales of unregistered securities. ITEM 6. SELECTED FINANCIAL DATA\nNot applicable to smaller reporting companies. See Managements Discussion and Analysis. ITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND\nRESULTS OF OPERATIONS\nThe following analysis discusses the Company's financial condition as of September 30, 2023, compared with September 30, 2022. The discussion should be read in conjunction with the audited financial statement and the related notes to the financial statement and the other financial information included elsewhere in this Form 10-K.\nCertain information included herein contains statements that may be considered forward-looking statements, such as statements relating to anticipated expenses, capital spending and financing sources. Such forward-looking information involves important risks and uncertainties that could significantly affect anticipated results in the future and, accordingly, such results may differ from those expressed in any forward-looking statements made herein. These risks and uncertainties include, but are not limited to, those relating to competitive industry conditions, California tourism and weather conditions, dependence on existing management, leverage and debt service, the regulation of the recreational vehicle industry, domestic or global economic conditions, and changes in federal or state tax laws or the administration of such laws.\nOVERVIEW\nPismo Coast Village, Inc. operates as a 400-space recreational vehicle resort. The Company includes additional business operations to provide its users with the full range of services expected of a recreational resort. These services include a store, video arcade, laundromat, and an RV storage operation.\nThe Company is authorized to issue 1,800 shares of one class, all with equal voting rights and all being without par value. Transfers of shares are restricted by Company bylaws. One such restriction is that transferees must acquire shares with intent to hold the same for the purpose of enjoying camping rights and other benefits to which a shareholder is entitled. Each share of stock is intended to provide the shareholder with the opportunity for 45 nights of free site use per year. However, if the Company is unable to generate sufficient funds from the public, the Company may be required to charge shareholders for services.\nManagement is charged with the task of developing sufficient funds to operate the Resort through site sales to general public guests by allocating a minimum of 175 sites to general public use and allocating a maximum of 225 sites for shareholder free use. The other service centers are expected to generate sufficient revenue to support themselves and/or produce a profit.\nThe Company continues to promote and depend upon recreational vehicle camping as the primary source of revenue. The rental of campsites to the general public provides income to cover expenses, complete capital improvements, and allow shareholders up to 45 free nights camping annually. Additional revenues come from RV storage and spotting, on-site convenience stores, and other ancillary activities such as laundromat, arcade, and bike rental.\nThe RVing public actively seeks accommodations on the Central Coast despite volatile fuel prices and personal financial uncertainties. RVing offers an affordable outdoor recreational experience, and the Company provides quality facilities and services in a highly popular location. According to industry reports such as the 2023 KOA Camping Report published May 12, 2023, it indicates that camping continues to be robust and resilient, even in economic downturns. Camping is increasingly popular, with more people than ever viewing it as a way to relax, unwind, and connect with family, friends, and nature.\nCamping is an important leisure activity for many people. This may be because, even in an economic downturn, camping remains economically accessible for most individuals. Faced with a failing economic climate, 38% of campers are willing to give up other vacation activities to go camping. 80% of survey respondents from the 2023 KOA Camping Report said they would give up other leisure travel options to camp more.\nMost (56%) RVers plan to RV camp the same amount or more in the event of an economic downturn. 33% of RVers say theyll use their RVs more, and 23% said they would use their RVs the same amount as usual. This is significant and helps demonstrate the economic resilience of outdoor hospitality.\nRV storage and towing continue to be a primary source of revenue for the Company. In April 2023, the company purchased 4.42 acres to develop a 150 site self-storage lot due to having a 300+ waitlist for new clients. RV storage provides numerous benefits to the customer including: no stress of towing, no need to own a tow vehicle, use of RV by multiple family members, and convenience. RV storage continues to have a strong demand for both self and tow storage.\nOngoing investment in resort improvements has assured Resort guests and shareholders a top quality, up-to-date facility. This quality and pride of ownership was evident as the resort continues to maintain high standards and again, has been recognized with quality ratings by Good Sam. The Companys commitment to quality, value, and enjoyment is underscored by the businesss success due to word of mouth and referrals from guests. In addition, investment for online marketing, social media content, ads in the leading national directory, and trade magazine advertising formulates most of the business-marketing plan.\nCURRENT OPERATING PLANS\nThe Board of Directors continues its previously established policy by adopting a stringent conservative budget for fiscal year 2024, which projects a positive cash flow of approximately $1,205,030 from operations. This projection is based on paid site occupancy reflecting similar occupancy as experienced in fiscal year 2023. The 2024 budget plan includes a $5 per night increase for all site rentals effective October 1, 2023. While the Company projects a positive cash flow, this cannot be assured for fiscal year 2024.\nFINANCIAL CONDITION\nThe business of the Company is seasonal and is concentrated on prime days of the year which are defined as follows: President's Day weekend, Easter week, Memorial Day weekend, summer vacation months, Labor Day weekend, Thanksgiving week, and Christmas/New Years week. There are no known trends that affect business or affect revenue.\nThe Company develops its income from two sources: (a) Resort Operations, consisting of revenues generated from RV site rentals, from RV storage space operations, and lease revenues from the laundromat, arcade, restaurant operations and property leases for cell tower communications facilities by third party lessees; and (b) Retail Operations, consisting of revenues from general store operations and recreation.\nWith the possibility of requiring additional funds for planned capital improvements and the winter season, the Company maintains a $500,000 Line of Credit to ensure funds will be available if required. In anticipation of future large projects, the Board of Directors has instructed management to build operational cash balances. The Company has no other liabilities to creditors other than current accounts payable arising from its normal day-to-day operations and advance Resort rental reservation deposits, none of which are in arrears.\nLIQUIDITY\nThe Company's policy is to use its ability to generate operating cash flow to meet its expected future needs for internal growth. The Company has continued to maintain sufficient cash so as to not require the use of a short-term line of credit during the off-season period, and the Company expects to be able to do so (although no assurance of continued cash flow can be given).\nNet cash provided by operating activities totaled $1,188,155 in 2023, compared to $1,710,003 for the 2022 fiscal year. Reduction in Net Cash provided by operating activities in 2023 of $521,848 can largely be attributed to the closing of the PCV RV Service Shop in April 2023. RV Service Shop income for 2023 was $255,424 versus $632,983 in 2022.\nDuring fiscal year 2023, capital investment of $1,412,193 was made that included purchasing 19.55-acre property located at 255 N. Oak Glen Avenue in Nipomo, California, to be developed for RV storage. In addition to the purchase of a lowboy tilt-trailer to haul equipment, redesign, upgrade for Square common area including patio furniture, electrical and lighting. Two golf carts were purchased for maintenance and one for Security. These projects were completed on time. During fiscal year 2022, capital investment of $247,870 was made that included Wi-Fi upgrade, surveillance cameras, new truck for security, new truck for RV Service, new backhoe, new outfall pumps and electrical panel, pool heater, and two golf carts.\nFiscal year 2023's current ratio (current assets to current liabilities) of 4.12 increased from fiscal year 2022s ratio of 3.82. The increase in the current ratio is the result of reduced accrued liabilities as well as reduced Rental deposits.\nWorking Capital increased to $8,511,851 at the end of fiscal year 2023, compared to $8,499,383 at the end of fiscal year 2022. This increase is primarily a result of increased interest received from investments.\nCAPITAL RESOURCES AND PLANNED EXPENDITURES\nThe Company plans capital expenditures up to $1,611,000 in fiscal year 2024 to further enhance the Resort facilities and services. This would include remodeling the General Store, Mini Golf Course and Guest Services Building, development of L Lot in Nipomo for RV Storage and environmental studies for Z Lot. In addition to replacement of all restroom and laundry water heaters and adding security cameras for Lots of B and E. The Board of Directors continues to evaluate the property Solar project with an initial cost of $4M before tax credits and rebates. Funding for these projects is expected to come from normal operating cash flows and, if necessary, be supplemented with outside financing. These capital expenditures are expected to increase the Resort's value to its shareholders and the general public.\nRESULTS OF OPERATIONS\nOCCUPANCY BY SEGMENT\nOCCUPANCY\n% of Shareholder Site Use\n29.6%\n28.0%\n% of Paid Site Rental\n70.4%\n71.6%\n% Total Site Occupancy\n77.4%\n85.7%\n% of Storage Rental\n99.0%\n99.0%\nResort Operations\n$\n8,728,725\n$\n9,021,458\nRetail Operations\n$\n955,343\n$\n1,315,075\nOperating Lease Income\n$\n66,559\n$\n-\nOccupancy rates on the previous table are calculated based on the quantity occupied as compared to the total sites available for occupancy (i.e., total occupied to number of total available).\n2023 COMPARED WITH 2022\nResort operations income decreased $292,733 primarily due to significant rains in the months of late Dec 2022, and first quarter 2023. The retail operations income decreased $359,732 primarily due to the RV Service department closing and liquidation in April 2023. The General Store was impacted by a 1Q reduction in occupancy, increased costs of goods and staffing challenges. In an effort to maximize revenue, management continues to stock more appropriate items, more effective merchandising, margin reviews and pay greater attention to customer service.\nInterest/Dividend Income increased $128,618 above the previous year. This increase was primarily due to interest income from treasury bills purchased in 2023. Interest Expense increased to ($14,532) in 2023 compared to ($11,849) the previous year.\nThe Company also received an Employee Retention Credit payment of $245,280 in June of 2022 which was not available in 2023.\nOperating Expenses increased $814,852 due to increase in employee compensation taxes, benefits and insurances expenses, Stockholder expenses due to Carol Lyons expenses, non-capitalized property improvements, extraordinary outside consultant expenses, and maintenance supplies and contract repair effected by inflation.\nThe Prior Management Team focused on keeping expenses under budget to maximum net profit. Choosing to be reactionary in regard to maintenance, internal operating systems and equipment needs had a definite effect on the 2022-2023 operating expenditures. The Operations Team is working on the development of a preventative maintenance plan, as well as a systems and equipment road map. A proactive approach will allow us to better control our budget.\nInflation has had an impact on our profit position for 2023. Inflation has affected operations and liquidity by raising the replacement cost of property and equipment. The Company has implemented minor rate increases to site rents to mitigate the effects of inflation and work towards maintaining a more favorable profit position. Should the current economic situation continue, Operations would recommend increasing the rate for our Storage customers which is currently below market.  ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nPismo Coast Village, Inc. is responsible for the information and representations contained in this report. The financial statements have been prepared in conformity with accounting principles generally accepted in the United States of America, which we considered appropriate in the circumstances and include some amounts based on our best estimates and judgments. Other financial information in this report is consistent with these financial statements.\nOur accounting systems include controls designed to reasonably assure assets are safeguarded from unauthorized use or disposition and provide for the preparation of financial statements in conformity with accounting principles generally accepted in the United States of America. These systems are currently under review by the Management and Interim Audit Chairperson. Additional training of accounting personnel and organizational restructuring for added layers of review are being considered.\nREPORT OF INDEPENDENT REGISTERED\nPUBLIC ACCOUNTING FIRM\nREPORT OF INDEPENDENT REGISTERED\nPUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Shareholders\nPismo Coast Village, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of Pismo Coast Village, Inc. (the Company) as of September 30, 2023, and 2022; the related statements of income, comprehensive income, stockholders equity, and cash flows for each of the years in the two-year period ended September 30, 2023; and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of September 30, 2023, and 2022, and the results of its operations and its cash flows for each of the years in the two-year period ended September 30, 2023 and 2022, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting, but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) are especially challenging, subjective, or involve complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nIncome Taxes\nManagements estimates of the deferred tax assets, liabilities, and provisions disclosed in Note 7 are based primarily on the differences between depreciation measurements on a tax basis versus accounting principles generally accepted in the United States of America (GAAP) basis, and timing of vacation expense recognition and shareholder site usage. We evaluated the key factors and assumptions used to develop the estimates of income tax provisions in determining that they are reasonable in relation to the financial statements taken as a whole.\nWe identified the evaluation of the Companys income tax provisions as a critical audit matter because the application of tax law and timing of recognition of income tax expense and benefits is complex and involves subjective judgment.\nWe have served as the Companys auditor since 2005.\nBROWN ARMSTRONG\nACCOUNTANCY CORPORATION\nAuditor Firm ID: #237\nBakersfield, California\nDecember 13, 2023\nPismo Coast Village, Inc.\nFinancial Statements\nYears Ended September 30, 2023, and 2022\nPage\nBalance Sheet as of September 30, 2023, and 2022\nStatement of Operations for the Years Ended September 30, 2023, and 2022\nStatement of Changes in Stockholders Equity for the Years Ended September 30, 2023, and 2022\nStatement of Cash Flows for the Years Ended September 30, 2023, and 2022\nNotes to Financial Statements\n23 - 33\nSupplementary Information\nSchedule of Operating Expenses as of September 30, 2023, and 2022\nStatements of Operations for the Three Months Ended September 30, 2023, and 2022\n2. Exhibits filed with this Form 10-K Report:\nExhibit No.\nDescription of Exhibit\nCode of Ethics\n31.1\nCertification of the President and Chief Executive Office of the Company pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n31.2\nCertification of the Vice President Finance and Chief Financial Officer of the Company pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n32.1\nCertification of the President and Chief Executive Office and Vice President Finance and Chief Financial Officer of the Company Pursuant to 18 U.S.C. Subsection 1350, as adopted pursuant to Section 906 of the Sarbanes Oxley Act of 2002\nPismo Coast Village, Inc.\nBalance Sheet\nSeptember 30, 2023, and 2022\nAssets\nCurrent assets\nCash and cash equivalents\n$\n884,943\n$\n1,019,465\nCash Reserved for Capital Improvements\nand Deferred Maintenance\n8,407,996\n9,566,367\nInvestments\n1,042,140\n-\nAccounts receivable\n55,528\n49,115\nInventories\n120,901\n216,842\nPrepaid income taxes\n395,800\n323,900\nPrepaid expenses\n333,945\n342,211\nTotal current assets\n11,241,253\n11,517,900\nOther Assets\nProperty and equipment, net of accumulated\ndepreciation and amortization\n16,011,915\n15,031,100\nTotal assets\n$\n27,253,168\n$\n26,549,000\nLiabilities and Stockholders' Equity\nCurrent liabilities\nAccounts payable and accrued liabilities\n$\n246,491\n$\n265,444\nAccrued salaries and vacation\n309,921\n432,187\nRental deposits\n2,084,012\n2,268,627\nBuilding security deposits\n25,000\n-\nCurrent portion of finance lease obligations\n63,978\n52,256\nTotal current liabilities\n2,729,402\n3,018,514\nLong-term liabilities\nDeferred taxes\n$\n439,400\n$\n424,900\nFinance lease obligations, net of current portion\n59,885\n104,382\nTotal liabilities\n3,228,687\n3,547,796\nStockholders' equity\nCommon stock - no par value, 1,800 shares issued,\n1,774 shares outstanding\n$\n5,566,130\n$\n5,566,130\nRetained earnings\n18,423,537\n17,435,074\nAccumulated other comprehensive income\n34,814\n-\nTotal stockholders' equity\n24,024,481\n23,001,204\nTotal liabilities and stockholders' equity\n$\n27,253,168\n$\n26,549,000\nThe accompanying notes are an integral part of these financial statements.\nPismo Coast Village, Inc.\nStatement of Operations Years Ended September 30, 2023, and 2022\nIncome\nResort operations\n$\n8,728,725\n$\n9,021,458\nRetail operations\n955,343\n1,315,075\nOperating Lease Income\n66,559\n-\nTotal income\n9,750,627\n10,336,533\nCosts and expenses\nOperating expenses\n$\n7,552,851\n$\n6,737,999\nCost of goods sold\n544,989\n639,434\nDepreciation and amortization\n460,132\n479,314\nTotal costs and expenses\n8,557,972\n7,856,747\nIncome from operations\n1,192,655\n2,479,786\nOther income (expense)\nInterest and dividend income\n$\n143,440\n$\n14,822\nInterest expense\n(14,532)\n(11,849)\nEmployee Retention Credit Income\n-\n245,280\nGain (loss) on disposal of fixed assets\n9,500\n-\nTotal other income (expense)\n138,408\n248,253\nIncome before provision for income tax\n1,331,063\n2,728,039\nProvision for income tax\n342,600\n724,700\nNet income\n$\n988,463\n$\n2,003,339\nNet income per share\n$\n557.19\n$\n1,129.28\nTotal comprehensive income per share\n$\n557.19\n$\n1,129.28\nThe accompanying notes are an integral part of these financial statements.\nPismo Coast Village, Inc. Statement of Changes in Stockholders Equity\nYears Ended September 30, 2023, and 2022\nCommon Stock\nRetained\nEarnings\nAccumulated\nOther\nComprehensive\nIncome\nTotal\nShares\nAmount\nBalance - September 30, 2020\n1,775\n$\n5,569,268\n$\n13,057,262\n$\n-\n$\n18,626,530\nNet Income\n$\n2,413,335\n$\n2,413,335\nBalance - September 30, 2021\n1,775\n$\n5,569,268\n$\n15,470,597\n$\n-\n$\n21,039,865\nNet Income\n$\n2,003,339\n$\n2,003,339\nRepurchase of common stock\n(1)\n$\n(3,138)\n$\n(38,862)\n$\n(42,000)\nBalance - September 30, 2022\n1,774\n$\n5,566,130\n$\n17,435,074\n$\n-\n$\n23,001,204\nNet Income\n$\n988,463\n$\n988,463\nOther comprehensive income\n$\n34,814\n$\n34,814\nBalance - September 30, 2023\n1,774\n$\n5,566,130\n$\n18,423,537\n$\n34,814\n$\n24,024,481\nThe accompanying notes are an integral part of these financial statements.\nPismo Coast Village, Inc.\nStatement of Cash Flows\nYears Ended September 30, 2023, and 2022\nCash flows from operating activities\nNet Income\n$\n988,463\n$\n2,003,339\nAdjustments to reconcile net income to net\nCash provided by operating activities:\nDepreciation and amortization\n460,132\n479,314\nChanges in operating assets and liabilities:\nAccounts receivable\n(6,413)\n(12,351)\nInventory\n95,941\n(16,735)\nPrepaid income taxes\n(71,900)\n(323,900)\nPrepaid expenses\n8,266\n(325,554)\nAccounts payable and accrued liabilities\n(18,953)\n(54,132)\nAccrued salaries and vacation\n(122,266)\n14,643\nRental deposits\n(184,615)\n23,779\nBuilding security deposits\n25,000\n-\nIncome taxes payable\n-\n(60,000)\nLong term deferred income taxes\n14,500\n(18,400)\nTotal adjustments\n199,692\n(293,336)\nNet cash provided by operating activities\n1,188,155\n1,710,003\nCash flows from investing activities\nCapital expenditures\n(1,412,193)\n-\nPurchase of Investments\n(1,007,326)\n(247,870)\nNet cash used investing activities\n(2,419,519)\n(247,870)\nCash flows from financing activities\nRepurchase of capital stock\n-\n(42,000)\nPrincipal payments on finance lease obligations\n(61,529)\n(60,757)\nNet cash used in financing activities\n(61,529)\n(102,757)\nNet (decrease)increase in cash and cash equivalents\n(1,292,893)\n1,359,376\nCash and cash equivalents - beginning of year\n10,585,832\n9,226,456\nCash and cash equivalent - end of year\n9,292,939\n10,585,832\nReconciliation of Cash and Cash Equivalents Per Balance Sheet\nCash and equivalents\n884,943\n1,019,465\nCash reserved for capital improvements\n8,407,996\n9,566,367\nCash and cash equivalents per statement of cash flows\n9,292,939\n10,585,832\nSchedule of payments of interest and taxes\nCash paid for income tax\n$\n400,000\n$\n1,127,000\nCash paid for interest\n$\n14,532\n$\n11,849\nSupplemental schedule of non-cash activities\nNet of unrealized holdings gain on available-for-sale\nInvestment securities\n$\n34,814\nThe accompanying notes are an integral part of these financial statements.\nPismo Coast Village Notes to Financial Statements September 30, 2023, and 2022 Note 1: Nature of Business\nPismo Coast Village, Inc. (the Company) is a recreational vehicle camping resort. Its business is seasonal in nature with the fourth quarter, the summer, being its busiest and most profitable.\nNote 2: Summary of Significant Accounting Policies\nRevenue from Contracts with Customers\nThe Financial Accounting Standards Board (FASB) issued new guidance that created Topic 606, Revenue from Contracts with Customers, in the Accounting Standards Codification (ASC). Topic 606 supersedes the revenue recognition requirements in FASB ASC 605, Revenue Recognition, and requires the recognition of revenue when promised goods or services are transferred to customers in an amount that reflects the consideration to which an entity expects to be entitled in exchange for those goods or services. The new guidance also added Subtopic 340-40, Other Assets and Deferred Costs-Contracts with Customers, to the ASC to require the deferral of incremental costs of obtaining a contract with a customer. The cumulative impact of adopting FASB ASC 606 was immaterial and did not require an adjustment to retained earnings.\nRevenue primarily consists of recreational camping space rentals, revenue from recreational vehicle storage space, food and beverage sales and other ancillary goods and services. Revenue is recognized when spaces are occupied or goods and services have been delivered or rendered, respectively.\nSales taxes assessed by a governmental authority that are both imposed on and concurrent with a specific revenue- producing transaction, that are collected by the Company from a customer, are excluded from revenue. Finally, the Company collects Transient Occupancy Taxes (TOT) and Tourism Business Improvement District (TBID) assessments from guests which are remitted to the City of Pismo Beach and County of San Luis Obispo and are excluded from revenues. At September 30, 2023, and 2022, the Company had $80,443 and $84,860 in TOT and TBID assessments due to the City of Pismo Beach and the County of San Luis Obispo included in accrued expenses on the combined balance sheet, respectively.\nPerformance Obligations\nFor performance obligations related to the Company accommodations and other ancillary goods and services, control transfers to the customer at a point in time. The Companys principal terms of sale occur simultaneously when control of the goods and services are transferred to the customer and payment is accepted. The Company does not have any significant financing components.\nThe Company does not disclose the value of unsatisfied performance obligations for contracts with an expected length of one year or less. Due to the nature of the business, the Companys revenue is not significantly impacted by refunds. Cash payments received in advance of guests staying at the resort are refunded to guests if the guest cancels within the specified time period, before any services are rendered. Refunds related to services are generally recognized as an adjustment to the transaction price at the time the resort stay occurs or services are rendered.\nDisaggregation of Revenue\nRevenue from performance obligations satisfied at a point in time consists of sales related to the Company accommodations and other ancillary goods and services at the location in Pismo Beach, California. The geographic nature of the revenue could affect the nature, timing, amount and uncertainty of revenue and cash flows. Revenue from site rentals, storage rental, spotting, and store and accessory sales accounts for approximately 66%, 15%, 5%, and 10% of the Company total revenue for the period ended September 30, 2023, respectively. Revenue from other ancillary goods and services accounts for the remaining 4% of revenue for the period ended September 30, 2023.\nPismo Coast Village, Inc.\nNotes to Financial Statements\nSeptember 30, 2023, and 2022\nNote 2: Summary of Significant Accounting Policies (Continued)\nCustomer Deposits\nThe Company does not recognize revenue when a customer prepays for resort accommodation. Rather, the Company records a deferred revenue liability equal to the amount received. Revenue is then recognized when the customer stays at the resort. As of September 30, 2023, and 2022, the Company had Customer deposits related to prepaid village accommodations was $2,084,012 and $2,268,627 on the balance sheet as rental deposits, respectively.\nCash and Cash Equivalents\nFor the purposes of the statement of cash flows, the Company considers all highly liquid investments including certificates of deposit with an original maturity of three months or less when purchased to be cash equivalents. As of September 30, 2023, and 2022, the Company had $2,511 and $6,089 of cash equivalents.\nCash Reserved for Capital Improvements and Deferred Maintenance\nThe Company keeps separate funds reserved for capital improvements and deferred maintenance. Historically, the Company has not carried a high amount of debt; this separate reserve is kept in order to self-finance major improvement and have cash ready upon project permit approval.\nAllowance for Doubtful Accounts\nIt is the policy of management to review the outstanding accounts receivable at year-end, as well as historical bad debt write-offs, and establish an allowance for doubtful accounts for estimated uncollectible accounts. Management did not believe an allowance for doubtful accounts was necessary as of September 30, 2023, or 2022.\nInventories\nInventories have been valued at the lower of cost or market on a first-in, first-out basis. Inventories are comprised primarily of finished goods in the general store.\nProperty and Equipment\nAll property and equipment are recorded at cost. Depreciation of property and equipment is computed using the straight-line method based on the cost of the assets, less allowance for salvage value, where appropriate.\nDepreciation rates are based upon the following estimated useful lives:\nBuilding and resort improvements\n5 to 40 years\nFurniture, fixtures, equipment, and leasehold improvements\n5 to 31.5 years\nTransportation equipment\n5 to 10 years\nEarnings Per Share\nThe earnings per share are based on the 1,774 shares issued and outstanding. The financial statements report only basic earnings per share, as there are no potentially dilutive shares outstanding.\nPismo Coast Village, Inc.\nNotes to Financial Statements\nSeptember 30, 2023, and 2022\nNote 2: Summary of Significant Accounting Policies (Continued)\nUse of Estimates\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States of America requires the Company to make estimates and assumptions that affect certain reported amounts and disclosures. Accordingly, actual results could differ from those estimates.\nAdvertising\nThe Company follows the policy of charging the costs of non-direct advertising as incurred. Advertising expenses was\n$70,709 and $58,944 for the years ended September 30, 2023, and 2022, respectively. Advertising expenses were included in operating expenses on the statement of operations.\nConcentration of Credit Risk\nAt September 30, 2023, and 2022, the Company had cash deposits of $417,269 and $552,851 in excess of the $250,000 federally insured limit with Pacific Premier Bank, respectively. However, because Pacific Premier Bank is a member of the Certificate of Deposit Account Registry Service (CDARS), large deposits are divided into smaller amounts and placed with other FDIC insured banks which are also members of the CDARS network. Then, those member banks issue CDs in amounts under $250,000, so that the entire deposit balance is eligible for FDIC insurance. Due to large fluctuations in the Operating checking account, there may be times when the balance is above the $250,000 FDIC threshold.\nIncome Taxes\nThe Company uses the asset-liability method of computing deferred taxes in accordance with Accounting Standards Codification (ASC) Income Taxes topic. ASC 740 requires, among other things, that if income is expected for the entire year, but there is a net loss to date, a tax benefit is recognized based on the annual effective tax rate.\nFASB ASC 740 also requires, among other things, the recognition and measurement of uncertain tax positions based on a \"more likely than not\" (likelihood greater than 50%) approach. As of September 30, 2023, management has considered its tax positions and believes that the Company did not maintain any uncertain tax positions under this approach and, accordingly, all tax positions have been fully recorded in the provision for income taxes. It is the policy of the Company to consistently classify interest and penalties associated with income tax expense separately from the provision for income taxes, and accordingly no interest or penalties associated with income taxes have been included in this calculation, or separately in the Statement of Operations and Retained Earnings. The Company does not expect any material changes through September 30, 2024. Although the Company does not maintain any uncertain tax positions, tax returns remain subject to examination by the Internal Revenue Service for fiscal years ending on or after September 30, 2018, and by the California Franchise Tax Board for fiscal years ending on or after September 30, 2017.\nInvestments\nInvestments in securities have been classified in the balance sheet, according to managements intent, as securities available-for-sale under the provisions of Financial Accounting Standards Board (FASB) Accounting Standards modification (ASC) Topic 320 Investments - Debt and Equity Securities. Available-for-sale securities consist of investment securities not classified as trading securities nor as held-to-maturity securities. Unrealized holding gains and losses, net of deferred taxes,\nPismo Coast Village, Inc.\nNotes to Financial Statements\nSeptember 30, 2023, and 2022\nNote 2: Summary of Significant Accounting Policies (Continued)\navailable-for-sale securities are reported as a net amount in a separate component of stockholders equity until realized. Gains and losses on the sale of available-for-sale securities are determined using the specification method.\nFair Value Measurements\nThe Company records its financial assets and liabilities at fair value in accordance with the Fair Value Measurements and Disclosures Topic of Financial Accounting Standards Board (FASB) Accounting Standards Codification (ASC) (the Topic).\nThis Topic provides a framework for measuring fair value, clarifies the definition of fair value and expands disclosures regarding fair value measurements. Fair value is defined as the price that would be received to sell an asset or paid to transfer a liability (an exit price) in an orderly transaction between market participants at that reporting date. The Topic also establishes a three-tier hierarchy, as follows, which prioritizes the inputs used in the valuation methodologies in measuring fair value.\nLevel 1: Inputs to the valuation methodology are unadjusted quoted prices for identical assets or liabilities in active markets that the Company has the ability to access.\nLevel 2: Inputs to the valuation methodology include:\nQuoted prices for similar assets and liabilities in active markets.\nQuoted prices for identical or similar assets or liabilities in active markets.\nInputs other than quoted prices that are observable for the asset or liability.\nInputs that are derived principally from or corroborated by observable market data by correlation or other means.\nIf the asset or liability has a specified (contractual) term, the Level 2 input must be observable for substantially the full term of the asset or liability.\nLevel 3: Inputs to the valuation methodology are unobservable and significant to the fair value measurement. The following is a description of the valuation methodologies used for assets measured at fair value:\nInvestments: Investments in US Treasury Bills are recorded at fair value based upon quoted market prices using Level 1 input.\nThe hierarchy requires the Company to use observable market data, when available, and to minimize the use of unobservable inputs when determining fair value.\nAt September 30, 2023, the following sets forth by level, within the fair value hierarchy, the Companys assets at fair value:\nSeptember 30, 2023\nLevel 1\nLevel 2\nLevel 3\nInvestment in US Treasury Bill\n$\n1,042,140\n$\n-\n$\n-\nTotal assets at fair value\n$\n1,042,140\nPismo Coast Village, Inc.\nNotes to Financial Statements\nSeptember 30, 2023, and 2022\nNote 2: Summary of Significant Accounting Policies (Continued)\nLeases\nOn October 1, 2022, the Company adopted Accounting Standards Update (ASU) No. 2016-02, Leases (Topic 842), using the optional transition method, which allowed the application of the new standard at the adoption date and the recognition of a cumulative-effect adjustment to the opening balance of retained earnings in the period of adoption without adjusting previously reported results. As a result, the Companys financial statements for periods prior to September 30, 2022, have not been revised to reflect the new lease accounting guidance.\nIn adopting ASC Topic 842, the Company elected the package of practical expedients permitted under the transition guidance within the new standard. This package allowed the Company to carry forward historical lease classifications, to not reassess whether any expired or existing contracts are or contain leases, and to not reassess the accounting for initial direct costs for any existing leases.\nThe Company determines if an arrangement is a lease at inception. Operating leases are included in the operating lease right-of-use (ROU) assets, current liabilities, and long-term operating lease liabilities in the balance sheet. Finance leases are included in property and equipment, current liabilities, and long-term finance lease liabilities in the balance sheet. ROU assets represent the Companys right to use an underlying asset for the lease term and lease liabilities represent the Companys obligation to make lease payments arising from the lease. ROU assets and liabilities are recognized at the lease commencement date based on the present value of lease payments over the lease term. For determining the present value of lease payments, the Company uses the discount rate implicit in the lease when readily determinable. As most of the Companys leases do not provide an implicit rate, the Company uses an incremental borrowing rate in determining the present value of lease payments that approximates the rate of interest the Company would have to pay to borrow on a collateralized basis over a similar term. At adoption, the ROU asset also includes any lease payment made and excludes lease incentives and initial direct costs. The Companys lease terms may include options to extend or terminate the lease when it is reasonably certain that the Company will exercise that option. Lease expense for lease payments is recognized on a straight-line basis over the lease term.\nThe Company evaluates contracts to determine if they contain a lease at inception. The Companys material leases primarily consist of vehicles. In accordance with GAAP, the Company classifies leases as operating or finance leases for financial reporting purposes, beginning at the lease commencement date. The lease term used in the classification includes the non-cancelable period for which the Company has the right to use the underlying asset, along with renewal option periods when the exercise of the renewal option is reasonably certain and failure to exercise such option would result in an economic penalty.\nThe Company has elected to account for short-term leases, those with a lease term of 12 months or less, by recognizing lease payments in profit and loss on a straight-line basis over the term of the lease, and variable lease payments in the period in which the obligation for the payments is incurred. This accounting policy selection has been made consistently for all short-term leases within the same asset class. The Company records operating rent expense on a straight-line basis beginning on the lease commencement date (when the Company takes possession of the premises) and ends on the lease termination date. For finance leases, the lease liability is unwound using the effective interest rate method, where interest expense is recognized over the lease term. The right-of-use asset is amortized on a straight-line basis over the shorter of the lease term or the useful life of the underlying asset. Maintenance, insurance, and property tax expenses are accounted for on an accrual basis as variable lease costs. Variable lease costs for operating leases are recognized in the period when changes in facts and circumstances on which the variable lease payments are based occur. For more information on the Companys lease arrangements, refer to Note 5 - Lease.\nPismo Coast Village, Inc.\nNotes to Financial Statements\nSeptember 30, 2023, and 2022\nNote 3: Property and Equipment\nAt September 30, 2023, and 2022, property and equipment included the following:\nLand\n$\n11,608,707\n$\n10,394,747\nBuilding and resort improvements\n13,262,158\n13,174,590\nFurniture, fixtures, equipment, and leasehold improvements\n895,394\n870,440\nTransportation equipment\n979,354\n959,978\nConstruction in progress\n149,714\n87,589\n26,895,327\n25,487,344\nLess accumulated depreciation and amortization\n(10,883,412)\n(10,456,244)\nProperty and Equipment, Net\n$\n16,011,915\n$\n15,031,100\nDepreciation and amortization expenses were $460,132 and $479,314 for the years ended September 30, 2023, and 2022, respectively.\nAt September 30, 2023, and 2022 the cost of assets under finance lease was $434,573 and $405,819, respectively, and related accumulated amortization was $385,311 and $331,071, respectively. Amortization expenses on assets under finance lease was $54,240 and $63,678 for the years ended September 30, 2023, and 2022, respectively.\nNote 4: Line of Credit\nThe Company has a revolving line of credit with Pacific Premier Bank (formerly Heritage Oaks Bank) for $500,000, expiring April 1, 2024. There was no outstanding balance on the line of credit as of September 30, 2023, or 2022.\nPismo Coast Village, Inc.\nNotes to Financial Statements\nSeptember 30, 2023, and 2022\nNote 5: Leases - Lessee\nDisclosure Subsequent to the Adoption of the New Lease Accounting Standard (ASU 2016-02). At September 30, 2023, and 2022, finance lease obligations consisted of the following:\nA 2016 Hino truck leased from Donahue Transportation Services Corp,\npayable in monthly installments of $1,257, including interest at 4.532%\nper annum, through December 2024.\n$\n19,483\n$\n2,837\nA 2018 Hino truck leased from Donahue Transportation Services Corp,\npayable in monthly installments of $1,154, including interest at 4.644%\nper annum, through August 2024.\n11,366\n24,358\nA 2019 Hino truck leased from Donahue Transportation Services Corp,\npayable in monthly installments of $1,162, including interest at 4.181%\nper annum, through March 2025.\n19,525\n32,364\nA 2019 Hino truck leased from Donahue Transportation Services Corp,\npayable in monthly installments of $1,151, including interest at 4.101%\nper annum, through September 2025.\n27,044\n39,482\nA 2020 Hino truck leased from Donahue Transportation Services Corp,\npayable in monthly installments of $1,166, including interest\nat 5.406% per annum, through May 2027.\n46,445\n57,597\n$\n123,863\n156,638\nLess current portion\n(63,978)\n(52,256)\nTotal non-current finance lease obligations\n$\n59,885\n104,382\nThe following table is a summary of the components of the net lease cost for the years ended September 30, 2023, and 2022, respectively.\nFinance lease cost\nAmortization of ROU assets\n$\n54,240\n$\n63,678\nInterest on lease liabilities\n4,956\n7,589\nTotal finance lease cost\n$\n59,196\n$\n71,267\nPismo Coast Village, Inc.\nNotes to Financial Statements\nSeptember 30, 2023, and 2022\nNote 5: Leases - Lessee (Continued)\nSupplemental cash flow information related to leases for the years ended September 30, 2023, and 2022 are as follows.\nCash paid for amounts included in the measurement of\nlease liabilities\nFinancing cash flows paid for principal portion of\nfinance leases\n$\n61,529\n$\n60,757\nSupplemental balance sheet information related to leases September 30, 2023, and 2022 are as follows.\nSeptember 30\nSeptember 30\nFinance leases:\nProperty and equipment, gross\n$\n434,573\n$\n405,819\nAccumulated amortization\n(385,311)\n(331,071)\nProperty and equipment net\n$\n49,262\n$\n74,748\nCurrent portion of long-term liabilities\n$\n63,978\n$\n52,256\nLong-term liabilities, less current portion\n59,885\n104,382\nTotal finance liabilities\n$\n123,863\n$\n156,638\nWeighted average remaining lease term\nFinance leases\n1.87 years\n3.16 years\nWeighted average discount rate\nFinance leases\n4.69%\n4.69%\nPismo Coast Village, Inc.\nNotes to Financial Statements\nSeptember 30, 2023, and 2022\nNote 5: Leases - Lessee (Continued)\nThe following table summarized the maturity of the lease liabilities at September 30, 2023.\nFor the Twelve Months Ending September 30\nFinance Lease\n$\n68,458\n39,643\n13,992\n9,328\n-\nThereafter\n-\nTotal minimum lease payments\n131,421\nLess amount representing interest\n(7,558)\nPresent value of lease payments\n123,863\nLess current portion\n(63,978)\nFinance lease obligations, net of current portion\n$\n59,885\nNote 6: Leases - Lessor\nOn April 1, 2023, the Company amended an operating lease agreement for a Billboard located in Santa Maria, CA. The lease is a 10-year lease, expiring May 30, 2033. The lease calls for annual income of $12,536 for years 1 to 5 and will increase to $15,036 per year for years 6 to 10.\nThe following table summarizes the future operating lease income.\nFor the Twelve Months Ending\nSeptember 30\n$\n12,536\n12,536\n12,536\n12,536\n12,536\nThereafter\n75,180\n$\n137,860\nOn May 1, 2023, the Company entered into an operating lease agreement for commercial building space at 180 S. Dolliver St., Pismo Beach, CA 93449. The lease is a 10-year lease, expiring May 30, 2033, and calls for monthly income of $3,075. Commences May 1, 2023.\nThe following table summarizes the future operating lease income.\nFor the Twelve Months Ending\nSeptember 30\n$\n36,900\n36,900\n36,900\n36,900\n36,900\nThereafter\n169,125\n$\n353,625\nPismo Coast Village, Inc.\nNotes to Financial Statements\nSeptember 30, 2023, and 2022\nNote 6: Leases - Lessor (Continued)\nOn May 1, 2023, the Company entered into an operating lease agreement for commercial building space at 2096 Nipomo St., Oceano, CA 93445. The lease is a 10-year lease, expiring May 30, 2033, and calls for monthly income of $6,200. Commences May 1, 2023.\nThe following table summarizes the future operating lease income.\nFor the Twelve Months Ending\nSeptember 30\n$\n74,400\n74,400\n74,400\n74,400\n74,400\nThereafter\n341,000\n$\n713,000\nNote 7: Common Stock\nEach share of stock is intended to provide the shareholder with free use of the resort for a maximum of 45 days per year. If the Company is unable to generate sufficient funds from the public, the Company may be required to charge shareholders for services.\nA shareholder is entitled to a pro rata share of any dividends as well as a pro rata share of the assets of the Company in the event of its liquidation or sale. The shares are personal property and do not constitute an interest in real property. The ownership of a share does not entitle the owner to any interest in any particular site or camping period.\nNote 8: Income Taxes\nThe provisions for income taxes for the years ended September 30, 2023, and 2022 are as follows:\nCurrent:\nFederal\n$\n229,500\n$\n524,500\nState\n98,600\n218,500\n$\n328,100\n$\n743,000\nDeferred:\nFederal\n$\n4,600\n$\n(12,900)\nState\n9,900\n(5,400)\n14,500\n(18,300)\nProvision for income taxes\n$\n342,600\n$\n724,700\nThe Company uses the asset-liability method of computing deferred taxes in accordance with FASB ASC Topic 740. The difference between the effective tax rate and the statutory tax rates is due primarily to the impact of state taxes net of the federal tax benefit and nondeductible variable costs of shareholder usage.\nPismo Coast Village, Inc.\nNotes to Financial Statements\nSeptember 30, 2023, and 2022\nNote 8: Income Taxes (Continued)\nAt September 30, 2023, and 2022, the deferred income tax liabilities consisted of the following:\nDeferred tax assets (liabilities):\nFederal\n$\n(382,400)\n$\n(377,800)\nState\n(57,000)\n(47,100)\nNet deferred income taxes\n$\n(439,400)\n$\n(424,900)\nDeferred income taxes arise from temporary differences between the tax basis of assets and liabilities and their reported amounts in the financial statements, which will result in taxable or deductible amounts in the future. The majority of the balance is due to timing differences of depreciation expense, caused by the use of accelerated depreciation methods for tax calculations.\nAt September 30, 2023, and 2022, the deferred income tax liabilities consisted of the following temporary differences:\nDepreciation\n$\n(478,800)\n$\n(525,400)\nUnrealized gain on investments\n-\n-\nTotal gross deferred tax\nliabilities\n(478,800)\n(525,400)\nVacation accrual\n34,400\nFederal benefit of state taxes\n38,700\n66,100\nTotal gross deferred tax assets\n39,400\n100,500\n$\n(439,400)\n$\n(424,900)\nThere were no net operating loss or tax credit carryforwards for the year ended September 30, 2023, or 2022 for federal or state.\nNote 9: Employee Retirement Plans\nThe Company is the sponsor of a 401(k)-profit sharing pension plan, which covers substantially all full-time employees. Employer contributions are discretionary and are determined on an annual basis. The Companys matching portion of the 401(k) safe harbor plan was $93,769 and $73,679 for the years ended September 30, 2023, and 2022, respectively.\nNote 10: Subsequent Events\nEvents subsequent to September 30, 2023, have been evaluated through December 13, 2023, which is the date the financial statements were available to be issued. Management did not identify any subsequent events that required disclosure.\nSupplementary Information\nPismo Coast Village, Inc.\nSchedule of Operating Expenses\nSeptember 30, 2023, and 2022\nAdministrative salaries\n$\n708,278\n$\n731,182\nAdvertising and promotion\n70,709\n58,944\nAuto and truck expense\n150,815\n164,520\nBad debts\n4,042\n1,042\nContract services\n49,033\n68,703\nCorporation expense\n95,455\n47,361\nCustodial supplies\n39,017\n39,133\nDirect labor\n2,474,450\n2,405,668\nEmployee travel and training\n95,861\n34,648\nEquipment lease\n6,254\n5,389\nInsurance\n1,040,034\n643,325\nMiscellaneous\n197,596\n109,420\nOffice supplies and expense\n177,312\n101,991\nPayroll tax expense\n256,598\n223,849\nPayroll service\n62,169\n47,042\nPension plan match\n93,769\n73,679\nProfessional services\n158,104\n121,634\nProperty taxes\n245,745\n215,930\nRecreational supplies\n17,118\n3,521\nRent - storage lots\n55,591\n53,011\nRepairs and maintenance\n283,783\n283,124\nRetail operating supplies\n16,857\n5,653\nSecurity\n2,682\n14,808\nService charges\n297,327\n354,231\nTaxes and licenses\n14,622\n11,343\nTelephone\n40,383\n34,371\nUniforms\n48,285\n32,225\nUtilities\n850,962\n852,252\nTotal operating expenses\n$\n7,552,851\n$\n6,737,999\nNo assurance is provided on these financial statements.\nINDEPENDENT AUDITORS REPORT\nON SUPPLEMENTARY INFORMATION\nTo the Board of Directors and Shareholders\nPismo Coast Village, Inc.\nWe have audited the financial statements of Pismo Coast Village, Inc. (the Company) as of and for the years ended September 30, 2023, and 2022, and our reports thereon dated December 13, 2023, which expressed an unqualified opinion on those financial statements, appears on page 16. The supplementary information contained in Statements of Operations for the Three Months Ended September 30, 2023, and 2022, has been subjected to audit procedures performed in conjunction with the audit of the Companys financial statements. The supplementary information is the responsibility of the Companys management. Our audit procedures included determining whether the supplementary information reconciles to the financial statements or the underlying accounting and other records, as applicable, and performing procedures to test the completeness and accuracy of the information presented in the supplementary information. In forming our opinion on the supplementary information, we evaluated whether the supplementary information, including its form and content, is presented in conformity with accounting principles generally accepted in the United States of America. In our opinion, the supplementary information is fairly stated, in all material respects, in relation to the financial statements as a whole.\nBROWN ARMSTRONG\nACCOUNTANCY CORPORATION\nBakersfield, California\nDecember 13, 2023\nPismo Coast Village, Inc.\nStatements of Operations\nThree Months Ended September 30, 2023, and 2022\nIncome:\nResort operations\n$\n2,558,576\n$\n2,630,835\nRetail operations\n248,680\n380,368\nOperating Lease Income\n66,559\n380,368\nTotal income\n2,873,815\n3,011,203\nCosts and expenses:\nOperating expenses\n2,106,120\n2,174,497\nCost of goods sold\n134,996\n185,083\nDepreciation\n95,446\n121,964\nTotal costs and expenses\n2,336,562\n2,481,544\nIncome from operations\n537,253\n529,659\nOther income (expense):\nOther income(expense)\nInterest income\n49,822\nInterest expense\n3,787\n(3,077)\nTotal other income (expense)\n53,609\n(2,901)\nIncome before provision for income taxes\n590,862\n526,758\nProvision for income tax\n475,100\n1,227,300\nNet profit\n$\n115,762\n$\n(700,542)\nNet Profit per share\n$\n65.25\n$\n(394.89)\nPismo Coast Village, Inc. 2022-2023 ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nThere has been no change of accountants, nor any disagreement with accountants, on any matter of accounting principle, practices, or financial statement disclosures required to be reported under this item. ITEM 9A(T). CONTROLS AND PROCEDURES\nDISCLOSURE CONTROLS AND PROCEDURES\nDisclosure controls and procedures are controls and other procedures that are designed to ensure that information required to be disclosed in our reports, filed, or submitted under the Securities Exchange Act, is recorded, processed, summarized, and reported, within the time periods specified in the Securities and Exchange Commission's rules and forms. Disclosure controls and procedures include, without limitation, controls and procedures designed to ensure that information required to be disclosed in our reports filed under the Exchange Act is accumulated and communicated to management, including our principal executive officer and our principal financial officer, as appropriate, to allow timely decisions regarding required disclosure.\nOur management, under the direction of our Chief Executive Officer and Chief Financial Officer (who is our principal accounting officer), has evaluated the effectiveness of our disclosure controls and procedures as required by Exchange Act Rule 13a-15(b) as of September 30, 2023 (the end of the period covered by this report). Based on that evaluation, our principal executive officer and our principal accounting officer concluded that these disclosure controls and procedures were effective as of such a date.\nINTERNAL CONTROL OVER FINANCIAL REPORTING\nOur management is also responsible for establishing internal control over financial reporting (\"ICFR\") as defined in Rules 13a-I5(f) and 15(d)-15(f) under the 1934 Act. Our ICFR is intended to be designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with accounting principles generally accepted in the United States of America. Our ICFR is expected to include policies and procedures that management believes are necessary that:\n1. pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the Company.\n2. provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the Company are being made only in accordance with authorizations of management and our directors; and\n3. provide reasonable assurance regarding the prevention or timely detection of unauthorized acquisition, use or disposition of the Company's assets that could have a material effect on the financial statements.\nManagement recognizes that there are inherent limitations in the effectiveness of any system of internal control, and accordingly, even effective internal control can provide only reasonable assurance with respect of financial statement preparation and may not prevent or detect misstatements. In addition, effective internal control at a point in time may become ineffective in future periods because of changes in conditions or due to deterioration in the degree of compliance with our established policies and procedures.\nAs of September 30, 2023, management assessed the effectiveness of the Company's internal control over financial reporting (ICFR) based on the criteria for effective ICFR established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) and SEC guidance on conducting such assessments by smaller reporting companies and non-accelerated filers. Based on that assessment, management concluded that, during the period covered by this report, such internal controls and procedures were ineffective as of September 30, 2023. The Management and Interim Audit Chairperson will be analyzing procedures and staff to evaluate where changes need to be made.\nPismo Coast Village, Inc. 2022-2023\nThis Annual Report does not include an attestation report of our independent registered public accounting firm regarding internal control over financial reporting. The managements report was not subject to attestation by our independent registered public accounting firm pursuant to temporary rules of the SEC that permit us to provide only the managements report in this Annual Report.\nThere were no changes in our internal control over financial reporting during the fiscal year ended September 30, 2023, that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. ITEM 9B. OTHER INFORMATION\nNo disclosure is required under this item.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS, AND CORPORATE GOVERNANCE\na. The Company's Directors were chosen at the Shareholders Annual Meeting held January 21, 2023. The Directors serve for one year, or until their successors are elected. The names, ages, background, and other information concerning the Directors, including other offices held by the Directors with the Company, are set forth below.\nThe following is a list of the Company's Directors and Executive Officers setting forth their functions and experience. There is no understanding or agreement under which the Directors hold office.\nDAVID BESSOM, Director\nAged 75\nDavid Bessom attended Bakersfield Jr. College in Bakersfield, CA, receiving an associate in arts degree in 1968. That Summer he started working for the Santa Fe Railroad as a brakeman, and in the Fall started attending San Jose State College. He received a Bachelor of Arts degree in 1970 while continuing to work in the railroad industry. Mr. Bessom was employed with the Santa Fe Railroad for 42 years, of which approximately 14 years of that time he was as a full-time elected representative for the Conductors, Brakeman, and Yardman for the states of California, Arizona and New Mexico. He retired in the Fall of 2008. He and his wife, Linda, were married in 1999, currently reside in Huntington Beach, CA, and have four sons between them. Mr. Bessom has served on the Board of Directors since November 2017.\nSAM BLANK, Director\nAged 78\nSam Blank served as a public-school teacher and administrator for more than 30 years. He earned Associate, Bachelors, Masters, and Doctoral degrees from Citrus College, CSU Fullerton, Whittier College, and Brigham Young University, respectively. He holds lifetime California teaching and administrative credentials. Dr. Blank began his career in 1967 as a middle school teacher in the West Covina USD. He soon became an assistant principal in neighboring Charter Oak USD. In 1979, he joined Poway USD, where he served as principal of elementary and middle schools until he retired in 2001. He has been principal of schools that received California Distinguished Schools and National Blue-Ribbon Schools honors. Following his retirement from public education, Dr. Blank obtained a real estate salesperson license and is currently affiliated with Coldwell Banker Realty. He and his wife, Bonnie, have been married since 1968 and have resided in Escondido since 1979. Bonnie is also retired with more than 25 years of service as a teacher and high school counselor. Their married daughter and two grandsons live in the North Bay Area. Dr. Blank has served on the Environmental, Health & Safety, Finance, Audit, and Operations Committees. He has served on the Board of Directors since November 2016.\nHARRY BUCHAKLIAN, Director\nAged 91\nHarry Buchaklian has a B.A. degree from California State University, Fresno, in industrial arts, a secondary level teaching credential in laboratory electronics and small engine repair. His career included employment as an assistant manager with Western Auto Stores, electronics instructor at Fresno Technical College. At Sears, he managed the Television Department, high tech center, mechanical shop, and was responsible for thirty-four technicians. He retired from Sears Roebuck in 1994. He has been a member of the Board from March 1981 to January 1992, from September 1995 to present, serving one year as Executive VP, and as a chairman of the Policy, Audit and Environmental, Health and Safety Advisory Committees.\nPismo Coast Village, Inc. 2022-2023\nSUZANNE COLVIN, Director\nAged 60\nMs. Colvin has over 25 years financial leadership experience in rapidly growing, global, industry-leading technology companies, both public and private. She is currently Chief Financial Officer at PLACE Inc., a full-service real estate and technology platform that provides best of class back-office support to the top real estate teams. Previously, she was CFO of Egnyte, an industry leading software as a service company that provides content security and governance, and she was CFO at Napster (NASDAQ: NAPS), the first digital music subscription service. Ms. Colvin began her career as an independent auditor at Price Waterhouse, is a Certified Public Accountant and has a bachelors degree in business with a concentration in Accounting from Cal Poly San Luis Obispo. Ms. Colvin lives in San Jose, California and has been a Pismo Coast Village shareholder for sixteen years.\nRODNEY ENNS, Director, and Vice President - Operations\nAged 70\nRodney Enns has a B.S. degree in computer engineering from California State University, Fresno, and a secondary math teaching credential from the State of California. He was president, owned and operated, Ennsbrook Ent., an incorporated poultry enterprise, from 1975 to 1995. Mr. Enns then worked as an electrical engineer at Voltage Multipliers, Inc., and was promoted to senior engineer before leaving in August 2005. He taught high school mathematics and engineering at Milpitas High School in Milpitas, California from 2005 to June 2022. He has been a member of the Board of Directors since November 2007, and is currently serving as Vice President - Operations.\nWILLIAM FISCHER, Director\nAged 90\nWilliam (Bill) Fischer resides in Camarillo, California. He served four years in the U.S. Air Force during the Korean War, attaining the rank of Staff Sergeant. He is a graduate of California State University, Northridge, with a B.S. degree in accounting. He worked in the aerospace, entertainment, and public utility industries until 1969 when he was hired by Getty Oil Companys corporate office in Los Angeles, California, as an accounting supervisor. Texaco, Inc. acquired Getty Oil in 1985, and he was promoted to Manager of Benefits Plans Accounting and transferred to Houston, Texas. Mr. Fischer was responsible for the Savings/Thrift, 401(k), and ESOP Plans administration until 1989, when he elected early retirement. He was an independent financial consultant to various companies until 2006. Mr. Fischer was also active in residential real estate from 1989 to 1997, and, since 1980, has had an active real estate brokers license. He has been a member of the Knights of Columbus since 1966 when he served as Grand Knight and District Deputy. He looks forward to contributing his financial background to the Board. Mr. Fischer served two years as Executive Vice President and five years as Nominating Committee Chairman. He has been on the Board since January 2002. Mr. Fischer resigned as Director at the September 16, 2023, Board Meeting.\nWAYNE HARDESTY, Director\nAged 90\nWayne Hardesty graduated from Arizona State University in 1955. He was commissioned an Ensign from the Naval Officer Candidate School in Newport, Rhode Island, in 1956, and was immediately assigned to the Navy Area Audit Office in Los Angeles, California, for duty at U.S.C. and General Dynamics-Pomona. He entered civil service in 1959, and remained with the Audit Office until 1973, at which time he became a price analyst for the U.S. Air Force at Norton Air Force Base working on the MX and Minuteman Project. Mr. Hardesty received his MBA from Southern Illinois University in 1980. He retired from civil service in 1988 and became self-employed, primarily in tax preparation for both individual and business returns. He became a licensed Enrolled Agent in 1989 and currently operates Hardesty Financial Services in Rancho Cucamonga, California. Mr. Hardesty has been a member of the Board since September 2008, has served three years as Chairman of the Audit Committee, and has served eight years as Chief Financial Officer and Vice President - Finance and as Chair of the Finance Committee.\nTERRIS HUGHES, Director\nAged 74\nTerris (Terry) Hughes holds an A.A. degree from Bakersfield Junior College in California in police science. He was employed by Belridge/Shell Oil for twenty-three years, from 1973 to 1997, holding the position of senior training technician for the last ten years of that time. He was employed as an internal consultant for Aera Energy LLC, an oil industry company formed in 1997 between the Shell Oil and Mobil Oil Corporations. His duties were to serve as a behavior base safety advisor and provide safety training to Aera Energy LLC employees. He retired from Aera Energy LLC on December 31, 2014. Mr. Hughes then opened his own business entitled Saf-T-Treasures and travels the country providing safety and motivational presentations to employees of various industries. He has been a member of the Board since January 1996, has served one year as Vice President - Policy, three years as Executive Vice President, and five years as President.\nPismo Coast Village, Inc. 2022-2023\nMARCUS JOHNSON, Director\nAged 70\nMarcus Johnson (Marc) has spent his entire career as an educator in the Central Valley of California. For sixteen years he taught, then spent the next twenty-one years in leadership roles, retiring in 2013 from the Sanger Unified School District, where he spent fourteen years, with twelve of those years as Superintendent. Currently, he serves as the K-12 Liaison with the Central Valley Higher Education Consortium and is also the Executive Director of the Fresno Compact in Fresno, California. In addition to those roles, Mr. Johnson does consult with schools and districts nationally, and is a published author as well. He has been married to his wife, Penni, for forty-six years, and they currently reside in Wildwood Island in Sanger, California. They have three children and nine grandchildren. Mr. Johnson has been a member of the Board since November 2018.\nKAREN KING, Director, and Executive Vice President\nAged 65\nKaren King studied business finance and management at California Lutheran University in Thousand Oaks, California, and at the University of Phoenix. From 1991 to 2006, she was employed as Director of Credit Risk and Underwriting Management, Credit Risk Manager, Customer Account Team Lead Underwriting and Quality Control, and as Desktop Underwriter Technology Instructor with Fannie Mae, and, from 2006 to 2008, she was employed with PMI Mortgage Insurance Company as Vice President, National Account Operations in Walnut Creek, California. In June 2008, Mrs. King and her family relocated to Camarillo, California, where she was employed until December 2009 as a sales agent for Camarillo Properties, a local real estate brokerage firm. In December 2009, she accepted employment with Bank of America, and held the positions of Vice President - Investor Audit, Vice President - Executive Customer Relations, Office of the CEO, and Vice President - Operations Risk. She left Bank of America in September 2015 when she was hired by Wells Fargo Bank as Vice President, Operations Risk Consultant. Since 2014, Ms. King has served on the Camarillo Ranch Foundation Board as Community Relations Chairperson. She has also been involved with the Camarillo City Ambassadors, the Camarillo Council on Aging, and the Ventura County Council on Aging, representing the City of Camarillo. Mrs. King has been a member of the Board of Directors since November 2016, and is currently serving as the Vice President - Secretary.\nGARRY NELSON, Director\nAged 73\nGarry Nelson is a graduate of Cal Poly University, San Luis Obispo, California, and has been involved in agriculture for more than forty years. From 2003 until his retirement in 2014, he was employed as the General Manager of Vintage Nurseries in Wasco, California, a company that specializes in grapevines. Prior to his employment at Vintage Nurseries, he was vice president and chief operating officer for Belridge Farms for many years. Mr. Nelson was a member of the Shafter City Council for twenty years, serving as mayor for eight of those years. He also serves on the board of Bakersfield Memorial Hospital Foundation and has served on numerous agricultural industry boards. Mr. Nelson has been a member of the Company's Board of Directors since November 2008, has served four years as Executive Vice President and as Chair of the Personnel and Compensation/Benefits Committee, and is currently serving as President. Mr. Nelson resigned as Director at the September 16, 2023, Board Meeting.\nRONALD NUNLIST, Director\nAged 85\nRonald Nunlist was employed in the oil business for many years. From 1995 to 1997, he was employed as an operations foreman by Cal Resources LLC, an oil industry company owned by Shell Oil Corporation. From 1997 until his retirement in 1999, Mr. Nunlist was employed as a logistics specialist by Aera Energy LLC, an oil industry company formed between the Shell Oil and Mobil Oil Corporations. Mr. Nunlist presently serves as a planning commissioner for the City of Shafter, California. He has been a member of the Board since January 1986, serving ten years as President (1992 to 1997 and from 2011 to 2016), and ten years as Vice President - Operations.\nGEORGE PAPPI, JR., Director and CEO/Executive President\nAged 61\nMr. Pappis current occupation is as a property major case General Adjuster for The Hartford Insurance. Other positions held during his more than thirty years of employment include office manager, property and bodily injury adjustor, fire, and casualty (with extensive construction background), risk management and commercial insurance. He graduated from Cal Poly Pomona with a B.S. in management and human resources. He resides in La Verne, California, and is actively involved in the local community and church activities and the United Way organization. Mr. Pappi has been a member of the Board of Directors since January 2004, has served six years as Vice President - Secretary, and is currently serving as Executive Vice President.\nPismo Coast Village, Inc. 2022-2023\nDWIGHT PLUMLEY, Director\nAged 71\nDwight Plumley attended College of the Sequoias in California, studying electronic engineering and construction real estate. In 1973, he started in the produce equipment industry working for Packers Manufacturing, Inc. as a service and installation supervisor. In 1979, he became employed by Pennwalt Corporation, an international equipment producer, as a project manager and supervisor. Mr. Plumley purchased Packers Manufacturing, Inc. in 1987, and, as President, produces fruit and vegetable packing and processing systems, from small to multimillion-dollar projects, nationwide and internationally. He has also served on the board of directors for Yosemite Bible Camp, a 60-acre facility for up to 350 campers and staff from 1994 to 2006 and served as church deacon from 1984 to 2004. Mr. Plumley has been a member of the Board of Directors since January 2010, and served seven years as Vice President - Operations.\nJERRY ROBERTS, Director\nAged 70\nJerry Roberts has an associate of arts degree in math and science from the College of the Sequoias, Visalia, California; a bachelors degree in biological sciences from the University of the Pacific, Stockton, California; an MBA degree from the Santa Clara University Graduate School of Business, Santa Clara, California; and is licensed by the California State Board of Accountancy as a Certified Public Accountant. He was first licensed in 1982 after fulfilling experience requirements while in the employment of the international accounting firm of Arthur Andersen & Co. Mr. Roberts is currently a partner in the accounting, tax, and consulting firm of Lampros & Roberts, established in 1985. Mr. Roberts has been married to his wife Denise since 1978. They have three sons and currently reside in Los Gatos, California. Mr. Roberts has been a member of the Board since March 2013, and is currently serving as Chair of the Audit Committee. Mr. Roberts resigned as Director at the September 16, 2023, Board Meeting.\nBRIAN SKAGGS, Director\nAged 65\nBrian Skaggs received his Bachelor of Science degree in Civil Engineering in 1980, and, in 1988, received a masters degree in engineering, both degrees from California State University, Fresno. He became a Registered Civil Engineer in the State of California in 1983. In 1980, Mr. Skaggs was hired as Assistant Engineer by Summers Engineering, Inc., was promoted to Civil Engineer in 1983, and in March 1991 was promoted to Senior Civil Engineer and became a partner in the firm. During his time with Summers Engineering, he worked in the field of water resources engineering in the San Joaquin Valley and other areas in California. Mr. Skaggs has been a member, past vice-president, and past president of the American Council of Engineering Companies (ACEC), Sequoia Chapter, and the ACEC Sequoia Chapter was named chapter of the year while he was serving as President. Mr. Skaggs is a member, past vice-president, and current president of the Hanford Fraternal Hall Association; a member, past treasurer, and past president of the Hanford Celebration Committee; and a member and past treasurer of the Kit Carson Volunteer Fire Department. Mr. Skaggs has been a member of the Board of Directors since May 2016, was elected to Vice President - Secretary for 2021, and is currently serving as Chair of the Environmental Health and Safety Committee.\nGARY WILLEMS, Director and Vice President-Secretary\nAged 69\nGary Willems holds a B.A. degree in music education and a California life teaching credential from Fresno Pacific University, as well as a professional clear administrative services credential. Mr. Willems started teaching in 1977 and was a Band Director for thirty years in the Dinuba/Reedley area. He was also Head Marching Band Director of the Reedley High School Band from 1985 to 2007. In 2007, he moved into school administration where he was employed as the Visual and Performing Arts Coordinator and the Administrator of the Dunlap Leadership Academy Charter School (an on-line high school) at Kings Canyon Unified School District. In 2014, Mr. Willems retired from education, and he is now enjoying time with his wife, children, and grandchildren. Mr. Willems has served on the Board of Directors since January 2001, served two years as Vice President - Secretary, and is currently serving as Chair of the Nominating Committee.\nJACK WILLIAMS, Director, Chief Financial Officer, and Vice President - Finance\nAged 73\nMr. Williams graduated from San Diego State University in 1974 with a B.S. in accounting. Following that, he has been employed in the field of accounting in a variety of industries, including agriculture, construction, heavy equipment sales, and manufacturing. He was employed as a financial analyst by Texaco Oil Corporation in the Bakersfield, California, area from 1997 until 1999, and as Chief Financial Officer for Goodwill Industries of South-Central California from March 2000 to November 2004. Mr. Williams was an interim controller for Diversified Utilities Services, a position he held from April 2005 to December 2005. He established his own C.P.A. practice in 1983, which he continues to own and operate. Mr. Williams has been a member of the Board since January 1995, and is currently serving as Chief Financial Officer and Vice President - Finance.\nPismo Coast Village, Inc. 2022-2023\nb. OTHER OFFICERS AND SIGNIFICANT EMPLOYEES\nLESLEY MARR, General Manager and Assistant Corporate Secretary\nAged 57\nLesley Marr is a seasoned hospitality professional with a rich background spanning Marriott, Wyndham, Blackstone Investment Group, and Sun Communities. Recognized for her drive and exceptional results, Lesleys career has seen promotions, operational awards, corporate citizenship recognition and selection to State Industry Organizations. Emphasizing empathy, Lesley advises emerging professionals that leadership is a call to service, prioritizing the needs of others. A Grover Beach resident, she and her husband explore Central Coast delights with their fur babies. Today, Lesley focuses on community development, high-quality operations, and exceptional results for both shareholders and guests, showcasing her commitment to excellence in the hospitality industry. She was elected to serve on the California Outdoor Hospitality Association in 2023 and currently serves as Vice Chair.\nCHARLES AMIAN, Sr. Operations Manager\nAged 57\nCharles Amian has been an integral part of Pismo Coast Village (PCV) since June 1984, starting in the Maintenance Department. Currently serving as Senior Operations Manager since November 2022, he previously held the role of Operations Manager since 1995. His leadership journey includes being elected Board President at the California Association of RV Parks and Campgrounds Annual Convention in March 2001, serving two successful terms. Charles has been actively involved in the industry, contributing to boards such as CalARVC and the Camp-California Marketing Board. He also served fifteen years on the Board of Trustees of REC PAC. Charles is a lifetime-designated Certified Park Operator, demonstrating his commitment to industry standards. Since November 2016, he has been a member of the Board of Directors of the National Association of RV Parks and Campgrounds (ARVC) and currently serves as Vice Chair, reflecting his continued leadership in the organization.\nc. FAMILY RELATIONSHIPS\nThere are no familial relationships between the Directors nor between the Directors and the Officers.\nd. INVOLVEMENT IN CERTAIN LEGAL PROCEEDINGS\nTo the knowledge of the Company, none of the officers or directors have been personally involved in any bankruptcy or insolvency proceedings. To the knowledge of the Company, none of the directors or officers have been convicted in any criminal proceedings (excluding traffic violations and other minor offenses) or are the subject of a criminal proceeding which is presently pending, nor have such persons been the subject of any order, judgment, or decree of any court of\ncompetent jurisdiction, permanently or temporarily enjoining them from acting as an investment advisor, underwriter, broker or dealer in securities, or as an affiliated person, director or insurance company, or from engaging in or continuing in any conduct or practice in connection with any such activity or in connection with the purchase or sale of any security, nor were any of such persons the subject of a federal or state authority barring or suspending, for more than 60 days, the right of such person to be engaged in any such activity, which order has not been reversed or suspended.\ne. AUDIT COMMITTEE FINANCIAL EXPERT\nOur Board of Directors has determined that it does not have a member of its Audit Committee that qualifies as an \"audit committee financial expert\" as defined in Item 401(e) of Regulation S-B and is \"independent\" as the term is used in Item 7(d)(3)(iv) of Schedule 14A under the Securities Exchange Act of 1934, as amended.\nWe believe that the members of our Audit Committee are collectively capable of analyzing and evaluating our financial statements and understanding internal controls and procedures for financial reporting. Due to the fact that the Directors of Pismo Coast Village, Inc. do not receive compensation for the services they provide in that capacity, the Company has been unable to nominate and retain a director with the required expertise to stand for election to the Board of Directors. However, until the time that our Audit Committee has a qualified audit committee financial expert, we believe our engagement of Glenn Burdette (GB), Certified Public Accountants, satisfies this requirement. GB provides the Company's quarterly compilation of the balance sheets and the related statements of income and retained earnings, and cash flows in accordance with Statements on Standards for Accounting and Review Services issued by the American Institute of Certified Public Accountants.\nPismo Coast Village, Inc. 2022-2023\nf. CODE OF ETHICS\nOn November 8, 2003, the Company's Board of Directors adopted the introduction to our code of ethical conduct. After further review, consideration was given to adopting a more comprehensive and detailed Code. At the meeting of the Executive Committee held June 19, 2009, the committee approved a recommendation to present a revised Code of Ethics to the full Board for adoption. At the Board of Directors meeting held July 18, 2009, the Board unanimously approved the revised and complete Code of Ethics that applies to all the Company's employees and directors, including our principal executive officer, principal financial officer, principal accounting officer or controller, and persons performing similar functions.\nThe complete text of the revised Code of Ethics is filed with this Form 10-K as Exhibit 14. In addition, the Company has posted the Code of Ethics on its website, www.pismocoastvillage.com.\nA copy of the Companys Code of Ethics will be provided to any person, without charge, upon written request. Requests for the Companys Code of Ethics should be addressed to:\nMs. Lesley Marr, General Manager\nPismo Coast Village, Inc.\n165 South Dolliver Street\nPismo Beach CA 93449\ng. SECTION 16(a) BENEFICIAL OWNERSHIP REPORTING COMPLIANCE\nSection 16(a) of the Securities Exchange Act of 1934, as amended, requires the Companys directors, officers, and persons who beneficially own more than ten percent of a registered class of our equity securities within specified time periods to file with the SEC initial reports (Form 3) of beneficial ownership and reports of changes (Form 4 and Form 5) in beneficial ownership of Common Stock of the Company. To the Companys knowledge, based solely on a review of the copies of such reports furnished to us and written representations that no other reports were required, all of the Companys officers, directors, and beneficial owners of greater than ten percent of the outstanding Common Stock complied with the Section 16(a) filing requirements for the fiscal year ended September 30, 2023. ITEM 11. EXECUTIVE COMPENSATION STOCK OPTIONS AND STOCK APPRECIATION RIGHTS GRANTED DURING THE LAST FISCAL YEAR\nThis information required by Item 11 is incorporated by reference in the Companys Definitive Proxy Statement for the Annual Meeting of Shareholders to be held January 21, 2023, under the caption Compensation of Directors and Executive Officers. The Definitive Proxy Statement is expected to be filed with the Commission on or before December 14, 2023. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nSECURITIES AUTHORIZED FOR ISSUANCE UNDER EQUITY COMPENSATION PLANS\nNot applicable.\nSECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT\na. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS\nNo person owns beneficially of record more than 5% of the Company's securities.\nb. SECURITY OWNERSHIP OF MANAGEMENT.\nPismo Coast Village, Inc. 2022-2023\nThe following sets forth the securities beneficially owned, directly, by all directors and officers as a group as of September 30, 2023:\nBoard Member\nTitle of Class\n*Amount of\nOwnership\nPercent of Class\nDavid Bessom\nHuntington Beach CA 92648\nCommon Stock\n1 Share\n0.059%\nSam Blank\nEscondido CA 92025\nCommon Stock\n1 Share\n0.059%\nHarry Buchaklian\nFresno CA 93720\nCommon Stock\n1 Share\n0.059%\nSuzanne Colvin\nSan Jose, CA 92121\nCommon Stock\n1 Share\n0.059%\nRodney Enns\nKingsburg CA 93631\nCommon Stock\n1 Share\n0.059%\nWilliam Fischer\nCamarillo, CA 93012\nCommon Stock\n1 Share\n0.059%\nWayne Hardesty\nRancho Cucamonga CA 91730\nCommon Stock\n1 Share\n0.059%\nTerris Hughes\nShafter CA 93263\nCommon Stock\n1 Share\n0.059%\nMarcus Johnson\nSanger CA 93657\nCommon Stock\n2 Shares\n0.118%\nKaren King\nCamarillo CA 93010\nCommon Stock\n1 Share\n0.059%\nGarry Nelson\nShafter, CA 93263\nCommon Stock\n1 Share\n0.059%\nRonald Nunlist\nShafter CA 93263\nCommon Stock\n4 Shares\n0.236%\nGeorge Pappi, Jr.\nLa Verne CA 91750\nCommon Stock\n1 Share\n0.059%\nDwight Plumley\nVisalia CA 93277\nCommon Stock\n3 Shares\n0.177%\nJerry Roberts\nLos Gatos, CA 95032\nCommon Stock\n3 Shares\n0.177%\nBrian Skaggs\nHanford CA 93230\nCommon Stock\n3 Share\n0.177%\nGary Willems\nCambria CA 93428\nCommon Stock\n1 Share\n0.059%\nJack Williams\nBakersfield, CA 93309\nCommon Stock\n1 Share\n0.059%\nAll Officers and Directors as a Group\nCommon Stock\n28 Shares\n1.416%\n* Amount of Ownership: All such shares are owned beneficially and of record, and there are no additional shares known to the Company for which the listed beneficial owner has the right to acquire beneficial ownership as specified in Rule 13D-3(d)(1) of the Exchange Act.\nPismo Coast Village, Inc. 2022-2023\nc. CHANGES IN CONTROL\nNot applicable. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThere have been no transactions during the past two years, or proposed transactions, to which the Company was or is to be a party, in which any of the officers, directors, nominees, named shareholders, or family members of any such persons, had or is to have a direct or indirect material interest, other than transactions where competitive bids determine the rates or charges involved, or where the amount involved does not exceed $120,000, or where the interest of the party arises solely from the ownership of securities of the Company and the party received no extra or special benefit that was not shared by all shareholders.\nEMPLOYMENT AGREEMENTS\nSee Item 11, Current employment contract, Pismo Coast Village, Inc., and Lesley Marr.\nOTHER ARRANGEMENTS\nDuring the fiscal years 2023 and 2022, Pismo Coast Village, Inc. paid for various hospitality functions and for travel, lodging and hospitality expenses for spouses who occasionally accompanied directors when they were traveling on company business. Management believes that the expenditure was to Pismo Coast Village, Inc.'s benefit.\nCERTAIN BUSINESS RELATIONSHIPS\nNone.\n(1)-(5) INDEBTEDNESS OF MANAGEMENT\nNone.\nTRANSACTIONS WITH PROMOTERS\nNot applicable.\nDIRECTOR INDEPENDENCE\nOur Board of Directors consists of shareholders of the Resort and therefore are not considered to be \"independent\" as defined by Section 121A of the American Stock Exchange Listing Standards. The Board considers all relevant facts and circumstances in its determination of independence of all members of the Board (including any relationships set forth in this Form 10-K under the heading \"Certain Related Person Transactions\"). As disclosed above, the Audit Committee, the Nominating Committee and the Personnel and Compensation/Benefits Committee members are not considered to be independent. ITEM 14. PRINCIPAL ACCOUNTING FEES AND SERVICES\nThe shareholders will vote on the independent audit firm for the fiscal year ending September 30, 2024, at the annual shareholders meeting held on January 20, 2024.\nThe following table discloses the fees that the Company was billed for professional services rendered by its independent public accounting firm, Brown Armstrong Accountancy Corporation, in each of the last two fiscal years.\nYears ended\nSeptember 30,\nAudi fees (1)\n$\n60,300\n$\n51,900\nAudit-related fees (2)\n-\n-\nTax fees (3)\n-\n-\nAll other fees (4)\n2,500\n2,500\nTotal\n$\n62,800\n$\n54,400\nPismo Coast Village, Inc. 2022-2023\nThe previous table reflects fees billed for the audit of the Company's consolidated financial statements included in its Form 10-K and review of its quarterly reports on Form 10-Q.\n(1) Reflects fees, if any, for consulting services related to financial accounting and reporting matters.\n(2) Reflects fees billed for tax compliance, tax advice and preparation of the Company's federal tax return.\n(3) Reflects fees, if any, for other products or professional services not related to the audit of the Company's consolidated financial statements and review of its quarterly reports, or for tax services.\n(4) AUDIT COMMITTEE'S PREAPPROVAL POLICIES AND PROCEDURES\nFor the fiscal years ended September 30, 2023, and September 30, 2022, all audit related services, tax services and other services were pre-approved by the Audit Committee, which concluded that the provision of such services by Brown Armstrong were compatible with the maintenance of that firm's independence in the conduct of its auditing function.\n(5) No effort expended on the principal accountant's engagement to audit the registrant's financial statements for the most recent fiscal year was attributed to work performed by persons other-than the accountant's full-time, permanent employees.\nPismo Coast Village, Inc. 2022-2023\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nRegistrant: PISMO COAST VILLAGE, INC.\nBy:\n/s/ GEORGE PAPPI\nGeorge Pappi, Jr., President\nand Chairman of the Board\nDate:\nDecember 13, 2023\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nBy:\n/s/ GEORGE PAPPI\nGeorge Pappi, Jr., President\nand Chairman of the Board\nDate:\nDecember 13, 2023\nBy:\n/s/ JACK WILLIAMS\nJack Williams, Chief Financial Officer,\nVice President - Finance, and Director\n(principal financial officer and principal accounting officer)\nDate:\nDecember 13, 2023\nBy:\n/s/ KAREN KING\nKaren King, Executive Vice President\nand Director\nDate:\nDecember 13, 2023\nBy:\n/s/ GARY WILLEMS\nGary Willems, Vice President - Secretary\nand Director\nDate:\nDecember 13, 2023\nBy:\n/s/ RODNEY ENNS\nRodney Enns, Vice President - Operations\nand Director\nDate:\nDecember 13, 2023\nBy:\n/s/ DAVID BESSOM\nDavid Bessom, Director\nDate:\nDecember 13, 2023\nBy:\n/s/ SAM BLANK\nSam Blank, Director\nDate:\nDecember 13, 2023\nBy:\n/s/ HARRY BUCHAKLIAN\nHarry Buchaklian, Director\nDate:\nDecember 13, 2023\nBy:\n/s/ SUZANNE COLVIN\nSuzanne Colvin, Director\nDate:\nDecember 13, 2023\nBy:\n/s/ WAYNE HARDESTY\nWayne Hardesty, Director\nDate:\nDecember 13, 2023\nBy:\n/s/ TERRIS HUGHES\nTerris Hughes, Director\nDate:\nDecember 13, 2023\nBy:\n/s/ MARCUS JOHNSON\nMarcus Johnson, Director\nDate:\nDecember 13, 2023\nBy:\n/s/ RONALD NUNLIST\nRonald Nunlist, Director\nDate:\nDecember 13, 2023\nBy:\n/s/ DWIGHT PLUMLEY\nDwight Plumley, Director\nDate:\nDecember 13, 2023\nBy:\n/s/ BRIAN SKAGGS\nBrian Skaggs, Director\nDate:\nDecember 13, 2023\nNo No Yes Yes\nfalse FY\n2022-10-01 2023-09-30\n2023-03-31\n2023-12-19\n2023-09-30\n2022-09-30\npcv:ResortOperationsMember\n2022-10-01 2023-09-30\npcv:ResortOperationsMember\n2021-10-01 2022-09-30\npcv:RetailOperationsMember\n2022-10-01 2023-09-30\npcv:RetailOperationsMember\n2021-10-01 2022-09-30\npcv:OperatingLeaseIncomeMember\n2022-10-01 2023-09-30\npcv:OperatingLeaseIncomeMember\n2021-10-01 2022-09-30\n2021-10-01 2022-09-30\nus-gaap:CommonStockMember\n2020-09-30\nus-gaap:RetainedEarningsMember\n2020-09-30\nus-gaap:AccumulatedOtherComprehensiveIncomeMember\n2020-09-30\n2020-09-30\nus-gaap:RetainedEarningsMember\n2020-10-01 2021-09-30\n2020-10-01 2021-09-30\nus-gaap:CommonStockMember\n2021-09-30\nus-gaap:RetainedEarningsMember\n2021-09-30\nus-gaap:AccumulatedOtherComprehensiveIncomeMember\n2021-09-30\n2021-09-30\nus-gaap:RetainedEarningsMember\n2021-10-01 2022-09-30\nus-gaap:CommonStockMember\n2021-10-01 2022-09-30\nus-gaap:CommonStockMember\n2022-09-30\nus-gaap:RetainedEarningsMember\n2022-09-30\nus-gaap:AccumulatedOtherComprehensiveIncomeMember\n2022-09-30\nus-gaap:RetainedEarningsMember\n2022-10-01 2023-09-30\nus-gaap:AccumulatedOtherComprehensiveIncomeMember\n2022-10-01 2023-09-30\nus-gaap:CommonStockMember\n2023-09-30\nus-gaap:RetainedEarningsMember\n2023-09-30\nus-gaap:AccumulatedOtherComprehensiveIncomeMember\n2023-09-30\npcv:TOTAndTBIDMember\n2023-09-30\npcv:TOTAndTBIDMember\n2022-09-30\nus-gaap:SalesRevenueNetMember us-gaap:CustomerConcentrationRiskMember pcv:SiteRentalsMember\n2022-10-01 2023-09-30\nus-gaap:SalesRevenueNetMember us-gaap:CustomerConcentrationRiskMember pcv:StorageRentalsMember\n2022-10-01 2023-09-30\nus-gaap:SalesRevenueNetMember us-gaap:CustomerConcentrationRiskMember pcv:SpottingMember\n2022-10-01 2023-09-30\nus-gaap:SalesRevenueNetMember us-gaap:CustomerConcentrationRiskMember pcv:StoreAndAccessoryMember\n2022-10-01 2023-09-30\nus-gaap:SalesRevenueNetMember us-gaap:CustomerConcentrationRiskMember pcv:OtherAncillaryGoodsAndServicesMember\n2022-10-01 2023-09-30\nsrt:MinimumMember pcv:BuildingAndResortImprovementsMember\n2023-09-30\nsrt:MaximumMember pcv:BuildingAndResortImprovementsMember\n2023-09-30\nsrt:MinimumMember pcv:FurnitureFixturesEquipmentAndLeaseholdImprovementsMember\n2023-09-30\nsrt:MaximumMember pcv:FurnitureFixturesEquipmentAndLeaseholdImprovementsMember\n2023-09-30\nsrt:MinimumMember us-gaap:TransportationEquipmentMember\n2023-09-30\nsrt:MaximumMember us-gaap:TransportationEquipmentMember\n2023-09-30\nus-gaap:InvestmentsMember us-gaap:FairValueInputsLevel1Member\n2023-09-30\nus-gaap:InvestmentsMember us-gaap:FairValueInputsLevel2Member\n2023-09-30\nus-gaap:InvestmentsMember us-gaap:FairValueInputsLevel3Member\n2023-09-30\nus-gaap:FairValueInputsLevel1Member\n2023-09-30\nus-gaap:FairValueInputsLevel2Member\n2023-09-30\nus-gaap:FairValueInputsLevel3Member\n2023-09-30\npcv:A2016LeaseWithDonahueTransportationCorpMember\n2023-09-30\npcv:A2016LeaseWithDonahueTransportationCorpMember\n2022-09-30\npcv:A2016LeaseWithDonahueTransportationCorpMember\n2022-10-01 2023-09-30\npcv:A2016LeaseWithDonahueTransportationCorpMember\n2021-10-01 2022-09-30\npcv:A2018LeaseWithDonahueTransportationCorpMember\n2023-09-30\npcv:A2018LeaseWithDonahueTransportationCorpMember\n2022-09-30\npcv:A2018LeaseWithDonahueTransportationCorpMember\n2022-10-01 2023-09-30\npcv:A2018LeaseWithDonahueTransportationCorpMember\n2021-10-01 2022-09-30\npcv:A2019LeaseWithDonahueTransportationCorpThroughMarch2025Member\n2023-09-30\npcv:A2019LeaseWithDonahueTransportationCorpThroughMarch2025Member\n2022-09-30\npcv:A2019LeaseWithDonahueTransportationCorpThroughMarch2025Member\n2022-10-01 2023-09-30\npcv:A2019LeaseWithDonahueTransportationCorpThroughMarch2025Member\n2021-10-01 2022-09-30\npcv:A2019LeaseWithDonahueTransportationCorpThroughSeptember2025Member\n2023-09-30\npcv:A2019LeaseWithDonahueTransportationCorpThroughSeptember2025Member\n2022-09-30\npcv:A2019LeaseWithDonahueTransportationCorpThroughSeptember2025Member\n2022-10-01 2023-09-30\npcv:A2019LeaseWithDonahueTransportationCorpThroughSeptember2025Member\n2021-10-01 2022-09-30\npcv:A2020LeaseWithDonahueTransportationCorpThroughMay2027Member\n2023-09-30\npcv:A2020LeaseWithDonahueTransportationCorpThroughMay2027Member\n2022-09-30\npcv:A2020LeaseWithDonahueTransportationCorpThroughMay2027Member\n2022-10-01 2023-09-30\npcv:A2020LeaseWithDonahueTransportationCorpThroughMay2027Member\n2021-10-01 2022-09-30\npcv:OperatingLeaseSantaMariaMember\n2023-09-30\npcv:OperatingLeaseSantaMariaMember\n2022-10-01 2023-09-30\nsrt:MinimumMember pcv:OperatingLeaseSantaMariaMember\n2023-09-30\nsrt:MaximumMember pcv:OperatingLeaseSantaMariaMember\n2023-09-30\npcv:OperatingLeaseDolliverStMember\n2023-09-30\npcv:OperatingLeaseDolliverStMember\n2022-10-01 2023-09-30\npcv:OperatingLeaseNipomoStMember\n2023-09-30\npcv:OperatingLeaseNipomoStMember\n2022-10-01 2023-09-30\nus-gaap:DomesticCountryMember\n2023-09-30\nus-gaap:DomesticCountryMember\n2022-09-30\nus-gaap:StateAndLocalJurisdictionMember\n2023-09-30\nus-gaap:StateAndLocalJurisdictionMember\n2022-09-30\niso4217:USD\nxbrli:shares\niso4217:USD\nxbrli:shares\nxbrli:pure"
}