{
    "cik": "27673",
    "company": "DEERE JOHN CAPITAL CORP",
    "filing_type": "10-K",
    "filing_date": "2023-12-15",
    "period_of_report": "2023-10-29",
    "sic": "6153",
    "state_of_inc": "DE",
    "state_location": "WI",
    "fiscal_year_end": "1029",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/27673/0001558370-23-019816-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/27673/000155837023019816/jdcc-20231029x10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/27673/0001558370-23-019816.txt",
    "filename": "27673_10K_2023_0001558370-23-019816.htm",
    "content": "Item 1. Business.\nThis Annual Report on Form 10-K contains forward-looking statements that are subject to risks and uncertainties. All statements other than statements of historical fact included in this Annual Report on Form 10-K are forward-looking statements. Forward-looking statements provide our current expectations and projections relating to our financial condition, results of operations, plans, objectives, future performance, and business. You can identify forward-looking statements as they do not relate to historical or current facts and by words such as believe, expect, estimate, anticipate, will, should, plan, forecast, target, guide, project, intend, could, and similar words or expressions.\nAll forward-looking statements are subject to risks and uncertainties that may cause actual results to differ materially from those that we expected. Important factors that could cause actual results to differ materially from our expectations, or cautionary statements, and other important information about forward-looking statements are disclosed under Item 1A, Risk Factors, and Item 7, Managements Discussion and Analysis of Financial Condition and Results of Operations-Forward-Looking Statements in this Annual Report on Form 10-K.\nPresentation of Amounts\nAll amounts are presented in millions of dollars, unless otherwise specified.\nThe Company\nJohn Deere Capital Corporation (Capital Corporation) and its subsidiaries are collectively called we, us, our or the Company. John Deere Financial Services, Inc. (JDFS), a wholly-owned finance holding subsidiary of Deere & Company, owns all of the outstanding common stock of Capital Corporation. See Our Relationships with John Deere for additional information regarding agreements between us and Deere & Company. We conduct business in Australia, New Zealand, the United States (U.S.), and in several countries in Africa, Asia, Europe, and Latin America, including Argentina and Mexico. Capital Corporation was incorporated under the laws of Delaware and commenced operations in 1958.\nWe provide and administer financing for retail purchases of new equipment manufactured by Deere & Companys production and precision agriculture operations, small agriculture and turf operations, and construction and forestry operations and used equipment taken in trade for this equipment. References to agriculture and turf include both production and precision agriculture and small agriculture and turf. We generally purchase retail installment sales and loan contracts (retail notes) from Deere & Company and its wholly-owned subsidiaries (collectively called John Deere). John Deere generally acquires these retail notes through independent John Deere retail dealers. We also purchase and finance a limited amount of non-John Deere retail notes. In addition, we finance and service revolving charge accounts, in most cases acquired from and offered through merchants in the agriculture and turf and construction and forestry markets (revolving charge accounts). We also provide wholesale financing to dealers of John Deere agriculture and turf equipment and construction and forestry equipment, primarily to finance inventories of equipment for those dealers (wholesale receivables). Further, we lease John Deere equipment and a limited amount of non-John Deere equipment to retail customers (financing and operating leases). We also offer credit enhanced international export financing to select customers and dealers, which primarily involves John Deere products. Retail notes, revolving charge accounts, and financing leases are collectively called Customer Receivables. Customer Receivables and wholesale receivables are collectively called Receivables. Receivables and equipment on operating leases are collectively called Receivables and Leases. We generally secure our Receivables, other than certain revolving charge accounts, by retaining as collateral security in the goods associated with those Receivables or with the use of other collateral.\nDeere & Companys internet address is https://www.deere.com. The information contained on John Deeres website is not included in, nor incorporated by reference into, this Annual Report on Form 10-K.\nBusiness of John Deere\nJohn Deeres operations are categorized into four business segments:\nThe production and precision agriculture segment defines, develops, and delivers global equipment and technology solutions for production-scale growers of crops like large grains (such as corn and soy), small grains (such as wheat, oats, and barley), cotton, and sugarcane. Equipment manufactured and distributed by the segment includes large and certain mid-size tractors, combines, cotton pickers, cotton strippers, sugarcane harvesters, related harvesting front-end equipment, and pull-behind scrapers. In addition, the segment includes tillage, seeding, and application equipment, including sprayers and nutrient management and soil preparation machinery.\nThe small agriculture and turf segment defines, develops, and delivers global equipment and technology solutions designed to unlock customer value for dairy and livestock producers, high-value crop producers, and turf and utility customers. Equipment manufactured and distributed by the segment include certain mid-size, small and utility tractors, and related loaders and attachments; turf and utility equipment, including riding lawn equipment, commercial mowing equipment, golf course equipment, utility vehicles, implements for mowing, tiling, snow and debris handling, aerating, and other residential, commercial, golf, and sports turf care applications; and hay and forage equipment, including self-propelled forage harvesters and attachments, balers, and mowers.\nThe construction and forestry segment delivers a robust portfolio of construction, roadbuilding, and forestry products with precision technology solutions. The segments primary construction products include excavators, wheel loaders, motor graders, dozers, backhoes, articulated dump trucks, compact construction equipment including skid steers, compact excavators, and compact truck loaders, along with a variety of attachments. The segments primary roadbuilding products include milling machines, pavers, compactors, rollers, crushers, screens and asphalt plants, and the primary forestry products include skidders, feller bunchers, forwarders, knuckleboom loaders, harvesters, swing machines, and precision forestry technology solutions.\nThe products and services produced by the segments above are marketed primarily through independent retail dealer networks and major retail outlets. For roadbuilding products in certain markets outside the U.S. and Canada, the products are sold through John Deere-owned sales and service subsidiaries.\nThe financial services segment includes our operations (described herein) and additional operations in the U.S., Canada, Brazil, China, India, and Thailand. The operations in Russia were sold in the second quarter of fiscal year 2023. The segment primarily finances sales and leases by John Deere dealers of new and used production and precision agriculture equipment, small agriculture and turf equipment, and construction and forestry equipment. In addition, the financial services segment provides wholesale financing to dealers of the foregoing equipment, finances retail revolving charge accounts, and offers extended equipment warranties.\nJohn Deeres worldwide production and precision agriculture operations, small agriculture and turf operations, and construction and forestry operations are sometimes collectively referred to as the equipment operations. The financial services segment is sometimes referred to as the financial services operations. Receivables and Leases managed by us are evaluated by market (agriculture and turf or construction and forestry).\nFor fiscal 2023, worldwide net income attributable to Deere & Company was $10.166 billion, or $34.63 per share, compared with $7.131 billion, or $23.28 per share, in fiscal 2022.\nDeere & Companys consolidated net sales and revenues increased 16 percent to $61.251 billion in 2023, compared with $52.577 billion in 2022. Net sales of the equipment operations increased in fiscal 2023 to $55.565 billion, compared with $47.917 billion last year, due to favorable industry fundamentals and strong demand for farm and construction equipment.\nThe financial services operations reported net income of $619 for fiscal 2023 compared with $880 in fiscal 2022. Net income declined as a result of the unfavorable impact of higher interest rates on financing spreads and a correction of the accounting treatment for financing incentives offered to John Deere dealers. In 2022, financial services increased the provision for credit losses in Russia and recorded an intercompany benefit from the equipment operations, which guarantees financial services investments in certain international markets, including Russia.\nSmart Industrial Operating Model and Leap Ambitions\nJohn Deere announced the Smart Industrial Operating Model in 2020. This operating model is based on three focus areas:\n(a) Production systems: A strategic alignment of products and solutions around John Deere customers operations.\n(b) Technology stack: Investments in technology, as well as research and development, that deliver intelligent solutions to John Deere customers through digital capabilities, automation, autonomy, and alternative power technologies.\n(c) Lifecycle solutions: The integration of John Deeres aftermarket and support capabilities to more effectively manage customer equipment, service, and technology needs across the full lifetime of a John Deere product.\nJohn Deeres Leap Ambitions were launched in 2022. These ambitions are designed to boost economic value and sustainability. The ambitions align across the production systems of John Deere customers, seeking to optimize their operations to deliver better outcomes with fewer resources. As an enabling business, we are fully integrated with John Deeres Smart Industrial Operating Model and are focused on providing financial solutions to help John Deere achieve its Leap Ambitions.\nOur Relationships with John Deere\nOur results of operations are affected by our relationships with John Deere, including, among other items, the terms on which we acquire Receivables and borrow funds from John Deere, the reimbursement for interest waiver and low-rate finance programs from John Deere, the compensation paid by John Deere in connection with our purchase of trade receivables from John Deere, and the payment to John Deere for various expenses applicable to our operations. In addition, we have joint access with John Deere to certain lines of credit.\nOur volume of Receivables and Leases is largely dependent upon the level of retail sales and leases of John Deere products. The level of John Deere retail sales and leases is responsive to a variety of economic, financial, geopolitical, climatic, legislative, and other factors that influence supply and demand for its products. The majority of our business is affected by changes in interest rates, demand for credit, and competition.\nWe bear substantially all of the credit risk (net of recovery from withholdings from certain John Deere dealers and merchants) associated with our holding of Receivables and Leases. A small portion of the Receivables and Leases held (less than 5 percent) is guaranteed by certain subsidiaries of Deere & Company. We also perform substantially all servicing and collection functions. Servicing and collection functions for a small portion of the Receivables and Leases held (less than 5 percent) are provided by John Deere. John Deere is reimbursed for staff and other administrative services at estimated cost and for credit lines provided to us based on utilization of those lines.\nThe terms and the basis on which we acquire retail notes and certain wholesale receivables from John Deere are governed by agreements with John Deere, generally terminable by either John Deere or us on 30 days notice. As provided in these agreements, we agree to the terms and conditions for purchasing the retail notes and wholesale receivables from John Deere. Under these agreements, John Deere is not obligated to sell notes to us, and we are obligated to purchase notes from John Deere only if the notes comply with the terms and conditions set by us.\nThe basis on which John Deere acquires retail notes and wholesale receivables from John Deere dealers is governed by agreements with those dealers, which may be terminated in accordance with their terms and applicable law. In acquiring these notes from dealers, the terms and conditions, as set forth in agreements with the dealers, conform with the terms and conditions adopted by us in determining the acceptability of retail and certain wholesale receivables to be purchased from John Deere. The dealers are not obligated to sell these notes to John Deere and John Deere is not obligated to accept these notes from the dealers. In practice, retail and wholesale receivables are acquired from dealers only if the terms of these notes and the creditworthiness of the customers are acceptable to us. We act on behalf of both ourselves and John Deere in determining the acceptability of the notes and in acquiring acceptable notes from dealers.\nThe basis on which we enter into leases with retail customers through John Deere dealers is governed by agreements between those dealers and us. Leases are accepted based on the terms and conditions, the lessees creditworthiness, the anticipated residual values of the equipment, and the intended use of the equipment.\nDeere & Company has an agreement with us pursuant to which it has agreed to continue to own, directly or through one or more wholly-owned subsidiaries, at least 51 percent of the voting shares of capital stock of Capital Corporation and to maintain our consolidated tangible net worth at not less than $50.0. This agreement also obligates Deere & Company to make payments to us such that our consolidated ratio of earnings to fixed charges is not less than 1.05 to 1 for any four consecutive fiscal quarterly periods. Deere & Companys obligations to make payments to us under the agreement are independent of whether we are in default on our indebtedness, obligations, or other liabilities. Further, Deere & Companys obligations under the agreement are not measured by the amount of our indebtedness, obligations, or other liabilities. Deere & Companys obligations to make payments under this agreement are expressly stated not to be a guarantee of any specific indebtedness, obligation, or liability of ours and are enforceable only by or in the name of Capital Corporation. No payments were required under this agreement during the periods included in the consolidated financial statements. At October 29, 2023, Deere & Company indirectly owned 100 percent of the voting shares of Capital Corporations capital stock and our consolidated tangible net worth was $5,901.6.\nWe purchase certain wholesale trade receivables from John Deere. These trade receivables arise from John Deeres sales of goods to independent dealers. Under the terms of the sales to dealers, interest is primarily charged to dealers on outstanding balances from the earlier of the date when goods are sold to retail customers by the dealer or the expiration of certain interest-free periods granted at the time of the sale to the dealer, until payment is received by us. Dealers cannot cancel purchases after John Deere recognizes a sale and are responsible for payment even if the equipment is not sold to retail customers. The interest-free periods are determined based on the type of equipment sold and the time of year of the sale. These periods range from one to twelve months for most equipment. Interest-free periods may not be extended. Interest charged may not be forgiven and the past due interest rates exceed market rates. We receive compensation from John Deere at approximate market interest rates for these interest-free periods. We compute the compensation from John Deere for interest-free periods based on our estimated funding costs, administrative and operating expenses, credit losses, and required return on equity.\nA portion of finance income earned by us arises from financing of retail sales of John Deere equipment on which finance charges are waived or reduced by John Deere for a period from the date of the retail sale to a specified subsequent date. We receive compensation from John Deere equal to competitive market interest rates for periods during which finance charges have been waived or reduced. We compute the compensation from John Deere for waived or reduced finance charges based on our estimated funding costs, administrative and operating expenses, credit losses, and required return on equity. The financing rate following the waiver or interest reduction period is not significantly different from the compensation rate from John Deere.\nDescription of Receivables and Leases\nReceivables and Leases arise mainly from retail and wholesale sales and leases of John Deere products and used equipment accepted in trade for them, and from retail sales of equipment of unrelated manufacturers. Receivables and Leases also include revolving charge receivables. At October 29, 2023 and October 30, 2022, at least 90 percent of the Receivables and Leases administered by us were for financing that facilitated the purchase or lease of John Deere products.\nJohn Deere Financial, f.s.b. (Thrift) is a wholly-owned subsidiary of Capital Corporation. It holds a federal thrift charter and is regulated by the Office of the Comptroller of the Currency (OCC). The U.S. Federal Reserve Board has oversight of us, as the owner of the Thrift. The Thrift is headquartered in Wisconsin and offers the following revolving charge products throughout the U.S.:\n● John Deere Financial Multi-Use AccountTM is used by farmers and ranchers to finance their purchases of production inputs from agribusiness merchants, including seed, fertilizer, and crop protection. It is also used by agriculture and turf customers to finance the purchase of parts and service from John Deere dealers.\n● PowerPlanTM is used by construction and forestry customers to finance the purchase of equipment parts, equipment rentals, and service work performed at John Deere construction and forestry dealers.\n● John Deere Financial Revolving Plan is used by retail customers of John Deere dealers to finance purchases of turf and utility equipment.\nWe provide wholesale financing to John Deere dealers, primarily to finance agriculture and turf and construction and forestry equipment inventories. A large portion of the wholesale financing is provided by us to dealers from whom we also purchase agriculture and turf and construction and forestry retail notes.\nWe generally require that theft and physical damage insurance be carried on all goods leased or securing retail notes and wholesale receivables. In certain markets, the customer may, at the customers own expense, have us or the seller of the goods purchase this insurance or obtain it from other sources. Insurance is not required for goods purchased under revolving charge accounts.\nReceivables and Leases are eligible for acceptance if they conform to prescribed finance and lease plan terms. In limited circumstances, Receivables and Leases may be accepted even though they do not conform in all respects to the established guidelines. We determine whether Receivables and Leases should be accepted and how they should be serviced. Acceptance of these Receivables and Leases is dependent on having one or more risk mitigation enhancements that may include larger down payments or advance lease payments, additional co-borrowers or guarantors, the pledge of additional collateral as security, the assignment of specific earnings to us, or the acceptance of accelerated payment schedules. Our officers are responsible for establishing policies and reviewing our performance in accepting and collecting Receivables and Leases. We perform substantially all of our own routine collections, settlements, and repossessions on Receivables and Leases.\nJohn Deere retail notes and wholesale receivables are generally supported by perfected security interests in goods financed under laws such as the Uniform Commercial Code (UCC), certain federal statutes, and state motor vehicle laws in the U.S. and by security in goods or other security under applicable laws in other countries and jurisdictions. UCC financing statements are also prepared and filed on leases; however, these filings for operating leases are made for informational purposes only.\nFinance Rates on Retail Notes\nAs of October 29, 2023 and October 30, 2022, over 95 percent of the retail notes held by us bore a fixed finance rate. A portion of the finance income earned by us arises from reimbursements from John Deere in connection with financing the retail sales of John Deere equipment on which finance charges are waived or reduced by John Deere for a period from the date of sale to a specified subsequent date. See Note 3 to the Consolidated Financial Statements for additional information.\nAverage Original Term and Average Actual Life of Retail Notes and Leases\nDue to prepayments (often from trade-ins and refinancing), the average actual life of retail notes and leases is considerably shorter than the average original term. The following table shows the average original term for retail notes and leases acquired during the year and the average actual life for retail notes and leases liquidated during the year (in months):\nAverage Original Term\nAverage Actual Life\nRetail notes:\nNew equipment:\nAgriculture and turf\nConstruction and forestry\nUsed equipment:\nAgriculture and turf\nConstruction and forestry\nFinancing leases\nEquipment on operating leases\nMaturities\nThe following table presents the contractual maturities of Receivables and Leases owned by us at October 29, 2023 and a summary of Receivables and Leases owned by us at October 30, 2022:\nOne year\nor less\nOne to five years\nFive to fifteen years\nTotal\nFixed\nVariable\nFixed\nVariable\nrate\nrate\nrate\nrate\nRetail notes:\nAgriculture and turf\n$\n8,110.7\n$\n17,587.8\n$\n353.8\n$\n649.5\n$\n6.5\n$\n26,708.3\n$\n23,796.5\nConstruction and forestry\n2,057.3\n3,207.9\n6.0\n18.4\n5,289.6\n4,954.1\nTotal retail notes\n10,168.0\n20,795.7\n359.8\n667.9\n6.5\n31,997.9\n28,750.6\nRevolving charge accounts\n4,435.2\n63.4\n95.8\n4,594.4\n4,165.8\nWholesale receivables\n12,893.7\n157.5\n277.1\n1.8\n13,330.1\n8,404.5\nFinancing leases\n874.9\n537.2\n9.7\n1,421.8\n1,120.7\nEquipment on operating leases\n988.7\n3,952.2\n110.6\n5,051.5\n4,853.5\nTotal Receivables and Leases\n$\n29,360.5\n$\n25,506.0\n$\n732.7\n$\n790.0\n$\n6.5\n$\n56,395.7\n$\n47,295.1\nNet Write-offs\nReceivable balances are written off to the allowance for credit losses when, in the judgment of management, they are considered uncollectible. Write-offs generally occur when Customer Receivables are 120 days delinquent, and on a case-by-case basis when wholesale receivables are 60 days delinquent.\nTotal net (write-offs) recoveries, by product, were as follows:\nDollars\nPercent\nDollars\nPercent\nDollars\nPercent\nNet write-offs:\nRetail notes and financing leases:\nAgriculture and turf\n$\n(22.9)\n(.09)\n%\n$\n(11.2)\n(.04)\n%\n$\n(9.4)\n(.04)\n%\nConstruction and forestry\n(25.0)\n(.47)\n(15.1)\n(.30)\n(15.7)\n(.36)\nTotal retail notes and financing leases\n(47.9)\n(.16)\n(26.3)\n(.10)\n(25.1)\n(.10)\nRevolving charge accounts\n(22.6)\n(.59)\n2.9\n.09\n7.7\n.23\nWholesale receivables\n.4\n.01\n(.2)\n(.3)\nTotal net write-offs\n$\n(70.1)\n(.15)\n%\n$\n(23.6)\n(.06)\n%\n$\n(17.7)\n(.05)\n%\nNet write-offs as a percent of portfolio increased in 2023 from near record lows in 2022 and 2021, but remain below the 10 year average of .18 percent.\nAllowance for Credit Losses\nThe total allowance for credit losses, by product, at October 29, 2023 and October 30, 2022, and the portfolio, by product, as a percent of total portfolio are presented below:\nDollars\nPercent\nDollars\nPercent\nRetail notes and financing leases:\nAgriculture and turf\n$\n55.4\n%\n$\n43.1\n%\nConstruction and forestry\n59.5\n52.3\nTotal retail notes and financing leases\n114.9\n95.4\nRevolving charge accounts\n20.4\n21.9\nWholesale receivables\n11.1\n11.1\nTotal\n$\n146.4\n%\n$\n128.4\n%\nKey credit quality metrics and related portfolio balances at October 29, 2023 and October 30, 2022 were as follows:\nDollars\nDollars\nReceivables 30 days or more past due\n$\n514.1\n$\n404.9\nNon-performing Receivables\n383.1\n263.2\nAllowance for credit losses\n146.4\n128.4\nTotal Receivables\n51,344.2\n42,441.6\nPercent\nPercent\nReceivables 30 days or more past due to total Receivables\n1.00\n%\n.95\n%\nNon-performing Receivables to total Receivables\n.75\n.62\nAllowance for credit losses to total Receivables\n.29\n.30\nAllowance for credit losses to non-performing Receivables\n38.21\n48.78\nThe Receivables portfolio continued to perform well in 2023. While certain portfolio quality metrics summarized above have diminished slightly from the prior year, past due and non-performing Receivables remain at historically healthy levels. The allowance for credit losses as a percent of total portfolio was relatively stable in 2023, as the impact of portfolio growth in wholesale receivables offset the impact of higher allowances on turf and construction customer accounts.\nCompetition\nThe businesses in which we are engaged are highly competitive. We primarily compete for customers with commercial banks and finance and leasing companies based upon our service, finance rates charged, and other finance terms. In addition, the competitive landscape is evolving as technology is unlocking new capabilities for traditional competitors and enabling new digital entrants that could be either technology partners or potential competitors. The proportion of John Deere equipment retail sales and leases financed by us is influenced by conditions prevailing in the agriculture and turf equipment and construction and forestry equipment markets, in the financial markets, and in business generally. We financed a significant portion of John Deere equipment retail sales and leases in many of the countries in which we operated during 2023 and 2022.\nWe emphasize convenient service to customers and endeavor to offer terms desired in our specialized markets, such as seasonal schedules of repayment and rentals. Our retail finance rates and lease rates are generally believed to be in the range offered by other sales finance and leasing companies, although not as low as those of some banks and other lenders and lessors.\nRegulation\nIn several U.S. states, state law limits the maximum finance rate on receivables. The present state limitations have not significantly limited variable-rate finance charges or the fixed-rate finance charges established by us. However, if interest rate levels should increase significantly, maximum state rates could affect us by preventing the variable rates on outstanding variable-rate retail notes from increasing above the maximum state rate and by limiting the fixed rates on new notes. In some states, we may be able to qualify new retail notes for a higher maximum rate limit by using retail installment sales contracts (rather than loan contracts) or by using fixed-rate rather than variable-rate contracts.\nIn addition to rate regulations, various U.S. state and federal laws and regulations apply to some Receivables and Leases, principally retail notes for goods sold for personal, family, or household use and John Deere Financial Revolving Plan, John Deere Financial Multi-Use AccountTM, and PowerPlanTM products and receivables. To date, these laws and regulations have not had a significant adverse effect on us.\nThe Thrift holds a federal thrift charter and is subject to regulation and examination by the OCC. The U.S. Federal Reserve Board has oversight of us, as the owner of the Thrift.\nOur financing offers outside the U.S. are affected by a variety of country specific laws, regulations, and customs, including those governing property rights and debtor obligations, and are subject to changes that may introduce greater risks to us.\nIn fiscal year 2023, compliance with the regulations applicable to us did not have a material effect on our capital expenditures, earnings, or competitive position. We do not expect to incur material capital expenditures related to compliance with regulations during fiscal year 2024. Additional information about the impact of government regulations on our business is included in Item 1A, Risk Factors under the headings Strategic Risks and Legal and Compliance Risks.\nHuman Capital\nHigher Purpose\nOur employees are guided by John Deeres higher purpose: We run so life can leap forward. Employees are further guided by John Deeres Code of Business Conduct (Code), which helps them to uphold and strengthen the standards of honor and integrity that have defined John Deere since its founding. Our world and business may change, yet we continue to be guided by our core values-integrity, quality, commitment and innovation.\nEmployees\nAt October 29, 2023, we had 1,508 full-time and part-time employees. We also retain consultants, independent contractors, and temporary workers.\nCode of Business Conduct\nWe are committed to conducting business in accordance with the highest ethical standards. We require all employees to complete training on our Code and, where permitted by law, also require that employees regularly certify compliance with the Code. The Code provides specific guidance to all our employees, outlining how they can and must uphold and strengthen the integrity that has defined John Deere since its founding. In addition, we maintain a global compliance hotline to allow for concerns of potential violations of the Code, global policies, or the law to be brought forward.\nDiversity, Equity, and Inclusion (DEI)\nWe adhere to the principle of equal employment opportunity and we believe that a diverse workforce is essential to our long-term success and solving our customers most pressing challenges. We strive to foster a diverse, equitable, and inclusive culture. We embrace employees differences in race, color, religion, age, sex, sexual orientation, gender, gender identity and expression, marital or partnership status, family status, citizenship, national origin, ancestry, geographic background, military or veteran status, disability (mental or physical), and any other characteristics that make our employees unique.\nOur leadership team works to set a consistent and transparent tone on DEI issues and strategy. We also create spaces for open conversations and learning through our Employee Resource Groups (ERGs) speaker series and micro-learnings. John Deere sponsors 13 ERGs that are run by employees, open to all employees, and are a key driver of inclusion. ERGs build organization-wide networks that allow employees to come together and discuss shared interests. The global chapters work with local teams to support our efforts to attract, retain, and develop the best talent. In addition, our global DEI strategy focuses on embedding DEI into world-wide business operations and people processes.\nIn addition to recruiting from a wide array of colleges and universities, John Deere partners with several professional organizations to support our diversity recruitment strategy, including AnitaB.org. - a global organization for women in technology, Minorities in Agriculture Natural Resources and Related Sciences, the National Association of Black Accountants, Inc., the National Black MBA Association, Inc., the National Society of Black Engineers, the Society of Women Engineers, the Thurgood Marshall College Fund Leadership Institute, and the Society of Hispanic Professional Engineers. Our broad recruiting strategy helps us identify talent from diverse backgrounds.\nCompensation & Benefits\nOur total rewards are intended to be competitive, meet the varied needs of our global workforce, and reinforce our values. We are committed to providing comprehensive and competitive pay and benefits to our employees. We invested, and continue to invest, in employees through growth and development and well-being initiatives.\nOur work environment is designed to promote innovation, well-being, and reward performance. Our total rewards for employees include a variety of components that aim to support sustainable employment and the ability to build a strong financial future, including competitive market-based pay and comprehensive benefits. In addition to earning base pay, eligible employees are compensated for their contributions to our goals with both short-term cash incentives and long-term equity-based incentives.\nEligible full-time employees in the U.S. have access to medical, dental, and vision plans; savings and retirement plans; parental leave and paid time off; and other resources, such as the Employee Assistance Program, which provides mental health and wellness services. We also offer a variety of working arrangements to eligible employees, including flexible schedules, remote work, and job sharing to help employees manage home and work-life situations. Programs and benefits differ internationally for a variety of reasons, such as local legal requirements, market practices, and negotiations with works councils and other employee representative bodies.\nTraining and Development\nEmployees are critical to the long-term success of our business. We encourage employees to identify the paths that can build the skills, experience, knowledge, and competencies needed for career advancement. We support employees by creating purpose-driven work opportunities, comprehensive performance reviews and development plans, mentoring opportunities, and professional and personal development opportunities.\nWe encourage employees to provide feedback across the enterprise through our internal voluntary employee experience survey, ad-hoc pulse surveys, and new-hire and exit surveys. Reports from these surveys help equip us to address needs across the employee lifecycle to improve the overall experience and engagement of our workforce.\nAround the world, we offer internships, training, upskilling, apprenticeships, and leadership development at all stages of an employees career. Training programs are tailored to different geographic regions and job functions and include topics such as relationships with customers and dealers, our culture and values, compliance with the Code, compliance with anti-bribery/corruption laws and policies, compliance with management of private data and cybersecurity, regulatory compliance, conflicts of interest, discrimination and workplace harassment policies, sexual harassment policies, and leadership development.\nHuman Rights and Our Code of Conduct\nWe honor human rights and respect the individual dignity of all persons globally. Our commitment to human rights requires that we understand and fulfill our responsibilities consistent with our values and practices. We strive to ensure that human rights are upheld for our employees and employees of John Deere dealers. Our commitment to human rights is defined in the Code, the John Deere dealer Code of Conduct, related policies and procedures, and John Deeres statement Support of Human Rights in our Business Practice, each of which is available on John Deeres website under Governance. These documents establish guidelines for our employees and John Deere dealers. We do not tolerate human rights abuses, such as forced labor, unlawful child labor, and human trafficking. Item 1A. Risk Factors.\nThe results of our operations are affected by our relationships with John Deere. See Our Relationships with John Deere for additional information regarding our relationships with John Deere.\nThe following risks are considered material to our business based upon current knowledge, information, and assumptions. This discussion of risk factors should be considered closely in conjunction with Managements Discussion and Analysis of Financial Condition and Results of Operations (MD&A), including the risks and uncertainties described in the Forward-Looking Statements, the Notes to Consolidated Financial Statements, and the risk factors of Deere & Company included in Exhibit 99 to this Annual Report on Form 10-K and incorporated herein by reference. These risk factors and\nother forward-looking statements relate to future events, expectations, trends, and operating periods. They involve certain factors that are subject to change and important risks and uncertainties that could cause actual results to differ materially. Although the risks are organized by headings, and each risk is discussed separately, many are interrelated. The risks described in this Annual Report on Form 10-K and the Forward-Looking Statements in this report are not the only risks we face.\nSTRATEGIC RISKS\nOur profitability and the financial condition of our operations are dependent upon the operations of John Deere.\nOur volume of Receivables and Leases is largely dependent upon the level of retail sales and leases of John Deere products. The results of our operations are affected by our relationship with John Deere, including, among other items, the terms on which we acquire Receivables and borrow funds from John Deere, the reimbursement for interest waiver and low-rate finance programs from John Deere, the compensation paid by John Deere in connection with our purchase of trade receivables from John Deere, and the payment to John Deere for various expenses applicable to our operations. In addition, we have joint access to certain lines of credit with John Deere.\nIf there were significant changes in the production or sales of John Deere products; the quality or resale value of John Deere equipment; John Deeres liquidity, capital position, debt ratings, and access to capital markets; the reputation of John Deere; or high inflation, higher interest rates, supply chain constraints, or other factors impacting John Deere or its products, such changes could significantly affect our profitability, financial condition, and access to capital markets. In addition, if there were changes to sales incentive programs offered by John Deere to retail customers, in which we receive reimbursement for interest waiver and low-rate finance programs, this could decrease our market share of John Deere financed equipment, volumes, and profitability.\nWe may be impacted by general negative economic conditions and outlook causing weakened demand for John Deeres equipment and services, limiting access to funding, and resulting in higher funding costs for us and John Deere.\nThe demand for John Deeres and our products and services depends on the fundamentals in the markets in which we operate and can be significantly reduced in an economic environment characterized by high unemployment, high interest rates, cautious consumer spending, inflation, lower corporate earnings, and lower business investment. Negative or uncertain economic conditions that cause John Deeres customers to lack confidence in the general economic outlook can significantly reduce their likelihood of purchasing John Deeres equipment. These economic events adversely affected and may continue to adversely affect John Deere and our operations.\nSustained negative economic conditions and outlook also affect housing starts, energy prices and demand, and other construction, which dampens demand for certain construction equipment. John Deeres turf operations and its construction and forestry segments are dependent on construction activity and have also been affected by recent adverse economic conditions. Decreases in construction activity and housing starts could have a material adverse effect on John Deeres and our results of operations.\nIf negative economic conditions affect the overall farm economy, there could be a similar effect on John Deeres agricultural equipment sales. Uncertain or negative outlook with respect to pervasive U.S. fiscal issues as well as general economic conditions and outlook, such as market volatility and continuing interest rate increases by the Federal Reserve, have caused and could continue to cause significant changes in market liquidity conditions. Such changes could impact access to funding and associated funding costs, which could reduce our earnings and cash flows.\nJohn Deere may not realize the anticipated benefits of its Smart Industrial Operating Model and Leap Ambitions.\nJohn Deeres failure to realize the anticipated benefits of its Smart Industrial Operating Model and related business strategies in production systems, precision technologies, and aftermarket support could adversely affect our results of operations and financial condition based on our dependence on John Deere operations. Several factors could impact John Deeres ability to successfully execute the Smart Industrial Operating Model, including, among other things, failure to accurately assess market opportunities and the technology required to address such opportunities; failure to develop and introduce new technologies or lack of adoption of such technologies by John Deeres customers; and failure to holistically provide lifecycle solutions. In addition, if John Deere is unable to optimize its capital allocation in connection with the Smart Industrial Operating Model, including capital allocation for the development and delivery of financial solutions we provide, we and John Deere may not be able to realize the full benefits of the Smart Industrial Operating Model, which could have an adverse effect on John Deeres and our financial condition and results of operations.\nSimilarly, John Deere may not realize the anticipated benefits of its Leap Ambitions and related goals in the expected timelines, or at all. As part of the Leap Ambitions, John Deere adopted various goals it expects to achieve by 2026 or 2030. John Deere may not be able to achieve these goals for a variety of reasons, some of which may be out of its control. For example, John Deeres estimates and assumptions related to efficiency of its products and the adoption of precision technology may not be accurate; certain materials, such as quality battery cells and cameras, may become unavailable or too costly; or infrastructure required to achieve its goals, such as sufficient charging stations or fuel availability, may become too costly or may not be developed on the expected timeline. The actual or perceived failure of John Deere to achieve its Leap Ambitions could negatively impact its ability to execute the Smart Industrial Operating Model.\nJohn Deere may face risks associated with international, national, and regional trade laws, regulations, and policies and government farm programs and policies which could significantly impair John Deeres profitability and growth prospects. As our volume of Receivables and Leases is largely dependent upon the level of retail sales and leases of John Deere products, these macroeconomic drivers could also negatively impact our profitability and growth prospects.\nInternational, national, and regional laws, regulations, and policies directly or indirectly related to or restricting the import and export of John Deeres products, services, and technology, or those of its customers, or for the benefit of favored industries or sectors, could harm John Deeres global business. John Deeres profitability and growth prospects are tied directly to the global marketplace. Restricted access to global markets could impair John Deeres ability to export goods and services from its various manufacturing locations around the world and could limit the ability to access raw materials and high-quality parts and components at competitive prices on a timely basis. Trade restrictions, negotiation of new trade agreements, non-tariff trade barriers, local content requirements, and imposition of new or retaliatory tariffs against certain countries or covering certain products, including developments in U.S.-China trade relations, export control and sanctions against Russia, have limited, and could continue to limit, John Deeres ability to capitalize on current and future growth opportunities in international markets. These trade restrictions, and changes in, or uncertainty surrounding global trade policies, may affect John Deeres competitive position. Furthermore, trade restrictions could impede those in developing countries from achieving a higher standard of living, which could negatively impact John Deeres future growth opportunities arising from increasing global demand for food, fuel, and infrastructure. Policies impacting exchange rates and commodity prices, or those limiting the export or import of commodities could have a material adverse effect on the international flow of agricultural and other commodities that may result in a corresponding negative effect on the demand for agricultural and forestry equipment in many areas of the world. John Deeres agricultural equipment sales could be harmed by such policies because farm income influences sales of agricultural equipment around the world. Additionally, changes in government farm programs and policies can influence demand for agricultural equipment as well as create unequal competition for multinational companies relative to domestic companies.\nWe may be unable to manage increasing political, economic, and social uncertainty in certain regions of the world, which could significantly change the dynamics of John Deeres and our competition, customer base, and product offerings globally.\nJohn Deeres efforts to grow its business depends in part upon access and developing market shared and profitability in additional geographic markets, including, but not limited to, Argentina, Brazil, China, India, and South Africa. In some cases, these countries have greater political and economic volatility, greater vulnerability to infrastructure and labor disruptions, and differing customer product preferences and requirements than John Deeres other markets. In fiscal 2022,\nas a result of the war in Ukraine, John Deere suspended shipments of machines and service parts to Russia. The suspension of shipments to Russia reduced actual and forecasted revenue for the region, among other impacts. Having business operations in various regions and countries exposes us and John Deere to multiple and potentially conflicting business practices, and legal and regulatory requirements that are subject to change. These practices and legal requirements are often complex and difficult to navigate, including those related to tariffs and trade regulations, investments, property ownership rights, taxation, repatriation of earnings, and advanced technologies. Expanding business operations globally also increases exposure to currency fluctuations, which can materially affect our financial results. While John Deere maintains a positive corporate image and its brands are widely recognized and valued in its traditional markets, the brands are less known in some emerging markets, which could impede John Deeres efforts to successfully compete in these markets.\nJohn Deere may be affected by changing worldwide demand for food and different forms of renewable energy, which could impact the price of farm commodities and consequently the demand for John Deere equipment. This could result in higher research and development costs related to changing machine fuel requirements.\nChanging worldwide demand for farm outputs to meet the worlds growing food and renewable energy demands, driven in part by government policies, including those related to climate change, and a growing world population, are likely to result in fluctuating agricultural commodity prices, which directly affect sales of agricultural equipment. Lower agricultural commodity prices directly affect farm incomes, which could negatively affect sales of agricultural equipment and result in higher credit losses. While higher commodity prices benefit John Deeres crop-producing agricultural equipment customers, they could result in greater feed costs for livestock and poultry producers, which in turn may result in lower levels of equipment purchased by these customers. In addition, changing renewable energy demands may cause farmers to change the types or quantities of the crops they raise, with corresponding changes in equipment demand. Finally, changes in governmental policies regulating bio-fuel utilization could affect commodity demand and commodity prices, demand for John Deeres diesel-fueled equipment, and result in higher research and development costs for John Deere related to equipment fuel standards. These changes could have a negative effect on our results.\nJohn Deeres ability to understand its customers preferences and requirements, and to develop, manufacture, and market products that meet customer demand could significantly affect its business results.\nJohn Deeres ability to match new product offerings to global customers preferences for different types and sizes of equipment and various equipment features and functionality, at affordable prices, is critical to its success. In addition, our ability to anticipate and deliver on customers changing preferences for financial solutions is critical to our success. This requires a thorough understanding of John Deeres and our existing and potential customers on a global basis, particularly in growth markets such as Argentina, Brazil and India. Failure to deliver quality products that meet customer needs at competitive prices ahead of competitors could have a significant adverse effect on John Deeres and our business.\nIn addition, customer preferences in the markets served by John Deere are changing as a result of ongoing social and regulatory focus on sustainability as these markets transition to less carbon-intensive business models. As regulations and social pressure drive change, John Deere must continue to proactively monitor trends and develop alternatives and enhancements that elevate and complement its product offerings. For example, even though John Deere plans to offer electric, hybrid-electric, and battery electric equipment solutions, John Deere may be unable to keep up with the rising demand for electric agriculture, turf, and construction equipment.\nThe development of alternative farming techniques, carbon sequestration technologies, and new low-carbon biofuels are changing farmers business models and equipment needs. If John Deere fails to continue to develop or invest in emerging technologies to meet changing customer demands, John Deere will be at risk of losing potential sources of revenue, which could affect John Deeres and our future financial results.\nJohn Deeres and our ability to adapt in highly competitive markets could affect our business, results of operations, and financial condition.\nJohn Deere operates in a variety of highly competitive global and regional markets with other manufacturers and distributors that produce and sell similar products. In addition, John Deeres industry is attracting non-traditional competitors, including technology-focused companies and start-up ventures. John Deere competes on product performance, innovation and quality, distribution, sustainability, customer service, and price. Aggressive pricing or other\nstrategies pursued by competitors, unanticipated product or manufacturing delays, or John Deeres failure to price its products competitively could adversely affect John Deeres business, results of operations, and financial condition, which could negatively affect our results.\nThe equipment finance industry in which we operate is highly competitive. We compete for customers with commercial banks and finance and leasing companies based upon service, finance rates charged, and other finance terms. In addition, the competitive landscape is evolving as technology is unlocking new capabilities for traditional competitors and enabling new digital entrants. Our ability to maintain and expand our market share is contingent upon us offering competitive pricing, developing and maintaining strong relationships with dealers and customers, making substantial investments in our technological infrastructure, and effectively responding to changes in the agriculture and turf equipment and construction and forestry equipment markets. In addition, any expansion into new markets may require us to compete with more experienced and established market participants. Failure to effectively manage these challenges could adversely affect our market share, and pressure to provide competitive pricing could have a negative effect on our results of operations and financial condition.\nJohn Deere relies on a network of independent dealers to manage the distribution of its products and services. If dealers are unsuccessful with their sales and business operations, it could have an adverse effect on overall John Deere sales and revenue.\nJohn Deere relies on the capability of John Deere dealers to develop and implement effective sales plans to create demand among purchasers for the equipment and related products and services that the dealers purchase from John Deere. If John Deeres dealers are unsuccessful in these endeavors, John Deere will be unable to grow its sales and revenue, which would have an adverse effect on John Deeres and our financial condition. In addition, the dealer channels ability to support and service precision technology solutions and emerging power solutions may affect customers acceptance and adoption rates of these products. The unavailability of specialized technicians to service John Deeres equipment may result in overburdening dealers servicing capacity.\nDealers may have trouble funding their day-to-day cash flow needs and paying their obligations due to adverse business conditions resulting from negative economic effects or other factors. Dealers may exit or John Deere may seek to terminate relationships with certain dealers if they are unable to meet customer needs. The unplanned loss of any John Deere dealers could lead to inadequate market coverage, negative customer impressions of John Deere, and may adversely impact John Deeres and our ability to collect receivables that are associated with that dealer.\nENVIRONMENTAL, CLIMATE, AND WEATHER RISKS\nUnfavorable weather conditions or natural catastrophes that reduce agricultural production and demand for agriculture and turf equipment could directly and indirectly affect John Deeres and our business.\nThe purchasing decisions of John Deeres customers, particularly the purchasers of agriculture and turf equipment, can be significantly affected by poor or unusual weather conditions. Such conditions include: insufficient levels of rain, which prevent farmers from planting new crops and may cause growing crops to die or result in lower yields; excessive rain or flooding can prevent planting from occurring at optimal times and may cause crop loss through increased disease or mold growth; temperatures outside normal ranges, which can cause crop failure or decreased yields and may also affect disease incidence; natural disasters such as regional floods, hurricanes or other storms, droughts, diseases, wildfires, and pests, either as a physical effect of climate change or otherwise, which have had and could in the future have significant negative effects on agricultural and livestock production; adverse weather conditions in a particular geographic region, particularly during the important spring selling season; and drought conditions can adversely affect sales of certain mowing equipment and can similarly cause lower sales volumes. Each of these conditions could have a negative impact on farm income which can affect demand for agricultural equipment and the financial condition and credit risk of our customers and John Deeres dealers.\nGovernmental actions designed to address climate change based on the emergence of new technologies and business models in connection with the transition to a lower-carbon economy could adversely affect John Deere and its customers.\nThere is global scientific consensus that greenhouse gas (GHG) emissions continue to alter the composition of Earths atmosphere in ways that are affecting and are expected to continue to affect the global climate. These considerations have led to new international, national, regional, and local legislative and regulatory responses. Various stakeholders, including legislators and regulators, shareholders, and non-governmental organizations, as well as companies in many business sectors, including us and John Deere, are continuing to look for ways to reduce GHG emissions. The regulation of GHG emissions from certain stationary or mobile sources or the imposition of carbon pricing mechanisms could result in additional costs to us and John Deere in the form of taxes or emission allowances, required facilities improvements, and increased energy costs. These results would increase John Deeres and our operating costs through higher utility, transportation, and materials cost and could prevent John Deere from selling products into certain markets. Increased input costs, such as fuel and fertilizer, and compliance-related costs could also affect customer operations and demand for John Deere equipment.\nFurther, we are subject to additional international and national European regulations relating to climate and environmental risk, which are continually evolving and could affect the financing operations and climate-risk processes developed by us. Regulators in Europe and the U.S. have also focused efforts on increased disclosure related to climate change and mitigation efforts. The EU recently adopted the European Sustainability Reporting Standards (ESRS) and the Corporate Sustainability Reporting Directive (CSRD) that will impose disclosure of the risks and opportunities arising from social and environmental issues, and on the impact of companies activities on people and the environment. The CSRD will need to be transposed into Member State law before it becomes effective, which is expected to occur in 2024. Similarly, the State of California recently passed the Climate Corporate Data Accountability Act and the Climate-Related Financial Risk Act that will impose broad climate-related disclosure obligations on certain companies doing business in California, including us and John Deere, starting in 2026. The Securities and Exchange Commission (SEC) has included in its regulatory agenda potential rulemaking on climate change disclosures that, if adopted, could significantly increase compliance burdens and associated regulatory costs and complexity.\nFINANCIAL RISKS\nChanges in government banking, monetary, and fiscal policies could have a negative effect on us.\nPolicies of the U.S. and other governments regarding banking, monetary, and fiscal policies intended to promote or maintain liquidity, stabilize financial markets, and/or address local deficit or structural economic issues may not be effective and could have a material impact on our customers and markets. Central bank policy interest rates continued to increase in fiscal year 2023. Most of our retail receivables are fixed rate, while wholesale financing receivables are generally variable rate. We have both fixed and variable rate borrowings. Historically, rising interest rates impact our borrowings sooner than the benefit is realized from the Receivable and Lease portfolios.\nOur operations and results could also be affected by financial regulatory reform that could, among other things, have an adverse effect on us and our customers by limiting their ability to enter into hedging transactions or to finance purchases of John Deere products. Government policies on spending can also affect John Deere, especially the construction and forestry segment, due to the impact of government spending on infrastructure development. John Deere and our operations, including those outside of the U.S., may also be affected by non-U.S. regulatory reforms being implemented to further regulate non-U.S. financial institutions and markets.\nChanges in tax rates, tax legislation, or exposure to additional tax liabilities could have a negative effect on us and John Deere.\nWe and John Deere are subject to income taxes in the U.S. and numerous foreign jurisdictions. John Deeres and our domestic and international tax liabilities are dependent upon the location of earnings among these different jurisdictions. Tax rates in various jurisdictions may be subject to significant change. John Deeres and our effective tax rates could be affected by changes in the mix of earnings in countries with differing statutory tax rates, changes in the valuation of deferred tax assets and liabilities, or changes in tax laws or their interpretations. If John Deeres and our effective tax rates\nwere to increase, or if the ultimate determination of taxes owed is for an amount more than amounts previously accrued, John Deeres and our operating results, cash flows, and financial condition could be adversely affected.\nOur consolidated financial results are reported in U.S. dollars while certain assets and other reported items are denominated in foreign currencies, creating currency exchange and translation risk.\nWe are a global company with transactions denominated in a variety of currencies. We are subject to currency exchange risk to the extent that costs are denominated in currencies other than those in which we earn revenues. Additionally, the reporting currency for our consolidated financial statements is the U.S. dollar. Certain of our assets, liabilities, expenses, and revenues are denominated in other countries currencies, which are then translated into U.S. dollars at the applicable exchange rates and reported in our consolidated financial statements. Therefore, fluctuations in foreign exchange rates affect the value of those items as reflected in our consolidated financial statements, even if their value remains unchanged in their original currencies. While the use of currency hedging instruments may provide us with some protection from adverse fluctuations in currency exchange rates, by utilizing these instruments, we potentially forego any benefits that may result from favorable fluctuations in such rates.\nChanges in interest rate risks or market liquidity conditions could adversely affect our financials and our earnings and/or cash.\nCentral bank policy interest rates continued to increase in fiscal year 2023. Rising interest rates could have a dampening effect on overall economic activity and/or the financial condition of our customers, either or both of which could negatively affect customer demand for John Deere equipment and customers ability to repay their obligations to us. Rising interest rates may cause credit market dislocations, that can impact funding costs, which can affect our ability to offer customers competitive financing rates. While we strive to match the interest rate characteristics of our financial assets and liabilities, changing interest rates have had an adverse effect on our financing spread-the difference between the yield we earn on our assets and the interest rates we pay for funding-which has affected our earnings.\nIn addition, actions by credit rating agencies, such as downgrades or negative changes to ratings outlooks, can affect the availability and cost of funding for us and can increase our cost of capital and hurt our competitive position.\nBecause we are a financing company, negative economic conditions in the financial industry could materially impact our operations and financial results.\nNegative economic conditions could have an adverse effect on the financial industry in which we operate. We provide financing for a significant portion of John Deeres sales in many of the countries in which we operate. We are exposed to the risk that customers and others will default on contractual obligations and may experience credit losses that exceed our expectations and adversely affect our financial condition and results of operations. Our inability to access funds at cost-effective rates to support our financing activities could have a material adverse effect on our business. Our liquidity and ongoing profitability depend largely on timely access to capital to meet future cash flow requirements and to fund operations and costs associated with engaging in diversified funding activities. Additionally, negative market conditions could reduce customer confidence levels, resulting in declines in credit applications and increases in delinquencies and default rates, which could materially impact our write-offs and provision for credit losses.\nOur results could be adversely affected by a decrease in the value of used equipment or higher than estimated returns of equipment on operating lease.\nWe sell repossessed equipment and equipment returned to us at the end-of-lease terms, primarily through the John Deere dealer network. We estimate the end-of-lease term residual value at the inception of the operating leases based on a number of factors, including lease term, expected hours of usage, historical wholesale sale prices, return experience, intended equipment use, market dynamics and trends, and third-party residual guarantees. Used equipment values may decrease as a result of any one or a combination of factors including market conditions, supply of and demand for used equipment, and technological advancements in new equipment. Depressed prices for used equipment may result in, or increase, a loss upon our disposition of off-lease or repossessed equipment, and in the case of repossessed equipment, we may be unable to collect the resulting deficiency. In addition, lower residual value estimates could result in increasing operating lease depreciation, impairment losses, and losses on the sale of matured operating lease inventory, which would decrease our earnings.\nWe could suffer operational and financial harm if our models fail to properly anticipate and manage risk.\nWe use models to forecast losses, project revenue and expenses, assess and control our operations and financial condition, perform automated credit decisioning, assist in capital planning, and forecast and assess capital and liquidity requirements for credit, market, operational and strategic risks. However, models are subject to inherent limitations from simplifying assumptions, uncertainty regarding economic and financial outcomes, and emerging risks. Our models may not be sufficiently predictive of future results due to limited historical patterns, unanticipated market movements, customer behavior, and liquidity, which could limit their effectiveness and require timely recalibration. In addition, our models may be adversely impacted by human error and may not be effective if we fail to properly oversee and review them at regular intervals and detect their flaws during our review and monitoring processes. Regardless of the steps we take to help confirm effective controls, monitor and test, implement new technology, and implement new processes, we could suffer operational and financial harm if our models fail to properly anticipate and help us manage risks.\nMANUFACTURING AND OPERATIONAL RISKS\nChanges in the availability and price of certain raw materials, components, and whole goods have resulted and could continue to result in disruptions to the supply chain causing production disruptions, increased costs, and lower profits on sales of John Deere products. As our volume of Receivables and Leases is largely dependent upon the level of retail sales and leases of John Deere products, supply chain disruptions and impacts of price increases could negatively impact our future volumes.\nJohn Deere requires access to various raw materials, components, and whole goods at competitive prices to manufacture and distribute our products. The price and availability of these materials have varied significantly in the last 36 months. While John Deere has seen stabilization in the supply chain and some commodity pricing improvements, John Deere anticipates potential fluctuations due to inflation, geopolitical and economic uncertainty, and regulatory and policy instability, including import tariffs and trade agreements. The latter have the potential to significantly increase production and logistics costs and have a material negative effect on the profitability of John Deeres business, particularly if John Deere is unable to recover the increased costs due to market considerations or other factors. John Deere has experienced changes in the availability and prices of these raw materials, components, whole goods, and freight over the past several years, especially in fiscal years 2021 and 2022. Global logistics network challenges resulted in delays, shortages of key manufacturing components, increased order backlogs, increased transportation costs, and production inefficiencies from a higher number of partially completed machines in inventory, which increased John Deeres overall production and overhead costs. Increases in such costs have had an adverse effect on John Deeres business operations.\nJohn Deere relies on its suppliers to acquire the raw materials, components, and whole goods required to manufacture their products. Significant disruptions to the supply chain resulting from shortages of raw materials, components, and whole goods have and could continue to adversely affect John Deeres ability to meet commitments to its customers. In addition, certain materials and components used in John Deere products are acquired from a single supplier or are proprietary in nature and cannot be alternatively sourced expeditiously. Furthermore, if John Deeres customers are unwilling to accept price increases for its products, or if John Deere is unable to offset the increases in costs, raw material costs or shortages could have a material adverse effect on John Deeres operational or financial results, which could negatively impact us.\nRESOURCES RISKS\nOur ability to attract, develop, engage, and retain qualified employees could affect our ability to execute our strategy.\nOur continued success depends, in part, on our ability to identify and attract qualified candidates with the requisite education, background, and experience, as well as our ability to develop, engage, and retain qualified employees. Failure to attract, develop, engage, and retain qualified employees, whether as a result of an insufficient number of qualified applicants, difficulty in recruiting new employees, or inadequate resources to train, integrate, and retain qualified employees, could impair our ability to execute our business strategy and could adversely affect our business, results of operations, and financial condition. In addition, while we strive to reduce the impact of the departure of employees, our operations or ability to execute our business strategy and meet our business objectives may be affected by the loss of employees, particularly when departures involve larger numbers of employees, such as those we could experience if a surge occurs in the number of employees voluntarily leaving their jobs. Higher rates of employee separations may\nadversely affect us through decreased employee morale, the loss of knowledge of departing employees, and the devotion of resources to recruiting and onboarding new employees.\nSecurity breaches and other disruptions to our information technology infrastructure could interfere with our operations and could compromise the information of us as well as our customers and/or John Deere dealers, exposing us to liability that could cause our business and reputation to suffer.\nIn the ordinary course of business, we rely upon information technology networks and systems, some of which are managed by third parties, to process, transmit, and store electronic information and to manage or support a variety of business processes and activities, including credit application and collection of payments from dealers and other purchasers of John Deere equipment. We use information technology systems to record, process, and summarize financial information and results of operations for internal reporting purposes and to comply with regulatory financial reporting, legal, and tax requirements. Additionally, we collect and store sensitive data, including intellectual property, proprietary business information, and the proprietary business information of our customers and John Deere dealers, as well as personally identifiable information of our customers and employees in data centers which are often owned by third parties, and on information technology networks. The secure operation of these information technology networks and the processing and maintenance of this information is critical to our business operations and strategy. Despite security measures, including a vulnerability disclosure program, and business continuity plans, our information technology networks and infrastructure have been, and may be, vulnerable to intrusion, damage, disruptions, or shutdowns due to attacks by cyber criminals, employees, suppliers, or dealers errors or malfeasance, supply chain compromises, disruptions during the process of upgrading or replacing computer software or hardware, power outages, computer viruses, ransomware or other malware, telecommunication or utility failures, terrorist acts, natural disasters, or other events. Although we have not suffered any significant cyber incidents that resulted in a material business impact, we have from time to time been the target of malicious cyber threat actors. The occurrence of any significant event could compromise our networks, and the information stored there could be accessed, obtained, publicly disclosed, lost, altered, misused, or stolen. Any such access, disclosure, alteration, misuse or other loss of information could result in legal claims or proceedings, government investigations, liability or regulatory penalties, disruption or shut down of our operations, and damage to our reputation, which could adversely affect our business, results of operations, and financial condition. Furthermore, as security threats continue to evolve and increase in frequency and sophistication, we may need to invest additional resources to protect information security.\nOur operations are affected by risks associated with our use of vendors and other third-party service providers.\nWe rely on vendor and third-party service providers for a variety of products and services to run our core credit operations, such as customer invoicing, collections, and software solutions. This reliance exposes us to risks of those third parties failing to perform financially or contractually to our expectations. These risks could include material adverse impacts on our business, such as disruption or interruption of business activities, cyber-attacks and information security breaches, poor performance of services affecting our customer relationships, and possibilities that we could be responsible to our customers for legal and regulatory violations committed by those third parties while conducting services on our behalf. While we have implemented ongoing monitoring to address this risk, there can be no assurance that our vendor and third-party relationships will not have a material adverse impact on our business.\nLEGAL AND COMPLIANCE RISKS\nOur global operations are subject to complex and changing laws and regulations, the violation of which could expose us to potential liabilities, increased costs, and other adverse effects.\nOur global operations are subject to numerous international, federal, state, and local laws and regulations, many of which are complex, frequently changing, and subject to varying interpretations. These laws and regulations cover a broad spectrum of subject areas, including advertising; anti-money laundering; antitrust; consumer finance; environmental, climate-related, health, and safety; foreign exchange controls and cash repatriation restrictions; foreign ownership and investment; human rights, labor, and employment; and data privacy. These laws may vary substantially within the different countries in which we operate. Compliance with these laws and regulations is costly and may further increase the cost of conducting our global operations. In addition, we must comply with the U.S. Foreign Corrupt Practices Act and all applicable foreign anti-corruption laws, including the U.K. Bribery Act, which generally prohibit companies and their\nintermediaries from making improper payments or providing anything of value to improperly influence government officials or private individuals for the purpose of obtaining or retaining a business advantage, regardless of whether those practices are culturally expected in a particular jurisdiction. Although we have a compliance program in place designed to reduce the likelihood of potential violations of such laws and regulations, there can be no assurance that our employees, contractors, or agents will not violate such laws and regulations or our policies and procedures. Violations of these laws and regulations could result in criminal or civil sanctions and have a material adverse effect on our reputation, business, results of operations, and financial condition.\nChanges to existing laws and regulations, or changes to how they are interpreted, or the implementation of new, more stringent laws or regulations, could adversely affect our business by increasing compliance costs, limiting our ability to offer a product or service, requiring changes to our business practices, or otherwise making our products and services less attractive to customers. Legislative and regulatory changes and other actions that could potentially affect our business may be announced with little or no advance notice and we may not be able to effectively mitigate all adverse effects from such measures.\nWe are subject to governmental laws, regulations, and other legal obligations related to privacy and data protection. Any inability or perceived inability of addressing these requirements could adversely affect our business.\nThe legislative and regulatory framework for privacy and data protection issues worldwide is rapidly evolving and is likely to remain uncertain for the foreseeable future. We collect personal information and other data as integral parts of our business processes and activities. This data is subject to a variety of U.S. and foreign laws and regulations, including oversight by various regulatory and other governmental bodies. Many foreign countries and governmental bodies, including the European Union (EU) and other relevant jurisdictions where we conduct business, have laws and regulations concerning the collection and use of personal information and other data obtained from their residents or by businesses operating within their jurisdictions. The EU General Data Protection Regulation and the California Consumer Privacy Act, among others, impose stringent data protection requirements and provide significant penalties for noncompliance. New privacy laws will continue to come into effect around the world in the future. Any inability or perceived inability to adequately address privacy and data protection concerns (even if unfounded), or comply with applicable laws, regulations, policies, industry standards, contractual obligations, or other legal obligations, could result in additional cost and liability to us, damage our reputation, inhibit revenue, and otherwise adversely affect our business.\nLegal proceedings and disputes in which, we are, and may in the future be, involved could harm our business, financial condition, reputation, and brand.\nWe are subject to a variety of legal proceedings and legal compliance risks around the world. We face risks of exposure to various types of claims, lawsuits, and government inquiries or investigations in the ordinary course of business, the most prevalent of which relate to retail credit matters. The uncertainty associated with substantial unresolved claims and lawsuits may harm our business, financial condition, reputation, and brand. The defense of lawsuits and government inquiries or investigations has resulted and may result in the expenditures of significant financial resources and the diversion of managements time and attention away from business operations. Such legal proceedings may also affect our assessment and estimates of loss contingencies recorded as a reserve and require us to make payments exceeding our reserves.\nGENERAL RISKS\nJohn Deeres and our reputation and brand could be damaged by negative publicity.\nJohn Deeres brand has worldwide recognition and significantly contributes to the success of both our businesses. John Deeres reputation is critical to growing the customer base. John Deeres brand depends on the ability to maintain a positive customer perception of the business, including the core values of integrity, quality, innovation, and commitment. Negative claims or publicity involving John Deere, its products or services, its culture and values, its stance on environmental, social, and governance topics, customer data, or any of its key employees or suppliers, could damage John Deeres reputation and brand image, regardless of whether such claims are accurate. Damage to John Deeres reputation could adversely impact its and our ability to attract new and maintain existing customer, employee, dealer, and business relationships.\nAdditionally, negative or inaccurate postings, articles, or comments on social media and the internet about John Deere could generate negative publicity that could damage the reputation of John Deere, us, or the John Deere brand.\nFurther, adverse publicity about regulatory or legal action against John Deere or us, or legal action initiated by John Deere or us, could also damage John Deeres and our reputation and brand image, undermine customer confidence, and reduce long-term demand for John Deere equipment, even if the regulatory or legal action is unfounded or not material to John Deeres or our operations. If the reputation, culture, or image of John Deeres brands are damaged, or John Deere or we receive negative publicity, then our revenue, financial condition, and results of operations could be materially and adversely affected.\nUnexpected events have and may in the future increase our cost of doing business or disrupt our operations.\nThe occurrence of one or more unexpected events, including war, acts of terrorism, epidemics and pandemics (such as the COVID-19 pandemic), civil unrest, fires, tornadoes, tsunamis, hurricanes, earthquakes, floods, and other forms of severe weather in the U.S. or in other countries in which we operate, or in which John Deere suppliers are located, have and could in the future adversely affect our operations and financial performance. Such events have and could cause complete or partial closure of one or more of John Deeres manufacturing facilities or distribution centers, temporary or long-term disruption in the supply of component products from some local and international suppliers, and disruption and delay in the transport of John Deere products to dealers, end-users, and distribution centers. Existing insurance coverage may not provide protection from all the costs that may arise from such events.\nThe potential physical impacts of climate change on John Deeres facilities, suppliers, and customers, and therefore on John Deeres operations, are highly uncertain and will be particular to the circumstances developing in various geographic regions. These potential physical effects may adversely affect the demand for John Deeres products and the financial performance of John Deeres and our operations. Item 1B. Unresolved Staff Comments.\nNone. Item 2. Properties.\nWe own office buildings in Johnston, Iowa; and lease office space in Middleton, Wisconsin; Rosario, Argentina; Brisbane, Australia; Gloucester, England; Langar, England; Ormes, France; Walldorf, Germany; Milan, Italy; Luxembourg City, Luxembourg; Monterrey, Mexico; Poznan, Poland; and Parla, Spain. We believe our properties are adequate and suitable for our business as presently conducted and are adequately maintained. Item 3. Legal Proceedings.\nWe are subject to various unresolved legal actions that arise in the normal course of our business, the most prevalent of which relate to retail credit matters. We believe the reasonably possible range of losses for these unresolved legal actions would not have a material effect on our consolidated financial statements. Item 4. Mine Safety Disclosures.\nNot applicable.\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters, and Issuer Purchases of Equity Securities.\n(a) All of Capital Corporations common stock is owned by JDFS, a finance holding company that is wholly-owned by Deere & Company. In 2023 and 2022, Capital Corporation declared and paid cash dividends of $165.0 and $370.0, respectively, to JDFS. In turn, JDFS declared and paid comparable dividends to Deere & Company.\nIn 2023, Deere & Company increased its capital investment in JDFS by $810.0. JDFS, in turn, increased its capital investment in Capital Corporation by the same amount. There were no capital investments during 2022.\n(b) Not applicable.\n(c) Not applicable. Item 6. [Reserved] Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations.\nThe MD&A is intended to promote understanding of our financial condition and results of operations. The MD&A is provided as a supplement to, and should be read in conjunction with, the consolidated financial statements and the accompanying Notes to Consolidated Financial Statements. For comparison of 2022 to 2021 results, refer to the Managements Discussion and Analysis section of our 2022 Form 10-K.\nResults of Operations\nOverview\nOrganization\nWe provide financial solutions that enable John Deere customers and dealers to advance their lives and livelihoods. Through our offering of retail notes, leases, and revolving charge accounts, customers are able to finance new and used John Deere equipment, as well as parts, services, and other input costs needed to run their operations. We also provide wholesale financing to John Deere dealers.\nSmart Industrial Operating Model and Leap Ambitions\nJohn Deere announced the Smart Industrial Operating Model in 2020. This operating model is based on three focus areas:\n(a) Production systems: A strategic alignment of products and solutions around John Deere customers operations.\n(b) Technology stack: Investments in technology, as well as research and development, that deliver intelligent solutions to John Deere customers through digital capabilities, automation, autonomy, and alternative power technologies.\n(c) Lifecycle solutions: The integration of John Deeres aftermarket and support capabilities to more effectively manage customer equipment, service, and technology needs across the full lifetime of a John Deere product.\nJohn Deeres Leap Ambitions were launched in 2022. These ambitions are designed to boost economic value and sustainability. The ambitions align across the production systems of John Deere customers, seeking to optimize their operations to deliver better outcomes with fewer resources. As an enabling business, we are fully integrated with John Deeres Smart Industrial Operating Model and are focused on providing financial solutions to help John Deere achieve its Leap Ambitions.\nTrends and Economic Conditions\nOur volume of Receivables and Leases is largely dependent upon the level of retail sales and leases of John Deere products. The level of John Deere retail sales and leases is responsive to a variety of economic, financial, climatic, legislative, and other factors that influence supply and demand for its products.\nIndustry Sales Outlook for Fiscal Year 2024\nJohn Deere Trends\nCustomers seek to improve profitability, productivity, and sustainability through technology. Integration of technology into equipment is a persistent market trend. John Deeres Smart Industrial Operating Model and Leap Ambitions are intended to capitalize on this market trend. The technologies that are the focus of John Deeres operating model are incorporated into products within each of John Deeres operating segments. We expect this trend to persist for the foreseeable future.\nAgriculture and Turf Outlook for 2024\n● John Deere expects large agricultural equipment sales to decline in 2024 in North America, Europe, and South America.\n● Demand for small agricultural equipment is expected to moderate in Europe.\n● Turf and utility equipment product sales are expected to be lower due to the overall U.S. economic condition and elevated interest rates.\nMarket Conditions:\n● Agricultural fundamentals are expected to moderate in 2024 due to lower commodity prices and elevated interest rates, offset by declining input costs and improved customer financials.\n● The dairy and livestock sector continues to benefit from elevated protein and hay prices.\n● Farm input costs in Europe are declining. Grain prices vary from favorable in Western Europe to depressed in Eastern Europe due to the Russia/Ukraine war.\n● The fleet average age is older than in prior business cycles. Combines are in line with the historical average age, while tractors are slightly older than historical averages.\nConstruction and Forestry Outlook for 2024\nMarket Conditions:\n● Construction equipment industry sales are forecasted to be down from 2023 levels.\n● Benefits from rental fleet replenishment, the energy industry, and U.S. infrastructure spending are expected to partially offset moderation in residential home, office, and retail construction.\n● Roadbuilding demand remains strong similar to 2023 in the U.S., largely offset by softening demand in Europe.\nCompany Trends\nOur net income in fiscal year 2024 is expected to be higher due to income earned on a higher average portfolio and lower dealer financing incentives, partially offset by less favorable financing spreads and lower gains on operating lease dispositions.\nCentral bank policy interest rates increased in 2022 and 2023. Most of our receivables and leases with retail customers are fixed rate, while our wholesale receivables generally are variable rate. This Receivable and Lease portfolio is financed with fixed and variable rate borrowings. We manage our exposure to interest rate fluctuations by matching the interest rate characteristics of our portfolio with our funding sources. We also enter into interest rate swap agreements to match our interest rate exposure.\nRising interest rates have historically impacted our borrowings sooner than the benefit is realized from our Receivable and Lease portfolio. As a result, we experienced $152.6 (after-tax) less favorable financing spreads in 2023 compared to 2022. If interest rates continue to rise, we expect to continue experiencing spread compression in 2024.\nRising interest rates are driven by factors outside of our control, and as a result, we cannot reasonably foresee when this condition will subside.\nOther Items of Concern and Uncertainties\nOther items that could impact our results are:\n● global and regional political conditions, including the war in Ukraine and the Israel-Hamas war,\n● economic, tax, and trade policies,\n● new or retaliatory tariffs,\n● capital market disruptions,\n● foreign currency and capital control policies,\n● regulations and legislation regarding right to repair,\n● weather conditions,\n● marketplace adoption and monetization of technologies we have invested in,\n● John Deeres and our ability to strengthen our digital capabilities, automation, autonomy, and alternative power technologies,\n● changes in demand and pricing for new and used equipment,\n● significant fluctuations in foreign currency exchange rates,\n● volatility in the prices of many commodities, and\n● slower economic growth or possible recession.\nFinancing Incentives\nIn the second quarter of 2023, we corrected the accounting treatment for financing incentives offered to John Deere dealers. Refer to Note 1, Note 2, and Note 23 of the consolidated financial statements for additional information. While prior period amounts have been restated for comparability, the impact of the correction in periods prior to the quarter ended April 30, 2023 was not material to our consolidated financial statements in any of the impacted periods.\n2023 Compared with 2022\nThe total revenues and net income attributable to the Company were as follows:\nTotal revenues\n$\n3,975.5\n$\n2,806.6\nNet income attributable to the Company\n572.3\n693.6\nTotal revenues increased in 2023 primarily due to a 22 percent increase in average Receivable balances and higher average financing rates on Receivables of 6.3 percent in 2023 compared to 4.5 percent in 2022. Net income in 2023 was lower than 2022 due to less favorable financing spreads, a higher provision for credit losses, unfavorable derivative market valuation\nadjustments (presented in Other in the bar below), lower gains on operating lease dispositions, and higher selling, administrative, and general expenses. These factors were partially offset by income earned on a higher average portfolio.\nRevenues\nFinance income, lease revenues, and other income earned by us were as follows:\n% Change\nFinance income earned from:\nRetail notes\n$\n1,494.7\n$\n1,064.5\n%\nRevolving charge accounts\n417.4\n300.2\nWholesale receivables\n889.8\n342.5\nLease revenues\n997.3\n963.7\nOther income\n176.3\n135.7\nHigher average financing rates and higher average portfolio balances drove increased revenues across all products during 2023. The change was most pronounced within wholesale receivables, due to a 67 percent increase in average portfolio balances and an increase in the average financing rate from 4.9 percent in 2022 to 7.7 percent in 2023. The majority of wholesale receivables earn a variable rate of interest. Lease revenues were up only slightly, driven by a relatively stable operating lease portfolio, with average balances up 1 percent over 2022.\nOther income increased in 2023 primarily due to higher interest earned on our cash and cash equivalents and intercompany receivables from John Deere, partially offset by lower gains on operating lease dispositions. While demand for used equipment remains strong, lease gains were lower during 2023 as end-of-lease values are now more closely aligned with equipment sale proceeds.\nRevenues earned from John Deere totaled $1,027.9 in 2023, compared with $643.1 in 2022. The increase was primarily the result of higher compensation paid by John Deere on wholesale receivables and retail notes, driven by a higher interest rate environment and higher average portfolio balances. Revenues earned from John Deere are included in each of the revenue amounts discussed above.\nExpenses\nExpenses incurred by us were as follows:\n% Change\nInterest expense\n$\n1,671.5\n$\n497.3\n%\nDepreciation of equipment on operating leases\n659.7\n667.7\n(1)\nAdministrative and operating expenses\n569.4\n501.6\nFees and interest paid to John Deere\n252.6\n222.1\nProvision for credit losses\n88.5\n23.5\nProvision for income taxes\n165.9\n205.6\n(19)\nThe increase in interest expense in 2023 was primarily due to higher average borrowing rates due to rising interest rates and higher average borrowings to fund a larger portfolio.\nAdministrative and operating expenses increased during 2023 due to higher dealer financing incentive program costs driven by increased finance volumes, in addition to higher employment costs, including incentive compensation.\nFees and interest paid to John Deere increased in 2023 primarily due to higher interest on intercompany borrowings from John Deere driven by higher average borrowing rates. This was partially offset by a one-time payment to Deere & Company in 2022 that did not recur in 2023, related to unrealized gains on certain non-designated derivatives assumed by Deere & Company.\nThe provision for credit losses increased in 2023 compared to 2022 primarily due to higher write-offs on retail notes and revolving charge accounts, an increase in allowance driven by growth in the retail notes and financing lease portfolios, and higher expected losses on turf and construction customer accounts.\nThe lower provision for income taxes in 2023 was primarily due lower pretax income.\nReceivables and Leases\nFor the fiscal years ended October 29, 2023 and October 30, 2022, Receivable and Lease (excluding wholesale) volumes and balances held were as follows:\nFiscal Year Volumes\nFiscal Year End Balances\n%\n%\nChange\nChange\nRetail notes:\nAgriculture and turf\n$\n13,787.7\n$\n12,723.9\n%\n$\n26,708.3\n$\n23,796.5\n%\nConstruction and forestry\n2,725.9\n2,840.1\n(4)\n5,289.6\n4,954.1\nTotal retail notes\n16,513.6\n15,564.0\n31,997.9\n28,750.6\nRevolving charge accounts\n8,118.1\n7,561.1\n4,594.4\n4,165.8\nFinancing leases\n1,134.8\n800.8\n1,421.8\n1,120.7\nEquipment on operating leases\n2,356.6\n2,062.3\n5,051.5\n4,853.5\nTotal Receivables and Leases (excluding wholesale)\n$\n28,123.1\n$\n25,988.2\n$\n43,065.6\n$\n38,890.6\nCustomer Receivables increased $3,977.0 during 2023 compared 2022 due to strong John Deere retail sales.\nTotal Receivables 30 days or more past due, non-performing Receivables, and the allowance for credit losses were as follows (as a percentage of the Receivables balance):\nDollars\nPercent\nDollars\nPercent\nReceivables 30 days or more past due\n$\n514.1\n1.00\n%\n$\n404.9\n.95\n%\nNon-performing Receivables\n383.1\n.75\n263.2\n.62\nAllowance for credit losses\n146.4\n.29\n128.4\n.30\nWe monitor the credit quality of Receivables based on delinquency status. Receivables 30 days or more past due continue to accrue finance income. We stop accruing finance income once Receivables are considered non-performing, which generally occurs once Receivables are 90 days past due. An allowance for credit losses is recorded for the estimated credit losses expected over the life of the Receivable portfolio.\nDeposits held from dealers and merchants amounted to $138.4 at October 29, 2023, compared with $137.3 at October 30, 2022. These balances primarily represent the aggregate dealer retail note and lease withholding accounts from individual John Deere dealers to which losses from retail notes and leases originating from the respective dealers can be charged. Recoveries from dealer deposits are recognized in Other income when the dealers withholding account is charged. Recoveries from dealer deposits and other freestanding credit enhancements recorded in other income in 2023 and 2022 were $17.0 and $8.5, respectively.\n2022 Compared with 2021\nPlease refer to the Managements Discussion and Analysis section of our 2022 Form 10-K.\nCapital Resources and Liquidity\nSources of Liquidity, Key Metrics, and Balance Sheet Data\nWe rely on our ability to raise substantial amounts of funds to finance our Receivable and Lease portfolios. We have access to most global markets at a reasonable cost and our ability to meet our debt obligations is supported in several ways. Sources of liquidity include:\n● cash and cash equivalents,\n● the issuance of commercial paper and term debt,\n● the securitization of retail notes,\n● intercompany loans from John Deere,\n● our Receivable and Lease portfolio, which is self-liquidating in nature, and\n● bank lines of credit.\nWe closely monitor our liquidity sources against our cash requirements and expect to have sufficient sources of global funding and liquidity to meet our funding needs in the short-term (next 12 months) and long-term (beyond 12 months).\nKey metrics and certain balance sheet data are provided in the following table as of October 29, 2023, October 30, 2022, and October 31, 2021:\nCash, cash equivalents, and marketable securities\n$\n1,488.9\n$\n662.9\n$\n679.1\nReceivables and Leases - net\n56,249.3\n47,166.7\n41,443.3\nInterest-bearing debt\n50,514.5\n41,856.1\n37,319.9\nUnused credit lines\n841.2\n3,283.9\n5,770.3\nRatio of interest-bearing debt to stockholders equity\n8.6 to 1\n8.9 to 1\n8.4 to 1\nThe reduction in unused credit lines at October 29, 2023, compared to both prior periods relates to an increase in commercial paper outstanding, by both us and John Deere, to fund growth in the Receivable portfolio.\nCash Flows\nNet cash provided by operating activities\n$\n1,536.2\n$\n1,205.9\n$\n1,365.9\nNet cash used for investing activities\n(10,178.0)\n(7,206.8)\n(3,391.7)\nNet cash provided by financing activities\n9,480.2\n6,017.1\n2,026.2\nEffect of Exchange Rate Changes on Cash, Cash Equivalents, and Restricted Cash\n8.4\n(22.9)\n3.0\nNet Increase (Decrease) in Cash, Cash Equivalents, and Restricted Cash\n$\n846.8\n$\n(6.7)\n$\n3.4\nNet cash used for investing activities increased during 2023 primarily due to growth in the Receivable portfolio, which was funded primarily through external borrowings, cash provided by operating activities, and capital investments from John Deere, partially offset by a reduction in borrowings from John Deere.\nBorrowings\nTotal borrowings increased $8,658.4 in 2023, corresponding with the level of the Receivable and Lease portfolios. During 2023, we issued $11,184.2 and retired $5,972.1 of long-term external borrowings, which primarily consisted of medium-term notes. During 2023, we also issued $4,479.6 and retired $3,194.5 of retail note securitization borrowings and maintained an average commercial paper balance of $4,910.9. Our funding profile may be altered to reflect such factors as relative costs of funding sources, assets available for securitizations, and capital market accessibility.\nWe have a revolving credit agreement to securitize retail notes (see Note 5). At October 29, 2023, the revolving credit agreement had a total capacity, or financing limit, of $1,500.0 of secured financings at any time. $1,281.4 of short-term securitization borrowings were outstanding under the agreement at October 29, 2023. At the end of the contractual revolving period, unless we and the banks agree to renew, we would liquidate the secured borrowings over time as payments on the retail notes are collected. The agreement was renewed in November 2023 with an expiration in November 2024 and a capacity of $2,000.0.\nCapital Investments and Dividends\nDuring 2023, Deere & Company increased its capital investment in JDFS by $810.0. JDFS, in turn, increased its capital investment in Capital Corporation by the same amount. The capital investments were made to maintain targeted leverage ratios and were driven by growth in total Receivables and corresponding borrowings. There were no capital investments during 2022.\nCapital Corporation declared and paid cash dividends to JDFS of $165.0 in 2023 and $370.0 in 2022. In turn, JDFS paid comparable dividends to Deere & Company.\nLines of Credit\nWe have access to bank lines of credit with various banks throughout the world. Some of the lines are available to both us and Deere & Company. Worldwide lines of credit totaled $10,215.7 at October 29, 2023, $841.2 of which were unused. For the purpose of computing the unused credit lines, commercial paper and short-term bank borrowings of us and John Deere were considered to constitute utilization. See Note 8 for more information.\nDebt Ratings\nOur ability to obtain funding is affected by our debt ratings, which are closely related to the outlook for and the financial condition of John Deere, and the nature and availability of support facilities, such as our lines of credit and the support agreement from Deere & Company.\nTo access debt markets, we rely on credit rating agencies to assign short-term and long-term credit ratings to our debt. These ratings are an indicator of credit quality for fixed income investors. A debt rating is not a recommendation by the rating agency to buy, sell, or hold. A credit rating agency may change or withdraw ratings based on its assessment of our current and future ability to meet interest and principal repayment obligations. Lower credit ratings or negative changes to\nratings outlooks generally result in higher borrowing costs, including costs of derivative transactions, and reduced access to debt capital markets, and may adversely impact our liquidity.\nThe senior long-term and short-term debt ratings and outlook currently assigned to our unsecured debt securities by the rating agencies engaged by us are the same as those for John Deere and are as follows:\nSenior Long-Term\nShort-Term\nOutlook\nFitch Ratings\nA+\nStable\nMoodys Investors Service, Inc.\nA2\nPrime-1\nPositive\nStandard & Poors\nA\nA-1\nStable\nContractual Obligations and Cash Requirements\nOur material cash requirements from contractual and other cash obligations relate to borrowings, including securitization borrowings. As of October 29, 2023, we had $18,865.9 of principal payments on borrowings and securitization borrowings payable in the next 12 months, along with interest payments of $1,612.4. The securitization borrowing payments are based on the expected liquidation of the related retail notes securitized. Our borrowings will likely be replaced with new borrowings to finance the Receivables and Leases portfolio. See Notes 5, 7, and 9 for further detail regarding future contractual payments on securitization borrowings, intercompany borrowings, and long-term external borrowings.\nCritical Accounting Estimates\nThe timely preparation of financial statements requires management to make estimates and assumptions. Those estimates affect reported amounts in these financial statements. Changes in those estimates and assumptions could have a significant effect on our consolidated financial statements. The following estimates are the most critical to our consolidated financial statements:\n● allowance for credit losses,\n● operating lease residual values, and\n● income taxes.\nThese items require the most difficult, subjective, or complex judgments. Our accounting policies are described primarily in Note 2 of our Consolidated Financial Statements.\nAllowance for Credit Losses\nThe allowance for credit losses is an estimate of the credit losses expected over the life of our Receivable portfolio. The allowance is measured on a collective basis for receivables with similar risk characteristics. Receivables that do not share risk characteristics are evaluated on an individual basis. Risk characteristics include:\n● product category,\n● market,\n● geography,\n● credit risk, and\n● remaining balance.\nWe utilize the following loss forecast models to estimate expected credit losses:\n● Transition matrix models are used for large and complex Customer Receivable pools. These models are used for more than 90 percent of Customer Receivables. Historical portfolio performance and current delinquency levels are used to forecast future defaults. Estimated recovery rates are applied to the estimated default balance to calculate the expected credit losses.\n● Weighted-average remaining maturity (WARM) models are used for smaller and less complex Customer Receivable pools.\n● Historical loss rate models are used for wholesale receivables, with consideration of current economic conditions and dealer financial risk.\nThe model output is adjusted for forecasted economic conditions which may include the following economic indicators:\n● commodity prices,\n● industry equipment sales,\n● unemployment rates, and\n● housing starts.\nManagement reviews each models output quarterly, and qualitative adjustments are incorporated as necessary. See Note 4 to the Consolidated Financial Statements for further information.\nThe allowance for credit losses at October 29, 2023, October 30, 2022, and October 31, 2021 was $146.4, $128.4, and $129.0, respectively. The allowance for credit losses increased in 2023 compared to 2022, primarily driven by growth in the retail notes and financing lease portfolios and higher expected losses on turf and construction customer accounts.\nWhile we believe our allowance is sufficient to provide for losses over the life of our existing Receivables portfolio, different assumptions would result in changes to the allowance for credit losses, specifically:\n● For the wholesale receivable portfolio: Changes in economic conditions have historically had limited impact on credit losses.\n● Within the Customer Receivables portfolio: Credit loss estimates are dependent on a number of factors, including historical portfolio performance, current delinquency levels, and estimated recoveries on defaulted accounts.\nHolding all other factors constant, a 10 percent increase in the transition matrix models forecasted defaults as a result of elevated levels of delinquencies, deteriorating roll rates, or otherwise, and a simultaneous 10 percent decrease in recovery rates would have resulted in an increase to the allowance for credit losses of approximately $40 at October 29, 2023.\nOperating Lease Residual Values\nEquipment on operating leases is depreciated to the estimated residual value over the lease term. The residual values are based on several factors, including:\n● lease term,\n● expected hours of usage,\n● historical wholesale sale prices,\n● return experience,\n● intended equipment use,\n● market dynamics and trends, and\n● dealer residual value guarantees.\nWe review residual value estimates during the lease term. Depreciation is adjusted over the remaining lease term if residual value estimates are revised. Impairments are recorded when events or circumstances necessitate.\nAt the end of the majority of leases, the equipment is disposed in the following sequence:\n● The lessee has the option to purchase the equipment for the contractual residual value.\n● The dealer has the option to purchase the equipment.\n● The equipment is sold to a third party at the equipments fair value. In this situation, we may record a gain or loss for the difference between the residual value and the sale price.\nThe total operating lease residual values at October 29, 2023, October 30, 2022, and October 31, 2021 were $3,538.3, $3,366.7, and $3,547.6, respectively. The increase in 2023 was primarily due to a higher operating lease portfolio.\nHypothetically, if (a) future market values for equipment on operating leases were to decrease 10 percent from our present estimates and (b) all the equipment on operating leases were returned to us for remarketing at the end of the lease term, the total unfavorable impact after consideration of dealer residual value guarantees would be approximately $80. This amount would be recognized as higher depreciation expense over the remaining term of the operating leases, or potentially as an impairment.\nIncome Taxes\nWe are subject to federal, state, and foreign income taxes. These tax laws can be complex. Significant judgment and interpretation is required to implement them. Changes in tax laws could materially affect our consolidated financial statements. We record our tax positions in the following categories:\n● current taxes,\n● deferred taxes, and\n● uncertain tax positions.\nDeferred income taxes represent temporary differences between the tax and the financial reporting basis of assets and liabilities. This will result in taxable or deductible amounts in the future. Loss carryforwards and tax credits are significant components of deferred tax asset balances. These assets are reviewed regularly for the following:\n● the likelihood of recoverability from future taxable income,\n● reversal of deferred tax liabilities, and\n● tax planning strategies.\nValuation allowances are established when we determine that the deferred tax benefit may not be realized. The recoverability analysis requires significant judgment and relies on estimates. Changes in foreign income tax laws, income for certain jurisdictions, or our tax structure could impact the valuation allowance balance.\nSome tax positions contain significant uncertainties. These positions may be challenged or disallowed by taxing authorities. If it is likely the position will be disallowed, no tax benefit is recorded. If it is likely the position will be sustained, a tax benefit is recognized. The ultimate resolution could take many years. This may result in a payment that is significantly different from the original estimate.\nSee Note 14 for further information on income taxes.\nForward-Looking Statements\nCertain statements contained herein, including in the section entitled Overview relating to future events, expectations, and trends constitute forward-looking statements as defined in the Private Securities Litigation Reform Act of 1995.\nForward-looking statements are based on currently available information and current assumptions, expectations, and projections about future events and should not be relied upon. Except as required by law, we expressly disclaim any obligation to update or revise our forward-looking statements. Many factors, risks, and uncertainties could cause actual results to differ materially from these forward-looking statements. Among these factors are risks related to:\n● volumes of Receivables and Leases being dependent upon the level of retail sales and leases of John Deere products;\n● changes in U.S., foreign and international laws, regulations, and policies relating to trade, spending, taxing, banking, monetary, environmental (including climate change and engine emission), and farming policies;\n● political, economic, and social instability of the geographies in which we and John Deere operate;\n● including the ongoing wars between Russia and Ukraine and between Israel and Hamas;\n● adverse macroeconomic conditions, including unemployment, inflation, rising interest rates, changes in consumer practices due to slower economic growth or possible recession, and regional or global liquidity constraints;\n● growth and sustainability of non-food uses for crops (including ethanol and biodiesel production);\n● John Deeres and our ability to execute business strategies, including John Deeres Smart Industrial Operating Model and Leap Ambitions;\n● John Deeres and our ability to understand and meet customers changing expectations and demand for John Deere products and solutions, including our financing solutions;\n● John Deeres and our ability to adapt in highly competitive markets;\n● John Deeres dealer practices and their ability to manage distribution of John Deere products and support and service precision technology solutions;\n● changes in climate patterns, unfavorable weather events, and natural disasters;\n● governmental and other actions designed to address climate change in connection with a transition to a lower-carbon economy;\n● higher interest rates and currency fluctuations, which could adversely affect the U.S. dollar, customer confidence, access to capital, and demand for John Deeres and our products and solutions;\n● stress in the banking sector may have adverse impacts on vendors or customers as well as on our ability to access cash deposits;\n● changes in our credit ratings and any failure to comply with financial covenants in credit agreements could impact access to funding;\n● availability and price of raw materials, components, whole goods, and used equipment;\n● delays or disruptions in John Deeres supply chain;\n● the ability to attract, develop, engage, and retain qualified personnel;\n● security breaches, cybersecurity attacks, technology failures, and other disruptions to the information technology infrastructure and products of John Deere, their products, or us;\n● compliance with evolving U.S. and foreign laws, including economic sanctions, data privacy, and environmental laws and regulations;\n● investigations, claims, lawsuits, or other legal proceedings;\n● events that damage John Deeres or our reputation or brand;\n● world grain stocks, available farm acres, soil conditions, harvest yields, prices for commodities and livestock, input costs, and availability of transport for crops; and\n● housing starts and supply, real estate and housing prices, levels of public and non-residential construction, and infrastructure investment.\nFurther information concerning our business, including factors that could materially affect our financial results, is included in our filings with the SEC (including, but not limited to, the factors discussed in Item 1A. Risk Factors of this Annual Report on Form 10-K). There also may be other factors that we cannot anticipate or that are not described herein because we do not currently perceive them to be material. Our business is closely related to John Deeres business. Further information, including factors that could materially affect our financial results and John Deeres financial results, is included in the most recent Deere & Company Annual Report on Form 10-K (including, but not limited to, the factors discussed in Item 1A., Risk Factors of the most recent Annual Report on Form 10-K) and other Deere & Company filings with the SEC. Item 7A. Quantitative and Qualitative Disclosures About Market Risk.\nFinancial Instrument Market Risk Information\nWe are naturally exposed to various interest rate and foreign currency risks. In an effort to mitigate the effects of such risks, we enter into derivative transactions to manage this exposure and not for speculative purposes.\nFrom time to time, we enter into interest rate swap agreements to manage our interest rate exposure. We also have foreign currency exposures at some of our foreign and domestic operations related to financing in currencies other than the functional currencies. We have entered into derivative agreements related to the management of these foreign currency transaction risks.\nInterest Rate Risk\nResults of Operations - Central bank policy rates increased in 2022 and 2023. Rising interest rates have historically impacted our borrowings sooner than the benefit is realized from the Receivable and Lease portfolio. As a result, our financing spread was unfavorably impacted in 2023 compared to 2022. If interest rates continue to rise, we expect to continue experiencing spread compression in 2024.\nFair Value Measurement - Quarterly, we use a combination of cash flow models to assess the sensitivity of our financial instruments with interest rate exposure to changes in market interest rates. The models calculate the effect of adjusting interest rates as follows:\n● cash flows for Receivables are discounted at the current prevailing rate for each Receivable portfolio,\n● cash flows for unsecured borrowings are discounted at the applicable benchmark yield curve plus market credit spreads for similarly rated borrowers,\n● cash flows for securitized borrowings are discounted at the swap yield curve plus a market credit spread for similarly rated borrowers, and\n● cash flows for interest rate swaps are projected and discounted using forward rates from the swap yield curve at the repricing dates.\nThe net loss in these financial instruments fair values, which would be caused by increasing the interest rates by 10 percent from the market rates at October 29, 2023 and October 30, 2022, would have been approximately $137 and $115, respectively.\nReference Rate Reform - We transitioned our financing, funding, and hedging portfolios from the London Interbank Offered Rate (LIBOR) to alternative reference rates. These transition activities did not have a material impact on our financial statements.\nForeign Currency Risk\nOur policy is to manage foreign currency risk through hedging strategies if the currency of the borrowings does not match the currency of the Receivable portfolio. As a result, a hypothetical 10 percent adverse change in the value of the U.S. dollar relative to all other foreign currencies would not have a material effect on our cash flows. Item 8. Financial Statements and Supplementary Data.\nSee accompanying table of contents of financial statements on page 35. Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure.\nNot applicable. Item 9A. Controls and Procedures.\nDisclosure Controls and Procedures\nOur principal executive officer and our principal financial officer have concluded that our disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) of the Securities Exchange Act of 1934, as amended (the Exchange Act)) were effective as of October 29, 2023, based on the evaluation of these controls and procedures required by Rule 13a-15(b) or 15d-15(b) of the Exchange Act.\nManagements Report on Internal Control Over Financial Reporting\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting. Our internal control system was designed to provide reasonable assurance regarding the preparation and fair presentation of published financial statements in accordance with generally accepted accounting principles in the U.S.\nAll internal control systems, no matter how well designed, have inherent limitations. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation in accordance with generally accepted accounting principles in the U.S.\nManagement assessed the effectiveness of our internal control over financial reporting as of October 29, 2023, using the criteria set forth in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on that assessment, management concluded that, as of October 29, 2023, our internal control over financial reporting was effective.\nThis Annual Report on Form 10-K does not include an attestation report of our independent registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by our independent registered public accounting firm pursuant to rules of the Securities and Exchange Commission that permit us to provide only managements report in this Annual Report on Form 10-K.\nChanges in Internal Control Over Financial Reporting\nDuring the fourth quarter, there were no changes that have materially affected or are reasonably likely to materially affect our internal control over financial reporting. Item 9B. Other Information.\nOn December 14, 2023, we entered into an amended and restated international support agreement (the International Support Agreement) with Deere & Company and certain of our wholly-owned subsidiaries, pursuant to which we and Deere & Company have agreed to make periodic support payments to each other if and to the extent necessary to ensure our International Business (defined as our businesses in certain international markets, including Mexico, Argentina and Chile) earns a specified target return on equity. The International Support Agreement was amended and restated to include the impact of foreign exchange gains/losses in the calculation of the amount of support payments payable thereunder. The International Support Agreement is intended to ensure our ability to support Deere & Companys operations in the applicable jurisdictions.\nThe International Support Agreement may be terminated by us or Deere & Company upon thirty days notice to the other party. Deere & Companys obligations to make payments under the International Support Agreement are expressly stated not to be a guarantee of any specific indebtedness, obligation, or liability of ours. The foregoing summary of the International Support Agreement does not purport to be complete and is subject to, and qualified in its entirety by, the full text of the International Support Agreement, a copy of which is filed herewith as Exhibit 10.11 and is incorporated into this report by reference.\nItem 9C. Disclosure Regarding Foreign Jurisdictions That Prevent Inspections.\nNot applicable.\nPART III Item 10. Directors, Executive Officers, and Corporate Governance.\nOmitted pursuant to Instruction I(2). Item 11. Executive Compensation.\nOmitted pursuant to Instruction I(2). Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nOmitted pursuant to Instruction I(2). Item 13. Certain Relationships and Related Transactions, and Director Independence.\nOmitted pursuant to Instruction I(2). Item 14. Principal Accountant Fees and Services.\nFor the years ended October 29, 2023 and October 30, 2022, professional services were performed by Deloitte & Touche LLP (PCAOB ID No. 34), the member firms of Deloitte Touche Tohmatsu, and their respective affiliates (collectively called Deloitte & Touche).\nAudit Fees\nThe aggregate fees billed include amounts for the audit of our annual financial statements, the reviews of the financial statements included in our Quarterly Reports on Form 10-Q, including services related thereto such as comfort letters, statutory audits, attest services, consents, and assistance with and review of documents filed with the SEC and other regulatory bodies. Audit fees for the fiscal years ended October 29, 2023 and October 30, 2022 were $4.1 and $3.4, respectively.\nAudit-Related Fees\nDuring the last two fiscal years, Deloitte & Touche has provided us with assurance and related services that are reasonably related to the performance of the audit of our financial statements. The aggregate fees billed for such audit-related services for each of the fiscal years ended October 29, 2023 and October 30, 2022 were $.3. These services included various attest services.\nTax Fees\nThere were no fees billed for professional services provided by Deloitte & Touche in connection with tax advice and tax planning services for the fiscal years ended October 29, 2023 and October 30, 2022.\nAll Other Fees\nThere were no fees billed by Deloitte & Touche for services not included above for the fiscal years ended October 29, 2023 and October 30, 2022.\nPre-approval of Services by the Independent Registered Public Accounting Firm\nAs a wholly-owned subsidiary of Deere & Company, audit and non-audit services provided by our independent registered public accounting firm are subject to Deere & Companys Audit Review Committee pre-approval policies and procedures as described in the Deere & Company 2023 proxy statement. During the fiscal year ended October 29, 2023, all services provided by the independent registered public accounting firm were pre-approved by Deere & Companys Audit Review Committee in accordance with such policy.\nPART IV Item 15. Exhibits and Financial Statement Schedules.\n(1)\nFinancial Statements\nSee the table of contents to financial statements on page 35.\n(2)\nFinancial Statement Schedules\nNone.\n(3)\nExhibits\nSee the index to exhibits on page 72.\nItem 16. Form 10-K Summary.\nNone.\nPage\nFinancial Statements:\nJohn Deere Capital Corporation and Subsidiaries:\nReport of Independent Registered Public Accounting Firm\nStatements of Consolidated Income\nFor the Years Ended October 29, 2023, October 30, 2022, and October 31, 2021\nStatements of Consolidated Comprehensive Income\nFor the Years Ended October 29, 2023 October 30, 2022, and October 31, 2021\nConsolidated Balance Sheets\nAs of October 29, 2023 and October 30, 2022\nStatements of Consolidated Cash Flows\nFor the Years Ended October 29, 2023, October 30, 2022, and October 31, 2021\nStatements of Changes in Consolidated Stockholders Equity\nFor the Years Ended October 31, 2021, October 30, 2022, and October 29, 2023\nNotes to Consolidated Financial Statements\nSchedules Omitted\nThe following schedules are omitted because of the absence of conditions under which they are required or because the required information is included in the Notes to the Consolidated Financial Statements:\nI, II, III, IV, and V.\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the stockholders and the Board of Directors of John Deere Capital Corporation:\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of John Deere Capital Corporation and subsidiaries (the Company) as of October 29, 2023 and October 30, 2022, the related statements of consolidated income, consolidated comprehensive income, changes in consolidated stockholders equity, and consolidated cash flows, for each of the three years in the period ended October 29, 2023, and the related notes (collectively referred to as the \"financial statements\"). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of October 29, 2023 and October 30, 2022, and the results of its operations and its cash flows for each of the three years in the period ended October 29, 2023, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current-period audit of the financial statements that was communicated or required to be communicated to the audit committee and that (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nAllowance for Credit Losses - Refer to Notes 2 and 4 to the financial statements\nCritical Audit Matter Description\nThe allowance for credit losses is an estimate of the credit losses expected over the life of the Companys receivable portfolio. Non-performing receivables are included in the estimate of expected credit losses. The allowance is measured on a collective basis for receivables with similar risk characteristics. Receivables that do not share risk characteristics are evaluated on an individual basis. Risk characteristics include:\n● product category,\n● market,\n● geography,\n● credit risk,\n● remaining balance.\nThe Company utilizes the following loss forecast models to estimate expected credit losses:\nCustomer Receivables:\n● Transition matrix models are used for large and complex customer receivable pools. These models are used for more than 90 percent of customer receivables and estimate credit losses using historical delinquency and default information to assign probabilities that a receivable will pay as contractually scheduled or become delinquent and advance through the various delinquency stages. The model simulates the runoff of the portfolio, month-by-month, over the life of the receivables until the balances are fully repaid or default, using roll rates applied to the outstanding portfolio. The roll rates are applied based on the delinquency status of the customer accounts and are further segmented based on the credit risk and remaining balance of the underlying receivables. Estimated recovery rates are applied to the balance at default to calculate the expected credit losses.\n● Weighted-average remaining maturity (WARM) models are used for smaller and less complex customer receivable pools, and apply historical average annual loss rates, adjusted for current and forecasted economic conditions, to the projected portfolio runoff.\nWholesale receivables:\n● Historical loss rate models are used for wholesale receivables, with consideration of current economic conditions and dealer financial risk. Changes in economic conditions have historically had limited impact on credit losses in this portfolio.\nThe model output is adjusted for forecasted economic conditions, which may include the economic indicators listed below. Management also reviews each models output quarterly, and qualitative adjustments are incorporated as necessary.\n● commodity prices\n● industry equipment sales\n● unemployment rates\n● housing starts\nWe identified the allowance for credit losses estimated for the Companys United States receivable portfolio by the transition matrix models and related reasonable and supportable forecast and qualitative adjustment as a critical audit matter because determining the appropriate methodology and assumptions used in the estimate requires significant judgment by management. Given the subjective nature and judgment applied by management to determine the allowance for credit losses, auditing the methodology and assumptions requires a high degree of auditor judgment and an increased extent of effort, including the need to involve credit specialists.\nHow the Critical Audit Matter Was Addressed in the Audit\nOur audit procedures related to testing the United States portion of the Companys allowance for credit losses estimated by the transition matrix models and related reasonable and supportable forecast and qualitative adjustment included the following, among others:\n● We tested the effectiveness of managements controls over the methodology, data and assumptions used to estimate the allowance for credit losses.\n● We tested the accuracy and evaluated the relevance of the underlying historical data used in the Companys transition matrix model.\n● With the assistance of our credit specialists, we evaluated the reasonableness and accuracy of the transition matrix model used to estimate the allowance for credit losses, including model assumptions and the selection and application of relevant risk characteristics and use of qualitative adjustments.\n● We evaluated qualitative adjustments to the model estimate. Our evaluation included:\no Comparison of qualitative factors used by the Company to source data provided by the Company and/or to externally available data\no Consideration and evaluation of contradictory evidence\nWe evaluated managements ability to accurately forecast credit losses by performing a retrospective review, which involved comparing actual credit losses to historical estimates.\n/s/ DELOITTE & TOUCHE LLP\nChicago, Illinois\nDecember 15, 2023\nWe have served as the Companys auditor since 1959.\nJohn Deere Capital Corporation and Subsidiaries\nStatements of Consolidated Income\nFor the Years Ended October 29, 2023, October 30, 2022, and October 31, 2021\n(in millions)\nRevenues\nFinance income earned on retail notes\n$\n1,494.7\n$\n1,064.5\n$\n976.0\nLease revenues\n997.3\n963.7\n1,028.3\nRevolving charge account income\n417.4\n300.2\n298.1\nFinance income earned on wholesale receivables\n889.8\n342.5\n299.8\nOther income\n176.3\n135.7\n121.5\nTotal revenues\n3,975.5\n2,806.6\n2,723.7\nExpenses\nInterest expense\n1,671.5\n497.3\n472.9\nOperating expenses:\nDepreciation of equipment on operating leases\n659.7\n667.7\n733.4\nAdministrative and operating expenses\n569.4\n501.6\n471.8\nFees and interest paid to John Deere\n252.6\n222.1\n168.3\nProvision (credit) for credit losses\n88.5\n23.5\n(.9)\nTotal operating expenses\n1,570.2\n1,414.9\n1,372.6\nTotal expenses\n3,241.7\n1,912.2\n1,845.5\nIncome of Consolidated Group before Income Taxes\n733.8\n894.4\n878.2\nProvision for income taxes\n165.9\n205.6\n193.8\nIncome of Consolidated Group\n567.9\n688.8\n684.4\nEquity in income of unconsolidated affiliate\n3.9\n4.5\n3.0\nNet Income\n571.8\n693.3\n687.4\nLess: Net income (loss) attributable to noncontrolling interests\n(.5)\n(.3)\n.2\nNet Income Attributable to the Company\n$\n572.3\n$\n693.6\n$\n687.2\nThe accompanying Notes to Consolidated Financial Statements are an integral part of this statement.\nJohn Deere Capital Corporation and Subsidiaries\nStatements of Consolidated Comprehensive Income\nFor the Years Ended October 29, 2023, October 30, 2022, and October 31, 2021\n(in millions)\nNet Income\n$\n571.8\n$\n693.3\n$\n687.4\nOther Comprehensive Income (Loss), Net of Income Taxes\nCumulative translation adjustment\n32.2\n(114.5)\n15.0\nUnrealized gain (loss) on derivatives\n(32.0)\n60.0\n13.5\nUnrealized gain (loss) on debt securities\n.1\n(.8)\n(.1)\nOther Comprehensive Income (Loss), Net of Income Taxes\n.3\n(55.3)\n28.4\nComprehensive Income of Consolidated Group\n572.1\n638.0\n715.8\nLess: Comprehensive income (loss) attributable to noncontrolling interests\n(.5)\n(.3)\n.2\nComprehensive Income Attributable to the Company\n$\n572.6\n$\n638.3\n$\n715.6\nThe accompanying Notes to Consolidated Financial Statements are an integral part of this statement.\nJohn Deere Capital Corporation and Subsidiaries\nConsolidated Balance Sheets\nAs of October 29, 2023 and October 30, 2022\n(in millions)\nAssets\nCash and cash equivalents\n$\n1,487.5\n$\n661.8\nMarketable securities\n1.4\n1.1\nReceivables:\nRetail notes\n24,641.1\n22,799.0\nRetail notes securitized\n7,356.8\n5,951.6\nRevolving charge accounts\n4,594.4\n4,165.8\nWholesale receivables\n13,330.1\n8,404.5\nFinancing leases\n1,421.8\n1,120.7\nTotal receivables\n51,344.2\n42,441.6\nAllowance for credit losses\n(146.4)\n(128.4)\nTotal receivables - net\n51,197.8\n42,313.2\nOther receivables\n162.0\n91.4\nReceivables from John Deere\n144.4\n214.8\nEquipment on operating leases - net\n5,051.5\n4,853.5\nNotes receivable from John Deere\n650.7\n370.7\nInvestment in unconsolidated affiliate\n27.6\n22.6\nDeferred income taxes\n24.6\n25.5\nOther assets\n367.5\n314.3\nTotal Assets\n$\n59,115.0\n$\n48,868.9\nLiabilities and Stockholders Equity\nShort-term external borrowings:\nCommercial paper and other notes payable\n$\n6,836.1\n$\n2,402.3\nSecuritization borrowings\n6,995.2\n5,710.9\nCurrent maturities of long-term external borrowings\n6,059.9\n5,989.6\nTotal short-term external borrowings\n19,891.2\n14,102.8\nNotes payable to John Deere\n3,184.0\n5,225.5\nOther payables to John Deere\n974.9\n1,024.2\nAccounts payable and accrued expenses\n1,128.3\n957.3\nDeposits held from dealers and merchants\n138.4\n137.3\nDeferred income taxes\n456.3\n208.5\nLong-term external borrowings\n27,439.3\n22,527.8\nTotal liabilities\n53,212.4\n44,183.4\nCommitments and contingencies (Note 17)\nStockholders equity:\nCommon stock, without par value (issued and outstanding -\n2,500 shares owned by John Deere Financial Services, Inc.)\n2,292.8\n1,482.8\nRetained earnings\n3,713.2\n3,305.9\nAccumulated other comprehensive loss\n(104.4)\n(104.7)\nTotal Company stockholders equity\n5,901.6\n4,684.0\nNoncontrolling interests\n1.0\n1.5\nTotal stockholders equity\n5,902.6\n4,685.5\nTotal Liabilities and Stockholders Equity\n$\n59,115.0\n$\n48,868.9\nThe accompanying Notes to Consolidated Financial Statements are an integral part of this statement.\nJohn Deere Capital Corporation and Subsidiaries\nStatements of Consolidated Cash Flows\nFor the Years Ended October 29, 2023, October 30, 2022, and October 31, 2021\n(in millions)\nCash Flows from Operating Activities:\nNet income\n$\n571.8\n$\n693.3\n$\n687.4\nAdjustments to reconcile net income to net cash\nprovided by operating activities:\nProvision (credit) for credit losses\n88.5\n23.5\n(.9)\nProvision for depreciation and amortization\n686.0\n692.1\n756.6\nProvision (credit) for deferred income taxes\n257.2\n(35.3)\n(89.7)\nChange in accounts payable and accrued expenses\n191.8\n12.0\n(17.9)\nChange in accrued income taxes payable/receivable\n(47.4)\n(31.9)\n(11.1)\nOther\n(211.7)\n(147.8)\n41.5\nNet cash provided by operating activities\n1,536.2\n1,205.9\n1,365.9\nCash Flows from Investing Activities:\nCost of receivables acquired (excluding wholesale)\n(25,776.6)\n(23,941.6)\n(22,438.0)\nCollections of receivables (excluding wholesale)\n21,553.4\n19,967.5\n18,147.4\nDecrease (increase) in wholesale receivables - net\n(4,836.1)\n(2,737.6)\n1,197.1\nCost of equipment on operating leases acquired\n(2,362.5)\n(2,067.1)\n(1,845.7)\nProceeds from sales of equipment on operating leases\n1,528.6\n1,547.4\n1,569.1\nCost of notes receivable acquired from John Deere\n(397.5)\n(351.9)\n(321.5)\nCollections of notes receivable from John Deere\n122.5\n367.4\n297.5\nOther\n(9.8)\n9.1\n2.4\nNet cash used for investing activities\n(10,178.0)\n(7,206.8)\n(3,391.7)\nCash Flows from Financing Activities:\nIncrease in commercial paper and other notes payable - net (original maturities of three months or less)\n2,643.8\n1,716.6\n504.9\nIncrease (decrease) in securitization borrowings - net\n1,285.1\n1,119.7\n(60.7)\nIncrease (decrease) in short-term borrowings with John Deere - net\n(2,017.0)\n88.6\n392.8\nProceeds from external borrowings issued (original maturities greater than three months)\n13,020.4\n9,255.3\n7,418.3\nPayments of external borrowings (original maturities greater than three months)\n(6,046.2)\n(5,754.4)\n(5,710.4)\nDividends paid\n(165.0)\n(370.0)\n(485.0)\nCapital investments from John Deere\n810.0\nDebt issuance costs\n(50.9)\n(38.7)\n(33.7)\nNet cash provided by financing activities\n9,480.2\n6,017.1\n2,026.2\nEffect of Exchange Rate Changes on Cash, Cash Equivalents, and Restricted Cash\n8.4\n(22.9)\n3.0\nNet Increase (Decrease) in Cash, Cash Equivalents, and Restricted Cash\n846.8\n(6.7)\n3.4\nCash, Cash Equivalents, and Restricted Cash at Beginning of Year\n766.1\n772.8\n769.4\nCash, Cash Equivalents, and Restricted Cash at End of Year\n$\n1,612.9\n$\n766.1\n$\n772.8\nComponents of Cash, Cash Equivalents, and Restricted Cash:\nCash and cash equivalents\n$\n1,487.5\n$\n661.8\n$\n677.0\nRestricted cash*\n125.4\n104.3\n95.8\nTotal Cash, Cash Equivalents, and Restricted Cash\n$\n1,612.9\n$\n766.1\n$\n772.8\n* Restricted cash is reported in other assets on the consolidated balance sheets and primarily relates to the securitization of receivables (see Note 5).\nThe accompanying Notes to Consolidated Financial Statements are an integral part of this statement.\nJohn Deere Capital Corporation and Subsidiaries\nStatements of Changes in Consolidated Stockholders Equity\nFor the Years Ended October 31, 2021, October 30, 2022 and October 29. 2023\n(in millions)\nCompany Stockholder\nAccumulated\nTotal\nOther\nNon-\nStockholders\nCommon\nRetained\nComprehensive\ncontrolling\nEquity\nStock\nEarnings\nIncome (Loss)\nInterests\nBalance November 1, 2020\n$\n4,212.9\n$\n1,482.8\n$\n2,806.3\n$\n(77.8)\n$\n1.6\nASU No. 2016-13 adoption\n(26.2)\n(26.2)\nNet income\n687.4\n687.2\n.2\nOther comprehensive income\n28.4\n28.4\nDividends declared\n(485.0)\n(485.0)\nBalance October 31, 2021\n4,417.5\n1,482.8\n2,982.3\n(49.4)\n1.8\nNet income (loss)\n693.3\n693.6\n(.3)\nOther comprehensive loss\n(55.3)\n(55.3)\nDividends declared\n(370.0)\n(370.0)\nBalance October 30, 2022\n4,685.5\n1,482.8\n3,305.9\n(104.7)\n1.5\nNet income (loss)\n571.8\n572.3\n(.5)\nOther comprehensive income\n.3\n.3\nCapital investments\n810.0\n810.0\nDividends declared\n(165.0)\n(165.0)\nBalance October 29, 2023\n$\n5,902.6\n$\n2,292.8\n$\n3,713.2\n$\n(104.4)\n$\n1.0\nThe accompanying Notes to Consolidated Financial Statements are an integral part of this statement.\nJohn Deere Capital Corporation and Subsidiaries\nNotes to Consolidated Financial Statements\nNote Listing\nPage\n1.\nOrganization and Consolidation\n2.\nSummary of Significant Accounting Policies and New Accounting Standards\n3.\nReceivables\n4.\nAllowance for Credit Losses and Credit Quality of Receivables\n5.\nSecuritization of Receivables\n6.\nLeases\n7.\nNotes Receivable from and Payable to John Deere\n8.\nShort-Term External Borrowings\n9.\nLong-Term External Borrowings\n10.\nCapital Stock\n11.\nCapital Investments and Dividends\n12.\nPension and Other Postretirement Benefits\n13.\nShare-Based Compensation\n14.\nIncome Taxes\n15.\nOther Income and Administrative and Operating Expenses\n16.\nSupplemental Cash Flow Information\n17.\nCommitments and Contingencies\n18.\nOther Comprehensive Income Items\n19.\nFair Value Measurements\n20.\nDerivative Instruments\n21.\nGeographic Area Information\n22.\nUnconsolidated Affiliated Company\n23.\nImmaterial Restatement of Prior Period Financial Statements\n24.\nSubsequent Events\nNote 1. Organization and Consolidation\nCorporate Organization\nReferences to John Deere Capital Corporation (Capital Corporation), the Company, we, us, or our include our consolidated subsidiaries. John Deere Financial Services, Inc. (JDFS), a wholly-owned finance holding subsidiary of Deere & Company, owns all of the outstanding common stock of Capital Corporation. We conduct business in Australia, New Zealand, the U.S., and in several countries in Africa, Asia, Europe, and Latin America, including Argentina and Mexico. Deere & Company and its wholly-owned subsidiaries are collectively called John Deere.\nRetail notes, revolving charge accounts, and financing leases are collectively called Customer Receivables. Customer Receivables and wholesale receivables are collectively called Receivables. Receivables and equipment on operating leases are collectively called Receivables and Leases.\nWe bear substantially all of the credit risk (net of recovery from withholdings from certain John Deere dealers and merchants) associated with our holding of Receivables and Leases. We secure our Receivables, other than certain revolving charge accounts, by retaining as collateral security in the equipment associated with those Receivables or with the use of other collateral, and require theft and physical damage insurance on such equipment. A small portion of the Receivables and Leases held (less than 5 percent) is guaranteed by certain subsidiaries of Deere & Company. We also perform substantially all servicing and collection functions. Servicing and collection functions for a small portion of the Receivables and Leases held (less than 5 percent) are provided by John Deere. John Deere is reimbursed for staff and other administrative services at estimated cost, and for credit lines provided to us based on utilization of those lines.\nPrinciples of Consolidation\nThe consolidated financial statements represent the consolidation of all companies in which Capital Corporation has a controlling interest. Certain variable interest entities (VIEs) are consolidated since we are the primary beneficiary. The primary beneficiary has both the power to direct the activities that most significantly impact the VIEs economic performance and the obligation to absorb losses or the right to receive benefits that could potentially be significant to the VIEs. We consolidate certain VIEs that are special purpose entities (SPEs) related to the securitization of receivables (see Note 5). We record our investment in each unconsolidated affiliated company (20 to 50 percent ownership) at our related equity in the net assets of such affiliate (see Note 22).\nFiscal Year\nWe use a 52/53 week fiscal year ending on the last Sunday in the reporting period, which generally occurs near the end of October. An additional week is included in the fourth fiscal quarter every five or six years to realign our fiscal quarters with the calendar. The fiscal year ends for 2023, 2022, and 2021 were October 29, 2023, October 30, 2022, and October 31, 2021, respectively. Fiscal years 2023, 2022, and 2021 contained 52 weeks. Unless otherwise stated, references to particular years or quarters refer to our fiscal years and the associated periods in those fiscal years.\nPresentation of Amounts\nAll amounts are presented in millions of dollars, unless otherwise specified.\nImmaterial Restatement of Prior Period Financial Statements\nIn the second quarter of 2023, we corrected the accounting treatment for financing incentives offered to John Deere dealers, which impacted the timing of expense recognition and the presentation of incentive costs in our consolidated financial statements. Refer to Note 2 for further information regarding the new and previous accounting treatment. The impact of the correction in periods prior to the quarter ended April 30, 2023 was not material to our consolidated financial statements in any of the impacted periods; however, the aggregate impact of correcting prior periods within the quarter ended April 30, 2023 would have been material to our 2023 consolidated financial results. Consequently, we made these immaterial corrections in the comparative prior periods. Refer to Note 23 for quantification of the prior period restatement impacts. Additionally, comparative prior period amounts in the applicable notes to the consolidated financial statements have been restated.\nArgentina\nWe have financial services operations in Argentina. The U.S. dollar has historically been the functional currency for our Argentina operations, as its business is indexed to the U.S. dollar due to the highly inflationary conditions. The Argentine government has certain capital and currency controls that restrict our ability to access U.S. dollars in Argentina and remit earnings from our Argentine operations. As of October 29, 2023 and October 30, 2022, our net investment in Argentina was $41.1 and $53.5, respectively. Revenues from our Argentine operations represented approximately 2 percent and 3 percent of our consolidated revenues for 2023 and 2022, respectively. The net peso exposure as of October 29, 2023 and October 30, 2022 was approximately $31.8 and $45.6, respectively. Argentine peso-denominated monetary assets and liabilities are remeasured at each balance sheet date using the official currency exchange rate. During 2023, 2022, and 2021, we recognized pretax net foreign exchange losses of $27.4, $22.1, and $14.0, respectively, related to our Argentina operations.\nNote 2. Summary of Significant Accounting Policies and New Accounting Standards\nThe following are significant accounting policies in addition to those included in other notes to the consolidated financial statements.\nUse of Estimates in Financial Statements\nCertain accounting policies require management to make estimates and assumptions in determining the amounts reflected in the financial statements and related disclosures. Actual results could differ from these estimates.\nCash and Cash Equivalents\nWe consider investments with purchased maturities of three months or less to be cash equivalents.\nRevenue Recognition\nFinancing revenue, including compensation from John Deere for waived or reduced finance charges, is recorded over the lives of the related receivables using the interest method. Deferred costs on the origination of receivables are recognized as a reduction in finance revenue over the lives of the receivables using the interest method. Operating lease revenue, including compensation from John Deere, and deferred costs on the origination of operating leases are recognized on a straight-line basis over the scheduled lease terms in lease revenue.\nReceivables and Allowance for Credit Losses\nReceivables are reported on the consolidated balance sheets at outstanding principal and accrued interest, adjusted for any write-offs and any unamortized deferred fees or costs on originated Receivables. We also record an allowance for credit losses and provision for credit losses related to the Receivables. The allowance represents an estimate of the credit losses expected over the life of the Receivable portfolio. Receivables are written off to the allowance when the account is considered uncollectible. Refer to Note 4 for additional information.\nSecuritization of Receivables\nCertain Receivables are periodically transferred to SPEs in securitization transactions (see Note 5). These securitizations qualify as collateral for secured borrowings and no gains or losses are recognized at the time of securitization. The receivables remain on the consolidated balance sheets and are classified as Retail notes securitized. We recognize finance income over the lives of these receivables using the interest method.\nDepreciation\nWe estimate residual values of equipment on operating leases at the inception of the lease, and the equipment is depreciated over the lease terms to the estimated residual value using the straight-line method. We review residual value estimates during the lease term and depreciation is adjusted prospectively on a straight-line basis over the remaining lease term if residual estimates are revised.\nImpairment of Long-Lived Assets\nWe evaluate the carrying value of long-lived assets, including equipment on operating leases, when events or circumstances warrant such a review. If the carrying value of the long-lived asset is considered impaired, it is written down to its fair value.\nFees and Interest Paid to John Deere\nFees and interest paid to John Deere include corporate support fees and interest on intercompany borrowings from John Deere based on approximate market rates.\nDerivative Financial Instruments\nIt is our policy to use derivative transactions only to manage exposures from the normal course of business. We do not execute derivative transactions for the purpose of creating speculative positions or trading. We have interest rate and foreign currency fluctuation risk between the types and amounts of our Receivable and Lease portfolios and how these portfolios are funded. We also have foreign currency exposures at some of our foreign and domestic operations related to financing in currencies other than the functional currencies.\nAll derivatives are recorded at fair value on the consolidated balance sheets. Cash collateral received or paid is not offset against the derivative fair values on the consolidated balance sheets. The cash flows from the derivative contracts are recorded in operating activities in the statements of consolidated cash flows. Each derivative is designated as a cash flow hedge, fair value hedge, or remains undesignated.\nChanges in the fair value of derivatives are recorded as follows:\n● Cash flow hedges are recorded in other comprehensive income (OCI) and subsequently reclassified into interest expense in the same periods during which the effects of the hedged item (borrowings) impact earnings. These amounts offset the effects of interest rate changes on the related borrowings in interest expense.\n● Fair value hedges are recorded in interest expense, and the gains or losses are generally offset by the fair value gains or losses on the hedged items (fixed-rate borrowings), which are also recorded in interest expense.\n● Derivatives not designated as hedging instruments are recorded in interest expense (interest rate contracts) or administrative and operating expenses (foreign currency exchange contracts).\nAll designated hedges are formally documented as to the relationship with the hedged item as well as the risk-management strategy. Both at inception and on an ongoing basis, the hedging instrument is assessed for its effectiveness. If and when a derivative is determined not to be highly effective as a hedge, the underlying hedged transaction is no longer likely to occur, the hedge designation is removed, or the derivative is terminated, hedge accounting is discontinued (see Note 20).\nFinancing Incentives\nWe provide incentive funds to John Deere dealers that meet certain performance metrics, which include minimum finance volume and finance market share with us over a defined period. At the end of the qualification period, dealers are granted incentive funds, which can be applied to certain predefined uses, including interest rate reductions on future loan and lease originations. In addition, certain dealers may elect to receive cash for a portion of their earned funds. We accrue for the incentive costs over the qualification period, which are reported as Administrative and operating expenses in the consolidated income statements and Accounts payable and accrued expenses in the consolidated balance sheets. The accrued liability is released as dealers utilize the funds.\nAs mentioned in Note 1, in the second quarter of 2023 we corrected our accounting policy for financing incentives offered to John Deere dealers. Under the previous accounting treatment, we amortized the non-cash portion of the incentive program costs as a reduction to finance income or lease revenue after the dealers designated the use of the incentive award. There was no change to the accounting treatment for the cash portion of the incentive program costs, which continues to be accrued over the qualification period.\nForeign Currency Translation\nThe functional currencies for most of our foreign operations are their respective local currencies. The assets and liabilities of these operations are translated into U.S. dollars using the exchange rates at the end of the period. The revenues and expenses are translated at weighted-average rates for the period. The gains or losses from these translations are recorded in OCI. Gains or losses from transactions denominated in a currency other than the functional currency of the subsidiary involved and foreign currency exchange components of derivative contracts are included in net income. The pretax net losses for foreign currency exchange in 2023, 2022, and 2021 were $20.4, $25.6, and $14.9 respectively, which are reported in Administrative and operating expenses and primarily related to our Argentina operations (see Note 1).\nNew Accounting Standards\nWe closely monitor all Accounting Standard Updates (ASUs) issued by the Financial Accounting Standards Board (FASB) and other authoritative guidance. We adopted the following standards in 2023, none of which had a material effect on our consolidated financial statements:\nNew Accounting Standards Adopted\nNo. 2021-10 - Government Assistance (Topic 832): Disclosures by Business Entities about Government Assistance\nNo. 2021-05 - Leases (Topic 842): Lessors - Certain Leases with Variable Lease Payments\nNo. 2021-04 - Issuer's Accounting for Certain Modifications or Exchanges of Freestanding Equity Classified Written Call Options\nWe will adopt the following standards in future periods, none of which are expected to have a material effect on our consolidated financial statements:\nNew Accounting Standards to be Adopted\nNo. 2022-02 - Financial Instruments - Credit Losses (Topic 326): Troubled Debt Restructurings and Vintage Disclosures\nNo. 2022-01 - Derivatives and Hedging (Topic 815): Fair Value Hedging - Portfolio Layer Method\nNo. 2021-08 - Business Combinations (Topic 805): Accounting for Contract Assets and Contract Liabilities from Contracts with Customers\nNote 3. Receivables\nRetail Notes Receivable\nRetail notes receivable by market at October 29, 2023 and October 30, 2022 were as follows:\nUnrestricted\nSecuritized\nUnrestricted\nSecuritized\nAgriculture and turf - new\n$\n14,350.6\n$\n2,664.9\n$\n12,997.8\n$\n2,100.2\nAgriculture and turf - used\n7,344.9\n3,387.4\n6,745.8\n2,767.4\nConstruction and forestry - new\n2,884.1\n1,010.9\n2,776.5\n846.7\nConstruction and forestry - used\n1,067.4\n430.5\n1,105.0\n332.0\nTotal\n25,647.0\n7,493.7\n23,625.1\n6,046.3\nUnearned finance income\n(1,005.9)\n(136.9)\n(826.1)\n(94.7)\nRetail notes receivable\n$\n24,641.1\n$\n7,356.8\n$\n22,799.0\n$\n5,951.6\nGross retail note installments at October 29, 2023 and October 30, 2022 were scheduled to be received as follows:\nUnrestricted\nSecuritized\nUnrestricted\nSecuritized\nDue in:\n0-12 months\n$\n7,718.5\n$\n2,820.5\n$\n7,139.7\n$\n2,225.2\n13-24 months\n6,146.8\n2,088.5\n5,668.8\n1,667.4\n25-36 months\n5,047.0\n1,509.0\n4,677.8\n1,208.9\n37-48 months\n3,724.5\n824.4\n3,427.2\n709.3\n49-60 months\n2,321.1\n240.5\n2,057.6\n226.8\nOver 60 months\n689.1\n10.8\n654.0\n8.7\nTotal\n$\n25,647.0\n$\n7,493.7\n$\n23,625.1\n$\n6,046.3\nFinance income is recognized over the lives of the retail notes using the interest method. During 2023, the average effective yield on retail notes held by us was approximately 5.0 percent, compared with 3.9 percent in 2022 and 4.0 percent in 2021. As of October 29, 2023 and October 30, 2022, over 95 percent of the retail notes held by us bore a fixed finance rate.\nA portion of the finance income earned by us arises from financing of retail sales of John Deere equipment on which finance charges are waived or reduced by John Deere for a period from the date of the retail sale to a specified subsequent date. We receive compensation from John Deere equal to competitive market interest rates for periods during which finance charges have been waived or reduced. We compute the compensation from John Deere for waived or reduced finance charges based on our estimated funding costs, administrative and operating expenses, credit losses, and required return on equity. The financing rate following the waiver or interest reduction period is not significantly different from the compensation rate from John Deere. During 2023, 2022, and 2021, the finance income earned from John Deere on retail notes containing waiver of finance charges or reduced rates was $388.4, $328.3, and $325.0, respectively.\nA deposit is withheld by us on certain John Deere agriculture and turf equipment retail notes originating from dealers. Any subsequent retail note losses, subject to certain limitations by customer, are charged against the withheld deposits. At the end of each calendar quarter, the balance of each dealers withholding account in excess of a specified percent (ranging from one-half to three percent based on dealer qualifications) of the total balance outstanding on retail notes originating with that dealer is remitted to the dealer. Credit losses recovered from dealer deposits are presented in Other income at the time the dealer deposits are charged. There is generally no withholding of dealer deposits on John Deere construction and forestry equipment retail notes.\nRevolving Charge Accounts Receivable\nRevolving charge account income is comprised of the following:\n● discounts paid by dealers and merchants on most transactions for processing and support,\n● finance charges paid by customers on their outstanding account balances, and\n● finance charge subsidies from John Deere and sponsoring merchants for waiver of finance charges or reduced rates.\nDuring 2023, 2022, and 2021, the finance income earned from John Deere on revolving charge accounts containing waiver of finance charges or reduced rates was $18.5, $13.4, and $14.3, respectively. Revolving charge accounts receivable at October 29, 2023 and October 30, 2022 totaled $4,594.4 and $4,165.8, and were net of unearned interest income of $88.4 and $59.2 for the same periods, respectively. Generally, account holders may pay their account balance in full at any time or make payments over a number of months according to a payment schedule.\nWholesale Receivables\nWe also provide wholesale financing to dealers of John Deere agriculture and turf equipment and construction and forestry equipment, primarily to finance inventories of equipment for those dealers. Wholesale finance income related to these notes is generally recognized monthly based on the daily balance of wholesale receivables outstanding and the applicable effective interest rate. Interest rates vary with a bank base rate, the type of equipment financed, and dealer financial profile. Substantially all wholesale receivables are secured with collateral or other credit enhancements. On average, the wholesale receivables portfolio turned five times and seven times during 2023 and 2022, respectively. Wholesale receivables at October 29, 2023 and October 30, 2022 totaled $13,330.1 and $8,404.5, respectively. Wholesale receivables increased in 2023 compared to 2022 due to higher shipment volumes of John Deere equipment, in addition to higher dealer used inventory levels compared to historic lows in the prior year.\nWe purchase certain wholesale trade receivables from John Deere, which are included within Wholesale receivables. These trade receivables arise from John Deeres sales of goods to independent dealers. Under the terms of the sales to dealers, interest is primarily charged to dealers on outstanding balances, from the earlier of the date when goods are sold to retail customers by the dealer or the expiration of certain interest-free periods granted at the time of the sale to the dealer, until payment is received by us. Dealers cannot cancel purchases after John Deere recognizes a sale and are responsible for payment even if the equipment is not sold to retail customers. The interest-free periods are determined based on the type of equipment sold and the time of year of the sale. These periods range from one to twelve months for most equipment. Interest-free periods may not be extended. Interest charged may not be forgiven and the past due interest rates exceed market rates. We receive compensation from John Deere at approximate market interest rates for these interest-free periods. We compute the compensation from John Deere for interest-free periods based on our estimated funding costs, administrative and operating expenses, credit losses, and required return on equity. During 2023, 2022, and 2021, the compensation earned from John Deere on wholesale receivables for waiver of finance charges or reduced rates was $542.6, $239.0, and $197.9, respectively. The increase in 2023 was primarily due to higher average portfolio and higher average compensation rates due to increased funding costs.\nFinancing Leases\nWe lease agriculture and turf equipment and construction and forestry equipment directly to retail customers. Leases classified as sales-type or direct financing leases are reported in Financing leases on the consolidated balance sheets. See Note 6 to the Consolidated Financial Statements for detailed disclosures related to financing leases.\nConcentration of Credit Risk\nReceivables have significant concentrations of credit risk in the agriculture and turf and construction and forestry markets. On a geographic basis, 86 percent of our Receivables portfolio was located in the U.S., at October 29, 2023. There is not a disproportionate concentration of credit risk with any single customer or dealer.\nNote 4. Allowance for Credit Losses and Credit Quality of Receivables\nCredit Quality\nWe monitor the credit quality of Receivables based on delinquency status, defined as follows:\n● Past due balances represent Receivables still accruing finance income with any payments 30 days or more past the contractual payment due date.\n● Non-performing Receivables represent Receivables for which we have stopped accruing finance income, which generally occurs when Customer Receivables are 90 days delinquent and when interest-bearing wholesale receivables become 60 days delinquent. Accrued finance income and lease revenue previously recognized on non-performing Receivables is reversed and subsequently recognized on a cash basis. Accrual of finance income and lease revenue is resumed when the receivable becomes contractually current, and collections are reasonably assured.\nAccrued finance income and lease revenue reversed on non-performing Receivables, and finance income and lease revenue recognized from cash payments on non-performing Receivables were as follows:\nAccrued finance income and lease revenue reversed\n$\n17.1\n$\n11.3\n$\n12.4\nFinance income and lease revenue recognized on cash payments\n18.4\n15.4\n17.1\nTotal Receivable balances represent principal plus accrued interest. Receivable balances are written off to the allowance for credit losses when, in the judgment of management, they are considered uncollectible. Write-offs generally occur when Customer Receivables are 120 days delinquent, and on a case-by-case basis when wholesale receivables are 60 days delinquent. In these situations, collateral is repossessed (for collateral-dependent Receivables) or the account is designated for litigation, and the estimated uncollectible amount is written off to the allowance for credit losses.\nThe credit quality analysis of Customer Receivables by year of origination was as follows:\nOctober 29, 2023\nPrior Years\nRevolving Charge Accounts\nTotal\nCustomer Receivables:\nAgriculture and turf\nCurrent\n$\n12,998.3\n$\n7,208.2\n$\n4,459.1\n$\n1,970.4\n$\n666.3\n$\n179.3\n$\n4,424.8\n$\n31,906.4\n30-59 days past due\n46.8\n66.6\n34.6\n18.7\n8.2\n2.9\n28.1\n205.9\n60-89 days past due\n15.8\n22.0\n14.8\n7.8\n3.3\n1.3\n8.6\n73.6\n90+ days past due\n1.4\n.8\n2.7\n2.9\n.1\n.1\n8.0\nNon-performing\n25.9\n63.7\n44.5\n25.0\n12.9\n12.0\n7.2\n191.2\nConstruction and forestry\nCurrent\n2,343.4\n1,586.2\n859.0\n279.2\n65.3\n27.3\n118.6\n5,279.0\n30-59 days past due\n44.4\n28.1\n24.8\n8.6\n3.4\n.4\n4.1\n113.8\n60-89 days past due\n17.8\n11.4\n11.8\n4.5\n1.0\n.2\n1.8\n48.5\n90+ days past due\n.1\n1.2\n.1\n.1\n1.5\nNon-performing\n34.1\n67.5\n51.2\n20.7\n7.5\n4.0\n1.2\n186.2\nTotal Customer Receivables\n$\n15,528.0\n$\n9,055.7\n$\n5,502.6\n$\n2,337.9\n$\n768.0\n$\n227.5\n$\n4,594.4\n$\n38,014.1\nOctober 30, 2022\nPrior Years\nRevolving Charge Accounts\nTotal\nCustomer Receivables:\nAgriculture and turf\nCurrent\n$\n11,736.1\n$\n6,939.9\n$\n3,479.6\n$\n1,515.8\n$\n581.3\n$\n152.9\n$\n4,022.7\n$\n28,428.3\n30-59 days past due\n40.1\n55.8\n31.4\n15.0\n6.4\n2.7\n18.4\n169.8\n60-89 days past due\n11.8\n19.5\n10.8\n4.4\n2.0\n1.1\n4.5\n54.1\n90+ days past due\n.4\n.2\n.2\n.8\nNon-performing\n24.7\n38.4\n29.2\n13.7\n11.2\n10.2\n7.8\n135.2\nConstruction and forestry\nCurrent\n2,373.7\n1,526.3\n658.1\n230.7\n57.2\n10.5\n107.7\n4,964.2\n30-59 days past due\n44.5\n40.6\n20.7\n7.6\n1.8\n.6\n3.1\n118.9\n60-89 days past due\n18.1\n11.4\n6.0\n3.0\n.7\n.1\n1.0\n40.3\n90+ days past due\n.3\n1.3\n1.4\n3.0\nNon-performing\n19.3\n51.2\n27.6\n15.4\n5.5\n2.9\n.6\n122.5\nTotal Customer Receivables\n$\n14,269.0\n$\n8,684.6\n$\n4,263.6\n$\n1,807.0\n$\n666.1\n$\n181.0\n$\n4,165.8\n$\n34,037.1\nThe credit quality analysis of wholesale receivables by year of origination was as follows:\nOctober 29, 2023\nPrior Years\nRevolving\nTotal\nWholesale receivables:\nAgriculture and turf\nCurrent\n$\n609.5\n$\n92.6\n$\n20.0\n$\n3.9\n$\n.7\n$\n159.9\n$\n9,270.1\n$\n10,156.7\n30+ days past due\n45.8\n45.8\nNon-performing\n5.7\n5.7\nConstruction and forestry\nCurrent\n19.4\n2.5\n19.9\n.2\n.1\n75.2\n2,987.6\n3,104.9\n30+ days past due\n17.0\n17.0\nNon-performing\nTotal wholesale receivables\n$\n628.9\n$\n95.1\n$\n39.9\n$\n4.1\n$\n.8\n$\n235.1\n$\n12,326.2\n$\n13,330.1\nOctober 30, 2022\nPrior Years\nRevolving\nTotal\nWholesale receivables:\nAgriculture and turf\nCurrent\n$\n381.3\n$\n62.7\n$\n25.0\n$\n3.8\n$\n.3\n$\n1.1\n$\n6,238.1\n$\n6,712.3\n30+ days past due\n.1\n8.3\n8.4\nNon-performing\n5.5\n5.5\nConstruction and forestry\nCurrent\n4.8\n28.2\n1.4\n.4\n.1\n1,633.8\n1,668.7\n30+ days past due\n9.6\n9.6\nNon-performing\nTotal wholesale receivables\n$\n386.1\n$\n91.0\n$\n26.4\n$\n4.2\n$\n.4\n$\n1.1\n$\n7,895.3\n$\n8,404.5\nAllowance for Credit Losses\nThe allowance for credit losses is an estimate of the credit losses expected over the life of our Receivable portfolio. Non-performing Receivables are included in the estimate of expected credit losses. The allowance is measured on a collective basis for receivables with similar risk characteristics. Receivables that do not share risk characteristics are evaluated on an individual basis. Risk characteristics include:\n● product category,\n● market,\n● geography,\n● credit risk, and\n● remaining balance.\nWe utilize the following loss forecast models to estimate expected credit losses:\nCustomer Receivables:\n● Transition matrix models are used for large and complex Customer Receivable pools. These models are used for more than 90 percent of Customer Receivables and estimate credit losses using historical delinquency and default information to assign probabilities that a receivable will pay as contractually scheduled or become delinquent and advance through the various delinquency stages. The model simulates the runoff of the portfolio, month-by-month, over the life of the receivables until the balances are fully repaid or default, using roll rates applied to the outstanding portfolio. The roll rates are applied based on the delinquency status of the customer accounts and are further segmented based on the credit risk and remaining balance of the underlying receivables. Estimated recovery rates are applied to the balance at default to calculate the expected credit losses.\n● Weighted-average remaining maturity (WARM) models are used for smaller and less complex Customer Receivable pools, and apply historical average annual loss rates, adjusted for current and forecasted economic conditions, to the projected portfolio runoff.\nWholesale receivables:\n● Historical loss rate models are used for wholesale receivables, with consideration of current economic conditions and dealer financial risk. Changes in economic conditions have historically had limited impact on credit losses in this portfolio.\nThe model output is adjusted for forecasted economic conditions, which may include the economic indicators listed below.\n● commodity prices,\n● industry equipment sales,\n● unemployment rates, and\n● housing starts.\nManagement reviews each models output quarterly, and qualitative adjustments are incorporated as necessary.\nRecoveries from freestanding credit enhancements, such as dealer deposits and certain credit insurance contracts, are not included in the estimate of expected credit losses. Recoveries from dealer deposits are recognized in Other income when the dealers withholding account is charged. During 2023, 2022, and 2021, $17.0, $8.5 and $14.3, respectively, was recorded in other income related to recoveries from freestanding credit enhancements. At October 29, 2023 and October 30, 2022, we had $129.6 and $132.7, respectively, of deposits withheld from John Deere dealers and merchants available as credit enhancements for retail notes and financing leases.\nAn analysis of the allowance for credit losses and investment in Receivables at October 29, 2023, October 30, 2022, and October 31, 2021 was as follows:\nRetail Notes\nRevolving\n& Financing\nCharge\nWholesale\nTotal\nLeases\nAccounts\nReceivables\nReceivables\nAllowance:\nBeginning of year balance\n$\n95.4\n$\n21.9\n$\n11.1\n$\n128.4\nProvision (credit) for credit losses*\n67.6\n21.2\n(.2)\n88.6\nWrite-offs\n(60.8)\n(44.4)\n(.2)\n(105.4)\nRecoveries\n12.9\n21.8\n.6\n35.3\nTranslation adjustments\n(.2)\n(.1)\n(.2)\n(.5)\nEnd of year balance\n$\n114.9\n$\n20.4\n$\n11.1\n$\n146.4\nReceivables:\nEnd of year balance\n$\n33,419.7\n$\n4,594.4\n$\n13,330.1\n$\n51,344.2\nAllowance:\nBeginning of year balance\n$\n96.5\n$\n20.8\n$\n11.7\n$\n129.0\nProvision (credit) for credit losses*\n26.1\n(1.8)\n.1\n24.4\nWrite-offs\n(40.7)\n(26.8)\n(.3)\n(67.8)\nRecoveries\n14.4\n29.7\n.1\n44.2\nTranslation adjustments\n(.9)\n(.5)\n(1.4)\nEnd of year balance\n$\n95.4\n$\n21.9\n$\n11.1\n$\n128.4\nReceivables:\nEnd of year balance\n$\n29,871.3\n$\n4,165.8\n$\n8,404.5\n$\n42,441.6\nAllowance:\nBeginning of year balance\n$\n76.9\n$\n42.3\n$\n9.9\n$\n129.1\nASU No. 2016-13 adoption\n32.5\n(12.2)\n(.6)\n19.7\nProvision (credit) for credit losses*\n11.8\n(17.0)\n2.5\n(2.7)\nWrite-offs\n(36.7)\n(27.8)\n(.3)\n(64.8)\nRecoveries\n11.6\n35.5\n47.1\nTranslation adjustments\n.4\n.2\n.6\nEnd of year balance\n$\n96.5\n$\n20.8\n$\n11.7\n$\n129.0\nReceivables:\nEnd of year balance\n$\n26,933.3\n$\n3,740.1\n$\n5,951.3\n$\n36,624.7\n* Excludes provision (credit) for credit losses on unfunded commitments of $(.1), $(.9), and $1.8 for the years ended October 29, 2023, October 30, 2022, and October 31, 2021, respectively. The estimated credit losses related to unfunded commitments are recorded in Accounts payable and accrued expenses.\nThe allowance for credit losses increased in 2023 compared to 2022, primarily driven by growth in the retail notes and financing lease portfolios and higher expected losses on turf and construction customer accounts. We continue to monitor the economy as part of the allowance setting process, including potential impacts of inflation and interest rates, among other factors, and qualitative adjustments to the allowance are incorporated, as necessary.\nTroubled Debt Restructuring\nA troubled debt restructuring is a significant modification of debt in which a creditor grants a concession it would not otherwise consider to a debtor that is experiencing financial difficulties. These concessions may include a reduction of the stated interest rate, an extension of the maturity date, a reduction of the face amount or maturity amount of the debt, or a reduction of accrued interest. The following table includes Receivable contracts identified as troubled debt restructurings, which were primarily retail notes:\nNumber of receivable contracts\nPre-modification balance\n$\n7.2\n$\n7.0\n$\n12.0\nPost-modification balance\n6.7\n5.8\n10.7\nIn 2023, 2022, and 2021, we had no significant troubled debt restructurings that subsequently defaulted and were written off. At October 29, 2023, we had no commitments to provide additional financing to customers whose accounts were modified in troubled debt restructurings.\nWrite-offs\nTotal write-offs and recoveries, by product, and as a percentage of average balances held during the year, were as follows:\nDollars\nPercent\nDollars\nPercent\nDollars\nPercent\nWrite-offs:\nRetail notes & financing leases:\nAgriculture and turf\n$\n(31.7)\n(.12)\n%\n$\n(21.4)\n(.09)\n%\n$\n(18.6)\n(.09)\n%\nConstruction and forestry\n(29.1)\n(.55)\n(19.3)\n(.39)\n(18.1)\n(.42)\nTotal retail notes & financing leases\n(60.8)\n(.20)\n(40.7)\n(.15)\n(36.7)\n(.15)\nRevolving charge accounts\n(44.4)\n(1.17)\n(26.8)\n(.77)\n(27.8)\n(.85)\nWholesale receivables\n(.2)\n(.3)\n(.3)\nTotal write-offs\n(105.4)\n(.23)\n(67.8)\n(.18)\n(64.8)\n(.19)\nRecoveries:\nRetail notes & financing leases:\nAgriculture and turf\n8.8\n.03\n10.2\n.05\n9.2\n.05\nConstruction and forestry\n4.1\n.08\n4.2\n.09\n2.4\n.06\nTotal retail notes & financing leases\n12.9\n.04\n14.4\n.05\n11.6\n.05\nRevolving charge accounts\n21.8\n.58\n29.7\n.86\n35.5\n1.08\nWholesale receivables\n.6\n.01\n.1\nTotal recoveries\n35.3\n.08\n44.2\n.12\n47.1\n.14\nTotal net write-offs\n$\n(70.1)\n(.15)\n%\n$\n(23.6)\n(.06)\n%\n$\n(17.7)\n(.05)\n%\nNote 5. Securitization of Receivables\nOur funding strategy includes retail note securitizations. While these securitization programs are administered in various forms, they are accomplished in the following basic steps:\n1. We transfer retail notes into a bankruptcy-remote SPE.\n2. The SPE issues debt to investors. The debt is secured by the retail notes.\n3. Investors are paid back based on cash receipts from the retail notes.\nAs part of step 1, these retail notes are legally isolated from the claims of our general creditors. This ensures cash receipts from the retail notes are accessible to pay back securitization program investors. The structure of these transactions does not meet the accounting criteria for a sale of receivables. As a result, they are accounted for as secured borrowings. The\nreceivables and borrowings remain on our balance sheet and are separately reported as Retail notes securitized and Securitization borrowings, respectively.\nWe offer securitization programs to institutional investors and other financial institutions through public issuances or privately through a revolving credit agreement. At October 29, 2023, the revolving agreement had a financing limit of up to $1,500.0 of secured financings at any time. At October 29, 2023, $1,281.4 of securitization borrowings were outstanding under the revolving agreement. The agreement was renewed in November 2023 with an expiration in November 2024 and an increased capacity of $2,000.0.\nThe components of the securitization programs at October 29, 2023 and October 30, 2022 were as follows:\nRetail notes securitized\n$\n7,356.8\n$\n5,951.6\nAllowance for credit losses\n(21.4)\n(15.7)\nOther assets (primarily restricted cash)\n152.0\n155.2\nTotal restricted securitized assets\n$\n7,487.4\n$\n6,091.1\nSecuritization borrowings\n$\n6,995.2\n$\n5,710.9\nAccrued interest on borrowings\n12.6\n6.1\nTotal liabilities related to restricted securitized assets\n$\n7,007.8\n$\n5,717.0\nUnder both the public and private securitization programs, restricted cash held by the SPE serves as a credit enhancement. The restricted cash would be used to satisfy receivable payment deficiencies, if any. The cash restriction is removed either after all secured borrowing payments are made or proportionally as the secured receivables are collected and the borrowing obligations are reduced. No additional support to these programs beyond what was previously contractually required has been provided during the reporting periods.\nThe weighted-average interest rates on securitization borrowings at October 29, 2023 and October 30, 2022 were 4.7 percent and 2.8 percent, respectively.\nAlthough these securitization borrowings are classified as short-term since payment is required if the retail notes are liquidated early, the payment schedule for these borrowings at October 29, 2023 based on the expected liquidation of the retail notes is as follows: 2024 - $3,278.1, 2025 - $2,075.5, 2026 - $1,187.2, 2027 - $416.9, 2028 - $44.1, and later years - $4.6. At October 29, 2023 the maximum remaining term of all restricted securitized retail notes was approximately seven years.\nNote 6. Leases\nWe lease John Deere equipment and a limited amount of non-John Deere equipment to retail customers through sales-type, direct financing, and operating leases. Sales-type and direct financing leases are reported in Financing leases, and operating leases are reported in Equipment on operating leases - net.\nLeases offered by us may include early termination and renewal options. At the end of the majority of leases, the lessee generally has the option to purchase the underlying equipment for the contractual residual value or return it to the dealer. If the equipment is returned to the dealer, the dealer also has the option to purchase the equipment or return it to us for remarketing.\nWe have elected to combine lease and nonlease components. The nonlease components primarily relate to preventative maintenance and extended warranty agreements financed by the customer. We have also elected to report consideration related to sales and value-added taxes net of the related tax expense. Property taxes on leased assets are recorded on a gross basis in Lease revenues and Administrative and operating expenses. Variable lease revenues primarily relate to separately invoiced property taxes on leased equipment in certain markets, late fees, and excess use and damage fees.\nLease revenues earned by us were as follows:\nSales-type and direct financing lease revenues\n$\n90.7\n$\n56.6\n$\n48.6\nOperating lease revenues\n894.2\n886.1\n959.3\nVariable lease revenues\n14.2\n23.4\n26.9\nTotal lease revenues\n$\n999.1\n$\n966.1\n$\n1,034.8\nVariable lease revenues reported above include excess use and damage fees of $1.8, $2.4, and $6.5 for 2023, 2022, and 2021, respectively, which were reported in Other income.\nDeposits withheld from John Deere dealers and related credit losses on leases are handled in a manner similar to the procedures for retail notes. As with retail notes, there are generally no deposits withheld from dealers on leases related to construction and forestry equipment. In addition, a lease payment discount program, allowing reduced payments over the term of the lease, is administered in a manner similar to finance waivers on retail notes (see Note 3). During 2023, 2022, and 2021, the finance income earned from John Deere on sales-type and direct financing leases containing waiver of finance charges or reduced rates was $6.9, $3.9, and $3.7, respectively. The operating lease revenue earned from John Deere during 2023, 2022, and 2021 was $24.5, $30.0, and $47.1, respectively.\nFinancing Leases\nSales-type and direct financing lease receivables by market at October 29, 2023 and October 30, 2022 were as follows:\nAgriculture and turf\n$\n664.4\n$\n570.2\nConstruction and forestry\n223.4\n183.7\nTotal\n887.8\n753.9\nGuaranteed residual values\n701.9\n466.5\nUnguaranteed residual values\n27.2\n25.9\nUnearned finance income\n(195.1)\n(125.6)\nFinancing leases receivable\n$\n1,421.8\n$\n1,120.7\nAt the time of accepting a lease that qualifies as a sales-type or direct financing lease, we record the gross amount of lease payments receivable, estimated residual value of the leased equipment, and unearned finance income. The unearned finance income is recognized as revenue over the lease term using the interest method.\nScheduled payments, including guaranteed residual values, on sales-type and direct financing lease receivables at October 29, 2023 were as follows:\nDue in:\n$\n955.8\n306.9\n168.1\n98.1\n49.9\nLater years\n10.9\nTotal\n$\n1,589.7\nOperating Leases\nThe cost of equipment on operating leases by market at October 29, 2023 and October 30, 2022 was as follows:\nAgriculture and turf\n$\n5,265.2\n$\n5,017.3\nConstruction and forestry\n1,042.4\n1,138.0\nTotal\n6,307.6\n6,155.3\nAccumulated depreciation\n(1,256.1)\n(1,301.8)\nEquipment on operating leases - net\n$\n5,051.5\n$\n4,853.5\nLease payments from equipment on operating leases are recorded as income on a straight-line method over the lease term. Lease agreements include usage limits and specifications on machine condition, which allows us to assess lessees for excess use or damages to the underlying equipment.\nLease payments for equipment on operating leases at October 29, 2023 were scheduled as follows:\nDue in:\n$\n749.5\n561.3\n321.4\n157.9\n38.9\nLater years\n7.8\nTotal\n$\n1,836.8\nOperating lease assets are recorded at cost and depreciated to their estimated residual value on a straight-line method over the term of the leases. We estimate the residual values for operating leases at lease inception based on several factors, including:\n● lease term,\n● expected hours of usage,\n● historical wholesale sale prices,\n● return experience,\n● intended equipment use,\n● market dynamics and trends, and\n● third-party residual guarantees.\nWe review residual value estimates during the lease term, and depreciation is adjusted prospectively on a straight-line basis over the remaining lease term if residual value estimates are revised. Impairments are recorded when events or circumstances necessitate. There were no impairment losses on operating leases recorded during any periods presented.\nThe total operating lease residual values at October 29, 2023 and October 30, 2022 were $3,538.3 and $3,366.7, respectively. John Deere dealers generally provide a first-loss residual value guarantee on operating lease originations. Total residual value guarantees were $566.9 and $440.7 at October 29, 2023 and October 30, 2022, respectively.\nWe discuss with lessees and dealers options to purchase the equipment or extend the lease prior to operating lease maturity. Equipment returned to us upon termination of leases is remarketed by us. The matured operating lease inventory balances at October 29, 2023 and October 30, 2022 were $16.2 and $10.8, respectively. Matured operating lease inventory is reported in Other assets.\nPast due balances of operating leases represent the total balance held (net book value plus accrued lease payments) and still accruing finance income with any payment amounts 30 days or more past the contractual payment due date. These amounts were $51.8 and $58.7 at October 29, 2023 and October 30, 2022, respectively.\nNote 7. Notes Receivable from and Payable to John Deere\nAt October 29, 2023 and October 30, 2022 we had notes receivable from John Deere with the following affiliated companies:\nBanco John Deere S.A.\n$\n650.7\n$\n370.0\nJohn Deere Agricultural Holdings, Inc.\n.7\nTotal notes receivable from John Deere\n$\n650.7\n$\n370.7\nThe loan agreements mature over the next seven years and charge interest at competitive market interest rates. Interest earned from John Deere was $37.6, $16.9, and $15.4 in 2023, 2022, and 2021, respectively, which is recorded in Other income.\nAt October 29, 2023 and October 30, 2022, we had notes payable to John Deere as follows:\nNotes payable to John Deere\n$\n3,184.0\n$\n5,225.5\nWeighted average interest rate\n5.2%\n3.3%\nThe intercompany borrowings are primarily short-term in nature or contain a due on demand call option. At October 29, 2023, $528.1 of the intercompany borrowings were long-term loans without a due on demand call option, which mature in 2025. We pay interest to John Deere for these borrowings based on competitive market rates. Interest expense paid to John Deere was $199.9, $86.8, and $53.0 in 2023, 2022, and 2021, respectively, which is recorded in Fees and interest paid to John Deere.\nNote 8. Short-Term External Borrowings\nOur short-term external borrowings at October 29, 2023 and October 30, 2022 consisted of the following:\nCommercial paper and other notes payable\n$\n6,836.1\n$\n2,402.3\nSecuritization borrowings\n6,995.2\n5,710.9\nCurrent maturities of long-term external borrowings *\n6,059.9\n5,989.6\nTotal\n$\n19,891.2\n$\n14,102.8\n* Includes unamortized fair value adjustments related to interest rate swaps.\nThe weighted-average interest rates at October 29, 2023 and October 30, 2022, were:\nCommercial paper and other notes payable\n5.6%\n3.4%\nSecuritization borrowings\n4.7%\n2.8%\nWorldwide lines of credit were $10,215.7 at October 29, 2023, consisting primarily of:\n● a 364-day credit facility agreement of $5.0 billion, expiring in the second quarter of 2024,\n● a credit facility agreement of $2.5 billion, expiring in the second quarter of 2027, and\n● a credit facility agreement of $2.5 billion, expiring in the second quarter of 2028.\nSome of these credit lines are available to both us and Deere & Company. At October 29, 2023, $841.2 of these worldwide lines of credit were unused. For the purpose of computing the unused credit lines, commercial paper and short-term bank borrowings of us and John Deere were considered to constitute utilization.\nThe credit agreements governing these lines of credit require us to maintain our consolidated ratio of earnings to fixed charges at not less than 1.05 to 1 for any four consecutive fiscal quarterly periods and our ratio of senior debt, excluding securitization indebtedness to capital base (total subordinated debt and stockholders equity excluding accumulated other comprehensive income (loss)) at not more than 11 to 1 at the end of any fiscal quarter. All of these credit agreement requirements have been met during the periods included in the consolidated financial statements. The agreements are mutually extendable, and the annual facility fees are not significant.\nDeere & Company has an agreement with us pursuant to which it has agreed to continue to own, directly or through one or more wholly-owned subsidiaries, at least 51 percent of the voting shares of capital stock of Capital Corporation and to maintain our consolidated tangible net worth at not less than $50.0. This agreement also obligates Deere & Company to make payments to us such that our consolidated ratio of earnings to fixed charges is not less than 1.05 to 1 for any four consecutive fiscal quarterly periods. Deere & Companys obligations to make payments to us under the agreement are independent of whether we are in default on our indebtedness, obligations, or other liabilities. Further, Deere & Companys obligations under the agreement are not measured by the amount of our indebtedness, obligations, or other liabilities. Deere & Companys obligations to make payments under this agreement are expressly stated not to be a guarantee of any specific indebtedness, obligation, or liability of ours and are enforceable only by or in the name of Capital Corporation. No payments were required under this agreement during the periods included in the consolidated financial statements. At October 29, 2023, Deere & Company indirectly owned 100 percent of the voting shares of Capital Corporations capital stock and our consolidated tangible net worth was $5,901.6.\nNote 9. Long-Term External Borrowings\nLong-term external borrowings at October 29, 2023 and October 30, 2022 consisted of the following:\nSenior Debt:\nMedium-term notes\n$\n27,522.8\n$\n22,595.4\nOther notes\n2.5\nTotal senior debt\n27,522.8\n22,597.9\nUnamortized debt discount and debt issuance costs\n(83.5)\n(70.1)\nTotal\n$\n27,439.3\n$\n22,527.8\nAll outstanding medium-term notes and other notes are senior unsecured borrowings and generally rank equally with each other. Medium-term notes are primarily offered by prospectus and have serial maturity dates through 2033. The medium-term notes in the table above include unamortized fair value adjustments related to interest rate swaps.\nThe principal balance and weighted-average interest rates on medium-term notes were as follows:\nMedium-term notes:\nPrincipal\n$\n28,733.5\n$\n23,564.6\nAverage interest rates*\n4.9%\n2.9%\n* Includes impact of interest rate swaps\nThe principal amounts of medium-term notes maturing in each of the next five years are as follows: 2024 - $6,047.8, 2025 -$7,214.7, 2026 - $6,933.7, 2027 - $2,900.0, and 2028 - $4,635.1.\nNote 10. Capital Stock\nAll of Capital Corporations common stock is owned by JDFS, a wholly-owned finance holding subsidiary of Deere & Company. No shares of common stock of Capital Corporation were reserved for officers or employees or for options, warrants, conversions, or other rights at October 29, 2023 or October 30, 2022. At October 29, 2023 and October 30, 2022, Capital Corporation had authorized, but not issued, 10,000 shares of $1 par value preferred stock.\nNote 11. Capital Investments and Dividends\nThe following capital investments were received from JDFS and cash dividends were declared and paid to JDFS during 2023, 2022, and 2021:\nCapital investments\n$\n810.0\nDividends\n165.0\n$\n370.0\n$\n485.0\nIn each case, JDFS either received a comparable capital investment or paid a comparable dividend to Deere & Company. The capital investments during 2023 were made to maintain targeted average leverage ratios and were driven by growth in total Receivables and corresponding borrowings.\nNote 12. Pension and Other Postretirement Benefits\nWe are a participating employer in certain Deere & Company sponsored defined benefit pension plans for employees in the U.S. and certain defined benefit pension plans outside the U.S. These pension plans provide for benefits that are based primarily on years of service and employee compensation. Pension expense (benefit) is actuarially determined based on our employees included in the plan. Our pension expense (benefit) was $(4.8) in 2023 and was not significant in 2022 or 2021. The accumulated benefit obligation and plan net assets for our employees are not determined separately from Deere & Company.\nWe provide defined benefit health care and life insurance plans for certain retired employees in the U.S. as a participating employer in Deere & Companys sponsored plans. Health care and life insurance benefits expense is actuarially determined based on our employees included in the plans and amounted to $6.2 in 2023, $6.0 in 2022, and $6.1 in 2021.\nWe are a participating employer in certain Deere & Company sponsored defined contribution plans related to employee investment and savings plans primarily in the U.S. Our contributions and costs under these plans were $14.4 in 2023, $13.8 in 2022, and $11.8 in 2021.\nFurther disclosure for the plans described above is included in the notes to the Deere & Company Annual Report on Form 10-K for the year ended October 29, 2023 (the Deere & Company 2023 Form 10-K).\nNote 13. Share-Based Compensation\nSome of our employees participate in Deere & Company share-based compensation plans. During 2023, 2022, and 2021, the total share-based compensation expense and income tax benefit recognized was as follows:\nShare-based compensation expense\n$\n8.6\n$\n6.4\n$\n6.3\nIncome tax benefit\n2.0\n1.5\n1.5\nFurther disclosure for these plans is included in the notes to the Deere & Company 2023 Form 10-K.\nNote 14. Income Taxes\nWe are subject to income taxes in a number of jurisdictions. The income tax provision is determined using the asset and liability method. The provision for income taxes by taxing jurisdiction and by significant component consisted of the following:\nCurrent:\nU.S.:\nFederal\n$\n(98.6)\n$\n200.8\n$\n231.1\nState\n(33.7)\n10.8\n15.2\nForeign\n41.0\n29.3\n37.2\nTotal current\n(91.3)\n240.9\n283.5\nDeferred:\nU.S.:\nFederal\n230.6\n(48.9)\n(75.4)\nState\n29.1\n3.2\n1.9\nForeign\n(2.5)\n10.4\n(16.2)\nTotal deferred\n257.2\n(35.3)\n(89.7)\nProvision for income taxes\n$\n165.9\n$\n205.6\n$\n193.8\nOur taxable income is included in the consolidated U.S. income tax return and various state returns of Deere & Company. Under tax sharing arrangements with Deere & Company, our provision for income taxes is generally recorded as if Capital Corporation and each of our subsidiaries filed separate income tax returns, with a modification for realizability of certain tax benefits. The difference between the provision for income taxes recorded by us and the provision for income taxes calculated on an unmodified, separate return basis was not material in 2023, 2022, or 2021.\nThe amounts due from (payable to) Deere & Company under the tax sharing arrangements at October 29, 2023 and October 30, 2022 were as follows:\nTax sharing receivables\n$\n43.8\n$\n6.3\nTax sharing payables\n(7.5)\n(9.3)\nThe tax sharing receivables are included in Other receivables and the payables are included in Accounts payable and accrued expenses.\nA comparison of the statutory and effective income tax provision and reasons for related differences follows:\nU.S. federal income tax provision at a statutory rate (21 percent)\n$\n154.1\n$\n187.8\n$\n184.4\nIncrease (decrease) resulting from:\nTax rates on foreign earnings\n1.4\n6.0\n5.5\nState and local income taxes, net of federal income tax benefit\n.4\n11.3\n13.7\nOther - net\n10.0\n.5\n(9.8)\nProvision for income taxes\n$\n165.9\n$\n205.6\n$\n193.8\nAt October 29, 2023, accumulated earnings of $87.0 in certain subsidiaries outside the U.S. are expected to remain indefinitely reinvested outside of the U.S. As such, a provision for foreign withholding taxes has not been made. Determination of the amount of foreign withholding tax liability on these unremitted earnings is not practicable.\nDeferred income taxes arise because there are certain items that are treated differently for financial accounting than for income tax reporting purposes. An analysis of deferred income tax assets and liabilities at October 29, 2023 and October 30, 2022 was as follows:\nDeferred\nDeferred\nDeferred\nDeferred\nTax\nTax\nTax\nTax\nAssets\nLiabilities\nAssets\nLiabilities\nLease transactions\n$\n1.2\n$\n562.6\n$\n.1\n$\n262.6\nAccrual for retirement and other benefits\n3.8\n5.3\nAccrual for other employee benefits\n19.6\n14.3\nAllowance for credit losses\n39.8\n32.6\nNet unrealized gain on derivatives/investments\n8.8\n26.5\nTax loss and tax credit carryforwards\n27.6\n11.6\nFederal taxes on deferred state tax deductions\n4.9\n7.8\nMiscellaneous accruals and other\n61.1\n8.1\n46.8\n4.1\nLess valuation allowances\n(10.2)\n(8.3)\nDeferred income tax assets and liabilities\n$\n147.8\n$\n579.5\n$\n110.2\n$\n293.2\nAt October 29, 2023, tax loss and tax credit carryforwards of $27.6 were available, with $26.3 expiring from 2029 through 2043 and $1.3 with an indefinite carryforward period.\nA reconciliation of the total amounts of unrecognized tax benefits at October 29, 2023, October 30, 2022, and October 31, 2021 was as follows:\nBeginning of year balance\n$\n36.5\n$\n34.9\n$\n33.3\nIncreases to tax positions taken during the current year\n15.0\n9.3\n11.2\nIncreases to tax positions taken during prior years\n3.2\n1.2\n1.4\nDecreases to tax positions taken during prior years\n(6.9)\n(6.1)\n(5.8)\nDecreases due to lapse of statute of limitations\n(2.6)\n(2.7)\n(3.7)\nSettlements\n(.8)\n(.1)\n(1.5)\nEnd of year balance\n$\n44.4\n$\n36.5\n$\n34.9\nThe amount of unrecognized tax benefits at October 29, 2023 and October 30, 2022 that would impact the effective tax rate if the tax benefits were recognized was $26.8 and $25.2, respectively. The remaining liability was related to tax positions for which there are offsetting tax receivables, or the uncertainty was only related to timing. We expect that any reasonably possible change in the amounts of unrecognized tax benefits in the next twelve months would not be significant.\nWe file our tax returns according to the tax laws of the jurisdictions in which we operate, which includes the U.S. federal jurisdiction, and various state and foreign jurisdictions. We are included in the consolidated U.S. income tax return and various state returns of Deere & Company. The U.S. Internal Revenue Service has completed the examination of Deere & Companys federal income tax returns for periods prior to 2015. The federal income tax returns for years 2015 to 2020 are currently under examination. Various state and foreign income tax returns also remain subject to examination by taxing authorities.\nOur policy is to recognize interest related to income taxes in Interest expense and Other income, and recognize penalties in Administrative and operating expenses. The amount of interest and penalties recognized was not significant for any of the periods presented. At October 29, 2023 and October 30, 2022, the liability for accrued interest and penalties totaled $12.3 and $12.8, respectively.\nNote 15. Other Income and Administrative and Operating Expenses\nThe major components of other income and administrative and operating expenses were as follows:\nOther income\nFees and interest from John Deere\n$\n47.0\n$\n28.5\n$\n25.6\nExternal interest income\n63.1\n8.6\n2.9\nOperating lease disposition gains - net\n31.0\n66.9\n65.0\nFreestanding credit enhancement recoveries\n17.0\n8.5\n14.3\nOther\n18.2\n23.2\n13.7\nTotal\n$\n176.3\n$\n135.7\n$\n121.5\nAdministrative and operating expenses\nCompensation and benefits\n$\n273.8\n$\n252.9\n$\n249.0\nComputer processing and software\n58.3\n55.8\n52.0\nProperty taxes on leased assets\n23.3\n33.0\n29.0\nForeign currency exchange losses - net\n20.4\n25.6\n14.9\nDealer financing incentives*\n129.9\n77.3\n81.9\nOther\n63.7\n57.0\n45.0\nTotal\n$\n569.4\n$\n501.6\n$\n471.8\n* As summarized in Notes 1, 2, and 23, we corrected our accounting treatment for dealer financing incentives during 2023. Prior period amounts in the table above have been restated and now include both the cash and non-cash portion of dealer financing incentives. Previously, the non-cash portion of dealer financing incentives was reported as a reduction to finance income.\nNote 16. Supplemental Cash Flow Information\nFor purposes of the statements of consolidated cash flows, all cash flows related to short-term borrowings with original maturities of three months or less, in addition to securitization borrowings, are reported on a net basis. During 2023, we issued $4,479.6 and retired $3,194.5 of retail note securitization borrowings.\nSupplemental cash flow information was as follows:\nCash paid for interest\n$\n1,726.6\n$\n606.8\n$\n562.4\nCash paid (received) for income taxes\n(43.2)\n280.9\n306.8\nNote 17. Commitments and Contingencies\nWe provide guarantees related to certain financial instruments issued by John Deere Financial Inc., a John Deere finance subsidiary in Canada. At October 29, 2023, the following notional amounts were guaranteed by us:\n● Medium-term notes: $2,855.8\n● Commercial paper: $2,418.0\n● Derivatives: $3,581.2, with a fair value liability of $125.8\nThe weighted-average interest rate on the medium-term notes at October 29, 2023 was 2.9 percent with a maximum remaining maturity of six years.\nWe have commitments to extend credit to customers and John Deere dealers through lines of credit and other pre-approved credit arrangements. We apply the same credit policies and approval process for these commitments to extend credit as we do for our Receivables and Leases, and generally have the right to unconditionally cancel, alter, or amend the terms at any time. Collateral is not required for these commitments, but if credit is extended, collateral may be required upon funding.\nA significant portion of these commitments is not expected to be fully drawn upon; therefore, the total commitment amounts likely do not represent a future cash requirement. The unused commitments at October 29, 2023 were as follows:\n● John Deere dealers: $8.0 billion\n● Customers: $31.7 billion, primarily related to revolving charge accounts\nWe have a reserve for credit losses of $2.0 on unfunded commitments that are not unconditionally cancellable at October 29, 2023, which is recorded in Accounts payable and accrued expenses.\nAt October 29, 2023, we had restricted other assets associated with borrowings related to securitizations (see Note 5). Excluding the securitization programs, the remaining balance of restricted other assets was not material as of October 29, 2023.\nWe are subject to various unresolved legal actions which arise in the normal course of our business, the most prevalent of which relate to retail credit matters. We believe the reasonably possible range of losses for these unresolved legal actions would not have a material effect on our consolidated financial statements.\nNote 18. Other Comprehensive Income Items\nThe after-tax components of accumulated other comprehensive income (loss) at October 29, 2023, October 30, 2022, and October 31, 2021 were as follows:\nCumulative translation adjustment\n$\n(136.8)\n$\n(169.0)\n$\n(54.5)\nUnrealized gain on derivatives\n34.8\n66.8\n6.8\nUnrealized loss on debt securities\n(2.4)\n(2.5)\n(1.7)\nTotal accumulated other comprehensive income (loss)\n$\n(104.4)\n$\n(104.7)\n$\n(49.4)\nThe following reflect amounts recorded in and reclassifications out of other comprehensive income (loss) and the income tax effects:\nBefore\nTax\nAfter\nTax\n(Expense)\nTax\nAmount\nCredit\nAmount\nCumulative translation adjustment\n$\n32.2\n$\n32.2\nUnrealized gain (loss) on derivatives:\nUnrealized hedging gain (loss)\n25.4\n$\n(5.3)\n20.1\nReclassification of realized (gain) loss to:\nInterest rate contracts - Interest expense\n(65.9)\n13.8\n(52.1)\nNet unrealized gain (loss) on derivatives\n(40.5)\n8.5\n(32.0)\nUnrealized gain (loss) on debt securities:\nUnrealized holding gain (loss)\n.1\n.1\nTotal other comprehensive income (loss)\n$\n(8.2)\n$\n8.5\n$\n.3\nCumulative translation adjustment\n$\n(114.5)\n$\n(114.5)\nUnrealized gain (loss) on derivatives:\nUnrealized hedging gain (loss)\n88.3\n$\n(18.5)\n69.8\nReclassification of realized (gain) loss to:\nInterest rate contracts - Interest expense\n(12.4)\n2.6\n(9.8)\nNet unrealized gain (loss) on derivatives\n75.9\n(15.9)\n60.0\nUnrealized gain (loss) on debt securities:\nUnrealized holding gain (loss)\n(1.1)\n.3\n(.8)\nTotal other comprehensive income (loss)\n$\n(39.7)\n$\n(15.6)\n$\n(55.3)\nCumulative translation adjustment\n$\n15.0\n$\n15.0\nUnrealized gain (loss) on derivatives:\nUnrealized hedging gain (loss)\n7.7\n$\n(1.6)\n6.1\nReclassification of realized (gain) loss to:\nInterest rate contracts - Interest expense\n9.4\n(2.0)\n7.4\nNet unrealized gain (loss) on derivatives\n17.1\n(3.6)\n13.5\nUnrealized gain (loss) on debt securities:\nUnrealized holding gain (loss)\n(.2)\n.1\n(.1)\nTotal other comprehensive income (loss)\n$\n31.9\n$\n(3.5)\n$\n28.4\nNote 19. Fair Value Measurements\nFair value is defined as the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. To determine fair value, we use various methods, including market and income approaches. We utilize valuation models and techniques that maximize the use of observable inputs. The models are industry-standard models that consider various assumptions, including time values and yield curves as well as other economic measures. These valuation techniques are consistently applied.\nLevel 1 measurements consist of quoted prices in active markets for identical assets or liabilities. Level 2 measurements include significant other observable inputs, such as quoted prices for similar assets or liabilities in active markets; identical assets or liabilities in inactive markets; observable inputs such as interest rates and yield curves; and other market-corroborated inputs. Level 3 measurements include significant unobservable inputs.\nThe fair values of financial instruments that do not approximate the carrying values at October 29, 2023 and October 30, 2022 were as follows:\nCarrying\nFair\nCarrying\nFair\nValue\nValue\nValue\nValue\nReceivables financed - net\n$\n43,862.4\n$\n43,168.7\n$\n36,377.3\n$\n35,562.4\nRetail notes securitized - net\n7,335.4\n7,055.8\n5,935.9\n5,696.3\nSecuritization borrowings\n6,995.2\n6,921.1\n5,710.9\n5,576.6\nCurrent maturities of long-term external borrowings\n6,059.9\n5,953.0\n5,989.6\n5,887.7\nLong-term external borrowings\n27,439.3\n27,057.7\n22,527.8\n21,792.7\nFair value measurements above were Level 3 for all Receivables and Level 2 for all borrowings.\nFair values of Receivables that were issued long-term were based on the discounted values of their related cash flows at interest rates currently being offered by us for similar Receivables. The fair values of the remaining Receivables approximated the carrying amounts.\nFair values of long-term external borrowings and securitization borrowings were based on current market quotes for identical or similar borrowings and credit risk, or on the discounted values of their related cash flows at current market interest rates. Certain long-term external borrowings have been swapped to current variable interest rates. The carrying values of these long-term external borrowings include adjustments related to fair value hedges.\nAssets and liabilities measured at October 29, 2023 and October 30, 2022 at fair value on a recurring basis were as follows:\nMarketable securities\nInternational debt securities\n$\n1.4\n$\n1.1\nReceivables from John Deere\nDerivatives\n144.4\n214.8\nOther assets\nDerivatives\n11.3\n1.3\nTotal assets\n$\n157.1\n$\n217.2\nOther payables to John Deere\nDerivatives\n$\n974.9\n$\n1,024.2\nAccounts payable and accrued expenses\nDerivatives\n.5\n14.1\nTotal liabilities\n$\n975.4\n$\n1,038.3\nAll fair value measurements in the table above were Level 2. Excluded from the table above were our cash equivalents, which were carried at a cost that approximates fair value. The cash equivalents consist of time deposits and money market funds.\nThe international debt securities mature over the next seven years. At October 29, 2023, the amortized cost basis and fair value of these available-for-sale debt securities were $5.1 and $1.4, respectively. Unrealized losses at October 29, 2023 were not recognized in income due to the ability and intent to hold to maturity.\nThere were no assets or liabilities measured at fair value on a nonrecurring basis, other than Receivables with specific allowances which were not material, during the periods ended October 29, 2023, October 30, 2022, and October 31, 2021.\nThe following is a description of the valuation methodologies we use to measure certain balance sheet items at fair value:\nMarketable securities - The international debt securities are valued using quoted prices for identical assets in inactive markets.\nDerivatives - Our derivative financial instruments consist of interest rate contracts (swaps and caps), foreign currency exchange contracts (forwards and swaps), and cross-currency interest rate contracts (swaps). The portfolio is valued based on an income approach (discounted cash flow) using market observable inputs, including swap curves and both forward and spot exchange rates for currencies.\nReceivables - Specific reserve impairments are based on the fair value of the collateral, which is measured using a market approach (appraisal values or realizable values).\nNote 20. Derivative Instruments\nOur outstanding derivatives transactions are with both unrelated external counterparties and with John Deere. For derivatives transactions with John Deere, we utilize a centralized hedging structure in which John Deere enters into a derivative transaction with an unrelated external counterparty and simultaneously enters into a derivative transaction with us. Except for collateral provisions, the terms of the transaction between John Deere and us are identical to the terms of the transaction between John Deere and its unrelated external counterparty. Derivative asset and liability positions for transactions with John Deere are recorded in Receivables from John Deere and Other payables to John Deere, respectively. Derivative asset and liability positions for transactions with unrelated external counterparty banks are recorded in Other assets and Accounts payable and accrued expenses, respectively.\nThe fair value of our derivative instruments and the associated notional amounts were as follows:\nOctober 29, 2023\nOctober 30, 2022\nFair Value\nFair Value\nNotional\nAsset\nLiability\nNotional\nAsset\nLiability\nCash flow hedges:\nInterest rate contracts - swaps\n$\n1,500.0\n$\n44.7\n$\n1,950.0\n$\n87.5\nFair value hedges:\nInterest rate contracts - swaps\n11,859.4\n$\n915.7\n9,448.9\n$\n947.9\nNot designated as hedging instruments:\nInterest rate contracts - swaps\n8,010.9\n72.2\n27.4\n3,931.3\n75.5\n25.2\nForeign currency exchange contracts\n1,546.5\n11.3\n.5\n1,069.0\n1.3\n14.1\nCross-currency interest rate contracts\n175.8\n3.2\n7.5\n134.2\n2.8\n2.1\nInterest rate caps - sold\n1,336.0\n24.3\n1,020.3\n49.0\nInterest rate caps - purchased\n1,336.0\n24.3\n1,020.3\n49.0\nThe amount of gain recorded in OCI related to cash flow hedges at October 29, 2023 that is expected to be reclassified to interest expense in the next twelve months if interest rates remain unchanged is $33.3 after-tax. No gains or losses were reclassified from OCI to earnings based on the probability that the original forecasted transaction would not occur.\nThe amounts recorded, at October 29, 2023 and October 30, 2022, in the consolidated balance sheets related to borrowings designated in fair value hedging relationships were as follows. Fair value hedging adjustments are included in the carrying amount of the hedged item.\nActive Hedging Relationships\nDiscontinued Hedging Relationships\nCarrying\nCumulative\nCarrying Amount\nCumulative\nAmount of\nFair Value\nof Formerly\nFair Value\nHedged Item\nHedging Adjustment\nHedged Item\nHedging Adjustment\nCurrent maturities of long-term external borrowings\n$\n1,814.0\n$\n14.9\nLong-term external borrowings\n$\n10,883.7\n$\n(922.6)\n7,144.1\n(288.1)\nCurrent maturities of long-term external borrowings\n$\n2,514.9\n$\n15.5\nLong-term external borrowings\n$\n8,453.6\n$\n(950.1)\n5,519.6\n(19.1)\nThe classification and gains (losses), including accrued interest expense, related to derivative instruments on the statements of consolidated income consisted of the following:\nFair Value Hedges\nInterest rate contracts - Interest expense\n$\n(518.7)\n$\n(1,102.0)\n$\n(208.9)\nCash Flow Hedges\nRecognized in OCI\nInterest rate contracts - OCI (pretax)\n$\n25.4\n$\n88.3\n$\n7.7\nReclassified from OCI\nInterest rate contracts - Interest expense\n65.9\n12.4\n(9.4)\nNot Designated as Hedges\nInterest rate contracts - Interest expense *\n$\n27.3\n$\n62.4\n$\n5.2\nForeign currency exchange contracts - Administrative and operating expenses *\n19.1\n169.3\n(26.6)\nTotal not designated\n$\n46.4\n$\n231.7\n$\n(21.4)\n* Includes interest and foreign currency exchange gains (losses) from cross-currency interest rate contracts.\nIncluded in the table above are interest expense and administrative and operating expense amounts we incurred on derivatives transacted with John Deere. The amounts we recognized on these affiliate party transactions were losses of $437.1, $1,021.7, and $224.3 during 2023, 2022, and 2021, respectively.\nCounterparty Risk and Collateral\nDerivative instruments are subject to significant concentrations of credit risk in the banking sector. We manage individual unrelated external counterparty exposure by setting limits that consider the credit rating of the unrelated external counterparty, the credit default swap spread of the counterparty, and other financial commitments and exposures between us and the unrelated external counterparty banks. All interest rate derivatives are transacted under International Swaps and Derivatives Association (ISDA) documentation. Each master agreement permits the net settlement of amounts owed in the event of default or termination. None of our derivative agreements contain credit-risk-related contingent features.\nWe have ISDA agreements with John Deere that permit the net settlement of amounts owed between counterparties in the event of early termination. In addition, we have a loss sharing agreement with John Deere in which we have agreed to\nabsorb any losses and expenses John Deere incurs if an unrelated external counterparty fails to meet its obligations on a derivative transaction that John Deere entered into to manage our exposures. The loss sharing agreement did not increase the maximum amount of loss that we would incur, after considering collateral received and netting arrangements, as of October 29, 2023 and October 30, 2022.\nDerivatives are recorded without offsetting for netting arrangements or collateral. The impact on the derivative assets and liabilities for external derivatives and those with John Deere related to netting arrangements and any collateral received or paid at October 29, 2023 and October 30, 2022 were as follows:\nDerivatives:\nGross Amounts Recognized\nNetting Arrangements\nCollateral\nNet\nAmount\nAssets\nExternal\n$\n11.3\n$\n(.1)\n$\n11.2\nJohn Deere\n144.4\n(107.0)\n37.4\nLiabilities\nExternal\n.5\n(.1)\n.4\nJohn Deere\n974.9\n(107.0)\n867.9\nDerivatives:\nGross Amounts Recognized\nNetting Arrangements\nCollateral\nNet\nAmount\nAssets\nExternal\n$\n1.3\n$\n(1.1)\n$\n.2\nJohn Deere\n214.8\n(128.3)\n86.5\nLiabilities\nExternal\n14.1\n(1.1)\n13.0\nJohn Deere\n1,024.2\n(128.3)\n895.9\nNote 21. Geographic Area Information\nBased on the way our operations are managed and evaluated by management and materiality considerations, we operate as one operating segment. However, geographic area information for revenues and Receivables attributed to the U.S. and countries outside the U.S. is disclosed below. No individual foreign countrys revenues or Receivables were material for disclosure purposes.\nGeographic area information as of and for the years ended October 29, 2023, October 30, 2022, and October 31, 2021 is presented below:\nRevenues:\nU.S.\n$\n3,456.5\n$\n2,450.5\n$\n2,393.0\nOutside the U.S.\n519.0\n356.1\n330.7\nTotal\n$\n3,975.5\n$\n2,806.6\n$\n2,723.7\nReceivables:\nU.S.\n$\n44,260.0\n$\n36,555.6\n$\n30,713.2\nOutside the U.S.\n7,084.2\n5,886.0\n5,911.5\nTotal\n$\n51,344.2\n$\n42,441.6\n$\n36,624.7\nNote 22. Unconsolidated Affiliated Company\nOur investment in an unconsolidated affiliated company consists of a 50 percent ownership in John Deere Financial S.A.S., a joint venture in France that primarily offers loans and leases to customers. We do not control the joint venture and account for our investment in the joint venture on the equity basis. Our share of the income or loss of this joint venture is reported in Equity in income of unconsolidated affiliate, and the investment is reported in Investment in unconsolidated affiliate.\nSummarized financial information of the unconsolidated affiliated company for the relevant fiscal years was as follows:\nOperations:\nTotal revenue\n$\n25.5\n$\n17.7\n$\n16.6\nNet income\n7.8\n9.0\n5.9\nThe Companys equity in net income\n3.9\n4.5\n3.0\nFinancial Position:\nTotal assets\n$\n606.5\n$\n496.3\nTotal external borrowings\n541.3\n449.3\nTotal net assets\n55.2\n45.2\nThe Companys share of net assets\n27.6\n22.6\nNote 23. Immaterial Restatement of Prior Period Financial Statements\nIn the second quarter of 2023, we corrected the accounting treatment for financing incentives offered to John Deere dealers, which impacted the timing of expense recognition and the presentation of incentive costs in our consolidated financial statements. Refer to Note 1 and Note 2 for additional information. While the prior period amounts have been restated, as set forth below for comparability, the impact of the correction in periods prior to the quarter ended April 30, 2023 was not material to our consolidated financial statements in any of the impacted periods.\nThe prior period impacts to our statements of consolidated income and the related impacts to our statements of consolidated comprehensive income for the years ended October 30, 2022 and October 31, 2021 were as follows:\nPreviously\nAs\nPreviously\nAs\nReported\nAdjustment\nAdjusted\nReported\nAdjustment\nAdjusted\nRevenues\nFinance income earned on retail notes\n$\n1,023.3\n$\n41.2\n$\n1,064.5\n$\n946.6\n$\n29.4\n$\n976.0\nLease revenues\n957.5\n6.2\n963.7\n1,022.0\n6.3\n1,028.3\nTotal revenues\n2,759.2\n47.4\n2,806.6\n2,688.0\n35.7\n2,723.7\nExpenses\nAdministrative and operating expenses\n440.1\n61.5\n501.6\n406.0\n65.8\n471.8\nTotal operating expenses\n1,353.4\n61.5\n1,414.9\n1,306.8\n65.8\n1,372.6\nTotal expenses\n1,850.7\n61.5\n1,912.2\n1,779.7\n65.8\n1,845.5\nIncome of Consolidated Group before Income Taxes\n908.5\n(14.1)\n894.4\n908.3\n(30.1)\n878.2\nProvision for income taxes\n209.0\n(3.4)\n205.6\n200.5\n(6.7)\n193.8\nIncome of Consolidated Group\n699.5\n(10.7)\n688.8\n707.8\n(23.4)\n684.4\nNet Income\n704.0\n(10.7)\n693.3\n710.8\n(23.4)\n687.4\nNet Income Attributable to the Company\n$\n704.3\n$\n(10.7)\n$\n693.6\n$\n710.6\n$\n(23.4)\n$\n687.2\nThe prior period impacts to our consolidated balance sheet and the related components of stockholders equity as of October 30, 2022 were as shown below. In addition, beginning retained earnings for the year ended October 30, 2022 decreased $108.7 from $3,091.0 to $2,982.3, and beginning retained earnings for the year ended October 31, 2021 decreased $85.3 from $2,891.6 to $2,806.3.\nPreviously\nAs\nReported\nAdjustment\nAdjusted\nAssets\nReceivables:\nRetail notes\n$\n22,860.3\n$\n(61.3)\n$\n22,799.0\nTotal receivables\n42,502.9\n(61.3)\n42,441.6\nTotal receivables - net\n42,374.5\n(61.3)\n42,313.2\nDeferred income taxes\n23.3\n2.2\n25.5\nTotal Assets\n$\n48,928.0\n$\n(59.1)\n$\n48,868.9\nLiabilities and Stockholders Equity\nAccounts payable and accrued expenses\n$\n866.1\n$\n91.2\n$\n957.3\nDeferred income taxes\n239.4\n(30.9)\n208.5\nTotal liabilities\n44,123.1\n60.3\n44,183.4\nStockholders equity:\nRetained earnings\n3,425.3\n(119.4)\n3,305.9\nTotal Company stockholders equity\n4,803.4\n(119.4)\n4,684.0\nTotal stockholders equity\n4,804.9\n(119.4)\n4,685.5\nTotal Liabilities and Stockholders Equity\n$\n48,928.0\n$\n(59.1)\n$\n48,868.9\nThe prior period impacts to our statements of consolidated cash flows for the years ended October 30, 2022 and October 31, 2021 were as follows:\nPreviously\nAs\nPreviously\nAs\nReported\nAdjustment\nAdjusted\nReported\nAdjustment\nAdjusted\nCash Flows from Operating Activities:\nNet income\n$\n704.0\n$\n(10.7)\n$\n693.3\n$\n710.8\n$\n(23.4)\n$\n687.4\nAdjustments to reconcile net income to net cash provided by operating activities:\nCredit for deferred income taxes\n(32.0)\n(3.3)\n(35.3)\n(83.3)\n(6.4)\n(89.7)\nChange in accounts payable and accrued expenses\n14.4\n(2.4)\n12.0\n(39.5)\n21.6\n(17.9)\nOther\n(164.2)\n16.4\n(147.8)\n33.3\n8.2\n41.5\nNet cash provided by operating activities\n$\n1,205.9\n$\n$\n1,205.9\n$\n1,365.9\n$\n$\n1,365.9\nNote 24. Subsequent Events\nOn December 7, 2023, Capital Corporation declared a $215 dividend paid to JDFS on December 14, 2023. JDFS, in turn, declared a $215 dividend to Deere & Company, also paid on December 14, 2023.\nIndex to Exhibits\n3.1\nCertificate of Incorporation, as amended (Exhibit 3.1 to Form 10-K of the registrant for the year ended October 31, 1999, Securities and Exchange Commission File Number 1-6458*)\n3.2\nBylaws, as amended (Exhibit 3.2 to Form 10-K of the registrant for the year ended October 31, 1999, Securities and Exchange Commission File Number 1-6458*)\n4.1\nSenior Indenture dated March 15, 1997 between the registrant and The Bank of New York Mellon (successor Trustee to The Chase Manhattan Bank National Association), as Trustee (Exhibit 4.1 to registration statement on Form S-3 no. 333-68355, filed December 4, 1998, Securities and Exchange Commission File Number 1-6458*)\n4.2\nFirst Supplemental Senior Indenture dated April 21, 2011 between the registrant and The Bank of New York Mellon, as Trustee (Exhibit 4.2 to registration statement on Form S-3 no. 333-173672, filed April 21, 2011, Securities and Exchange Commission File Number 1-6458*)\n4.3\nSecond Supplemental Senior Indenture dated April 17, 2014 between the registrant and The Bank of New York Mellon, as Trustee (Exhibit 4.3 to registration statement on Form S-3 no. 333-195332, filed April 17, 2014, Securities and Exchange Commission File Number 1-6458*)\n4.4\nSubordinated Indenture dated September 1, 2003 between the registrant and U.S. Bank National Association, as Trustee (Exhibit 4.3 to registration statement on Form S-3 no. 333-108705, filed September 11, 2003, Securities and Exchange Commission File Number 1-6458*)\n4.5\nTerms and Conditions of the Euro Medium Term Notes, published March 31, 2022, applicable to the U.S. $6,000,000,000 Euro Medium Term Note Programme of the registrant, Deere & Company, John Deere Bank S.A., and John Deere Cash Management (Exhibit 4.5 to the Form 10-K of Deere & Company for the year ended October 30, 2022, Securities and Exchange Commission File Number 1-4121*)\n4.6\nThird Supplemental Senior Indenture dated April 7, 2017 between the registrant and The Bank of New York Mellon, as Trustee (Exhibit 4.4 to registration statement on Form S-3 no. 333-217193, filed April 7, 2017, Securities and Exchange Commission File Number 1-6458*)\n4.7\nDescription of the registrants 2.00% Senior Notes due 2031 (Exhibit 4.8 to Form 10-K of the registrant for the year ended October 31, 2021, Securities and Exchange Commission File Number 1-6458*)\nCertain instruments relating to long-term debt constituting less than 10 percent of the registrants total assets may not be filed as exhibits herewith pursuant to Item 601(b)(4)(iii)(A) of Regulation S-K. The registrant will furnish copies of such instruments to the Commission upon request.\n10.1\nAgreement, as amended November 1, 1994, between the registrant and Deere & Company concerning agricultural retail notes (Exhibit 10.1 to Form 10-K of Deere & Company for the year ended October 31, 1998, Securities and Exchange Commission File Number 1-4121*)\n10.2\nAgreement, as amended November 1, 1994, between the registrant and Deere & Company concerning lawn and grounds care retail notes (Exhibit 10.2 to the Form 10-K of Deere & Company for the year ended October 31, 1998, Securities and Exchange Commission File Number 1-4121*)\n10.3\nAgreement, as amended November 1, 1994, between the registrant and John Deere Construction Equipment Company concerning construction retail notes (Exhibit 10.3 to the Form 10-K of Deere & Company for the year ended October 31, 1998, Securities and Exchange Commission File Number 1-4121*)\n10.4\nAgreement, dated July 14, 1997, between the registrant and John Deere Construction Equipment Company concerning construction retail notes (Exhibit 10.4 to Form 10-K of Deere & Company for the year ended October 31, 2003, Securities and Exchange Commission File Number 1-4121*)\n10.5\nSecond Amended Agreement, dated March 27, 2023, between the registrant and Deere & Company relating to fixed charges ratio, ownership and minimum net worth of the registrant (Exhibit 10.4 to Form 10-Q of the registrant for the quarter ended April 30, 2023, Securities and Exchange Commission File Number 1-4121*)\n10.6\nAsset Purchase Agreement, dated October 29, 2001, between Deere & Company and Deere Capital, Inc. concerning the sale of trade receivables (Exhibit 10.19 to Form 10-K of Deere & Company for the year ended October 31, 2001, Securities and Exchange Commission File Number 1-4121*)\n10.7\nSecond Amendment, dated February 21, 2020, to the Asset Purchase Agreement dated October 29, 2001, between Deere & Company and Deere Capital, Inc. (including conformed copy of the Asset Purchase Agreement as Exhibit A thereto) (Exhibit 10.1 to Form 10-Q of Deere & Company for the quarter ended February 2, 2020, Securities and Exchange Commission File Number 1-4121*)\n10.8\nAsset Purchase Agreement, dated October 29, 2001, between John Deere Construction & Forestry Company and Deere Capital, Inc. concerning the sale of trade receivables (Exhibit 10.20 to Form 10-K of Deere & Company for the year ended October 31, 2001, Securities and Exchange Commission File Number 1-4121*)\n10.9\nSecond Amendment, dated February 21, 2020, to the Asset Purchase Agreement dated October 29, 2001, between John Deere Construction & Forestry Company and Deere Capital, Inc. (including conformed copy of the Asset Purchase Agreement as Exhibit A thereto) (Exhibit 10.2 to Form 10-Q of Deere & Company for the quarter ended February 2, 2020, Securities and Exchange Commission File Number 1-4121*)\n10.10\nIncentive Compensation Recovery Policy effective October 2, 2023\n10.11\nAgreement, dated December 14, 2023, between the registrant, Deere & Company, Deere Credit, Inc., and Deere Capital, Inc., relating to providing international support payments between the parties\n10.12\n2027 Credit Agreement, dated March 27, 2023, among the registrant, Deere & Company, John Deere Bank S.A., various financial institutions, JPMorgan Chase Bank, N.A., as Administrative Agent, Bank of America, N.A. and Citibank, N.A., as Co-Syndication Agents, and J.P. Morgan Securities LLC, as Sustainability Structuring Agent (Exhibit 10.2 to Form 10-Q of the registrant for the quarter ended April 30, 2023, Securities and Exchange Commission File Number 1-6458*)\n10.13\n2028 Credit Agreement, dated March 27, 2023, among the registrant, Deere & Company, John Deere Bank S.A., various financial institutions, JPMorgan Chase Bank, N.A., as Administrative Agent, Bank of America, N.A. and Citibank, N.A., as Co-Syndication Agents, and J.P. Morgan Securities LLC, as Sustainability Structuring Agent (Exhibit 10.3 to Form 10-Q of the registrant for the quarter ended April 30, 2023, Securities and Exchange Commission File Number 1-6458*)\n10.14\n364-Day Credit Agreement, dated March 27, 2023, among the registrant, Deere & Company, John Deere Bank S.A., various financial institutions, JPMorgan Chase Bank, N.A., as Administrative Agent, Bank of America, N.A. and Citibank, N.A., as Co-Syndication Agents, and J.P. Morgan Securities LLC, as Sustainability Structuring Agent (Exhibit 10.1 to Form 10-Q of the registrant for the quarter ended April 30, 2023, Securities and Exchange Commission File Number 1-6458*)\n21.\nOmitted pursuant to instruction I(2)\n23.\nConsent of Deloitte & Touche LLP\n24.\nPower of Attorney (included on signature page)\n31.1\nRule 13a-14(a)/15d-14(a) Certification\n31.2\nRule 13a-14(a)/15d-14(a) Certification\n32.\nSection 1350 Certifications (furnished herewith)\n99.\nItem 1A of the Deere & Company Form 10-K for the fiscal year ended October 29, 2023 (Securities and Exchange Commission File Number 1-4121*)\n101.INS\nInline XBRL Instance Document (the instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document)\n101.SCH\nInline XBRL Taxonomy Extension Schema Document\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101)\n*\nIncorporated by reference.\nManagement contract or compensatory plan or arrangement.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nJOHN DEERE CAPITAL CORPORATION\nBy:\n/s/ John C. May\nJohn C. May\nChairman and Chief Executive Officer\n(Principal Executive Officer)\nDate:December 15, 2023\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the date indicated.\nEach person signing below also hereby appoints John C. May, Joshua A. Jepsen, and Edward R. Berk, and each of them singly, his or her lawful attorney-in-fact with full power to execute and file any and all amendments to this report together with exhibits thereto and generally to do all such things as such attorney-in-fact may deem appropriate to enable John Deere Capital Corporation to comply with the provisions of the Securities Exchange Act of 1934 and all requirements of the Securities and Exchange Commission.\nSignature\nTitle\nDate\n/s/ John C. May\nDirector, Chairman, and\n)\nJohn C. May\nChief Executive Officer\n)\n(Principal Executive Officer)\n)\n)\n/s/ Joshua A. Jepsen\nDirector and Senior Vice President\n)\nJoshua A. Jepsen\n(Principal Financial Officer and\n)\nPrincipal Accounting Officer)\n)\n)\n)\n/s/ Rajesh Kalathur\nDirector and President\n)\nRajesh Kalathur\n)\n)\n)\n/s/ Ryan D. Campbell\nDirector\n)\nDecember 15, 2023\nRyan D. Campbell\n)\n)\n)\n/s/ Deanna M. Kovar\nDirector\n)\nDeanna M. Kovar\n)\n)\n)\n/s/ Steven N. Owenson\nDirector\n)\nSteven N. Owenson\n)\n)\n)\n/s/ Cory J. Reed\nDirector\n)\nCory J. Reed\n)\n)\nSignature\nTitle\nDate\n/s/ Jayma A. Sandquist\nDirector\n)\nJayma A. Sandquist\n)\n)\nDecember 15, 2023\n)\n/s/ Andrew C. Traeger\nDirector\n)\nAndrew C. Traeger\n)"
}