{
    "cik": "27673",
    "company": "DEERE JOHN CAPITAL CORP",
    "filing_type": "10-K",
    "filing_date": "2022-12-15",
    "period_of_report": "2022-10-30",
    "sic": "6153",
    "state_of_inc": "DE",
    "state_location": "WI",
    "fiscal_year_end": "1030",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/27673/0001558370-22-018706-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/27673/000155837022018706/jdcc-20221030x10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/27673/0001558370-22-018706.txt",
    "filename": "27673_10K_2022_0001558370-22-018706.htm",
    "content": "Item 1. Business.\nThis Annual Report on Form 10-K contains forward-looking statements that are subject to risks and uncertainties. All statements other than statements of historical fact included in this Annual Report on Form 10-K are forward-looking statements. Forward-looking statements provide our current expectations and projections relating to our financial condition, results of operations, plans, objectives, future performance, and business. You can identify forward-looking statements as they do not relate to historical or current facts and by words such as believe, expect, estimate, anticipate, will, should, plan, forecast, target, guide, project, intend, could, and similar words or expressions.\nAll forward-looking statements are subject to risks and uncertainties that may cause actual results to differ materially from those that we expected. Important factors that could cause actual results to differ materially from our expectations, or cautionary statements, and other important information about forward-looking statements are disclosed under Item 1A, Risk Factors, and Item 7, Managements Discussion and Analysis of Financial Condition and Results of Operations-Forward-Looking Statements in this Annual Report on Form 10-K.\nThe Company\nJohn Deere Capital Corporation (Capital Corporation) and its subsidiaries are collectively called the Company. John Deere Financial Services, Inc. (JDFS), a wholly-owned finance holding subsidiary of Deere & Company, owns all of the outstanding common stock of Capital Corporation. See Relationships of the Company with John Deere for additional information regarding agreements between the Company and Deere & Company. The Company conducts business in Australia, New Zealand, the United States (U.S.), and in several countries in Africa, Asia, Europe, and Latin America, including Argentina and Mexico. Capital Corporation was incorporated under the laws of Delaware and commenced operations in 1958.\nThe Company provides and administers financing for retail purchases of new equipment manufactured by Deere & Companys production and precision agriculture operations, small agriculture and turf operations, and construction and forestry operations and used equipment taken in trade for this equipment. References to agriculture and turf include both production and precision agriculture and small agriculture and turf. The Company generally purchases retail installment sales and loan contracts (retail notes) from Deere & Company and its wholly-owned subsidiaries (collectively called John Deere). John Deere generally acquires these retail notes through independent John Deere retail dealers. The Company also purchases and finances a limited amount of non-John Deere retail notes. In addition, the Company finances and services revolving charge accounts, in most cases acquired from and offered through merchants in the agriculture and turf, and construction and forestry markets (revolving charge accounts). The Company also provides wholesale financing to dealers of John Deere agriculture and turf equipment, and construction and forestry equipment, primarily to finance inventories of equipment for those dealers (wholesale receivables). Further, the Company leases John Deere equipment and a limited amount of non-John Deere equipment to retail customers (financing and operating leases). The Company also offers credit enhanced international export financing to select customers and dealers, which primarily involves John Deere products. Retail notes, revolving charge accounts, and financing leases are collectively called Customer Receivables. Customer Receivables and wholesale receivables are collectively called Receivables. Receivables and equipment on operating leases are collectively called Receivables and Leases. The Company generally secures its Receivables, other than certain revolving charge accounts, by retaining as collateral security in the goods associated with those Receivables or with the use of other collateral.\nJohn Deeres internet address is https://www.deere.com. The information contained on John Deeres website is not included in, nor incorporated by reference into, this Annual Report on Form 10-K.\nBusiness of John Deere\nJohn Deeres operations are categorized into four business segments:\nThe production and precision agriculture segment defines, develops, and delivers global equipment and technology solutions to unlock customer value for production-scale growers of large grains, small grains, cotton, and\nsugarcane. The segments main products include large and certain mid-size tractors, combines, cotton pickers, sugarcane harvesters and loaders, and soil preparation, seeding, application, and crop care equipment.\nThe small agriculture and turf segment defines, develops, and delivers global equipment and technology solutions to unlock customer value for dairy and livestock producers, high-value crop producers, and turf and utility customers. The segments primary products include certain mid-size and small tractors, as well as hay and forage equipment, riding and commercial lawn equipment, golf course equipment, and utility vehicles.\nThe construction and forestry segment defines, develops, and delivers a broad range of machines and technology solutions to unlock customer value on job sites, including earthmoving, forestry, and roadbuilding production systems. The segments primary products include crawler dozers and loaders, four-wheel-drive loaders, excavators, skid-steer loaders, milling machines, and log harvesters.\nThe products and services produced by the segments above are marketed primarily through independent retail dealer networks and major retail outlets and, as it relates to roadbuilding products in certain markets outside the U.S. and Canada, primarily through John Deere-owned sales and service subsidiaries.\nThe financial services segment includes the operations of the Company (described herein), and additional operations in the U.S., Canada, Brazil, China, India, Russia, and Thailand. John Deere suspended shipments to Russia on February 24, 2022 and no new financing has been offered. The segment primarily finances sales and leases by John Deere dealers of new and used production and precision agriculture, small agriculture and turf, and construction and forestry equipment. In addition, the financial services segment provides wholesale financing to dealers of the foregoing equipment, finances retail revolving charge accounts, and offers extended equipment warranties.\nJohn Deeres worldwide production and precision agriculture operations, small agriculture and turf operations, and construction and forestry operations are sometimes collectively referred to as the equipment operations. The financial services segment is sometimes referred to as the financial services operations. Receivables and Leases managed by the Company are evaluated by market (agriculture and turf or construction and forestry).\nFor fiscal 2022, worldwide net income attributable to Deere & Company was $7.131 billion, or $23.28 per share, compared with $5.963 billion, or $18.99 per share, in fiscal 2021.\nDeere & Companys consolidated net sales and revenues increased 19 percent to $52.577 billion in 2022, compared with $44.024 billion in 2021. Net sales of the equipment operations increased in fiscal 2022 to $47.917 billion, compared with $39.737 billion last year, due to higher shipment volumes and price realization, partially offset by the negative effects of currency translation.\nThe financial services operations reported net income of $880 million for fiscal 2022 compared with $881 million in fiscal 2021. Net income in 2022 was roughly the same mainly due to income earned on a higher average portfolio, partially offset by less favorable financing spreads and unfavorable discrete income tax adjustments. In addition, financial services provision for credit losses increased in 2022, primarily due to economic uncertainty in Russia. The financial services operations received an intercompany benefit from the equipment operations, as the equipment operations guarantees financial services investments in certain international markets, including Russia.\nSmart Industrial Operating Model and Leap Ambitions\nIn fiscal year 2020, John Deere began implementing the Smart Industrial operating model. The Smart Industrial operating model is focused on making significant investments in strengthening John Deeres capabilities in digital, automation, autonomy, and alternative propulsion technologies. These technologies are intended to increase worksite efficiency, improve yields, lower input costs, and ease labor constraints. Building upon the Smart Industrial operating model, John Deere announced its Leap Ambitions framework in fiscal year 2022. The Leap Ambitions are goals that measure John Deeres Smart Industrial operating model and are designed to boost economic value and sustainability for John Deeres customers. As an enabling business, the Company is fully integrated with John Deeres Smart Industrial operating model and is focused on providing financial solutions to help John Deere achieve its Leap Ambitions. For additional information regarding John Deeres Smart Industrial operating model and Leap Ambitions, refer to the Smart\nIndustrial Operating Model and Leap Ambitions section in Item 1 of the Deere & Company Annual Report on Form 10-K for the year ended October 30, 2022.\nMarket Conditions\nAgriculture and Turf. Industry sales of large agricultural machinery in the U.S. and Canada are forecasted to increase 5 to 10 percent compared to 2022. Industry sales of small agricultural and turf equipment in the U.S. and Canada are expected to be flat to down 5 percent in 2023. Industry sales of agricultural machinery in Europe are forecasted to be flat to up 5 percent, while South American industry sales of tractors and combines are forecasted to be flat to up 5 percent in 2023. Asia industry sales are forecasted to be down moderately in 2023 as the demand in India, the worlds largest tractor market by unit, stabilizes.\nConstruction and Forestry. On an industry basis, North American construction equipment and compact construction equipment sales are each expected to be flat to up 5 percent in 2023. Global forestry and global roadbuilding industry sales are each expected to be flat.\nFinancial Services, including the Company. Results for the full-year fiscal 2023 are expected to be slightly higher due to income earned on a higher average portfolio, partially offset by less favorable financing spreads and lower gains on operating lease dispositions. Excluding financial services portfolio in Russia, a higher provision for credit losses is forecasted in 2023.\nRelationships of the Company with John Deere\nThe results of operations of the Company are affected by its relationships with John Deere, including, among other items, the terms on which the Company acquires Receivables and borrows funds from John Deere, the reimbursement for interest waiver and low-rate finance programs from John Deere, the compensation paid by John Deere in connection with the Companys purchase of trade receivables from John Deere, and the payment to John Deere for various expenses applicable to the Companys operations. In addition, John Deere and the Company have joint access to certain lines of credit.\nThe Companys volume of Receivables and Leases is largely dependent upon the level of retail sales and leases of John Deere products. The level of John Deere retail sales and leases is responsive to a variety of economic, financial, geopolitical, climatic, legislative, and other factors that influence supply and demand for its products. The majority of the Companys businesses are affected by changes in interest rates, demand for credit, and competition.\nThe Company bears substantially all of the credit risk (net of recovery from withholdings from certain John Deere dealers and merchants) associated with its holding of Receivables and Leases. A small portion of the Receivables and Leases held (less than 5 percent) is guaranteed by certain subsidiaries of Deere & Company. The Company also performs substantially all servicing and collection functions. Servicing and collection functions for a small portion of the Receivables and Leases held (less than 5 percent) are provided by John Deere. John Deere is reimbursed for staff and other administrative services at estimated cost and for credit lines provided to the Company based on utilization of those lines.\nThe terms and the basis on which the Company acquires retail notes and certain wholesale receivables from John Deere are governed by agreements with John Deere, generally terminable by either John Deere or the Company on 30 days notice. As provided in these agreements, the Company agrees to the terms and conditions for purchasing the retail notes and wholesale receivables from John Deere. Under these agreements, John Deere is not obligated to sell notes to the Company, and the Company is obligated to purchase notes from John Deere only if the notes comply with the terms and conditions set by the Company.\nThe basis on which John Deere acquires retail notes and wholesale receivables from John Deere dealers is governed by agreements with those dealers, which may be terminated in accordance with their terms and applicable law. In acquiring these notes from dealers, the terms and conditions, as set forth in agreements with the dealers, conform with the terms and conditions adopted by the Company in determining the acceptability of retail and certain wholesale notes to be purchased from John Deere. The dealers are not obligated to sell these notes to John Deere and John Deere is not obligated to accept these notes from the dealers. In practice, retail and wholesale notes are acquired from dealers only if the terms of these notes and the creditworthiness of the customers are acceptable to the Company. The Company acts on\nbehalf of both itself and John Deere in determining the acceptability of the notes and in acquiring acceptable notes from dealers.\nThe basis on which the Company enters into leases with retail customers through John Deere dealers is governed by agreements between those dealers and the Company. Leases are accepted based on the terms and conditions, the lessees creditworthiness, the anticipated residual values of the equipment, and the intended use of the equipment.\nDeere & Company has an agreement with Capital Corporation pursuant to which it has agreed to continue to own, directly or through one or more wholly-owned subsidiaries, at least 51 percent of the voting shares of capital stock of Capital Corporation and to maintain the Companys consolidated tangible net worth at not less than $50.0 million. This agreement also obligates Deere & Company to make payments to Capital Corporation such that its consolidated ratio of earnings to fixed charges is not less than 1.05 to 1 for each fiscal quarter. Deere & Companys obligations to make payments to Capital Corporation under the agreement are independent of whether the Company is in default on its indebtedness, obligations, or other liabilities. Further, Deere & Companys obligations under the agreement are not measured by the amount of the Companys indebtedness, obligations, or other liabilities. Deere & Companys obligations to make payments under this agreement are expressly stated not to be a guarantee of any specific indebtedness, obligation, or liability of the Company and are enforceable only by or in the name of Capital Corporation. No payments were required under this agreement during the periods included in the consolidated financial statements. At October 30, 2022, Deere & Company indirectly owned 100 percent of the voting shares of Capital Corporations capital stock and Capital Corporations consolidated tangible net worth was $4,803.4 million.\nThe Company purchases certain wholesale trade receivables from John Deere. These trade receivables arise from John Deeres sales of goods to independent dealers. Under the terms of the sales to dealers, interest is primarily charged to dealers on outstanding balances from the earlier of the date when goods are sold to retail customers by the dealer or the expiration of certain interest-free periods granted at the time of the sale to the dealer, until payment is received by the Company. Dealers cannot cancel purchases after John Deere recognizes a sale and are responsible for payment even if the equipment is not sold to retail customers. The interest-free periods are determined based on the type of equipment sold and the time of year of the sale. These periods range from one to twelve months for most equipment. Interest-free periods may not be extended. Interest charged may not be forgiven and the past due interest rates exceed market rates. The Company receives compensation from John Deere at approximate market interest rates for these interest-free periods. The Company computes the compensation from John Deere for interest-free periods based on the Companys estimated funding costs, administrative and operating expenses, credit losses, and required return on equity.\nA portion of finance income earned by the Company arises from financing of retail sales of John Deere equipment on which finance charges are waived or reduced by John Deere for a period from the date of the retail sale to a specified subsequent date. The Company receives compensation from John Deere equal to competitive market interest rates for periods during which finance charges have been waived or reduced. The Company computes the compensation from John Deere for waived or reduced finance charges based on the Companys estimated funding costs, administrative and operating expenses, credit losses, and required return on equity. The financing rate following the waiver or interest reduction period is not significantly different from the compensation rate from John Deere.\nDescription of Receivables and Leases\nReceivables and Leases arise mainly from retail and wholesale sales and leases of John Deere products and used equipment accepted in trade for them, and from retail sales of equipment of unrelated manufacturers. Receivables and Leases also include revolving charge accounts receivable. At October 30, 2022 and October 31, 2021, at least 90 percent of the Receivables and Leases administered by the Company were for financing that facilitated the purchase or lease of John Deere products.\nJohn Deere Financial, f.s.b. (Thrift) is a wholly-owned subsidiary of Capital Corporation. It holds a federal thrift charter and is regulated by the Office of the Comptroller of the Currency (OCC). The U.S. Federal Reserve Board has oversight of the Company, as the owner of the Thrift. The Thrift is headquartered in Madison, Wisconsin and offers revolving charge products including John Deere Financial Multi-Use Account, PowerPlanâ, and John Deere Financial Revolving Plan throughout the U.S. The John Deere Financial Multi-Use Account is used by farmers and ranchers to finance their purchases of production inputs from agribusiness merchants, including seed, fertilizer, and crop protection.\nThe John Deere Financial Multi-Use Account is also used by agriculture and turf customers to finance the purchase of parts and service from John Deere dealers. PowerPlanâ is primarily used by construction and forestry customers to finance the purchase of equipment parts, equipment rentals, and service work performed at John Deere construction and forestry dealers. The John Deere Financial Revolving Plan is used primarily by retail customers of John Deere dealers to finance purchases of turf and utility equipment. See Note 3 to the Consolidated Financial Statements under Revolving Charge Accounts Receivable.\nThe Company provides wholesale financing to John Deere dealers, primarily to finance agriculture and turf and construction and forestry equipment inventories. A large portion of the wholesale financing is provided by the Company to dealers from whom it also purchases agriculture and turf and construction and forestry retail notes. See Note 3 to the Consolidated Financial Statements under Wholesale Receivables.\nThe Company generally requires that theft and physical damage insurance be carried on all goods leased or securing retail notes and wholesale receivables. In certain markets, the customer may, at the customers own expense, have the Company or the seller of the goods purchase this insurance or obtain it from other sources. Insurance is not required for goods purchased under revolving charge accounts.\nReceivables and Leases are eligible for acceptance if they conform to prescribed finance and lease plan terms. Guidelines relating to down payments and contract terms on retail notes and leases are described in Note 3 and Note 6 to the Consolidated Financial Statements.\nIn limited circumstances, Receivables and Leases may be accepted even though they do not conform in all respects to the established guidelines. The Company determines whether Receivables and Leases should be accepted and how they should be serviced. Acceptance of these Receivables and Leases is dependent on having one or more risk mitigation enhancements that may include larger down payments or advance lease payments, additional co-borrowers or guarantors, the pledge of additional collateral as security, the assignment of specific earnings to the Company, or the acceptance of accelerated payment schedules. Officers of the Company are responsible for establishing policies and reviewing the performance of the Company in accepting and collecting Receivables and Leases. The Company performs substantially all of its own routine collections, settlements, and repossessions on Receivables and Leases.\nJohn Deere retail notes and wholesale receivables are generally supported by perfected security interests in goods financed under laws such as the Uniform Commercial Code (UCC), certain federal statutes, and state motor vehicle laws in the U.S. and by security in goods or other security under applicable laws in other countries and jurisdictions. UCC financing statements are also prepared and filed on leases; however, these filings for operating leases are made for informational purposes only.\nFinance Rates on Retail Notes\nAs of October 30, 2022 and October 31, 2021, over 95 percent of the retail notes held by the Company bore a fixed finance rate. A portion of the finance income earned by the Company arises from reimbursements from John Deere in connection with financing the retail sales of John Deere equipment on which finance charges are waived or reduced by John Deere for a period from the date of sale to a specified subsequent date. See Note 3 to the Consolidated Financial Statements for additional information.\nAverage Original Term and Average Actual Life of Retail Notes and Leases\nDue to prepayments (often from trade-ins and refinancing), the average actual life of retail notes and leases is considerably shorter than the average original term. The following table shows the average original term for retail notes\nand leases acquired during the year and the average actual life for retail notes and leases liquidated during the year (in months):\nAverage Original Term\nAverage Actual Life\nRetail notes:\nNew equipment:\nAgriculture and turf\nConstruction and forestry\nUsed equipment:\nAgriculture and turf\nConstruction and forestry\nFinancing leases\nEquipment on operating leases\nMaturities\nThe following table presents the contractual maturities of Receivables and Leases owned by the Company at October 30, 2022 (in millions of dollars), and a summary of Receivables and Leases owned by the Company at October 30, 2022 and October 31, 2021 (in millions of dollars):\nOne year\nor less\nOne to five years\nFive to fifteen years\nTotal\nFixed\nVariable\nFixed\nVariable\nrate\nrate\nrate\nrate\nRetail notes:\nAgriculture and turf\n$\n7,052.6\n$\n15,746.3\n$\n427.2\n$\n627.1\n$\n4.6\n$\n23,857.8\n$\n21,518.9\nConstruction and forestry\n1,916.6\n3,020.0\n5.5\n12.0\n4,954.1\n4,487.0\nTotal retail notes\n8,969.2\n18,766.3\n432.7\n639.1\n4.6\n28,811.9\n26,005.9\nRevolving charge accounts\n3,968.3\n88.7\n108.8\n4,165.8\n3,740.1\nWholesale receivables\n8,032.3\n109.6\n259.9\n2.7\n8,404.5\n5,951.3\nFinancing leases\n613.7\n496.5\n10.5\n1,120.7\n972.3\nEquipment on operating leases\n1,107.7\n3,652.8\n93.0\n4,853.5\n4,947.6\nTotal Receivables and Leases\n$\n22,691.2\n$\n23,113.9\n$\n801.4\n$\n745.3\n$\n4.6\n$\n47,356.4\n$\n41,617.2\nNet Write-offs\nTotal net (write-offs) recoveries, by product, were as follows (in millions of dollars):\nDollars\nPercent\nDollars\nPercent\nDollars\nPercent\nNet write-offs:\nRetail notes and financing leases:\nAgriculture and turf\n$\n(11.2)\n(.04)\n%\n$\n(9.4)\n(.04)\n%\n$\n(10.6)\n(.06)\n%\nConstruction and forestry\n(15.1)\n(.30)\n(15.7)\n(.36)\n(32.1)\n(.89)\nTotal retail notes and financing leases\n(26.3)\n(.10)\n(25.1)\n(.10)\n(42.7)\n(.21)\nRevolving charge accounts\n2.9\n.09\n7.7\n.23\n(22.1)\n(.65)\nWholesale receivables\n(.2)\n(.3)\n.4\n.01\nTotal net write-offs\n$\n(23.6)\n(.06)\n%\n$\n(17.7)\n(.05)\n%\n$\n(64.4)\n(.20)\n%\nAllowance for Credit Losses\nReceivables 30 days or more past due continue to accrue finance income. The Company ceases to accrue finance income once Receivables are considered non-performing. An allowance for credit losses is recorded for the estimated credit losses expected over the life of the Receivable portfolio. The Company measures expected credit losses on a collective basis when similar risk characteristics exist. Risk characteristics considered by the Company include product category, market, geography, credit risk, and remaining duration. Receivables that do not share risk characteristics with other receivables in the portfolio are evaluated on an individual basis. Non-performing Receivables are included in the\nestimate of expected credit losses. See Note 4 for additional information related to the allowance for credit losses.\nThe total allowance for credit losses, by product, at October 30, 2022 and October 31, 2021 (in millions of dollars), and the portfolio, by product, as a percent of total portfolio are presented below:\nDollars\nPercent\nDollars\nPercent\nRetail notes and financing leases:\nAgriculture and turf\n$\n43.1\n%\n$\n49.2\n%\nConstruction and forestry\n52.3\n47.3\nTotal retail notes and financing leases\n95.4\n96.5\nRevolving charge accounts\n21.9\n20.8\nWholesale receivables\n11.1\n11.7\nTotal\n$\n128.4\n%\n$\n129.0\n%\nKey credit quality metrics and related portfolio balances (in millions of dollars) at October 30, 2022 and October 31, 2021 were as follows:\nDollars\nDollars\nReceivables 30 days or more past due\n$\n404.9\n$\n340.8\nNon-performing Receivables\n263.2\n280.1\nAllowance for credit losses\n128.4\n129.0\nTotal Receivables\n42,502.9\n36,669.6\nPercent\nPercent\nReceivables 30 days or more past due to total Receivables\n.95\n%\n.93\n%\nNon-performing Receivables to total Receivables\n.62\n.76\nAllowance for credit losses to total Receivables\n.30\n.35\nAllowance for credit losses to non-performing Receivables\n48.78\n46.05\nThe Receivables portfolio continued to perform strongly in 2022 as evidenced by the 30 days or more past due and non-performing Receivables as a percentage of the total Receivables portfolio. The allowance for credit losses as a percent of total portfolio was favorable in 2022 compared to 2021, primarily due to continued positive agricultural market conditions. In addition, strong recovery rates, driven by higher prices on used equipment inventory, also benefited the allowance for credit losses.\nCompetition\nThe businesses in which the Company is engaged are highly competitive. The Company primarily competes for customers with commercial banks and finance and leasing companies based upon its service, finance rates charged, and other finance terms. In addition, the competitive landscape is evolving as technology is unlocking new capabilities for traditional competitors and enabling new digital entrants that could be either technology partners or potential competitors. The proportion of John Deere equipment retail sales and leases financed by the Company is influenced by conditions prevailing in the agriculture and turf equipment and construction and forestry equipment markets, in the financial markets, and in business generally. The Company financed a significant portion of John Deere equipment retail sales and leases in many of the countries in which the Company operated during 2022 and 2021.\nThe Company emphasizes convenient service to customers and endeavors to offer terms desired in its specialized markets, such as seasonal schedules of repayment and rentals. The Companys retail finance rates and lease rates are generally believed to be in the range offered by other sales finance and leasing companies, although not as low as those of some banks and other lenders and lessors.\nRegulation\nIn several U.S. states, state law limits the maximum finance rate on receivables. The present state limitations have not significantly limited variable-rate finance charges or the fixed-rate finance charges established by the Company. However, if interest rate levels should increase significantly, maximum state rates could affect the Company by preventing the variable rates on outstanding variable-rate retail notes from increasing above the maximum state rate and by limiting the fixed rates on new notes. In some states, the Company may be able to qualify new retail notes for a higher maximum rate limit by using retail installment sales contracts (rather than loan contracts) or by using fixed-rate rather than variable-rate contracts.\nIn addition to rate regulation, various U.S. state and federal laws and regulations apply to some Receivables and Leases, principally retail notes for goods sold for personal, family, or household use and John Deere Financial Revolving Plan, John Deere Financial Multi-Use Account, and PowerPlanâ products and receivables. To date, these laws and regulations have not had a significant adverse effect on the Company.\nThe Thrift holds a federal thrift charter and is subject to regulation and examination by the OCC. The U.S. Federal Reserve Board has oversight of the Company, as the owner of the Thrift.\nThe manner in which the Company offers financing outside the U.S. is affected by a variety of country specific laws, regulations, and customs, including those governing property rights and debtor obligations, which are subject to change and that may introduce greater risk to the Company.\nIn fiscal year 2022, compliance with the regulations applicable to the Company did not have a material effect on capital expenditures, earnings, or competitive position. The Company does not expect to incur material capital expenditures related to compliance with regulations during fiscal year 2023. Additional information about the impact of government regulations on the Companys business is included in Item 1A, Risk Factors under the headings Strategic Risks and Legal and Compliance Risks.\nHuman Capital\nHigher Purpose\nThe Companys employees, its human capital, are guided by John Deeres higher purpose: We run so life can leap forward. Employees are further guided by John Deeres Code of Business Conduct (Code), which helps them to uphold and strengthen the standards of honor and integrity that have defined John Deere since its founding. Our world and business may change, but our core values-integrity, quality, commitment and innovation-remain constant in everything we do. Our values have shaped and guided John Deeres vision since 1837.\nEmployees\nAt October 30, 2022, the Company had 1,488 full-time and part-time employees. The Company also retains consultants, independent contractors, and temporary workers.\nCode of Business Conduct\nJohn Deere and the Company are committed to conducting business in accordance with the highest ethical standards. This means how we conduct ourselves and our global work is more than just a matter of policy and law; it reflects our core values. The Code provides specific guidance to all John Deere employees, outlining how they can and must uphold and strengthen the integrity that has defined John Deere since its founding. The Companys policy requires all employees to complete Code training and, where permitted by law, also requires the employees to certify each year that they will comply with the Code. The Company maintains a global compliance hotline to allow for concerns to be brought forward.\nDiversity, Equity, and Inclusion (DEI)\nThe Company believes that a diverse workforce is essential to its long-term success and it strives to foster a diverse, equitable, and inclusive culture where all voices are heard, valued, and included. The Company embraces employees differences in race, color, religion, age, sex, sexual orientation, gender, gender identity or expression, marital or partnership status, family status, citizenship, genetic information, national origin, ancestry, geographic background, military or veteran status, disability (mental or physical), and any other characteristics that make our employees unique.\nThe Companys global DEI strategy focuses on embedding DEI into world-wide business operations and people processes. The Company believes that sustainable DEI requires rigor and long-term investment to realize lasting benefits to the business. The Companys DEI strategic framework consists of four DEI pillars that reflect our areas of focus-people, leadership, business strategy, and community.\nThe Companys leadership team works to set a consistent and transparent tone on DEI issues and strategy. The Company creates spaces for open conversations and learning through its DEI speaker series, micro-learnings, and online forum panel series, ‘Lets Talk Series. Additionally, the Company works to provide immersive learning experiences to improve workplace equity and inclusion. DEI expectations are integrated into the Companys global performance management program. To help managers with development and team building, the Company measures inclusiveness as part of its periodic internal employee experience survey.\nJohn Deere and the Company proudly partner with several professional organizations to support our diversity recruitment strategy, including Anita B.org. - a global organization for women in technology, Minorities in Agriculture Natural Resources and Related Sciences, the National Association of Black Accountants, Inc., the National Black MBA Association, Inc., the National Society of Black Engineers, Prospanica - the Association of Hispanic Professionals, the Society of Women Engineers, the Thurgood Marshall College Fund Leadership Institute, and the Society of Hispanic Professional Engineers.\nJohn Deeres 13 Employee Resource Groups (ERGs), in which employees of the Company participate, are Company sponsored organizations run by employees, and are a key driver of inclusion at John Deere and a critical component of our global DEI strategy. ERGs build organization-wide networks that help enable employees with shared interests to come together and are open to all employees. The global chapters work with local teams to support our efforts to attract, retain, and develop the best talent.\nCompensation and Benefits\nThe Companys total rewards are intended to be competitive, meet the varied needs of our global workforce, and reinforce our values. The Company is committed to providing comprehensive and competitive pay and benefits to its employees. The Company has invested, and continues to invest, in its employees through growth and development and well-being initiatives.\nThe Companys work environment is designed to promote innovation and well-being and reward performance. The Companys total rewards for employees include a variety of components that aim to support sustainable employment and the ability to build a strong financial future, including competitive market-based pay and comprehensive benefits. In addition to earning base pay, eligible employees are compensated for their contributions to the Companys goals with both short-term and long-term cash incentives and long-term equity-based incentives.\nEligible full-time employees in the U.S. have access to medical, dental, and vision plans; savings and retirement plans; parental leave and paid time off; and other resources, such as the Employee Assistance Program (EAP), which provides mental health and wellness services. The Company also offers a variety of working arrangements to eligible employees, including flexible schedules, telecommuting, and job sharing, to help employees manage home and work-life situations. Programs and benefits differ internationally for a variety of reasons, such as local legal requirements, market practices, and negotiations with works councils, and other employee representative bodies.\nTraining and Development\nThe Company provides training and development opportunities for employees at all stages of their careers to empower them to reach their full potential. Employees are critical to the long-term success of the Companys business. We encourage employees to identify the paths that can build the skills, experience, knowledge, and competencies needed for career advancement. The Company supports employees by creating purpose-driven work opportunities, comprehensive performance reviews and development plans, mentoring opportunities, and professional and personal development opportunities.\nThe Company encourages employees to provide feedback across the enterprise through our internal voluntary employee experience survey, ad-hoc pulse surveys, and new-hire and exit surveys. Reports from these surveys help equip the Company to address needs across the employee lifecycle to improve the overall experience and engagement of our workforce.\nIn terms of learning and development, the Company continues to invest in technology and content providers that strengthen our commitment to prepare a future-ready workforce. We offer training, upskilling, and development opportunities at all stages of an employees career, empowering them to reach their full potential.\nThe Companys training programs, which are tailored to different geographic regions and job functions, include among other topics, relationships with customers and dealers, the Companys culture and values, compliance with the Code, compliance with anti-bribery/corruption laws and policies, compliance with management of private data and cybersecurity, regulatory compliance, conflicts of interest, discrimination and workplace harassment policies, sexual harassment policies, and leadership development.\nHuman Rights\nThe Company honors human rights and respects the individual dignity of all persons globally. The Companys commitment to human rights requires that we understand and carry out our responsibilities consistent with Company values and practices. The Company strives to ensure that human rights are upheld for our employees and employees of John Deere dealers. Our commitment to human rights is defined in the Code, the John Deere dealer Code of Conduct, related policies and procedures, and Support of Human Rights in our Business Practice, each of which is available on John Deeres website under Governance. These documents establish clear guidelines for our employees and John Deere dealers while helping to inform our business decisions. We do not tolerate human rights abuses, such as forced labor, unlawful child labor, or human trafficking. We are proud to contribute to the places where we work and support the residents of these places. Item 1A. Risk Factors.\nThe results of operations of the Company are affected by its relationships with John Deere. See Relationships of the Company with John Deere for additional information regarding the relationship between the Company and John Deere.\nThe following risks are considered material to the Companys business based upon current knowledge, information, and assumptions. This discussion of risk factors should be considered closely in conjunction with Managements Discussion and Analysis of Financial Condition and Results of Operations, including the risks and uncertainties described in the Forward-Looking Statements, the Notes to Consolidated Financial Statements, and the risk factors of Deere & Company included in Exhibit 99 to this Annual Report on Form 10-K and incorporated herein by reference. These risk factors and other forward-looking statements relate to future events, expectations, trends, and operating periods, and involve certain factors that are subject to change and important risks and uncertainties that could cause actual results to differ materially. Some of these risks and uncertainties could affect particular portions of the business, while others could affect all the Companys business. Although the risks are organized by headings, and each risk is discussed separately, many are interrelated. The risks described in this Annual Report on Form 10-K and the Forward-Looking Statements in this report are not the only risks faced by the Company.\nSTRATEGIC RISKS\nThe profitability and financial condition of the Companys operations are dependent upon the operations of John Deere.\nThe Companys volume of Receivables and Leases is largely dependent upon the level of retail sales and leases of John Deere products. The results of operations of the Company are affected by its relationships with John Deere, including, among other items, the terms on which the Company acquires Receivables and borrows funds from John Deere, the reimbursement for interest waiver and low-rate finance programs from John Deere, the compensation paid by John Deere in connection with the Companys purchase of trade receivables from John Deere, and the payment to John Deere for various expenses applicable to the Companys operations. In addition, John Deere and the Company have joint access to certain lines of credit.\nIf there were significant changes in the production or sales of John Deere products; the quality or resale value of John Deere equipment; John Deeres liquidity, capital position, debt ratings, and access to capital markets; the reputation of John Deere; or inflationary pressures, supply chain constraints, or other factors impacting John Deere or its products, such changes could significantly affect the Companys profitability, financial condition, and access to capital markets. In addition, if there were changes to sales incentive programs offered by John Deere to retail customers, in which the Company receives reimbursement for interest waiver and low-rate finance programs, this could decrease the Companys market share of John Deere financed equipment, volumes, and profitability.\nInternational, national, and regional trade laws, regulations, and policies (particularly those related to or restricting global trade) and government farm programs and policies could significantly impair John Deeres profitability and growth prospects. As the Companys volume of Receivables and Leases is largely dependent upon the level of retail sales and leases of John Deere products, these macroeconomic drivers could also negatively impact the Company's profitability and growth prospects.\nInternational, national, and regional laws, regulations, and policies directly or indirectly related to or restricting the import and export of John Deeres products, services, and technology, or those of its customers, including protectionist policies in particular jurisdictions or for the benefit of favored industries or sectors, could harm John Deeres global business. John Deeres profitability and growth prospects are tied directly to the global marketplace. Restricted access to global markets impairs John Deeres ability to export goods and services from its various manufacturing locations around the world and limits the ability to access raw materials and high-quality parts and components at competitive prices on a timely basis. Trade restrictions, including withdrawal from or modification of existing trade agreements, negotiation of new trade agreements, non-tariff trade barriers, local content requirements, and imposition of new or retaliatory tariffs against certain countries or covering certain products, including developments in U.S.-China trade relations and sanctions against Russia, have limited, and could continue to limit, John Deeres ability to capitalize on current and future growth opportunities in international markets and impair John Deeres ability to expand the business. These trade restrictions, and changes in, or uncertainty surrounding, global trade policies, may affect John Deeres competitive position. Policies impacting exchange rates and commodity prices or those limiting the export or import of commodities could have a material adverse effect on the international flow of agricultural and other commodities that may result in a corresponding negative effect on the demand for agricultural and forestry equipment in many areas of the world. John Deeres agricultural equipment sales could be especially harmed by such policies because farm income strongly influences sales of agricultural equipment around the world. Furthermore, trade restrictions could impede those in developing countries from achieving a higher standard of living, which could negatively impact John Deeres future growth opportunities arising from increasing global demand for food, fuel, and infrastructure. Additionally, changes in government farm programs and policies, including direct payment and other subsidies, can significantly influence demand for agricultural equipment as well as create unequal competition for multinational companies relative to domestic companies.\nGreater political, economic, and social uncertainty and the evolving globalization of businesses could significantly change the dynamics of John Deeres and the Companys competition, customer base, and product offerings and impact John Deeres and the Companys growth opportunities globally.\nJohn Deeres efforts to grow its businesses depend in part upon access to additional geographic markets, including, but not limited to, Argentina, Brazil, China, India, and South Africa, and its success in developing market share\nand operating profitably in such markets. In some cases, these countries have greater political and economic volatility, greater vulnerability to infrastructure and labor disruptions, and differing local customer product preferences and requirements than John Deeres other markets. Having business operations in various regions and countries exposes John Deere and the Company to multiple and potentially conflicting business practices, and legal and regulatory requirements that are subject to change and are often complex and difficult to navigate, including those related to tariffs and trade regulations, investments, property ownership rights, taxation, repatriation of earnings, and advanced technologies. Expanding business operations globally also increases exposure to currency fluctuations, which can materially affect the Companys financial results. While John Deere maintains a positive corporate image and its brands are widely recognized and valued in its traditional markets, the brands are less known in some emerging markets, which could impede John Deeres efforts to successfully compete in these markets.\nThe conflict between Russia and Ukraine could adversely impact John Deeres business and financial results.\nOn February 24, 2022, John Deere suspended shipments of machines and service parts to Russia and Belarus. As a result, the Company has not offered any new financings in Russia. After assessing the impact of the Russia and Ukraine conflict on John Deeres operations within Russia, John Deeres senior management in the U.S. decided to initiate a voluntary employee-separation program, which reduced overall headcount in Russia. John Deere may further reduce or discontinue operations in Russia depending on the continued evolution of the conflict, monetary, currency or payment controls, restrictions on access to financial institutions, supply and transportation challenges, sanctions and export controls and counter-sanctions, or other circumstances and considerations. John Deeres U.S. senior management continues to closely monitor all risks to John Deeres and the Companys operations in the region. The broader consequences of the Russia and Ukraine conflict such as, embargoes, regional instability, geopolitical shift, access to natural gas, higher energy prices, potential retaliatory action by the Russian government, including nationalization of foreign businesses, increased tensions between the U.S. and countries in which John Deere and the Company operate, and the extent of the conflicts effect on the global economy, cannot be predicted, including the extent to which the conflict may heighten other risks disclosed herein. Ultimately, these or other factors could result in further loss or write-downs of other operating assets and working capital for John Deere. For further description of the Companys outstanding exposure related to Russia, refer to Note 7 to the Consolidated Financial Statements.\nNegative economic conditions and outlook can materially weaken demand for John Deeres equipment and services, limit access to funding, and result in higher funding costs for John Deere and the Company.\nThe demand for John Deeres and the Companys products and services can be significantly reduced in an economic environment characterized by high unemployment, rising interest rates, cautious consumer spending, changes in consumer practices due to a possible recession, lower corporate earnings, and lower business investment. Negative or uncertain economic conditions that cause John Deeres customers to lack confidence in the general economic outlook can significantly reduce their likelihood of purchasing John Deeres equipment. The COVID-19 pandemic (COVID), geopolitical instability, including the conflict between Russia and Ukraine, and other global events have significantly increased economic and demand uncertainty. Some of the results of these events include supply chain challenges, inflation, high interest rates, foreign currency exchange volatility, and volatility in global capital markets. These adverse economic events have and may continue to adversely affect John Deeres and the Companys operations.\nSustained negative economic conditions and outlook also affect housing starts, energy prices and demand, and other construction, which dampens demand for certain construction equipment. John Deeres turf operations and its construction and forestry segments are dependent on construction activity and have also been affected by recent adverse economic conditions. In fiscal 2022, supply constraints, shortage of turf inventory, and softening customer demand have affected John Deeres production and sales of consumer products within these segments. Decreases in construction activity and housing starts could have a material adverse effect on John Deeres and the Companys results of operations.\nIf negative economic conditions affect the overall farm economy, there could be a similar effect on John Deeres agricultural equipment sales. In addition, uncertain or negative outlook with respect to pervasive U.S. fiscal issues as well as general economic conditions and outlook, such as market volatility and continued interest rate increases by the Federal Reserve, have caused and could continue to cause significant changes in market liquidity conditions. Such changes could impact access to funding and associated funding costs, which could reduce the Companys earnings and cash flows. Additionally, John Deeres and the Companys investment management activities could be adversely affected by changes\nin the equity and bond markets, including the recent volatility of the United Kingdoms bond market, which would negatively affect earnings.\nChanging worldwide demand for food and different forms of bio-energy could affect the price of farm commodities and consequently the demand for certain John Deere equipment and could also result in higher research and development costs related to changing machine fuel requirements.\nChanging worldwide demand for farm outputs to meet the worlds growing food and bio-energy demands, driven in part by government policies, including those related to climate change, and a growing world population, are likely to result in fluctuating agricultural commodity prices, which directly affect sales of agricultural equipment. Lower agricultural commodity prices directly affect farm incomes, which could negatively affect sales of agricultural equipment and result in higher credit losses. While higher commodity prices benefit John Deeres crop-producing agricultural equipment customers, higher commodity prices also could result in greater feed costs for livestock and poultry producers, which in turn may result in lower levels of equipment purchased by these customers. Furthermore, changing bio-energy demands may cause farmers to change the types or quantities of the crops they raise, with corresponding changes in equipment demands. Finally, changes in governmental policies regulating bio-fuel utilization could affect commodity demand and commodity prices, demand for John Deeres diesel-fueled equipment, and result in higher research and development costs for John Deere related to equipment fuel standards. These changes could have a negative effect on the Companys results.\nJohn Deere and the Company may not realize the anticipated benefits of its Smart Industrial operating model and Leap Ambitions.\nJohn Deeres failure to realize the anticipated benefits of its Smart Industrial operating model and related business strategies in production systems, precision technologies, and aftermarket support could adversely affect the Companys results of operations and financial condition. Several factors could impact John Deeres ability to successfully execute the Smart Industrial operating model, including, among other things, failure to accurately assess market opportunity and the technology required to address such opportunity; failure to develop and introduce new technologies or lack of adoption of such technologies by John Deeres customers; and failure to holistically execute lifecycle solutions. In addition, if John Deere is unable to optimize its capital allocation in connection with the operating model, including capital allocation for the development and delivery of financial solutions provided by the Company, it may not be able to realize the full benefits of John Deeres Smart Industrial operating model, which could have an adverse effect on John Deeres and the Companys financial condition or results of operations.\nSimilarly, John Deere may not realize the anticipated benefits of its Leap Ambitions and related goals in the expected timeline, or at all. As part of its Leap Ambitions framework, John Deere adopted various goals that it expects to achieve by 2026 or 2030, as applicable. John Deere may not be able to achieve these goals for a number of reasons, some of which may be out of its control. For example, John Deeres estimates and assumptions related to efficiency of its products and the adoption of precision technology may not be accurate; certain materials, such as quality battery cells, may become unavailable or too costly; or infrastructure required to achieve its goals, such as sufficient charging stations, may become too costly or may not occur on the expected timeline. The actual or perceived failure of John Deere to achieve its Leap Ambitions could negatively impact its ability to execute the Smart Industrial operating model, and could harm John Deeres and the Companys reputation and business.\nJohn Deeres ability to understand its customers specific preferences and requirements, and to develop, manufacture, and market products that meet customer demand, could significantly affect its business results.\nJohn Deeres ability to match new product offerings to diverse global customers anticipated preferences for different types and sizes of equipment and various equipment features and functionality, at affordable prices, is critical to its success. In addition, the Companys ability to anticipate and deliver on customers changing preferences for financial solutions, is critical to its success. This requires a thorough understanding of John Deeres and the Companys existing and potential customers on a global basis. Failure to deliver quality products that meet customer needs at competitive prices ahead of competitors could have a significant adverse effect on John Deeres and the Companys business.\nCustomer preferences in the markets served by John Deere could change as these markets transition to less carbon-intensive business models. Ongoing social and regulatory focus on sustainability and the impact of policies and\nconsumer preferences on the construction, forestry, and agriculture industries mean that change is imminent. As regulations and social pressure drive change, John Deere must be proactive in monitoring trends and developing alternatives and enhancements that complement its product offerings. For example, John Deere may be unable to keep up with the rising demand for electric agriculture, turf, and construction equipment.\nThe development of alternative farming techniques, carbon sequestration technologies, and new low-carbon biofuels could change farmers business models and equipment needs. If John Deere fails to properly develop or invest in new technologies to meet changing customer demands, John Deere will be at risk of losing potential sources of revenue, which could affect John Deeres and the Companys future financial results.\nJohn Deeres and the Companys ability to adapt in highly competitive markets could affect its business, results of operations, and financial condition.\nJohn Deere operates in a variety of highly competitive global and regional markets. John Deere competes worldwide with a number of other manufacturers and distributors that produce and sell similar products. In addition, John Deeres industry is attracting non-traditional competitors, including technology-focused companies and start-up ventures. John Deere competes on the basis of product performance, innovation and quality, distribution, customer service, and price. Aggressive pricing or other strategies pursued by competitors, unanticipated product or manufacturing delays, or John Deeres failure to price its products competitively could adversely affect John Deeres business, results of operations, and financial condition, which could have a negative effect on the Companys results.\nThe equipment finance industry in which the Company competes is highly competitive. We compete for customers with commercial banks and finance and leasing companies based upon service, finance rates charged, and other finance terms. In addition, the competitive landscape is evolving as technology is unlocking new capabilities for traditional competitors and enabling new digital entrants. The Companys ability to maintain and expand our market share is contingent upon us offering competitive pricing, developing and maintaining strong relationships with dealers and customers, making substantial investments in our technological infrastructure, and effectively responding to changes in the agriculture and turf equipment and construction and forestry equipment markets. In addition, any expansion into new markets may require us to compete with more experienced and established market participants. Failure to effectively manage these challenges could adversely affect our market share, and pressure to provide competitive pricing could have a negative effect on the Companys results of operations and financial condition.\nJohn Deere relies on a network of independent dealers to manage the distribution of its products. If dealers are unsuccessful with their sales and business operations, it could have an adverse effect on overall John Deere sales and revenue.\nJohn Deere relies on the capability of John Deere dealers to develop and implement effective sales plans to create demand among purchasers for the equipment and related products and services that the dealers purchase from John Deere. If John Deeres dealers are not successful in these endeavors, then John Deere will be unable to grow its sales and revenue, which would have an adverse effect on John Deeres and the Companys financial condition. In addition, the dealer channels ability to support and service precision technology solutions and emerging power solutions may affect customers acceptance and adoption rates of these products.\nDealers may have trouble funding their day-to-day cash flow needs and paying their obligations due to adverse business conditions resulting from negative economic effects or other factors. Dealers may exit or John Deere may seek to terminate relationships with certain dealers if they are unable to meet customer needs. The unplanned loss of any John Deere dealers could lead to inadequate market coverage, negative customer impressions of John Deere, and may adversely impact John Deeres and the Companys ability to collect receivables that are associated with that dealer.\nENVIRONMENTAL, CLIMATE, AND WEATHER RISKS\nUnfavorable weather conditions or natural calamities that reduce agricultural production and demand for agriculture and turf equipment could directly and indirectly affect John Deeres and the Companys business.\nPoor or unusual weather conditions, particularly during the planting and early growing season, can significantly affect the purchasing decisions of John Deeres customers, particularly the purchasers of agriculture and turf equipment.\nThe timing and quantity of rainfall are two of the most important factors in agricultural production. Insufficient levels of rain prevent farmers from planting new crops and may cause growing crops to die or result in lower yields. Excessive rain or flooding can prevent planting from occurring at optimal times and may cause crop loss through increased disease or mold growth. Temperature affects the rate of growth, maturity, and quality of crops. Temperatures outside normal ranges can also cause crop failure or decreased yields, and may also affect disease incidence. Natural calamities such as regional floods, hurricanes or other storms, droughts, diseases, and pests, either as a physical effect of climate change or otherwise, have had and could in the future have significant negative effects on agricultural and livestock production. The resulting negative impact on farm income can strongly affect demand for agricultural equipment and the financial condition and credit risk of our customers and John Deeres dealers. Adverse weather conditions in a particular geographic region, particularly during the important spring selling season, may adversely affect sales of some turf equipment. Drought conditions can adversely affect sales of certain mowing equipment and unusually rainy weather can similarly cause lower sales volumes.\nGovernmental actions designed to address climate change and the emergence of new technologies and business models in connection with the transition to a lower-carbon economy could adversely affect John Deere and its customers.\nThere is global scientific consensus that greenhouse gas (GHG) emissions continue to alter the composition of Earths atmosphere in ways that are affecting and are expected to continue to affect the global climate. These considerations have led to new international, national, regional, and local legislative and regulatory responses. Various stakeholders, including legislators and regulators, shareholders, and non-governmental organizations, as well as companies in many business sectors, including John Deere and the Company, are continuing to look for ways to reduce GHG emissions. The regulation of GHG emissions from certain stationary or mobile sources or the imposition of carbon pricing mechanisms could result in additional costs to John Deere and the Company in the form of taxes or emission allowances, required facilities improvements, and increased energy costs, which would increase John Deeres and the Companys operating costs through higher utility, transportation, and materials costs. Increased input costs, such as fuel and fertilizer, and compliance-related costs could also affect customer operations and demand for John Deere equipment. Additional international and national European regulations relating to climate and environmental risk, which are continually evolving, could affect the lending operations and climate-risk processes developed by the Company. Regulators in Europe and the U.S. have also focused efforts on increased disclosure related to climate change and mitigation efforts. The Securities and Exchange Commission (SEC) has included in its regulatory agenda potential rulemaking on climate change disclosures that, if adopted, could significantly increase compliance burdens and associated regulatory costs and complexity.\nFINANCIAL RISKS\nChanges in government banking, monetary, and fiscal policies could have a negative effect on the Company.\nPolicies of the U.S. and other governments regarding banking, monetary, and fiscal policies intended to promote or maintain liquidity, stabilize financial markets, and/or address local deficit or structural economic issues may not be effective and could have a material impact on the Companys customers and markets. The Companys operations and results could also be affected by financial regulatory reform that could, among other things, have an adverse effect on the Company and its customers by limiting their ability to enter into hedging transactions or to finance purchases of John Deere products. Government policies on spending can also affect John Deere, especially the construction and forestry segment, due to the impact of government spending on infrastructure development. The Companys and John Deeres operations, including those outside of the United States, may also be affected by non-U.S. regulatory reforms being implemented to further regulate non-U.S. financial institutions and markets.\nChanges in tax rates, tax legislation, or exposure to additional tax liabilities could have a negative effect on John Deere and the Company.\nJohn Deere and the Company are subject to income taxes in the U.S. and numerous foreign jurisdictions. John Deeres and the Companys domestic and international tax liabilities are dependent upon the location of earnings among these different jurisdictions. Tax rates in various jurisdictions may be subject to significant change. John Deeres and the Companys effective tax rates could be affected by changes in the mix of earnings in countries with differing statutory tax rates, changes in the valuation of deferred tax assets and liabilities, or changes in tax laws or their interpretations. If John Deeres and the Companys effective tax rates were to increase, or if the ultimate determination of taxes owed is for an\namount more than amounts previously accrued, John Deeres and the Companys operating results, cash flows, and financial condition could be adversely affected.\nThe Companys consolidated financial results are reported in U.S. dollars while certain assets and other reported items are denominated in the currencies of other countries, creating currency exchange and translation risk.\nThe Company operates in many areas of the world, involving transactions denominated in a variety of currencies. The Company is subject to currency exchange risk to the extent that its costs are denominated in currencies other than those in which it earns revenues. Additionally, the reporting currency for the Companys consolidated financial statements is the U.S. dollar. Certain of the Companys assets, liabilities, expenses, and revenues are denominated in other countries currencies, which are then translated into U.S. dollars at the applicable exchange rates in the Companys reported consolidated financial statements. Therefore, fluctuations in foreign exchange rates affect the value of those items as reflected in the Companys consolidated financial statements, even if their value remains unchanged in their original currencies. While the use of currency hedging instruments may provide the Company with protection from adverse fluctuations in currency exchange rates, by utilizing these instruments we potentially forego any benefits that may result from favorable fluctuations in such rates.\nBecause the Company is subject to interest rate risks, changes in interest rates can reduce demand for equipment, adversely affect interest margins, and limit access to capital markets while increasing borrowing costs.\nRising interest rates could have a dampening effect on overall economic activity and/or the financial condition of the Companys customers, either or both of which could negatively affect customer demand for John Deere equipment and customers ability to repay obligations to the Company. In response to increasing inflation, the U.S. Federal Reserve began to raise interest rates in March 2022 for the first time in over three years, and has signaled it expects to make additional rate increases. Rising interest rates could cause credit market dislocations, which could have an impact on funding costs, which are important to the Company because such costs affect the Companys ability to offer customers competitive financing rates. While the Company strives to match the interest rate characteristics of its financial assets and liabilities, changing interest rates could have an adverse effect on the Companys net interest rate margin-the difference between the yield the Company earns on its assets and the interest rates the Company pays for funding, which could in turn affect the Companys net interest income and earnings.\nIn addition, actions by credit rating agencies, such as downgrades or negative changes to ratings outlooks, can affect the availability and cost of funding for the Company and can increase the Companys cost of capital and hurt its competitive position.\nFurther, due to the cessation of the London Interbank Offered Rate (LIBOR), the Company has entered into financial transactions such as credit agreements, receivables, derivatives, and notes that use the Secured Overnight Financing Rate (SOFR) or the Sterling Overnight Index Average (SONIA) as interest rate benchmarks. SOFR and SONIA are calculated differently from LIBOR and have inherent differences, which could give rise to uncertainties, including the limited historical data and volatility in the benchmark rates. The full effects of the transition to SOFR, SONIA, or other rates remain uncertain.\nBecause the Company is a financing company, negative economic conditions in the financial industry could materially impact the Companys operations and financial results.\nNegative economic conditions could have an adverse effect on the financial industry in which the Company operates. The Company provides financing for a significant portion of John Deeres sales in many of the countries in which the Company operates. The Company is exposed to the risk that customers and others will default on contractual obligations and may experience credit losses that exceed its expectations and adversely affect its financial condition and results of operations. The Companys inability to access funds at cost-effective rates to support its financing activities could have a material adverse effect on the Companys business. The Companys liquidity and ongoing profitability depend largely on timely access to capital to meet future cash flow requirements and to fund operations and costs associated with engaging in diversified funding activities. Additionally, negative market conditions could reduce customer confidence levels, resulting in declines in credit applications and increases in delinquencies and default rates, which could materially impact the Companys write-offs and provision for credit losses.\nThe Companys results could be adversely affected by a decrease in the value of used equipment or higher than estimated returns of equipment on operating lease.\nThe Company sells repossessed equipment and equipment returned to us at the end of lease terms, primarily through the John Deere dealer network. The Company estimates the end-of-lease term residual value at the inception of the operating leases based on a number of factors, including lease term, expected hours of usage, historical wholesale sale prices, return experience, intended use of the equipment, market dynamics and trends, and third-party residual guarantees. Used equipment values may decrease as a result of any one or a combination of factors including market conditions, supply of and demand for used equipment, and technological advancements in new equipment. Depressed prices for used equipment may result in, or increase, a loss upon our disposition of off-lease or repossessed equipment, and in the case of repossessed equipment, we may be unable to collect the resulting deficiency. In addition, lower residual value estimates could result in increasing operating lease depreciation, impairment losses, and losses on the sale of matured operating lease inventory, which would decrease the Companys earnings.\nMANUFACTURING AND OPERATIONAL RISKS\nChanges in the availability and price of certain raw materials, components, and whole goods have resulted and could continue to result in significant disruptions to the supply chain causing production disruptions, increased costs and lower profits on sales of John Deere products. As the Companys volume of Receivables and Leases is largely dependent upon the level of retail sales and leases of John Deere products, supply chain disruptions and impacts of price increases could negatively impact the Companys future volumes.\nJohn Deere requires access to various raw materials, components, and whole goods at competitive prices to manufacture and distribute its products. The price and availability of these materials have varied significantly in the last 24 months and are expected to continue to fluctuate due to inflation, geopolitical and economic uncertainty, and regulatory and policy instability, including import tariffs and trade agreements. The latter have the potential to significantly increase production and logistics costs and have a material negative effect on the profitability of John Deeres business, particularly if John Deere is unable to recover the increased costs due to market considerations or other factors. John Deere relies on suppliers to acquire raw materials, components, and whole goods required to manufacture its products. Significant disruptions to the supply chain resulting from shortages of raw materials, components, and whole goods has and could continue to adversely affect John Deeres ability to meet commitments to customers. During fiscal 2022, the supply chain challenges in combination with demand for John Deeres products resulted in a heavier back-end loaded year for industry retail orders. As the result of the COVID pandemic, geopolitical instability, and other global events, John Deere has experienced changes in the availability and prices of these raw materials, components, whole goods, and freight. Global logistics network challenges include shortages of shipping containers, ocean freight capacity constraints, international port delays, trucking and chassis shortages, and railway and airfreight capacity, which have resulted in delays, shortages of key manufacturing components, increased order backlogs, increased transportation costs, and production inefficiencies from a higher number of partially completed machines in inventory, which increased John Deeres overall production and overhead costs.\nIn an effort to mitigate raw material shortages and supply chain constraints, John Deere has increased the list price of its products and worked with suppliers to ensure optimum inventory levels. However, if customers are unwilling to accept price increases in John Deere products or John Deere is unable to offset the increase in costs, raw material shortages could have an adverse effect on John Deeres operations. Continued or increased fluctuations in costs of materials or inflation generally and continued supply chain challenges could have a material adverse effect on John Deeres business, which could negatively impact the Company.\nRESOURCES RISKS\nThe Companys ability to attract, develop, engage, and retain qualified employees could affect its ability to execute its strategy.\nThe Companys continued success depends, in part, on its ability to identify and attract qualified candidates with the requisite education, background, and experience as well as its ability to develop, engage, and retain qualified employees. Failure to attract, develop, engage, and retain qualified employees, whether as a result of an insufficient number of qualified applicants, difficulty in recruiting new employees, or inadequate resources to train, integrate, and retain\nqualified employees, could impair the Companys ability to execute its business strategy and could adversely affect the Companys business. In addition, while the Company strives to reduce the impact of the departure of employees, the Companys operations or ability to execute its business strategy and meet its business objectives may be affected by the loss of employees, particularly when departures involve larger numbers of employees, such as those the Company could experience if a surge occurs in the number of employees voluntarily leaving their jobs. Higher rates of employee separations may adversely affect the Company through decreased employee morale, the loss of knowledge of departing employees, and the devotion of resources to recruiting and onboarding new employees.\nSecurity breaches and other disruptions to the Companys information technology infrastructure could interfere with the Companys operations and could compromise the information of the Company as well as its customers and/or John Deere dealers, exposing the Company to liability that could cause the Companys business and reputation to suffer.\nIn the ordinary course of business, the Company relies upon information technology networks and systems, some of which are managed by third parties, to process, transmit, and store electronic information and to manage or support a variety of business processes and activities, including loan application and collection of payments from dealers and other purchasers of John Deere equipment. The Company uses information technology systems to record, process, and summarize financial information and results of operations for internal reporting purposes and to comply with regulatory financial reporting, legal, and tax requirements. Additionally, the Company collects and stores sensitive data, including intellectual property, proprietary business information, and the proprietary business information of the Companys customers and John Deere dealers, as well as personally identifiable information of the Companys customers and employees, in data centers, which are often owned by third parties, and on information technology networks. The secure operation of these information technology networks and the processing and maintenance of this information is critical to the Companys business operations and strategy. Despite security measures, including a vulnerability disclosure program, and business continuity plans, the Companys information technology networks and infrastructure have been and may be vulnerable to intrusion, damage, disruptions, or shutdowns due to attacks by cyber criminals, employee, supplier, or dealer error or malfeasance, supply chain compromise, disruptions during the process of upgrading or replacing computer software or hardware, power outages, computer viruses, ransomware or other malware, telecommunication or utility failures, terrorist acts, natural disasters, or other events. Although the Company has not suffered any significant cyber incidents that resulted in a material business impact, it has from time to time been the target of malicious cyber threat actors. The occurrence of any significant event could compromise the Companys networks, and the information stored there could be accessed, obtained, publicly disclosed, lost, altered, misused, or stolen. Any such access, disclosure, alteration, misuse or other loss of information could result in legal claims or proceedings, government investigations, liability or regulatory penalties, disruption to the Companys operations, and damage to the Companys reputation, which could adversely affect the Companys business, results of operations, and financial condition. In addition, as security threats continue to evolve and increase in frequency and sophistication, the Company may need to invest additional resources to protect information security.\nLEGAL AND COMPLIANCE RISKS\nThe Companys global operations are subject to complex and changing laws and regulations, the violation of which could expose the Company to potential liabilities, increased costs, and other adverse effects.\nThe Companys global operations are subject to numerous international, federal, state, and local laws and regulations, many of which are complex, frequently changing, and subject to varying interpretations. These laws and regulations cover a broad spectrum of subject areas, including advertising; anti-money laundering; antitrust; consumer finance; environmental, climate-related, health, and safety; foreign exchange controls and cash repatriation restrictions; foreign ownership and investment; human rights, labor, and employment; and data privacy. These laws may vary substantially within the different markets in which the Company operates. Compliance with these laws and regulations is costly and may further increase the cost of conducting the Companys global operations. In addition, the Company must comply with the U.S. Foreign Corrupt Practices Act and all applicable foreign anti-corruption laws, including the U.K. Bribery Act, which generally prohibit companies and their intermediaries from making improper payments or providing anything of value to improperly influence government officials or private individuals for the purpose of obtaining or retaining a business advantage, regardless of whether those practices are culturally expected in a particular jurisdiction. Although the Company has a compliance program in place designed to reduce the likelihood of potential violations of such laws and regulations, there can be no assurance that the Companys employees, contractors, or agents will not violate\nsuch laws and regulations or the Companys policies and procedures. Violations of these laws and regulations could result in criminal or civil sanctions and have a material adverse effect on the Companys reputation, business, results of operations, and financial condition.\nChanges to existing laws and regulations or changes to how they are interpreted or the implementation of new, more stringent laws or regulations could adversely affect the Companys business by increasing compliance costs, limiting the Companys ability to offer a product or service, requiring changes to the Companys business practices, or otherwise making the Companys products and services less attractive to customers. Legislative and regulatory changes and other actions that could potentially affect the Companys business may be announced with little or no advance notice and the Company may not be able to effectively mitigate all adverse effects from such measures.\nThe Company is subject to governmental laws, regulations, and other legal obligations related to privacy and data protection and any inability or perceived inability of the Company to address these requirements could adversely affect our business.\nThe legislative and regulatory framework for privacy and data protection issues worldwide is rapidly evolving and is likely to remain uncertain for the foreseeable future. The Company collects personal information and other data as integral parts of its business processes and activities. This data is subject to a variety of U.S. and foreign laws and regulations, including oversight by various regulatory and other governmental bodies. Many foreign countries and governmental bodies, including the European Union and other relevant jurisdictions where the Company conducts business, have laws and regulations concerning the collection and use of personal information and other data obtained from their residents or by businesses operating within their jurisdictions. The European Union General Data Protection Regulation and the California Consumer Privacy Act, among others, impose stringent data protection requirements and provide significant penalties for noncompliance. New privacy laws will continue to come into effect around the world in the future. Any inability or perceived inability to adequately address privacy and data protection concerns, even if unfounded, or comply with applicable laws, regulations, policies, industry standards, contractual obligations, or other legal obligations could result in additional cost and liability to the Company or Company officials, damage our reputation, inhibit sales, and otherwise adversely affect our business.\nLegal proceedings and disputes in which, the Company is, and may in the future, be involved could harm the Companys business, financial condition, reputation, and brand.\nThe Company is subject to a variety of legal proceedings and legal compliance risks around the world. The Company faces risks of exposure to various types of claims, lawsuits, and government inquiries or investigations in the ordinary course of business, the most prevalent of which relate to retail credit matters. The uncertainty associated with substantial unresolved claims and lawsuits may harm the Companys business, financial condition, reputation, and brand. The defense of lawsuits and government inquiries or investigations has resulted and may result in the expenditures of significant financial resources and the diversion of managements time and attention away from business operations. Such legal proceedings may also affect the Companys assessment and estimates of loss contingencies recorded as a reserve and require us to make payments exceeding our reserves.\nGENERAL RISKS\nJohn Deeres and the Companys reputation and brand could be damaged by negative publicity.\nJohn Deeres brand has worldwide recognition and significantly contributes to the success of its and the Companys business. John Deeres reputation is critical to growing its customer base. John Deeres brand depends on the ability to maintain a positive customer perception of the business, including the core values of integrity, quality, innovation, and commitment. Negative claims or publicity involving John Deere, its products or services, its culture and values, customer data, or any of its key employees or suppliers, could damage John Deeres reputation and brand image, regardless of whether such claims are accurate. Damage to John Deeres reputation could adversely impact its and the Companys ability to attract new and maintain existing customers, employees, dealers, and business relationships.\nAdditionally, negative or inaccurate postings, articles, or comments on social media and the internet about John Deere could generate negative publicity that could damage the reputation of John Deere, the Company, or the John Deere brand.\nFurther, adverse publicity about regulatory or legal action against John Deere or the Company, or by John Deere or the Company, could also damage John Deeres and the Companys reputation and brand image, undermine customer confidence, and reduce long-term demand for John Deere equipment, even if the regulatory or legal action is unfounded or not material to John Deeres or the Companys operations. If the reputation, culture or image of John Deeres brands are damaged, or John Deere or the Company receive negative publicity, then the Companys revenue, financial condition, and results of operations could be materially and adversely affected.\nUnexpected events have and may in the future increase the Companys cost of doing business or disrupt its operations.\nThe occurrence of one or more unexpected events, including war, acts of terrorism, epidemics and pandemics (such as the COVID pandemic), civil unrest, fires, tornadoes, tsunamis, hurricanes, earthquakes, floods, and other forms of severe weather in the United States or in other countries in which the Company operates, or in which John Deere suppliers are located, have and could in the future adversely affect the Companys operations and financial performance. Such events have and could cause complete or partial closure of one or more of John Deeres manufacturing facilities or distribution centers, temporary or long-term disruption in the supply of component products from some local and international suppliers, and disruption and delay in the transport of John Deere products to dealers, end-users, and distribution centers. Existing insurance coverage may not provide protection from all the costs that may arise from such events.\nThe potential physical impacts of climate change on John Deeres facilities, suppliers, and customers, and therefore on John Deeres operations, are highly uncertain and will be particular to the circumstances developing in various geographic regions. These potential physical effects may adversely affect the demand for John Deeres products and the financial performance of John Deeres and the Companys operations. Item 1B. Unresolved Staff Comments.\nNone. Item 2. Properties.\nThe Company owns office buildings in Johnston, Iowa; and leases office space in Madison, Wisconsin; Rosario, Argentina; Brisbane, Australia; Gloucester, England; Langar, England; Ormes, France; Walldorf, Germany; Milan, Italy; Luxembourg City, Luxembourg; Monterrey, Mexico; Poznan, Poland; and Parla, Spain. We believe our properties are adequate and suitable for our business as presently conducted and are adequately maintained. Item 3. Legal Proceedings.\nThe Company is subject to various unresolved legal actions that arise in the normal course of its business, the most prevalent of which relate to retail credit matters. The Company believes the reasonably possible range of losses for these unresolved legal actions would not have a material effect on its consolidated financial statements. Item 4. Mine Safety Disclosures.\nNot applicable.\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters, and Issuer Purchases of Equity Securities.\n(a) All of Capital Corporations common stock is owned by JDFS, a finance holding company that is wholly-owned by Deere & Company. In 2022 and 2021, Capital Corporation declared and paid cash dividends of $370.0 million and $485.0 million, respectively, to JDFS. In turn, JDFS declared and paid comparable dividends to Deere & Company.\n(b) Not applicable.\n(c) Not applicable. Item 6. [Reserved] Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations.\nThe following Management's Discussion and Analysis of Financial Condition and Results of Operations (MD&A) is intended to promote understanding of the Companys financial condition and results of operations. The MD&A is provided as a supplement to, and should be read in conjunction with, the consolidated financial statements and the accompanying Notes to Consolidated Financial Statements (Part II, Item 8 of this Form 10-K).\nResults of Operations\nOverview\nOrganization\nThe Company primarily generates revenues and cash by financing John Deere dealers sales and leases of new and used production and precision agriculture, small agriculture and turf, and construction and forestry equipment. In addition, the Company also provides wholesale financing to dealers of the foregoing equipment and finances retail revolving charge accounts.\nSmart Industrial Operating Model and Leap Ambitions\nJohn Deeres Smart Industrial operating model is focused on making significant investments in strengthening its capabilities in digital, automation, autonomy, and alternative propulsion technologies. These technologies are intended to increase worksite efficiency, improve yields, lower input costs, and ease labor constraints. John Deeres Leap Ambitions are goals designed to boost economic value and sustainability for John Deeres customers. As an enabling business, the Company is fully integrated with John Deeres Smart Industrial operating model and is focused on providing financial solutions to help John Deere achieve its Leap Ambitions. John Deere and the Company anticipate opportunities in this area, as John Deere, the Company, and their customers have a vested interest in sustainable practices.\nTrends and Economic Conditions\nThe Companys volume of Receivables and Leases is largely dependent upon the level of retail sales and leases of John Deere products. The level of John Deere retail sales and leases is responsive to a variety of economic, financial, climatic, legislative, and other factors that influence supply and demand for its products.\nIndustry Trends for Fiscal Year 2023\nIndustry sales of large agricultural machinery in the U.S. and Canada for 2023 are forecasted to increase 5 to 10 percent compared to 2022. Industry sales of small agricultural and turf equipment in the U.S. and Canada are expected to be flat to down 5 percent in 2023. Industry sales of agricultural machinery in Europe are forecasted to be flat to up 5 percent, while South American industry sales of tractors and combines are expected to be flat to up 5 percent in 2023. Asia industry sales are forecasted to be down moderately in 2023 as the demand in India, the worlds largest tractor market by unit, stabilizes. On an industry basis, North American construction equipment and compact construction equipment sales are both expected to be flat to up 5 percent in 2023. Global forestry and global roadbuilding industry sales are each expected to be flat.\nJohn Deere and Company Trends\nCustomers demand for integration of technology into equipment is a market trend underlying John Deeres Smart Industrial operating model and Leap Ambitions framework. Customers have sought to improve profitability, productivity, and sustainability through technology. John Deeres approach to technology involves hardware and software, guidance, connectivity and digital solutions, automation and machine intelligence, autonomy, and electrification. This technology is incorporated into products within each of John Deeres operating segments. Customers continue to adopt technology integrated in the John Deere portfolio of smart machines, systems, and solutions. The Company expects this trend to persist for the foreseeable future.\nDemand for John Deeres equipment remains strong, as order books are full through a majority of 2023. Agricultural fundamentals are expected to remain solid into 2023, and retail demand will comprise most of 2023 sales. John Deere expects dealer stock inventory replenishment to occur in 2024. The North American retail customer fleet age remains above average, and dealer inventories are historically low due to the manufacturing and supply chain constraints over the past few years. Crop prices remain favorable to John Deere customers in part due to low stock-to-use ratios for key grains and lower exports from the Black Sea region. John Deere expects to sell more large agricultural equipment in 2023 than 2022 in North America, Europe, and South America. Demand for small agricultural equipment remains stable, while turf and utility equipment product sales are expected to be lower due to the overall U.S. economic conditions. Construction equipment markets are forecasted to be steady. Rental fleets replenishment, the energy industry, and U.S. infrastructure spend will offset moderation in residential home construction. Roadbuilding demand remains strongest in the U.S., largely offset by softening demand in Europe and sluggish demand in Asia.\nStrong retail demand of John Deeres products in 2023 is favorably impacting forecasted financing volumes, benefiting net income for the Company. Net income for the Company in fiscal 2023 is expected to be slightly higher than fiscal 2022 due to income earned on a higher average portfolio, partially offset by less favorable financing spreads, lower gains on operating lease dispositions, and a higher provision for credit losses.\nAdditional Trends\nJohn Deere experienced supply chain disruptions in 2022. Supply chain disruptions impacted many aspects of John Deeres business, including parts availability, increased production costs, and more partially completed machines in inventory. Additionally, past due deliveries from suppliers were at elevated levels. Late part deliveries required rework of partially built machines, contributing to production inefficiencies and higher overhead costs. John Deere implemented mitigation efforts to minimize the impact of supply chain disruptions on its ability to meet customer demand. While supply chain disruptions are expected to persist into 2023, John Deere is working diligently to secure the parts and components that customers need to deliver essential food and infrastructure more profitably and sustainably. As the Companys volume of Receivables and Leases is largely dependent upon the level of retail sales and leases of John Deere products, supply chain disruptions could impact the Companys future volumes. Despite supply chain challenges in 2022, the Companys volumes were at historic levels, driven by strong John Deere equipment sales volume.\nInterest rates rose in 2022 and further central bank policy interest rate increases are projected in 2023. Most of the Companys Customer Receivables are fixed rate, while its wholesale receivables generally earn a floating rate. The Company has both fixed and floating rate borrowings. The Company manages the risk of interest rate fluctuations by balancing the types and amounts of its funding sources to its Receivable and Lease portfolios. Accordingly, the Company enters into interest rate swap agreements to manage its interest rate exposure. The rising interest rate environment in 2022 increased the Companys balance sheet derivative positions and generated income statement net gains on its non-designated derivatives (see Note 20). The Company expects to be able to pass the higher interest rates onto its retail and wholesale customers or receive increased compensation from John Deere for reduced or waived interest charges. Historically, rising interest rates impact the Companys borrowings sooner than the benefit is realized from the Receivable and Lease portfolio. As a result, the Companys financing spread was unfavorably impacted by $42.7 million (after-tax) in 2022 compared to 2021, which reflects spread compression primarily due to rising interest rates, partially offset by the non-designated derivative gains and lower depreciation rates of equipment on operating lease. If interest rates continue to rise, the Company expects to continue experiencing spread compression in 2023.\nInflation was a pervasive feature throughout 2022, and the Company expects inflation to continue in 2023. The Companys estimation of credit losses may be negatively impacted in the event customers operations are negatively impacted due to inflation or rising interest rates. As part of the process to establish the allowance for credit losses, the Company continues to monitor the economy, including potential impacts of inflation and rising interest rates, among other factors, and qualitative adjustments to the allowance are incorporated, as necessary. As of October 30, 2022, impacts of inflation and interest rates did not have a material impact on the Companys allowance.\nLow dealer inventories, partially due to supply constraints, along with inflation have and may continue to contribute to higher prices on used equipment inventory. Higher used equipment prices have a favorable impact on the Companys operating lease portfolio at lease maturity through lower return rates and higher disposition values on returned equipment. The Company reported net gains of $66.9 million in other income during 2022 on operating lease dispositions.\nSupply chain disruptions, inflationary pressures, and rising interest rates are driven by factors outside of the Companys control, and as a result, the Company cannot reasonably foresee when these conditions will subside.\nFor additional information regarding the impact of supply chain disruptions, including mitigation efforts to minimize the impact of potential supply chain disruptions on John Deeres ability to meet customer demand, as well as inflationary pressures, refer to the Trends and Economic Conditions section in Item 7 of the Deere & Company Annual Report on Form 10-K for the year ended October 30, 2022.\nItems of Concern and Uncertainties\nOther items of concern include global and regional political conditions, economic and trade policies, imposition of new or retaliatory tariffs against certain countries or covering certain products, the ongoing effects of the pandemic, capital market disruptions, changes in demand and pricing for new and used equipment, significant fluctuations in foreign currency exchange rates, volatility in the prices of many commodities, and potential recession. These items could impact the Companys results. John Deere and the Company are making investments in technology and in strengthening capabilities in digital, automation, autonomy, and electrification. As with most technology investments, marketplace adoption and monetization of these features holds an elevated level of uncertainty.\n2022 Compared with 2021\nThe total revenues and net income attributable to the Company were as follows (in millions of dollars):\nTotal revenues\n$\n2,759.2\n$\n2,688.0\nNet income attributable to the Company\n704.3\n710.6\nTotal revenues increased in 2022 primarily due to an average portfolio that was 7 percent higher, partially offset by lower average financing yields of 6.2 percent in 2022 compared to 6.5 percent in 2021. Net income in 2022 was lower than 2021 due to less favorable financing spreads, a higher provision for credit losses, higher selling, administrative, and general expenses, and unfavorable discrete income-tax adjustments. These factors were partially offset by income earned on a higher average portfolio.\nRevenues\nFinance income, lease revenues, and other income earned by the Company were as follows (in millions of dollars):\n% Change\nFinance income earned from:\nRetail notes\n$\n1,023.3\n$\n946.6\n%\nRevolving charge accounts\n300.2\n298.1\nWholesale receivables\n342.5\n299.8\nLease revenues\n957.5\n1,022.0\n(6)\nOther income\n135.7\n121.5\nFinance income on retail notes and revolving charge accounts increased in 2022 due to higher average portfolio balances, partially offset by lower average financing rates. Finance income on wholesale receivables increased in 2022 primarily due to higher average financing rates, partially offset by a lower average portfolio. Lease revenues decreased primarily due to lower average financing rates and lower average portfolio balances.\nOther income increased in 2022 primarily due to a gain on sale of property, higher interest income on cash and cash equivalents as a result of rising interest rates, and larger gains on operating lease dispositions. These increases were partially offset by lower freestanding credit enhancement recoveries in 2022.\nRevenues earned from John Deere totaled $643.1 million in 2022, compared with $613.7 million in 2021. The increase was primarily the result of higher compensation paid by John Deere on wholesale receivables, driven by a higher interest rate environment. This compensation was partially offset by lower subsidies paid by John Deere related to operating leases. Revenues earned from John Deere are included in each of the revenue amounts discussed above.\nExpenses\nExpenses incurred by the Company were as follows (in millions of dollars):\n% Change\nInterest expense\n$\n497.3\n$\n472.9\n%\nDepreciation of equipment on operating leases\n667.7\n733.4\n(9)\nAdministrative and operating expenses\n440.1\n406.0\nFees and interest paid to John Deere\n222.1\n168.3\nProvision (credit) for credit losses\n23.5\n(.9)\nProvision for income taxes\n209.0\n200.5\nThe increase in interest expense in 2022 was driven by higher average borrowings and higher average borrowing rates, offset in part by gains on non-designated derivatives.\nThe depreciation of equipment on operating leases decreased during 2022, primarily due to updated depreciation estimates as a result of improving conditions in the agriculture and construction markets, in addition to lower average balances of equipment on operating leases.\nAdministrative and operating expenses increased during 2022 primarily due to foreign currency exchange net losses and increases in other general operating expenses.\nFees and interest paid to John Deere increased in 2022 primarily due to higher interest on intercompany borrowings from John Deere driven by higher average borrowing rates, in addition to the remittance of gains on non-designated derivatives that were subsequently assumed by Deere & Company (see Note 7).\nThe provision for credit losses increased in 2022 compared to 2021, driven by favorable adjustments to the allowance for credit losses in 2021, which did not recur in the current year, in addition to lower net recoveries on revolving charge accounts in 2022.\nThe higher provision for income taxes in 2022 was primarily related to favorable discrete income-tax adjustments in 2021. See Note 14 to the Consolidated Financial Statements for additional information.\nReceivables and Leases\nFor the fiscal years ended October 30, 2022 and October 31, 2021, Receivable and Lease (excluding wholesale) volumes and balances held were as follows (in millions of dollars):\nFiscal Year Volumes\nFiscal Year End Balances\n%\n%\nChange\nChange\nRetail notes:\nAgriculture and turf\n$\n12,723.9\n$\n12,085.1\n%\n$\n23,857.8\n$\n21,518.9\n%\nConstruction and forestry\n2,840.1\n2,812.2\n4,954.1\n4,487.0\nTotal retail notes\n15,564.0\n14,897.3\n28,811.9\n26,005.9\nRevolving charge accounts\n7,561.1\n6,886.0\n4,165.8\n3,740.1\nFinancing leases\n800.8\n655.4\n1,120.7\n972.3\nEquipment on operating leases\n2,062.3\n1,832.5\n4,853.5\n4,947.6\n(2)\nTotal Receivables and Leases (excluding wholesale)\n$\n25,988.2\n$\n24,271.2\n$\n38,951.9\n$\n35,665.9\nRetail notes bearing fixed finance rates totaled over 95 percent of the total retail note portfolio at October 30, 2022 and October 31, 2021.\nTotal Receivables 30 days or more past due, non-performing Receivables, and the allowance for credit losses were as follows (in millions of dollars and as a percentage of the Receivables balance):\nDollars\nPercent\nDollars\nPercent\nReceivables 30 days or more past due\n$\n404.9\n.95\n%\n$\n340.8\n.93\n%\nNon-performing Receivables\n263.2\n.62\n280.1\n.76\nAllowance for credit losses\n128.4\n.30\n129.0\n.35\nReceivables 30 days or more past due continue to accrue finance income. The Company ceases to accrue finance income once Receivables are considered non-performing. An allowance for credit losses is recorded for the estimated credit losses expected over the life of the Receivable portfolio. The Company measures expected credit losses on a collective basis when similar risk characteristics exist. Risk characteristics considered by the Company include product category, market, geography, credit risk, and remaining duration. Receivables that do not share risk characteristics with other receivables in the portfolio are evaluated on an individual basis. Non-performing Receivables are included in the estimate of expected credit losses. While the Company believes its allowance is sufficient to provide for losses over the life of its existing Receivable portfolio, different assumptions or changes in economic conditions would result in changes to the allowance for credit losses and the provision for credit losses. See Note 4 for additional information related to the allowance for credit losses.\nDeposits held from dealers and merchants amounted to $137.3 million at October 30, 2022, compared with $131.8 million at October 31, 2021. These balances primarily represent the aggregate dealer retail note and lease withholding accounts from individual John Deere dealers to which losses from retail notes and leases originating from the respective dealers can be charged. Recoveries from dealer deposits are recognized in other income when the dealers withholding account is charged. Recoveries from dealer deposits and other freestanding credit enhancements recorded in other income in 2022 and 2021 were $8.5 million and $14.3 million, respectively.\n2021 Compared with 2020\nThe comparison of the 2021 results with 2020 can be found under the heading 2021 Compared with 2020 in the Managements Discussion and Analysis of Financial Condition and Results of Operations section of the Companys Annual Report on Form 10-K for the year ended October 31, 2021.\nCapital Resources and Liquidity\nSources of Liquidity, Key Metrics, and Balance Sheet Data\nThe Company relies on its ability to raise substantial amounts of funds to finance its Receivable and Lease portfolios. The Company has access to most global markets at a reasonable cost. The Companys ability to meet its debt obligations is supported in several ways. The assets of the Company are self-liquidating in nature. A solid equity position is available to absorb unusual losses on these assets and all commercial paper is backed by unsecured, committed borrowing lines from various banks. Liquidity is also provided by the Companys ability to securitize these assets and through the issuance of term debt in both public and private markets. Additionally, liquidity may be provided through loans from John Deere. The Company closely monitors its liquidity sources against the cash requirements and expects to have sufficient sources of global funding and liquidity to meet its funding needs in the short-term (next 12 months) and long-term (beyond 12 months).\nKey metrics and certain balance sheet data are provided in the following table as of October 30, 2022, October 31, 2021, and November 1, 2020, in millions of dollars:\nCash, cash equivalents, and marketable securities\n$\n662.9\n$\n679.1\n$\n676.8\nReceivables and Leases - net\n47,228.0\n41,488.2\n38,726.0\nInterest-bearing debt\n41,856.1\n37,319.9\n35,145.9\nUnused credit lines\n3,283.9\n5,770.3\n6,801.2\nRatio of interest-bearing debt to stockholders equity\n8.7 to 1\n8.2 to 1\n8.2 to 1\nThe reduction in unused credit lines at October 30, 2022, compared to both prior periods relates to an increase in commercial paper outstanding, by both the Company and John Deere, to fund growth in the Receivable portfolio.\nCash Flows\nNet cash provided by operating activities\n$\n1,205.9\n$\n1,365.9\n$\n1,450.2\nNet cash used for investing activities\n(7,206.8)\n(3,391.7)\n(1,335.6)\nNet cash provided by (used for) financing activities\n6,017.1\n2,026.2\n(55.7)\nEffect of exchange rate changes on cash, cash equivalents, and restricted cash\n(22.9)\n3.0\n(.4)\nNet increase (decrease) in cash, cash equivalents, and restricted cash\n$\n(6.7)\n$\n3.4\n$\n58.5\nNet cash used by investing activities increased during 2022 primarily due to growth in the Receivable portfolio, which was funded primarily through external borrowings and cash provided by operating activities.\nCash, Cash Equivalents, and Marketable Securities Held by Foreign Subsidiaries\nThe amount of cash, cash equivalents, and marketable securities held by foreign subsidiaries was $217.2 million and $158.0 million at October 30, 2022 and October 31, 2021, respectively.\nBorrowings\nTotal borrowings increased $4,536.2 million in 2022, corresponding with the level of the Receivable and Lease portfolios. During 2022, the Company issued $9,255.3 million and retired $5,754.4 million of long-term external borrowings, which primarily consisted of medium-term notes. During 2022, the Company also issued $4,084.5 million and retired $2,964.8 million of retail note securitization borrowings and maintained an average commercial paper balance of $2,364.0 million. The Companys funding profile may be altered to reflect such factors as relative costs of funding sources, assets available for securitizations, and capital market accessibility.\nThe Company has a revolving warehouse facility to utilize bank conduit facilities to securitize retail notes (see Note 5). At October 30, 2022, the revolving credit agreement had a total capacity, or financing limit, of $1,000.0 million of secured financings at any time. $948.2 million of short-term securitization borrowings were outstanding under the agreement at October 30, 2022. At the end of the contractual revolving period, unless the banks and the Company agree to renew, the Company would liquidate the secured borrowings over time as payments on the retail notes are collected. The agreement was renewed in November 2022 with an expiration in November 2023 and a capacity of $1,500.0 million.\nDividends\nCapital Corporation declared and paid cash dividends to JDFS of $370.0 million in 2022 and $485.0 million in 2021. In turn, JDFS paid comparable dividends to Deere & Company.\nLines of Credit\nThe Company has access to bank lines of credit with various banks throughout the world. Some of the lines are available to both the Company and Deere & Company. Worldwide lines of credit totaled $8,089.2 million at October 30, 2022, $3,283.9 million of which were unused. For the purpose of computing the unused credit lines, commercial paper and short-term bank borrowings of the Company and John Deere, excluding secured borrowings and the current portion of long-term external borrowings, were considered to constitute utilization. See Note 8 for more information.\nDebt Ratings\nThe Companys ability to obtain funding is affected by its debt ratings, which are closely related to the outlook for and the financial condition of John Deere, and the nature and availability of support facilities, such as the Companys lines of credit and the support agreement from Deere & Company.\nTo access public debt capital markets, the Company relies on credit rating agencies to assign short-term and long-term credit ratings to the Companys securities as an indicator of credit quality for fixed income investors. A security rating is not a recommendation by the rating agency to buy, sell, or hold the Companys securities. A credit rating agency may change or withdraw Company ratings based on its assessment of the Companys current and future ability to meet interest and principal repayment obligations. Each agencys rating should be evaluated independently of any other rating. Lower credit ratings generally result in higher borrowing costs, including costs of derivative transactions, and reduced access to debt capital markets.\nThe senior long-term and short-term debt ratings and outlook currently assigned to unsecured Company debt securities by the rating agencies engaged by the Company are the same as those for John Deere and are as follows:\nSenior Long-Term\nShort-Term\nOutlook\nFitch Ratings\nA\nStable\nMoodys Investors Service, Inc.\nA2\nPrime-1\nPositive\nStandard & Poors\nA\nA-1\nStable\nContractual Obligations and Cash Requirements\nThe Companys material cash requirements from contractual and other cash obligations relate to borrowings, including securitization borrowings. As of October 30, 2022, the Company had $15,814.4 million of principal payments on borrowings and securitization borrowings payable in the next 12 months, along with interest payments of $1,008.4 million. The securitization borrowing payments are based on the expected liquidation of the related retail notes securitized. The Companys borrowings will likely be replaced with new borrowings to finance the Receivables and Leases portfolio. See Notes 5, 7, and 9 for further detail regarding future contractual payments on securitization borrowings, intercompany borrowings, and long-term external borrowings.\nCritical Accounting Estimates\nThe preparation of the Companys consolidated financial statements in conformity with accounting principles generally accepted in the U.S. requires management to make estimates and assumptions that affect reported amounts of assets, liabilities, revenues, and expenses. Changes in these estimates and assumptions could have a significant effect on the Companys consolidated financial statements. The accounting policies below are those management believes are the most critical to the preparation of the Companys consolidated financial statements and require the most difficult, subjective, or complex judgments. The Companys other accounting policies are described in the Notes to the Consolidated Financial Statements.\nAllowance for Credit Losses\nThe allowance for credit losses is an estimate of the credit losses expected over the life of the Companys Receivable portfolio. The allowance is measured on a collective basis when similar risk characteristics exist. Risk characteristics considered by the Company include product category, market, geography, credit risk, and remaining duration. Receivables that do not share risk characteristics with other receivables in the portfolio are evaluated on an individual basis. Non-performing Receivables are included in the estimate of expected credit losses.\nThe Company utilizes loss forecast models, which are selected based on the size and credit risk of the underlying pool of receivables, to estimate expected credit losses. Transition matrix models are used for large and complex Customer Receivable pools, while weighted-average remaining maturity models are used for smaller and less complex Customer Receivable pools. Expected credit losses on wholesale receivables are based on historical loss rates, with consideration of current economic conditions and dealer financial risk. The modeled expected credit losses are adjusted based on reasonable and supportable forecasts, which may include economic indicators such as commodity prices, industry equipment sales, unemployment rates, and housing starts. Management reviews each models output quarterly, and qualitative adjustments are incorporated as necessary. See Note 4 to the Consolidated Financial Statements for further information.\nIn 2021, the Company adopted ASU No. 2016-13, which revised the measurement of credit losses from an incurred loss to an expected loss methodology. Upon adoption, the Companys allowance for credit losses increased $19.7 million with an offset to retained earnings. The allowance for credit losses at November 1, 2020 was not restated under the expected loss methodology. The total allowance for credit losses at October 30, 2022, October 31, 2021, and November 1, 2020 was $128.4 million, $129.0 million, and $129.1 million, respectively. The allowance decreased slightly in 2022 compared to 2021, primarily due to continued positive agricultural market conditions, which are having favorable impacts on the allowance and are offsetting increases due to higher portfolio balances. Strong recovery rates, driven by higher prices on used equipment inventory, are also benefiting the allowance for credit losses (see Note 4). The allowance decreased in 2021 compared to 2020, primarily due to lower expected losses in the construction and forestry market, continued improvement in the agriculture and turf market, and better than expected performance of accounts granted payment relief due to the economic effects of COVID. These decreases in 2021 were largely offset by the adoption of ASU No. 2016-13, as previously mentioned.\nThe assumptions used in evaluating the Companys exposure to credit losses involve estimates and significant judgment. While the Company believes its allowance is sufficient to provide for losses over the life of its existing Receivables portfolio, different assumptions or changes in economic conditions would result in changes to the allowance for credit losses. Historically, changes in economic conditions have had limited impact on credit losses within the Companys wholesale receivable portfolio. Within the Customer Receivables portfolio, credit loss estimates are dependent on a number of factors, including historical portfolio performance, current delinquency levels, and estimated recoveries\non defaulted accounts. The Companys transition matrix models, which are utilized to estimate credit losses for more than 90 percent of Customer Receivables, use historical portfolio performance and current delinquency levels to forecast future defaults. Estimated recovery rates are applied to the estimated default balance to calculate the expected credit losses. Holding all other factors constant, a 10 percent increase in the transition matrix models forecasted defaults as a result of elevated levels of delinquencies, deteriorating roll rates, or otherwise, and a simultaneous 10 percent decrease in recovery rates would have resulted in an increase to the allowance for credit losses of approximately $30 million at October 30, 2022.\nOperating Lease Residual Values\nThe carrying value of equipment on operating leases is affected by the estimated fair values of the equipment at the end of the lease (residual values). Upon termination of the lease, the equipment is either purchased by the lessee or sold to a third party, in which case the Company may record a gain or a loss for the difference between the estimated residual value and the sale price. The Company estimates residual values at the inception of the lease based on several factors, including lease term, expected hours of usage, historical wholesale sale prices, return experience, intended use of the equipment, market dynamics and trends, and third-party residual guarantees. The Company reviews residual value estimates during the lease term and tests the carrying value of its operating lease assets for impairment when events or circumstances necessitate. Changes in residual value assumptions would affect the amount of depreciation expense and the amount of investment in equipment on operating leases. Depreciation is adjusted prospectively on a straight-line basis over the remaining lease term if residual value estimates are revised. The total operating lease residual values at October 30, 2022, October 31, 2021, and November 1, 2020 were $3,366.7 million, $3,547.6 million, and $3,826.3 million, respectively. The decreases in 2022 and 2021 were primarily due to a lower operating lease portfolio.\nEstimates used in determining end-of-lease market values for equipment on operating leases significantly impact the amount and timing of depreciation expense. Hypothetically, if future market values for this equipment were to decrease 10 percent from the Companys present estimates and all the equipment on operating leases were returned to the Company for remarketing at the end of the lease term, the total impact would be to increase the Companys annual depreciation for equipment on operating leases by approximately $40 million, after consideration of dealer residual value guarantees.\nForward-Looking Statements\nCertain statements contained herein, including in the section entitled Overview relating to future events, expectations, and trends constitute forward-looking statements as defined in the Private Securities Litigation Reform Act of 1995 and involve factors that are subject to change, assumptions, risks, and uncertainties that could cause actual results to differ materially.\nForward-looking statements are based on currently available information and current assumptions, expectations, and projections about future events and should not be relied upon. Further information concerning the Company and its business, including factors that could materially affect the Companys financial results, is included in the Companys other filings with the SEC (including, but not limited to, the factors discussed in Item 1A. Risk Factors of this Annual Report on Form 10-K and subsequent Quarterly Reports on Form 10-Q).\nThe Companys business is closely related to John Deeres business. Further information, including factors that could materially affect the Companys and John Deeres financial results, is included in the Deere & Company Annual Report on Form 10-K for the year ended October 30, 2022 (including, but not limited to, the factors discussed in Item 1A., Risk Factors of the Annual Report on Form 10-K) and other Deere & Company and Capital Corporation filings with the SEC.\nIn addition, the Companys business and its results are affected by general global macroeconomic conditions, including but not limited to inflation, slower growth or recession, higher interest rates, and currency fluctuations, which could adversely affect the U.S. dollar and customer confidence, customer access to capital, and overall demand for John Deere products, credit application volumes, financing and repayment practices, and the number of and size of customer delinquencies and defaults, which could materially impact the Companys write-offs and provision for credit losses; government spending and taxing; actions of banks, financing and leasing companies, and other lenders that compete with the Company for customers; changes in weather and climate patterns; the political and social stability of the markets in\nwhich the Company operates; the effects of, or response to, wars and other conflicts, including the current conflict between Russia and Ukraine; natural disasters; and the spread of major epidemics or pandemics (including the COVID pandemic).\nThe liquidity and ongoing profitability of the Company depend on timely access to capital to meet future cash flow requirements, and to fund operations, costs, and finance customer purchases of John Deere products. If general economic conditions deteriorate further or capital markets become more volatile, funding could be unavailable or insufficient. Significant changes in market liquidity conditions, changes in the Companys credit ratings, and any failure to comply with financial covenants in credit agreements could also impact the Companys access to or terms of future funding, which could reduce the Companys earnings and cash flows. A debt crisis in Europe (including the recent volatility of the United Kingdoms bond market), Latin America, or elsewhere could negatively impact currencies, global financial markets, funding sources and costs, asset and obligation values, customers, demand for John Deere equipment, and Company operations and results. The Companys operations could be impaired by changes in the equity, bond, and other financial markets, which would negatively affect earnings.\nAdditional factors that could materially affect the Companys operations, financial condition, and results include changes in governmental trade, banking, monetary, and fiscal policies, including financial regulatory reform and its effects on the consumer finance industry, derivatives, funding costs, governmental programs, and policies and tariffs for the benefit of certain industries or sectors; actions by central banks and by financial and securities regulators, including increases to benchmark interest rates, which may affect the costs and expenses of financing the Company and the financing rates it is able to offer; actions by environmental, health, and safety regulatory agencies, including those related to the effects of climate change; changes to accounting standards; changes to and compliance with privacy, banking, and other regulations; changes to and compliance with economic sanctions and export controls laws and regulations (including those in place for Russia); and compliance with evolving U.S. and foreign laws when expanding to new markets and otherwise.\nOther factors that could materially affect the Companys results and operations include security breaches, cybersecurity attacks, technology failures, and other disruptions to the information technology infrastructure of the Company and John Deere dealers; events that damage the Companys reputation or brand; significant investigations, claims, lawsuits, or other legal proceedings; the success or failure of new product initiatives or business strategies; changes in product preferences and take rates of products; oil and energy prices, supplies, and volatility; customer profitability; housing starts and supply; the levels of public and non-residential construction; infrastructure investment; real estate values; consumable input costs; demand for agricultural products; world grain stocks; soil conditions; harvest yields; prices for commodities and livestock; availability and cost of fertilizer; availability of transport for crops; the growth and sustainability of non-food uses for some crops (including ethanol and biodiesel production); availability of technological innovations; John Deere dealers ability to support and service precision technology solutions; available acreage for farming; changes in government farm programs and policies; changes in and effects of crop insurance programs; changes in environmental regulations and their impact on farming practices; animal diseases and their effects on poultry, beef, and pork consumption and prices on livestock feed demand; crop pests and diseases; actions of competitors; changes in demand and pricing for used equipment and resulting impacts on lease residual values; labor relations and contracts, including work stoppages and other disruptions; and changes in the ability to attract, develop, engage, and retain qualified personnel. Item 7A. Quantitative and Qualitative Disclosures About Market Risk.\nFinancial Instrument Market Risk Information\nThe Company is naturally exposed to various interest rate and foreign currency risks. In an effort to mitigate the effects of such risks, the Company enters into derivative transactions to manage certain of these exposures that arise in the normal course of business and not for the purpose of creating speculative positions or trading. The Company manages the relationships of the types and amounts of its funding sources to its Receivable and Lease portfolios in an effort to diminish risk due to interest rate and foreign currency fluctuations, while responding to favorable financing opportunities. Accordingly, from time to time, the Company enters into interest rate swap agreements to manage its interest rate exposure. The Company also has foreign currency exposures at some of its foreign and domestic operations related to financing in currencies other than the functional currencies. The Company has entered into derivative agreements related to the management of these foreign currency transaction risks.\nInterest Rate Risk\nInterest rates rose in 2022 and further central bank policy rate increases are projected in 2023. Rising interest rates have historically impacted the Companys borrowings sooner than the benefit is realized from the Receivable and Lease portfolio. As a result, the Companys financing spread was unfavorably impacted in 2022 compared to 2021. If interest rates continue to rise, the Company expects to continue experiencing spread compression in 2023.\nQuarterly, the Company uses a combination of cash flow models to assess the sensitivity of its financial instruments with interest rate exposure to changes in market interest rates. The models calculate the effect of adjusting interest rates as follows. Cash flows for Receivables are discounted at the current prevailing rate for each Receivable portfolio. Cash flows for unsecured borrowings are discounted at the applicable benchmark yield curve plus market credit spreads for similarly rated borrowers. Cash flows for securitized borrowings are discounted at the swap yield curve plus a market credit spread for similarly rated borrowers. Cash flows for interest rate swaps are projected and discounted using forward rates from the swap yield curve at the repricing dates. The net loss in these financial instruments fair values, which would be caused by increasing the interest rates by 10 percent from the market rates at October 30, 2022 and October 31, 2021, would have been approximately $115 million and $100 million, respectively.\nThe Company continues to transition its Receivables, funding, and hedging portfolios from LIBOR to alternative reference rates. These transition activities are not expected to have a material impact on the Companys financial statements.\nForeign Currency Risk\nThe Companys policy is to manage foreign currency risk through hedging strategies if the currency of the borrowings does not match the currency of the Receivable portfolio. As a result, a hypothetical 10 percent adverse change in the value of the U.S. dollar relative to all other foreign currencies would not have a material effect on the Companys cash flows. Item 8. Financial Statements and Supplementary Data.\nSee accompanying table of contents of financial statements on page 35. Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure.\nNot applicable. Item 9A. Controls and Procedures.\nDisclosure Controls and Procedures\nThe Companys principal executive officer and its principal financial officer have concluded that the Companys disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) of the Securities Exchange Act of 1934, as amended (the Exchange Act)) were effective as of October 30, 2022, based on the evaluation of these controls and procedures required by Rule 13a-15(b) or 15d-15(b) of the Exchange Act.\nManagements Report on Internal Control Over Financial Reporting\nThe Companys management is responsible for establishing and maintaining adequate internal control over financial reporting. The Companys internal control system was designed to provide reasonable assurance regarding the preparation and fair presentation of published financial statements in accordance with generally accepted accounting principles in the U.S.\nAll internal control systems, no matter how well designed, have inherent limitations. Therefore, even those systems determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation in accordance with generally accepted accounting principles in the U.S.\nManagement assessed the effectiveness of the Companys internal control over financial reporting as of October 30, 2022, using the criteria set forth in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on that assessment, management believes that, as of October 30, 2022, the Companys internal control over financial reporting was effective.\nThis Annual Report on Form 10-K does not include an attestation report of the Companys independent registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by the Companys independent registered public accounting firm pursuant to rules of the Securities and Exchange Commission that permit the Company to provide only managements report in this Annual Report on Form 10-K.\nChanges in Internal Control Over Financial Reporting\nDuring the fourth quarter, there were no changes that have materially affected or are reasonably likely to materially affect the Companys internal control over financial reporting. Item 9B. Other Information.\nNot applicable.\nItem 9C. Disclosure Regarding Foreign Jurisdictions That Prevent Inspections.\nNot applicable.\nPART III Item 10. Directors, Executive Officers, and Corporate Governance.\nOmitted pursuant to Instruction I(2). Item 11. Executive Compensation.\nOmitted pursuant to Instruction I(2). Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters.\nOmitted pursuant to Instruction I(2). Item 13. Certain Relationships and Related Transactions, and Director Independence.\nOmitted pursuant to Instruction I(2). Item 14. Principal Accountant Fees and Services.\nFor the years ended October 30, 2022 and October 31, 2021, professional services were performed by Deloitte & Touche LLP (PCAOB ID No. 34), the member firms of Deloitte Touche Tohmatsu, and their respective affiliates (collectively called Deloitte & Touche).\nAudit Fees\nThe aggregate fees billed include amounts for the audit of the Companys annual financial statements, the reviews of the financial statements included in the Companys Quarterly Reports on Form 10-Q, including services related thereto such as comfort letters, statutory audits, attest services, consents, and assistance with and review of documents filed with the SEC and other regulatory bodies. Audit fees for the fiscal years ended October 30, 2022 and October 31, 2021 were $3.4 million and $3.2 million, respectively.\nAudit-Related Fees\nDuring the last two fiscal years, Deloitte & Touche has provided the Company with assurance and related services that are reasonably related to the performance of the audit of the Companys financial statements. The aggregate fees billed for such audit-related services for the fiscal years ended October 30, 2022 and October 31, 2021 were $.3 million and $.2 million, respectively. These services included various attest services.\nTax Fees\nThere were no fees billed for professional services provided by Deloitte & Touche in connection with tax advice and tax planning services for the fiscal years ended October 30, 2022 and October 31, 2021.\nAll Other Fees\nThere were no fees billed by Deloitte & Touche for services not included above for the fiscal years ended October 30, 2022 and October 31, 2021.\nPre-approval of Services by the Independent Registered Public Accounting Firm\nAs a wholly-owned subsidiary of Deere & Company, audit and non-audit services provided by the Companys independent registered public accounting firm are subject to Deere & Companys Audit Review Committee pre-approval policies and procedures as described in the Deere & Company 2022 proxy statement. During the fiscal year ended October 30, 2022, all services provided by the independent registered public accounting firm were pre-approved by Deere & Companys Audit Review Committee in accordance with such policy.\nPART IV Item 15. Exhibits and Financial Statement Schedules.\n(1)    Financial Statements\nSee the table of contents to financial statements on page 35.\n(2)    Financial Statement Schedules\nNone.\n(3)    Exhibits\nSee the index to exhibits on page 73.\nItem 16. Form 10-K Summary.\nNone.\nPage\nFinancial Statements:\nJohn Deere Capital Corporation and Subsidiaries:\nReport of Independent Registered Public Accounting Firm\nStatements of Consolidated Income\nFor the Years Ended October 30, 2022, October 31, 2021, and November 1, 2020\nStatements of Consolidated Comprehensive Income\nFor the Years Ended October 30, 2022, October 31, 2021, and November 1, 2020\nConsolidated Balance Sheets\nAs of October 30, 2022 and October 31, 2021\nStatements of Consolidated Cash Flows\nFor the Years Ended October 30, 2022, October 31, 2021, and November 1, 2020\nStatements of Changes in Consolidated Stockholders Equity\nFor the Years Ended November 1, 2020, October 31, 2021, and October 30, 2022\nNotes to Consolidated Financial Statements\nSchedules Omitted\nThe following schedules are omitted because of the absence of conditions under which they are required or because the required information is included in the Notes to the Consolidated Financial Statements:\nI, II, III, IV, and V.\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the stockholders and the Board of Directors of John Deere Capital Corporation:\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of John Deere Capital Corporation and subsidiaries (the Company) as of October 30, 2022 and October 31, 2021, the related statements of consolidated income, consolidated comprehensive income, changes in consolidated stockholders equity, and consolidated cash flows, for each of the three years in the period ended October 30, 2022, and the related notes (collectively referred to as the \"financial statements\"). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of October 30, 2022 and October 31, 2021, and the results of its operations and its cash flows for each of the three years in the period ended October 30, 2022, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current-period audit of the financial statements that was communicated or required to be communicated to the audit committee and that (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nAllowance for Credit Losses - Refer to Notes 2 and 4 to the financial statements\nCritical Audit Matter Description\nThe allowance for credit losses as of October 30, 2022 was $128.4 million. The allowance for credit losses is an estimate of the credit losses expected over the life of the Companys receivable portfolio. The Company measures expected credit losses on a collective basis when similar risk characteristics exist. Risk characteristics considered by the Company include product category, market, geography, credit risk, and remaining duration. The Company utilizes loss forecast models, which are selected based on the size and credit risk of the underlying pool of receivables, to estimate expected credit losses. Transition matrix models, which are used for the majority of the customer receivables, use historical\ndelinquency and default information to assign probabilities that a receivable will pay as contractually scheduled or become delinquent and advance through the various delinquency stages. The modeled expected credit losses are adjusted based on reasonable and supportable forecasts, which may include economic indicators such as commodity prices, industry equipment sales, unemployment rates, and housing starts. Management reviews each models output quarterly, and qualitative adjustments are incorporated as necessary.\nWe identified the allowance for credit losses as a critical audit matter because determining the appropriate methodology and assumptions used in the estimate requires significant judgment by management. Given the subjective nature and judgment applied by management to determine the allowance for credit losses, auditing the methodology and assumptions requires a high degree of auditor judgment and an increased extent of effort, including the need to involve credit specialists.\nHow the Critical Audit Matter Was Addressed in the Audit\nOur audit procedures related to testing the Companys allowance for credit losses included the following, among others:\n● We tested the effectiveness of managements controls over the methodology, data and assumptions used to estimate the allowance for credit losses.\n● We tested the accuracy and evaluated the relevance of the underlying historical data used in the Companys model.\n● With the assistance of our credit specialists, we evaluated the reasonableness and accuracy of the models used to estimate the allowance for credit losses, including model assumptions and the selection and application of relevant risk characteristics and use of qualitative adjustments.\n● We evaluated qualitative adjustments to the model estimate. Our evaluation included:\no Comparison of qualitative factors used by the Company to source data provided by the Company and/or to externally available data\no Consideration and evaluation of contradictory evidence\n● We evaluated managements ability to accurately forecast credit losses by performing a retrospective review, which involved comparing actual credit losses to historical estimates.\n/s/ DELOITTE & TOUCHE LLP\nChicago, Illinois\nDecember 15, 2022\nWe have served as the Companys auditor since 1959.\nJohn Deere Capital Corporation and Subsidiaries\nStatements of Consolidated Income\nFor the Years Ended October 30, 2022, October 31, 2021, and November 1, 2020\n(in millions)\nRevenues\nFinance income earned on retail notes\n$\n1,023.3\n$\n946.6\n$\n941.4\nLease revenues\n957.5\n1,022.0\n1,088.9\nRevolving charge account income\n300.2\n298.1\n333.8\nFinance income earned on wholesale receivables\n342.5\n299.8\n385.0\nOther income\n135.7\n121.5\n58.5\nTotal revenues\n2,759.2\n2,688.0\n2,807.6\nExpenses\nInterest expense\n497.3\n472.9\n743.9\nOperating expenses:\nDepreciation of equipment on operating leases\n667.7\n733.4\n845.1\nAdministrative and operating expenses\n440.1\n406.0\n470.6\nFees and interest paid to John Deere\n222.1\n168.3\n101.6\nProvision (credit) for credit losses\n23.5\n(.9)\n89.4\nTotal operating expenses\n1,353.4\n1,306.8\n1,506.7\nTotal expenses\n1,850.7\n1,779.7\n2,250.6\nIncome of consolidated group before income taxes\n908.5\n908.3\n557.0\nProvision for income taxes\n209.0\n200.5\n134.1\nIncome of consolidated group\n699.5\n707.8\n422.9\nEquity in income of unconsolidated affiliate\n4.5\n3.0\n2.2\nNet income\n704.0\n710.8\n425.1\nLess: Net income (loss) attributable to noncontrolling interests\n(.3)\n.2\n.1\nNet income attributable to the Company\n$\n704.3\n$\n710.6\n$\n425.0\nThe accompanying Notes to Consolidated Financial Statements are an integral part of this statement.\nJohn Deere Capital Corporation and Subsidiaries\nStatements of Consolidated Comprehensive Income\nFor the Years Ended October 30, 2022, October 31, 2021, and November 1, 2020\n(in millions)\nNet income\n$\n704.0\n$\n710.8\n$\n425.1\nOther comprehensive income (loss), net of income taxes\nCumulative translation adjustment\n(114.5)\n15.0\n18.9\nUnrealized gain on derivatives\n60.0\n13.5\n.3\nUnrealized gain (loss) on debt securities\n(.8)\n(.1)\n.4\nOther comprehensive income (loss), net of income taxes\n(55.3)\n28.4\n19.6\nComprehensive income of consolidated group\n648.7\n739.2\n444.7\nLess: Comprehensive income (loss) attributable to noncontrolling interests\n(.3)\n.2\n.1\nComprehensive income attributable to the Company\n$\n649.0\n$\n739.0\n$\n444.6\nThe accompanying Notes to Consolidated Financial Statements are an integral part of this statement.\nJohn Deere Capital Corporation and Subsidiaries\nConsolidated Balance Sheets\nAs of October 30, 2022 and October 31, 2021\n(in millions)\nAssets\nCash and cash equivalents\n$\n661.8\n$\n677.0\nMarketable securities\n1.1\n2.1\nReceivables:\nRetail notes\n22,860.3\n21,343.5\nRetail notes securitized\n5,951.6\n4,662.4\nRevolving charge accounts\n4,165.8\n3,740.1\nWholesale receivables\n8,404.5\n5,951.3\nFinancing leases\n1,120.7\n972.3\nTotal receivables\n42,502.9\n36,669.6\nAllowance for credit losses\n(128.4)\n(129.0)\nTotal receivables - net\n42,374.5\n36,540.6\nOther receivables\n91.4\n85.1\nReceivables from John Deere\n214.8\n191.6\nEquipment on operating leases - net\n4,853.5\n4,947.6\nNotes receivable from John Deere\n370.7\n393.5\nInvestment in unconsolidated affiliate\n22.6\n21.9\nDeferred income taxes\n23.3\n32.7\nOther assets\n314.3\n324.5\nTotal Assets\n$\n48,928.0\n$\n43,216.6\nLiabilities and Stockholders Equity\nShort-term external borrowings:\nCommercial paper and other notes payable\n$\n2,402.3\n$\n678.9\nSecuritization borrowings\n5,710.9\n4,595.2\nCurrent maturities of long-term external borrowings\n5,989.6\n5,819.1\nTotal short-term external borrowings\n14,102.8\n11,093.2\nNotes payable to John Deere\n5,225.5\n5,619.4\nOther payables to John Deere\n1,024.2\n97.6\nAccounts payable and accrued expenses\n866.1\n876.0\nDeposits held from dealers and merchants\n137.3\n131.8\nDeferred income taxes\n239.4\n265.1\nLong-term external borrowings\n22,527.8\n20,607.3\nTotal liabilities\n44,123.1\n38,690.4\nCommitments and contingencies (Note 17)\nStockholders equity:\nCommon stock, without par value (issued and outstanding -\n2,500 shares owned by John Deere Financial Services, Inc.)\n1,482.8\n1,482.8\nRetained earnings\n3,425.3\n3,091.0\nAccumulated other comprehensive loss\n(104.7)\n(49.4)\nTotal Company stockholders equity\n4,803.4\n4,524.4\nNoncontrolling interests\n1.5\n1.8\nTotal stockholders equity\n4,804.9\n4,526.2\nTotal Liabilities and Stockholders Equity\n$\n48,928.0\n$\n43,216.6\nThe accompanying Notes to Consolidated Financial Statements are an integral part of this statement.\nJohn Deere Capital Corporation and Subsidiaries\nStatements of Consolidated Cash Flows\nFor the Years Ended October 30, 2022, October 31, 2021, and November 1, 2020\n(in millions)\nCash Flows from Operating Activities:\nNet income\n$\n704.0\n$\n710.8\n$\n425.1\nAdjustments to reconcile net income to net cash\nprovided by operating activities:\nProvision (credit) for credit losses\n23.5\n(.9)\n89.4\nProvision for depreciation and amortization\n692.1\n756.6\n861.6\nCredit for deferred income taxes\n(32.0)\n(83.3)\n(175.6)\nImpairment charges\n30.8\nChange in accounts payable and accrued expenses\n14.4\n(39.5)\n(25.1)\nChange in accrued income taxes payable/receivable\n(31.9)\n(11.1)\n45.7\nOther\n(164.2)\n33.3\n198.3\nNet cash provided by operating activities\n1,205.9\n1,365.9\n1,450.2\nCash Flows from Investing Activities:\nCost of receivables acquired (excluding wholesale)\n(23,941.6)\n(22,438.0)\n(19,060.0)\nCollections of receivables (excluding wholesale)\n19,967.5\n18,147.4\n16,768.9\nDecrease (increase) in wholesale receivables - net\n(2,737.6)\n1,197.1\n1,649.1\nCost of equipment on operating leases acquired\n(2,067.1)\n(1,845.7)\n(1,904.9)\nProceeds from sales of equipment on operating leases\n1,547.4\n1,569.1\n1,334.6\nCost of notes receivable acquired from John Deere\n(351.9)\n(321.5)\n(198.1)\nCollections of notes receivable from John Deere\n367.4\n297.5\n110.7\nOther\n9.1\n2.4\n(35.9)\nNet cash used for investing activities\n(7,206.8)\n(3,391.7)\n(1,335.6)\nCash Flows from Financing Activities:\nIncrease (decrease) in commercial paper and other notes\npayable - net\n1,716.6\n504.9\n(1,269.1)\nIncrease (decrease) in securitization borrowings - net\n1,119.7\n(60.7)\n379.1\nIncrease in short-term borrowings with John Deere - net\n88.6\n392.8\n3,291.8\nProceeds from issuance of long-term external borrowings\n9,255.3\n7,418.3\n3,561.9\nPayments of long-term external borrowings\n(5,754.4)\n(5,710.4)\n(5,719.7)\nDividends paid\n(370.0)\n(485.0)\n(275.0)\nCapital investment from John Deere\n.1\nDebt issuance costs\n(38.7)\n(33.7)\n(24.8)\nNet cash provided by (used for) financing activities\n6,017.1\n2,026.2\n(55.7)\nEffect of exchange rate changes on cash, cash equivalents, and restricted cash\n(22.9)\n3.0\n(.4)\nNet increase (decrease) in cash, cash equivalents, and restricted cash\n(6.7)\n3.4\n58.5\nCash, cash equivalents, and restricted cash at beginning of year\n772.8\n769.4\n710.9\nCash, cash equivalents, and restricted cash at end of year\n$\n766.1\n$\n772.8\n$\n769.4\nComponents of cash, cash equivalents, and restricted cash:\nCash and cash equivalents\n$\n661.8\n$\n677.0\n$\n674.6\nRestricted cash*\n104.3\n95.8\n94.8\nTotal cash, cash equivalents, and restricted cash\n$\n766.1\n$\n772.8\n$\n769.4\n* Restricted cash is reported in other assets on the consolidated balance sheets and primarily relates to the securitization of receivables (see Note 5).\nThe accompanying Notes to Consolidated Financial Statements are an integral part of this statement.\nJohn Deere Capital Corporation and Subsidiaries\nStatements of Changes in Consolidated Stockholders Equity\nFor the Years Ended November 1, 2020, October 31, 2021, and October 30, 2022\n(in millions)\nCompany Stockholder\nAccumulated\nTotal\nOther\nNon-\nStockholders\nCommon\nRetained\nComprehensive\ncontrolling\nEquity\nStock\nEarnings\nIncome (Loss)\nInterests\nBalance November 3, 2019\n$\n4,128.4\n$\n1,482.8\n$\n2,741.6\n$\n(97.4)\n$\n1.4\nNet income\n425.1\n425.0\n.1\nOther comprehensive income\n19.6\n19.6\nDividends declared\n(275.0)\n(275.0)\nCapital investment\n.1\n.1\nBalance November 1, 2020\n4,298.2\n1,482.8\n2,891.6\n(77.8)\n1.6\nASU No. 2016-13 adoption\n(26.2)\n(26.2)\nNet income\n710.8\n710.6\n.2\nOther comprehensive income\n28.4\n28.4\nDividends declared\n(485.0)\n(485.0)\nBalance October 31, 2021\n4,526.2\n1,482.8\n3,091.0\n(49.4)\n1.8\nNet income (loss)\n704.0\n704.3\n(.3)\nOther comprehensive loss\n(55.3)\n(55.3)\nDividends declared\n(370.0)\n(370.0)\nBalance October 30, 2022\n$\n4,804.9\n$\n1,482.8\n$\n3,425.3\n$\n(104.7)\n$\n1.5\nThe accompanying Notes to Consolidated Financial Statements are an integral part of this statement.\nJohn Deere Capital Corporation and Subsidiaries\nNotes to Consolidated Financial Statements\nNote 1. Organization and Consolidation\nCorporate Organization\nJohn Deere Capital Corporation (Capital Corporation) and its subsidiaries are collectively called the Company. John Deere Financial Services, Inc. (JDFS), a wholly-owned finance holding subsidiary of Deere & Company, owns all of the outstanding common stock of Capital Corporation. The Company conducts business in Australia, New Zealand, the U.S., and in several countries in Africa, Asia, Europe, and Latin America, including Argentina and Mexico. Deere & Company and its wholly-owned subsidiaries are collectively called John Deere.\nRetail notes, revolving charge accounts, and financing leases are collectively called Customer Receivables. Customer Receivables and wholesale receivables are collectively called Receivables. Receivables and equipment on operating leases are collectively called Receivables and Leases.\nThe Company bears substantially all of the credit risk (net of recovery from withholdings from certain John Deere dealers and merchants) associated with its holding of Receivables and Leases. A small portion of the Receivables and Leases held (less than 5 percent) is guaranteed by certain subsidiaries of Deere & Company. The Company also performs substantially all servicing and collection functions. Servicing and collection functions for a small portion of the Receivables and Leases held (less than 5 percent) are provided by John Deere. John Deere is reimbursed for staff and other administrative services at estimated cost, and for credit lines provided to the Company based on utilization of those lines.\nPrinciples of Consolidation\nThe consolidated financial statements include the financial statements of Capital Corporation and its subsidiaries. The consolidated financial statements represent the consolidation of all companies in which Capital Corporation has a controlling interest. Certain variable interest entities (VIEs) are consolidated since the Company is the primary beneficiary. The primary beneficiary has both the power to direct the activities that most significantly impact the VIEs economic performance and the obligation to absorb losses or the right to receive benefits that could potentially be significant to the VIEs. The Company consolidates certain VIEs that are special purpose entities (SPEs) related to the securitization of receivables (see Note 5). The Company records its investment in each unconsolidated affiliated company (20 to 50 percent ownership) at its related equity in the net assets of such affiliate (see Note 23).\nFiscal Year\nThe Company uses a 52/53 week fiscal year ending on the last Sunday in the reporting period, which generally occurs near the end of October. An additional week is included in the fourth fiscal quarter every five or six years to realign the Companys fiscal quarters with the calendar. The fiscal year ends for 2022, 2021, and 2020 were October 30, 2022, October 31, 2021, and November 1, 2020, respectively. Fiscal years 2022, 2021, and 2020 contained 52 weeks. Unless otherwise stated, references to particular years or quarters refer to the Companys fiscal years and the associated periods in those fiscal years.\nArgentina\nThe Company has financial services operations in Argentina. The U.S. dollar has historically been the functional currency for the Company's Argentina operations, as its business is indexed to the U.S. dollar due to the highly inflationary conditions. The Argentine government has certain capital and currency controls that restrict the Company's ability to access U.S. dollars in Argentina and remit earnings from its Argentine operations. As of October 30, 2022 and October 31, 2021, the Company's net investment in Argentina was approximately $53.5 million and $69.5 million, respectively. Revenues from the Company's Argentine operations represented approximately 3 percent of the Company's consolidated revenues for 2022. The net peso exposure as of October 30, 2022 and October 31, 2021 was approximately $45.6 million and $46.5 million, respectively. Argentine peso-denominated monetary assets and liabilities are remeasured at each balance sheet date using the official currency exchange rate.\nNote 2. Summary of Significant Accounting Policies and New Accounting Standards\nThe following are significant accounting policies in addition to those included in other Notes to the Consolidated Financial Statements.\nUse of Estimates in Financial Statements\nThe preparation of financial statements in conformity with accounting principles generally accepted in the U.S. requires management to make estimates and assumptions that affect the reported amounts and related disclosures.\nRevenue Recognition\nFinancing revenue, including compensation from John Deere for waived or reduced finance charges, is recorded over the lives of the related receivables using the interest method. Deferred costs on the origination of receivables are recognized as a reduction in finance revenue over the expected lives of the receivables using the interest method. Operating lease revenue, including compensation from John Deere, and deferred costs on the origination of operating leases are recognized on a straight-line basis over the scheduled lease terms in lease revenue.\nReceivables and Allowance for Credit Losses\nReceivables are reported on the consolidated balance sheets at outstanding principal and accrued interest, adjusted for any write-offs and any unamortized deferred fees or costs on originated Receivables. The Company also records an allowance for credit losses and provision for credit losses related to the Receivables. The allowance represents an estimate of the credit losses expected over the life of the Receivable portfolio, and is measured on a collective basis when similar risk characteristics exist. Risk characteristics considered by the Company include product category, market, geography, credit risk, and remaining duration. Receivables that do not share risk characteristics with other receivables in the portfolio are evaluated on an individual basis. The Company utilizes loss forecast models, which are selected based on the size and credit risk of the underlying pool of receivables, to estimate expected credit losses. Transition matrix models are used for large and complex Customer Receivable pools, while weighted-average remaining maturity (WARM) models are used for smaller and less complex Customer Receivable pools. Expected credit losses on wholesale receivables are based on historical loss rates, with consideration of current economic conditions and dealer financial risk. The modeled expected credit losses are adjusted based on reasonable and supportable forecasts, which may include economic indicators such as commodity prices, industry equipment sales, unemployment rates, and housing starts. Management reviews each models output quarterly, and qualitative adjustments are incorporated as necessary. Receivables are written off to the allowance when the account is considered uncollectible (see Note 4).\nSecuritization of Receivables\nCertain financing receivables are periodically transferred to SPEs in securitization transactions (see Note 5). These securitizations qualify as collateral for secured borrowings and no gains or losses are recognized at the time of securitization. The receivables remain on the consolidated balance sheets and are classified as retail notes securitized. The Company recognizes finance income over the lives of these receivables using the interest method.\nDepreciation\nThe Company estimates residual values of equipment on operating leases at the inception of the lease, and the equipment is depreciated over the lease terms to the estimated residual value using the straight-line method. The Company reviews residual value estimates during the lease term and depreciation is adjusted prospectively on a straight-line basis over the remaining lease term if residual estimates are revised.\nImpairment of Long-Lived Assets\nThe Company evaluates the carrying value of long-lived assets when events or circumstances warrant such a review. If the carrying value of the long-lived asset is considered impaired, a loss is recognized based on the amount by which the carrying value exceeds the fair value of the asset (see Notes 6 and 19).\nFees and Interest Paid to John Deere\nFees and interest paid to John Deere include corporate support fees and interest on intercompany borrowings from John Deere based on approximate market rates.\nDerivative Financial Instruments\nIt is the Companys policy that derivative transactions are executed only to manage exposures arising in the normal course of business and not for the purpose of creating speculative positions or trading. The Company manages the relationship of the types and amounts of its funding sources to its Receivable and Lease portfolios in an effort to diminish risk due to interest rate and foreign currency fluctuations, while responding to favorable financing opportunities. The Company also has foreign currency exposures at some of its foreign and domestic operations related to financing in currencies other than the functional currencies.\nAll derivatives are recorded at fair value on the consolidated balance sheets. Cash collateral received or paid is not offset against the derivative fair values on the consolidated balance sheets. The cash flows from the derivative contracts are recorded in operating activities in the statements of consolidated cash flows. Each derivative is designated as a cash flow hedge, fair value hedge, or remains undesignated. Changes in the fair value of derivatives that are designated and effective as cash flow hedges are recorded in other comprehensive income (OCI) and reclassified to the income statement when the effects of the item being hedged are recognized in the income statement. Changes in the fair value of derivatives that are designated and effective as fair value hedges are recognized currently in net income. These changes are offset in net income by fair value changes related to the risk being hedged on the hedged item. Changes in the fair value of undesignated hedges are recognized currently in the income statement.\nAll designated hedges are formally documented as to the relationship with the hedged item as well as the risk-management strategy. Both at inception and on an ongoing basis, the hedging instrument is assessed as to its effectiveness. If and when a derivative is determined not to be highly effective as a hedge, the underlying hedged transaction is no longer likely to occur, the hedge designation is removed, or the derivative is terminated, hedge accounting is discontinued (see Note 20).\nForeign Currency Translation\nThe functional currencies for most of the Companys foreign operations are their respective local currencies. The assets and liabilities of these operations are translated into U.S. dollars at the end of the period exchange rates. The revenues and expenses are translated at weighted-average rates for the period. The gains or losses from these translations are recorded in OCI. Gains or losses from transactions denominated in a currency other than the functional currency of the subsidiary involved and foreign currency exchange components of derivative contracts are included in net income. The pretax net losses for foreign currency exchange in 2022, 2021, and 2020 were $25.6 million, $14.9 million, and $18.8 million respectively, which is reported in administrative and operating expenses.\nNew Accounting Standards\nThe Company closely monitors all Accounting Standard Updates (ASUs) issued by the Financial Accounting Standards Board (FASB) and other authoritative guidance. The Company adopted the following standards in 2022, none of which had a material effect on the Companys consolidated financial statements:\nAccounting Standards Updates\nNo. 2019-12\nSimplifying the Accounting for Income Taxes, which amends ASC 740, Income Taxes\nNo. 2020-08\nCodification Improvements to Subtopic 310-20, Receivables - Nonrefundable Fees and Other Costs\nIn March 2022, the FASB issued ASU No. 2022-02, Financial Instruments - Credit Losses (Topic 326): Troubled Debt Restructurings and Vintage Disclosures, which will be effective in the first quarter of fiscal year 2024. The ASU eliminates the accounting guidance for troubled debt restructurings, enhances disclosures for certain receivable modifications related to borrowers experiencing financial difficulty, and requires disclosure of current period gross write-offs by year of origination. ASU No. 2022-02 and other ASUs to be adopted in future periods are being evaluated and at this point are not expected to have a material impact on the Companys consolidated financial statements.\nNote 3. Receivables\nRetail Notes Receivable\nThe Company provides and administers financing for retail purchases of new equipment manufactured by John Deeres production and precision agriculture operations, small agriculture and turf operations, and construction and forestry operations and used equipment taken in trade for this equipment. References to agriculture and turf include both production and precision agriculture and small agriculture and turf. The Company generally purchases retail installment sales and loan contracts (retail notes) from John Deere. These retail notes are acquired by John Deere through John Deere retail dealers. The Company also purchases and finances a limited amount of retail notes unrelated to John Deere.\nRetail notes receivable by market at October 30, 2022 and October 31, 2021 were as follows (in millions of dollars):\nUnrestricted\nSecuritized\nUnrestricted\nSecuritized\nAgriculture and turf - new\n$\n12,997.8\n$\n2,100.2\n$\n12,125.8\n$\n1,713.7\nAgriculture and turf - used\n6,745.8\n2,767.4\n5,992.5\n2,326.6\nConstruction and forestry - new\n2,776.5\n846.7\n2,902.1\n536.0\nConstruction and forestry - used\n1,105.0\n332.0\n974.6\n165.9\nTotal\n23,625.1\n6,046.3\n21,995.0\n4,742.2\nUnearned finance income\n(764.8)\n(94.7)\n(651.5)\n(79.8)\nRetail notes receivable\n$\n22,860.3\n$\n5,951.6\n$\n21,343.5\n$\n4,662.4\nRetail notes acquired by the Company during 2022, 2021, and 2020, had an average original term (based on dollar weighted amounts) of 58 months, 57 months, and 57 months, respectively. Historically, because of prepayments, the average actual life of retail notes has been considerably shorter than the average original term. The average actual life for retail notes liquidated in 2022, 2021, and 2020 was 35 months, 36 months, and 38 months, respectively.\nGross retail note installments at October 30, 2022 and October 31, 2021 were scheduled to be received as follows (in millions of dollars):\nUnrestricted\nSecuritized\nUnrestricted\nSecuritized\nDue in:\n0-12 months\n$\n7,139.7\n$\n2,225.2\n$\n6,448.9\n$\n1,894.0\n13-24 months\n5,668.8\n1,667.4\n5,361.5\n1,322.8\n25-36 months\n4,677.8\n1,208.9\n4,400.4\n884.4\n37-48 months\n3,427.2\n709.3\n3,232.5\n478.1\n49-60 months\n2,057.6\n226.8\n1,927.4\n149.7\nOver 60 months\n654.0\n8.7\n624.3\n13.2\nTotal\n$\n23,625.1\n$\n6,046.3\n$\n21,995.0\n$\n4,742.2\nCompany guidelines relating to down payment requirements and contract terms on retail notes are generally as follows:\nDown\nContract\nPayment\nTerms\nAgriculture (new and used):\nSeasonal payments\n20%\n3 - 7 years\nMonthly payments\n10%\n36 - 84 months\nTurf (new and used):\nSeasonal payments\n10%\n3 - 7 years\nMonthly payments\n0%\n36 - 84 months\nConstruction and forestry:\nNew\n10%\n24 - 60 months\nUsed\n15%\n36 - 60 months\nFinance income is recognized over the lives of the retail notes using the interest method. During 2022, the average effective yield on retail notes held by the Company was approximately 3.9 percent, compared with 4.0 percent in 2021 and 4.7 percent in 2020. As of October 30, 2022 and October 31, 2021, over 95 percent of the retail notes held by the Company bore a fixed finance rate. Finance income on variable-rate retail notes is adjusted periodically based on the adjustment schedule and fluctuations in the applicable base rate specified in the respective contract. Net costs incurred in the acquisition of retail notes are deferred and recognized over the expected lives of the retail notes using the interest method.\nA portion of the finance income earned by the Company arises from financing of retail sales of John Deere equipment on which finance charges are waived or reduced by John Deere for a period from the date of the retail sale to a specified subsequent date. The Company receives compensation from John Deere equal to competitive market interest rates for periods during which finance charges have been waived or reduced. The Company computes the compensation from John Deere for waived or reduced finance charges based on the Companys estimated funding costs, administrative and operating expenses, credit losses, and required return on equity. The financing rate following the waiver or interest reduction period is not significantly different from the compensation rate from John Deere. During 2022, 2021, and 2020, the finance income earned from John Deere on retail notes containing waiver of finance charges or reduced rates was $328.3 million, $325.0 million, and $339.5 million, respectively.\nA deposit is withheld by the Company on certain John Deere agriculture and turf equipment retail notes originating from dealers. Any subsequent retail note losses, subject to certain limitations by customer, are charged against the withheld deposits. At the end of each calendar quarter, the balance of each dealers withholding account in excess of a specified percent (ranging from one-half to three percent based on dealer qualifications) of the total balance outstanding on retail notes originating with that dealer is remitted to the dealer. Credit losses recovered from dealer deposits are presented in other income at the time the dealer deposits are charged. Prior to the adoption of ASU No. 2016-13, Measurement of Credit Losses on Financial Instruments, in the first quarter of 2021, the benefit of credit losses recovered from dealer deposits was recognized in the provision for credit losses based on estimated recoveries. There is generally no withholding of dealer deposits on John Deere construction and forestry equipment retail notes.\nThe Company generally requires theft and physical damage insurance be carried on all goods leased or securing retail notes and wholesale receivables. In certain markets, the customer may, at the customers own expense, have the Company or the seller of the goods purchase this insurance or obtain it from other sources.\nRevolving Charge Accounts Receivable\nRevolving charge account income is generated primarily by three revolving credit products: John Deere Financial Multi-Use Account, PowerPlanâ, and John Deere Financial Revolving Plan. John Deere Financial Multi-Use Account is primarily used by farmers and ranchers to finance parts and services from John Deere dealers, as well as crop inputs, such as seed, fertilizer, and crop protection from agribusiness merchants. Merchants, including agribusinesses and dealers, offer John Deere Financial Multi-Use Account as an alternative to carrying in-house accounts receivable and can initially sell existing balances to the Company under a recourse arrangement. John Deere Financial Multi-Use Account income includes a discount paid by merchants on most transactions for processing and support and finance charges paid by customers on\ntheir outstanding account balances. PowerPlanâ is primarily used by construction companies to finance parts and services. John Deere construction and forestry dealers offer PowerPlanâ as an alternative to carrying in-house accounts receivable and can initially sell existing balances to the Company under a recourse arrangement. PowerPlanâ income includes a discount paid by dealers for transaction processing and support and finance charges paid by customers on their outstanding account balances. The John Deere Financial Revolving Plan is used primarily by retail customers of John Deere dealers to finance turf and utility equipment. Income includes a discount paid by dealers on most transactions and finance charges paid by customers on their outstanding account balances. Revolving charge account income is also generated through waiver of finance charges or reduced rates from John Deere and sponsoring merchants.\nDuring 2022, 2021, and 2020, the finance income earned from John Deere on revolving charge accounts containing waiver of finance charges or reduced rates was $13.4 million, $14.3 million, and $15.2 million, respectively. Revolving charge accounts receivable at October 30, 2022 and October 31, 2021 totaled $4,165.8 million and $3,740.1 million, and were net of unearned interest income of $59.2 million and $53.8 million for the same periods, respectively. Generally, account holders may pay the account balance in full at any time or make payments over a number of months according to a payment schedule.\nWholesale Receivables\nThe Company also provides wholesale financing to dealers of John Deere agriculture and turf equipment and construction and forestry equipment, primarily to finance inventories of equipment for those dealers. Wholesale finance income related to these notes is generally recognized monthly based on the daily balance of wholesale receivables outstanding and the applicable effective interest rate. Interest rates vary with a bank base rate, the type of equipment financed, and dealer financial profile. Substantially all wholesale receivables are secured by equipment financed or other collateral. On average, the wholesale receivables portfolio turned seven times and five times during 2022 and 2021, respectively. Wholesale receivables at October 30, 2022 and October 31, 2021 totaled $8,404.5 million and $5,951.3 million, respectively.\nThe Company purchases certain wholesale trade receivables from John Deere, which are included within the wholesale receivable balances above. These trade receivables arise from John Deeres sales of goods to independent dealers. Under the terms of the sales to dealers, interest is primarily charged to dealers on outstanding balances, from the earlier of the date when goods are sold to retail customers by the dealer or the expiration of certain interest-free periods granted at the time of the sale to the dealer, until payment is received by the Company. Dealers cannot cancel purchases after John Deere recognizes a sale and are responsible for payment even if the equipment is not sold to retail customers. The interest-free periods are determined based on the type of equipment sold and the time of year of the sale. These periods range from one to twelve months for most equipment. Interest-free periods may not be extended. Interest charged may not be forgiven and the past due interest rates exceed market rates. The Company receives compensation from John Deere at approximate market interest rates for these interest-free periods. The Company computes the compensation from John Deere for interest-free periods based on the Companys estimated funding costs, administrative and operating expenses, credit losses, and required return on equity. During 2022, 2021, and 2020, the compensation earned from John Deere on wholesale receivables for waiver of finance charges or reduced rates was $239.0 million, $197.9 million, and $228.8 million, respectively.\nFinancing Leases\nThe Company leases agriculture and turf equipment and construction and forestry equipment directly to retail customers. Leases classified as sales-type or direct financing leases are reported in financing leases on the consolidated balance sheets. See Note 6 to the Consolidated Financial Statements for detailed disclosures related to financing leases.\nConcentration of Credit Risk\nReceivables have significant concentrations of credit risk in the agriculture and turf and construction and forestry markets. On a geographic basis, 86 percent of the Companys Receivables portfolio was located in the U.S., at October 30, 2022. There is not a disproportionate concentration of credit risk with any single customer or dealer. The Company secures its Receivables, other than certain revolving charge accounts, by retaining as collateral security in the equipment associated with those Receivables or with the use of other collateral, and requires theft and physical damage insurance on such equipment.\nNote 4. Allowance for Credit Losses and Credit Quality of Receivables\nCredit Quality\nThe Company monitors the credit quality of Receivables based on delinquency status. Past due balances of Receivables still accruing finance income represent the total balance held (principal plus accrued interest) with any payment amounts 30 days or more past the contractual payment due date. Non-performing Receivables represent receivables for which the Company has ceased accruing finance income. Generally, when retail notes, revolving charge accounts, and financing lease accounts are 90 days delinquent, accrual of finance income and lease revenue is suspended, and accrued finance income and lease revenue previously recognized is reversed. Generally, when a wholesale receivable becomes 60 days delinquent, the Company determines whether the accrual of finance income on interest-bearing wholesale receivables should be suspended and whether accrued finance income previously recognized should be reversed. During 2022 and 2021, $11.3 million and $12.4 million, respectively, of accrued finance income and lease revenue was reversed on non-performing Receivables. Finance income and lease revenue for non-performing Receivables is recognized on a cash basis. Accrual of finance income and lease revenue is resumed when the receivable becomes contractually current and collections are reasonably assured. During 2022 and 2021, finance income and lease revenue of $15.4 million and $17.1 million, respectively, was recognized from cash payments on non-performing Receivables.\nReceivable balances are written off to the allowance for credit losses when, in the judgment of management, they are considered uncollectible. Generally, when retail notes and financing lease accounts are 120 days delinquent, the collateral is repossessed or the account is designated for litigation, and the estimated uncollectible amount from the customer is written off to the allowance for credit losses. Revolving charge accounts are generally deemed to be uncollectible and written off to the allowance for credit losses when delinquency reaches 120 days. Generally, when a wholesale account becomes 60 days delinquent, the Company determines whether the collateral should be repossessed or the account designated for litigation, and the estimated uncollectible amount is written off to the allowance for credit losses.\nThe credit quality analysis of Customer Receivables by year of origination was as follows (in millions of dollars):\nOctober 30, 2022\nPrior Years\nRevolving Charge Accounts\nTotal\nCustomer Receivables:\nAgriculture and turf\nCurrent\n$\n11,764.5\n$\n6,958.0\n$\n3,488.7\n$\n1,519.7\n$\n582.8\n$\n153.2\n$\n4,022.7\n$\n28,489.6\n30-59 days past due\n40.1\n55.8\n31.4\n15.0\n6.4\n2.7\n18.4\n169.8\n60-89 days past due\n11.8\n19.5\n10.8\n4.4\n2.0\n1.1\n4.5\n54.1\n90+ days past due\n.4\n.2\n.2\n.8\nNon-performing\n24.7\n38.4\n29.2\n13.7\n11.2\n10.2\n7.8\n135.2\nConstruction and forestry\nCurrent\n2,373.7\n1,526.3\n658.1\n230.7\n57.2\n10.5\n107.7\n4,964.2\n30-59 days past due\n44.5\n40.6\n20.7\n7.6\n1.8\n.6\n3.1\n118.9\n60-89 days past due\n18.1\n11.4\n6.0\n3.0\n.7\n.1\n1.0\n40.3\n90+ days past due\n.3\n1.3\n1.4\n3.0\nNon-performing\n19.3\n51.2\n27.6\n15.4\n5.5\n2.9\n.6\n122.5\nTotal Customer Receivables\n$\n14,297.4\n$\n8,702.7\n$\n4,272.7\n$\n1,810.9\n$\n667.6\n$\n181.3\n$\n4,165.8\n$\n34,098.4\nOctober 31, 2021\nPrior Years\nRevolving Charge Accounts\nTotal\nCustomer Receivables:\nAgriculture and turf\nCurrent\n$\n11,318.1\n$\n5,719.1\n$\n2,842.5\n$\n1,431.0\n$\n582.8\n$\n119.9\n$\n3,620.9\n$\n25,634.3\n30-59 days past due\n34.7\n47.5\n24.2\n13.7\n5.9\n2.9\n13.1\n142.0\n60-89 days past due\n12.8\n17.4\n8.4\n5.1\n2.4\n.7\n3.2\n50.0\n90+ days past due\n.5\n.5\n.1\n.2\n.1\n1.4\nNon-performing\n20.1\n44.5\n26.4\n22.3\n10.6\n12.5\n6.4\n142.8\nConstruction and forestry\nCurrent\n2,356.4\n1,198.5\n573.5\n215.6\n42.5\n5.4\n92.3\n4,484.2\n30-59 days past due\n36.6\n33.0\n21.1\n5.8\n2.0\n.1\n2.7\n101.3\n60-89 days past due\n12.5\n8.4\n5.0\n2.6\n.5\n.2\n1.0\n30.2\n90+ days past due\n.1\n.4\n.9\n.1\n1.5\nNon-performing\n21.9\n50.0\n33.9\n15.1\n6.3\n2.9\n.5\n130.6\nTotal Customer Receivables\n$\n13,813.7\n$\n7,119.3\n$\n3,536.0\n$\n1,711.4\n$\n653.2\n$\n144.6\n$\n3,740.1\n$\n30,718.3\nThe credit quality analysis of wholesale receivables by year of origination was as follows (in millions of dollars):\nOctober 30, 2022\nPrior Years\nRevolving\nTotal\nWholesale receivables:\nAgriculture and turf\nCurrent\n$\n381.3\n$\n62.7\n$\n25.0\n$\n3.8\n$\n.3\n$\n1.1\n$\n6,238.1\n$\n6,712.3\n30+ days past due\n.1\n8.3\n8.4\nNon-performing\n5.5\n5.5\nConstruction and forestry\nCurrent\n4.8\n28.2\n1.4\n.4\n.1\n1,633.8\n1,668.7\n30+ days past due\n9.6\n9.6\nNon-performing\nTotal wholesale receivables\n$\n386.1\n$\n91.0\n$\n26.4\n$\n4.2\n$\n.4\n$\n1.1\n$\n7,895.3\n$\n8,404.5\nOctober 31, 2021\nPrior Years\nRevolving\nTotal\nWholesale receivables:\nAgriculture and turf\nCurrent\n$\n339.6\n$\n77.1\n$\n21.1\n$\n9.2\n$\n2.7\n$\n.4\n$\n4,233.4\n$\n4,683.5\n30+ days past due\n12.0\n12.0\nNon-performing\n6.7\n6.7\nConstruction and forestry\nCurrent\n39.4\n4.0\n3.4\n.3\n1,199.6\n1,246.7\n30+ days past due\n2.4\n2.4\nNon-performing\nTotal wholesale receivables\n$\n379.0\n$\n81.1\n$\n24.5\n$\n9.5\n$\n2.7\n$\n.4\n$\n5,454.1\n$\n5,951.3\nAllowance for Credit Losses\nThe allowance for credit losses is an estimate of the credit losses expected over the life of the Companys Receivable portfolio. The Company measures expected credit losses on a collective basis when similar risk characteristics exist. Risk characteristics considered by the Company include product category, market, geography, credit risk, and remaining duration. Receivables that do not share risk characteristics with other receivables in the portfolio are evaluated on an individual basis. Non-performing Receivables are included in the estimate of expected credit losses.\nThe Company utilizes loss forecast models, which are selected based on the size and credit risk of the underlying pool of receivables, to estimate expected credit losses. Transition matrix models are used for large and complex Customer Receivable pools, while WARM models are used for smaller and less complex Customer Receivable pools. Transition matrix models, which are used for the majority of the Customer Receivables, estimate credit losses using historical delinquency and default information to assign probabilities that a receivable will pay as contractually scheduled or become delinquent and advance through the various delinquency stages. The model simulates the runoff of the portfolio, month-by-month, over the life of the receivables until the balances are fully repaid or default, using roll rates applied to the outstanding portfolio. The roll rates are applied based on the delinquency status of the customer accounts and are further segmented based on the credit risk and remaining duration of the underlying receivables. Estimated recovery rates are applied to the balance at default to calculate the expected credit losses. The modeled expected credit losses are adjusted based on reasonable and supportable forecasts, which may include economic indicators such as commodity prices, industry equipment sales, unemployment rates, and housing starts. The WARM models apply historical average annual loss rates, adjusted for current and forecasted economic conditions, to the projected portfolio runoff. Expected credit losses on wholesale receivables are based on historical loss rates, with consideration of current economic conditions and dealer financial risk, along with reasonable and supportable forecasts. Management reviews each models output quarterly, and qualitative adjustments are incorporated as necessary.\nRecoveries from freestanding credit enhancements, such as dealer deposits and certain credit insurance contracts, are not included in the estimate of expected credit losses. Recoveries from dealer deposits are recognized in other income on the statements of consolidated income when the dealers withholding account is charged. During 2022 and 2021, $8.5 million and $14.3 million, respectively, was recorded in other income related to recoveries from freestanding credit enhancements. Prior to the adoption of ASU No. 2016-13, the benefit of credit losses recovered from freestanding credit enhancements was recognized in the provision for credit losses based on estimated recoveries. At October 30, 2022 and October 31, 2021, the Company had $132.7 million and $128.8 million, respectively, of deposits withheld from John Deere dealers and merchants available as credit enhancements for retail notes and financing leases.\nAn analysis of the allowance for credit losses and investment in Receivables at October 30, 2022, October 31, 2021, and November 1, 2020 was as follows (in millions of dollars):\nRetail Notes\nRevolving\n& Financing\nCharge\nWholesale\nTotal\nLeases\nAccounts\nReceivables\nReceivables\nAllowance:\nBeginning of year balance\n$\n96.5\n$\n20.8\n$\n11.7\n$\n129.0\nProvision (credit) for credit losses*\n26.1\n(1.8)\n.1\n24.4\nWrite-offs\n(40.7)\n(26.8)\n(.3)\n(67.8)\nRecoveries\n14.4\n29.7\n.1\n44.2\nTranslation adjustments\n(.9)\n(.5)\n(1.4)\nEnd of year balance\n$\n95.4\n$\n21.9\n$\n11.1\n$\n128.4\nReceivables:\nEnd of year balance\n$\n29,932.6\n$\n4,165.8\n$\n8,404.5\n$\n42,502.9\nAllowance:\nBeginning of year balance\n$\n76.9\n$\n42.3\n$\n9.9\n$\n129.1\nASU No. 2016-13 adoption\n32.5\n(12.2)\n(.6)\n19.7\nProvision (credit) for credit losses*\n11.8\n(17.0)\n2.5\n(2.7)\nWrite-offs\n(36.7)\n(27.8)\n(.3)\n(64.8)\nRecoveries\n11.6\n35.5\n47.1\nTranslation adjustments\n.4\n.2\n.6\nEnd of year balance\n$\n96.5\n$\n20.8\n$\n11.7\n$\n129.0\nReceivables:\nEnd of year balance\n$\n26,978.2\n$\n3,740.1\n$\n5,951.3\n$\n36,669.6\nAllowance:\nBeginning of year balance\n$\n53.7\n$\n39.3\n$\n7.6\n$\n100.6\nProvision (credit) for credit losses\n66.2\n25.1\n(1.9)\n89.4\nWrite-offs\n(49.1)\n(51.6)\n(.9)\n(101.6)\nRecoveries\n6.4\n29.5\n1.3\n37.2\nTranslation adjustments\n(.3)\n3.8\n3.5\nEnd of year balance\n$\n76.9\n$\n42.3\n$\n9.9\n$\n129.1\nReceivables:\nEnd of year balance\n$\n22,636.6\n$\n3,827.4\n$\n7,093.3\n$\n33,557.3\n* Excludes provision (credit) for credit losses on unfunded commitments of $(.9) million and $1.8 million for the years ended October 30, 2022 and October 31, 2021, respectively. The estimated credit losses related to unfunded commitments are recorded in accounts payable and accrued expenses on the consolidated balance sheets.\nThe allowance for credit losses was relatively flat in 2022 compared to 2021. Continued positive agricultural market conditions are having favorable impacts on the allowance, offsetting increases in the allowance due to higher portfolio balances. Strong recovery rates, driven by higher prices on used equipment inventory, are also benefiting the allowance for credit losses. As part of the allowance setting process, the Company continues to monitor the economy, including potential impacts of inflation and interest rates, among other factors, and qualitative adjustments to the allowance are incorporated, as necessary.\nTroubled Debt Restructuring\nA troubled debt restructuring is a significant modification of debt in which a creditor grants a concession it would not otherwise consider to a debtor that is experiencing financial difficulties. These modifications may include a reduction of the stated interest rate, an extension of the maturity date, a reduction of the face amount or maturity amount of the debt, or a reduction of accrued interest. The following table includes Receivable contracts identified as troubled debt restructurings, which were primarily retail notes (in millions of dollars):\nNumber of receivable contracts\nPre-modification balance\n$\n7.0\n$\n12.0\n$\n19.0\nPost-modification balance\n5.8\n10.7\n17.4\nShort-term payment relief provided related to COVID (primarily granted in 2020) did not meet the definition of a troubled debt restructuring. In 2022, 2021, and 2020, there were no significant troubled debt restructurings that subsequently defaulted and were written off. At October 30, 2022, the Company had no commitments to provide additional financing to customers whose accounts were modified in troubled debt restructurings.\nWrite-offs\nTotal write-offs and recoveries, by product, and as a percentage of average balances held during the year, were as follows (in millions of dollars):\nDollars\nPercent\nDollars\nPercent\nDollars\nPercent\nWrite-offs:\nRetail notes & financing leases:\nAgriculture and turf\n$\n(21.4)\n(.09)\n%\n$\n(18.6)\n(.09)\n%\n$\n(15.2)\n(.09)\n%\nConstruction and forestry\n(19.3)\n(.39)\n(18.1)\n(.42)\n(33.9)\n(.94)\nTotal retail notes & financing leases\n(40.7)\n(.15)\n(36.7)\n(.15)\n(49.1)\n(.24)\nRevolving charge accounts\n(26.8)\n(.77)\n(27.8)\n(.85)\n(51.6)\n(1.51)\nWholesale receivables\n(.3)\n(.3)\n(.9)\n(.01)\nTotal write-offs\n(67.8)\n(.18)\n(64.8)\n(.19)\n(101.6)\n(.31)\nRecoveries:\nRetail notes & financing leases:\nAgriculture and turf\n10.2\n.05\n9.2\n.05\n4.6\n.03\nConstruction and forestry\n4.2\n.09\n2.4\n.06\n1.8\n.05\nTotal retail notes & financing leases\n14.4\n.05\n11.6\n.05\n6.4\n.03\nRevolving charge accounts\n29.7\n.86\n35.5\n1.08\n29.5\n.86\nWholesale receivables\n.1\n1.3\n.02\nTotal recoveries\n44.2\n.12\n47.1\n.14\n37.2\n.11\nTotal net write-offs\n$\n(23.6)\n(.06)\n%\n$\n(17.7)\n(.05)\n%\n$\n(64.4)\n(.20)\n%\nNote 5. Securitization of Receivables\nAs a part of its overall funding strategy, the Company periodically transfers certain Receivables (retail notes) into VIEs that are SPEs, or non-VIE banking operations, as part of its asset-backed securities programs (securitizations). The structure of these transactions is such that the transfer of the retail notes does not meet the accounting criteria for sales of receivables, and is, therefore, accounted for as a secured borrowing. SPEs utilized in securitizations of retail notes differ from other entities included in the Companys consolidated statements because the assets they hold are legally isolated. Use of the assets held by the SPEs or the non-VIEs is restricted by terms of the documents governing the securitization transactions.\nIn these securitizations, the retail notes are transferred to certain SPEs, which in turn issue debt to investors, or to non-VIE banking operations, which provide funding directly to the Company. The funding provided by these third parties result in secured borrowings, which are recorded as Securitization borrowings on the consolidated balance sheets. The securitized retail notes are recorded as Retail notes securitized on the consolidated balance sheets. The total restricted assets on the consolidated balance sheets related to these securitizations include the retail notes securitized, less an allowance for credit losses, and other assets primarily representing restricted cash. Restricted cash results from contractual requirements in securitized borrowing arrangements and serves as a credit enhancement. The restricted cash is used to satisfy payment deficiencies, if any, in the required payments on secured borrowings. The balance of restricted cash is contractually stipulated and is either a fixed amount as determined by the initial balance of the retail notes securitized or a fixed percentage of the outstanding balance of the retail notes securitized. The restriction is removed either after all secured borrowing payments are made or proportionally as these receivables are collected and borrowing obligations reduced. For those securitizations in which retail notes are transferred into SPEs, the SPEs supporting the secured borrowings are consolidated unless the Company does not have both the power to direct the activities that most significantly impact the SPEs economic performance and the obligation to absorb losses or the right to receive benefits that could potentially be significant to the SPEs. No additional support to these SPEs beyond what was previously contractually required has been provided during the reporting periods.\nIn certain securitizations, the Company consolidates the SPEs since it has both the power to direct the activities that most significantly impact the SPEs economic performance through its role as servicer of all the Receivables held by the SPEs, and the obligation through variable interests in the SPEs to absorb losses or receive benefits that could potentially be significant to the SPEs. The restricted assets (retail notes securitized, allowance for credit losses, and other assets) of the consolidated SPEs totaled $5,037.6 million and $3,093.6 million at October 30, 2022 and October 31, 2021, respectively. The liabilities (securitization borrowings and accrued interest) of these SPEs totaled $4,767.9 million and $3,024.0 million at October 30, 2022 and October 31, 2021, respectively. The credit holders of these SPEs do not have legal recourse to the Companys general credit.\nThe Company has a revolving warehouse facility to utilize bank conduit facilities to securitize retail notes, described further in the following paragraphs. At October 30, 2022, the facility had a total capacity, or financing limit, of up to $1,000.0 million of secured financings at any time. The agreement was renewed in November 2022 with an expiration in November 2023 and a capacity of $1,500.0 million.\nThrough the revolving warehouse facility, the Company transfers retail notes into bank-sponsored, multi-seller, commercial paper conduits, which are SPEs that are not consolidated. The Company does not service a significant portion of the conduits receivables, and therefore, does not have the power to direct the activities that most significantly impact the conduits economic performance. These conduits provide a funding source to the Company (as well as other transferors into the conduit) as they fund the retail notes through the issuance of commercial paper. The Companys carrying values and variable interest related to these conduits were restricted assets (retail notes securitized, allowance for credit losses, and other assets) of $842.8 million and $1,175.8 million at October 30, 2022 and October 31, 2021, respectively. The liabilities (securitization borrowings and accrued interest) related to these conduits were $759.3 million and $1,112.8 million at October 30, 2022 and October 31, 2021, respectively.\nThe Companys carrying amount of the liabilities to the unconsolidated conduits, compared to the maximum exposure to loss related to these conduits, which would only be incurred in the event of a complete loss on the restricted assets at October 30, 2022 was as follows (in millions of dollars):\nCarrying value of liabilities\n$\n759.3\nMaximum exposure to loss\n842.8\nThe total assets of the unconsolidated conduits related to securitizations were approximately $18 billion at October 30, 2022.\nIn addition, through the revolving warehouse facility, the Company transfers retail notes to banks, which may elect to fund the retail notes through the use of their own funding sources. These non-VIE banking operations are not consolidated since the Company does not have a controlling interest in them. The Companys carrying values and interests related to the securitizations with the unconsolidated non-VIEs were restricted assets (retail notes securitized, allowance\nfor credit losses, and other assets) of $210.7 million and $486.1 million at October 30, 2022 and October 31, 2021, respectively. The liabilities (securitization borrowings and accrued interest) were $189.8 million and $460.1 million at October 30, 2022 and October 31, 2021, respectively.\nThe components of consolidated restricted assets, secured borrowings, and other liabilities related to secured borrowings in securitization transactions at October 30, 2022 and October 31, 2021 were as follows (in millions of dollars):\nRetail notes securitized\n$\n5,951.6\n$\n4,662.4\nAllowance for credit losses\n(15.7)\n(13.5)\nOther assets (primarily restricted cash)\n155.2\n106.6\nTotal restricted securitized assets\n$\n6,091.1\n$\n4,755.5\nSecuritization borrowings\n$\n5,710.9\n$\n4,595.2\nAccrued interest on borrowings\n6.1\n1.7\nTotal liabilities related to restricted securitized assets\n$\n5,717.0\n$\n4,596.9\nSecuritization borrowings are presented net of debt acquisition costs. The secured borrowings related to these restricted securitized retail notes are obligations that are payable as the retail notes are liquidated. Repayment of the secured borrowings depends on cash flows generated by the restricted assets. Depending on the Companys ability to obtain and meet certain pre-established credit rating criteria, cash collections from these restricted assets are required to be placed into a segregated collection account either on a daily basis or immediately prior to the time payment is required to the secured creditors. At October 30, 2022, the maximum remaining term of all restricted securitized retail notes was approximately seven years.\nAlthough these securitization borrowings are classified as short-term since payment is required if the retail notes are liquidated early, the expected payment schedule for these borrowings at October 30, 2022 based on the expected liquidation of the retail notes in millions of dollars is as follows: 2023 - $2,702.7, 2024 - $1,662.0, 2025 - $955.3, 2026 - $373.2, 2027 - $24.9, and later years - $2.8.\nNote 6. Leases\nThe Company leases John Deere equipment and a limited amount of non-John Deere equipment to retail customers through sales-type, direct financing, and operating leases. Sales-type and direct financing leases are reported in financing leases on the consolidated balance sheets. Operating leases are reported in equipment on operating leases - net on the consolidated balance sheets.\nInitial lease terms generally range from less than one year to seven years. Leases offered by the Company may include early termination and renewal options. At the end of a lease, the lessee generally has the option to purchase the underlying equipment for a fixed price or return it to the dealer. If the equipment is returned to the dealer, the dealer also has the option to purchase the equipment or return it to the Company for remarketing.\nThe Company has elected to combine lease and nonlease components. The nonlease components primarily relate to preventative maintenance and extended warranty agreements financed by the customer. The Company has also elected to report consideration related to sales and value-added taxes net of the related tax expense. Property taxes on leased assets are recorded on a gross basis in lease revenues and administrative and operating expenses on the statements of consolidated income. Variable lease revenues primarily relate to separately invoiced property taxes on leased equipment in certain markets, late fees, and excess use and damage fees.\nLease revenues earned by the Company were as follows (in millions of dollars):\nSales-type and direct financing lease revenues\n$\n56.6\n$\n48.6\n$\n46.0\nOperating lease revenues\n879.9\n953.0\n1,022.5\nVariable lease revenues\n23.4\n26.9\n28.6\nTotal lease revenues\n$\n959.9\n$\n1,028.5\n$\n1,097.1\nVariable lease revenues reported above include excess use and damage fees of $2.4 million, $6.5 million, and $8.2 million for 2022, 2021, and 2020, respectively, which were reported in other income on the statements of consolidated income.\nDeposits withheld from John Deere dealers and related credit losses on leases are handled in a manner similar to the procedures for retail notes. As with retail notes, there are generally no deposits withheld from dealers on leases related to construction and forestry equipment. In addition, a lease payment discount program, allowing reduced payments over the term of the lease, is administered in a manner similar to finance waivers on retail notes (see Note 3). During 2022, 2021, and 2020, the finance income earned from John Deere on sales-type and direct financing leases containing waiver of finance charges or reduced rates was $3.9 million, $3.7 million, and $3.3 million, respectively. The operating lease revenue earned from John Deere during 2022, 2021, and 2020 was $30.0 million, $47.1 million, and $57.2 million, respectively.\nFinancing Leases\nSales-type and direct financing lease receivables by market at October 30, 2022 and October 31, 2021 were as follows (in millions of dollars):\nAgriculture and turf\n$\n570.2\n$\n500.8\nConstruction and forestry\n183.7\n168.2\nTotal\n753.9\n669.0\nGuaranteed residual values\n466.5\n359.7\nUnguaranteed residual values\n25.9\n33.7\nUnearned finance income\n(125.6)\n(90.1)\nFinancing leases receivable\n$\n1,120.7\n$\n972.3\nAt the time of accepting a lease that qualifies as a sales-type or direct financing lease, the Company records the gross amount of lease payments receivable, estimated residual value of the leased equipment, and unearned finance income. The unearned finance income is recognized as revenue over the lease term using the interest method.\nScheduled payments, including guaranteed residual values, on sales-type and direct financing lease receivables at October 30, 2022 were as follows (in millions of dollars):\nDue in:\n$\n662.9\n279.8\n148.2\n76.8\n41.4\nLater years\n11.3\nTotal\n$\n1,220.4\nOperating Leases\nThe cost of equipment on operating leases by market at October 30, 2022 and October 31, 2021 was as follows (in millions of dollars):\nAgriculture and turf\n$\n5,017.3\n$\n5,053.4\nConstruction and forestry\n1,138.0\n1,323.6\nTotal\n6,155.3\n6,377.0\nAccumulated depreciation\n(1,301.8)\n(1,429.4)\nEquipment on operating leases - net\n$\n4,853.5\n$\n4,947.6\nLease payments from equipment on operating leases are recorded as income on a straight-line method over the lease term. Operating lease assets are recorded at cost and depreciated to their estimated residual value on a straight-line method over the term of the leases. Lease agreements include usage limits and specifications on machine condition, which allow the Company to assess lessees for excess use or damages to the underlying equipment.\nLease payments for equipment on operating leases at October 30, 2022 were scheduled as follows (in millions of dollars):\nDue in:\n$\n677.1\n474.7\n273.0\n133.8\n29.1\nLater years\n5.0\nTotal\n$\n1,592.7\nThe Company estimates the residual values for operating leases at lease inception based on several factors, including lease term, expected hours of usage, historical wholesale sale prices, return experience, intended use of the equipment, market dynamics and trends, and third-party residual guarantees. The Company reviews residual value estimates during the lease term and tests the carrying value of its operating lease assets for impairment when events or circumstances necessitate. Depreciation is adjusted prospectively on a straight-line basis over the remaining lease term if residual value estimates are revised. Operating lease impairments are recorded in administrative and operating expenses on the statements of consolidated income. There were no impairment losses on operating leases recorded during 2022 or 2021. During 2020, the Company recorded impairment losses on operating leases of $21.0 million due to higher expected return rates and lower estimated values of used construction equipment.\nThe total operating lease residual values at October 30, 2022 and October 31, 2021 were $3,366.7 million and $3,547.6 million, respectively. For operating lease originations effective after January 2020, John Deere dealers generally provide a first-loss residual value guarantee. The total first-loss residual value guarantees were $440.7 million and $295.8 million at October 30, 2022 and October 31, 2021, respectively.\nThe Company discusses with lessees and dealers options to purchase the equipment or extend the lease prior to operating lease maturity. Equipment returned to the Company upon termination of leases is remarketed by the Company. The matured operating lease inventory balances at October 30, 2022 and October 31, 2021 were $10.8 million and $25.4 million, respectively. Matured operating lease inventory is reported in other assets on the consolidated balance sheets. During 2020, the Company recorded impairment losses on matured operating lease inventory of $9.8 million due to lower estimated values of used construction equipment. There were no impairment losses on matured operating lease inventory in 2022 or 2021. Impairment losses on matured operating lease inventory are included in administrative and operating expenses on the statements of consolidated income.\nPast due balances of operating leases represent the total balance held (net book value plus accrued lease payments) and still accruing finance income with any payment amounts 30 days or more past the contractual payment due date. These amounts were $58.7 million and $53.9 million at October 30, 2022 and October 31, 2021, respectively.\nNote 7. Notes Receivable from and Payable to John Deere\nThe Company provides loans to and holds other receivables from affiliated companies. The loan agreements mature over the next seven years and charge interest at competitive market interest rates. Interest earned from John Deere was $16.9 million, $15.4 million, and $16.6 million in 2022, 2021, and 2020, respectively, which is recorded in other income.\nThe Company had notes receivable from John Deere at October 30, 2022 and October 31, 2021 with the following affiliated companies as follows (in millions of dollars):\nLimited Liability Company John Deere Financial\n$\n233.7\nBanco John Deere S.A.\n$\n370.0\n159.8\nJohn Deere Agricultural Holdings, Inc.\n.7\nTotal Notes Receivable from John Deere\n$\n370.7\n$\n393.5\nLimited Liability Company John Deere Financial (JDF Russia) is a John Deere financial services affiliate in Russia. The Company previously provided ruble-denominated loans to JDF Russia to fund JDF Russias retail portfolio. The Company had entered into non-designated cross-currency interest rate contracts and foreign currency exchange contracts to hedge against interest rate and foreign currency exchange risk associated with the loans. In April 2022, the loans to JDF Russia and related derivative contracts were assumed by Deere & Company for cash at carrying value as of the date of assumption.\nJohn Deere Agricultural Holdings, Inc. (JDAH) is a John Deere equipment operations affiliate in Russia. Historically, the Company purchased wholesale receivables from this affiliate related to independent John Deere dealers in Russia. The affiliate receivable from JDAH represents cash collections on the Russia wholesale portfolio that have not yet been remitted to the Company. The remaining outstanding wholesale portfolio in Russia held by the Company was $4.4 million at October 30, 2022. On February 24, 2022, John Deere suspended shipments of machines and service parts to Russia, and currently requires prepayment of existing equipment inventory in Russia, and, as such, no further wholesale receivables are being purchased by the Company.\nThe Company also obtains funding from affiliated companies. At October 30, 2022 and October 31, 2021, the Company had notes payable to John Deere of $5,225.5 million and $5,619.4 million, respectively. The intercompany borrowings are primarily short-term in nature or contain a due on demand call option. At October 30, 2022, $498.2 million of the intercompany borrowings were long-term loans without a due on demand call option, which mature in 2024. The Company pays interest to John Deere for these borrowings based on competitive market rates. The weighted-average interest rates on total intercompany borrowings at October 30, 2022 and October 31, 2021 were 3.3 percent and 1.2 percent, respectively. Interest expense paid to John Deere was $86.8 million, $53.0 million, and $18.1 million in 2022, 2021, and 2020, respectively, which is recorded in fees and interest paid to John Deere.\nNote 8. Short-Term External Borrowings\nShort-term external borrowings of the Company at October 30, 2022 and October 31, 2021 consisted of the following (in millions of dollars):\nCommercial paper and other notes payable\n$\n2,402.3\n$\n678.9\nSecuritization borrowings\n5,710.9\n4,595.2\nCurrent maturities of long-term external borrowings *\n5,989.6\n5,819.1\nTotal\n$\n14,102.8\n$\n11,093.2\n* Includes unamortized fair value adjustments related to interest rate swaps.\nThe weighted-average interest rates on total short-term external borrowings, excluding current maturities of long-term external borrowings, at October 30, 2022 and October 31, 2021, were 3.1 percent and .8 percent, respectively.\nLines of credit available from U.S. and foreign banks were $8,089.2 million at October 30, 2022. Some of these credit lines are available to both the Company and Deere & Company. At October 30, 2022, $3,283.9 million of these worldwide lines of credit were unused. For the purpose of computing the unused credit lines, commercial paper and short-term bank borrowings of the Company and John Deere, excluding secured borrowings and the current portion of long-term external borrowings, were considered to constitute utilization. Included in the total credit lines at October 30, 2022 was a 364-day credit facility agreement of $3,000.0 million, expiring in the second quarter of 2023. In addition, total credit lines included long-term credit facility agreements of $2,500.0 million, expiring in the second quarter of 2026, and $2,500.0 million, expiring in the second quarter of 2027. The agreements are mutually extendable, and the annual facility fees are not significant. In October 2022, the Company amended these credit agreements with pricing adjustments tied to John Deeres Leap Ambitions framework. Failure by John Deere to meet certain Scope 1 and 2 emissions targets or engaged acres goals will result in a maximum 6 basis-point penalty rate, while exceeding certain thresholds on the same metrics will result in a similar favorable rate adjustment.\nThese credit agreements require the Company to maintain its consolidated ratio of earnings to fixed charges at not less than 1.05 to 1 for each fiscal quarter and its ratio of senior debt to capital base (total subordinated debt and stockholders equity excluding accumulated other comprehensive income (loss)) at not more than 11 to 1 at the end of any fiscal quarter. Senior debt consists of the Companys total interest-bearing obligations, excluding subordinated debt and securitization indebtedness, but including notes payable to John Deere. All of these credit agreement requirements have been met during the periods included in the consolidated financial statements. The facility fees on these lines of credit are divided between Deere & Company and the Company based on the proportion of their respective forecasted liquidity requirements.\nDeere & Company has an agreement with Capital Corporation pursuant to which it has agreed to continue to own, directly or through one or more wholly-owned subsidiaries, at least 51 percent of the voting shares of capital stock of Capital Corporation and to maintain the Companys consolidated tangible net worth at not less than $50.0 million. This agreement also obligates Deere & Company to make payments to Capital Corporation such that its consolidated ratio of earnings to fixed charges is not less than 1.05 to 1 for each fiscal quarter. Deere & Companys obligations to make payments to Capital Corporation under the agreement are independent of whether the Company is in default on its indebtedness, obligations, or other liabilities. Further, Deere & Companys obligations under the agreement are not measured by the amount of the Companys indebtedness, obligations, or other liabilities. Deere & Companys obligations to make payments under this agreement are expressly stated not to be a guarantee of any specific indebtedness, obligation, or liability of the Company and are enforceable only by or in the name of Capital Corporation. No payments were required under this agreement during the periods included in the consolidated financial statements. At October 30, 2022, Deere & Company indirectly owned 100 percent of the voting shares of Capital Corporations capital stock and Capital Corporations consolidated tangible net worth was $4,803.4 million.\nNote 9. Long-Term External Borrowings\nLong-term external borrowings of the Company at October 30, 2022 and October 31, 2021 consisted of the following (in millions of dollars):\nSenior Debt:\nMedium-term notes\n$\n22,595.4\n$\n20,649.2\nOther notes\n2.5\n15.6\nTotal senior debt\n22,597.9\n20,664.8\nUnamortized debt discount and debt issuance costs\n(70.1)\n(57.5)\nTotal\n$\n22,527.8\n$\n20,607.3\nMedium-term notes are primarily offered by prospectus and issued at fixed and variable rates. The medium-term notes in the table above include unamortized fair value adjustments related to interest rate swaps. The weighted-average interest rate of medium-term notes at October 30, 2022 and October 31, 2021 was 2.9 percent and 1.1 percent, respectively. The principal balances of the medium-term notes were $23,564.6 million and $20,378.2 million at October 30, 2022 and October 31, 2021, respectively, and have serial maturity dates through 2032. The principal amounts of medium-term notes maturing in each of the next five years, in millions of dollars, are as follows: 2023 - $5,976.3, 2024 - $6,050.7,\n2025 - $5,268.5, 2026 - $3,397.8, and 2027 - $2,900.0. All outstanding medium-term notes and other notes in the table above are senior unsecured borrowings and generally rank equally with each other.\nIn April 2022, the Company issued $600.0 million of sustainability-linked medium-term notes with an initial interest rate of 3.35 percent, which are due in 2029. This transaction supports John Deeres commitment to environmental sustainability. Failure to meet the stated sustainability performance target would result in a 25-basis point increase to the interest rate payable on the 2029 notes from and including April 2026.\nNote 10. Capital Stock\nAll of Capital Corporations common stock is owned by JDFS, a wholly-owned finance holding subsidiary of Deere & Company. No shares of common stock of Capital Corporation were reserved for officers or employees or for options, warrants, conversions, or other rights at October 30, 2022 or October 31, 2021. At October 30, 2022 and October 31, 2021, Capital Corporation had authorized, but not issued, 10,000 shares of $1 par value preferred stock.\nNote 11. Dividends\nIn 2022, 2021, and 2020, Capital Corporation declared and paid cash dividends of $370.0 million, $485.0 million, and $275.0 million, respectively, to JDFS. In each case, JDFS paid comparable dividends to Deere & Company.\nNote 12. Pension and Other Postretirement Benefits\nThe Company is a participating employer in certain Deere & Company sponsored defined benefit pension plans for employees in the U.S. and certain defined benefit pension plans outside the U.S. These pension plans provide for benefits that are based primarily on years of service and employee compensation. Pension expense is actuarially determined based on the Companys employees included in the plan. The Companys pension expense was not significant in 2022, 2021, or 2020. The accumulated benefit obligation and plan net assets for the employees of the Company are not determined separately from Deere & Company. The Companys U.S. salaried pension plan will be closed to new entrants effective January 1, 2023. Certain participants will have the opportunity to make a one-time election in 2023 to freeze their defined benefit pension plan benefit for an enhanced defined contribution benefit.\nThe Company provides defined benefit health care and life insurance plans for certain retired employees in the U.S. as a participating employer in Deere & Companys sponsored plans. Health care and life insurance benefits expense is actuarially determined based on the Companys employees included in the plans and amounted to $6.0 million in 2022, $6.1 million in 2021, and $12.3 million in 2020. The decrease in 2021 from 2020 was primarily due to curtailment losses of $5.5 million in 2020 related to voluntary employee-separation programs (see Note 21). Further disclosure for these plans is included in the notes to the Deere & Company Annual Report on Form 10-K for the year ended October 30, 2022 (the Deere & Company 2022 Form 10-K).\nThe Company is a participating employer in certain Deere & Company sponsored defined contribution plans related to employee investment and savings plans primarily in the U.S. The Companys contributions and costs under these plans were $13.8 million in 2022, $11.8 million in 2021, and $10.7 million in 2020. The contribution rate varies primarily based on Deere & Companys performance in the prior year and employee participation in the plans.\nNote 13. Stock Option and Restricted Stock Unit Awards\nCertain employees of the Company participate in Deere & Company share-based compensation plans. During 2022, 2021, and 2020, the total share-based compensation expense was $6.4 million, $6.3 million, and $6.2 million, respectively, with an income tax benefit recognized in net income of $1.5 million, $1.5 million, and $1.4 million, respectively. Further disclosure for these plans is included in the notes to the Deere & Company 2022 Form 10-K.\nNote 14. Income Taxes\nThe provision for income taxes by taxing jurisdiction and by significant component consisted of the following (in millions of dollars):\nCurrent:\nU.S.:\nFederal\n$\n200.9\n$\n231.4\n$\n273.2\nState\n10.8\n15.2\n9.0\nForeign\n29.3\n37.2\n27.5\nTotal current\n241.0\n283.8\n309.7\nDeferred:\nU.S.:\nFederal\n(46.5)\n(69.7)\n(179.1)\nState\n3.5\n2.2\n(4.1)\nForeign\n11.0\n(15.8)\n7.6\nTotal deferred\n(32.0)\n(83.3)\n(175.6)\nProvision for income taxes\n$\n209.0\n$\n200.5\n$\n134.1\nThe taxable income of the Company is included in the consolidated U.S. income tax return of Deere & Company. Under a tax sharing agreement with Deere & Company, the Companys provision for income taxes is generally recorded as if Capital Corporation and each of its subsidiaries filed separate income tax returns, with a modification for realizability of certain tax benefits. The difference between the provision for income taxes recorded by the Company and the provision for income taxes calculated on an unmodified, separate return basis was not material in 2022, 2021, or 2020.\nThe amounts due from (payable to) Deere & Company under the tax sharing agreement at October 30, 2022 and October 31, 2021 were $6.3 million and $(9.6) million, respectively. The tax sharing receivable is included in other receivables and the payable is included in accounts payable and accrued expenses on the consolidated balance sheets.\nA comparison of the statutory and effective income tax provision and reasons for related differences follows (in millions of dollars):\nU.S. federal income tax provision at a statutory rate (21 percent)\n$\n190.8\n$\n190.8\n$\n116.9\nIncrease (decrease) resulting from:\nTax rates on foreign earnings\n6.0\n5.5\n5.8\nState and local income taxes, net of federal income tax benefit\n11.3\n13.7\n3.8\nOther - net\n.9\n(9.5)\n7.6\nProvision for income taxes\n$\n209.0\n$\n200.5\n$\n134.1\nAt October 30, 2022, accumulated earnings of $66.5 million in certain subsidiaries outside the U.S. are expected to remain indefinitely reinvested outside of the U.S. As such, a provision for foreign withholding taxes has not been made. Determination of the amount of foreign withholding tax liability on these unremitted earnings is not practicable.\nDeferred income taxes arise because there are certain items that are treated differently for financial accounting than for income tax reporting purposes. An analysis of deferred income tax assets and liabilities at October 30, 2022 and October 31, 2021 was as follows (in millions of dollars):\nDeferred\nDeferred\nDeferred\nDeferred\nTax\nTax\nTax\nTax\nAssets\nLiabilities\nAssets\nLiabilities\nLease transactions\n$\n262.5\n$\n310.4\nAccrual for retirement and other benefits\n$\n5.3\n$\n4.8\nAccrual for other employee benefits\n14.3\n15.9\nAllowance for credit losses\n32.6\n31.9\nNet unrealized gain on derivatives/investments\n26.5\n3.9\nTax loss and tax credit carryforwards\n11.6\n18.7\nFederal taxes on deferred state tax deductions\n7.8\n7.4\nMiscellaneous accruals and other\n13.7\n4.1\n17.5\n5.3\nLess valuation allowances\n(8.3)\n(9.0)\nDeferred income tax assets and liabilities\n$\n77.0\n$\n293.1\n$\n87.2\n$\n319.6\nAt October 30, 2022, tax loss and tax credit carryforwards of $11.6 million were available, with $10.9 million expiring from 2029 through 2038 and $.7 million with an indefinite carryforward period.\nA reconciliation of the total amounts of unrecognized tax benefits at October 30, 2022, October 31, 2021, and November 1, 2020 was as follows (in millions of dollars):\nBeginning of year balance\n$\n34.9\n$\n33.3\n$\n32.5\nIncreases to tax positions taken during the current year\n9.3\n11.2\n7.4\nIncreases to tax positions taken during prior years\n1.2\n1.4\n3.1\nDecreases to tax positions taken during prior years\n(6.1)\n(5.8)\n(4.9)\nDecreases due to lapse of statute of limitations\n(2.7)\n(3.7)\n(4.8)\nSettlements\n(.1)\n(1.5)\nEnd of year balance\n$\n36.5\n$\n34.9\n$\n33.3\nThe amount of unrecognized tax benefits at October 30, 2022 and October 31, 2021 that would impact the effective tax rate if the tax benefits were recognized was $25.2 million and $24.0 million, respectively. The remaining liability was related to tax positions for which there are offsetting tax receivables, or the uncertainty was only related to timing. The Company expects that any reasonably possible change in the amounts of unrecognized tax benefits in the next twelve months would not be significant.\nThe Company files its tax returns according to the tax laws of the jurisdictions in which it operates, which includes the U.S. federal jurisdiction, and various state and foreign jurisdictions. The Company is included in the consolidated U.S. income tax return and various state returns of Deere & Company. The U.S. Internal Revenue Service has completed the examination of Deere & Companys federal income tax returns for periods prior to 2015. The federal income tax returns for years 2015 to 2020 are currently under examination. Various state and foreign income tax returns also remain subject to examination by taxing authorities.\nThe Companys policy is to recognize interest related to income taxes in interest expense and other income, and recognize penalties in administrative and operating expenses. The amount of interest and penalties recognized was not significant for any of the periods presented. At October 30, 2022 and October 31, 2021, the liability for accrued interest and penalties totaled $12.8 million and $12.3 million, respectively.\nNote 15. Other Income and Administrative and Operating Expenses\nThe major components of other income and administrative and operating expenses were as follows (in millions of dollars):\nOther income\nFees and interest from John Deere\n$\n28.5\n$\n25.6\n$\n25.5\nExternal interest income\n8.6\n2.9\n13.8\nOperating lease disposition gains - net\n66.9\n65.0\nFreestanding credit enhancement recoveries *\n8.5\n14.3\nOther\n23.2\n13.7\n19.2\nTotal\n$\n135.7\n$\n121.5\n$\n58.5\nAdministrative and operating expenses\nCompensation and benefits\n$\n252.9\n$\n249.0\n$\n251.0\nOperating lease disposition losses - net and impairments\n53.6\nComputer processing and software\n55.8\n52.0\n47.2\nProperty taxes on leased assets\n33.0\n29.0\n30.0\nForeign currency exchange losses - net\n25.6\n14.9\n18.8\nOther\n72.8\n61.1\n70.0\nTotal\n$\n440.1\n$\n406.0\n$\n470.6\n* As a result of the adoption of ASU No. 2016-13 in 2021, recoveries from freestanding credit enhancements are recognized in other income. Prior to the adoption of ASU No. 2016-13, recoveries from freestanding credit enhancements were recorded in the provision for credit losses.\nThe Company recorded net gains on operating lease dispositions in 2022 and 2021 of $66.9 million and $65.0 million, respectively, driven by better than expected conditions in the agriculture and construction used equipment markets, which led to favorable results when the matured operating lease equipment was sold. In 2020, the Company recorded a net loss on operating lease residual values and impairments of $53.6 million (see Note 6).\nNote 16. Cash Flow Information\nFor purposes of the statements of consolidated cash flows, the Company considers investments with purchased maturities of three months or less to be cash equivalents. Substantially all of the Companys short-term borrowings, excluding the securitization borrowings and current maturities of long-term borrowings, mature or may require payment within three months or less.\nSupplemental cash flow information was as follows (in millions of dollars):\nCash paid for interest\n$\n606.8\n$\n562.4\n$\n806.0\nCash paid for income taxes\n280.9\n306.8\n254.0\nNote 17. Commitments and Contingencies\nAt October 30, 2022, John Deere Financial Inc., the John Deere finance subsidiary in Canada, had $2,064.1 million of medium-term notes outstanding, and a fair value liability of $137.0 million for derivatives outstanding, prior to considering applicable netting provisions, with notional amounts of $2,690.7 million that were guaranteed by Capital Corporation. The weighted-average interest rate on the medium-term notes at October 30, 2022 was 2.0 percent with a maximum remaining maturity of seven years.\nCapital Corporation has a variable interest in John Deere Canada Funding Inc. (JDCFI), a wholly-owned subsidiary of John Deere Financial Inc., which was created as a VIE to issue debt in public markets to fund the operations\nof affiliated companies in Canada. Capital Corporation has a variable interest in JDCFI because it provides guarantees for all debt issued by JDCFI, however it does not consolidate JDCFI because it does not have the power to direct the activities that most significantly impact JDCFIs economic performance. Capital Corporation has no carrying value of assets or liabilities related to JDCFI. Its maximum exposure to loss is the amount of the debt issued by JDCFI and guaranteed by Capital Corporation, which was $368.6 million at October 30, 2022. The weighted-average interest rate on the debt at October 30, 2022 was 2.8 percent with a maximum remaining maturity of one year. No additional support beyond what was previously contractually required has been provided to JDCFI during the reporting periods.\nThe Company has commitments to extend credit to customers and John Deere dealers through lines of credit and other pre-approved credit arrangements. The Company applies the same credit policies and approval process for these commitments to extend credit as it does for its Receivables. Collateral is not required for these commitments, but if credit is extended, collateral may be required upon funding. The amount of unused commitments to extend credit to customers and John Deere dealers was $31.6 billion and $8.2 billion, respectively, at October 30, 2022. A significant portion of these commitments is not expected to be fully drawn upon; therefore, the total commitment amounts likely do not represent a future cash requirement. The Company generally has the right to unconditionally cancel, alter, or amend the terms of these commitments at any time. Over 95 percent of the unused commitments to extend credit to customers relate to revolving charge accounts. The Company has a reserve for credit losses of $2.0 million on unfunded commitments that are not unconditionally cancellable at October 30, 2022, which is recorded in accounts payable and accrued expenses on the consolidated balance sheets.\nAt October 30, 2022, the Company had restricted other assets associated with borrowings related to securitizations (see Note 5). Excluding the securitization programs, the remaining balance of restricted other assets was not material as of October 30, 2022.\nThe Company is subject to various unresolved legal actions which arise in the normal course of its business, the most prevalent of which relate to retail credit matters. The Company believes the reasonably possible range of losses for these unresolved legal actions would not have a material effect on its consolidated financial statements.\nNote 18. Other Comprehensive Income Items\nThe after-tax components of accumulated other comprehensive income (loss) at October 30, 2022, October 31, 2021, and November 1, 2020 were as follows (in millions of dollars):\nCumulative translation adjustment\n$\n(169.0)\n$\n(54.5)\n$\n(69.5)\nUnrealized gain (loss) on derivatives\n66.8\n6.8\n(6.7)\nUnrealized loss on debt securities\n(2.5)\n(1.7)\n(1.6)\nTotal accumulated other comprehensive income (loss)\n$\n(104.7)\n$\n(49.4)\n$\n(77.8)\nFollowing are amounts recorded in and reclassifications out of other comprehensive income (loss) and the income tax effects (in millions of dollars):\nBefore\nTax\nAfter\nTax\n(Expense)\nTax\nAmount\nCredit\nAmount\nCumulative translation adjustment\n$\n(114.5)\n$\n(114.5)\nUnrealized gain (loss) on derivatives:\nUnrealized hedging gain (loss)\n88.3\n$\n(18.5)\n69.8\nReclassification of realized (gain) loss to:\nInterest rate contracts - Interest expense\n(12.4)\n2.6\n(9.8)\nNet unrealized gain (loss) on derivatives\n75.9\n(15.9)\n60.0\nUnrealized gain (loss) on debt securities:\nUnrealized holding gain (loss)\n(1.1)\n.3\n(.8)\nTotal other comprehensive income (loss)\n$\n(39.7)\n$\n(15.6)\n$\n(55.3)\nCumulative translation adjustment\n$\n15.0\n$\n15.0\nUnrealized gain (loss) on derivatives:\nUnrealized hedging gain (loss)\n7.7\n$\n(1.6)\n6.1\nReclassification of realized (gain) loss to:\nInterest rate contracts - Interest expense\n9.4\n(2.0)\n7.4\nNet unrealized gain (loss) on derivatives\n17.1\n(3.6)\n13.5\nUnrealized gain (loss) on debt securities:\nUnrealized holding gain (loss)\n(.2)\n.1\n(.1)\nTotal other comprehensive income (loss)\n$\n31.9\n$\n(3.5)\n$\n28.4\nCumulative translation adjustment\n$\n18.9\n$\n18.9\nUnrealized gain (loss) on derivatives:\nUnrealized hedging gain (loss)\n(17.4)\n$\n3.6\n(13.8)\nReclassification of realized (gain) loss to:\nInterest rate contracts - Interest expense\n17.9\n(3.8)\n14.1\nNet unrealized gain (loss) on derivatives\n.5\n(.2)\n.3\nUnrealized gain (loss) on debt securities:\nUnrealized holding gain (loss)\n(.9)\n.4\n(.5)\nReclassification of realized (gain) loss - Administrative and operating expenses\n1.3\n(.4)\n.9\nNet unrealized gain (loss) on debt securities\n.4\n.4\nTotal other comprehensive income (loss)\n$\n19.8\n$\n(.2)\n$\n19.6\nNote 19. Fair Value Measurements\nFair value is defined as the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. To determine fair value, the Company uses various methods, including market and income approaches. The Company utilizes valuation models and techniques that maximize the use of observable inputs. The models are industry-standard models that consider various assumptions, including time values and yield curves as well as other economic measures. These valuation techniques are consistently applied.\nLevel 1 measurements consist of quoted prices in active markets for identical assets or liabilities. Level 2 measurements include significant other observable inputs, such as quoted prices for similar assets or liabilities in active markets; identical assets or liabilities in inactive markets; observable inputs such as interest rates and yield curves; and other market-corroborated inputs. Level 3 measurements include significant unobservable inputs.\nThe fair values of financial instruments that do not approximate the carrying values at October 30, 2022 and October 31, 2021 were as follows (in millions of dollars):\nCarrying\nFair\nCarrying\nFair\nValue\nValue\nValue\nValue\nReceivables financed - net\n$\n36,438.6\n$\n35,562.4\n$\n31,891.7\n$\n31,903.6\nRetail notes securitized - net\n5,935.9\n5,696.3\n4,648.9\n4,694.2\nSecuritization borrowings\n5,710.9\n5,576.6\n4,595.2\n4,600.0\nCurrent maturities of long-term external borrowings\n5,989.6\n5,887.7\n5,819.1\n5,842.3\nLong-term external borrowings\n22,527.8\n21,792.7\n20,607.3\n20,887.5\nFair value measurements above were Level 3 for all Receivables and Level 2 for all borrowings.\nFair values of Receivables that were issued long-term were based on the discounted values of their related cash flows at interest rates currently being offered by the Company for similar Receivables. The fair values of the remaining Receivables approximated the carrying amounts.\nFair values of long-term external borrowings and securitization borrowings were based on current market quotes for identical or similar borrowings and credit risk, or on the discounted values of their related cash flows at current market interest rates. Certain long-term external borrowings have been swapped to current variable interest rates. The carrying values of these long-term external borrowings include adjustments related to fair value hedges.\nAssets and liabilities measured at October 30, 2022 and October 31, 2021 at fair value on a recurring basis were as follows (in millions of dollars):\nMarketable securities\nInternational debt securities\n$\n1.1\n$\n2.1\nReceivables from John Deere\nDerivatives\n214.8\n191.6\nOther assets\nDerivatives\n1.3\n1.1\nTotal assets\n$\n217.2\n$\n194.8\nOther payables to John Deere\nDerivatives\n$\n1,024.2\n$\n97.6\nAccounts payable and accrued expenses\nDerivatives\n14.1\n4.8\nTotal liabilities\n$\n1,038.3\n$\n102.4\nAll fair value measurements in the table above were Level 2. Excluded from the table above were the Companys cash equivalents, which were carried at a cost that approximates fair value. The cash equivalents consist of time deposits and money market funds.\nThe international debt securities mature over the next eight years. At October 30, 2022, the amortized cost basis and fair value of these available-for-sale debt securities were $4.9 million and $1.1 million, respectively. Unrealized losses at October 30, 2022 were not recognized in income due to the ability and intent to hold to maturity.\nFair value, nonrecurring Level 3 measurements from impairments, excluding Receivables with specific allowances which were not material, at October 30, 2022 and October 31, 2021 were as shown in the table below (in millions of dollars). The losses recorded during 2020 were the result of impairments taken on operating leases and matured operating lease inventory (see Note 6).\nFair Value\nLosses\nEquipment on operating leases - net\n$\n21.0\nOther assets\n9.8\nTotal\n$\n30.8\nThe following is a description of the valuation methodologies the Company uses to measure certain balance sheet items at fair value:\nMarketable securities - The international debt securities are valued using quoted prices for identical assets in inactive markets.\nDerivatives - The Companys derivative financial instruments consist of interest rate contracts (swaps and caps), foreign currency exchange contracts (futures, forwards, and swaps), and cross-currency interest rate contracts (swaps). The portfolio is valued based on an income approach (discounted cash flow) using market observable inputs, including swap curves and both forward and spot exchange rates for currencies.\nReceivables - Specific reserve impairments are based on the fair value of the collateral, which is measured using a market approach (appraisal values or realizable values). Inputs include a selection of realizable values.\nEquipment on operating leases - net - The impairments were based on an income approach (discounted cash flow), using the contractual payments, plus estimates of return rates and equipment sale price at lease maturity. Inputs included historical return rates and realized sales values.\nOther assets - The impairments of the matured operating lease inventory were measured at the fair value of that inventory. The valuations were based on a market approach. The inputs included sales of comparable assets.\nNote 20. Derivative Instruments\nCash Flow Hedges\nCertain interest rate contracts (swaps) were designated as hedges of future cash flows from borrowings. The total notional amounts of the receive-variable/pay-fixed interest rate contracts at October 30, 2022 and October 31, 2021 were $1,950.0 million and $2,700.0 million, respectively. Fair value gains or losses on cash flow hedges are recorded in OCI and subsequently reclassified into interest expense in the same periods during which the hedged transactions impact earnings. These amounts offset the effects of interest rate changes on the related borrowings.\nThe amount of gain recorded in OCI at October 30, 2022 that is expected to be reclassified to interest expense in the next twelve months if interest rates remain unchanged is $46.6 million after-tax. No gains or losses were reclassified from OCI to earnings based on the probability that the original forecasted transaction would not occur.\nFair Value Hedges\nCertain interest rate contracts (swaps) were designated as fair value hedges of borrowings. The total notional amounts of the receive-fixed/pay-variable interest rate contracts at October 30, 2022 and October 31, 2021 were $9,448.9 million and $7,313.6 million, respectively. The fair value gains or losses on these contracts were generally offset by fair value gains or losses on the hedged items (fixed-rate borrowings) with both items recorded in interest expense.\nThe amounts recorded, at October 30, 2022 and October 31, 2021, in the consolidated balance sheets related to borrowings designated in fair value hedging relationships were as follows (in millions of dollars). Fair value hedging adjustments are included in the carrying amount of the hedged item.\nActive Hedging Relationships\nDiscontinued Hedging Relationships\nCarrying\nCumulative\nCarrying Amount\nCumulative\nAmount of\nFair Value\nof Formerly\nFair Value\nHedged Item\nHedging Adjustment\nHedged Item\nHedging Adjustment\nCurrent maturities of long-term external borrowings\n$\n2,514.9\n$\n15.5\nLong-term external borrowings\n$\n8,453.6\n$\n(950.1)\n5,519.6\n(19.1)\nCurrent maturities of long-term external borrowings\n$\n191.2\n$\n2.7\n$\n1,997.4\n$\n(1.7)\nLong-term external borrowings\n7,139.0\n48.3\n6,287.3\n222.7\nDerivatives Not Designated as Hedging Instruments\nThe Company has certain interest rate contracts (swaps and caps), foreign currency exchange contracts (futures, forwards, and swaps), and cross-currency interest rate contracts (swaps), which were not formally designated as hedges. These derivatives were held as economic hedges for underlying interest rate or foreign currency exposures for certain borrowings. The total notional amounts of the interest rate swaps at October 30, 2022 and October 31, 2021 were $3,931.3 million and $2,970.4 million, the foreign currency exchange contracts were $1,069.0 million and $96.7 million, and the cross-currency interest rate contracts were $134.2 million and $237.5 million, respectively. To facilitate borrowings through securitization of retail notes, interest rate caps were sold with notional amounts of $1,020.3 million and $1,645.4 million at October 30, 2022 and October 31, 2021, respectively. Interest rate caps were also purchased with notional amounts of $1,020.3 million and $1,645.4 million at the same dates, respectively. The fair value gains or losses from derivatives not designated as hedging instruments were recorded in the statements of consolidated income, generally offsetting over time the exposure on the hedged item.\nFair values of derivative instruments in the consolidated balance sheets at October 30, 2022 and October 31, 2021 were as follows (in millions of dollars):\nReceivables from John Deere\nDesignated as hedging instruments:\nInterest rate contracts\n$\n87.5\n$\n162.8\nNot designated as hedging instruments:\nInterest rate contracts\n124.5\n23.4\nCross-currency interest rate contracts\n2.8\n5.4\nTotal not designated\n127.3\n28.8\nOther Assets\nNot designated as hedging instruments:\nForeign currency exchange contracts\n1.3\n1.1\nTotal derivative assets\n$\n216.1\n$\n192.7\nOther Payables to John Deere\nDesignated as hedging instruments:\nInterest rate contracts\n$\n947.9\n$\n79.0\nNot designated as hedging instruments:\nInterest rate contracts\n74.2\n17.1\nCross-currency interest rate contracts\n2.1\n1.5\nTotal not designated\n76.3\n18.6\nAccounts Payable and Accrued Expenses\nNot designated as hedging instruments:\nForeign currency exchange contracts\n14.1\n4.8\nTotal derivative liabilities\n$\n1,038.3\n$\n102.4\nThe classification and gains (losses), including accrued interest expense, related to derivative instruments on the statements of consolidated income consisted of the following (in millions of dollars):\nFair Value Hedges\nInterest rate contracts - Interest expense\n$\n(1,102.0)\n$\n(208.9)\n$\n477.3\nCash Flow Hedges\nRecognized in OCI\nInterest rate contracts - OCI (pretax)\n88.3\n7.7\n(17.4)\nReclassified from OCI\nInterest rate contracts - Interest expense\n12.4\n(9.4)\n(17.9)\nNot Designated as Hedges\nInterest rate contracts - Interest expense *\n$\n62.4\n$\n5.2\n$\n(5.4)\nForeign currency exchange contracts - Administrative and operating expenses *\n169.3\n(26.6)\n57.0\nTotal not designated\n$\n231.7\n$\n(21.4)\n$\n51.6\n*     Includes interest and foreign currency exchange gains (losses) from cross-currency interest rate contracts.\nIncluded in the table above are interest expense and administrative and operating expense amounts the Company incurred on derivatives transacted with John Deere. The amounts the Company recognized on these affiliate party transactions were losses of $1,021.7 million and $224.3 million during 2022 and 2021, respectively, and a gain of $468.7 million during 2020.\nCounterparty Risk and Collateral\nDerivative instruments are subject to significant concentrations of credit risk to the banking sector. The Company manages individual unrelated external counterparty exposure by setting limits that consider the credit rating of the unrelated external counterparty, the credit default swap spread of the counterparty, and other financial commitments and exposures between the Company and the unrelated external counterparty banks. All interest rate derivatives are transacted under International Swaps and Derivatives Association (ISDA) documentation. Each master agreement permits the net settlement of amounts owed in the event of default or termination. None of the Companys derivative agreements contain credit-risk-related contingent features.\nThe Companys outstanding derivatives transactions are with both unrelated external counterparties and with John Deere. For derivatives transactions with John Deere, the Company utilizes a centralized hedging structure in which John Deere enters into a derivative transaction with an unrelated external counterparty and simultaneously enters into a derivative transaction with the Company. Except for collateral provisions, the terms of the transaction between the Company and John Deere are identical to the terms of the transaction between John Deere and its unrelated external counterparty.\nThe Company has ISDA agreements with John Deere that permit the net settlement of amounts owed between counterparties in the event of early termination. In addition, the Company has a loss sharing agreement with John Deere in which the Company has agreed to absorb any losses and expenses John Deere incurs if an unrelated external counterparty fails to meet its obligations on a derivative transaction that John Deere entered into to manage exposures of the Company. The loss sharing agreement did not increase the maximum amount of loss that the Company would incur, after considering collateral received and netting arrangements, as of October 30, 2022 and October 31, 2021.\nDerivatives are recorded without offsetting for netting arrangements or collateral. The impact on the derivative assets and liabilities for external derivatives and those with John Deere related to netting arrangements and any collateral received or paid at October 30, 2022 and October 31, 2021 were as follows (in millions of dollars):\nDerivatives:\nGross Amounts Recognized\nNetting Arrangements\nCollateral\nNet\nAmount\nAssets\nExternal\n$\n1.3\n$\n(1.1)\n$\n.2\nJohn Deere\n214.8\n(128.3)\n86.5\nLiabilities\nExternal\n14.1\n(1.1)\n13.0\nJohn Deere\n1,024.2\n(128.3)\n895.9\nDerivatives:\nGross Amounts Recognized\nNetting Arrangements\nCollateral\nNet\nAmount\nAssets\nExternal\n$\n1.1\n$\n(.3)\n$\n.8\nJohn Deere\n191.6\n(97.6)\n94.0\nLiabilities\nExternal\n4.8\n(.3)\n4.5\nJohn Deere\n97.6\n(97.6)\nNote 21. Employee-Separation Programs\nDuring 2020, the Company implemented employee-separation programs for the Companys salaried workforce in several geographic areas, including the U.S., Europe, and Latin America. The programs main purpose was to improve efficiency through a leaner, more flexible organization. The programs were largely voluntary in nature with the expense recorded in the period in which the employees irrevocably accepted a separation offer. For the limited involuntary employee-separation programs, the expense was recorded when management committed to a plan, the plan was communicated to the employees, and the employees were not required to provide service beyond the legal notification period. The programs provided for cash payments based on years of service, and in some countries subsidized healthcare for a limited period and outplacement services. The programs total pretax expense in 2020 was $19.7 million, which was recorded in administrative and operating expenses. The total pretax expense included non-cash charges of $5.5 million resulting from curtailments in certain other postretirement benefit plans (see Note 12).\nNote 22. Geographic Area Information\nBased on the way the operations are managed and evaluated by management and materiality considerations, the Company is viewed as one operating segment. However, geographic area information for revenues and Receivables attributed to the U.S. and countries outside the U.S. is disclosed below. No individual foreign countrys revenues or Receivables were material for disclosure purposes.\nGeographic area information as of and for the years ended October 30, 2022, October 31, 2021, and November 1, 2020 is presented below (in millions of dollars):\nRevenues:\nU.S.\n$\n2,403.2\n$\n2,357.2\n$\n2,517.6\nOutside the U.S.\n356.0\n330.8\n290.0\nTotal\n$\n2,759.2\n$\n2,688.0\n$\n2,807.6\nReceivables:\nU.S.\n$\n36,614.1\n$\n30,756.7\n$\n28,196.8\nOutside the U.S.\n5,888.8\n5,912.9\n5,360.5\nTotal\n$\n42,502.9\n$\n36,669.6\n$\n33,557.3\nNote 23. Unconsolidated Affiliated Company\nThe Companys investment in an unconsolidated affiliated company consists of a 50 percent ownership in John Deere Financial S.A.S., a joint venture in France that primarily offers loans and leases to customers. The Company does not control the joint venture and accounts for its investment in the joint venture on the equity basis. The Companys share of the income or loss of this joint venture is reported in the consolidated income statement under Equity in income of unconsolidated affiliate. The investment in this joint venture is reported in the consolidated balance sheets under Investment in unconsolidated affiliate.\nSummarized financial information of the unconsolidated affiliated company for the relevant fiscal years was as follows (in millions of dollars):\nOperations:\nTotal revenue\n$\n17.7\n$\n16.6\n$\n13.4\nNet income\n9.0\n5.9\n4.4\nThe Companys equity in net income\n4.5\n3.0\n2.2\nFinancial Position:\nTotal assets\n$\n496.3\n$\n416.1\nTotal external borrowings\n449.3\n364.6\nTotal net assets\n45.2\n43.8\nThe Companys share of net assets\n22.6\n21.9\nIndex to Exhibits\n3.1\nCertificate of Incorporation, as amended (Exhibit 3.1 to Form 10-K of the registrant for the year ended October 31, 1999, Securities and Exchange Commission File Number 1-6458*)\n3.2\nBylaws, as amended (Exhibit 3.2 to Form 10-K of the registrant for the year ended October 31, 1999, Securities and Exchange Commission File Number 1-6458*)\n4.1\nSenior Indenture dated March 15, 1997 between the registrant and The Bank of New York Mellon (successor Trustee to The Chase Manhattan Bank National Association), as Trustee (Exhibit 4.1 to registration statement on Form S-3 no. 333-68355, filed December 4, 1998, Securities and Exchange Commission File Number 1-6458*)\n4.2\nFirst Supplemental Senior Indenture dated April 21, 2011 between the registrant and The Bank of New York Mellon, as Trustee (Exhibit 4.2 to registration statement on Form S-3 no. 333-173672, filed April 21, 2011, Securities and Exchange Commission File Number 1-6458*)\n4.3\nSecond Supplemental Senior Indenture dated April 17, 2014 between the registrant and The Bank of New York Mellon, as Trustee (Exhibit 4.3 to registration statement on Form S-3 no. 333-195332, filed April 17, 2014, Securities and Exchange Commission File Number 1-6458*)\n4.4\nSubordinated Indenture dated September 1, 2003 between the registrant and U.S. Bank National Association, as Trustee (Exhibit 4.3 to registration statement on Form S-3 no. 333-108705, filed September 11, 2003, Securities and Exchange Commission File Number 1-6458*)\n4.5\nTerms and Conditions of the Euro Medium Term Notes, published March 31, 2022, applicable to the U.S. $6,000,000,000 Euro Medium Term Note Programme of the registrant, Deere & Company, John Deere Bank S.A., and John Deere Cash Management (Exhibit 4.5 to the Form 10-K of Deere & Company for the year ended October 30, 2022, Securities and Exchange Commission File Number 1-4121*)\n4.6\nThird Supplemental Senior Indenture dated April 7, 2017 between the registrant and The Bank of New York Mellon, as Trustee (Exhibit 4.4 to registration statement on Form S-3 no. 333-217193, filed April 7, 2017, Securities and Exchange Commission File Number 1-6458*)\n4.7\nDescription of the registrants 2.00% Senior Notes due 2031 (Exhibit 4.8 to Form 10-K of the registrant for the year ended October 31, 2021, Securities and Exchange Commission File Number 1-6458*)\nCertain instruments relating to long-term debt constituting less than 10 percent of the registrants total assets may not be filed as exhibits herewith pursuant to Item 601(b)(4)(iii)(A) of Regulation S-K. The registrant will furnish copies of such instruments to the Commission upon request.\n10.1\nAgreement, as amended November 1, 1994, between the registrant and Deere & Company concerning agricultural retail notes (Exhibit 10.1 to Form 10-K of Deere & Company for the year ended October 31, 1998, Securities and Exchange Commission File Number 1-4121*)\n10.2\nAgreement, as amended November 1, 1994, between the registrant and Deere & Company concerning lawn and grounds care retail notes (Exhibit 10.2 to the Form 10-K of Deere & Company for the year ended October 31, 1998, Securities and Exchange Commission File Number 1-4121*)\n10.3\nAgreement, as amended November 1, 1994, between the registrant and John Deere Construction Equipment Company concerning construction retail notes (Exhibit 10.3 to the Form 10-K of Deere & Company for the year ended October 31, 1998, Securities and Exchange Commission File Number 1-4121*)\n10.4\nAgreement, dated July 14, 1997, between the registrant and John Deere Construction Equipment Company concerning construction retail notes (Exhibit 10.4 to Form 10-K of Deere & Company for the year ended October 31, 2003, Securities and Exchange Commission File Number 1-4121*)\n10.5\nFirst Amended Agreement, dated November 1, 2003, between the registrant and Deere & Company relating to fixed charges ratio, ownership and minimum net worth of the registrant (Exhibit 10.5 to Form 10-K of Deere & Company for the year ended October 31, 2003, Securities and Exchange Commission File Number 1-4121*)\n10.6\nAsset Purchase Agreement, dated October 29, 2001, between Deere & Company and Deere Capital, Inc. concerning the sale of trade receivables (Exhibit 10.19 to Form 10-K of Deere & Company for the year ended October 31, 2001, Securities and Exchange Commission File Number 1-4121*)\n10.7\nSecond Amendment, dated February 21, 2020, to the Asset Purchase Agreement dated October 29, 2001, between Deere & Company and Deere Capital, Inc. (including conformed copy of the Asset Purchase Agreement as Exhibit A thereto) (Exhibit 10.1 to Form 10-Q of Deere & Company for the quarter ended February 2, 2020, Securities and Exchange Commission File Number 1-4121*)\n10.8\nAsset Purchase Agreement, dated October 29, 2001, between John Deere Construction & Forestry Company and Deere Capital, Inc. concerning the sale of trade receivables (Exhibit 10.20 to Form 10-K of Deere & Company for the year ended October 31, 2001, Securities and Exchange Commission File Number 1-4121*)\n10.9\nSecond Amendment, dated February 21, 2020, to the Asset Purchase Agreement dated October 29, 2001, between John Deere Construction & Forestry Company and Deere Capital, Inc. (including conformed copy of the Asset Purchase Agreement as Exhibit A thereto) (Exhibit 10.2 to Form 10-Q of Deere & Company for the quarter ended February 2, 2020, Securities and Exchange Commission File Number 1-4121*)\n10.10\n2026 Credit Agreement, dated March 28, 2022, among the registrant, Deere & Company, John Deere Bank S.A., various financial institutions, JPMorgan Chase Bank, N.A., as Administrative Agent, Bank of America, N.A. and Citibank, N.A., as Co-Syndication Agents, and J.P. Morgan Securities LLC, as Sustainability Structuring Agent (Exhibit 10.1 to Form 10-Q of registrant for the quarter ended May 1, 2022, Securities and Exchange Commission File Number 1-6458*)\n10.11\n2027 Credit Agreement, dated March 28, 2022, among the registrant, Deere & Company, John Deere Bank S.A., various financial institutions, JPMorgan Chase Bank, N.A., as Administrative Agent, Bank of America, N.A. and Citibank, N.A., as Co-Syndication Agents, and J.P. Morgan Securities LLC, as Sustainability Structuring Agent (Exhibit 10.2 to Form 10-Q of registrant for the quarter ended May 1, 2022, Securities and Exchange Commission File Number 1-6458*)\n10.12\n364-Day Credit Agreement, dated March 28, 2022, among the registrant, Deere & Company, John Deere Bank S.A., various financial institutions, JPMorgan Chase Bank, N.A., as Administrative Agent, Bank of America, N.A. and Citibank, N.A., as Co-Syndication Agents, and J.P. Morgan Securities LLC, as Sustainability Structuring Agent (Exhibit 10.3 to Form 10-Q of registrant for the quarter ended May 1, 2022, Securities and Exchange Commission File Number 1-6458*)\n21.\nOmitted pursuant to instruction I(2)\n23.\nConsent of Deloitte & Touche LLP\n24.\nPower of Attorney (included on signature page)\n31.1\nRule 13a-14(a)/15d-14(a) Certification\n31.2\nRule 13a-14(a)/15d-14(a) Certification\n32.\nSection 1350 Certifications (furnished herewith)\n99.\nItem 1A of the Deere & Company Form 10-K for the fiscal year ended October 30, 2022 (Securities and Exchange Commission File Number 1-4121*)\n101.SCH\nInline XBRL Taxonomy Extension Schema Document\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101)\n*\nIncorporated by reference.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nJOHN DEERE CAPITAL CORPORATION\nBy:\n/s/ John C. May\nJohn C. May\nChairman and Chief Executive Officer\n(Principal Executive Officer)\nDate:December 15, 2022\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the date indicated.\nEach person signing below also hereby appoints John C. May, Joshua A. Jepsen, and Edward R. Berk, and each of them singly, his or her lawful attorney-in-fact with full power to execute and file any and all amendments to this report together with exhibits thereto and generally to do all such things as such attorney-in-fact may deem appropriate to enable John Deere Capital Corporation to comply with the provisions of the Securities Exchange Act of 1934 and all requirements of the Securities and Exchange Commission.\nSignature\nTitle\nDate\n/s/ Ryan D. Campbell\nDirector\n)\nRyan D. Campbell\n)\n)\n)\n/s/ Joshua A. Jepsen\nDirector and Senior Vice President\n)\nJoshua A. Jepsen\n(Principal Financial Officer and\n)\nPrincipal Accounting Officer)\n)\n)\n)\n/s/ Rajesh Kalathur\nDirector and President\n)\nRajesh Kalathur\n)\n)\n)\n/s/ John C. May\nDirector, Chairman, and\n)\nDecember 15, 2022\nJohn C. May\nChief Executive Officer\n)\n(Principal Executive Officer)\n)\n)\n)\n/s/ Steven N. Owenson\nDirector\n)\nSteven N. Owenson\n)\n)\n)\n/s/ Cory J. Reed\nDirector\n)\nCory J. Reed\n)\n)\n)\n/s/ Jayma A. Sandquist\nDirector\n)\nJayma A. Sandquist\n)\n)\nSignature\nTitle\nDate\n/s/ Andrew C. Traeger\nDirector\n)\nAndrew C. Traeger\n)\n)\nDecember 15, 2022\n)\n/s/ Markwart von Pentz\nDirector\n)\nMarkwart von Pentz\n)"
}