{
    "cik": "315131",
    "company": "PHX MINERALS INC.",
    "filing_type": "10-K",
    "filing_date": "2022-12-13",
    "period_of_report": "2022-09-30",
    "sic": "1311",
    "state_of_inc": "OK",
    "state_location": "TX",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/315131/0000950170-22-026464-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/315131/000095017022026464/phx-20220930.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/315131/0000950170-22-026464.txt",
    "filename": "315131_10K_2022_0000950170-22-026464.htm",
    "content": "ITEM 1. Business\nOverview\nPHX Minerals Inc., a Delaware corporation, is a Fort Worth-based company focused on perpetual natural gas and oil mineral ownership in resource plays in the United States. Prior to a strategy change in 2019, the Company participated with a working interest on some of its mineral and leasehold acreage and as a result still holds legacy interests in leasehold acreage and non-operated working interests in natural gas and oil properties. In this Annual Report, we generally refer to such working interests and the related wells as legacy interests and wells.\nThe Company was originally founded as a cooperative in 1926, and its shares became publicly traded in 1979. Effective April 1, 2022, the Company changed its state of incorporation from Oklahoma to Delaware through a merger with a wholly owned subsidiary, which was conducted for such purpose (the Reincorporation). Other than the change in the state of incorporation, the Reincorporation did not result in any change in the business, physical location, management, assets, liabilities or net worth of the Company, nor did it result in any change in location of the Companys employees, including the Companys management.\nStrategic Focus on Mineral Ownership\nDuring fiscal year 2019, we made the strategic decision to focus on perpetual natural gas and oil mineral ownership and growth by acquiring minerals in our core focus areas and by developing our significant mineral acreage inventory. In accordance with this strategy, we have ceased taking any working interest positions on our mineral and leasehold acreage. During the three fiscal years ended September 30, 2022, we did not participate with a working interest in the drilling of any new wells. We believe that our strategy to focus on mineral ownership is the best path forward to provide our stockholders the greatest risk-weighted returns on their investments.\nA mineral fee is an interest in real property in which the owner owns all of the rights to the minerals under the surface in perpetuity, as compared to a mineral lease in which the lessees rights end at the expiration of the lease term or after production in paying quantities ceases with respect to the lease or the lease otherwise terminates in accordance with its terms. Generally, the mineral interest owner of a mineral fee interest reserves a non-cost bearing royalty interest upon the lease of such gas, oil, and other minerals to a gas and oil exploration and development company. Such companies lease such mineral interests from the fee mineral owner for a term with the expectation of producing natural gas and oil, thereby generating free cash flow from bonuses and royalties to the mineral interest owner.\nAs referenced above, our legacy leasehold interests, rather than our mineral interests, are non-operated working interests. These legacy non-operated working interests require us to contribute our proportionate share of the costs incurred by the operator in the development of such minerals. As discussed above and further below, since the end of 2019 and going forward, we no longer seek to participate with such working interests and are in the process of divesting legacy working interests and redeploying the proceeds into acquiring high quality mineral and royalty properties. Our producing mineral and leasehold properties are located primarily in Oklahoma, Texas, Louisiana, North Dakota and Arkansas.\nAlthough a significant amount of our revenues is currently derived from the production and sale of natural gas, oil and NGL from our legacy working interests, the majority of our revenues is derived from royalties generated from the production and sale of natural gas, oil and NGL. These royalties are tied to our perpetual ownership of mineral acreage. Royalties are due and payable whenever the operator of such interest produces and sells natural gas, oil or NGL from wells located on our mineral acreage.\nAs of September 30, 2022, we owned approximately 244,739 perpetual mineral acres, as detailed in the table below:\nPlay\nNet Acres\n% Producing\n% Leased But Not Producing\n% Unleased\nSCOOP\n7,636\n67%\n7%\n26%\nSTACK\n5,802\n90%\n4%\n6%\nArkoma Stack\n10,604\n70%\n1%\n29%\nHaynesville\n3,321\n100%\n0%\n0%\nBakken /Three Forks\n3,108\n89%\n0%\n11%\nFayetteville\n9,883\n73%\n0%\n27%\nOther\n204,385\n17%\n2%\n81%\nTotal:\n244,739\n27%\n2%\n71%\nApproximately 29% of our net minerals are currently under lease with an operator of which 27% have a producing well. Additionally, approximately 71% of our net mineral position is currently unleased, providing the opportunity to generate additional cash flow from bonus payments and royalties without spending additional capital. We may also generate additional cash flows through opportunistically divesting unleased minerals. We also own working interests, royalty interests or both in 6,362 producing natural gas and oil wells and 172 wells in the process of being drilled or completed.\nExploration and development of our natural gas and oil properties are conducted by natural gas and oil exploration and production companies, which typically are larger, independent oil and gas operating companies. We do not operate any natural gas and oil properties. While we previously were an active working interest participant in wells drilled on our mineral and leasehold acreage, we now focus on growth through mineral acquisitions and through development of our significant mineral acreage inventory.\nWe intend to maximize stockholder value through the acquisition of mineral acreage in the core areas of resource plays with substantial undeveloped opportunities, proactive leasing of our mineral holdings, and divestiture of non-core minerals with limited optionality when the amount negotiated exceeds our projected total value.\nOur Business Strategy\nOur principal business objective is to maximize stockholder value. At the end of 2019, we made the strategic decision to cease taking working interest positions on our mineral and leasehold acreage. Our focus since then has been on growth through mineral acquisitions and by developing our significant mineral acreage inventory in our core focus areas under high quality operators. We believe this is the best path to provide our stockholders the greatest risk-weighted returns on their investment. We intend to accomplish this objective by executing the following corporate strategies:\nActively Manage Mineral and Leasehold Assets as a Portfolio to Maximize Value. We plan to manage our mineral and leasehold assets through the following:\noIncreasing our mineral fee holdings by acquiring mineral acreage in our core focus areas of natural gas and oil resource plays with substantial undeveloped opportunities that meet or exceed our minimum return threshold;\noUtilizing in-house geology and engineering expertise as a competitive advantage;\noProactively leasing or monetizing our unleased mineral holdings; and\noHigh-grading our asset base by: (a) selectively divesting non-core minerals when the anticipated sales price exceeds our projected total value, (b) optimizing our leasehold and working interest positions through strategic sales and farmouts of such assets, and (c) redeploying proceeds from sales into our core focus areas.\nMaintain a Stable and Well Capitalized Balance Sheet. We plan to maintain a strong financial position through the following:\noMaintaining a conservative amount of debt outstanding with ample liquidity to ensure our ability to successfully operate in all business and commodity environments; and\noHedging a portion of our future natural gas and oil prices to manage commodity price risk and protect our cash flow.\nOur Business Strengths\nWe believe the following attributes position us to achieve our objectives:\nFocusing on Perpetual Mineral Fee Ownership. Our strategic decision to focus on mineral ownership provides us with the perpetual option to benefit from future development and technology. We are focused on generating meaningful revenues through lease bonuses and royalty interests, and our royalty revenue as a percentage of total revenue continues to increase. As of September 30, 2022, we owned approximately 244,739 net mineral acres located primarily in Oklahoma, Texas, North Dakota, Louisiana and Arkansas. We also own working interests, royalty interests or both in 6,362 producing natural gas and oil wells and 172 wells in the process of being drilled or completed.\nMineral and Leasehold Ownership in Multiple Top-Tier Resource Plays. We own mineral and leasehold interests in multiple top-tier resource plays in the United States, including positions in the Haynesville, SCOOP, STACK, Bakken/Three Forks, Arkoma Woodford, Eagle Ford, Permian Basin and Fayetteville plays. A significant portion of our revenues is derived from the production and sale of natural gas, oil and NGL from these positions. During fiscal year 2022, production on our acreage averaged 26,328 Mcfed with approximately 78%, 12% and 10% of such volumes derived from the production of natural gas, oil and NGL, respectively.\nMaterial Undeveloped Mineral Position in Gas and Oil Producing Basins. Over 70% of our mineral fee position is currently unleased or not currently producing, providing us with the opportunity to generate additional cash flows from bonus payments and royalties without deploying additional capital. We may also generate additional cash flows through opportunistically divesting these unleased minerals.\nStable and Flexible Financial Position. We maintain a stable and flexible financial position by actively managing our debt, cash and working capital. We hedge a portion of our production to manage commodity price risk and to protect our balance sheet and cash flow.\nExperienced Management and Technical Team. We have a management and technical team with extensive experience in the oil and gas industry. Our management and technical team members average over 20 years of industry experience in each applicable area of the Company, including accounting, land, geology, engineering and mergers and acquisitions.\nPrincipal Products and Markets\nWe derive our revenue through bonus and royalty payments and from legacy working interests on our mineral and leasehold acreage. Our principal products from the production associated with our royalty and non-operated interests, in order of revenue generated, are natural gas, crude oil and NGL. These products are generally sold by well operators to various purchasers, including pipeline and marketing companies, which service the areas where the producing wells are located. Since we do not operate any of the wells in which we own an interest, we must rely on the operating expertise of numerous companies that operate the wells in which we own interests, including expertise in the drilling and completion of new wells, producing well operations and, in most cases, the marketing or purchasing of production from the wells. We receive payments from natural gas, oil and NGL sales from the well operator or the contracted purchaser.\nPrices of natural gas, oil and NGL are dependent on numerous factors beyond our control, including supply and demand, competition, weather, international events and geo-political circumstances, actions taken by OPEC and economic, political and regulatory developments. Since demand for natural gas is subject to weather conditions, prices received for our natural gas production may be subject to seasonal variations.\nWe enter into price risk management financial instruments (derivatives) to reduce our exposure to short-term fluctuations in the price of natural gas and oil and to protect our return on investments. The derivative contracts apply only to a portion of our natural gas and oil production, provide only partial price protection against declines in natural gas and oil prices and may limit the benefit of future increases in natural gas and oil prices. Please see Item 7A - Quantitative and Qualitative Disclosures about Market Risk and Note 12 to the financial statements included in Item 8 - Financial Statements and Supplementary Data for additional information regarding the derivative contracts we enter into.\nCompetitive Business Conditions\nThe oil and natural gas industry is highly competitive, particularly with respect to attempting to acquire additional fee mineral interests and natural gas, oil and NGL reserves. Many factors beyond our control affect our competitive position. Some of\nthese factors include: the quantity and price of foreign oil imports; domestic supply and deliverability of natural gas, oil and NGL; changes in prices received for natural gas, oil and NGL production; business and consumer demand for refined natural gas, oil products and NGL; and the effects of federal, state and local regulation of the exploration for, production of and sales of natural gas, oil and NGL (see ITEM 1A. Risk Factors\nIn addition to the other information included in this Form 10-K, the following risk factors should be considered in evaluating our business and future prospects. If any of the following risk factors should occur, our financial condition could be materially impacted, and the holders of our securities could lose part or all of their investment in the Company. As the owner of mineral fee interests and non-operating working interests, we do not operate any natural gas and oil properties, and we do not have any employees or contractors in the field. As such, the risks associated with natural gas and oil operations affect us indirectly and typically through our non-operating working interests as we proportionately share in the costs of operating such wells. The risk factors described below are not exhaustive, and investors are encouraged to perform their own investigation with respect to our Company and our business. Investors should also read the other information in this Form 10-K, including the financial statements and related notes.\nRisks Related to our Business\nThe volatility of natural gas and oil prices due to factors beyond our control greatly affects our financial condition, results of operations and cash available for distribution.\nThe supply of and demand for natural gas, oil and NGL impact the prices we realize on the sale of these commodities and, in turn, materially affect our financial results. Our revenues, operating results, cash available for distribution and the carrying value of our natural gas and oil properties depend significantly upon the prevailing prices for natural gas, oil and NGL. Natural gas, oil and NGL prices have historically been, and will likely continue to be, volatile. The prices for natural gas, oil and NGL are subject to wide fluctuation in response to a number of factors beyond our control, including:\ndomestic and worldwide economic conditions;\neconomic, political, regulatory and tax developments;\nmarket uncertainty;\nchanges in the supply of and demand for natural gas, oil and NGL, both domestically and abroad;\nthe impacts and effects of public health crises, pandemics and epidemics, such as the COVID-19 pandemic;\navailability and capacity of necessary transportation and processing facilities;\ncommodity futures trading;\nregional price differentials;\ndiffering quality of oil produced (i.e., sweet crude versus heavy or sour crude);\ndiffering quality and NGL content of natural gas produced;\nconservation and environmental protection efforts;\nthe level of imports and exports of natural gas, oil and NGL;\npolitical instability or armed conflicts in major natural gas and oil producing regions;\nactions taken by OPEC or other major natural gas, oil and NGL producing or consuming countries;\ntechnological advancements affecting energy consumption and energy supply;\nthe level of prices and expectations about future prices of natural gas and oil;\nthe level of global natural gas and oil exploration and production;\nthe cost of exploring for, developing, producing and delivering natural gas and oil;\nthe price and quantity of foreign imports;\npolitical and economic conditions in oil producing countries, including the Middle East, Africa, South America and Russia;\nthe ability of members of OPEC to agree to and maintain oil price and production controls;\nspeculative trading in natural gas and crude oil derivative contracts;\nweather conditions and other natural disasters;\nrisks associated with operating drilling rigs;\nthe price and availability of, and competition from, alternative fuels;\ndomestic and foreign governmental regulations and taxes;\nthe continued threat of terrorism and the impact of military and other action, including U.S. military operations in the Middle East;\nsocial unrest, political instability or armed conflict in major oil and natural gas producing regions outside the U.S., such as the conflict between Ukraine and Russia;\nthe proximity, cost, availability and capacity of natural gas and oil pipelines and other transportation facilities; and\noverall domestic and global economic conditions.\nThese factors and the volatility of the energy markets make it extremely difficult to predict future natural gas, oil and NGL price movements with any certainty. If the prices of natural gas, oil and NGL decline, our operations, financial condition and level of expenditures for the development of our natural gas, oil and NGL reserves may be materially and adversely affected. Lower natural gas, oil and NGL prices may also result in a reduction in the borrowing base under our credit agreement, which may be determined at the discretion of our lenders.\nLow natural gas, oil and NGL prices for a prolonged period of time would have a material adverse effect on the Company.\nThe volatility of the energy markets makes it extremely difficult to predict future natural gas, oil and NGL price movements with any certainty. Natural gas, oil and NGL prices continued to fluctuate in fiscal year 2022, with the COVID-19 pandemic continuing to contribute to volatility and uncertainty. Our financial position, results of operations, access to capital and the quantities of natural gas, oil and NGL that may be economically produced would be negatively impacted if natural gas, oil and NGL prices were low for an extended period of time. The ways in which low prices could have a material negative effect include the following:\nsignificantly decrease the number of wells operators drill on our acreage, thereby reducing our production and cash flows;\ncash flow would be reduced, decreasing funds available for capital expenditures employed to replace reserves and maintain or increase production;\nfuture undiscounted and discounted net cash flows from producing properties would decrease, possibly resulting in recognition of impairment expense;\ncertain reserves may no longer be economic to produce, leading to lower proved reserves, production and cash flow;\naccess to sources of capital, such as equity and debt markets, could be severely limited or unavailable; and\nwe may incur a reduction in the borrowing base on our credit facility.\nThe COVID-19 pandemic may adversely affect our business, financial condition and results of operations.\nThe COVID-19 pandemic (COVID-19) created significant uncertainty and economic disruption, as well as heightened volatility in the prices of oil and natural gas. The negative impact on worldwide demand for oil and natural gas resulting from COVID-19 led to a precipitous decline in oil prices, further exacerbated by the early March 2020 failure by OPEC+ to reach an agreement over proposed oil production cuts and global storage considerations. Although OPEC+ subsequently agreed to cut oil production, crude oil prices remained depressed as a result of an increasingly utilized global storage network and the decrease in crude oil demand due to COVID-19. Since then, oil and natural gas prices have risen, but such prices are expected to continue to be volatile as a result of multiple factors, including COVID-19 and related measures taken by governments around the world, and as changes in oil and natural gas inventories, oil demand and economic performance are reported. Although government response measures to COVID-19 have generally relaxed, the ultimate impact of this pandemic is uncertain and subject to change. The extent of the impact of COVID-19 on our operational and financial performance will depend on future developments, including the reemergence of widespread COVID-19 infections, COVID-19 variants, the pandemics severity, actions to contain the disease or mitigate its impact and the effectiveness of treatments and vaccines, all of which are highly uncertain and cannot be predicted with certainty at this time. Declines in oil prices due to COVID-19 could result in the events discussed in the immediately preceding risk factor, which could have a material adverse effect on our business and financial results. We are unable to predict the ultimate adverse impact of COVID-19 on our business, which will depend on numerous evolving factors and future developments, including the pandemics ongoing effect on the demand for oil and natural gas and the response of the overall economy and the financial markets after the pandemic and response measures come to an end, the timing of which remains highly uncertain.\nThe conflict in Ukraine and related price volatility and geopolitical instability could negatively impact our business.\nIn late February 2022, Russia launched significant military action against Ukraine. The conflict has caused, and could intensify, volatility in natural gas, oil and NGL prices, and the extent and duration of the military action, sanctions and resulting market disruptions could be significant and could potentially have a substantial negative impact on the global economy and/or our business for an unknown period of time. There is evidence that the increase in crude oil prices during the first half of calendar year 2022 was partially due to the impact of the conflict between Russia and Ukraine on the global commodity and financial markets, and in response to economic and trade sanctions that certain countries have imposed on Russia. Any such volatility and disruptions may also magnify the impact of other risks described in this Risk Factors section.\nLower natural gas, oil and NGL prices or negative adjustments to natural gas, oil and NGL reserves may result in significant impairment charges.\nWe have elected to utilize the successful efforts method of accounting for our natural gas and oil exploration and development activities. Exploration expenses, including geological and geophysical costs, rentals and exploratory dry holes, are charged against income as incurred. Costs of successful wells and related production equipment and development dry holes are capitalized and amortized by property using the unit-of-production method (the ratio of natural gas, oil and NGL volumes produced to total proved or proved developed reserves) as natural gas, oil and NGL are produced.\nAll long-lived assets, principally our natural gas and oil properties, are monitored for potential impairment when circumstances indicate that the carrying value of the asset on our books may be greater than our future net cash flows. The need to test a property for impairment may result from declines in natural gas, oil and NGL sales prices or unfavorable adjustments to natural gas, oil and NGL reserves. The decision to not participate in future development on our leasehold acreage can trigger a test for impairment. Also, once assets are classified as held for sale, they are reviewed for impairment. Because of the uncertainty inherent in these factors, we cannot predict when or if future impairment charges will be recorded. If an impairment charge is recognized, cash flow from operating activities is not impacted, but net income and, consequently, stockholders equity are reduced. In periods when impairment\ncharges are incurred, it could have a material adverse effect on our results of operations. See Note 11 to the financial statements included in Item 8 - Financial Statements and Supplemental Data for further discussion on impairment under the heading Impairment.\nOur future success depends on developing our existing inventory of mineral acreage and acquiring additional mineral interests. Failure to develop our existing inventory of mineral acreage and to acquire additional mineral interests will cause reserves and production to decline materially from their current levels.\nThe rate of production from natural gas and oil properties generally declines as reserves are depleted. Our proved reserves will decline materially as reserves are produced except to the extent that we acquire additional mineral interests on properties containing proved reserves and our lessees or well operators conduct additional successful exploration and development drilling, successfully apply new technologies or identify additional behind-pipe zones (different productive zones within existing producing well bores) or secondary recovery reserves.\nDrilling for natural gas and oil invariably involves unprofitable efforts, not only from dry wells, but also from wells that are productive but do not produce sufficient reserves to return a profit after deducting drilling, completion, operating and other costs. In addition, wells that are profitable may not achieve a targeted rate of return. We rely on third-party operators interpretation of seismic data and other advanced technologies in identifying prospects and in conducting exploration and development activities. Nevertheless, prior to drilling a well, the seismic data and other technologies used do not allow operators to know conclusively whether natural gas, oil or NGL is present in commercial quantities.\nCost factors can adversely affect the economics of any project, and the eventual cost of drilling, completing and operating a well is controlled by well operators and existing market conditions. Further, drilling operations may be curtailed, delayed or canceled as a result of numerous factors, including:\nunexpected drilling conditions;\ntitle problems;\npressure or irregularities in formations;\nequipment failures or accidents;\nfires, explosions, blowouts and surface cratering;\nlack of availability to market production via pipelines or other transportation;\nadverse weather conditions;\nenvironmental hazards or liabilities;\nlack of water disposal facilities;\ngovernmental regulations;\ncost and availability of drilling rigs, equipment and services; and\nexpected sales price to be received for natural gas, oil or NGL produced from the wells.\nCompetition for acquisitions of mineral interests may increase the cost of, or cause us to refrain from, completing acquisitions. Our ability to complete acquisitions is dependent upon, among other things, our ability to obtain debt and equity financing and, in some cases, regulatory approvals. Further, these acquisitions may be in geographic regions in which we do not currently hold properties, which could result in unforeseen operating difficulties. In addition, if we enter into new geographic markets, we may be subject to additional and unfamiliar legal and regulatory requirements. Compliance with regulatory requirements may impose substantial additional obligations on us and our management, cause us to expend additional time and resources in compliance activities and increase our exposure to penalties or fines for non-compliance with such additional legal requirements. Further, the success of any completed acquisition will depend on our ability to effectively integrate the acquired business or assets into our existing\noperations. The process of integrating acquired businesses or assets may involve unforeseen difficulties and may require a disproportionate amount of our managerial and financial resources. In addition, possible future acquisitions may be larger and for purchase prices significantly higher than those paid for earlier acquisitions.\nNo assurance can be given that we will be able to identify suitable mineral interest acquisition opportunities, negotiate acceptable terms, obtain financing for acquisitions on acceptable terms or successfully acquire identified targets. Our failure to achieve consolidation savings, to integrate the acquired businesses and assets into our existing operations successfully or to minimize any unforeseen operational difficulties could have a material adverse effect on our financial condition, results of operations and cash available for distribution. The inability to effectively manage the integration of acquisitions could reduce our focus on subsequent acquisitions and current operations, which, in turn, could negatively impact our growth, results of operations and cash available for distribution.\nAny acquisition of additional mineral and royalty interests that we complete will be subject to substantial risks.\nAny acquisition involves potential risks, including, among other things:\nthe validity of our assumptions about estimated proved reserves, future production, prices, revenues, capital expenditures, operating expenses and costs;\na decrease in our liquidity by using a significant portion of our cash generated from operations or borrowing capacity to finance acquisitions;\na significant increase in our interest expense or financial leverage if we incur debt to finance acquisitions;\nthe assumption of unknown liabilities, losses or costs for which we are not indemnified or for which any indemnity we receive is inadequate;\nmistaken assumptions about the overall cost of equity or debt;\nour ability to obtain satisfactory title to the assets we acquire;\nan inability to hire, train or retain qualified personnel to manage and operate our growing business and assets; and\nthe occurrence of other significant changes, such as impairment of natural gas and oil properties, goodwill or other intangible assets, asset devaluation or restructuring charges.\nOur estimated proved reserves are based on many assumptions that may prove to be inaccurate. Any inaccuracies in these reserve estimates or underlying assumptions may materially affect the quantities and present value of our reserves.\nIt is not possible to measure underground accumulations of natural gas, oil and NGL with precision. Natural gas, oil and NGL reserve engineering requires subjective estimates of underground accumulations of natural gas, oil and NGL using assumptions concerning future prices of these commodities, future production levels and operating and development costs. In estimating our reserves, we and our Independent Consulting Petroleum Engineer must make various assumptions with respect to many matters that may prove to be incorrect, including:\nfuture natural gas, oil and NGL prices;\nunexpected complications from offset well development;\nproduction rates;\nreservoir pressures, decline rates, drainage areas and reservoir limits;\ninterpretation of subsurface conditions including geological and geophysical data;\npotential for water encroachment or mechanical failures;\nlevels and timing of capital expenditures, lease operating expenses, production taxes and income taxes, and availability of funds for such expenditures; and\neffects of government regulation.\nIf any of these assumptions prove to be incorrect, our estimates of reserves, the classifications of reserves based on risk of recovery and our estimates of the future net cash flows from our reserves could change significantly.\nOur standardized measure of oil and natural gas reserves is calculated using the 12-month average price calculated as the unweighted arithmetic average of the first-day-of-the-month individual product prices for each month within the 12-month period prior to September 30. These prices and the operating costs in effect as of the date of estimation are held flat over the life of the properties. Production and income tax expenses are deducted from this calculation of future estimated development, with the result discounted at 10% per annum to reflect the timing of future net revenue in accordance with the rules and regulations of the SEC. Over time, we may make material changes to reserve estimates to take into account changes in our assumptions and the results of actual development and production.\nThe reserve estimates made for fields that do not have a lengthy production history are less reliable than estimates for fields with lengthy records. A lack of production history may contribute to inaccuracy in our estimates of proved reserves, future production rates and the timing of development expenditures. Further, our lack of knowledge of all individual well information known to the well operators such as incomplete well stimulation efforts, restricted production rates for various reasons and up-to-date well production data, etc. may cause differences in our reserve estimates.\nBecause PUD reserves, under SEC reporting rules, may only be recorded if the wells they relate to are scheduled to be drilled within five years of the date of recording, the removal of PUD reserves that are not developed within this five-year period may be required. Removals of this nature may significantly reduce the quantity and present value of our natural gas, oil and NGL reserves. Please read Item 2 - Properties - Proved Reserves and Note 16 to the financial statements included in Item 8 - Financial Statements and Supplementary Data.\nSince forward-looking prices and costs are not used to estimate discounted future net cash flows from our estimated proved reserves, the standardized measure of our estimated proved reserves is not necessarily the same as the current market value of our estimated proved natural gas, oil and NGL reserves.\nThe timing of the development and production on our properties will affect the timing of actual future net cash flows from proved reserves, and thus their actual present value. In addition, the 10% discount factor used when calculating discounted future net cash flows, in compliance with the FASB statement on oil and natural gas producing activities disclosures, may not be the most appropriate discount factor based on interest rates in effect from time to time and risks associated with the Company, or the oil and natural gas industry in general.\nDebt level and interest rates may adversely affect our business.\nOn September 1, 2021, we entered into a four-year Credit Agreement (as amended, the Credit Agreement) with certain lenders and Independent Bank, as Administrative Agent and Letter of Credit Issuer (as defined in the Credit Agreement). The Credit Agreement replaced our prior revolving credit facility set forth in the Amended and Restated Credit Agreement dated as of November 25, 2013, as amended, among the Company, each lender party thereto, and BOKF, NA dba Bank of Oklahoma, as administrative agent, which we repaid in full and terminated. As of September 30, 2022, we had a balance of $28,300,000 drawn on our credit facility set forth in the Credit Agreement (the Credit Facility). The Credit Facilitys borrowing base is set at $50,000,000. All obligations under the Credit Agreement are secured, subject to permitted liens and other exceptions, by a first-priority security interest on substantially all of our personal property and at least 80% of the total value of the proved, developed and producing Oil and Gas Properties (as defined in the Credit Agreement) owned by the Company.\nShould we incur additional indebtedness under the Credit Facility to fund capital projects or for other reasons, there is a risk this could adversely affect our business operations as follows:\ncash flows from operating activities required to service indebtedness may not be available for other purposes;\ncovenants contained in the Credit Agreement may limit our ability to borrow additional funds, pay dividends and make certain investments;\nany limitation on the borrowing of additional funds may affect our ability to fund capital projects and may also affect how we will be able to react to economic and industry changes;\na significant increase in the interest rate under the Credit Facility will limit funds available for other purposes; and\nchanges in prevailing interest rates may affect our capability to meet our interest payments, as the Credit Facility bears interest at floating rates.\nThe borrowing base of our Credit Facility is subject to periodic redetermination and is based in part on natural gas, oil and NGL prices. A lowering of our borrowing base because of lower natural gas, oil or NGL prices, or for other reasons, could require us to repay indebtedness in excess of the established borrowing base, or we might need to further secure the debt with additional collateral. Our ability to meet any debt obligations depends on our future performance. General business, economic, financial and product pricing conditions, along with other factors, affect our future performance, and many of these factors are beyond our control. In addition, our failure to comply with the restrictive covenants relating to our Credit Facility could result in a default, which might adversely affect our business, financial condition, results of operations and cash flows.\nWe may incur losses as a result of title defects in the properties we own.\nConsistent with industry practice, we do not have current abstracts or title opinions on all of our mineral acreage and, therefore, cannot be certain that we have unencumbered title to all of these properties. Our failure to cure any title defects that may exist may adversely impact our ability in the future to increase production and reserves. There is no assurance that we will not suffer a monetary loss from title defects or title failure. Additionally, undeveloped acreage has greater risk of title defects than developed acreage. If there are any title defects or defects in assignment of leasehold rights in properties in which we hold an interest, we may suffer a financial loss.\nCompetition in the oil and natural gas industry is intense, and most of our competitors have greater financial and other resources than we do.\nWe compete in the highly competitive areas of natural gas and oil acquisition, development, exploration and production. We face intense competition from both major and independent oil and natural gas companies to acquire desirable producing properties, new properties for future exploration and human resource expertise necessary to effectively develop properties. We also face similar competition in obtaining sufficient capital to maintain or grow production.\nWe may be subject to information technology system failures, network disruptions, cyber-attacks or other breaches in data security.\nThe oil and natural gas industry in general has become increasingly dependent upon digital technologies to conduct day-to-day operations, including certain exploration, development and production activities. We use digital technology to estimate quantities of natural gas, oil and NGL reserves, process and record financial data and communicate with our employees and third parties. Power, telecommunication or other system failures due to hardware or software malfunctions, computer viruses, vandalism, terrorism, natural disasters, fire, human error or by other means could significantly affect our ability to conduct our business. Though we have implemented complex network security measures, stringent internal controls and maintain offsite backup of all crucial electronic data, there cannot be absolute assurance that a form of system failure or data security breach will not have a material adverse effect on our financial condition and operations results. For instance, unauthorized access to our reserves information or other proprietary or commercially sensitive information could lead to data corruption, communication interruption or other disruptions in our operations or planned business transactions, any of which could have a material adverse impact on our results of operations. Further, as cyber-attacks continue to evolve, we may be required to expend significant additional resources to continue to modify or enhance our protective measures or to investigate and remediate any vulnerability to cyber-attacks.\nOur derivative activities may reduce the cash flow received for natural gas and oil sales.\nIn order to manage exposure to price volatility on our natural gas and oil production, we currently, and may in the future, enter into natural gas and oil derivative contracts for a portion of our expected production. Natural gas and oil price derivatives may limit the cash flow we actually realize and therefore reduce our ability to fund future projects. None of our natural gas and oil price derivative contracts are designated as hedges for accounting purposes; therefore, all changes in fair value of derivative contracts are reflected in earnings. Accordingly, these fair values may vary significantly from period to period, materially affecting reported earnings. In addition, this type of derivative contract can limit the benefit we would receive from increases in the prices for natural gas and oil. The fair value of our natural gas and oil derivative instruments outstanding as of September 30, 2022, was a net liability of $8,561,191.\nThere is risk associated with our derivative contracts that involves the possibility that counterparties may be unable to satisfy contractual obligations to us. If any counterparty to our derivative instruments were to default or seek bankruptcy protection, it could subject a larger percentage of our future natural gas and oil production to commodity price changes and could have a negative effect on our ability to fund future acquisitions.\nPlease read Item 7A - Quantitative and Qualitative Disclosures about Market Risk and Note 1 and 12 to the financial statements included in Item 8 - Financial Statements and Supplementary Data for additional information regarding derivative contracts.\nThere are inherent limitations in all control systems, and misstatements due to error or fraud could occur and not be detected.\nThe ongoing internal control provisions of Section 404 of the Sarbanes-Oxley Act of 2002 require us to identify material weaknesses in internal control over financial reporting, which is a process to provide reasonable assurance regarding the reliability of financial reporting for external purposes in accordance with GAAP. Our management, including our principal executive officer and principal financial officer, does not expect that our internal controls and disclosure controls will prevent all errors and all fraud. A control system, no matter how well conceived and operated, can provide only reasonable, not absolute, assurance that the objectives of the control system are met. In addition, the design of a control system must reflect the fact that there are resource constraints and the benefit of controls must be relative to their costs. Because of the inherent limitations in all control systems, no evaluation of controls can provide absolute assurance that all control issues and instances of fraud in our Company have been detected. These inherent limitations include the realities that judgments in decision-making can be faulty and that breakdowns can occur because of simple errors or mistakes. Further, controls can be circumvented by individual acts of some persons, by collusion of two or more persons, or by management override of the controls. The design of any system of controls is also based in part upon certain assumptions about the likelihood of future events, and there can be no assurance that any design will succeed in achieving our stated goals under all potential future conditions. Over time, a control may be inadequate because of changes in conditions, such as growth of the company or increased transaction volume, or the degree of compliance with the policies or procedures may deteriorate. Because of inherent limitations in a cost-effective control system, misstatements due to error or fraud may occur in the future and not be detected.\nIn addition, discovery and disclosure of a material weakness, such as the material weakness we previously discovered and disclosed, by definition, could have a material adverse impact on our financial statements. Such an occurrence could negatively affect our business and affect how our stock trades. This could, in turn, negatively affect our ability to access public equity or debt markets for capital.\nFuture legislative or regulatory changes may result in increased costs and decreased revenues, cash flows and liquidity.\nCompanies that operate wells in which we own a working interest are subject to extensive federal, state and local regulation. We, as a working interest owner, are therefore indirectly subject to these same regulations. New or changed laws and regulations such as those described below could have a material adverse effect on our business. In particular, changes in law or regulation related to hydraulic fracturing or greenhouse gases could potentially increase capital, compliance and operating costs significantly, as well as halt or delay the further development of oil and gas reserves on our properties.\nFederal Income Taxation\nWe are subject to U.S. federal income tax, as well as income or capital-based taxes in various states, and our operating cash flow is sensitive to the amount of income taxes we must pay. Income taxes are assessed on our revenue after consideration of all allowable deductions and credits. Changes in the types of earnings that are subject to income tax, the types of costs that are considered allowable deductions or the rates assessed on our taxable earnings would all impact our income taxes and resulting operating cash flow.\nCertain beneficial provisions within the Tax Cuts and Jobs Act passed in December 2017 are set to be reduced beginning in 2023 and beyond, such as a reduction in the amount of immediate bonus depreciation available for qualified property placed into service.\nThe Inflation Reduction Act of 2022 (the IRA), which was signed into law in August 2022, includes several provisions that are specifically applicable to corporations. The IRA includes an annual 15% minimum tax on corporations that have average annual adjusted financial statement income in excess of $1 billion over a three year period. The IRA also includes a 1% tax on publicly traded corporations on the fair market value of stock repurchased during any taxable year. Such tax applies to the extent such buybacks exceed $1 million during such year, which buyback value may be offset by other stock issuances.\nAdditionally, further revisions to U.S. tax law, such as a reversal of the corporate income tax rate reduction, the repeal of the percentage depletion allowance, the repeal of expensing for intangible drilling costs or the repeal of enhanced bonus depreciation, could have a material adverse effect on our business. Moreover, the U.S. Department of Treasury has broad authority to issue regulations and interpretative guidance that may significantly impact how we apply U.S. tax law, with a corresponding impact on the results of our operations for the periods affected.\nOklahoma Taxation\nOklahoma imposes a gross production tax, or severance tax, on the value of natural gas, oil and NGL produced within the state. Under Oklahoma law, the gross production tax rate on the first three years of a horizontal wells production is 5.2% and 7% thereafter. Future changes to Oklahoma production taxes could affect the profitability of wells producing natural gas, oil and NGL in Oklahoma.\nHydraulic Fracturing and Water Disposal\nThe vast majority of natural gas and oil wells drilled in recent years have been, and future wells are expected to be, hydraulically fractured as a part of the process of completing the wells and putting them on production. This is true of the wells drilled in which we own an interest. Hydraulic fracturing is a process that involves pumping water, sand and additives at high pressure into rock formations to stimulate natural gas and oil production. In developing plays where hydraulic fracturing, which requires large volumes of water, is necessary for successful development, the demand for water may exceed the supply. A lack of readily available water or a significant increase in the cost of water could cause delays or increased completion costs.\nIn addition to water, hydraulic fracturing fluid contains chemical additives designed to optimize production. Well operators are being required in certain states to disclose the components of these additives. Additional states and the federal government may follow with similar requirements or may restrict the use of certain additives. This could result in more costly or less effective development of wells.\nOnce a well has been hydraulically fractured, the fluid produced from the fractured wells must be either treated for reuse or disposed of by injecting the fluid into disposal wells. Injection well disposal processes have been, and continue to be, studied to determine the extent of correlation between injection well disposal and the occurrence of earthquakes. Certain studies have concluded there is a correlation, and this has resulted in the cessation of or the reduction of injection rates in certain water disposal wells, especially in northern Oklahoma.\nEfforts to regulate hydraulic fracturing and fluid disposal continue at the local, state and federal level. New regulations are being considered, including limiting water withdrawals and usage, limiting water disposition, restricting which additives may be used, implementing statewide hydraulic fracturing moratoriums and temporary or permanent bans in certain environmentally sensitive areas. Public sentiment against hydraulic fracturing and fluid disposal and shale production could result in more stringent permitting and compliance requirements. Consequences of these actions could potentially increase capital, compliance and operating costs significantly, as well as delay or halt the further development of gas and oil reserves on our properties. Though the Biden administration has not proposed the outright ban of hydraulic fracturing, the administration has proposed significant regulations regarding methane emissions that could potentially affect new and existing wells, including those that are hydraulically fractured. The proposed methane rule is discussed in more detail in the Climate Change section, below.\nAny of the above factors could have a material adverse effect on our financial position, results of operations or cash flows.\nClimate Change\nCertain studies have suggested that emission of certain gases, commonly referred to as greenhouse gases, may be impacting the earths climate. Methane, the primary component of natural gas, and carbon dioxide, a byproduct of burning natural gas and oil, are examples of greenhouse gases. Various state governments and regional organizations are considering enacting new legislation and promulgating new regulations governing or restricting the emission of greenhouse gases from stationary sources such as gas and oil production equipment and operations.\nLegislation to regulate greenhouse gas emissions has periodically been introduced in the U.S. Congress, and such legislation may be proposed in the future. In addition, in December 2015, the United States joined the international\ncommunity at the 21st Conference of the Parties of the United Nations Framework Convention on Climate Change in Paris, France, in preparing an agreement which set greenhouse gas emission reduction goals every five years beginning in 2020. This Paris Agreement was signed by the United States in April 2016 and entered into force in November 2016. To help achieve these reductions, federal agencies addressed climate change through a variety of administrative actions. The EPA issued greenhouse gas monitoring and reporting regulations that cover natural gas and oil facilities, among other industries. However, on June 1, 2017, the President of the United States announced that the United States planned to withdraw from the Paris Agreement and to seek negotiations to either reenter the Paris Agreement on different terms or establish a new framework agreement. The Paris Agreement provides for a four-year exit process beginning when it took effect in November 2016, which resulted in an exit in November 2020. While the U.S. officially exited the Paris Agreement in November of 2020, the Biden administration immediately rejoined the Paris Agreement after taking office in January of 2021. On January 20, 2021, President Biden signed an executive order triggering a 30-day process to re-enter the agreement.\nMore recently, the EPA issued a proposed rule to regulate methane emissions from the oil and gas industry. If adopted, states will have authority to incorporate the emission guidelines proposed by EPA or to adopt their own standards that achieve the same degree of emission limitations. The proposed rule applies to the Crude Oil and Natural Gas source category, including the production, processing, transmission, and storage segments. If adopted, these rules would result in additional operating costs, such as costs to purchase and operate emissions controls or lower emitting equipment and costs to implement monitoring requirements.\nSeismic Activity\nEarthquakes in northern and central Oklahoma and elsewhere have prompted concerns about seismic activity and possible relationships with the energy industry. Legislative and regulatory initiatives intended to address these concerns may result in additional levels of regulation that could lead to operational delays, increase operating and compliance costs or otherwise adversely affect operations.\nThe adoption of derivatives legislation by the U.S. Congress could have an adverse effect on us and our ability to hedge risks associated with our business.\nThe Dodd-Frank Act requires the CFTC (the United States Commodity Futures Trading Commission) and the SEC to promulgate rules and regulations establishing federal oversight and regulation of the over-the-counter derivatives market and entities that participate in that market including swap clearing and trade execution requirements. New or modified rules, regulations or requirements may increase the cost and availability to the counterparties of our hedging and swap positions which they can make available to us, as applicable, and may further require the counterparties to our derivative instruments to spin off some of their derivative activities to separate entities which may not be as creditworthy as the current counterparties. Any changes in the regulations of swaps may result in certain market participants deciding to curtail or cease their derivative activities.\nWhile many rules and regulations have been promulgated and are already in effect, other rules and regulations remain to be finalized or effectuated and, therefore, the impact of those rules and regulations on us is uncertain at this time. The Dodd-Frank Act, and the rules promulgated thereunder, could (i) significantly increase the cost, or decrease the liquidity, of energy-related derivatives that we use to hedge against commodity price fluctuations (including requirements to post collateral), (ii) materially alter the terms of derivative contracts, (iii) reduce the availability of derivatives to protect against risks we encounter and (iv) increase our exposure to less creditworthy counterparties.\nRisks Related to our Third-Party Operators\nWe cannot control activities on our properties.\nWe do not operate any of the properties in which we have an interest and have very limited ability to exercise influence over the third-party operators of these properties. Our dependence on the third-party operators of our properties, and on the cooperation of other working interest owners in these properties, could negatively affect the following:\nour return on capital used in drilling or property acquisition;\nour production and reserve growth rates;\ncapital required to workover or recomplete wells;\nsuccess and timing of drilling, development and exploitation activities on our properties;\ncompliance with environmental, safety and other regulations;\nlease operating expenses; and\nplugging and abandonment costs, including well-site restorations.\nDependency on each operators judgment, expertise and financial resources could result in unexpected future costs, lost revenues and/or capital restrictions, to the extent they would cumulatively have a material adverse effect on our financial position and results of operations.\nThe natural gas and oil drilling and producing operations of our third-party operators involve various risks.\nBecause we do not operate our properties, our business relies heavily upon our third-party operators and their operational effectiveness. Through our third-party operators, we are subject to all the risks normally incident to the operation and development of natural gas and oil properties, including:\nwell blowouts, cratering, explosions and human related accidents;\nmechanical, equipment and pipe failures;\nadverse weather conditions, earthquakes and other natural disasters;\ncivil disturbances and terrorist activities;\nnatural gas, oil and NGL price reductions;\nenvironmental risks stemming from the use, production, handling and disposal of water, waste materials, hydrocarbons and other substances into the air, soil or water;\ntitle problems;\nlimited availability of financing;\nmarketing related infrastructure, transportation and processing limitations; and\nregulatory compliance issues.\nAs a non-operator, we are also dependent on third-party operators and the contractors they hire for operational safety, environmental safety and compliance with regulations of governmental authorities.\nWe maintain insurance against many potential losses or liabilities arising from well operations in accordance with customary industry practices and in amounts believed by management to be prudent. However, this insurance does not protect us against all risks. For example, we do not maintain insurance for business interruption, acts of war or terrorism. Additionally, pollution and environmental risks generally are not fully insurable. These risks could give rise to significant uninsured costs that might have a material adverse effect on our business condition and financial results.\nWe may experience delays in the payment of royalties and be unable to replace operators that do not make required royalty payments, and we may not be able to terminate our leases with defaulting lessees if any of the operators on those leases declare bankruptcy.\nA failure on the part of the operators to make royalty payments gives us the right to terminate the lease, repossess the property and enforce payment obligations under the lease. If we repossessed any of our properties, we would seek a replacement operator. However, we might not be able to find a replacement operator and, if we did, we might not be able to enter into a new lease on favorable terms within a reasonable period of time. In addition, the outgoing operator could be subject to a proceeding under title 11 of the United States Code (the Bankruptcy Code), in which case our right to enforce or terminate the lease for any defaults,\nincluding non-payment, may be substantially delayed or otherwise impaired. In general, in a proceeding under the Bankruptcy Code, the bankrupt operator would have a substantial period of time to decide whether to ultimately reject or assume the lease, which could prevent the execution of a new lease or the assignment of the existing lease to another operator. In the event that the operator rejected the lease, our ability to collect amounts owed would be substantially delayed, and our ultimate recovery may be only a fraction of the amount owed or nothing. In addition, if we are able to enter into a new lease with a new operator, the replacement operator may not achieve the same levels of production or sell natural gas or oil at the same price as the operator it replaced.\nShortages of oilfield equipment, services, qualified personnel and resulting cost increases could adversely affect results of operations.\nThe demand for qualified and experienced field personnel, geologists, geophysicists, engineers and other professionals in the oil and natural gas industry can fluctuate significantly, often in correlation with natural gas, oil and NGL prices, resulting in periodic shortages. When demand for rigs and equipment increases due to an increase in the number of wells being drilled, there have been shortages of drilling rigs, hydraulic fracturing equipment and personnel and other oilfield equipment. Higher natural gas, oil and NGL prices generally stimulate increased demand for, and result in increased prices of, drilling rigs, crews and associated supplies, equipment and services. These shortages or price increases could negatively affect the ability to drill wells and conduct ordinary operations by the operators of our wells, resulting in an adverse effect on our financial condition, cash flow and operating results.\nThe marketability of natural gas and oil production is dependent upon transportation, pipelines and refining facilities, which neither we nor many of our operators control. Any limitation in the availability of those facilities could interfere with our or our operators ability to market our or our operators production and could harm our business.\nThe marketability of our or our operators production depends in part on the availability, proximity and capacity of pipelines, tanker trucks and other transportation methods and processing and refining facilities owned by third parties. The amount of oil that can be produced and sold is subject to curtailment in certain circumstances, such as pipeline interruptions due to scheduled and unscheduled maintenance, excessive pressure, physical damage or lack of available capacity on these systems, tanker truck availability and extreme weather conditions. Also, the shipment of our or our operators natural gas and oil on third-party pipelines may be curtailed or delayed if it does not meet the quality specifications of the pipeline owners. The curtailments arising from these and similar circumstances may last from a few days to several months. In many cases, we or our operators are provided only with limited, if any, notice as to when these circumstances will arise and their duration. Any significant curtailment in gathering system or transportation, processing or refining-facility capacity could reduce our or our operators ability to market oil production and have a material adverse effect on our financial condition, results of operations and cash distributions to stockholders. Our or our operators access to transportation options and the prices we or our operators receive can also be affected by federal and state regulation-including regulation of oil production, transportation and pipeline safety-as well as by general economic conditions and changes in supply and demand. In addition, the third parties on whom we or our operators rely for transportation services are subject to complex federal, state, tribal and local laws that could adversely affect the cost, manner or feasibility of conducting our business.\nWe may be negatively impacted by inflation.\nIncreases in inflation could have an adverse effect on us. Current and future inflationary effects may be driven by, among other things, supply chain disruptions and governmental stimulus or fiscal policies, and geopolitical instability, including the ongoing conflict between the Ukraine and Russia. Continuing increases in inflation could increase our costs of labor and other costs related to our business, which could have an adverse impact on our business, financial position, results of operations and cash flows. Inflation has also resulted in higher interest rates in the U.S., which could increase our cost of debt borrowing in the future.\nRisks Related to the Oil and Gas Industry\nConcerns over general economic, business or industry conditions may have a material adverse effect on our results of operations, financial condition and cash available for distribution.\nConcerns over global economic conditions, energy costs, geopolitical issues, inflation, the availability and cost of credit in the European, Asian and U.S. markets contribute to economic uncertainty and diminished expectations for the global economy. These factors, combined with volatile prices of natural gas, oil and NGL, volatility in consumer confidence and job markets, may result in an economic slowdown or recession. In addition, continued hostilities in the Middle East and the occurrence or threat of terrorist attacks in the United States or other countries could adversely affect the economies of the United States and other countries. Concerns about global economic growth have had a significant adverse impact on global financial markets and commodity prices. If the economic climate in the United States or abroad deteriorates, worldwide demand for petroleum products could diminish, which could impact the price at which natural gas, oil and NGL from our properties are sold, affect the ability of vendors, suppliers and customers associated\nwith our properties to continue operations and ultimately adversely impact our results of operations, financial condition and cash available for distribution.\nConservation measures and technological advances could reduce demand for natural gas and oil.\nFuel conservation measures, alternative fuel requirements, increasing consumer demand for alternatives to natural gas and oil, technological advances in fuel economy and energy generation devices could reduce demand for natural gas and oil. The impact of the changing demand for natural gas and oil services and products may have a material adverse effect on our business, financial condition, results of operations and cash available for distribution.\nRisks Related to an Investment in our Common Stock\nThe issuance of additional shares of our Common Stock could cause the market price of our Common Stock to decline and may result in dilution to our existing stockholders.\nWe filed a shelf registration statement on Form S-3 on October 19, 2020, and amendments thereto on December 10, 2020, February 8, 2021, and February 19, 2021, which the SEC declared effective on February 24, 2021 (the February 2021 S-3). The February 2021 S-3 allows us to issue up to $75 million in securities including Common Stock, preferred stock, debt securities, warrants and units, and is intended to provide us with increased financial flexibility and more efficient access to the capital markets. On August 25, 2021, we entered into an At-The-Market Equity Offering Sales Agreement with Stifel, as sales agent and/or principal, pursuant to which we may offer and sell, from time to time through or to Stifel, up to 3,000,000 shares of our Common Stock under the February 2021 S-3. We also issue shares of our Common Stock in private transactions from time to time. During fiscal year 2022, we issued 1,519,481 shares of Common Stock in a private transaction on December 1, 2021, as consideration for the acquisition of certain mineral and royalty assets. These shares were registered with the SEC through the filing of a resale registration statement on Form S-3, which the SEC declared effective on January 27, 2022.\nWe cannot predict the effect, if any, that market sales of these securities or the availability of the securities will have on the prevailing market price of our Common Stock from time to time. Substantial sales of shares of our Common Stock or other securities in the public market, or the perception that those sales could occur, may cause the market price of our Common Stock to decline. Such a decrease in our share price could in turn impair our ability to raise capital through the sale of additional equity securities. In addition, any such decline may make it more difficult for stockholders to sell shares of our Common Stock at prices they deem acceptable.\nAs of September 30, 2022, we were authorized to issue an aggregate of 54,010,500 shares of capital stock, consisting of 54,000,500 shares of Common Stock and 10,000 shares of preferred stock, par value $0.01666 per share (Preferred Stock), of which 36,528,844 shares of Common Stock and no shares of Preferred Stock were issued and outstanding on December 6, 2022. Future issuances of our Common Stock or Preferred Stock, or other securities convertible into our Common Stock or Preferred Stock, may result in significant dilution to our existing stockholders. Significant dilution would reduce the proportionate ownership and voting power held by our existing stockholders.\nWe may reduce or suspend our dividend in the future.\nWe have paid a quarterly dividend for many years. Our most recent quarterly dividend was $0.02 per share, and we have paid a quarterly dividend ranging from $0.01 per share or $0.04 per share for the past three years. In the future our Board may, without advance notice, determine to reduce or suspend our dividend in order to maintain our financial flexibility and best position us for long-term success. The declaration and amount of future dividends is at the discretion of our Board and will depend on our financial condition, results of operations, cash flows, prospects, industry conditions, capital requirements and other factors and restrictions our Board deems relevant. The likelihood that dividends will be reduced or suspended is increased during periods of prolonged market weakness. In addition, our ability to pay dividends may be limited by agreements governing our indebtedness now or in the future. Although we do not currently have plans to reduce or suspend our dividend, there can be no assurance that we will not reduce our dividend or that we will continue to pay a dividend in the future.\nIf we cannot meet the NYSE continued listing requirements, the NYSE may delist our Common Stock.\nOur Common Stock is currently listed on the NYSE. In the future, if we are unable to meet the continued listing requirements of the NYSE, including, among other things, (i) the requirement of maintaining a minimum average closing price of $1.00 per share over a consecutive 30 trading-day period and (ii) the requirement of maintaining an average market capitalization of not less than $50 million over a 30 trading-day period with, at the same time, stockholders equity not less than $50 million, we would fall below compliance standards and risk having our Common Stock delisted. In addition, in the event of an abnormally low share price of our\nCommon Stock and/or we fail to maintain an average market capitalization of at least $15 million over a 30-trading day period, we would be subject to immediate delisting under the NYSEs rules without any opportunity to cure. A delisting of our Common Stock could negatively impact us by, among other things, the following:\ncausing our shares to be transferred to a more limited market than the NYSE, which could affect the market price, trading volume, liquidity and resale price of such shares;\nreducing the number of investors, including institutional investors, willing to hold or acquire our Common Stock, which could negatively impact our ability to raise equity;\ndecreasing the amount of news and analyst coverage relating to us;\nlimiting our ability to issue additional securities, obtain additional financing or pursue strategic restructuring, refinancing or other transactions; and\nimpacting our reputation and, as a consequence, our business. ITEM 1B. Staff Comments\nNone ITEM 2. Properties\nGeneral Background\nWe are focused on perpetual natural gas and oil mineral ownership in resource plays in the United States. As part of our evolution as a company, we also own interests in leasehold acreage and non-operated working interests in natural gas and oil properties.\nAt September 30, 2022, our principal properties consisted of (i) perpetual ownership of 244,739 net mineral acres, held principally in Oklahoma, Texas, Louisiana, North Dakota and Arkansas; (ii) leases on 16,260 net acres primarily in Oklahoma; and (iii) working interests, royalty interests or both in 6,362 producing natural gas and oil wells and 172 wells in the process of being drilled or completed.\nManagements Business Strategy Related to Properties\nOur primary focus continues to be on perpetual natural gas and oil mineral ownership and growth through mineral acquisitions and the development of our significant mineral acreage inventory in our core focus areas. In accordance with this strategy, we no longer participate in new development on our mineral or leasehold acreage with a cost-bearing working interest. We believe that our strategy to focus on mineral ownership is the best path to giving our stockholders the greatest risk-weighted returns on their investments.\nOur goal is to increase stockholder value through the active management of our fee mineral and leasehold assets. We continue to grow our mineral fee holdings by acquiring mineral acreage, in the core areas of resource plays with substantial undeveloped opportunities, that meets or exceeds our corporate return threshold. We have an active program in place focused on leasing open acreage to generate additional lease bonus revenue and future royalty revenue. We also generate additional cash flows through opportunistically divesting unleased minerals.\nTitle to Properties\nConsistent with industry practice, we do not have current abstracts or title opinions on all of our mineral acreage and, therefore, cannot be certain that we have unencumbered title to all of these properties. In recent years, a few insignificant challenges have been made against our fee title to our acreage.\nAcreage\nMineral Interests Owned\nThe following table of mineral interests owned reflects, in each respective state, the number of (i) net and gross acres owned by the Company, (ii) net and gross producing acres owned by the Company, (iii) net and gross acres leased to others by the Company and (iv) net and gross acres open (unleased) as of September 30, 2022.\nState\nNet Acres\nGross Acres\nNet Acres Producing\n(1)\nGross\nAcres\nProducing\n(1)\nNet Acres\nLeased to\nOthers (2)\nGross\nAcres\nLeased to\nOthers (2)\nNet Acres\nUnleased\n(3)\nGross Acres\nUnleased\n(3)\nOklahoma\n110,241\n1,067,706\n47,953\n440,221\n3,482\n29,345\n58,807\n598,139\nTexas\n33,077\n276,069\n5,092\n74,703\n2,053\n12,411\n25,931\n188,955\nLouisiana\n2,299\n32,574\n2,299\n32,574\n-\n-\n-\n-\nNorth Dakota\n14,304\n90,362\n2,774\n26,750\n-\n-\n11,530\n63,613\nArkansas\n11,754\n55,417\n7,227\n32,157\n4,518\n23,180\nOther\n73,064\n257,585\n1,076\n7,700\n71,920\n249,485\nTotal:\n244,739\n1,779,713\n66,421\n614,105\n5,612\n42,236\n172,706\n1,123,372\n(1)Producing represents the mineral acres in which PHX owns a royalty or working interest in a producing well.\n(2)Leased represents the mineral acres owned by PHX that are leased to third parties but not producing.\n(3)Unleased represents mineral acres owned by PHX that are not leased or in production.\nLeases\nThe following table reflects our net mineral acres leased from others, lease expiration dates, and net leased acres held by production related to leasehold as of September 30, 2022.\nNet Acres Expiring\nState\nNet\nAcres\nNet Acres\nHeld by\nProduction\nOklahoma\n11,487\n-\n-\n-\n-\n-\n11,487\nTexas\n2,200\n-\n-\n-\n-\n-\n2,200\nOther\n1,083\n-\n-\n-\n-\n-\n1,083\nTOTAL\n14,770\n-\n-\n-\n-\n-\n14,770\nThe following table reflects our net mineral acres leased from others, lease expiration dates, and net leased acres held by production related to our overriding royalty interests as of September 30, 2022.\nNet Acres Expiring\nState\nNet\nAcres\nNet Acres\nHeld by\nProduction\nLouisiana\n-\n-\n-\n-\n-\nOklahoma\n1,288\n-\n-\n-\n-\n-\n1,288\nTexas\n-\n-\n-\n-\n-\nTOTAL\n1,490\n-\n-\n-\n-\n-\n1,490\nProved Reserves\nSummary of Proved Reserves\nThe following tables summarize estimates of total and royalty only proved reserves of natural gas, oil and NGL held by the Company as of September 30, 2022, compared to the two preceding year ends, using prices and costs under existing economic conditions. Proved reserves are located onshore within the contiguous United States and are principally made up of small interests in 6,362 wells, which are predominately located in the Mid-Continent region. Other than this Annual Report, our reserve estimates are not filed with any federal agency.\nSummary of Proved Natural Gas and Oil Reserves\nNatural Gas\nOil\nNGL\nTotal Proved\n(Mcf)\n(Bbl)\n(Bbl)\n(Mcfe)\nNet Proved Developed Reserves\nSeptember 30, 2022\n50,304,185\n1,275,853\n1,698,046\n68,147,579\nSeptember 30, 2021\n60,287,881\n1,439,860\n1,467,092\n77,729,593\nSeptember 30, 2020\n40,924,083\n1,148,989\n1,135,864\n54,633,201\nNet Proved Undeveloped Reserves\nSeptember 30, 2022\n11,933,021\n106,924\n64,637\n12,962,387\nSeptember 30, 2021\n4,664,787\n64,980\n34,761\n5,263,233\nSeptember 30, 2020\n1,448,690\n184,668\n83,993\n3,060,656\nNet Total Proved Reserves\nSeptember 30, 2022\n62,237,206\n1,382,777\n1,762,683\n81,109,966\nSeptember 30, 2021\n64,952,668\n1,504,840\n1,501,853\n82,992,826\nSeptember 30, 2020\n42,372,773\n1,333,657\n1,219,857\n57,693,857\nSummary of Proved Natural Gas and Oil Royalty Reserves\nNatural Gas\nOil\nNGL\nTotal Proved\n(Mcf)\n(Bbl)\n(Bbl)\n(Mcfe)\nNet Proved Developed Royalty Interest Reserves\nSeptember 30, 2022\n32,055,133\n607,727\n685,166\n39,812,491\nSeptember 30, 2021\n23,978,345\n667,457\n527,142\n31,145,939\nSeptember 30, 2020\n14,559,704\n526,934\n408,407\n20,171,750\nNet Proved Undeveloped Royalty Interest Reserves\nSeptember 30, 2022\n11,933,021\n106,924\n64,637\n12,962,387\nSeptember 30, 2021\n4,664,782\n64,979\n34,762\n5,263,228\nSeptember 30, 2020\n1,448,696\n184,666\n83,999\n3,060,686\nNet Total Proved Royalty Interest Reserves\nSeptember 30, 2022\n43,988,154\n714,651\n749,803\n52,774,878\nSeptember 30, 2021\n28,643,127\n732,436\n561,904\n36,409,167\nSeptember 30, 2020\n16,008,400\n711,600\n492,406\n23,232,436\nExploration and development of our natural gas and oil properties is conducted by natural gas and oil exploration and production companies, primarily larger independent operating companies. We do not operate any of our natural gas and oil properties.\nFor the year ended September 30, 2022, our net total proved reserves decreased by 1.9 Bcfe, as compared to September 30, 2021. The decrease in total proved reserves from September 30, 2021 to September 30, 2022 is attributable to a combination of the following factors:\nThe sale of 17.6 Bcfe proved developed, consisting predominately of working interest properties in the Fayetteville Shale play in Arkansas and the Arkoma Stack play and Western Anadarko Basin in Oklahoma.\nProduction of 9.6 Bcfe from our natural gas and oil properties.\nNegative performance revisions of 3.3 Bcfe (comprised of all proved developed), principally due to steep declines following workovers on high working interest Woodford Shale wells in the Arkoma Stack play in Oklahoma and steeper declines on Bossier Shale wells drilled in the last two years as compared to Haynesville Shale wells in the Haynesville play of Texas.\nThe acquisition of 15.6 Bcfe, predominately of royalty interest properties in the active drilling programs of the Haynesville Shale play in east Texas and western Louisiana and the Mississippi and Woodford Shale intervals in the SCOOP play in the Ardmore basin of Oklahoma, of which 7.0 Bcfe were proved developed and 8.6 Bcfe were proved undeveloped.\nPositive pricing revisions of 8.1 Bcfe of proved developed revisions due to natural gas and oil wells extending their economic limits later than was projected in 2021 due to higher commodity prices.\nReserve extensions, discoveries and other additions of 4.9 Bcfe (comprised of 1.7 Bcfe proved developed and 3.2 Bcfe proved undeveloped reserves) principally resulting from: (i) our royalty interest ownership in the ongoing development of unconventional natural gas, utilizing horizontal drilling, in the Haynesville Shale play of East Texas and Western Louisiana; and (ii) our royalty interest ownership in the ongoing development of unconventional natural gas, oil and NGL utilizing horizontal drilling in the Mississippi and Woodford Shale intervals in the SCOOP and STACK plays in the Ardmore and Anadarko basins of Oklahoma.\nProved Undeveloped Reserves\nThe following details the changes in proved undeveloped reserves for fiscal year 2022 (Mcfe):\nBeginning proved undeveloped reserves\n5,263,233\nProved undeveloped reserves transferred to proved developed\n(4,132,227\n)\nRevisions\n63,036\nExtensions and discoveries\n3,164,434\nSales\n-\nPurchases\n8,603,911\nEnding proved undeveloped reserves\n12,962,387\nDuring fiscal year 2022, total net PUD reserves increased by 7.7 Bcfe. In fiscal year 2022, a total of 4.1 Bcfe (79% of the beginning balance) was transferred to proved developed. The remaining balance of approximately 11.8 Bcfe (225% of the beginning balance) of positive revisions to PUD reserves consist of acquisitions of 8.6 Bcfe in the Haynesville Shale in Texas and Louisiana and Meramec and Woodford SCOOP play in Oklahoma and additions and extensions of 3.2 Bcfe within the active drilling program areas of (i) the Haynesville Shale in Texas and Louisiana, (ii) the SCOOP Meramec and Woodford in Oklahoma, (iii) the STACK Meramec and Woodford in Oklahoma and (iv) the Bakken in North Dakota.\nWe anticipate that all our current PUD locations will be drilled and converted to PDP within five years of the date they were added. However, PUD locations and associated reserves, which are no longer projected to be drilled within five years from the date they were added to PUD reserves, will be removed as revisions at the time that determination is made. In the event that there are undrilled PUD locations at the end of the five-year period, it is our intent to remove the reserves associated with those locations from our proved reserves as revisions.\nEstimated Future Net Cash Flows\nSet forth below are estimated future net cash flows with respect to our net proved reserves (based on the estimated units set forth above in Proved Reserves) for each of the years indicated, and the present value of such estimated future net cash flows,\ncomputed by applying a 10% discount factor as required by SEC rules and regulations. We follow the SEC rule, Modernization of Oil and Gas Reporting Requirements. In accordance with the SEC rule, the estimated future net cash flows were computed using the 12-month average price calculated as the unweighted arithmetic average of the first-day-of-the-month individual product prices for each month within the 12-month period prior to September 30 held flat over the life of the properties and applied to future production of proved reserves less estimated future development and production expenditures for these reserves. The amounts presented are net of operating costs and production taxes levied by the respective states. Prices used for determining future cash flows from natural gas, oil and NGL as of September 30, 2022, 2021, and 2020, were as follows: in fiscal year 2022, $6.41 for natural gas, $90.33 for oil and $38.09 for NGL; in fiscal year 2021, $2.79/Mcf for natural gas, $56.51/Bbl for oil and $20.58/Bbl for NGL; and in fiscal year 2020, $1.62/Mcf for natural gas, $40.18/Bbl for oil and $9.95/Bbl for NGL. These future net cash flows based on SEC pricing rules should not be construed as the fair market value of our reserves. A market value determination would need to include many additional factors, including anticipated natural gas, oil and NGL price and production cost increases or decreases, which could affect the economic life of the properties.\nEstimated Future Net Cash Flows\n9/30/2022\n9/30/2021\n9/30/2020\nProved Developed\n$\n374,063,580\n$\n163,339,707\n$\n57,306,480\nProved Undeveloped\n83,098,064\n16,244,436\n8,779,289\nIncome Tax Expense\n(107,209,614\n)\n(40,697,140\n)\n(13,224,535\n)\nTotal Proved\n$\n349,952,030\n$\n138,887,003\n$\n52,861,234\n10% Discounted Present Value of Estimated Future Net Cash Flows\n9/30/2022\n9/30/2021\n9/30/2020\nProved Developed\n$\n184,948,239\n$\n86,793,303\n$\n33,270,804\nProved Undeveloped\n52,978,389\n9,731,036\n5,659,479\nIncome Tax Expense\n(55,357,247\n)\n(21,733,997\n)\n(7,796,130\n)\nTotal Proved\n$\n182,569,381\n$\n74,790,342\n$\n31,134,153\nEvaluation and Review of Reserves\nThe determination of reserve estimates is a function of testing and evaluating the production and development of natural gas and oil reservoirs in order to establish a production decline curve. The established production decline curves, in conjunction with natural gas and oil prices, development costs, production taxes and operating expenses, are used to estimate natural gas and oil reserve quantities and associated future net cash flows. As information is processed regarding the development of individual reservoirs, and as market conditions change, estimated reserve quantities and future net cash flows will change over time as well. Estimated reserve quantities and future net cash flows are affected by changes in product prices. These prices have varied substantially in recent years and are expected to vary substantially from current pricing in the future.\nWe follow the SECs modernized oil and natural gas reporting rules, which were effective for annual reports on Form 10-K for fiscal years ending on or after December 31, 2009. See Note 16 to the financial statements in Item 8 - Financial Statements and Supplementary Data for disclosures regarding our natural gas and oil reserves.\nUnder the SEC rules, oil and natural gas reserves are those quantities of oil and natural gas which, by analysis of geoscience and engineering data, can be estimated with reasonable certainty to be economically producible - from a given date forward, from known reservoirs and under existing economic conditions, operating methods and government regulations - prior to the time at which contracts providing the right to operate expire, unless evidence indicates that renewal is reasonably certain, regardless of whether deterministic or probabilistic methods are used for the estimation. The project to extract the hydrocarbons must have commenced, or the operator must be reasonably certain that it will commence the project, within a reasonable time. The area of the reservoir considered as proved includes: (i) the area identified by drilling and limited by fluid contacts, if any, and (ii) adjacent undrilled portions of the reservoir that can, with reasonable certainty, be judged to be continuous with the reservoir and to contain economically producible oil or natural gas on the basis of available geoscience and engineering data. In the absence of data on fluid contacts, proved quantities in a reservoir are limited by the lowest known hydrocarbons as seen in a well penetration unless geoscience, engineering or performance data and reliable technology establishes a lower contact with reasonable certainty. Where direct observation from well penetrations has defined a highest known oil elevation and the potential exists for an associated natural gas cap, proved oil reserves may be assigned in the structurally higher portions of the reservoir only if geoscience, engineering or performance data and reliable technology establish the higher contact with reasonable certainty. Reserves, that can be produced economically through application of improved recovery techniques (including, but not limited to, fluid injection) are included in the proved classification when: (i) successful testing by a pilot project in an area of the reservoir with properties no more favorable than in the reservoir as a whole, the operation of an installed program in the reservoir or an analogous reservoir or other evidence using reliable technology establishes the\nreasonable certainty of the engineering analysis on which the project or program was based; and (ii) the project has been approved for development by all necessary parties and entities, including governmental entities. Existing economic conditions include prices and costs at which economic producibility from a reservoir is to be determined. The price shall be the average price during the 12-month period prior to the ending date of the period covered by the report, determined as an unweighted arithmetic average of the first-day-of-the-month price for each month within such period, unless prices are defined by contractual arrangements, excluding escalations based upon future conditions.\nDeveloped oil and natural gas reserves are reserves of any category that can be expected to be recovered through existing wells with existing equipment and operating methods, or in which the cost of the required equipment is relatively minor, compared to the cost of a new well, and through installed extraction equipment and infrastructure operational at the time of the reserve estimate, if the extraction is by means not involving a well.\nUndeveloped oil and natural gas reserves are reserves of any category that are expected to be recovered from new wells on undrilled acreage or from existing wells where a relatively major expenditure is required for recompletion. Reserves on undrilled acreage are limited to those directly offsetting development spacing areas that are reasonably certain of production when drilled, unless evidence using reliable technology exists that establishes reasonable certainty of economic producibility at greater distances. Undrilled locations can be classified as having undeveloped reserves only if a development plan has been adopted indicating that they are scheduled to be drilled within five years, unless the specific circumstances justify a longer time. Under no circumstances shall estimates for undeveloped reserves be attributable to any acreage for which an application of fluid injection or other improved recovery technique is contemplated, unless such techniques have been proved effective by actual projects in the same reservoir or an analogous reservoir or by other evidence using reliable technology establishing reasonable certainty.\nThe independent consulting petroleum engineering firm of Cawley, Gillespie and Associates, Inc. (CG&A) of Fort Worth, Texas, prepared our natural gas, oil and NGL reserves estimates as of September 30, 2022, and the independent consulting petroleum engineering firm of DeGolyer and MacNaughton of Dallas, Texas, prepared our natural gas, oil and NGL reserves estimates as of September 30, 2021 and 2020. Within CG&A, the technical person primarily responsible for preparing the estimates set forth in the Report of CG&A dated October 4, 2022, filed as Exhibit 99.1 to this Annual Report on Form 10-K, was W. Todd Brooker. Mr. Brooker has been a Petroleum Consultant for CG&A since 1992 and became President in 2017. His responsibilities include reserve and economic evaluations, fair market valuations, field studies, pipeline resource studies and acquisition/divestiture analysis. His reserve reports are routinely used for public company SEC disclosures, and his experience includes significant projects in both conventional and unconventional resources in every major U.S. producing basin and abroad, including oil and gas shale plays, coalbed methane fields, waterfloods and complex, faulted structures. Prior to CG&A, Mr. Brooker worked in Gulf of Mexico drilling and production engineering at Chevron USA. Mr. Brooker graduated with honors from the University of Texas at Austin in 1989 with a Bachelor of Science degree in Petroleum Engineering. He is a registered professional engineer in Texas, No. 83462, a member of the Society of Petroleum Engineers (SPE) and a member of the Society of Petroleum Evaluation Engineers (SPEE). Mr. Brooker meets or exceeds the education, training and experience requirements set forth in the Standards Pertaining to the Estimating and Auditing of Oil and Gas Reserves Information promulgated by the Society of Petroleum Engineers and is proficient in judiciously applying industry standard practices to engineering and geoscience evaluations as well as applying SEC and other industry reserve definitions and guidelines.\nAll of the reserve estimates are reviewed and approved by our Vice President of Engineering. Our Vice President of Engineering and internal staff work closely with our Independent Consulting Petroleum Engineers to ensure the integrity, accuracy and timeliness of data furnished to them for their reserves estimation process. We provide historical information (such as ownership interest, gas and oil production, well test data, commodity prices, operating costs, handling fees, and development costs) for all properties to our Independent Consulting Petroleum Engineers. Throughout the year, our team meets regularly with representatives of our Independent Consulting Petroleum Engineers to review properties and discuss methods and assumptions. Our net proved natural gas, oil and NGL reserves (including certain undeveloped reserves described above) are located onshore in the contiguous United States. All studies have been prepared in accordance with regulations prescribed by the SEC. The reserve estimates were based on economic and operating conditions existing at September 30, 2022, 2021, and 2020. Since the determination and valuation of proved reserves is a function of testing and estimation, the reserves presented are expected to change as future information becomes available.\nNatural Gas, Oil and NGL Production\nThe following table sets forth our net production of natural gas, oil and NGL for the fiscal periods indicated.\nYear Ended\n9/30/2022\nRoyalty Interest\nWorking Interest\nTotal\nMcf - Natural Gas\n5,020,572\n2,407,136\n7,427,708\nBbls - Oil\n119,518\n79,017\n198,535\nBbls - NGL\n78,662\n86,458\n165,120\nMcfe\n6,209,654\n3,399,984\n9,609,638\nYear Ended\n9/30/2021\nRoyalty Interest\nWorking Interest\nTotal\nMcf - Natural Gas\n3,026,761\n3,672,959\n6,699,720\nBbls - Oil\n120,145\n104,334\n224,479\nBbls - NGL\n71,655\n99,833\n171,488\nMcfe\n4,177,559\n4,897,960\n9,075,519\nYear Ended\n9/30/2020\nRoyalty Interest\nWorking Interest\nTotal\nMcf - Natural Gas\n2,148,295\n3,814,410\n5,962,705\nBbls - Oil\n135,572\n134,213\n269,785\nBbls - NGL\n64,345\n104,278\n168,623\nMcfe\n3,347,797\n5,245,356\n8,593,153\nAverage Sales Prices and Production Costs\nThe following tables set forth unit price and cost data for the fiscal periods indicated.\nYear Ended\nYear Ended\nYear Ended\nAverage Sales Price\n9/30/2022\n9/30/2021\n9/30/2020\nPer Mcf, Natural Gas\n$\n6.16\n$\n3.13\n$\n1.72\nPer Bbl, Oil\n$\n91.32\n$\n56.58\n$\n41.47\nPer Bbl, NGL\n$\n36.11\n$\n23.80\n$\n11.42\nPer Mcfe\n$\n7.27\n$\n4.16\n$\n2.72\nYear Ended\nYear Ended\nYear Ended\nAverage Production (lifting) Costs\n9/30/2022\n9/30/2021\n9/30/2020\n(Per Total Mcfe)\nWell Operating Costs (1)\n$\n1.03\n$\n1.11\n$\n1.12\nProduction Taxes (2)\n0.34\n0.21\n0.12\n$\n1.37\n$\n1.32\n$\n1.24\n(1)Includes actual well operating costs, compression, handling and marketing fees paid on natural gas sales and other minor expenses associated with well operations.\n(2)Includes production taxes only.\nIn fiscal year 2022, approximately 64% of our natural gas, oil and NGL revenue was generated from royalty payments received on our mineral acreage. Royalty interests bear no share of the field operating costs on those producing wells but do bear a share of the handling fees (primarily gathering and transportation).\nGross and Net Productive Wells and Developed Acres\nThe following table sets forth our gross and net productive natural gas and oil wells as of September 30, 2022. We own either working interests, royalty interests or both in these wells. We do not operate any wells.\nGross Working Interest Only Wells\nNet Working Interest Only Wells\nGross Working Interest and Royalty Interest Wells\nNet Working Interest and Royalty Interest Wells\nGross Royalty Only Wells\nNet Royalty Only Wells\nTotal Gross Wells\nNatural Gas\n3.08\n17.87\n3,825\n25.21\n4,290\nOil\n10.29\n2.34\n1,889\n10.62\n2,072\nTotal\n13.37\n20.21\n5,714\n35.83\n6,362\nOur average interest in royalty interest only wells is 0.63%. Our average interest in working interest wells is 5.57% working interest and 5.18% net revenue interest.\nInformation on multiple completions is not available from our records, but the number is not believed to be significant. With regard to Gross Royalty Only Wells, some of these wells are in multi-well unitized fields. In such cases, our ownership in each unitized field is counted as one gross well, as we do not have access to the actual well count in all of these unitized fields.\nAs of September 30, 2022, we owned 614,105 gross (66,421 net) developed mineral acres and leased 191,305 gross (16,260 net) developed acres.\nUndeveloped Acreage\nAs of September 30, 2022, we owned 1,165,608 gross and 178,318 net undeveloped mineral acres. All of our leases are held by production (HBP), and we do not have any leases on undeveloped acres.\nDrilling Activity\nThe following table sets forth our net productive development, exploratory and purchased wells and net dry development, exploratory and purchased wells in which we had either a working interest, a royalty interest or both were drilled and completed during the fiscal years indicated.\nNet Productive\nNet Productive\nNet Dry\nWorking Interest\nWells\nRoyalty Interest\nWells\nWorking Interest\nWells\nDevelopment Wells\nFiscal years ended:\nSeptember 30, 2022\n-\n0.986062\n-\nSeptember 30, 2021\n-\n0.556684\n-\nSeptember 30, 2020\n-\n0.597278\n-\nExploratory Wells\nFiscal years ended:\nSeptember 30, 2022\n-\n-\n-\nSeptember 30, 2021\n-\n-\n-\nSeptember 30, 2020\n-\n-\n-\nPurchased Wells\nFiscal years ended:\nSeptember 30, 2022\n-\n1.108386\n-\nSeptember 30, 2021\n-\n1.216467\n-\nSeptember 30, 2020\n-\n0.364206\n-\nPresent Activities\nThe following table sets forth our gross and net natural gas and oil wells being drilled or waiting on completion as of September 30, 2022, in which we own either a working interest, a royalty interest or both. These wells were not producing at September 30, 2022.\nGross Working Interest Wells\nNet Working Interest Wells\nGross Royalty Only Wells\nTotal Net Royalty Interest Wells\nNatural Gas\n-\n-\n0.81\nOil\n-\n-\n0.01\nTotal\n-\n-\n0.82\nOther Facilities\nWe have an office lease on 8,776 square feet of office space in Oklahoma City, Oklahoma, which is scheduled to expire on August 31, 2027, and an office lease on 3,080 square feet of office space in Fort Worth, Texas, which is scheduled to expire on August 31, 2027. ITEM 3. Legal Proceedings\nIn the ordinary course of business, we may be, from time to time, a claimant or a defendant in various legal proceedings. There were no material pending legal proceedings involving the Company on September 30, 2022, or at the date of this Annual Report. ITEM 4. Mine Safety Disclosures\nNot applicable.\nPART II ITEM 5. Market for Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nMarket for our Common Stock\nOur Common Stock is listed on the New York Stock Exchange (NYSE) under the trading symbol PHX.\nAs of September 30, 2022, we were authorized to issue an aggregate of 54,000,500 shares of Common Stock.\nPerformance Graph\nThe following graph compares the 5-year cumulative total return provided stockholders on our Common Stock relative to the cumulative total returns of the S&P Smallcap 600 Index and the S&P Oil & Gas Exploration & Production Index. An investment of $100 (with reinvestment of all dividends) is assumed to have been made in our Common Stock and in each of the indexes on September 30, 2017, and the relative performance of such investment is tracked through and including September 30, 2022. This table is not intended to forecast future performance of our Common Stock.\nRecord Holders\nAt December 6, 2022, there were 1,280 holders of record of our Common Stock and approximately 7,000 beneficial owners.\nDividends\nDuring the past three years, we have paid quarterly dividends ranging from $0.01 per share to $0.04 per share on our Common Stock. Approval by our Board is required before the declaration and payment of any dividends.\nHistorically, we have paid dividends to our stockholders on a quarterly basis. While we anticipate we will continue to pay dividends on our Common Stock, the payment and amount of future cash dividends will depend upon, among other things, financial condition, funds from operations, the level of capital and development expenditures, future business prospects, contractual restrictions and any other factors considered relevant by the Board. Our Credit Agreement sets limits on dividend payments and stock repurchases if those payments would cause the Leverage Ratio (as defined in the Credit Agreement) to go above 2.50 to 1.0 or the Available Commitment (as defined in the Credit Agreement) to go below ten percent of the Borrowing Base (as defined in the Credit Agreement).\nPurchases of Equity Securities by the Company\nFollowing approval by our stockholders of our 2010 Restricted Stock Plan (2010 Stock Plan) in March 2010, as amended in May 2018, our Board approved our repurchase program which, as amended, authorizes management to repurchase up to $1.5 million of our Common Stock at our discretion. The repurchase program has an evergreen provision which authorizes the repurchase of an additional $1.5 million of our Common Stock when the previous amount is utilized. As part of the amendment, the number of shares allowed to be purchased by us under the repurchase program is no longer capped at an amount equal to the aggregate number of shares of Common Stock (i) awarded pursuant to our 2010 Stock Plan, as amended, (ii) contributed by us to the PHX Minerals Inc. Employee Stock Ownership and 401(k) Plan, a tax qualified, defined contribution plan (the ESOP) and (iii) credited to the accounts of directors pursuant to our Deferred Compensation Plan for Non-Employee Directors.\nDuring the quarter ended September 30, 2022, we did not repurchase any shares of our Common Stock. ITEM 6. Reserved ITEM 7. Managements Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion and analysis should be read in conjunction with our accompanying financial statements and the notes to those financial statements included elsewhere in this Annual Report. The following discussion includes forward-looking statements that reflect our plans, estimates and beliefs. Our actual results could differ materially from those discussed in these forward-looking statements as a result of many factors, including those discussed under Risk Factors and elsewhere in this Annual Report. The following discussion and analysis generally discuss fiscal year 2022 and 2021 items and fiscal year-to-year comparisons between 2022 and 2021. Discussions of 2020 items and year-to-year comparisons between 2021 and 2020 that are not included in this Form 10-K can be found in \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in Part II, Item 7 of our Annual Report on Form 10-K for the fiscal year ended September 30, 2021.\nBusiness Overview\nWe are focused on perpetual natural gas and oil mineral ownership in resource plays in the United States. Prior to a strategy change in 2019, we participated with a working interest on some of our mineral and leasehold acreage and as a result, we still have legacy interests in leasehold acreage and non-operated interests in natural gas and oil properties. Effective October 8, 2020, our corporate name was changed to PHX Minerals Inc. to more accurately reflect our business strategy.\nOur results of operations are dependent primarily upon the Companys: existing reserve quantities; costs associated with acquiring, exploring for and developing new reserves; production quantities and related production costs; and natural gas, oil and NGL sales prices. Although a significant amount of our revenues is currently derived from the production and sale of natural gas, oil and NGL on our working interests, the majority of our revenues is derived from royalties granted from the production and sale of natural gas, oil and NGL.\nStrategic Focus on Mineral Ownership\nDuring fiscal year 2019, we made the strategic decision to focus on perpetual natural gas and oil mineral ownership and growth through mineral acquisitions and the development of our significant mineral acreage inventory in our core focus areas. In accordance with this decision, we ceased taking working interest positions on our mineral and leasehold acreage going forward. During the three fiscal years ended September 30, 2022, we did not participate with a working interest in the drilling of any new wells. We believe that our strategy to focus on mineral ownership is the best path to giving our stockholders the greatest risk-weighted returns on their investments.\nMarket Conditions and Commodity Prices\nCommodity prices are affected by many factors outside of our control, including changes in market supply and demand, which are impacted by weather conditions, pipeline capacity constraints, inventory storage levels, basis differentials and other factors. As a result, we cannot accurately predict future commodity prices and, therefore, we cannot determine with any degree of certainty what effect increases or decreases in these prices will have on our production volumes or revenues.\nOur working interest and royalty revenues may vary significantly from period to period as a result of changes in commodity prices, production mix and volumes of production sold by our operators.\nProduction and Operational Update\nOur natural gas production for the fiscal year 2022 increased 11%, while oil and NGL production decreased 12% and 4%, respectively, from that of 2021. The 2022 fiscal years higher natural gas, oil and NGL prices (as discussed below) and the overall production changes noted above resulted in an 85% increase in revenues from the sale of natural gas, oil and NGL in 2022.\nOur proved natural gas, oil and NGL reserves decreased to 81.1 Bcfe in 2022, compared to 83.0 Bcfe in 2021, a decrease of approximately 1.9 Bcfe, or 2%. The decrease was primarily due to the sale of 17.6 Bcfe proved developed working interest properties in the Fayetteville Shale play in Arkansas, and the Arkoma Stack play and Western Anadarko Basin in Oklahoma, coupled with production and, to a lesser extent, performance revisions. This was partially offset by the acquisition of 15.6 Bcfe, predominately of royalty interest properties in the active drilling programs of the Haynesville Shale play in east Texas and western Louisiana and the Mississippi and Woodford Shale intervals in the SCOOP play in the Ardmore basin of Oklahoma. Additional reserve increases include (i) positive pricing revisions primarily related to natural gas and oil wells extending their economic limits later than was projected in 2021 due to higher commodity prices and other reserve parameters, such as differentials and lease operating costs, and (ii) additions resulting from our royalty interest ownership in the ongoing development of unconventional natural gas, utilizing horizontal drilling,\nin the Haynesville Shale play of East Texas and Western Louisiana; and the ongoing development of unconventional natural gas, oil and NGL utilizing horizontal drilling in the Mississippi and Woodford Shale intervals in the SCOOP and STACK plays in the Ardmore and Anadarko basins of Oklahoma.\nAs of September 30, 2022, we owned an average 0.5% net revenue interest, consisting of all royalty interest, in 172 wells that were being drilled or awaiting completion.\nResults of Operations\nThe following table reflects certain operating data for fiscal 2022 and 2021:\nFor the Year Ended September 30,\nPercent\nIncr. or (Decr.)\nProduction:\nNatural Gas (Mcf)\n7,427,708\n6,699,720\n11%\nOil (Bbls)\n198,535\n224,479\n(12%)\nNGL (Bbls)\n165,120\n171,488\n(4%)\nMcfe\n9,609,638\n9,075,519\n6%\nAverage Sales Price:\nNatural Gas (per Mcf)\n$6.16\n$3.13\n97%\nOil (per Bbl)\n$91.32\n$56.58\n61%\nNGL (per Bbl)\n$36.11\n$23.80\n52%\nMcfe\n$7.27\n$4.16\n75%\nProduction by quarter for 2022 and 2021 was as follows (Mcfe):\nFor the Year Ended September 30, 2022\nRoyalty Interest\nWorking Interest\nTotal\nFirst quarter\n1,225,220\n903,028\n2,128,248\nSecond quarter\n1,547,609\n912,433\n2,460,042\nThird quarter\n1,595,323\n834,437\n2,429,760\nFourth quarter\n1,841,502\n750,086\n2,591,588\nTotal\n6,209,654\n3,399,984\n9,609,638\nFor the Year Ended September 30, 2021\nRoyalty Interest\nWorking Interest\nTotal\nFirst quarter\n744,653\n1,329,681\n2,074,334\nSecond quarter\n1,230,105\n1,066,697\n2,296,802\nThird quarter\n1,204,571\n1,288,242\n2,492,813\nFourth quarter\n998,230\n1,213,340\n2,211,570\nTotal\n4,177,559\n4,897,960\n9,075,519\nFiscal Year 2022 Compared to Fiscal Year 2021\nOverview\nRevenues increased in 2022 primarily due to higher natural gas, oil and NGL sales. We recorded net income of $20,409,272, or $0.59 per share, in 2022, compared to net loss of $6,217,237, or $0.24 per share, in 2021. Expenses increased in 2022, primarily the\nresult of increases in G&A, production taxes, interest expense and transportation, gathering and marketing expenses, partially offset by an increase in gains on asset sales and decreases in DD&A, loss on debt extinguishment and LOE.\nNatural Gas, Oil and NGL Sales\nFor the Year Ended September 30,\nPercent\nIncr. or (Decr.)\nNatural gas, oil and NGL sales\n$\n69,860,631\n$\n37,749,044\n85%\nThe increase was due to increased natural gas, oil and NGL prices of 97%, 61% and 52%, respectively, combined with higher natural gas volumes of 11%, partially offset by lower oil and NGL volumes of 12% and 4%, respectively.\nThe increase in natural gas production was primarily due to acquisitions and new drilling in the Haynesville Shale play of Texas and Louisiana, and slightly offset by divestiture of working interest assets in the Fayetteville Shale and naturally declining production in the Arkoma STACK. The decrease in oil production was a result of naturally declining production in high interest wells in the Eagle Ford and Bakken plays, wells shut in for workovers in the Eagle Ford, our strategy of no longer participating with working interest in new drilling in the Eagle Ford, and the natural decline of wells brought online in fiscal year 2021 in the STACK play. These decreases were partially offset by new drilling and acquisitions in the SCOOP. The decrease in NGL production is primarily attributable to the natural decline in high interest, liquids rich wells in the STACK. This was partially offset by new wells in the SCOOP.\nGiven our strategic decision to cease participating with working interests, we plan to offset the natural decline of our existing production base by the development of our current inventory of mineral acreage and through acquisitions of additional mineral interests.\nGains (Losses) on Derivative Contracts\nFor the Year Ended September 30,\nPercent\nIncr. or (Decr.)\nCash received (paid) on settled derivative contracts:\nCash received (paid) on settled derivative contracts, net(1)\n$\n(14,533,560\n)\n$\n(11,925,669\n)\n(22%)\nNon-cash gain (loss) on derivative contracts:\nNon-cash gain (loss) on derivative contracts, net\n$\n(2,299,518\n)\n$\n(4,276,820\n)\n46%\nGains (losses) on derivative contracts, net\n$\n(16,833,078\n)\n$\n(16,202,489\n)\n(4%)\nAs of September 30,\nFair value of derivative contracts\nNet asset (net liability)\n$\n(8,561,191\n)\n$\n(13,784,467\n)\n38%\n(1) Excludes $7,522,794 of cash paid to settle off-market derivative contracts that are not reflected on the Condensed Statements of Operations for the year ended September 30, 2022. See Note 12 to the financial statements in Item 8 - Financial Statements and Supplementary Data for further explanation on off-market derivative contracts.\nThe change in net (loss) gain on derivative contracts was due to the settlements of natural gas and oil collars and fixed price swaps and the change in valuation caused by the difference in September 30, 2022 pricing relative to the strike price on open derivative contracts.\nOur natural gas and oil fixed price swaps in place at September 30, 2022, had expiration dates through December 2023. We utilize derivative contracts for the purpose of protecting our cash flow and return on investments.\nLease Operating Expenses (LOE)\nFor the Year Ended September 30,\nPercent\nIncr. or (Decr.)\nLease operating expenses\n$\n4,047,420\n$\n4,230,968\n(4%)\nLease operating expenses per working interest MCFE\n$\n1.19\n$\n0.86\n38%\nLease operating expenses per total MCFE\n$\n0.42\n$\n0.47\n(11%)\nWe are responsible for a portion of LOE relating to a well as a working interest owner. LOE includes normal recurring and nonrecurring expenses associated with our working interests necessary to produce hydrocarbons from our natural gas and oil wells, including maintenance, repairs, salt water disposal, insurance and workover expenses. Total LOE related to field operating costs decreased $183,548, or 4%, in 2022 compared to 2021. The decrease in LOE was principally the result of the divestiture of working interest properties, partially offset by cost inflation associated with field operating activities.\nTransportation, Gathering and Marketing\nFor the Year Ended September 30,\nPercent\nIncr. or (Decr.)\nTransportation, gathering and marketing\n$\n5,890,390\n$\n5,767,287\n2%\nTransportation, gathering and marketing per MCFE\n$\n0.61\n$\n0.64\n(5%)\nTransportation, gathering and marketing increased $123,103, or 2%, in 2022 compared to 2021. This increase in costs was primarily due to increased production in 2022. The decrease in rate per Mcfe was primarily due to the divestiture of assets with higher associated transportation, gathering and marketing rates and the increase in natural gas sales in fields with lower associated transportation, gathering and marketing rates. Natural gas sales bear the large majority of our transportation, gathering and marketing fees.\nProduction Taxes\nFor the Year Ended September 30,\nPercent\nIncr. or (Decr.)\nProduction taxes\n$\n3,230,867\n$\n1,938,304\n67%\nProduction taxes as % of sales\n4.6\n%\n5.1\n%\n(10%)\nProduction taxes are paid on produced natural gas and oil based on a percentage of revenues from products sold at both fixed and variable rates established by federal, state or local taxing authorities. Production taxes increased $1,292,563, or 67%, in 2022 compared to 2021. The increase in amount was primarily the result of increased natural gas, oil and NGL sales of $32,111,587 during 2022.\nDepreciation, Depletion and Amortization (DD&A)\nFor the Year Ended September 30,\nPercent\nIncr. or (Decr.)\nDepreciation, depletion and amortization\n$\n7,278,118\n$\n7,745,804\n(6%)\nDepreciation, depletion and amortization per MCFE\n$\n0.76\n$\n0.85\n(11%)\nDD&A is the amount of cost basis of natural gas and oil properties attributable to the volume of hydrocarbons extracted during such period, calculated on a units-of-production basis for working interest, and on a straight-line basis for producing and non-producing minerals. Estimates of proved developed producing reserves are a major component of the calculation of depletion. DD&A decreased $467,686, or 6%, in 2022 compared to 2021, of which $921,685 of the decrease resulted from a $0.09 decrease in the DD&A rate per Mcfe, partially offset by an increase of $453,999 resulting from production increasing 6% in 2022. The rate decrease was due to working interest divestitures, partially offset by royalty interest acquisitions in 2022.\nProvision for Impairment\nProvision for impairment was $14,565 in 2022, as compared to $50,475 provision for impairment in 2021. During 2021, impairment of $37,879 was related to one field. These assets were written down to their fair market value as required by GAAP. The remaining $14,565 and $12,596 of impairment in the 2022 and 2021 periods, respectively, were related to working interest wells in which we assigned our interests to the operator.\nInterest Expense\nFor the Year Ended September 30,\nPercent\nIncr. or (Decr.)\nInterest Expense\n$\n1,164,992\n$\n995,127\n17%\nWeighted average debt outstanding\n$\n25,004,110\n$\n23,725,079\n5%\nThe increase was due to a higher outstanding debt balance and an increase in the average interest rate in 2022 compared to 2021.\nGeneral and Administrative Costs (G&A)\nFor the Year Ended September 30,\nPercent\nIncr. or (Decr.)\nGeneral and administrative costs\n$\n11,500,594\n$\n8,207,882\n40%\nG&A are costs not directly associated with the production of natural gas and oil and include the cost of employee salaries and related benefits, office expenses and fees for professional services. G&A for 2022 increased $3,292,712 as compared to 2021. The increase was primarily due to legal expenses associated with reincorporating in the state of Delaware, increased transaction activity and restricted stock expense during the year.\nLoss on Debt Extinguishment\nWhen we terminated our credit facility led by Bank of Oklahoma in the fourth quarter of 2021, we wrote-off all associated costs that had been previously capitalized.\nLosses (Gains) on Asset Sales and Other\nFor the Year Ended September 30,\nPercent\nIncr. or (Decr.)\nLosses (gains) on asset sales and other\n$\n(4,243,163\n)\n$\n(356,127\n)\n(1,091%)\nThe increase in gain on asset sales and other is primarily related to divestitures during 2022.\nProvision (Benefit) for Income Taxes\nFor the Year Ended September 30,\nPercent\nIncr. or (Decr.)\nProvision (benefit) for income taxes\n$\n4,202,000\n$\n(651,051\n)\n745%\nEffective tax rate\n%\n(9\n%)\n289%\nProvision (benefit) for income taxes changed $4,853,051, from a $651,051 benefit in 2021 to a $4,202,000 provision in 2022. The change in provision (benefit) for income taxes resulted primarily from the change in our net income (loss) from a net loss of $6,217,237 in 2021 to net income of $20,409,272 in 2022.\nWhen a provision for income taxes is expected for the year, federal and Oklahoma excess percentage depletion decreases the effective tax rate, while the effect is to increase the effective tax rate when a benefit for income taxes is recorded.\nFiscal Year 2021 Compared to Fiscal Year 2020\nOverview\nRevenues decreased in 2021 primarily due to an increase in losses on derivative contracts, partially offset by higher natural gas, oil and NGL sales. We recorded a net loss of $6,217,237, or $0.24 per share, in 2021, compared to net loss of $23,952,037, or $1.41 per share, in 2020. Expenses decreased in 2021, primarily the result of decreases in provision for impairment (non-cash), DD&A, LOE and interest expense, partially offset by an increase in transportation, gathering and marketing expenses, production taxes and loss on debt extinguishment.\nNatural Gas, Oil and NGL Sales\nFor the Year Ended September 30,\nPercent\nIncr. or (Decr.)\nNatural gas, oil and NGL sales\n$\n37,749,044\n$\n23,370,003\n62%\nThe increase was due to increased natural gas, oil and NGL prices of 82%, 36% and 108%, respectively, combined with higher natural gas and NGL volumes of 12% and 2%, respectively, partially offset by lower oil volumes of 17%.\nThe increase in natural gas production was primarily due to acquisitions in the Haynesville Shale play of Texas and Louisiana, and slightly offset by naturally declining production in the SCOOP and Arkoma STACK. The decrease in oil production was a result of naturally declining production in high interest wells in the Eagle Ford and Bakken plays, our strategy of no longer participating with working interest in new drilling in the Eagle Ford, and reduced drilling activity in the Bakken. These decreases were slightly offset by acquisitions and new drilling in the STACK. The increase in NGL production is primarily attributable to high interest wells coming back online after being shut-in for part of fiscal year 2020, as well as new wells being brought online in the STACK. This was slightly offset by naturally declining production in the SCOOP.\nGiven our strategic decision to cease participating with working interests, we plan to offset the natural decline of our existing production base by the development of our current inventory of mineral acreage and through acquisitions of additional mineral interests going forward.\nGains (Losses) on Derivative Contracts\nFor the Year Ended September 30,\nPercent\nIncr. or (Decr.)\nCash received (paid) on settled derivative contracts:\nCash received (paid) on settled derivative contracts, net\n$\n(11,925,669\n)\n$\n4,109,210\n(390%)\nNon-cash gain (loss) on derivative contracts:\nNon-cash gain (loss) on derivative contracts, net\n$\n(4,276,820\n)\n$\n(3,201,791\n)\n(34%)\nGains (losses) on derivative contracts, net\n$\n(16,202,489\n)\n$\n907,419\n(1,886%)\nAs of September 30,\nFair value of derivative contracts\nNet asset (net liability)\n$\n(13,784,467\n)\n$\n(707,647\n)\n(1,848%)\nThe change in net loss on derivative contracts was due to the natural gas and oil collars and fixed price swaps being less beneficial in 2021 in relation to their respective contracted volumes and prices. The change from a net liability position of $707,647 at September 30, 2020, to a net liability position of $13,784,467 at September 30, 2021, resulted from non-cash loss on derivative contracts in the 2021 period of $4,276,820 and entry into off-market hedges with BP Energy Company (BP) for $8.8 million in cash. See Note 12 to the financial statements in Item 8 - Financial Statements and Supplementary Data for further explanation.\nOur natural gas and oil fixed price swaps in place at September 30, 2021, had expiration dates through March 2023. We utilize derivative contracts for the purpose of protecting our cash flow and return on investments.\nLease Operating Expenses (LOE)\nFor the Year Ended September 30,\nPercent\nIncr. or (Decr.)\nLease operating expenses\n$\n4,230,968\n$\n4,841,541\n(13%)\nLease operating expenses per MCFE\n$\n0.47\n$\n0.56\n(16%)\nWe are responsible for a portion of LOE relating to a well as a working interest owner. LOE includes normal recurring and nonrecurring expenses associated with our working interests necessary to produce hydrocarbons from our natural gas and oil wells, including maintenance, repairs, salt water disposal, insurance and workover expenses. Total LOE related to field operating costs decreased $610,573, or 13%, in 2021 compared to 2020. The decrease in LOE rate was principally the result of our strategic decision to cease participating with a working interest in new wells and the increase in royalty interest production as a percentage of total production.\nTransportation, Gathering and Marketing\nFor the Year Ended September 30,\nPercent\nIncr. or (Decr.)\nTransportation, gathering and marketing\n$\n5,767,287\n$\n4,812,869\n20%\nTransportation, gathering and marketing per MCFE\n$\n0.64\n$\n0.56\n14%\nTransportation, gathering and marketing increased $954,418, or 20%, in 2021 compared to 2020. This increase in costs was primarily due to increased production in 2021. The increase in rate per Mcfe was primarily due to the increase in natural gas sales in relation to other products. Natural gas sales bear the large majority of our transportation, gathering and marketing fees.\nProduction Taxes\nFor the Year Ended September 30,\nPercent\nIncr. or (Decr.)\nProduction taxes\n$\n1,938,304\n$\n1,022,912\n89%\nProduction taxes as % of sales\n5.1\n%\n4.4\n%\n16%\nProduction taxes are paid on produced natural gas and oil based on a percentage of revenues from products sold at both fixed and variable rates established by federal, state or local taxing authorities. Production taxes increased $915,392, or 89%, in 2021 compared to 2020. The increase in amount was primarily the result of increased natural gas, oil and NGL sales of $14,379,041 during 2021.\nDepreciation, Depletion and Amortization (DD&A)\nFor the Year Ended September 30,\nPercent\nIncr. or (Decr.)\nDepreciation, depletion and amortization\n$\n7,745,804\n$\n11,313,783\n(32%)\nDepreciation, depletion and amortization per MCFE\n$\n0.85\n$\n1.32\n(36%)\nDD&A is the amount of cost basis of natural gas and oil properties attributable to the volume of hydrocarbons extracted during such period, calculated on a units-of-production basis for working interest, and on a straight-line basis for producing and non-producing minerals. Estimates of proved developed producing reserves are a major component of the calculation of depletion. DD&A decreased $3,567,979, or 32%, in 2021 compared to 2020, of which $4,204,702 of the decrease resulted from a $0.47 decrease in the DD&A rate per Mcfe, partially offset by an increase of $636,723 resulting from production increasing 6% in 2021. The rate decrease was partially due to higher natural gas, oil and NGL prices utilized in the reserve calculations during the 2021 period, as compared to 2020 period, lengthening the economic life of wells. This resulted in higher projected remaining reserves on a significant number of wells causing decreased units of production DD&A, despite the increase in projection.\nProvision for Impairment\nProvision for impairment was $50,475 in 2021, as compared to $29,904,528 provision for impairment in 2020. During 2021, impairment of $37,879 was related to one field. These assets were written down to their fair market value as required by GAAP. During 2020, impairment of $29,315,806 was recorded on seven different fields including the Fayetteville and Eagle Ford shales, which represented 89% of our total impairment. The impairment in these seven fields was caused by lower future prices reducing future net cash flows associated with these fields, which caused these assets to fail the step one test for impairment as their undiscounted cash flows were not high enough to cover the book basis of the assets. These assets were written down to their fair market value as required by GAAP. The remaining $12,596 and $588,721 of impairment in the 2021 and 2020 periods, respectively, were recorded on other assets.\nInterest Expense\nFor the Year Ended September 30,\nPercent\nIncr. or (Decr.)\nInterest Expense\n$\n995,127\n$\n1,286,788\n(23%)\nWeighted average debt outstanding\n$\n23,725,079\n$\n32,290,257\n(27%)\nThe decrease was due to a lower outstanding debt balance in 2021 compared to 2020.\nGeneral and Administrative Costs (G&A)\nFor the Year Ended September 30,\nPercent\nIncr. or (Decr.)\nGeneral and administrative costs\n$\n8,207,882\n$\n8,024,901\n2%\nG&A are costs not directly associated with the production of natural gas and oil and include the cost of employee salaries and related benefits, office expenses and fees for professional services. G&A for 2021 increased $182,981 as compared to 2020. The slight increase was primarily due to increased activity during the year, partially offset by our cost reduction efforts.\nLoss on Debt Extinguishment\nWhen we terminated our credit facility led by Bank of Oklahoma, we wrote-off all associated costs that had been previously capitalized.\nLoss (Gain) on Asset Sales and Other\nIn 2021, we recorded a net gain on asset sales of $312,838 as compared to a net gain of $3,973,256 in 2020. During 2021, we sold 2,857 net mineral acres in Central Basin Platform in Texas for $285,714, resulting in a gain of $236,907. The remaining gain on asset sales in 2021 was due to various immaterial asset sales less adjustments.\nDuring the first quarter of 2020, we sold producing mineral acreage in Eddy County, New Mexico, for a gain of $3,272,499. We utilized a like-kind exchange under Internal Revenue Code Section 1031 to defer income tax on all of the gain by offsetting it with the STACK/SCOOP mineral acreage acquisition that was purchased during the quarter using qualified exchange accommodation agreements. During the fourth quarter of 2020, we sold 5,925 non-producing mineral acres in northwestern Oklahoma for a gain of $717,640. The remaining gain on asset sales in 2020 was due to various asset sales less adjustments.\nProvision (Benefit) for Income Taxes\nFor the Year Ended September 30,\nPercent\nIncr. or (Decr.)\nProvision (benefit) for income taxes\n$\n(651,051\n)\n$\n(8,289,000\n)\n(92%)\nEffective tax rate\n%\n%\n(65%)\nProvision (benefit) for income taxes changed $7,637,949, from a $8,289,000 benefit in 2020 to a $651,051 benefit in 2021. The income tax benefit change resulted primarily from the reduction in net loss.\nWhen a provision for income taxes is expected for the year, federal and Oklahoma excess percentage depletion decreases the effective tax rate, while the effect is to increase the effective tax rate when a benefit for income taxes is recorded.\nLiquidity and Capital Resources\nWe had positive working capital (current assets less current liabilities excluding current derivatives) of $14,533,225 at September 30, 2022, compared to positive working capital of $9,175,126 at September 30, 2021.\nLiquidity\nCash and cash equivalents were $3,396,809 as of September 30, 2022, compared to $2,438,511 at September 30, 2021, an increase of $958,298. Cash flows for the year ended September 30, 2022 and 2021, are summarized as follows:\nFor the Year Ended September 30,\nNet cash provided (used) by:\nChange\nOperating activities\n$\n37,531,650\n$\n3,942,087\n$\n33,589,563\nInvesting activities\n(30,860,030\n)\n(20,368,919\n)\n(10,491,111\n)\nFinancing activities\n(5,713,322\n)\n8,174,948\n(13,888,270\n)\nIncrease (decrease) in cash and cash equivalents\n$\n958,298\n$\n(8,251,884\n)\n$\n9,210,182\nOperating activities:\nNet cash provided by operating activities increased $33,589,563 during 2022, as compared to 2021, primarily as a result of the following:\nReceipts of natural gas, oil and NGL sales (net of production taxes and gathering, transportation and marketing costs) and other increased $27,620,895;\nDecreased net payments on derivative contracts of $9,129,420;\nIncreased lease bonus receipts of $246,554; and\nDecreased payments for interest expense of $24,057.\nOffset by:\nIncreased income tax payments of $1,775,474;\nIncreased payments for G&A and other expense of $1,650,019; and\nIncreased field operating expenses of $5,870.\nInvesting activities:\nNet cash used in investing activities increased $10,491,111 during 2022, as compared to 2021, primarily as a result of the following:\nHigher acquisition activity increased our expenditures by $22,900,889.\nOffset by:\nHigher proceeds received from the sale of assets of $12,229,244; and\nLower workover activity during 2022 decreased our capital expenditures by $180,534.\nFinancing activities:\nNet cash used in financing activities increased $13,888,270 during 2022, as compared to 2021, primarily as a result of the following:\nIncreased net cash payments on off-market derivative contracts of $28,060,104 during 2022;\nIncreased dividend payments by $1,197,453 during 2022; and\nDecreased net proceeds from equity issuance of $6,681,599 during 2022.\nOffset by:\nIncreased net borrowings on debt of $22,050,000.\nCapital Resources\nWe had no capital expenditures to drill and complete wells in 2022, as a result of our strategy to cease participating in new wells with a working interest at the end of fiscal year 2019. We currently have no remaining commitments that would require significant capital to drill and complete wells.\nSince we have decided to cease further participation in wells with a working interest on our mineral and leasehold acreage, we expect that capital expenditures for working interest properties will be minimal going forward, as the expenditures will be limited to capital workovers to enhance existing wells.\nOver the past five quarters, we made the following property acquisitions:\nQuarter Ended (4)\nNet royalty acres (1)(2)\nCash\nNumber of shares issued (3)\nTotal Purchase Price (1)\nArea of Interest\nSeptember 30, 2022\n$0.7million\n-\n$0.7million\nHaynesville / LA\n$0.2million\n-\n$0.2million\nSCOOP / OK\n$1.5million\n-\n$1.5million\nHaynesville / LA\n$3.0million\n-\n$3.0million\nHaynesville / LA\n$1.0million\n-\n$1.0million\nHaynesville / LA\n$5.5million\n-\n$5.5million\nHaynesville / LA\n$1.7million\n-\n$1.7million\nSCOOP / OK\nJune 30, 2022\n$0.6million\n-\n$0.6million\nSCOOP / OK\n$0.8million\n-\n$0.8million\nHaynesville / LA\n$0.4million\n-\n$0.4million\nHaynesville / LA\n$0.9million\n-\n$0.9million\nSCOOP / OK\n$5.0million\n-\n$5.0million\nHaynesville / LA, TX\n$0.6million\n-\n$0.6million\nHaynesville / LA\n$0.3million\n-\n$0.3million\nHaynesville / LA\n$0.5million\n-\n$0.5million\nSCOOP / OK\nMarch 31, 2022\n$0.5million\n-\n$0.5million\nSCOOP / OK\n$6.4million\n-\n$6.4million\nHaynesville / LA\n$0.7million\n-\n$0.7million\nHaynesville / TX\n$1.3million\n-\n$1.3million\nSCOOP / OK\n$0.4million\n-\n$0.4million\nHaynesville / TX\nDecember 31, 2021\n$5.8million\n-\n$5.8million\nHaynesville / LA\n$0.6million\n1,519,481\n$4.1million\nHaynesville / LA\n$1.4million\n-\n$1.4million\nSCOOP / OK\n$0.6million\n-\n$0.6million\nHaynesville / TX\n$1.7million\n-\n$1.7million\nHaynesville / LA\n$1.2million\n-\n$1.2million\nSCOOP / OK\nSeptember 30, 2021\n$0.7million\n2,349,407\n$7.3million\nHaynesville / LA, TX\n(1) Excludes subsequent closing adjustments and insignificant acquisitions.\n(2) An estimated net royalty equivalent was used for the minerals included in the net royalty acres.\n(3) The Companys policy is to classify all costs associated with equity issuances as financial costs in the Statements of Cash Flows.\n(4) Presented in chronological order with most recent at top.\nWe received lease bonus payments during fiscal year 2022 totaling approximately $0.7 million. Looking forward, the cash flow from bonus payments associated with the leasing of drilling rights on our mineral acreage is difficult to project and management plans to continue to actively pursue leasing opportunities.\nWith continued natural gas and oil price volatility, management continues to evaluate opportunities for product price protection through additional hedging of our future natural gas and oil production. See Note 12 to the financial statements included in Item 8 - Financial Statements and Supplementary Data for a complete list of our outstanding derivative contracts.\nThe use of cash provided by operating activities and resultant change to cash is summarized in the table below:\nTwelve months ended\n9/30/2022\nCash provided by operating activities\n$\n37,531,650\nCash provided (used) by:\nCapital expenditures - acquisitions\n(43,525,236\n)\nCapital expenditures - legacy working interest wells and furniture and fixtures\n(552,638\n)\nQuarterly dividends\n(2,257,901\n)\nTreasury stock purchases\n(1,855\n)\nNet borrowings (payments) on credit facility\n10,800,000\nNet proceeds from sales of assets\n13,217,844\nCash receipts from (payments on) off-market derivative contracts\n(19,260,104\n)\nNet proceeds from equity issuance\n5,006,538\nNet cash used\n(36,573,352\n)\nNet increase (decrease) in cash\n$\n958,298\nOutstanding borrowings under our Credit Facility at September 30, 2022 were $28,300,000.\nLooking forward, we expect to fund overhead costs, mineral and royalty acquisitions, and dividend payments from cash provided by operating activities, cash on hand and borrowings from our Credit Facility. We had availability of $21,700,000 at September 30, 2022 under our Credit Facility and were in compliance with our debt covenants (current ratio, debt to trailing 12-month EBITDAX, as defined in the Credit Agreement, and restricted payments limited by leverage ratio). The debt covenants in the Credit Agreement limit the maximum ratio of our debt to EBITDAX to no more than 3.5:1.\nWe have our Credit Facility with certain lenders and Independent Bank, as Administrative Agent and Letter of Credit Issuer, which provides for up to $100 million in borrowings from time to time and is subject to an at least semi-annual borrowing base determination. The borrowing base at September 30, 2022, was $50,000,000 and all obligations under the Credit Agreement are secured, subject to permitted liens and other exceptions, by a first-priority security interest on substantially all of our personal property and at least 80% of the total value of our proved, developed and producing Oil and Gas Properties. The revolving loan matures on September 1, 2025. Borrowings under the revolving loan are due at maturity. Interest on the Credit Agreement is calculated based on either (a) the Secured Overnight Financing Rate (SOFR) plus an applicable margin ranging from 2.750% to 3.750% per annum based on our Borrowing Base Utilization or (b) the greater of (1) the Prime Rate in effect for such day, or (2) the overnight cost of federal funds as announced by the US Federal Reserve System in effect on such day plus one-half of one percent (0.50%), plus, in each case, an applicable margin ranging from 1.750% to 2.750% per annum based on our Borrowing Base Utilization. Under the terms of the Credit Agreement, a 5% interest penalty may apply to any outstanding amount not paid when due or that remains outstanding while an event of default exists. At September 30, 2022, the effective rate was 5.93%. The Credit Agreement contains financial and various other covenants that are common in such agreements, including a (a) maximum ratio of consolidated Funded Indebtedness to consolidated pro forma EBITDAX of 3.50 to 1.00, calculated on a rolling four-quarter basis, and (b) minimum ratio of consolidated Current Assets to consolidated Current Liabilities (excluding the Loan Balance) of 1.00 to 1.00. Other negative covenants include restrictions on our ability to incur debt, grant liens, make fundamental changes and engage in certain transactions with affiliates. The Credit Agreement also restricts our ability to make certain restricted payments if both before and after the Restricted Payment (i) the Available Commitment is less than or equal to ten percent (10%) of the Borrowing Base or (ii) the Leverage Ratio on a pro forma basis is greater than 2.50 to 1.00. All capitalized terms in this description of the Credit Facility that are not otherwise defined in this Annual Report have the meaning assigned to them in the Credit Agreement.\nBased on our expected capital expenditure levels, anticipated cash provided by operating activities for 2023, combined with availability under our Credit Facility and potential future sales of Common Stock under our currently effective shelf registration statement, we believe we have sufficient liquidity to fund our ongoing operations.\nOn August 25, 2021, we entered into an At-The-Market Equity Offering Sales Agreement (the ATM Agreement) with Stifel, Nicolaus & Company, Incorporated, as sales agent and/or principal (Stifel), pursuant to which we may offer and sell, from time to time through or to Stifel, up to 3,000,000 shares of our Common Stock. As of September 30, 2022, we have sold 1,531,013 shares of Common Stock pursuant to the ATM Agreement for proceeds of approximately $5.9 million, net of commissions paid. As disclosed in Item 9B - Other Information of this Annual Report on Form 10-K, we voluntarily terminated the ATM Agreement on December 12, 2022.\nCONTRACTUAL OBLIGATIONS AND COMMITMENTS\nWe have our Credit Facility with certain lenders and Independent Bank, as Administrative Agent and Letter of Credit Issuer, which provides for up to $100 million in borrowings from time to time and is subject to an at least semi-annual borrowing base determination. The borrowing base at September 30, 2022, was $50,000,000 and all obligations under the Credit Agreement are secured, subject to permitted liens and other exceptions, by a first-priority security interest on substantially all of our personal property and at least 80% of the total value of our proved, developed and producing Oil and Gas Properties. The revolving loan matures on September 1, 2025. Borrowings under the revolving loan are due at maturity. Interest on the Credit Agreement is calculated based on either (a) the Secured Overnight Financing Rate (SOFR) plus an applicable margin ranging from 2.750% to 3.750% per annum based on our Borrowing Base Utilization or (b) the greater of (1) the Prime Rate in effect for such day, or (2) the overnight cost of federal funds as announced by the US Federal Reserve System in effect on such day plus one-half of one percent (0.50%), plus, in each case, an applicable margin ranging from 1.750% to 2.750% per annum based on our Borrowing Base Utilization. Under the terms of the Credit Agreement, a 5% interest penalty may apply to any outstanding amount not paid when due or that remains outstanding while an event of default exists. At September 30, 2022, the effective rate was 5.93%. All capitalized terms in this description of the Credit Facility that are not otherwise defined in this Annual Report have the meaning assigned to them in the Credit Agreement.\nDeterminations of the borrowing base are made at least semi-annually (on December 1 and June 1) or whenever the banks, in their discretion, believe that there has been a material change in the value of the natural gas and oil properties. The Credit Agreement contains financial and various other covenants that are common in such agreements, including a (a) maximum ratio of consolidated Funded Indebtedness to consolidated pro forma EBITDAX of 3.50 to 1.00, calculated on a rolling four-quarter basis, and (b) minimum ratio of consolidated Current Assets to consolidated Current Liabilities (excluding the Loan Balance) of 1.00 to 1.00. Other negative covenants include restrictions on our ability to incur debt, grant liens, make fundamental changes, and engage in certain transactions with affiliates. The Credit Agreement also restricts our ability to make certain restricted payments if before or after the Restricted Payment (i) the Available Commitment is less than or equal to ten percent (10%) of the Borrowing Base or (ii) the Leverage Ratio on a pro forma basis is greater than 2.50 to 1.00. At September 30, 2022, we were in compliance with the covenants of the Credit Facility, had $28,300,000 outstanding and had $21,700,000 of borrowing base availability under the Credit Facility.\nThe table below summarizes our contractual obligations and commitments as of September 30, 2022:\nPayments due by period\nContractual Obligations\nLess than\nMore than\nand Commitments\nTotal\n1 Year\n1-3 Years\n3-5 Years\n5 Years\nLong-term debt obligations\n$\n28,300,000\n$\n-\n$\n28,300,000\n$\n-\n$\n-\nBuilding lease\n$\n1,323,444\n$\n256,795\n$\n533,748\n$\n532,901\n$\n-\nOur building leases are accounted for as operating leases, and a related operating lease right-of-use (ROU) asset and operating lease liability has been recognized on our balance sheets.\nAt September 30, 2022, our derivative contracts were in a net liability position of $8,561,191. The ultimate settlement amounts of the derivative contracts are unknown because they are subject to continuing market risk. Please read ITEM 7A. Quantitative and Qualitative Disclosures About Market Risk\nCommodity Price Risk\nNatural gas, oil and NGL prices historically have been volatile, and this volatility is expected to continue. Uncertainty continues to exist as to the direction of natural gas, oil and NGL price trends, and there remains a wide divergence in the opinions held in the industry. We can be significantly impacted by changes in natural gas and oil prices. The market price of natural gas, oil and NGL in 2023 will impact the amount of cash generated from operating activities, which will in turn impact the level of our capital expenditures for acquisitions and production. Excluding the impact of our 2023 derivative contracts (see below), the price sensitivity for each $0.10 per Mcf change in wellhead natural gas price is approximately $742,771 for operating revenue based on our prior year natural gas volumes. The price sensitivity in 2023 for each $1.00 per barrel change in wellhead oil is approximately $198,535 for operating revenue based on our prior year oil volumes.\nFinancial Market Risk\nOperating income could also be impacted, to a lesser extent, by changes in the market interest rates related to our Credit Facility. Interest under our Credit Facility is calculated based on either (a) SOFR plus an applicable margin ranging from 2.750% to 3.750% per annum based on our Borrowing Base Utilization or (b) the greater of (1) the Prime Rate in effect for such day, or (2) the overnight cost of federal funds as announced by the US Federal Reserve System in effect on such day plus one-half of one percent (0.50%), plus, in each case, an applicable margin ranging from 1.750% to 2.750% per annum based on our Borrowing Base Utilization. Under the terms of the Credit Agreement, a 5% interest penalty may apply to any outstanding amount not paid when due or that remains outstanding while an event of default exists. At September 30, 2022, we had $28,300,000 outstanding under this facility and the effective interest rate was 5.93%. The impact of a 1% increase in the interest rate on this amount of debt would have resulted in an increase in interest expense, and a corresponding decrease in our results of operations, of $283,000 for the year ended September 30, 2022, assuming that our indebtedness remained constant throughout the period. At this point, we do not believe that our liquidity has been materially affected by the debt market uncertainties noted in the last few years, and we do not believe that our liquidity will be significantly impacted in the near future. All capitalized terms in this description of the interest rate under the Credit Facility that are not otherwise defined in this Annual Report have the meaning assigned to them in the Credit Agreement. ITEM 8 FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nReport of Registered Public Accounting Firm on Internal Control Over Financial Reporting (PCAOB ID Number 42)\nReport of Independent Registered Public Accounting Firm (PCAOB ID Number 42)\nBalance Sheets As of September 30, 2022 and 2021\nStatements of Operations for the Years Ended September 30, 2022, 2021 and 2020\nStatements of Stockholders Equity for the Years Ended September 30, 2022, 2021 and 2020\nStatements of Cash Flows for the Years Ended September 30, 2022, 2021 and 2020\nNotes to Financial Statements\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and the Board of Directors of PHX Minerals Inc.\nOpinion on Internal Control Over Financial Reporting\nWe have audited PHX Minerals Inc.s internal control over financial reporting as of September 30, 2022, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the COSO criteria). In our opinion, PHX Minerals Inc. (the Company) maintained, in all material respects, effective internal control over financial reporting as of September 30, 2022, based on the COSO criteria.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the balance sheets of the Company as of September 30, 2022, and 2021, the related statements of operations, stockholders equity, and cash flows for each of the three years in the period ended September 30, 2022, and the related notes, and our report dated December 13, 2022, expressed an unqualified opinion thereon.\nBasis for Opinion\nThe Companys management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Managements Report on Internal Control over Financial Reporting. Our responsibility is to express an opinion on the Companys internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects.\nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA companys internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A companys internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ Ernst & Young LLP\nOklahoma City, Oklahoma\nDecember 13, 2022\nReport of Independent Registered Public Accounting Firm\nTo the Stockholders and the Board of Directors of PHX Minerals Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of PHX Minerals Inc. (the Company) as of September 30, 2022 and 2021, the related statements of operations, stockholders equity and cash flows for each of the three years in the period ended September 30, 2022, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company at September 30, 2022 and 2021, and the results of its operations and its cash flows for each of the three years in the period ended September 30, 2022, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company's internal control over financial reporting as of September 30, 2022, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) and our report dated December 13, 2022, expressed an unqualified opinion thereon.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nDepreciation, Depletion and Amortization of Producing Natural Gas and Oil Working Interest Properties\nDescription of the Matter\nAt September 30, 2022, the net book value of the Companys natural gas and oil properties was $132.4 million, and depreciation, depletion and amortization (DD&A) expense related to the Companys natural gas and oil properties was $7.2 million. Of this amount, $3.3 million relates to DD&A on working interest properties. As discussed in Note 1, the Company follows the successful efforts method of accounting for its natural gas and oil producing activities. DD&A on working interest properties is recorded based on the units-of-production method on an individual property basis using proved or proved developed reserves, as applicable, as estimated by the Companys Independent Consulting Petroleum Engineers. Proved natural gas, oil and NGL reserves are estimated quantities of natural gas, oil and NGL which geological and engineering data demonstrate with reasonable certainty to be commercially recoverable in future years from known reservoirs under existing economic and operating conditions. The Companys Independent Consulting Petroleum Engineer, with assistance from the Company, prepares estimates of natural gas, oil and NGL reserves. These estimates are based on available geologic and seismic data, reservoir pressure data, core\nanalysis reports, well logs, analogous reservoir performance history, production data and other available sources of engineering, geological and geophysical information. For DD&A purposes, the reserve estimates are based on average individual product prices during the 12-month period prior to September 30, determined as an unweighted arithmetic average of the first-day-of-the-month price for each month within such period, unless prices were defined by contractual arrangements, excluding escalations based upon future conditions. Natural gas, oil and NGL prices are volatile and largely affected by worldwide production and consumption and are outside the control of management.\nSignificant judgment is required by the Independent Consulting Petroleum Engineers in evaluating geological and engineering data used to estimate natural gas, oil and NGL reserves. Estimating reserves also requires the selection of inputs, including natural gas, oil and NGL price assumptions, operating and capital costs assumptions and tax rates by jurisdiction, among others. Auditing the Companys working interest properties DD&A calculations is especially complex because of the use of the work of the Independent Petroleum Consulting Engineers and the evaluation of managements determination of the inputs described above used by the engineers in estimating proved developed natural gas, oil and NGL reserves.\nHow We Addressed the Matter in Our Audit\nWe obtained an understanding, evaluated the design and tested the operating effectiveness of internal controls over the Companys process to calculate DD&A, including managements controls over the completeness and accuracy of the financial data provided to the engineers for use in estimating proved developed natural gas, oil and NGL reserves.\nOur audit procedures included, among others, evaluating the professional qualifications and objectivity of the Independent Petroleum Consulting Engineers used to prepare the natural gas, oil and NGL reserve estimates. In addition, in assessing whether we can use the work of the Independent Petroleum Consulting Engineers we evaluated the completeness and accuracy of the financial data and inputs described above used by the engineers in estimating proved natural gas, oil and NGL reserves by agreeing them to source documentation and we identified and evaluated corroborative and contrary evidence. We also tested the mathematical accuracy of the DD&A calculations, including comparing the proved developed natural gas, oil and NGL reserve amounts used in the calculations to the Companys reserve report.\n/s/ Ernst & Young LLP\nWe have served as the Company's auditor since 1989.\nOklahoma City, Oklahoma\nDecember 13, 2022\nPHX Minerals Inc.\nBalance Sheets\nSeptember 30,\nAssets\nCurrent Assets:\nCash and cash equivalents\n$\n3,396,809\n$\n2,438,511\nNatural gas, oil and NGL sales receivables (net of $0 allowance for uncollectable accounts)\n13,152,274\n6,428,982\nRefundable income taxes\n-\n2,413,942\nOther\n1,372,847\n942,082\nTotal current assets\n17,921,930\n12,223,517\nProperties and equipment at cost, based on successful efforts accounting:\nProducing natural gas and oil properties\n248,978,928\n319,984,874\nNon-producing natural gas and oil properties\n51,779,336\n40,466,098\nOther\n1,085,056\n794,179\n301,843,320\n361,245,151\nLess accumulated depreciation, depletion and amortization\n(168,759,385\n)\n(257,643,661\n)\nNet properties and equipment\n133,083,935\n103,601,490\nOperating lease right-of-use assets\n739,131\n607,414\nOther, net\n757,116\n578,593\nTotal assets\n$\n152,502,112\n$\n117,011,014\nLiabilities and Stockholders' Equity\nCurrent Liabilities:\nAccounts payable\n$\n647,217\n$\n772,717\nDerivative contracts, net\n7,873,979\n12,087,988\nCurrent portion of operating lease liability\n213,355\n132,287\nIncome taxes payable\n495,858\n334,050\nAccrued liabilities and other\n2,032,275\n1,809,337\nTotal current liabilities\n11,262,684\n15,136,379\nLong-term debt\n28,300,000\n17,500,000\nDeferred income taxes\n1,585,906\n343,906\nAsset retirement obligations\n1,901,904\n2,836,172\nDerivative contracts, net\n687,212\n1,696,479\nOperating lease liability, net of current portion\n985,887\n789,339\nTotal liabilities\n44,723,593\n38,302,275\nStockholders' equity:\nVoting common stock, par value $0.01666 per share: 54,000,500 shares authorized and\n35,776,752 shares issued and outstanding at September 30, 2022; 36,000,500 shares\nauthorized and 32,770,433 shares issued and outstanding at September 30, 2021\n596,041\n545,956\nCapital in excess of par value\n44,177,051\n33,213,645\nDeferred directors' compensation\n1,496,243\n1,768,151\nRetained earnings\n67,117,791\n48,966,420\n113,387,126\n84,494,172\nTreasury stock, at cost: 377,232 shares at September 30, 2022; 388,545 shares\nat September 30, 2021\n(5,608,607\n)\n(5,785,433\n)\nTotal stockholders' equity\n107,778,519\n78,708,739\nTotal liabilities and stockholders' equity\n$\n152,502,112\n$\n117,011,014\nSee accompanying notes.\nPHX Minerals Inc.\nStatements of Operations\nYear ended September 30,\nRevenues:\nNatural gas, oil and NGL sales\n$\n69,860,631\n$\n37,749,044\n$\n23,370,003\nLease bonuses and rental income\n467,502\n425,113\n690,961\nGains (losses) on derivative contracts (Note 12)\n(16,833,078\n)\n(16,202,489\n)\n907,419\n53,495,055\n21,971,668\n24,968,383\nCosts and expenses:\nLease operating expenses\n4,047,420\n4,230,968\n4,841,541\nTransportation, gathering and marketing\n5,890,390\n5,767,287\n4,812,869\nProduction taxes\n3,230,867\n1,938,304\n1,022,912\nDepreciation, depletion and amortization\n7,278,118\n7,745,804\n11,313,783\nProvision for impairment\n14,565\n50,475\n29,904,528\nInterest expense\n1,164,992\n995,127\n1,286,788\nGeneral and administrative\n11,500,594\n8,207,882\n8,024,901\nLoss on debt extinguishment\n-\n260,236\n-\nLosses (gains) on asset sales and other\n(4,243,163\n)\n(356,127\n)\n(3,997,902\n)\n28,883,783\n28,839,956\n57,209,420\nIncome (loss) before provision (benefit) for income\ntaxes\n24,611,272\n(6,868,288\n)\n(32,241,037\n)\nProvision (benefit) for income taxes\n4,202,000\n(651,051\n)\n(8,289,000\n)\nNet income (loss)\n$\n20,409,272\n$\n(6,217,237\n)\n$\n(23,952,037\n)\nBasic and diluted earnings (loss) per common share (Note 7)\n$\n0.59\n$\n(0.24\n)\n$\n(1.41\n)\nSee accompanying notes.\nPHX Minerals Inc.\nStatements of Stockholders Equity\nVoting\nCapital in\nDeferred\nCommon Stock\nExcess of\nDirectors'\nRetained\nTreasury\nTreasury\nShares\nAmount\nPar Value\nCompensation\nEarnings\nShares\nStock\nTotal\nBalances at September 30, 2019\n16,897,306\n$\n281,509\n$\n2,967,984\n$\n2,555,781\n$\n81,848,301\n(558,051\n)\n$\n(8,344,042\n)\n$\n79,309,533\nNet income (loss)\n-\n-\n-\n-\n(23,952,037\n)\n-\n-\n(23,952,037\n)\nPurchase of treasury stock\n-\n-\n-\n-\n-\n(632\n)\n(7,635\n)\n(7,635\n)\nIssuance of treasury shares to ESOP\n-\n-\n(974,806\n)\n-\n-\n72,101\n1,077,910\n103,104\nRestricted stock awards\n-\n-\n743,897\n-\n-\n-\n-\n743,897\nDividends declared ($0.10 per share)\n-\n-\n-\n-\n(1,652,164\n)\n-\n-\n(1,652,164\n)\nDistribution of restricted stock to\nofficers and directors\n-\n-\n(82,820\n)\n-\n-\n5,546\n82,914\nDistribution of deferred directors'\ncompensation\n-\n-\n(129,575\n)\n(910,182\n)\n-\n69,549\n1,039,757\n-\nCommon shares to be issued to\ndirectors for services\n-\n-\n-\n228,408\n-\n-\n-\n228,408\nEquity offering\n5,750,000\n95,795\n8,124,931\n-\n-\n-\n-\n8,220,726\nBalances at September 30, 2020\n22,647,306\n$\n377,304\n$\n10,649,611\n$\n1,874,007\n$\n56,244,100\n(411,487\n)\n$\n(6,151,096\n)\n$\n62,993,926\nNet income (loss)\n-\n-\n-\n-\n(6,217,237\n)\n-\n-\n(6,217,237\n)\nPurchase of treasury stock\n-\n-\n-\n-\n-\n(1,229\n)\n(2,741\n)\n(2,741\n)\nRestricted stock awards\n-\n-\n801,200\n-\n-\n-\n-\n801,200\nDividends declared ($0.04 per share)\n-\n-\n-\n-\n(1,060,443\n)\n-\n-\n(1,060,443\n)\nDistribution of restricted stock to\nofficers and directors\n-\n-\n(369,260\n)\n-\n-\n24,171\n368,404\n(856\n)\nDistribution of deferred directors'\ncompensation\n24,545\n339,913\n(340,322\n)\n-\n-\n-\nIncrease in deferred directors' compensation charged to expense\n-\n-\n-\n234,466\n-\n-\n-\n234,466\nEquity issued to acquire assets\n3,702,582\n61,685\n10,210,603\n10,272,288\nEquity offering\n6,175,000\n102,875\n10,985,981\n-\n-\n-\n-\n11,088,856\nAt-the-market offering\n221,000\n3,682\n595,597\n-\n-\n-\n-\n599,279\nBalances at September 30, 2021\n32,770,433\n$\n545,956\n$\n33,213,645\n$\n1,768,151\n$\n48,966,420\n(388,545\n)\n$\n(5,785,433\n)\n$\n78,708,739\nNet income (loss)\n-\n-\n-\n-\n20,409,272\n-\n-\n20,409,272\nPurchase of treasury stock\n-\n-\n-\n-\n-\n(700\n)\n(1,855\n)\n(1,855\n)\nRestricted stock awards\n-\n-\n2,211,673\n-\n-\n-\n-\n2,211,673\nDividends declared ($0.065 per share)\n-\n-\n-\n-\n(2,257,901\n)\n-\n-\n(2,257,901\n)\nDistribution of restricted stock to\nofficers and directors\n115,373\n1,922\n(178,481\n)\n-\n-\n12,013\n178,681\n2,122\nDistribution of deferred directors'\ncompensation\n61,452\n1,024\n462,736\n(463,760\n)\n-\n-\n-\n-\nIncrease in deferred directors' compensation charged to expense\n-\n-\n-\n191,852\n-\n-\n-\n191,852\nEquity issued to acquire assets\n1,519,481\n25,315\n3,484,686\n-\n-\n-\n-\n3,510,001\nAt-the-market offering\n1,310,013\n21,824\n4,982,792\n-\n-\n-\n-\n5,004,616\nBalances at September 30, 2022\n35,776,752\n$\n596,041\n$\n44,177,051\n$\n1,496,243\n$\n67,117,791\n(377,232\n)\n$\n(5,608,607\n)\n$\n107,778,519\nSee accompanying notes.\nPHX Minerals Inc.\nStatements of Cash Flows\nYear ended September 30,\nOperating Activities\nNet income (loss)\n$\n20,409,272\n$\n(6,217,237\n)\n$\n(23,952,037\n)\nAdjustments to reconcile net income (loss) to net cash provided by operating activities:\nDepreciation, depletion and amortization\n7,278,118\n7,745,804\n11,313,783\nImpairment of producing properties\n14,565\n50,475\n29,904,528\nProvision for deferred income taxes\n1,242,000\n(985,101\n)\n(4,647,000\n)\nGain from leasing fee mineral acreage\n(466,341\n)\n(421,915\n)\n(685,927\n)\nProceeds from leasing fee mineral acreage\n688,207\n441,653\n701,948\nNet (gain) loss on sales of assets\n(4,423,646\n)\n(309,348\n)\n(3,973,321\n)\nESOP contribution expense\n-\n-\n103,104\nDirectors' deferred compensation expense\n191,852\n234,466\n228,408\nTotal (gain) loss on derivative contracts\n16,833,078\n16,202,489\n(907,419\n)\nCash receipts (payments) on settled derivative contracts\n(2,796,250\n)\n(11,925,669\n)\n4,109,210\nRestricted stock awards\n2,211,673\n801,200\n743,897\nLoss on debt extinguishment\n-\n260,236\n-\nOther\n87,353\n(11,099\n)\n(2,611\n)\nCash provided (used) by changes in assets and\nliabilities:\nNatural gas, oil and NGL sales receivables\n(6,723,292\n)\n(3,485,762\n)\n1,434,426\nRefundable (payable) income taxes\n2,413,942\n1,391,285\n(2,299,785\n)\nOther current assets\n250,568\n(436,401\n)\n(89,931\n)\nAccounts payable\n(10,305\n)\n(151,875\n)\n1,308,731\nOther non-current assets\n(380,964\n)\n(86,282\n)\n(1,044,680\n)\nIncome taxes payable\n161,808\n-\n-\nAccrued liabilities\n550,012\n845,168\n(1,139,029\n)\nTotal adjustments\n17,122,378\n10,159,324\n35,058,332\nNet cash provided by operating activities\n37,531,650\n3,942,087\n11,106,295\nInvesting Activities\nCapital expenditures\n$\n(552,638\n)\n$\n(733,172\n)\n$\n(403,136\n)\nAcquisition of minerals and overriding royalty interests\n(43,525,236\n)\n(20,624,347\n)\n(10,288,250\n)\nNet proceeds from sales of assets\n13,217,844\n988,600\n4,228,868\nNet cash provided (used) by investing activities\n(30,860,030\n)\n(20,368,919\n)\n(6,462,518\n)\nFinancing Activities\nBorrowings under Credit Facility\n21,300,000\n26,300,000\n6,061,725\nPayments of loan principal\n(10,500,000\n)\n(37,550,000\n)\n(12,736,725\n)\nNet proceeds from equity issuance\n5,006,538\n11,688,137\n8,220,726\nCash receipts from (payments on) off-market derivative contracts\n(19,260,104\n)\n8,800,000\n-\nPurchases of treasury stock\n(1,855\n)\n(2,741\n)\n(7,635\n)\nPayments of dividends\n(2,257,901\n)\n(1,060,448\n)\n(1,652,164\n)\nNet cash provided (used) by financing activities\n(5,713,322\n)\n8,174,948\n(114,073\n)\nIncrease (decrease) in cash and cash equivalents\n958,298\n(8,251,884\n)\n4,529,704\nCash and cash equivalents at beginning of year\n2,438,511\n10,690,395\n6,160,691\nCash and cash equivalents at end of year\n$\n3,396,809\n$\n2,438,511\n$\n10,690,395\nSupplemental Disclosures of Cash Flow\nInformation\nInterest paid (net of capitalized interest)\n$\n997,085\n$\n1,021,142\n$\n1,306,967\nIncome taxes paid (net of refunds received)\n$\n384,249\n$\n(1,391,225\n)\n$\n(1,342,275\n)\nSupplemental schedule of noncash investing and\nfinancing activities:\nAdditions and revisions, net, to asset retirement obligations\n$\n-\n$\n-\n$\nGross additions to properties and equipment\n$\n46,791,346\n$\n31,485,015\n$\n10,701,284\nValue of shares used for acquisitions\n(3,510,001\n)\n(10,272,288\n)\n-\nNet (increase) decrease in accounts payable for\nproperties and equipment additions\n796,529\n144,792\n(9,898\n)\nCapital expenditures and acquisitions\n$\n44,077,874\n$\n21,357,519\n$\n10,691,386\nPHX Minerals Inc.\nNotes to Financial Statements\nSeptember 30, 2022, 2021, and 2020\n1. SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES\nNature of Business\nThe Companys principal line of business is maximizing the value of its existing mineral and royalty assets through active management and expanding its asset base through acquisitions of additional mineral and royalty interests. The Company owns mineral and leasehold properties and other natural gas and oil interests, which are all located in the contiguous United States, primarily in Oklahoma, Texas, Louisiana, North Dakota and Arkansas, with properties located in several other states. The Companys natural gas, oil and NGL production is from interests in 6,362 wells located principally in Oklahoma, Louisiana, Texas, Arkansas and North Dakota. The Company does not operate any wells. Approximately 66%, 26% and 8% of natural gas, oil and NGL revenues were derived from the sale of natural gas, oil and NGL, respectively, in 2022. Approximately 78%, 12% and 10% of the Companys total sales volumes in 2022 were derived from natural gas, oil and NGL, respectively. Substantially all the Companys natural gas, oil and NGL production is sold through the operators of the wells.\nUse of Estimates\nPreparation of financial statements in conformity with accounting principles generally accepted in the United States requires management to make estimates and assumptions that affect the amounts and disclosures reported in the financial statements and accompanying notes. Actual results could differ from those estimates.\nOf these estimates and assumptions, management considers the estimation of natural gas, crude oil and NGL reserves to be the most significant. These estimates affect the unaudited standardized measure disclosures, as well as DD&A and impairment calculations. The Companys Independent Consulting Petroleum Engineer, with assistance from the Company, prepares estimates of natural gas, crude oil and NGL reserves on an annual basis, with a semi-annual update. These estimates are based on available geologic and seismic data, reservoir pressure data, core analysis reports, well logs, analogous reservoir performance history, production data and other available sources of engineering, geological and geophysical information. For DD&A purposes, and as required by the guidelines and definitions established by the SEC, the reserve estimates were based on average individual product prices during the 12-month period prior to September 30, determined as an unweighted arithmetic average of the first-day-of-the-month price for each month within such period, unless prices were defined by contractual arrangements, excluding escalations based upon future conditions. For impairment purposes, projected future natural gas, crude oil and NGL prices as estimated by management are used. Natural gas, crude oil and NGL prices are volatile and largely affected by worldwide production and consumption and are outside the control of management. Management uses projected future natural gas, crude oil and NGL pricing assumptions to prepare estimates of natural gas, crude oil and NGL reserves used in formulating managements overall operating decisions.\nAs a non-operator of working, royalty and mineral interests, the Company receives actual natural gas, oil and NGL sales volumes and prices more than a month after the information is available to the operators of the wells. Because of the delay in information, the most current available production data is gathered from the appropriate operators, as well as public and private sources, and natural gas, oil and NGL index prices are used to estimate the accrual of revenue on these wells. If information is not available from an outside source, the Company utilizes past production receipts and estimated sales price information to estimate its accrual of revenue on all other wells each quarter. The natural gas, oil and NGL sales revenue accrual can be impacted by many variables including rapid production decline rates, production curtailments by operators, the shut-in of wells with mechanical problems and rapidly changing market prices for natural gas, oil and NGL. These variables could lead to an over or under accrual of natural gas, oil and NGL at the end of any particular quarter. Based on past history, the Companys estimated accrual has been materially accurate.\nBasis of Presentation\nCertain reclassifications have been made to prior period financials to conform to the current year presentation. These reclassifications have no impact on previous reported total assets, total liabilities, net loss, stockholders equity, or operating cash flows.\nCash and Cash Equivalents\nCash and cash equivalents consist of all demand deposits and funds invested in short-term investments with original maturities of three months or less.\nNatural Gas, Oil and NGL Sales\nThe Company sells natural gas, oil and NGL to various customers, recognizing revenues as natural gas, oil and NGL is produced and sold.\nAccounts Receivable and Concentration of Credit Risk\nSubstantially all of the Companys accounts receivable are due from purchasers (operators) of natural gas, oil and NGL. Natural gas, oil and NGL sales receivables are generally unsecured. This industry concentration has the potential to impact our overall exposure to credit risk, in that the purchasers of our natural gas, oil and NGL and the operators of the properties in which we have an interest may be similarly affected by changes in economic, industry or other conditions. During 2022, 2021, and 2020 the Company did not have any bad debt expense. The Companys allowance for uncollectible accounts as of the balance sheet dates was not material.\nNatural Gas and Oil Producing Activities\nThe Company follows the successful efforts method of accounting for natural gas and oil producing activities. For working interest properties, intangible drilling and other costs of successful wells and development dry holes are capitalized and amortized. The costs of exploratory wells are initially capitalized, but charged against income, if and when the well does not reach commercial production levels. Natural gas and oil mineral and leasehold costs are capitalized when incurred.\nLeasing of Mineral Rights\nThe Company generates lease bonuses by leasing its mineral interests to exploration and production companies. A lease agreement represents the Company's contract with a third party and generally conveys the rights to any natural gas, oil or NGL discovered, grants the Company a right to a specified royalty interest and requires that drilling and completion operations commence within a specified time period. Control is transferred to the lessee and the Company has satisfied its performance obligation when the lease agreement is executed, such that revenue is recognized when the lease bonus payment is received. The Company accounts for its lease bonuses as conveyances in accordance with the guidance set forth in ASC 932, and it recognizes the lease bonus as a cost recovery with any excess above its cost basis in the mineral being treated as income. The excess of lease bonus above the mineral basis is shown in the lease bonuses and rentals line item on the Companys Statements of Operations.\nDerivatives\nThe Company utilizes derivative contracts to reduce its exposure to short-term fluctuations in the price of natural gas and oil. These derivatives are recorded at fair value on the balance sheet. The Company has elected not to complete the documentation requirements necessary to permit these derivative contracts to be accounted for as cash flow hedges.\nProperties and Equipment\nDepreciation, Depletion and Amortization\nDepreciation, depletion and amortization of the costs of producing natural gas and oil properties are generally computed using the unit-of-production method primarily on an individual property basis using proved or proved developed reserves, as applicable, as estimated by the Companys Independent Consulting Petroleum Engineer. The Companys capitalized costs of drilling and equipping all development wells, and those exploratory wells that have found proved reserves, are amortized on a unit-of-production basis over the remaining life of associated proved developed reserves. Leasehold costs for working interest properties are amortized on a unit-of-production basis over the remaining life of associated total proved reserves. Depreciation of furniture and fixtures is computed using the straight-line method over estimated productive lives of five to eight years.\nNon-producing natural gas and oil properties include non-producing minerals, which had a net book value of $43,223,165 and $32,542,709 at September 30, 2022 and 2021, respectively, consisting of perpetual ownership of mineral interests in several states, with 60% of the acreage in Oklahoma, Texas, Louisiana, North Dakota and Arkansas. As mentioned, these mineral rights are perpetual and have been accumulated over the 96-year life of the Company. There are approximately 178,318 net acres of non-producing minerals in more than 5,727 tracts owned by the Company. An average tract contains approximately 30 acres. Since inception, the Company has continually generated an interest in several thousand natural gas and oil wells using its ownership of the fee mineral acres as an ownership basis. There continues to be drilling and leasing activity on these mineral interests each year. Non-producing minerals are considered a long-term investment by the Company, as they do not expire (unlike natural gas and oil leases) and based on past history and experience, management has concluded that a long-term straight-line amortization over 33 years is appropriate. Due to the fact that the Companys mineral ownership consists of a large number of properties, whose costs are not individually significant, and because virtually all are in the Companys core operating areas, the minerals are being amortized on an aggregate basis (by mineral deed).\nWhen a new well is drilled on the Companys mineral acreage, all of the non-producing mineral costs for the associated mineral deed are transferred to producing minerals and are amortized straight-line over a 20-year period (insignificant fields are amortized over a 10-year period). Management has historically chosen to move non-producing mineral costs in this manner, as it is very difficult for the Company, as a non-operator, to predict well spacing and timing of drilling on the Companys minerals, and future development will deplete these assets over a long period. The straight-line amortization over a 20-year period is appropriate for producing minerals, because current and future development will deplete these assets over a lengthy period that represents the estimated economic life.\nCapitalized Interest\nDuring 2022, 2021, and 2020, no interest was capitalized. Interest of $1,164,992, $995,127 and $1,286,788, respectively, was charged to expense during those periods.\nAccrued Liabilities\nThe following table shows the balances for the years ended September 30, 2022 and 2021, relating to the Companys accrued liabilities:\nYear Ended September 30,\nAccrued compensation\n$\n1,296,471\n$\n982,259\nRevenues payable\n263,225\n275,981\nAccrued ad valorem\n190,216\n245,116\nOther\n282,363\n305,981\nTotal accrued liabilities\n$\n2,032,275\n$\n1,809,337\nThe increase in accrued compensation in 2022 is primarily due to the short-term incentive compensation driven by Company performance.\nAsset Retirement Obligations\nThe Company owns interests in natural gas and oil properties, which may require expenditures to plug and abandon the wells upon the end of their economic lives. The fair value of legal obligations to retire and remove long-lived assets is recorded in the period in which the obligation is incurred (typically when the asset is installed at the production location). When the liability is initially recorded, this cost is capitalized by increasing the carrying amount of the related properties and equipment. Over time the liability is increased for the change in its present value, and the capitalized cost in properties and equipment is depreciated over the useful life of the remaining asset. The Company does not have any assets restricted for the purpose of settling asset retirement obligations.\nEnvironmental Costs\nAs the Company is directly involved in the extraction and use of natural resources, it is subject to various federal, state and local provisions regarding environmental and ecological matters. Compliance with these laws may necessitate significant capital outlays. The Company does not believe the existence of current environmental laws, or interpretations thereof, will materially hinder or adversely affect the Companys business operations; however, there can be no assurances of future effects on the Company of new laws or interpretations thereof. Since the Company does not operate any wells where it owns an interest, actual compliance with environmental laws is controlled by the well operators, with the Company being responsible for its proportionate share of the costs involved (on working interest wells only). The Company carries liability and pollution control insurance. However, all risks are not insured due to the availability and cost of insurance.\nEnvironmental liabilities, which historically have not been material, are recognized when it is probable that a loss has been incurred and the amount of that loss is reasonably estimable. Environmental liabilities, when accrued, are based upon estimates of expected future costs. At September 30, 2022 and 2021, there were no such costs accrued.\nEarnings (Loss) Per Share of Common Stock\nEarnings (loss) per share is calculated using net income (loss) divided by the weighted average number of common shares outstanding, plus unissued, vested directors deferred compensation shares during the period.\nShare-based Compensation\nThe Company recognizes current compensation costs for its Deferred Compensation Plan for Non-Employee Directors (the Plan). Compensation cost is recognized for the requisite directors fees as earned and unissued stock is recorded to each directors account based on the fair market value of the stock at the date earned. The Plan provides that only upon retirement, termination or death of the director or upon a change in control of the Company, the shares accrued under the Plan may be issued to the director.\nIn accordance with guidance on accounting for employee stock ownership plans, the Company recorded the fair market value of the stock contributed into its ESOP as expense.\nRestricted stock awards to officers and employees provide for either cliff vesting at the end of three years from the date of the awards or time vesting ratably over a three year period. These restricted stock awards can be granted based on service time only (time-based), subject to certain share price performance standards (market-based) or subject to company performance standards (performance-based). Restricted stock awards to the non-employee directors provide for annual vesting during the calendar year of the award. The fair value of the awards on the grant date is ratably expensed over the vesting period in accordance with accounting guidance.\nIncome Taxes\nThe estimation of amounts of income tax to be recorded by the Company involves interpretation of complex tax laws and regulations, as well as the completion of complex calculations, including the determination of the Companys percentage depletion deduction. Although the Companys management believes its tax accruals are adequate, differences may occur in the future depending on the resolution of pending and new tax regulations. Deferred income taxes are computed using the liability method and are provided on all temporary differences between the financial basis and the tax basis of the Companys assets and liabilities.\nThe Companys provision for income taxes differs from the statutory rate primarily due to estimated federal and state benefits generated from estimated excess federal and Oklahoma percentage depletion, which are permanent tax benefits. Excess percentage depletion, both federal and Oklahoma, can only be taken in the amount that it exceeds cost depletion which is calculated on a unit-of-production basis.\nBoth excess federal percentage depletion, which is limited to certain production volumes and by certain income levels, and excess Oklahoma percentage depletion, which has no limitation on production volume, reduce estimated taxable income or add to estimated taxable loss projected for any year. Federal and Oklahoma excess percentage depletion, when a provision for income taxes is expected for the year, decreases the effective tax rate, while the effect is to increase the effective tax rate when a benefit for income taxes is expected for the year. The benefits of federal and Oklahoma excess percentage depletion and excess tax benefits and deficiencies of stock-based compensation are not directly related to the amount of pre-tax income (loss) recorded in a period. Accordingly, in periods where a recorded pre-tax income or loss is relatively small, the proportional effect of these items on the effective tax rate may be significant. The effective tax rate for the year ended September 30, 2022, was a 17% provision, as compared to a 9% benefit for the year ended September 30, 2021.\nThe threshold for recognizing the financial statement effect of a tax position is when it is more likely than not, based on the technical merits, that the position will be sustained by a taxing authority. Recognized tax positions are initially and subsequently measured as the largest amount of tax benefit that is more likely than not to be realized upon ultimate settlement with a taxing authority. The Company files income tax returns in the U.S. federal jurisdiction and various state jurisdictions. Subject to statutory exceptions that allow for a possible extension of the assessment period, the Company is no longer subject to U.S. federal, state, and local income tax examinations for fiscal years prior to 2019.\nThe Company includes interest assessed by the taxing authorities in interest expense and penalties related to income taxes in general and administrative expense on its Statements of Operations. For the fiscal years ended September 30, 2022, 2021, and 2020, the Companys interest and penalties were not material. The Company does not believe it has any material uncertain tax positions.\nRecent Accounting Pronouncements\nStandard\nDescription\nDate of Adoption\nImpact on Financial Statements or Other Significant Matters\nAdoption of New Accounting Pronouncements\nASU 2016-02, Leases (Topic 842)\nThis update will supersede the lease requirements in Topic 840, Leases, by requiring lessees to recognize lease assets and lease liabilities classified as operating leases on the balance sheet.\nQ1 2020\nSee Note 2. Leases and Commitments for further details related the Companys adoption of this standard.\nASU 2018-11, Leases (Topic 842), Targeted Improvements and ASC 842\nThis update will allow entities to apply the transition provisions of the new standard at the adoption date instead of at the earliest comparative period presented in the financial statements and will allow entities to continue to apply the legacy guidance in Topic 840, including disclosure requirements, in the comparative period presented in the year the new leases standard is adopted. Entities that elect this option would still adopt the new leases standard using a modified retrospective transition method but would recognize a cumulative-effect adjustment to the opening balance of retained earnings in the period of adoption, if any, rather than in the earliest period presented.\nQ1 2020\nSee Note 2. Leases and Commitments for further details related the Companys adoption of this standard.\nASU 2016-13, Financial Instruments-Credit Losses (Topic 326): Measurement of Credit Losses on Financial Instruments.\nThis standard changes how entities will measure credit losses for most financial assets and certain other instruments that are not measured at fair value through net income. The standard will replace the currently required incurred loss approach with an expected loss model for instruments measured at amortized cost.\nQ1 2021\nThe adoption of this update did not have a material impact on the Company's balance sheet, statement of operations or liquidity. The Company's credit losses on natural gas, oil and NGL sales receivables are immaterial.\nASU 2019-12, Simplifying the Accounting for Income Taxes.\nThis standard is intended to clarify and simplify the accounting for income taxes by removing certain exceptions and amending existing guidance.\nQ1 2022\nThe adoption of this update did not have a material impact on the Company's financial statements and related disclosures.\nOther accounting standards that have been issued or proposed by the FASB, or other standards-setting bodies, and that do not require adoption until a future date are not expected to have a material impact on the Companys financial statements upon adoption.\n2. LEASES AND COMMITMENTS\nAssessment of Leases\nThe Company determines if an arrangement is a lease at inception by considering whether (i) explicitly or implicitly identified assets have been deployed in the agreement and (ii) the Company obtains substantially all of the economic benefits from the use of that underlying asset and directs how and for what purpose the asset is used during the term of the agreement. As of September 30, 2022, none of the Companys leases were classified as financing leases. Operating lease liabilities represent the Companys obligation to make lease payments arising from the lease. The Company entered into a seven-year lease for office space during the quarter ended March 31, 2020, with a commencement date in August 2020. The associated lease liability and ROU asset at September 30, 2022, were $789,339 and $519,334, respectively. The Company has a lease incentive asset of $244,253, which is included in Other, net on the Companys balance sheets. Additionally, the Company entered into a new five-year lease for office space during the quarter ended March 31, 2022, with a commencement date in July 2022. The associated lease liability and ROU asset at September 30, 2022, were $409,903 and $219,797, respectively. The Company has a lease incentive asset of $146,548, which is included in Other, net on the Companys balance sheets.\nROU assets represent the Companys right to use an underlying asset for the lease term, and operating lease liabilities represent the Companys obligation to make payments arising from the lease. ROU assets are recognized at commencement date and consist of the present value of remaining lease payments over the lease term, initial direct costs and prepaid lease payments less any lease incentives. Operating lease liabilities are recognized at commencement date based on the present value of remaining lease payments over the lease term. The Company uses the implicit rate, when readily determinable, or its incremental borrowing rate based on the information available at commencement date to determine the present value of lease payments.\nThe lease terms may include periods covered by options to extend the lease when it is reasonably certain that the Company will exercise that option and periods covered by options to terminate the lease when it is not reasonably certain that the Company will exercise that option. Lease expense for lease payments will be recognized on a straight-line basis over the lease term. The Company made an accounting policy election to not recognize leases with terms, including applicable options, of less than twelve months on the Companys balance sheets and recognize those lease payments in the Companys Statements of Operations on a straight-line basis over the lease term. In the event that the Companys assumptions and expectations change, it may have to revise its ROU assets and operating lease liabilities.\nThe following table represents the maturities of the operating lease liabilities as of September 30, 2022:\n$\n256,794\n265,097\n268,651\n276,953\n255,948\nThereafter\n-\nTotal lease payments\n$\n1,323,443\nLess: Imputed interest\n(124,201\n)\nTotal\n$\n1,199,242\n3. REVENUES\nNatural gas and oil derivative contracts\nSee Note 12 for discussion of the Companys accounting for derivative contracts.\nRevenues from Contracts with Customers\nNatural gas, oil and NGL sales\nSales of natural gas, oil and NGL are recognized when production is sold to a purchaser and control has transferred. Oil is priced on the delivery date based upon prevailing prices published by purchasers with certain adjustments related to oil quality and physical location. The price the Company receives for natural gas and NGL is tied to a market index, with certain adjustments based on, among other factors, whether a well delivers to a gathering or transmission line, quality and heat content of natural gas, and prevailing supply and demand conditions, so that the price of natural gas fluctuates to remain competitive with other available natural gas supplies. These market indices are determined on a monthly basis. Each unit of commodity is considered a separate performance obligation; however, as consideration is variable, the Company utilizes the variable consideration allocation exception permitted under the standard to allocate the variable consideration to the specific units of commodity to which they relate.\nDisaggregation of natural gas, oil and NGL revenues\nThe following table presents the disaggregation of the Companys natural gas, oil and NGL revenues for the year ended September 30, 2022.\nYear Ended September 30, 2022\nRoyalty Interest\nWorking Interest\nTotal\nNatural gas revenue\n$\n30,837,464\n$\n14,930,201\n$\n45,767,665\nOil revenue\n10,851,353\n7,279,566\n18,130,919\nNGL revenue\n2,795,655\n3,166,392\n5,962,047\nNatural gas, oil and NGL sales\n$\n44,484,472\n$\n25,376,159\n$\n69,860,631\nPerformance obligations\nThe Company satisfies the performance obligations under its natural gas, oil and NGL sales contracts upon delivery of its production and related transfer of title to purchasers. Upon delivery of production, the Company has a right to receive consideration from its purchasers in amounts that correspond with the value of the production transferred.\nAllocation of transaction price to remaining performance obligations\nNatural gas, oil and NGL sales\nAs the Company has determined that each unit of product generally represents a separate performance obligation, future volumes are wholly unsatisfied, and disclosure of the transaction price allocated to remaining performance obligations is not required. The Company has utilized the practical expedient in ASC 606, which permits the Company to allocate variable consideration to one or more but not all performance obligations in the contract if the terms of the variable payment relate specifically to the Companys efforts to satisfy that performance obligation and allocating the variable amount to the performance obligation is consistent with the allocation objective under ASC 606. Additionally, the Company will not disclose variable consideration subject to this practical expedient.\nPrior-period performance obligations and contract balances\nThe Company records revenue in the month production is delivered to the purchaser. As a non-operator, the Company has limited visibility into the timing of when new wells start producing, and production statements may not be received for 30 to 90 days or more after the date production is delivered. As a result, the Company is required to estimate the amount of production delivered to the purchaser and the price that will be received for the sale of the product. The expected sales volumes and prices for these properties are estimated and recorded within the natural gas, oil and NGL sales receivables line item on the Companys balance sheets. The difference between the Companys estimates and the actual amounts received for natural gas, oil and NGL sales is recorded in the quarter that payment is received from the third party. For the years ended September 30, 2022, 2021, and 2020, revenue recognized in these reporting periods related to performance obligations satisfied in prior reporting periods for existing wells was considered a change in estimate.\n4. INCOME TAXES\nThe Companys provision (benefit) for income taxes is detailed as follows:\nCurrent:\nFederal\n$\n2,522,000\n$\n315,050\n$\n(3,642,000\n)\nState\n438,000\n19,000\n-\n2,960,000\n334,050\n(3,642,000\n)\nDeferred:\nFederal\n845,000\n(824,000\n)\n(3,611,000\n)\nState\n397,000\n(161,101\n)\n(1,036,000\n)\n1,242,000\n(985,101\n)\n(4,647,000\n)\n$\n4,202,000\n$\n(651,051\n)\n$\n(8,289,000\n)\nThe difference between the provision (benefit) for income taxes and the amount which would result from the application of the federal statutory rate to income before provision (benefit) for income taxes is analyzed below for the years ended September 30:\nProvision (benefit) for income taxes at statutory rate\n$\n5,168,366\n$\n(1,429,291\n)\n$\n(6,765,705\n)\nChange in valuation allowance\n(1,313,271\n)\n1,228,899\n96,000\nPercentage depletion\n(602,490\n)\n(412,650\n)\n(258,300\n)\nState income taxes, net of federal provision (benefit)\n863,042\n(176,960\n)\n(939,310\n)\nEffect of NOL Carryback Rate\n-\n-\n(610,803\n)\nRestricted stock tax benefit\n59,000\n76,000\n58,000\nDeferred directors' compensation benefit\n64,000\n54,000\n79,000\nLaw change\n(56,094\n)\n47,000\n-\nOther\n19,447\n(38,049\n)\n52,118\n$\n4,202,000\n$\n(651,051\n)\n$\n(8,289,000\n)\nDeferred tax assets and liabilities, resulting from differences between the financial statement carrying amounts and the tax basis of assets and liabilities, consist of the following at September 30:\nDeferred tax liabilities:\nFinancial basis in excess of tax basis, principally intangible\ndrilling costs capitalized for financial purposes and\nexpensed for tax purposes\n$\n5,121,376\n$\n4,090,017\nDerivative contracts\n-\n-\nTotal deferred tax liabilities\n5,121,376\n4,090,017\nDeferred tax assets:\nState net operating loss carry forwards\n14,737\n238,439\nFederal net operating loss carry forwards\n-\n-\nStatutory depletion carryover\n-\n286,440\nAsset retirement obligations\n337,247\n483,990\nDeferred directors' compensation\n331,395\n390,683\nRestricted stock expense\n705,195\n303,674\nDerivative contracts\n2,072,530\n3,278,067\nOther\n88,095\n91,717\nTotal deferred tax assets\n3,549,199\n5,073,010\nDeferred tax asset valuation allowance\n-\n1,251,096\nState NOL valuation allowance\n13,729\n75,803\nNet deferred tax (assets) liabilities\n$\n1,585,906\n$\n343,906\nIncluded in state net operating loss carry forwards at September 30, 2022, the Company had a deferred tax asset of $14,737 related to Arkansas state income tax net operating loss (AR NOL) carry-forwards, which begin to expire in 2023. The Company has a valuation allowance of $13,729 for the AR NOLs, as it is more likely than not that it will not be utilized before expiration.\nThe federal Coronavirus Aid, Relief, and Economic Security Act (CARES Act) was enacted on March 27, 2020. The CARES Act provides relief to corporate taxpayers by permitting a five-year carryback of 2018-2020 Net Operating Losses (NOLs), removing the 80% limitation on the carryback of those NOLs, increasing the Section 163(j) 30% limitation on interest expense deductibility to 50% of adjusted taxable income for 2019 and 2020, and accelerates refunds for minimum tax credit carryforwards, along with a few other provisions. On July 28, 2020, final regulations were issued under Section 163(j) which modified the calculation under the previous proposed regulations of adjusted taxable income for purposes of the 50% limitation on interest expense. Under the final regulations, depreciation, amortization, and depletion capitalizable under Section 263A is now added back to tentative taxable income. This change allows all interest expense to be deductible for 2020 and reduces the associated deferred tax asset to zero. In fiscal 2021, the Company received a tax refund associated with the AMT credits totaling $1.4 million, which was accelerated due to the CARES Act. In fiscal 2022, the Company received $2.2 million associated with the carryback of the 2020 federal net operating loss.\n5. DEBT\nOn September 1, 2021, the Company entered into a $100,000,000 credit facility (the Credit Facility) with a group of banks headed by Independent Bank, which replaced the Companys prior credit facility with BOKF, NA dba Bank of Oklahoma (BOKF), as administrative agent, which the Company repaid in full and terminated. The Credit Facility has a current borrowing base of $50,000,000 as of September 30, 2022, and a maturity date of September 1, 2025. The Credit Facility is secured by the Companys personal property and at least 80% of the total value of the proved, developed and producing oil and gas properties. The interest rate is based on either (a) the Secured Overnight Financing Rate (SOFR) plus an applicable margin ranging from 2.750% to 3.750% per annum based on the Companys Borrowing Base Utilization or (b) the greater of (1) the Prime Rate in effect for such day, or (2) the overnight cost of federal funds as announced by the US Federal Reserve System in effect on such day plus one-half of one percent (0.50%), plus, in each case, an applicable margin ranging from 1.750% to 2.750% per annum based on the Companys Borrowing Base Utilization. The election of Independent Bank prime or SOFR is at the Companys discretion. The interest rate spread from Independent Bank prime or SOFR will be charged based on the ratio of the loan balance to the borrowing base. The interest rate spread from SOFR or the prime rate increases as a larger percent of the borrowing base is advanced. At September 30, 2022, the effective interest rate was 5.93%.\nThe Companys debt is recorded at the carrying amount on its balance sheets. The carrying amount of the Credit Facility approximates fair value because the interest rates are reflective of market rates. Debt issuance costs associated with the Credit Facility are presented in Other, net on the Companys balance sheets. Total debt issuance cost net of amortization as of September 30, 2022, was $336,232. The debt issuance cost is amortized over the life of the Credit Facility.\nDeterminations of the borrowing base are made semi-annually (usually June and December) or whenever the banks, in their sole discretion, believe that there has been a material change in the value of the Companys natural gas and oil properties. The Credit Facility contains customary covenants which, among other things, require periodic financial and reserve reporting and place certain limits on the Companys incurrence of indebtedness, liens, make fundamental changes, and engage in certain transactions with affiliates. The Credit Agreement also restricts the Companys ability to make certain restricted payments if before or after the Restricted Payment (i) the Available Commitment is less than ten percent (10%) of the Borrowing Base or (ii) the Leverage Ratio on a pro forma basis is greater than 2.50 to 1.00. In addition, the Company is required to maintain certain financial ratios, a current ratio (as described in the Credit Agreement) of no less than 1.0 to 1.0 and a funded debt to EBITDAX (as defined in the Credit Agreement) of no more than 3.5 to 1.0 based on the trailing twelve months. At September 30, 2022, the Company was in compliance with the covenants of the Credit Facility, had $28,300,000 outstanding, and had $21,700,000 of borrowing base availability under the Credit Facility. All capitalized terms in this description of the Credit Facility that are not otherwise defined in this Annual Report have the meaning assigned to them in the Credit Agreement.\n6. STOCKHOLDERS EQUITY\nIn May 2014, the Board adopted stock repurchase resolutions (the Repurchase Program) to allow management, at its discretion, to purchase the Companys Common Stock as treasury shares up to an amount equal to the aggregate number of shares of Common Stock awarded pursuant to the 2010 Restricted Stock Plan (2010 Stock Plan), as amended, contributed by the Company to its ESOP and credited to the accounts of directors pursuant to the Deferred Compensation Plan for Non-Employee Directors.\nEffective in May 2018, the Board approved an amendment to the Companys existing stock Repurchase Program. As amended, the Repurchase Program continues to allow the Company to repurchase up to $1.5 million of the Companys Common Stock at managements discretion. The Board added language to clarify that this is intended to be an evergreen program as the repurchase of an additional $1.5 million of the Companys Common Stock is authorized and approved whenever the previous amount is utilized. In addition, the number of shares allowed to be purchased by the Company under the Repurchase Program is no longer capped at an amount equal to the aggregate number of shares of Common Stock (i) awarded pursuant to the 2010 Stock Plan, as amended, (ii) contributed by the Company to its ESOP, and (iii) credited to the accounts of directors pursuant to the Deferred Compensation Plan for Non-Employee Directors.\nOn August 25, 2021, the Company entered into an At-The-Market Equity Offering Sales Agreement, pursuant to which the Company may offer and sell from time to time up to 3 million shares of Common Stock.\n7. EARNINGS (LOSS) PER SHARE (EPS)\nBasic and diluted earnings (loss) per common share is calculated using net income (loss) divided by the weighted average number of shares of Common Stock outstanding, including unissued, vested directors deferred compensation shares of 219,286, 183,334 and 154,142, respectively, during the 2022, 2021, and 2020 periods.\nFor the years ended September 30, 2021 and 2020, the Company did not include restricted stock in the diluted EPS calculation because the effect would have been antidilutive. The average shares outstanding of restricted stock excluded from the diluted EPS calculation was 141,690 and 80,809 for the years ended September 30, 2021 and 2020, respectively.\nThe following table sets forth the computation of earnings (loss) per share.\nYear Ended September 30,\nBasic EPS\nNumerator:\nBasic net income (loss)\n$\n20,409,272\n$\n(6,217,237\n)\n$\n(23,952,037\n)\nDenominator:\nCommon Shares\n34,184,212\n25,742,202\n16,856,792\nUnissued, directors' deferred compensation shares\n219,286\n183,334\n154,142\nBasic weighted average shares outstanding\n34,403,498\n25,925,536\n17,010,934\nBasic EPS\n$\n0.59\n$\n(0.24\n)\n$\n(1.41\n)\nDiluted EPS\nNumerator:\nBasic net income (loss)\n$\n20,409,272\n$\n(6,217,237\n)\n$\n(23,952,037\n)\nDiluted net income (loss)\n20,409,272\n(6,217,237\n)\n(23,952,037\n)\nDenominator:\nBasic weighted average shares outstanding\n34,403,498\n25,925,536\n17,010,934\nEffects of dilutive securities:\nUnvested restricted stock\n156,812\n-\n-\nDiluted weighted average shares outstanding\n34,560,310\n25,925,536\n17,010,934\nDiluted EPS\n$\n0.59\n$\n(0.24\n)\n$\n(1.41\n)\n8. 401K PLAN AND EMPLOYEE STOCK OWNERSHIP PLAN (ESOP)\nThe Companys ESOP was established in 1984 and is a tax qualified, defined contribution plan. Company contributions were made at the discretion of the Board, and, to date, all contributions have been made in shares of Company Common Stock. For contributions of Common Stock, the Company recorded as expense the fair market value of the stock contributed. Effective January 1, 2021, the Company terminated the ESOP and established a new defined contribution 401K only plan. All ESOP participants were fully vested in all Company Common Stock held in their accounts, and those shares were transferred to their new 401K accounts. The Company began matching up to 5% of 401K contributions in cash starting January 1, 2021.\nContributions to the plans consisted of:\nYear\nPlan\nShares\nAmount\n401K\n-\n$\n85,444\n401K\n-\n$\n79,015\nESOP\n72,101\n$\n103,104\n9. DEFERRED COMPENSATION PLAN FOR DIRECTORS\nAnnually, independent directors may elect to be included in the Companys Deferred Directors Compensation Plan for Non-Employee Directors (the Plan). The Plan provides that each independent director may individually elect to be credited with future unissued shares of Company Common Stock rather than cash for all or a portion of the annual retainers, and may elect to receive shares, when issued, over annual time periods up to ten years. These unissued shares are recorded to each directors deferred compensation account at the closing market price of the shares at each quarter end. Only upon a directors retirement, termination, death or a change-in-control of the Company will the shares recorded for such director under the Plan be issued to the director. The\npromise to issue such shares in the future is an unsecured obligation of the Company. As of September 30, 2022, there were 241,353 shares recorded under the Plan. The deferred balance outstanding at September 30, 2022, under the Plan was $1,496,243. Expenses totaling $191,852, $234,466 and $228,408 were charged to the Companys results of operations for the years ended September 30, 2022, 2021, and 2020, respectively, and are included in general and administrative expense in the accompanying Statements of Operations.\n10. RESTRICTED STOCK PLAN AND LONG-TERM INCENTIVE PLAN\nIn March 2010, stockholders approved the Companys 2010 Stock Plan, which made available 200,000 shares of Common Stock to provide a long-term component to the Companys total compensation package for its officers and to further align the interest of its officers with those of its stockholders. In March 2014, stockholders approved an amendment to increase the number of shares of Common Stock reserved for issuance under the 2010 Stock Plan from 200,000 shares to 500,000 shares and to allow the grant of shares of restricted stock to our directors. In March 2020, stockholders approved an amendment to increase the number of shares of Common Stock reserved for issuance under the 2010 Stock Plan to 750,000 shares. The 2010 Stock Plan, as amended, is designed to provide as much flexibility as possible for future grants of restricted stock so the Company can respond as necessary to provide competitive compensation in order to retain, attract and motivate officers of the Company and to align their interests with those of the Companys stockholders.\nIn June 2010, the Company began awarding shares of the Companys Common Stock as restricted stock (time-based) to certain officers. The restricted stock vests at the end of the vesting period and contains nonforfeitable rights to receive dividends and voting rights during the vesting period. The fair value of the shares was based on the closing price of the shares on their award date and will be recognized as compensation expense ratably over the vesting period. Upon vesting, shares are expected to be issued out of shares held in treasury or the Companys authorized but unissued shares.\nIn December 2010, the Company also began awarding shares of the Companys Common Stock, subject to certain share price performance standards (market-based), as restricted stock to certain officers. Vesting of these shares is based on the performance of the market price of the Common Stock over the vesting period. The fair value of the performance shares was estimated on the grant date using a Monte Carlo valuation model that factors in information, including the expected price volatility, risk-free interest rate and the probable outcome of the market condition, over the expected life of the performance shares. Compensation expense for the performance shares is a fixed amount determined at the grant date and is recognized over the vesting period regardless of whether performance shares are awarded at the end of the vesting period.\nIn May 2014, the Company also began awarding shares of the Companys Common Stock as restricted stock (time-based) to its non-employee directors. The restricted stock vests annually. The fair value of the shares is based on the closing price of the shares on their award date and will be recognized as compensation expense ratably over the vesting period. Upon vesting, shares are expected to be issued out of shares held in treasury or the Companys authorized but unissued shares.\nIn March of 2021, stockholders approved the PHX Minerals Inc. 2021 Long-Term Incentive Plan (the LTIP). The terms and conditions of awards granted under the Companys 2010 Stock Plan prior to the LTIP are not affected by the adoption of the LTIP. The LTIP expressly prohibits the payment of dividends or dividend equivalents on any award before the date on which the award vests. Awards under the LTIP will be subject to any clawback or recapture policy that the Company may adopt from time to time or any clawback or recapture provisions set forth in an award agreement.\nOn January 5, 2021, the Company awarded 303,750 market-based shares of the Companys Common Stock as restricted stock to certain officers. The restricted stock vests at the end of a three-year period and contains non-forfeitable rights to receive dividends and voting rights during the vesting period. The market-based shares that do not meet certain market performance criteria at a certain date are forfeited. The market-based shares had a fair value on their award date of $826,457. The fair value of the market-based awards will be recognized as compensation expense ratably over the vesting period. The fair value of the market-based shares on their award date is calculated by simulating the Companys stock prices as compared to the S&P Oil & Gas Exploration & Production ETF (XOP) prices utilizing a Monte Carlo model covering the market performance period (December 18, 2020, through December 18, 2023).\nOn March 22, 2021, the Company awarded 125,000 time-based shares of the Companys Common Stock as restricted stock to its non-employee directors. The shares issued as restricted stock contain voting rights during the vesting period but do not include the right to dividends prior to the stock vesting. The restricted stock vests on December 31, 2021. These time-based shares had a fair value on their award date of $396,252.\nOn March 2, 2022, the Company awarded shares of Common Stock in the form of time-based and market-based restricted stock to the directors, employees and officers of the Company. Non-employee directors received 138,249 time-based shares with a fair value on the award date of $387,095. These shares vest in December 2022. Officers were awarded 402,086 market-based shares with a fair value on their award date of $1,679,757. Upon vesting, the market-based shares that do not meet certain performance criteria are forfeited. Both employees and certain officers were also awarded 126,013 time-based shares with a fair value on the award date of $352,838. The shares issued to employees time-vest ratably over a three-year period ending in December 2024, and the shares awarded to the officers cliff vest at the end of a three-year period ending in December 2024. All shares awarded on March 2, 2022, have voting rights during the vesting period and do not include the right to dividends prior to vesting.\nOn April 1, 2022, the Company awarded shares of common stock in the form of time-based restricted stock to a new director. The non-employee director received 20,737 time-based shares with a fair value on the award date of $62,004. These shares vest in December of 2022, contain voting rights during the vesting period, and do not include the right to dividends prior to vesting.\nCompensation expense for the restricted stock awards is recognized in G&A. Forfeitures of awards are recognized when they occur.\nThe following table summarizes the Companys pre-tax compensation expense for the years ended September 30, 2022, 2021. and 2020, related to the Companys market-based, time-based and performance-based restricted stock:\nYear Ended September 30,\nMarket-based, restricted stock\n$\n1,018,136\n$\n247,601\n$\n295,397\nTime-based, restricted stock\n$\n730,303\n$\n553,599\n448,500\nPerformance-based, restricted stock\n463,234\n-\n-\nTotal compensation expense\n$\n2,211,673\n$\n801,200\n$\n743,897\nA summary of the Companys unrecognized compensation cost for its unvested market-based, time-based and performance-based restricted stock and the weighted-average periods over which the compensation cost is expected to be recognized are shown in the following table:\nUnrecognized\nCompensation\nCost\nWeighted Average Period\n(in years)\nMarket-based, restricted stock\n$\n1,308,130\n1.30\nTime-based, restricted stock\n433,434\n1.43\nPerformance-based, restricted stock\n6,376\n0.20\nTotal\n$\n1,747,940\nUpon vesting, shares are expected to be issued out of shares held in treasury and authorized but unissued shares.\nA summary of the status of, and changes in, unvested shares of restricted stock awards is presented below:\nMarket-Based\nUnvested\nRestricted\nAwards\nWeighted\nAverage\nGrant-Date\nFair Value\nTime-Based\nUnvested\nRestricted\nAwards\nWeighted\nAverage\nGrant-Date\nFair Value\nPerformance-Based\nUnvested\nRestricted\nAwards\nWeighted\nAverage\nGrant-Date\nFair Value\nUnvested shares as of September 30,\n46,670\n$\n10.21\n18,707\n$\n17.54\n-\n$\n-\nGranted\n39,579\n8.83\n102,154\n9.21\n39,579\n9.04\nVested\n-\n-\n(20,410\n)\n13.35\n-\n-\nForfeited\n(24,779\n)\n11.34\n(9,929\n)\n13.93\n(4,765\n)\n9.35\nUnvested shares as of September 30,\n61,470\n$\n8.87\n90,522\n$\n9.49\n34,814\n$\n8.99\nGranted\n303,750\n2.72\n125,000\n3.17\n-\n-\nVested\n-\n-\n(9,860\n)\n14.08\n-\n-\nForfeited\n(9,071\n)\n11.34\n(2,562\n)\n13.00\n-\n-\nUnvested shares as of September 30,\n356,149\n$\n3.56\n203,100\n$\n5.33\n34,814\n$\n8.99\nGranted\n402,086\n4.18\n284,999\n2.81\n-\n-\nVested\n-\n-\n(127,386\n)\n3.41\n-\n-\nForfeited\n(17,585\n)\n8.16\n(6,855\n)\n6.92\n-\n-\nUnvested shares as of September 30,\n740,650\n3.79\n353,858\n3.97\n34,814\n8.99\nThe intrinsic value of the vested shares in 2022 was $277,573.\n11. PROPERTIES AND EQUIPMENT\nImpairment\nDuring the year ended September 30, 2022, the Company recorded no impairment provisions on producing properties and $14,565 on wells that the Company wrote off.\nDuring the year ended September 30, 2021, the Company recorded impairment of $37,879 on producing properties and $12,596 on wells that the Company wrote off.\nDuring the quarter ended March 31, 2020, impairment of $19.3 million and $7.3 million was recorded on our Fayetteville Shale and Eagle Ford fields, respectively. The remaining $2.7 million of impairment was taken on other producing assets. The discounted cash flows of the properties were prepared using NYMEX strip pricing as of March 31, 2020, using a discount rate of 10% for proved developed and assigning no value to undeveloped locations. The Fayetteville Shale assets are dry-gas assets of which the Company acquired a portion in 2011. Low natural gas prices at March 31, 2020, were the primary reason for impairment in this field. The impairment of the Eagle Ford assets at March 31, 2020, was due to the decline in commodity prices over fiscal year 2020.\nA further reduction in natural gas, oil and NGL prices or a decline in reserve volumes may lead to additional impairment in future periods that may be material to the Company.\nDivestitures\nQuarter Ended\nNet mineral acres(1)/ Wellbores(2)\nSale Price (4)\nGain/(Loss) (4)\nLocation\nSeptember 30, 2022\n5 wellbores\n$0.1million\n$-\nOK\n210 wellbores\n$5.0million\n$3.5million\nAR\n87 acres\n$0.1million\n$0.1million\nTX\n9 wellbores\n$0.2million\n$0.1million\nND\nJune 30, 2022\n43 acres\n$0.1million\n$0.1million\nTX\n9 wellbores\n$0.3million\n$0.1million\nOK\n83 acres\n$0.1million\n$0.1million\nOK\n16 wellbores\n$0.1million\n$-\nOK\n2 wellbores\n$0.1million\n$0.1million\nOK\n2,255 acres\n$0.3million\n$0.3million\nAR / OK / TX\nMarch 31, 2022\n7,071 acres\n$1.6million\n$1.6million\nNM / TX\n130 acres\n$0.5million\n$0.5million\nTX\nDecember 31, 2021\n98 wellbores\n$2.0million\n($3.5)million\nOK\n95 wellbores\n$0.5million\n$0.2million\nOK / TX\n499 wellbores\n$2.1million\n$1.1million\nAR\nSeptember 30, 2021\nNo significant divestitures\nJune 30, 2021\n2,857 acres\n$0.3million\n$0.2million\nCentral Basin Platform, TX\nMarch 31, 2021\nNo significant divestitures\nDecember 31, 2020\nNo significant divestitures\n(1) Number of net mineral acres sold.\n(2) Number of gross wellbores associated with working interests sold.\n(3) Excludes immaterial divestitures.\n(4) Sales price and gain(loss) is net of purchase price adjustment.\nAcquisitions\nQuarter Ended (4)\nNet royalty acres (1)(2)\nCash\nNumber of shares issued (3)\nTotal Purchase Price (1)\nArea of Interest\nSeptember 30, 2022\n$0.7million\n-\n$0.7million\nHaynesville / LA\n$0.2million\n-\n$0.2million\nSCOOP / OK\n$1.5million\n-\n$1.5million\nHaynesville / LA\n$3.0million\n-\n$3.0million\nHaynesville / LA\n$1.0million\n-\n$1.0million\nHaynesville / LA\n$5.5million\n-\n$5.5million\nHaynesville / LA\n$1.7million\n-\n$1.7million\nSCOOP / OK\nJune 30, 2022\n$0.6million\n-\n$0.6million\nSCOOP / OK\n$0.8million\n-\n$0.8million\nHaynesville / LA\n$0.4million\n-\n$0.4million\nHaynesville / LA\n$0.9million\n-\n$0.9million\nSCOOP / OK\n$5.0million\n-\n$5.0million\nHaynesville / LA, TX\n$0.6million\n-\n$0.6million\nHaynesville / LA\n$0.3million\n-\n$0.3million\nHaynesville / LA\n$0.5million\n-\n$0.5million\nSCOOP / OK\nMarch 31, 2022\n$0.5million\n-\n$0.5million\nSCOOP / OK\n$6.4million\n-\n$6.4million\nHaynesville / LA\n$0.7million\n-\n$0.7million\nHaynesville / TX\n$1.3million\n-\n$1.3million\nSCOOP / OK\n$0.4million\n-\n$0.4million\nHaynesville / TX\nDecember 31, 2021\n$5.8million\n-\n$5.8million\nHaynesville / LA\n$0.6million\n1,519,481\n$4.1million\nHaynesville / LA\n$1.4million\n-\n$1.4million\nSCOOP / OK\n$0.6million\n-\n$0.6million\nHaynesville / TX\n$1.7million\n-\n$1.7million\nHaynesville / LA\n$1.2million\n-\n$1.2million\nSCOOP / OK\nSeptember 30, 2021\n$0.7million\n2,349,207\n$7.3million\nHaynesville / LA, TX\nJune 30, 2021\n$1.3million\n-\n$1.3million\nHaynesville / LA\n$1.0million\n-\n$1.0million\nHaynesville / TX\n2,514\n$9.5million\n1,200,000\n$13.0million\nSCOOP / OK\nMarch 31, 2021\nNo significant acquisitions\nDecember 31, 2020\n$1.0million\n-\n$1.0million\nHaynesville / TX\n$0.8million\n-\n$0.8million\nHaynesville / TX\n$3.5million\n-\n$3.5million\nHaynesville / TX\n$2.0 million\n153,375\n$2.3 million\nSCOOP / OK\n(1) Excludes subsequent closing adjustments and insignificant acquisitions.\n(2) An estimated net royalty equivalent was used for the minerals included in the net royalty acres.\n(3) The Companys policy is to classify all costs associated with equity issuances as financial costs in the Statements of Cash Flows.\n(4) Presented in chronological order with most recent at top.\nAll purchases made in 2020, 2021, and 2022 were of mineral and royalty acreage and were accounted for as asset acquisitions.\nAsset Retirement Obligations\nThe following table shows the activity for the years ended September 30, 2022 and 2021, relating to the Companys asset retirement obligations:\nAsset retirement obligations as of beginning of the year\n$\n2,836,172\n$\n2,897,522\nWells acquired or drilled\n-\n-\nWells sold or plugged\n(1,027,030\n)\n(189,459\n)\nAccretion of discount\n92,762\n128,109\nAsset retirement obligations as of end of the year\n$\n1,901,904\n$\n2,836,172\nAs a non-operator, the Company does not control the plugging of wells in which it has a working interest and is not involved in the negotiation of the terms of the plugging contracts. This estimate relies on information gathered from outside sources as well as relevant information received directly from operators.\n12. DERIVATIVES\nThe Company has entered into fixed swap contracts and costless collar contracts. These instruments are intended to reduce the Companys exposure to short-term fluctuations in the price of natural gas and oil. Collar contracts set a fixed floor price and a fixed ceiling price and provide payments to the Company if the index price falls below the floor or require payments by the Company if the index price rises above the ceiling. Fixed swap contracts set a fixed price and provide payments to the Company if the index price is below the fixed price or require payments by the Company if the index price is above the fixed price. These contracts cover only a portion of the Companys natural gas and oil production, provide only partial price protection against declines in natural gas and oil prices and may limit the benefit of future increases in prices.\nOn September 2, 2021, the Company settled all of its derivative contracts consisting of both swaps and costless collars with BOKF by paying $8.8 million. On September 3, 2021, the Company entered into new derivative contracts with BP Energy Company (BP) that had similar terms to the contracts settled with BOKF and received a payment of $8.8 million from BP. The new derivative contracts consisted of all fixed swap contracts and are secured under the Companys Credit Facility with Independent Bank. Management concluded that the financing element of the new derivative contracts with BP was other than insignificant due to the off-market terms of the fixed swap price. Due to the financing element, the Company is required to report all cash flows associated with these derivative contracts as cash flows from financing activities in the statement of cash flows. This requirement relates to all cash flows from these derivatives and not just the portion of the cash flows relating to the financing element of the derivative. The derivative instruments have settled or will settle based on the terms below.\nDerivative contracts in place as of September 30, 2022\nFiscal period\nContract total volume\nIndex\nContract average price\nNatural gas costless collars\n1,415,000 Mmbtu\nNYMEX Henry Hub\n$4.13floor/$7.69ceiling\n135,000 Mmbtu\nNYMEX Henry Hub\n$3.28floor/$5.98ceiling\nNatural gas fixed price swaps\n2,100,000 Mmbtu\nNYMEX Henry Hub\n$3.24\n380,000 Mmbtu\nNYMEX Henry Hub\n$3.41\nOil Costless Collars\n15,000 Bbls\nNYMEX WTI\n$75.00floor/$96.00ceiling\nOil fixed price swaps\n72,750 Bbls\nNYMEX WTI\n$63.65\n14,250 Bbls\nNYMEX WTI\n$74.91\nThe Companys fair value of derivative contracts was a net liability of $8,561,191 as of September 30, 2022, and a net liability of $13,784,467 as of September 30, 2021. Realized and unrealized gains and (losses) are recorded in gains (losses) on derivative contracts on the Companys Statement of Operations. Cash receipts in the following table reflect the gain or loss on derivative contracts which settled during the respective periods, and the non-cash gain or loss reflect the change in fair value of derivative contracts as of the end of the respective periods. The $8.8 million in cash received from BP in fiscal 2021 is a cash flow from a financing activity and is excluded from the table below.\nFor the Year Ended September 30,\nCash received (paid) on settled derivative contracts:\nNatural gas costless collars\n$\n(1,878,250\n)\n$\n(4,271,467\n)\n$\n28,510\nNatural gas fixed price swaps(1)\n(9,065,100\n)\n(1,862,801\n)\n1,687,600\nOil costless collars\n-\n(2,047,098\n)\n1,011,472\nOil fixed price swaps(1)\n(3,590,210\n)\n(3,744,303\n)\n1,381,628\nCash received (paid) on settled derivative contracts, net\n$\n(14,533,560\n)\n$\n(11,925,669\n)\n$\n4,109,210\nNon-cash gain (loss) on derivative contracts:\nNatural gas costless collars\n$\n(1,044,958\n)\n$\n706,015\n$\n(706,015\n)\nNatural gas fixed price swaps\n(1,954,719\n)\n(3,624,108\n)\n(1,535,122\n)\nOil costless collars\n106,157\n(63,169\n)\n(538,022\n)\nOil fixed price swaps\n594,002\n(1,295,558\n)\n(422,632\n)\nNon-cash gain (loss) on derivative contracts, net\n$\n(2,299,518\n)\n$\n(4,276,820\n)\n$\n(3,201,791\n)\nGains (losses) on derivative contracts, net\n$\n(16,833,078\n)\n$\n(16,202,489\n)\n$\n907,419\n(1) For the year ended September 30, 2022, excludes $7,522,794 of cash paid to settle off-market derivative contracts that are not reflected on the Condensed Statements of Operations. Total cash paid related to off-market derivatives was $19,260,104 for the year ended September 30, 2022 and is reflected in the Financing Activities section of the Condensed Statements of Cash Flows.\nThe fair value amounts recognized for the Companys derivative contracts executed with the same counterparty under a master netting arrangement may be offset. The Company has the choice to offset or not, but that choice must be applied consistently. A master netting arrangement exists if the reporting entity has multiple contracts with a single counterparty that are subject to a contractual agreement that provides for the net settlement of all contracts through a single payment in a single currency in the event of default on, or termination of, any one contract. Offsetting the fair values recognized for the derivative contracts outstanding with a single counterparty results in the net fair value of the transactions being reported as an asset or a liability on the balance sheets. The following table summarizes and reconciles the Company's derivative contracts fair values at a gross level back to net fair value presentation on the Company's balance sheets at September 30, 2022, and September 30, 2021. The Company has offset all amounts subject to master netting agreements on the Company's balance sheets at September 30, 2022 and September 30, 2021.\n9/30/2022\n9/30/2021\nFair Value\nFair Value\nCommodity Contracts\nCommodity Contracts\nCurrent Assets\nCurrent Liabilities\nNon-Current\nAssets\nNon-Current\nLiabilities\nCurrent Assets\nCurrent Liabilities\nNon-Current\nLiabilities\nGross amounts recognized\n$\n924,258\n$\n8,798,237\n$\n124,983\n$\n812,195\n$\n17,395\n$\n12,105,383\n$\n1,696,479\nOffsetting adjustments\n(924,258\n)\n(924,258\n)\n(124,983\n)\n(124,983\n)\n(17,395\n)\n(17,395\n)\n-\nNet presentation on Balance Sheets\n$\n-\n$\n7,873,979\n$\n-\n$\n687,212\n$\n-\n$\n12,087,988\n$\n1,696,479\nThe fair value of derivative assets and derivative liabilities is adjusted for credit risk. The impact of credit risk was immaterial for all periods presented.\n13. FAIR VALUE MEASUREMENTS\nFair value is defined as the amount that would be received from the sale of an asset or paid for the transfer of a liability in an orderly transaction between market participants, i.e., an exit price. To estimate an exit price, a three-level hierarchy is used. The fair value hierarchy prioritizes the inputs, which refer broadly to assumptions market participants would use in pricing an asset or a liability, into three levels.\nLevel 1:\tUnadjusted quoted prices in active markets that are accessible at the measurement date for identical, unrestricted assets or liabilities. The Company considers active markets as those in which transactions for the assets or liabilities occur with sufficient frequency and volume to provide pricing information on an ongoing basis.\nLevel 2:\tQuoted prices in markets that are not active, or inputs that are observable, either directly or indirectly, for substantially the full term of the asset or liability. This category includes those derivative instruments that the Company values using observable market data. Substantially all of these inputs are observable in the marketplace throughout the full term of the derivative instrument, can be derived from observable data or are supported by observable levels at which transactions are executed in the marketplace. Instruments in this category include non-exchange traded derivatives such as over-the-counter commodity fixed-price swaps and commodity options (i.e. price collars).\nThe Company uses an option pricing valuation model for option derivative contracts that considers various inputs including: future prices, time value, volatility factors, counterparty credit risk and current market and contractual prices for the underlying instruments. The values calculated are then compared to the values given by counterparties for reasonableness.\nLevel 3:\tMeasured based on prices or valuation models that require inputs that are both significant to the fair value measurement and unobservable (or less observable) from objective sources (supported by little or no market activity).\nThe following table provides fair value measurement information for financial assets and liabilities measured at fair value on a recurring basis.\nFair Value Measurement at September 30, 2022\nQuoted\nPrices in\nActive\nMarkets\nSignificant\nOther Observable Inputs\nSignificant Unobservable Inputs\nTotal Fair\n(Level 1)\n(Level 2)\n(Level 3)\nValue\nFinancial Assets (Liabilities):\nDerivative Contracts - Swaps\n$\n-\n$\n(7,622,390\n)\n$\n-\n$\n(7,622,390\n)\nDerivative Contracts - Collars\n$\n-\n$\n(938,801\n)\n$\n-\n$\n(938,801\n)\nFair Value Measurement at September 30, 2021\nQuoted\nPrices in\nActive\nMarkets\nSignificant\nOther\nObservable Inputs\nSignificant Unobservable Inputs\nTotal Fair\n(Level 1)\n(Level 2)\n(Level 3)\nValue\nFinancial Assets (Liabilities):\nDerivative Contracts - Swaps\n$\n-\n$\n(13,784,467\n)\n$\n-\n$\n(13,784,467\n)\nThe following table presents impairments associated with certain assets that have been measured at fair value on a nonrecurring basis within Level 3 of the fair value hierarchy.\nYear Ended September 30,\nFair Value\nImpairment\nFair Value\nImpairment\nFair Value\nImpairment\nProducing Properties (a)\n$\n-\n$\n-\n$\n$\n37,879\n$\n5,288,710\n$\n29,315,807\n(a)At the end of each quarter, the Company assessed the carrying value of its producing properties for impairment if indicators of impairment existed at such time. This assessment utilized estimates of future cash flows or fair value (selling price) less cost to sell if the property is held for sale. Significant judgments and assumptions in these assessments include estimates of future natural gas, oil and NGL prices using a forward NYMEX curve adjusted for projected inflation, locational basis differentials, drilling plans, expected capital costs and an applicable discount rate\ncommensurate with risk of the underlying cash flow estimates. These assessments identified certain properties with carrying value in excess of their calculated fair values. This table excludes impairments on properties that were written off in the amount of $14,565, $12,596 and $588,721 for the years ended September 30, 2022, 2021 and 2020, respectively.\nAt September 30, 2022, and September 30, 2021, the carrying values of cash and cash equivalents, receivables, and payables are considered to be representative of their respective fair values due to the short-term maturities of those instruments. Financial instruments include debt, which the valuation is classified as Level 2 as the carrying amount of the Companys revolving credit facility approximates fair value because the interest rates are reflective of market rates. The estimated current market interest rates are based primarily on interest rates currently being offered on borrowings of similar amounts and terms. In addition, no valuation input adjustments were considered necessary relating to nonperformance risk for the debt agreements.\n14. INFORMATION ON NATURAL GAS AND OIL PRODUCING ACTIVITIES\nThe natural gas and oil producing activities of the Company are conducted within the contiguous United States (principally in Oklahoma, Texas, Louisiana, Arkansas and North Dakota) and represent substantially all of the business activities of the Company.\nThe following table shows sales to major purchasers, by percentage, through various operators/purchasers during 2022, 2021 and 2020.\nCompany A\n%\n%\n%\nCompany B\n%\n%\n%\nThe loss of any of these major purchasers of natural gas, oil and NGL production could have a material adverse effect on the ability of the Company to produce and sell its natural gas, oil and NGL production.\n15. SUBSEQUENT EVENTS\nThird Amendment to Credit Agreement\nOn December 7, 2022, the Company entered into a Third Amendment (the Third Amendment) to the Credit Agreement. Pursuant to the terms of the Third Amendment, among other changes, (a) the borrowing base under the Credit Facility was reaffirmed at $50 million, which constitutes the periodic redetermination of the borrowing base for December 1, 2022 and is not deemed an unscheduled redetermination, (b) the required title percentage owed by the Company was decreased from 80% to 50% and (c) the required mortgage percentage owed by the Company was decreased from 80% to 75%.\nThe above description of the material terms and conditions of the Third Amendment does not purport to be complete and is qualified in its entirety by reference to the full text of the Third Amendment, which is filed as Exhibit 10.8 to this Annual Report on Form 10-K.\nAcquisitions\nSubsequent to September 30, 2022, the Company has closed on additional acquisitions of 930 net royalty acres located in the SCOOP and Haynesville plays for approximately $10.3 million funded through cash on hand and additional borrowings of $5 million.\nChange in Fiscal Year and Amendment of Bylaws\nOn December 9, 2022, the Companys Board approved a change in fiscal year from the twelve months beginning October 1st and ending September 30th to the twelve months beginning January 1st and ending December 31st. The Company plans to file a transition report on Form 10-QT for the transition period from October 1, 2022 to December 31, 2022. The Companys fiscal year 2023 will begin January 1, 2023 and end December 31, 2023.\nIn order to reflect the change in fiscal year, the Companys Board has adopted an amendment to the Companys Bylaws, effective December 9, 2022. Section 7.08 of the Companys Bylaws has been amended to provide that the fiscal year of the Company shall consist of twelve (12) calendar months terminating on December 31st of each calendar year, rather than terminating on September 30th of each calendar year. Further, Section 7.08 of the Companys Bylaws has been amended to provide that the Board\nmay further change the fiscal year of the Company, without amending the Bylaws, by resolution adopted by a majority of the whole Board at any special or regular meeting of the Board.\nA copy of the Amended and Restated Bylaws of the Company is filed as Exhibit 3.2 to this Annual Report on Form 10-K.\nTermination of a Material Definitive Contract\nOn December 12, 2022, the Company voluntarily terminated its At-The-Market Equity Offering Sales Agreement, dated August 25, 2021, as amended by Amendment No. 1 dated May 10, 2022 (the ATM Agreement), that was entered into with Stifel. Pursuant to the ATM Agreement, the Company was authorized to offer and sell, from time to time, through or to Stifel, up to 3,000,000 shares of Common Stock. During the term of the ATM Agreement, 1,531,013 shares of Common Stock were sold pursuant to the ATM Agreement for proceeds of approximately $5.9 million, net of commissions paid. The ATM Agreement was terminable at will by the Company at any time without penalty.\n16. SUPPLEMENTARY INFORMATION ON NATURAL GAS, OIL AND NGL RESERVES (UNAUDITED)\nAggregate Capitalized Costs\nThe aggregate amount of capitalized costs of natural gas and oil properties and related accumulated depreciation, depletion and amortization as of September 30 is as follows:\nProducing properties\n$\n248,978,928\n$\n319,984,874\nNon-producing minerals\n50,032,539\n38,328,699\nNon-producing leasehold\n1,746,797\n2,137,399\n300,758,264\n360,450,972\nAccumulated depreciation, depletion and amortization\n(168,349,542\n)\n(257,250,452\n)\nNet capitalized costs\n$\n132,408,722\n$\n103,200,520\nCosts Incurred\nFor the years ended September 30, the Company incurred the following costs in natural gas and oil producing activities:\nProperty acquisition costs\n$\n46,224,928\n$\n30,963,579\n$\n10,453,119\nDevelopment costs\n156,752\n518,058\n273,825\n$\n46,381,680\n$\n31,481,637\n$\n10,726,944\nEstimated Quantities of Proved Natural Gas, Oil and NGL Reserves\nThe following unaudited information regarding the Companys natural gas, oil and NGL reserves is presented pursuant to the disclosure requirements promulgated by the SEC and the FASB.\nProved natural gas and oil reserves are those quantities of natural gas and oil which, by analysis of geoscience and engineering data, can be estimated with reasonable certainty to be economically producible - from a given date forward, from known reservoirs, and under existing economic conditions, operating methods and government regulations - prior to the time at which contracts providing the right to operate expire, unless evidence indicates that renewal is reasonably certain, regardless of whether deterministic or probabilistic methods are used for the estimation. Existing economic conditions include prices and costs at which economic producibility from a reservoir is to be determined. The price shall be the average price during the 12-month period prior to the ending date of the period covered by the report, determined as an unweighted arithmetic average of the first-day-of-the-month price for each month within such period, unless prices are defined by contractual arrangements, excluding escalations based upon future conditions. The project to extract the hydrocarbons must have commenced, or the operator must be reasonably certain that it will commence the project within a reasonable time. The area of the reservoir considered as proved includes: (i) the area identified by drilling and limited by fluid contacts, if any, and (ii) adjacent undrilled portions of the reservoir that can, with reasonable certainty, be judged to be continuous with it and to contain economically producible natural gas or oil on the basis of available geoscience and engineering data. In the absence of data on fluid contacts, proved quantities in a reservoir are limited by the lowest known hydrocarbons as seen in a well penetration unless geoscience, engineering or performance data and reliable technology establishes a lower contact with reasonable certainty. Where direct observation from well penetrations has defined a highest known oil elevation and the potential exists for an associated natural gas cap, proved oil reserves may be assigned in the structurally higher portions of the reservoir only if geoscience, engineering or performance data and reliable technology establish the higher contact with reasonable certainty. Reserves which can be produced economically through application of improved recovery techniques (including, but not limited to, fluid injection) are included in the proved classification when: (i) successful testing by a pilot project in an area of the reservoir with properties no more favorable than in the reservoir as a whole, the operation of an installed program in the reservoir or an analogous reservoir, or other evidence using reliable technology establishes the reasonable certainty of the engineering analysis on which the project or program was based; and (ii) the project has been approved for development by all necessary parties and entities, including governmental entities.\nThe independent consulting petroleum engineering firm of Cawley, Gillespie and Associates, Inc. (CG&A) of Fort Worth, Texas, prepared the Companys natural gas, oil and NGL reserves estimates as of September 30, 2022, and the independent consulting petroleum engineering firm of DeGolyer and MacNaughton of Dallas, Texas, prepared the Companys natural gas, oil and NGL reserves estimates as of September 30, 2021 and 2020.\nThe Companys net proved natural gas, oil and NGL reserves, which are located in the contiguous United States, as of September 30, 2022, 2021 and 2020, have been estimated by the Companys Independent Consulting Petroleum Engineering Firm. Estimates of reserves were prepared by the use of appropriate geologic, petroleum engineering and evaluation principles and techniques that are in accordance with practices generally recognized by the petroleum industry as presented in the publication of the Society of Petroleum Engineers entitled Standards Pertaining to the Estimating and Auditing of Oil and Gas Reserves Information (Revision as of February 19, 2007). The method or combination of methods used in the analysis of each reservoir was tempered by experience with similar reservoirs, stage of development, quality and completeness of basic data and production history.\nAll of the reserve estimates are reviewed and approved by the Companys Vice President of Engineering. The Vice President of Engineering, and internal staff work closely with the Independent Consulting Petroleum Engineers to ensure the integrity, accuracy and timeliness of data furnished to them for their reserves estimation process. The Company provides historical information (such as ownership interest, gas and oil production, well test data, commodity prices, operating costs, handling fees and development costs) for all properties to the Independent Consulting Petroleum Engineers. Throughout the year, the Vice President of Engineering and internal staff meet regularly with representatives of the Independent Consulting Petroleum Engineers to review properties and discuss methods and assumptions.\nEstimates of reserves were prepared by the use of appropriate geologic, petroleum engineering and evaluation principles and techniques that are in accordance with the reserves definitions of Rules 4-10(a) (1)-(32) of Regulation S-X of the SEC and with practices generally recognized by the petroleum industry as presented in the publication of the Society of Petroleum Engineers (SPE) entitled Standards Pertaining to the Estimating and Auditing of Oil and Gas Reserves Information (revised June 2019) Approved by the SPE Board on 25 June 2019 and in Monograph 3 and Monograph 4 published by the Society of Petroleum Evaluation Engineers. The method or combination of methods used in the analysis of each reservoir was tempered by experience with similar reservoirs, stage of development, quality and completeness of basic data, and production history. Based on the current stage of field development, production performance, development plans and analyses of areas offsetting existing wells with test or production data, reserves were\nclassified as proved. The proved undeveloped reserves were estimated for locations that have been permitted, are currently drilling, are drilled but not yet completed, or locations where the operator has indicated to the Company its intention to drill.\nFor the evaluation of unconventional reservoirs, a performance-based methodology integrating the appropriate geology and petroleum engineering data was utilized. Performance-based methodology primarily includes (1) production diagnostics, (2) decline-curve analysis, and (3) model-based analysis (if necessary, based on availability of data). Production diagnostics include data quality control, identification of flow regimes and characteristic well performance behavior. These analyses were performed for all well groupings (or type-curve areas). Characteristic rate-decline profiles from diagnostic interpretation were translated to modified hyperbolic rate profiles, including one or multiple b-exponent values followed by an exponential decline. Based on the availability of data, model-based analysis may be integrated to evaluate long-term decline behavior, the effect of dynamic reservoir and fracture parameters on well performance, and complex situations sourced by the nature of unconventional reservoirs. In the evaluation of undeveloped reserves, type-well analysis was performed using well data from analogous reservoirs for which more complete historical performance data were available.\nAccordingly, these estimates should be expected to change, and such changes could be material and occur in the near term as future information becomes available.\nNet quantities of proved, developed and undeveloped natural gas, oil and NGL reserves are summarized as follows:\nProved Reserves\nNatural Gas\nOil\nNGL\nTotal\n(Mcf)\n(Barrels)\n(Barrels)\nBcfe\nSeptember 30, 2019\n80,273,906\n2,380,090\n1,973,280\n106.4\nRevisions of previous estimates\n(34,666,426\n)\n(1,094,923\n)\n(774,214\n)\n(45.9\n)\nAcquisitions\n972,819\n156,133\n84,134\n2.4\nDivestitures\n(60,966\n)\n(98,412\n)\n(13,201\n)\n(0.7\n)\nExtensions, discoveries and other additions\n1,816,144\n260,555\n118,480\n4.1\nProduction\n(5,962,704\n)\n(269,786\n)\n(168,622\n)\n(8.6\n)\nSeptember 30, 2020\n42,372,773\n1,333,657\n1,219,857\n57.7\nRevisions of previous estimates\n21,930,522\n287,961\n389,825\n26.0\nAcquisitions\n7,814,545\n91,198\n41,085\n8.6\nDivestitures\n(820,122\n)\n(11,622\n)\n(4,174\n)\n(0.9\n)\nExtensions, discoveries and other additions\n354,670\n28,125\n26,748\n0.7\nProduction\n(6,699,720\n)\n(224,479\n)\n(171,488\n)\n(9.1\n)\nSeptember 30, 2021\n64,952,668\n1,504,840\n1,501,853\n83.0\nRevisions of previous estimates\n2,405,959\n(13,498\n)\n409,597\n4.8\nAcquisitions\n15,302,364\n29,987\n18,260\n15.6\nDivestitures\n(16,624,066\n)\n(72,244\n)\n(83,931\n)\n(17.6\n)\nExtensions, discoveries and other additions\n3,627,989\n132,227\n82,024\n4.9\nProduction\n(7,427,708\n)\n(198,535\n)\n(165,120\n)\n(9.6\n)\nSeptember 30, 2022\n62,237,206\n1,382,777\n1,762,683\n81.1\nThe prices used to calculate reserves and future cash flows from reserves for natural gas, oil and NGL, respectively, were as follows: September 30, 2022 - $6.41, $90.33, $38.09; September 30, 2021 - $2.79/Mcf, $56.51/Bbl, $20.58/Bbl; September 30, 2020 - $1.62/Mcf, $40.18/Bbl, $9.95/Bbl.\nThe changes in reserves at September 30,2022, as compared to September 30, 2021, are attributable to:\nRevisions of previous estimates from 2021 to 2022 that were primarily the result of\nPositive pricing revisions of 8.1 Bcfe of proved developed revisions due to natural gas and oil wells extending their economic limits later than was projected in 2021 due to higher commodity prices.\nNegative performance revisions of 3.3 Bcfe (comprised of all proved developed), principally due to steep declines following workovers on high working interest Woodford Shale wells in the Arkoma Stack play in Oklahoma and steeper declines on Bossier Shale wells drilled in the last two years as compared to Haynesville Shale wells in the Haynesville play of Texas.\nAcquisitions and divestitures were the result of\nThe sale of 17.6 Bcfe proved developed, consisting predominately of working interest properties in the Fayetteville Shale play in Arkansas, and the Arkoma Stack play and Western Anadarko Basin in Oklahoma.\nThe acquisition of 15.6 Bcfe, predominately of royalty interest properties in the active drilling programs of the Haynesville Shale play in east Texas and western Louisiana and the Mississippi and Woodford Shale intervals in the SCOOP play in the Ardmore basin of Oklahoma, of which 7.0 Bcfe were proved developed and 8.6 Bcfe were proved undeveloped.\nExtensions, discoveries and other additions from 2021 to 2022 that are principally attributable to\nReserve extensions, discoveries and other additions of 4.9 Bcfe (comprised of 1.7 Bcfe proved developed and 3.2 Bcfe proved undeveloped reserves) principally resulting from:\na)The Companys royalty interest ownership in the ongoing development of unconventional natural gas, utilizing horizontal drilling, in the Haynesville Shale play of East Texas and Western Louisiana.\nb)The Companys royalty interest ownership in the ongoing development of unconventional natural gas, oil and NGL utilizing horizontal drilling in the Mississippi and Woodford Shale intervals in the SCOOP and STACK plays in the Ardmore and Anadarko basins of Oklahoma.\nAnd production of 9.6 Bcfe from the Companys natural gas and oil properties.\nProved Developed Reserves\nProved Undeveloped Reserves\nNatural Gas\nOil\nNGL\nNatural Gas\nOil\nNGL\n(Mcf)\n(Barrels)\n(Barrels)\n(Mcf)\n(Barrels)\n(Barrels)\nSeptember 30, 2020\n40,924,083\n1,148,989\n1,135,864\n1,448,690\n184,668\n83,993\nSeptember 30, 2021\n60,287,881\n1,439,860\n1,467,092\n4,664,787\n64,980\n34,761\nSeptember 30, 2022\n50,304,185\n1,275,853\n1,698,046\n11,933,021\n106,924\n64,637\nThe following details the changes in proved undeveloped reserves for 2022 (Mcfe):\nBeginning proved undeveloped reserves\n5,263,233\nProved undeveloped reserves transferred to proved developed\n(4,132,227\n)\nRevisions\n63,036\nExtensions and discoveries\n3,164,434\nSales\n-\nPurchases\n8,603,911\nEnding proved undeveloped reserves\n12,962,387\nDuring fiscal year 2022, total net PUD reserves increased by 7.7 Bcfe. In fiscal year 2022, a total of 4.1 Bcfe (79% of the beginning balance) was transferred to proved developed. The remaining balance of approximately 11.8 Bcfe (225% of the beginning balance) of positive revisions to PUD reserves consist of acquisitions of 8.6 Bcfe in the Haynesville Shale in Texas and Louisiana and Meramec and Woodford SCOOP play in Oklahoma and additions and extensions of 3.2 Bcfe within the active drilling program areas of (i) the Haynesville Shale in Texas and Louisiana, (ii) the SCOOP Meramec and Woodford in Oklahoma, (iii) the STACK Meramec and Woodford in Oklahoma and (iii) the Bakken in North Dakota.\nThe Company anticipates that all current PUD locations will be drilled and converted to PDP within five years of the date they were added. However, PUD locations and associated reserves, which are no longer projected to be drilled within five years from the date they were added to PUD reserves, will be removed as revisions at the time that determination is made. In the event that there are undrilled PUD locations at the end of the five-year period, the Company intends to remove the reserves associated with those locations from proved reserves as revisions.\nStandardized Measure of Discounted Future Net Cash Flows\nAccounting Standards prescribe guidelines for computing a standardized measure of future net cash flows and changes therein relating to estimated proved reserves. The Company has followed these guidelines, which are briefly discussed below.\nFuture cash inflows and future production and development costs are determined by applying the trailing unweighted 12-month arithmetic average of the first-day-of-the-month individual product prices and year-end costs to the estimated quantities of natural gas, oil and NGL to be produced. Actual future prices and costs may be materially higher or lower than the unweighted 12-month arithmetic average of the first-day-of-the-month individual product prices and year-end costs used. For each year, estimates are made of quantities of proved reserves and the future periods during which they are expected to be produced, based on continuation of the economic conditions applied for such year.\nEstimated future income taxes are computed using current statutory income tax rates, including consideration for the current tax basis of the properties and related carry forwards, giving effect to permanent differences and tax credits. The resulting future net cash flows are reduced to present value amounts by applying a 10% annual discount factor. The assumptions used to compute the standardized measure are those prescribed by the FASB and, as such, do not necessarily reflect the Companys expectations of actual revenue to be derived from those reserves nor their present worth. The limitations inherent in the reserve quantity estimation process, as discussed previously, are equally applicable to the standardized measure computations since these estimates affect the valuation process.\nFuture cash inflows\n$\n591,082,414\n$\n297,138,886\n$\n134,179,216\nFuture production costs\n(131,377,260\n)\n(115,681,617\n)\n(66,136,222\n)\nFuture development and asset retirement costs\n(2,543,510\n)\n(1,873,126\n)\n(1,957,225\n)\nFuture income tax expense\n(107,209,614\n)\n(40,697,140\n)\n(13,224,535\n)\nFuture net cash flows\n349,952,030\n138,887,003\n52,861,234\n10% annual discount\n(167,382,649\n)\n(64,096,661\n)\n(21,727,081\n)\nStandardized measure of discounted future net\ncash flows\n$\n182,569,381\n$\n74,790,342\n$\n31,134,153\nChanges in the standardized measure of discounted future net cash flows are as follows:\nBeginning of year\n$\n74,790,342\n$\n31,134,153\n$\n85,561,529\nChanges resulting from:\nSales of natural gas, oil and NGL, net of\nproduction costs\n(56,691,954\n)\n(25,812,485\n)\n(12,692,681\n)\nNet change in sales prices and production costs\n172,990,983\n43,951,090\n(46,499,344\n)\nNet change in future development and asset\nretirement costs\n(360,323\n)\n49,542\n(20,571\n)\nExtensions and discoveries\n14,493,340\n803,714\n2,841,807\nRevisions of quantity estimates\n14,569,169\n33,482,964\n(28,332,653\n)\nAcquisitions (divestitures) of reserves-in-place\n(5,808,769\n)\n9,041,028\n1,169,819\nAccretion of discount\n9,652,434\n3,893,028\n11,039,792\nNet change in income taxes\n(33,623,250\n)\n(13,937,867\n)\n17,037,980\nChange in timing and other, net\n(7,442,591\n)\n(7,814,825\n)\n1,028,475\nNet change\n107,779,039\n43,656,189\n(54,427,376\n)\nEnd of year\n$\n182,569,381\n$\n74,790,342\n$\n31,134,153 ITEM 9 CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone ITEM 9A CONTROLS AND PROCEDURES\n(a) EVALUATION OF DISCLOSURE CONTROLS AND PROCEDURES\nThe Company maintains disclosure controls and procedures, as such term is defined in Rules 13a-15(e) and 15d-15(e) under the Exchange Act, that are designed to ensure that information required to be disclosed in reports the Company files or submits under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in SEC rules and forms, and that such information is collected and communicated to management, including the Companys Chief Executive Officer and Chief Financial Officer, as appropriate, to allow timely decisions regarding required disclosure. In designing and evaluating its disclosure controls and procedures, management recognizes that no matter how well conceived and operated, disclosure controls and procedures can provide only reasonable, not absolute, assurance that the objectives of the disclosure controls and procedures are met. Based on their evaluation, the Companys Chief Executive Officer and Chief Financial Officer have concluded that the Companys disclosure controls and procedures were effective as of September 30, 2022.\n(b) MANAGEMENTS REPORT ON INTERNAL CONTROL OVER FINANCIAL REPORTING\nThe Companys management is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Exchange Act Rule 13a-15(f). The Companys internal control structure is designed to provide reasonable assurance to its management and Board regarding the reliability of financial reporting and the preparation and fair presentation of its financial statements prepared for external purposes in accordance with U.S. generally accepted accounting principles.\nBecause of its inherent limitations, internal control over financial reporting can provide only reasonable assurance that the objectives of the control system are met and may not prevent or detect misstatements. In addition, any evaluation of the effectiveness of internal controls over financial reporting in future periods is subject to risk that those internal controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nThe Companys management, including the Chief Executive Officer and Chief Financial Officer, conducted an evaluation of the effectiveness of the Companys internal control over financial reporting based on the Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission. Based on their evaluation, the Companys Chief Executive Officer and Chief Financial Officer have concluded that the Companys disclosure controls over financial reporting were effective as of September 30, 2022.\nThe Companys independent registered public accounting firm, Ernst & Young LLP, has issued an attestation report regarding its assessment of the Companys internal control over financial reporting as of September 30, 2022, presented preceding the Companys financial statements included in this Form 10-K. Additionally, the financial statements included in this Annual Report on Form 10-K, have also been audited by the Companys independent registered public accounting firm, whose report is presented preceding their report on the Companys internal control over financial reporting.\n(c) CHANGES IN INTERNAL CONTROL OVER FINANCIAL REPORTING\nThere were no changes in the Companys internal control over financial reporting that have materially affected, or are reasonably likely to materially affect, the Companys internal control over financial reporting made during the fiscal quarter ended September 30, 2022, or subsequent to the date the assessment was completed through the filing of this Form 10-K. ITEM 9B OTHER INFORMATION\nThird Amendment to Credit Agreement\nOn December 7, 2022, the Company entered into a Third Amendment (the Third Amendment) to the Credit Agreement. Pursuant to the terms of the Third Amendment, among other changes, (a) the borrowing base under the Credit Facility was reaffirmed at $50 million, which constitutes the periodic redetermination of the borrowing base for December 1, 2022 and is not deemed an\nunscheduled redetermination, (b) the required title percentage owed by the Company was decreased from 80% to 50% and (c) the required mortgage percentage owed by the Company was decreased from 80% to 75%.\nThe above description of the material terms and conditions of the Third Amendment does not purport to be complete and is qualified in its entirety by reference to the full text of the Third Amendment, which is filed as Exhibit 10.8 to this Annual Report on Form 10-K.\nChange in Fiscal Year and Amendment of Bylaws\nOn December 9, 2022, the Companys Board approved a change in fiscal year from the twelve months beginning October 1st and ending September 30th to the twelve months beginning January 1st and ending December 31st. The Company plans to file a transition report on Form 10-QT for the transition period from October 1, 2022 to December 31, 2022. The Companys fiscal year 2023 will begin January 1, 2023 and end December 31, 2023.\nIn order to reflect the change in fiscal year, the Companys Board has adopted an amendment to the Companys Bylaws, effective December 9, 2022. Section 7.08 of the Companys Bylaws has been amended to provide that the fiscal year of the Company shall consist of twelve (12) calendar months terminating on December 31st of each calendar year, rather than terminating on September 30th of each calendar year. Further, Section 7.08 of the Companys Bylaws has been amended to provide that the Board may further change the fiscal year of the Company, without amending the Bylaws, by resolution adopted by a majority of the whole Board at any special or regular meeting of the Board.\nA copy of the Amended and Restated Bylaws of the Company is filed as Exhibit 3.2 to this Annual Report on Form 10-K.\nTermination of a Material Definitive Contract\nOn December 12, 2022, the Company voluntarily terminated its At-The-Market Equity Offering Sales Agreement, dated August 25, 2021, as amended by Amendment No. 1 dated May 10, 2022 (the ATM Agreement), that was entered into with Stifel. Pursuant to the ATM Agreement, the Company was authorized to offer and sell, from time to time, through or to Stifel, up to 3,000,000 shares of Common Stock. During the term of the ATM Agreement, 1,531,013 shares of Common Stock were sold pursuant to the ATM Agreement for proceeds of approximately $5.9 million, net of commissions paid. The ATM Agreement was terminable at will by the Company at any time without penalty.\nITEM 9C DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable.\nPART III\nThe information called for by Part III of Form 10-K (      ITEM 15 EXHIBITS, FINANCIAL STATEMENT SCHEDULES\nFINANCIAL STATEMENT SCHEDULES\nThe Company has omitted all schedules because the conditions requiring their filing do not exist or because the required information appears in the Companys Financial Statements, including the notes to those statements.\nEXHIBITS\n(1.1)\nAt-The-Market Equity Offering Sales Agreement by and between PHX Minerals Inc. and Stifel, Nicolaus & Company, Incorporated, dated August 25, 2021 (incorporated by reference to Exhibit 1.1 to Form 8-K filed with the SEC on August 25, 2021)\n(1.2)\nAmendment No. 1 to At-The-Market Equity Offering Sales Agreement, dated May 10, 2022, by and between PHX Minerals Inc. and Stifel, Nicolaus & Company, Incorporated (incorporated by reference to Exhibit 1.1 to Form 8-K filed with the SEC May 10, 2022).\n(2.1)\nAgreement and Plan of Merger, dated as of March 31, 2022, by and between PHX Minerals Inc., an Oklahoma corporation, and PHX Minerals (DE) Inc., a Delaware corporation (incorporated by reference to Exhibit 2.1 to Form 8-K12B filed with the SEC on April 5, 2022).\n(3.1)\nCertificate of Incorporation of PHX Minerals Inc., as amended (incorporated by reference to Exhibit 3.1 to Form 8-K12B filed with the SEC on April 5, 2022).\n(3.2)\nAmended and Restated Bylaws of PHX Minerals Inc.\n(4.1)\nDescription of Capital Stock of PHX Minerals Inc. (incorporated by reference to Exhibit 99.1 to Form 8-K12B filed April 5, 2022).\n*(10.1)\nAmended Indemnification Agreement indemnifying directors and officers (incorporated by reference to Exhibit 10 to Form 8-K filed with the SEC on June 19, 2007)\n*(10.2)\nForm of Amended and Restated Change-in-Control Executive Severance Agreement (incorporated by reference to Exhibit 10.17 to Form 10-K filed with the SEC on December 10, 2020)\n*(10.3)\nPHX Minerals Inc. Amended 2010 Restricted Stock Plan (incorporated by reference to Exhibit 10.18 to Form 10-K filed with the SEC on December 10, 2020)\n*(10.4)\nPHX Minerals Inc. 2021 Long-Term Incentive Plan (incorporated by reference to Exhibit 10.1 to Form 8-K filed with the SEC on March 8, 2021)\n(10.5)\nCredit Agreement dated as of September 1, 2021, among PHX Minerals Inc., each lender from time to time party thereto, and Independent Bank, as Administrative Agent and L/C Issuer (incorporated by reference to Exhibit 10.1 to Form 8-K filed with the SEC on September 3, 2021)\n(10.6)\nFirst Amendment to Credit Agreement dated as of December 6, 2021, by and among PHX Minerals Inc., each lender party thereto, and Independent Bank, as Administrative Agent and L/C Issuer (incorporated by reference to Exhibit 10.3 to Form 8-K filed with the SEC on December 9, 2021).\n(10.7)\nSecond Amendment to Credit Agreement dated as of May 18, 2022, by and among PHX Minerals Inc., each lender party thereto, and Independent Bank, as Administrative Agent and L/C Issuer (incorporated by reference to Exhibit 10.1 to Form 8-K filed May 19, 2022).\n(10.8)\nThird Amendment to Credit Agreement dated as of December 7, 2022, by and among PHX Minerals Inc., each lender party thereto, and Independent Bank, as Administrative Agent and L/C Issuer.\n+(10.9)\nPurchase and Sale Agreement, dated November 10, 2021, by and between PHX Minerals Inc., as Buyer, and Vendera Resources III, LP and Vendera Management III LLC, collectively as Seller (incorporated by reference to Exhibit 10.1 to Form 8-K filed with the SEC on November 12, 2021).\n+(10.10)\nPurchase and Sale Agreement, dated December 6, 2021, by and among Merrimac Properties Partners, LLC and Quarter Horse Energy Partners, LLC, as Sellers, and PHX Minerals Inc., as Buyer (incorporated by reference to Exhibit 10.1 to Form 8-K filed with the SEC on December 9, 2021).\n+(10.11)\nPurchase and Sale Agreement, dated December 6, 2021, by and between Palmetto Investment Partners II, LLC, as Seller, and PHX Minerals Inc., as Buyer (incorporated by reference to Exhibit 10.2 to Form 8-K filed with the SEC on December 9, 2021).\n(23.1)\nConsent of Ernst & Young, LLP\n(23.2)\nConsent of Cawley, Gillespie and Associates, Inc., Independent Petroleum Engineering Consultants\n(23.3)\nConsent of DeGolyer and MacNaughton, Independent Petroleum Engineering Consultants\n(24.1)\nPower of Attorney (see signature page)\n(31.1)\nCertification of Chief Executive Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n(31.2)\nCertification of Chief Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n(32.1)\nCertification of Chief Executive Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n(32.2)\nCertification of Chief Financial Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n(99.1)\nReport of Cawley, Gillespie and Associates, Inc., Independent Petroleum Engineering Consultants\n(101.INS)\nInline XBRL Instance Document\n(101.SCH)\nInline XBRL Taxonomy Extension Schema Document\n(101.CAL)\nInline XBRL Taxonomy Extension Calculation Linkbase Document\n(101.LAB)\nInline XBRL Taxonomy Extension Labels Linkbase Document\n(101.PRE)\nInline XBRL Taxonomy Extension Presentation Linkbase Document\n(101.DEF)\nInline XBRL Taxonomy Extension Definition Linkbase Document\n(104)\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101)\n*\nIndicates management contract or compensatory plan or arrangement\n+\nThe Purchase and Sale Agreement contains schedules and exhibits that have been omitted pursuant to Item 601(a)(5) of Regulation S-K. The Company agrees to furnish a supplemental copy of any such omitted exhibit or schedule to the SEC upon request.\nITEM 16 FORM 10-K SUMMARY\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 of the Securities Exchange Act of 1934, the registrant caused this Report to be signed on its behalf by the undersigned, thereunto duly authorized.\nPHX MINERALS INC.\nBy: /s/ Chad L. Stephens\nChad L. Stephens\nPresident and Chief Executive Officer\nDate: December 13, 2022\nPOWER OF ATTORNEY\nKNOW ALL PERSONS BY THESE PRESENTS, that each person whose signature appears below constitutes and appoints each of Chad L. Stephens and Ralph DAmico, with full power of substitution and re-substitution, his or her true and lawful attorney-in-fact and agent, to sign any amendments to this report, with exhibits thereto and other documents in connection therewith, with the Securities and Exchange Commission, hereby ratifying and confirming all that said attorney-in-fact, or his substitute or substitutes, may do or cause to be done by virtue hereof.\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature\nTitle\nDate\n/s/ Chad L. Stephens\nChad L. Stephens\nPresident and Chief Executive Officer (principal executive officer)\nDecember 13, 2022\n/s/Ralph DAmico\nRalph DAmico\nVice President and Chief Financial Officer (principal financial officer)\nDecember 13, 2022\n/s/Chad D. True\nChad D. True\nVice President of Accounting\n(principal accounting officer)\nDecember 13, 2022\n/s/ Mark T. Behrman\nMark T. Behrman\nNon-Executive Chairman of the Board\nDecember 13, 2022\n/s/ Glen A. Brown\nGlen A. Brown\nDirector\nDecember 13, 2022\n/s/ Lee M. Canaan\nLee M. Canaan\nDirector\nDecember 13, 2022\n/s/ Peter B. Delaney\nPeter B. Delaney\nDirector\nDecember 13, 2022\n/s/ Steven L. Packebush\nSteven L. Packebush\nDirector\nDecember 13, 2022\n/s/ John H. Pinkerton\nJohn H. Pinkerton\nDirector\nDecember 13, 2022"
}