{
    "cik": "316253",
    "company": "ENZO BIOCHEM INC",
    "filing_type": "10-K",
    "filing_date": "2023-11-03",
    "period_of_report": "2023-07-31",
    "sic": "8071",
    "state_of_inc": "NY",
    "state_location": "NY",
    "fiscal_year_end": "0731",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/316253/0001213900-23-083566-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/316253/000121390023083566/f10k2023_enzobio.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/316253/0001213900-23-083566.txt",
    "filename": "316253_10K_2023_0001213900-23-083566.htm",
    "content": "Item 1. Business\nOverview\nEnzo Biochem, Inc. (the Company we, our or Enzo), a pioneer in molecular diagnostics, contributes to advancing healthcare with its comprehensive portfolio of technical platforms and reagent sets supporting a diverse range of biomedical research and translational science needs. A leader in innovation and product development, for over 45 years scientists have trusted Enzo Biochem to manufacture and supply a comprehensive portfolio of thousands of high-quality products, including antibodies, genomic probes, assays, biochemicals, and proteins. The Companys proprietary products and technologies play central roles in all translational research and drug development areas, including cell biology, genomics, assays, immunohistochemistry, and small molecule chemistry. Enzo Biochem, Inc.s Life Science division supports the work of research centers and industry partners, shaping the future of healthcare worldwide. Enzo Biochem, Inc. has a broad and deep intellectual property portfolio, with patent coverage across many vital enabling technologies.\nIn the course of our research and development activities, we have built a substantial portfolio of intellectual property assets, comprised of 457 owned patents worldwide and 59 pending patent applications, to date, along with extensive enabling technologies and platforms. Some of this extensive portfolio supports and protects our position in the life sciences market.\nDiscontinued Operations\nIn fiscal 2023, our Board of Directors and management undertook a comprehensive review of our business and long-term strategy and developed a plan to simplify our operations and focus on Enzo Life Sciences. In July 2023, we executed this plan by means of the sale of certain assets used in the operation of Enzo Clinical Labs and the assignment of certain clinical lab liabilities to Laboratory Corporation of America Holdings for $113.25 million, pursuant to an Asset Purchase Agreement dated March 16, 2023, as amended July 3, 2023. In accordance with the sale, Enzo Biochem ceased its clinical laboratory operations.\nOur Strategy\nWith the exit from the clinical lab segment, we are positioned as a focused life science solutions provider emphasizing sustainable, profitable growth. Key elements of our growth strategy include:\n● Pin-pointed R&D investment for accelerated product launches,\n● Channel investment and alignment to increase customer and partner touchpoints,\n● Market expansion into adjacent space supported by our current experience and customer relationships,\n● Operational optimization for cost containment and development of an infrastructure capable of supporting growth\nOperating Segment\nAs of July 31, 2023, we have one reportable segment: Products. This segment evolved from our core technical competencies involving the use of nucleic acids, proteins and cells as informational molecules and the use of compounds for immune modulation and later augmented by previous acquisitions of a number of related companies. Costs excluded from segments performance consist of corporate general and administrative costs not allocable to the operating segment and are reported as Corporate and Other. Financial information by geographic area and business segments for the fiscal years ended July 31, 2023 and 2022 is located in Note 18 - Segment Reporting in the Notes to Consolidated Financial Statements. During fiscal year ended July 31, 2022 we had another operating segment, Enzo Therapeutics. The operating results of Enzo Therapeutics are now also included in the Corporate and Other segment.\nThe Products segment manufactures, develops and markets products and tools for clinical research, translational research, drug development and bioscience research customers worldwide. Underpinned by broad technological capabilities, Enzo Life Sciences has developed proprietary products used in the identification of genomic information by laboratories around the world. Information regarding our technologies can be found in the Core Technologies section. We are internationally recognized and acknowledged as a leader in the development, manufacturing validation and commercialization of numerous products serving the fields of cellular analysis and drug discovery, among others. Our operations are supported by global operations allowing for the efficient marketing and delivery of our products around the world. During the fiscal years ended July 31, 2023 and 2022, the segment generated product revenues of $31.1 million and $32.6 million, respectively.\nMarkets\nLife Sciences -- Drug Discovery, Development and Diagnostics\nThis broad market includes technology platforms and products used by a wide array of customer types including: academic researchers, clinical researchers, biotechnology and pharmaceutical companies and diagnostic manufacturers. Our broad spectrum of products such as labels, dyes, antibodies, genomic probes, immunoassays, biochemicals, and proteins are used to label, detect and visualize a biological target of interest in drug discovery exploration and drug development process development. Enzo leverages its differentiated capabilities in labeling and detection, assay kitting and validations, and integrated manufacturing to serve as a one stop shop for 20,000 reagents that are critical to workflows across various technologies and applications, validated by over 150,000 scientific publications. We are a global manufacturer of cost-effective, high-quality solutions to enable drug discovery, development and translational research workflows supported by Good Manufacturing Practice (GMP) manufacturing. We have market expertise in genomic analysis, protein analysis, cellular analysis, tissue analysis, small molecule chemistry, GMP and custom services.\nThere is a large and growing global demand by biomedical and pharmaceutical companies for research and diagnostic tools that both facilitate and accelerate the generation of biological information. This demand can be met by gene and protein target-based diagnostics for which a variety of formats and tools have been developed that enable researchers to study biological pathways. These tools can identify mutations in gene sequences and variations in gene expression levels that can lead to disease, or they can quantify biomarkers that provide insight into disease and potential therapeutic solutions. These techniques use instruments such as DNA sequencing and genotyping equipment, microarrays, fluorescent microscopes, high content screening platforms, flow cytometers and plate readers. Common among these instruments is the need for reagents that allow the identification, quantification and characterization of interactions of specific genes or nucleic acid sequences, proteins, cells, and other cellular structures and organelles.\nWe believe this market will continue to grow as a result of:\n● long term commitment to research spending by academic, government and private organizations to determine the function and clinical relevance of the gene sequences and proteins that have been identified by genomics research, as well as investments in nucleic acid and protein detection in various sample mediums\n● development of commercial applications based on information derived from this research expansion into new methods of visualization and detection including a multi-dimensional approach to visualize results such as spatial biology and,\n● on-going advancements in tools that accelerate these research and development activities.\nStrategy\nWe will focus on one market segment with our technical strength and operational prowess. We will focus on offering sensitive, specific and consistent products for the Life Sciences market. To achieve this, we will focus on common workflows and apply Enzos innovative technical expertise to each platform part in order to achieve integrative efficient, useful solutions that provide insight to the scientific results not possible when applying alternate tools. This is balanced with an operational focus on cost containment and operational process efficiency.\nOur objective is to continue to develop and manufacture high value, reliable life science products and services using our proprietary technologies to allow our customers to meet their discovery and development needs. Our strong intellectual property estate provides freedom to operate and compete in a rapidly growing and developing healthcare marketplace.\nIncrease investment in research and development & product development and accelerate product pipeline\nWe are focusing our research and development efforts to translate our technological know-how into relevant products including a continued focus on the development of detection systems for nucleic acid, protein, cell and tissue analysis.\nCurrent technology platforms under development include:\n● AMPIVIEW ® in situ hybridization probes for enhanced detection of low expressed targets useful in the growing Spatial biology space.\n● Reagents and assays for Cell and Gene Therapy research and development\n● POLYVIEW PLUS® Enhanced Immunohistochemistry - optimized reagents for clear, consistent immunohistochemistry and in situ hybridization results moving Pathology to the next generation Enzos POLYVIEW PLUS® Enhanced Immunohistochemistry platform offers solutions within the area of Anatomical Pathology through optimized assays for clear, consistent immunohistochemistry and in situ hybridization results moving Pathology to the next generation. This platform has been used in conjunction with validated biomarkers for detecting cancers and their progression especially in the areas of womens health.\n● Enhanced Immunoassays - pushing sensitivity to expand immunoassay applications for basic research, bioprocess and diagnostics.\nEnzo is committed to delivering a robust line of products and services that will provide relevant, high-quality solutions that are easily adaptable to the workflow of drug discovery, development and diagnostic customers.\nIn October 2022, Enzo launched a new series of AMPIVIEW products for gene expression analysis relying on Enzo developed LoopRNA™ technology. This suite of products will be sold through our Enzo Life Sciences division with the first products focused on analysis of HPV and SARS-CoV-2. Additional products for visualization of cancer targets were launched in 2023, and plans to further expand the portfolio continue into 2024. These tissue pathology products complement Enzos current portfolio and expand our technology into the growing spatial biology market space.\nContinue to commercialize new platforms via multiple channels and leverage our marketing and distribution infrastructure\nEnzo Life Sciences maintains relationships with academic and commercial groups worldwide, sourcing and commercializing high value reagents developed by leading researchers. We have also developed a sales and marketing infrastructure to directly service our end users such as clinical laboratories, researchers and pharmaceutical companies, while simultaneously positioning the Company for targeted product line expansion. Our global sales, marketing, manufacturing, product development and distribution infrastructure is integrated and consolidated as a single global business. Enzo Life Sciences operates, under its own name, worldwide through wholly owned subsidiaries (in USA, Switzerland, Benelux, Germany, and the UK), a branch office in France and a network of third party distributors in most other significant markets worldwide. Our comprehensive product portfolio allows us to deliver integrated solutions to basic researchers, drug developers and clinical researchers around the globe. Our research provides solutions in all key research areas including: Genomics, Cell Biology, Biomarker Detection, and in a multitude of applied research markets including: Bioprocess, Personal Care, Cancer Research, and Neuroscience, to name a few.\nExpand and protect our intellectual property estate\nSince our inception, we have followed a strategy of creating a broadly encompassing patent position in the life sciences and therapeutics areas. We have made obtaining patent protection a central strategic policy, both with respect to our proprietary platform technologies and products, as well as broadly in the areas of our research activities. During fiscal years 2023 and 2022, we were issued 7 and 15 patents, respectively, expanding our patent estate in the area of nucleotides, amplification, labeling and detection, among others.\nWe consider our intellectual property program to be a key asset and a major strategic component to the execution of our business strategy. A broad portfolio of owned patents and pending patent applications supports our core technology platforms. Our policy is to seek patent protection for our core technology platforms, as well as for ancillary technologies that support these platforms and provide a competitive advantage. In the last fiscal year, we had 7 patents issued and we filed 6 new patent applications.\nAt the end of fiscal 2023, we owned 457 patents relating to products, methods and procedures resulting from our internal or sponsored research projects. There can be no assurance that patents will be issued on pending applications or that any owned patents will not be challenged (see Item 3, Legal Proceedings), or that they will have commercial benefit. We do not intend to rely on patent protection as the sole basis for protecting our proprietary technology.\nWe also rely on our trade secrets and continuing technological innovation. We require each of our employees to sign a confidentiality agreement that prohibits the employee from disclosing any confidential information about us, including our technology or trade secrets.\nOur intellectual property portfolio can be divided into patents that provide claims in three primary categories, as described below:\nCore Technologies for Gene, Protein, Cell and Tissue Analysis\nWe have developed a portfolio of proprietary technologies with a variety of research, diagnostic and therapeutic applications. Technology platforms and products are developed and offered for use by our customers to label, detect and visualize their target of interest.\nGene analysis technology\nAll gene-based testing is premised on the knowledge that DNA forms a double helix comprised of two complementary strands that match and bind to each other. If a complementary piece of DNA (a probe) is introduced into a sample containing its matching DNA, it will bind to, or hybridize, to form a double helix with that DNA. Gene-based testing is carried out by:\n● amplification of the target DNA sequence (a process that is essential for the detection of very small amounts of nucleic acid);\n● labeling the probe with a marker that generates a detectable signal upon hybridization;\n● addition of the probe to the sample containing the DNA; and\n● binding or hybridization of the probe to the target DNA sequence, if present, to generate a detectable signal.\nHistorically, we swiftly and decisively responded to challenges within the life sciences market. As the market demanded methods to specifically and accurately identify disease targets, Enzo provided tools to meet their needs Whether it was our various gene analysis solutions for HPV detection or broader platforms for the labeling, detection, amplification and analysis of nucleic acids like our AMPIPROBE® platform, Enzo has translated our technological know-how into market relevant tools for solving customers technological challenges.\nWe have recently expanded in this area with our AMPIVIEW® in situ hybridization technology, thereby opening up opportunities with various drug development segments.\nAmplification\nIn the early stages of infection, a pathogen may be present in very small amounts and consequently may be difficult to detect. Using DNA amplification, samples can be treated to cause a pathogens DNA to be replicated, or amplified, to detectable levels. We have developed a proprietary amplification process for multicopy production of nucleic acids, as well as proprietary techniques for amplifying the signals of our probes to further improve sensitivity. Our amplification technologies are particularly useful for the early detection of very small amounts of target DNA. We have also developed isothermal amplification procedures that can be performed at constant temperatures; unlike polymerase chain reaction (PCR) the most commonly used method of target nucleic acid amplification. These platform technologies could thus potentially lead to assays with advantages over PCR-based tests which require expensive heating and cooling systems or specialized heat-resistant enzymes. Moreover, our AMPIPROBE® Nucleic Acid Amplification Platform, because of the reduced amount of starting material needed for analysis, may lead to a next-generation of molecular diagnostics that can impart higher sensitivity at a lower cost than currently available assays.\nNon-Radioactive Labeling and Detection for gene analysis\nTraditionally, nucleic acid probes were labeled with radioactive isotopes. However, radioactively labeled probes have a number of shortcomings; they are unstable and consequently have a limited shelf life and they are potentially hazardous, resulting in restrictive licensing requirements and safety precautions for preparation, use and disposal. Finally, radioactive components are expensive. Our technologies permit gene analysis without the problems associated with radioactively labeled probes and are adaptable to a wide variety of formats.\nFormats\nThere are various processes, or formats, for performing probe-based tests. In certain formats, the probe is introduced to a target sample affixed to a solid matrix; in others, the probe is combined with the sample in solution (homogeneous assay). Solid matrix assays include: in situ assays in which the probe reaction takes place directly on a microscope slide; dot blot assays in which the target DNA is fixed to a membrane; and microplate and microarray assays in which the DNA is fixed on a solid surface, and the reaction can be quantified by instrumentation.\nLife Sciences\nWe are a manufacturer of labeling and detection technologies from DNA to whole cell analysis. Enzos products are backed by innovative technology platforms and a deep patent portfolio. With over 45 years of experience, Enzo continues to provide integrated solutions for drug development, pipeline basic research, drug discovery, quality control in drug development and diagnostics. Enzo Life Sciences offers a broad range of high-quality products to advance research including proteins, antibodies, peptides, small molecules, labeling probes, dyes, and kits. Enzo operates in a highly competitive and price-sensitive marketplace and is repositioning itself by narrowing its product mix to concentrate on improved profitability, while also adding staff who are more experienced in operations. We have become a specialized assay supplier as part of our integrated strategic plan to deliver highly efficient, cost-effective assays for our own use and to sell to independent labs. With direct sales operations in the US, Switzerland, Germany, UK, France, and Benelux, Enzo Life Sciences also supports its products through a global network of dedicated distributors.\nWith a passion for genomics, Enzo was the first to develop products for non-radioactive labeling of nucleic acids. This technique was instrumental in the development of todays genomic analysis market. Our pioneering research in genetic modification medicine was the first to recognize that nucleic acids could be used as therapeutics. Our innovations in the detection of nucleic acids in solutions and solid matrices led to the development of technology platforms such as hybrid capture, as well as fluorescent and chromogenic in situ hybridization. Enzo remains at the forefront of target amplification technologies critical in the detection of infectious agents, cancer markers, and genotyping. Our work in the genomic space has resulted in technologies in gene expression and immune system regulation, which opened the door for the well-known molecular diagnostics assays used today.\nThe products we produce and supply include small molecules, proteins, antibodies, peptides, probes, immunoassays, biochemical assays and custom services. Our comprehensive portfolio of high quality reagents and kits in key research areas are sold to scientific experts in the following fields:\n● Bioprocess ● Immunology/Inflammation/Innate Immunity\n● Cancer ● Metabolism\n● Cell Death/Autophagy ● Pathology\n● Cell cycle ● In situ Hybridization\n● Drug discovery ● Microarray Labeling\n● Epigenetics ● Neuroscience\n● FISH ● Oxidative Stress\n● Genomics ● Proteostasis\n● HPV ● Signal Transduction\n● ImmunoHistochemistry ● Stem Cell\n● Viral signaling and detection ● Stress Proteins\n● Toxicology\nWe maintain the technology and products from acquired brands including Alexis, Biomol International, Assay Designs, and Stressgen. Enzo strategically uses these brands to complete our product portfolio, allowing us to offer complete solutions to researchers in all fields. These brands are complementary to our core expertise in genomics and molecular biology. The Company intends to maintain the rights to the acquired brands which have long product histories. The Company believes the emphasis on the Enzo Life Sciences brand will result in stronger and clearer brand awareness and allow the Company to execute the sale of higher value products and promote more products into the drug development, clinical research and diagnostic markets.\nAxxora.com -The Reagents Marketplace, Thousands of Reagents, One Marketplace Axxora.com is a proven distribution platform for original manufacturers of innovative research reagents. An increasing number of researchers use our unique marketplace to connect with over 40 specialty manufacturers and gain access to over 100,000 products.\nResearch and Development\nOur principal research and development efforts are directed toward developing innovative new research platforms, and selective expansion of our research product lines, given our manufacturing and distribution capability. We have developed our core research expertise in the life sciences field due to over 45 years of dedicated focus in this area. We conduct our research and other product development efforts through internal research and collaborative relationships.\nIn the fiscal years ended July 31, 2023 and 2022, the Company incurred costs of approximately $3.9 million and $2.4 million, respectively, for research and development activities.\nInternal Research Programs\nOur professional staff, including 42 with doctoral degrees, performs our internal research and development activities. Our product development programs incorporate various scientific areas of expertise, including recombinant DNA, monoclonal antibody development, enzymology, microbiology, biochemistry, molecular biology, organic chemistry, immunology, flow cytometry and fermentation. In addition, we continuously review in-licensing opportunities in connection with new technology.\nExternal Research Collaborations\nWe have and continue to explore collaborative relationships with prominent companies and leading-edge research institutions in order to maximize the application of our technology in areas where we believe such relationship will benefit the development of our technology.\nSales and Marketing\nOur sales and marketing strategy is to sell our life sciences products through: (i) direct sales to end-users under the Enzo Life Sciences name, with direct recognition to our acquired brands (ii) direct sales to end users under the Axxora electronic market place name (iii) supply agreements with manufacturers and (iv) distributors in major geographic markets. We operate with an understanding of local markets and a well-functioning distribution network system across the globe. We have a worldwide customer support group operated by scientists to consult with our broad and deep customer base that is situated in dozens of countries around the globe. Scientists around the world who recognize the brands (Alexis, Assay Designs, Biomol, Enzo and Stressgen) now receive products directly from Enzo Life Sciences where we are recognized for innovative high quality products, supported directly by our qualified global technical staff. We sell the same products through our Axxora electronic market place which is also the source for life science research reagents from over 40 specialty manufacturers. Our direct marketing and sales network includes fully-owned subsidiaries (USA, Switzerland, Germany, Benelux, and UK), a branch office in France and a network of third party distributors in most other significant markets worldwide. Our products are cited in over 150,000 scientific publications.\nDistribution Arrangements\nWe distribute our life science products internationally through a network of distributors. Through these arrangements, we are able to leverage the established marketing and distribution infrastructure of these companies in certain market places.\nCompetition\nWe compete with other life science and biotechnology companies, as well as pharmaceutical, chemical and other companies. Competition in our industry is intense. Many of these companies are performing research targeting the same technologies, applications and markets. Many of these competitors are significantly larger than we are and have more resources. The primary competitive factors in our industry are the ability to create scientifically advanced technology, offer innovative products at the forefront of technological development to targeted market segments, successfully develop and commercialize products on a timely basis, establish and maintain intellectual property rights and attract and retain a breadth and depth of human resources.\nNucleic Acid Chemistry\nWe currently have broad patent coverage in the area of nucleic acid chemistry. We have done extensive work on the labeling of nucleic acids for the purpose of generating a signal that dates back over twenty years. Enzo has multiple owned patents covering the modification of nucleic acids at their sugar and phosphate sites. The claims contained in these patents cover products that incorporate a signaling moiety into a nucleic acid attached to a sugar or phosphate for the purpose of nucleic acid detection or quantification, including sequencing and real time nucleic acid amplification. Enzo also has patents directed to proprietary dyes that may be used to label the sugar, base or phosphate positions of nucleic acids.\nSignal Delivery\nWe have a long history of innovation in the area of analyte detection using non-radioactive signaling entities. At the signaling entity itself, there are several Enzo patents that cover the formation of this structure. A patent which was issued in 2006 covers the attachment of signaling molecules through the phosphate moiety of a nucleic acid, which is how the signal-generating enzyme is bound.\nNucleic Acid Analysis Format\nWe have patents with issued claims covering the use of arrays of single-stranded nucleic acids fixed or immobilized in hybridizable form to a non-porous solid support. These patents cover any product that uses arrays of nucleic acids for molecular analysis. In some instances, we may enter into royalty agreements with collaborating research parties in consideration for the commercial use by us of the developments of their joint research. In other instances the collaborating party might obtain a patent, but we receive the license to use the patented subject matter. In such cases, we will seek to secure exclusive licenses. In other instances, we might have an obligation to pay royalties to or reach a royalty arrangement with a third party in consideration of our use of developments of such third party.\nREGULATION AFFECTING OUR BUSINESSES\nAdhering to the privacy, security and breach notification requirements under the Health Insurance Portability and Accountability Act (HIPAA) requires an extensive compliance infrastructure. We are required to maintain numerous policies and procedures in order to comply with these requirements. Furthermore, we need to continuously ensure that there are mechanisms in place to safeguard the privacy of protected health information (PHI) that is transmitted or maintained in any format (e.g. oral, written, or electronic). Failure to comply with these requirements can result in criminal and civil penalties. In addition, to comply with the HIPAA security regulations in particular, we must ensure the confidentiality, integrity and availability of all electronic PHI (EPHI) that we create, receive, maintain, or transmit. We have some flexibility to fashion our own security measures to accomplish these goals. The security regulations strongly emphasize that we must periodically conduct an accurate and thorough assessment of the potential risks and vulnerabilities to the confidentiality, integrity and availability of our EPHI and then document our response to the various security regulations on the basis of that assessment.\nThe privacy, security and breach notification regulations under HIPAA were last modified in 2013 as a result of final regulations published pursuant to the HITECH Act (Omnibus Rule). The HITECH Act requires, among other things, that Covered Entity health care providers, which may include laboratories, notify patients of breaches of unsecured PHI, enter into business associate agreements with their business associates that meet certain requirements, and take other steps to comply with the privacy, security, and breach notification requirements of the HITECH Act, which include making necessary revisions to many of their existing privacy policies and procedures. In addition, the HITECH Act makes Business Associates directly liable to the Federal government for compliance with certain aspects of the privacy, security and breach notification regulations. In addition, as implemented in the Omnibus Rule, a downstream subcontractor of a Business Associate that creates, receives, maintains, or transmits PHI on behalf of the Business Associate is also itself considered a Business Associate.\nCovered Entities and Business Associates are subject to potentially significant civil and criminal penalties for violating HIPAA. Under the Omnibus Rule, health care providers, such as laboratories, that are subject to HIPAA as a Covered Entity are also vicariously liable for violations of HIPAA based on acts or omissions of their agents, including Business Associates, when the agent is acting within the scope of the agency. Complying with the electronic transaction, privacy, security and breach notification rules requires significant effort and expense for virtually all entities that conduct health care transactions electronically and handle PHI.\nIn April 2023, the Company experienced a ransomware attack that impacted certain critical information technology systems. In response, we promptly deployed containment measures, including disconnecting our systems from the internet, launching an investigation with assistance from third-party cybersecurity experts, and notifying law enforcement. We adhered to our disaster recovery plan, which enabled us to maintain operations throughout the incident response process. We are in the process of evaluating the full scope of the costs and related impacts of this incident. The Companys facilities remained open, and we continued to provide services to patients and partners. We later became aware that certain data, including names, test information, and Social Security numbers, was accessed, and in some instances, exfiltrated from the Companys information technology systems as part of this incident. The investigation identified unauthorized access to or acquisition of clinical test information of approximately 2,470,000 individuals. The Social Security numbers of approximately 600,000 of these individuals may also have been involved. Additionally, the Company has determined that some employees information may have been involved. The Company has provided notice to the individuals whose information may have been involved, as well as to regulatory authorities, in accordance with applicable law. There is pending Class Action litigation (see Item 3, Legal Proceedings).\nWaste\nWe are subject to licensing and regulation under federal, state and local laws relating to the handling and disposal of hazardous waste, as well as to the safety and health of laboratory employees. Our manufacturing facility is required to operate in accordance with applicable federal and state laws and regulations relating to disposal of all hazardous waste. We use outside vendors to dispose of such waste. Although we believe that we comply in all respects with such federal, state and local laws, our failure to comply with those laws could subject us to denial of the right to conduct business, fines, criminal penalties and/or other enforcement actions.\nOccupational Safety\nIn addition to its comprehensive regulation of safety in the workplace, the U.S. Federal Occupational Safety and Health Administration (OSHA) has established extensive requirements relating to workplace safety. We are subject to OSHAs requirement that employers using hazardous chemicals communicate the properties and hazards presented by those chemicals to their employees. We believe that we are in compliance with these OSHA requirements. Our failure to comply with those regulations and requirements could subject us to tort liability, civil fines, criminal penalties and/or other enforcement actions.\nOther Regulation\nOur business is and will continue to be subject to regulation under various state and federal environmental, safety and health laws, including the Occupational Safety and Health Act, the Resource Conservation and Recovery Act, and the Atomic Energy Act or their state law analogs. These and other laws govern our use, handling and disposal of various biological, chemical and radioactive substances used in our operations and wastes generated by our operations. We are required to possess licenses under, or are otherwise subject to federal and state regulations pertaining to, the handling and disposal of hazardous waste and radioactive materials.\nWe believe that we are in compliance with applicable environmental, safety and health laws in the United States and internationally and that our continual compliance with these laws will not have a material adverse effect on our business. All of our laboratories are operated in accordance with applicable federal and state laws and regulations relating to hazardous substances and we use qualified third-party vendors to dispose of hazardous wastes. Although we believe that we comply in all respects with such federal, state and local laws, our failure to comply with those laws could subject us to denial of the right to conduct business, civil fines, criminal penalties and/or other enforcement actions. Environmental contamination resulting from spills or disposal of hazardous substances generated by our operations, even if caused by a third-party contractor or occurring at a remote location could result in material liability.\nRegulation of Diagnostic Products\nIn February 2020, the HHS Secretary determined that there was a public health emergency that has a significant potential to affect national security or the health and security of United States citizens living abroad, and that involves the virus that causes COVID-19. On the basis of this determination, the Secretary then declared that circumstances exist justifying the authorization of emergency use of in vitro diagnostics for detection and/or diagnosis of the virus that causes COVID-19.\nThe diagnostic products that are developed by our collaborators, or by us, are likely to be regulated by the FDA as medical devices. Unless an exemption applies, medical devices must undergo premarket review (and receive 510(k) clearance, de novo 510(k) authorization, or pre-market approval (PMA) from the FDA, as may be applicable) before they can be marketed in the United States. The FDAs premarket review processes may be costly and time consuming, but the process of obtaining PMA approval is typically the most costly, lengthy and uncertain, followed by the de novo 510(k) process, and then the 510(k) process. Regardless of the premarket review pathway that applies to a particular product, we cannot be sure that we will successfully complete the FDA premarket review process for any product we propose to market.\nThe FDA decides the premarket review process that applies to a particular device based upon statutory criteria. These criteria include the level of risk that the agency perceives is associated with the device and a determination whether the product is a type of device that is similar to devices that are already legally marketed. Devices deemed to pose relatively less risk are placed in either class I or II, which requires the manufacturer to submit a premarket notification requesting 510(k) clearance, unless an exemption applies. In a pre-market notification, the applicant must demonstrate that the proposed device is substantially equivalent in intended use and in safety and effectiveness to a legally marketed predicate device that is a pre-amendment class III device (i.e., one that was legally in commercial distribution before May 1976) for which the FDA has not yet called for submission of a PMA application, or a device which has been reclassified from Class III to Class II or I, a device which has been found substantially equivalent through the 510(k) process, or a device that was granted marketing authorization via the de novo classification process that is not exempt from premarket notification requirement.\nAfter a device receives 510(k) clearance, any modification that could significantly affect its safety or effectiveness, or that would constitute a major change in its intended use, requires a new 510(k) clearance or could require a de novo 510(k) authorization or PMA approval (as applicable). The FDA requires each manufacturer to make the determination regarding whether a modification triggers the requirement for a new submission in the first instance, but the FDA can review any such decision. If the FDA disagrees with a manufacturers decision not to seek premarket review for the modified device, the agency may retroactively require the manufacturer to do so. The FDA also can require the manufacturer to cease marketing and/or recall the modified device until the premarket review process has been successfully completed.\nDevices deemed by the FDA to pose the greatest risk, such as life-sustaining, life-supporting or implantable devices, or deemed not substantially equivalent to a legally marketed class I or class II predicate device, or to a preamendment class III device, for which PMAs have not been called, are placed in class III. Such devices are required to undergo the PMA approval process in which the manufacturer must provide sufficient valid scientific evidence of the safety and effectiveness of the device. A PMA application typically requires the collection of extensive preclinical and clinical trial data and also information about the device and its components regarding, among other things, device design, manufacturing and labeling. After approval of a PMA, a new PMA or PMA supplement is required in the event of a modification to the device, its labeling or its manufacturing process.\nAlthough clinical investigations of many devices are subject to the investigational device exemption (IDE) requirements, clinical investigations of certain in vitro diagnostic (IVDs) tests are exempt from the IDE requirement provided the testing is non-invasive, does not require an invasive sampling procedure that presents a significant risk, does not by design or intention introduce energy into the subject, and is not used as a diagnostic procedure without confirmation by another medically established test or procedure.\nNotwithstanding the above, certain IVD products can be marketed without going through the premarket review process if they are intended for use in the laboratory research phase of development and not represented as an effective IVD (i.e., labeled for Research Use Only (RUO)) or for use in product testing prior to full commercial marketing (i.e. for Investigational Use Only (IUO)). Because RUO and IUO-labeled products are exempt from most regulatory requirements that would otherwise apply to medical devices, it is important that they are not distributed for clinical diagnostic use. Mere placement of an RUO or IUO label on an IVD product does not render the device exempt from otherwise applicable regulatory requirements; indeed, FDA may determine that the device is intended for use in clinical diagnosis on the basis of other evidence, including how the device is marketed. FDA recommends that manufacturers assess the totality of the circumstances surrounding the distribution of their RUO and IUO labeled products to ensure that they are not engaging in practices that conflict with their labeling. The FDA expressed its intent to exercise heightened enforcement with respect to IUO and RUO devices improperly commercialized without FDA clearance, authorization or approval in a 2013 final guidance document.\nWe have developed products that we currently distribute in the United States on a RUO basis. There can be no assurance that the FDA would agree that our distribution of these products meets the requirements for RUO distribution. Furthermore, our failure to comply with the regulatory limitations on the sale and distribution of RUO devices could result in enforcement action by the FDA, including the imposition of restrictions on our distribution of these products.\nIn so far as the products that we manufacture or distribute are subject to regulation as medical devices, a host of additional regulatory requirements may apply beyond premarket review requirements, including establishment registration, device listing, the Quality System Regulation (which requires manufacturers to follow elaborate design, testing, control, documentation and other quality assurance procedures), the Medical Device Reporting regulation (which requires that manufacturers report to the FDA certain types of adverse events involving their products), labeling regulations, and the FDAs general prohibition against promoting products for unapproved or off label uses. Class II devices may also be subject to special controls such as performance standards, post market surveillance, patient registries, and FDA guidelines that do not apply to class I devices. Unanticipated changes in existing regulatory requirements or adoption of new requirements could hurt our business, financial condition and results of operations.\nWe are subject to inspection and market surveillance by the FDA to determine compliance with regulatory requirements. If the FDA finds that we have failed to comply with applicable requirements, the agency can institute a wide variety of enforcement actions, ranging from a public warning letter to more severe sanctions such as fines, injunction, civil penalties, recall or seizure of our products, operating restrictions, partial suspension or total shutdown of production, refusal of our requests for 510(k) clearance or PMA approval of new products, withdrawal of PMA approvals already granted, and criminal prosecution.\nThe FDA also has the authority to request repair, replacement or refund of the cost of any medical device manufactured or distributed by us. Our failure to comply with applicable requirements could lead to an enforcement action that may have an adverse effect on our financial condition and results of operations.\nUnanticipated changes in existing regulatory requirements, our failure to comply with such requirements or adoption of new requirements could have a material adverse effect on us. We have employees to expedite the preparation and filing of documentation necessary for FDA clearances, authorizations, and approvals, as well as patent issuances and licensing agreements. We cannot assure you that future clinical diagnostic products developed by us or our collaborators will not be required to be reviewed by FDA under the more expensive and time consuming pre-market approval process.\nThe Company also adheres to ISO 9001 and ISO 13485 regulations, a globally recognized Quality Management system. Improved continuous business, service, process and product improvement are the core of ISO regulations.\nManufacturing and Research Facilities\nOur product development, manufacture and scientific efforts currently take place primarily at two adjacent facilities in Farmingdale, New York. One facility is utilized entirely by Enzo Life Science as its global headquarters, and also for research and manufacturing with special handling capabilities and clean rooms suitable for our operations. The second facility includes the Enzo Life Sciences call center and warehouse space. Enzo Life Sciences had previously centered its US logistics, reagent and kit manufacturing at a leased facility in Ann Arbor, Michigan, which we exited in September 2021. The European logistics operations is based in Lausen, Switzerland. We also contract with qualified third-party contractors to manufacture our products in cases where we deem it appropriate, for example, when it is not cost-effective to produce a product ourselves or where we seek to leverage the expertise of another manufacturer in a certain area.\nEmployees\nAs of July 31, 2023, we employed 179 full-time and 11 part-time employees. Of the full-time employees, 112 were engaged in research, development, manufacturing, and marketing of research products, and 67 in finance, information technology, administrative and executive functions. Our scientific staff, including 42 with post graduate degrees, possesses a wide range of experience and expertise in the areas of recombinant DNA, nucleic acid chemistry, molecular biology and immunology. We believe that we have established good relationships with our employees.\nInformation Systems\nInformation systems are used extensively in virtually all aspects of our businesses. Our success depends, in part, on the continued and uninterrupted performance of our information technology systems. Computer systems are vulnerable to damage from a variety of sources, including telecommunications or network failures, malicious human acts and natural disasters.\nMoreover, despite network security measures, some of our servers are potentially vulnerable to physical or electronic break-ins, computer viruses and similar disruptive problems. We have invested heavily in the upgrade of our information and telecommunications systems to improve the quality, efficiency and security of our businesses.\nDespite the precautionary measures that we have taken to prevent unanticipated problems that could affect our information technology systems, sustained or repeated system failures could adversely affect our reputation and result in a loss of customers and net revenues.\nOn April 6, 2023, the Company experienced a ransomware attack that impacted certain critical information technology systems. In response, we promptly deployed containment measures, including disconnecting our systems from the internet, launched an investigation with assistance from third-party cybersecurity experts, and notified law enforcement. We adhered to our disaster recovery plan, which enabled us to maintain operations throughout the incident response process. We are in the process of evaluating the full scope of the costs and related impacts of this incident. During the disaster recovery, our ability to perform clinical reference testing was severely curtailed and we were forced to outsource much of the testing to third parties, including Labcorp. This negatively impacted the 2023 periods services revenue of the discontinued operations and costs increased due to a higher volume of outsourcing testing to third parties. The Company has incurred, and may continue to incur, certain expenses related to this attack, including expenses to respond to, remediate and investigate this matter, as well as related litigation and regulatory inquiries (see Item 3, Legal Proceedings).\nFORWARD - LOOKING AND CAUTIONARY STATEMENTS\nThis Annual Report contains forward-looking statements as defined in the Private Securities Litigation Reform Act of 1995. All statements other than statements of historical fact, including, without limitation, the statements under Managements Discussion and Analysis of Financial Condition and Results of Operations are forward-looking statements. Forward-looking statements may include the words believes, expects, plans, intends, anticipates, continues or other similar expressions. These statements are based on the Companys current expectations of future events and are subject to a number of risks and uncertainties that may cause the Companys actual results to differ materially from those described in the forward-looking statements. Should one or more of these risks or uncertainties materialize, or should underlying assumptions prove incorrect, actual results may vary materially from those anticipated, estimated or projected. The Company assumes no obligation to revise or update any forward-looking statements for any reason, except as required by law.\nThe Company files annual, quarterly and current reports, proxy statements and other information with the Securities and Exchange Commission (the SEC). These filings are available to the public via the Internet at the SECs website located at http://www.sec.gov. You may also read and copy any document the Company files with the SEC at the SECs public reference room located at 100 F Street, N.E., Washington, D.C. 20549. For more information, please call the SEC at 1-800-SEC-0330.\nThe Companys website is located at www.enzo.com. The Company makes available on its website a link to all filings that it makes with the SEC. You may request a copy of the Companys filings with the SEC (excluding exhibits) at no cost by writing or telephoning us at the following address or telephone number:\nEnzo Biochem, Inc.\n81 Executive Blvd. Suite 3\nFarmingdale, NY 11735\nTel: (631) 755-5500\nAttn: Investor Relations Item 1A. Risk Factors\nOur failure to establish and maintain effective internal controls over financial reporting and information technology access could result in material misstatements in our consolidated financial statements, our failure to meet our reporting obligations and cause investors to lose confidence in our reported financial information, which in turn could cause the trading price of our common stock to decline.\nUnder Section 404 of the Sarbanes-Oxley Act of 2002 and rules promulgated by the SEC, companies are required to conduct a comprehensive evaluation of their internal control over financial reporting. As part of this process, we are required to document and test our internal control over financial reporting; management is required to assess and issue a report concerning our internal control over financial reporting; and our independent registered public accounting firm may be required to attest to the effectiveness of our internal control over financial reporting. Our internal control over financial reporting may not prevent or detect misstatements because of its inherent limitations, including the possibility of human error, the circumvention or overriding of controls, or fraud.\nOver time, controls may become inadequate because of changes in conditions or deterioration in the degree of compliance with policies or procedures. Because of the inherent limitations in a cost-effective control system, misstatements due to error or fraud may occur and not be prevented or detected timely. Even effective internal controls over financial reporting can provide only reasonable assurance with respect to the preparation and fair presentation of financial statements.\nThe existence of a material weakness could result in errors in our financial statements that could result in a restatement of financial statements, which could cause us to fail to meet our reporting obligations, lead to a loss of investor confidence and have a negative impact on the trading price of our common stock.\nIn connection with our April 30, 2023 unaudited consolidated financial statements, Enzos management identified a deficiency, which it considers to be a material weakness, which could reasonably result in a material misstatement in the Companys financial statements. The Company has implemented remediation measures. However, the material weakness cannot be considered remediated until the applicable controls have operated for a sufficient period of time and management has concluded, through testing, that these controls are operating effectively.\nEnzo has concluded that there are material weaknesses in its internal control over financial reporting, which, if not remediated, could materially adversely affect its ability to timely and accurately report its results of operations and financial condition. The accuracy of Enzos financial reporting depends on the effectiveness of its internal controls over financial reporting.\nInternal controls over financial reporting can provide only reasonable assurance with respect to the preparation and fair presentation of financial statements and may not prevent or detect misstatements. Failure to maintain effective internal controls over financial reporting, or lapses in disclosure controls and procedures, could undermine the ability to provide accurate disclosure (including with respect to financial information) on a timely basis, which could cause investors to lose confidence in Enzos disclosures (including with respect to financial information), require significant resources to remediate the lapse or deficiency, and expose it to legal or regulatory proceedings. In connection with our April 30, 2023 unaudited consolidated financial statements, Enzos management identified a deficiency, which it considers to be a material weakness, which could reasonably result in a material misstatement in the Companys financial statements. The Company has implemented remediation measures. However, the material weakness cannot be considered remediated until the applicable controls have operated for a sufficient period of time and management has concluded, through testing, that these controls are operating effectively.\nBusiness Risks\nOur operating results may vary from period to period.\nOur operating results may vary significantly from quarter to quarter and from year to year, depending on a variety of factors including:\n● customer demand for our products due to changes in purchasing requirements and research needs;\n● the introduction of new products by us or our competitors;\n● the timing of our research and development, sales and marketing expenses;\n● general worldwide economic conditions affecting funding of research;\n● expenses associated with defending our intellectual property portfolio\n● foreign currency exchange rate fluctuations;\n● changes in tax laws, the results of tax audits or the measurement of tax uncertainties; and\n● the success of identifying, acquiring and integrating businesses that complement our product offerings, add new technology or add presence in a market;\nConsequently, results for any interim or full year period may not necessarily be indicative of results in subsequent periods.\nA significant proportion of our Products revenues are from academic centers, funded by government grants in our major markets globally.\nGovernments around the world have been reviewing long term public funding of life science research in response to the problems arising from global financial pressures. As a result, the available funds for discretionary purchases from market to market have been capped or reduced based on available National budgets. Reduced grants for researchers could impact our business, in the amount, price and type of products bought and used by customers.\nA significant proportion of our Products revenues are from customers in pharmaceutical and biotech companies.\nGlobally, pharmaceutical companies are challenging internal budgets, and the return of investment from their R&D spend. This could impact our business, in the amount, price and type of products bought and used by customers.\nOur future success will depend in part upon our ability to enhance existing products, develop and introduce new products and realize commercial acceptance of those products, in a rapidly changing technological environment.\nThe market for our products is characterized by rapidly changing technology, evolving industry standards and new product introductions, which may make our existing products obsolete. Our future success will depend in part upon our ability to enhance existing products, develop and introduce new products, and realize commercial acceptance of those products.\nThe development of new or enhanced products is a complex and uncertain process requiring the accurate anticipation of technological and market trends as well as precise technological execution. In addition, the successful development of new products will depend on the development of new technologies. We will be required to undertake time-consuming and costly development activities and to seek regulatory approval for these new products. We may experience difficulties that could delay or prevent the successful development, introduction and marketing of these new products. Regulatory clearance or approval of any new products may not be granted by the FDA, state-wide agency or foreign regulatory authorities on a timely basis, or at all, and the new products may not be successfully commercialized.\nOur inability to carry out certain of our marketing and sales plans may make it difficult for us to grow or maintain our business.\nThe Products segment continues a marketing program designed to more directly service its end users, while simultaneously promoting the Enzo Life Science brand, with reference to our acquired brands. We will continue to reach out to our customers using our direct field sales force, in-house business team, the on-going enhancement of our interactive websites, continued attendance at top industry trade meetings, and publications to customers and in leading scientific journals. In addition to our direct sales, we operate worldwide through wholly-owned subsidiaries (in USA, Switzerland, Belgium, Germany, and the UK), a branch office in France and a network of third-party distributors in most other significant markets. If we are unable to successfully continue these programs, we may be unable to grow and our business could suffer.\nWe face significant competition, which could cause us to decrease the prices for our products or render our products uneconomical or obsolete, any of which could reduce our revenues and limit our growth.\nOur competitors in the biotechnology industry in the United States and abroad are numerous and include major pharmaceutical, energy, food and chemical companies, as well as specialized genetic engineering firms. Many of our large competitors have substantially greater resources than us and have the capability of developing products which compete directly with our products. Many of these companies are performing research in the same areas as we are. The markets for our products are also subject to competitive risks because markets are highly price competitive. Our competitors have competed in the past by lowering prices on certain products.\nThese competitive conditions could, among other things:\n● require us to reduce our prices to retain market share;\n● require us to increase our marketing efforts which could reduce our profit margins;\n● increase our cost of labor to attract qualified personnel;\n● render our biotechnology products uneconomical or obsolete or;\n● reduce our revenue\nEthical, legal and social concerns surrounding the use of genetic information could reduce demand for our products.\nGenetic testing has raised ethical issues regarding privacy and the appropriate uses of the resulting information. For these reasons, governmental authorities may call for limits on or regulation of the use of genetic testing or prohibit testing for genetic predisposition to certain conditions, particularly for those that have no known cure. Similarly, such concerns may lead individuals to refuse to use genetics tests even if permissible. Any of these scenarios could reduce the potential markets for our molecular diagnostic products, which could have a material adverse effect on our business, financial condition and results of operations.\nWe depend on distributors and contract manufacturers and suppliers for materials that could impair our ability to manufacture or distribute our products.\nWe manufacture and distribute our own brand products and the products of third party manufacturers and suppliers. Distributors also sell our branded products. To the extent we are unable to maintain or replace a distributor in a reasonable time period, or on commercially reasonable terms, if at all, our operations could be disrupted.\nOutside distributors, suppliers and contract manufacturers provide key finished goods, components and raw materials used in the sale and manufacture of our products. Although we believe that alternative sources for components and raw materials are available, any supply interruption in a limited or sole source component or raw material would harm our ability to manufacture our products until a new source of supply is identified and qualified. In addition, an uncorrected defect or suppliers variation in a component or raw material, either unknown to us or incompatible with our manufacturing process, could harm our ability to manufacture products. We might not be able to find a sufficient alternative supplier in a reasonable time period, or on commercially reasonable terms, if at all. If we fail to obtain a supplier for the components of our products, our operations could be disrupted.\nWe use hazardous materials in our business. Any claims relating to improper handling, storage or disposal of these materials could be costly and time-consuming.\nOur manufacturing and research and development processes involve the storage, use and disposal of hazardous substances, including hazardous chemicals, biological hazardous materials and radioactive compounds. We are subject to governmental regulations governing the use, manufacture, storage, handling and disposal of materials and waste products. Although we believe that our safety and environmental management practices and procedures for handling and disposing of these hazardous materials are in accordance with good industry practice and comply with applicable laws, permits, licenses and regulations, the risk of accidental environmental or human contamination or injury from the release or exposure of hazardous materials cannot be completely eliminated. In the event of an accident, we could be held liable for any damages that result, including environmental clean-up or decontamination costs, and any such liability could exceed the limits of, or fall outside the coverage of, our insurance.\nWe may not be able to maintain insurance on acceptable terms, or at all. We could be required to incur significant costs to comply with current or future environmental and public and workplace safety and health laws and regulations.\nWe are required to expend significant resources for research and development for our diagnostic products in development and these products may not be developed successfully. Failure to successfully develop these products may prevent us from earning a return on our research and development expenditures.\nThe diagnostic products we are developing are at various stages of development and clinical evaluations and may require further technical development and investment to determine whether commercial application is practicable. There can be no assurance that our efforts will result in products with valuable commercial applications. Our cash requirements may vary materially from current estimates because of results of our research and development programs, competitive and technological advances and other factors. In any event, we will require substantial funds to conduct development activities, apply for regulatory approvals and commercialize products, if any, that are developed.\nWe do not have any commitments or arrangements to obtain any additional financing and there is no assurance that required financing will be available to us on acceptable terms, if at all. Even if we spend substantial amounts on research and development, our potential diagnostic products may not be developed successfully.\nIf our diagnostic product candidates on which we have expended significant amounts for research and development are not commercialized, we will not earn a return on our research and development expenditures, which may harm our business.\nRisks relating to our Intellectual Property and Regulatory Approval\nProtecting our proprietary rights is difficult and costly. If we fail to adequately protect or enforce our proprietary rights, we could lose potential revenue from licensing and royalties.\nOur potential revenue and success depends in large part on our ability to obtain, maintain and enforce our patents. Our ability to commercialize any product successfully will largely depend on our ability to obtain and maintain patents of sufficient scope to prevent third parties from developing similar or competitive products. In the absence of patent protection, competitors may impact our business by developing and marketing substantially equivalent products and technology.\nPatent disputes are frequent and can preclude the commercialization of products. We have in the past been, are currently, and may in the future be, involved in material patent litigation, such as the matters discussed under Part I - Item 3. Legal Proceedings in this report. Patent protection litigation is time-consuming and we have incurred and anticipate continuing to incur significant legal costs. In addition, an adverse decision could force us to either obtain third-party licenses at a material cost or cease using the technology or product in dispute.\nWe have filed applications for United States and foreign patents covering certain aspects of our technology, but there is no assurance that pending patents will issue or as to the degree of protection which any owned patent might afford.\nLawsuits, including patent infringements, in the biotechnology industry are not uncommon. If we become involved in any significant litigation, we would suffer as a result of the diversion of our managements attention, the expense of litigation and any judgments against us.\nIn addition to intellectual property litigation for infringement, other substantial, complex or extended litigation could result in large expenditures by us and distraction of our management. Patent litigation is time-consuming and costly in its own right and could subject us to significant liabilities to third parties. In addition, an adverse decision could force us to either obtain third-party licenses at a material cost or cease using the technology or product in dispute. In addition, lawsuits by employees, stockholders, collaborators or distributors could be very costly and substantially disrupt our business. Disputes from time to time with companies or individuals are not uncommon in the biotechnology industry, and we cannot assure you that we will always be able to resolve them out of court.\nWe also utilize certain unpatented proprietary technology and no assurance can be given that others will not independently develop substantially equivalent proprietary technology, that such proprietary technology will not be disclosed or that we can meaningfully protect our rights to such proprietary technology.\nOur business is subject to governmental laws and regulations. Changes in the way the FDA regulates the reagents, and other consumables we use when developing, validating, and performing our tests could result in delay or additional expense in bringing our tests to market or performing such tests for our customers. We may be unable to obtain or maintain regulatory approvals for our diagnostic products, which could reduce our revenue or prevent us from earning a return on our research and development expenditures.\nOur research, preclinical development, product manufacturing and marketing are subject to regulation by the FDA and similar health authorities in foreign countries. The FDA has regulatory responsibility over, among other areas, instruments, software, test kits, reagents and other devices used by clinical laboratories to perform diagnostic testing in the U.S. The tests we develop internally are offered as lab developed tests or LDTs. The FDA has claimed regulatory authority over all LDTs, but has stated that it exercised enforcement discretion with regard to most LDTs performed by high complexity CLIA-certified laboratories. As the FDA moves to regulate more clinical laboratory testing, its approach to regulation is impacting industry practices and participants, new competitors may enter the industry, and competition may come in new forms. In late 2018, legislation was introduced in Congress that would enable the FDA to regulate LDTs, in vitro diagnostics, software and other items used in the diagnosis of disease. If this legislation were to become law, the FDA could regulate diagnostic tests and components and platforms used as part of these tests. If such legislation were to become law, it could have a significant impact on the clinical laboratory testing industry, including regulating LDTs in new ways and creating avenues of opportunity and competition regarding clinical laboratory testing. New competitors may enter the industry, and competition may come in new forms. Pursuant to the 21st Century Cures Act, the FDA issued guidance regarding its position on the regulation of clinical decision software, which may be used in, or in connection with, LDTs. The guidance attempts to clarify whether FDA approval of certain software is required. In January 2019, the FDA issued draft guidance on a pre-certification pilot program to help software developers have a speedier and less restrictive path to clearance or approval of their software.\nWe cannot be sure that we can obtain necessary regulatory approvals on a timely basis, if at all, for any of the products we are developing or manufacturing or that we can maintain necessary regulatory approvals for our existing products, and all of the following could have a material adverse effect on our business:\n● significant delays in obtaining or failing to obtain required approvals;\n● loss of, or changes to, previously obtained approvals;\n● failure to comply with existing or future regulatory requirements and;\n● changes to manufacturing processes, manufacturing process standards or GMP following approval or changing interpretations of these factors.\nAdverse perception and increased regulatory scrutiny of gene medicine and genetic research might limit our ability to conduct our business.\nEthical, social and legal concerns about gene medicine, genetic testing and genetic research could result in additional regulations restricting or prohibiting the technologies we or our collaborators may use. Recently, gene medicine studies have come under increasing scrutiny, which has delayed on-going and could delay future clinical trials and regulatory approvals. Federal and state agencies, congressional committees and foreign governments have expressed interest in further regulating biotechnology. More restrictive regulations or claims that our products are unsafe or pose a hazard could prevent us from commercializing any products.\nFinancial Risks\nWe have experienced significant losses in our continuing operations in fiscal years ended July 31, 2023 and 2022 and our losses have resulted in the use of cash in operations. If such losses and cash uses continue, the value of your investment could decline significantly.\nWe incurred net losses before income taxes from continuing operations of $25.0 million and $20.3 million, for the fiscal years ended July 31, 2023 and 2022, respectively. If our revenues do not increase, or if our operating expenses exceed expectations or cannot be reduced, we may continue to suffer substantial losses and use cash in operations which could have an adverse effect on our business and adversely affect your investment in our Company. We have an accumulated deficit of $268.4 million as of July 31, 2023 and net cash used in operating activities was $37.0 million for the fiscal year 2023. We may continue to generate net losses. We believe our cash and cash equivalents at July 31, 2023 are sufficient for our operations and non-discretionary capital needs for at least twelve months from the filing of this report. Failure to generate additional product revenues at higher margins, obtain additional capital or manage discretionary spending could have an adverse effect on our financial position, results of operations and liquidity.\nOther risks relating to our business\nCyber security risks and the failure to maintain the confidentiality, integrity, and availability of our computer hardware, software, and Internet applications and related tools and functions could result in damage to the Companys reputation and/or subject the Company to costs, fines, or lawsuits.\nThe integrity and protection of our own data, and that of its customers and employees, is critical to the Companys business. The regulatory environment governing information, security and privacy laws is increasingly demanding and continues to evolve. Maintaining compliance with applicable security and privacy regulations may increase the Companys operating costs and/or adversely impact the Companys ability to market its products and services to customers. Although the Companys computer and communications hardware is protected through physical and software safeguards, it is still vulnerable to fire, storm, flood, power loss, earthquakes, telecommunications failures, physical or software break-ins, software viruses, and similar events. These events could lead to the unauthorized access, disclosure and use of non-public information. The techniques used by criminal elements to attack computer systems are sophisticated, change frequently and may originate from less regulated and remote areas of the world. As a result, the Company may not be able to address these techniques proactively or implement adequate preventative measures. If the Companys computer systems are compromised, it could be subject to fines, damages, litigation, and enforcement actions, customers could curtail or cease using its applications, and the Company could lose trade secrets, the occurrence of which could harm its business.\nWe rely on network and information systems and other technology whose failure or misuse could cause, and has caused, a disruption of services or loss or improper disclosure of personal data, business information, including intellectual property, or other confidential information, resulting in increased costs, loss of revenue or other harm to our business.\nNetwork and information systems and other technologies, including those related to the Companys network management, are important to its business activities. The Company also relies on third party providers for certain technology and cloud-based systems and services that support a variety of business operations. Network and information systems-related events affecting the Companys systems, or those of third parties upon which the Companys business relies, such as computer compromises, cyber threats and attacks, ransomware attacks, computer viruses, worms or other destructive or disruptive software, process breakdowns, denial of service attacks, malicious social engineering or other malicious activities, or any combination of the foregoing, as well as power outages, equipment failure, natural disasters (including extreme weather), terrorist activities, war, human or technological error or malfeasance that may affect such systems, could result in disruption of the Companys business and/or loss, corruption or improper disclosure of personal data, business information, including intellectual property, or other confidential information. In addition, any design or manufacturing defects in, or the improper implementation of, hardware or software applications the Company develops or procures from third parties could unexpectedly compromise information security. In recent years, there has been a rise in the number of cyber-attacks and ransomware attacks on companies network and information systems, and such attacks have become more sophisticated, targeted and difficult to detect and prevent. As a result, the risks associated with such an event continue to increase, particularly as the Companys digital businesses expand. The Companys security measures and internal controls that are designed to protect personal data, business information, including intellectual property, and other confidential information, to prevent data loss, and to prevent or detect security breaches, have not always provided, and cannot provide, absolute security and have at times failed and may not be successful in preventing these events from occurring, particularly given that techniques used to access, disable or degrade service, or sabotage systems change frequently, and any network and information systems-related events have required and could continue to require the Company to expend significant resources to remedy such event. Moreover, the development and maintenance of these measures is costly and requires ongoing monitoring and updating as technologies change and efforts to overcome security measures become more sophisticated. The Companys cyber risk insurance may not be sufficient to cover all losses from any future breaches of our systems.\nA significant cyber attack, ransomware attack, failure, compromise, breach or interruption of the Companys systems, or those of third parties upon which its business relies, could result in a disruption of its operations, customer, audience or advertiser dissatisfaction, damage to its reputation or brands, regulatory investigations and enforcement actions, lawsuits, remediation costs, a loss of customers, advertisers or revenues and other financial losses. If any such failure, interruption or similar event results in the improper disclosure of information maintained in the Companys information systems and networks or those of its vendors, including financial, personal, credit card, confidential and proprietary information relating to personnel, customers, vendors and the Companys business, including its intellectual property, the Company could also be subject to liability under relevant contractual obligations and laws and regulations protecting personal data and privacy. In addition, media or other reports of perceived security vulnerabilities to our systems or those of third parties upon which the Companys business relies, even if nothing has actually been attempted or occurred, could also adversely impact our brand and reputation and materially affect our business.\nOn April 6, 2023, the Company experienced a ransomware attack that impacted certain critical information technology systems. The Company has incurred, and may continue to incur, certain expenses related to this attack and remains subject to risks and uncertainties as a result of the incident. Additionally, security and privacy incidents have led to, and may continue to lead to, additional regulatory scrutiny and class action litigation exposure. This incident severely curtailed our ability to perform clinical reference testing and we were forced to outsource much of the testing to third parties, including Labcorp, which negatively impacted the 2023 periods services revenue and increased costs due to a higher volume of outsourcing testing to third parties in the discontinued operations. See Note 17 Contingencies for additional information.\nIf we fail to attract and retain key personnel, including our senior management, our business could be adversely affected.\nMost of our products and services are highly technical in nature. In general, only highly qualified and trained scientists and technician personnel have the necessary skills to develop proprietary technological products and market our products and support our research and development programs.\nIn addition, some of our manufacturing, quality control, safety and compliance, information technology and e-commerce related positions are highly technical as well. Further, our sales personnel are highly trained and are important to retaining and growing our businesses. Our success depends in large part upon our ability to identify, hire, retain and motivate highly skilled professionals.\nWe face intense competition for these professionals from our competitors, customers, marketing partners and other companies throughout the industries in which we compete. Since our inception we have successfully recruited and hired qualified key employees. Any failure on our part to hire, train, and retain a sufficient number of qualified professionals would seriously damage our business.\nWe depend heavily on the services of our senior management. We believe that our future success depends on the continued services of such management. Our business may be harmed by the loss of a significant number of our senior management in a short period of time.\nThe insurance we purchase to cover our potential business risk may be inadequate.\nAlthough we believe that our present insurance coverage is sufficient to cover our current estimated exposures, we cannot assure that we will not incur losses or liabilities in excess of our policy limits. In addition, although we believe that will be able to continue to obtain adequate coverage, we cannot assure that we will be able to do so at acceptable costs.\nWe are, and may become subject to, legal proceedings, arbitration proceedings, investigations, and other claims or disputes, which are costly to defend and, if determined adversely to us, could require us to pay fines or damages, undertake remedial measures, or prevent us from taking certain actions, any of which could adversely affect our business.\nWe are, and in the future may become, a party to legal proceedings, arbitration proceedings, investigations, and other claims or disputes, which have related and may relate to subjects including our recent ransomware attack and data breach, breach of fiduciary duties relating to our commercial transactions, intellectual property, securities, employee relations, or compliance with applicable laws and regulations (see Part I - Item 3, Legal Proceedings).\nWe face a significant risk due to ongoing litigation that has the potential to result in future financial obligations, adversely impacting the companys business and profitability. The outcome of the present legal proceedings may lead to financial liabilities, such as settlements or damages, posing a material threat to our financial condition and cash flow. Moreover, adverse litigation outcomes may harm our reputation, affecting customer trust and investor confidence, thereby influencing market share and brand value. While we are actively managing and addressing the litigation, uncertainties persist, emphasizing the importance of transparency in communication with stakeholders and the implementation of effective risk mitigation strategies.\nRisks relating to our international operations\nForeign currency exchange rate fluctuations may adversely affect our business.\nSince we operate as a multinational corporation that sells and sources products in many different countries, changes in exchange rates could in the future, adversely affect our cash flows and results of operations.\nFurthermore, reported sales and purchases made in non-U.S. currencies by our international businesses, when translated into U.S. dollars for financial reporting purposes, fluctuate due to exchange rate movement. Due to the number of currencies involved, the variability of currency exposures and the potential volatility of currency exchange rates, we cannot predict the effect of exchange rate fluctuations on future sales and operating results.\nWe are subject to economic, political and other risks associated with our significant international business, which could adversely affect our financial results.\nWe operate internationally primarily through wholly-owned subsidiaries located in North America and Europe. Revenues outside the United States were approximately 40% of total revenues in fiscal year 2023. Our sales and earnings could be adversely affected by a variety of factors resulting from our international operations, including\n● future fluctuations in foreign currency exchange rates;\n● complex regulatory requirements and changes in those requirements;\n● trade protection measures and import or export licensing requirements;\n● multiple jurisdictions and differing tax laws, as well as changes in those laws;\n● restrictions on our ability to repatriate investments and earnings from foreign operations;\n● changes in the political or economic conditions in a country or region, including the actual and potential impact Brexit has on our UK operations;\n● changes in shipping costs; and\n● difficulties in collecting on accounts receivable.\nIf any of these risks materialize, we could face substantial increases in costs, the reduction of profit and the inability to do business.\nWith our commercialization activities outside of the United States, we are subject to the risk of inadvertently conducting activities in a manner that violates the U.S. Foreign Corrupt Practices Act and similar laws. If that occurs, we may be subject to civil or criminal penalties which could have a material adverse effect on our business, financial condition, results of operations and growth prospects.\nWe are subject to the U.S. Foreign Corrupt Practices Act (FCPA), which prohibits corporations and individuals from paying, offering to pay, or authorizing the payment of anything of value to any foreign government official, government staff member, political party, or political candidate in an attempt to obtain or retain business or to otherwise influence a person working in an official capacity. We are also subject to the UK Anti-Bribery Act, which prohibits both domestic and international bribery, as well as bribery across both public and private sectors.\nIn the course of establishing and expanding our commercial operations and seeking regulatory approvals outside of the United States, we will need to establish and expand business relationships with various third parties and we will interact more frequently with foreign officials, including regulatory authorities. Expanded programs to maintain compliance with such laws will be costly and may not be effective. Any interactions with any such parties or individuals where compensation is provided that are found to be in violation of such laws could result in substantial fines and penalties and could materially harm our business. Furthermore, any finding of a violation under one countrys laws may increase the likelihood that we will be prosecuted and be found to have violated another countrys laws. If our business practices outside the United States are found to be in violation of the FCPA, UK Anti-Bribery Act or other similar law, we may be subject to significant civil and criminal penalties which could have a material adverse effect on our financial condition and results of operations.\nRisks Relating to our Common Stock\nOur stock price has been volatile, which could result in substantial losses for investors.\nOur common stock is quoted on the New York Stock Exchange, and there has been historical volatility in the market price of our common stock. The trading price of our common stock has been, and is likely to continue to be, subject to significant fluctuations due to a variety of factors, including:\n● fluctuations in our quarterly operating and earnings per share results;\n● the gain or loss of significant contracts;\n● loss of key personnel;\n● announcements of technological innovations or new products by us or our competitors;\n● delays in the development and introduction of new products;\n● legislative or regulatory changes;\n● general trends in the industries we operate;\n● recommendations and/or changes in estimates by equity and market research analysts;\n● biological or medical discoveries;\n● disputes and/or developments concerning intellectual property, including patents and litigation matters;\n● public concern as to the safety of new technologies;\n● sales of common stock of existing holders;\n● securities class action or other litigation;\n● developments in our relationships with current or future customers and suppliers and;\n● general economic conditions, both in the United States and worldwide.\nIn addition, the stock market in general has experienced extreme price and volume fluctuations that have affected the market price of our common stock, as well as the stock of many companies in our industries. Often, price fluctuations are unrelated to operating performance of the specific companies whose stock is affected.\nIn the past, following periods of volatility in the market price of a companys stock, securities class action litigation has occurred against the issuing company. If we were subject to this type of litigation in the future, we could incur substantial costs and a diversion of our managements attention and resources, each of which could have a material adverse effect on our revenue and earnings. Any adverse determination in this type of litigation could also subject us to significant liabilities.\nBecause we have not and may never pay cash dividends on our common stock, an investor in our common stock may only benefit if it appreciates in value.\nWe currently intend to retain our retained earnings and future earnings, if any, to finance the expansion of our business and may not pay any cash dividends on our common stock in the foreseeable future. As a result, the success of an investment in our common stock may depend entirely upon any future appreciation. There is no guarantee that our common stock will appreciate in value or even maintain the price at which investors purchased their shares.\nIt may be difficult for a third party to acquire us, which could inhibit stockholders from realizing a premium on their stock price.\nOur certificate of incorporation, as amended, and by-laws contain provisions that could have the effect of delaying, deferring or preventing a change in control of us that stockholders may consider favorable or beneficial due to a majority stockholder vote requirement. These provisions could discourage proxy contests and make it more difficult for stockholders to elect directors and take other corporate actions. These provisions could also limit the price that investors might be willing to pay in the future for shares of our common stock. These provisions include advance notice requirements for the submission by stockholders of nominations for election to the board of directors and for proposing matters that can be acted upon by stockholders at a meeting.\nFuture sales of shares of our common stock or the issuance of securities senior to our common stock could adversely affect the trading price of our common stock and our ability to raise funds in new equity offerings.\nWe are not restricted from issuing additional common stock, preferred stock or securities convertible into or exchangeable for common stock. Future sales of a substantial number of our shares of common stock or equity-related securities in the public market or privately, or the perception that such sales could occur, could adversely affect prevailing trading prices of our common stock, and could impair our ability to raise capital through future offerings of equity or equity-related securities. No prediction can be made as to the effect, if any, that future sales of shares of common stock or the availability of shares of common stock for future sale will have on the trading price of our common stock. Item 1B. Unresolved Staff Comments\nNone Item 2. Properties\nThe following are the principal facilities of the Company:\nLeased or Square\nLocation Primary use Segments owned footage\nFarmingdale, NY\n(Note 1) Formerly Clinical laboratory and research Formerly Clinical Labs Leased 43,000\nFarmingdale, NY Manufacturing, research, sales and administrative office Products Owned 22,000\nFarmingdale, NY\n(Note 2) Manufacturing and administrative office Products Owned 36,000\nFarmingdale, NY\n(Note 3) Corporate headquarters and administrative office Products and Other Leased 12,000\nNew York, NY\n(Note 4) Administrative office Other Leased 11,300\nLausen, Switzerland\n(Note 5) Operational headquarters in Europe, including sales and distribution Products Leased 9,626\nNote 1 On October 9, 2015, this lease was amended and extended through March 31, 2027.We are evaluating our continued use of this facility. The square footage shown is per the lease agreement.\nNote 2 On November 27, 2018 we closed on the $6 million purchase of this facility, which was subleased through June 30, 2020.\nNote 3 This lease commenced June 15, 2021 and expires on June 15, 2024.\nNote 4 In June 2017, the lease was extended through June 2028. In July 2022, we sublet 7,200 square feet of this space for the remaining term of the lease, expiring June 2028.\nNote 5 In June 2019, the lease was amended and extended through July 2020 and automatically renews for one year on each anniversary.\nWe believe the current facilities are suitable and adequate for the Companys current operating needs for its Products and Corporate and Other segments and that the production capacity in various locations is sufficient to manage services and product requirements. Item 3. Legal Proceedings\nEnzo Biochem is currently subject to regulatory inquiry from the New York Attorney General and a joint inquiry from the Connecticut and New Jersey Attorneys General. Both inquiries ask questions about the ransomware incident, as well as the corrective actions taken in response. It is not known at this time whether the Attorneys General will seek penalty against the Company. We are unable to evaluate the likelihood of an outcome, favorable or unfavorable, to the Company or to estimate the amount or range of any potential liability, if any, at this time.\nThere is also pending Class Action litigation:\nIn re Enzo Biochem Data Breach Litigation, No. 2:23-cv-04282 (EDNY)\nIn the Eastern District of New York twenty putative class actions have been consolidated alleging various harms stemming from the April 2023 data incident. Interim lead counsel has been appointed and a consolidated complaint is due to be filed on November 13, 2023. The complaints seek to certify a federal class as well as several state subclasses. Based on the individual complaints that were filed, we expect the consolidated complaint to bring various statutory and common law claims including negligence, negligence per se, breach of fiduciary duty, breach of implied contract, breach of the implied covenant of good faith and fair dealing, violation of the New Yorks General Business Law § 349, Invasion of Privacy, violations of the Connecticut Unfair Trade Practices Act, violations of the New Jersey Consumer Fraud Act.\nMaria Sgambati et al., v. Enzo Biochem, Inc., et al., Index No. 619511/2023 (N.Y. Sup. Ct.)\nThis is a putative class action pending in state court alleging various harms stemming from the April 2023 data incident. The complaint seeks to certify a class of New York residents. The complaint brings claims of negligence; negligence per se; breach of implied covenant and good faith and fair dealing; breach of duty; breach of implied contract; and violations of New Yorks Deceptive Acts and Practices § 349. We have filed a motion to stay this action pending the resolution of the Federal Action and the motion remains pending.\nLouis v. Enzo Biochem, Inc. et al., Index No. 653281/2023 (N.Y. Sup. Ct.)\nThis is a putative class action pending in state court alleging various harms stemming from the April 2023 data incident. The complaint seeks to certify a class of New York citizens. The complaint brings claims of for negligence; negligence per se; breach of duty, breach of implied contract; breach of implied covenant of good faith and fair dealing; and violations of New Yorks Deceptive Acts and Practices § 349. We have filed a motion to stay this action pending the resolution of the Federal Action and the motion remains pending.\nA provision has been made in the financial statements for a financial contingency for the above matters based on a reasonable estimate; however, the actual exposure may differ.\nOn or about March 2, 2023, a verified complaint was filed in the Supreme Court of the State of New York, New York County captioned Elazar Rabbani v. Mary Tagliaferri, et al., Index No. 651120/2023. The verified complaint purports to assert causes of action for breach of fiduciary duty and corporate waste under N.Y.B.C.L. § 720, and also seeks an accounting and certain injunctive relief. Plaintiff served a copy of the verified complaint on Enzos agent for service in New York on or about March 13, 2023. On August 4, 2023, defendants moved to dismiss all of the causes of action asserted in the verified complaint. Plaintiff filed an amended complaint on or about October 4, 2023, adding, among other things, an additional cause of action for violation of N.Y.B.C.L. § 626. On October 23, 2023, Defendants filed a reply in further support of their motion to dismiss. On October 24, 2023, Plaintiff sought leave to file an opposition brief. Defendants filed an opposition to that request on October 26, 2023. On October 31, 2023, in response to a question from the Courts law clerk, Defendants reiterated that they had elected to apply their original motion to dismiss to the amended pleading. That same day, Plaintiff indicated his intent to file an opposition to that motion on or before November 6, 2023. The Company cannot predict the outcome of this matter.\nThe Company has brought cases in the United States District Court for the District of Delaware (the Court), alleging patent infringement against various companies. In 2017, the Court ruled that the asserted claims of the 180 and 405 Patents are invalid for nonenablement in cases involving Abbott, Becton Dickinson, Gen-Probe, Hologic, and Roche. That ruling was affirmed by the United States Court of Appeals for the Federal Circuit (Federal Circuit) in June 2019. Enzo subsequently filed a petition for certiorari regarding the invalidity ruling for the 180 and 405 Patents in February 2020; the Supreme Court denied Enzos petition on March 30, 2020.\nThe Company, along with its subsidiary Enzo Life Sciences, Inc., resolved its claims against Roche regarding the 197 Patent before the Court (civil action No. 12 cv-00106) in July 2022. There is currently one case that was originally brought by the Company that is still pending in the Court. In that case, Enzo alleges patent infringement of the 197 patent against Becton Dickinson Defendants. The claims in that case are stayed.\nIn separate inter partes review proceedings before the U.S. Patent and Trademark Office (PTO) involving, among others, Becton Dickinson, certain claims of the 197 Patent were found unpatentable as anticipated or obvious and cancelled by the Patent Trial and Appeals Board (Board). Enzo appealed that decision to the Federal Circuit. On August 16, 2019, the Federal Circuit affirmed the Boards decision, finding that each of the challenged claims is unpatentable. The Company filed a petition for rehearing and rehearing en banc on October 30, 2019, which the Federal Circuit denied on December 4, 2019. The Company filed a petition for certiorari with the Supreme Court on March 3, 2020, which was denied.\nIn April 2019, the Company entered into an agreement with Hologic and Grifols, resolving litigation resulting from four cases originally brought by the Company in the Court. As a result, Enzo dismissed (1) a stayed patent litigation regarding the 180 and 197 Patent against Hologic in the Court; (2) the Consolidated Appeals against Gen-Probe and Hologic resulting from two cases filed in the Court, and (3) the Companys appeal in the litigation involving the 581 Patent that involved both Hologic and Grifols. As a result of the agreement with Hologic, Hologic withdrew from Enzos Federal Circuit appeal of the Boards adverse rulings in the inter partes review proceedings regarding the 197 Patent filed by Hologic and joined by Becton Dickinson mentioned above.\nOn September 2, 2021, the PTO issued a non-final office action in an ex parte reexamination concerning the 197 Patent. In the office action, the PTO rejected certain claims of the 197 Patent under 35 U.S.C. §§ 102 and 103, and for nonstatutory double-patenting. Enzo responded to the office action on January 3, 2022, and the proceeding remains pending. Becton Dickinson requested another ex parte reexamination concerning the 197 patent on July 26, 2022. On September 16, 2022, the PTO ordered that ex parte reexamination as to certain claims of the 197 patent and has not yet issued an office action. Enzo filed a petition to terminate that second reexamination proceeding on November 16, 2022.\nOn November 27, 2020, the Company brought an action in the United States District Court for the Southern District of New York against Harbert Discovery Fund, LP, Harbert Discovery Co-Investment Fund I, LP, Harbert Fund Advisors, Inc., Harbert Management Corp. and Kenan Lucas (together, Harbert). The Company alleged Harbert made false and misleading representations, or omitted to state material facts necessary to make their statements not misleading, in proxy materials they disseminated seeking the election to the Companys Board of Directors at its 2019 Annual Meeting of two candidates they nominated, in violation of Section 14(a) of the 1934 Exchange Act and Rule 14a-9 thereunder. The Company sought damages and injunctive relief. On October 12, 2021, HDF filed five counterclaims against the Company and present and former directors Dr. Elazar Rabbani, Barry W. Weiner, Dr. Bruce A. Hanna, Dov Perlysky, Rebeca Fischer, Dr. Mary Tagliaferri and Dr. Ian B. Walters. HDF claimed the Company made false and misleading representations in proxy materials it disseminated in connection with its 2019 Annual Meeting, in violation of Section 14(a) of the 1934 Exchange Act and Rule 14a-9 thereunder, and that the Companys directors at that time were liable under Section 20(a) of the Exchange Act for the Companys purported misstatements. HDF also claimed that current and former Company directors breached their fiduciary duties by taking four corporate actions: (a) adjourning the 2019 meeting for 25 days; (b) purportedly causing the two Harbert candidates for director, who were elected at the 2019 Meeting, to resign in November 2020; (c) authorizing the November 27, 2020 Lawsuit; and (d) not accepting Dr. Rabbanis resignation as a director in March 2021. On November 10, 2021, the Company and the other counterclaim defendants moved to dismiss HDFs counterclaims. On December 9, 2021, the court granted the motion to dismiss HDFs counterclaims except HDFs Section 14(a) claim against the Company concerning its statement that it intended to delay the 2019 Annual Meeting, and HDFs Section 20(a) and breach of fiduciary duty counterclaims against Dr. Elazar Rabbani, Barry W. Weiner, Dr. Bruce Hanna, Dov Perlysky and Rebecca Fischer with respect to that statement. The Court allowed HDF to move for leave to replead with respect to its dismissed counterclaims. On June 7, 2022, the Court so ordered a stipulation of dismissal with prejudice of the Companys claims against Harbert Discovery Fund, LP, Harbert Discovery Co-Investment Fund I, LP, Harbert Fund Advisors, Inc., Harbert Management Corp., and Kenan Lucas, and HDFs counterclaims against the Company, Dr. Bruce Hanna, Dov Perlysky, Rebecca Fischer, Dr. Ian B. Walters and Dr. Mary Tagliaferri. The only remaining claims were HDFs counterclaims against Dr. Rabbani and Mr. Weiner. HDF asked the Court to dismiss those claims without prejudice. Dr. Rabbani and Mr. Weiner asked the Court to dismiss those counterclaims with prejudice and to allow them to take discovery from HDF, the Company, and possibly others. On December 1, 2022, the court granted HDFs motion for voluntary dismissal without prejudice, denied Dr. Rabbani and Mr. Weiners motion to compel discovery, and directed the Clerk of the Court to close this case.\nOn or about September 26, 2023, James G. Wolf, Individually and as the Trustee of the Wolf Family Charitable Foundation, Barbaranne R. Wolf, Stephen Paul Wolf, and Preston M. Wolf initiated an appraisal action against Enzo Biochem, Inc. in the New York Supreme Court for Suffolk County. Petitioners seek an appraisal of the value of their shares in the Company. The amount of damages sought by the Petitioners is unspecified. The Company will defend itself vigorously in the appraisal action.\nIn our discontinued Clinical Labs operations, third-party payers, including government programs, may decide to deny payment or recoup payments for testing that they contend was improperly billed or not medically necessary, against their coverage determinations, or for which they believe they have otherwise overpaid (including as a result of their own error), and we may be required to refund payments that we received.\nFormer executives arbitration\nThe Company terminated the employment of Elazar Rabbani, Ph.D., the Companys former Chief Executive Officer, effective April 21, 2022. Dr. Rabbani remains a board director of the Company. Dr. Rabbani is a party to an employment agreement with the Company that entitles him to certain termination benefits, including severance pay, acceleration of vesting of share-based compensation, and continuation of benefits. Based on the terms of his employment agreement, the Company estimated and accrued a charge of $2,600 in fiscal year 2022 which is included in Selling, general and administrative expenses. The charge was partially offset by the reversal of bonus accruals. In May 2022, the Company paid Dr. Rabbani $2,123 in severance (the payment constituted taxable income but the Company did not withhold taxes from the payment). In July 2022, the Company paid Dr. Rabbanis income and other withholding taxes of $1,024 related to that payment on Dr. Rabbanis behalf, which was included in prepaid expense and other current assets as of July 31, 2022, as the payment is reimbursable from Dr. Rabbani. Dr. Rabbani disputed, among other things, the Companys decision to not award him a bonus for fiscal year 2021 and the amount of severance that was owed to him under his employment agreement. On July 8, 2022, the Company filed a demand for arbitration with the American Arbitration Association (the AAA) seeking, among other things, a declaration that the Company has fully satisfied its contractual obligations to Dr. Rabbani and seeking the tax withholding reimbursement referenced above. On August 4, 2022, Dr. Rabbani filed counterclaims in the arbitration seeking, among other things, a bonus for fiscal year 2021 and additional severance that he asserts is owed to him. At the parties joint request, the arbitration has been stayed while the parties work towards resolving the matter.\nOn February 25, 2022, Barry Weiner, the Companys co-founder and President, notified the Company that he was terminating his employment as President of the Company for Good Reason as defined in his employment agreement. The Company accepted Mr. Weiners termination, effective April 19, 2022, but disagreed with Mr. Weiners assertion regarding Good Reason. On October 24, 2023, the Company and Mr. Weiner reached an agreement resolving the dispute.\nA provision has been made in the financial statements for these matters based on a reasonable estimate; however, the actual exposure may differ. Item 4. Mine Safety Disclosures\nNot applicable.\nPart II Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nThe common stock of the Company is traded on the New York Stock Exchange (Symbol: ENZ).\nAs of October 27, 2023, the Company had approximately 720 stockholders of record of its common stock.\nThe Company has not paid a cash dividend on its common stock and intends to continue a policy of retaining earnings to finance and build its operations. Accordingly, the Company does not anticipate the payment of cash dividends to holders of common stock in the foreseeable future. Item 6. [Reserved]\nNot applicable, reserved. Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations\nSee in this Form 10-K for the fiscal year ended July 31, 2023 Part 1. Item 1. Business, for Forward Looking Cautionary Statements.\nThe Companys Enzo Life Sciences Products reporting unit, as described below, is a global company affected by different US and global economic conditions which are included in Item 1A, Risk Factors. Our company evolved out of our core competence: the use of nucleic acids as informational molecules and the use of compounds for immune modulation. Costs excluded from this reporting unit and reported as Corporate and Other consist of corporate general and administrative costs which are not allocable to the reportable segment. Below is a brief description of this operating segment (see Note 18 in the Notes to Consolidated Financial Statements).\nEnzo Life Sciences Products manufactures, develops and markets products and tools to life sciences, drug development and clinical research customers world-wide and has amassed a large patent and technology portfolio. Enzo Life Sciences, Inc. is a recognized leader in labeling and detection technologies across research and diagnostic markets. Our strong portfolio of proteins, antibodies, peptides, small molecules, labeling probes, dyes and kits provides life science researchers tools for target identification/validation, high content analysis, gene expression analysis, nucleic acid detection, protein biochemistry and detection, and cellular analysis. We are globally recognized and acknowledged as a leader in manufacturing, in-licensing, and commercialization of over 20,000 products. Our strategic focus is directed to innovative high quality research reagents and kits in the primary key research areas of genomics, immunohistochemistry, immunoassays, cellular analysis, and small molecule chemistry. The segment is an established source for a comprehensive panel of products to scientific experts in the fields of cancer, cardiovascular disease, neurological disorders, diabetes and obesity, endocrine disorders, infectious and autoimmune disease, hepatotoxicity and renal injury. During the fiscal years ended July 31, 2023 and 2022, the Products segment generated revenues of $31.1 million and $32.6 million, respectively\nDiscontinued operations - Labcorp Asset Purchase Agreement\nEffective July 24, 2023, we completed the sale of certain assets used in the operation of Enzo Clinical Labs and the assignment of certain clinical lab liabilities for an aggregate purchase price of $113.25 million in cash, subject to customary closing adjustments. In accordance with the sale, we ceased our clinical services operations. As a consequence of the sale, for fiscal years 2023 and 2022 we have classified as discontinued operations all income and expenses attributable to the clinical services business, the gain from the sale of the clinical services assets, and the income tax expense attributed to the sale of the clinical services assets. Excluded from the sale of the clinical services assets were its cash and accounts receivable.\nDiscontinued Operations Carve Out and Expense Allocations\nFor fiscal years ended July 31, 2023 and 2022, results from operations for our clinical services business are classified as discontinued operations. The carve out of the discontinued operations were prepared in accordance with the SECs carve out rules under ASC 205-20 Discontinued Operations and are derived from identifying and carving out the specific assets, liabilities, operating expenses and interest expense associated with the clinical services businesss operations. Certain administrative and overhead expenses, including personnel expenses, which were incurred by us (for which the discontinued operation benefited from such resources) are allocated out of the discontinued operations based upon the identification of those allocated expenses and to the continuing operations.\nFor fiscal years ended July 31, 2023 and 2022, we allocated $2.1 million and $1.2 million, respectively, of selling, general and administrative expenses from the discontinued operations to the continuing operations in the accompanying results of operations tables and explanations.\nRansomware attack\nIn April 2023, the Company experienced a ransomware attack that impacted certain critical information technology systems. In response, we promptly deployed containment measures, including disconnecting our systems from the internet, launching an investigation with assistance from third-party cybersecurity experts, and notifying law enforcement. We adhered to our disaster recovery plan, which enabled us to maintain operations throughout the incident response process. The Companys facilities remained open, and we continued to provide services to patients and partners. We later became aware that certain data, including names, test information, and Social Security numbers, was accessed, and in some instances, exfiltrated from the Companys information technology systems as part of this incident. The investigation identified unauthorized access to or acquisition of clinical test information of approximately 2,470,000 individuals. The Social Security numbers of approximately 600,000 of these individuals may also have been involved. Additionally, the Company has determined that some employees information may have been involved. The Company has provided notice to the individuals whose information may have been involved, as well as to regulatory authorities, in accordance with applicable law. The Company has incurred, and may continue to incur, related expenses. The Companys cybersecurity insurance carrier has indicated that it will cover up to $3 million of the remediation costs related to this incident and pay all service providers directly from the policy. As of July 31, 2023, the insurance carrier has assumed approximately $2.3 million of the remediation costs.\nThe Company remains subject to risks and uncertainties as a result of the incident, including as a result of the data that was accessed or exfiltrated from the Companys network as noted above. Additionally, security and privacy incidents have led to, and may continue to lead to, additional regulatory scrutiny and class action litigation exposure. We are in the process of evaluating the full scope of the costs and related impacts of this incident. See Note 17 of the consolidated financial statements for litigation in connection with this incident.\nSale of 10% Convertible Debentures and Warrants\nThe Company entered into a Securities Purchase Agreement on May 19, 2023 for 10% Original Issue Discount Secured Convertible Debentures with an aggregate principal amount of $7,608,696 with a conversion price of $3.01 per share and (ii) warrants to purchase up to 1,000,000 shares of the Companys common stock, par value $0.01 per share for an exercise price of $2.31 per share, for a total purchase price of $7,000,000. The Purchase Agreement contains customary representations, warranties and covenants. We prepaid $4,000,000 of principal prior to July 31, 2023. See Note 9 for additional information.\nResults of Operations from Continuing Operations\nFiscal year ended July 31, 2023 compared to July 31, 2022\n(in $000s)\nComparative Financial Data from Continuing Operations for the Fiscal Years Ended July 31,\nFavorable\n(Unfavorable) %\nChange\nRevenues $ 31,061 $ 32,643 $ (1,582 ) (5 )\nOperating costs and expenses:\nCost of revenues 17,866 19,213 1,347\nCost of revenues - inventory provision 1,629 - (1,629 ) **\nResearch and development 3,904 2,438 (1,466 ) (60 )\nSelling, general and administrative 27,202 23,084 (4,118 ) (18 )\nLegal and related expenses 5,196 5,435\nLegal settlement - (500 ) (500 ) **\nTotal operating costs and expenses 55,797 49,670 (6,127 ) (12 )\nOperating loss (24,736 ) (17,027 ) (7,709 ) (45 )\nOther income (expense):\nInterest (1,122 ) (1,300 ) **\nFair value adjustment (824 ) - (824 ) **\nOther (1,268 ) 1,648 **\nForeign exchange gain (loss) 1,280 (2,222 ) 3,502 **\nLoss before income taxes $ (25,022 ) $ (20,339 ) $ (4,683 ) (23 )\n** not meaningful\nConsolidated Results:\nThe 2023 period and the 2022 period refer to the fiscal year ended July 31, 2023 and July 31, 2022, respectively.\nProduct revenues were $31.1 million in the 2023 period and $32.6 million in the 2022 period, a decrease of approximately $1.6 million or 5%. The 2022 period includes a $2.8 million bulk sale of a GMP reagent to a large industrial customer in the US. Excluding the bulk sale, in the 2023 period there was an approximate $1.6 million increase in revenues in the US market, partially offset by a $0.4 million decrease in revenues in the European and Asia Pacific markets.\nThe cost of Product revenues was $17.9 million in the 2023 period and $19.2 million in the 2022 period, a decrease of $1.3 million or 7%. The gross profit margin on Products was approximately 42% in the 2023 period and 41% in the 2022 period. During the 2022 period we made a large bulk sale of a GMP reagent which had a significantly positive impact on that periods profit margin. Without the bulk sale, the gross margin would have been 38.1% in the 2022 period. The 2023 period gross profit was positively impacted by a more profitable mix of products sold.\nThe cost of Product revenues - inventory provision was $1.6 million for finished goods of high throughput machines we intended to sell to laboratory customers which we fully reserved in the 2023 period. This expense represents 5.2% of the periods products revenues.\nResearch and development expenses were $3.9 million in the 2023 period and $2.4 million in the 2022 period, an increase of $1.5 million or 60%, due to increased investment in R&D resources and materials consumed and patent related costs in the Products segment.\nSelling, general and administrative expenses were $27.2 million during the 2023 period versus $23.1 million during the 2022 period, an increase of $4.1 million or 18%. The Corporate and Other segment expense increased $4.3 million during the 2023 period due to professional fees related to strategic initiatives, severance provisions related to former officers, and greater share based compensation expense. The Products segment expense in the 2023 period decreased $0.2 million compared to 2022.\nLegal and related expenses were $5.2 million during the 2023 period and $5.4 million in the 2022 period. During the 2023 period, we required significant legal expertise and assistance associated with our strategic initiatives, the Credit Facility, the ransomware attack, the convertible debentures, and matters related to two former senior executives arbitration, which are ongoing. The 2023 period expense is net of a reimbursement of $0.8 million under the Companys directors and officers insurance policy. During the 2022 period, we incurred legal expenses associated with strategic initiatives, and corporate employment matters related to two former executives arbitration, which are ongoing.\nLegal settlement income was $0.5 million in the 2022 period. The Company as plaintiff finalized and executed a settlement agreement with Roche.\nInterest (expense) income, net was ($1.1) million in the 2023 period and $0.2 million in the 2022 period, an unfavorable variance of $1.3 million. The 2023 periods interest expense, including set up fees and penalties, was incurred on the 10% convertible debentures issued in May 2023, and on the Credit Facility and the mortgage, both of which were paid off at the APA closing. Some interest income was earned on available cash in a money market fund and will continue to be earned on the net proceeds from the APA, which are on deposit in a money market fund. In the 2022 period, we earned interest on marketable securities in bond funds and incurred interest expense primarily on the mortgage.\nWe recorded a fair value adjustment charge of approximately $0.8 million for the 10% convertible debentures based on their fair value as of July 31, 2023.\nOther income (expense) in the 2023 period was $0.4 million versus ($1.2) million in the 2022 period, a favorable variance of approximately $1.6 million. During the 2023 period we sublet a portion of our office space. During the 2022 period, the primary component of the expense was realized losses on marketable securities in bond funds liquidated in full by the end of that period.\nThe foreign exchange gain (loss) recognized by the Products segment during the 2023 period was $1.3 million compared to ($2.2) million in the 2022 period, a favorable variance of $3.5 million. The 2023 period revaluation gain was due to the significant appreciation of the British pound and Swiss franc versus the U.S. dollar as of the end of the 2023 period compared to its start. The revaluation loss in the 2022 period was due to the depreciation of the British pound and Swiss franc versus the U.S. dollar as of the end of that period compared to its start as a result of actions by the US Federal Reserve to begin raising interest rates.\nLiquidity and Capital Resources\nOur aggregate cash and cash equivalents and restricted cash as of July 31, 2023 and 2022 was $83.4 million and $22.6 million, respectively. Our working capital was $58.5 million and $29.8 million as of July 31, 2023 and 2022, respectively. The increase of $60.8 million in our cash and cash equivalents and restricted cash balance for the year ended July 31, 2023 was principally due to the completed sale of certain assets used in the operation of Enzo Clinical Labs to Labcorp in July 2023, partially offset by cash used in operations and the repayment of debt.\nNet cash used in operating activities during the 2023 period was $37.0 million, compared to $16.6 million during the 2022 period, an unfavorable variance of $20.4 million. The net cash used in the 2023 period was due to the year over year increase in net income of $38.5 million offset by the gain on the Labcorp APA of $82.6 million, a decrease in non-cash expense adjustments of $1.7 million, and a cash positive net change in operating assets and operating liabilities year over year amounting to $25.4 million.\nNet cash provided by investing activities during the 2023 period was approximately $99.0 million as compared to $25.2 million in the 2022 period. In the 2023 period, we received net cash proceeds of $101.7 million from the Labcorp APA. In the 2022 period, we sold our investments in bond funds for proceeds of $28.7 million. Capital expenditures in the 2023 and 2022 periods amounted to $2.8 million and $3.5 million, respectively.\nCash used in financing activities in the 2023 period amounted to $1.1 million, net. In the 2023 period, we borrowed and repaid $16.8 million under the Revolving Credit facility, issued 10% convertible debentures due in May 2024 and warrants for $7.0 million in cash and repaid $4.0 million of that, and made principal payments and repaid the full balance of a mortgage totaling $4.1 million. See below for further details regarding the revolving loan, mortgage and convertible debentures. We issued common stock through the ATM Sales Agreement resulting in proceeds of approximately $0.4 million. In the 2022 period we used approximated $0.2 million for payments related to a mortgage and finance leases.\nIn March 2023, the Company entered into a Revolving Loan and Security Agreement with Gemino Healthcare Finance, LLC d/b/a SLR Healthcare ABL as lender specializing in direct lending to middle-market companies in the healthcare sector. The credit facility provided for a maximum $8 million revolving line of credit based on the Companys eligible accounts receivable. The annual interest rate was equal to the 90 day term SOFR rate plus 5.5%. The line of credit would terminate one year from closing and unused line fees and early prepayment penalties would apply. We repaid this loan in July 2023 using proceeds from the Labcorp transaction and paid a $240 prepayment penalty.\nIn connection with the purchase of a building in Farmingdale, NY in November 2018, a wholly-owned subsidiary (the mortgagor subsidiary) of the Company entered into a Fee Mortgage and Security Agreement (the mortgage agreement) with Citibank, N.A. (the mortgagee). The mortgage agreement provided for a loan of $4,500 for a term of 10 years, bore a fixed interest rate of 5.09% per annum and required monthly mortgage payments of principal and interest of $30. The Companys obligations under the mortgage agreement were secured by the building and by a $1,000 cash collateral deposit with the mortgagee as additional security. In July 2023, we repaid in full the mortgage balance of $3,834 without prepayment penalty. The cash collateral deposit was released in August 2023 and the $1,000 collateral deposit is included in prepaid and other assets as of July 31, 2023. At July 31, 2022, the balance owed by the subsidiary under the mortgage agreement was $3,980. The restricted cash of $1,000 was included in other assets as of July 31, 2022.\nOn May 19, 2023, the Company entered into a Securities Purchase Agreement (the Purchase Agreement) with each of the purchasers that are parties thereto (each, including its successors and assigns, a Purchaser and collectively, the Purchasers) and JGB Collateral, LLC, a Delaware limited liability company, as collateral agent for the Purchasers (the Agent). Pursuant to the Purchase Agreement, the Company agreed to sell to the Purchasers (i) 10% Original Issue Discount Secured Convertible Debentures (the Debentures) with an aggregate principal amount of $7,608 and (ii) warrants to purchase up to 1,000,000 shares of the Companys common stock, par value $0.01 per share (the Common Stock), for an exercise price of $2.31 per share, the average of the three (3) daily volume weighted average prices of the Common Stock as defined in the Purchase Agreement (VWAP) prior to the closing date (the Warrants), subject to adjustments as set forth in the Warrants, for a total purchase price of $7,000. The Purchase Agreement contains customary representations, warranties and covenants. The transactions contemplated by the Purchase Agreement were consummated on May 19, 2023. Pursuant to ASC 825, Fair Value Options, the Company made an irrevocable election at the time of issuance to report the Debentures at fair value with changes in fair value recorded through the Companys consolidated statements of operations as other income (expense) in each reporting period. The Debentures bear interest at a rate of 10% per annum (which interest rate is increased to 18% per annum five days after the occurrence and continuance of an Event of Default (as defined in the Debentures)), have a maturity date of May 20, 2024 and are convertible, at any time after their issuance date at the option of the Purchasers, into shares of Common Stock at a conversion price equal to $3.01 per share (the Conversion Price), subject to adjustment as set forth in the Debentures. Following the consummation of the Companys sale of certain assets and assignment of certain liabilities of Enzo Clinical Labs, Inc., to Labcorp pursuant to the Asset Purchase Agreement, dated March 16, 2023 (the Asset Sale), the Company shall either, at the option of the Company upon written notice delivered to the Purchasers within three (3) trading days after the consummation of the Asset Sale, (i) prepay $4,000 of the outstanding principal amount of the Debentures (to be applied pro rata among the outstanding Debentures based on the relative outstanding principal balance of each Debenture) or (ii) deposit $4,000 in cash, as collateral for the Companys obligations, into a deposit account subject to a deposit account control agreement, among the Company, the depository bank and the Agent and otherwise acceptable to Agent (in its sole absolute discretion) in form and substance. The Company prepaid $4,000 of the outstanding principal amount prior to July 31, 2023.\nLabcorp Asset Purchase Agreement\nWe have indemnification obligations to Labcorp Corporation of America Holdings (Labcorp) under the Asset Purchase Agreement that may require us to make future payments to Labcorp and other related persons for any damages incurred by Labcorp or such related persons as a result of any breaches of our representations, warranties, covenants or agreements contained in the Asset Purchase Agreement, or arising from the Retained Liabilities (as such term is defined in the Asset Purchase Agreement) or certain third-party claims specified in the Asset Purchase Agreement. Generally, our representations and warranties survive for a period of 15 months from the closing date, which was July 24, 2023, other than certain fundamental representations which survive until the expiration of the applicable statute of limitations. There is a limited indemnification cap with respect to a majority of the Companys indemnification obligations under the Asset Purchase Agreement with the exception of claims for actual fraud, the breach of any fundamental representations and certain other items, which have a larger indemnification cap (e.g., the purchase price). Pursuant to the terms of the Asset Purchase Agreement, we, Labcorp, and an escrow agent entered into an Escrow Agreement at closing, pursuant to which Labcorp deposited $5 million of the aggregate purchase price of the clinical service business into an escrow account established with the Escrow Agent in order to satisfy, in whole or in part, certain of our indemnity obligations under the Asset Purchase Agreement. If, on the 15th month anniversary of the closing date, there are funds remaining in the escrow account, the Escrow Agent will release any funds remaining in the escrow account to us minus any amounts being reserved for escrow claims asserted by Labcorp prior to such date. Upon the resolution of any pending escrow claims, the Escrow Agent will, within two business days of receipt of joint instructions or a final order from a court (as described in the Escrow Agreement) disburse such reserved amount to the parties entitled to such funds. Through the date of this filing, no disbursements have been made out of the escrow funds.\nGeneral\nThe Company is a defendant in a number of legal matters, including class action lawsuits related to the ransomware attack of its information technology systems in April 2023. We face a significant risk due to ongoing litigation that has the potential to result in future financial obligations, adversely impacting the companys business and profitability.\nManagement is not aware of any other trends, events or uncertainties that have or are reasonably likely to have a material negative impact upon our(i) short-term or long-term liquidity, or (ii) net sales or income from continuing operations. Our business is subject to seasonal variations thereby impacting our liquidity and working capital during the course of our fiscal year. To the extent that we do not generate sufficient cash from operations, our cash balances will decline. We may also use our cash to explore and/or acquire new product technologies, applications, product line extensions, or other new business opportunities. In the event that our available cash is insufficient to support such initiatives, we may need to incur indebtedness or issue Common Stock to finance plans for growth. Volatility in the credit markets and the liquidity of major financial institutions may have an adverse effect on our ability to fund our business strategy through borrowings, under either existing or newly created instruments in the public or private markets on terms that we believe to be reasonable, if at all.\nEffect of New Accounting Pronouncements\nRecently Adopted Accounting Pronouncements\nIn August 2020, the Financial Accounting Standards Board (FASB) issued Accounting Standards Update (ASU) No. 2020-06 Accounting for Convertible Instruments and Contracts in an Entitys Own Equity (Subtopic 470-20). The amendments in the ASU simplify the settlement assessment by removing requirements to (1) to consider whether the contract would be settled in registered shares, (2) to consider whether collateral is required to be posted, and (3) to assess shareholder rights. The amendments require instruments that are required to be classified as an asset or liability to measured subsequently at fair value, with changed reported in earnings and disclosed in the financial statements. The amendments improve the consistency of EPS calculations by amending the guidance to align the diluted EPS calculation for convertible instruments by requiring that an entity use the if-converted method rather than the treasury stock method. The amendments also require that the effect of potential share settlement be included in the diluted EPS calculation when an instrument may be settled in cash or shares. Until the issuance of the Debentures, the Company had no instruments affected by ASU 2020-06. We adopted the amendments in this ASU effective with the issuance of the Debentures in the fiscal quarter ended July 31, 2023, which did not have a material impact on our financial position or results of operations.\nPronouncements Issued but Not Yet Adopted\nIn June 2016, FASB issued ASU No. 2016-13 Financial Instruments - Credit Losses (Topic 326). This standard changes the impairment model for most financial instruments, including trade receivables, from an incurred loss method to a new forward-looking approach, based on expected losses. The estimate of expected credit losses will require entities to incorporate considerations of historical information, current information and reasonable and supportable forecasts. Adoption of this standard is required for our annual and interim periods beginning August 1, 2023 and must be adopted using a modified retrospective transition approach. We do not expect the impact of the adoption of this standard on our results of operations, financial position and cash flows to be material.\nWe reviewed all other recently issued accounting pronouncements and have concluded they are not applicable or not expected to be significant to the accounting for our operations.\nCritical Accounting Policies and Estimates\nGeneral\nThe Companys discussion and analysis of its financial condition and results of operations are based upon Enzo Biochem, Inc.s consolidated financial statements, which have been prepared in accordance with accounting principles generally accepted in the United States. The preparation of these financial statements requires the Company to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues and expenses. These estimates and judgments also affect related disclosure of contingent assets and liabilities.\nOn an on-going basis, we evaluate our estimates, including those related to contractual expense, allowance for uncollectible accounts, inventory, and income taxes. The Company bases its estimates on experience and on various other assumptions that are believed to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Actual results may differ from these estimates under different assumptions or conditions.\nContingencies\nContingencies are evaluated and a liability is recorded when the matter is both probable and reasonably estimable. Gain contingencies are evaluated and not recognized until the gain is realizable or realized.\nProduct revenues\nProducts revenues consist of the sale of single-use products used in the identification of genomic information and are recognized at a point in time following the transfer of control of such products to the customer, which generally occurs upon shipment. Payment terms for shipments to end-user and distributor customers may range from 30 to 90 days. Any claims for credit or return of goods may be made generally within 30 days of receipt. Revenues are reduced to reflect estimated credits and returns, although historically these adjustments have not been material. Taxes collected from customers relating to product sales and remitted to governmental authorities are excluded from revenue. Amounts billed to customers for shipping and handling are included in revenue, while the related shipping and handling costs are reflected in cost of products.\nAccounts Receivable\nAccounts receivable are reported at realizable value, net of allowances for doubtful accounts, which is estimated and recorded in the period of the related revenue.\nAs of July 31, 2023 and 2022, Products accounts receivable, net were $4,808 and $4,762, respectively. As of July 31, 2023 and 2022, these totals include foreign receivables, net of $1,277 and $1,142, respectively. As of July 31, 2021, Products accounts receivable, net were $4,182, and include foreign receivables, net of approximately $1,400.\nIncome Taxes\nThe Company accounts for income taxes under the liability method of accounting for income taxes. Under the liability method, deferred tax assets and liabilities are recognized for the future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases. The liability method requires that any tax benefits recognized for net operating loss carry forwards and other items be reduced by a valuation allowance where it is not more likely than not the benefits will be realized in the foreseeable future. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. Under the liability method, the effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date. It is the Companys policy to provide for uncertain tax positions, if any, and the related interest and penalties based upon managements assessment of whether a tax benefit is more likely than not to be sustained upon examination by tax authorities. To the extent the Company prevails in matters for which a liability for an unrecognized tax benefit is established or is required to pay amounts in excess of the liability, the Companys effective tax rate in a given financial statement period may be affected.\nInventory\nThe Company values inventory at the lower of cost (first-in, first-out) or net realizable value. Work-in-process and finished goods inventories consist of material, labor, and manufacturing overhead. Write downs of inventories to net realizable value are based on a review of inventory quantities on hand and estimated sales forecasts based on sales history and anticipated future demand. Unanticipated changes in demand could have a significant impact on the value of our inventory and require additional write downs of inventory which would impact our results of operations.\nLong-Lived Assets\nThe Company reviews the recoverability of the carrying value of long-lived depreciable assets of an asset or asset group for impairment if indicators of potential impairment exist. Should indicators of impairment exist, the carrying values of the depreciable assets are evaluated in relation to the operating performance and future undiscounted cash flows of an asset or asset group. The net book value of the depreciable long lived asset is adjusted to fair value if its expected future undiscounted cash flow is less than its book value.\nDuring fiscal years 2023 and 2022 there was no impairment of depreciable long-lived assets used in continuing operations. During the fiscal year ended July 31, 2022, all intangible assets, which were finite lived, became fully amortized. Item 7A.\nNot applicable. Item 8. Financial Statements and Supplementary Data\nThe response to this item is submitted in a separate section of this report. See Item 15(a) (1) and (2). Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosure\nNone. Item 9A. Controls and Procedures\n1. Disclosure Controls and Procedures\nWe maintain disclosure controls and procedures (Disclosure Controls) within the meaning of Rules 13a-15(e) and 15d-15(e) of the Securities Exchange Act of 1934, as amended, or the Exchange Act. Our Disclosure Controls are designed to ensure that information required to be disclosed by us in the reports we file or submit under the Exchange Act, such as this Annual Report on Form 10-K, is recorded, processed, summarized and reported within the time periods specified in the Securities and Exchange Commissions rules and forms. Our Disclosure Controls are also designed to ensure that such information is accumulated and communicated to our management, including our principal executive officer and principal financial officer, as appropriate, to allow timely decisions regarding required disclosure. In designing and evaluating our Disclosure Controls, management recognized that any controls and procedures, no matter how well designed and operated, can provide only reasonable assurance of achieving the desired control objectives, and management necessarily applied its judgment in evaluating and implementing possible controls and procedures.\nAs of the end of the period covered by this Annual Report on Form 10-K, we evaluated the effectiveness of the design and operation of our Disclosure Controls, which was done under the supervision and with the participation of our management, including our principal executive officer and principal financial officer. Based on the evaluation of our Disclosure Controls, as a result of the material weakness identified below, our principal executive officer and principal financial officer have concluded that, as of July 31, 2023, our Disclosure Controls were not effective to ensure that information required to be disclosed by us in the reports we file or submit under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in the SECs rules and forms and is accumulated and communicated to our management, including our principal executive officer and principal financial officer, as appropriate to allow timely decisions regarding required disclosure.\n2. Change in Internal Control over Financial Reporting\nThere were no changes in our internal control over financial reporting that occurred during the year ended July 31, 2023, other than the discussion below, that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\n3. Managements Report on Internal Control Over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting. Internal control over financial reporting is defined in Rules 13a-15(f) and 15d-15(f) promulgated under the Exchange Act as a process designed by, or under the supervision of, a companys principal executive and principal financial officers and effected by the companys board of directors, management and other personnel, to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with U.S. generally accepted accounting principles. Our internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of our assets; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that our receipts and expenditures are being made only in accordance with authorizations of our management and directors; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of our assets that could have a material effect of our consolidated financial statements.\nThere are inherent limitations on the effectiveness of any system of internal controls and procedures, including the possibility of human error and the circumvention or overriding of the controls and procedures. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies and procedures may deteriorate. Accordingly, even effective internal controls and procedures can only provide reasonable assurance of achieving their control objectives.\nAs previously disclosed on Form 8-Ks dated April 13, 2023, and May 30, 2023, the Company experienced a ransomware attack that impacted certain critical information technology systems. In response, the Company promptly deployed containment measures, including disconnecting its systems from the internet, launching an investigation with assistance from third-party cybersecurity experts, and notifying law enforcement. The Company adhered to its disaster recovery plan, which enabled it to substantially maintain operations throughout the incident response process.\nAs a result of the ransomware attack and the subsequent investigation, the Company determined a material weakness existed that impaired the Companys ability to assure that standard systems and accounting processes could operate effectively. As a result, a reasonable possibility exists that a material misstatement of the Companys annual or interim financial statements would not be prevented or detected and corrected in a timely manner. The following is a description of the material weakness identified:\nControl Environment, Risk Assessment, Information and Communication, and Control Activities\nWe did not maintain effective internal control related to our control environment, risk assessment, information and communication, and control activities:\n● In April 2023, we became aware that we were exposed to a ransomware attack in our Information Technology environment which interrupted systems and affected operations. The effect of these circumstances significantly impacted the following:\no our ability to access and reinstate our financial systems for an extended period to a new normal state of operation;\no the need to rebuild our financial information from backups as a result of the ransomware incident;\no additional workload associated with process workflows that were previously automated but were manually performed as a result of the ransomware attack.\n● We were required to supplement resources and as a result, did not adequately perform in a timely manner the following:\no assessment, redesign and timely evaluation of performance of controls over financial reporting risks as a result of existing IT circumstances; and\no generate real time information across the organization to allow the finance department to perform timely application of controls; and\no Internal controls over financial reporting related to the recording and processing of revenue transactions could not be completed timely using standard methods due to the limitations of access to data.\nManagement began remediation measures during and after the April 30, 2023 period end which were substantially implemented by July 31, 2023. During the fourth quarter of fiscal year ended July 31, 2023, evaluation of certain controls effectiveness could not be performed according to the typical frequency or sufficient evidence of control performance was not available for testing due to the cyber incident.\nManagement assessed the effectiveness of our internal control over financial reporting as of July 31, 2023. In making this assessment, management used the criteria established in Internal Control-Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). Based on this assessment, management has concluded that, as of July 31, 2023, our internal control over financial reporting was not effective because the fourth quarter included timeframes during which specific data was not available for testing.\n4. Report of Independent Registered Accounting Firm\nNot applicable. Item 9B. Other Information\nNone\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNone\nPART III Item 10. Directors, Executive Officers and Corporate Governance\nThe information required under this item will be set forth in the Companys proxy statement to be filed with the Securities and Exchange Commission on or before November 28, 2023 and is incorporated herein by reference. Item 11. Executive Compensation\nThe information required under this item will be set forth in the Companys proxy statement to be filed with the Securities and Exchange Commission on or before November 28, 2023 and is incorporated herein by reference. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe information required under this item will be set forth in the Companys proxy statement to be filed with the Securities and Exchange Commission on or before November 28, 2023 and is incorporated herein by reference. Item 13. Certain Relationships and Related Transactions, and Director Independence\nThe information required under this item will be set forth in the Companys proxy statement to be filed with the Securities and Exchange Commission on or before November 28, 2023 and is incorporated herein by reference. Item 14. Principal Accountant Fees and Services\nThe information required under this item will be set forth in the Companys proxy statement expected to be filed with the Securities and Exchange Commission on or before November 28, 2023 and is incorporated herein by reference.\nPART IV Item 15. Exhibits, Financial Statement Schedules\n(a) (1) Consolidated Financial Statements\nConsolidated Balance Sheets - July 31, 2023 and 2022\nConsolidated Statements of Operations - Years ended July 31, 2023 and 2022\nConsolidated Statements of Comprehensive Income (Loss) - Years ended July 31, 2023 and 2022\nConsolidated Statements of Stockholders Equity - Years ended July 31, 2023 and 2022\nConsolidated Statements of Cash Flows - Years ended July 31, 2023 and 2022\nNotes to Consolidated Financial Statements\n(2) Financial Statement Schedule\nSchedule II - Valuation and Qualifying Accounts S-1\nAll other schedules have been omitted because the required information is included in the consolidated financial statements or the notes thereto or because they are not required.\n(3) Exhibits\nThe following documents are filed as Exhibits to this Annual Report on Form 10-K:\nExhibit No.\nDescription\n3(a)\nRestated Certificate of Incorporation (1)\n3(b)\nAmended and restated Bylaws (16)\n4.1*\nDescription of Capital Stock\n10 (a)\nLease agreement with Pari Management (2)\n10 (b)\nAmendment No. 1 to Amended and Restated Employment Agreement with Elazar Rabbani (3)\n10 (c)\nAmendment No. 1 to Amended and Restated Employment Agreement with Barry Weiner (3)\n10 (d)\nAmendment of Lease with Pari Management (4)\n10 (e)\nSettlement Release Agreement between the Company and Roche Diagnostics GmbH and Roche Molecular Systems Inc. (5)\n10 (f)\nSettlement Release Agreement between the Company and Hologic, Inc., Grifolds, S.A. and Grifolds Diagnostic Solutions Inc. (6)\n10 (g)\nFee and Leasehold Mortgage and Security Agreement from the Town of Babylon Industrial Development Agency and Enzo Realty II, LLC, to Citibank, N.A. (7)\n10 (h)\nAmended and Restated 2011 Incentive Plan (8)\n10 (i)\nEmployment agreement for Hamid Erfanian, CEO (9)\n10 (j)\nCooperation agreement by and among Enzo Biochem, Inc. and the Radoff Parties (10)\n10 (k)\nFirst Amended and Restated Employment Agreement between Enzo Biochem, Inc. and Kara Cannon, effective as of October 20, 2022 (11)\n10 (l)\nSecond Amended and Restated Employment Agreement between Enzo Biochem, Inc. and Hamid Erfanian, effective as of October 20, 2022 (11)\n10 (m)\nAsset Purchase Agreement, dated as of March 16, 2023, by and among Laboratory Corporation of America Holdings, Enzo Clinical Labs, Inc. and Enzo Biochem, Inc. (12)\n10 (n)\nCredit Agreement, dated as of March 31, 2023, by and among Enzo Clinical Labs, Inc., Enzo Life Sciences, Inc., Gemino Healthcare Finance, LLC d/b/a SLR Healthcare ABL, Enzo Biochem, Inc. and certain other parties thereto. (13)\n10 (o)\nForm of Debenture (14)\n10 (p)\nForm of Warrant (14)\n10 (q)\nSecurities Purchase Agreement, dated May 19, 2023, by and among Enzo Biochem, Inc., the purchasers named therein, and JGB Collateral, LLC. (14)\n10 (r)\nRegistration Rights Agreement, dated May 19, 2023, by and among Enzo Biochem, Inc. and the purchasers named therein. (14)\n10 (s)\nSecurity Agreement, dated May 19, 2023, by and among Enzo Biochem, Inc., each of Enzo Biochem, Inc.s specified subsidiaries named therein, the purchasers named therein and JGB Collateral, LLC. (14)\n10 (t)\nForm of Subsidiary Guarantee (14)\n10 (u)\nAmendment No. 1 to Asset Purchase Agreement, dated as of July 3, 2023, by and among Enzo Biochem, Inc., Enzo Clinical Labs, Inc., and Laboratory Corporation of America Holdings. (15)\n10 (v)\nSublease agreement between Enzo Biochem, Inc. and Siemens Corporation (17)\n10 (w)*\nAmendment Agreement by and among JGB Capital, LP, JGB (Cayman) Sussex Ltd., Enzo Biochem, Inc. and JGB Collateral LLC\n10 (x)*\nSeparation Agreement and General Release between Hamid Erfanian and Enzo Biochem, Inc.\n10 (y)*\nSettlement Agreement between Barry Weiner, Shahla Weiner, Roya Weiner, and Jonathan Weiner and Enzo Biochem, Inc., Mary Tagliaferri, Ian Walters, Brad Radoff, and Hamid Erfanian\n14 (a)\nCode of Ethics (11)\n21*\nList of subsidiaries of the Company\n23.1*\nConsent of Independent Registered Public Accounting Firm\n31 (a)*\nCertification of CEO Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n(b)*\nCertification of CFO Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n32 (a)*\nCertification of CEO Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n32 (b)*\nCertification of CFO Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\n97.1*\nClawback Policy\n101.INS*\nInline XBRL Instance Document\n101.SCH*\nInline XBRL Taxonomy Extension Schema Document.\n101.CAL*\nInline XBRL Taxonomy Extension Calculation Linkbase Document.\n101.DEF*\nInline XBRL Taxonomy Extension Definition Linkbase Document.\n101.LAB*\nInline XBRL Taxonomy Extension Label Linkbase Document.\n101.PRE*\nInline XBRL Taxonomy Extension Presentation Linkbase Document.\n104*\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101).\nNotes to exhibits\n* Filed herewith\n** XBRL (Extensible Business Reporting Language) information is being furnished and not filed for purposes of Sections 11 and 12 of the Securities Act of 1933 and Section 18 of the Securities Exchange Act of 1934.\n(1) This exhibit was filed with the Companys Current Report on Form 8-K on April 27, 2022 and is incorporated herein by reference\n(2) This exhibit was filed with the Companys Annual Report on Form 10-K for the year ended July 31, 2005 and is incorporated herein by reference.\n(3) This exhibit was filed with the Companys Current Report on Form 8-K on January 10, 2017 and is incorporated herein by reference.\n(4) This exhibit was filed with the Companys Annual Report on Form 10-K for the year ended July 31, 2015 and is incorporated herein by reference\n(5) This exhibit was filed with the Companys Current Report on Form 8-K on February 11, 2019 and is incorporated herein by reference\n(6) This exhibit was filed with the Companys Current Report on Form 8-K on April 22, 2019 and is incorporated herein by reference\n(7) This exhibit was filed with the Companys Current Report on Form 8-K on November 21, 2018 and is incorporated herein by reference\n(8) This exhibit was filed with the Companys Annual Report on Form 10-K for the year ended July 31, 2021\n(9) This exhibit was filed with the Companys Current Report on Form 8-K on October 18, 2021 and is incorporated herein by reference\n(10) This exhibit was filed with the Companys Current Report on Form 8-K on January 4, 2022 and is incorporated herein by reference\n(11) This exhibit was filed with the Companys Annual Report on Form 10-K for the year ended July 31, 2003 and is incorporated herein by reference\n(12) This exhibit was filed with the Companys Current Report on Form 8-K on March 16, 2023 and is incorporated herein by reference\n(13) This exhibit was filed with the Companys Current Report on Form 8-K on April 5, 2023 and is incorporated herein by reference\n(14) This exhibit was filed with the Companys Current Report on Form 8-K on May 22, 2023 and is incorporated herein by reference\n(15) This exhibit was filed with the Companys Current Report on Form 8-K on July 10, 2023 and is incorporated herein by reference\n(16) This exhibit was filed with the Companys Current Report on Form 8-K on October 30, 2023 and is incorporated herein by reference\n(17) This exhibit was filed with the Companys Annual Report on Form 10-K for the year ended July 31, 2022 and is incorporated herein by reference\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nENZO BIOCHEM, INC.\nDate: November 3, 2023 By: /s/ Kara Cannon\nKara Cannon\nInterim Chief Executive Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nBy: /s/ Kara Cannon\nNovember 3, 2023\nKara Cannon\nInterim Chief Executive Officer\nBy: /s/ Patricia Eckert\nNovember 3, 2023\nPatricia Eckert,\nInterim Chief Financial Officer,\nPrincipal Accounting Officer\nElazar Rabbani, Ph.D., Director\nBy: /s/ Bradley L. Radoff\nNovember 3, 2023\nBradley Radoff, Director\nBy: /s/ Mary Tagliaferri\nNovember 3, 2023\nMary Tagliaferri, M.D., Director\nBy: /s/ Ian B. Walters\nNovember 3, 2023\nIan B. Walters, M.D., Director\nSteven J. Pully, Chair of the Board\nFORM 10-K, ITEM 15(a) (1) and (2)\nENZO BIOCHEM, INC.\nLIST OF CONSOLIDATED FINANCIAL STATEMENTS AND\nFINANCIAL STATEMENT SCHEDULE\nThe following consolidated financial statements and financial statement schedule of Enzo Biochem, Inc. are included in Item 15(a):\nList of Consolidated Financial Statements and Financial Statements Schedule\nReport of Independent Registered Public Accounting Firm (PCAOB ID 274)\nConsolidated Balance Sheets - July 31, 2023 and 2022\nConsolidated Statements of Operations - Years ended July 31, 2023 and 2022\nConsolidated Statements of Comprehensive Income (Loss) - Years ended July 31, 2023 and 2022\nConsolidated Statements of Stockholders Equity - Years ended July 31, 2023 and 2022\nConsolidated Statements of Cash Flows - Years ended July 31, 2023 and 2022\nNotes to Consolidated Financial Statements\nSchedule II - Valuation and Qualifying Accounts - As of and for the Years ended July 31, 2023 and 2022 S-1\nAll other schedules for which provision is made in the applicable accounting regulation of the Securities and Exchange Commission are not required under the related instructions or are inapplicable, and therefore have been omitted.\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Board of Directors and Stockholders of\nEnzo Biochem, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Enzo Biochem, Inc. (the Company) as of July 31, 2023 and 2022, and the related consolidated statements of operations, comprehensive income (loss), stockholders equity, and cash flows for each of the years then ended, and the related notes and the financial statement schedule identified in Item 15 (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the consolidated financial position of the Company as of July 31, 2023 and 2022, and the consolidated results of their operations and their cash flows for each of the years then ended, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nContingencies\nAs discussed in Note 17 to the consolidated financial statements, the Company is subject to legal claims, lawsuits, and regulatory inquiries. The amounts to settle any liabilities that might arise from the claims and lawsuits could result in adverse consequences to the Company. Contingencies are evaluated and a liability is recorded when the matter is both probable and reasonably estimable. Where the reasonable estimate of the probable loss is a range, management records the most likely estimate of the loss, or the low end of the range if there is no one best estimate. Management either discloses the amount of a possible loss or range of loss in excess of established accruals if estimable and appropriate, or states that such an estimate cannot be made. Management discloses significant legal proceedings even where liability is not probable or the amount of the liability is not estimable, or both, if management believes there is at least a reasonable possibility that a loss may be incurred.\nWe identified the assessment of loss contingencies relating to pending legal claims, lawsuits, and regulatory inquiries as a critical audit matter due to the significant judgments required by management in assessing the likelihood of a loss being incurred and in estimating the loss or range of loss for each matter. As such, there is a high degree of auditor judgment and subjectivity, and significant audit effort was required in performing procedures to evaluate managements assessment of contingencies.\nAddressing the critical audit matter involved performing procedures and evaluating audit evidence in connection with forming our overall opinion on the financial statements. These procedures included, among others, (i) obtaining an understanding of and evaluating the design of controls related to the assessment and valuation of loss contingencies related to pending legal claims, lawsuits, and regulatory inquiries; (ii) obtaining and evaluating the letters of audit inquiry with internal and external legal counsel; (iii) evaluating the reasonableness of managements assessment regarding whether an unfavorable outcome is reasonably possible or probable and reasonably estimable; and (iv) evaluating the sufficiency of the Companys disclosures related to legal proceedings.\n/s/ EisnerAmper LLP\nWe have served as the Companys auditor since 2013.\nEISNERAMPER LLP\nIselin, New Jersey\nNovember 3, 2023\nENZO BIOCHEM, INC.\nCONSOLIDATED BALANCE SHEETS\n(in thousands, except share and per share data)\nJuly 31,\nJuly 31,\nASSETS\nCurrent assets:\nCash and cash equivalents $ 82,373 $ 21,603\nAccounts receivable, net 4,808 4,762\nInventories, net 7,939 9,516\nPrepaid expenses and other current assets, including $1,000 restricted cash 3,336 2,816\nCurrent assets of discontinued operations, net -\n4,126\nTotal current assets 98,456 42,823\nProperty, plant, and equipment, net 13,086 11,636\nRight-of-use assets 3,626 4,384\nOther assets, including $5,000 escrow at July 31, 2023 5,745 1,309\nNon-current assets of discontinued operations, net 15,459\nTotal assets $ 121,880 $ 75,611\nLIABILITIES AND STOCKHOLDERS EQUITY\nCurrent liabilities:\nAccounts payable - trade $ 3,575 $ 3,715\nAccrued liabilities 11,743 8,179\nCurrent portion of operating lease liabilities\nOther current liabilities\nConvertible debentures 2,514 -\nCurrent liabilities of discontinued operations, net 21,102 -\nTotal current liabilities 39,989 13,019\nOperating lease liabilities, non-current 3,160 4,053\nLong term debt, net 4,077\nTotal liabilities $ 43,418 $ 21,149\nCommitments and contingencies - see Notes 16 and 17\nStockholders equity:\nPreferred Stock, $.01 par value; authorized 25,000,000 shares; no shares issued or outstanding -\n-\nCommon Stock, $.01 par value; authorized 75,000,000 shares; shares issued and outstanding: 49,997,631 at July 31, 2023 and 48,720,454 at July 31, 2022\nAdditional paid-in capital 344,435 339,462\nAccumulated deficit (268,350 ) (288,638 )\nAccumulated other comprehensive income 1,878 3,151\nTotal stockholders equity 78,462 54,462\nTotal liabilities and stockholders equity $ 121,880 $ 75,611\nThe accompanying notes are an integral part of these consolidated financial statements\nENZO BIOCHEM, INC.\nCONSOLIDATED STATEMENTS OF OPERATIONS\n(in thousands, except per share data)\nYears ended July 31,\nRevenues $ 31,061 $ 32,643\nOperating costs, expenses and legal settlements, net:\nCost of revenues 17,866 19,213\nCost of revenue - inventory provision 1,629 -\nResearch and development 3,904 2,438\nSelling, general, and administrative 27,202 23,084\nLegal and related expenses 5,196 5,435\nLegal settlements -\n(500 )\nTotal costs, expenses and legal settlements, net 55,797 49,670\nOperating loss (24,736 ) (17,027 )\nOther income (expense):\nInterest, net (1,122 )\nChange in fair value of convertible debentures (824 ) -\nOther (1,268 )\nForeign exchange gain (loss) 1,280 (2,222 )\nLoss before income taxes (25,022 ) (20,339 )\nIncome taxes -\n-\nNet loss from continuing operations $ (25,022 ) $ (20,339 )\nNet (loss) income from discontinued operations (37,321 ) 2,078\nGain on sale of discontinued operations, net of tax 82,631 -\nNet income (loss) 20,288 (18,261 )\nNet income (loss) per common share - basic and diluted:\nContinuing operations\n$ (0.51 ) $ (0.42 )\nDiscontinued operations\n0.92 0.04\nTotal net income (loss) per basic and diluted common share\n$ 0.41 $ (0.38 )\nWeighted average common shares outstanding:\nBasic 49,160 48,594\nDiluted 49,160 48,594\nThe accompanying notes are an integral part of these consolidated financial statements\nENZO BIOCHEM, INC.\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME (LOSS)\n(in thousands)\nYears ended July 31,\nNet income (loss) $ 20,288 $ (18,261 )\nOther comprehensive income (loss):\nForeign currency translation adjustments (1,273 ) 1,799\nComprehensive income (loss) $ 19,015 $ (16,462 )\nThe accompanying notes are an integral part of these consolidated financial statements.\nENZO BIOCHEM, INC.\nCONSOLIDATED STATEMENTS OF STOCKHOLDERS EQUITY\nYears ended July 31, 2023 and 2022\n(in thousands, except share data)\nCommon\nStock\nShares\nIssued Common\nStock\nAmount Additional\nPaid-in\nCapital Accumulated\nDeficit Accumulated\nOther\nComprehensive\nIncome Total\nStockholders\nEquity\nBalance at July 31, 2021 48,471,771 $ 485 $ 337,126 $ (270,377 ) $ 1,352 $ 68,586\nNet loss for the year ended July 31, 2022 - -\n-\n(18,261 ) -\n(18,261 )\nExercise of stock options 11,300 -\n-\n-\nShare-based compensation charges - -\n1,496 -\n-\n1,496\nIssuance of common stock for employee 401(k) plan match 237,383 -\n-\nForeign currency translation adjustments - -\n-\n-\n1,799 1,799\nBalance at July 31, 2022 48,720,454 $ 487 $ 339,462 $ (288,638 ) $ 3,151 $ 54,462\nNet income for the year ended July 31, 2023 - -\n-\n20,288 -\n20,288\nVesting of restricted stock 125,731 -\n-\n-\nVesting of performance stock 25,200 - - - - -\nExercise of stock options 6,667 -\n-\n-\nIssuance of common stock (net of expenses of $12) 276,479 -\n-\nShare-based compensation charges - -\n2,268 -\n-\n2,268\nIssuance of common stock for employee 401(k) plan match 843,100 1,071 - - 1,079\nIssuance of warrants - - 1,237 - - 1,237\nForeign currency translation adjustments - -\n-\n-\n(1,273 ) (1,273 )\nBalance at July 31, 2023 49,997,631 $ 499 $ 344,435 $ (268,350 ) $ 1,878 $ 78,462\nThe accompanying notes are an integral part of these consolidated financial statements\nENZO BIOCHEM, INC.\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(in thousands)\nYear ended July 31,\nCash flows from operating activities:\nNet income (loss) $ 20,288 $ (18,261 )\nAdjustments to reconcile net income (loss) to net cash used in operating activities:\nGain on sale of discontinued operations, net of tax (82,631 ) -\nChange in fair value of convertible debentures -\nDepreciation and amortization of property, plant and equipment 2,682 2,566\nAmortization of intangible assets -\nShare-based compensation charges 2,268 1,496\nShare-based 401(k) employer match expense\nForeign exchange (gain) loss (1,674 ) 2,057\nRealized and unrealized loss on marketable securities -\n1,283\nProvision for inventories 1,629 -\nImpairments of other assets -\nChanges in operating assets and liabilities:\nAccounts receivable 5,033 (1,299 )\nInventories (334 ) (2,736 )\nPrepaid expenses and other assets (1,174 )\nAccounts payable - trade 1,159\nAccrued liabilities, other current liabilities and other liabilities 12,595 (2,016 )\nTotal adjustments (57,264 ) 1,671\nNet cash used in operating activities (36,976 ) (16,590 )\nCash flows from investing activities:\nNet proceeds from sale of discontinued operations 101,740 -\nCapital expenditures (2,760 ) (3,472 )\nSales of marketable securities -\n28,695\nNet cash provided by investing activities 98,980 25,223\nCash flows from financing activities:\nNet proceeds from issuance of common stock through ATM -\nProceeds from issuance of convertible debentures and warrants 7,000 -\nRepayments of convertible debentures (4,000 ) -\nCost of issuance of convertible debentures and warrants (389 ) -\nProceeds from borrowings under revolving credit agreement 16,846 -\nRepayments under revolving credit agreement (16,846 ) -\nRepayments under mortgage agreement and capital leases (4,136 ) (269 )\nProceeds from exercise of stock options\nNet cash used in financing activities (1,125 ) (241 )\nEffect of exchange rate changes on cash and cash equivalents (109 ) (63 )\nIncrease in cash and cash equivalents and restricted cash 60,770 8,329\nCash and cash equivalents and restricted cash - beginning of year 22,603 14,274\nCash and cash equivalents and restricted cash - end of year $ 83,373 $ 22,603\nComposition of cash and cash equivalents and restricted cash is as follows:\nCash and cash equivalents 82,373 21,603\nRestricted cash 1,000 1,000\nTotal cash and cash equivalents and restricted cash $ 83,373 $ 22,603\nThe accompanying notes are an integral part of these consolidated financial statements\nENZO BIOCHEM, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJuly 31, 2023\n(Dollars in thousands except share data)\nNote 1 - Organization and business\nEnzo Biochem, Inc. (the Company we, our or Enzo), is a manufacturer and supplier of a comprehensive portfolio of thousands of high-quality products, including antibodies, genomic probes, assays, biochemicals, and proteins. The Companys proprietary products and technologies play central roles in translational research and drug development areas, including cell biology, genomics, assays, immunohistochemistry, and small molecule chemistry. Enzo Biochem, Inc.s Life Science division supports the work of research centers and industry partners. Enzo Biochem, Inc. has a broad and deep intellectual property portfolio, with patent coverage across many vital enabling technologies.\nNote 2 - Discontinued operations, sale of Clinical Labs business\nPrior to July 24, 2023, we operated a clinical laboratory, doing business as Enzo Clinical Labs, which provided reference, molecular and esoteric diagnostic medical testing services in the New York, New Jersey, and Connecticut medical communities. Effective July 24, 2023, we completed the sale of certain assets used in the operation of Enzo Clinical Labs and the assignment of certain clinical lab liabilities to Laboratory Corporation of America (Labcorp) for an aggregate purchase price of $113.25 million in cash, subject to customary closing adjustments. In accordance with the sale, we ceased our clinical services operations. As a consequence of the sale, for fiscal years 2023 and 2022 we have classified as discontinued operations all income and expenses attributable to the clinical services business, the gain from the sale of the clinical services assets, and the income tax expense attributed to the sale of the clinical services assets. Excluded from the sale of the clinical services assets were its cash and accounts receivable.\nThe gain on the sale of the Clinical Labs business and net proceeds were as follows:\nGross consideration from the sale of the Clinical Labs business $ 113,250\nClosing and transaction costs (9,941 )\nConsideration from sale of the Clinical Labs business - net 103,309\nNet book value of assets sold or abandoned (19,818 )\nGain on sale of the Clinical Labs business before income taxes 83,491\nIncome tax expense (860 )\nGain on the sale of the Clinical Labs business after income taxes $ 82,631\nNet cash proceeds from sale:\nCash paid at closing, net of closing costs paid at closing $ 106,740\nProceeds due on sale of assets, cash held in escrow (5,000 )\nNet cash proceeds from sale $ 101,740\nWe incurred $9,941 in closing and transaction costs associated with the sale of the Clinical Labs business which were comprised of (i) transaction fees and related closing costs of $7,238 and (ii) performance bonuses to certain employees associated with the sale of the business of $2,703. The compensation committee of our board of directors approved these compensation arrangements.\nENZO BIOCHEM, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJuly 31, 2023\n(Dollars in thousands except share data)\nThe following table sets forth the condensed operating results of the discontinued operations for the fiscal years ended July 31,\nNet revenues $ 30,087 $ 74,428\nCost of revenues 38,163 45,891\nSelling, general and administrative 28,270 24,934\nResearch and development 1,329\nLegal and related expenses\nOther (expense) income (5 )\n(Loss) income from operations (37,321 ) 2,078\nGain on sale of business - before taxes 83,491 -\nIncome tax expense on gain (860 ) -\nIncome from discontinued operations $ 45,310 $ 2,078\nThe following table sets forth the condensed carrying amounts of major classes of assets and liabilities of the discontinued operations as of July 31,\nCarrying amounts of major current assets included as part of discontinued operations:\nTrade receivables $ 1,675 $ 6,754\nInventories -\n5,895\nPrepaid and other current 3,008\nTotal current assets 1,729 15,657\nCarrying amounts of major current liabilities included as part of discontinued operations:\nTrade payables and accrued liabilities 20,616 8,914\nOperating lease liabilities and other 2,215 2,617\nTotal current liabilities 22,831 11,531\nCurrent liabilities of discontinued operations, net 21,102\nCurrent assets of discontinued operations, net\n4,126\nCarrying amount of major non-current assets included as part of discontinued operations:\nRight of use assets $ 7,001 $ 10,790\nProperty, plant and equipment -\n5,623\nGoodwill and other 7,760\nTotal non- current assets 7,063 24,173\nCarrying amount of major non-current liabilities included as part of discontinued operations:\nOperating lease liabilities and other 6,096 8,714\nNon-current assets of discontinued operations, net $ 967 $ 15,459\nENZO BIOCHEM, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJuly 31, 2023\n(Dollars in thousands except share data)\nDuring the fiscal year ended July 31, 2023, the cash used in operating activities of the discontinued operations was $19,000 and the cash provided by investing activities was $101,300. During the fiscal year ended July 31, 2022, the cash used in operating activities and investing activities of the discontinued operations was $4,224 and $815, respectively.\nNote 3 - Summary of significant accounting policies\nFor the fiscal years ended July 31, 2023 and 2022, our revenues from continuing operations come from the sales of our products in the Products segment.\nPrinciples of consolidation\nThe accompanying consolidated financial statements have been prepared in conformity with accounting principles generally accepted in the United States of America (U.S. GAAP) and include the accounts of the Company and its wholly-owned subsidiaries, Enzo Life Sciences, Inc. (and its wholly-owned foreign subsidiaries), Enzo Therapeutics, Inc., Enzo Realty LLC (Realty), Enzo Realty II, LLC (Realty II), and Enzo Clinical Labs, Inc., (a corporate entity with discontinued operations). All intercompany transactions and balances have been eliminated.\nChange in segment reporting\nHistorically, we engaged in the research and development of therapeutic candidates through Enzo Therapeutics, a biopharmaceutical venture that was developing multiple novel approaches in the areas of gastrointestinal, infectious, ophthalmic and metabolic diseases, many of which were derived from the researching work of Enzo Life Sciences. Enzo Therapeutics focused its efforts on researching treatment regimens for diseases and conditions for which treatment options were ineffective, costly, and/or caused unwanted side effects. This focus generated a clinical and preclinical pipeline, as well as numerous patents and patent applications with Enzo Therapeutics as the assignee. At the beginning of fiscal 2023, we determined we would redirect our research resources and efforts to our two then operating segments, Clinical Services and Products, and no longer consider Enzo Therapeutics a segment. The operating results of Enzo Therapeutics are now included in the Corporate and Other segment for all periods presented. The operating expenses of Enzo Therapeutics for the fiscal years ended July 31, 2023 and 2022 are now included in the Corporate and Other segment were $40 and $55, respectively.\nUse of Estimates\nThe preparation of financial statements in conformity with U.S. GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting periods. Actual results could differ from those estimates.\nContingencies\nContingencies are evaluated and a liability is recorded when the matter is both probable and reasonably estimable. Gain contingencies are evaluated and not recognized until the gain is realizable or realized.\nForeign Currency Translation/Transactions\nThe Company has determined that the functional currency for its foreign subsidiaries is the local currency. For financial reporting purposes, assets and liabilities denominated in foreign currencies are translated at current exchange rates and profit and loss accounts are translated at weighted average exchange rates. Resulting translation gains and losses are included as a separate component of stockholders equity as accumulated other comprehensive income or loss. Gains or losses resulting from transactions entered into in other than the functional currency are recorded as foreign exchange gains and losses in the consolidated statements of operations.\nENZO BIOCHEM, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJuly 31, 2023\n(Dollars in thousands except share data)\nFair Value Measurements\nThe Company determines fair value measurements used in its consolidated financial statements based upon the exit price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants exclusive of any transaction costs, as determined by either the principal market or the most advantageous market. Inputs used in the valuation techniques to derive fair values are classified based on a three-level hierarchy. The basis for fair value measurements for each level within the hierarchy is described below with Level 1 having the highest priority and Level 3 having the lowest.\nLevel 1 Quoted prices in active markets for identical assets or liabilities.\nLevel 2 Quoted prices for similar assets or liabilities in active markets; quoted prices for identical or similar instruments in markets that are not active; and model-derived valuations in which all significant inputs are observable in active markets.\nLevel 3 Valuations derived from valuation techniques in which one or more significant inputs are unobservable.\nCash and cash equivalents\nCash and cash equivalents consist of demand deposits with banks and highly liquid money market funds. At July 31, 2023 and 2022, the Company had cash and cash equivalents in foreign bank accounts of $419 and $590, respectively.\nMarketable securities\nAt the beginning of fiscal year 2022, the Company had investments in a mutual fund and an exchange traded fund (ETF) holding highly rated corporate bonds, asset backed securities, municipal bonds, mortgage obligations and government obligations. These investments were classified as trading securities and Level 1 fair value investments (quoted prices in active markets for identical assets or liabilities). During fiscal year 2022, these investments were sold resulting in a realized loss of $1,283, which is included in Other income (expense).\nConcentration of Credit Risk\nFinancial instruments that potentially subject the Company to concentrations of credit risk primarily consist of cash and cash equivalents and accounts receivable. The Company believes the fair value of the aforementioned financial instruments approximates the cost due to the immediate or short-term nature of these items. At July 31, 2023 and 2022, the Company had cash deposited in certain financial institutions in excess of federally insured levels. The Company regularly monitors the financial stability of these financial institutions and believes that it is not exposed to any significant credit risk in cash and cash equivalents or restricted cash.\nConcentration of credit risk with respect to the Companys Products segment is mitigated by the diversity of the Companys customers and their dispersion across many different geographic regions. To reduce risk, the Company routinely assesses the financial strength of these customers and, consequently, believes that its accounts receivable credit exposure with respect to these customers is limited.\nAccounts Receivable\nAccounts receivable are reported at realizable value, net of allowances for doubtful accounts, which is estimated and recorded in the period of the related revenue.\nENZO BIOCHEM, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJuly 31, 2023\n(Dollars in thousands except share data)\nAs of July 31, 2023 and 2022, Products accounts receivable, net were $4,808 and $4,762, respectively. As of July 31, 2023 and 2022, these totals include foreign receivables, net of $1,277 and $1,142, respectively. As of July 31, 2021, Products accounts receivable, net were $4,182 which includes $1,400 of foreign receivables, net.\nInventories\nThe Company values inventory at the lower of cost (first-in, first-out) or net realizable value. Work-in-process and finished goods inventories consist of material, labor, and manufacturing overhead. Finished goods also include high throughput machines we intend to sell to laboratory customers, of which approximately $1.6 million were fully reserved in 2023 and reflected in a separate line item in the Consolidated Statements of Operations as Cost of revenues-inventory provision. Write downs of inventories to net realizable value are based on a review of inventory quantities on hand and estimated sales forecasts based on sales history and anticipated future demand. Unanticipated changes in demand could have a significant impact on the value of our inventory and require additional write downs of inventory which would impact our results of operations.\nProperty, plant and equipment\nProperty, plant and equipment is stated at cost, and depreciated on the straight-line basis over the estimated useful lives of the various asset classes as follows: building and building improvements: 15-30 years; laboratory machinery and equipment, office furniture and computer equipment: 3-10 years. Leasehold improvements are amortized over the term of the related leases or estimated useful lives of the assets, whichever is shorter.\nImpairment testing for Long-Lived Assets\nThe Company reviews the recoverability of the carrying value of long-lived assets of an asset or asset group for impairment if indicators of potential impairment exist. Should indicators of impairment exist, the carrying values of the assets are evaluated in relation to the operating performance and future undiscounted cash flows of an asset or asset group. The net book value of the long lived asset is adjusted to fair value if its expected future undiscounted cash flow is less than its book value. There were no long-lived asset impairments in 2023 or 2022.\nComprehensive income (loss)\nComprehensive income (loss) consists of the Companys consolidated net income (loss) and foreign currency translation adjustments. Foreign currency translation adjustments included in comprehensive income (loss) were not tax effected as the Company has a full valuation allowance at July 31, 2023 and 2022 in the foreign jurisdictions affected. Accumulated other comprehensive income is a separate component of stockholders equity and consists of the cumulative foreign currency translation adjustments.\nShipping and Handling Costs\nShipping and handling costs associated with the distribution of finished goods to customers are recorded in cost of goods sold.\nResearch and Development\nResearch and development costs are charged to expense as incurred.\nAdvertising\nAll costs associated with advertising are expensed as incurred. Advertising expense, included in selling, general and administrative expense, approximated $345 and $577 for the years ended July 31, 2023 and 2022, respectively.\nENZO BIOCHEM, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJuly 31, 2023\n(Dollars in thousands except share data)\nIncome Taxes\nThe Company accounts for income taxes under the liability method of accounting for income taxes. Under the liability method, deferred tax assets and liabilities are recognized for the future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases. The liability method requires that any tax benefits recognized for net operating loss carry forwards and other items be reduced by a valuation allowance when it is more likely than not that the benefits may not be realized.\nDeferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled.\nUnder the liability method, the effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date.\nIt is the Companys policy to provide for uncertain tax positions and the related interest and penalties based upon managements assessment of whether a tax benefit is more likely than not to be sustained upon examination by tax authorities. At July 31, 2023 and 2022, the Company had no uncertain tax benefits recorded. To the extent the Company prevails in matters for which a liability for an unrecognized tax benefit is established or is required to pay amounts in excess of the liability, the Companys effective tax rate in a given financial statement period may be affected.\nSegment Reporting\nThe Company separately reports information about each operating segment that engages in business activities from which the segment may earn revenues and incur expenses, whose separate operating results are regularly reviewed by the chief operating decision maker regarding allocation of resources and performance assessment and which exceed specific quantitative thresholds related to revenue and profit or loss. The Companys Enzo Life Sciences operating activities are reported in one segment, Products. Costs excluded from this reporting unit and reported as Corporate and Other consist of corporate general and administrative costs and operating results of Enzo Therapeutics which are not allocable to the reportable segment (see Note 18).\nNet income (loss) per share\nBasic net income (loss) per share represents net income (loss) divided by the weighted average number of common shares outstanding during the period. The dilutive effect of potential common shares, consisting of outstanding stock options, and unvested restricted stock units and performance stock units, is determined using the treasury stock method.\nFor the years ended July 31, 2023 and 2022, the effect of approximately 3,254,500 and 1,499,000 respectively, of outstanding out of the money options to purchase common shares were excluded from the calculation of diluted weighted average shares outstanding because their effect would be anti-dilutive. For the years ended July 31, 2023 and 2022, the effect of approximately 120,000 and 472,000 respectively, of outstanding restricted stock units and performance stock units were excluded from the calculation of diluted weighted average shares outstanding because their effect would be anti-dilutive. During the year ended July 31, 2023, the effect of approximately 16,000 warrants were excluded from the calculation of diluted weighted average shares outstanding because their effect would be anti-dilutive. During the year ended July 31, 2023, the effect of approximately 120,000 shares related to the assumed conversion of the debentures were excluded from the calculation of diluted weighted average shares outstanding because their effect would be anti-dilutive.\nENZO BIOCHEM, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJuly 31, 2023\n(Dollars in thousands except share data)\nThe following table sets forth the computation of basic and diluted net income (loss) per share for the years ended July 31 (in thousands except for per share amounts):\nNet (loss) from continuing operations $ (25,022 ) $ (20,339 )\nNet income from discontinued operations 45,310 2,078\nNet income (loss) $ 20,288 $ (18,261 )\nWeighted-average common shares outstanding - basic 49,160 48,594\nNet income (loss) per common share - basic and diluted:\nContinuing operations\n$ (0.51 ) $ (0.42 )\nDiscontinued operations\n0.92 0.04\nTotal net income (loss) per basic and diluted common share\n$ 0.41 $ (0.38 )\nShare-Based Compensation\nThe Company records compensation expense associated with stock options, restricted stock units and performance stock units based upon the fair value of the stock based awards as measured at the grant date. The Company determines the award values of stock options using the Black Scholes option pricing model or the fair value of our stock at the date of grant. The expense is recognized by amortizing the fair values on a straight-line basis over the vesting period, adjusted for forfeitures when they occur.\nFor the years ended July 31, 2023 and 2022, share-based compensation expense relating to the fair value of stock options, restricted stock units and performance stock units was approximately $1,772 and $1,298, respectively (see Note 14). No excess tax benefits were recognized for the year ended July 31, 2023 and 2022.\nThe following table sets forth the amount of expense related to share-based payment arrangements included in specific line items in the accompanying statement of operations for the years ended July 31:\nCost of revenues $ 22 $ 6\nSelling, general and administrative 1,750 1,292\n$ 1,772 $ 1,298\nEffect of New Accounting Pronouncements\nRecently Adopted Accounting Pronouncements\nIn August 2020, the Financial Accounting Standards Board (FASB) issued Accounting Standards Update (ASU) No. 2020-06 Accounting for Convertible Instruments and Contracts in an Entitys Own Equity (Subtopic 470-20). The amendments in the ASU simplify the settlement assessment by removing requirements to (1) to consider whether the contract would be settled in registered shares, (2) to consider whether collateral is required to be posted, and (3) to assess shareholder rights. The amendments require instruments that are required to be classified as an asset or liability to measured subsequently at fair value, with changed reported in earnings and disclosed in the financial statements. The amendments improve the consistency of EPS calculations by amending the guidance to align the diluted EPS calculation for convertible instruments by requiring that an entity use the if-converted method rather than the treasury stock method. The amendments also require that the effect of potential share settlement be included in the diluted EPS calculation when an instrument may be settled in cash or shares. Until the issuance of the Debentures (see Note 9), the Company had no instruments affected by ASU 2020-06. We adopted the amendments in this ASU effective with the issuance of the Debentures in the fiscal quarter ended July 31, 2023, which did not have a material impact on our financial position or results of operations.\nENZO BIOCHEM, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJuly 31, 2023\n(Dollars in thousands except share data)\nPronouncements Issued but Not Yet Adopted\nIn June 2016, FASB issued ASU No. 2016-13 Financial Instruments - Credit Losses (Topic 326). This standard changes the impairment model for most financial instruments, including trade receivables, from an incurred loss method to a new forward-looking approach, based on expected losses.\nThe estimate of expected credit losses will require entities to incorporate considerations of historical information, current information and reasonable and supportable forecasts. Adoption of this standard is required for our annual and interim periods beginning August 1, 2023, as we qualify as a smaller reporting company at the end of fiscal 2022 and must be adopted using a modified retrospective transition approach. We do not expect the impact of the adoption of this standard on our results of operations, financial position and cash flows to be material.\nWe reviewed all other recently issued accounting pronouncements and have concluded they are not applicable or not expected to be significant to the accounting for our operations.\nReclassification\nCertain prior period amounts have been reclassified to conform to the current period presentation. These reclassifications had no effect on the reported results of operations.\nIntangible assets\nThe Companys Products segment held finite lived intangibles until July 31, 2022 at which time the intangibles were fully amortized. Amortization expense for the year ended July 31, 2022 was $239.\nNote 4 - Revenue Recognition\nProducts Revenue\nThe Company generates revenue from the sale of our single-use products used in the identification of genomic information. Revenue is recorded net of sales tax. The Company considers revenue to be earned when all of the following criteria are met: the Company has a contract with a customer that creates enforceable rights and obligations; promised products are identified; the transaction price is determinable; and the Company has transferred control of the promised items to the customer. A performance obligation is a promise in a contract to transfer a distinct good or service to the customer, and is the unit of account in the contract. The transaction price for the contract is measured as the amount of consideration the Company expects to receive in exchange for the goods expected to be transferred. A contracts transaction price is allocated to each distinct performance obligation and recognized as revenue when, or as, control of the distinct good or service is transferred. Transfer of control for the Companys products is generally at shipment or delivery, depending on contractual terms, but occurs when title and risk of loss transfers to the customer which represents the point in time when the customer obtains the use of and substantially all of the remaining benefit of the product. As such, the Companys performance obligation related to product sales is satisfied at a point in time. The Company recognizes a receivable when it has an unconditional right to payment, which represents the amount the Company expects to collect in a transaction and is most often equal to the transaction price in the contract. Payment terms for shipments to end-user and distributor customers may range from 30 to 90 days. Amounts billed to customers for shipping and handling are included in revenue, while the related shipping and handling costs are reflected in cost of revenues.\nENZO BIOCHEM, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJuly 31, 2023\n(Dollars in thousands except share data)\nProducts revenue by geography is as follows:\nUnited States $ 18,551 $ 19,781\nEurope 8,448 8,568\nAsia Pacific 4,062 4,294\nProducts revenue $ 31,061 $ 32,643\nNote 5 - Supplemental disclosure for statement of cash flows\nIn the years ended July 31, 2023 and 2022, interest paid by the Company, including penalties and fees approximated $1,246 and $231, respectively.\nFor the years ended July 31, 2023 and 2022, the net reductions in the measurement of right of use assets and liabilities included in cash flows from operating activities was approximately $38 and $29, respectively. The changes are included in changes in accrued liabilities, other current liabilities, and other liabilities in the statements of cash flows.\nIn connection with the completed sale of certain assets used in the operation of Enzo Clinical Labs, $5,000 of proceeds were included in other assets as escrow as of July 31, 2023.\nFor the years ended July 31, 2023 and 2022, tax on capital paid by the Company was $22 and $129 respectively. There was no cash paid for income taxes by the Company for the years ended July 31, 2023 and 2022.\nDuring the years ended July 31, 2023 and 2022, the Company issued common stock in connection with its share-based 401(k) employer match in the amount of $1,079 and $814, respectively.\nNote 6 - Inventories\nInventories, net consisted of the following at July 31:\nRaw materials $ 2,206 $ 1,524\nWork in process 2,599 2,460\nFinished products 3,134 5,532\n$ 7,939 $ 9,516\nNote 7 - Property, plant, and equipment\nAt July 31, 2023 and 2022, property, plant, and equipment consist of:\nBuilding and building improvements $ 12,501 $ 11,819\nMachinery and equipment 6,988 3,262\nOffice furniture and computer equipment 7,928 9,978\nLeasehold improvements\n28,304 25,705\nAccumulated depreciation and amortization (17,280 ) (16,131 )\n11,024 9,574\nLand and land improvements 2,062 2,062\n$ 13,086 $ 11,636\nENZO BIOCHEM, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJuly 31, 2023\n(Dollars in thousands except share data)\nAt July 31, 2023 and 2022, building and building improvements included construction in progress of approximately $436 and $323, respectively.\nNote 8 - Income taxes\nThe Company recorded no benefit or provision for income taxes for fiscal years ended July 31, 2023 and 2022.\nDeferred tax assets and liabilities arise from temporary differences between the tax basis of assets and liabilities and their reported amounts in the financial statements. The components of deferred tax assets (liabilities) as of July 31 are as follows:\nDeferred tax assets:\nFederal tax carryforward losses $ 11,345 20,303\nProvision for uncollectible accounts receivable\nState and local tax carry forward losses 2,758\nStock compensation 2,349 1,766\nDepreciation\nResearch and development and other tax credit carryforwards 1,652 1,551\nLease liabilities 3,232 4,594\nForeign tax carryforward losses 3,708 3,213\nIntangibles and goodwill\nInventory 1,623 1,769\nAccrued expenses 4,463 2,199\nOther, net\nDeferred tax assets 30,006 40,156\nRight of use assets (2,757 ) (4,313 )\nPrepaid expenses (507 ) (1,175 )\nOther, net (57 ) (58 )\nDeferred tax liabilities (3,321 ) (5,546 )\nNet deferred tax assets before valuation allowance 26,685 34,610\nLess: valuation allowance (26,685 ) (34,610 )\nNet deferred tax assets $ -\n$ -\nThe Company recorded a valuation allowance during the years ended July 31, 2023 and 2022 equal to domestic and foreign net deferred tax assets. The Company believes that the valuation allowance is necessary as it is not more likely than not that the deferred tax assets will be realized in the foreseeable future based on positive and negative evidence available at this time. This conclusion was reached because of uncertainties relating to future taxable income, in terms of both its timing and its sufficiency, which would enable the Company to realize the deferred tax assets. For fiscal years 2023 and 2022, the change in the valuation allowance was ($7,925) and $4,736, respectively.\nAs of July 31, 2023, the Company had U.S. federal net operating loss carryforwards of approximately $54,025 of which $16,214, if not fully utilized, expire between 2030 and 2038 and which $37,811 do not expire. The Company has local net operating loss carryforwards of $1,101 which expire in 2042. Utilization is dependent on generating sufficient taxable income prior to expiration of the tax loss carryforwards.\nENZO BIOCHEM, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJuly 31, 2023\n(Dollars in thousands except share data)\nIn addition, the Company has research and development tax credit carryforwards of approximately $1,646 which expire between 2025 and 2043. As of July 31, 2023, the Company had foreign loss carryforwards of approximately $16,574 which with few exceptions do not expire.\nThe geographic components of loss before income taxes consisted of the following for the years ended July 31:\nUnited States operations $ (23,714 ) $ (16,345 )\nInternational operations (1,308 ) (3,994 )\n(Loss) income before taxes $ (25,022 ) $ (20,339 )\nThe benefit for income taxes was at rates different from U.S. federal statutory rates for the following reasons for the years ended July 31:\nFederal statutory rate 21.0 % 21.0 %\nCompensation and other expenses not deductible for income tax return purposes (1.4 ) (2.9 )\nChange in valuation allowance, net (19.6 ) (18.1 )\n-\n% -\n%\nBecause there are no undistributed earnings at the Companys foreign subsidiaries at July 31, 2023, no U.S. federal income taxes have been provided. As of July 31, 2023, the Company has no liabilities for uncertain tax positions. It is the Companys policy to record interest and penalties as a component of tax expense. The Company files income tax returns in the U.S. Federal jurisdiction, various U.S. state jurisdictions and several foreign jurisdictions. With few exceptions, the fiscal years that remain subject to examination are July 31, 2020 through July 31, 2023.\nNote 9 - Convertible debentures and other current debt\nOn May 19, 2023, the Company entered into a Securities Purchase Agreement (the Purchase Agreement) with each of the purchasers that are parties thereto (each, including its successors and assigns, a Purchaser and collectively, the Purchasers) and JGB Collateral, LLC, a Delaware limited liability company, as collateral agent for the Purchasers (the Agent). Pursuant to the Purchase Agreement, the Company agreed to sell to the Purchasers (i) 10% Original Issue Discount Secured Convertible Debentures (the Debentures) with an aggregate principal amount of $7,608 and (ii) warrants to purchase up to 1,000,000 shares of the Companys common stock, par value $0.01 per share (the Common Stock), for an exercise price of $2.31 per share, the average of the three (3) daily volume weighted average prices of the Common Stock as defined in the Purchase Agreement (VWAP) prior to the closing date (the Warrants), subject to adjustments as set forth in the Warrants, for a total purchase price of $7,000. The Purchase Agreement contains customary representations, warranties and covenants. The transactions contemplated by the Purchase Agreement were consummated on May 19, 2023. Pursuant to ASC 825, Fair Value Option, the Company made an irrevocable election at the time of issuance to report the Debentures at fair value with changes in fair value recorded through the Companys consolidated statements of operations as other income (expense) in each reporting period.\nENZO BIOCHEM, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJuly 31, 2023\n(Dollars in thousands except share data)\nDebentures\nThe Debentures bear interest at a rate of 10% per annum (which interest rate is increased to 18% per annum five days after the occurrence and continuance of an Event of Default (as defined in the Debentures)), have a maturity date of May 20, 2024 and are convertible, at any time after their issuance date at the option of the Purchasers, into shares of Common Stock at a conversion price equal to $3.01 per share (the Conversion Price), subject to adjustment as set forth in the Debentures. Following the consummation of the Companys sale of certain assets and assignment of certain liabilities of Enzo Clinical Labs, Inc., to Labcorp pursuant to the Asset Purchase Agreement, dated March 16, 2023 (the Asset Sale), the Company shall either, at the option of the Company upon written notice delivered to the Purchasers within three (3) trading days after the consummation of the Asset Sale, (i) prepay $4,000 of the outstanding principal amount of the Debentures (to be applied pro rata among the outstanding Debentures based on the relative outstanding principal balance of each Debenture) or (ii) deposit $4,000 in cash, as collateral for the Companys obligations, into a deposit account subject to a deposit account control agreement, among the Company, the depository bank and the Agent and otherwise acceptable to Agent (in its sole absolute discretion) in form and substance. The Company prepaid $4,000 of the outstanding principal amount prior to July 31, 2023.\nThe Companys obligations under the Debentures could have been accelerated, at the Purchasers election, upon the occurrence of certain customary events of default. As of July 31, 2023, there were no events of default. The Debentures contain customary representations, warranties and covenants including among other things and subject to certain exceptions, covenants that restrict the Company from incurring additional indebtedness, creating or permitting liens on assets, amending its charter documents and bylaws, repurchasing or otherwise acquiring more than a de minimis number of its Common Stock or equivalents thereof, repaying outstanding indebtedness, paying dividends or distributions, assigning or selling certain assets, making or holding any investments, and entering into transactions with affiliates.\nThe following table presents a reconciliation of the beginning and ending balances of the convertible debentures measured at fair value on a recurring basis that use significant unobservable inputs (Level 3) and the related unrealized losses recorded in the consolidated statement of operations during the year ended July 31, 2023:\nIssuance of convertible debt and warrants at fair value $ 7,000\nAllocation of warrants to additional paid in capital based on relative fair value (1,310 )\nRepayment (4,000 )\nChange in fair value of convertible debentures\nFair value, July 31, 2023 $ 2,514\nSecurity Agreement and Subsidiary Guarantees\nIn connection with the Purchase Agreement, on May 19, 2023, the Company, certain of the Companys domestic subsidiaries (Guarantors), the Purchasers and the Agent entered into a Security Agreement (the Security Agreement), pursuant to which the Company and the Guarantors granted, for the benefit of the Purchasers, to secure the Companys obligations under the Purchase Agreement and the Debentures.\nWarrants\nThe Warrants are exercisable for five years from May 19, 2023, at an exercise price of $2.31 per share, which is the average of three (3) daily VWAPs prior to the closing date, subject, with certain exceptions, to adjustments in the event of stock splits, dividends, subsequent dilutive offerings and certain fundamental transactions, as more fully described in the Warrant.\nRegistration Rights Agreement\nIn connection with the Purchase Agreement, on May 19, 2023, the Company and the Purchasers entered into a Registration Rights Agreement, pursuant to which the Company is obligated to register the shares of Company Common Stock issuable upon exercise of the Debentures and the Warrants. The Company has registered the shares.\nENZO BIOCHEM, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJuly 31, 2023\n(Dollars in thousands except share data)\nOther\nIn March 2023, the Company entered into a Revolving Loan and Security Agreement with Gemino Healthcare Finance, LLC d/b/a SLR Healthcare ABL as lender specializing in direct lending to middle-market companies in the healthcare sector. The credit facility provided for a maximum $8,000 revolving line of credit based on the Companys eligible accounts receivable. The annual interest rate was equal to the 90 day term SOFR rate plus 5.5%. The line of credit would terminate one year from closing and unused line fees and early prepayment penalties would apply. We repaid this loan in July 2023 using proceeds from the Labcorp transaction and paid a $240 prepayment penalty recorded to Interest expense in the Consolidated Statements of Operations.\nNote 10 - Long term debt\nIn connection with the purchase of a building in Farmingdale, NY in November 2018, a wholly-owned subsidiary (the mortgagor subsidiary) of the Company entered into a Fee Mortgage and Security Agreement (the mortgage agreement) with Citibank, N.A. (the mortgagee). The mortgage agreement provided for a loan of $4,500 for a term of 10 years, bore a fixed interest rate of 5.09% per annum and required monthly mortgage payments of principal and interest of $30. The Companys obligations under the mortgage agreement were secured by the building and by a $1,000 cash collateral deposit with the mortgagee as additional security. In July 2023, we repaid in full the mortgage balance of $3,834 without prepayment penalty. The cash collateral deposit was released in August 2023 and the $1,000 collateral deposit is included in prepaid and other assets as of July 31, 2023.\nAt July 31, 2022, the balance owed by the subsidiary under the mortgage agreement was $3,980. The restricted cash of $1,000 was included in other assets as of July 31, 2022.\nIn April 2020, our subsidiary in Switzerland received a loan of CHF 400 (or $400, based on the foreign exchange rate as of July 31, 2020) from the Swiss government under the Corona Krise emergency loan program in response to the COVID-19 pandemic. This loan is uncollateralized and bears 0% interest. In January 2022, the bank agent of the Swiss government informed our subsidiary that the loan had to be fully amortized within a maximum of eight years and that the first of semiannual amortization payments of CHF 33 would begin in March 2022. In March 2022, the subsidiary made its first semi-annual principal repayment of CHF 33 (or $35 based on exchange rates). Based on this amortization schedule, the loan will be repaid by September 2027. The current portion of this loan is included in other current liabilities and the long term portion in long term debt - net as of July 31, 2023 and 2022.\nMinimum future annual principal payments under this agreement as of July 31, 2023 are as follows:\nJuly 31, Total\n$ 77\nTotal principal payments\nLess: current portion, included in other current liabilities (75 )\nLong term debt - net $ 269\nENZO BIOCHEM, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJuly 31, 2023\n(Dollars in thousands except share data)\nThe CARES Act expanded the U.S. Small Business Administrations (SBA) business loan program to create the Paycheck Protection Program (PPP), which provided employers with uncollateralized loans whose primary purpose is to retain or maintain workforce and salaries for a twenty-four week period (covered period) following receipt of the loan. The primary features of the PPP loan program are to provide funding to companies to cover eligible expenses, and the potential for forgiveness of that portion of the loan spent on payroll and other permitted operating expenses during the covered period, subject to reductions if the borrower fails to maintain or restore employee and salary levels. We applied for the PPP loan based on the eligibility and need requirements established when the program was announced and in April 2020 received $7,000 through Citibank N.A., the Companys existing lender, pursuant to the PPP (the PPP Loan). We accrued no interest on the loan. In June 2021, the SBA approved in full our request for loan forgiveness and we recognized the forgiveness of the $7,000 loan in fiscal year 2021. The SBA announced its intention to audit loans in excess of $2,000 and in June 2022 requested through Citibank N.A. the production of documents and information related to our loan and our request for forgiveness. We provided that information to the SBA via Citibank N.A. In October 2023, the SBA informed the Company that it closed its review of our loan forgiveness with no findings.\nNote 11 - Leases\nThe Company determines if an arrangement is or contains a lease at contract inception. The Company leases buildings, office space, patient service centers, and equipment through operating leases. Generally, a right-of-use asset, representing the right to use the underlying asset during the lease term, and a lease liability, representing the payment obligation arising from the lease, are recognized on the balance sheet at lease commencement based on the present value of the payment obligation. For operating leases, expense is recognized on a straight-line basis over the lease term. Short-term leases with an initial term of 12 months or less are not recorded on the balance sheet; the Company recognizes lease expense for these leases on a straight-line basis over the lease term. The Company primarily uses its incremental borrowing rate in determining the present value of lease payments as the Companys leases generally do not provide an implicit rate.\nThe Company has lease agreements with (i) right-of-use asset payments and (ii) non-lease components (e.g. payments related to maintenance fees, utilities, etc.) which have generally been combined and accounted for as a single lease component. The Companys leases have remaining terms of less than 1 year to 4 years, some of which include options to extend the leases for up to 3 years. The Companys lease terms may include renewal options that are reasonably certain to be exercised and termination options that are reasonably certain not to be exercised.\nCertain of the Companys lease agreements include rental payments adjusted periodically for inflation or a market rate which are included in the lease liabilities.\nLeases Balance Sheet Classification July 31,\nJuly 31,\nAssets\nOperating Right-of-use assets $ 3,626 $ 4,384\nTotal lease assets\n$ 3,626 $ 4,384\nLiabilities\nCurrent:\nOperating Current portion of operating lease liabilities $ 980 $ 896\nNon-current:\nOperating Operating lease liabilities, non-current 3,160 4,053\nTotal lease liabilities\n$ 4,140 $ 4,949\nENZO BIOCHEM, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJuly 31, 2023\n(Dollars in thousands except share data)\nFor the years ended July 31, components of lease cost were as follows:\nLease Cost\nOperating lease cost - net (a) $ 689 $ 1,108\n(a) Net of $378 sublease income for the year ended July 31, 2023.\nThe maturity of the Companys lease liabilities as of July 31, 2023 is as follows:\nMaturity of lease liabilities, years ending July 31, Operating\nleases\n$ 1,156\nTotal lease payments 4,626\nLess: Interest (a) (486 )\nPresent value of lease liabilities $ 4,140\n(a) Primarily calculated using the Companys incremental borrowing rate.\nLease term and discount rate for the years ended July 31 were as follows:\nLease term and discount rate\nWeighted-average remaining lease term (years):\nOperating leases 3.9 years 4.9 years\nWeighted-average discount rate:\nOperating leases 5.1 % 5.1 %\nSee Note 5 for cash flow information on cash paid for amounts included in the measurement of lease liabilities for the years ended July 31, 2023 and 2022.\nNote 12 - Accrued Liabilities\nAt July 31, accrued liabilities consist of:\nPayroll, benefits and commissions $ 7,421 $ 2,371\nProfessional fees\nLegal 2,248 4,523\nOther 1,464\n$ 11,743 $ 8,179\nENZO BIOCHEM, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJuly 31, 2022\n(Dollars in thousands except share data)\nSelf-Insured Medical Plan\nThe Company self-funds medical insurance coverage for certain of its U.S. based employees. The risk to the Company is believed to be limited through the use of individual and aggregate stop loss insurance. As of July 31, 2023 and 2022, the Company had established reserves of $631 and $260 respectively, which are included in accrued liabilities for payroll, benefits and commissions, for claims that have been reported but not paid and for claims that have been incurred but not reported. The reserve is based upon the Companys historical payment trends, claim history and current estimates.\nNote 13 - Other current liabilities\nAt July 31, other current liabilities consist of:\nCurrent portion of mortgage loan -\nCurrent portion of Swiss government loan\n$ 75 $ 229\nNote 14 - Stockholders equity\nControlled Equity Offering\nIn May 2023, the Company entered into a sales agreement (the Sales Agreement) with B. Riley Securities, Inc. as sales agent (Riley). Under the Sales Agreement, the Company may offer and sell, from time to time, through Riley, shares of the Companys common stock, par value $0.01 per share (Shares) having an aggregate offering price of up to $30 million. The Company pays Riley a commission of 3.0% of the aggregate gross proceeds received under the Sale Agreement. The Company is not obligated to make any sales of Shares under the Sales Agreement. The offering of Shares pursuant to the Sales Agreement will terminate upon the earlier of (a) the sale of all of the Shares subject to the Sales Agreement or (b) the termination of the Sales Agreement by Riley or the Company, as permitted therein. In May 2023, the Company filed with the SEC a shelf registration and sales agreement prospectus covering the Sales Agreement. A total of $150 million of securities, including those covered by the Sales Agreement, may be sold under the shelf registration which was declared effective in July 2023. During the fourth quarter of the fiscal year ended July 31, 2023, the Company sold 276,479 shares for net proceeds of $386.\nCommon stock issuances\nIn fiscal 2023, the Company issued 843,100 shares of common stock pursuant to its employees 401(k) matching contribution obligation of $1,079. In fiscal 2022, the Company issued 237,383 shares of common stock pursuant to its employees 401(k) matching contribution obligation of $814.\nENZO BIOCHEM, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJuly 31, 2023\n(Dollars in thousands except share data)\nIncentive stock plans\nIn January 2011, the Companys stockholders approved the adoption of the 2011 Incentive Plan (the 2011 Plan) for the issuance of equity awards, including, among others, options, restricted stock, restricted stock units and performance stock units for up to 3,000,000 shares of common stock. In January 2018, the Companys stockholders approved the amendment and restatement of the 2011 Plan (the Amended and Restated 2011 Plan) to increase the number of shares of common stock available for grant under the 2011 Plan by 2,000,000 shares of common stock bringing the total number of shares available for grant to 5,000,000 shares of common stock. On October 7, 2020, the Companys Board of Directors approved the amendment and restatement of the Amended and Restated 2011 Plan, with an effective date of October 7, 2020 and subject to approval by the Companys stockholders at the 2020 annual meeting of stockholders of the Company. The amendment and restatement of the Amended and Restated 2011 Plan was for purposes of, among other things, (i) increasing the shares of common stock available for grant under the Amended and Restated 2011 Plan by an additional 4,000,000 shares of common stock bringing the total number of shares available for grant to 9,000,000 shares of common stock and (ii) extending the term of the Amended and Restated 2011 Plan until October 7, 2030. In January 2021, the Companys stockholders approved the amendment and restatement of the Amended and Restated 2011 Plan.\nThe exercise price of options granted under the Amended and Restated 2011 Plan, as amended and restated, is equal to or greater than fair market value of the common stock on the date of grant. The Amended and Restated 2011 Plan, as amended and restated, will terminate at the earliest of (a) such time as no shares of common stock remain available for issuance under the plan, (b) termination of the plan by the Companys Board of Directors, or (c) October 7, 2030. Awards outstanding upon expiration of the Amended and Restated 2011 Plan, as amended and restated, will remain in effect until they have been exercised or terminated, or have expired. As of July 31, 2023, there were approximately 4,014,000 shares of common stock available for grant under the Amended and Restated 2011 Plan, as amended and restated.\nThe Company estimates the fair value of each stock option award on the measurement date using a Black-Scholes option pricing model or the fair value of our stock at the date of grant. The fair value of awards is amortized to expense on a straight-line basis over the requisite service period. The Company expenses restricted stock awards based on vesting requirements, primarily time elapsed. Performance stock awards are not recognized until it is probable they will be earned. At such time, their expense is then recognized over the requisite service period, including that portion of the service period already elapsed.\nEffective November 8, 2021, the Company granted equity awards to its CEO comprised of options to purchase 700,000 shares of common stock of the Company and restricted stock units (RSUs) for 260,000 shares of the common stock of the Company.\nOptions granted pursuant to the plans may be either incentive stock options or non-statutory options. The 2011 Plan provides for the issuance of stock options, restricted stock and restricted stock unit awards which generally vest over a two or three year period. A summary of the option activity pursuant to the Companys stock option plan for the years ended July 31, 2023 and 2022:\nOptions Weighted -\nAverage\nExercise\nPrice Options Weighted -\nAverage\nExercise\nPrice\nOutstanding at beginning of year 3,941,783 $ 3.00 2,504,563 $ 3.74\nNew Grants 640,000 $ 2.01 1,858,250 $ 2.88\nExercised (6,667 ) $ 2.14 (11,300 ) $ 2.49\nExpired or forfeited (745,616 ) $ 4.15 (409,730 ) $ 7.00\nOutstanding at end of year 3,829,500 $ 2.61 3,941,783 $ 3.00\nExercisable at end of year 2,195,867 $ 2.65 1,794,399 $ 3.14\nWeighted average fair value of options granted during year\n$ 1.03\n$ 1.52\nENZO BIOCHEM, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJuly 31, 2023\n(Dollars in thousands except share data)\nThe intrinsic value of stock option awards represents the value of the Companys closing stock price on the last trading day of the fiscal year in excess of the exercise price multiplied by the number of options that are outstanding. Total intrinsic value of outstanding options that were exercisable at July 31, 2023 and 2022 was $0 and $68, respectively. The intrinsic value of options outstanding at July 31, 2023 and 2022 was $0 and $193, respectively. The intrinsic value of the options exercised in fiscal 2023 and 2022 was $3 and $4, respectively.\nListed below are the assumptions used to determine the fair value of options granted during fiscal years 2023 and 2022:\nGrant Year\nOptions\nGranted\nExercise\nPrice\nRange\nTerm\n(years)\nVesting\nPeriod\n(years)\nFMV of\noptions\nGranted/Per\nShare\nExpected\nLife (years)\nExpected\nVolatility %\nInterest\nRate %\n640,000\n$ 1.97 - $2.42\n$ 1.07 - $1.28\n3.5\n73.44 - 73.77\n3.03 - 4.10\n1,858,250\n$ 2.21 - $3.64\n$ 1.17 - $1.78\n3.5\n73.25 - 74.52\n1.73 - 3.03\nThe following table summarizes information for stock options outstanding at July 31, 2023:\nRange of Exercise prices Shares Weighted-\nAverage\nRemaining\nContractual\nLife in Years Weighted-\nAverage\nExercise\nPrice\n$1.97 - $2.42 1,757,333 3.5 $ 2.14\n$2.63 - $2.80 1,131,917 1.4 $ 2.72\n$2.93 - $3.39 940,250 3.3 $ 3.34\n3,829,500\nThe following table summarizes information for stock options exercisable at July 31, 2023:\nRange of Exercise prices Shares Weighted- Average Remaining Contractual Life in Years Weighted- Average Exercise Price\n$1.97 - $2.42 728,833 2.6 $ 2.20\n$2.63 - $2.80 1,113,450 1.3 $ 2.72\n$2.93 - $3.39 353,583 3.3 $ 3.34\n2,195,867\nENZO BIOCHEM, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJuly 31, 2023\n(Dollars in thousands except share data)\nRestricted Stock Units\nDuring fiscal year 2023, the Company awarded to its CEO 100,000 RSUs which cliff vest annually over three years whose fair market value was $197 at the time of grant. During fiscal year 2023, the Company awarded to its 3 independent directors 225,564 RSUs which vest over one year whose fair market value was $300. During fiscal year 2023, the Company recognized share based compensation expense of $918 for all RSUs.\nIn November 2021, 260,000 RSUs were awarded to our CEO which vest over three years on the anniversary of his hiring. The fair market value of these RSUs at the date of grant was $881. The Company awarded to its 3 independent directors 117,189 RSUs in April 2022 which cliff vest annually over two years whose fair market value was $300. In July 2022, the Company awarded to its 3 independent directors 124,998 RSUs which vest in one year and whose fair market value was $300. During fiscal year 2022, the Company recognized shared based compensation expense of $295 for these RSUs.\nThe following table summarizes RSU activity for the fiscal year ended July 31, 2023:\nNumber of\nRSUs\noutstanding Weighted\nAverage Fair\nValue per\nUnit at\nDate of\nGrant or\nVesting Weighted\nAverage\nRemaining\nContractual\nTerm Aggregate\nIntrinsic\nValue (000s)\nOutstanding at beginning of fiscal year 502,187 $ 2.95 0.8 years 1,190\nGranted 325,564 $ 1.53\nVested (270,261 ) $ 1.64\nCancelled -\n$\nOutstanding at end of period 557,490 $ 2.21 1.1 years $ 825\nExpected to vest at end of period 557,490 $ 2.21 1.1 years $ 825\nCertain directors had not taken their vested RSU shares, totaling 144,530, as of July 31, 2023. As of July 31, 2023, there was $2,855 of total unrecognized compensation cost related to non-vested share-based payment arrangements granted under the Companys 2011 Incentive Plan, which will be recognized over a weighted average remaining life of approximately one and a half years.\nThe following table summarizes RSU activity for the fiscal year ended July 31, 2022:\nNumber of\nRSUs\noutstanding Weighted\nAverage Fair\nValue per\nUnit at\nDate of\nGrant or\nVesting Weighted\nAverage\nRemaining\nContractual\nTerm Aggregate\nIntrinsic\nValue (000s)\nGranted 502,187 $\nVested -\n-\nCancelled -\n$ -\nOutstanding at end of period 502,187 $ 2.95 1.8 years $ 1,190\nExpected to vest at end of period 502,187 $ 2.95 1.8 years $ 1,190\nENZO BIOCHEM, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJuly 31, 2023\n(Dollars in thousands except share data)\nPerformance Stock Units\nTo better align the long-term interest of executives with growing U.S. practices, beginning in fiscal 2018, the Company granted long-term incentive awards in the form of time based stock options and performance-based restricted stock units (Performance Stock Units or PSUs). The PSUs earned will be determined over a three-year performance period. The primary performance metrics will be revenue and Adjusted EBITDA growth. Payouts are based on revenue and adjusted EBITDA goals met at threshold, target or maximum levels and will be modified based on Total Shareholder Return (TSR) performance relative to Enzos peer group. The PSUs awarded to executive officers in fiscal year 2018 expired in fiscal year 2021 as the 3 year growth goals were not achieved.\nDuring the fiscal years ended 2020 and 2019, the Company awarded additional PSUs to its executive officers. These awards provide for the grant of shares of our common stock at the end of a three-year period based on the achievement of revenue growth and adjusted EBITDA growth goals met at threshold, target or maximum levels over the respective period.\nFor the fiscal year ended July 31, 2023, the Company reversed net total PSU accruals of $82 for former officers who forfeited 28,300 PSUs from the fiscal 2020 award, resulting in net PSU compensation expense of $2. For the fiscal year ended July 31, 2022, the Company reversed net total PSU accruals of $124 for a former officer who forfeited 25,300 and 20,000 PSUs from the fiscal year 2020 and fiscal year 2019 awards, respectively, resulting in net PSU compensation expense of $70.\nDuring the fiscal year ended July 31, 2023, the Company issued 25,200 shares for awards made in fiscal year 2019 and vested at the end of fiscal 2022.\nThe following table summarizes PSUs granted and outstanding through July 31, 2023:\nGrant Date Total Grant Forfeitures Outstanding Fair Market\nValue At\nGrant Date\n(000s)\n10/19/2020 98,600 (53,600 ) 45,000 $ 95\nNote 15 - Employee benefit plans\nThe Company has a qualified Salary Reduction Profit Sharing Plan (the Plan) for eligible U.S. employees under Section 401(k) of the Internal Revenue Code. The Plan provides for voluntary employee contributions through salary reduction and voluntary employer contributions at the discretion of the Company. For the year ended July 31, 2023, the Company authorized employer matched contributions of 50% of the employees contribution of the employees compensation, payable in Enzo Biochem, Inc. common stock. For the year ended July 31, 2022, the Company authorized employer matched contributions of 50% of the employees contribution up to 10% of the employees compensation, payable in Enzo Biochem, Inc. common stock.\nThe share-based 401(k) employer matched contribution was approximately $1,079 and $814 in fiscal years 2023 and 2022, respectively. As of July 31, 2023 and 2022, the Company accrued a total of $263 and $140, respectively in 401(k) matching contribution obligations within the Accrued liabilities account.\nThe Companys Swiss operations provide a pension plan named the Enzo Life Sciences (ELS) AG Vertrag - Nr. 2/401144, (the Swiss Plan) under the Swiss governments social security system for Swiss employees. The current required minimum saving contribution is 13% for employees over age 25 and minimum annual investment return is 1.00%. Employees are required to contribute based on a formula and the Companys Swiss operations make contributions of at least 40% of the employee contribution. The status of the Swiss Plan, which is substantially funded as of December 31, 2022, the latest plan year end, is as follows:\nENZO BIOCHEM, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJuly 31, 2023\n(Dollars in thousands except share data)\nAs of December 31,\nTotal Assets $ 2,780 $ 2,667\nAccumulated Benefit Obligation $ 2,780 $ 2,760\nFunded status 100 % 97 %\nFiscal Year ended July 31,\nEmployer contributions $ 182 $ 144\nThe contract for the Swiss Plan automatically renews on its annual anniversary unless notice of termination is provided three months prior. The current contract will automatically renew on December 31, 2023. Currently, the Company has no plans to change the current funding or plan design. No events have occurred that would impact the Swiss Plan status.\nNote 16 - Commitments\nLeases\nA related party entity owned by a director and a former executive officer of the Company owns the building that the Company leases as its main facility for the discontinued operations. In addition to the minimum annual rentals of space, the lease is subject to annual increases, based on the consumer price index. Annual increases are limited to 3% per year. Rent expense for this lease, inclusive of real estate taxes, approximated $1,937 and $1,867 during fiscal years 2023 and 2022, respectively.\nNote 17 - Contingencies\nIn April 2023, the Company experienced a ransomware attack that impacted certain critical information technology systems. In response, we promptly deployed containment measures, including disconnecting our systems from the internet, launching an investigation with assistance from third-party cybersecurity experts, and notifying law enforcement. We adhered to our disaster recovery plan, which enabled us to maintain operations throughout the incident response process. We are in the process of evaluating the full scope of the costs and related impacts of this incident. The Companys facilities remained open, and we continued to provide services to patients and partners. We later became aware that certain data, including names, test information, and Social Security numbers, was accessed, and in some instances, exfiltrated from the Companys information technology systems as part of this incident. The investigation identified unauthorized access to or acquisition of clinical test information of approximately 2,470,000 individuals. The Social Security numbers of approximately 600,000 of these individuals may also have been involved. Additionally, the Company has determined that some employees information may have been involved. The Company has provided notice to the individuals whose information may have been involved, as well as to regulatory authorities, in accordance with applicable law.\nEnzo Biochem is currently subject to regulatory inquiry from the New York Attorney General and a joint inquiry from the Connecticut and New Jersey Attorneys General. Both inquiries ask questions about the ransomware incident, as well as the corrective actions taken in response. It is not known at this time whether the Attorneys General will seek penalty against the Company. We are unable to evaluate the likelihood of an outcome, favorable or unfavorable, to the Company or to estimate the amount or range of any potential liability, if any, at this time.\nENZO BIOCHEM, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJuly 31, 2023\n(Dollars in thousands except share data)\nThere is also pending Class Action litigation:\nIn re Enzo Biochem Data Breach Litigation, No. 2:23-cv-04282 (EDNY)\nIn the Eastern District of New York twenty putative class actions have been consolidated alleging various harms stemming from the April 2023 data incident. Interim lead counsel has been appointed and a consolidated complaint is due to be filed on November 13, 2023. The complaints seek to certify a federal class as well as several state subclasses. Based on the individual complaints that were filed, we expect the consolidated complaint to bring various statutory and common law claims including negligence, negligence per se, breach of fiduciary duty, breach of implied contract, breach of the implied covenant of good faith and fair dealing, violation of the New Yorks General Business Law § 349, Invasion of Privacy, violations of the Connecticut Unfair Trade Practices Act, violations of the New Jersey Consumer Fraud Act.\nMaria Sgambati et al., v. Enzo Biochem, Inc., et al., Index No. 619511/2023 (N.Y. Sup. Ct.)\nThis is a putative class action pending in state court alleging various harms stemming from the April 2023 data incident. The complaint seeks to certify a class of New York residents. The complaint brings claims of negligence; negligence per se; breach of implied covenant and good faith and fair dealing; breach of duty; breach of implied contract; and violations of New Yorks Deceptive Acts and Practices § 349. We have filed a motion to stay this action pending the resolution of the Federal Action and the motion remains pending.\nLouis v. Enzo Biochem, Inc. et al., Index No. 653281/2023 (N.Y. Sup. Ct.)\nThis is a putative class action pending in state court alleging various harms stemming from the April 2023 data incident. The complaint seeks to certify a class of New York citizens. The complaint brings claims of for negligence; negligence per se; breach of duty, breach of implied contract; breach of implied covenant of good faith and fair dealing; and violations of New Yorks Deceptive Acts and Practices § 349. We have filed a motion to stay this action pending the resolution of the Federal Action and the motion remains pending.\nA provision has been made in the financial statements for a financial contingency for the above matters based on a reasonable estimate; however, the actual exposure may differ.\nOn or about March 2, 2023, a verified complaint was filed in the Supreme Court of the State of New York, New York County captioned Elazar Rabbani v. Mary Tagliaferri, et al., Index No. 651120/2023. The verified complaint purports to assert causes of action for breach of fiduciary duty and corporate waste under N.Y.B.C.L. § 720, and also seeks an accounting and certain injunctive relief. Plaintiff served a copy of the verified complaint on Enzos agent for service in New York on or about March 13, 2023. On August 4, 2023, defendants moved to dismiss all of the causes of action asserted in the verified complaint. Plaintiff filed an amended complaint on or about October 4, 2023, adding, among other things, an additional cause of action for violation of N.Y.B.C.L. § 626. On October 23, 2023, Defendants filed a reply in further support of their motion to dismiss. On October 24, 2023, Plaintiff sought leave to file an opposition brief. Defendants filed an opposition to that request on October 26, 2023. On October 31, 2023, in response to a question from the Courts law clerk, Defendants reiterated that they had elected to apply their original motion to dismiss to the amended pleading. That same day, Plaintiff indicated his intent to file an opposition to that motion on or before November 6, 2023. The Company cannot predict the outcome of this matter.\nThe Company has brought cases in the United States District Court for the District of Delaware (the Court), alleging patent infringement against various companies. In 2017, the Court ruled that the asserted claims of the 180 and 405 Patents are invalid for nonenablement in cases involving Abbott, Becton Dickinson, Gen-Probe, Hologic, and Roche. That ruling was affirmed by the United States Court of Appeals for the Federal Circuit (Federal Circuit) in June 2019. Enzo subsequently filed a petition for certiorari regarding the invalidity ruling for the 180 and 405 Patents in February 2020; the Supreme Court denied Enzos petition on March 30, 2020.\nENZO BIOCHEM, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJuly 31, 2023\n(Dollars in thousands except share data)\nThe Company, along with its subsidiary Enzo Life Sciences, Inc., resolved its claims against Roche regarding the 197 Patent before the Court (civil action No. 12 cv-00106) in July 2022. There is currently one case that was originally brought by the Company that is still pending in the Court. In that case, Enzo alleges patent infringement of the 197 patent against Becton Dickinson Defendants. The claims in that case are stayed.\nIn separate inter partes review proceedings before the U.S. Patent and Trademark Office (PTO) involving, among others, Becton Dickinson, certain claims of the 197 Patent were found unpatentable as anticipated or obvious and cancelled by the Patent Trial and Appeals Board (Board). Enzo appealed that decision to the Federal Circuit. On August 16, 2019, the Federal Circuit affirmed the Boards decision, finding that each of the challenged claims is unpatentable. The Company filed a petition for rehearing and rehearing en banc on October 30, 2019, which the Federal Circuit denied on December 4, 2019. The Company filed a petition for certiorari with the Supreme Court on March 3, 2020, which was denied.\nIn April 2019, the Company entered into an agreement with Hologic and Grifols, resolving litigation resulting from four cases originally brought by the Company in the Court. As a result, Enzo dismissed (1) a stayed patent litigation regarding the 180 and 197 Patent against Hologic in the Court; (2) the Consolidated Appeals against Gen-Probe and Hologic resulting from two cases filed in the Court, and (3) the Companys appeal in the litigation involving the 581 Patent that involved both Hologic and Grifols. As a result of the agreement with Hologic, Hologic withdrew from Enzos Federal Circuit appeal of the Boards adverse rulings in the inter partes review proceedings regarding the 197 Patent filed by Hologic and joined by Becton Dickinson mentioned above.\nOn September 2, 2021, the PTO issued a non-final office action in an ex parte reexamination concerning the 197 Patent. In the office action, the PTO rejected certain claims of the 197 Patent under 35 U.S.C. §§ 102 and 103, and for nonstatutory double-patenting. Enzo responded to the office action on January 3, 2022, and the proceeding remains pending. Becton Dickinson requested another ex parte reexamination concerning the 197 patent on July 26, 2022. On September 16, 2022, the PTO ordered that ex parte reexamination as to certain claims of the 197 patent and has not yet issued an office action. Enzo filed a petition to terminate that second reexamination proceeding on November 16, 2022.\nOn November 27, 2020, the Company brought an action in the United States District Court for the Southern District of New York against Harbert Discovery Fund, LP, Harbert Discovery Co-Investment Fund I, LP, Harbert Fund Advisors, Inc., Harbert Management Corp. and Kenan Lucas (together, Harbert). The Company alleged Harbert made false and misleading representations, or omitted to state material facts necessary to make their statements not misleading, in proxy materials they disseminated seeking the election to the Companys Board of Directors at its 2019 Annual Meeting of two candidates they nominated, in violation of Section 14(a) of the 1934 Exchange Act and Rule 14a-9 thereunder. The Company sought damages and injunctive relief. On October 12, 2021, HDF filed five counterclaims against the Company and present and former directors Dr. Elazar Rabbani, Barry W. Weiner, Dr. Bruce A. Hanna, Dov Perlysky, Rebeca Fischer, Dr. Mary Tagliaferri and Dr. Ian B. Walters. HDF claimed the Company made false and misleading representations in proxy materials it disseminated in connection with its 2019 Annual Meeting, in violation of Section 14(a) of the 1934 Exchange Act and Rule 14a-9 thereunder, and that the Companys directors at that time were liable under Section 20(a) of the Exchange Act for the Companys purported misstatements. HDF also claimed that current and former Company directors breached their fiduciary duties by taking four corporate actions: (a) adjourning the 2019 meeting for 25 days; (b) purportedly causing the two Harbert candidates for director, who were elected at the 2019 Meeting, to resign in November 2020; (c) authorizing the November 27, 2020 Lawsuit; and (d) not accepting Dr. Rabbanis resignation as a director in March 2021. On November 10, 2021, the Company and the other counterclaim defendants moved to dismiss HDFs counterclaims. On December 9, 2021, the court granted the motion to dismiss HDFs counterclaims except HDFs Section 14(a) claim against the Company concerning its statement that it intended to delay the 2019 Annual Meeting, and HDFs Section 20(a) and breach of fiduciary duty counterclaims against Dr. Elazar Rabbani, Barry W. Weiner, Dr. Bruce Hanna, Dov Perlysky and Rebecca Fischer with respect to that statement. The Court allowed HDF to move for leave to replead with respect to its dismissed counterclaims. On June 7, 2022, the Court so ordered a stipulation of dismissal with prejudice of the Companys claims against Harbert Discovery Fund, LP, Harbert Discovery Co-Investment Fund I, LP, Harbert Fund Advisors, Inc., Harbert Management Corp., and Kenan Lucas, and HDFs counterclaims against the Company, Dr. Bruce Hanna, Dov Perlysky, Rebecca Fischer, Dr. Ian B. Walters and Dr. Mary Tagliaferri. The only remaining claims were HDFs counterclaims against Dr. Rabbani and Mr. Weiner. HDF asked the Court to dismiss those claims without prejudice. Dr. Rabbani and Mr. Weiner asked the Court to dismiss those counterclaims with prejudice and to allow them to take discovery from HDF, the Company, and possibly others. On December 1, 2022, the court granted HDFs motion for voluntary dismissal without prejudice, denied Dr. Rabbani and Mr. Weiners motion to compel discovery, and directed the Clerk of the Court to close this case.\nOn or about September 26, 2023, James G. Wolf, Individually and as the Trustee of the Wolf Family Charitable Foundation, Barbaranne R. Wolf, Stephen Paul Wolf, and Preston M. Wolf initiated an appraisal action against Enzo Biochem, Inc. in the New York Supreme Court for Suffolk County. Petitioners seek an appraisal of the value of their shares in the Company. The amount of damages sought by the Petitioners is unspecified. The Company will defend itself vigorously in the appraisal action.\nENZO BIOCHEM, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJuly 31, 2023\n(Dollars in thousands except share data)\nIn our discontinued Clinical Labs operations, third-party payers, including government programs, may decide to deny payment or recoup payments for testing that they contend was improperly billed or not medically necessary, against their coverage determinations, or for which they believe they have otherwise overpaid (including as a result of their own error), and we may be required to refund payments that we received.\nFormer executives arbitration\nThe Company terminated the employment of Elazar Rabbani, Ph.D., the Companys former Chief Executive Officer, effective April 21, 2022. Dr. Rabbani remains a board director of the Company. Dr. Rabbani is a party to an employment agreement with the Company that entitles him to certain termination benefits, including severance pay, acceleration of vesting of share-based compensation, and continuation of benefits. Based on the terms of his employment agreement, the Company estimated and accrued a charge of $2,600 in fiscal year 2022 which is included in Selling, general and administrative expenses. The charge was partially offset by the reversal of bonus accruals. In May 2022, the Company paid Dr. Rabbani $2,123 in severance (the payment constituted taxable income but the Company did not withhold taxes from the payment). In July 2022, the Company paid Dr. Rabbanis income and other withholding taxes of $1,024 related to that payment on Dr. Rabbanis behalf, which was included in prepaid expense and other current assets as of July 31, 2022, as the payment is reimbursable from Dr. Rabbani. Dr. Rabbani disputed, among other things, the Companys decision to not award him a bonus for fiscal year 2021 and the amount of severance that was owed to him under his employment agreement. On July 8, 2022, the Company filed a demand for arbitration with the American Arbitration Association (the AAA) seeking, among other things, a declaration that the Company has fully satisfied its contractual obligations to Dr. Rabbani and seeking the tax withholding reimbursement referenced above. On August 4, 2022, Dr. Rabbani filed counterclaims in the arbitration seeking, among other things, a bonus for fiscal year 2021 and additional severance that he asserts is owed to him. At the parties joint request, the arbitration has been stayed while the parties work towards resolving the matter.\nOn February 25, 2022, Barry Weiner, the Companys co-founder and President, notified the Company that he was terminating his employment as President of the Company for Good Reason as defined in his employment agreement. The Company accepted Mr. Weiners termination, effective April 19, 2022, but disagreed with Mr. Weiners assertion regarding Good Reason. On October 24, 2023, the Company and Mr. Weiner reached an agreement resolving the dispute.\nA provision has been made in the financial statements for these matters based on a reasonable estimate; however, the actual exposure may differ.\nNote 18 - Segment reporting\nThe Company has one reportable segment, Products, which develops, manufactures, and markets products to research and pharmaceutical customers. The Company evaluates segment performance based on segment income (loss) before taxes. Costs excluded from segment income (loss) before taxes and reported as Corporate & Other consist of corporate general and administrative costs which are not allocable to the Products segment.\nLegal and related expenses incurred to defend the Companys intellectual property, which may result in settlements recognized in another segment and other general corporate matters are considered a component of the Corporate & Other segment. Legal and related expenses specific to the Products segments activities are allocated to that segment.\nLegal settlements, net, represent activities for which royalties would have been received in the Companys Products segment. Management of the Company assesses assets on a consolidated basis only and therefore, assets by reportable segment have not been included in the reportable segments below. The accounting policies of the reportable segment are the same as those described in the summary of significant accounting policies.\nENZO BIOCHEM, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJuly 31, 2023\n(Dollars in thousands except share data)\nThe following financial information represents the operating results of the reportable segments of the Company:\nYear ended July 31, 2023\nProducts Corporate\n& Other Consolidated\nRevenues - Products $ 31,061 -\n$ 31,061\nOperating costs and expenses:\nCost of revenues 17,866 -\n17,866\nCosts of revenues - inventory provision 1,629 -\n1,629\nResearch and development 3,864 3,904\nSelling, general and administrative 12,302 $ 14,900 27,202\nLegal and related expenses 5,123 5,196\nTotal operating costs and expenses 35,734 20,063 55,797\nOperating loss (4,673 ) (20,063 ) (24,736 )\nOther income (expense)\nInterest (1,240 ) (1,122 )\nChange in fair value of convertible debentures -\n(824 ) (824 )\nOther\nForeign exchange gain 1,280 -\n1,280\nLoss before taxes $ (3,268 ) $ (21,754 ) $ (25,022 )\nDepreciation and amortization included above $ 687 $ 365 $ 1,052\nShare-based compensation included above:\nSelling, general and administrative 1,669 1,750\nCost of sales -\nTotal $ 103 $ 1,669 $ 1,772\nCapital expenditures $ 1,694 $ 650 $ 2,344\nENZO BIOCHEM, INC.\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nJuly 31, 2023\n(Dollars in thousands except share data)\nYear ended July 31, 2022\nProducts Corporate\n& Other Consolidated\nRevenues - Services and Products $ 32,643 -\n$ 32,643\nOperating costs and expenses:\nCost of revenues 19,213 -\n19,213\nResearch and development 2,383 2,438\nSelling, general and administrative 12,516 $ 10,568 23,084\nLegal and related expenses 5,249 5,435\nLegal settlements (500 ) -\n(500 )\nTotal operating costs and expenses 33,798 15,872 49,670\nOperating loss (1,155 ) (15,872 ) (17,027 )\nOther income (expense)\nInterest\nOther (1,272 ) (1,268 )\nForeign exchange loss (2,222 ) -\n(2,222 )\nLoss before taxes $ (3,328 ) $ (17,011 ) $ (20,339 )\nDepreciation and amortization included above $ 813 $ 303 $ 1,116\nShare-based compensation included above:\nSelling, general and administrative 1,270 1,292\nCost of sales -\nTotal $ 28 $ 1,270 $ 1,298\nCapital expenditures $ 1,915 $ 628 $ 2,543\nENZO BIOCHEM, INC\nSCHEDULE II\nVALUATION AND QUALIFYING ACCOUNTS\nAs of and for the Years ended July 31, 2023 and 2022\n(in thousands)\nYear ended July 31,\nDescription\nBalance at\nBeginning\nof Year\nCharged\n(credited)\nto costs\nand expenses\nCharged\nto other\naccounts\nDeductions\nBalance at\nend of\nYear\nAllowance for doubtful accounts receivable\n$\n$\n$ -\n$\nAllowance for doubtful accounts receivable\n(1)\nDeferred tax valuation allowance\n34,610\n(7,925)\n-\n26,685\nDeferred tax valuation allowance\n29,874\n4,736\n-\n34,610\n(1) Write-off of uncollectible accounts receivable.\nS-1\n0.42 0.51 0.04 0.92 0.38 0.41\n0.42 0.51 0.04 0.92 0.38 0.41\nfalse FY New York\n2022-08-01 2023-07-31\n2023-01-31\n2023-10-27\n2023-07-31\n2022-07-31\n2021-08-01 2022-07-31\nus-gaap:CommonStockMember\n2021-07-31\nus-gaap:AdditionalPaidInCapitalMember\n2021-07-31\nus-gaap:RetainedEarningsMember\n2021-07-31\nus-gaap:AccumulatedOtherComprehensiveIncomeMember\n2021-07-31\n2021-07-31\nus-gaap:CommonStockMember\n2021-08-01 2022-07-31\nus-gaap:AdditionalPaidInCapitalMember\n2021-08-01 2022-07-31\nus-gaap:RetainedEarningsMember\n2021-08-01 2022-07-31\nus-gaap:AccumulatedOtherComprehensiveIncomeMember\n2021-08-01 2022-07-31\nus-gaap:CommonStockMember\n2022-07-31\nus-gaap:AdditionalPaidInCapitalMember\n2022-07-31\nus-gaap:RetainedEarningsMember\n2022-07-31\nus-gaap:AccumulatedOtherComprehensiveIncomeMember\n2022-07-31\nus-gaap:CommonStockMember\n2022-08-01 2023-07-31\nus-gaap:AdditionalPaidInCapitalMember\n2022-08-01 2023-07-31\nus-gaap:RetainedEarningsMember\n2022-08-01 2023-07-31\nus-gaap:AccumulatedOtherComprehensiveIncomeMember\n2022-08-01 2023-07-31\nus-gaap:CommonStockMember\n2023-07-31\nus-gaap:AdditionalPaidInCapitalMember\n2023-07-31\nus-gaap:RetainedEarningsMember\n2023-07-31\nus-gaap:AccumulatedOtherComprehensiveIncomeMember\n2023-07-31\n2023-07-01 2023-07-24\nus-gaap:ParentMember\n2022-08-01 2023-07-31\nus-gaap:ParentMember\n2021-08-01 2022-07-31\nsrt:ParentCompanyMember\n2023-07-31\nsrt:ParentCompanyMember\n2022-07-31\nus-gaap:CorporateAndOtherMember\n2022-08-01 2023-07-31\nus-gaap:CorporateAndOtherMember\n2021-08-01 2022-07-31\nenz:ForeignBankMember\n2023-07-31\nenz:ForeignBankMember\n2022-07-31\nenz:ClinicalLabsMember\n2021-07-31\nenz:ClinicalLabsMember\n2019-08-01 2020-07-31\nsrt:MinimumMember us-gaap:BuildingAndBuildingImprovementsMember\n2023-07-31\nsrt:MaximumMember us-gaap:BuildingAndBuildingImprovementsMember\n2023-07-31\nsrt:MinimumMember us-gaap:MachineryAndEquipmentMember\n2023-07-31\nsrt:MaximumMember us-gaap:MachineryAndEquipmentMember\n2023-07-31\nenz:OutOfTheMoneyMember\n2022-08-01 2023-07-31\nenz:OutOfTheMoneyMember\n2021-08-01 2022-07-31\nenz:CostOfRevenuesMember\n2022-08-01 2023-07-31\nenz:CostOfRevenuesMember\n2021-08-01 2022-07-31\nus-gaap:SellingGeneralAndAdministrativeExpensesMember\n2022-08-01 2023-07-31\nus-gaap:SellingGeneralAndAdministrativeExpensesMember\n2021-08-01 2022-07-31\nenz:ProductRevenueMember country:US\n2022-08-01 2023-07-31\nenz:ProductRevenueMember country:US\n2021-08-01 2022-07-31\nenz:ProductRevenueMember srt:EuropeMember\n2022-08-01 2023-07-31\nenz:ProductRevenueMember srt:EuropeMember\n2021-08-01 2022-07-31\nenz:ProductRevenueMember srt:AsiaPacificMember\n2022-08-01 2023-07-31\nenz:ProductRevenueMember srt:AsiaPacificMember\n2021-08-01 2022-07-31\nenz:ProductRevenueMember\n2022-08-01 2023-07-31\nenz:ProductRevenueMember\n2021-08-01 2022-07-31\nus-gaap:BuildingAndBuildingImprovementsMember\n2023-07-31\nus-gaap:BuildingAndBuildingImprovementsMember\n2022-07-31\nus-gaap:MachineryAndEquipmentMember\n2023-07-31\nus-gaap:MachineryAndEquipmentMember\n2022-07-31\nus-gaap:OfficeEquipmentMember\n2023-07-31\nus-gaap:OfficeEquipmentMember\n2022-07-31\nus-gaap:LeaseholdImprovementsMember\n2023-07-31\nus-gaap:LeaseholdImprovementsMember\n2022-07-31\nus-gaap:DomesticCountryMember\n2022-08-01 2023-07-31\nus-gaap:DomesticCountryMember\n2021-08-01 2022-07-31\nus-gaap:ForeignCountryMember\n2022-08-01 2023-07-31\nus-gaap:ForeignCountryMember\n2021-08-01 2022-07-31\nenz:JGBCollateralLLCMember\n2023-05-19\n2023-05-01 2023-05-19\n2023-05-19\nenz:ConversionPriceMember\n2023-07-31\n2023-03-01 2023-03-16\n2023-03-16\nenz:SOFRMember\n2022-08-01 2023-07-31\nenz:CitibankNAMember\n2023-07-31\nenz:CitibankNAMember\n2018-11-01 2018-11-30\n2020-04-30\n2020-07-31\n2022-03-01 2022-03-31\nenz:CitibankNAMember\n2020-04-30\n2021-06-01 2021-06-30\n2022-06-01 2022-06-30\nsrt:MinimumMember\n2022-08-01 2023-07-31\nsrt:MaximumMember\n2022-08-01 2023-07-31\nenz:TwoThousandElevenPlanMember\n2011-01-31\nenz:TwoThousandElevenPlanMember\n2018-01-01 2018-01-31\nenz:TwoThousandElevenPlanMember\n2018-01-31\nus-gaap:RestrictedStockUnitsRSUMember\n2023-07-31\n2021-11-08\n2021-11-08 2021-11-08\nus-gaap:RestrictedStockUnitsRSUMember\n2022-08-01 2023-07-31\n2021-11-30\n2022-04-01 2022-04-30\n2022-07-01 2022-07-31\nus-gaap:PhantomShareUnitsPSUsMember\n2022-08-01 2023-07-31\nsrt:MinimumMember\n2021-08-01 2022-07-31\nsrt:MaximumMember\n2021-08-01 2022-07-31\nsrt:MinimumMember enz:StockOptionsOutstandingMember enz:ExercisePriceRange197242Member\n2023-07-31\nsrt:MaximumMember enz:StockOptionsOutstandingMember enz:ExercisePriceRange197242Member\n2023-07-31\nenz:StockOptionsOutstandingMember enz:ExercisePriceRange197242Member\n2023-07-31\nenz:StockOptionsOutstandingMember enz:ExercisePriceRange197242Member\n2022-08-01 2023-07-31\nsrt:MinimumMember enz:StockOptionsOutstandingMember enz:ExercisePriceRange263280Member\n2023-07-31\nsrt:MaximumMember enz:StockOptionsOutstandingMember enz:ExercisePriceRange263280Member\n2023-07-31\nenz:StockOptionsOutstandingMember enz:ExercisePriceRange263280Member\n2023-07-31\nenz:StockOptionsOutstandingMember enz:ExercisePriceRange263280Member\n2022-08-01 2023-07-31\nsrt:MinimumMember enz:StockOptionsOutstandingMember enz:ExercisePriceRange293339Member\n2023-07-31\nsrt:MaximumMember enz:StockOptionsOutstandingMember enz:ExercisePriceRange293339Member\n2023-07-31\nenz:StockOptionsOutstandingMember enz:ExercisePriceRange293339Member\n2023-07-31\nenz:StockOptionsOutstandingMember enz:ExercisePriceRange293339Member\n2022-08-01 2023-07-31\nenz:StockOptionsOutstandingMember enz:ExercisePriceRangeMember\n2023-07-31\nsrt:MinimumMember enz:StockOptionsExercisableMember enz:ExercisePriceRange197242Member\n2023-07-31\nsrt:MaximumMember enz:StockOptionsExercisableMember enz:ExercisePriceRange197242Member\n2023-07-31\nenz:StockOptionsExercisableMember enz:ExercisePriceRange197242Member\n2023-07-31\nenz:StockOptionsExercisableMember enz:ExercisePriceRange197242Member\n2022-08-01 2023-07-31\nsrt:MinimumMember enz:StockOptionsExercisableMember enz:ExercisePriceRange263280OneMember\n2023-07-31\nsrt:MaximumMember enz:StockOptionsExercisableMember enz:ExercisePriceRange263280OneMember\n2023-07-31\nenz:StockOptionsExercisableMember enz:ExercisePriceRange263280OneMember\n2023-07-31\nenz:StockOptionsExercisableMember enz:ExercisePriceRange263280OneMember\n2022-08-01 2023-07-31\nsrt:MinimumMember enz:StockOptionsExercisableMember enz:ExercisePriceRange293339OneMember\n2023-07-31\nsrt:MaximumMember enz:StockOptionsExercisableMember enz:ExercisePriceRange293339OneMember\n2023-07-31\nenz:StockOptionsExercisableMember enz:ExercisePriceRange293339OneMember\n2023-07-31\nenz:StockOptionsExercisableMember enz:ExercisePriceRange293339OneMember\n2022-08-01 2023-07-31\nenz:StockOptionsExercisableMember enz:ExercisePriceRangeMember\n2023-07-31\nus-gaap:RestrictedStockUnitsRSUMember\n2022-07-31\nus-gaap:RestrictedStockUnitsRSUMember\n2021-08-01 2022-07-31\nenz:GrantDateTwoMember\n2022-08-01 2023-07-31\nenz:GrantDateTwoMember\n2023-07-31\nenz:EnzoBiochemIncMember\n2022-08-01 2023-07-31\nenz:EnzoBiochemIncMember\n2021-08-01 2022-07-31\nenz:EnzoLifeSciencesOneMember\n2022-08-01 2023-07-31\nenz:EnzoLifeSciencesMember\n2022-08-01 2023-07-31\n2020-08-01 2021-07-31\n2022-05-01 2022-05-31\nenz:ProductsMember\n2022-08-01 2023-07-31\nus-gaap:CorporateAndOtherMember\n2022-08-01 2023-07-31\nenz:ConsolidatedMember\n2022-08-01 2023-07-31\nenz:ProductsMember\n2021-08-01 2022-07-31\nus-gaap:CorporateAndOtherMember\n2021-08-01 2022-07-31\nenz:ConsolidatedMember\n2021-08-01 2022-07-31\nenz:AllowanceForDoubtfulAccountsReceivableMember\n2022-07-31\nenz:AllowanceForDoubtfulAccountsReceivableMember\n2022-08-01 2023-07-31\nenz:AllowanceForDoubtfulAccountsReceivableMember\n2023-07-31\nenz:AllowanceForDoubtfulAccountsReceivableMember\n2021-07-31\nenz:AllowanceForDoubtfulAccountsReceivableMember\n2021-08-01 2022-07-31\nus-gaap:ValuationAllowanceOfDeferredTaxAssetsMember\n2022-07-31\nus-gaap:ValuationAllowanceOfDeferredTaxAssetsMember\n2022-08-01 2023-07-31\nus-gaap:ValuationAllowanceOfDeferredTaxAssetsMember\n2023-07-31\nus-gaap:ValuationAllowanceOfDeferredTaxAssetsMember\n2021-07-31\nus-gaap:ValuationAllowanceOfDeferredTaxAssetsMember\n2021-08-01 2022-07-31\niso4217:USD\nxbrli:shares\niso4217:USD\nxbrli:shares\nxbrli:pure\niso4217:CHF"
}