{
    "cik": "356037",
    "company": "CSP INC /MA/",
    "filing_type": "10-K",
    "filing_date": "2022-12-08",
    "period_of_report": "2022-09-30",
    "sic": "7373",
    "state_of_inc": "MA",
    "state_location": "MA",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/356037/0000356037-22-000036-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/356037/000035603722000036/cspi-20220930x10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/356037/0000356037-22-000036.txt",
    "filename": "356037_10K_2022_0000356037-22-000036.htm",
    "content": "Item 1. Business\nCSP Inc. (\"CSPi\" or \"CSPI\" or \"the Company\" or \"we\" or \"our\") was incorporated in 1968 and is based in Lowell, Massachusetts. To meet the diverse requirements of our commercial and defense customers worldwide, CSPi and its subsidiaries develop and market IT integration solutions, advanced security products, managed IT services, cloud services, purpose built network adapters, and high-performance cluster computer systems.\nSegments\nCSPI operates in two segments: Technology Solutions (\"TS\") and High Performance Products (\"HPP\").\nTS Segment\n● The TS segment consists of our wholly-owned Modcomp, Inc. subsidiary, which operates in the United States and the United Kingdom.\n·\nThe TS segment generates product revenues by reselling third-party computer hardware and software as a value added reseller (\"VAR\"). The TS segment generates service revenues by the delivery of professional services for complex IT solutions, including advanced security; unified communications and collaboration; wireless and mobility; data center solutions; and network solutions as well as managed IT services (\"MSP\") that primarily serve the small and mid-sized business market (\"SMB\").\n·\nThird party products and professional services are marketed and sold through the Companys direct sales force into a variety of vertical markets, including; automotive; defense; health care; education; federal, state and local government; and maritime.\nHPP Segment\n● The HPP segment revenue comes from three distinct product lines: (i) a cybersecurity solution marketed as ARIA™ Software-Defined Security (SDS), which is offered to commercial, original equipment manufacturers (\"OEM\") and government customers; (ii) the Myricom® network adapters for commercial, government and OEM customers; and (iii) the legacy Multicomputer product portfolio for digital signal processing (\"DSP\") applications within the defense markets.\n● The ARIA SDS solution is a software portfolio starting with an underlying platform, hosted applications that reside on top, as well as any supporting hardware then deployed in turn-key security deployments. All are developed to secure an organizations network, enterprise-wide, to better protect critical devices, applications and high-value data from breaches or other disruptive attacks. Revenue is derived from: (i) license sales of our software platform components, (ii) supporting hardware and (iii) any required support packages. The software licenses, as well as the support packages, are renewable on a recurring basis. The ARIA SDS platform and applications can also be deployed on customer provided virtual machines or on our Myricom SmartNIC adapters which can be directly inserted into our customers servers or integrated as part of our turn-key appliances. Either of these approaches can be deployed into a customers data center environments or within Cloud Platform services such as AWS and Azure to provide cybersecurity services.\n● The ARIA portfolio is of value to regulated industries, such as financial services or healthcare, due to the rise of data-privacy regulations enforced at the federal, U.S. state, and international level, as well as industry entities. Due to the COVID-19 pandemic and the resulting increase in hybrid remote workforce models, we believe ARIA SDS will provide additional protection against exploits entering in from home-based computers and networks. In addition, due to the complexities and high-costs associated with enterprise-wide security, particularly in the creation and operation of Security Operation Centers (SOCs), we believe that ARIA will be attractive to organizations that desire SOC level protections without incurring the procurement of disparate\ntools and the need to hire and retain highly-trained security analysts. We also have begun selling our unique, solution into Managed Security Service Providers (MSSPs) that want to offer a lower cost, more effective service at detecting todays widening range of cyber attacks. The ARIA SDS portfolio of software based products will continue to expand based on customer feedback during Fiscal 2023.\n● The Myricom SmartNIC adapters (ARC Series and Myricom Secure Intelligent Adapters or SIA) are optimized for and sold into markets that require high-bandwidth and low-latency including (i) packet capture, (ii) financial transactions, (iii) machine vision and (iv) network security. Our primary customers for packet capture include government agencies that need to capture and/or analyze network traffic at line rate, and OEMs selling into vendors of computer security appliances. Financial institutions, such as banks and brokerage firms, use Myricom adapters to decrease transaction times. Our machine vision customers, primarily in the manufacturing industry, use our adapters and software for high fidelity video capture and processing.\n● There was limited revenue for HPP products in fiscal 2022. This was primarily due to supply chain issues which delayed delivery of components used by our Myricom Hardware. We hope to clear the majority of our backlog during the first half of FY 2023.\n● Multicomputer products for DSP applications are no longer actively developed but will continue to be sold into established programs and supported for several years. Revenue flows come from servicing previously deployed products for a modest number of existing high-value defense customers. The revenue from these products, as a percentage of overall Company revenue, is expected to continue to decline over time.\nSales Information by Industry Segment\nThe following table details our sales by operating segment for fiscal years ending September 30, 2022 and 2021. Additional segment and geographical information are set forth in Note 18 Segment Information to the consolidated financial statements.\nSegment\n%\n%\n(Dollar amounts in thousands)\nTS\n$\n50,518\n%\n$\n44,585\n%\nHPP\n3,843\n%\n4,623\n%\nTotal Sales\n$\n54,361\n%\n$\n49,208\n%\nTS Segment\nProducts and Services\nIntegration Solutions\nThe TS segment is a value-added reseller (\"VAR\") of third-party hardware and software technology solutions along with our, advanced technology consulting, professional IT, managed IT and Cloud services. Our value proposition is our ability to support the complete IT life cycle of planning, designing, implementing and optimizing a comprehensive solution into our customers IT environments, to help achieve their expected business outcomes.\nThird-Party Hardware and Software\nWe sell third-party hardware, software, and information technology products, with a strategic focus on industry standard servers and data center infrastructure solutions, midrange data storage infrastructure products, networking and mobility products, unified communications, and advanced IT security hardware and software solutions. Our key offerings include products from Hewlett Packard (HPE)/Aruba, Cisco Systems, Palo Alto Networks, Nutanix, DellEMC, Juniper Networks, Citrix, Intel, VMWare, Fortinet, Microsoft and Barracuda. Through our business relationships with these vendors, we are able to offer competitively priced robust products to meet our diverse customers technology needs,\nproviding procurement and engineering expertise in server infrastructure, storage, security, unified communications, mobility and networking, to the small-to-medium sized businesses (\"SMBs\") and large enterprise businesses (\"LEBs\") with unique and/or complex IT environments. Many of our SMB customers have unique technology needs and may lack technical purchasing expertise or have very limited IT engineering resources on staff. We offer our customers a single point of contact for complicated multi-vendor technology purchases. We also provide installation, integration, logistical assistance and other value-added services that customers may require. We target SMB and LEB customers across all industries. Our current customers are in web and infrastructure hosting, education, telecommunications, healthcare services, distribution, financial services, professional services and manufacturing.\nProfessional Services\nWe provide professional IT consulting services in the following areas:\n● Assessments, planning, designing, implementation, migration, optimization services and project management.\n● Hyper-Converged Infrastructure (\"HCI\"). We assist our clients with designing and implementing HCI solutions from multiple vendors including DellEMC, Nutanix, HPE and Cisco. HCI is a software-centric architecture that tightly integrates compute, storage and virtualization resources in a single system. The benefits of an HCI solution are improved performance, scalability and flexibility all in a reduced footprint.\n● Virtualization. We help our customers implement virtualization solutions using products from companies such as VMWare, Nutanix and Citrix that allow one computer to do the job of multiple computers by sharing resources of a single computer across multiple environments. Virtualization eliminates physical and geographical limitations and enables users to host multiple operating systems and applications on fewer servers. Benefits include energy cost savings, lower capital expenditure requirements, high availability of resources, better desktop management, increased security and improved disaster recovery.\n● Enterprise security intrusion prevention, network access control and unified threat management. Using third-party products from companies like Palo Alto, Aruba Networks, Juniper Networks, Fortinet, Barracuda and Cisco Systems, our services are designed to ensure data security and integrity through the establishment of virtual private networks, firewalls and other technologies.\n● IT security compliance services. We provide services for IT security compliance with personal privacy laws such as the Payment Card Industry Data Security Standard (\"PCI DSS\"), the Health Insurance Portability and Accountability Act of 1996 (\"HIPAA\"), and internal control regulations under the Sarbanes-Oxley Act (\"SOX\").\n● Unified communications, using Cisco Systems and Microsoft solutions. We are Cisco Premier Partner approved for its Cloud and Managed Services Program for Managed Business Communications and a Microsoft Gold Partner with specialties in Cloud, and Collaboration solutions.\n● Wireless, routing, and switching solutions using Juniper Networks and Aruba Networks products and services.\n● Custom software applications and solutions development and support. We develop custom applications to customer specifications using industry standard platforms such as Microsoft.Net, SharePoint and OnBase. We are a Microsoft Gold Partner.\n● Managed IT services that include monitoring, reporting and management of alerts for the resolution and preventive general IT and IT security support tasks.\n● Optimization, maintenance and technical support for third-party products including hardware and software, operating system and user support.\nManaged IT and Cloud Services\nAs consumption models continue to evolve in our industry, we have developed a robust managed and cloud services portfolio to provide alternative solutions to traditional capital expenditure investments in IT solutions and IT operations for our clients. Our value is to provide an elastic offering that will allow the client to scale and consume these offerings with monthly billing options that help control costs and provide economies of scale.\nWe provide managed and cloud services in the following areas:\n● Proactive monitoring and remote management of IT Infrastructure that includes network (both wired and wireless), data center (which includes compute, storage and virtualization), desktops, unified communications platforms and security.\n● Managed and Hosted Unified Communication as a Service via a Cisco Communication and Collaboration solution under an annuity program.\n● Managed Security (firewall, endpoint protection, malware, anti-virus Managed Detection & Response).\n● Managed BackUp and Replication.\n● Cloud services that include Microsoft 365, Azure, Azure Virtual Desktop, Greencloud, Amazon Web Services and Google Cloud Platform.\nMarkets and Marketing\nWe are an IT systems integrator and computer hardware and software VAR. We also provide technical services to achieve a value-add to our customers. We operate within the VAR sales channels of major computer hardware and software OEMs, primarily within the geographic areas of our sales offices and across the U.S. We provide innovative IT solutions, including a myriad of infrastructure products with customized professional IT consulting services and managed services to meet the unique requirements of our customers. We market the products and services we sell through sales offices in the U.S. and the U.K. using our direct sales force.\nCompetition\nOur primary competition in the TS segment are other VARs ranging from small companies that number in the thousands, to large enterprises such as CDW, PC Connection, Insight, Presidio, Dimension Data, and Computacenter Limited. In addition, we compete directly with many of the companies that manufacture the third-party products we sell, including Cisco Systems, IBM, HPE, EMC (now part of Dell) and others. In the network management, security and storage systems integration services business, our competitors are extensive and vary to a certain degree in each of the geographical markets, but they also include such national competitors as HP/EDS, IBM and Cap Gemini.\nNearly all of our product offerings are available through other channels. Favorable competitive factors for the TS segment include procurement capability, product diversity which enables the delivery of complete and custom solutions to our customers and the strength of our key business relationships with the major IT OEMs. We also consider our ability to meet the unique and/or specialized needs of the SMB and LEB markets and our strong knowledge of the IT products that we sell to be a key competitive advantage. Our ability to provide managed services through our network operations center and the professional IT services required to design and implement custom IT solutions to address our customers' IT needs are distinct competitive advantages. Unfavorable competitive factors include low name recognition, limited geographic coverage and pricing.\nSources and Availability of Product\nSeveral components used in our HPP segment products are obtained from sole-source suppliers. We are dependent on key vendors such as Xilinx, NXP, NVIDIA, Marvel, and BCRM for a variety of processors for certain products. While we believe that many of our competitors face similar supply chain risks, we continue to work closely with our long term suppliers in meeting our projected sales obligations; however, if a long term supplier is unable to provide sufficient components, and we are unable to find alternative suppliers, our projected sales may be materially impacted.\nCOVID-19 has adversely affected manufacturers, which has led to production disruptions, resulting in supply shortages. We are working to clear the backlog in fiscal 2023, although, there can be no assurances that supply shortages will be resolved or that our backlog will be timely cleared.\nBacklog\nThe gross backlog of customer orders and contracts for the TS segment was approximately $18.2 million at September 30, 2022, as compared to $8.7 million at September 30, 2021. Our backlog can fluctuate greatly. These fluctuations can be due to the timing of receiving large orders for third-party products and/or IT services. It is expected that all of the customer orders in backlog will ship and/or be provided during fiscal year 2023.\nHPP Segment\nProducts and Services\nThe mission of the HPP team is to deliver a differentiated, smarter approach to cybersecurity. Our software-defined platform makes it easier for organizations to achieve enterprise-wide network security and protection of critical assets, applications and devices by improving their ability to find, stop, and prevent cyberattacks.\nMarkets and Marketing\nCyber Security Products Market\nThe ARIA SDS solution is targeted at organizations that need to get additional functionality out of their current cybersecurity solutions to find and stop attacks, while also reducing their operating costs. At the present time, our ARIA SDS solutions are primarily offered through our direct sales channel, however, we have begun to add channel partners such as independent resellers.\nOEM vendors in the cybersecurity market can benefit from integrating the ARIA applications and leveraging them as internal solutions to allow their applications to scale, add critical functionality. OEMs are interested in the Myricom Adapters including our SIA SmartNIC running our ARIA SDS applications.\nAs mentioned, MSSPs require simple, yet differentiated, solutions that can be deployed across their customer bases. The detection, and automation capabilities found in ARIA SDS are valuable as they allow these security service providers to scale their offerings while increasing the productivity of their security operation center staff.\nAerospace & Defense Market\nOur focus for fiscal 2023 and beyond is to continue our support of system deployments to be made by government entities.\nFinancial Transactions Market\nMyricom network adapters with DBL application software address the need for the ultra-low latency required in the world of financial trading. Running DBL on the Myricom ARC Series provides acceleration for 10G Ethernet\nenvironments, with benchmarked application-to-application latency in the single digit microsecond range for Linux and Microsoft Windows operating systems.\nPacket Capture Market\nMyricom Sniffer10G software, running on Myricom ARC adapters, provides enterprise and government customers and partners the ability to capture, inject, and analyze network traffic at line rate, with low CPU overhead.\nMachine Vision Market\nMyricom ARC network adapters are used by OEMs for machine vision camera systems network applications, These OEM customers require the high-performance, low latency 10G attributions our solutions support.\nCompetition\nCSPis competition in the cybersecurity space comes primarily from the large, traditional security vendors like Splunk, IBM, and McAfee. We also face competition from traditional network security solutions vendors such as Palo Alto and Cisco.\nManufacturing, Assembly and Testing\nCurrently, products are shipped to our customers directly from our plant in Lowell, Massachusetts. Our manufacturing activities consist mainly of final assembly and testing of printed circuit boards and systems that are designed by us and fabricated by outside third-party vendors, as well as integration of our software onto the Myricom NICs and turnkey appliances.\nSources and Availability of Raw Materials\nSeveral components used in our HPP segment products are obtained from sole-source suppliers. We are dependent on key vendors such as Xilinx, NXP, NVIDIA, Marvel, and BCRM for a variety of processors for certain products. While we face the same supply chain risks as the rest of our competitors, we continue to work closely with our long term suppliers to meet our projected sales obligations.\nCOVID-19 has adversely affected manufacturers, which has led to production disruptions, resulting in supply shortages. We are working to clear the backlog in fiscal 2023.\nResearch and Development\nFor the year ended September 30, 2022, our expenses for R&D were approximately $3.1 million compared to approximately $2.9 million for the year ended September 30, 2021. Expenditures for R&D are expensed as they are incurred. Product development efforts in fiscal year 2022 and 2021 involved development of the ARIA SDS product set, ARIA Zero Trust (AZT), and enhancements to our Myricom products. We expect to continue to make investments related to the development of new hardware adapter products and new cybersecurity software applications.\nIntellectual Property\nWe rely on a combination of trademark and trade secret laws in the United States and other jurisdictions, as well as confidentiality procedures and contractual provisions to protect our intellectual property rights. We have newly issued as well as pending patents for the ARIA SDS software and will be pursuing additional patent rights over time.\nBacklog\nThe gross backlog of customer orders and contracts in the HPP segment was $5.0 million at September 30, 2022 as compared to $4.3 million at September 30, 2021. Our backlog can fluctuate greatly. We can experience possible large\nfluctuations due to the timing of receipt of large orders often for purchases from prime contractors for sales to the government. It is expected nearly all of the customer orders in backlog will ship and/or be provided through fiscal year 2023.\nSignificant Customers\nSee Note 18 Segment Information in the notes to the consolidated financial statements for detailed information regarding customers which comprised more than 10% of consolidated revenues for the years ended September 30, 2022 and 2021.\nEmployees\nAs of September 30, 2022, we had approximately 117 full time equivalent employees worldwide for our consolidated operations. None of our employees are represented by a labor union and we have had no work stoppages in the last three fiscal years. We consider relations with our employees to be good.\nCompany Website\nThe United States Securities and Exchange Commission (SEC) maintains an internet site (www.sec.gov) that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC. The Companys internet address is http://www.cspi.com. Through that address, the Companys Annual Report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and amendments to those reports are available free of charge as soon as reasonably practicable after they are filed with the SEC. The information contained on the Companys website is not included in, nor incorporated by reference into, this annual report on Form 10-K.\nFinancial Information about Geographic Areas\nInformation regarding our sales by geographic area and percentage of sales based on the location to which the products are shipped or services rendered are in Note 18 Segment Information of the notes to the consolidated financial statements. Item 1A. Risk Factors\nIf any of the risks and uncertainties set forth below actually materialize, our business, financial condition and/or results of operations could be materially and adversely affected, the trading price of our common stock could decline and a stockholder could lose all or part of its, his or her investment. The risks and uncertainties set forth below are not the only ones we face. Additional risks and uncertainties not presently known to us or that we currently consider immaterial may also impair our business operations.\nEconomic, Industry, and Operational Risks\nWe depend on a small number of customers for a significant portion of our revenue and loss of any customer could significantly affect our business.\nBoth the HPP and TS segments are reliant upon a small number of significant customers, and the loss of or significant reduction in sales to any one of which could have a material adverse effect on our business. For the fiscal year ended September 30, 2022, one customer accounted for $10.4 million, or 19%, of our total revenues for the fiscal year. For the fiscal year ended September 30, 2021, no one customer accounted for 10% or more of our total revenues for the fiscal year. In addition, our revenues are largely dependent upon the ability of our customers to continue to grow or need services or to develop and sell products that incorporate our products. No assurance can be given that our customers will not experience financial or other difficulties that could adversely affect their operations and, in turn, our results of operations.\nWe depend on key personnel and skilled employees and face competition in hiring and retaining qualified employees.\nWe are largely dependent upon the skills and efforts of our senior management, managerial, sales and technical employees. None of our senior management personnel or other key employees are subject to any employment contracts except Victor Dellovo, our Chief Executive Officer and President. The loss of services of any of our executives or other key personnel could have a material adverse effect on our business, financial condition and results of operations. Our future success will depend to a significant extent on our ability to attract, train, motivate and retain highly skilled technical professionals. Our ability to maintain and renew existing engagements and obtain new business depends, in large part, on our ability to hire and retain technical personnel with the skills that keep pace with continuing changes in our industry standards and technologies. The inability to hire additional qualified personnel could impair our ability to satisfy or grow our client base. There can be no assurance that we will be successful in retaining current or future employees.\nOur success depends in part on our timely introduction of new products and technologies and our results can be impacted by the effectiveness of our significant investments in new products and technologies\nWe have made significant investments in our ARIA SDS cyber security products and services that may not achieve expected returns. We will continue to make significant investments in research, development, and marketing for ARIA products, services, and technologies. Commercial success depends on many factors, including innovativeness, developer support, and effective distribution and marketing. If customers do not perceive our latest offerings as providing significant new functionality or other value, they may reduce their purchases of new software and hardware products or upgrades, unfavorably affecting revenue. We may not achieve significant revenue from new product, service, and distribution channel investments for several years. New products and services may not be profitable, and even if they are profitable, operating margins for some new products and businesses may not be as high as the margins we have experienced historically. Developing new technologies and products is complex. It can require long development and testing periods. Significant delays in new releases or significant problems in creating new products or services could adversely affect our revenue.\nTo be successful, we must respond to the rapid changes in technology. If we are unable to do so on a timely basis our business could be materially adversely affected.\nOur future success will depend in large part on our ability to enhance our current products and to develop new commercial products on a timely and cost-effective basis in order to respond to technological developments and changing customer needs. The design-in process is typically lengthy and expensive and there can be no assurance that we will be able to continue to meet the product specifications of our customers in a timely and adequate manner. In addition, if we fail to anticipate or to respond adequately to changes in technology and customer preferences, or if there is any significant delay in product developments or introductions, this could have a material adverse effect on our business, financial condition and results of operations, including the risk of inventory obsolescence. Because of the complexity of our products, we have experienced delays from time to time in completing products on a timely basis. If we are unable to design, develop or introduce competitive new products on a timely basis, our future operating results would be adversely affected, particularly in our HPP segment. There can be no assurance that we will be successful in developing new products or enhancing our existing products on a timely or cost-effective basis, or that such new products or product enhancements will achieve market acceptance.\nThe complexity of our products, particularly in the HPP segment, could result in unforeseen delays or expense or undetected defects or bugs, which could adversely affect the market acceptance of new products, damage our reputation with current or prospective customers, and materially and adversely affect our operating costs.\nHighly complex products, such as those we offer, may contain defects and bugs when they are first introduced or as new versions, software documentation or enhancements are released, or their release may be delayed due to unforeseen difficulties during product development. If any of our products or third-party components used in our products, contain defects or bugs, or have reliability, quality or compatibility problems, we may not be able to successfully design workarounds. Furthermore, if any of these problems are not discovered until after we have commenced commercial production or deployment of a new product, we may be required to incur additional development costs and product recall,\nrepair or replacement costs. Significant technical challenges also arise with our software products because our customers license and deploy our products across a variety of computer platforms and integrate them with a number of third-party software applications and databases. As a result, if there is system-wide failure or an actual or perceived breach of information integrity, security or availability occurs in one of our end-user customers system, it can be difficult to determine which product is at fault and we could ultimately be harmed by the failure of another suppliers product. Consequently, our reputation may be damaged and customers may be reluctant to buy our products, which could materially and adversely affect our ability to retain existing customers and attract new customers. To resolve these problems, we may have to invest significant capital and other resources and we would likely lose, or experience a delay in, market acceptance of the affected product or products. These problems may also result in claims against us by our customers or others. For example, if a delay in the manufacture and delivery of our products causes the delay of a customers end-product delivery, we may be required, under the terms of our agreement with that customer, to compensate the customer for the adverse effects of such delays. As a result, our financial results could be materially adversely affected.\nWe rely on single sources for supply of certain components and our business may be seriously harmed if our supply of any of these components or other components is disrupted.\nSeveral components used in our HPP products are currently obtained from sole-source suppliers. We are dependent on key vendors like NVIDIA for our high-speed interconnect components and Marvel for Myricom components. Generally, suppliers may terminate our purchase orders without cause upon 30 days notice and may cease offering products to us upon 180 days notice. To the extent our key vendors, such as NVIDIA and Marvel were to limit or reduce the sale of such components to us, or if these or other component suppliers, some of which are small companies, experience future financial difficulties or other problems which could prevent them from supplying the necessary components, such events could have a material adverse effect on our business, financial condition and results of operations. These sole source and other suppliers are each subject to quality and performance risks, materials shortages, excess demand, reduction in capacity and other factors that may disrupt the flow of goods to us or our customers, which thereby may adversely affect our business and customer relationships.\nWe have no guaranteed supply arrangements with our suppliers and there can be no assurance that our suppliers will continue to meet our requirements. If our supply arrangements are interrupted, there can be no assurance that we would be able to find another supplier on a timely or satisfactory basis. Any shortage or interruption in the supply of any of the components used in our products, or the inability to procure these components from alternate sources on acceptable terms, could have a material adverse effect on our business, financial condition and results of operations. There can be no assurance that severe shortages of components will not occur in the future. Such shortages could increase the cost or delay the shipment of our products, which could have a material adverse effect on our business, financial condition and results of operations. Significant increases in the prices of these components would also materially adversely affect our financial performance since we may not be able to adjust product pricing to reflect the increase in component costs. We could incur set-up costs and delays in manufacturing should it become necessary to replace any key vendors due to work stoppages, shipping delays, financial difficulties, pandemics, government shutdowns or other factors and, under certain circumstances, these costs and delays could have a material adverse effect on our business, financial condition and results of operations.\nOur international operation is subject to a number of risks.\nWe market and sell our products in certain international markets and we have established operations in the U.K. Foreign-based revenue is determined based on the location to which the product is shipped or services are rendered and represented 4% and 8% of our total revenue for the fiscal years ended September 30, 2022 and 2021, respectively. If revenues generated by foreign activities are not adequate to offset the expense of establishing and maintaining these foreign activities, our business, financial condition and results of operations could be materially adversely affected. In addition, there are certain risks inherent in transacting business internationally, such as changes in applicable laws and regulatory requirements, export and import restrictions, export controls relating to technology, tariffs and other trade barriers, longer payment cycles, problems in collecting accounts receivable, political instability, fluctuations in currency exchange rates, expatriation controls and potential adverse tax consequences, any of which could adversely impact the success of our international activities. In particular, it is possible activity in the United Kingdom and the rest of Europe will be adversely impacted and that we will face increased regulatory and legal complexities, including those related to tax, trade, and\nemployee relations as a result of Brexit. A portion of our revenues are from sales to foreign entities, including foreign governments, which are primarily paid in the form of foreign currencies. There can be no assurance that one or more of such factors will not have a material adverse effect on our future international activities and, consequently, on our business, financial condition or results of operations.\nWe face competition that could adversely affect our sales and profitability.\nThe markets for our products are highly competitive and are characterized by rapidly changing technology, frequent product performance improvements and evolving industry standards. Many of our competitors are substantially larger than we are and have greater access to capital and human resources and in many cases price their products and services less than ours. In addition, due to the rapidly changing nature of technology, new competitors may emerge. Competitors may be able to offer more attractive pricing or develop products that could offer performance features that are superior to our products, resulting in reduced demand for our products. Such competitors could have a negative impact on our ability to win future business opportunities. There can be no assurance that a new competitor will not attempt to penetrate the various markets for our products and services. Their entry into markets historically targeted by us could have a material adverse effect on our business, financial condition and results of operations.\nPandemics, epidemics or disease outbreaks, such as the novel coronavirus (COVID-19), may materially adversely affect our business, results of operations, cash flows and financial condition.\nPandemics, epidemics, or disease outbreaks, such as COVID-19 may cause harm to us, our employees, our clients, our vendors and supply chain partners, and financial institutions, which could have a material adverse effect on our business, results of operations, cash flows, and financial condition. The impact of a pandemic, epidemic, or other disease outbreak, such as COVID-19, may include, but would not be limited to: (i) disruption to operations due to the unavailability of employees due to illness, quarantines, risk of illness, travel restrictions or factors that limit our existing or potential workforce; (ii) volatility in the demand for or availability of our products and services, (iii) inability to meet our customers needs due to disruptions in the manufacture, sourcing and distribution of our products and services, or (iv) failure of third parties on which we rely, including our suppliers, clients, and external business partners, to meet their obligations to us, or significant disruptions in their ability to do so. As a result of the World Health Organization characterizing the COVID-19 outbreak as a pandemic on March 11, 2021, national, state, and local governments have taken actions such as declaring a state of emergency, establishing social distancing guidelines, and shutting down certain businesses which are not considered essential in part or entirely. The Company has complied with such actions causing most employees to work remotely in all locations. Such measures could have a material adverse effect on our business, financial condition and results of operations.\nGovernment Contracting Risks\nWe depend on contracts with the federal government, primarily with the Department of Defense (\"DoD\"), for a portion of our revenue, and our business could be seriously harmed if the government significantly decreased or ceased doing business with us.\nWe derived 2% of our total revenue in fiscal year 2022 and 4% of our total revenue in fiscal year 2022 from the DoD as a subcontractor. We expect that the DoD contracts will continue to be important to our business for the foreseeable future. If we were suspended or debarred from contracting with the federal government generally, the General Services Administration, or any significant agency in the intelligence community or the DoD, if our reputation or relationship with government agencies were to be impaired, or if the government otherwise ceased doing business with us or significantly decreased the amount of business it does with us, our business, prospects, financial condition and operating results would be materially and adversely affected.\nOur business could be adversely affected by changes in budgetary priorities of the federal government.\nBecause we derive a significant percentage of our revenue from contracts with the federal government, changes in federal government budgetary priorities could directly affect our financial performance. A significant decline in government expenditures, a shift of expenditures away from programs that we support or a change in federal government\ncontracting policies could cause federal government agencies to reduce their purchases under contracts, to exercise their right to terminate contracts at any time without penalty or not to exercise options to renew contracts.\nIn years when Congress does not complete its budget process before the end of its fiscal year (September 30), government operations are funded through a continuing resolution (\"CR\") that temporarily funds federal agencies. Recent CRs have generally provided funding at the levels provided in the previous fiscal year and have not authorized new spending initiatives. When the federal government operates under a CR, delays can occur in the procurement of products and services. Historically, such delays have not had a material effect on our business; however, should funding of the federal government by CR be prolonged or extended, it could have significant consequences to our business and our industry.\nAdditionally, our business could be seriously affected if changes in DoD priorities reduces the demand for our services on contracts supporting some operations and maintenance activities or if we experience an increase in set-asides for small businesses, which could result in our inability to compete directly for contracts.\nU.S. Federal government contracts contain numerous provisions that are unfavorable to us.\nU.S. Federal government contracts contain provisions and are subject to laws and regulations that give the government rights and remedies, some of which are not typically found in commercial contracts, including allowing the government to:\n● cancel multi-year contracts and related orders if funds for contract performance for any subsequent year become unavailable;\n● claim rights in systems and software developed by us;\n● suspend or debar us from doing business with the federal government or with a governmental agency;\n● impose fines and penalties and subject us to criminal prosecution; and\n● control or prohibit the export of our data and technology.\nIf the government terminates a contract for convenience, we may recover only our incurred or committed costs, settlement expenses and profit on work completed prior to the termination. If the government terminates a contract for default, we may be unable to recover even those amounts, and instead may be liable for excess costs incurred by the government in procuring undelivered items and services from another source. Depending on the value of a contract, such termination could cause our actual results to differ materially and adversely from those anticipated.\nAs is common with government contractors, we have experienced and continue to experience occasional performance issues under certain of our contracts. Depending upon the value of the matters affected, a performance problem that impacts our performance of a program or contract could cause our actual results to differ materially and adversely from those anticipated.\nIntellectual Property and Systems Risks\nWe may be unsuccessful in protecting our intellectual property rights which could result in the loss of a competitive advantage.\nOur ability to compete effectively against other companies in our industry depends, in part, on our ability to protect our current and future proprietary technology under patent, copyright, trademark, trade secret and unfair competition laws. We cannot assure that our means of protecting our proprietary rights in the United States or abroad will be adequate, or that others will not develop technologies similar or superior to our technology or design around our proprietary rights. In addition, we may incur substantial costs in attempting to protect our proprietary rights.\nAlso, despite the steps taken by us to protect our proprietary rights, it may be possible for unauthorized third parties to copy or reverse-engineer aspects of our products develop similar technology independently or otherwise obtain and use information that we regard as proprietary and we may be unable to successfully identify or prosecute unauthorized uses of our technology. Furthermore, with respect to our issued patents and patent applications, we cannot assure that patents from any pending patent applications (or from any future patent applications) will be issued, that the scope of any patent protection will include competitors or provide competitive advantages to us, that any of our patents will be held valid if subsequently challenged or that others will not claim rights in or ownership of the patents (and patent applications) and other proprietary rights held by us.\nIf we become subject to intellectual property infringement claims, we could incur significant expenses and could be prevented from selling specific products.\nWe may become subject to claims that we infringe the intellectual property rights of others in the future. We cannot assure that, if made, these claims will not be successful. Any claim of infringement could cause us to incur substantial costs defending against the claim even if the claim is invalid and could distract management from other business. Any judgment against us could require substantial payment in damages and could also include an injunction or other court order that could prevent us from offering certain products.\nWe need to continue to expend resources on research and development (\"R&D\") efforts in our HPP segment, to meet the needs of our customers. If we are unable to do so, our products could become less attractive to customers and our business could be materially adversely affected.\nOur industry requires a continued investment in R&D. As a result of our need to maintain or increase our spending levels for R&D in this area and the difficulty in reducing costs associated with R&D, our operating results could be materially harmed if our revenues fall below expectations. In addition, as a result of CSPis commitment to invest in R&D, spending as a percent of revenues may fluctuate in the future. Further, if we fail to invest sufficiently in R&D or our R&D does not produce competitive results, our products may become less attractive to our customers or potential customers, which could materially harm our business and results of operations.\nOur need for continued or increased investment in research and development may increase expenses and reduce our profitability.\nOur industry is characterized by the need for continued investment in research and development. If we fail to invest sufficiently in research and development, our products could become less attractive to potential customers and our business and financial condition could be materially and adversely affected. As a result of the need to maintain or increase spending levels in this area and the difficulty in reducing costs associated with research and development, our operating results could be materially harmed if our research and development efforts fail to result in new products or if revenues fall below expectations. In addition, as a result of our commitment to invest in research and development, spending levels of research and development expenses as a percentage of revenues may fluctuate in the future.\nOur results of operations are subject to fluctuation from period to period and may not be an accurate indication of future performance.\nWe have experienced fluctuations in operating results in large part due to the sale of products and services in relatively large dollar amounts to a relatively small number of customers. Customers specify delivery date requirements that coincide with their need for our products and services. Because these customers may use our products and services in connection with a variety of defense programs or other projects with different sizes and durations, a customers orders for one quarter generally do not indicate a trend for future orders by that customer. As such, we have not been able in the past to consistently predict when our customers will place orders and request shipments so that we cannot always accurately plan our manufacturing, inventory, and working capital requirements. As a result, if orders and shipments differ from what we predict, we may incur additional expenses and build excess inventory, which may require additional reserves and allowances and reduce our working capital and operational flexibility. Any significant change in our customers purchasing patterns could have a material adverse effect on our operating results and reported earnings per share for a particular\nquarter. Thus, results of operations in any period should not be considered indicative of the results to be expected for any future period.\nOur quarterly results may be subject to fluctuations resulting from a number of other factors, including:\n● delays in completion of internal product development projects;\n● delays in shipping hardware and software;\n● delays in acceptance testing by customers;\n● a change in the mix of products sold to our served markets;\n● changes in customer order patterns;\n● production delays due to quality problems with outsourced components;\n● inability to scale quick reaction capability products due to low product volume;\n● shortages and costs of components;\n● the timing of product line transitions;\n● declines in quarterly revenues from previous generations of products following announcement of replacement products containing more advanced technology;\n● inability to realize the expected benefits from acquisitions and restructurings, or delays in realizing such benefits;\n● potential asset impairment, including goodwill and intangibles, write-off of deferred tax assets or restructuring charges; and\n● changes in estimates of completion on fixed price service engagements.\nIn addition, from time to time, we have entered into contracts, referred to as development contracts, to engineer a specific solution based on modifications to standard products. Gross margins from development contract revenues are typically lower than gross margins from standard product revenues. We intend to continue to enter into development contracts and anticipate that the gross margins associated with development contract revenues will continue to be lower than gross margins from standard product sales.\nAnother factor contributing to fluctuations in our quarterly results is the fixed nature of expenditures on personnel, facilities and marketing programs. Expense levels for these programs are based, in significant part, on expectations of future revenues. If actual quarterly revenues are below managements expectations, our results of operations will likely be adversely affected. Further, the preparation of financial statements in conformity with accounting principles generally accepted in the United States requires us to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the dates of the financial statements and the reported amounts of revenues and expenses during the reporting periods. Actual results could differ from those estimates, and changes in estimates in subsequent periods could cause our results of operations to fluctuate.\nIf we experience a disaster or other business continuity problem, we may not be able to recover successfully, which could cause material financial loss, loss of human capital, regulatory actions, reputational harm, or legal liability.\nIf we experience a local or regional disaster or other business continuity problem, such as a hurricane, earthquake, terrorist attack, pandemic or other natural or man-made disaster, our continued success will depend, in part, on the availability of our personnel, our office facilities, and the proper functioning of our computer, telecommunication and other related systems and operations. As we attempt to grow our operations, the potential for particular types of natural or man-made disasters, political, economic or infrastructure instabilities, or other country- or region-specific business continuity risks increases.\nIf we suffer any data breaches involving the designs, schematics, or source code for our products or other sensitive information, our business and financial results could be adversely affected.\nWe securely store our designs, schematics, and source code for our products as they are created. A breach, whether physical, electronic or otherwise, of the systems on which this sensitive data is stored could lead to damage or piracy of our products. If we are subject to data security breaches from external sources or from an insider threat, we may have a loss in sales or increased costs arising from the restoration or implementation of additional security measures, either of which could adversely affect our business, financial condition, and results of operations. Other potential costs could include loss of brand value, incident response costs, loss of stock market value, regulatory inquiries, litigation, and management distraction. In addition, a security breach that involved classified information could subject us to civil or criminal penalties, loss of a government contract, loss of access to classified information, or debarment as a government contractor. Similarly, a breach that involved loss of customer-provided data could subject us to loss of a customer, loss of a contract, litigation costs and legal damages, and reputational harm.\nSystems failures may disrupt our business and have an adverse effect on our results of operations.\nAny systems failures, including network, software or hardware failures, whether caused by us, a third party service provider, unauthorized intruders and hackers, computer viruses, natural disasters, power shortages or terrorist attacks, could cause loss of data or interruptions or delays in our business or that of our clients and reputational harm as a security provider. Like other companies, we have experienced cyber security threats to our data and systems, our company sensitive information, and our information technology infrastructure, including malware and computer virus attacks, unauthorized access, systems failures and temporary disruptions. We may experience similar security threats at customer sites that we operate and manage as a contractual requirement. Prior cyber attacks directed at us have not had a material adverse impact on our business or our financial results, and we believe that our continuing commitment toward threat detection and mitigation processes and procedures will help us minimize or avoid such impact in the future. Due to the evolving nature of these security threats, however, the impact of any future incident cannot be predicted.\nIn addition, the failure or disruption of our email, communications or utilities could cause us to interrupt or suspend our operations or otherwise harm our business. Our property and business interruption insurance may be inadequate to compensate us for all losses that may occur as a result of any system or operational failure or disruption and, as a result, our actual results could differ materially and adversely from those anticipated.\nThe systems and networks that we maintain for our clients, although highly redundant in their design, could also fail. If a system or network we maintain were to fail or experience service interruptions, we might experience loss of revenue or face claims for damages or contract termination. Our errors and omissions liability insurance may be inadequate to compensate us for all the damages that we might incur and, as a result, our actual results could differ materially and adversely from those anticipated.\nOur business, financial condition and results of operations could be adversely affected by disruptions in the global economy caused by the ongoing conflict between Russia and Ukraine.\nThe global economy has been negatively impacted by the military conflict between Russia and Ukraine. Furthermore, governments in the United States, United Kingdom and European Union have each imposed export controls\non certain products and financial and economic sanctions on certain industry sectors and parties in Russia. Although we do not have significant customers or suppliers in Russia or Ukraine, we do have customers and suppliers in surrounding regions which may be affected. Further escalation of Russian-Ukraine military conflict and geopolitical tensions related to such military conflict, including increased trade barriers or restrictions on global trade, could result in, among other things, cyber attacks, supply disruptions, lower consumer demand, and changes to foreign exchange rates and financial markets, any of which may adversely affect our business, financial condition and results of operations. The effects of the ongoing conflict could heighten many of our known risks described in section entitled \"Risk Factors\" in Part I, Item 1A in this Annual Report on Form 10-K for the fiscal year ended September 30, 2022.\nLegal and Regulatory Risks.\nChanges in regulations could materially adversely affect us.\nOur business, results of operations, or financial condition could be materially adversely affected if laws, regulations, or standards relating to us or our products are newly implemented or changed. In addition, our compliance with existing regulations may have a material adverse impact on us. Under applicable federal securities laws, we are required to evaluate and determine the effectiveness of our internal control structure and procedures. If we have a material weakness in our internal controls, our results of operations or financial condition may be materially adversely affected, or our stock price may decline.\nRisks Related to Ownership of Our Common Stock\nOur stock price may continue to be volatile.\nHistorically, the market for technology stocks has been extremely volatile. Our common stock has experienced and may continue to experience substantial price volatility. The following factors could cause the market price of our common stock to fluctuate significantly:\n● loss of a major customer;\n● loss of a major supplier;\n● inflationary pressures;\n● the addition or departure of key personnel;\n● variations in our quarterly operating results;\n● announcements by us or our competitors of significant contracts, new products or product enhancements;\n● acquisitions, distribution partnerships, joint ventures or capital commitments;\n● regulatory changes;\n● sales of our common stock or other securities in the future;\n● changes in market valuations of technology companies; and\n● fluctuations in stock market prices and volumes.\nIn addition, the stock market in general and the NASDAQ Global Market and technology companies in particular, have experienced extreme price and volume fluctuations that have often been unrelated or disproportionate to the operating performance of such companies. These broad market and industry factors may materially adversely affect the market price of our common stock, regardless of our actual operating performance. In the past, following periods of volatility in the market price of a companys securities, securities class action litigation has often been instituted against such companies. If any shareholder were to issue a lawsuit, we could incur substantial costs defending the lawsuit and the attention of management could be diverted.  Item 2. Properties\nListed below are our principal facilities as of September 30, 2022. Management considers all facilities listed below to be suitable for the purpose(s) for which they are used, including manufacturing, research and development, sales, marketing, service and administration.\nOwned\nor\nApproximate\nLocation\nPrincipal Use\nLeased\nFloor Area\nTS Segment Properties:\nModcomp, Inc.\nDivision Headquarters\nLeased\n11,815 S.F.\n1182 East Newport Center Drive\nSales, Marketing and\nDeerfield Beach, FL 33442\nAdministration\nModcomp, Ltd.\nSales, Marketing and\nLeased\n484 S.F.\nIndigo House, Mulberry Business Park\nAdministration\nWokingham, Berkshire RG41 2GY\nUnited Kingdom\nHPP Segment Properties:\nCSP Inc.\nCorporate Headquarters\nLeased\n8,257 S.F.\n175 Cabot Street, Suite 210\nManufacturing, Sales,\nLowell, MA 01854\nMarketing and\nAdministration Item 3. Legal Proceedings\nWe are currently not a party to any material legal proceedings. Item 4. Mine Safety Disclosures\nNot Applicable.\nPART II Item 5. Market for Registrants Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nMarket information. Our common stock is traded on the Nasdaq Global Market under the symbol CSPI. The following table provides the high and low sales prices of our common stock as reported on the Nasdaq Global Market for the periods indicated.\nFiscal Year:\nHigh\nLow\nHigh\nLow\n1st Quarter\n$\n9.30\n$\n8.09\n$\n8.71\n$\n7.09\n2nd Quarter\n$\n8.94\n$\n6.99\n$\n12.76\n$\n7.96\n3rd Quarter\n$\n9.68\n$\n6.81\n$\n11.60\n$\n8.47\n4th Quarter\n$\n8.95\n$\n7.12\n$\n10.85\n$\n8.70\nStockholders. We had approximately 72 holders of record of our common stock as of December 6, 2022. This number does not include stockholders for whom shares were held in a nominee or street name. We believe the number of beneficial owners of our shares of common stock (including shares held in street name) at that date was approximately 1,347.\nPurchases of equity securities.\nOn February 8, 2011, the Board of Directors authorized the Company to repurchase up to 250 thousand additional shares of the Company's outstanding common stock at market price. The plan does not expire. As of May 14, 2020, we suspended our stock repurchase program until further economic clarity. The Board of Directors approved the activation of the suspended stock repurchase program on December 29, 2021.\nCommon stock of CSP Inc. may be repurchased on the open market at the discretion of management. Open market repurchases will be made in compliance with the Securities and Exchanges Commissions Rule 10b-18 in addition to complying with applicable legal and other considerations. Below are the purchases that have been made for the three months ended September 30, 2022.\nPeriod\nTotal number of shares purchased\nAverage price paid per share\nTotal number of shares purchased as part of publicly announced plans (1)\nMaximum number that may yet be purchased under the repurchase plan\nAugust 1-31, 2022\n1,300\n$\n8.10\n1,300\n173,327\nSeptember 1-30, 2022\n1,600\n$\n8.02\n1,600\n171,727\n(1) On December 29, 2021, the Company announced the commencement of purchases under our stock repurchase program, which was originally authorized and announced February 8, 2011. This program originally allowed the Company to purchase up to 250,000 shares of its Common Stock. As of the December 29, 2021 announcement, 194,125 shares of Common Stock were available to be repurchased under the stock repurchase program. The program does not expire. The stock repurchase program may be suspended, terminated, or modified at any time for any reason.\nDividends. As of May 14, 2020, we suspended our stock repurchase program and the payment of quarterly cash dividends until further economic clarity. The dividend was reinstated on August 10, 2022. There were no dividends paid in fiscal year 2021. For the fiscal year ended September 30, 2022 the Company paid cash dividends as follows:\nAmount Paid\nFiscal Year\nDate Declared\nRecord Date\nDate Paid\nPer Share\n8/10/2022\n8/22/2022\n9/9/2022\n$\n0.03 Item 6. [Reserved] Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations\nThis managements discussion and analysis of financial condition and results of operations and other portions of this filing contain forward-looking information that involves risks and uncertainties. Our actual results could differ materially from those anticipated by the forward-looking information. You should review the Special Note Regarding Forward Looking Statements and Risk Factors sections of this annual report for a discussion of important factors that could cause actual results to differ materially from the results described in or implied by the forward-looking statements contained in the following discussion and analysis. The following discussion should be read in conjunction with our financial statements and the related notes included elsewhere in this filing.\nObservations on effects of novel coronavirus and Russia/Ukraine Conflict\nOn March 11, 2020, the World Health Organization characterized the novel coronavirus outbreak as a pandemic. The outbreak has and continues to adversely affect the economies of the U.S., U.K., and other international markets and economies in which we operate. As a result of the World Health Organization characterizing the COVID-19 outbreak as a pandemic, national, state, and local governments have and continue to take actions such as declaring a state of emergency, implementing social distancing and other guidelines, and shutting down and/or limiting the opening or operation of certain businesses which are not considered essential.\nIn these times of pandemic, our top priorities are to protect the health, well-being, and safety of our employees and partners, while still focusing on the key drivers of our business. To that end, and to insure we continue to operate safely and cautiously while also meeting our public health responsibilities, the Company has adopted flexible business practices including allowing most employees to work remotely in all locations.\nCOVID-19 has adversely affected the distribution channel leading to significantly longer lead times when ordering product. Manufacturers are not producing as much product as prior to the pandemic due to disruptions, resulting in supply shortages. Additionally, recent global shipping delays have exacerbated this problem. The TS segment has many vendors it transacts with and supply shortages are pervasive with many of them. The HPP segment has and continues to experience shortages with their vendors as well. If we are unable to successfully resolve these disruptions and shortages, the timing and amount of our future results may be materially impacted. The HPP segment secured a $1.8 million contract for real-time networking monitoring for cyber attack detection in the first quarter of fiscal year 2021, but due to the delays by manufacturers the sale is anticipated to be recognized fully in revenue in fiscal year 2023 when we can obtain the product from the manufacturers. Related to the supply shortage and potentially inflation, we have experienced price increases for our products, which we try to pass on to the customer.\nWe recognize the pandemic has created a dynamic and uncertain situation in the national economy, and we continue to closely monitor the latest information to make timely, informed business decisions and public disclosures regarding the potential impact of the pandemic on our operations. Despite reduced infection rates and ever-increasing vaccination rates in the United States, many nations and certain pockets within the United States are still battling various strains/variants of the novel coronavirus, creating ongoing uncertainties as to when economies will return to business as usual and what that will look like, what regulatory measures or voluntary actions will be further implemented to limit the spread of COVID-19 and its variants and the duration of any such measures. The extent, severity and impact of any further spread of COVID-19 variants or resurgence of COVID-19 in a given geographic region after it has hit its peak, and the extent to which herd immunity will be achieved through the vaccination process is still uncertain. In summary, the scope of this pandemic and its effects are unprecedented, and we cannot at this time make a reasonable estimate on the extent or duration of the impacts on our business.\nAs of September 30, 2022, the Russian/Ukrainian military conflict has not had a direct significant impact on revenue as we do not have any recurring customers in either country. However, we do have customers and suppliers in surrounding regions which may be affected and further escalation of the Russian-Ukraine military conflict and geopolitical tensions related to such military conflict could adversely affect our business, financial condition and results of operations, by among other things, cyber attacks, supply disruptions, lower consumer demand, and changes to foreign exchange rates and financial markets. It is not possible at this time to predict the size of the impact or consequences of the conflict to the Company and our customers and suppliers.\nOverview of Fiscal 2022 Results of Operations\nRevenue increased by approximately $5.2 million, or 10%, to $54.4 million for the fiscal year ended September 30, 2022 versus $49.2 million for the fiscal year ended September 30, 2021.\nGross profit margin percentage increased, from 33% of revenues for the fiscal year ended September 30, 2021 to 35% for the fiscal year ended September 30, 2022.\nWe generated an operating loss of $40 thousand for the fiscal year ended September 30, 2022 as compared to an operating loss of approximately $1.4 million for the fiscal year ended September 30, 2021.\nOther income, (expense) net was $2.0 million for the fiscal year ended September 30, 2022 as compared to $2.0 million for the prior year.\nA one-time gain of $465k occurred in fiscal year 2021, which was a purchase price adjustment of a subsidiary (Modcomp GmbH) that was sold in fiscal year 2018. This is classified as discontinued operations. There are no further amounts to be received in connection with the purchase agreement from the original sale.\nThe Company recorded an income tax provision of approximately $50 thousand for the fiscal year ended September 30, 2022, which reflected an effective tax rate of 3% for the year ended September 30, 2022. The provision is primarily driven by the state tax expense. For the fiscal year ended September 30, 2021, the income tax provision was $444 thousand, which reflected an effective tax rate of 39%. The provision is primarily driven by the recording of a partial valuation allowance against US deferred tax assets that are not more-likely-than-not to be realized partially offset by current year federal R&D credits and the benefit resulting from the carryback of federal net operating losses to years in which the statutory federal tax rate was 34%.\nThe following table details our results of operations in dollars and as a percentage of sales for the fiscal years ended:\n%\n%\nSeptember 30, 2022\nof sales\nSeptember 30, 2021\nof sales\n(Dollar amounts in thousands)\nSales\n$\n54,361\n%\n$\n49,208\n%\nCosts and expenses:\nCost of sales\n35,534\n%\n33,059\n%\nEngineering and development\n3,084\n%\n2,887\n%\nSelling, general and administrative\n15,783\n%\n14,624\n%\nTotal costs and expenses\n54,401\n%\n50,570\n%\nOperating loss\n(40)\n-\n%\n(1,362)\n(3)\n%\nOther income, (expense) net\n1,979\n%\n2,040\n%\nIncome before income taxes\n1,939\n%\n%\nIncome tax expense\n-\n%\n%\nNet income from continuing operations\n$\n1,889\n%\n$\n-\n%\nGain on sale of discontinued operations\n-\n-\n%\n%\nNet income\n$\n1,889\n%\n$\n%\nRevenues\nRevenue increased by approximately $5.2 million, or approximately 10%, to $54.4 million for the fiscal year ended September 30, 2022 versus $49.2 million for the fiscal year ended September 30, 2021. Our TS segment revenue increased by approximately $5.9 million consisting of an increase of $7.1 million in our U.S. division, partially offset by a decrease of $1.2 million in our U.K. division. Our HPP segment revenue decreased by approximately $0.8 million or 17%.\nTS segment revenue changes by products and services for the fiscal years ended September 30 were as follows:\nSeptember 30,\nIncrease\n$\n%\n(Dollar amounts in thousands)\nProducts\n$\n34,172\n$\n32,100\n$\n2,072\n%\nServices\n16,346\n12,485\n3,861\n%\nTotal\n$\n50,518\n$\n44,585\n$\n5,933\n%\nThe increase in TS segment product revenue of $2.1 million during the period was the result of a $3.1 million increase in the U.S. division, partially offset by a decrease of approximately $1.0 million in the U.K. division. As the economic environment returns to pre-pandemic levels it has led to customers budgets not being as constrained as prior year leading to increased sales in the U.S. division. The increase in our U.S. division product revenue year over year was primarily associated with several major customers, partially offset by a decrease with several other customers. The decrease in the U.K. division year over year was primarily associated with a decrease with one major customer. The increase in TS segment service revenue of $3.9 million as compared to the prior year was due to a $4.0 million increase in the U.S. division, partially offset with a $0.1 million decrease in the U.K. division. In fiscal year 2022 as compared to the prior year, the U.S. division had an increase of $1.5 million in managed services, an increase of $1.3 million in services provided by the Company and third party services, and an increase of $1.2 million in third party maintenance revenue.\nHPP segment revenue changes by product and services for the fiscal years ended September 30 were as follows:\nSeptember 30,\nDecrease\n$\n%\n(Dollar amounts in thousands)\nProducts\n$\n2,516\n$\n3,126\n$\n(610)\n(20)\n%\nServices\n1,327\n1,497\n(170)\n(11)\n%\nTotal\n$\n3,843\n$\n4,623\n$\n(780)\n(17)\n%\nThe decrease in HPP product revenue of $0.6 million in the fiscal year ended September 30, 2022 was primarily the result of an approximately $0.6 million decrease in Multicomputer product line shipments for the fiscal year ended September 30, 2022 as compared to the fiscal year ended September 30, 2021. The decrease in HPP service revenue of approximately $0.2 million for the fiscal year ended September 30, 2022 period was primarily the result of a $0.4 million decrease in royalty revenues on high-speed processing boards related to the E2D program, partially offset with higher ARIA sales of $0.2 million as compared to the fiscal year ended September 30, 2021.\nOur total revenues by geographic area based on the location to which the products were shipped or services rendered were as follows:\nSeptember 30,\nIncrease (decrease)\n%\n%\n$\n%\n(Dollar amounts in thousands)\nAmericas\n$\n52,486\n%\n$\n45,321\n%\n$\n7,165\n%\nEurope\n1,407\n%\n3,203\n%\n(1,796)\n(56)\n%\nAsia\n%\n%\n(216)\n(32)\n%\nTotals\n$\n54,361\n%\n$\n49,208\n%\n$\n5,153\n%\nThe $7.2 million increase in the Americas revenue for the fiscal year ended September 30, 2022 as compared to the fiscal year ended September 30, 2021 was primarily due to increased revenue by our TS-US division of approximately $7.7 million, partially offset with a decrease of $0.2 million attributable to the TS-UK division combined with decreased sales by our HPP segment of approximately $0.3 million. The $1.8 million decrease in Europe revenue for the fiscal year ended September 30, 2022 as compared to the prior year period was primarily due to decreased sales by our TS-UK division of approximately $1.0 million, a decrease in sales by our TS-US division of approximately $0.5 million, and a decrease of $0.3 million in our HPP segment. The $0.2 million decrease in Asia revenue for the fiscal year ended September 30, 2022 as compared to the prior year period was the result of decreased revenue by our HPP segment of $0.1 million combined with a $0.1 million decrease in our TS-U.S. division.\nGross Margins\nOur gross margin (\"GM\") increased by $2.7 million to $18.8 million for fiscal year 2022 as compared to GM of approximately $16.1 million for fiscal year 2021. The total GM as a percentage of revenue increased to 35% for fiscal\nyear 2022 from 33% for fiscal year 2021. The increase in total GM as a percentage of revenue was primarily attributed to a significantly higher increase in service revenue, which has a higher GM as a percentage of revenue, versus product revenue. The improved product GM as a percentage of revenue has been a focus in fiscal year 2022, particularly in the TS segment. The 8% decrease in HPP GM as a percentage of revenue from prior year was due to decreased royalty sales, which are nearly all margin.\nThe following table summarizes GM changes by segment for fiscal years ended September 30:\nSeptember 30,\nIncrease (decrease)\n(Dollar amounts in thousands)\nGM$\nGM%\nGM$\nGM%\nGM$\nGM%\nTS\n$\n16,879\n%\n$\n13,405\n%\n$\n3,474\n%\nHPP\n1,948\n%\n2,744\n%\n(796)\n(8)\n%\nTotal\n$\n18,827\n%\n$\n16,149\n%\n$\n2,678\n%\nThe impact of product mix within our TS segment on gross margins for the fiscal years ended September 30 was as follows:\nSeptember 30,\nIncrease\nGM$\nGM%\nGM$\nGM%\nGM$\nGM%\n(Dollar amounts in thousands)\nProducts\n$\n6,818\n%\n$\n5,898\n%\n$\n%\nServices\n10,061\n%\n7,507\n%\n2,554\n%\nTotal\n$\n16,879\n%\n$\n13,405\n%\n$\n3,474\n%\nThe overall TS segment GM as a percentage of revenue increased to 33% in fiscal year 2022 from 30% in fiscal year 2021. The increase in GM as a percentage of revenue was primarily attributed to increased GM as a percentage of revenue for both product and service revenue than in fiscal year 2021. The $0.9 million increase in our TS segment product GM in fiscal year 2022 as compared to the prior year resulted from an increase in GM in the U.S. division. The $2.6 million increase in the TS segment service GM in fiscal year 2022 as compared to the prior year primarily resulted from increased service GM of $2.7 million in the U.S. division, partially offset by a decrease of $0.1 million in the U.K. division.\nThe impact of product mix on gross margins within our HPP segment for the fiscal years ended September 30 was as follows:\nSeptember 30,\nDecrease\n(Dollar amounts in thousands)\nGM$\nGM%\nGM$\nGM%\nGM$\nGM%\nProducts\n$\n%\n$\n1,304\n%\n$\n(411)\n(7)\n%\nServices\n1,055\n%\n1,440\n%\n(385)\n(16)\n%\nTotal\n$\n1,948\n%\n$\n2,744\n%\n$\n(796)\n(8)\n%\nThe overall HPP segment GM as a percentage of revenue decreased to 51% in fiscal year 2022 from 59% in fiscal year 2021. The 8% decrease in GM as a percentage of sales in the HPP segment was primarily attributed to the impact of a decrease of $0.4 million in high margin Multicomputer royalty revenues, which is nearly all GM and recorded as service revenue. The GM as a percentage of sales from products decreased primarily due to product mix in fiscal year 2022 as compared to the prior year.\nEngineering and Development Expenses\nOur engineering and development expenses are only in our HPP segment. These expenses had an increase of $0.2 million, primarily due to increased consulting costs, from $2.9 million in fiscal year 2021 to $3.1 million for fiscal year 2022. Fiscal year 2022 and 2021 expenses were primarily for product engineering expenses incurred in connection with the development of the ARIA SDS cyber security products and ARIA Zero Trust (AZT).\nSelling, General and Administrative\nThe following table details our selling, general and administrative (SG&A) expenses by operating segment for the years ended September 30, 2022 and 2021:\nYear ended\n$\n%\n% of\n% of\nIncrease\nIncrease\nTotal\nTotal\n(Decrease)\n(Decrease)\n(Dollar amounts in thousands)\nBy Operating Segment:\nTS segment\n$\n12,032\n%\n$\n10,190\n%\n$\n1,842\n%\nHPP segment\n3,751\n%\n4,434\n%\n(683)\n(15)\n%\nTotal\n$\n15,783\n%\n$\n14,624\n%\n$\n1,159\n%\nThe TS segment SG&A spending increase of approximately $1.8 million for the fiscal year ended September 30, 2022 when compared to the prior year was primarily due to an increase in variable compensation of $1.5 million and an increase in salaries and other expenses of $0.3 million.\nThe HPP segment SG&A spending decrease of $0.7 million for the fiscal year ended September 30, 2022 when compared to the prior year was primarily attributed to decreased headcount and consulting expenses.\nOther Income/Expenses\nThe following table details our other income (expense) for the years ended September 30, 2022 and 2021:\nYear ended\nIncrease\nSeptember 30, 2022\nSeptember 30, 2021\n(Decrease)\n(Amounts in thousands)\nForeign exchange gain (loss)\n$\n1,692\n$\n(488)\n$\n2,180\nInterest expense\n(360)\n(350)\n(10)\nInterest income\nGain on debt forgiveness\n-\n2,196\n(2,196)\nOther income (expense), net\n(3)\n(110)\nTotal other income (expense), net\n$\n1,979\n$\n2,040\n$\n(61)\nFor the year ended September 30, 2022 the largest change was the foreign exchange gain increase of $2.2 million due to the U.S. dollar significantly strengthening against the British Pound and the largest change for the year ended September 30, 2021 was a gain on debt forgiveness of $2.2 million for the Payroll Protection Program loans. These two items had a net effect of nearly zero. The $0.1 million decrease to total other income (expense), net for the year ended September 30, 2022 as compared to the prior year period is due to a nonrecurring rebate we received in the prior year that originated several years ago, which we did not anticipate receiving.\nThe U.K. division has significant bank accounts with U.S. dollars and Euros. In consolidation, U.S. dollars and Euros are remeasured into the functional currency, British Pounds, of our U.K. subsidiary. This non-cash remeasurement is included in foreign exchange gain or loss on the income statement and the foreign exchange gain or loss is primarily from a U.S. Dollar and Euro bank account. The US dollar and Euro strengthened relative to the British Pound when comparing the exchange rate as of September 30, 2022 to September 30, 2021, which caused the foreign exchange gain.\nInterest income is primarily related to agreements that have payment terms in excess of one year (see Note 3 Accounts and Long-Term Receivable in Item 1 to this Annual Report on Form 10-K for details) from the TS-US segment as interest income recognized in each agreement decreases as principal payments are made. There were three new agreements in fiscal year 2022, which caused an increase in interest income.\nThe interest expense increase of $10 thousand for the year ended September 30, 2022 as compared to the prior year period is related to three total new multi-year agreements with vendors in the TS U.S. division in the second and fourth quarters of fiscal year 2021. Payments on these agreements contain both principal and interest expense. In fiscal year 2022 there was a full year of interest expense compared to less than three full quarters in the prior year. As principal payments are made the interest expense decreases and this was slightly offset by the full year of interest expense from these agreements. See Note 9 Accounts payable and accrued expenses, and Other noncurrent liabilities in Item 1 to this Annual Report on Form 10-K.\nThe other income decrease of $110 thousand for the year ended September 30, 2022 as compared to the prior year period is primarily related to a nonrecurring rebate we received in the prior year that originated several years ago, which we did not anticipate receiving.\nIncome Taxes\nThe Company recorded an income tax provision of approximately $50 thousand for the fiscal year ended September 30, 2022, which reflected an effective tax rate of 2.6% for the year ended September 30, 2022. The provision is primarily driven by the state tax expense. For the fiscal year ended September 30, 2021, the income tax provision was $444 thousand, which reflected an effective tax rate of 38.8%. The provision is primarily driven by the recording of a partial valuation allowance against US deferred tax assets that are not more-likely-than-not to be realized partially offset by current year federal R&D credits and the benefit resulting from the carryback of federal net operating losses to years in which the statutory federal tax rate was 34%.\nDuring the period ended September 30, 2022, management assessed the positive and negative evidence in the U.S. operations and concluded that it is more likely than not that the deferred tax assets as of September 30, 2022 will not be realized in light of recent results, the ongoing impacts of the coronavirus (COVID-19) pandemic, and the resulting economic fallout. In assessing the realizability of deferred tax assets, we consider taxable income in prior carryback years, as permitted under the tax law, our forecasted taxable earnings, tax planning strategies, and the expected timing of the reversal of temporary differences. This determination requires significant judgment, including assumptions about future taxable income that are based on historical and projected information and is performed on a jurisdiction-by-jurisdiction basis.\nWe also continue to maintain a full valuation allowance against our U.K. deferred tax assets as we have experienced cumulative losses and do not have any indication that the operation will be profitable in the future to an extent that will allow us to utilize much of our net operating loss carryforwards. To the extent that actual experience deviates from our assumptions, our projections would be affected and hence our assessment of realizability of our deferred tax assets may change.\nGain on Discontinued Operations\nCSPi sold all stock of Modcomp GmbH to Reply AG on July 31, 2018 for $14.4 million cash and a gain of $18.1 million. This sale was recorded in fiscal year 2018. An additional €400 thousand was included in escrow as part of the Share Purchase and Assignment Agreement to potentially be received later as a purchase price adjustment in fiscal year 2021. This amount was received in July 2021 and recorded as a gain from discontinued operations in the Consolidated Statements of Operations. No income taxes were provided as the transaction was a tax-free exchange in the U.K. There are no other amounts that will be received as part of the agreement.\nLiquidity and Capital Resources\nOur primary source of liquidity is our cash and cash equivalents, which increased by $4.0 million to $24.0 million as of September 30, 2022 from $20.0 million as of September 30, 2021.\nOur significant source of cash for the year ended September 30, 2022 is primarily related to the $2.9 million net change between an increase in accounts receivable and long-term receivable of $4.1 million netted with an increase of $7.0 million in accounts payable and accrued expenses, and other-long-term liabilities. We have multi-year agreements on both the receivables (including long-term) and payables (long-term portion in other long-term liabilities). During the fourth quarter of fiscal year 2022 we entered into a $12.8 million sales agreement with a financing component, which includes receiving three payments with the final payment due in fiscal year 2024. We received the first payment in the fourth quarter of fiscal year 2022 of approximately $4.3 million. Our cost of sale for this agreement was paid in full in the first quarter of fiscal year 2023 and significantly decreased our cash balance. This is the largest driver for the increase in accounts payable. The revenue for this transaction was recorded net during the fourth quarter of fiscal year 2022. The other significant sources of cash were net borrowings of $2.2 million on our line of credit, tax refunds of approximately $0.6 million, and life insurance proceeds received of $0.3 million.\nOther significant uses of cash for the year ended September 30, 2022 included paying $0.9 million of insurance policy loans back, payments for leases of $0.8 million, repayments on debt of $0.7 million, contributions to the pension and defined contribution plans of $0.5 million, purchases of common stock of $0.2 million, purchases of property, equipment, and improvements of $0.2 million, and dividends of $0.1 million.\nOur cash held by our foreign subsidiary in the United Kingdom totaled approximately $8.8 million as of September 30, 2022, which consisted of 0.4 million Euros, 0.2 million British Pounds, and 8.2 million U.S. Dollars. This cash is included in our total cash and cash equivalents reported within our financial statements. Due to the pension obligation in the U.K., we maintain a large balance of cash in the U.K., most of the cash is from the sale of Modcomp GmbH in fiscal year 2018. Subsequent to September 30, 2022 approximately 3.5 million U.S. Dollars was transferred from the foreign subsidiary in the U.K. to Modcomp, Inc. (TS-US) to use in operations.\nAs of September 30, 2022 and September 30, 2021, the Company maintained a line of credit with a capacity of up to $15.0 million for inventory accessible to both the HPP and TS segments. This line of credit also includes availability of a limited cash withdrawal of up to $1.0 million. Amounts of $11.9 million and $14.1 million were available as of September 30, 2022 and September 30, 2021, respectively. As of September 30, 2022 and September 30, 2021 there were no cash withdrawals outstanding. For a further discussion of the Companys line of credit, including its financial covenants, see Item 1, Note 12 Line of Credit.\nOn April 17, 2021, the Company and Modcomp, Inc., its wholly owned subsidiary each received a loan (SBA Loans) in the form of a promissory note from Paragon Bank in the amounts of $827,000 and $1,353,600, respectively under the Paycheck Protection Program, which was established under the recently enacted Coronavirus Aid, Relief, and Economic Security Act (CARES Act) administered by the U.S. Small Business Administration. The SBA loans had a two-year term and carried an annual fixed interest rate of 1%. The SBA Loans were forgiven in full by the SBA in the first quarter of fiscal year 2021.\nIf cash generated from operations is insufficient to satisfy working capital requirements, we may need to access funds through bank loans or other means. If we are unable to secure additional financing, we may not be able to complete development or enhancement of products, take advantage of future opportunities, respond to competition, retain key employees, or continue to effectively operate our business.\nBased on our current plans and business conditions, management believes that the Companys available cash and cash equivalents, the cash received from the SBA loans, the cash generated from operations, and availability on our line of credit will be sufficient to provide for the Companys working capital and capital expenditure requirements for at least 12 months from the date of this filing.\nCritical Accounting Estimates and Policies\nOur discussion and analysis of our financial condition and results of operations are based upon our consolidated financial statements, which have been prepared in accordance with accounting principles generally accepted in the United States. The preparation of these financial statements requires us to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues and expenses. On an on-going basis, we evaluate our estimates, including those related to uncollectible receivables, inventory valuation, goodwill and intangibles, income taxes, deferred compensation, revenue recognition, retirement plans, restructuring costs and contingencies. We base our estimates on historical performance and on various other assumptions that are believed to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Actual results may differ from these estimates under different assumptions or conditions.\nWe believe the following critical accounting policies affect our more significant judgments and estimates used in the preparation of our consolidated financial statements: revenue recognition, valuation allowances, specifically the allowance for doubtful accounts and net deferred tax asset valuation allowance, inventory valuation, intangibles, and pension and retirement plans.\nRevenue Recognition\nSee Note 1 Summary of Significant Accounting Policies, in the Consolidated Financial Statements for additional information regarding our revenue recognition policies. The following areas involve significant judgment and estimates:\nAllocating transaction price with agreements with multiple components including leasing and/or a financing component\nA financing component exists when at contract inception the period between the transfer of a promised good and/or service to the customer differs from when the customer pays for the good and/or service. As a practical expedient, we have elected not to adjust the amount of consideration for effects of a significant financing component when it is anticipated the promised good or service will be transferred and the subsequent payment will be one year or less.\nCertain contracts contain a financing component including managed services contracts with financing of hardware and software. The interest rate used reflects the approximate interest rate consistent with a separate financing transaction with the customer at the inception of the agreement. Revenues from arrangements which include financing are allocated considering relative standalone selling prices of lease and non-lease components within the agreement. The lease component includes hardware, which is subject to ASC 842, Leases. The non-lease components are subject to ASC 606, Revenue from Contracts with Customers.\nWhen product and non-managed services are sold together, the allocation of the transaction price to each performance obligation is calculated based on the estimated relative selling price or a budgeted cost-plus margin approach, as appropriate. Due to the complex nature of these contracts, there is significant judgment in allocating the transaction price. These estimates are periodically reviewed by project managers, engineers, and other staff involved to ensure estimates remain appropriate. For items sold separately, including hardware, software, professional services, maintenance contracts, other services, and third-party service contracts, there is no allocation as there is one performance obligation.\nProfessional Services Sold Without Products\nThe input method using labor hours expended relative to the total expected hours is used to recognize revenue for professional services. Only the hours that depict our performance toward satisfying a performance obligation are used to measure progress. An estimate of hours for each professional service agreement is made at the beginning of each contract based on prior experience and monitored throughout the performance of the services. This method is most appropriate as it depicts the measure of progress towards satisfaction of the performance obligation.\nGross versus Net Revenue\nWe recognize revenue from third-party service contracts as either gross sales or net sales depending on whether we are acting as a principal party to the transaction or acting as an agent or broker based on control and timing. We are a principal if we control the good or service before that good or service is transferred to the customer. We record revenue as gross when we are a principal party to the arrangement and net of cost when we are acting as a broker or agent for a third party. Under gross sales recognition, the entire selling price is recorded in revenue and our cost to the third-party service provider or vendor is recorded in cost of sales. Under net sales recognition, the cost to the third-party service provider or vendor is recorded as a reduction to revenue resulting in net sales equal to the gross profit on the transaction. Third-party service contracts are sold in different combinations with hardware, software, and services. When we are an agent, revenue is typically recorded at a point in time. When we are the principal, revenue is recognized over the contract term. We have concluded we are the agent in sales of third-party maintenance, software or hardware support, and certain security software that is sold with integral third-party delivered software maintenance that include critical updates.\nProduct Warranty Accrual\nOur product sales generally include a 90-day to three-year hardware warranty. At time of product shipment, we accrue for the estimated cost to repair or replace potentially defective products. Estimated warranty costs are based upon prior actual warranty costs for substantially similar products.\nEngineering and Development Expenses\nEngineering and development expenses include payroll, employee benefits, stock-based compensation and other headcount-related expenses associated with product development. Engineering and development expenses also include third-party development and programming costs. We consider technological feasibility for our software products to be reached upon the release of the software, accordingly, no internal software development costs have been capitalized.\nIncome Taxes\nWe use the asset and liability method of accounting for income taxes whereby deferred tax assets and liabilities are recognized for the estimated future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases. Deferred tax assets and liabilities are measured using enacted tax rates in effect for the year in which those temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date. We also reduce deferred tax assets by a valuation allowance if, based on the weight of available evidence, it is more likely than not that some portion or all of the recorded deferred tax assets will not be realized in future periods. This methodology requires estimates and judgments in the determination of the recoverability of deferred tax assets and in the calculation of certain tax liabilities. Valuation allowances are recorded against the gross deferred tax assets that management believes, after considering all available positive and negative objective evidence, historical and prospective, with greater weight given to historical evidence, that it is more likely than not that these assets will not be realized.\nIn addition, we are required to recognize in the consolidated financial statements, those tax positions determined to be more-likely-than-not of being sustained upon examination, based on the technical merits of the positions as of the reporting date. If a tax position is not considered more-likely-than-not to be sustained based solely on its technical merits, no benefits of the position are recognized.\nIn addition, the calculation of the Companys tax liabilities involves dealing with uncertainties in the application of complex tax regulations in a multitude of jurisdictions. The Company records liabilities for estimated tax obligations in the U.S. and other tax jurisdictions. These estimated tax liabilities include the provision for taxes that may become payable in the future.\nIntangible Assets\nIntangible assets that are not subject to amortization are also required to be tested annually, or more frequently if events or circumstances indicate that the asset may be impaired. We did not have intangible assets with indefinite lives at any time during the two years ended September 30, 2022. Intangible assets subject to amortization are amortized over their estimated useful lives, generally three to ten years, and are carried at net book value. The remaining useful lives of intangible assets are evaluated on an annual basis. If the fair value of an intangible asset subject to amortization is determined to be less than its carrying value, then an impairment charge is recorded to write down that asset to its fair value.\nInventories\nInventories are stated at the lower of cost or market, with cost determined using the first-in, first-out method. The recoverability of inventories is based upon the types and levels of inventories held, forecasted demand, pricing, competition and changes in technology. We write down our inventory for estimated obsolescence or unmarketable inventory equal to the difference between the cost of inventory and the estimated market value based upon assumptions about future demand and market conditions. If actual market conditions are less favorable than those projected by management, additional inventory write-downs may be required.\nPension and Retirement Plans\nThe funded status of pension and other post-retirement benefit plans is recognized prospectively on the consolidated balance sheet. Gains and losses, prior service costs and credits and any remaining transition amounts that have not yet been recognized through pension expense will be recognized in accumulated other comprehensive loss, net of tax, until they are amortized as a component of net periodic pension/post-retirement benefits expense. Additionally, plan assets and obligations are measured as of our fiscal year-end balance sheet date (September 30).\nWe have defined benefit and defined contribution plans in the U.K. and in the U.S. In the U.K., the Company provides defined benefit pension plans for certain employees and former employees and defined contribution plans for the majority of the employees. The defined benefit plans in the U.K. are closed to newly hired employees and have been for the two years ended September 30, 2022. In the U.S., the Company provides defined contribution plans that cover most employees and supplementary retirement plans to certain employees and former employees who are now retired. These supplementary retirement plans are also closed to newly hired employees and have been for the two years ended September 30, 2022. These supplementary plans are funded through whole life insurance policies. The Company expects to recover all insurance premiums paid under these policies in the future, through the cash surrender value of the policies and any death benefits or portions thereof to be paid upon the death of the participant. These whole life insurance policies are carried on the balance sheet at their cash surrender values as they are owned by the Company and not assets of the defined benefit plans. In the U.S., the Company also provides for officer death benefits and post-retirement health insurance benefits through supplemental post-retirement plans to certain officers. The Company also funds these supplemental plans obligations through whole life insurance policies on the officers.\nPension expense is based on an actuarial computation of current future benefits using estimates for expected return on assets, expected compensation increases and applicable discount rates. Management has reviewed the discount rates and rates of return with our consulting actuaries and investment advisers and concluded they were reasonable. A decrease in the expected return on pension assets would increase pension expense. Expected compensation increases are estimated based on historical and expected increases in the future. Increases in estimated compensation increases would result in higher pension expense while decreases would lower pension expense. Discount rates are selected based upon rates of return on high quality fixed income investments currently available and expected to be available during the period to maturity of the pension benefit. A decrease in the discount rate would result in greater pension expense while an increase in the discount rate would decrease pension expense.\nThe Company funds its pension plans in amounts sufficient to meet the requirements set forth in applicable employee benefits laws and local tax laws. Liabilities for amounts in excess of these funding levels are accrued and reported in the consolidated balance sheets.\nInflation and Changing Prices\nManagement does not believe that inflation and changing prices had significant impact on sales, revenues or income during fiscal years 2022 or 2021. However, we have seen a trend of significantly increasing prices, specifically with integrated circuit vendors. We try to pass these price increases to our customers, but certain economic factors and technological advances have placed downward pressure on pricing. There is no assurance that the Companys business will not be materially and adversely affected by inflation and changing prices in the future.  Item 8. Financial Statements and Supplementary Data\nThe consolidated financial statements are included herein.\nPage\nReport of Independent Registered Public Accounting Firm (PCAOB ID 49)\nConsolidated Balance Sheets as of September 30, 2022 and 2021\nConsolidated Statements of Operations for the years ended September 30, 2022 and 2021\nConsolidated Statements of Comprehensive Income for the years ended September 30, 2022 and 2021\nConsolidated Statements of Shareholders Equity for the years ended September 30, 2022 and 2021\nConsolidated Statements of Cash Flows for the years ended September 30, 2022 and 2021\nNotes to Consolidated Financial Statements Item 9. Changes in and Disagreements with Accountants on Accounting and Financial Disclosures\nNone. Item 9A. Controls and Procedures\nEvaluation of Controls and Procedures\nDisclosure Controls and Procedures. The Company evaluated the effectiveness of the design and operation of its disclosure controls and procedures as of September 30, 2022. Our Chief Executive Officer, our Chief Financial Officer and other members of our senior management team supervised and participated in this evaluation. The term disclosure controls and procedures, as defined in Rules 13a-15(e) and 15d-15(e) under the Exchange Act, means controls and other procedures of a company that are designed to ensure that information required to be disclosed by a company in the reports that it files or submits under the Exchange Act is recorded, processed, summarized and reported, within the time periods specified in the Securities and Exchange Commissions (\"SEC\") rules and forms. Disclosure controls and procedures include, without limitation, controls and procedures designed to ensure that information required to be disclosed by a company in the reports that it files or submits under the Exchange Act is accumulated and communicated to the companys management, including its principal executive and principal financial officers, as appropriate to allow timely decisions regarding required disclosure. Management recognizes that any controls and procedures, no matter how well designed and operated, can provide only reasonable assurance of achieving their objectives and management necessarily applies its judgment in evaluating the cost-benefit relationship of possible controls and procedures. Based on the evaluation of our disclosure controls and procedures as of September 30, 2022, the Companys Chief Executive Officer and Chief Financial Officer concluded that, as of such date, our disclosure controls and procedures were effective.\nManagements Report on Internal Control over Financial Reporting.\nThe Companys management is responsible for establishing and maintaining adequate internal control over financial reporting. As defined in Rule 13a-15(f) under the Exchange Act, internal control over financial reporting is a process designed by or under the supervision of a companys principal executive and principal financial officers and effected by a companys board of directors, management and other personnel, to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with accounting principles generally accepted in the United States of America. It includes those policies and procedures that:\n● pertain to the maintenance of records that in reasonable detail accurately and fairly reflect the transactions and dispositions of the assets of a company;\n● provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles and that receipts and expenditures of a company are being made only in accordance with authorizations of management and the board of directors of a company; and\n● provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of a companys assets that could have a material effect on its financial statements.\nManagement has assessed the effectiveness of the Companys internal control over financial reporting as of September 30, 2022. In making its assessment of internal control, management used the criteria described in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations (\"COSO\") of the Treadway Commission. As a result of its assessment, management has concluded that the Companys internal control over financial reporting was effective as of September 30, 2022.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nThis Annual Report on Form 10-K does not include an attestation report of the Companys independent registered public accounting firm regarding internal control over financial reporting. Managements assessment of the effectiveness of the Companys internal control over financial reporting as of September 30, 2022 was not subject to attestation by the Companys independent registered public accounting firm pursuant to rules of the SEC that call for the Company to provide only managements report in this Annual Report on Form 10-K.\nChanges in Internal Control over Financial Reporting.\nThere were no changes in our internal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act) identified in connection with managements evaluation during our fiscal year 2022 that have materially affected, or are reasonably likely to materially affect, the Companys internal control over financial reporting. Item 9B. Other Information\nNone\nItem 9C. Disclosure Regarding Foreign Jurisdiction that Prevent Inspections\nNot applicable\nPART III Item 10. Directors, Executive Officers and Corporate Governance\nWe incorporate the information required by this item by reference to the sections captioned Nominees for Election, Our Board of Directors, Our Executive Officers, Delinquent Section 16(a) reports and Corporate Governance in our Schedule 14A Proxy Statement for our 2023 Annual Meeting of Stockholders, to be filed with the SEC within 120 days after the end of our fiscal year ended September 30, 2022. Item 11. Executive Compensation\nWe incorporate the information required by this item by reference to the sections captioned Compensation of Executive Officers and Compensation of Non-Employee Directors in our Schedule 14A Proxy Statement for our 2023 Annual Meeting of Stockholders to be filed with the SEC within 120 days after the end of our fiscal year ended September 30, 2022. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nSecurities Authorized for Issuance Under Equity Compensation Plans.\nThe equity compensation plans approved by our stockholders consist of the CSP, Inc. 1997 Incentive Stock Option Plan, the 2003 Stock Incentive Plan, the 2007 Stock Incentive Plan, the 2014 Employee Stock Purchase Plan (the \"ESPP\") and the 2015 Stock Incentive Plan. In fiscal 2022 and 2021, the Company granted to certain key employees, certain officers including its Chief Executive Officer and non-employee directors shares of non-vested common stock instead of stock options. The non-vested common stock has a four-year vesting period for key employees, officers including the Chief Executive Officer. There is a one-year vesting period for the non-employee directors. The following\ntable sets forth information as of September 30, 2022 regarding the total number of securities outstanding under these equity compensation plans.\n(a) (1)\n(b) (1)\n(c)\nNumber of securities\nremaining available for future\nNumber of securities to be\nWeighted average\nissuance under equity\nissued upon exercise of\ngrant date fair value\ncompensation plans (excluding\noutstanding restricted stock awards\nrestricted stock awards\nsecurities reflected in column (a)\nPlan Category\n(a)\nEquity compensation plans approved by security holders\n259,788\n$\n9.14\n388,996\n(1) Does not include purchase rights under the ESPP, as the purchase price and number of shares to be purchased under the ESPP are not determined until the end of the relevant purchase period.\nWe incorporate additional information required by this Item by reference to the section captioned Security Ownership of Certain Beneficial Owners and Management in our Schedule 14A Proxy Statement for our 2023 Annual Meeting of Stockholders to be filed with the SEC within 120 days after the end of our fiscal year ended September 30, 2022. Item 13. Certain Relationships and Related Transactions and Director Independence\nWe incorporate the information required by this item by reference to the section captioned Corporate Governance in our Schedule 14A Proxy Statement for our 2023 Annual Meeting of Stockholders to be filed with the SEC within 120 days after the end of our fiscal year ended September 30, 2022. Item 14. Principal Accountant Fees and Services\nWe incorporate the information required by this item by reference to the sections captioned Fees for Professional Services and Pre-approval Policies and Procedures in our Schedule 14A Proxy Statement for our 2023 Annual Meeting of Stockholders to be filed with the SEC within 120 days after the end of our fiscal year ended September 30, 2022.\nPART IV Item 15. Exhibits and Financial Statement Schedules\n(a) (1) Financial statements filed as part of this report:\nConsolidated Balance Sheets as of September 30, 2022 and 2021\nConsolidated Statements of Operations for the years ended September 30, 2022 and 2021\nConsolidated Statements of Comprehensive Income for the years ended September 30, 2022 and 2021\nConsolidated Statements of Shareholders Equity for the years ended September 30, 2022 and 2021\nConsolidated Statements of Cash Flows for the years ended September 30, 2022 and 2021\nNotes to Consolidated Financial Statements\n(2) Financial statement schedules\nAll other financial statements and schedules not listed have been omitted since the required information is included in the consolidated financial statements or the notes thereto included in Item 8, or is not applicable, material or required.\n(3) Exhibits\nIncorporated by Reference\nExhibit\nNo.\nDescription\nFiled with\nthis Form\n10-K\nForm\nFiling Date\nExhibit\nNo.\n3.1\nArticles of Organization and amendments thereto\n10-K\nDecember 26, 2007\n3.1\n3.2\nBy-laws, as amended December 13, 2012\n10-K\nDecember 20, 2012\n3.2\n4.1\nDescription of Securities\n10-K\nDecember 28, 2021\n4.1\n10.1\nForm of Employee Invention and Non-Disclosure Agreement\n10-K\nNovember 22, 1996\n10.3\n10.2\nCSPI Supplemental Retirement Income Plan\n10-K\nDecember 29, 2008\n10.2\n10.3*\n2007 Stock Incentive Plan\nDEF 14A\nMarch 30, 2007\nB\n10.4*\n2014 Variable Compensation (Executive Bonus) and Base Programs dated November 12, 2013\n10-K\nDecember 23, 2014\n10.10\n10.5*\nDeath Benefit and Retirement Benefit Agreement between the Company and Victor Dellovo dated September 13, 2013\n10-K\nDecember 24, 2013\n10.11\n10.6*\nForm of Change of Control Agreement with Gary W. Levine dated January 11, 2008\n10-K\nDecember 23, 2010\n10.11\n10.7*\n2014 Employee Stock Purchase Plan\nDEF 14A\nJanuary 6, 2014\nA\n10.8*\n2015 Stock Incentive Plan\nDEF 14RA\nJanuary 25, 2019\nA\n10.9\n2015 Lowell, MA Lease\n10-K\nDecember 24, 2015\n10.21\n10.10\n2015 Deerfield Beach, FL Lease\n10-K\nDecember 24, 2015\n10.20\n10.11*\nExecutive Retention and Service Agreement with Victor Dellovo, dated September 4, 2012\n10-Q\nFebruary 14, 2018\n10.1\n10.12*\nForms of Employee Restricted Stock Award Agreement\n10-Q\nFebruary 14, 2018\n10.2\n10.13\nShare Purchase and Assignment Agreement\n8-K\nJune 27, 2018\n2.1\n10.14\nNote, dated as of April 17, 2021, by, and between Paragon Bank and CSP, Inc.\n8-K\nApril 23, 2021\n10.1\n10.15\nNote, dated as of April 17, 2021, by, and between Paragon Bank and Modcomp, Inc.\n8-K\nApril 23, 2021\n10.2\n21.1\nSubsidiaries\nX\n23.1\nConsent of RSM LLP, Independent Registered Public Accounting Firm\nX\n31.1\nCertification of Chief Executive Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\nX\n31.2\nCertification of Chief Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\nX\n32.1\nCertification of Chief Executive Officer and Chief Financial Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002\nX\n101.INS\nXBRL Instance\n101.SCH\nXBRL Taxonomy Schema\n101.CAL\nXBRL Taxonomy Extension Calculation\n101.DEF\nXBRL Taxonomy Extension Definition\n101.LAB\nXBRL Taxonomy Extension Labels\n101.PRE\nXBRL Taxonomy Extension Presentation\n*\nManagement contract or compensatory plan.\nItem 16. Form 10-K Summary\nNone.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nCSP INC.\nBy:\n/s/ Victor Dellovo\nVictor Dellovo\nChief Executive Officer and President\nDate: December 8, 2022\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nName\nTitle\nDate\n/s/ Victor Dellovo\nChief Executive Officer, President and Director\nDecember 8, 2022\nVictor Dellovo\n/s/ Gary W. Levine\nChief Financial Officer\n(Principal Financial Officer)\nDecember 8, 2022\nGary W. Levine\n/s/ Mike Newbanks\nVice President of Finance\n(Chief Accounting Officer)\nDecember 8, 2022\nMike Newbanks\n/s/ C. Shelton James\nDirector\nDecember 8, 2022\nC. Shelton James\n/s/ Raymond Charles Blackmon\nDirector\nDecember 8, 2022\nRaymond Charles Blackmon\n/s/ Marilyn T. Smith\nDirector\nDecember 8, 2022\nMarilyn T. Smith\n/s/ Izzy Azeri\nDirector\nDecember 8, 2022\nIzzy Azeri\nReport of Independent Registered Public Accounting Firm\nShareholders and the Board of Directors of CSP Inc. and Subsidiaries\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of CSP Inc. and its subsidiaries (the Company) as of September 30, 2022 and 2021, the related consolidated statements of operations, comprehensive income, shareholders equity and cash flows for the years then ended, and the related notes to the consolidated financial statements (collectively, the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of September 30, 2022 and 2021, and the results of their operations and their cash flows for the years then ended, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits, we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matter communicated below is a matter arising from the current-period audit of the financial statements that were communicated or required to be communicated to the audit committee and that (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing separate opinions on the critical audit matter or on the accounts or disclosures to which it relates.\nRevenue Recognition - Gross Versus Net Presentation\nAs described in Note 1 to the financial statements, the Company recognizes revenue from third-party service contracts as either gross sales or net sales depending on whether the Company is acting as a principal party to the transaction or simply acting as an agent or broker. The Company records revenue as gross when the Company is a principal party to the arrangement and net of cost when they are acting as a broker or agent.\nThe Company has concluded that it is the agent in sales of third-party maintenance, software or hardware support, and certain security software that is sold with integral third-party delivered software maintenance that include critical updates.\nWe identified the Companys accounting for revenue from third-party service contracts described above to be a critical audit matter due to the significant judgments used by management related to the evaluation of the principal versus agent considerations. Auditing managements assumptions and conclusions involved a high degree of auditor judgment.\nOur audit procedures related to these contracts included the following, among others:\n● We evaluated management's significant accounting policies related to these third-party contracts for consistency with accounting standards\n● For a selection of contracts, we performed the following procedures:\no Inspected the customer invoice and purchase order to determine whether the sale represented a valid and enforceable transaction with a customer\no Compared the cost per the Companys records to the cost per the vendor invoice\no Assessed the terms in the customer agreement and evaluated the Companys determination of principal versus agent presentation:\n● Compared the description of the transaction per the invoice to managements summary file of gross vs net transactions\n● Evaluated the accuracy of the summary file through inspection of customer invoices, purchase orders, and information on vendor websites accessed through third-party search engines and through inquiries with management\n/s/ RSM US LLP\nWe have served as the Company's auditor since 2007.\nMiami, Florida\nDecember 8, 2022\nCSP INC. AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\n(Amounts in thousands, except par value)\nSeptember 30,\nSeptember 30,\nASSETS\nCurrent assets:\nCash and cash equivalents\n$\n23,982\n$\n20,007\nAccounts receivable, net of allowances of $88 and $142\n22,993\n18,698\nInvestment in lease, net-current portion\nInventories\n4,372\n3,989\nRefundable income taxes\n1,050\n1,656\nOther current assets\n7,043\n4,616\nTotal current assets\n59,457\n49,034\nProperty, equipment and improvements, net\nOperating lease right-of-use assets\n1,160\n1,358\nIntangibles, net\nInvestment in lease, net-less current portion\nLong-term receivable\n7,412\n7,522\nCash surrender value of life insurance\n5,163\n4,194\nPension benefits assets\n1,099\n-\nOther assets\nTotal assets\n$\n75,062\n$\n62,974\nLIABILITIES AND SHAREHOLDERS EQUITY\nCurrent liabilities:\nAccounts payable and accrued expenses\n$\n22,463\n$\n13,928\nLine of credit\n3,124\nNotes payable - current portion\nDeferred revenue\n4,058\n1,893\nPension and retirement plans\nTotal current liabilities\n30,182\n17,827\nPension and retirement plans\n1,337\n4,097\nNotes payable - noncurrent portion\nOperating lease liabilities - noncurrent portion\nIncome taxes payable\nOther noncurrent liabilities\n3,046\n4,783\nTotal liabilities\n36,099\n28,928\nShareholders equity:\nCommon stock, $.01 par value per share; authorized, 7,500 shares; issued and outstanding 4,554 and 4,394 shares, respectively\nAdditional paid-in capital\n19,476\n18,258\nRetained earnings\n26,769\n25,191\nAccumulated other comprehensive loss\n(7,328)\n(9,448)\nTotal shareholders equity\n38,963\n34,046\nTotal liabilities and shareholders equity\n$\n75,062\n$\n62,974\nSee accompanying notes to consolidated financial statements.\nCSP INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF OPERATIONS\n(Amounts in thousands, except for per share data)\nYear ended\nSeptember 30,\nSeptember 30,\nSales:\nProduct\n$\n36,688\n$\n35,226\nServices\n17,673\n13,982\nTotal sales\n54,361\n49,208\nCost of sales:\nProduct\n28,977\n28,024\nServices\n6,557\n5,035\nTotal cost of sales\n35,534\n33,059\nGross profit\n18,827\n16,149\nOperating expenses:\nEngineering and development\n3,084\n2,887\nSelling, general and administrative\n15,783\n14,624\nTotal operating expenses\n18,867\n17,511\nOperating loss\n(40)\n(1,362)\nOther income (expense):\nForeign exchange gain (loss)\n1,692\n(488)\nInterest expense\n(360)\n(350)\nInterest income\nGain on forgiveness of debt\n-\n2,196\nOther (expense) income, net\n(3)\nTotal other income (expense), net\n1,979\n2,040\nIncome before income taxes\n1,939\nIncome tax expense\nNet income from continuing operations\n$\n1,889\n$\nDiscontinued operations:\nGain from sale of discontinued operations\n$\n-\n$\nNet income\n$\n1,889\n$\nNet income attributable to common shareholders\n$\n1,789\n$\nContinued and discontinued operations:\nNet income from continuing operations attributable to common shareholders\n$\n1,789\n$\nNet income from discontinued operations attributable to common shareholders\n$\n-\n$\nNet income attributable to common shareholders\n$\n1,789\n$\nNet income per common share from continuing operations - basic\n$\n0.42\n$\n0.05\nNet income per common share from sale of discontinued operations - basic\n$\n-\n$\n0.11\nNet income per common share - basic\n$\n0.42\n$\n0.16\nWeighted average common shares outstanding - basic\n4,261\n4,151\nNet income per common share from continuing operations - diluted\n$\n0.42\n$\n0.05\nNet income per common share from sale of discontinued operations - diluted\n$\n-\n$\n0.11\nNet income per common share - diluted\n$\n0.42\n$\n0.16\nWeighted average common shares outstanding continuing operations - diluted\n4,278\n4,220\nWeighted average common shares outstanding discontinued operations - diluted\n-\n4,220\nWeighted average common shares outstanding net income - diluted\n4,278\n4,220\nSee accompanying notes to consolidated financial statements.\nCSP INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF COMPREHENSIVE INCOME\n(Amounts in thousands)\nYear ended\nSeptember 30,\nSeptember 30,\nNet income\n$\n1,889\n$\nOther comprehensive income (loss):\nUnrealized actuarial gain on minimum pension liability, net of tax effect\n3,861\n1,901\nForeign currency translation (loss) gain adjustments, net\n(1,741)\nOther comprehensive income\n2,120\n2,547\nTotal comprehensive income\n$\n4,009\n$\n3,246\nSee accompanying notes to consolidated financial statements.\nCSP INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF SHAREHOLDERS EQUITY\nFor the Years Ended September 30, 2022 and 2021:\n(Amounts in thousands)\nAccumulated\nAdditional\nother\nTotal\nPaid-in\nRetained\ncomprehensive\nShareholders\nYear ended September 30, 2022:\nShares\nAmount\nCapital\nEarnings\nloss\nEquity\nBalance as of September 30, 2021\n4,394\n$\n$\n18,258\n$\n25,191\n$\n(9,448)\n$\n34,046\nNet income\n-\n-\n-\n1,889\n-\n1,889\nOther comprehensive income\n-\n-\n-\n-\n2,120\n2,120\nStock-based compensation\n-\n-\n-\n-\nRestricted stock cancellation\n(1)\n-\n-\n-\n(1)\nRestricted stock issuance\n-\n-\n-\nIssuance of shares under employee stock purchase plan\n-\n-\n-\nPurchase of common stock\n(22)\n-\n-\n(174)\n-\n(174)\nCash dividends paid on common stock ($0.03 per share)\n-\n-\n-\n(137)\n-\n(137)\nBalance as of September 30, 2022\n4,554\n$\n$\n19,476\n$\n26,769\n$\n(7,328)\n$\n38,963\nAccumulated\nAdditional\nother\nTotal\nPaid-in\nRetained\ncomprehensive\nShareholders\nYear ended September 30, 2021:\nShares\nAmount\nCapital\nEarnings\nloss\nEquity\nBalance as of September 30, 2020\n4,276\n$\n$\n16,994\n$\n24,492\n$\n(11,995)\n$\n29,534\nNet income\n-\n-\n-\n-\nOther comprehensive income\n-\n-\n-\n-\n2,547\n2,547\nStock-based compensation\n-\n-\n-\n-\nRestricted stock cancellation\n(19)\n-\n-\n-\n-\nRestricted stock issuance\n-\n-\n-\nIssuance of shares under employee stock purchase plan\n-\n-\n-\nBalance as of September 30, 2021\n4,394\n$\n$\n18,258\n$\n25,191\n$\n(9,448)\n$\n34,046\nSee accompanying notes to consolidated financial statements.\nCSP INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\n(Amounts in thousands)\nYear ended\nSeptember 30,\nSeptember 30,\nOperating activities\nNet income from continuing operations\n$\n1,889\n$\nNet income from discontinued operations\n-\nNet income\n1,889\nAdjustments to reconcile net income to net cash provided by operating activities:\nDepreciation\nAmortization of intangibles\nForeign exchange (gain) loss\n(1,692)\nProvision for losses on accounts receivable\n(50)\nProvision for obsolete inventory\nAmortization of lease right-of-use assets\nStock-based compensation expense on stock options and restricted stock awards\nDeferred income taxes\n-\n1,149\nIncrease in cash surrender value of life insurance\n(1,221)\n(176)\nAdjustment for financing activities recognized in net income - Gain on forgiveness of debt\n-\n(2,196)\nChanges in operating assets and liabilities:\nIncrease in accounts receivable\n(4,264)\n(5,375)\n(Increase) decrease in inventories\n(517)\n1,263\nDecrease (increase) in refundable income taxes\n(849)\n(Increase) decrease in operating lease right-of-use assets\n(377)\nIncrease in other assets\n(2,491)\n(1,993)\nDecrease in investment in lease\nDecrease (increase) in long-term receivable\n(3,880)\nIncrease in accounts payable and accrued expenses\n8,714\n5,729\n(Decrease) increase in interest payable\n(8)\nDecrease in operating lease liabilities\n(330)\n(661)\nIncrease in deferred revenue\n2,165\nDecrease in pension and retirement plans liabilities\n(167)\n(301)\nDecrease in income taxes payable\n(62)\n(65)\n(Decrease) increase in other long-term liabilities\n(1,737)\n4,579\nNet cash provided by operating activities\n2,675\n1,903\nInvesting activities\nLife insurance premiums paid\n(70)\n(70)\nProceeds from corporate life insurance owned policy\n-\nProceeds from sales of property, equipment, and improvements\nPurchases of property, equipment and improvements\n(234)\n(98)\nNet cash provided by (used in) investing activities\n(166)\nFinancing activities\nDividends paid\n(137)\n-\nNet borrowing (payments) under line-of-credit agreement\n2,183\n(631)\nRepayments on notes payable\n(736)\n(332)\nPrincipal payments on finance leases\n(47)\n(274)\nPurchase of common stock\n(174)\n-\nProceeds from issuance of shares under equity compensation plans\nNet cash provided by (used in) financing activities\n1,328\n(954)\nEffects of exchange rate on cash\n(48)\n(40)\nNet increase in cash and cash equivalents\n3,975\nCash and cash equivalents beginning of year\n20,007\n19,264\nCash and cash equivalents end of year\n$\n23,982\n$\n20,007\nSupplementary cash flow information:\nCash (received) paid for income taxes\n$\n(233)\n$\nCash paid for interest\n$\n$\nSupplementary non-cash financing activities:\nGain on forgiveness of debt\n$\n-\n$\n2,196\nObtaining a right-of-use asset in exchange for a lease liability\n$\n$\n-\nCustomer financing for inventory sold (see Note 3 Accounts and Long-Term Receivable for details)\n$\n1,232\n$\n16,014\nVendor financing for inventory purchased (see Note 9 Accounts payable and accrued expenses, and Other noncurrent liabilities for details)\n$\n-\n$\n8,399\nSee accompanying notes to consolidated financial statements.\nCSP INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nFOR THE YEARS ENDED SEPTEMBER 30, 2022 AND 2021\nOrganization and Business\nCSP Inc. (\"CSPi\" or \"CSPI\" or \"the Company\" or \"we\" or \"our\") was founded in 1968 and is based in Lowell, Massachusetts. To meet the diverse requirements of commercial and defense customers worldwide, CSPI and its subsidiaries develop and market IT integration solutions, advanced security products, managed IT services, purpose built network adapters, and high-performance cluster computer systems. The Company operates in two segments, its Technology Solutions (\"TS\") segment and its High Performance Products (\"HPP\") segment.\n1. Summary of Significant Accounting Policies\nBasis of Presentation\nThe accompanying audited Consolidated Financial Statements have been prepared in accordance with generally accepted accounting principles in the United States of America and the rules and regulations of the Securities and Exchange Commission.\nPrinciples of Consolidation\nThe consolidated financial statements include the accounts of the Company and its subsidiaries. All significant intercompany accounts and transactions have been eliminated.\nForeign Currency Translation\nThe U.S. Dollar is the reporting currency for all periods presented. The financial information for entities outside the United States is measured using the local currency as the functional currency. In consolidation, foreign transactions are remeasured into the functional currency, British Pounds, of our U.K. subsidiary. This non-cash remeasurement is included in foreign exchange gain or loss on the income statement. After this remeasurement, assets and liabilities of the Companys foreign operations are translated into U.S. dollars at the exchange rates in effect at the balance sheet date. Revenue and expenses are translated at average rates in effect during the period. The resulting translation adjustment is reflected as accumulated other comprehensive loss, a separate component of shareholders equity on the consolidated balance sheets. Currency transaction gains and losses are recorded as other income (expense) in the consolidated statements of operations.\nCash Equivalents\nFor purposes of the consolidated statements of cash flows, highly liquid investments with original maturities of three months or less at the time of acquisition are considered cash equivalents.\nResearch and Development Expense\nFor the years ended September 30, 2022 and 2021, our expenses for research and development were approximately $3.1 million and $2.9 million, respectively. Expenditures for research and development are expensed as they are incurred.\nImpairment of Long-Lived Assets\nThe Company reviews its long-lived assets, including intangible assets subject to amortization, for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable. Management assesses the recoverability of the long-lived assets (other than goodwill and intangibles) by comparing the estimated undiscounted cash flows associated with the related asset or group of assets against their respective carrying\namounts. The amount of impairment, if any, is calculated based on the excess of the carrying amount over the fair value of those assets. Intangible assets that are not subject to amortization are also required to be tested annually, or more frequently if events or circumstances indicate that the asset may be impaired. We did not have intangible assets with indefinite lives or goodwill at any time during the two years ended September 30, 2022. Intangible assets subject to amortization are amortized on a straight-line basis over their estimated useful lives, generally three to ten years, and are carried at net book value. The remaining useful lives of intangible assets are evaluated on an annual basis. Intangible assets subject to amortization are also tested for recoverability whenever events or changes in circumstances indicate that their carrying amount may not be recoverable. If the fair value of an intangible asset subject to amortization is determined to be less than its carrying value, then an impairment charge is recorded to write down that asset to its fair value. There was no impairment for the year ended September 30, 2022 and 2021.\nLeases as Lessee\nAt the inception of an arrangement, the Company determines whether the arrangement contains a lease. This includes arrangements with goods and services to determine if there is an embedded lease. An arrangement containing a lease would allow the Company the right to control an implicitly or explicitly identified asset. If there is a lease in an arrangement, the classification is determined at inception of the arrangement. Certain leases may contain transfer of ownership or an option to purchase the underlying asset. The most relevant criterion for our lease classification is transfer of ownership, which if included in the arrangement makes the lease a finance lease rather than an operating lease.\nThe discount rate used to assess classification is the incremental borrowing rate at the commencement date due to the implicit rate not being readily determinable. The incremental borrowing rate is the rate of interest the Company would have to pay to borrow on a collateralized basis over a similar term and amount equal to the lease payments in a similar economic environment. The lease term includes periods where we are reasonably certain we will exercise the renewal option. The Company has elected not to apply Subtopic ASC 842-25 to short-term leases, which are defined as a lease that has a lease term of 12 months or less and does not include an option to purchase the underlying asset that the Company is reasonably certain to exercise. Therefore, there are no right-of-use assets or lease liabilities related to short-term leases in the Consolidated Balance Sheets and the lease payments are expensed on a straight-line basis over the lease term. Leases are typically not able to be terminated without penalty. None of our lease arrangements contain residual value guarantees, restrictions, or covenants. None of the Companys current leases are with related parties. There are no lease arrangements that we have entered into as of September 30, 2022 that have not yet commenced. See Note 10 Leases for additional information.\nOperating leases\nThe Company has operating leases for office space, data centers, and other information technology equipment under various leases. Operating lease right-of-use assets and liabilities are recognized at the commencement date using the present value of the fixed lease payments over the lease term. We do not have leases with variable consideration. The incremental borrowing rate is used in determining present value. Certain operating leases, primarily office space and IT equipment, have an option to extend the lease. Renewal periods related to certain lease agreements related to office buildings are included in the lease term for lease accounting.\nThe Company has operating lease agreements with lease components (e.g. fixed payments including rent, real estate taxes, and insurance costs) as well as nonlease components (e.g. common-area maintenance, colocation services). The Company has elected to account for lease and nonlease components as one single lease component for all classes of assets. Lease expense is recognized on a straight-line basis over the lease term.\nFinance leases\nThe Company has finance leases for information technology equipment and subleases all this equipment (see Lessor section below for details). All finance leases transfer ownership to the Company, which meets the criterion to be a finance lease. Due to our finance leases being subleases, there are no finance right-of-use assets because instead there is a net investment in lease in the Consolidated Balance Sheets.\nLeases as Lessor\nThe Company is a lessor, but only as a sublessor. The process for identifying and classifying a lease is similar to the process described above in the lessee section. Additionally, the most relevant criteria to classification is transfer of ownership and present value of the total lease payments in relation to fair value of the underlying asset. The Company as a lessor has both sales-type and direct financing leases. The Company as a lessor does not have operating leases. All the Companys sublease agreements are bundled agreements containing managed services, software, and other services. The fixed payments under bundled agreements are allocated based on the relative standalone selling prices of the lease and non-lease deliverables are consistent with ASC 606. The allocation of the fixed payments may be calculated using a budgeted cost-plus margin approach if there are other services in addition to managed services. Due to the complex nature of these contracts, there is significant judgment in allocating the fixed payments. There is no variable consideration in these agreements. The discount rate used as a lessor pertaining to the lease component is the implicit rate. As sublessor, lease agreements contain an option to purchase the underlying asset or transfers ownership at the end of the lease. The leases typically do not have any residual value to the Company. In the Companys sublessor agreements, the payments allocated to the lease component cannot be terminated. There were no new agreements where the Company was a lessor for the year ended September 30, 2022. See Note 10 Leases for additional information.\nInventories\nInventories are stated at the lower of cost or net realizable value, with cost determined using the first-in, first-out method. The recoverability of inventories is based upon the types and levels of inventories held, forecasted demand, pricing, competition and changes in technology. We write down our inventory for estimated obsolescence or unmarketable inventory equal to the difference between the cost of inventory and the estimated market value based upon assumptions about future demand and market conditions. If actual market conditions are less favorable than those projected by management, additional inventory write-downs may be required. As of September 30, 2022, and September 30, 2021, the Company maintained inventory reserves of $0.8 million and $2.3 million, respectively.\nProperty, Equipment and Improvements\nThe components of property, equipment and improvements are stated at cost. The Company provides for depreciation by use of the straight-line method over the estimated useful lives of the related assets (three to seven years). Leasehold improvements are amortized by use of the straight-line method over the lesser of the estimated useful life of the asset or the lease term. Repairs and maintenance costs are expensed as incurred.\nTrade Accounts Receivable, Long Term Receivable, and Allowance for Doubtful Accounts\nTrade accounts receivable are stated at amounts that have been billed to customers less an allowance for doubtful accounts. Allowances for doubtful accounts are recorded for the estimated losses resulting from the inability of our customers to make required payments. The estimates for the allowance for doubtful accounts are based on the length of time the receivables are past due, current business environment, and our historical experience. If the financial condition of our customers were to deteriorate, resulting in impairment of their ability to make payments, additional allowances may be required. Accounts receivable are charged off against the reserve when management has determined they are uncollectible. Within trade accounts receivable and long-term receivable are financing agreements with an original payment term of greater than one year. Interest income earned on these receivables is recognized using the effective interest method. See Note 3 Accounts and Long-Term Receivables for further details on financing arrangements.\nPension and Retirement Plans\nThe funded status of pension and other postretirement benefit plans is recognized on the consolidated balance sheet. Gains and losses, prior service costs and credits and any remaining transition amounts that have not yet been recognized through pension expense will be recognized in accumulated other comprehensive loss, net of tax, until they are amortized as a component of net periodic pension/postretirement benefits expense. Additionally, plan assets and obligations are measured as of our fiscal year-end balance sheet date (September 30).\nWe have defined benefit and defined contribution plans in the United Kingdom (the U.K.) and in the U.S. In the U.K. the Company provides defined benefit pension plans for certain employees and former employees and defined contribution plans for the majority of the employees. The defined benefit plan in the U.K. is closed to newly hired employees and has been for the two years ended September 30, 2022. In the U.S., the Company also provides defined contribution plans that cover most employees and supplementary retirement plans to certain employees and former employees who are now retired. These supplementary retirement plans are also closed to newly hired employees and have been for the two years ended September 30, 2022. These supplementary plans are funded through whole life insurance policies. The Company expects to recover all insurance premiums paid under these policies in the future, through the cash surrender value of the policies and any death benefits or portions thereof to be paid upon the death of the participant. These whole life insurance policies are carried on the balance sheet at their cash surrender values as they are owned by the Company and not assets of the defined benefit plans. In the U.S., the Company also provides for officer death benefits and post-retirement health insurance benefits through supplemental post-retirement plans to certain officers. The Company also funds these supplemental plans obligations through whole life insurance policies on the officers.\nPension expense is based on an actuarial computation of current future benefits using estimates for expected return on assets, expected compensation increases and applicable discount rates. Management has reviewed the discount rates and rates of return with our consulting actuaries and investment advisor and concluded they were reasonable. A decrease in the expected return on pension assets would increase pension expense. Expected compensation increases are estimated based on historical and expected increases in the future. Increases in estimated compensation increases would result in higher pension expense while decreases would lower pension expense. Discount rates are selected based upon rates of return on high quality fixed income investments currently available and expected to be available during the period to maturity of the pension benefit. A decrease in the discount rate would result in greater pension expense while an increase in the discount rate would decrease pension expense.\nThe Company funds its pension plans in amounts sufficient to meet the requirements set forth in applicable employee benefits laws and local tax laws. Liabilities for amounts in excess of these funding levels are accrued and reported in the consolidated balance sheets.\nSegment Information\nWe have two operating segments: (i) Technology Solutions (\"TS\") and (ii) High Performance Products (\"HPP\"). In the TS segment, we focus on value added reseller (\"VAR\") integrated solutions including third party hardware, software and technical computer-related consulting and managed services. In the HPP segment, we design, manufacture and deliver products and services to customers that require specialized cyber security services, networking and signal processing products. The operations and assets of our TS segment are located in the United States and the United Kingdom. The operations and assets of our HPP segment are located in the United States.\nRevenue Recognition\nWe derive revenue from the sale of integrated hardware and software, third-party service contracts, professional services, managed services, financing of hardware and software, and other services.\nWe recognize revenue from hardware upon transfer of control, which is at a point in time typically upon shipment when title transfers. Revenue from software is recognized at a point in time when the license is granted.\nWe recognize revenue from third-party service contracts as either gross sales or net sales depending on whether we are acting as a principal party to the transaction or acting as an agent or broker based on control and timing. We are a principal if we control the good or service before that good or service is transferred to the customer. We record revenue as gross when we are a principal party to the arrangement and net of cost when we are acting as a broker or agent for a third party. Under gross sales recognition, the entire selling price is recorded in revenue and our cost to the third-party service provider or vendor is recorded in cost of sales. Under net sales recognition, the cost to the third-party service provider or vendor is recorded as a reduction to revenue resulting in net sales equal to the gross profit on the transaction. Third-party service contracts are sold in different combinations with hardware, software, and services. When we are an agent, revenue is typically recorded at a point in time. When we are the principal, revenue is recognized over the contract term. We have\nconcluded we are the agent in sales of third-party maintenance, software or hardware support, and certain security software that is sold with integral third-party delivered software maintenance that include critical updates.\nProfessional services generally include implementation, installation, and training services. Professional services are considered a series of distinct services that form one performance obligation and revenue is recognized over time as services are performed.\nRevenue generated from managed services is recognized over the term of the contract. Certain managed services contracts include financing of hardware and software. Revenues from arrangements which include financing are allocated considering relative standalone selling prices of lease and non-lease components within the agreement. The lease component includes hardware, which is subject to ASC 842, Leases. The non-lease components are subject to ASC 606, Revenue from Contracts with Customers.\nOther services generally include revenue generated through our royalty, extended warranty, multicomputer repair, and maintenance contracts. Royalty revenue is sales-based and recognized on date of subsequent sale of the product, which occurs on the date of customer shipment. Revenue from extended warranty contracts is recognized ratably over the warranty period. Multicomputer repair services revenue is recognized upon control transfer when the customer takes possession of the computer at time of shipping. Revenue generated from maintenance services is recognized evenly over the term of the contract.\nThe right of return risk lies with the original manufacturer of the product. Managed service contracts contain the right to refund if canceled within 30 days of inception. Any products with a standard warranty are treated as a warranty obligation under ASC 460, Guarantees.\nThe following policies are applicable to our major categories of segment revenue transactions:\nTS Segment Revenue\nTS Segment revenue is derived from the sale of hardware, software, professional services, third-party service contracts, maintenance contracts, managed services, and financing of hardware and software. Financing revenue pertaining to the portion of an arrangement containing a lease is recognized in accordance with ASC 842. Financing revenue related to the lease is recorded in revenue as equipment leasing is part of our operations.\nThird-party service contracts are evaluated to determine whether such service revenue should be recorded as gross or net sales and whether over time or at point in time.\nHPP Segment Revenue\nHPP segment revenue is derived from the sale of integrated hardware and software, maintenance, and other services through the Multicomputer, Myricom, and ARIA product lines.\nMyricom revenue is derived from the sale of products, which are comprised of both hardware and embedded software which is essential to the products functionality, and post contract maintenance and support. Post contract maintenance and support is considered immaterial in the context of the contract and therefore is not a separate performance obligation. Multicomputer revenue is derived from the sale of hardware, software, extended warranties, royalties, and repair services.\nSee disaggregated revenues below by products/services and geography.\nTechnology Solutions Segment\nHigh\nPerformance\nProducts\nUnited\nConsolidated\nYear ended September 30,\nSegment\nKingdom\nU.S.\nTotal\nTotal\n(Amounts in thousands)\nSales:\nProduct\n$\n2,516\n$\n$\n33,653\n$\n34,171\n$\n36,687\nService\n1,327\n16,021\n16,346\n17,673\nFinance *\n-\n-\nTotal sales\n$\n3,843\n$\n$\n49,675\n$\n50,518\n$\n54,361\nTechnology Solutions Segment\nHigh\nPerformance\nProducts\nUnited\nConsolidated\nYear ended September 30,\nSegment\nKingdom\nU.S.\nTotal\nTotal\n(Amounts in thousands)\nSales:\nProduct\n$\n3,126\n$\n1,578\n$\n30,502\n$\n32,080\n$\n35,206\nService\n1,497\n12,059\n12,485\n13,982\nFinance *\n-\n-\nTotal sales\n$\n4,623\n$\n2,004\n$\n42,581\n$\n44,585\n$\n49,208\n* Finance revenue is related to equipment leasing and is not subject to the guidance on revenue from contracts with customers (ASC 606).\nContract Assets and Liabilities\nWhen we have performed work but do not have an unconditional right to payment, a contract asset is recorded. When we have the right to bill a customer, accounts receivable is recorded as an unconditional right exists. Current contract assets were $4.4 million and $2.7 million as of September 30, 2022 and September 30, 2021, respectively. The current portion is recorded in other current assets on the consolidated balance sheets. There were no noncurrent contract assets as of September 30, 2022 and September 30, 2021. The difference in the balances is due to regular timing differences between when work is performed and having an unconditional right to payment.\nContract liabilities arise when payment is received before we transfer a good or service to the customer. Current contract liabilities were $1.9 million and $0.9 million as of September 30, 2022 and September 30, 2021, respectively. The current portion of contract liabilities is recorded in deferred revenue on the consolidated balance sheets. There were no long-term contract liabilities as of September 30, 2022. The long-term portion of contract liabilities was $0.4 million as of September 30, 2021. These noncurrent liabilities are recorded in other noncurrent liabilities on the consolidated balance sheets. Revenue recognized for the year ended September 30, 2022 that was included in contract liabilities as of September 30, 2021 was $1.7 million.\nContract Costs\nIncremental costs of obtaining a contract involving customer transactions where the revenue and the related transfer of goods and services are equal to or less than a one year period, are expensed as incurred, utilizing the practical expedient in ASC 340-40-25-4. For a period greater than one year, incremental contract costs are capitalized if we expect to recover these costs. The costs are amortized over the contract term and expected renewal periods. The period of amortization is generally three to six years. Incremental costs are related to commissions in the TS portion of the business.\nCurrent capitalized contract costs are within the other current assets on the consolidated balance sheets as of September 30, 2022 and 2021. The portion of current capitalized costs were $128 thousand and $137 thousand as of September 30, 2022 and 2021, respectively. There were no noncurrent capitalized costs on the consolidated balance sheets as these commissions are paid annually even when the contract extends beyond a one year period. The amount of incremental costs amortized for the year ended September 30, 2022 and 2021 were $366 thousand and $442 thousand, respectively. This is recorded in selling, general, and administrative expenses. There was no impairment related to incremental costs capitalized for the years ended September 30, 2022 and 2021, respectively.\nCosts to fulfill a contract are capitalized when the costs are related to a contract or anticipated contract, generate or enhance resources that will be used in satisfying performance obligations in the future, and costs are recoverable. Costs to fulfill a contract are related to the TS portion of the business and involve activities performed before managed services can be completed. Current capitalized fulfillment costs are in the other current assets and noncurrent costs are in other assets on the consolidated balance sheets. The portion of current capitalized costs were $9 thousand as of September 30, 2022 and $13 thousand as of September 30, 2021. There were no noncurrent capitalized costs as of September 30, 2022. The portion of noncurrent capitalized costs was $9 thousand as of September 30, 2021. The amount of fulfillment costs amortized year ended September 30, 2022 and 2021 were $13 thousand and $13 thousand, respectively. These costs amortized were recorded in cost of sales. There was no impairment related to fulfillment costs capitalized for the years ended September 30, 2022 and 2021, respectively.\nOther\nProjects are typically billed upon completion or at certain milestones. Product and services are typically billed when shipped or as services are being performed. Payment terms are typically 30 days to pay in full except in Europe where it could be up to 90 days. Most of our contracts are less than one year. There are certain contracts that contain a financing component. See Note 1 Summary of Significant Accounting Policies to the consolidated financial statements for additional information. We elected to use the optional exemption to not disclose the aggregate amount of the transaction price allocated to performance obligations that have an original expected duration of one year or less. This is due to a low amount of performance obligations, which are less than one year from being unsatisfied at each period end. Most of these contracts are related to product sales.\nWe have certain contracts that have an original term of more than one year. The royalty agreement is longer than one year, but not included in the table below as the royalties are sales-based. Managed service contracts are generally longer than one year. For these contracts the aggregate amount of the transaction price allocated to the performance obligations that are unsatisfied or partially unsatisfied as of September 30, 2022 is set forth in the table below:\n(Amounts in thousands)\nFiscal 2023\nFiscal 2024\n$\nProduct Warranty Accrual\nOur product sales generally include a hardware warranty which ranges from 90-days to three-years. At time of product shipment, we accrue for the estimated cost to repair or replace potentially defective products. Estimated warranty costs are based upon prior actual warranty costs for substantially similar products. See Note 11 Product Warranties for balances as of September 30, 2022 and 2021.\nEngineering and Development Expenses\nEngineering and development expenses include payroll, employee benefits, stock-based compensation and other headcount-related expenses associated with product development. Engineering and development expenses also include third-party development and programming costs. We consider technological feasibility for our software products to be reached upon the release of the software, accordingly, no internal software development costs have been capitalized.\nIncome Taxes\nWe use the asset and liability method of accounting for income taxes whereby deferred tax assets and liabilities are recognized for the estimated future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases. Deferred tax assets and liabilities are measured using enacted tax rates in effect for the year in which those temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date. We also reduce deferred tax assets by a valuation allowance if, based on the weight of available evidence, it is more likely than not that some portion or all of the recorded deferred tax assets will not be realized in future periods. This methodology requires estimates and judgments in the determination of the recoverability of deferred tax assets and in the calculation of certain tax liabilities. Valuation allowances are recorded against the gross deferred tax assets that management believes, after considering all available positive and negative objective evidence, historical and prospective, with greater weight given to historical evidence, that it is more likely than not that these assets will not be realized.\nIn addition, we are required to recognize in the consolidated financial statements, those tax positions determined to be more-likely-than-not of being sustained upon examination, based on the technical merits of the positions as of the reporting date. If a tax position is not considered more-likely-than-not to be sustained based solely on its technical merits, no benefits of the position are recognized.\nIn addition, the calculation of the Companys tax liabilities involves dealing with uncertainties in the application of complex tax regulations in a multitude of jurisdictions. The Company records liabilities for estimated tax obligations in the U.S. and other tax jurisdictions. These estimated tax liabilities include the provision for taxes that may become payable in the future.\nEarnings per Share of Common Stock\nBasic net income per common share is computed by dividing net income available to common shareholders by the weighted average number of common shares outstanding for the period. Diluted net income per common share reflects the maximum dilution that would have resulted from the assumed exercise and share repurchase related to dilutive stock options and is computed by dividing net income by the assumed weighted average number of common shares outstanding.\nWe are required to present earnings per share (\"EPS\") utilizing the two-class method because we had outstanding, non-vested share-based payment awards that contain non-forfeitable rights to dividends or dividend equivalents, which are considered participating securities.\nBasic and diluted earnings per share computations for the Companys reported net income attributable to common stockholders are as follows:\nYear ended\nSeptember 30,\nSeptember 30,\nNet income from continuing operations\n$\n1,889\n$\nNet income from sale of discontinued operations\n-\nNet income\n1,889\nLess: net income attributable to nonvested common stock\nNet income attributable to common shareholders\n$\n1,789\n$\nNet income attributable to common shareholders from continuing operations\n$\n1,789\n$\nNet income attributable to common shareholders from discontinued operations\n-\nNet income attributable to common shareholders\n$\n1,789\n$\nWeighted average total common shares outstanding - basic\n4,498\n4,356\nLess: weighted average non-vested shares outstanding\n(237)\n(205)\nWeighted average number of common shares outstanding - basic\n4,261\n4,151\nAdd: potential common shares from non-vested stock awards and the assumed exercise of stock options\nWeighted average common shares outstanding - diluted\n4,278\n4,220\nNet income from continuing operations per common share - basic\n$\n0.42\n$\n0.05\nNet income from discontinued operations per common share - basic\n$\n-\n$\n0.11\nNet income per common share - basic\n$\n0.42\n$\n0.16\nNet income from continuing operations per common share - diluted\n$\n0.42\n$\n0.05\nNet income from discontinued operations per common share - diluted\n$\n-\n$\n0.11\nNet income per common share - diluted\n$\n0.42\n$\n0.16\nAll anti-dilutive securities, including stock options, are excluded from the diluted income per share computation. Non-vested restricted stock awards of 170,600 shares were excluded from net income per share for the year ended September 30, 2022, because their inclusion would have been anti-dilutive. Non-vested restricted stock awards of 136,000 shares were excluded from net income per share for the year ended September 30, 2021, because their inclusion would have been anti-dilutive.\nUse of Estimates\nThe preparation of consolidated financial statements in conformity with accounting principles generally accepted in the United States requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results may differ from those estimates under different assumptions or conditions.\nStock-Based Compensation\nWe measure and recognize compensation expense for all stock-based payment awards made to employees and directors including stock options and nonvested shares of restricted common stock based on estimated fair values of stock-based payment awards on the date of grant. The Company uses the Black-Scholes option-pricing model to calculate the fair value of stock option grants. The fair value of nonvested restricted share awards is equal to the quoted market price of our common stock as quoted on the Nasdaq Global Market on the date of grant. The fair value of the portion of the award\nthat is ultimately expected to vest is recognized as expense over the requisite service periods in the Companys consolidated statements of operations.\nBecause stock-based compensation expense recognized in the consolidated statements of operations for the fiscal years ended September 30, 2022 and 2021 is based on awards ultimately expected to vest, it has been reduced for estimated forfeitures and will be revised, if necessary, in subsequent periods if actual forfeitures differ from those estimates.\nStock-based compensation expense recognized for the fiscal years ended September 30, 2022 and 2021 consisted of options and restricted stock granted pursuant to the Companys stock incentive and employee stock purchase plans of approximately $1.0 million and $1.0 million, respectively.\nConcentrations of Credit Risk\nCash and cash equivalents are maintained with several financial institutions in the U.S. and the U.K. Deposits held with banks may exceed the amount of insurance on such deposits. Generally, these deposits may be redeemed upon demand. The Company has not experienced any losses in such accounts and believes it is not exposed to any significant credit risk on cash and cash equivalents.\nWe had one customer who totaled approximately $15.8 million, or 52%, and approximately $16.2 million, or 62%, of total consolidated accounts receivable as of September 30, 2022 and September 30, 2021, respectively. We believe that the Company is not exposed to any significant credit risk with respect to the accounts receivable with this customer as of September 30, 2022. No other customers accounted for 10% or more of total consolidated accounts receivable as of September 30, 2022\nSubsequent Events\nThe Company recognizes in the consolidated financial statements the effects of all subsequent events that provide additional evidence about conditions that existed at the date of the statement of financial position, including the estimates inherent in the process of preparing financial statements. The Company has evaluated subsequent events through the date of this filing.\nNew accounting standards not adopted as of September 30, 2022\nIn June 2016, the FASB issued ASU 2016-13, Financial Instruments-Credit Losses (Topic 326), an amendment of the FASB Accounting Standards Codification. This ASU will change how entities account for credit losses for most financial assets and certain other instruments. For trade receivables, loans and held-to-maturity debt securities entities will be required to estimate lifetime expected credit losses. For available-for-sale debt securities entities will be required to recognize an allowance for credit losses rather than a reduction to the carrying value of the asset. Additionally, there will be a significant increase in the amount of disclosures by year of origination for certain financing receivables. For public entities classified as a smaller reporting company, the new standard is effective for annual periods beginning after December 15, 2022 (ASU 2019-10 Financial Instruments-Credit Losses (Topic 326), Derivatives and Hedging (Topic 815), and Leases (Topic 842): Effective Dates), including interim periods within that annual period. The Company is evaluating the effect that ASU 2016-13 will have on its consolidated financial statements and related disclosures.\n2. Discontinued Operations of TS Segment\nCSPi sold all stock of Modcomp GmbH to Reply AG on July 31, 2018 for $14.4 million cash and a gain of $18.1 million. This sale was recorded in fiscal year 2018. An additional €400 thousand was included in escrow as part of the Share Purchase and Assignment Agreement to potentially be received later as a purchase price adjustment in fiscal year 2021. This amount was received in July 2021 and recorded as a gain from discontinued operations in the Consolidated Statements of Operations, which is consistent with the presentation for the original transaction. No income taxes were provided as the transaction was a tax-free exchange in the U.K. There are no other amounts that will be received as part of the agreement.\n3. Accounts and Long-Term Receivable\nWithin accounts receivable and long-term receivable there are amounts due reflecting sales whose payment terms exceed one year. This financing is separate from agreements with a leasing component, see Note 10 Leases for financing through leases. These receivables are included in Accounts Receivable and Long-Term Receivable in the amount of $8.9 million and $7.4 million as of September 30, 2022, respectively. These receivables are included in Accounts Receivable and Long-Term Receivable in the amount of $6.5 million and $7.5 million as of September 30, 2021, respectively. The receivables with a payment term exceeding one year carry an average weighted interest rate of 4.7% as of September 30, 2022, which reflects the approximate interest rate consistent with a separate financing transaction with the customer at the inception of the agreement.\nThere is not an allowance for credit losses nor impairments for accounts and long-term receivables with a contractual maturity of over one year. All accounts had no past amounts due as of September 30, 2022 or 2021, respectively. There was no activity in the allowance for credit losses of these receivables for the years ended September 30, 2022 and 2021, respectively. All these agreements are looked at as one portfolio in determining credit losses. There are various factors that are considered in extending a customer payment terms longer than one year including payment history, economic conditions, and capacity to pay. The credit quality of customers is monitored by payment activity. The unearned income represents a rate similar to market at the inception of the agreement.\nThe amount of interest income earned from sales whose payment terms exceed one year for the year ended September 30, 2022 and 2021 was $548 thousand and $547 thousand, respectively. Interest income from these agreements is recorded in Other income, net on the Consolidated Statements of Operations.\nThere was one new agreement effective in the first quarter of fiscal year 2022 causing an increase in Accounts and Long-term receivable. This agreement included approximately $0.5 million of payments to be received over the next 2 years from the effective date of the agreement. The revenue for this transaction was recorded net during the first quarter of fiscal year 2022.\nThere was one new agreement effective in the third quarter of fiscal year 2022 causing an increase in Accounts and Long-term receivable. This agreement included approximately $0.8 million of payments to be received over the next 3 years from the effective date of the agreement. The revenue for this transaction was recorded net during the third quarter of fiscal year 2022.\nThere was one new agreement effective in the fourth quarter of fiscal year 2022 causing an increase in Accounts and Long-term receivable. This agreement included approximately $12.8 million of payments to be received over the next 2 years from the effective date of the agreement. The revenue for this transaction was recorded net during the fourth quarter of fiscal year 2022.\nReceivables whose payment terms exceed one year are placed on nonaccrual status, meaning interest income stops being recorded, when the customer has a past due amount in excess of 30 days or reasonable doubt exists in collecting all interest and principal. A payment due in excess of 30 days is considered delinquent. If a payment is received for a receivable on nonaccrual status the payment is first applied to interest and then principal. Recording interest income resumes once no reasonable doubt exists regarding collecting all interest and principal.\nContractual maturities of outstanding financing receivables with an original contractual maturity over one year are as follows:\nFiscal year ending September 30:\n(Amounts in thousands)\n$\n9,527\n6,106\n1,560\nTotal payments\n$\n17,193\nLess: unearned interest income\n(865)\nTotal, net of unearned interest income\n$\n16,328\n4. Inventories\nInventories consist of the following:\nSeptember 30,\nSeptember 30,\n(Amounts in thousands)\nRaw materials\n$\n$\nWork-in-process\nFinished goods\n3,928\n2,964\nTotal\n$\n4,372\n$\n3,989\nSeveral components used in our HPP segment products are obtained from sole-source suppliers. We are dependent on key vendors such as ADP, NXP, and BCRM for a variety of processors for certain products. We are dependent NVIDIA for our high-speed interconnect components and Marvel for Myricom components. Despite our dependence on these sole-source suppliers, based on our current forecast and our projected sales obligations, we believe we have adequate inventory on hand and our current near-term requirements can be met in the existing supply chain.\nCOVID-19 has adversely affected the distribution channel leading to significantly longer lead times when ordering product. Manufacturers are not producing as much product as prior to the pandemic due to disruptions, resulting in supply shortages. Additionally, recent global shipping delays have exacerbated this problem. The TS segment has many vendors it transacts with and supply shortages are pervasive with many of them.\n5. Accumulated Other Comprehensive Loss\nThe components of accumulated other comprehensive loss are as follows:\nEffect of\nAccumulated\nForeign\nMinimum\nOther\nCurrency\nPension\nComprehensive\nTranslation\nLiability\nLoss\n(Amounts in thousands)\nBalance as of September 30, 2020\n$\n(4,696)\n$\n(7,299)\n$\n(11,995)\nChange in period\n1,972\n2,618\nTax effect of change in period\n-\n(71)\n(71)\nBalance as of September 30, 2021\n$\n(4,050)\n$\n(5,398)\n$\n(9,448)\nChange in period\n(1,741)\n4,096\n2,355\nTax effect of change in period\n-\n(235)\n(235)\nBalance as of September 30, 2022\n$\n(5,791)\n$\n(1,537)\n$\n(7,328)\nThe changes in the minimum pension liability are net of amortization of net loss of $91 thousand in 2022 and net loss of $235 thousand in 2021 included in net periodic pension cost.\n6. Income Taxes\nThe components of income before income tax expense, income tax expense (benefit), and deferred income tax are comprised of the following:\nFor the Years Ended\nSeptember 30,\n(Amounts in thousands)\nIncome (loss) before income tax expense1\nU.S.\n$\n$\n1,316\nForeign\n1,522\n(173)\n$\n1,939\n$\n1,143\nIncome tax expense (benefit):\nCurrent:\nFederal\n$\n-\n$\n(674)\nState\n(30)\n$\n$\n(704)\nDeferred:\nFederal\n$\n-\n$\n1,148\nTotal income tax expense\n$\n$\n1 FY 2021 consists of $678 thousand from continuing operations and $465 thousand from discontinued operations totaling $1,143 thousand.\nThe effective income tax rate differed from the statutory federal income tax rate due to the following:\nFor the Years Ended September 30,\n(Dollar amounts in thousands)\nComputed expected tax expense\n$\n21.0\n%\n$\n21.0\n%\nIncreases (reductions) in taxes resulting from:\nState income taxes, net of federal tax benefit\n1.5\n%\n(38)\n(3.3)\n%\nForeign rate differential\n(30)\n(1.5)\n%\n1.1\n%\nExclusion of PPP Loan Forgiveness Income\n-\n-\n%\n(458)\n(40.1)\n%\nExclusion of the UK's Gain on Sale of Disc Ops Entity\n-\n-\n%\n(98)\n(8.6)\n%\nPermanent differences\n(19)\n(1.0)\n%\n(22)\n(1.9)\n%\nChange in valuation allowance\n(226)\n(11.5)\n%\n1,598\n139.8\n%\nResearch and development credit\n(131)\n(6.8)\n%\n(116)\n(10.1)\n%\nBenefit of US Federal NOL carryback\n-\n-\n%\n(359)\n(31.4)\n%\nReturn to Provision Adjustments\n0.7\n%\n(394)\n(34.5)\n%\nOther items\n0.2\n%\n6.8\n%\nIncome tax expense\n$\n2.6\n%\n$\n38.8\n%\nSignificant components of the Company's net deferred tax assets and liabilities as of September 30, 2022 and 2021 are as follows:\nSeptember 30,\nSeptember 30,\n(Amounts in thousands)\nDeferred tax assets:\nPension\n$\n$\n1,006\nIntangibles\nOther reserves and accruals\nInventory reserves and other\nFederal and state tax credits\n1,273\n1,141\nFederal and state net operating loss carryforwards\nForeign net operating loss carryforwards\n2,693\n2,333\nGross deferred tax assets\n5,359\n5,524\nLess: valuation allowance\n(5,029)\n(5,334)\nRealizable deferred tax asset\n$\n$\nDeferred tax liabilities:\nDepreciation and amortization\n$\n(121)\n$\n(190)\nPension\n(209)\n-\nRealizable deferred tax liabilities\n$\n(330)\n$\n(190)\nNet deferred tax assets\n$\n-\n$\n-\nThe Company regularly assesses the need for a valuation allowance against its deferred tax assets. In making that assessment, the Company considers both positive and negative evidence related to the likelihood of realization of the deferred tax assets to determine, based on the weight of available evidence, whether it is more-likely-than-not that some or all of the deferred tax assets will not be realized. In assessing the realizability of deferred tax assets, we consider taxable income in prior carryback years, as permitted under the tax law, our forecasted taxable earnings, tax planning strategies, and the expected timing of the reversal of temporary differences. This determination requires significant judgment, including assumptions about future taxable income that are based on historical and projected information and is performed on a jurisdiction-by-jurisdiction basis.\nThe valuation allowance against deferred tax assets decreased by approximately $305 thousand during fiscal year 2022. During the year ended September 30, 2022, management assessed the positive and negative evidence in the U.S. operations and concluded that it is more likely than not that deferred tax assets as of September 30, 2022 will not be realized in light of recent results, the ongoing effects of the coronavirus (COVID-19) pandemic, and the resulting economic fallout. We continue to maintain a full valuation allowance against our U.K. deferred tax assets as we have experienced cumulative losses and do not have any indication that the operation will be profitable in the future to an extent that will allow us to utilize much of our net operating loss carryforwards.\nTo the extent that actual experience deviates from our assumptions, our projections would be affected and hence our assessment of realizability of our deferred tax assets may change.\nAs of September 30, 2022 the Company had U.S. net operating loss carryforwards for federal purposes of approximately $162 thousand. There were no U.S. net operating loss carryforwards for federal purposes as of September 30, 2021. As of September 30, 2022, and 2021, the Company had U.S. tax credit carryforwards for federal purposes of $884 thousand and $753 thousand, respectively. The U.S. tax credit carryforwards begin to expire in the Company's fiscal year 2038. The fiscal year 2022 federal R&D credit and all carried forward credits will be used to offset future tax liabilities.\nAs of September 30, 2022, and 2021, the Company had U.S. net operating loss carryforwards for state purposes of approximately $3.7 million and $3.4 million, respectively, which are available to offset future taxable income through fiscal year 2042. As of September 30, 2022, the Company had state tax credit carryforwards of $1.1 million available to\nreduce future state tax expense, of which $50 thousand has unlimited carryover status and the remainder of the credits are available through fiscal year 2035.\nAs of September 30, 2022, the Company had U.K. net operating loss carryforwards of approximately $14.2 million that have an indefinite life with no expiration. Subsequent to September 30, 2022 approximately 3.5 million U.S. Dollars was transferred from the foreign subsidiary in the U.K. to Modcomp, Inc. (TS-US) to use in operations.\nUndistributed earnings of the Company's foreign subsidiaries amounted to approximately $6.1 million and $7.9 million as of September 30, 2022 and 2021, respectively. The Company is considering cash distribution of undistributed foreign earnings in the future and will continue to assess the potential impact of any future distributions on U.S. taxes. The state tax impact of a distribution of foreign earnings and profits would not be material.\nIn addition, the calculation of the Company's tax liabilities involves dealing with uncertainties in the application of complex tax regulations in a multitude of jurisdictions. The Company records liabilities for estimated tax obligations in the U.S. and other tax jurisdictions. These estimated tax liabilities include the provision for taxes that may become payable in the future.\nAs of September 30, 2022, the total amount of uncertain tax liabilities relates to state tax credit carryforwards and are all recorded net in deferred taxes.\nA reconciliation of the beginning and ending balances of the total amounts of gross unrecognized tax benefits is as follows:\nFor the Year Ended\nFor the Year Ended\nSeptember 30, 2022\nSeptember 30, 2021\n(Amounts in thousands)\nBalance, beginning of year\n$\n$\nAdditions for tax positions of current year\nAdditions for tax positions of prior years\nBalance, end of period\n$\n$\nWe file income tax returns in the U.S. federal jurisdiction and various state and foreign jurisdictions. The Company has reviewed the tax positions taken on returns filed domestically and in its foreign jurisdictions for all open years, generally fiscal 2019 through 2022, and believes that tax adjustments in any audited year will not be material.\n7. Property, Equipment and Improvements, Net\nProperty, equipment and improvements, net consist of the following:\nSeptember 30,\nSeptember 30,\n(Amounts in thousands)\nLeasehold improvements\n$\n$\nEquipment\n8,842\n8,707\nAutomobiles\nProperty, equipment and improvements, gross\n9,182\n9,047\nLess accumulated depreciation and amortization\n(8,535)\n(8,283)\nProperty, equipment and improvements, net\n$\n$\nThe Company uses the straight-line method over the estimated useful lives of the assets to record depreciation expense. Depreciation expense was $350 thousand and $379 thousand for the years ended September 30, 2022 and 2021, respectively.\n8. Acquired Intangible Assets\nAs of September 30, 2022 and 2021, intangible assets are as follows:\nSeptember 30, 2022\nSeptember 30, 2021\nWeighted\nWeighted\nAverage\nAverage\nRemaining\nRemaining\nAmortization\nAccumulated\nAmortization\nAccumulated\nPeriod\nGross\nAmortization\nNet\nPeriod\nGross\nAmortization\nNet\n(Amounts in thousands)\nCustomer list\n2 years\n$\n$\n$\n3 years\n$\n$\n$\nAmortization expense on these intangible assets was $9 thousand and $9 thousand for the year ended September 30, 2022 and 2021, respectively.\nAnnual amortization expense related to intangible assets for each of the following successive fiscal years is as follows:\nFiscal year ending September 30:\n(Amounts in thousands)\nTotal\n$\n9. Accounts payable and accrued expenses, and Other noncurrent liabilities\nAccounts payable and accrued expenses consist of the following:\nSeptember 30,\n(Amounts in thousands)\nAccounts payable\n$\n19,241\n$\n11,271\nCommissions\nCompensation and fringe benefits\n1,607\n1,233\nProfessional fees\nTaxes, other than income\nFinance lease liability\nOperating lease liability\nProduct warranty\n$\n22,463\n$\n13,928\nThe Company enters into certain multi-year agreements with vendors when also entering into some of the multi-year contracts the Company enters into with customers. See Note 3 Accounts and Long-Term Receivable for further information related to the multi-year agreements with customers.\nThere was not an interest rate stated in the agreements and therefore interest was imputed under ASC 835 Interest as the payments in the exchange represented two elements: principal and interest. The imputed interest rate for the agreements was determined to be 5.0%. The rate was determined primarily based on the rate the Company could obtain by financing from other sources at the date of the transaction.\nInterest expense related to these agreements was $260 thousand and $190 thousand for the years ended September 30, 2022 and 2021, respectively.\nThe amounts owed for these agreements are within accounts payable and other noncurrent liabilities because they are owed to a vendor rather than banks or financial institutions for borrowings. See Note 12 Line of Credit and Note 13 Notes Payable for amounts due to banks and other financial institutions for borrowings.\nBelow are details of the aforementioned agreements with the vendors that contain imputed interest:\nSeptember 30, 2022\nSeptember 30, 2021\n(Amounts in thousands)\nCurrent\n$\n1,758\n$\n1,627\nLess: discount\nAccounts payable and accrued expenses\n$\n1,574\n$\n1,380\nNoncurrent\n$\n3,186\n$\n4,682\nLess: discount\nOther noncurrent liabilities\n$\n3,048\n$\n4,367\nThe Company had a total of approximately $16.1 million due (net of interest) to one of these vendors as of September 30, 2022. This is approximately 63% of Accounts payable and other noncurrent liabilities. The majority of this balance involves one large transaction that occurred in the fourth quarter of fiscal year 2022. The Company had a total of approximately $7.8 million due (net of interest) to one of these vendors as of September 30, 2021. This is approximately 41% of Accounts payable and other noncurrent liabilities.The TS segment has many vendors it transacts with and does not have any specific agreement with this vendor that it must purchase certain products from the vendor. Management believes other suppliers could provide similar products on comparable terms.\n10. Leases\nInformation related to both lessee and lessor\nThe following table specifies where the right-of-use assets and lease liabilities are within the Consolidated Balance Sheets as of September 30, 2022 and 2021:\nCondensed Balance Sheets Location\nSeptember 30, 2022\nSeptember 30, 2021\n(Amounts in thousands)\nAssets\nOperating leases\nOperating lease right-of-use assets\n$\n1,160\n$\n1,358\nLease receivable - current\nInvestment in lease, net-current portion\n$\n$\nLease receivable - noncurrent\nInvestment in lease, net-less current portion\nTotal lease receivable\n$\n$\nLiabilities\nCurrent operating lease liabilities\nAccounts payable and accrued expenses\n$\n$\nNon-current operating lease liabilities\nOperating lease liabilities - noncurrent portion\nTotal operating lease liabilities\n$\n1,173\n$\n1,390\nCurrent finance lease liabilities\nAccounts payable and accrued expenses\n$\n$\nNon-current finance lease liabilities\nOther noncurrent liabilities\n-\nTotal finance lease liabilities\n$\n$\nThe components of lease costs for the year ended September 30, 2022 and 2021 are as follows:\nYear ended\nCondensed Consolidated Statements of Operations Location\nSeptember 30, 2022\nSeptember 30, 2021\n(Amounts in thousands)\nFinance Lease:\nInterest on lease liabilities\nInterest expense\n$\n$\nOperating Lease:\nOperating lease cost\nSelling, general, and administrative\nShort-term lease cost\nSelling, general, and administrative\nTotal lease costs\n$\n$\nLess sublease interest income\nRevenue\n(1)\n(20)\nTotal lease costs, net of sublease interest income\n$\n$\nFuture lease payments under our non-cancellable leases and payments to be received as a sublessor as of September 30, 2022 are in the following table:\nOperating lease\nFinance lease\nSublease\nFiscal year ending September 30:\nCosts\nCosts\nPayments received\n(Amounts in thousands)\n$\n$\n$\n-\n-\n-\n-\n-\nTotal\n$\n1,242\n$\n$\nLess imputed interest\n(69)\n(1)\n-\nTotal\n$\n1,173\n$\n$\nSupplemental cash flow information related to leases for the fiscal year ended September 30, 2022 and 2021 is below:\nYear ended\nSeptember 30, 2022\nSeptember 30, 2021\n(Amounts in thousands)\nCash paid for amounts included in the measurement of lease liabilities:\nOperating cash flows from operating leases\n$\n$\nOperating cash flows from short-term leases\nOperating cash flows from finance leases\nFinancing cash flows from finance leases\nLease assets obtained in exchange for new lease liabilities\nOperating leases\n-\nCash received from subleases\n(49)\n(356)\nInformation as a lessee related to weighted averages of lease term and discount rate as of September 30, 2022 is below:\nWeighted-average remaining lease term (years)\nSeptember 30, 2022\nOperating leases\n2.3\nFinance leases\n0.9\nWeighted-average discount rate\nSeptember 30, 2022\nOperating leases\n4.7%\nFinance leases\n3.4%\n11. Product Warranties\nProduct warranty activity for the year ended September 30 2022 and 2021 was as follows:\n(Amounts in thousands)\nBalance at the beginning of the year\n$\n$\nAccruals for warranties for products sold in the period\n-\nFulfillment of warranty obligations\n(23)\n(24)\nBalance at the end of the year\n$\n$\nThese amounts are within Accounts payable and accrued expenses on the Consolidated Balance Sheets.\n12. Line of Credit\nAs of September 30, 2022 and September 30, 2021, the Company maintained an inventory line of credit with a borrowing capacity of $15.0 million. It may be used by the TS or HPP segment in the U.S. to purchase inventory from approved vendors with payment terms which exceed those offered by the vendors. No interest accrues under the inventory line of credit when advances are paid within terms, however, late payments are subject to an interest charge of the rate published in the Wall Street Journal as the prime rate plus 5%. The prime rate was 6.25% as of September 30, 2022. There is no expiration date or minimum principal payment. However, the credit agreement for the inventory line of credit contains financial covenants which require the Company to maintain the following TS segment-specific financial ratios: (1) a minimum current ratio of 1.2, (2) tangible net worth of no less than $4.0 million, and (3) a maximum ratio of total liabilities to total net worth of less than 5.0:1. As of September 30, 2022 and September 30, 2021, Company borrowings, all from the TS segment, under the inventory line of credit were $3.1 million and $0.9 million, respectively, and the Company was in compliance with all covenants. There is no unused commitment fee. As of September 30, 2022 and September 30, 2021, this line of credit also included availability of a limited cash withdrawal option of up to $1.0 million. As of September 30, 2022 and 2021, there were no cash withdrawals outstanding.\n13. Notes Payable\nIn September 2019, the Company borrowed $1.0 million with a 5.0% rate of interest related to a multi-year agreement with a customer. See Note 3 Accounts and Long-Term Receivable for the disclosure related to the receivables. This was fully repaid in fiscal year 2022.\nIn October 2019, the Company borrowed $2.0 million with a 5.1% rate of interest related to a multi-year agreement with a customer. This is the only note payable outstanding as of September 30, 2022.\nOn April 17, 2021, CSP, Inc. and Modcomp, Inc., its wholly owned subsidiary (collectively, the Borrowers) each received a loan in the form of a promissory note from Paragon Bank (Lender) in the amounts of $827,000 and $1,353,600, respectively (the SBA Loans) under the Paycheck Protection Program (PPP), which was established under the recently enacted Coronavirus Aid, Relief, and Economic Security Act (CARES Act) administered by the U.S. Small Business Administration (SBA). The SBA Loans have a two-year term and carry an annual fixed interest rate of 1%.\nThe SBA Loans provided for customary events of default, including, among others, those relating to failure to make payment, bankruptcy, materially false or misleading representations to Lender or SBA, and adverse changes in the financial condition or business operations that Lender believed could materially affect Borrowers ability to pay the SBA Loans. The Borrowers did not provide any collateral or guarantees for the SBA Loans and the Borrowers could prepay the principal of the SBA Loans at any time without penalty.\nThe Borrowers applied to the Lender for forgiveness of an amount due on the SBA Loans in an amount equal to the sum of certain costs during the 24 week period beginning on the date of the first disbursement of the SBA Loans. The amount of SBA Loans forgiveness was calculated in accordance with the requirements of the PPP, including provisions of Section 1106 of the CARES Act. We used the SBA Loans proceeds in accordance with the applicable SBA guidelines. In November 2021 the SBA Loans were formally forgiven. The $2.2 million gain is presented on the Consolidated Statement of Operations as Gain on forgiveness of debt for the year ended September 30, 2021.\nInterest expense related to the notes for the years ended September 30, 2022 and 2021 was $50 thousand and $87 thousand, respectively. Below are details of the notes payable.\nFiscal year ending September 30:\n(Amounts in thousands)\n$\nTotal\nLess: note discount\nTotal\n$\nSeptember 30, 2022\nSeptember 30, 2021\n(Amounts in thousands)\nCurrent\n$\n$\nLess: notes discount\nNotes payable - current portion\n$\n$\nNoncurrent\n$\n$\nLess: notes discount\n-\nNotes payable - noncurrent portion\n$\n$\n14. Pension and Retirement Plans\nWe have defined benefit and defined contribution plans in the U.K. and in the U.S. In the U.K., the Company provides defined benefit pension plans for certain employees and former employees and defined contribution plans for the majority of the employees. The defined benefit plans in the U.K. are frozen to newly hired employees and have been for the two years ended September 30, 2022. In the U.S., the Company also provides defined contribution plans that cover most employees and supplementary retirement plans to certain employees and former employees who are now retired. These supplementary retirement plans are also closed to newly hired employees and have been for the two years ended September 30, 2022. These supplementary plans are funded through whole life insurance policies. The Company expects to recover all insurance premiums paid under these policies in the future, through the cash surrender value of the policies and any death benefits or portions thereof to be paid upon the death of the participant. These whole life insurance policies are carried on the balance sheet at their cash surrender values as they are owned by the Company and not assets of the defined benefit plans. In the U.S., the Company also provides for officer death benefits and post-retirement health insurance benefits through supplemental post-retirement plans to certain officers. The Company also funds these supplemental plans obligations through whole life insurance policies on the officers. A gain on a life insurance policy of $0.1 million occurred during the second quarter of fiscal year 2022. The gain on this life insurance policy was not related to a current employee at time of expiration. The Company received $322 thousand from the life insurance policy during Q3 of fiscal year 2022. Additionally, during the fiscal third quarter management made the decision to pay back approximately $0.9 million of insurance policy loans.\nDefined Benefit Plans\nThe Company funds its pension plans in amounts sufficient to meet the requirements set forth in applicable employee benefits laws and local tax laws. Liabilities for amounts in excess of these funding levels are accrued and reported in the consolidated balance sheets.\nThe domestic supplemental retirement plans have life insurance policies which are not considered plan assets but were purchased by the Company as a vehicle to fund the costs of the plan. These insurance policies are included in the balance sheet at their cash surrender value, net of policy loans, aggregating $3.5 million and $2.6 million as of September 30, 2022 and 2021, respectively. The loans against the policies have been taken out by the Company to pay the premiums. The costs and benefit payments for these plans are paid through operating cash flows of the Company to the extent that they cannot be funded through the use of the cash values in the insurance policies. The Company expects that the recorded value of the insurance policies will be sufficient to fund all of the Companys obligations under these plans.\nAssumptions:\nThe following table provides the weighted average actuarial assumptions used to determine the actuarial present value of projected benefit obligations at:\nDomestic\nInternational\nSeptember 30,\nSeptember 30,\nDiscount rate:\n5.14\n%\n2.75\n%\n5.2\n%\n2.00\n%\nExpected return on plan assets:\n6.0\n%\n4.00\n%\nThe following table provides the weighted average actuarial assumptions used to determine net periodic benefit cost for years ended:\nDomestic\nInternational\nSeptember 30,\nSeptember 30,\nDiscount rate:\n2.75\n%\n2.50\n%\n5.2\n%\n2.0\n%\nExpected return on plan assets:\n6.0\n%\n4.0\n%\nFor domestic plans, the discount rate was determined by comparison against the FTSE pension liability index for AA rated corporate instruments. The Company monitors other indices to assure that the pension obligations are fairly reported on a consistent basis. The international discount rates were determined by comparison against country specific AA corporate indices, adjusted for duration of the obligation.\nThe periodic benefit cost and the actuarial present value of projected benefit obligations are based on actuarial assumptions that are reviewed on an annual basis. The Company revises these assumptions based on an annual evaluation of long-term trends, as well as market conditions that may have an impact on the cost of providing retirement benefits.\nThe components of net periodic benefit costs related to the U.S. and international plans are as follows:\nYear ended September 30,\nU.K.\nU.S.\nTotal\nU.K.\nU.S.\nTotal\n(Amounts in thousands)\nPension:\nInterest cost\n$\n$\n$\n$\n$\n$\nExpected return on plan assets\n(449)\n-\n(449)\n(398)\n-\n(398)\nAmortization of past service costs\n-\n-\nAmortization of net loss\nNet periodic (benefit) cost\n$\n(77)\n$\n$\n(65)\n$\n$\n$\nPost Retirement:\nService cost\n$\n-\n$\n$\n$\n-\n$\n$\nInterest cost\n-\n-\nAmortization of net (gain) loss\n-\n(7)\n(7)\n-\nNet periodic cost\n$\n-\n$\n$\n$\n-\n$\n$\nPension:\nDecrease in minimum liability included in other comprehensive income\n$\n(3,509)\n(20)\n$\n(3,529)\n$\n(1,794)\n(8)\n$\n(1,802)\nPost Retirement:\nDecrease in minimum liability included in other comprehensive income\n-\n(567)\n(567)\n-\n(170)\n(170)\nTotal:\nDecrease in minimum liability included in other comprehensive income\n$\n(3,509)\n$\n(587)\n$\n(4,096)\n$\n(1,794)\n$\n(178)\n$\n(1,972)\nThe following table presents an analysis of the changes in 2022 and 2021 of the benefit obligation, the plan assets and the funded status of the plans:\nYears Ended September 30\nForeign\nU.S.\nTotal\nForeign\nU.S.\nTotal\n(Amounts in thousands)\nPension:\nChange in projected benefit obligation (PBO)\nBalance beginning of year\n$\n14,317\n$\n$\n14,656\n$\n14,403\n$\n$\n14,829\nInterest cost\nChanges in actuarial assumptions\n(4,574)\n(21)\n(4,595)\n(658)\n(6)\n(664)\nForeign exchange impact\n(1,873)\n-\n(1,873)\n-\nBenefits paid\n(412)\n(68)\n(480)\n(341)\n(92)\n(433)\nProjected benefit obligation at end of year\n$\n7,726\n$\n$\n7,987\n$\n14,317\n$\n$\n14,656\nChanges in fair value of plan assets:\nFair value of plan assets at beginning of year\n$\n11,921\n$\n-\n$\n11,921\n$\n9,740\n$\n-\n$\n9,740\nActual (loss) gain on plan assets\n(1,026)\n-\n(1,026)\n1,655\n-\n1,655\nCompany contributions\nForeign exchange impact\n(1,911)\n-\n(1,911)\n-\nBenefits paid\n(412)\n(68)\n(480)\n(341)\n(92)\n(433)\nFair value of plan assets at end of year\n$\n8,825\n$\n-\n$\n8,825\n$\n11,921\n$\n-\n$\n11,921\nFunded status \\ net amount recognized\n$\n1,099\n$\n(261)\n$\n$\n(2,396)\n$\n(339)\n$\n(2,735)\nPost Retirement:\nChange in projected benefit obligation (PBO):\nBalance beginning of year\n$\n-\n$\n1,670\n$\n1,670\n$\n-\n$\n1,703\n$\n1,703\nService cost\n-\n-\nInterest cost\n-\n-\nChanges in actuarial assumptions\n-\n(574)\n(574)\n-\n(120)\n(120)\nProjected benefit obligation at end of year\n$\n-\n$\n1,186\n$\n1,186\n$\n-\n$\n1,670\n$\n1,670\nFunded status \\ net amount recognized\n$\n-\n$\n(1,186)\n$\n(1,186)\n$\n-\n$\n(1,670)\n$\n(1,670)\nThe amounts recognized in the consolidated balance sheet consist of:\nYears Ended September 30\nForeign\nU.S.\nTotal\nForeign\nU.S.\nTotal\n(Amounts in thousands)\nPension:\nAccrued benefit asset (liability)\n$\n1,099\n$\n(261)\n$\n$\n(2,396)\n$\n(339)\n$\n(2,735)\nDeferred tax\n-\n-\nAccumulated other comprehensive income\n4,140\n4,161\nNet amount recognized\n$\n1,730\n$\n(227)\n$\n1,503\n$\n1,744\n$\n(301)\n$\n1,443\nPost Retirement:\nAccrued benefit liability\n$\n-\n$\n(1,186)\n$\n(1,186)\n$\n-\n$\n(1,670)\n$\n(1,670)\nDeferred tax\n-\n-\nAccumulated other comprehensive (loss) income\n-\n(282)\n(282)\n-\nNet amount recognized\n$\n-\n$\n(1,163)\n$\n(1,163)\n$\n-\n$\n(1,535)\n$\n(1,535)\nTotal pension and post retirement:\nAccrued benefit asset (liability)\n$\n1,099\n$\n(1,447)\n$\n(348)\n$\n(2,396)\n$\n(2,009)\n$\n(4,405)\nDeferred tax\n-\n-\nAccumulated other comprehensive income\n(273)\n4,140\n4,218\nNet amount recognized\n$\n1,730\n$\n(1,390)\n$\n$\n1,744\n$\n(1,836)\n$\n(92)\nAccumulated Benefit Obligation:\nPension\n$\n(7,726)\n$\n(261)\n$\n(7,987)\n$\n(14,317)\n$\n(339)\n$\n(14,656)\nPost Retirement\n-\n(1,186)\n(1,186)\n-\n(1,670)\n(1,670)\nTotal accumulated benefit obligation\n$\n(7,726)\n$\n(1,447)\n$\n(9,173)\n$\n(14,317)\n$\n(2,009)\n$\n(16,326)\nPlans with projected benefit obligations in excess of plan assets are attributable to unfunded domestic supplemental retirement plans, and our U.K. retirement plan.\nAccrued benefit liability reported as:\nSeptember 30,\n(Amounts in thousands)\nNon-current benefits assets\n$\n1,099\n$\n-\nCurrent accrued benefit liability\n$\n$\nNon-current accrued benefit liability\n1,337\n4,097\nTotal accrued benefit liability\n$\n1,447\n$\n4,405\nAs of September 30, 2022 and 2021, the amounts included in accumulated other comprehensive loss, consisted of deferred net losses totaling approximately $0.4 million and $4.2 million, respectively.\nThe amount of net deferred loss expected to be recognized as a component of net periodic benefit cost for the year ending September 30, 2022, is approximately $191 thousand.\nThe assumed discount rate used for the calculation of the projected benefit obligation more than doubled causing a large decrease. Additionally, the expected return on plan assets increased significantly, which cause the net pension liability to decrease.\nContributions\nThe Company expects to contribute $0.2 million to its pension plans for fiscal 2023.\nEstimated Future Benefit Payments\nThe following benefit payments, which reflect expected future service, as appropriate, are expected to be paid (amounts in thousands):\nFiscal year ending September 30:\n(Amounts in thousands)\n$\n$\n$\n$\n$\nThereafter\n$\n1,085\nPlan Assets\nAt September 30, 2022, our pension plan in the U.K. was the only plan with assets, holding investments of approximately $8.8 million. Pension plan assets are managed by a fiduciary committee. The Companys investment strategy for pension plan assets is to maximize the long-term rate of return on plan assets within an acceptable level of risk while maintaining adequate funding levels. Local regulations, local funding rules, and local financial and tax considerations are part of the funding and investment process. In deciding on the investments to be held, the trustees take into account the risk of possible fluctuations in income from, and market values of, the assets as well as the risk of departing from an asset profile which broadly matches the liability profile. The committee has invested the plan assets in a single pooled fund with an authorized investment company (the Fund). The Fund selected by the trustees is consistent with the plans overall investment principles and strategy described herein. There are no specific targets as to asset allocation other than those contained within the Fund that is managed by the authorized investment company.\nThe fair value of the assets held by the U.K. pension plan by asset category are as follows:\nFair Values as of\nSeptember 30, 2022\nSeptember 30, 2021\nFair Value Measurements Using Inputs Considered as\nFair Value Measurements Using Inputs Considered as\nAsset Category\nTotal\nLevel 1\nLevel 2\nLevel 3\nTotal\nLevel 1\nLevel 2\nLevel 3\n(Amounts in thousands)\nCash on deposit\n$\n$\n$\n-\n$\n-\n$\n$\n$\n-\n$\n-\nPooled funds\n8,798\n5,513\n3,285\n-\n11,828\n7,747\n4,081\n-\nTotal plan assets\n$\n8,825\n$\n5,540\n$\n3,285\n$\n-\n$\n11,921\n$\n7,840\n$\n4,081\n$\n-\nThe expected long-term rates of return on plan assets are equal to the yields to maturity of appropriate indices for government and corporate bonds and by adding a premium to the government bond return for equities. The expected rate of return on cash is the Bank of England base rate in force at the effective date.\nLevel 1 investments represent mutual funds for which a quoted market price is available on an active market. These investments primarily hold stocks or bonds, or a combination of stocks and bonds.\nLevel 2 investment represents a mutual fund, which a quoted market price is not available on an active market. Significant observable inputs that reflect quoted prices for similar assets or liabilities in active markets are used. This investment primarily holds stocks within developed global equity markets, excluding the UK.\nDefined Contribution Plans\nThe Company has defined contribution plans in domestic and international locations under which the Company matches a portion of the employees contributions and may make discretionary contributions to the plans. The Companys contributions were $193 thousand and $174 thousand for the years ended September 30, 2022 and 2021, respectively.\n15. Stock Based Incentive Compensation\nIn 2015, the Company adopted the 2015 Stock Incentive Plan (the \"2015 Plan\") and authorized 300,000 shares of common stock to be reserved for issuance pursuant to the 2015 Plan. During 2019 an additional 300,000 shares of common stock were authorized to be reserved for issuance pursuant to the 2015 Plan. During 2022 an additional 400,000 shares of common stock were authorized to be reserved for issuance pursuant to the 2015 Plan. As of September 30, 2022, there were 388,576 shares available to be granted under the 2015 Plan. Under all of the stock incentive plans, both incentive stock options and non-qualified stock options may be granted to officers, key employees and other persons providing services to the Company. All of the Companys stock incentive plans have a ten-year life.\nAwards issued under any of the stock option plans are not affected by termination of the plan. The Company issues stock options at their fair value on the date of grant. Vesting of stock options granted pursuant to the Companys stock incentive plans is determined by the Companys compensation committee. Generally, options granted to employees vest over four years and expire ten years from the date of grant. Options granted to non-employee directors have historically included cliff vesting after six months from the date of grant and expire three years from the date of grant. In fiscal years 2016 through 2022, the Company granted certain officers including its Chief Executive Officer and non-employee directors, and key employees shares of nonvested common stock instead of stock options. The vesting period for the officers and the Chief Executive Officers restricted stock awards are four years. The vesting for non-employee directors restricted stock awards is one year. The vesting period for the key employees restricted stock awards is four years or immediately.\nWe measure and recognize compensation expense for all stock-based payment awards made to employees and directors including employee stock options and awards of nonvested stock based on estimated fair values, as described in Note 1 Summary of Significant Accounting Policies. Stock-based compensation expense incurred and recognized for the years ended September 30, 2022 and 2021 related to stock options and nonvested stock granted to employees and non-employee directors under the Companys stock incentive and employee stock purchase plans totaled approximately $979 thousand and $981 thousand, respectively. The classification of the cost of stock-based compensation, in the consolidated statements of operations, is consistent with the nature of the services being rendered in exchange for the share-based payment.\nThe following table summarizes stock-based compensation expense in the Companys consolidated statements of operations:\nYears Ended\nSeptember 30,\nSeptember 30,\n(Amounts in thousands)\nCost of sales\n$\n-\n$\nEngineering and development\nSelling, general and administrative\nTotal\n$\n$\nFor the year ended September 30, 2022, the Company granted 80,246 nonvested shares to certain key employees, 52,000 nonvested shares to certain officers including 38,000 shares granted to the Chief Executive Officer, and 20,000 nonvested shares to its non-employee directors. For the year ended September 30, 2021, the Company granted 42,457 nonvested shares to certain key employees, 41,000 nonvested shares to certain officers including 30,000 shares granted to the Chief Executive Officer, and 20,000 nonvested shares to its non-employee directors.\nThe Company measures the fair value of nonvested stock awards based upon the market price of its common stock as of the date of grant. The Company used the Black-Scholes option-pricing model to value stock options. The Black-Scholes model requires the use of a number of assumptions including volatility of the Companys stock price, the weighted average risk-free interest rate and the weighted average expected life of the options, at the time of grant. The expected dividend yield is equal to the dividend per share historically declared, divided by the closing share price on the date the options were granted. All equity compensation awards granted for the years ended September 30, 2022 and September 30, 2021 were nonvested stock awards. There were no stock options granted for the years ended September 30, 2022 and 2021.\nAs stock-based compensation expense recognized in the consolidated statements of operations is based on awards ultimately expected to vest, expense for grants beginning upon adoption on October 1, 2005 has been reduced for estimated forfeitures. Forfeitures are estimated at the time of grant and revised, if necessary, in subsequent periods if actual forfeitures differ from those estimates. The forfeiture rates for the years ended September 30, 2022 and 2021 were based on actual forfeitures.\nNo cash was used to settle equity instruments granted under share-base payment arrangements in any of the years in the two-year period ended September 30, 2022.\nThe following tables provide summary data of stock option award activity:\nWeighted\nWeighted\nAverage\nAggregate\naverage\nRemaining\nIntrinsic\nNumber\nexercise\nContractual\nValue\nof Options\nprice\nTerm\n(in thousands)\nOutstanding at September 30, 2020\n1,000\n$\n3.64\n-\n-\nGranted\n-\n-\n-\n-\nExpired\n(500)\n3.85\n-\n-\nForfeited\n-\n-\n-\n-\nExercised\n-\n-\n-\n-\nOutstanding at September 30, 2021\n$\n3.43\n-\n-\nGranted\n-\n-\n-\n-\nExpired\n(500)\n3.43\n-\n-\nForfeited\n-\n-\n-\n-\nExercised\n-\n-\n-\n-\nOutstanding at September 30, 2022\n-\n$\n-\n-\n-\nThe following table provides summary data of nonvested stock award activity:\nWeighted\nWeighted\nAverage\nAverage\nAggregate\nNumber of\ngrant date\nRemaining\nIntrinsic\nnonvested\nFair\nContractual\nValue\nshares\nValue\nTerm\n(in thousands)\nNonvested shares outstanding at September 30, 2020\n202,742\n$\n11.82\n2.21 Years\n$\n1,750\nActivity in fiscal year 2021:\nGranted\n103,465\n$\n8.60\n-\n-\nVested\n(90,395)\n$\n11.79\n-\n-\nForfeited\n(18,750)\n$\n10.37\n-\n-\nNonvested shares outstanding at September 30, 2021\n197,063\n$\n10.28\n2.15 Years\n$\n1,760\nActivity in fiscal year 2022:\nGranted\n152,246\n$\n8.53\n-\n-\nVested\n(87,957)\n$\n10.57\n-\n-\nForfeited\n(1,564)\n$\n13.24\n-\n-\nNonvested shares outstanding at September 30, 2022\n259,788\n$\n9.14\n2.38 Years\n$\n1,868\nAs of September 30, 2022, there was $1.7 million of total unrecognized compensation cost related to nonvested stock-based compensation arrangements (including nonvested stock awards) granted under the Companys stock incentive plans. This cost is expected to be expensed over a weighted average period of approximately 2.56 years. The total fair value of shares vested during the years ended September 30, 2022 and 2021 was $0.9 million and $1.1 million, respectively.\n16. Employee Stock Purchase Plan\nIn December 2013, the Board of Directors of the Company adopted the 2014 Employee Stock Purchase Plan covering up to 250,000 shares of Common Stock (the \"ESPP\"), which was ratified by a vote of the Companys shareholders in February 2014. Under the ESPP, the Companys employees may purchase shares of common stock at a price per share that is currently 95% of the lesser of the fair value as of the beginning or end of semi-annual option periods. Pursuant to the ESPP, the Company issued 31,372 and 32,939 shares for the years ended September 30, 2022 and September 30, 2021, respectively. As of September 30, 2022, 420 shares remain authorized to be issued under the Employee Stock Purchase Plan.\n17. Repurchase of Common Stock\nOn February 8, 2011, the Board of Directors authorized the Company to purchase up to 250 thousand additional shares of the Company's outstanding common stock at market price. The plan does not expire. As of May 14, 2020, we suspended our stock repurchase program until further economic clarity. The Board of Directors approved the activation of the suspended stock repurchase program on December 29, 2021. The Company repurchased 22,398 thousand shares of its outstanding common stock on the open market during fiscal year 2022. As of September 30, 2022, 171,727 shares remain authorized to repurchase under the stock repurchase program.\n18. Segment Information\nThe following table presents certain operating segment information.\nTechnology Solutions Segment\nHigh\nPerformance\nProducts\nUnited\nConsolidated\nYear ended September 30,\nSegment\nKingdom\nU.S.\nTotal\nTotal\n(Amounts in thousands)\nSales:\nProduct\n$\n2,516\n$\n$\n33,654\n$\n34,172\n$\n36,688\nService\n1,327\n16,021\n16,346\n17,673\nTotal sales\n$\n3,843\n$\n$\n49,675\n$\n50,518\n$\n54,361\nOperating (loss) income\n$\n(4,888)\n$\n(204)\n$\n5,052\n$\n4,848\n$\n(40)\nInterest income\n$\n$\n$\n$\n$\nInterest expense\n$\n(48)\n$\n-\n$\n(312)\n$\n(312)\n$\n(360)\nTotal assets\n$\n8,855\n$\n10,069\n$\n56,138\n$\n66,207\n$\n75,062\nCapital expenditures\n$\n$\n-\n$\n$\n$\nDepreciation and amortization\n$\n$\n-\n$\n$\n$\nSales:\nProduct\n$\n3,126\n$\n1,578\n$\n30,522\n$\n32,100\n$\n35,226\nService\n1,497\n12,059\n12,485\n13,982\nTotal sales\n$\n4,623\n$\n2,004\n$\n42,581\n$\n44,585\n$\n49,208\nOperating (loss) income\n$\n(4,578)\n$\n(217)\n$\n3,433\n$\n3,216\n$\n(1,362)\nInterest income\n$\n-\n$\n$\n$\n$\nInterest expense\n$\n(71)\n$\n-\n$\n(279)\n$\n(279)\n$\n(350)\nTotal assets\n$\n9,018\n$\n10,174\n$\n43,782\n$\n53,956\n$\n62,974\nCapital expenditures\n$\n$\n-\n$\n$\n$\nDepreciation and amortization\n$\n$\n-\n$\n$\n$\nProfit (loss) from operations is sales less cost of sales, engineering and development, selling, general and administrative expenses but is not affected by either non-operating charges/income or by income taxes. Non-operating charges/income consists principally of investment income and interest expense. All intercompany transactions have been eliminated. Our long-lived assets are located in North America.\nThe following table details the Companys sales by operating segment for fiscal years ended September 30, 2022 and 2021. The Companys sales by geographic area based on the location of where the products were shipped or services rendered are as follows:\n% of\nAmericas\nEurope\nAsia\nTotal\nTotal\n(Amounts in thousands)\nTS\n$\n49,285\n$\n1,069\n$\n$\n50,518\n%\nHPP\n3,201\n3,843\n%\nTotal\n$\n52,486\n$\n1,407\n$\n$\n54,361\n%\n% of Total\n%\n%\n%\n%\nTS\n$\n41,783\n$\n2,538\n$\n$\n44,585\n%\nHPP\n3,538\n4,623\n%\nTotal\n$\n45,321\n$\n3,203\n$\n$\n49,208\n%\n% of Total\n%\n%\n%\n%\nThe following table lists customers from which the Company derived revenues in excess of 10% of total revenues for the years ended years ended September 30, 2022 and 2021.\nYear ended September 30,\n(in millions)\n(in millions)\nCustomer\n% of Total\nCustomer\n% of Total\nRevenues\nRevenues\nRevenues\nRevenues\nCustomer A\n$\n10.4\n%\n$\n3.4\n%\nIn addition, accounts receivable from Customer A totaled approximately $15.8 million, or 52%, and approximately $16.2 million, or 62%, of total consolidated accounts receivable as of September 30, 2022 and September 30, 2021, respectively. We believe that the Company is not exposed to any significant credit risk with respect to the accounts receivable with this customer as of September 30, 2022. No other customers accounted for 10% or more of total consolidated accounts receivable as of September 30, 2022.\n19. Fair Value Disclosures\nUnder the fair value standards fair value is based on the exit price and defined as the price that would be received to sell an asset or transfer a liability in an orderly transaction between market participants at the measurement date. The fair value measurement should reflect all the assumptions that market participants would use in pricing an asset or liability. A fair value hierarchy is established in the authoritative guidance outlined in three levels ranking from Level 1 to level 3 with Level 1 being the highest priority.\nLevel 1: observable inputs that reflect quoted prices (unadjusted) for identical assets or liabilities in active markets\nLevel 2: inputs other than quoted prices included in Level 1 that are observable for the asset or liability either directly or indirectly\nLevel 3: unobservable inputs (e.g., a reporting entitys or other entitys own data)\nThe Company had no assets or liabilities measured at fair value on a recurring (except our pension plan assets, see Note 14 Pension and Retirement Plan) or non-recurring basis as of September 30, 2022 or September 30, 2021.\nTo estimate fair value of the financial instruments below quoted market prices are used when available and classified within Level 1. If this data is not available, we use observable market-based inputs to estimate fair value, which are classified within Level 2. If the preceding information is unavailable, we use internally generated data to estimate fair value which is classified within Level 3.\nAs of September 30, 2022\nAs of September 30, 2021\nCarrying Amount\nFair Value\nCarrying Amount\nFair Value\nFair Value Level\nReference\n(Amounts in thousands)\nAssets:\nCash and cash equivalents\n$\n23,982\n$\n23,982\n$\n20,007\n$\n20,007\nCondensed Consolidated Balance Sheets\nAccounts and long-term receivable*\n16,328\n16,328\n13,968\n13,968\nNote 3\nLiabilities:\nAccounts payable and accrued expenses and other long-term liabilities*\n4,622\n4,622\n5,747\n5,747\nNote 9\nLine of Credit\n3,124\n3,124\nNote 12\nNotes payable\n1,633\n1,633\nNote 13\n*Original maturity over one year\nCash and cash equivalents\nCarrying amount approximated fair value.\nAccounts and long-term receivable with original maturity over one year\nFair value was estimated by discounting future cash flows based on the current rate with similar terms.\nLine of credit\nThe fair value of our line of credit is based on borrowing rates currently available to a market participant for loans with similar terms or maturity. The carrying amount of our outstanding revolving line of credit approximates fair value because the base interest rate charged varies with market conditions and the credit spread is commensurate with current market spreads for issuers of similar risk. No interest accrues under the inventory line of credit when advances are paid within terms.\nNotes Payable\nFair value was estimated by discounting future cash flows based on the current rate the Company could get in another transaction with similar terms based on historical information.\nFair value of accounts receivable with an original maturity of one year or less and accounts payable was not materially different from their carrying values at September 30, 2022, and 2021.\n20. Dividend\nAs of May 14, 2020, we suspended our stock repurchase program and the payment of quarterly cash dividends until further economic clarity. The dividend was reinstated on August 10, 2022. There were no dividends paid in fiscal year 2021. For the fiscal year ended September 30, 2022 the Company paid cash dividends as follows:\nAmount Paid\nFiscal Year\nDate Declared\nRecord Date\nDate Paid\nPer Share\n8/10/2022\n8/22/2022\n9/9/2022\n$\n0.03\n21. Subsequent Events\nWe entered into a $12.8 million sales agreement with a financing component during the fourth quarter of fiscal 2022 in the TS-US division, which includes receiving three payments including interest with the final payment due in fiscal year 2024. The revenue for this transaction was recorded net during the fourth quarter of fiscal year 2022. Our cost for this agreement was originally going to be paid in full in the fiscal fourth quarter of 2022 as stated in our Form 10-Q for the period ended June 30, 2022 filed with the SEC on August 10, 2022. However, our payment to the vendor was made in the first quarter of fiscal year 2023, which significantly decreased our cash balance."
}