{
    "cik": "38264",
    "company": "Forward Industries, Inc.",
    "filing_type": "10-K",
    "filing_date": "2023-12-21",
    "period_of_report": "2023-09-30",
    "sic": "3089",
    "state_of_inc": "NY",
    "state_location": "NY",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/38264/0001683168-23-009026-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/38264/000168316823009026/forward_i10k-093023.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/38264/0001683168-23-009026.txt",
    "filename": "38264_10K_2023_0001683168-23-009026.htm",
    "content": "ITEM 1. BUSINESS\nGeneral\nForward Industries, Inc. (Forward, we, our or the Company), through its wholly-owned subsidiaries, Forward Industries (IN), Inc. (Forward US), Forward Industries (Switzerland) GmbH (Forward Switzerland), Forward Industries UK Limited (Forward UK), Intelligent Product Solutions, Inc. (IPS), and Kablooe, Inc. (Kablooe), is a global design, sourcing and distribution company serving top tier medical and technology customers worldwide.\nThe principal customer in our original equipment manufacturer (OEM) distribution business has been OEMs or the contract manufacturing firms of these OEM customers, that either package our products as accessories in box together with their branded product offerings or sell them through their retail distribution channels. Our OEM products include carrying cases and other accessories for medical monitoring and diagnostic kits and a variety of other portable electronic and non-electronic products such as sporting and recreational products, bar code scanners, GPS location devices, tablets and firearms. Our OEM customers are located in various regions worldwide.\nWe do not manufacture any of our OEM or retail distribution products and source substantially all these products from independent suppliers in China through Forward Industries Asia-Pacific Corporation, a British Virgin Islands corporation (Forward China). Forward China is owned by our Chairman and Chief Executive Officer.\nOur design business provides hardware and software product design and engineering services to customers predominantly located in the U.S. Our expertise in various disciplines enables us to serve a wide variety of industries and provide clients with a single source solution for concepts, industrial design, mechanical engineering, embedded software and systems architecture, mobile and enterprise application software, and optical engineering.\nDiscontinued Operations\nConsidering the recurring losses incurred by the retail segment, in July 2023, the Company decided to cease operations of our retail distribution segment and we are presenting the results of operations for this segment within discontinued operations in the current and prior periods presented herein. The discontinuation of the retail segment represents a strategic shift in the Companys business. The primary assets of the retail segment are inventory and accounts receivable. The Company expects to sell, liquidate, or otherwise dispose of remaining retail inventory by June 30, 2024, and to collect remaining retail accounts receivable by the end of fiscal 2024. After this time, we expect to have no further significant continuing involvement with the retail distribution segment. The inventory of the retail segment is presented as discontinued assets held for sale on the balance sheets at September 30, 2023 and 2022 and the results of operations for the retail segment have been classified as discontinued operations on the consolidated statements of operations for the years ended September 30, 2023 and 2022. All information and results in this annual report on Form 10-K exclude the discontinued operations unless otherwise noted. See Note 3 to our consolidated financial statements for additional information on discontinued operations.\nCOVID-19\nOn May 11, 2023, the U.S. Department of Health and Human Services declared the end of the Public Health Emergency for COVID-19; however, the effects of COVID-19 continue to linger throughout the global economy and our businesses. Though the severity of COVID-19 has subsided, new variants, or the outbreak of a new pathogen, could interrupt business, cause renewed labor and supply chain disruptions, and negatively impact the global and US economy, which could materially and adversely impact our businesses.\nCorporate History\nForward was incorporated in 1961 as a manufacturer and distributer of advertising specialty and promotional products. In 1989, we acquired Forward US, a manufacturer of soft-sided carrying cases. The carrying case business became our predominant business, and in September 1997, we sold the assets relating to the production of advertising specialty and promotional products, ceasing to operate in that segment.\nIn May 2001, we formed Forward Switzerland to facilitate distribution of aftermarket products under our licenses for cell phone cases with a major North American multinational and to further develop our OEM European business presence. After the expiration of the last of these licenses in March 2009, staff at Forward Switzerland was significantly reduced and in recent years has primarily served our OEM customers in Europe.\nIn January 2018, Forward acquired IPS, an engineering design company, and in August 2020, Forward acquired the assets of Kablooe Design, a medical and consumer design and development company. We believe that the design and engineering service capabilities of Kablooe has complemented the IPS business and further diversified the industries and customers with which we do business.\nCustomers\nOur OEM distribution customers are located in all geographic regions worldwide. Our design business provides services to Fortune 500 companies, established mid-level companies, and start-ups. The wide range of industries served includes industrial electronics, medical and dental equipment, food/beverage, certain luxury brands, and oil/gas. Our design customers are located primarily in the U.S.\nProducts\nOur products include carrying cases and other accessories for medical monitoring and diagnostic kits and a variety of other portable electronic and non-electronic products (such as sporting and recreational products, bar code scanners, GPS location devices, tablets, and firearms). We do not manufacture any of our products and we source substantially all our products from independent suppliers in China through Forward China, a related party (see Note 14 to the consolidated financial statements).\nDiabetic Products\nWe sell carrying cases for blood glucose diagnostic kits directly to OEM customers, or their contract manufacturers. These electronic monitoring kits are made for use by diabetics. The diabetic products customer (or its contract manufacturer) packages our carry cases in box as a custom accessory for the customers blood glucose testing and monitoring kits, or to a much lesser extent, sells them through their retail distribution channels. These kits typically include a small, electronic blood glucose monitor, testing strips, lancets for drawing a drop of blood and our carrying case, customized with the manufacturers logo and designed to fit and secure the glucose monitor, testing strips, and lancets in separate straps, pouches, and holders. As the kits and technology change, our carrying case designs change to accommodate the changes in size, shape and layout of the electronic monitoring device, strips and lancet.\nOther Products\nWe also sell carrying and protective solutions to customers for a diverse array of other portable electronic and other products, including sporting and recreational products, bar code scanners, GPS location devices, tablets, and firearms, on a made-to-order basis that are customized to fit the products sold by our customers. Our selling prices for these products vary across a broad range, depending on the size and nature of the product for which we design and sell the carry solution.\nDesign Products\nOur design business provides a complete range of design, engineering and development services with respect to a diverse array of consumer and industrial electronics products. These include but are not limited to medical products, smart displays, beverage vending, enterprise and mobile software applications, lighting, security and detections systems, cameras, wearables and vehicle controls. Solutions in these and other areas are designed and developed in-house, beginning at product concept, extending through design, engineering and prototype, and final design for manufacturing and computer-aided design files.\nProduct Development\nIn the OEM division, we typically receive requests to submit product designs in connection with a customers introduction and rollout to market of a new product. We collaborate with clients to determine functionality, size and other basic specifications and requirements for products. Our design and production resources develop more detailed product specifications and design options for our customers evaluation. We provide documentation of each phase to the client and gain approval of a working prototype. Working with our suppliers and the customer, samples are modified and refined. Once approved for commercial introduction and order by our customer, we work with our suppliers to ensure conformity of commercial production to the definitive product samples and specifications. Manufacture and delivery of products in production quantities are coordinated with the customers manufacturing and shipment schedules so that our products are available to be packaged with the customers additional product components prior to shipment and sale, or to make the product available to the customer for direct sale through its retail distribution channels.\nServices\nServices offered in our design business vary from full development utilizing a wide range of in-house design and engineering functions, to targeted design and engineering support for clients with in-house development teams. Our in-house capabilities include the following:\n· Electrical Engineering\n· Mechanical Engineering\n· Software Engineering\n· Industrial Design\n· User Experience/User Interface (UX/UI) Design and Development\n· Optical Engineering\n· Program Management\n· IoT System Architecture\n· IT Support\nDistribution\nChannels of Distribution\nWe ship the majority of our OEM distribution products directly to our customers (or their contract manufacturers), who package our accessory products in box with their branded products. Some of our customers also purchase certain of our products and offer them for sale as stand-alone accessories to complement their product offerings.\nDistribution Hubs for Customers\nWe have arrangements with certain customers distribution hubs. These arrangements obligate us to supply our products to our customers distribution hubs where their products are manufactured, kitted, and/or warehoused pending sale, and where our products are packaged in box with the distribution customers products. The product quantities we are required to supply to each distribution hub are based on the distribution customers purchase orders and forecasts. We do not recognize revenue for product shipped to a customers hub until we have been notified by our customer that our product has been used by the distribution hub. Hub arrangements have had the general effect of providing financing for our customers inventory purchases by extending the time between our placement of orders to our suppliers and the time that we are able to recognize revenue. The corollary effect is an increase in our inventory levels.\nProduct Supply\nManufacturing\nThe manufacture of custom carrying cases and other carry and protective solutions generally consists of die cutting fabrics and heat sealing, gluing, sewing, and affixing logos to the cut-outs by means of silk screening, hot-stamping, embroidering or embossing. The principal materials used in the manufacture of our products are vinyl, nylon, leather, metal and plastic parts (for clips, buckles, loops, hinges and other hardware), foam padding and cardboard, all of which are obtained from suppliers based on our specifications.\nWe do not believe that any of the component materials or parts used in the manufacture of our products are supply constrained. We believe that there are adequate available alternative sources of supply for all of the materials used to manufacture, package, and ship our products.\nDependence on Sourcing Agent\nWe have a Buying Agency and Supply Agreement (the Supply Agreement) with Forward China. The Supply Agreement provides that Forward China acts as our exclusive buying agent for the products we sell. Forward China also arranges for sourcing, manufacture and exportation of such products. We purchase products at Forward Chinas cost and through March 2023 paid them a monthly service fee calculated at $100,000 plus 4% of Adjusted Gross Profit, which is defined as the selling price less the cost from Forward China. Considering the loss of a significant OEM distribution customer (see Note 16 to the consolidated financial statements), effective April 1, 2023, the Company and Forward China agreed to reduce the fixed portion of the sourcing fee from $100,000 to $83,333 per month for the remaining term of the Supply Agreement, which expired in October 2023, resulting in cash savings of $100,000 in Fiscal 2023. Effective October 2023, the Company and Forward China entered into a new sourcing agreement under which the fixed portion of the sourcing fee was further reduced to $65,833 per month. Other terms in the agreement are substantially the same as the prior agreement. Due to the Companys decision to cease operations of its retail distribution segment and the decline in the OEM distribution segment business, the new sourcing agreement expires October 31, 2024. Terence Wise, our Chairman, Chief Executive Officer and largest shareholder, is the owner of Forward China. In addition, Jenny P. Yu, a Managing Director of Forward China, beneficially owns more than 5% of the Companys common stock. See Item 1A. - Risk Factors regarding our dependence on Forward China.\nSuppliers\nWe procure substantially all our OEM distribution products from independent suppliers in China through Forward China. Depending on the product, we may require several different suppliers to furnish component parts or pieces. We place orders for particular products and do not have minimum supply requirement agreements to guarantee a supply of finished product, nor have we made purchase commitments to purchase minimum amounts. However, from time to time, we may order certain OEM products in advance of receiving a customer purchase order, or in quantities in excess of those forecasted to us by our customer, for which they are contractually obligated to us, in order to meet our customers anticipated delivery demands.\nThere are very few suppliers required for the design segment of the business as it is a service-based business. We do, however, purchase supplies and equipment to develop prototypes or mock-ups for design and development projects. Design business suppliers are predominantly based in the United States.\nQuality Assurance\nForwards quality assurance manager oversees the process to ensure that our distribution products manufactured in China meet our quality assurance standards. The quality assurance manager independently verifies and supervises the inspection of products provided by independent contractors in China. In July 2015, Forward China received its ISO 9001:2008 quality certification, which was renewed and is valid until July 2024.\nOur design business follows general industry standard practices for review and corrective actions related to its design services. There are no independent quality assurance standards in place for its design and engineering work. Customer specifications and scope of services are laid out in project contracts and we work closely with the customer to identify and correct any quality issues that arise.\nCompetition\nDistribution Business\nOur OEM distribution business is highly competitive in terms of product pricing, design, delivery terms, and customer service. In the production of our distribution products, we compete with numerous U.S. and foreign producers and distributors. Some of our competitors are substantially larger than we are and have greater financial and other resources. We believe that we sustain our competitive position through maintenance of an effective product design capability, rapid response time to customer requests for proposals and product shipment, reliable product delivery and product quality, and competitive pricing. We believe that our ability to compete based on product quality assurance considerations is enhanced by Forward Chinas local presence, quality control, shipment capabilities and expertise in sourcing.\nDesign Business\nThe depth and breadth of services offered, and industries served by our design segment are unique. Our management team is aware that there are very few competitive firms that have the full set of capabilities that our design segment has under one roof. There are, however, numerous design and engineering companies that compete with us in specific industries and/or with specific targeted skills or have competitive advantages.\nHuman Capital/Employees\nAs of November 30, 2023, we had approximately 100 employees, substantially all of whom work full-time, none of which are covered by a collective bargaining agreement. We hire consultants on an as-needed basis.\nHuman capital management is critical to our ongoing business success, which requires investing in our people. Our aim is to create a highly engaged and motivated workforce where employees are inspired by leadership, engaged in purpose-driven, meaningful work and have opportunities for growth and development. We are committed to creating and maintaining a work environment in which employees are treated with respect and dignity. We value our diverse employees and provide career and professional development opportunities that foster the success of our company.\nAn effective approach to human capital management requires that we invest in talent, development, culture and employee engagement. We aim to create an environment where our employees are encouraged to make positive contributions and fulfill their potential. We emphasize our core values of innovation, encouragement, motivation, and curiosity with our employees to instill our culture and create an environment of growth and positivity.\nOur Compensation Committee is also actively involved in reviewing and approving executive compensation, and succession plans so that we have leadership in place with the requisite skills and experience to deliver results the right way. We offer fair, competitive compensation and benefits that support our employees overall wellbeing. In addition to health benefits, we contribute to employees 401(k) plans and offer student tuition reimbursement (if certain requirements are met).\nRegulation and Environmental Protection\nOur OEM distribution business is subject to various regulations in various jurisdictions, including the U.S., Canada and member states of the European Union, that restrict the use or importation of products manufactured with compounds deemed to be hazardous. We work with our suppliers to ensure compliance with such regulations. In addition, from time to time, one or more customers may require testing of our products to ensure compliance with applicable consumer safety rules and regulations or the customers safety or packaging protocols. Because we do not manufacture the products that we sell and distribute, compliance with federal, state and local laws and regulations pertaining to the discharge of materials into the environment, or otherwise relating to the protection of the environment, has not had, and is not anticipated to have, any direct material effect upon our capital expenditures, earnings, or competitive position. However, compliance with such laws and regulations on the part of our suppliers may result in increased costs of supply to us, particularly if domestic environmental regulations in China become more prevalent.\nWe have not been engaged in any environmental litigation or incurred any material costs related to compliance with environmental or other regulations. From time to time, we incur chemical and/or safety laboratory testing expenses in order to address customer requests regarding our product materials or method of manufacture, or regarding their packaging methods and standards.\nThere are no specific regulatory or environmental requirements imposed upon the design segment of our business. As a paid service provider, customers are assisted in securing regulatory certifications including UL (Underwriters Laboratories - a U.S. based safety certification organization), FCC (Federal Communications Commission - U.S. governmental certification department for electronic goods), CE (Conformité Européenne - a European certification for health, safety and environmental protection standards) and others depending on needs, product types and locations of customers product markets.\nAvailable Information\nOur corporate website is www.forwardindustries.com. On our website under Investors \"SEC Filings\", we make available access to our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, Proxy Statements on Schedule 14A and amendments to those materials filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934 (the Exchange Act), free of charge. The contents of the website are not incorporated into this report.\nITEM 1A. RISK FACTORS\nInvesting in our common stock involves a high degree of risk. You should carefully consider the following risk factors before deciding whether to purchase or sell stock in the Company. Additional risks and uncertainties not presently known to us, or that we currently deem immaterial, may also impair our business operations or our financial condition. If any of the events discussed below occur, our business, consolidated financial condition, results of operations or prospects could be materially and adversely affected. In such case, the value and marketability of the common stock could decline.\nRisks Relating to Our Business, Liquidity and Operations\nThe COVID-19 pandemic, or any other future pandemic, has had, and may continue to have, a material and adverse effect on our business and results of operations.\nOn May 11, 2023, the U.S. Department of Health and Human Services declared the end of the Public Health Emergency for COVID-19; however, the effects of COVID-19 continue to linger throughout the global economy and our businesses. Though the severity of COVID-19 has subsided, new variants or any other future pandemic could interrupt business, cause renewed labor and supply chain disruptions, and negatively impact the global and US economy, which could materially and adversely impact our business. During the height of COVID-19 our supply chain experienced significant disruptions which, together with other factors such as the increase in global consumer demand and the global shipping container shortage, resulted in longer delivery times and higher importation costs for most of our products. While our supply chain appears to generally be stable at this time, should a resurgence of COVID-19 occur, our supply chain could again be negatively impacted; for example, the factories that manufacture our products could be required by government authorities to temporarily cease operations or might be limited in their production capacity. If governments take protective actions in response to a resurgence of COVID-19 or the outbreak of a new pandemic, it may have a material adverse impact on our business, financial condition and operating results for the reasons described above.\nDuring Fiscal 2023, we generated a net loss. We cannot assure you that we will regain profitability in the future.\nIn Fiscal 2023, we generated a net loss of approximately $3,737,000. While we generated income from continuing operations, we can provide no assurance that we will not experience operating losses in the future. In addition to our $1,300,000 commercial line of credit (the Line of Credit), none of which has been utilized as of the date of this report, Forward China holds a $1,100,000 note which is due December 31, 2024. Additionally, we owe Forward China $8,246,000 in accounts payable. See Note 14 to the consolidated financial statements for a discussion on these payables. Forward China, which is owned by our Chief Executive Officer and Chairman of the Board, has previously agreed to extend the note numerous times to assist the Company with its liquidity. We cannot provide any assurance that Forward China will continue to grant us extensions on this note. If we cannot generate sufficient revenues to operate profitably, we may be forced to cease, limit or suspend operations, or we may be required to raise capital or incur additional debt to maintain or grow our operations. There is no assurance that we will be able to raise such capital and if so on terms that are not onerous and dilutive to the Company and its shareholders. While we believe that our existing cash resources are sufficient to support our business, there can be no assurances that we will be successful.\nOur OEM distribution business remains highly concentrated in our diabetic products line. If our diabetic products line were to suffer the loss of a principal customer or a material decline in revenues from any such large customer, our business would be materially and adversely affected.\nIn Fiscal 2023, revenues from diabetic products accounted for 84% of our OEM distribution revenues and OEM distribution revenue accounted for 38% of our consolidated net revenue. As a result, our financial condition and results of operations are subject to higher risk from the loss of a major diabetic products customer or changes in their business practices. For example, in 2018 a new diabetes monitoring product was brought to the market which does not use a carrying case. If our customers use new solutions in their diabetes product lines that do not use carrying cases, our business would be materially and adversely affected.\nThe loss of any of, or a material reduction in orders from, our largest customers would materially and adversely affect our results of operations and financial condition.\nEach of our distribution and design businesses can at times be concentrated with certain larger customers. In Fiscal 2023, our largest design customer accounted for 27.9% of our consolidated net revenue and one OEM distribution customer accounted for 11.2% of our consolidated net revenue. In Fiscal 2022, our largest design customer accounted for 11.8% of our consolidated net revenue and two OEM distribution customers represented 25.5% of our consolidated net revenue. Recently, two of our employees left the Company to become full-time employees of our largest design customer. If this continues, it may result in the customer sending us less business which will adversely affect our revenues.\nAlthough our customer concentration changes from year to year, and we continue our efforts to diversify our business, we cannot provide any assurance that we will be successful. The loss of any of these customers would have a material adverse effect on our financial condition, liquidity and results of operations.\nIf any one or more of our OEM distribution customers elect to reduce or discontinue inclusion of cases in box, our results of operations and financial condition would be materially and adversely affected.\nThe predominant percentage of our OEM distribution revenues is derived from sales of case accessories to our OEM customers who package our cases in box with their electronics. During recent years, there have been numerous federal legislative and administrative actions that have affected government programs, including adjustments that have reduced or increased payments to healthcare providers and patients. Any measures to restrict healthcare spending could result in decreased sales of our products. If one or more of our distribution customers reduce or discontinue the practice of including carry case accessories in box or if our customers experience reduced demand for their products as a result of political changes, we may incur a significant decline in our revenues and our results of operations and financial condition would be materially and adversely affected.\nRising threats of international tariffs, including tariffs applied to goods between the U.S. and China, may materially and adversely affect our business.\nRising threats of international tariffs, including tariffs applied to goods traded between the U.S. and China, could materially and adversely affect our business and results of operations. Since the beginning of 2018, there has been increasing rhetoric, in some cases coupled with legislative or executive action, from several U.S. and foreign leaders regarding the possibility of instituting tariffs on the foreign imports of certain materials and products. More specifically, throughout 2020 and 2019, the U.S. and China imposed tariffs or announced proposed tariffs to be applied in the future to certain of each others exports. As of the date of this report, the Company has not been directly affected by any tariffs previously implemented by former President Trump on the medical technology industry which remain in place pending the Biden Administrations continued review of the tariffs. In May 2022 the U.S. Trade Representative (the USTR) announced a statutory four-year review of the tariffs against China. The USTR also announced in May 2022 that it reinstated or extended various eligible tariff exclusions on certain products from China through December 2023. However, we do not know if the Biden administration will implement any new tariffs or alter current tariffs. If any such tariffs or any restrictions are imposed on products that we import for our customers, we would be required to raise our prices, which may result in the loss of customers and harm our business. Additionally, some of our non-diabetic distribution customers and customers in the design and development business have been affected by these tariffs, specifically those who manufacture electronic products. This may cause these customers to reduce the amount of discretionary spending they use on outsource product design and engineering services supplied by our design segment.\nChanges in political conditions in China and changes in the state of China-U.S. relations, including any tensions relating to potential military conflict between China and Taiwan, are difficult to predict and could adversely affect the operations or financial condition of the Company. In addition, because of our involvement in the Chinese market, any deterioration in political or trade relations might cause a public perception in the U.S. or elsewhere that might cause our business to become less attractive. Such an impact could adversely affect our revenues and cash flows.\nWe continue to encounter pressure from our largest customers to maintain or even decrease prices, or to provide lower priced solutions, and expect such pressure to persist. The effects of such price constraints on our business may be exacerbated by inflationary pressures that affect our costs of supply and labor.\nDuring Fiscal 2023, we continued to experience significant pricing pressure from many customers, including some of our largest distribution customers, to reduce the prices we charge them. When we are unable to extract comparable concessions from our suppliers on prices they charge us, our product sales margins erode. In Fiscal 2023, due to increased pricing pressure, we did not renew our contract with one major OEM distribution customer, which expired in March 2023. The recent inflationary environment in the U.S. and globally has caused production costs to increase in Fiscal 2023. Similarly, due to continued trends of high demand and low supply in the labor market which have persisted despite Federal Reserve interest rate increases, the cost of labor has risen in both our design and distribution businesses. These developments have a material adverse impact on our margins and our ability to achieve or maintain profitability. In addition, competitors may reduce their average selling prices faster than we are able to reduce costs, which can also accelerate the rate of decline of our selling prices.\nIn addition to margin compression from customers in general, we are encountering increased costs from our Chinese suppliers who are reacting to inflationary increases in materials and labor costs incurred by them. In addition, prices that our Chinese vendors charge to us may reflect appreciation of the Chinese currency against the U.S. dollar, which can be passed through to us in the form of higher U.S. dollar prices. This in turn will tend to reduce gross profit if we are unable to raise our prices. Any decrease in demand for our products or services, coupled with pressure from the market and our customers to decrease our prices, would have a material adverse effect on our business, financial condition, and results of operations.\nIncreasingly, our OEM distribution customers are requesting that we enter into supply agreements with them that have restrictive terms and conditions. These agreements typically include provisions that increase our financial exposure, which could result in significant costs to us.\nIncreasingly, our OEM distribution customers are requesting that we enter into supply agreements with them. These agreements typically do not include volume commitments but do include provisions that generally serve to increase our exposure for product liability and limited sales returns, which could result in higher costs to us as a result of such claims. In addition, these agreements typically contain provisions that seek to limit our operational and pricing flexibility and extend payment terms, which could materially adversely affect our cash flow, business, financial condition, and results of operations.\nOur distribution business depends on a single exclusive buying agent who, in turn, depends on a limited number of key suppliers.\nOur Chairman, Chief Executive Officer and largest shareholder is the owner of Forward China, our exclusive sourcing agent in the Asia Pacific region. We have a Buying Agency and Supply Agreement with Forward China under which Forward China will act as the Companys exclusive agent to arrange for sourcing, manufacturing and exporting the Companys distribution products. Historically, Forward China has relied on a limited number of suppliers to supply the component parts and pieces necessary for the production of our carry and protective solutions products. As a result, our ability to effectively push back against rising material costs may diminish. In addition, any inability to obtain supplies from a single or limited number of suppliers may result in difficulty obtaining the supplies necessary for our business and may restrict our ability to produce our carry and protective solutions products. Where practical, we intend to establish alternative sources through Forward China to mitigate the risk that the failure of any single supplier will adversely affect our business. Nevertheless, either a prolonged inability to obtain certain components or the failure of one of our suppliers to do so could impair our ability to ship products and generate revenues, which could adversely affect our operating results and damage our customer relationships.\nIn addition, we depend significantly on Forward China as our exclusive buying agent for substantially all of our component parts. As a result, we have limited visibility as to our supplier base, making it difficult to forecast future events and to plan our operations. In addition, if Forward China fails to satisfactorily perform its obligations, including payment obligations, to our suppliers or its duties to us as our exclusive buying agent as a result of financial or other difficulties or for any other reason, or if our relationship with Forward China was to suffer or we are unable to extend our agreement with Forward China which expires in October 2024, we could suffer irreparable harm resulting in substantial damage to the distribution business.\nOur business has benefited from customers deciding to outsource their carry and protective solutions assembly needs, as well as product development and design functions, to us. If our customers choose to provide these services in-house or select other providers, our business could suffer.\nOur future revenue growth partially depends on new outsourcing opportunities from our current and prospective customers. Current and prospective customers continuously evaluate our performance against other providers. They also evaluate the potential benefits of developing, designing, manufacturing and transporting their products themselves. To the extent that outsourcing opportunities are not available either due to these customers deciding to develop, design, produce or transport these products themselves or to use other providers, our financial results and future growth could be materially adversely affected.\nIf we are unable to provide our customers with high-quality products and services or if we are unable to deliver our products and/or services to our customers in a timely manner, our business, financial condition, and results of operations may be materially adversely affected.\nIn order to maintain our existing customer base and obtain business from new customers, we must demonstrate our ability to develop, design and produce products and services at the level of quality, responsiveness, timeliness, and cost that our customers require. If our products or services are provided at what customers believe are of a substandard quality, if they are not delivered on time, if we are not responsive to our customers demands or cannot meet their needs, our reputation as a reliable supplier of high-quality products and a sophisticated product designer and developer would likely be damaged. If we are unable to meet anticipated product and service standards imposed by contractual arrangements, customer expectations, industry practices, regulatory requirements and competitive forces, we may be unable to obtain new or keep our existing customers, and this would have a material adverse effect on our business, financial condition, and results of operations.\nIf our design teams fail to complete a project in a timely manner, miss a required performance standard, or otherwise fail to adequately perform on a project, then we may incur a loss on that project.\nOur design engagements often involve large-scale, complex projects. The quality of our performance on such projects depends in large part upon our ability to manage the relationship with our clients and our ability to effectively manage the project and deploy appropriate resources, including third-party contractors and our own personnel, in a timely manner. We may commit to a client that we will complete a project by a scheduled date and/or at a fixed fee. We may also commit that a project, when completed, will achieve specified performance standards. If the project is not completed by the scheduled date or fails to meet required performance standards, we may incur significant additional costs or be held responsible for the costs incurred by the client to rectify damages due to late completion or failure to achieve the required performance standards. The uncertainty of the timing of a project can present difficulties in planning the amount of personnel needed for the project. If the project is delayed or canceled, we may bear the cost of an underutilized workforce that was dedicated to fulfilling the project. In addition, performance of projects can be affected by a number of factors beyond our control, including unavoidable delays from government inaction, inability to obtain financing, weather conditions, unavailability of vendor materials, changes in the project scope of services requested by our clients, industrial accidents, environmental hazards, and labor disruptions. Furthermore, our entrance into fixed price arrangements mean that if the costs of supplies, labor and other resources rise due to shortages, heightened demand, inflation or other factors, our margin for a given project will decline. To the extent these events occur, the total costs of the project could exceed our estimates, and we could experience reduced profits or, in some cases, incur a loss on a project, which may reduce or eliminate our overall profitability on that project or in general. Further, any defects or errors, or failures to meet our clients expectations, could result in claims for damages against us. Failure to meet performance standards or complete performance on a timely basis could also adversely affect our reputation.\nOur results of operations could suffer if we are not able to maintain adequate utilization of our workforce.\nThe cost of providing our design services, including the extent to which we utilize our workforce, affects our profitability. The rate at which we utilize our workforce is affected by a number of factors, including:\n· our ability to transition employees from completed projects to new assignments and to hire and assimilate new employees;\n· our ability to forecast demand for our services and thereby maintain an appropriate headcount in each of our operating units;\n· our ability to engage employees in assignments during natural disasters or pandemics;\n· our ability to manage attrition;\n· our need to devote time and resources to training, business development, professional development, and other non-chargeable activities; and\n· our ability to match the skill sets of our employees to the needs of the marketplace.\nIf we over-utilize our workforce, our employees may become disengaged, which could impact employee attrition. If we under-utilize our workforce, our profit margin and profitability would suffer.\nEmployee or agent misconduct, or our failure to comply with anti-bribery and other laws or regulations, could harm our reputation, reduce our revenue and profits, and subject us to criminal and civil enforcement actions.\nMisconduct, fraud, non-compliance with applicable laws and regulations, or other improper activities by one of our employees or agents could have a significant negative impact on our business and reputation. Such misconduct could include the failure to comply with various procurement regulations, regulations regarding the protection of confidential information, regulations prohibiting bribery and other foreign corrupt practices, regulations regarding the pricing of labor and other costs in contracts, regulations on lobbying or similar activities, regulations pertaining to the internal controls over financial reporting, environmental laws, and any other applicable laws or regulations. For example, the Foreign Corrupt Practices Act, or FCPA, and similar anti-bribery laws in other jurisdictions generally prohibit companies and their intermediaries from making improper payments to non-U.S. officials for the purpose of obtaining or retaining business. Our policies mandate compliance with these regulations and laws, and we take precautions to prevent and detect misconduct. However, since our internal controls are subject to inherent limitations, including human error, it is possible that these controls could be intentionally circumvented or become inadequate because of changed conditions. As a result, we cannot assure that our controls will protect us from reckless or criminal acts committed by our employees or agents. Our failure to comply with applicable laws or regulations or acts of misconduct could subject us to fines and penalties and suspension or debarment from contracting, any or all of which could harm our reputation, reduce our revenue and profits, and subject us to criminal and civil enforcement actions.\nIf we fail to maintain an effective system of internal controls over financial reporting, we may not be able to accurately report our financial results. As a result, current and potential stockholders could lose confidence in our financial reporting, which could harm our business and the trading price of our stock.\nEffective internal controls over financial reporting are necessary for us to provide reliable financial reports. If we cannot maintain effective controls and reliable financial reports, our business and operating results could be harmed. We continue to work on improvements to our internal controls over financial reporting. Any failure to implement and maintain internal controls over our financial reporting or difficulties encountered in the implementation of improvements in our controls, could cause us to fail to meet our reporting obligations. Any failure to improve our internal controls over financial reporting or to address identified weaknesses in the future, if they were to occur, could also cause investors to lose confidence in our reported financial information, which could have a negative impact on the trading price of our stock.\nOur results of operations are subject to the risks of fluctuations in the values of foreign currencies relative to the U.S. dollar.\nOur results of operations are expressed in U.S. dollars. When the U.S. dollar appreciates or depreciates in value against a currency in which all or a significant portion of revenues or other accounts receivable are denominated, such as the Euro, our results of operations can be adversely affected or benefited, respectively. The degree of impact is proportional to the amount of foreign currency expense or revenue, as the case may be, and the fluctuations in exchange rates over the period in which the effect is measured on our financial statements. In addition, such currency fluctuations may affect the comparability of our results of operations between financial periods.\nFuture revenues are difficult to predict and are likely to show significant variability as a consequence of customer concentration and operating in more than one segment.\nBecause our revenues can at times be concentrated in a few large customers, and because the volumes of these customers order flows to us can fluctuate markedly in a short period of time, our quarterly revenues, and consequently our results of operations, may be highly variable and subject to significant changes over a relatively short period of time. Our largest OEM distribution customers may keep consumer products with which our carry solutions are packaged in-box in active promotion for many months, or for a very short period of time, depending on various factors, including sales trends for the product, product development cycles, new product introductions, and our customers' competitors' product offerings. As demand for the consumer product relating to the in-box program matures and decreases, we may be forced to accept significant price and/or volume reductions in customer orders for our carry solutions, which will adversely affect revenues. Additionally, our large design and development customers may have their budgets limited from many factors including economic declines (resulting from a pandemic or any other reason) causing discretionary budgets to decline or may from-time-to-time choose to do their development work in-house. Further, in our design and development business customers may decline to use us for future work after a project is completed, which may be due to lack of continued need for our services after their product has been developed, produced and marketed or because they are dissatisfied with our pricing or performance. All of these factors tend to lead to a high degree of variability in our quarterly revenue levels. Significant, rapid shifts in our operating results may occur if and when one or more of these customers increases or decreases the size(s) of, or eliminates, their orders or engagement from us by amounts that are material to our business.\nOur gross margins, and therefore our potential profitability, vary considerably by customer and by product and service offering, and if the revenue contribution from one or more customers or products or project changes materially, relative to total revenues, our gross profit percentage may fluctuate.\nOur gross profit margins on the products and services we sell can vary widely depending on the product or project type, customer, and contract or order size. Because of the broad variability in price ranges and product and project types, we anticipate that gross margins, and accordingly their impact on operating income or loss, may fluctuate depending on the relative revenue contribution from each customer or product. Similarly, because we offer a wide range of services which often vary with each customer and project, we face challenges in maintaining and enhancing operational efficiencies. For example, because of the range of products and services we offer and our general lack of specializations within our fields relative to some of our competitors, we may not enjoy the advantages offered by more focused or streamlined operations, such as economies of scale or improved production capabilities from our labor, facilities, and procedures with the passage of time. If our gross margins decrease, our results of operations will be adversely affected.\nProduct manufacture is often outsourced by our distribution customers to contract manufacturing firms in China and in these cases, it is the contract manufacturer to which we must look for payment.\nContract manufacturing firms are performing manufacturing, assembly, and product packaging functions, including the bundling of our product accessories with the OEM distribution customer's product. As a consequence of this business practice, we often sell our carry solutions products directly to the contract manufacturing firm. This is particularly significant in the case of diabetic product sales to certain customers. In these cases, we invoice the contract manufacturing firm and not the OEM distribution customer. Therefore, it is the contract manufacturing firm to which we must look for payment in such cases and not our OEM distribution customer. If we fail to receive payment from the contract manufacturer, our ability to be paid for products already delivered would be limited. In such event, our results of operations and cash flows will be adversely affected.\nOur dependence on foreign manufacturers creates quality control and other risks to our business. From time to time, we may experience certain quality control, on-time delivery, cost, or other issues that may jeopardize customer relationships.\nOur reliance on foreign suppliers, manufacturers and other contractors involves significant risks, including risk of product quality issues and reduced control over quality assurance, manufacturing yields and costs, pricing, timely delivery schedules, the potential lack of adequate manufacturing capacity and availability of product, the lack of capital and potential misappropriation of our designs. In any such event, our reputation and our business will be harmed.\nOur shipments of products may become subject to delays or cancellation due to work stoppages or slowdowns, piracy, damage to port facilities, and congestion due to inadequacy of port terminal equipment and other causes.\nTo the extent that there are disruptions or delays in loading container cargo in ports of origin or off-loading cargo at ports of destination as a result of labor disputes, work-rules related slowdowns, tariff or World Trade Organization-related disputes, piracy, physical damage to port terminal facilities or equipment caused by severe weather or terrorist incidents, congestion in port terminal facilities, inadequate equipment to load, dock and offload container vessels or energy-related tie-ups or otherwise, or for other reasons, product shipments to our customers will be delayed. For example, in March 2021, a container ship carrying some of our products ran aground in the Suez Canal and was immobilized for six days. Although this accident did not have a material adverse effect on our business, there is no assurance that, if it happened again, that it would not. In any such case, our customers may cancel or change the terms of its purchase order, resulting in a cancellation or delay of payments to us. A closure or partial closure of port facilities or other causes of delays in the loading, importation, offloading or movement of our products to the shipping destination agreed to with our customer could result in increased expenses, as we try to avoid such delays, delayed shipments or cancelled orders, or all of the above. Depending on the severity of such consequences, this may have an adverse effect on our financial condition and results of operations.\nIssues with our products or services may lead to product liability, personal injury or property damage claims, recalls, withdrawals, replacements of products, or regulatory actions by governmental authorities that could divert resources, affect business operations, decrease sales, increase costs, and put us at a competitive disadvantage, any of which could have a significant adverse effect on our financial condition.\nWe may experience issues with products that we source or develop, or with the services we render, that may lead to product liability, personal injury or property damage claims, recalls, withdrawals, replacements of products, or regulatory actions by governmental authorities. Any of these activities could result in increased governmental scrutiny, harm to our reputation, reduced demand by consumers for products or services, decreased willingness by retailer customers to purchase our products or procure our services, absence or increased cost of insurance, or additional safety and testing requirements. Such results could divert development and management resources, adversely affect our business operations, decrease sales, increase legal fees and other costs, and put us at a competitive disadvantage compared to other companies not affected by similar issues with products and services, any of which could have a significant adverse effect on our financial condition and results of operations. Although the Company carries product liability insurance and works with its customers to satisfy product quality concerns (the cost of such efforts are typically covered by our sourcing agent, Forward China) we can provide no assurance that customers will not seek damages beyond what we warranty or beyond our insurance coverage. Although we have not had significant claims for damages or losses from the products we distribute in our distribution business or assist in the development, design or production of in our design business, any uninsured claim, if successful and of significant magnitude, could have a material adverse effect on our business, prospects, results of operations or financial condition.\nThe product distribution and design businesses are highly competitive and do not pose significant barriers to entry.\nThere are many competitors in the sale of carry solutions products to our customers including OEMs, and competition is intense. Since little or no significant proprietary technology is involved in the design, production or distribution of the types of products we sell, others may enter the business with relative ease and compete against us. Such competition may result in the diminution of our market share or the loss of one or more major customers, thereby adversely affecting our net revenues, results of operations, and financial condition. Further, with respect to our design business, while management believes there are a limited number of customers offering the broad range of design and development services we do, there are numerous design and engineering companies that compete with us in specific industries and/or with specific targeted skills or competitive advantages, and some prospective customers might prefer a competitor that focuses in a specialty area in which they operate or target over an offering such as ours that is not limited to any specific industry or product type.\nMany of our competitors are larger, better capitalized and more diversified than we are and may be better able to withstand a downturn in the general economy or in the product areas in which we specialize. Potential customers may prefer the pricing terms offered by competitors. These competitors may also have less sales concentration than we do and be better able to withstand the loss of a key customer or diminution in its orders. If we are not effectively able to compete, our results of operations will be adversely affected.\nIf we fail to retain our key personnel, we may not be able to achieve our anticipated level of growth and our business could suffer.\nOur future depends, in part, on our ability to attract and retain key sales personnel and the continued contribution of our executive officers including Terence Wise, our Chief Executive Officer, who would be difficult to replace. Our design and development business is highly labor intensive and, therefore, our ability to attract and retain professional and technical staff is an important factor in our future success. The market for qualified engineers is competitive and, from time to time, it may be difficult to attract and retain qualified individuals with the required expertise within the timeframe demanded by our clients. The loss of the services of any of our key personnel and the process to replace any key personnel would involve significant time and expense and may significantly delay or prevent the achievement of our business objectives.\nIf a third party asserts that we are infringing on its intellectual property, whether successful or not, it could subject us to costly and time-consuming litigation or require us to obtain expensive licenses, and our business may be adversely affected.\nThird party lawsuits alleging our infringement of patents, trade secrets or other intellectual property rights could cause us to do one or more of the following:\n· stop using technology that contains the allegedly infringing intellectual property;\n· incur significant legal expenses;\n· cause our management to divert substantial time to our defenses;\n· pay substantial damages to the party whose intellectual property rights we may be found to be infringing;\n· indemnify customers; or\n· attempt to obtain a license to the relevant intellectual property from third parties, which may not be available to us on reasonable terms or at all.\nThird party lawsuits alleging our infringement of patents, trade secrets or other intellectual property rights could have a material adverse effect on our business, results of operations and financial condition. In addition to our products, potential adverse developments involving intellectual property described above may occur with respect to customers products incorporating our products or services that we render.\nIf we experience system interruptions, it may cause us to lose customers and may harm our business.\nOur inability to maintain and improve our information technology systems and infrastructure may result in system interruptions. System interruptions and slow delivery times, unreliable service levels, prolonged or frequent service outages, or insufficient capacity may prevent us from efficiently providing services to our customers on our website, which could result in our losing customers and revenue.\nWe lease space for our data center for power, security, connectivity and other services. We also rely on third-party providers for bandwidth. We do not control these vendors and it would take significant time and effort to replace them. We have experienced, and may experience in the future, website disruptions, outages and other performance problems due to a variety of factors, including infrastructure changes, human or software errors and capacity constraints.\nOur systems are vulnerable to damage or interruption from terrorist attacks, floods, fires, power loss, telecommunications failures, hurricanes, computer viruses, computer denial of service attacks or other attempts to harm our systems. Any such damage or interruption would adversely affect our results of operations.\nBecause our networks and IT systems may be vulnerable to unauthorized persons hacking our systems, it could disrupt our operations and result in the theft of our proprietary information.\nA party who is able to breach the security measures on our networks could misappropriate either our or our customers proprietary information, or cause interruptions or malfunctions in our operations. Hacking of companies infrastructure is a growing problem. Although we believe our systems and engineering team have the capability of protecting the Company from any such hacking, we can provide you with no such assurance. If we grow and obtain more visibility, we may be more vulnerable to hacking. We may be required to expend significant capital and other resources to protect against such threats or to alleviate problems caused by breaches in security, which could have a material adverse effect on our financial performance and operating results.\nOur design business uses software that is highly technical, and undetected errors, if any, could adversely affect our business.\nOur design business may use software that is highly technical and complex. Our software has contained, and may now or in the future contain, undetected errors, bugs, flaws, corrupted data or vulnerabilities. Some errors in our software code may only be discovered after the code has been released. Any errors, bugs, flaws or corrupted data could result in damage to our reputation, loss of users, or loss of revenue, any of which could adversely affect our business and financial results.\nWe maintain cash balances in our bank accounts that exceed the FDIC insurance limitation.\nWe maintain our cash assets at commercial banks in the U.S. in amounts in excess of the Federal Deposit Insurance Corporation insurance limit of $250,000 and in Europe in amounts that may exceed any applicable deposit insurance limits. In the event of a failure at a commercial bank where we maintain our deposits or money market or other cash, we may incur a loss to the extent such loss exceeds the insurance limitation, which could have a material adverse effect upon our financial conditions and our results of operations.\nOur Chairman and Chief Executive Officer is a significant shareholder, which makes it possible for him to have significant influence over the outcome of all matters submitted to our shareholders for approval and which influence may be alleged to conflict with our interests and the interests of our other shareholders.\nTerence Wise, our Chairman and Chief Executive Officer, is a significant shareholder who beneficially owns approximately 18% of the outstanding shares of our common stock as of December 9, 2023. Mr. Wise has substantial influence over the outcome of all matters submitted to our shareholders for approval, including the election of our directors and other corporate actions. This influence may be alleged to conflict with our interests and the interests of our other shareholders. In addition, such influence by Mr. Wise could have the effect of discouraging potential business partners or create actual or perceived governance instabilities that could adversely affect the price of our common stock.\nRisks Related to Our Common Stock\nDue to factors beyond our control, our stock price may be volatile.\nAny of the following factors could affect the market price of our common stock:\n· Our failure to increase revenue in each succeeding quarter and achieve and thereafter maintain profitability;\n· Our failure to meet our revenue and earnings guidance or our failure to meet financial analysts performance expectations;\n· The loss of Forward China as our agent;\n· Cybersecurity breaches;\n· The loss of customers or our failure to attract more customers;\n· Creditworthiness and solvency of clients;\n· Loss of key employees;\n· The sale of a large amount of common stock by our shareholders;\n· Our announcement of a pending or completed acquisition or our failure to complete a proposed acquisition;\n· An adverse court ruling or regulatory action;\n· Changes in regulatory practices, including tariffs and taxes;\n· Changes in market valuations of similar companies;\n· Short selling activities;\n· Our announcement of any financing or a change in the direction of our business;\n· Announcements by us, or our competitors, of significant contracts, acquisitions, commercial relationships, joint ventures or capital commitments; or\n· Other forces outside of our control such as inflation, Federal Reserve interest rate increases and the recessionary environment it could bring, geopolitical turmoil such as the recent Ukraine war, and other developments that could adversely impact the U.S. and global economies and erode investor sentiment.\nIn the past, following periods of volatility in the market price of a companys securities, securities class action litigation has often been instituted. A securities class action suit against us could result in substantial costs and divert our managements time and attention, which would otherwise be used to benefit our business.\nBecause we are currently non-compliant with Nasdaqs minimum bid price requirement, it could result in delisting of our common stock, negatively affect the price of our common stock and limit investors ability to trade in our common stock.\nOur common stock is listed on Nasdaq. Nasdaq rules impose certain continued listing requirements, including the minimum $1 bid price, corporate governance standards and number of public stockholders. On July 31, 2023, we were notified by Nasdaq that we are not compliant with its closing bid price requirement because the closing bid price of our common stock was below $1.00 per share for 30 consecutive trading days. We have until January 29, 2024 (the Deadline Date) to become compliant. We have since remained non-compliant with the closing bid price requirement as our stock price has remained below $1.00 since we received the notice. We are assessing all options to regain compliance. At our annual stockholders meeting, which is customarily held in February, we have the option to ask our stockholders to approve a reverse stock split in an amount that would satisfy Nasdaq listing requirements. In addition to the risk described below that we do not receive stockholder approval, reverse splits are often perceived negatively and announcements of or implementation of a reverse split may cause the market price of our common stock to decline.\nIf we continue to fail to meet these continued listing requirements through the Deadline Date and are unable to get an extension to regain compliance, Nasdaq may delist our common stock. Reverse splits require approval by stockholders who hold a majority of our voting power. Because many of our shares are held in street name and brokers do not necessarily vote unvoted shares, we may not receive approval of a reverse split. Additionally, a reverse stock split typically has the effect of reducing the number of holders of shares in round lots, meaning those holding 100 or more shares. Another requirement for being listed on Nasdaq is that the Company have a minimum of 300 round lot holders, so if our stock price falls too low, a reverse split may not be sufficient to solve our Nasdaq non-compliance based on the minimum round lot requirement. If our common stock is delisted, we could face significant material adverse consequences, including:\n● a limited availability of market quotations for our common stock;\n● reduced liquidity with respect to our common stock;\n●\na determination that our shares of common stock are a penny stock which will require broker-dealers trading in our\ncommon stock to adhere to more stringent rules, including being unable to solicit buyers for our common stock;\n● a limited amount of news and analyst coverage for our company; and\n● a limited ability to raise capital in the future.\nIf we become subject to a regulatory investigation, it could cause us to incur substantial costs or require us to change our business practices in a manner materially adverse to our business.\nFrom time to time, we may receive inquiries from regulators regarding our compliance with laws and other matters. In 2019, we incurred significant expenses responding to an SEC investigation into potential insider trading by certain insiders of the Company. Although that investigation has concluded, responding to, or defending other such actions would cause us to continue to incur substantial expenses and divert our managements attention.\nViolation of existing or future regulatory orders or consent decrees could subject us to substantial monetary fines and other penalties that could negatively affect our financial condition and results of operations. In addition, it is possible that future orders issued by, or enforcement actions initiated by, regulatory authorities could cause us to incur substantial costs or require us to change our business practices in a manner materially adverse to our business.\nWe do not expect to pay dividends in the future, which means that investors may not be able to realize the value of their shares except through a sale.\nWe do not anticipate that we will declare or pay a cash dividend. We expect to retain future earnings, if any, for our business and do not anticipate paying dividends on common stock at any time in the foreseeable future. Because we do not anticipate paying dividends in the future, the only opportunity for our shareholders to realize the creation of value in our common stock will likely be through a sale of those shares. ITEM 1B. UNRESOLVED STAFF COMMENTS\nNot Applicable. ITEM 2. PROPERTIES\nWe lease all properties where our business is operated. We believe that these properties are adequate for the purposes for which they are used. All leases are with unaffiliated third parties. We believe that the loss of any lease would not have a material adverse effect on our operations, as we believe that we could identify and lease comparable facilities upon approximately equivalent terms. The properties which are material to the Companys business are described below:\nWe lease 14,000 square feet in Hauppauge, New York for our executive offices and IPS, which we rent under a lease agreement scheduled to expire in 2027. The lease has annual escalations and rent payments were approximately $31,000 per month during Fiscal 2023.\nWe lease 11,000 square feet in Coon Rapids, Minnesota for Kablooe, which we rent under a lease agreement scheduled to expire in June 2026. The lease has annual escalations and rent payments were approximately $11,000 per month during Fiscal 2023. ITEM 3. LEGAL PROCEEDINGS\nFrom time to time, the Company may become a party to legal actions or proceedings in the ordinary course of its business. As of September 30, 2023, and through the filing date of this Form 10-K, there were no such actions or proceedings, either individually or in the aggregate, that, if decided adversely to the Companys interests, the Company believes would be material to its business. ITEM 4. MINE SAFETY DISCLOSURES.\nNot Applicable.\nPART II ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED SHAREHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES\nMarket for Common Stock\nThe principal market for our common stock is Nasdaq. Our common stock is traded under the symbol FORD.\nOn December 8, 2023, the closing price for our common stock was $0.74.\nHolders of Common Stock\nAt November 30, 2023, there were approximately 70 holders of record of our common stock. Because many of our shares of common stock are held by brokers and other institutions on behalf of stockholders, we are unable to estimate the total number of stockholders represented by these record holders.\nDividends\nWe have not paid any cash dividends on our common stock since 1987 and do not plan to pay cash dividends in the foreseeable future. The payment of dividends in the future, if any, will depend upon our results of operations, as well as our short-term and long-term cash availability, net working capital, working capital needs, and other factors, as determined by our Board of Directors. Currently, except as may be provided by applicable laws, there are no contractual or other restrictions on our ability to pay dividends if we were to decide to declare and pay them.\nRecent Sales of Unregistered Securities\nNone. ITEM 6. RESERVED\nNot applicable. ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion and analysis should be read in conjunction with our consolidated financial statements and related notes appearing elsewhere in this report on Form 10-K. The following discussion and analysis compares our results of operations for the year ended September 30, 2023 (Fiscal 2023) with those for the year ended September 30, 2022 (Fiscal 2022). All dollar amounts and percentages presented herein have been rounded to approximate values. In addition to historical information, this discussion and analysis contains forward-looking statements that involve risks, uncertainties, and assumptions. Our actual results may differ materially from those anticipated in these forward-looking statements as a result of certain factors, including but not limited to those set forth under Risk Factors.\nCautionary statement regarding Forward-Looking Statements\nThis report includes forward-looking statements, as such term is used within the meaning of the Private Securities Litigation Reform Act of 1995. These statements include, among other things, statements regarding our liquidity, plans on repaying outstanding debt obligations, expectations regarding the effect of the pandemic and inflation on our business, as well as other statements regarding our future operations, financial condition and prospects, and business strategies. Forward-looking statements generally can be identified by words such as \"anticipates,\" \"believes,\" \"estimates,\" \"expects,\" \"intends,\" \"plans,\" \"predicts,\" \"projects,\" \"will be,\" \"will continue,\" \"will likely result,\" and similar expressions. These forward-looking statements are based on current expectations and assumptions that are subject to risks and uncertainties, which could cause our actual results to differ materially and adversely from those reflected in the forward-looking statements. Factors that could cause or contribute to such differences include, but are not limited to, those discussed in this Annual Report on Form 10-K, and in particular, the risks discussed under the caption \"Risk Factors\" in Item 1A of this report and those discussed in other documents we file with the SEC. We undertake no obligation to revise or publicly release the results of any revision to these forward-looking statements, except as required by law. Given these risks and uncertainties, readers are cautioned not to place undue reliance on such forward-looking statements.\nBusiness Overview\nForward Industries, Inc. is a global design, sourcing and distribution Company serving top tier medical and technology customers worldwide.\nOur design division provides hardware and software product design and engineering services to customers predominantly located in the U.S. Our OEM distribution division sources and sells carrying cases and other accessories for medical monitoring and diagnostic kits as well as a variety of other portable electronic and non-electronic devices to OEMs, or their contract manufacturers worldwide, that either package our products as accessories in box together with their branded product offerings or sell them through their retail distribution channels.\nConsidering the recurring losses incurred by the retail segment, in July 2023, the Company decided to cease operations of our retail distribution segment and we are presenting the results of operations for this segment within discontinued operations in the current and prior periods presented herein. The discontinuation of the retail segment represents a strategic shift in the Companys business. The primary assets of the retail segment are inventory and accounts receivable. The Company expects to sell, liquidate, or otherwise dispose of remaining retail inventory by June 30, 2024, and to collect remaining retail accounts receivable by the end of Fiscal 2024. After this time, we expect to have no further significant continuing involvement with the retail distribution segment. The inventory of the retail segment is presented as discontinued assets held for sale on the balance sheets at September 30, 2023 and 2022 and the results of operations for the retail segment have been classified as discontinued operations on the consolidated statements of operations for the years ended September 30, 2023 and 2022. All information and results in this annual report on Form 10-K exclude the discontinued operations unless otherwise noted. See Note 3 to our consolidated financial statements for additional information on discontinued operations.\nOn May 11, 2023, the U.S. Department of Health and Human Services declared the end of the Public Health Emergency for COVID-19; however, the effects of COVID-19 continue to linger throughout the global economy and our businesses. Though the severity of COVID-19 has subsided, new variants, or the outbreak of a new pathogen, could interrupt business, cause renewed labor and supply chain disruptions, and negatively impact the global and US economy, which could materially and adversely impact our businesses.\nAdditionally, see Part I, Item 1A Risk Factors for a description of the material risks we currently face in connection with COVID-19.\nVariability of Revenues and Results of Operations\nA significant portion of our revenue is concentrated with several large customers, some of which are the same and some of which change over time. Orders from some of these customers can be highly variable, with short lead times, which can cause our quarterly revenues, and consequently our results of operations, to vary over a relatively short period of time.\nCritical Accounting Policies and Estimates\nWe have identified the accounting policies and significant estimation processes below as critical to our business operations and the understanding of our results of operations. The discussion below is not intended to be comprehensive. In many cases, the accounting treatment of a particular transaction is specifically dictated by U.S. GAAP, with no need for managements judgment. In other cases, management is required to exercise judgment in the application of accounting principles with respect to particular transactions. The impact and any associated risks related to these policies on our business operations are discussed throughout this Managements Discussion and Analysis of Financial Condition and Results of Operations where such policies affect reported and expected financial results. For a detailed discussion of the applications of these and other accounting policies, see Item 8. Financial Statements and Supplementary Data in this report. The preparation of our consolidated financial statements requires us to make estimates and assumptions that are believed to be reasonable under the circumstances. There can be no assurance that actual results will not differ from those estimates and such differences could be significant.\nRevenue Recognition\nOEM Distribution Segment\nThe OEM distribution segment recognizes revenue when: (i) finished goods are shipped to its customers (in general, these conditions occur at either point of shipment or point of destination, depending on the terms of sale and transfer of control); (ii) there are no other deliverables or performance obligations; and (iii) there are no further obligations to the customer after the title of the goods has transferred. If the Company receives consideration before achieving the criteria previously mentioned, it records a contract liability, which is classified as a component of deferred income in the accompanying consolidated balance sheets.\nDesign Segment\nThe design segment applies the cost to cost and right to invoice methods of revenue recognition to its contracts with customers. The design segment typically engages in two types of contracts: (i) time and material and (ii) fixed price. The Company recognizes revenue over time on its time and material contracts utilizing a right to invoice method. Revenues from fixed price contracts that require performance of services that are not related to the production of tangible assets are recognized by using cost inputs to measure progress toward the completion of its performance obligations, or the cost to cost method. Revenues from fixed price contracts that contain specific deliverables are recognized when the performance obligation has been satisfied or the transfer of goods to the customer has been completed and accepted.\nRecognized revenues that will not be billed until a later date, or contract assets, are recorded as an asset and classified as a component of accounts receivable in the accompanying consolidated balance sheets. Contracts where collections to date have exceeded recognized revenues, or contract liabilities, are recorded as a liability and classified as a component of deferred income in the accompanying consolidated balance sheets.\nSegment Reporting\nAs a result of discontinuing our retail reportable segment, we now have two reportable segments: OEM distribution and design. The OEM distribution segment sources and distributes carrying cases and other accessories for medical monitoring and diagnostic kits and a variety of other portable electronic and non-electronic devices directly to OEMs or their contract manufacturers worldwide. The design segment consists of two operating segments (IPS and Kablooe, which have been aggregated into one reportable segment) that provide a full spectrum of hardware and software product design and engineering services to customers predominantly located in the U.S.\nOur chief operating decision maker (CODM) regularly reviews revenue and operating income for each segment to assess financial results and allocate resources. For our OEM distribution segment, we exclude general and administrative and general corporate expenses from its measure of profitability as these expenses are not allocated to the segments and therefore not included in the measure of profitability used by the CODM. For the design segment, general and administrative expenses directly attributable to that segment are included in its measure of profitability as these expenses are included in the measure of its profitability reviewed by the CODM. We do not include intercompany activity in our segment results to be consistent with the information that is presented to the CODM. Segment assets consist of accounts receivable and inventory, which are regularly reviewed by the CODM, as well as goodwill and intangible assets resulting from design segment acquisitions (see Note 16 to the consolidated financial statements).\nInventory Valuation\nInventories consist primarily of finished goods and are stated at the lower of cost (determined by the first-in, first-out method) or net realizable value. Based on managements estimates, an allowance is made to reduce excess, obsolete, or otherwise unsellable inventories to net realizable value. The allowance is established through charges to cost of sales in the Companys consolidated statements of operations. In determining the adequacy of the allowance, managements estimates are based upon several factors, including analyses of inventory levels, historical loss trends, sales history and projections of future sales demand. The Companys estimates of the allowance may change from time to time based on managements assessments, and such changes could be material.\nGoodwill and Intangible Assets\nWe review goodwill for impairment at least annually, or more often if triggering events occur. We have two reporting units with goodwill (the IPS and Kablooe operating segments) and we perform our annual goodwill impairment test on September 30, the end of the fiscal year, or upon the occurrence of a triggering event. We have the option to perform a qualitative assessment to determine if an impairment is more likely than not to have occurred. If we can support the conclusion that it is not more likely than not that the fair value of a reporting unit is less than its carrying amount, then we would not need to perform a quantitative impairment test for the reporting unit. If we cannot support such a conclusion or do not elect to perform the qualitative assessment, then we will perform the quantitative impairment test by comparing the fair value of the reporting unit with its carrying amount, including goodwill. If the fair value of the reporting unit exceeds its carrying amount, no impairment charge is recognized. If the fair value of the reporting unit is less than its carrying amount, an impairment charge will be recognized for the amount by which the reporting units carrying amount exceeds its fair value. A significant amount of judgment is required in performing goodwill impairment tests including estimating the fair value of a reporting unit. There were no indications of goodwill impairment in Fiscal 2023 or Fiscal 2022.\nOur intangible assets are reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable. In assessing the recoverability of our intangible assets, we must make estimates and assumptions regarding future cash flows and other factors to determine the fair value of the respective assets. These estimates and assumptions could have a significant impact on whether an impairment charge is recognized and the magnitude of any such charge. Fair value estimates are made at a specific point in time, based on relevant information. These estimates are subjective in nature and involve uncertainties and matters of significant judgments and therefore cannot be determined with precision. Changes in assumptions could significantly affect the estimates. If these estimates or material related assumptions change in the future, we may be required to record impairment charges related to our intangible assets. There were no indications of impairment of intangible assets in Fiscal 2023 or 2022.\nRecent Accounting Pronouncements\nIn November 2019, the Financial Accounting Standards Board (FASB) issued Accounting Standards Update (ASU) 2019-11, Codification Improvements to Topic 326, Financial Instruments - Credit Losses. ASU 2019-11 is an accounting pronouncement that provides clarity to and amends earlier guidance on this topic and would be effective concurrently with the adoption of such earlier guidance. This pronouncement is effective for us for fiscal years beginning after December 15, 2022 and interim periods within those fiscal years and is not expected to have a material impact on our consolidated financial statements.\nRESULTS OF OPERATIONS FOR FISCAL 2023 COMPARED TO FISCAL 2022\nConsolidated Results\nThe table below summarizes our consolidated results of continuing operations for Fiscal 2023 as compared to Fiscal 2022:\nConsolidated Results of Operations\nFiscal 2023 Fiscal 2022 Change ($) Change (%)\nNet revenues $ 36,688,000 $ 38,207,000 $ (1,519,000 ) (4.0% )\nCost of sales 28,324,000 29,407,000 (1,083,000 ) (3.7% )\nGross profit 8,364,000 8,800,000 (436,000 ) (5.0% )\nSales and marketing expenses 1,663,000 1,478,000 185,000 12.5%\nGeneral and administrative expenses 6,541,000 6,734,000 (193,000 ) (2.9% )\nOperating income 160,000 588,000 (428,000 ) (72.8% )\nOther expense/(income), net (19,000 ) 135,000 (154,000 ) (114.1% )\nIncome tax provision 20,000 3,000 17,000 566.7%\nIncome from continuing operations $ 159,000 $ 450,000 $ (291,000 ) (64.7% )\nThe decrease in net revenues in Fiscal 2023 was primarily driven by a decline in revenue in the OEM distribution segment, which was partially offset by revenue growth in the design segment.\nGross profit decreased and gross margin declined from 23.0% in Fiscal 2022 to 22.8% in Fiscal 2023. This decrease was mainly driven by the OEM distribution segment because of continued pricing pressures from our customers, high product, importation and logistics costs and inflation.\nSales and marketing expenses increased primarily due to higher sales related expenses in the design segment, partially offset by lower marketing related overhead in our OEM distribution segment. Sales and marketing expenses as a percentage of revenue increased from 3.9% in Fiscal 2022 to 4.5% in Fiscal 2023.\nGeneral and administrative expenses decreased in Fiscal 2023, primarily related to bad debt recoveries in the design segment and lower non-employee directors share-based compensation expense, partially offset by higher professional fees and personnel costs. Management continues to monitor the various components of general and administrative expenses and how these costs are affected by inflationary and other factors. We intend to adjust these costs as needed based on the overall needs of the business.\nWe reported other income of $19,000 in Fiscal 2023 as compared to other expense of $135,000 in Fiscal 2022. The variance is due to fair value adjustments of $70,000 in the 2023 Period to reduce to the fair value of the earnout consideration related to the Kablooe acquisition, $18,000 of net duty drawback income received in the 2023 Period, interest income from interest bearing deposits, foreign currency fluctuations and a decrease in interest expense resulting from a reduction in the amount of debt outstanding.\nIn Fiscal 2023, we recorded a tax provision of $20,000, generated income from continuing operations before income taxes of $179,000 and had an effective tax rate of 11.2%. In Fiscal 2022, we recorded a tax provision of $3,000, generated income from continuing operations before income taxes of $452,000 and had an effective tax rate of 0.5%.\nConsolidated basic and diluted earnings per share from continuing operations was $0.02 and $0.04 for Fiscal 2023 and Fiscal 2022, respectively.\nSegment Results\nThe discussion that follows below provides further details about the results of operations for each continuing segment as compared to the prior year.\nSegment Results of Operations\nOEM Distribution Design Corporate Expenses Consolidated\nFiscal 2023 revenues $ 14,002,000 $ 22,686,000 $ - $ 36,688,000\nFiscal 2022 revenues 18,036,000 20,171,000 - 38,207,000\nChange $ (4,034,000 ) $ 2,515,000 $ - $ (1,519,000 )\nFiscal 2023 operating income $ 440,000 $ 2,182,000 $ (2,462,000 ) $ 160,000\nFiscal 2022 operating income 905,000 2,148,000 (2,465,000 ) 588,000\nChange $ (465,000 ) $ 34,000 $ 3,000 $ (428,000 )\nOEM Distribution\nNet revenues in the OEM distribution segment decreased from lower sales volume from both diabetic customers and other OEM customers. As consumer demand increases for diabetic testing products which require no carrying case, we expect diabetic product sales to continue to represent a smaller portion of our OEM distribution revenue. In March 2023, a contract with one of our major diabetic customers expired. Due to increased pricing pressures, we did not extend our contract with this customer. Revenue from this customer represented approximately 12% of our consolidated net revenues in the 2022 Period. We expect the loss of this customer to cause a significant decline in OEM distribution segment revenues in future periods.\nThe following tables set forth revenues by product line of our OEM distribution segment customers for the periods indicated:\nOEM Revenues by Product Line\nFiscal 2023 Fiscal 2022 Change ($) Change (%)\nDiabetic products $ 11,805,000 $ 15,403,000 $ (3,598,000 ) (23.4% )\nOther products 2,197,000 2,633,000 (436,000 ) (16.6% )\nTotal net revenues $ 14,002,000 $ 18,036,000 $ (4,034,000 ) (22.4% )\nDiabetic Product Revenues\nOur OEM distribution segment sources to the order of, and sells carrying cases for, blood glucose diagnostic kits directly to OEMs (or their contract manufacturers). The OEM customer or its contract manufacturer packages our carry cases in box as a custom accessory for the OEMs blood glucose testing and monitoring kits or, to a lesser extent, sells them through their retail distribution channels.\nRevenues from diabetic products decreased due to the loss of a major customer in March 2023, lower demand from one major customer and the loss of one product to a competitor. These decreases were partially offset by an increase in demand from another customer, which was timing related. As mentioned above, management believes that revenues from diabetic customers will continue to decline.\nRevenues from diabetic products represented 84% of net revenues for the OEM distribution segment in Fiscal 2023 compared to 85% in Fiscal 2022.\nOther Product Revenues\nOur OEM distribution segment also sources and sells cases and protective solutions for a diverse array of portable electronic and non-electronic products (such as sporting and recreational products, bar code scanners, GPS devices, tablets and firearms) on a made-to-order basis that are customized to fit the products sold by our OEM customers.\nRevenues from other products decreased due to lower sales volume with some existing customers, partially driven by the delayed rollout of certain customer product lines and reduced demand from some customers. We will continue to focus on our sales and sales support teams in our continued efforts to expand and diversify our other products customer base.\nOperating Income\nOperating income for the OEM distribution segment declined and operating income margin declined to 3.1% in Fiscal 2023, compared to 5.0% in Fiscal 2022, driven by lower gross margins and a shift in the mix of revenue. While revenues decreased in both diabetic and other products, a large portion of the decrease in diabetic revenue was from more profitable products, thus driving overall gross margins down. The cost of importing all products from China has increased and both the diabetic and other OEM product lines have experienced pricing pressures from customers. The decline in gross margin was partially mitigated by lower selling and marketing costs related to OEM sales commissions. We continue to work on expanding our product offerings to include higher margin products and enhancing our sales efforts to grow revenue and increase gross profit.\nConsidering the loss of a significant diabetic customer, management reduced its OEM distribution segment sales and marketing personnel in March 2023 and reduced its sourcing fee with Forward China. Effective April 1, 2023, the Company and Forward China agreed to reduce the fixed portion of the sourcing fee from $100,000 to $83,333 per month for the remaining term of the sourcing agreement, which resulted in cash savings of $100,000 for Fiscal 2023. The Company and Forward China signed a new Supply Agreement effective October 2023, which further reduced the fixed portion of the sourcing fee to $65,833 per month. See Note 14 to the consolidated financial statements for more information on the sourcing agreement with Forward China.\nDesign Segment\nThe increase in net revenues in the design segment was driven by an increase in revenue from one major customer, coupled with an increase in projects from new and existing customers, which was partially offset by declines in revenues from certain prior year customers.\nOperating income for the design segment increased slightly but operating income margin decreased from 10.6% in Fiscal 2022 to 9.6% in Fiscal 2023. The impact of higher direct labor costs driven by inflationary pressures, coupled with higher sales and marketing expenses, was slightly offset by better utilization and increased billing rates and lower general and administrative expenses, driven by bad debt recoveries.\nLIQUIDITY AND CAPITAL RESOURCES\nOur primary source of liquidity is our operations. The primary demand on our working capital has historically been (i) operating losses, (ii) repayment of debt obligations, and (iii) any increases in accounts receivable and inventories arising in the ordinary course of business. Historically, our sources of liquidity have been adequate to satisfy working capital requirements arising in the ordinary course of business. At September 30, 2023, our working capital was $26,000 compared to $1,209,000 at September 30, 2022, which excludes discontinued assets held for sale. The decrease was primarily due to higher payables and accrued expenses and a decrease in accounts receivable, partially offset by an increase in cash. At November 30, 2023, we had approximately $3,800,000 cash on hand and $1,300,000 available under our line of credit with a bank which matures May 31, 2024. There are no assurances this line of credit will extend beyond May 31, 2024.\nForward China, our largest vendor and an entity owned by our Chairman of the Board and Chief Executive Officer, holds a $1,600,000 promissory note (the FC Note) issued by us which matures on December 31, 2024 (see Note 14 to the consolidated financial statements). The balance of the FC Note was reduced to $1,100,000 after we made principal payments of $500,000 in Fiscal 2023 and Fiscal 2022. Although the FC Note has been extended on multiple occasions to assist us with our liquidity position, we plan on funding the repayment at maturity using existing cash balances and/or obtaining additional extensions as deemed necessary. Additionally, Forward China has extended payment terms on our outstanding payables due to them when necessary. At September 30, 2023, our accounts payable due to Forward China was approximately $8,246,000. In connection with the new sourcing agreement (see Note 14 to the consolidated financial statements) and in order to preserve our future liquidity, Forward China agreed to limit the amount of outstanding payables it would seek to collect from us to $500,000 in any 12-month period, which we agreed to pay within 30 days of any such request. This agreement pertains only to payables that were outstanding at October 30, 2023 of $7,365,000. Purchases from Forward China made after October 30, 2023, are not covered by this agreement and are expected to be paid according to normal payment terms. We can provide no assurance that (i) Forward China will extend the FC Note again if we request an extension, (ii) Forward China will extend additional payment terms on any payables not covered by the agreement, if needed, or (iii) any additional credit facility will be available on terms acceptable to us or at all.\nWe anticipate that our liquidity and financial resources for the 12 months following the date of this report will be adequate to manage our operating and financial requirements. If we have the opportunity to make a strategic acquisition (as we have in the past with the acquisitions of IPS and Kablooe) or an investment in a product or partnership, we may require additional capital beyond our current cash balance to fund the opportunity. If we seek to raise additional capital, there is no assurance that we will be able to raise funds on terms that are acceptable to us or at all. In the current environment of rising interest rates, any future borrowing is expected to result in higher interest expense.\nAlthough we do not anticipate the need to purchase any additional material capital assets in order to carry out our business, it may be necessary for us to purchase equipment and other capital assets in the future, depending on need.\nCash Flows\nDuring Fiscal 2023 and Fiscal 2022, our sources and uses of cash were as follows:\nOperating Activities\nDuring Fiscal 2023, cash provided by operating activities of $1,041,000 resulted from a decrease in discontinued assets held for sale of $2,642,00, an increase in accounts payable and amounts due to Forward China of $783,000, an increase in accounts receivable of $495,000, non-cash charges for depreciation, amortization, share-based compensation and bad debt expense of $481,000 and the net change in other operating assets and liabilities of $427,000, partially offset by the $70,000 non-cash adjustment to the fair value of the Kablooe earnout consideration and the net loss of $3,737,000.\nDuring Fiscal 2022, cash provided by operating activities of $1,535,000 resulted from an increase in accounts payable and amounts due to Forward China of $1,856,000, a decrease in accounts receivable of $953,000, non-cash charges for depreciation, amortization, share-based compensation and bad debt expense of $775,000, an increase in accrued expenses of $624,000 and the net change in other operating assets and liabilities of $552,000, partially offset by the net loss of $1,378,000 and an increase in discontinued assets held for sale of $1,847,000.\nInvesting Activities\nIn Fiscal 2023 and Fiscal 2022, cash used for investing activities of $136,000 and $170,000, respectively, resulted from purchases of property and equipment.\nFinancing Activities\nIn Fiscal 2023 and Fiscal 2022, cash used in financing activities of $300,000 and $200,000, respectively, consisted of principal payments on the promissory note held by Forward China. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nNot applicable. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nThe consolidated financial statements and notes thereto included in this Annual Report may be found beginning on page of this Annual Report on Form 10-K. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone. ITEM 9A. CONTROLS AND PROCEDURES\nEvaluation of Disclosure Controls and Procedures\nOur management carried out an evaluation, with the participation of our Principal Executive Officer and Principal Financial Officer, of the effectiveness of our disclosure controls and procedures as defined in Rule 13a-15(e) under the Exchange Act. Based on their evaluation, our Principal Executive Officer and Principal Financial Officer concluded that our disclosure controls and procedures were effective as of September 30, 2023.\nManagements Report on Internal Control Over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting (as defined in Rule 13a-15(f) under the Exchange Act). Our management, under the supervision and with the participation of our Principal Executive Officer and Principal Financial Officer, evaluated the effectiveness of our internal control over financial reporting as of the end of the period covered by this report. In making this assessment, our management used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (COSO) in Internal Control-Integrated Framework as issued in 2013. Based on that evaluation, our management concluded that our internal control over financial reporting as of September 30, 2023, was effective based on that criteria.\nOur internal control over financial reporting is a process designed under the supervision of our Principal Executive Officer and Principal Financial Officer to provide reasonable assurance regarding the reliability of financial reporting and the preparation of our financial statements for external reporting purposes in accordance with U.S. GAAP. Internal control over financial reporting includes those policies and procedures that (i) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of our assets; (ii) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with U.S. GAAP, and that receipts and expenditures are being made only in accordance with authorizations of our management and directors; and (iii) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use or disposition of our assets that could have a material effect on the consolidated financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with policies or procedures may deteriorate.\nChanges in Internal Control\nThere were no changes in our internal control over financial reporting identified in management's evaluation pursuant to Rules 13a-15(d) or 15d-15(d) of the Exchange Act during the fourth quarter of Fiscal 2023 that materially affected, or are reasonably likely to materially affect, our internal control over financial reporting. ITEM 9B. OTHER INFORMATION\nOn December 14, 2023, the Board of Directors approved the following changes to the Fiscal 2024 non-employee director (NED) and Chief Executive Officer (CEO) compensation:\nNED compensation was reduced by 25% (resulting in a cost savings of $50,000)\nCEO compensation was reduced by 25% (resulting in a cost savings of $84,250)\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot Applicable.\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe information required by this item is incorporated by reference to our Proxy Statement for the 2024 Annual Meeting of Stockholders to be filed with the SEC within 120 days of the fiscal year ended September 30, 2023. Our Board has adopted a Code of Business Conduct and Ethics applicable to all officers, directors and employees, which is available on our website (https://forwardindustries.com) under Investors, \"Governance.\" We intend to satisfy the disclosure requirement under Item 5.05 of Form 8-K regarding amendment to, or waiver from, a provision of our Code of Conduct and by posting such information on the website address and location specified above. ITEM 11. EXECUTIVE COMPENSATION\nThe information required by this item is incorporated by reference to our Proxy Statement for the 2024 Annual Meeting of Stockholders to be filed with the SEC within 120 days of the fiscal year ended September 30, 2023. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED SHAREHOLDER MATTERS\nThe information required by this item is incorporated by reference to our Proxy Statement for the 2024 Annual Meeting of Stockholders to be filed with the SEC within 120 days of the fiscal year ended September 30, 2023. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS AND DIRECTOR INDEPENDENCE\nThe information required by this item is incorporated by reference to our Proxy Statement for the 2024 Annual Meeting of Stockholders to be filed with the SEC within 120 days of the fiscal year ended September 30, 2023. ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nThe information required by this item is incorporated by reference to our Proxy Statement for the 2024 Annual Meeting of Stockholders to be filed with the SEC within 120 days of the fiscal year ended September 30, 2023.\nPART IV ITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n(a) Documents filed as part of the report.\n(1) Financial Statements. See Index to Consolidated Financial Statements, which appears on page hereof. The financial statements listed in the accompanying Index to Consolidated Financial Statements are filed herewith in response to this Item.\n(2) Financial Statements Schedules. All schedules are omitted because they are not applicable or because the required information is contained in the consolidated financial statements or notes included in this report.\n(3) Exhibits. See the Exhibit Index.\nITEM 16. FORM 10-K SUMMARY\nNot Applicable.\nSignatures\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nDated: December 21, 2023\nFORWARD INDUSTRIES, INC.\nBy: /s/ Terence Wise\nTerence Wise\nChief Executive Officer\n(Principal Executive Officer)\nIn accordance with the Securities Exchange Act of 1934, as amended, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated:\nDecember 21, 2023 /s/ Terence Wise\nTerence Wise\nPrincipal Executive Officer and Director\nDecember 21, 2023 /s/ Kathleen Weisberg\nKathleen Weisberg\nChief Financial Officer\nPrincipal Financial Officer and Principal Accounting Officer\nDecember 21, 2023 /s/ Sangita Shah\nSangita Shah\nDirector\nDecember 21, 2023\n/s/ James Ziglar\nJames Ziglar\nDirector\nDecember 21, 2023\n/s/ Sharon Hrynkow\nSharon Hrynkow\nDirector\nEXHIBIT INDEX\nIncorporated by\nReference\nExhibit\nNo.\nExhibit Description Form Date Number Filed or\nFurnished\nHerewith\n2.1\nStock Purchase Agreement dated January 18, 2018 - Intelligent Product Solutions, Inc.+ 8-K 1/18/18 2.1\n2.2\nAsset Purchase Agreement dated August 17, 2020 - Kablooe, Inc.+ 8-K 8/17/20 2.1\n3.1\nRestated Certificate of Incorporation 10-K 12/8/10 3(i)\n3.2\nCertificate of Amendment of the Certificate of Incorporation, April 26, 2013 8-K 4/26/13 3.1\n3.3\nCertificate of Amendment of the Certificate of Incorporation, June 28, 2013 8-K 7/3/13 3.1\n3.4\nThird Amended and Restated Bylaws, as of May 28, 2014 10-K 12/10/14 3(ii)\n4.1\nDescription of securities registered under Section 12 of the Exchange Act of 1934 10-K 12/27/19 4.1\n4.2\nPromissory Note dated January 18, 2018 - Forward Industries (Asia-Pacific) Corporation (as amended and restated) 10-K 12/16/22 4.2  \n10.1\n2011 Long Term Incentive Plan, as amended 10-Q 2/14/19 4.3\n10.2\nEquity Incentive Plan 8-K 12/23/20 4.1\n10.3\nForm of Employment Agreement dated May 26, 2021- Paul Severino*$ 10-K 12/16/21 10.4(a)\n10.4\nSummary of Employment Arrangement - Terence Wise*\nFiled\n10.5\nEmployment Agreement dated July 1, 2023 - Kathleen Weisberg* 8-K 6/30/23 10.1\n10.6\nPaycheck Protection Program Term Note payable to TD Bank, N.A. dated April 18, 2020 8-K 4/22/20 10.1\n10.7\nAmended and Restated TD Bank Revolving Term Note dated September 28, 2018 8-K 10/2/18 10.1\n10.8\nTD Bank Modification Agreement dated September 28, 2018 8-K 10/2/18 10.2\n10.9\nConsultancy Agreement dated March 1, 2022 - Justwise Group Ltd. 10-Q 5/12/22 10.1\n10.10\nConsultancy Agreement dated September 1, 2022 - Justwise Group Ltd. 10-K 12/16/22 10.11\n10.10(a)\nExtension to the Consultancy Agreement - Justwise Group Ltd. 8-K 11/8/23 10.4\n10.11\nEmployment Agreement dated January 18, 2018 - Robert Wild* 10-K 12/16/22 10.12\n10.12\nEmployment Agreement dated August 17, 2020 - Tom KraMer* 10-K 12/16/22 10.13\n10.13\nBuying Agency and Supply Agreement dated November 2, 2023 - Forward Industries (Asia-Pacific) Corporation+ 8-K 11/8/23 10.1\n10.14\nDeferred Payment Agreement 8-K 11/8/23 10.2\n21.1\nList of Subsidiaries 10-K 12/17/20 21.1\n23.1\nConsent of Independent Registered Public Accounting Firm\nFiled\n31.1\nCEO Certifications (302)\nFiled\n31.2\nCFO Certification (302)\nFiled\n32.1\nCEO and CFO Certifications (906)\nFurnished\n101.INS\nInline XBRL Instance Document (the Instance Document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document)\nFiled\n101.SCH\nInline XBRL Taxonomy Extension Schema Document\nFiled\n101.CAL\nInline XBRL Taxonomy Extension Calculation Linkbase Document\nFiled\n101.DEF\nInline XBRL Taxonomy Extension Definition Linkbase Document\nFiled\n101.LAB\nInline XBRL Taxonomy Extension Label Linkbase Document\nFiled\n101.PRE\nInline XBRL Taxonomy Extension Presentation Linkbase Document\nFiled\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101)\n______________________\n* Management compensatory agreement or arrangement.\n+ Certain schedules, appendices and exhibits to this agreement have been omitted in accordance with Item 601 of Regulation S-K. A copy of any omitted schedule and/or exhibit will be furnished supplementally to the Securities and Exchange Commission staff upon request.\n$ As previously disclosed, this executive officer has received an increase to his annual Base Salary.\nCopies of this filing (including the financial statements) and any of the exhibits referred to above will be furnished at no cost to our shareholders who make a written request to Forward Industries, Inc.; 700 Veterans Memorial Hwy, Suite 100, Hauppauge, NY 11788; Attention: Corporate Secretary.\nFORWARD INDUSTRIES, INC. AND SUBSIDIARIES\nCONSOLIDATED FINANCIAL STATEMENTS\nPage\nReport of Independent Registered Public Accounting Firm (PCAOB #596)\nConsolidated Balance Sheets at September 30, 2023 and 2022\nConsolidated Statements of Operations for the Years Ended September 30, 2023 and 2022\nConsolidated Statements of Shareholders' Equity for the Years Ended September 30, 2023 and 2022\nConsolidated Statements of Cash Flows for the Years Ended September 30, 2023 and 2022\nNotes to Consolidated Financial Statements\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nThe Board of Directors and Shareholders of\nForward Industries, Inc.\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Forward Industries, Inc. and Subsidiaries (the Company) as of September 30, 2023 and 2022, and the related consolidated statements of operations, shareholders equity and cash flows for the years then ended, and the related notes (collectively referred to as the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company as of September 30, 2023 and 2022, and the results of its operations and its cash flows for the years then ended, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese consolidated financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys consolidated financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (\"PCAOB\") and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the consolidated financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the consolidated financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the consolidated financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the consolidated financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matter communicated below is a matter arising from the current period audit of the consolidated financial statements that was communicated or required to be communicated to the audit committee and that: (1) related to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of a critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing separate opinions on the critical audit matter or on the accounts or disclosures to which they relate.\nAssessment of Going Concern (Note 1 to the Consolidated Financial Statements)\nSignificant judgment is exercised by the Company in determining whether there is substantial doubt the Company will continue as a going concern. Specifically, the Companys forecasted cash flows are sensitive to significant assumptions such as projected revenue and projected operating results, all of which are affected by the expected future market or economic conditions, including the residual effects of the global pandemic, and inflation.\nGiven these factors, the related audit effort in evaluating managements judgments in determining the Companys ability to continue as a going concern was challenging, subjective, and complex and required a high degree of auditor judgment.\nHow our Audit Addressed the Critical Audit Matter\nOur principal audit procedures related to the Companys assessment of going concern included the following:\n· Obtaining an understanding of and evaluating the Companys process to develop forecasted cash flows, including significant assumptions used in developing forecasted cash flows as well as considering the appropriateness of the underlying data used by the Company in its analyses.\n· Evaluating the reasonableness of the Companys forecasted revenue, operating results, and cash flows by comparing those forecasts to underlying business strategies, including customer relationships and the Companys ability to obtain new customers, and to historical results. In addition, we performed sensitivity analyses related to the key inputs used in the Companys forecasted cash flows, including evaluating whether the changes in the assumptions would result in a material change in forecasted cash flows.\n· Evaluating managements ability to accurately forecast future cash flows by comparing the Companys historical forecasted sales, operating results and cash flow forecasts to actual results.\n/s/ CohnReznick LLP\nWe have served as the Companys auditor since 2011.\nMelville, New York\nDecember 21, 2023\nFORWARD INDUSTRIES, INC. AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\nSeptember 30,\nAssets\nCurrent assets:\nCash $ 3,180,468 $ 2,575,522\nAccounts receivable, net 6,968,778 7,542,666\nInventories, net 334,384 650,853\nDiscontinued assets held for sale 508,077 3,150,177\nPrepaid expenses and other current assets 378,512 417,605\nTotal current assets 11,370,219 14,336,823\nProperty and equipment, net 274,046 241,146\nIntangible assets, net 893,143 1,105,901\nGoodwill 1,758,682 1,758,682\nOperating lease right-of-use assets, net 3,021,315 3,427,726\nOther assets 68,737 68,737\nTotal assets $ 17,386,142 $ 20,939,015\nLiabilities and shareholders' equity\nCurrent liabilities:\nAccounts payable $ 518,892 $ 268,160\nDue to Forward China 8,246,015 7,713,880\nDeferred income 297,407 438,878\nCurrent portion of earnout consideration - 25,000\nCurrent portion of operating lease liability 416,042 377,940\nAccrued expenses and other current liabilities 1,357,743 1,153,906\nTotal current liabilities 10,836,099 9,977,764\nOther liabilities:\nNote payable to Forward China 1,100,000 1,400,000\nOperating lease liability, less current portion 2,833,782 3,249,824\nEarnout consideration, less current portion - 45,000\nTotal liabilities 14,769,881 14,672,588\nCommitments and contingencies (Note 12) - -\nShareholders' equity:\nCommon stock, par value $0.01 per share; 40,000,000 shares authorized; 10,061,185 shares issued and outstanding at September 30, 2023 and 2022 100,612 100,612\nAdditional paid-in capital 20,202,202 20,115,711\nAccumulated deficit (17,686,553 ) (13,949,896 )\nTotal shareholders' equity 2,616,261 6,266,427\nTotal liabilities and shareholders' equity $ 17,386,142 $ 20,939,015\nThe accompanying notes are an integral part of the consolidated financial statements.\nFORWARD INDUSTRIES, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF OPERATIONS\nFor the Fiscal Years Ended September 30,\nRevenues, net $ 36,688,307 $ 38,206,958\nCost of sales 28,323,822 29,407,009\nGross profit 8,364,485 8,799,949\nSales and marketing expenses 1,663,791 1,477,936\nGeneral and administrative expenses 6,541,036 6,733,543\nOperating income 159,658 588,470\nFair value adjustment of earnout consideration (70,000 ) -\nInterest income (23,188 ) -\nInterest expense 104,201 123,411\nOther (income)/expense, net (30,019 ) 12,612\nIncome from continuing operations before income taxes 178,664 452,447\nProvision for income taxes 20,006 2,554\nIncome from continuing operations 158,658 449,893\nLoss from discontinued operations, net of tax (3,895,315 ) (1,828,144 )\nNet loss $ (3,736,657 ) $ (1,378,251 )\nBasic earnings/(loss) per share :\nBasic earnings per share from continuing operations $ 0.02 $ 0.04\nBasic loss per share from discontinued operations (0.39 ) (0.18 )\nBasic loss per share $ (0.37 ) $ (0.14 )\nDiluted earnings/(loss) per share:\nDiluted earnings per share from continuing operations $ 0.02 $ 0.04\nDiluted loss per share from discontinued operations (0.39 ) (0.18 )\nDiluted loss per share $ (0.37 ) $ (0.14 )\nWeighted average common shares outstanding:\nBasic 10,061,185 10,061,185\nDiluted 10,061,185 10,200,792\nThe accompanying notes are an integral part of the consolidated financial statements.\nFORWARD INDUSTRIES, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF SHAREHOLDERS' EQUITY\nFor the Fiscal Year Ended September 30, 2023\nAdditional\nCommon Stock Paid-In Accumulated\nShares Amount Capital Deficit Total\nBalance at September 30, 2022 10,061,185 $ 100,612 $ 20,115,711 $ (13,949,896 ) $ 6,266,427\nShare-based compensation - - 86,491 - 86,491\nNet loss - - - (3,736,657 ) (3,736,657 )\nBalance at September 30, 2023 10,061,185 $ 100,612 $ 20,202,202 $ (17,686,553 ) $ 2,616,261\nFor the Fiscal Year Ended September 30, 2022\nAdditional\nCommon Stock Paid-In Accumulated\nShares Amount Capital Deficit Total\nBalance at September 30, 2021 10,061,185 $ 100,612 $ 19,914,476 $ (12,571,645 ) $ 7,443,443\nShare-based compensation - - 201,235 - 201,235\nNet loss - - - (1,378,251 ) (1,378,251 )\nBalance at September 30, 2022 10,061,185 $ 100,612 $ 20,115,711 $ (13,949,896 ) $ 6,266,427\nThe accompanying notes are an integral part of the consolidated financial statements.\nFORWARD INDUSTRIES, INC. AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nFor the Fiscal Years Ended September 30,\nOperating Activities:\nNet loss $ (3,736,657 ) $ (1,378,251 )\nAdjustments to reconcile net loss to net cash provided by operating activities:\nShare-based compensation 86,491 201,235\nDepreciation and amortization 315,940 309,239\nBad debt expense 78,786 264,912\nChange in fair value of earn-out consideration (70,000 ) -\nChanges in operating assets and liabilities:\nAccounts receivable 495,102 953,137\nInventories 316,469 108,223\nDiscontinued assets held for sale 2,642,100 (1,846,696 )\nPrepaid expenses and other current assets 39,093 143,467\nOther assets - 3,514\nAccounts payable and due to Forward China 782,867 1,856,340\nDeferred income (141,471 ) 251,183\nNet changes in operating lease liabilities 28,471 44,076\nAccrued expenses and other current liabilities 203,837 624,409\nNet cash provided by operating activities 1,041,028 1,534,788\nInvesting Activities:\nPurchases of property and equipment (136,082 ) (169,631 )\nNet cash used in investing activities (136,082 ) (169,631 )\nFinancing Activities:\nRepayment of note payable to Forward China (300,000 ) (200,000 )\nNet cash used in financing activities (300,000 ) (200,000 )\nNet increase in cash 604,946 1,165,157\nCash at beginning of year 2,575,522 1,410,365\nCash at end of year $ 3,180,468 $ 2,575,522\nSupplemental Disclosures of Cash Flow Information:\nCash paid for interest $ 104,201 $ 123,411\nCash paid for taxes $ 10,271 $ 10,856\nSupplemental Disclosures of Non-Cash Information:\nOperating lease assets obtained in exchange for operating lease liabilities $ - $ 204,881\nThe accompanying notes are an integral part of the consolidated financial statements.\nFORWARD INDUSTRIES, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 1 OVERVIEW\nBusiness\nForward Industries, Inc. (Forward, we, our, or the Company), is a global design, sourcing and distribution company serving top tier medical and technology customers worldwide.\nThe Companys design division provides hardware and software product design and engineering services to customers predominantly located in the U.S. The Companys original equipment manufacturing (OEM) distribution division sources and sells carrying cases and other accessories for medical monitoring and diagnostic kits as well as a variety of other portable electronic and non-electronic devices to original equipment manufacturers (OEMs), or their contract manufacturers worldwide, that either package our products as accessories in box together with their branded product offerings or sell them through their retail distribution channels. The Company does not manufacture any of its OEM products and sources substantially all of these products from independent suppliers in China, through Forward Industries Asia-Pacific Corporation, a British Virgin Islands corporation (Forward China). See Note 14.\nDiscontinued Operations\nIn July 2023, the Company decided to cease operations of its retail distribution segment and is presenting the results of operations for this segment within discontinued operations in the current and prior periods presented herein. Our retail distribution business sources and sells smart-enabled furniture, hot tubs and saunas and a variety of other products through various online retailer websites to customers predominantly located in the U.S. and Canada. The inventory of the retail segment is presented as discontinued assets held for sale on the balance sheets at September 30, 2023 and 2022. Where applicable, certain footnotes exclude the discontinued operations unless otherwise noted. See Note 3 for additional information on discontinued operations.\nLiquidity\nIn Fiscal 2023, the Company generated a net loss of $3,737,000, income from continuing operations of $159,000 and cash flows from operating activities of $1,041,000. At September 30, 2023, the Company had $1,300,000 of borrowing available under its line of credit with a bank that was renewed in March 2023 and has a maturity date of May 31, 2024 (see Note 17). By discontinuing the retail segment, which incurred significant losses, the Company expects improvement in operating profitability and cash flows in future periods. The Companys OEM distribution segment procures substantially all its products through independent suppliers in China through Forward China. In connection with the new sourcing agreement and in order to preserve future liquidity, in November 2023, the Company and Forward China entered into an agreement whereby Forward China agreed to limit the amount of outstanding payables it would seek to collect from the Company to $500,000 in any 12-month period, which the Company agreed to pay within 30 days of any such request (see Note 14). This agreement pertains only to payables that were outstanding at October 30, 2023 of approximately $7,365,000. Purchases from Forward China made after October 30, 2023 are not covered by this agreement and are expected to be paid according to normal payment terms. Based on our forecasted cash flows, discontinuing our retail segment and the agreement with Forward China, we believe our existing cash balance and working capital will be sufficient to meet our liquidity needs through at least December 31, 2024. The consolidated financial statements do not include any adjustments that might result if the Company is unable to continue as a going concern.\nImpact of COVID-19\nOn May 11, 2023, the U.S. Department of Health and Human Services declared the end of the Public Health Emergency for COVID-19; however, the effects of COVID-19 continue to linger throughout the global economy and our businesses. Though the severity of COVID-19 has subsided, new variants, or the outbreak of a new pathogen, could interrupt our business, cause renewed labor and supply chain disruptions, and negatively impact the global and US economy, which could materially and adversely impact our business.\nFORWARD INDUSTRIES, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 2 ACCOUNTING POLICIES\nUse of Estimates\nThe preparation of the Companys consolidated financial statements in conformity with accounting principles generally accepted in the United States of America (U.S. GAAP) requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosures of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting periods. Actual results could differ from those estimates and assumptions. Within this report, certain dollar amounts and percentages have been rounded to their approximate values.\nBasis of Presentation\nThe accompanying consolidated financial statements include the accounts of Forward Industries, Inc. and its wholly-owned subsidiaries (Forward US, Forward Switzerland, Forward UK, IPS and Kablooe). All significant intercompany transactions and balances have been eliminated in consolidation.\nSegment Reporting\nAs a result of the discontinued retail segment, as disclosed in Note 3, the Company now has two reportable segments: OEM distribution and design. The OEM distribution segment sources and sells carrying cases and other accessories for medical monitoring and diagnostic kits and a variety of other portable electronic and non-electronic devices (such as sporting and recreational products, bar code scanners, GPS location devices, tablets and firearms) on a made-to-order basis that are customized to fit the products sold by our OEM customers worldwide. The design segment consists of two operating segments (IPS and Kablooe, which have been aggregated into one reportable segment) that provide a full spectrum of hardware and software product design and engineering services to customers predominantly located in the U.S. See Note 16 for more information on segments.\nGoodwill\nThe Company reviews goodwill for impairment at least annually, or more often if triggering events occur. The Company has two reporting units with goodwill (the IPS and Kablooe operating segments) and we perform our annual goodwill impairment test on September 30, the end of the fiscal year, or upon the occurrence of a triggering event. The Company has the option to perform a qualitative assessment to determine if an impairment is more likely than not to have occurred. If the Company can support the conclusion that it is not more likely than not that the fair value of a reporting unit is less than its carrying amount, then the Company would not need to perform a quantitative impairment test for the reporting unit. If the Company cannot support such a conclusion or does not elect to perform the qualitative assessment, then the Company will perform the quantitative impairment test by comparing the fair value of the reporting unit with its carrying amount, including goodwill. If the fair value of the reporting unit exceeds its carrying amount, no impairment charge is recognized. If the fair value of the reporting unit is less than its carrying amount, an impairment charge will be recognized for the amount by which the reporting units carrying amount exceeds its fair value. A significant amount of judgment is required in performing goodwill impairment tests including estimating the fair value of a reporting unit. Management evaluated and concluded there were no indications of impairment of goodwill in Fiscal 2023 or 2022.\nIntangible Assets\nIntangible assets include trademarks and customer relationships, which were acquired as part of the acquisitions of IPS in Fiscal 2018 and Kablooe in Fiscal 2020 and are amortized over their estimated useful lives, which are periodically evaluated for reasonableness.\nFORWARD INDUSTRIES, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nOur intangible assets are reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable. In assessing the recoverability of our intangible assets, we must make estimates and assumptions regarding future cash flows and other factors to determine the fair value of the respective assets. These estimates and assumptions could have a significant impact on whether an impairment charge is recognized and the magnitude of any such charge. Fair value estimates are made at a specific point in time, based on relevant information. These estimates are subjective in nature and involve uncertainties and matters of significant judgments and therefore cannot be determined with precision. Changes in assumptions could significantly affect the estimates. If these estimates or material related assumptions change in the future, we may be required to record impairment charges related to our intangible assets. Management evaluated and concluded that there were no indications of impairments of intangible assets at September 30, 2023 or 2022.\nCash\nThe Company maintains cash deposits and a money market account in banks with financial institutions in the United States (that at times may exceed federally insured limits of $250,000 per financial institution) and Switzerland. At September 30, 2023 and 2022, there were deposits totaling $2,565,000 (which includes $358,000 in a foreign bank) and $2,037,000 (which includes $467,000 in a foreign bank), respectively, held in excess of federally insured limits. Historically, we have not experienced any losses due to such cash concentrations.\nAccounts Receivable\nAccounts receivable consist of unsecured trade accounts with customers in amounts that have been invoiced ($6,949,000 and $7,861,000 at September 30, 2023 and 2022, respectively) and contract assets as described further below under the heading Revenue Recognition. The Company maintains an allowance for doubtful accounts and customer allowances (for trade, promotional or other discounts), which is recorded as a reduction to accounts receivable on the consolidated balance sheets. Collectability of accounts receivable is estimated by evaluating the number of days accounts are outstanding, customer payment history, recent payment trends and perceived creditworthiness, adjusted as necessary based on specific customer situations. At September 30, 2023 and 2022, the Company had no allowances for the OEM distribution segment, allowances for doubtful accounts and customer allowances of $185,000 and $75,000, respectively, for the discontinued retail distribution segment and $771,000 and $852,000, respectively, for the design segment.\nThe Company has agreements with various retailers which contain different terms for trade discounts, promotional and other sales allowances. At September 30, 2023, 2022 and 2021, the Company recorded accounts receivable allowances of $139,000, $55,000 and $0, respectively, for the retail distribution segment.\nInventories\nInventories consist primarily of finished goods and are stated at the lower of cost (determined by the first-in, first-out method) or net realizable value. Based on managements estimates, an allowance is made to reduce excess, obsolete, or otherwise unsellable inventories to net realizable value. The allowance is established through charges to cost of sales in the Companys consolidated statements of operations. In determining the adequacy of the allowance, managements estimates are based upon several factors, including analyses of inventory levels, historical loss trends, sales history and projections of future sales demand. The Companys estimates of the allowance may change from time to time based on managements assessments, and such changes could be material.\nProperty and Equipment\nProperty and equipment consist of computer hardware and software, furniture, fixtures and equipment and are recorded at cost. Expenditures for major additions and improvements are capitalized, and minor replacements, maintenance, and repairs are charged to expense as incurred. When property and equipment are retired or otherwise disposed of, the cost and accumulated depreciation are removed from the accounts and any resulting gain or loss is included in the results of operations for the respective period. Depreciation is provided over the estimated useful lives of the related assets using the straight-line method. The estimated useful lives for all property and equipment ranges from three to five years.\nFORWARD INDUSTRIES, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nLeases\nLease assets and liabilities are recognized at lease commencement date based on the present value of lease payments over the lease term, using the Companys incremental borrowing rate commensurate with the lease term, since the Companys lessors do not provide an implicit rate, nor is one readily available. The Company has certain leases that may include an option to renew and when it is reasonably probable to exercise such option, the Company will include the renewal option terms in determining the lease asset and lease liability. Lease assets represent the Companys right to use an underlying asset for the lease term and lease liabilities represent the Companys obligation to make lease payments arising from the lease. Lease expense for lease payments is recognized on a straight-line basis over the lease term. Operating lease assets are shown as right of use assets and financing lease assets are a component of property and equipment on the consolidated balance sheets. The current and long-term portions of operating and financing lease liabilities are shown separately as such on the consolidated balance sheets.\nIncome Taxes\nThe Company recognizes future tax benefits and liabilities measured at enacted rates attributable to temporary differences between financial statement and income tax bases of assets and liabilities and to net tax operating loss carryforwards to the extent that realization of these benefits is more likely than not. At September 30, 2023, there was no change to our assessment that a full valuation allowance was required against all net deferred tax assets as it is not probable that such deferred tax assets will be realized. Accordingly, any deferred tax provision or benefit was offset by an equal and opposite change to the valuation allowance. Our income tax provision or benefit is generally not significant due to the existence of significant net operating loss carryforwards.\nRevenue Recognition\nOEM Distribution Segment\nThe OEM distribution segment recognizes revenue when: (i) finished goods are shipped to its customers (in general, these conditions occur at either point of shipment or point of destination, depending on the terms of sale and transfer of control); (ii) there are no other deliverables or performance obligations; and (iii) there are no further obligations to the customer after the title of the goods has transferred. If the Company receives consideration before achieving the criteria previously mentioned, it records a contract liability, which is classified as a component of deferred income in the accompanying consolidated balance sheets. The OEM distribution segment had no contract liabilities at September 30, 2023, 2022 or 2021.\nDiscontinued Retail Distribution Segment\nThe retail distribution segment sells products primarily through online websites operated by authorized third-party retailers. Revenue is recognized when control (as defined in Accounting Standards Codification (ASC) 606, Revenue from Contracts with Customers) of the related goods is transferred to the retailer, which generally occurs upon shipment to the end customer. Other than product delivery, the retail distribution segment does not typically have other deliverables or performance obligations associated with its products. Revenue is measured as the amount of consideration expected to be received in exchange for the products provided, net of allowances taken by retailers for product returns and any taxes collected from customers that will be remitted to governmental authorities. When the Company receives consideration before achieving the criteria previously mentioned, it records a contract liability, which is classified as a component of deferred income in the accompanying consolidated balance sheets. The retail distribution segment had no contract liabilities at September 30, 2023, 2022 or 2021. The results of operations of the retail segment are reported as discontinued operations for Fiscal 2023 and 2022. See Note 3.\nDesign Segment\nThe Company applies the cost to cost and right to invoice methods of revenue recognition to the contracts with customers in the design segment. The design segment typically engages in two types of contracts: (i) time and material and (ii) fixed price. The Company recognizes revenue over time on its time and material contracts utilizing a right to invoice method. Revenues from fixed price contracts that require performance of services that are not related to the production of tangible assets are recognized by using cost inputs to measure progress toward the completion of its performance obligations, or the cost to cost method. Revenues from fixed price contracts that contain specific deliverables are recognized when the performance obligation has been satisfied or the transfer of goods to the customer has been completed and accepted.\nFORWARD INDUSTRIES, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nRecognized revenues that will not be billed until a later date, or contract assets, are recorded as an asset and classified as a component of accounts receivable in the accompanying consolidated balance sheets. The design segment had contract assets of $976,000, $609,000 and $693,000 at September 30, 2023, 2022 and 2021, respectively. Contracts where collections to date have exceeded recognized revenues, or contract liabilities, are recorded as a liability and classified as a component of deferred income in the accompanying consolidated balance sheets. The design segment had contract liabilities of $297,000, $439,000 and $188,000 at September 30, 2023, 2022 and 2021, respectively.\nShipping and Handling Fees\nThe Company includes shipping and handling fees billed to customers in net revenues and the related transportation costs in cost of sales.\nForeign Currency Transactions\nThe Companys functional currency is the U.S. dollar. Foreign currency transactions may generate receivables or payables that are fixed in terms of the amount of foreign currency that will be received or paid. Fluctuations in exchange rates between such foreign currency and the functional currency increase or decrease the expected amount of functional currency cash flows upon settlement of the transaction. These increases or decreases in expected functional currency cash flows are foreign currency transaction gains or losses that are included in other income or expense in the accompanying consolidated statements of operations. The approximate net gains (losses) from foreign currency transactions were $2,000 and ($13,000) in Fiscal 2023 and 2022, respectively.\nFair Value Measurements\nWe perform fair value measurements in accordance with the guidance provided by ASC 820, Fair Value Measurement. ASC 820 defines fair value as the price that would be received from selling an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. When determining the fair value measurements for assets and liabilities required to be recorded at their fair values, we consider the principal or most advantageous market in which we would transact and consider assumptions that market participants would use when pricing the assets or liabilities, such as inherent risk, transfer restrictions, and risk of nonperformance.\nASC 820 establishes a fair value hierarchy that requires an entity to maximize the use of observable inputs and minimize the use of unobservable inputs when measuring fair value. An asset's or liability's categorization within the fair value hierarchy is based upon the lowest level of input that is significant to the fair value measurement. ASC 820 establishes three levels of inputs that may be used to measure fair value:\n· Level 1: quoted prices in active markets for identical assets or liabilities;\n· Level 2: inputs other than Level 1 that are observable, either directly or indirectly, such as quoted prices in active markets for similar assets or liabilities, quoted prices for identical or similar assets or liabilities in markets that are not active, or other inputs that are observable or can be corroborated by observable market data for substantially the full term of the assets or liabilities; or\n· Level 3: unobservable inputs that are supported by little or no market activity and that are significant to the fair values of the assets or liabilities.\nShare-Based Compensation Expense\nThe Company estimates the fair value of employee and non-employee director share-based compensation on the date of grant using the Black-Scholes option pricing model, which includes variables such as the expected volatility of the Companys share price, the exercise behavior of its grantees, interest rates, and dividend yields. These variables are projected based on the Companys historical data, experience, and other factors. The fair value of employee and non-employee director share-based compensation is recognized in the consolidated statements of operations over the related service or vesting period of each grant. In the case of awards with multiple vesting periods, the Company has elected to use the graded vesting attribution method, which recognizes compensation cost on a straight-line basis over each separately vesting portion of the award as if the award was, in substance, multiple awards (see Note 9).\nFORWARD INDUSTRIES, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nRecent Accounting Pronouncements\nIn November 2019, the FASB issued ASU 2019-11, Codification Improvements to Topic 326, Financial Instruments - Credit Losses. ASU 2019-11 is an accounting pronouncement that provides clarity to and amends earlier guidance on this topic and would be effective concurrently with the adoption of such earlier guidance. This pronouncement is effective for the Company for fiscal years beginning after December 15, 2022, and interim periods within those fiscal years and is not expected to have a material impact on our consolidated financial statements.\nNOTE 3 DISCONTINUED OPERATIONS AND ASSETS HELD FOR SALE\nConsidering the recurring losses incurred by the retail segment, in July 2023, the Company decided to cease operations of its retail distribution segment (Retail Exit). The primary assets of the retail segment are inventory and accounts receivable. The Company expects to sell, liquidate, or otherwise dispose of remaining retail inventory by June 30, 2024, and to collect remaining retail accounts receivable by the end of Fiscal 2024. After this time, we expect to have no further significant continuing involvement with the retail distribution segment. The Retail Exit is considered a strategic shift that will have a significant impact on the Companys operations and financial results. The inventory of the retail segment meets the criteria to be considered held-for-sale in accordance with ASC 205-20, Discontinued Operations. Accordingly, the retail inventory is classified on our consolidated balance sheet as discontinued assets held for sale at September 30, 2023 and 2022, and the results of operations for the retail segment have been classified as Discontinued Operations on the consolidated statements of operations for the years ended September 30, 2023 and 2022. The consolidated balance sheets and results of operations for comparable prior periods have been reclassified to conform to this presentation in accordance with the accounting guidance.\nConsistent with the Company's plan for the Retail Exit, the Company re-evaluated its retail inventory and recorded an increase in the reserve of approximately $685,000 relating to discounts deemed necessary to sell the remaining retail inventory. Additionally, on September 30, 2023, the Company had unfulfilled purchase orders for retail products totaling approximately $1,021,000. As of September 30, 2023, the Company made prepayments on these orders of approximately $298,000. Due to the Retail Exit, the Company and Forward China agreed to cancel the full amount of these orders. The unpaid balance on the purchase orders of approximately $723,000, is accrued for as of September 30, 2023 and included in Due to Forward China on the consolidated balance sheets. Collectively, the additional inventory reserve, write off of the prepayments and accrual on the unfulfilled purchase orders represent the loss on classification of discontinued assets held for sale shown in the table below. The total amount related to the retail segment included in Due to Forward China on the consolidated balance sheets was approximately $1,002,000 (which includes the $723,000 due on canceled purchase orders) at September 30, 2023 and $238,000 at September 30, 2022.\nThe following table presents the major classes of the Net loss from discontinued operations, net of tax in our consolidated statements of operations.\nSchedule of discontinued operations\nFor the Fiscal Years Ended September 30,\nRevenues, net $ 4,332,890 $ 4,130,427\nCost of sales 5,285,495 4,562,106\nGross profit (952,605 ) (431,679 )\nSales and marketing expenses 1,210,563 1,376,729\nGeneral and administrative expenses 26,762 19,736\nLoss from operations (2,189,930 ) (1,828,144 )\nLoss on classification as held for sale 1,705,385 -\nNet loss from discontinued operations before income taxes (3,895,315 ) (1,828,144 )\nProvision for income taxes - -\nLoss from discontinued operations $ (3,895,315 ) $ (1,828,144 )\nAt September 30, 2023 and 2022, discontinued assets held for sale of $508,000 and $3,150,000, respectively, consist of the net inventory of the retail segment. These numbers include an allowance of $1,464,000 and $535,000, respectively to reduce excess or otherwise unsellable inventory to its estimated net realizable value.\nThere was no depreciation, amortization, investing or financing cash flow activities, or other significant noncash operating cash flow activities for the retail segment in Fiscal 2023 or 2022.\nFORWARD INDUSTRIES, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 4 INTANGIBLE ASSETS AND GOODWILL\nIntangible Assets\nThe Companys intangible assets consist of the following:\nSchedule of intangible assets\nSeptember 30, 2023 September 30, 2022\nTrademarks Customer Relationships Total Intangible Assets Trademarks Customer Relationships Total Intangible Assets\nGross carrying amount $ 585,000 $ 1,390,000 $ 1,975,000 $ 585,000 $ 1,390,000 $ 1,975,000\nLess accumulated amortization (203,000 ) (879,000 ) (1,082,000 ) (164,000 ) (705,000 ) (869,000 )\nNet carrying amount $ 382,000 $ 511,000 $ 893,000 $ 421,000 $ 685,000 $ 1,106,000\nThe Companys intangible assets resulted from the acquisitions of Kablooe and IPS in Fiscal 2020 and Fiscal 2018, respectively, and relate to the design segment of our business. Intangible assets are amortized over their expected useful lives of 15 years for the trademarks and eight years for the customer relationships. During Fiscal 2023 and Fiscal 2022, the Company recorded amortization expense related to intangible assets of $213,000, which is included in general and administrative expenses in the Companys consolidated statements of operations.\nAt September 30, 2023, estimated amortization expense for the Companys intangible assets for each of the next five years and thereafter is as follows:\nSchedule of estimated amortization expense\nFiscal 2024 $ 213,000\nFiscal 2025 213,000\nFiscal 2026 121,000\nFiscal 2027 81,000\nFiscal 2028 78,000\nThereafter 187,000\nTotal $ 893,000\nGoodwill\nGoodwill represents the future economic benefits of assets acquired in a business combination that are not individually identified or separately recognized. The Companys goodwill resulted from the acquisitions of Kablooe and IPS in Fiscal 2020 and Fiscal 2018, respectively and are held under the design segment of our business. The goodwill associated with the IPS acquisition is not deductible for tax purposes, but the goodwill associated with the Kablooe acquisition is deductible for tax purposes.\nNOTE 5 PROPERTY AND EQUIPMENT\nProperty and equipment and related accumulated depreciation and amortization are summarized in the table below:\nSchedule of property and equipment\nSeptember 30,\nComputer hardware and software $ 502,000 $ 473,000\nFurniture and fixtures 67,000 67,000\nEquipment 171,000 74,000\nProperty and equipment, cost 740,000 614,000\nLess accumulated depreciation and amortization (466,000 ) (373,000 )\nProperty and equipment, net $ 274,000 $ 241,000\nDepreciation expense was $103,000 and $96,000 for Fiscal 2023 and Fiscal 2022, respectively.\nFORWARD INDUSTRIES, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 6 FAIR VALUE MEASUREMENTS\nThe earnout consideration of $0 and $70,000 at September 30, 2023 and 2022, respectively, represents the fair value of the contingent earnout consideration related to the acquisition of Kablooe, which provides annual contingent earnout payments based on results of operations through August 2025. The current and non-current portions of this liability are shown in the corresponding categories on the consolidated balance sheets in each period presented. The fair value of the earnout liability is measured on a recurring basis at each reporting date using a Black-Scholes valuation model with the following inputs and assumptions, which are categorized within Level 3 of the fair value hierarchy:\nSchedule of fair value assumptions\nSeptember 30,\nVolatility 40%\n40%\nRisk-free interest rate 4.9%-5.3%\n4.1%\nExpected term in years 0.4 - 1.4\n0.4 - 2.4\nDividend yield -\n-\nIn Fiscal 2023, the Company reduced this liability from $70,000 to $0 based on changes in the expected likelihood of Kablooe reaching the specified earnings targets. In Fiscal 2022, there were no changes to the total fair value of this earnout liability.\nNOTE 7 ACCRUED EXPENSES AND OTHER CURRENT LIABILITIES\nAccrued expenses and other current liabilities at September 30, 2023 and 2022 are as follows:\nSchedule of accrued expenses and other current liabilities\nSeptember 30,\nAccrued commissions/bonuses $ 872,000 $ 722,000\nPaid time off 285,000 228,000\nOther 201,000 204,000\nTotal $ 1,358,000 $ 1,154,000\nNOTE 8 SHAREHOLDERS EQUITY\nBlank Check Preferred Stock\nThe Company is authorized to issue up to 4,000,000 shares of blank check preferred stock. The Board has the authority and discretion, without shareholder approval, to issue preferred stock in one or more series for any consideration it deems appropriate, and to fix the relative rights and preferences thereof including their redemption, dividend and conversion rights. Of these shares, 100,000 shares have been authorized as the Series A Participating Preferred Stock. There were no shares of preferred stock issued or outstanding at September 30, 2023 or 2022.\nWarrants\nAt September 30, 2023, the Company had 75,000 warrants outstanding and exercisable, which have an exercise price of $1.75 per share and an expiration date 90 days after a registration statement registering common stock (other than pursuant to an employee benefit plan) is declared effective by the Securities and Exchange Commission. During Fiscal 2023, 76,000 of the warrants outstanding at September 30, 2022 expired.\nNasdaq\nOn July 31, 2023, the Company was notified by Nasdaq that it was not compliant with its closing bid price requirement because the closing bid price of our common stock was below $1.00 per share for 30 consecutive trading days. The Company has until January 29, 2024 (the Deadline Date) to become compliant. We have since remained non-compliant with the closing bid price requirement as our stock price has remained below $1.00 since we received the notice. We are currently assessing all options to regain compliance.\nFORWARD INDUSTRIES, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 9 SHARE-BASED COMPENSATION\n2021 Equity Incentive Plan\nIn February 2021, shareholders of the Company approved the 2021 Equity Incentive Plan (the 2021 Plan), which is administered by the Compensation Committee of the Board of Directors and authorizes 1,291,000 shares of common stock for grants of various types of equity awards to officers, directors, employees and consultants. Upon approval of the 2021 Plan, no additional awards were granted under the 2011 Long Term Incentive Plan (the 2011 Plan), which expired according to its terms in March 2021. Shares authorized under the 2021 Plan include 1,000,000 new shares and 291,000 shares that remained available under the 2011 Plan. Awards which are forfeited or expire are eligible for regrant under the 2021 Plan. The exercise prices of stock options granted may not be less than the fair market value of the common stock as quoted on the Nasdaq stock market on the grant date and the expiration date of option awards may not exceed 10 years. At September 30, 2023, there were 889,000 shares of common stock available for grants under the 2021 Plan.\nStock Options\nThe fair value of option awards is estimated on the date of grant using the Black-Scholes option pricing model that uses the assumptions in the following table. The expected term represents the period over which the stock option awards are expected to be outstanding. The Company utilizes the simplified method to develop an estimate of the expected term of plain vanilla option grants. The expected volatility used is based on the historical price of the Companys stock over the most recent period commensurate with the expected term of the award. The risk-free interest rate used is based on the implied yield of U.S. Treasury zero-coupon issues with a remaining term equivalent to the awards expected term. The Company historically has not paid any dividends on its common stock and had no intention to do so on the date the share-based awards were granted. The Company accounts for forfeitures in the period they occur.\nIn applying the Black-Scholes option pricing model to options granted, the Company used the following assumptions:\nSchedule of assumptions used for options\nFiscal 2023\nFiscal 2022\nExpected term (years)\n2.75\n2.5 - 5.0\nExpected volatility\n69.0%\n68.8% - 78.6%\nRisk free interest rate\n4.31%\n0.4% - 3.1%\nExpected dividends\n-\n-\nIn Fiscal 2023, the Company granted options to three of its non-employee directors to purchase an aggregate of 124,740 shares of its common stock at an exercise price of $1.03 per share. The options vest six months from the date of grant and expire five years from the date of grant. The options have a weighted average grant-date fair value of $0.48 per share and an aggregate grant-date fair value of $60,000, which will be recognized ratably over the vesting period.\nOn October 1, 2023, the Company granted options to three of its non-employee directors to purchase an aggregate of 332,409 shares of its common stock at an exercise price of $0.76 per share. The options vest one year from the date of grant and expire five years from the date of the grant. The options have a weighted average grant-date fair value of $0.36 per share and an aggregate grant-date fair value of $120,000, which will be recognized ratably over the vesting period.\nIn Fiscal 2022, the Company made the following option grants which collectively had a weighted-average grant date fair value of $0.82 per share:\n· Options to current and former non-employee directors to purchase an aggregate of 297,000 shares of its common stock. The options were granted throughout Fiscal 2022, expire five to ten years from the date of grant, 145,000 vested immediately, 129,000 vest one year from the date of grant and 23,000 were forfeited prior to vesting. These options had an aggregate grant date fair value of $245,000, which is being recognized ratably over the vesting period.\n· Options to an employee to purchase 27,000 shares of its common stock. These options were granted in January and July of 2022, vest ratably over two years, expire five years from the date of grant and had an aggregate grant date fair value of $20,000, which is being recognized ratably over the vesting period.\nFORWARD INDUSTRIES, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nThe Company recognized compensation expense for stock option awards of $86,000 and $201,000 during Fiscal 2023 and Fiscal 2022, respectively, which was recorded as a component of general and administrative expenses in its consolidated statements of operations.\nNo options were exercised during Fiscal 2023 and Fiscal 2022.\nAt September 30, 2023, there was $22,000 of unrecognized compensation cost related to nonvested stock option awards that is expected to be recognized over a weighted average period of 0.2 years.\nThe following table summarizes stock option activity during Fiscal 2023:\nSchedule of stock option activity\nWeighted Weighted\nAverage Average Aggregate\nNumber of Exercise Remaining Intrinsic\nOptions Price Life (Yrs.) Value\nOutstanding at September 30, 2022 1,085,000 $ 1.48\nGranted 125,000 $ 1.03\nExpired (287,000 ) $ 1.46\nOutstanding at September 30, 2023 923,000 $ 1.43 2.6 $ -\nExercisable at September 30, 2023 789,000 $ 1.49 2.3 $ -\nOptions outstanding at September 30, 2023 have an exercise price between $1.03 and $2.39 per share.\nNOTE 10 INCOME TAXES\nThe following table summarizes the Companys consolidated provision from continuing operations for U.S. federal, state and foreign taxes on income:\nSchedule of income tax provision\nFiscal 2023 Fiscal 2022\nCurrent:\nFederal $ - $ -\nState 20,000 3,000\nForeign - -\nDeferred:\nFederal 112,000 220,000\nState (244,000 ) 32,000\nForeign (39,000 ) (23,000 )\nDeferred income tax expense (benefit) (151,000 ) 232,000\nChange in valuation allowance 171,000 (229,000 )\nIncome tax provision $ 20,000 $ 3,000\nThe deferred tax provision/(benefit) is the change in the deferred tax assets and liabilities representing the tax consequences of changes in the amounts of temporary differences, net operating loss carryforwards and changes in tax rates during the fiscal year.\nFORWARD INDUSTRIES, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nThe Companys deferred tax assets and liabilities are comprised of the following:\nSchedule of deferred tax assets and liabilities\nSeptember 30,\nDeferred tax assets\nNet operating losses $ 2,976,000 $ 2,006,000\nShare-based compensation 242,000 220,000\nAMT & other tax credits 5,000 5,000\nExcess tax over book basis in inventory 18,000 101,000\nReserves and other allowances 893,000 649,000\nDeferred rent - 8,000\nLease liability 794,000 -\nAccrued compensation 101,000 70,000\nAccrued related party interest 5,000 5,000\nCharitable contributions 1,000 -\nInterest expense limitation 46,000 48,000\nTotal deferred tax assets 5,081,000 3,112,000\nDeferred tax liabilities\nDepreciation (9,000 ) (12,000 )\nPrepaid expenses (88,000 ) (96,000 )\nIntangible assets (145,000 ) (178,000 )\nROU Asset (737,000 ) -\nTotal deferred tax liabilities (979,000 ) (286,000 )\nValuation allowance (4,102,000 ) (2,826,000 )\nNet deferred tax assets $ - $ -\nThe Company recorded a provision for income taxes which includes net expense of $20,000 and $3,000 in Fiscal 2023 and 2022, respectively, primarily for state income tax expenses in states where net operating loss carryforwards (NOLs) were not available.\nAt September 30, 2023, the Company had available NOLs for U.S. federal income tax purposes of $9,350,000 and NOLs for state income tax purposes of $5,113,000. NOLs generated prior to 2018 expire beginning in 2031 while NOLs generated after 2018 have an indefinite carryforward period. The NOLs result in a deferred tax asset of $2,283,000 with respect to U.S. federal income taxes and $371,000 for state income taxes. In addition, at September 30, 2023, the Company had available NOLs for foreign income tax purposes of $1,839,000, resulting in a deferred tax asset of $322,000, expiring through 2028. Total net deferred tax assets, before valuation allowance, were $4,102,000 and $2,826,000 at September 30, 2023 and 2022, respectively. Undistributed earnings of the Company's foreign subsidiaries are considered permanently reinvested; therefore, in accordance with U.S. GAAP, no provision for U.S. federal or state income taxes would result. In Fiscal 2023, Forward Switzerland had a net loss for tax purposes of $113,000 and Forward UK had a net loss for tax purposes of $158,000.\nAt September 30, 2023, as part of its periodic evaluation of the necessity to maintain a valuation allowance against its deferred tax assets, and after consideration of all factors, including, among others, projections of future taxable income, current year NOL utilization and the extent of the Company's cumulative losses in recent years, the Company determined that, on a more likely than not basis, it would not be able to use remaining deferred tax assets, except with respect to the U.S. federal income taxes in the event the Company elects to effect repatriation of certain foreign source income of Forward Switzerland, which income is currently considered to be permanently reinvested and for which no U.S. tax liability has been accrued. Accordingly, the Company has determined to maintain a full valuation allowance against its net deferred tax assets. At September 30, 2023 and 2022, the valuation allowance was $4,102,000 and $2,826,000, respectively. The change in the valuation allowance of $1,275,000 is comprised of $171,000 from continuing operations and $1,104,000 from discontinued operations. In the future, the utilization of the Company's NOLs may be subject to certain change of control limitations. If the Company determines that it will be able to use some or all of its deferred tax assets in a future reporting period, the adjustment to reduce or eliminate the valuation allowance would reduce its income tax expense and increase after-tax income.\nFORWARD INDUSTRIES, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nThe significant elements contributing to the difference between the U.S. federal statutory tax rate and the Companys effective tax rate are as follows:\nSchedule of reconciliation of effective tax rate\nFiscal 2023 Fiscal 2022\nU.S. federal statutory rate 21.0% 21.0%\nState tax rate, net of federal benefit 3.9% 5.8%\nForeign rate differential (9.2% ) (5.3% )\nTax return to provision adjustments (94.6% ) 4.1%\nEffect of state tax rate change (8.5% ) 7.0%\nChange in valuation allowance 95.7% (34.1% )\nPermanent differences 2.9% 2.0%\nEffective tax rate 11.2% 0.5%\nAt September 30, 2023 and 2022, the Company had not accrued any interest or penalties related to uncertain tax positions. It is the Company's policy to recognize interest and/or penalties, if any, related to income tax matters in income tax expense in the consolidated statements of operations. For the periods presented in the accompanying consolidated statements of operations, no material income tax related interest or penalties were assessed or recorded. All fiscal years prior to the fiscal year ended September 30, 2020, are closed to federal and state examination.\nNOTE 11 EARNINGS PER SHARE\nBasic earnings per share data for each period presented is computed using the weighted average number of shares of common stock outstanding during each such period. Diluted earnings per share data is computed using the weighted average number of common and dilutive common equivalent shares outstanding during each period. Dilutive common equivalent shares consist of shares that would be issued upon the exercise of stock options and warrants, computed using the treasury stock method. A reconciliation of basic and diluted earnings/loss per share is as follows:\nSchedule of reconciliation of basic and diluted earnings/loss per share\nFor the Fiscal Years Ended\nSeptember 30,\nNumerator:\nIncome from continuing operations $ 179,000 $ 450,000\nLoss from discontinued operations, net of tax (3,895,000 ) (1,828,000 )\nNet loss $ (3,716,000 ) $ (1,378,000 )\nDenominator:\nWeighted average common shares outstanding 10,061,000 10,061,000\nDilutive common share equivalents - 140,000\nWeighted average dilutive shares outstanding 10,061,000 10,201,000\nBasic earnings/(loss) per share :\nBasic earnings per share from continuing operations $ 0.02 $ 0.04\nBasic loss per share from discontinued operations (0.39 ) (0.18 )\nBasic loss per share $ (0.37 ) $ (0.14 )\nDiluted earnings/(loss) per share:\nDiluted earnings per share from continuing operations $ 0.02 $ 0.04\nDiluted loss per share from discontinued operations (0.39 ) (0.18 )\nDiluted loss per share $ (0.37 ) $ (0.14 )\nFORWARD INDUSTRIES, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nThe following securities were excluded from the calculation of diluted earnings per share in Fiscal 2023 and 2022 because their inclusion would have been anti-dilutive:\nSchedule of anti-dilutive\nFor the Fiscal Years Ended\nSeptember 30,\nOptions 923,000 277,000\nWarrants 75,000 151,000\nTotal potentially dilutive shares 998,000 428,000\nNOTE 12 COMMITMENTS AND CONTINGENCIES\nGuarantee Obligation\nIn February 2010, Forward Switzerland and its European logistics provider (freight forwarding and customs agent) entered into a Representation Agreement (the Representation Agreement) whereby, among other things, the European logistics provider agreed to act as Forward Switzerland's fiscal representative in The Netherlands for the purpose of providing services in connection with any value added tax matters. As part of this agreement, Forward Switzerland agreed to provide an undertaking (in the form of a bank letter of guarantee) to the logistics provider with respect to any value added tax liability arising in The Netherlands that the logistics provider is required to pay to Dutch tax authorities on its behalf.\nIn February 2010, Forward Switzerland entered into a guarantee agreement with a Swiss bank relating to the repayment of any amount up to €75,000 (equal to approximately $79,000 at September 30, 2023) paid by such bank to the logistics provider in order to satisfy such undertaking pursuant to the bank letter of guarantee. Forward Switzerland would be required to perform under the guarantee agreement only in the event that (i) a value added tax liability is imposed on the Company's revenues in The Netherlands; (ii) the logistics provider asserts that it has been called upon in its capacity as surety by the Dutch Receiver of Taxes to pay such taxes; (iii) Forward Switzerland or the Company on its behalf fails or refuses to remit the amount of value added tax due to the logistics provider upon its demand; and (iv) the logistics provider makes a drawing under the bank letter of guarantee. Under the Representation Agreement, Forward Switzerland agreed that the letter of guarantee would remain available for drawing for three years following the date that its relationship terminates with the logistics provider to satisfy any value added tax liability arising prior to expiration of the Representation Agreement but asserted by The Netherlands after expiration.\nThe initial term of the bank letter of guarantee expired February 28, 2011, but it renews automatically for one-year periods on February 28 of each subsequent year unless Forward Switzerland provides the Swiss bank with written notice of termination at least 60 days prior to the renewal date. It is the intent of Forward Switzerland and the logistics provider that the bank letter of guarantee amount be adjusted annually. In consideration of the issuance of the letter of guarantee, Forward Switzerland has granted the Swiss bank a security interest in all of its assets on deposit with, held by, or credited to Forward Switzerlands accounts with, the Swiss bank (approximately $358,000 at September 30, 2023). At September 30, 2023, the Company had not incurred a liability in connection with this guarantee.\nLegal Proceedings\nFrom time to time, the Company may become a party to legal actions or proceedings in the ordinary course of its business. At September 30, 2023, there were no such actions or proceedings, either individually or in the aggregate, that, if decided adversely to its interests, the Company believes would be material to its business.\nFORWARD INDUSTRIES, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 13 LEASES\nThe Companys operating leases are primarily for corporate, engineering, and administrative office space. Total operating lease expense in Fiscal 2023 was $621,000, of which $3,000 was recorded in sales and marketing expenses and $618,000 was recorded in general and administrative expenses on the consolidated statements of operations. Total operating lease expense in Fiscal 2022 was $631,000, of which $57,000 was recorded in sales and marketing expenses and $574,000 was recorded in general and administrative expenses on the consolidated statements of operations. Cash paid for amounts included in operating lease liabilities in Fiscal 2023 and Fiscal 2022, which have been included in cash flows from operating activities, was $575,000 and $601,000, respectively.\nAt September 30, 2023, the Companys operating leases had a weighted average remaining lease term of 7.6 years and a weighted average discount rate of 5.7%.\nFuture minimum payments under non-cancellable operating leases are as follows:\nSchedule of future minimum payments under operating leases\nFiscal 2024 $ 592,000\nFiscal 2025 556,000\nFiscal 2026 510,000\nFiscal 2027 419,000\nFiscal 2028 428,000\nThereafter 1,551,000\nTotal future minimum lease payments 4,056,000\nLess imputed interest (806,000 )\nPresent value of lease liabilities 3,250,000\nLess current portion of lease liabilities (416,000 )\nLong-term portion of lease liabilities $ 2,834,000\nNOTE 14 RELATED PARTY TRANSACTIONS\nBuying Agency and Supply Agreement\nThe Company has a Buying Agency and Supply Agreement (the Supply Agreement) with Forward China. The Supply Agreement provides that, upon the terms and subject to the conditions set forth therein, Forward China will act as the Companys exclusive buying agent and supplier of Products (as defined in the Supply Agreement) in the Asia-Pacific region. The Company purchases products at Forward Chinas cost and through March 2023 paid Forward China a monthly service fee equal to the sum of (i) $100,000, and (ii) 4% of Adjusted Gross Profit, which is defined as the selling price less the cost from Forward China. Considering the loss of a significant OEM distribution customer (see Note 16), effective April 1, 2023, the Company and Forward China agreed to reduce the fixed portion of the sourcing fee from $100,000 to $83,333 per month for the remaining term of the Supply Agreement, which expired in October 2023, resulting in cash savings of $100,000 in Fiscal 2023. Effective October 2023, the Company and Forward China entered into a new sourcing agreement under which the fixed portion of the sourcing fee was further reduced to $65,833 per month. Other terms in the agreement are substantially the same as the prior agreement. Due to the Retail Exit and decline in the OEM distribution segment business, the new sourcing agreement expires October 31, 2024.\nTerence Wise, Chief Executive Officer and Chairman of the Company, is the owner of Forward China. In addition, Jenny P. Yu, a Managing Director of Forward China, beneficially owns more than 5% of the Companys common stock. The Company recorded service fees to Forward China of $1,266,000 and $1,398,000 during Fiscal 2023 and Fiscal 2022, respectively, which are included as a component of cost of sales upon sales of the related products. The Company had purchases from Forward China of $12,799,000 and $18,055,000 during Fiscal 2023 and Fiscal 2022, respectively.\nThe Company has a separate agreement with Forward China to address the potential impact of customers sourcing directly from Forward China. In the event a customer bypasses the services of the Company and does business directly with Forward China, Forward China will pay a commission of 50% of the net revenue, less direct costs, generated from the products or services sold. No commissions were recognized in Fiscal 2023 and Fiscal 2022.\nFORWARD INDUSTRIES, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nIn connection with the new sourcing agreement and in order to preserve the Companys future liquidity, in November 2023, the Company and Forward China entered into an agreement whereby Forward China agreed to limit the amount of outstanding payables it would seek to collect from the Company to $500,000 in any 12-month period, which the Company agreed to pay within 30 days of any such request. This agreement pertains only to payables that were outstanding at October 30, 2023 of approximately $7,365,000. Purchases from Forward China made after October 30, 2023 are not covered by this agreement and are expected to be paid according to normal payment terms.\nThe Company made prepayments to Forward China for inventory purchases of $20,000 at September 30, 2022, which are included in prepaid expenses and other current assets on the consolidated balance sheets. As of September 30, 2023, there were no such prepayments. During 2023, as a result of the Retail Exit, the Company recognized a loss of approximately $1,021,000 relating to the termination of unfulfilled purchase orders for retail products (see Note 3).\nPromissory Note\nOn January 18, 2018, the Company issued a $1,600,000 unsecured promissory note payable to Forward China to fund the acquisition of IPS. The promissory note bears interest at a rate of 8% per annum and had an original maturity date of January 18, 2019. Monthly interest payments commenced on February 18, 2018, with the principal due at maturity. The Company incurred and paid interest associated with this note of $104,000 and $122,000 in Fiscal 2023 and Fiscal 2022, respectively. The maturity date of this note was extended to December 31, 2024. The maturity date of the note has been extended on several occasions to assist the Company with liquidity. The Company made principal payments of $300,000 and $200,000 on this note during Fiscal 2023 and Fiscal 2022, respectively, and this note has a remaining balance of $1,100,000 at September 30, 2023.\nOther Related Party Activity\nIn October 2020, the Company began selling smart-enabled furniture, which is sourced by Forward China and sold in the U.S. under the Koble brand name. The Koble brand is owned by The Justwise Group Ltd. (Justwise) a company owned by Terence Wise, Chief Executive Officer and Chairman of the Company. The Company recognized revenues from the sale of Koble products of $2,058,000 and $1,741,000 in Fiscal 2023 and Fiscal 2022, respectively. Due to the Retail Exit, these revenues are included in the loss from discontinued operations for Fiscal 2023 and 2022.\nThe Company entered into an agreement with Justwise effective March 1, 2022, under which (i) Justwise will perform design and marketing services related to the Koble products sold by the Company and (ii) the Company was granted a license to sell Koble products. In exchange for such services, the Company will pay Justwise $10,000 per month plus 1% of the cost of Koble products purchased from Forward China. This agreement was effective until August 31, 2023. Effective September 1, 2023, the Company entered into an agreement to extend this agreement on a month-to-month basis and to expand its scope to include inventory management assistance. The Company incurred costs of $127,000 under this agreement for Fiscal 2023, of which $120,000 was included in selling and marketing expenses and $7,000 is included as a component of cost of sales upon sales of the related products. The Company incurred costs of $90,000 under this agreement for Fiscal 2022, of which $84,000 was included in selling and marketing expenses and $6,000 is included as a component of cost of sales upon sales of the related products. The Company had accounts payable to Justwise of $10,000 and $15,000 at September 30, 2023 and 2022, respectively.\nThe Company recorded revenue from a customer whose principal owner is an immediate family member of Jenny P. Yu, a shareholder of the Company and managing director of Forward China. The Company recognized revenues from this customer of $626,000 and $780,000 in Fiscal 2023 and Fiscal 2022, respectively. The Company had no accounts receivable from this customer at September 30, 2023 or 2022.\nA member of the Companys Audit, Governance and Compensation Committees of its Board of Directors is also a member of the Board of Directors of a company to whom the Companys OEM distribution segment sold products during Fiscal 2022. The Company recognized revenue of $0 and $13,000 from the sale of such products during Fiscal 2023 and 2022, respectively.\nNOTE 15 401(k) PLAN\nThe Company maintains a 401(k) benefit plan allowing eligible employees to make pre-tax and/or after-tax contributions of a portion of their salary in amounts subject to Internal Revenue Service limitations. The Company made immediately vested contributions of $426,000 during Fiscal 2023, of which $310,000 was recorded to cost of sales, $25,000 was recorded to sales and marketing expense and $91,000 was recorded to general and administrative expense on the consolidated statement of operations. The Company made immediately vested contributions of $379,000 during Fiscal 2022, of which $313,000 was recorded to cost of sales, $16,000 was recorded to sales and marketing expense and $50,000 was recorded to general and administrative expense on the consolidated statement of operations.\nFORWARD INDUSTRIES, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nNOTE 16 SEGMENTS AND CONCENTRATIONS\nSegments\nAs a result of discontinuing the retail segment, see Note 3, the Company now has two reportable segments: OEM distribution and design. See Note 2 for more information on the composition and accounting policies of our reportable segments. The results of the retail segment were classified as discontinued operations as discussed in Note 3. Segment information presented herein excludes the results of the retail segment for all periods presented.\nOur chief operating decision maker (CODM) regularly reviews revenue and operating income for each segment to assess financial results and allocate resources. For our OEM distribution segments, we exclude general and administrative and general corporate expenses from their measure of profitability as these expenses are not allocated to the segments and therefore not included in the measure of profitability used by the CODM. For the design segment, general and administrative expenses directly attributable to that segment are included in its measure of profitability as these expenses are included in the measure of its profitability reviewed by the CODM. We do not include intercompany activity in our segment results shown below to be consistent with the information that is presented to the CODM. Segment assets consist of accounts receivable and inventory, which are regularly reviewed by the CODM, as well as goodwill and intangible assets resulting from design segment acquisitions.\nInformation by segment and related reconciliations are shown in tables below:\nSchedule of segment and related reconciliations\nRevenues\nFiscal 2023 Fiscal 2022\nOEM distribution $ 14,002,000 $ 18,036,000\nDesign 22,686,000 20,171,000\nTotal segment revenues $ 36,688,000 $ 38,207,000\nOperating Income/(Loss)\nFiscal 2023 Fiscal 2022\nOEM distribution $ 440,000 $ 905,000\nDesign 2,182,000 2,148,000\nTotal segment operating income 2,622,000 3,053,000\nGeneral corporate expenses (2,462,000 ) (2,465,000 )\nOperating loss from continuing operations before income taxes 160,000 588,000\nOther expense/(income), net (19,000 ) 136,000\nIncome from continuing operations before income taxes $ 179,000 $ 452,000\nDepreciation and Amortization\nFiscal 2023 Fiscal 2022\nOEM distribution $ 4,000 $ 8,000\nDesign 312,000 301,000\nTotal $ 316,000 $ 309,000\nSchedule of condensed balance sheet\nSegment Assets\nSeptember 30,\nOEM distribution $ 2,478,000 $ 4,276,000\nDesign 6,721,000 6,116,000\nTotal segment assets 9,199,000 10,392,000\nGeneral corporate assets 6,924,000 6,731,000\nDiscontinued assets held for sale 508,000 3,150,000\nOther assets of discontinued retail segment 755,000 666,000\nTotal assets $ 17,386,000 $ 20,939,000\nFORWARD INDUSTRIES, INC. AND SUBSIDIARIES\nNOTES TO CONSOLIDATED FINANCIAL STATEMENTS\nGeographic Concentrations\nThe Companys long-lived assets consist of property and equipment and operating lease right-of-use assets, all of which are located in the United States. The following table sets forth our consolidated net revenues by country for Fiscal 2023 and Fiscal 2022:\nSchedule of consolidated net revenues\nRevenues\nFiscal 2023 Fiscal 2022\nUnited States $ 27,116,000 $ 25,538,000\nChina 3,443,000 5,325,000\nGermany 3,000,000 2,976,000\nPoland 1,275,000 2,643,000\nOther foreign countries 1,854,000 1,725,000\nTotal $ 36,688,000 $ 38,207,000\nCustomer Concentrations\nThe Company had certain customers in the OEM distribution segment whose individual percentage of the Companys consolidated revenues was 10% or greater. Revenue from one of these customers or their affiliates or contract manufacturers represented 11.2% of the Companys consolidated net revenues in Fiscal 2023 and revenues from two of these customers or their affiliates or contract manufacturers represented 25.5% of the Companys consolidated net revenues in Fiscal 2022.\nThe Company had one customer in the design segment whose individual percentage of the Companys consolidated revenues was 10% or greater. Revenues from this customer represented 27.9% and 11.8% of the Companys consolidated net revenues in Fiscal 2023 and 2022, respectively.\nThe Company had customers in the OEM distribution segment whose accounts receivable balances accounted for 10% or more of the Companys consolidated accounts receivable. One customer or its affiliate or contract manufacturer represented 12.0% of the Companys consolidated accounts receivable at September 30, 2023 and two customers or their affiliates or contract manufacturers represented 28.1% of the Companys consolidated accounts receivable at September 30, 2022.\nAt September 30, 2023, the Company had one customer in the design segment whose accounts receivable balances accounted for 10% or more of the Companys consolidated accounts receivable. Accounts receivable from this customer represented 31.1% of the Companys consolidated accounts receivable at September 30, 2023. There were no customers in the design segment whose individual percentage of the Companys consolidated accounts receivable was 10% or greater at September 30, 2022.\nIn March 2023, the Companys contract with one of its major diabetic customers in the OEM distribution segment expired. Due to increased pricing pressures, the Company did not extend its contract with this customer. Revenue from this customer represented approximately 13% of our consolidated net revenues for Fiscal 2022. The Company expects the loss of this customer to cause a significant decline in OEM distribution segment revenues in future periods.\nSupplier Concentration\nThe Companys OEM distribution segment procures substantially all its products through independent suppliers in China through Forward China (see Note 14). Depending on the product, Forward China may require several different suppliers to furnish component parts or pieces.\nNOTE 17 LINE OF CREDIT\nThe Company, specifically IPS, has a $1,300,000 revolving line of credit with a bank which was renewed in March 2023. The line of credit has a maturity date of May 31, 2024, is guaranteed by the Company and is secured by all of IPS assets. The interest rate on the line of credit is 0.75% above The Wall Street Journal prime rate. The effective interest rate was 9.25% and 7.0% at September 30, 2023 and 2022, respectively. In March 2021, the Company paid down the outstanding balance on the line of credit and $1,300,000 was available at September 30, 2023 and 2022. The Company is subject to certain debt-service ratio requirements which are measured annually. The Company was in compliance with such covenants at September 30, 2023."
}