{
    "cik": "48465",
    "company": "HORMEL FOODS CORP /DE/",
    "filing_type": "10-K",
    "filing_date": "2023-12-06",
    "period_of_report": "2023-10-29",
    "sic": "2011",
    "state_of_inc": "DE",
    "state_location": "MN",
    "fiscal_year_end": "1029",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/48465/0000048465-23-000083-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/48465/000004846523000083/hrl-20231029.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/48465/0000048465-23-000083.txt",
    "filename": "48465_10K_2023_0000048465-23-000083.htm",
    "content": "Item 1. BUSINESS\nGeneral Development of Business\nHormel Foods Corporation, a Delaware corporation (collectively, the \"Company\", \"we,\" \"us,\" and \"our\"), was founded by George A. Hormel in 1891 in Austin, Minnesota, as Geo. A. Hormel & Company. The Company started as a processor of meat and food products and continues in this line of business with emphasis on the manufacturing and distribution of branded, value-added consumer items rather than commodity fresh meat products. The Company builds on its founder's legacy of innovation, quality, and integrity with focus on its purpose statement - Inspired People. Inspired Food.™ Today, the Company is a global branded food company bringing some of the most trusted and iconic brands to tables across the globe with over $12 billion in annual revenue in more than 80 countries.\nThe Company has continually expanded its product portfolio through organic growth and acquisitions. In fiscal 2021, the Company acquired the Planters® snack nuts business, expanding the Company's presence in the growing snacking space. Refer to Note B - Acquisitions and Divestitures of the Notes to the Consolidated Financial Statements for additional information. During fiscal 2023, the Company purchased a 30% common stock interest in PT Garudafood Putra Putri Jaya Tbk (Garudafood), a food and beverage company in Indonesia, expanding the Company's presence in Southeast Asia and supporting global execution in the snacking and entertaining category. Refer to Note D - Investments in Affiliates of the Notes to the Consolidated Financial Statements for additional information.\nDescription of Business\nSegments\nEffective in fiscal 2023, the Company transitioned to a new strategic operating model, which aligns its businesses to be more agile, consumer and customer focused, and market driven. The Company currently operates with the following three operating and reportable segments: Retail, Foodservice, and International.\nRetail\nThe Retail segment consists primarily of the processing, marketing, and sale of food products sold predominantly in the retail market. This segment also includes the results from the Companys MegaMex Foods, LLC joint venture.\nFoodservice\nThe Foodservice segment consists primarily of the processing, marketing, and sale of food and nutritional products for foodservice, convenience store, and commercial customers.\nInternational\nThe International segment processes, markets, and sells Company products internationally. This segment also includes the results from the Companys international joint ventures, equity method investments, and royalty arrangements.\nPrior period results for fiscal 2022 and 2021 have been recast to reflect the new reportable segments. Net sales to unaffiliated customers, segment profit, and certain other financial information by segment are reported in Note P - Segment Reporting of the Notes to the Consolidated Financial Statements and in Managements Discussion and Analysis of Financial Condition and Results of Operations.\nProducts and Distribution\nThe Company develops, processes, and distributes a wide array of food products in a variety of markets and manufactures its products through various processing facilities and trusted co-manufacturers. The Companys products primarily consist of meat, nuts, and other food products sold across multiple distribution channels, such as U.S. Retail, U.S. Foodservice, and International.\nDomestically, the Company sells its products in all 50 states. The Companys products are sold through its sales personnel, who operate in assigned territories or in dedicated teams serving major customers and who are coordinated from sales offices predominately located in major U.S. cities. The Company also utilizes independent brokers and distributors. Products are primarily distributed by common carrier.\nThe Company has a global presence within several major international markets, including Australia, Brazil, Canada, China, England, Indonesia, Japan, Mexico, the Philippines, Singapore, and South Korea. Distribution of export sales to customers is by common carrier, while the China and Brazil operations own and operate their own delivery systems. The Company has licensed companies to manufacture various products internationally on a royalty basis, with the primary licensees being Danish Crown UK\nLtd., and CJ CheilJedang Corporation. The Company also has minority positions in food companies in the Philippines (The Purefoods-Hormel Company, Inc., 40 percent holding) and Indonesia (Garudafood, 30 percent holding).\nRaw Materials\nThe Company concentrates on the marketing and sale of branded, value-added food products. The principal raw materials used by the Company include pork, turkey, beef, chicken, and nuts. The Company takes a balanced approach to sourcing pork raw materials, including hogs purchased for the Austin, Minnesota processing facility, long-term supply agreements for pork, and spot market purchases of pork. The majority of the turkeys needed to meet raw material requirements are raised by the Company. Production costs from raising turkeys are subject to fluctuations in grain prices and fuel costs. To manage these risks, the Company uses futures, swaps, and options contracts to hedge a portion of its anticipated purchases.\nThe Company also purchases raw materials from various suppliers. As the Company has shifted its focus toward a more value-added portfolio, it has become increasingly dependent on these suppliers to meet its raw material needs. Certain raw materials, such as cashews, are sourced internationally, which may cause additional risks to pricing and availability. The Company utilizes supply contracts and forward buying strategies to ensure an adequate supply and mitigate price fluctuations.\nHuman Capital\nThe Companys employees are the driving force behind innovation, improvement, and success. As of October 29, 2023, the Company had approximately 20,000 active employees, with over 90 percent located within the U.S. Approximately 20 percent of employees are covered by collective bargaining agreements.\nTalent Acquisition, Development, and Retention\nHormels team members are the cornerstone of the Company and of the fulfillment of its purpose - Inspired People. Inspired Food.™ The Company places great importance on the growth, development, and engagement of its team members. The Company offers a competitive compensation package and a multitude of benefits, including medical, life and disability insurance, contributory and non-contributory retirement savings plans, free post-secondary tuition and tuition reimbursement programs, and two years of tuition-free community and technical college for U.S. employees dependent children.\nThe Company believes investing in the education, training, and development of employees contributes to the overall success of the business. The Company provides learning opportunities for employees through various training courses, including instructor-led internal and external programs and on-the-job training.\nThe Company considers the tenure of its team members to be an important indicator of overall performance and is proud of its tenure figures. As of October 29, 2023, approximately 50 percent of the Company's team members had five or more years of service, and the 34-person officer team had an average of 25 years of service.\nDiversity, Equity, and Inclusion\nThe Company welcomes the diversity of all team members, customers, and consumers, and encourages the integration of their unique skills, thoughts, experiences, and identities. The Companys workforce is made up of approximately 40 percent female and approximately 60 percent underrepresented minorities. The Companys salaried employees are made up of approximately 35 percent female and over 20 percent underrepresented minorities. By fostering an inclusive culture, the Company enables every member of the workforce to leverage unique talents and high performance standards to drive innovation and success.\nExecutives of the Company are held accountable for creating an inclusive, diverse workplace through their annual incentive plan, which includes a component focused on overall belonging scores and the representation of female and underrepresented minorities in salaried positions.\nThe Company supports twelve employee resource groups (ERGs) that support the Companys mission to create a workplace where all people feel welcomed, respected, and valued. These employee-driven groups play a critical role in diversity, equity, and inclusion efforts and provide professional development and mentorship opportunities.\nSafety, Health, and Wellness\nThe Companys dedicated corporate safety department develops and administers company-wide policies to ensure the safety of each employee and compliance with Occupational Safety and Health Administration standards. The corporate safety department also conducts regular audits of production facilities to ensure compliance with Company safety policies. The Company conducts safety training for all team members and completes approximately 1,000 safety assessments each month.\nThe Company recognizes that team members perform best when they are healthy, and that optimal performance is necessary for the Company to achieve its key results. In addition to the health care benefits package, the Companys Inspired Health program aims to cultivate and maintain a culture of health and wellness that is focused on encouraging and empowering team members to make healthy lifestyle choices through awareness, prevention, and positive health behavior\nchanges. This program includes biometric screenings, on-site fitness centers and fitness center discounts, an online health university with robust information and resources, a tobacco cessation program, wellness challenges, and confidential health and wellness support.\nGovernmental Regulation and Environmental Matters\nThe Companys operations are subject to regulation by various governmental agencies which oversee areas such as food safety, workforce immigration, environmental laws, animal welfare, tax regulations, and the processing, packaging, storage, distribution, advertising, and labeling of the Companys products. The Company believes it is in compliance with current laws and regulations and does not expect continued compliance to have a material impact on capital expenditures, earnings, or competitive position. The Company continues to monitor existing and pending laws and regulations and, while the impact of regulatory changes cannot be predicted with certainty, the Company does not expect compliance to have a material adverse effect on the Company's business. In addition to compliance with environmental laws and regulations, the Company sets goals to further improve its sustainability efforts and reduce its environmental impact. These goals are outlined in the Companys 20 by 30 Challenge and include matching energy with renewable sourcing, reducing organic waste and greenhouse gas emissions, supporting regenerative agriculture, focusing on packaging sustainability, and reducing food waste. In addition, the Company's greenhouse gas reduction targets were validated by the Science Based Targets initiative in 2023.\nSignificant Customers\nThe Company serves many customers throughout the world across various sales channels. Sales to the Companys largest customer, Walmart Inc. (Walmart), accounted for approximately 15 percent of consolidated gross sales less returns and allowances during fiscal 2023. Walmart is a customer for the Company's Retail and International segments. The Companys top five customers collectively represent approximately 36 percent of consolidated gross sales less returns and allowances. The loss of one or more of the top customers in any of the reportable segments could have a material adverse effect upon such segments financial results.\nCompetition\nThe production and sale of meat and food products in the U.S. and internationally is highly competitive. The Company competes with manufacturers of pork and turkey products as well as national and regional producers of other meat and protein sources, such as beef, chicken, fish, nuts, and plant-based proteins.\nAll operating segments compete on the basis of price, product quality and attributes, brand identification, breadth of product line, and customer service. Through effective marketing and strong quality assurance programs, the Companys strategy is to provide high quality products that possess strong brand recognition, which support higher value perceptions with customers. To grow and maintain market position, the Company focuses on meeting consumer preferences, delivering product innovation, and maintaining long-term and lasting relationships with industry partners.\nPatents and Trademarks\nThere are numerous patents and trademarks important to the Companys business. The Company holds 23 U.S. and eight foreign patents. Most of the trademarks the Company uses are registered in the U.S. and other countries. Some of the more significant owned or licensed trademarks used by the Company or its affiliates are:\nHORMEL, ALWAYS TENDER, APPLEGATE, AUSTIN BLUES, BACON 1, BLACK LABEL, BREAD READY, BURKE, CAFÉ H, CERATTI, CHI-CHIS, COLUMBUS, COMPLEATS, CORN NUTS, CURE 81, DANS PRIZE, DI LUSSO, DINTY MOORE, DON MIGUEL, DOÑA MARIA, EMBASA, FAST ‘N EASY, FIRE BRAISED, FONTANINI, HAPPY LITTLE PLANTS, HERDEZ, HORMEL GATHERINGS, HORMEL SQUARE TABLE, HORMEL VITAL CUISINE, HOUSE OF TSANG, JENNIE-O, JUSTINS, LA VICTORIA, LAYOUT, LLOYDS, MARY KITCHEN, MR. PEANUT, NATURAL CHOICE, NUT-RITION, OLD SMOKEHOUSE, OVEN READY, PILLOW PACK, PLANTERS, ROSA GRANDE, SADLER'S SMOKEHOUSE, SKIPPY, SPAM, SPECIAL RECIPE, THICK & EASY, VALLEY FRESH, and WHOLLY.\nThe Companys patents expire after a term that is typically 20 years from the date of filing, with earlier expiration possible based on the Companys decision whether to pay required maintenance fees. As long as the Company continues to use its trademarks, they are renewed indefinitely.\nAvailable Information\nThe Company makes available its annual report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934 on its website at www.hormelfoods.com. These reports are accessible under the caption, Investors - Filings & Reports - SEC Filings on the Companys website and are available as soon as reasonably practicable after such material is electronically filed with or furnished to the Securities and Exchange Commission (SEC). These filings are also available on the SEC's website at www.sec.gov. The documents are available in print, free of charge, to any stockholder who requests them.\nFORWARD-LOOKING STATEMENTS\nThis report contains forward-looking information within the meaning of the federal securities laws. The forward-looking information may include statements concerning the Companys outlook for the future as well as other statements of beliefs, future plans, strategies, or anticipated events and similar expressions concerning matters that are not historical facts.\nThe Private Securities Litigation Reform Act of 1995 (the Reform Act) provides a \"safe harbor\" for forward-looking statements to encourage companies to provide prospective information. The Company is filing this cautionary statement in connection with the Reform Act. When used in the Companys Annual Report to Stockholders, other filings by the Company with the SEC, the Company's press releases, and oral statements made by the Company's representatives, the words or phrases \"should result,\" \"believe,\" \"intend,\" \"plan,\" \"are expected to,\" \"targeted,\" \"will continue,\" \"will approximate,\" \"is anticipated,\" \"estimate,\" \"project,\" or similar expressions are intended to identify forward-looking statements within the meaning of the Reform Act. Such statements are subject to certain risks and uncertainties that could cause actual results to differ materially from historical earnings and those anticipated or projected.\nIn connection with the safe harbor provisions of the Reform Act, the Company is identifying risk factors that could affect financial performance and cause the Companys actual results to differ materially from opinions or statements expressed with respect to future periods. The following discussion of risk factors contains certain cautionary statements regarding the Companys business, which should be considered by investors and others. Such risk factors should be considered in conjunction with any discussions of operations or results by the Company or its representatives, including any forward-looking discussion, as well as comments contained in press releases, presentations to securities analysts or investors, or other communications by the Company.\nIn making these statements, the Company is not undertaking, and specifically declines to undertake, any obligation to address or update each or any factor in future filings or communications regarding the Companys business or results, and is not undertaking to address how any of these factors may have caused changes to discussions or information contained in previous filings or communications. Though the Company has attempted to list comprehensively these important cautionary risk factors, the Company wishes to caution investors and others that other factors may in the future prove to be important in affecting the Companys business or results of operations.\nThe Company cautions readers not to place undue reliance on forward-looking statements, which represent current views as of the date made. Forward-looking statements are inherently at risk to changes in the national and worldwide economic environment, which could include, among other things, risks related to the deterioration of economic conditions; risks associated with acquisitions, joint ventures, equity investments, and divestitures; potential disruption of operations, including at co-manufacturers, suppliers, logistics providers, customers, or other third-party service providers; failure to realize anticipated cost savings or operating efficiencies associated with strategic initiatives; risk of loss of a material contract; the Companys inability to protect information technology systems against, or effectively respond to, cyber attacks or security breaches; deterioration of labor relations, labor availability or increases to labor costs; general risks of the food industry, including food contamination; outbreaks of disease among livestock and poultry flocks; fluctuations in commodity prices and availability of raw materials and other inputs; fluctuations in market demand for the Companys products; damage to the Company's reputation or brand image; climate change, or legal, regulatory, or market measures to address climate change; risks of litigation; potential sanctions and compliance costs arising from government regulation; compliance with stringent environmental regulations and potential environmental litigation; and risks arising from the Companys foreign operations. Item 1A. RISK FACTORS\nBusiness and Operational Risks\nDeterioration of economic conditions could harm the Companys business. The Company's business may be adversely affected by changes in national or global economic conditions, including inflation, interest rates, tax rates, availability of capital, energy availability and costs (including fuel surcharges), political developments, civil unrest, and the effects of governmental initiatives to manage economic conditions. Decreases in consumer spending rates and shifts in consumer product preferences could also negatively impact the Company.\nVolatility in financial markets and the deterioration of national and global economic conditions could impact the Companys operations as follows:\n▪The financial stability of the Company's customers and suppliers may be compromised, which could result in challenges in collecting accounts receivable or non-performance by suppliers.\n▪Unfavorable economic conditions may lead customers and consumers to delay or reduce purchases of the Company's products.\n▪Customer demand for products may not materialize to levels required to achieve the Company's anticipated financial results or may decline as distributors and retailers seek to reduce inventory positions if there is an economic downturn or economic uncertainty in key markets.\n▪The value of the Company's investments in debt and equity securities may decline, including most significantly the trading securities held as part of a rabbi trust to fund supplemental executive retirement plans and deferred income plans and the Companys assets held in pension plans.\n▪Future volatility or disruption in the capital and credit markets could impair the Company's liquidity or increase costs of borrowing.\n▪The Company may be required to redirect cash flow from operations or explore alternative strategies, such as disposing of assets, to fulfill the payment of principal and interest on its indebtedness.\nThe Company has no operations in Russia or Ukraine, yet it has experienced inflated fuel costs and supply chain shortages and delays due to the impact of the military conflict on the global economy. If this conflict, or others such as the Israel-Hamas war, escalates further, it could result in, among other things, additional supply chain disruptions, rising prices for oil and other commodities, volatility in capital markets and foreign exchange rates, rising interest rates, or heightened cybersecurity risks, any of which may adversely affect the Company's business. In addition, the effects of the ongoing conflict could heighten many of the other risk factors included in Item 1A.\nThe Company utilizes hedging programs to manage its exposure to various market risks, such as commodity prices and interest rates, which qualify for hedge accounting for financial reporting purposes. Volatile fluctuations in market conditions could cause these instruments to become ineffective, which could require any gains or losses associated with these instruments to be reported in the Companys earnings each period. These instruments may limit the Companys ability to benefit from market gains if commodity prices and/or interest rates become more favorable than those secured under the Companys hedging programs.\nThe Company's goodwill and indefinite-lived intangible assets are initially recorded at fair value and are not amortized, but are reviewed for impairment annually or more frequently if impairment indicators arise. Impairment testing requires judgment around estimates and assumptions and is impacted by factors such as revenue growth rates, operating margins, tax rates, royalty rates, and discount rates. An unfavorable change in these factors may lead to the impairment of goodwill and/or intangible assets. During fiscal 2023, an impairment was indicated for the Justin's® trade name, resulting in an impairment charge of $28.4 million.\nAdditionally, if a highly pathogenic human disease outbreak developed, such as COVID-19, it may negatively impact the global economy, demand for Company products, the supply chain, the Company's co-manufacturers, and/or the Companys workforce availability including leadership, and the Companys financial results could suffer. The Company has developed contingency plans to address infectious disease scenarios and the potential impact on its operations, and will continue to update these plans as necessary. There can be no assurance given, however, that these plans will be effective in eliminating the negative effects of any such diseases on the Companys operating results.\nThe Companys operations are subject to the general risks associated with acquisitions, joint ventures, equity investments, and divestitures. The Company regularly reviews opportunities to support the Companys strategic initiative of delivering long-term value to shareholders through acquisitions, joint ventures, and equity investments and to divest non-strategic assets. The Company has made several acquisitions, joint ventures, equity investments, and divestitures in recent years, including the acquisition of the Planters® snack nuts business in fiscal 2021 and purchase of a minority interest in Garudafood in fiscal 2023. Potential risks associated with these transactions include the inability to consummate a transaction timely or on favorable terms, diversion of management's attention from other business concerns, loss of key employees and customers of current or acquired companies, inability to integrate or divest operations successfully, assumption of unknown liabilities, disputes with buyers, sellers, or partners, inability to obtain favorable financing terms, impairment charges if purchase assumptions are not achieved, and the inherent risks in entering markets or lines of business in which the Company has limited or no prior experience. Due to the nature of these arrangements, joint ventures and equity investments involve further risks, including the possibility that the Company is unable to execute business strategies and manage operations given limitations of the Company's control. Additionally, partners may become bankrupt, make business decisions that are inconsistent with the Company's goals, or block or delay necessary decisions. Acquisitions, joint ventures, or equity investments outside the U.S. may also present unique challenges and increase the Company's exposure to the risks associated with foreign operations. Any or all of these risks could impact the Companys financial results and business reputation. The Company's level of indebtedness increased significantly to fund the purchase of the Planters® snack nuts business and may continue to increase to fund future acquisitions, joint ventures, or equity investments. Higher levels of debt may, among other things, impact the Company's liquidity and increase the Company's exposure to negative fluctuations in interest rates. During fiscal 2023, an impairment was indicated for the Justin's® trade name, resulting in an impairment charge of $28.4 million and the Company recorded a $7.0 million impairment charge related to a corporate venturing investment to recognize a decline in fair value not believed to be temporary.\nThe Company is subject to disruption of operations at co-manufacturers, suppliers, logistics providers, customers, or other third-party service providers.\n▪Disruption of operations at co-manufacturers, suppliers, or logistics providers have and may continue to impact the Companys product and input supplies as well as the ability to distribute products.\n▪Disruptions related to significant customers or sales channels has and could continue to result in a reduction in sales or change in the mix of products sold.\n▪Disruption in services from partners such as third-party service providers used to support various business functions such as benefit plan administration, payroll processing, information technology and cloud computing services could have an adverse effect on the Company's business.\nDisruptions of third-party providers have had and may continue to have an adverse effect on the Company's financial results. Actions taken to mitigate the impact of any potential disruption, including increasing inventory in anticipation of a potential production or supply interruption, may adversely affect the Companys financial results. Additionally, labor-related challenges have caused disruptions for many of these providers and may continue to impact the Company's ability to receive inputs or distribute products.\nThe Company may not realize the anticipated cost savings or operating efficiencies associated with strategic initiatives. The Company operates in the highly competitive food industry and is subject to volatile cost inputs. Strategic initiatives are implemented to achieve a profitable cost structure, operate efficiently, better serve customers, and optimize cash flow. These initiatives may focus on opportunities to improve the procurement, manufacturing, and logistics within the Companys supply chain as well as general and administrative processes. A failure or delay in implementing the improvements associated with these strategic initiatives could adversely impact the Companys results, ability to meet its long-term growth expectations, and ability to fund future initiatives.\nThe Company began an enterprise transformation and modernization initiative in the second half of fiscal 2023 to provide cost savings and operating efficiencies by fiscal 2026. If this initiative does not achieve the expected financial impact or is not completed in a timely manner, the Companys financial results and ability to meet its long-term growth expectations could be adversely impacted.\nThe Company is subject to the loss of a material contract. The Company is a party to several supply, distribution, contract packaging and other material contracts. The loss of a material contract or failure to obtain new material contracts could adversely affect the Companys financial results.\nThe Company may be adversely impacted if the Company is unable to protect information technology systems against, or effectively respond to, cyber attacks or security breaches. Information technology systems are an important part of the Companys business operations. In addition, the Company increasingly relies upon third-party service providers for a variety of business functions, including cloud-based services. Cyber incidents are occurring more frequently across U.S. industries and are being made by groups and individuals with a wide range of motives and expertise. Continued high-profile data security incidents at other companies evidence an external environment that is becoming increasingly hostile. From time to time, the Company has experienced, and may experience in the future, breaches of its security measures due to human error, malfeasance, insider threats, system errors or vulnerabilities or other irregularities, none of which have been material to date. Remote work arrangements may bring additional information technology and data security risks.\nAlthough the Company has programs in place related to business continuity, disaster recovery, and information security initiatives to maintain the confidentiality, integrity, and availability of systems, business applications, and customer information, the Company may not be able to anticipate or implement effective preventive measures against all potential cybersecurity threats, especially because the techniques used change frequently and because attacks can originate from a wide variety of sources, both domestic and foreign. Cybersecurity risk is increasingly difficult to identify and quantify and cannot be fully mitigated because of the rapidly evolving nature of the threats, targets, and consequences.\nIn addition, the Company is in the midst of multi-year data and technology transformation projects to achieve better analytics, customer service, and process efficiencies. The projects, including modernizing the order-to-cash process, are expected to improve the efficiency and effectiveness of certain financial and business transaction processes and the underlying systems environment. Multiple phases of these projects have already been implemented and additional phases are expected to be implemented in the upcoming years. These implementations are a major undertaking from a financial, management, and personnel perspective and may prove to be more difficult, costly, or time consuming than expected, and there can be no assurance that these projects will be beneficial to the extent anticipated.\nDeterioration of labor relations, labor availability or increases in labor costs could harm the Companys business. As of October 29, 2023, the Company employed approximately 20,000 people worldwide, of which approximately 20 percent were represented by labor unions, principally the United Food and Commercial Workers Union. Union contracts at two of the Company's manufacturing facilities, covering approximately 250 employees, will expire during fiscal 2024. A significant increase in labor costs or a deterioration of labor relations at any of the Companys facilities or co-manufacturing facilities resulting in work slowdowns or stoppages could harm the Companys financial results. Labor and skilled labor availability challenges could continue to have an adverse effect on the Company's business.\nIndustry Risks\nThe Companys operations are subject to the general risks of the food industry. The food products manufacturing industry is subject to the risks posed by:\n▪food spoilage;\n▪food contamination caused by disease-producing organisms or pathogens, such as Listeria monocytogenes, Salmonella, and pathogenic E coli.;\n▪food allergens;\n▪nutritional and health-related concerns;\n▪federal, state, and local food processing controls;\n▪consumer product liability claims;\n▪product tampering; and\n▪the possible unavailability and/or expense of liability insurance.\nThe pathogens that may cause food contamination are found generally in livestock and in the environment and thus may be present in the Company's products. These pathogens can also be introduced to products as a result of improper handling by customers or consumers. The Company does not have control over handling procedures once products have been shipped for distribution. If one or more of these risks were to materialize, the Companys brand and business reputation could be negatively impacted. In addition, revenues could decrease, costs of doing business could increase, and the Companys operating results could be adversely affected.\nOutbreaks of disease among livestock and poultry flocks could harm the Companys revenues and operating margins. The Company is subject to risks associated with the outbreak of disease in pork and beef livestock, and poultry flocks, including African swine fever (ASF), Bovine Spongiform Encephalopathy (BSE), pneumo-virus, Porcine Circovirus 2 (PCV2), Porcine Reproduction & Respiratory Syndrome (PRRS), Foot-and-Mouth Disease (FMD), Porcine Epidemic Diarrhea Virus (PEDv), and Highly Pathogenic Avian Influenza (HPAI). The outbreak of such diseases could adversely affect the Companys supply of raw materials, increase the cost of production, reduce utilization of the Companys harvest facilities, and reduce operating margins. The impact of global climate change may increase these risks due to changes in weather or migratory patterns which may result in certain types of diseases occurring more frequently or with more intense effects. Additionally, the outbreak of disease may hinder the Companys ability to market and sell products both domestically and internationally.\nIn recent years, the outbreak of ASF has impacted hog herds in China, Asia, Europe, and the Caribbean. If an outbreak of ASF were to occur in the U.S., the Company's supply of hogs and pork could be materially impacted.\nHPAI was detected within the Company's turkey supply chain during the fourth quarter of fiscal 2023 and first quarter of fiscal 2024. The impact of HPAI has reduced and will continue to reduce production volume in the Company's turkey facilities into fiscal 2024. The Company is continuing to monitor the situation and will take the appropriate actions to protect the health of the turkeys across the supply chain.\nThe Company has developed business continuity plans for various disease scenarios and will continue to update these plans as necessary. There can be no assurance given, however, that these plans will be effective in eliminating the negative effects of any such diseases on the Companys operating results.\nFluctuations in commodity prices and availability of raw materials and other inputs could harm the Companys earnings. The Companys results of operations and financial condition are largely dependent upon the cost and supply of pork, poultry, beef, feed grains, and nuts as well as supplies, energy and other inputs and the selling prices for many of the Company's products, which are determined by constantly changing market forces of supply and demand.\nThe Company takes a balanced approach to sourcing pork raw materials, including hogs purchased for the Austin, Minnesota processing facility, long-term supply agreements for pork, and spot market purchases of pork. This approach ensures a more stable supply of raw materials while minimizing extreme fluctuations in costs over the long-term. This may result, in the short-term, in higher or lower live hog costs compared to the cash spot market. Market-based pricing on certain product lines, and lead time required to implement pricing adjustments, may prevent all or part of these cost increases from being recovered, and these higher costs could adversely affect the Company's short-term financial results.\nThe Company raises turkeys and contracts with turkey growers to meet its raw material requirements for whole birds and processed turkey products. Results in these operations are affected by the cost and supply of feed grains, which fluctuate due to climate conditions, production forecasts, and supply and demand conditions at local, regional, national, and worldwide markets. The Company attempts to manage some of its short-term exposure to fluctuations in feed prices by forward buying, using futures contracts, and pursuing pricing advances. However, these strategies may not be adequate to overcome sustained increases in market prices due to alternate uses for feed grains or other changes in these market conditions.\nThe Company may be subject to decreased availability or less favorable pricing for nuts, tomatoes, avocados, or other produce if poor growing conditions have a negative effect on agricultural productivity. Reductions in crop size or quality due to unfavorable growing conditions may have an adverse effect on the Companys results.\nThe supplies of natural and organic proteins may impact the Companys ability to ensure a continuing supply of these products. To mitigate this risk, the Company partners with multiple long-term suppliers.\nInternational trade barriers and other restrictions or disruptions could result in decreased foreign demand and increased domestic supply of proteins, thereby potentially lowering prices. The Company occasionally utilizes in-country production to limit this exposure.\nMarket demand for the Companys products may fluctuate. The Company faces competition from producers of alternative meats and protein sources, including pork, beef, turkey, chicken, fish, nuts, nut butters, whey, and plant-based proteins. The factors on which the Company competes include:\n▪price;\n▪product quality and attributes;\n▪brand identification;\n▪breadth of product line; and\n▪customer service.\nDemand for the Companys products is also affected by competitors promotional spending, the effectiveness of the Companys advertising and marketing programs, and consumer perceptions. Failure to identify and react to changes in food trends such as sustainability of product sources and animal welfare could lead to, among other things, reduced demand for the Companys brands and products. The Company may be unable to compete successfully on any or all of these factors in the future.\nDamage to the Companys reputation or brand image can adversely affect its business. Maintaining and continually enhancing the perception of the Companys reputation and brands is critical to business success. The Companys reputation and brands have been in the past and could in the future be adversely impacted by a number of factors, including unfavorable consumer perception related to events or rumors, adverse publicity, and negative information disseminated through social and digital media. Failure to maintain, extend, and expand the Companys reputation or brand image could adversely impact operating results.\nClimate change, or legal, regulatory or market measures to address climate change, could have an adverse impact on the Companys business and results of operations. There is growing concern that carbon dioxide and other greenhouse gases in the atmosphere may have an adverse impact on global temperatures, weather patterns, and the frequency and severity of extreme weather and natural disasters. If such climate change has a negative impact on agricultural productivity, the Company may have decreased availability or less favorable pricing for the raw materials necessary for its operations. Climate change may also cause decreased availability or less favorable pricing for water, which could have an adverse effect on the Companys operations and supply chain. In addition, natural disasters and extreme weather, including those caused by climate change, could cause disruptions in the Companys operations and supply chain.\nThe increasing concern over climate change may also result in greater local, state, federal, and foreign legal requirements, including requirements to limit greenhouse gas emissions or conserve water usage. If such requirements are enacted, the Company could experience significant cost increases in its operations and supply chain.\nThe Company has developed and publicly announced goals to reduce its impact on the environment such as the 20 by 30 Challenge and the recently announced validation of its greenhouse gas reduction targets by the Science Based Targets initiative. The Company's ability to achieve these goals is subject to numerous factors and conditions, many of which are outside of its control. Examples include, among others, evolving regulatory requirements, disclosure frameworks, and methodologies for reporting data. Failure to accomplish goals set by the Company related to climate change or meet expectations of various Company stakeholders may cause decreased demand for the Companys products and have an adverse effect on results of operations.\nLegal and Regulatory Risks\nThe Companys operations are subject to the general risks of litigation. The Company is involved on an ongoing basis in litigation arising in the ordinary course of business. Trends in litigation may include class actions involving employees, consumers, competitors, suppliers, shareholders, or others, and claims relating to product liability, contract disputes, antitrust regulations, intellectual property, advertising, labeling, wage and hour laws, employment practices or environmental matters. Neither litigation trends nor the outcomes of litigation can be predicted with certainty and adverse litigation trends and outcomes could negatively affect the Companys financial results.\nGovernment regulation, present and future, exposes the Company to potential sanctions and compliance costs that could adversely affect the Companys business. The Companys operations are subject to extensive regulation by the U.S. Department of Homeland Security, the U.S. Department of Agriculture, the U.S. Food and Drug Administration, federal and state taxing authorities and other federal, state, and local authorities which oversee workforce immigration, taxation, animal welfare, food safety, and the processing, packaging, storage, distribution, advertising, and labeling of the Companys products. The Companys manufacturing facilities and products are subject to ongoing inspection by federal, state and local authorities. Claims or enforcement proceedings could be brought against the Company in the future. The availability of government inspectors due to a government furlough could also cause disruption to the Companys manufacturing facilities. Additionally, the Company is subject to new or modified laws, regulations, and accounting standards. The Companys failure or inability to comply with such requirements could subject the Company to civil remedies, including fines, injunctions, recalls or seizures, as well as potential criminal sanctions. A federal district court ruling has had a negative impact on harvest capacity and labor costs. Harvest facilities the Company uses are negotiating to resolve the situation and expect to reach a solution, but harvest capacity and labor costs may continue to be negatively impacted until a solution is reached. There can be no assurance a solution will be reached, in which case the negative impacts of the ruling would continue.\nThe Company is subject to stringent environmental regulations and potentially subject to environmental litigation, proceedings, and investigations. The Companys past and present business operations and ownership and operation of real property are subject to stringent federal, state, and local environmental laws and regulations pertaining to the discharge of materials into the environment and the handling and disposition of wastes (including solid and hazardous wastes) or otherwise relating to protection of the environment. Compliance with these laws and regulations, as well as any modifications, is material to the Companys business. Some of the Companys facilities have been in operation for many years and, over time, the Company and other prior operators of these facilities may have generated and disposed of wastes that now may be considered hazardous. Future discovery of contamination of property underlying or in the vicinity of the Companys present or former properties or manufacturing facilities and/or waste disposal sites could require the Company to incur additional expenses related to additional investigation, assessment or other requirements. The occurrence of any of these events, the implementation of new laws and regulations or stricter interpretation of existing laws or regulations could adversely affect the Companys financial results.\nThe Companys foreign operations pose additional risks to the Companys business. The Company operates its business and markets its products internationally. The Companys foreign operations are subject to the risks described above, as well as risks related to fluctuations in currency values, foreign currency exchange controls, compliance with foreign laws, compliance with applicable U.S. laws, including the Foreign Corrupt Practices Act, and other economic or political uncertainties. International sales are subject to risks related to general economic conditions, imposition of tariffs, quotas, trade barriers and other restrictions, enforcement of remedies in foreign jurisdictions and compliance with applicable foreign laws, and other economic and political uncertainties. All of these risks could result in increased costs or decreased revenues, which could adversely affect the Companys financial results. Item 1B. UNRESOLVED STAFF COMMENTS\nNone. Item 2. PROPERTIES\nThe Company's global headquarters are located in Austin, Minnesota. The Company has various processing plants, warehouses and operational facilities, mainly located in the U.S. The Company maintains a national sales force through strategic placement of sales offices across the U.S. Properties are also maintained internationally to support global processing and sales. A majority of the Company's property is owned. Leased property is used as needed for production, distribution, and sales.\nThe Company believes its operating facilities are well maintained and suitable for current production volumes. The Company regularly engages in construction and other capital improvement projects with a focus on value-added capacity projects and automation.\nMany of the Company's domestic properties are utilized by more than one segment and utilization of these facilities can change over time. Therefore, it is impracticable to disclose them by segment. The facilities outside the U.S. serve the International segment.\nArea (1)\nSquare feet, in thousands\nProduction Facilities\nWarehouse/Distribution Centers\nAdministration/Sales/Research Offices\nTotal\nLeased\nOwned\nArizona - - 2 2 2 -\nArkansas 589 - 9 598 9 589\nCalifornia 323 428 54 805 656 149\nColorado 829 - 10 839 10 829\nFlorida - - 5 5 5 -\nGeorgia 259 - - 259 - 259\nIllinois 738 - 22 760 22 738\nIowa 1,482 658 3 2,143 283 1,860\nKansas 312 - 3 315 3 312\nMassachusetts - - 4 4 4 -\nMichigan - - 3 3 3 -\nMinnesota 3,761 219 554 4,534 89 4,445\nNebraska 845 - - 845 - 845\nNew Jersey - - 29 29 29 -\nNorth Carolina - - 3 3 3 -\nOhio - 453 8 461 322 139\nPennsylvania 13 348 9 370 357 13\nTexas 285 - 2 287 2 285\nUtah - 209 - 209 209 -\nVirginia\n625 - - 625 - 625\nWashington - - 2 2 2 -\nWisconsin 1,227 102 3 1,332 107 1,225\nTotal Domestic 11,288 2,417 725 14,430 2,117 12,313\nAustralia - - 2 2 2 -\nBrazil 440 - 3 443 440 3\nChina 842 33 26 901 2 899\nTotal International 1,282 33 31 1,346 444 902\nTotal Square Feet 12,570 2,450 756 15,776 2,561 13,215\n(1) Turkey growout facilities are excluded. Item 3. LEGAL PROCEEDINGS\nOn August 15, 2023, the Company received an unexpected, unfavorable arbitration ruling involving an isolated commercial dispute with a third party. Pursuant to the ruling, the arbitrator awarded $59.6 million in damages, plus prejudgment interest of $5.3 million and attorneys fees, to the counterparty payable by the Company. The pre-tax impact of the adverse arbitration ruling of $68.3 million is reflected in Selling, General, and Administrative expenses in the Consolidated Statements of Operations for fiscal 2023. The arbitration award amount was paid in full by the Company in the fourth quarter of fiscal 2023. The adverse arbitration ruling is not subject to further appeal or judicial review. Standard confidentiality provisions in the arbitration rules prohibit the Company from commenting on the substance of the ruling.\nInformation regarding other legal proceedings is available in Note J - Commitments and Contingencies of the Notes to the Consolidated Financial Statements. Item 4. MINE SAFETY DISCLOSURES\nNot applicable.\nInformation About Executive Officers\nCURRENT OFFICE AND PREVIOUS\nNAME AGE FIVE YEARS EXPERIENCE DATES\nJames P. Snee 56 Chairman of the Board, President and Chief Executive Officer 11/20/17 to Present\nJacinth C. Smiley 55 Executive Vice President and Chief Financial Officer 01/01/22 to Present\nGroup Vice President (Corporate Strategy) 04/05/21 to 12/31/21\nVice President and Chief Accounting Officer, LyondellBasell 04/01/18 to 04/04/21\nDeanna T. Brady 58 Executive Vice President (Retail) 10/31/22 to Present\nExecutive Vice President (Refrigerated Foods) 10/28/19 to 10/30/22\nGroup Vice President/President Consumer Product Sales 10/26/15 to 10/27/19\nMark A. Coffey 61 Group Vice President (Supply Chain) 04/26/21 to Present\nSenior Vice President (Supply Chain and Manufacturing) 03/28/17 to 04/25/21\nSwen Neufeldt 50 Group Vice President (Hormel Foods International Corporation) 06/29/20 to Present\nVice President (Meat Products) 10/31/16 to 06/28/20\nMark J. Ourada 58 Group Vice President (Foodservice) 03/05/18 to Present\nKatherine M. Losness-Larson 58 Senior Vice President (Human Resources) 10/31/22 to Present\nDirector of Human Resources 10/29/18 to 10/30/22\nPierre M. Lilly 52 Senior Vice President and Chief Compliance Officer 10/26/20 to Present\nDirector of Internal Audit 05/30/16 to 10/25/20\nKevin L. Myers, Ph.D. 58 Senior Vice President (Research and Development, Quality Control) 03/30/15 to Present\nPaul R. Kuehneman 52 Vice President and Controller 02/18/22 to Present\nAssistant Controller 01/04/21 to 02/17/22\nVice President and CFO (Jennie-O Turkey Store) 05/30/16 to 01/03/21\nNo family relationship exists among the executive officers.\nExecutive officers are designated annually by the Board of Directors at the first meeting following the Annual Meeting of Stockholders. Vacancies may be filled and additional officers elected at any time. The Company's Chief Executive Officer has the authority to appoint and remove Vice Presidents (other than Executive Vice Presidents, Group Vice Presidents, and Senior Vice Presidents).\nPART II Item 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS, AND ISSUER PURCHASES OF EQUITY SECURITIES\nMarket Information\nHormel Foods Corporations common stock is traded on the New York Stock Exchange under the symbol HRL. The CUSIP number is 440452100.\nHolders\nThere are approximately 10,000 record stockholders and 270,000 stockholders whose shares are held in street name by brokerage firms and financial institutions.\nThere were no issuer purchases of equity securities in the quarter ended October 29, 2023. On January 29, 2013, the Company's Board of Directors authorized the repurchase of 10,000,000 shares of its common stock with no expiration date. On January 26, 2016, the Board of Directors approved a two-for-one split of the Companys common stock to be effective January 27, 2016. As part of the stock split resolution, the number of shares remaining to be repurchased was adjusted proportionately. The maximum number of shares that may yet be purchased under the repurchase plans or programs as of October 29, 2023 is 3,677,494.\nDividends\nThe Company has paid dividends for 381 consecutive quarters. The annual dividend rate for fiscal 2024 will increase to $1.13 per share, representing the 58th consecutive annual dividend increase. The Company is dedicated to returning excess cash flow to shareholders through dividend payments.\nShareholder Return Performance Graph\nThe following graph shows a comparison of cumulative total shareholder return, calculated on a dividend-reinvested basis, for the Company, the S&P 500 Index, and the S&P 500 Packaged Foods & Meats Index for the five years ended October 29, 2023. The graph assumes $100 was invested in each as of the market close on October 29, 2018. Note that historic stock price performance is not necessarily indicative of future stock price performance. Item 6. RESERVED Item 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nExecutive Overview\nFiscal 2023: The Company achieved its second consecutive year of net sales in excess of $12 billion in fiscal 2023. Net sales were $12.1 billion, declining 3 percent compared to the prior year, as the benefit from pricing actions to mitigate inflationary pressures was more than offset by the impact of lower volumes in the Retail and International segments and lower net pricing in certain categories, such as bacon, reflecting raw material commodity deflation. Volume declined for the full year, primarily due to declines in commodity pork availability as a result of the Company's new pork supply agreement and lower turkey supply in the first half of the year due to the impacts of HPAI. Segment profit declined 11 percent, as higher results in the Foodservice segment were more than offset by significantly lower results in the Retail and International segments. Net earnings declined 21 percent due to lower segment profit and the pre-tax impact of an adverse arbitration ruling of $68.3 million. Adjusted net earnings(1) - excluding the impact of the adverse arbitration ruling, non-cash impairment charges, and costs associated with the Company's transformation and modernization initiative - declined 12 percent. Diluted net earnings per share and adjusted diluted net earnings per share(1) for fiscal 2023 were $1.45 and $1.61, respectively, compared to $1.82 last year.\nSegment profit for the Foodservice segment increased due to improved mix across the portfolio. Retail segment profit declined significantly for the full year, driven primarily by lower volumes, unfavorable mix, and higher operating expenses, partially offset by the benefit from pricing actions across the portfolio and higher equity in earnings from MegaMex Foods, LLC (MegaMex Foods). International segment profit declined due to lower sales in China and lower turkey commodity sales.\nThe Company again reinvested into the business through capital expenditures and returned a record amount of cash to shareholders in the form of dividends. Capital expenditures in fiscal 2023 were $270 million, including investments in new production capabilities for retail and foodservice pepperoni and an expansion for the SPAM® family of products. The Company continues to prioritize investments in growth, innovation, cost savings, automation, and maintenance. The annual dividend for 2024 will be $1.13 per share, representing an increase of 3 percent and marking the 58th consecutive year of dividend increases.\nDuring fiscal 2023, the Company purchased a 30% common stock interest in Garudafood, a food and beverage company in Indonesia. This investment expands the Company's presence in Southeast Asia and supports the global execution of the snacking and entertaining strategic priority. The Company obtained this minority interest in Garudafood for a purchase price of $426 million, including associated transaction costs. The Company funded this transaction with cash on hand.\nFiscal 2024 Outlook(2): The Company continues to navigate through a dynamic operating environment characterized by slowing consumer demand, inflationary pressures, and headwinds in its turkey business. Net sales growth of 1 percent to 3 percent is expected and assumes volume growth in key categories, higher brand support and innovation, a benefit from incremental pricing actions, and the current assumptions for raw material input costs. From a bottom-line perspective, diluted net earnings per share are expected to be $1.43 to $1.57 and adjusted diluted net earnings per share(1) are expected to be $1.51 to $1.65. Earnings are expected to decline in the first half of the year due to the impact from lower turkey markets, lower volumes in the Retail segment, expenses associated with the transformation and modernization initiative, and softness in the Company's China business. Segment profit growth from all three segments is expected in the back half of the year as these pressures abate and as benefits from the transformation and modernization initiative are realized. Major risks to the outlook include incremental inflationary pressures, significantly lower turkey markets than expected, and the impact of deteriorating macroeconomic conditions on the Company's customers, consumers, and operators.\nThe Company remains in a strong financial position due to its consistent cash flow, liquidity, and strong balance sheet. The Company plans to continue to support the business through increased marketing and advertising investments for its leading brands as well as investments into its production capabilities, including converting the Barron, Wisconsin, plant into a value-added facility to support growth across the portfolio. The Company is also expanding capacity for high-demand Planters® snack nuts items. Returning cash to shareholders in the form of dividends remains a top priority for the Company.\nConsistent with the plan outlined at its recent investor day, the Company expects fiscal 2024 to be a year of investment and remains focused on its strategic priorities, executing on its transformation and modernization initiative, fueling its innovation pipeline, and exiting the year with momentum in its business segments. For fiscal 2024, the Company expects a modest benefit to net earnings from its transformation and modernization initiative.\nA detailed review of the Company's fiscal 2023 performance compared to fiscal 2022 appears in the following section. A detailed review of fiscal 2022 performance compared to fiscal 2021 is also provided due to the change in reportable segments which occurred in the first quarter of fiscal 2023.\n(1) See the \"Non-GAAP Financial Measures\" section below for a description of the Company's use of measures not defined by U.S. generally accepted accounting principles (GAAP).\n(2) All forward-looking comparisons for fiscal 2024 are comparing fiscal 2023 GAAP figures to projected fiscal 2024 GAAP figures, unless otherwise noted.\nResults of Operations\nOVERVIEW\nThe Company is a processor of branded and unbranded food products for retail, foodservice, deli, and commercial customers.\nThe Company transitioned to a new operating model in the first quarter of fiscal 2023 and now reports its results in the following three reportable segments:\nThe Retail segment consists primarily of the processing, marketing, and sale of food products sold predominantly in the retail market. This segment also includes the results from the Companys MegaMex Foods, LLC joint venture.\nThe Foodservice segment consists primarily of the processing, marketing, and sale of food and nutritional products for foodservice, convenience store, and commercial customers.\nThe International segment processes, markets, and sells Company products internationally. This segment also includes the results from the Companys international joint ventures, equity method investments, and royalty arrangements.\nPrior period segment results have been retrospectively recast to reflect the new reportable segments.\nThe Companys fiscal year consisted of 52 weeks in fiscal years 2023 and 2022 and 53 weeks in fiscal year 2021. Fiscal year 2024 will consist of 52 weeks.\nFISCAL YEARS 2023 AND 2022\nCONSOLIDATED RESULTS\nNet Earnings and Diluted Earnings Per Share\nFourth Quarter Ended Fiscal Year Ended\nIn thousands, except per share amounts October 29, 2023 October 30, 2022 % Change October 29, 2023 October 30, 2022 % Change\nNet Earnings $ 195,935 $ 279,883 (30.0) $ 793,572 $ 999,987 (20.6)\nDiluted Earnings Per Share 0.36 0.51 (29.4) 1.45 1.82 (20.3)\nAdjusted Diluted Earnings Per Share(1)\n0.42 0.51 (17.2) 1.61 1.82 (11.4)\n(1) See the \"Non-GAAP Financial Measures\" section below for a description of the Company's use of measures not defined by U.S. generally accepted accounting principles (GAAP).\nVolume and Net Sales\nFourth Quarter Ended Fiscal Year Ended\nIn thousands October 29, 2023 October 30, 2022 % Change October 29, 2023 October 30, 2022 % Change\nVolume (lbs.) 1,155,445 1,160,490 (0.4) 4,411,738 4,604,169 (4.2)\nNet Sales $ 3,198,079 $ 3,283,475 (2.6) $ 12,110,010 $ 12,458,806 (2.8)\nVolume for the fourth quarter of fiscal 2023 was comparable with last year, as higher turkey volumes in each segment were offset by lower Retail volumes in the convenient meals and proteins and the snacking and entertaining verticals. Net sales declined in the fourth quarter, as higher Foodservice segment sales and the benefit from higher turkey volumes were more than offset by lower volumes in the Retail segment and continued pressure in the International segment.\nFiscal 2023 marked the second consecutive year of net sales in excess of $12 billion. Net sales declined for the full year, as the benefit from pricing actions to mitigate inflationary pressures was more than offset by the impact of lower volumes in the Retail and International segments and lower net pricing in certain categories, such as bacon, reflecting raw material commodity\ndeflation. The primary drivers of lower volume in fiscal 2023 were declines in commodity pork availability as a result of the Company's new pork supply agreement and lower turkey supply in the first half of the year from the impacts of HPAI.\nIn fiscal 2024, the Company expects sales growth, which assumes benefits from modestly higher volumes, growth in key categories, higher brand support and innovation, incremental pricing actions, and the current assumptions for raw material costs. Risks to this outlook include slowing consumer demand and greater-than-expected pricing headwinds in the turkey business.\nCost of Products Sold\nFourth Quarter Ended Fiscal Year Ended\nOctober 29, October 30, October 29, October 30,\nIn thousands 2023 2022 % Change 2023 2022 % Change\nCost of Products Sold $ 2,683,655 $ 2,717,058 (1.2) $ 10,110,169 $ 10,294,120 (1.8)\nCost of products sold for the fourth quarter and full year of fiscal 2023 decreased due to lower sales. On a volume basis, cost of products sold increased 2 percent in fiscal 2023, driven primarily by inflationary pressures stemming from, among other inputs, packaging, logistics, and labor.\nIn fiscal 2024, costs are expected to moderate relative to the high levels of inflation the business has absorbed since the beginning of fiscal 2021. Raw material input costs for pork, beef, and feed are anticipated to remain volatile and above historical levels. The Company expects its transformation and modernization initiative to begin delivering modest cost savings in fiscal 2024, targeting packaging, logistics, and production costs.\nGross Profit\nFourth Quarter Ended Fiscal Year Ended\nOctober 29, October 30, October 29, October 30,\nIn thousands 2023 2022 % Change 2023 2022 % Change\nGross Profit $ 514,425 $ 566,417 (9.2) $ 1,999,841 $ 2,164,686 (7.6)\nPercent of Net Sales\n16.1 % 17.3 % 16.5 % 17.4 %\nConsolidated gross profit as a percent of net sales for the fourth quarter and full year of fiscal 2023 decreased, driven primarily by unfavorable mix in the Retail and International segments and the persistent impact of inflationary pressures. Pricing actions helped mitigate some of the impact from inflationary pressures. Compared to fiscal 2022, gross profit as a percent of net sales for the fourth quarter and full year increased for the Foodservice segment but declined for the Retail and International segments.\nIn fiscal 2024, the Company expects gross profit as a percent of net sales to be comparable to fiscal 2023. Incremental cost inflation and unfavorable sales mix pose the largest risks to this outlook.\nSelling, General, and Administrative (SG&A)\nFourth Quarter Ended Fiscal Year Ended\nIn thousands October 29, 2023 October 30, 2022 % Change October 29, 2023 October 30, 2022 % Change\nSG&A $ 216,546 $ 206,487 4.9 $ 942,167 $ 879,265 7.2\nPercent of Net Sales\n6.8 % 6.3 % 7.8 % 7.1 %\nAdjusted Percent of Net Sales(1)\n6.6 % 6.3 % 7.1 % 7.1 %\n(1) See the \"Non-GAAP Financial Measures\" section below for a description of the Company's use of measures not defined by U.S. generally accepted accounting principles (GAAP).\nSG&A expenses for the fourth quarter of fiscal 2023 increased as higher professional service expense related to the Company's transformation and modernization initiative and higher advertising expense were partially offset by lower employee-related expenses. For full year fiscal 2023, the increase in SG&A expenses and SG&A expenses as a percent of net sales is attributed to an adverse arbitration ruling totaling $68.3 million. Adjusted SG&A expenses as a percent of net sales(1) for fiscal 2023 were comparable to the prior year.\nAdvertising investments in fiscal 2023 were $160 million, representing a 2% increase compared to fiscal 2022.\nIn fiscal 2024, the Company intends to continue investing in its leading brands and for full year advertising expense to increase compared to the prior year.\nResearch and development continues to be a vital part of the Company's strategy to grow existing brands and expand into new branded items. Research and development expenses were $33.7 million in fiscal 2023, compared to $34.7 million in fiscal 2022.\nEquity in Earnings of Affiliates\nFourth Quarter Ended Fiscal Year Ended\nOctober 29, October 30, October 29, October 30,\nIn thousands 2023 2022 % Change 2023 2022 % Change\nEquity in Earnings of Affiliates $ 541 $ 7,234 (92.5) $ 42,754 $ 27,185 57.3\nEquity in earnings of affiliates for the fourth quarter of fiscal 2023 decreased, resulting from the $7.0 million impairment of a corporate venturing investment. Equity in earnings of affiliates for the full year of fiscal 2023 increased due to significantly higher results for MegaMex Foods, reflecting a benefit from pricing actions and lower avocado input costs.\nThe Company accounts for its majority-owned operations under the consolidation method. Investments in which the Company owns a minority interest, and for which there are no other indicators of control, are accounted for under the equity or cost method. These investments, including balances due to or from affiliates, are included on the Consolidated Statements of Financial Position as Investments in Affiliates. The composition of this line item as of October 29, 2023, was as follows:\nIn thousands Investments in Affiliates\nU.S. $ 214,019\nForeign 511,103\nTotal $ 725,121\nGoodwill and Intangible Impairment\nAn impairment charge related to the Justin's® trade name of $28.4 million was recorded in the fourth quarter of fiscal 2023.\nInterest and Investment Income and Interest Expense\nFourth Quarter Ended Fiscal Year Ended\nOctober 29, October 30, October 29, October 30,\nIn thousands 2023 2022 % Change 2023 2022 % Change\nInterest and Investment Income $ (5,872) $ 7,933 (174.0) $ 14,828 $ 28,012 (47.1)\nInterest Expense 18,360 17,602 4.3 73,402 62,515 17.4\nInterest and investment income decreased in the fourth quarter of fiscal 2023 primarily due to higher pension costs. Interest and investment income decreased for the full year of fiscal 2023 due to higher pension costs, partially offset by increased interest income and improved performance on the rabbi trust. Interest expense increased in fiscal 2023 due to the impact of an interest rate swap.\nEffective Tax Rate\nFourth Quarter Ended Fiscal Year Ended\nOctober 29, October 30, October 29, October 30,\n2023 2022 2023 2022\nEffective Tax Rate 20.5 % 21.7 % 21.8 % 21.7 %\nThe effective tax rate for fiscal 2023 reflects a benefit related to the deduction for foreign-derived intangible income. The fiscal 2022 effective tax rate included a benefit for stock option exercises. For additional information, refer to Note N - Income Taxes of the Notes to the Consolidated Financial Statements.\nThe Company expects the effective tax rate in fiscal 2024 to be between 21.0 and 23.0 percent.\nSEGMENT RESULTS\nNet sales and segment profit for each of the Companys reportable segments are set forth below. The Company is an integrated enterprise, characterized by substantial intersegment cooperation, cost allocations, and sharing of assets. Therefore, the Company does not represent that these segments, if operated independently, would report the profit and other financial information shown below. Additional segment financial information can be found in Note P - Segment Reporting of the Notes to the Consolidated Financial Statements.\nFourth Quarter Ended Fiscal Year Ended\nOctober 29, October 30, October 29, October 30,\nIn thousands 2023 2022 % Change 2023 2022 % Change\nNet Sales\nRetail $ 1,983,253 $ 2,066,454 (4.0) $ 7,749,039 $ 7,987,598 (3.0)\nFoodservice 1,032,353 1,009,672 2.2 3,639,492 3,691,408 (1.4)\nInternational 182,474 207,350 (12.0) 721,479 779,799 (7.5)\nTotal Net Sales $ 3,198,079 $ 3,283,475 (2.6) $ 12,110,010 $ 12,458,806 (2.8)\nSegment Profit\nRetail $ 118,660 $ 198,852 (40.3) $ 577,690 $ 721,832 (20.0)\nFoodservice 167,571 148,203 13.1 595,682 547,686 8.8\nInternational 9,511 28,810 (67.0) 55,234 107,642 (48.7)\nTotal Segment Profit 295,743 375,865 (21.3) 1,228,606 1,377,161 (10.8)\nNet Unallocated Expense 49,485 18,498 167.5 214,482 99,297 116.0\nNoncontrolling Interest (452) 128 (454.6) (653) 239 (372.7)\nEarnings Before Income Taxes $ 245,805 $ 357,495 (31.2) $ 1,013,472 $ 1,278,103 (20.7)\nVolume for the full year of fiscal 2023 was negatively impacted by lower fresh pork availability resulting from the Company's new pork supply agreement (primarily impacting the first quarter) and lower turkey volumes due to the impacts of HPAI in the Company's vertically integrated turkey supply chain (primarily impacting the first half).\nRetail\nFourth Quarter Ended Fiscal Year Ended\nOctober 29, October 30, October 29, October 30,\nIn thousands 2023 2022 % Change 2023 2022 % Change\nVolume (lbs.) 788,030 810,044 (2.7) 3,055,393 3,245,625 (5.9)\nNet Sales $ 1,983,253 $ 2,066,454 (4.0) $ 7,749,039 $ 7,987,598 (3.0)\nSegment Profit 118,660 198,852 (40.3) 577,690 721,832 (20.0)\nAdjusted Segment Profit(1)\n147,043 198,852 (26.1) 606,073 721,832 (16.0)\n(1) See the \"Non-GAAP Financial Measures\" section below for a description of the Company's use of measures not defined by U.S. generally accepted accounting principles (GAAP).\nFor the fourth quarter of fiscal 2023, volume and net sales growth from the value-added meats, emerging brands and bacon verticals was more than offset by declines in the convenient meals and proteins and the snacking and entertaining verticals. In addition to continued recovery across the Jennie-O® turkey portfolio, items such as Applegate® natural and organic meats, Hormel® Black Label® bacon, Chi-Chi's® and La Victoria® salsas, Corn Nuts® products and Hormel® Square Table™ entrees grew volume and net sales during the quarter. Net sales declines continued to be partially attributed to the difficult comparison from high levels of demand for Skippy® spreads last year. Full year fiscal 2023 net sales declined primarily due to lower volumes from the convenient meals and proteins and value-added meats verticals, declines in the snacking and entertaining vertical and lower market-driven pricing on raw bacon items.\nSegment profit declined for the fourth quarter due to lower sales, unfavorable mix and increased brand investments. Additionally, a non-cash impairment charge of $28.4 million was recorded in the fourth quarter associated with the Justin's® trade name. For fiscal 2023, segment profit declined due to lower volumes, unfavorable mix, and higher operating expenses, partially offset by the benefit from pricing actions across the portfolio, higher equity in earnings from MegaMex Foods, and improved bacon volumes.\nIn fiscal 2024, the Company expects volume and net sales from its Retail segment to be comparable to the prior year. Volume growth in key categories, higher brand support and innovation, and a benefit from incremental pricing actions are expected to be positive catalysts for the business. Earnings are expected to decline compared to the prior year, driven primarily by commodity headwinds in the Company's turkey business. Risks to this outlook include a further slowing in consumer demand and greater-than-expected pricing headwinds in the turkey business.\nFoodservice\nFourth Quarter Ended Fiscal Year Ended\nOctober 29, October 30, October 29, October 30,\nIn thousands 2023 2022 % Change 2023 2022 % Change\nVolume (lbs.) 279,288 266,447 4.8 1,026,772 1,027,124 -\nNet Sales $ 1,032,353 $ 1,009,672 2.2 $ 3,639,492 $ 3,691,408 (1.4)\nSegment Profit 167,571 148,203 13.1 595,682 547,686 8.8\nVolume and net sales for the fourth quarter of fiscal 2023 increased, driven by a significant recovery across the Jennie-O® turkey portfolio and strong demand for premium bacon, pizza toppings and premium breakfast sausage. Additionally, volume and net sales increased for the Cafe H®, Austin Blues® and Hormel® Cure 81® brands. Net sales declined for full year fiscal 2023 primarily due to lower net pricing in certain categories, reflecting raw material commodity deflation and lower turkey and fresh pork volumes.\nFor the fourth quarter, segment profit increased due to the contribution from higher volumes and improved mix. Segment profit increased during fiscal 2023 due to improved mix across the portfolio.\nIn fiscal 2024, the Company anticipates higher volume, net sales and segment profit from its Foodservice segment compared to the prior year. Risks to this outlook include a softening of foodservice industry demand, lower-than-expected raw material input costs (negatively impacting net sales), and higher-than-expected operating costs.\nInternational\nFourth Quarter Ended Fiscal Year Ended\nOctober 29, October 30, October 29, October 30,\nIn thousands 2023 2022 % Change 2023 2022 % Change\nVolume (lbs.) 88,128 83,999 4.9 329,573 331,421 (0.6)\nNet Sales $ 182,474 $ 207,350 (12.0) $ 721,479 $ 779,799 (7.5)\nSegment Profit 9,511 28,810 (67.0) 55,234 107,642 (48.7)\nAs anticipated, net sales declined for the fourth quarter of fiscal 2023 as a result of lower branded export volumes and lower sales in China, primarily related to the retail business. Volume growth was driven by low-margin turkey and commodity fresh pork. For the full year of fiscal 2023, net sales declined primarily due to lower SPAM® luncheon meat exports, lower sales in China, and lower commodity turkey prices.\nSegment profit for the fourth quarter declined significantly due to continued softness in China and lower branded export demand, partially offset by the contribution from the Company's minority investment in Garudafood. Segment profit for fiscal 2023 declined significantly due to lower sales in China, lower commodity turkey sales, and lower branded export margins.\nIn fiscal 2024, the Company expects a rebound in its International segment, including higher net sales and segment profit. This recovery is expected to be driven by improvement across the business, including from its multinational businesses in China and Brazil, partnership in the Philippines, and branded exports. Risks to this outlook include continued softness in China and commodity headwinds impacting the export business.\nUnallocated Income and Expense\nThe Company does not allocate deferred compensation, investment income, interest expense, or interest income to its segments when measuring performance. The Company also retains various other income and unallocated expenses at the corporate level. Equity in Earnings of Affiliates is included in segment profit; however, earnings attributable to the Companys corporate venturing investments and noncontrolling interests are excluded.\nFourth Quarter Ended Fiscal Year Ended\nOctober 29, October 30, October 29, October 30,\nIn thousands 2023 2022 2023 2022\nNet Unallocated Expense $ 49,485 $ 18,498 $ 214,482 $ 99,297\nNoncontrolling Interest (452) 128 (653) 239\nFor the fourth quarter of fiscal 2023, net unallocated expense increased as a result of higher pension costs, higher professional service expenses related to the Company's transformation and modernization initiative, and from the impairment of a corporate venturing investment. In addition to these drivers, net unallocated expense for fiscal 2023 increased as a result of an adverse arbitration ruling totaling $68.3 million.\n(1)Non-GAAP Financial Measures\nThis filing includes measures of financial performance that are not defined by U.S. GAAP. The Company utilizes these non-GAAP measures to understand and evaluate operating performance on a consistent basis. These measures may also be used when making decisions regarding resource allocation and in determining incentive compensation. The Company believes these non-GAAP financial measures provide useful information to investors because they facilitate year-over-year comparison and provide additional information about trends in the Companys operations. Non-GAAP measures are not intended to be a substitute for U.S. GAAP measures in analyzing financial performance. These non-GAAP measures are not in accordance with generally accepted accounting principles and may be different from non-GAAP measures used by other companies.\nAdjusted SG&A expenses as a percent of net sales excludes the impact of an adverse arbitration ruling and certain costs associated with the transformation and modernization initiative. Adjusted diluted net earnings per share excludes the impact of an adverse arbitration ruling, impairment charges associated with the Justin's® trade name and a corporate venturing investment, and costs associated with the transformation and modernization initiative. The tax impact was calculated using the effective tax rate for the quarter in which the expense was incurred. The non-GAAP financial measure of adjusted segment profit for the Retail segment excludes the impact of the impairment charge associated with the Justin's® trade name.\nThe Company's fiscal 2024 outlook for adjusted diluted net earnings per share is a non-GAAP financial measure that excludes, or has otherwise been adjusted for, items impacting comparability, including estimated charges associated with the transformation and modernization initiative. The Company's strategic investments in the transformation and modernization initiative are expected to cease at the end of the investment period, are not expected to recur in the foreseeable future, and are not considered representative of the Company's underlying operating performance.\nThe Company provides earnings before interest and taxes (EBIT) and earnings before interest, taxes, depreciation, and amortization (EBITDA) because these measures are useful to management and investors as indicators of operating strength relative to prior years and are commonly used to benchmark the Companys performance.\nThe following tables show the calculations to reconcile from the GAAP measures to the non-GAAP financial measures.\nADJUSTED SELLING, GENERAL, AND ADMINISTRATIVE EXPENSES AS A PERCENT OF NET SALES (NON-GAAP) AND ADJUSTED DILUTED NET EARNINGS PER SHARE (NON-GAAP)\nFourth Quarter Ended\nOctober 29, 2023 October 30, 2022\nIn thousands, except per share amounts GAAP Non-GAAP Adjustments Non-GAAP Reported\nGAAP Non-GAAP\n% Change\nNet Sales $ 3,198,079 $ - $ 3,198,079 $ 3,283,475 (2.6)\nCost of Products Sold 2,683,655 (944) 2,682,711 2,717,058 (1.3)\nGross Profit 514,425 944 515,368 566,417 (9.0)\nSelling, General, and Administrative 216,546 (6,726) 209,820 206,487 1.6\nEquity in Earnings of Affiliates 541 6,985 7,526 7,234 4.0\nGoodwill and Intangible Impairment 28,383 (28,383) - - -\nOperating Income 270,037 43,038 313,074 367,164 (14.7)\nInterest and Investment Income (5,872) - (5,872) 7,933 (174.0)\nInterest Expense 18,360 - 18,360 17,602 4.3\nEarnings Before Income Taxes 245,805 43,038 288,843 357,495 (19.2)\nProvision for Income Taxes 50,322 8,822 59,145 77,484 (23.7)\nNet Earnings 195,483 34,216 229,698 280,011 (18.0)\nLess: Net Earnings (Loss) Attributable to Noncontrolling Interest (452) - (452) 128 (454.6)\nNet Earnings Attributable to Hormel Foods Corporation $ 195,935 $ 34,216 $ 230,150 $ 279,883 (17.8)\nDiluted Net Earnings Per Share $ 0.36 $ 0.06 $ 0.42 $ 0.51 (17.2)\nSelling, General, and Administrative Expenses as a Percent of Net Sales\n6.8 % 6.6 % 6.3 %\nFiscal Year Ended\nOctober 29, 2023 October 30, 2022\nIn thousands, except per share amounts GAAP Non-GAAP Adjustments Non-GAAP Reported\nGAAP Non-GAAP\n% Change\nNet Sales $ 12,110,010 $ - $ 12,110,010 $ 12,458,806 (2.8)\nCost of Products Sold 10,110,169 (944) 10,109,225 10,294,120 (1.8)\nGross Profit 1,999,841 944 2,000,785 2,164,686 (7.6)\nSelling, General, and Administrative 942,167 (76,726) 865,441 879,265 (1.6)\nEquity in Earnings of Affiliates 42,754 6,985 49,739 27,185 83.0\nGoodwill and Intangible Impairment 28,383 (28,383) - - -\nOperating Income 1,072,046 113,038 1,185,083 1,312,607 (9.7)\nInterest and Investment Income 14,828 - 14,828 28,012 (47.1)\nInterest Expense 73,402 - 73,402 62,515 17.4\nEarnings Before Income Taxes 1,013,472 113,038 1,126,509 1,278,103 (11.9)\nProvision for Income Taxes 220,552 24,012 244,565 277,877 (12.0)\nNet Earnings 792,920 89,026 881,945 1,000,226 (11.8)\nLess: Net Earnings (Loss) Attributable to Noncontrolling Interest (653) - (653) 239 (372.7)\nNet Earnings Attributable to Hormel Foods Corporation $ 793,572 $ 89,026 $ 882,597 $ 999,987 (11.7)\nDiluted Net Earnings Per Share $ 1.45 $ 0.16 $ 1.61 $ 1.82 (11.4)\nSelling, General, and Administrative Expenses as a Percent of Net Sales\n7.8 % 7.1 % 7.1 %\nADJUSTED SEGMENT PROFIT (NON-GAAP)\nFourth Quarter Ended\nOctober 29, 2023 October 30, 2022\nIn thousands GAAP Non-GAAP Adjustments Non-GAAP Reported\nGAAP Non-GAAP\n% Change\nSegment Profit\nRetail $ 118,660 $ 28,383 $ 147,043 $ 198,852 (26.1)\nFoodservice 167,571 - 167,571 148,203 13.1\nInternational 9,511 - 9,511 28,810 (67.0)\nTotal Segment Profit 295,743 28,383 324,126 375,865 (13.8)\nNet Unallocated Expense 49,485 (14,655) 34,830 18,498 88.3\nNoncontrolling Interest (452) - (452) 128 (454.6)\nEarnings Before Income Taxes $ 245,805 $ 43,038 $ 288,843 $ 357,495 (19.2)\nFiscal Year Ended\nOctober 29, 2023 October 30, 2022\nIn thousands GAAP Non-GAAP Adjustments Non-GAAP Reported\nGAAP Non-GAAP\n% Change\nSegment Profit\nRetail $ 577,690 $ 28,383 $ 606,073 $ 721,832 (16.0)\nFoodservice 595,682 - 595,682 547,686 8.8\nInternational 55,234 - 55,234 107,642 (48.7)\nTotal Segment Profit 1,228,606 28,383 1,256,989 1,377,161 (8.7)\nNet Unallocated Expense 214,482 (84,655) 129,827 99,297 30.7\nNoncontrolling Interest (653) - (653) 239 (373.1)\nEarnings Before Income Taxes $ 1,013,472 $ 113,038 $ 1,126,510 $ 1,278,103 (11.9)\nADJUSTED DILUTED NET EARNINGS PER SHARE OUTLOOK (NON-GAAP)\nFiscal Year\n2024 Outlook\n2023 Results\nDiluted Net Earnings per Share $1.43 - $1.57 $1.45\nArbitration Ruling - $0.10\nImpairment Charges\n- $0.05\nTransformation and Modernization Initiative\n$0.08 $0.01\nAdjusted Diluted Net Earnings per Share $1.51 - $1.65 $1.61\nEBIT AND EBITDA (NON-GAAP)\nFiscal Year Ended\nIn thousands October 29, 2023 October 30, 2022\nEBIT:\nNet Earnings Attributable to Hormel Foods Corporation $ 793,572 $ 999,987\nPlus: Income Tax Expense 220,552 277,877\nPlus: Interest Expense 73,402 62,515\nLess: Interest and Investment Income 14,828 28,012\nEBIT $ 1,072,698 $ 1,312,367\nEBITDA:\nEBIT per above 1,072,698 1,312,367\nPlus: Depreciation and Amortization 253,311 235,885\nEBITDA $ 1,326,009 $ 1,548,252\nFISCAL YEARS 2022 AND 2021\nCONSOLIDATED RESULTS\nA detailed review of fiscal 2022 performance compared to fiscal 2021 is provided due to the change in reportable segments which occurred in the first quarter of fiscal 2023.\nNet Earnings and Diluted Earnings Per Share\nFourth Quarter Ended Fiscal Year Ended\nIn thousands, except per share amounts October 30, 2022 October 31, 2021 % Change October 30, 2022 October 31, 2021 % Change\nNet Earnings $ 279,883 $ 281,738 (0.7) $ 999,987 $ 908,839 10.0\nDiluted Earnings Per Share 0.51 0.51 - 1.82 1.66 9.6\nAdjusted Diluted Earnings Per Share(1)\n0.51 0.51 - 1.82 1.73 5.2\nVolume and Net Sales\nFourth Quarter Ended Fiscal Year Ended\nIn thousands October 30, 2022 October 31, 2021 % Change October 30, 2022 October 31, 2021 % Change\nVolume (lbs.) 1,160,490 1,379,848 (15.9) 4,604,169 4,933,136 (6.7)\nOrganic Volume(1)\n1,160,490 1,281,287 (9.4) 4,440,352 4,834,575 (8.2)\nNet Sales $ 3,283,475 $ 3,454,751 (5.0) $ 12,458,806 $ 11,386,189 9.4\nOrganic Net Sales(1)\n3,283,475 3,207,983 2.4 11,853,241 11,139,421 6.4\n(1) See the \"Non-GAAP Financial Measures\" section below for a description of the Company's use of measures not defined by U.S. generally accepted accounting principles (GAAP).\nConsistent with the Company's long-term strategy to better align resources to value-added growth, the overall decline in volume for the fourth quarter and full year of fiscal 2022 was primarily due to lower commodity sales resulting from the Company's new pork supply agreement, which was effective January 1, 2022.\nNet sales decreased for the fourth quarter of fiscal 2022 due to reduced commodity sales and the impact from an additional week of sales last year. Organic net sales for the fourth quarter increased, led by growth from the Retail and Foodservice segments. The Retail segment benefited from pricing actions effective at the beginning of the fourth quarter.\nFiscal 2022 marked the third consecutive year of record sales for the Company. Record net sales were primarily driven by the inclusion of the Planters® snack nuts business and growth from the Foodservice segment. All segments implemented pricing actions during the fiscal year to combat inflationary pressures.\nCost of Products Sold\nFourth Quarter Ended Fiscal Year Ended\nOctober 30, October 31, October 30, October 31,\nIn thousands 2022 2021 % Change 2022 2021 % Change\nCost of Products Sold $ 2,717,058 $ 2,876,669 (5.5) $ 10,294,120 $ 9,458,283 8.8\nCost of products sold for the fourth quarter decreased, resulting from lower sales due to the additional week in fiscal 2021. For fiscal 2022, cost of products sold increased due to inflationary pressures stemming from raw materials, packaging, freight, labor, and other inputs. The inclusion of the Planters® snack nuts business was also a driver of higher costs for the full year.\nGross Profit\nFourth Quarter Ended Fiscal Year Ended\nOctober 30, October 31, October 30, October 31,\nIn thousands 2022 2021 % Change 2022 2021 % Change\nGross Profit $ 566,417 $ 578,081 (2.0) $ 2,164,686 $ 1,927,906 12.3\nPercent of Net Sales\n17.3 % 16.7 % 17.4 % 16.9 %\nConsolidated gross profit as a percent of net sales for the fourth quarter of fiscal 2022 increased primarily due to improved profitability from the Retail segment. For fiscal 2022, gross profit as a percent of net sales increased primarily due to improved profitability from the Foodservice and International segments, the inclusion of the Planters® snack nuts business, and pricing actions to help mitigate inflationary pressures across all segments. Gross profit as a percent of net sales for fiscal 2022 also benefited from the reduction of lower margin commodity sales resulting from the Company's pork supply agreement that was new in fiscal 2022.\nCompared to the prior year, gross profit as a percent of net sales for the fourth quarter of fiscal 2022 increased for the Retail segment and declined for the other segments. For fiscal 2022, gross profit as a percent of net sales increased for Foodservice and International segments and decreased modestly for the Retail segment. All business segments were negatively impacted by broad-based inflationary pressures.\nSelling, General, and Administrative (SG&A)\nFourth Quarter Ended Fiscal Year Ended\nOctober 30, October 31, October 30, October 31,\nIn thousands 2022 2021 % Change 2022 2021 % Change\nSG&A $ 206,487 $ 230,441 (10.4) $ 879,265 $ 853,071 3.1\nPercent of Net Sales\n6.3 % 6.7 % 7.1 % 7.5 %\nSG&A expenses for the fourth quarter of fiscal 2022 declined primarily due to the additional week in fiscal 2021. SG&A expenses for fiscal 2022 increased due to the inclusion of the Planters® snack nuts business and higher marketing and advertising investments. As a percent of net sales, SG&A expenses declined for the full year, driven by record sales and disciplined cost management.\nAdvertising investments in fiscal 2022 were $157 million, representing a 14 percent increase compared to fiscal 2021.\nResearch and development continued to be a vital part of the Company's strategy to grow existing brands and expand into new branded items. Research and development expenses were $34.7 million in fiscal 2022, compared to $33.6 million in fiscal 2021.\nEquity in Earnings of Affiliates\nFourth Quarter Ended Fiscal Year Ended\nOctober 30, October 31, October 30, October 31,\nIn thousands 2022 2021 % Change 2022 2021 % Change\nEquity in Earnings of Affiliates $ 7,234 $ 10,041 (28.0) $ 27,185 $ 47,763 (43.1)\nEquity in earnings of affiliates for the fourth quarter and full year of fiscal 2022 decreased significantly due to lower results for MegaMex Foods. MegaMex Foods results were negatively impacted by inflationary pressures, including significantly higher costs for avocados.\nThe Company accounts for its majority-owned operations under the consolidation method. Investments in which the Company owns a minority interest, and for which there are no other indicators of control, are accounted for under the equity or cost method. These investments, along with receivables from other affiliates, are included on the Consolidated Statements of Financial Position as Investments in Affiliates. The composition of this line item as of October 30, 2022, was as follows:\nIn thousands Investments in Affiliates\nU.S. $ 192,577\nForeign 78,481\nTotal $ 271,058\nInterest and Investment Income and Interest Expense\nFourth Quarter Ended Fiscal Year Ended\nOctober 30, October 31, October 30, October 31,\nIn thousands 2022 2021 % Change 2022 2021 % Change\nInterest and Investment Income $ 7,933 $ 10,138 (21.7) $ 28,012 $ 46,878 (40.2)\nInterest Expense 17,602 15,589 12.9 62,515 43,307 44.4\nInterest and investment income decreased in the fourth quarter and full year of fiscal 2022 primarily due to losses on the rabbi trust. Interest expense in fiscal 2022 reflects the full year impact of debt issued in 2021.\nEffective Tax Rate\nFourth Quarter Ended Fiscal Year Ended\nOctober 30, October 31, October 30, October 31,\n2022 2021 2022 2021\nEffective Tax Rate 21.7 % 20.0 % 21.7 % 19.3 %\nThe effective tax rate for fiscal 2021 included the benefit of one-time state tax discrete items. For additional information, refer to Note N - Income Taxes of the Notes to the Consolidated Financial Statements.\nSEGMENT RESULTS\nNet sales and segment profit for each of the Companys reportable segments are set forth below. The Company is an integrated enterprise, characterized by substantial intersegment cooperation, cost allocations, and sharing of assets. Therefore, the Company does not represent that these segments, if operated independently, would report the profit and other financial information shown below. Additional segment financial information can be found in Note P - Segment Reporting of the Notes to the Consolidated Financial Statements.\nFourth Quarter Ended Fiscal Year Ended\nOctober 30, October 31, October 30, October 31,\nIn thousands 2022 2021 % Change 2022 2021 % Change\nNet Sales\nRetail $ 2,066,454 $ 2,181,048 (5.3) $ 7,987,598 $ 7,418,079 7.7\nFoodservice 1,009,672 1,043,634 (3.3) 3,691,408 3,130,174 17.9\nInternational 207,350 230,068 (9.9) 779,799 837,936 (6.9)\nTotal Net Sales $ 3,283,475 $ 3,454,751 (5.0) $ 12,458,806 $ 11,386,189 9.4\nSegment Profit\nRetail $ 198,852 $ 167,551 18.7 $ 721,832 $ 690,127 4.6\nFoodservice 148,203 163,367 (9.3) 547,686 431,992 26.8\nInternational 28,810 38,970 (26.1) 107,642 116,585 (7.7)\nTotal Segment Profit 375,865 369,888 1.6 1,377,161 1,238,704 11.2\nNet Unallocated Expense 18,498 17,669 4.7 99,297 112,836 (12.0)\nNoncontrolling Interest 128 12 994.1 239 301 (20.6)\nEarnings Before Income Taxes $ 357,495 $ 352,230 1.5 $ 1,278,103 $ 1,126,170 13.5\nRetail\nFourth Quarter Ended Fiscal Year Ended\nOctober 30, October 31, October 30, October 31,\nIn thousands 2022 2021 % Change 2022 2021 % Change\nVolume (lbs.) 810,044 980,339 (17.4) 3,245,625 3,546,324 (8.5)\nNet Sales $ 2,066,454 $ 2,181,048 (5.3) $ 7,987,598 $ 7,418,079 7.7\nSegment Profit 198,852 167,551 18.7 721,832 690,127 4.6\nNet sales for the fourth quarter of fiscal 2022 decreased due to the impact from an additional week in the fourth quarter of last year and lower commodity sales. These declines more than offset strong demand for Skippy® peanut butter and the impact of pricing actions across the global flavors and convenient meals and proteins verticals. For fiscal 2022, net sales increased primarily due to the inclusion of the Planters® snack nuts business and the impact from strategic pricing actions. Consistent with the Company's long-term strategy to better align resources to value-added growth, the overall decline in volume for the fourth quarter and full year of fiscal 2022 was primarily due to lower commodity sales resulting from the Company's new pork supply agreement, in addition to supply impacts on the Company's vertically integrated supply chain as a result of HPAI.\nFor the fourth quarter of fiscal 2022, segment profit increased due to higher commodity turkey prices, improved value-added mix, and pricing actions to offset the impact from continued inflationary pressures. Fiscal 2022 segment profit increased, as the contribution from the Planters® snack nuts business and higher commodity turkey prices more than offset the impact of inflationary pressures and lower results from MegaMex Foods.\nFoodservice\nFourth Quarter Ended Fiscal Year Ended\nOctober 30, October 31, October 30, October 31,\nIn thousands 2022 2021 % Change 2022 2021 % Change\nVolume (lbs.) 266,447 301,111 (11.5) 1,027,124 1,007,667 1.9\nNet Sales $ 1,009,672 $ 1,043,634 (3.3) $ 3,691,408 $ 3,130,174 17.9\nSegment Profit 148,203 163,367 (9.3) 547,686 431,992 26.8\nVolume and net sales declined in the fourth quarter of fiscal 2022 due to the impact from an additional week in the fourth quarter of fiscal 2021 and lower turkey sales. Partially offsetting these declines, products such as Hormel® Natural Choice® meats, Hormel® Bacon 1TM fully cooked bacon and Hormel® Fire BraisedTM flame-seared meats grew volume and sales for the fourth quarter of fiscal 2022. Fiscal 2022 volume and net sales increased due to strong results across the portfolio as the industry continued to recover from pandemic-related declines and from the inclusion of the Planters® snack nuts business in the convenience channel.\nThe decline in segment profit for the fourth quarter of fiscal 2022 was driven by the impact from an additional week in the fourth quarter of fiscal 2021 and higher operational, logistics and raw material costs. Segment profit growth for fiscal 2022 was primarily due to significantly higher net sales as described above.\nInternational\nFourth Quarter Ended Fiscal Year Ended\nOctober 30, October 31, October 30, October 31,\nIn thousands 2022 2021 % Change 2022 2021 % Change\nVolume (lbs.) 83,999 98,399 (14.6) 331,421 379,145 (12.6)\nNet Sales $ 207,350 $ 230,068 (9.9) $ 779,799 $ 837,936 (6.9)\nSegment Profit 28,810 38,970 (26.1) 107,642 116,585 (7.7)\nIn the fourth quarter of fiscal 2022, volume and net sales growth from the SPAM® and Skippy® brands and the multinational businesses were more than offset by lower commodity turkey, fresh pork and refrigerated export sales. For fiscal 2022, volume and sales declined as a result of lower commodity sales due to the Company's new pork supply agreement, lower turkey sales as a result of the supply impacts on the Company's vertically integrated supply chain from HPAI, and ongoing export logistics challenges.\nSegment profit declined in the fourth quarter of fiscal 2022, as growth in China did not overcome the impact of lower commodity turkey sales, lower branded export margins, and higher logistics expenses for the export business. Segment profit for fiscal 2022 declined due in large part to lower results from the export business, which was negatively impacted by logistics challenges and meaningfully higher freight expenses.\nUnallocated Income and Expense\nThe Company does not allocate deferred compensation, investment income, interest expense, or interest income to its segments when measuring performance. The Company also retains various other income and unallocated expenses at the corporate level. Equity in Earnings of Affiliates is included in segment profit; however, earnings attributable to the Companys corporate venturing investments and noncontrolling interests are excluded.\nFourth Quarter Ended Fiscal Year Ended\nOctober 30, October 31, October 30, October 31,\nIn thousands 2022 2021 2022 2021\nNet Unallocated Expense $ 18,498 $ 17,669 $ 99,297 $ 112,836\nNoncontrolling Interest 128 12 239 301\nFor the fourth quarter of fiscal 2022, net unallocated expense increased slightly as unfavorable investment performance was mostly offset with lower corporate expense.\nFor fiscal 2022, net unallocated expense decreased due to one-time acquisition costs and accounting adjustments of $43 million related to the acquisition of the Planters® snack nuts business in fiscal 2021. The overall decline was partially offset by higher interest expense and lower investment income net of deferred compensation.\nNon-GAAP Financial Measures\nThe non-GAAP financial measure of adjusted diluted earnings per share is presented to provide investors with additional information to facilitate the comparison of past and present operations. This measurement excludes the impact of the acquisition-related expenses and accounting adjustments related to the acquisition of the Planters® snack nuts business. The tax impact was calculated using the effective tax rate for the quarter in which the expenses and accounting adjustments were incurred.\nThe non-GAAP financial measures of organic volume and organic net sales are presented to provide investors with additional information to facilitate the comparison of past and present operations. Organic volume and organic net sales exclude the impacts of the acquisition of the Planters® snack nuts business (June 2021) in the Retail, Foodservice, and International segments. Organic volume and organic net sales also exclude the impact of the 53rd week in fiscal 2021 as approximated based on average weekly sales for the fourth quarter (fourteen weeks) ended October 31, 2021.\nThe Company provides earnings before interest and taxes (EBIT) and earnings before interest, taxes, depreciation, and amortization (EBITDA) because these measures are useful to management and investors as indicators of operating strength relative to prior years and are commonly used to benchmark the Companys performance.\nThe Company believes these non-GAAP financial measures provide useful information to investors because they are the measures used to evaluate performance on a comparable year-over-year basis. Non-GAAP measures are not intended to be a substitute for U.S. GAAP measures in analyzing financial performance. These non-GAAP measures are not in accordance with generally accepted accounting principles and may be different from non-GAAP measures used by other companies.\nThe following tables show the calculations to reconcile from the GAAP measures to the non-GAAP adjusted measures.\nADJUSTED DILUTED EARNINGS PER SHARE (NON-GAAP)\nFiscal Year Ended\nOctober 30, 2022 October 31, 2021\nIn thousands, except per share amounts Reported\nGAAP Reported\nGAAP Acquisition Costs and Adjustments\nNon-GAAP Non-GAAP\n% Change\nNet Sales $ 12,458,806 $ 11,386,189 $ - $ 11,386,189 9.4\nCost of Products Sold 10,294,120 9,458,283 (12,900) 9,445,383 9.0\nGross Profit 2,164,686 1,927,906 12,900 1,940,806 11.5\nSelling, General, and Administrative 879,265 853,071 (30,303) 822,768 6.9\nEquity in Earnings of Affiliates 27,185 47,763 - 47,763 (43.1)\nOperating Income 1,312,607 1,122,599 43,203 1,165,802 12.6\nInterest and Investment Income (Expense) 28,012 46,878 - 46,878 (40.2)\nInterest Expense 62,515 43,307 - 43,307 44.4\nEarnings Before Income Taxes 1,278,103 1,126,170 43,203 1,169,373 9.3\nProvision for Income Taxes 277,877 217,029 5,975 223,004 24.6\nNet Earnings 1,000,226 909,140 37,228 946,368 5.7\nLess: Net Earnings Attributable to Noncontrolling Interest 239 301 - 301 (20.5)\nNet Earnings Attributable to Hormel Foods Corporation $ 999,987 $ 908,839 $ 37,228 $ 946,067 5.7\nDiluted Net Earnings Per Share $ 1.82 $ 1.66 $ 0.06 $ 1.73 5.2\nORGANIC VOLUME (NON-GAAP)\nFourth Quarter Ended\nOctober 30, 2022 October 31, 2021\nLbs., in thousands Reported\n(GAAP) Reported\n(GAAP) 53rd Week\nOrganic\n(Non-GAAP) Organic\n% Change\nRetail 810,044 980,339 (70,024) 910,315 (11.0)\nFoodservice 266,447 301,111 (21,508) 279,603 (4.7)\nInternational 83,999 98,399 (7,029) 91,371 (8.1)\nTotal Volume 1,160,490 1,379,848 (98,561) 1,281,287 (9.4)\nFiscal Year Ended\nOctober 30, 2022 October 31, 2021\nLbs., in thousands Reported\n(GAAP) Acquisitions Organic\n(Non-GAAP) Reported\n(GAAP) 53rd Week\nOrganic\n(Non-GAAP) Organic\n% Change\nRetail 3,245,625 (138,186) 3,107,439 3,546,324 (70,024) 3,476,300 (10.6)\nFoodservice 1,027,124 (22,127) 1,004,997 1,007,667 (21,508) 986,159 1.9\nInternational 331,421 (3,503) 327,918 379,145 (7,029) 372,117 (11.9)\nTotal Volume 4,604,169 (163,817) 4,440,352 4,933,136 (98,561) 4,834,575 (8.2)\nORGANIC NET SALES (NON-GAAP)\nFourth Quarter Ended\nOctober 30, 2022 October 31, 2021\nIn thousands Reported\n(GAAP) Reported\n(GAAP) 53rd Week\nOrganic\n(Non-GAAP) Organic\n% Change\nRetail $ 2,066,454 $ 2,181,048 $ (155,789) $ 2,025,259 2.0\nFoodservice 1,009,672 1,043,634 (74,545) 969,089 4.2\nInternational 207,350 230,068 (16,433) 213,635 (2.9)\nTotal Net Sales $ 3,283,475 $ 3,454,751 $ (246,768) $ 3,207,983 2.4\nFiscal Year Ended\nOctober 30, 2022 October 31, 2021\nIn thousands Reported\n(GAAP) Acquisitions Organic\n(Non-GAAP) Reported\n(GAAP) 53rd Week\nOrganic\n(Non-GAAP) Organic\n% Change\nRetail $ 7,987,598 $ (514,708) $ 7,472,890 $ 7,418,079 $ (155,789) $ 7,262,290 2.9\nFoodservice 3,691,408 (80,979) 3,610,429 3,130,174 (74,545) 3,055,629 18.2\nInternational 779,799 (9,877) 769,922 837,936 (16,433) 821,503 (6.3)\nTotal Net Sales $ 12,458,806 $ (605,565) $ 11,853,241 $ 11,386,189 $ (246,768) $ 11,139,421 6.4\nEBIT AND EBITDA (NON-GAAP)\nFiscal Year Ended\nIn thousands October 30, 2022 October 31, 2021\nEBIT:\nNet Earnings Attributable to Hormel Foods Corporation $ 999,987 $ 908,839\nPlus: Income Tax Expense 277,877 217,029\nPlus: Interest Expense 62,515 43,307\nLess: Interest and Investment Income 28,012 46,878\nEBIT $ 1,312,367 $ 1,122,297\nEBITDA:\nEBIT per above 1,312,367 1,122,297\nPlus: Depreciation and Amortization 235,885 209,309\nEBITDA $ 1,548,252 $ 1,331,606\nLIQUIDITY AND CAPITAL RESOURCES\nWhen assessing liquidity and capital resources, the Company evaluates cash and cash equivalents, short-term and long-term investments, income from operations, and borrowing capacity.\nCash Flow Highlights\nFiscal Year Ended\nIn millions October 29, 2023 October 30, 2022\nCash and Cash Equivalents $ 737 $ 982\nCash Provided By (Used in) Operating Activities 1,048 1,135\nCash Provided by (Used in) Investing Activities (690) (258)\nCash Provided by (Used in) Financing Activities (600) (487)\nCash and cash equivalents decreased in fiscal 2023. The Companys income from operations was sufficient to cover dividend payments and capital expenditures. Cash on hand was also used to fund an investment in Garudafood, a food and beverage company in Indonesia. Additional details related to significant drivers of cash flows are provided below.\nCash Provided by (Used in) Operating Activities\n▪Cash flows from operating activities were largely impacted by changes in operating assets and liabilities.\n-Accounts receivable decreased $49 million in fiscal 2023 primarily due to timing of sales and more efficient collections. The $28 million decrease in fiscal 2022 is largely due to timing of collections.\n-In fiscal 2023, inventory decreased $36 million as a result of strategic inventory management efforts implemented to address elevated inventory levels. The $352 million increase in fiscal 2022 is due to inflation in raw material and other input costs and maintaining higher inventory levels.\n-Prepaid expenses and other assets increased $69 million in fiscal 2023 primarily due to cash collateral requirements for the Company's hedging programs and timing of payments related to infrastructure improvement commitments. The increase in fiscal 2022 of $15 million is primarily due to the timing of payments.\n-Accounts payable and accrued expenses decreased $141 million in fiscal 2023 related to the timing of payments and lower promotional and incentive compensation expenses. In fiscal 2022, accounts payable and accrued expenses decreased $15 million related to the timing of payments.\nCash Provided by (Used in) Investing Activities\n▪In fiscal 2023, the Company acquired a minority interest in Garudafood for $426 million, including associated transaction costs.\n▪Capital expenditures were $270 million and $279 million in fiscal 2023 and 2022, respectively. The largest projects for fiscal 2023 included a new production line for the SPAM® family of products in Dubuque, Iowa, initial phases of the transition from harvest to value-added capacity in Barron, Wisconsin, wastewater infrastructure in Austin, Minnesota, and pepperoni capacity in Omaha, Nebraska. The largest spend in fiscal 2022 also included the capacity expansion for SPAM® and pepperoni as well as for bacon in Austin, Minnesota.\nCash Provided by (Used in) Financing Activities\n▪Cash dividends paid to the Companys shareholders are an ongoing financing activity for the Company with payments totaling $593 million in fiscal 2023 and $558 million in fiscal 2022. The dividend rate was $1.10 per share in fiscal 2023 compared to $1.04 per share in fiscal 2022.\n▪During fiscal 2023, the Company repurchased 310,000 shares for $12 million.\nSources and Uses of Cash\nThe Company's balanced business model, with diversification across raw material inputs, channels, and categories, provides stability in ever changing economic environments. The Company maintains a disciplined capital allocation strategy by applying a waterfall approach, which focuses first on required uses of cash such as capital expenditures to maintain facilities, dividend returns to investors, mandatory debt repayments, and pension obligations. Next, the Company looks to strategic items in support of growth initiatives such as capital projects, acquisitions, additional dividend increases, and working capital investments. Finally, the Company evaluates opportunistic uses including incremental debt repayment and share repurchases.\nThe Company believes its anticipated income from operations, cash on hand, borrowing capacity under the current credit facility, and access to capital markets will be adequate to meet all short-term and long-term commitments. The Company continues to look for opportunities to make investments and acquisitions that align with its strategic priorities. The Company's ability to leverage its balance sheet through the issuance of debt provides the flexibility to pursue strategic opportunities which may require additional funding.\nDividend Payments\nThe Company remains committed to providing returns to investors through cash dividends. The Company has paid 381 consecutive quarterly dividends since becoming a public company in 1928. The annual dividend rate for fiscal 2024 will increase to $1.13 per share, representing the 58th consecutive annual dividend increase.\nCapital Expenditures\nCapital expenditures are first allocated to required maintenance and then growth opportunities based on the needs of the business. Capital expenditures supporting growth opportunities in fiscal 2024 are expected to focus on projects related to value-added capacity, infrastructure, and new technology. Capital expenditures for fiscal 2024 are estimated to be $280 million.\nDebt\nAs of October 29, 2023, the Companys outstanding debt included $3.3 billion of fixed rate unsecured senior notes due in fiscal 2024, 2028, 2030, and 2051 with interest payable semi-annually. During fiscal 2023, the Company made $55 million of interest payments and expects to make $55 million of interest payments in fiscal 2024 on these notes. In fiscal 2023, $950 million of the notes was reclassified as Current Maturities of Long-term Debt on the Consolidated Statements of Financial Position. See Note L - Long-Term Debt and Other Borrowing Arrangements of the Notes to the Consolidated Financial Statements for additional information.\nBorrowing Capacity\nAs a source of short-term financing, the Company maintains a $750 million unsecured revolving credit facility. The maximum commitment under this credit facility may be further increased by $375 million, generally by mutual agreement of the lenders and\nthe Company, subject to certain customary conditions. Funds drawn from this facility may be used by the Company to refinance existing debt, for working capital or other general corporate purposes, and for funding acquisitions. The lending commitments under the facility are scheduled to expire on May 6, 2026, at which time the Company will be required to pay in full all obligations then outstanding. As of October 29, 2023, the Company had no outstanding draws from this facility.\nDebt Covenants\nThe Companys debt and credit agreements contain customary terms and conditions including representations, warranties, and covenants. These debt covenants limit the ability of the Company to, among other things, incur debt for borrowed money secured by certain liens, engage in certain sale and leaseback transactions, and require maintenance of certain consolidated leverage ratios. As of October 29, 2023, the Company was in compliance with all covenants and expects to maintain compliance in the future.\nCash Held by International Subsidiaries\nAs of October 29, 2023, the Company had $164 million of cash and cash equivalents held by international subsidiaries. The Company maintains all undistributed earnings as permanently reinvested. The Company evaluates the balance and uses of cash held internationally based on the needs of the business.\nShare Repurchases\nThe Company is authorized to repurchase 3,677,494 shares of common stock as part of an existing plan approved by the Companys Board of Directors. During fiscal 2023, the Company repurchased 310,000 shares for $12 million. The Company continues to evaluate share repurchases as part of its capital allocation strategy.\nCommitments\nThe following table shows a schedule of the Company's material cash commitments as of October 29, 2023:\nIn millions Payments Due by Periods\nTotal Less than 1 year 1-3 years 3-5 years More than 5 years\nPurchase Commitments(1)\n$ 2,763 $ 1,229 $ 1,178 $ 298 $ 59\nDebt Repayments(2)\n3,300 950 - 750 1,600\nInterest Payments on Long-term Debt(2)\n708 55 98 98 457\nPension & Other Post-retirement Benefit Payments(3)\n1,138 104 217 227 590\nLease Obligations(4)\n194 41 69 47 36\nOther Commitments(5)\n110 51 59 - -\n(1) The Company commits to purchase quantities of livestock, grain, and other raw materials to ensure a steady supply of production inputs. The Company uses hedging programs to manage price risk associated with a portion of the future grain and hog commitments. The purchase commitments listed above do not reflect the impact of the hedging instruments that manage the risk of fluctuating commodity markets. See Note F - Derivatives and Hedging and Note J - Commitments and Contingencies of the Notes to the Consolidated Financial Statements for additional information.\n(2) As of October 29, 2023, the Companys outstanding debt included unsecured senior notes due in fiscal 2024, 2028, 2030, and 2051. The Company is required by certain covenants in its debt agreements to maintain specified levels of financial ratios and financial position. See Note L - Long-Term Debt and Other Borrowing Arrangements of the Notes to the Consolidated Financial Statements for additional information.\n(3) Represents pension and other post-retirement benefit payments related to the Company's unfunded defined benefit plans. Benefit payments reflect expectations for the next ten years as estimates are not readily available beyond that point. See Note G - Pension and Other Post-Retirement Benefits of the Notes to the Consolidated Financial Statements for additional information.\n(4) See Note K - Leases of the Notes to the Consolidated Financial Statements for additional detail. Lease payments exclude $31.2 million of legally binding minimum lease payments for leases signed but not yet commenced.\n(5) Includes obligations related to infrastructure improvements supporting various manufacturing facilities and a media advertising agreement.\nOff Balance Sheet Arrangements\nAs of October 29, 2023, the Company had $48.6 million of standby letters of credit issued on its behalf. The standby letters of credit are primarily related to the Companys self-insured workers compensation programs. This amount includes revocable standby letters of credit totaling $2.7 million for obligations of an affiliated party that may arise under workers compensation claims. Letters of credit are not reflected on the Consolidated Statements of Financial Position.\nCRITICAL ACCOUNTING ESTIMATES\nManagement's discussion and analysis of financial condition and results of operations is based upon the Company's consolidated financial statements, which have been prepared in accordance with U.S. generally accepted accounting principles. The preparation of these financial statements requires the Company to make estimates, judgments, and assumptions that can\nhave a meaningful effect on the reporting of consolidated financial statements. See Note A - Summary of Significant Accounting Policies of the Notes to the Consolidated Financial Statements for additional information.\nCritical accounting estimates are defined as those reflective of significant judgments, estimates and uncertainties, which may result in materially different results under different assumptions and conditions. The Company believes the following are its critical accounting estimates:\nRevenue Recognition\nDescription: The Company recognizes sales at the point in time when the performance obligation has been satisfied and control of the product has transferred to the customer. Obligations for the Company are usually fulfilled once shipped product is received or picked up by the customer. Revenue is recorded net of applicable provisions for discounts, returns, and allowances.\nJudgments and Uncertainties: The Company offers various sales incentives to customers and consumers. Incentives offered off-invoice include prompt pay allowances, will call allowances, spoilage allowances, and temporary price reductions. These incentives are recognized as reductions of revenue at the time control is transferred. Coupons are used as an incentive for consumers to purchase various products. The coupons reduce revenue at the time they are offered, based on estimated redemption rates. Promotional contracts are performed by customers to promote the Companys products to consumers. These incentives reduce revenue at the time of performance through direct payments and accrued promotional funds. Accrued promotional funds are unpaid liabilities for promotional contracts in process or completed at the end of a quarter or fiscal year. Accruals with customers are based on defined performance.\nSensitivity of Estimate to Change: The liability relating to these agreements is based on a review of the outstanding contracts on which performance has taken place but which the promotional payments relating to such contracts remain unpaid as of the end of the fiscal year. The level of customer performance and the historical spend rate versus contracted rates are estimates used to determine these liabilities.\nIncome Taxes\nDescription: The Company records income taxes in accordance with the liability method of accounting. Deferred taxes are recognized for the estimated taxes ultimately payable or recoverable based on enacted tax law. Changes in enacted tax rates are reflected in the tax provision as they occur.\nJudgments and Uncertainties: The Company computes its provision for income taxes based on the statutory tax rates and tax planning opportunities available to it in the various jurisdictions in which it operates. Judgment is required in evaluating the Companys tax positions and determining its annual tax provision.\nSensitivity of Estimate to Change: While the Company considers all of its tax positions fully supportable, the Company is occasionally challenged by various tax authorities regarding the amount of taxes due. The Company recognizes a tax position in its financial statements when it is more likely than not the position will be sustained upon examination, based on its technical merits. The position is then measured at the largest amount of benefit that is greater than 50 percent likely of being realized upon ultimate settlement. A change in judgment related to the expected ultimate resolution of uncertain tax positions will be recognized in earnings in the quarter of such change. As of October 29, 2023, the Company had $21.5 million of unrecognized tax benefits, including estimated interest and penalties, recorded in Other Long-term Liabilities.\nBusiness Combinations\nDescription: The Company accounts for business combinations using the acquisition method of accounting. The Company allocates the purchase price of an acquired business to the assets acquired and liabilities assumed based upon their estimated fair values at the acquisition date with the excess recorded as Goodwill.\nJudgments and Uncertainties: The acquisition method of accounting requires the Company to make significant estimates and assumptions regarding the fair value of the acquired assets. Fair value of the assets and liabilities acquired is determined through established valuation techniques, such as the income, cost or market approach. The Company may utilize third-party valuation experts to assist in the fair value determination. The fair value measurements of identifiable intangibles are based on available historical information and expectations and assumptions about the future. Significant assumptions used to value identifiable intangible assets may include projected revenue growth, estimated cash flows, discount rates, royalty rates, and other factors.\nDetermining the useful life of an intangible asset also requires judgment. Certain acquired brands are expected to have indefinite lives based on their history and the Companys intent to continue to support and build the brands. Other acquired assets, such as customer relationships, are expected to have determinable useful lives.\nSensitivity of Estimate to Change: The Company did not have any business combinations in fiscal 2023 and 2022. On June 7, 2021, the Company acquired the Planters® snack nuts business for $3.4 billion and used a third-party valuation specialist to perform the valuation of the assets acquired. Refer to Note B - Acquisitions and Divestitures of the Notes to the Consolidated\nFinancial Statements for additional information. The Company acquired trade names which were determined to have a fair value of $712.0 million. Key assumptions used to calculate the fair value of the trade names using a relief from royalty model included revenue projections, royalty rates, and discount rates. The Company also identified customer relationships which were assigned a fair value of $51.0 million using the distributor method under the income approach. Assumptions in valuing this asset included future earnings projections, customer attrition rate, and discount rate, among others. The Company believes the estimates applied are based on reasonable assumptions, but which are inherently uncertain. As a result, actual results may differ from the assumptions and judgments used to determine fair value of the assets acquired, which could result in material impairment losses in the future.\nGoodwill and Other Indefinite-Lived Intangibles\nDescription: Other indefinite-lived intangible assets primarily include trade names obtained through business acquisitions which are originally recorded at their estimated fair values at the date of acquisition. Goodwill is the residual after allocating the purchase price to net assets acquired and is allocated across the Companys reporting units: Retail, Foodservice, and International. Goodwill and indefinite-lived intangible assets are not amortized but tested annually for impairment, or more frequently if impairment indicators arise. If the carrying value of these assets exceeds the estimated fair value, the asset is considered impaired which requires a reduction to earnings. See Note A - Summary of Significant Accounting Policies of the Notes to the Consolidated Financial Statements for additional details regarding the Companys procedures.\nJudgments and Uncertainties: Determining whether impairment indicators exist and estimating the fair value of the Companys goodwill reporting units and intangible assets for impairment testing requires significant judgment. Indefinite-lived trade names are evaluated for impairment using an income approach utilizing the relief from royalty method. Significant assumptions include royalty rate, annual projected revenue, discount rate, and estimated long-term growth rate. Estimating the fair value of goodwill reporting units using the discounted cash flow model requires management to make assumptions and projections of future cash flows, revenues, earnings, discount rates, long-term growth rates, and other factors.\nSensitivity of Estimate to Change: The assumptions used to assess impairment consider historical trends, macroeconomic conditions, and projections consistent with the Companys operating strategy. Changes in these estimates can have a significant impact on the assessment of fair value which could result in material impairment losses.\nAs a result of organizational changes in the first quarter of fiscal 2023, the Company conducted an assessment of its operating segments and reporting units. Based on this analysis, goodwill was reallocated using the relative fair value approach. Prior to the goodwill reallocation, an impairment assessment was performed which indicated no impairment to the Company's reporting units. Subsequent to the goodwill reallocation, the Company completed quantitative impairment testing on each new reporting unit. The estimated fair value of each goodwill reporting unit exceeded the calculated carrying value by more than 50 percent. During the fourth quarter of fiscal 2023, the Company performed a qualitative assessment of goodwill. No goodwill impairment charges were recorded as a result of the assessment. Based on the quantitative testing performed in the first quarter of fiscal 2023, a 10 percent decline in projected cash flows or 10 percent increase in the discount rate would not result in an impairment.\nThe Company also performed a qualitative impairment assessment for indefinite-lived intangible assets in the fourth quarter of fiscal 2023. As a result of the qualitative assessment, it was determined that it was more likely than not the Justin's® trade name was impaired, and the Company performed a quantitative impairment test. As a result of the quantitative impairment test, a $28.4 million intangible asset impairment charge was recorded for the Justin's® trade name. No other impairment charges were recorded as a result of the qualitative assessment. The Company last completed quantitative testing for the other indefinite-lived intangible assets in fiscal 2021 and the estimated fair value of each indefinite-lived intangible asset exceeded the carrying value by more than 10 percent. Based on the fiscal 2021 testing, a 10 percent decline in forecasted revenue or 10 percent increase in the discount rate would not result in a material impairment. Based on the fiscal 2023 quantitative impairment test, a 10 percent decline in forecasted revenue or 10 percent increase in the discount rate used for the Justin's® trade name would not result in additional material impairment.\nPension and Other Post-Retirement Benefits\nDescription: The Company sponsors several defined benefit pension and post-retirement health care benefit plans and recognizes the associated expenses, assets, and liabilities.\nJudgments and Uncertainties: In accounting for these employment costs and the associated benefit obligations, management must make a variety of assumptions and estimates including mortality rates, discount rates, compensation increases, expected return on plan assets, health care cost trend rates, and interest crediting rates. The Company considers historical data as well as current facts and circumstances when determining these estimates. Expected long-term rate of return on plan assets is based on fair value, composition of the asset portfolio, historical long-term rates of return, and estimates of future performance. Mortality and discount rates used are based on actuarial tables elected at each fiscal year-end. The Company uses third-party specialists to assist in the determination of these estimates and the calculation of certain employee benefit expenses and the outstanding obligation.\nBenefit plan assets are stated at fair value. Due to the lack of readily available market prices, private equity investments are valued by models using a combination of available market data and unobservable inputs that consider earnings multiples, discounted cash flows, and other qualitative and quantitative factors. Other benefit plan investments are measured at Net Asset Value (NAV) per share of the fund's underlying investments as a practical expedient.\nSensitivity of Estimate to Change: The assumed discount rate, expected long-term rate of return on plan assets, rate of future compensation increase, interest crediting rate, and the health care cost trend rate have a significant impact on the amounts reported for the benefit plans. For the year ended October 29, 2023, the Company had $1.2 billion and $186.2 million in pension benefit obligation and post-retirement benefit obligation, respectively. For fiscal 2024, the Company expects pension benefit costs of $44.3 million and post-retirement benefit costs of $10.5 million. A one-percentage-point change in these rates would have the following effects:\nOne-Percentage-Point\nBenefit Cost Benefit Obligation\nIn millions Increase Decrease Increase Decrease\nPension Benefits\nDiscount Rate $ (11.0) $ 13.0 $ (108.5) $ 129.7\nExpected Long-term Rate of Return on Plan Assets (11.5) 11.5 - -\nRate of Future Compensation Increase 1.7 (1.5) 1.0 (1.3)\nInterest Crediting Rate 4.3 (3.6) 11.6 (10.2)\nPost-retirement Benefits\nDiscount Rate $ (0.2) $ 0.3 $ (12.4) $ 14.3\nHealth Care Cost Trend Rate 1.0 (0.9) 14.3 (12.6)\nAs of October 29, 2023, the Company had $79.4 million and $638.4 million of private equity and NAV investments, respectively. These valuations are subject to judgments and assumptions of the funds which may prove to be incorrect, resulting in risks of incorrect valuation of these investments. The Company seeks to mitigate these risks by evaluating the appropriateness of the funds judgments and assumptions by reviewing the financial data included in the funds financial statements. The Company also holds quarterly meetings with the investment adviser to review fund performance, which include comparisons to the relevant indices. On an annual basis, the Company performs pricing tests on certain underlying investments to gain additional assurance of the reliability of values received from the fund manager.\nSee Note G - Pension and Other Post-Retirement Benefits of the Notes to the Consolidated Financial Statements for additional information. Item 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nThe Company is exposed to various forms of market risk as a part of its ongoing business practices. The Company utilizes derivative instruments to mitigate earnings fluctuations due to market volatility.\nCommodity Price Risk: The Company is subject to commodity price risk primarily through grain, lean hog, and natural gas markets. To reduce these exposures and offset the fluctuations caused by changes in market conditions, the Company employs hedging programs. These programs utilize futures, swaps, and options contracts and are accounted for as cash flow hedges. The fair value of the Companys cash flow commodity contracts as of October 29, 2023, was $17.1 million compared to $21.6 million as of October 30, 2022. The Company measures its market risk exposure on its cash flow commodity contracts using a sensitivity analysis, which considers a hypothetical 10 percent change in the market prices. A 10 percent decrease in the market price would have negatively impacted the fair value of the Company's cash flow commodity contracts as of October 29, 2023, by $26.3 million, which in turn would lower the Company's future cost on purchased commodities by a similar amount.\nInterest Rate Risk: The Company is subject to interest rate risk primarily from changes in fair value of long-term fixed rate debt. As of October 29, 2023, the Companys long-term debt had a fair value of $2.7 billion compared to $2.7 billion as of October 30, 2022. The Company measures its market risk exposure of long-term fixed rate debt using a sensitivity analysis, which considers a 10 percent change in interest rates. A 10 percent decrease in interest rates would have positively impacted the fair value of the Companys long-term debt as of October 29, 2023, by $83.6 million. A 10 percent increase would have negatively impacted the long-term debt by $77.5 million.\nForeign Currency Exchange Rate Risk: The fair values of certain assets are subject to fluctuations in foreign currency exchange rates. The Company's net asset position in foreign currencies as of October 29, 2023, was $1.1 billion, compared to $652.4 million as of October 30, 2022, with most of the exposure existing in Indonesian rupiah, Chinese yuan, and Brazilian real. The Company currently does not use market risk sensitive instruments to manage this risk.\nInvestment Risk: The Company has corporate-owned life insurance policies classified as trading securities as part of a rabbi trust to fund certain supplemental executive retirement plans and deferred income plans. As of October 29, 2023, the balance of\nthese securities totaled $188.2 million compared to $186.2 million as of October 30, 2022. The rabbi trust is invested primarily in fixed income funds. The Company is subject to market risk due to fluctuations in the value of the remaining investments as unrealized gains and losses associated with these securities are included in the Companys net earnings on a mark-to-market basis. A 10 percent decline in the value of the investments not held in fixed income funds would have negatively impacted the Companys pretax earnings by approximately $7.8 million, while a 10 percent increase in value would have a positive impact of the same amount. Item 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nReport of Management\nManagements Responsibility for Financial Statements\nThe accompanying financial statements were prepared by the management of Hormel Foods Corporation which is responsible for their integrity and objectivity. These statements have been prepared in accordance with U.S. generally accepted accounting principles appropriate in the circumstances and, as such, include amounts that are based on our best estimates and judgments.\nHormel Foods Corporation has developed a system of internal controls designed to assure that the records reflect the transactions of the Company and that the established policies and procedures are adhered to. This system is augmented by well-communicated written policies and procedures, a strong program of internal audit and well-qualified personnel.\nThese financial statements have been audited by Ernst & Young LLP, an independent registered public accounting firm, and their report is included herein. The audit was conducted in accordance with the standards of the U.S. Public Company Accounting Oversight Board and includes a review of the Companys accounting and financial controls and tests of transactions.\nThe Audit Committee of the Board of Directors, composed solely of outside directors, meets periodically with the independent auditors, management, and the internal auditors to assure that each is carrying out its responsibilities. Both Ernst & Young LLP and our internal auditors have full and free access to the Audit Committee, with or without the presence of management, to discuss the results of their audit work and their opinions on the adequacy of internal controls and the quality of financial reporting.\nManagements Report on Internal Control Over Financial Reporting\nManagement of Hormel Foods Corporation is responsible for establishing and maintaining adequate internal control over financial reporting for the Company, as such term is defined in Exchange Act Rule 13a-15(f). The Companys internal control system is designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting standards. Under the supervision, and with the participation of management, including the Chief Executive Officer and Chief Financial Officer, we conducted an evaluation of the effectiveness of our internal control over financial reporting based on the framework in Internal Control - Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework).\nBased on our evaluation under the framework in Internal Control - Integrated Framework, we concluded that our internal control over financial reporting was effective as of October 29, 2023. Our internal control over financial reporting as of October 29, 2023, has been audited by Ernst & Young LLP, an independent registered public accounting firm, as stated in their report which is included herein.\n/s/ James P. Snee /s/ Jacinth C. Smiley\nJames P. Snee\nJacinth C. Smiley\nChairman of the Board, Executive Vice President\nPresident and Chief Executive Officer and Chief Financial Officer\nReport of Independent Registered Public Accounting Firm\nTo the Shareholders and the Board of Directors of Hormel Foods Corporation\nOpinion on Internal Control Over Financial Reporting\nWe have audited Hormel Foods Corporations internal control over financial reporting as of October 29, 2023, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) (the COSO criteria). In our opinion, Hormel Foods Corporation (the Company) maintained, in all material respects, effective internal control over financial reporting as of October 29, 2023, based on the COSO criteria.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated statements of financial position of the Company as of October 29, 2023 and October 30, 2022, the related consolidated statements of operations, comprehensive income, changes in shareholders investment and cash flows for each of the three years in the period ended October 29, 2023 and the related notes and schedule listed in the Index at Item 15 and our report dated December 6, 2023 expressed an unqualified opinion thereon.\nBasis for Opinion\nThe Companys management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting included in the accompanying Managements Report on Internal Control Over Financial Reporting. Our responsibility is to express an opinion on the Companys internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects.\nOur audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control Over Financial Reporting\nA companys internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A companys internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ Ernst & Young LLP\nMinneapolis, Minnesota\nDecember 6, 2023\nReport of Independent Registered Public Accounting Firm\nTo the Shareholders and the Board of Directors of Hormel Foods Corporation\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated statements of financial position of Hormel Foods Corporation (the Company) as of October 29, 2023 and October 30, 2022, the related consolidated statements of operations, comprehensive income, changes in shareholders investment and cash flows for each of the three years in the period ended October 29, 2023 and the related notes and financial statement schedule listed in the Index at Item 15 (collectively referred to as the consolidated financial statements). In our opinion, the consolidated financial statements present fairly, in all material respects, the financial position of the Company at October 29, 2023 and October 30, 2022, and the results of its operations and its cash flows for each of the three years in the period ended October 29, 2023, in conformity with U.S. generally accepted accounting principles.\nWe also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company's internal control over financial reporting as of October 29, 2023, based on criteria established in Internal Control-Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework) and our report dated December 6, 2023 expressed an unqualified opinion thereon.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current period audit of the financial statements that was communicated or required to be communicated to the audit committee and that: (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective or complex judgments. The communication of the critical audit matter does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the account or disclosure to which it relates.\nValuation of Alternative Investments - Pension Assets\nDescription of the Matter At October 29, 2023, the Company had $1.2 billion in plan assets related to the defined benefit pension plans. Approximately 61% of the total pension assets are in private equity funds, real estate - domestic funds, global stocks - collective investment funds, global stocks - gold funds, hedge funds, fixed income - hedge funds, and fixed income - collective investment funds. These types of investments are referred to as alternative investments. As documented in the notes of the financial statements, these alternative investments are valued at net asset value (NAV) or are valued using significant unobservable inputs.\nAuditing the fair value of these alternative investments is challenging because of the higher estimation uncertainty of the inputs to the fair value calculations, including the underlying NAVs, discounted cash flow valuations, comparable market valuations, and adjustments for currency, credit liquidity and other risks. Additionally, certain information regarding the fair value of these alternative investments is based on unaudited information available to management at the time of valuation.\nValuation of Alternative Investments - Pension Assets\nHow We Addressed the Matter in Our Audit We obtained an understanding, evaluated the design and tested the operating effectiveness of controls addressing the risk of material misstatement relating to valuation of alternative investments. This included testing management's review controls over the valuation of alternative investments, for example, a review of fund performance in comparison to the selected benchmark and meetings with the investment advisor on a quarterly basis to review market performance and fund returns in comparison with relevant indices and the investment policy. We also tested managements independent price testing of underlying investments performed for certain investments on a quarterly basis.\nOur audit procedures included, among others, inquiring of management and the investment advisor regarding changes to the investment portfolio and investment strategies. We confirmed the fair value of the investments and ownership interest directly with the fund managers. We inspected the trust statement for observable transactions near year end to compare to the estimated fair value. We also obtained the latest audited financial statements for certain investments, performed a rollforward of the investment balance to compute an estimated market return on investment, and compared the market return to relevant benchmarks.\n/s/ Ernst & Young LLP\nWe have served as the Company's auditor since 1931.\nMinneapolis, Minnesota\nDecember 6, 2023\nConsolidated Statements of Operations\nFiscal Year Ended\nOctober 29, October 30, October 31,\nIn thousands, except per share amounts 2023 2022 2021\nNet Sales $ 12,110,010 $ 12,458,806 $ 11,386,189\nCost of Products Sold 10,110,169 10,294,120 9,458,283\nGross Profit 1,999,841 2,164,686 1,927,906\nSelling, General, and Administrative 942,167 879,265 853,071\nEquity in Earnings of Affiliates 42,754 27,185 47,763\nGoodwill and Intangible Impairment\n28,383 - -\nOperating Income 1,072,046 1,312,607 1,122,599\nInterest and Investment Income 14,828 28,012 46,878\nInterest Expense 73,402 62,515 43,307\nEarnings Before Income Taxes 1,013,472 1,278,103 1,126,170\nProvision for Income Taxes 220,552 277,877 217,029\nNet Earnings 792,920 1,000,226 909,140\nLess: Net Earnings (Loss) Attributable to Noncontrolling Interest\n(653) 239 301\nNet Earnings Attributable to Hormel Foods Corporation $ 793,572 $ 999,987 $ 908,839\nNet Earnings Per Share:\nBasic $ 1.45 $ 1.84 $ 1.68\nDiluted $ 1.45 $ 1.82 $ 1.66\nWeighted-average Shares Outstanding:\nBasic 546,421 544,918 541,114\nDiluted 548,982 549,566 547,580\nSee Notes to the Consolidated Financial Statements\nConsolidated Statements of Comprehensive Income\nFiscal Year Ended\nOctober 29, October 30, October 31,\nIn thousands 2023 2022 2021\nNet Earnings $ 792,920 $ 1,000,226 $ 909,140\nOther Comprehensive Income (Loss), Net of Tax:\nForeign Currency Translation 3,588 (39,393) 13,379\nPension and Other Benefits 11,632 65,587 71,967\nDerivatives and Hedging\n(38,940) (5,267) 33,034\nEquity Method Investments\n6,847 - -\nTotal Other Comprehensive Income (Loss) (16,874) 20,927 118,380\nComprehensive Income 776,045 1,021,153 1,027,520\nLess: Comprehensive Income (Loss) Attributable to Noncontrolling Interest (836) (542) 700\nComprehensive Income Attributable to Hormel Foods Corporation $ 776,881 $ 1,021,695 $ 1,026,820\nSee Notes to the Consolidated Financial Statements\nConsolidated Statements of Financial Position\nOctober 29, October 30,\nIn thousands, except share and per share amounts 2023 2022\nAssets\nCash and Cash Equivalents $ 736,532 $ 982,107\nShort-term Marketable Securities 16,664 16,149\nAccounts Receivable (Net of Allowance for Doubtful Accounts of $3,557\nat October 29, 2023 and $3,507 at October 30, 2022)\n817,391 867,593\nInventories 1,680,406 1,716,059\nTaxes Receivable 7,242 7,177\nPrepaid Expenses and Other Current Assets 39,014 48,041\nTotal Current Assets 3,297,249 3,637,125\nGoodwill 4,928,464 4,925,829\nOther Intangibles 1,757,171 1,803,027\nPension Assets 204,697 245,566\nInvestments in Affiliates\n725,121 271,058\nOther Assets 370,252 283,169\nProperty, Plant, and Equipment\nLand 74,626 74,303\nBuildings 1,458,354 1,398,255\nEquipment 2,781,730 2,636,660\nConstruction in Progress 195,665 216,246\nLess: Allowance for Depreciation (2,344,557) (2,184,319)\nNet Property, Plant, and Equipment 2,165,818 2,141,146\nTotal Assets $ 13,448,772 $ 13,306,919\nLiabilities and Shareholders Investment\nAccounts Payable $ 771,397 $ 816,604\nAccrued Expenses 51,679 58,801\nAccrued Marketing Expenses 87,452 113,105\nEmployee-Related Expenses\n263,330 279,072\nInterest and Dividends Payable 172,178 163,963\nTaxes Payable 15,212 32,925\nCurrent Maturities of Long-term Debt 950,529 8,796\nTotal Current Liabilities 2,311,776 1,473,266\nLong-term Debt Less Current Maturities 2,358,719 3,290,549\nPension and Post-retirement Benefits 349,268 385,832\nDeferred Income Taxes 498,106 475,212\nOther Long-term Liabilities 191,917 141,840\nShareholders Investment\nPreferred Stock, Par Value $0.01 a Share - Authorized 160,000,000 Shares;\nIssued - None\n- -\nCommon Stock, Nonvoting, Par Value $0.01 a Share -\nAuthorized 400,000,000 Shares; Issued - None\n- -\nCommon Stock, Par Value $0.01465 a Share - Authorized 1,600,000,000 Shares;\nIssued 546,599,420 Shares October 29, 2023\nIssued 546,237,051 Shares October 30, 2022\n8,007 8,002\nAdditional Paid-in Capital 506,179 469,468\nAccumulated Other Comprehensive Loss (272,252) (255,561)\nRetained Earnings 7,492,952 7,313,374\nHormel Foods Corporation Shareholders Investment 7,734,885 7,535,284\nNoncontrolling Interest 4,100 4,936\nTotal Shareholders Investment 7,738,985 7,540,219\nTotal Liabilities and Shareholders Investment $ 13,448,772 $ 13,306,919\nSee Notes to the Consolidated Financial Statements\nConsolidated Statements of Changes in Shareholders Investment\nHormel Foods Corporation Shareholders\nIn thousands, except per Common Stock Treasury Stock Additional Paid-In Capital Retained Earnings Accumulated Other Comprehensive Income (Loss) Non-controlling Interest Total Shareholders Investment\nshare amounts Shares Amount Shares Amount\nBalance at October 25, 2020\n539,887 $ 7,909 - $ - $ 289,554 $ 6,523,335 $ (395,250) $ 4,778 $ 6,430,326\nNet Earnings 908,839 301 909,140\nOther Comprehensive Income\n(Loss) 117,981 399 118,380\nPurchases of Common Stock (469) (19,958) (19,958)\nStock-based Compensation\nExpense 38 1 24,743 24,744\nExercise of Stock Options/\nRestricted Shares 2,956 43 46,326 46,369\nShares Retired (469) (7) 469 19,958 (287) (19,664) -\nDeclared Dividends -\n$0.98 per Share\n(530,640) (530,640)\nBalance at October 31, 2021\n542,412 $ 7,946 - $ - $ 360,336 $ 6,881,870 $ (277,269) $ 5,478 $ 6,978,360\nNet Earnings 999,987 239 1,000,226\nOther Comprehensive Income\n(Loss) 21,708 (782) 20,927\nStock-based Compensation\nExpense 37 1 27,786 27,786\nExercise of Stock Options/\nRestricted Shares 3,787 55 79,871 79,927\nDeclared Dividends -\n$1.04 per Share\n1,475 (568,482) (567,007)\nBalance at October 30, 2022\n546,237 $ 8,002 - $ - $ 469,468 $ 7,313,374 $ (255,561) $ 4,936 $ 7,540,219\nNet Earnings 793,572 (653) 792,920\nOther Comprehensive Income\n(Loss) (16,691) (183) (16,874)\nPurchases of Common Stock (310) (12,303) (12,303)\nStock-based Compensation\nExpense 44 - 24,077 24,077\nExercise of Stock Options/\nRestricted Shares 629 9 12,009 12,018\nShares Retired (310) (5) 310 12,303 (277) (12,021) -\nDeclared Dividends -\n$1.10 per Share\n902 (601,974) (601,072)\nBalance at October 29, 2023\n546,599 $ 8,007 - $ - $ 506,179 $ 7,492,952 $ (272,252) $ 4,100 $ 7,738,985\nSee Notes to the Consolidated Financial Statements\nConsolidated Statements of Cash Flows\nFiscal Year Ended\nOctober 29, October 30, October 31,\nIn thousands 2023 2022 2021\nOperating Activities\nNet Earnings $ 792,920 $ 1,000,226 $ 909,140\nAdjustments to Reconcile to Net Cash Provided by\n(Used in) Operating Activities:\nDepreciation 227,331 213,026 183,772\nAmortization 25,980 22,859 25,537\nEquity in Earnings of Affiliates (42,754) (27,185) (47,763)\nDistributions Received from Equity Method Investees 38,160 43,039 44,999\nProvision for Deferred Income Taxes 31,794 177,000 28,677\nNon-cash Investment Activities (2,392) 19,298 (24,215)\nStock-based Compensation Expense 24,077 24,943 24,744\nOperating Lease Cost\n29,072 20,633 16,699\nGoodwill and Intangible Impairment\n28,383 - -\nOther Non-cash, Net\n20,034 12,931 6,129\nChanges in Operating Assets and Liabilities, Net of Acquisitions:\nDecrease (Increase) in Accounts Receivable 48,998 28,365 (191,627)\nDecrease (Increase) in Inventories 35,714 (351,663) (145,176)\nDecrease (Increase) in Prepaid Expenses and Other Assets (68,666) (15,460) 34,555\nIncrease (Decrease) in Pension and Post-retirement Benefits 18,272 (29,392) (15,448)\nIncrease (Decrease) in Accounts Payable and Accrued Expenses (140,519) (14,511) 115,099\nIncrease (Decrease) in Net Income Taxes Payable (18,557) 10,869 36,811\nNet Cash Provided by (Used in) Operating Activities 1,047,847 1,134,977 1,001,934\nInvesting Activities\nNet (Purchase) Sale of Securities (42) 2,493 (4,364)\nAcquisitions of Businesses and Intangibles - - (3,396,246)\nPurchases of Property, Plant, and Equipment\n(270,211) (278,918) (232,416)\nProceeds from Sales of Property, Plant, and Equipment\n5,322 1,224 2,216\nProceeds from (Purchases of) Affiliates and Other Investments\n(427,709) 2,404 (343)\nProceeds from Company-owned Life Insurance 3,096 14,761 5,315\nNet Cash Provided by (Used in) Investing Activities (689,544) (258,037) (3,625,839)\nFinancing Activities\nProceeds from Long-term Debt 1,980 - 2,276,292\nRepayments of Long-term Debt and Finance Leases (8,827) (8,673) (258,617)\nDividends Paid on Common Stock (592,932) (557,839) (523,114)\nShare Repurchase (12,303) - (19,958)\nProceeds from Exercise of Stock Options 12,018 79,827 45,919\nNet Cash Provided by (Used in) Financing Activities (600,064) (486,684) 1,520,520\nEffect of Exchange Rate Changes on Cash (3,814) (21,679) 2,606\nIncrease (Decrease) in Cash and Cash Equivalents (245,575) 368,577 (1,100,778)\nCash and Cash Equivalents at Beginning of Year 982,107 613,530 1,714,309\nCash and Cash Equivalents at End of Year $ 736,532 $ 982,107 $ 613,530\nSee Notes to the Consolidated Financial Statements\nNotes to the Consolidated Financial Statements\nNote A\nSummary of Significant Accounting Policies\nPrinciples of Consolidation: The Consolidated Financial Statements include the accounts of Hormel Foods Corporation (the Company) and all its majority-owned subsidiaries after elimination of intercompany accounts, transactions, and profits.\nUse of Estimates: The preparation of financial statements in conformity with U.S. generally accepted accounting principles requires management to make estimates and assumptions that affect the amounts reported in the financial statements and accompanying notes. Actual results could differ from those estimates.\nRounding: Certain amounts in the Consolidated Financial Statements and associated notes may not foot due to rounding. All percentages have been calculated using unrounded amounts.\nFiscal Year: The Companys fiscal year ends on the last Sunday in October. Fiscal years 2023 and 2022 consisted of 52 weeks. Fiscal year 2021 consisted of 53 weeks. Fiscal year 2024 will consist of 52 weeks.\nReportable Segments: As of October 30, 2022, the Company had four operating and reportable segments: Grocery Products, Refrigerated Foods, Jennie-O Turkey Store, and International and Other. At the beginning of fiscal 2023, the Company transitioned to a new strategic operating model, which aligns its businesses to be more agile, consumer and customer focused, and market driven. Effective on October 31, 2022, the Company operates with the following three operating and reportable segments: Retail, Foodservice, and International, which are consistent with how the Company's chief operating decision maker assesses performance and allocates resources. This change had no impact on the consolidated results of operations, financial position, shareholders' investment, or cash flows. Prior period segment results have been retrospectively recast to reflect the new reportable segments.\nCash and Cash Equivalents: The Company considers all investments with an original maturity of three months or less on their acquisition date to be cash equivalents. The Companys cash equivalents as of October 29, 2023 and October 30, 2022, consisted primarily of bank deposits, money market funds rated AAA, or other highly liquid investment accounts. The Net Asset Value (NAV) of the Companys money market funds is based on the market value of the securities in the portfolio.\nFair Value Measurements: Pursuant to the provisions of Accounting Standards Codification (ASC) 820, Fair Value Measurements and Disclosures, the Company measures certain assets and liabilities at fair value or discloses the fair value of certain assets and liabilities recorded at cost in the Consolidated Financial Statements. Fair value is calculated as the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date (an exit price). ASC 820 establishes a fair value hierarchy which requires assets and liabilities measured at fair value to be categorized into one of three levels based on the inputs used in the valuation. The Company classifies assets and liabilities in their entirety based on the lowest level of input significant to the fair value measurement. The three levels are defined as follows:\nLevel 1: Observable inputs based on quoted prices (unadjusted) in active markets for identical assets or liabilities.\nLevel 2: Observable inputs, other than those included in Level 1, based on quoted prices for similar assets and liabilities in active markets, or quoted prices for identical assets and liabilities in inactive markets.\nLevel 3: Unobservable inputs that reflect an entitys own assumptions about what inputs a market participant would use in pricing the asset or liability based on the best information available in the circumstances.\nSee additional discussion regarding the Companys fair value measurements in Note F - Derivatives and Hedging, Note G - Pension and Other Post-Retirement Benefits, and Note I - Fair Value Measurements.\nCompensation: The Company maintains a rabbi trust to fund certain supplemental executive retirement plans and deferred compensation plans. Under the plans, participants can defer certain types of compensation and elect to receive a return on the deferred amounts based on the changes in fair value of various investment options, primarily a variety of mutual funds. The Company has corporate-owned life insurance policies on certain participants in the deferred compensation plans. The cash surrender value of the policies is included in Other Assets on the Consolidated Statements of Financial Position. The securities held by the trust are classified as trading securities. Therefore, unrealized gains and losses associated with these investments\nare included in the Companys earnings. Securities held by the trust generated gains (losses) of $3.2 million, $(16.8) million, and $21.2 million for fiscal years 2023, 2022, and 2021, respectively.\nInventories: Inventories are stated at the lower of cost or net realizable value. Cost is determined principally under the average cost method. Adjustments to the Companys lower of cost or net realizable value inventory reserve are reflected in Cost of Products Sold in the Consolidated Statements of Operations.\nProperty, Plant, and Equipment: Property, Plant, and Equipment are stated at cost. The Company uses the straight-line method in computing depreciation. The annual provisions for depreciation have been computed principally using the following ranges of asset lives: buildings 20 to 40 years, and equipment 3 to 14 years.\nLeases: The Company determines if an arrangement contains a lease at inception. Right-of-use assets and lease liabilities are recognized based on the present value of future minimum lease payments over the lease term at the commencement date. Leases with an initial term of twelve months or less are not recorded on the Consolidated Statements of Financial Position. The Company combines lease and non-lease components together in determining the minimum lease payments for all leases.\nThe length of the lease term used in recording right-of-use assets and lease liabilities is based on the contractually required lease term adjusted for any options to renew, early terminate, or purchase the lease that are reasonably certain of being exercised. Most leases include one or more options to renew or terminate. The exercise of lease renewal and termination options is at the Companys discretion and generally is not reasonably certain at lease commencement. The Companys lease agreements typically do not contain material residual value guarantees. The Company has one lease with an immaterial residual value guarantee that is included in the minimum lease payments.\nCertain lease agreements include rental payment increases over the lease term that can be fixed or variable. Fixed payment increases and variable payment increases based on an index or rate are included in the initial lease liability using the index or rate at commencement date. Variable payment increases not based on an index or rate are recognized as incurred.\nIf the rate implicit in the lease is not readily determinable, the Company used its periodic incremental borrowing rate, based on the information available at commencement date, to determine the present value of future lease payments. Leases and right-of-use assets that existed prior to the adoption of Accounting Standards Update 2016-02, Leases (Topic 842) were valued using the incremental borrowing rate on October 28, 2019.\nImpairment of Long-Lived Assets and Definite-Lived Intangible Assets: Definite-lived intangible assets are amortized over their estimated useful lives. The Company reviews long-lived assets and definite-lived intangible assets for impairment annually, or more frequently when events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable. If impairment indicators are present and the estimated future undiscounted cash flows are less than the carrying value of the assets and any related goodwill, the carrying value is reduced to the estimated fair value. The Company recorded no material impairment charges for long-lived or definite-lived assets in fiscal years 2023, 2022, or 2021.\nGoodwill and Other Indefinite-Lived Intangibles: Indefinite-lived intangible assets are originally recorded at their estimated fair values at date of acquisition. Goodwill is the residual after allocating the purchase price to net assets acquired. Acquired goodwill and other indefinite-lived intangible assets are allocated to reporting units that will receive the related benefits. Goodwill and indefinite-lived intangible assets are tested annually for impairment during the fourth quarter following the annual planning process or more frequently if impairment indicators arise.\nSee additional discussion regarding the Companys goodwill and intangible assets in Note C - Goodwill and Intangible Assets.\nGoodwill\nIn conducting the annual impairment test for goodwill, the Company has the option to first assess qualitative factors to determine whether it is more likely than not (> 50 percent likelihood) the fair value of any reporting unit is less than its carrying amount. If the Company elects to perform a qualitative assessment and determines an impairment is more likely than not, the Company is required to perform a quantitative impairment test. Otherwise, no further analysis is required. Alternatively, the Company may elect to proceed directly to the quantitative impairment test.\nIn conducting a qualitative assessment, the Company analyzes actual and projected growth trends for net sales, gross margin and segment profit for each reporting unit, as well as historical performance versus plan and the results of prior quantitative tests. Additionally, the Company assesses factors that may impact the business's financial results such as macroeconomic conditions and the related impact, market-related exposures, plans to market for sale all or a portion of the business, competitive changes, new or discontinued product lines, and changes in key personnel.\nIf performed, the quantitative goodwill impairment test is performed at the reporting unit level. First, the fair value of each reporting unit is compared to its corresponding carrying value, including goodwill. The fair value of each reporting unit is estimated using discounted cash flow valuations (Level 3), which incorporate assumptions regarding future growth rates, terminal values and discount rates. The estimates and assumptions used consider historical performance and are consistent\nwith the assumptions used in determining future profit plans for each reporting unit, which are approved by the Companys Board of Directors. If the quantitative assessment results in the carrying value exceeding the fair value of any reporting unit, the results from the quantitative analysis will be relied upon to determine both the existence and amount of goodwill impairment. An impairment loss will be recognized for the amount by which the reporting units carrying amount exceeds its fair value, not to exceed the carrying amount of goodwill in that reporting unit.\nAs a result of organizational changes in the first quarter of fiscal 2023, the Company conducted an assessment of its operating segments and reporting units. Based on this analysis, goodwill was reallocated using the relative fair value approach. Prior to the goodwill reallocation, an impairment assessment was performed which indicated no impairment to the Company's reporting units. Subsequent to the goodwill reallocation, the Company completed quantitative impairment testing on each new reporting unit. The fair value of each reporting unit exceeded its carrying amount; therefore, no impairment charges were recorded.\nDuring the fourth quarter of fiscal 2023, the Company completed its annual goodwill impairment tests and performed qualitative assessments. No impairment charges were recorded as a result of the annual assessments in fiscal years 2023, 2022, and 2021.\nIndefinite-Lived Intangibles\nIn conducting the annual impairment test for its indefinite-lived intangible assets, the Company first performs a qualitative assessment to determine whether it is more likely than not (> 50 percent likelihood) an indefinite-lived intangible asset is impaired. If the Company concludes this is the case, a quantitative test for impairment must be performed. Otherwise, the Company does not need to perform a quantitative test.\nIn conducting the qualitative assessment, the Company analyzes growth rates for historical and projected net sales and the results of prior quantitative tests. Additionally, each operating segment assesses items that may impact the value of their intangible assets or the applicable royalty rates to determine if impairment may be indicated.\nIf performed, the quantitative impairment test compares the fair value and carrying amount of the indefinite-lived intangible asset. The fair value of indefinite-lived intangible assets is primarily determined on the basis of estimated discounted value using the relief from royalty method (Level 3), which incorporates assumptions regarding future sales projections, discount rates and royalty rates. If the carrying amount exceeds fair value, the indefinite-lived intangible asset is considered impaired, and an impairment charge is recorded for the difference. Even if not required, the Company may elect to perform the quantitative test in order to gain further assurance in the qualitative assessment.\nDuring the fourth quarter of fiscal 2023, the Company completed its annual indefinite-lived asset impairment tests by performing qualitative assessments. As a result of the qualitative assessments, it was determined that more likely than not the Justin's® trade name was impaired, and the Company performed a quantitative impairment test. As a result of the quantitative impairment test, a $28.4 million intangible asset impairment charge was recorded for the Justin's® trade name. No other impairment charges were recorded as a result of the qualitative assessments in fiscal years 2023 and 2022 and quantitative assessments in fiscal year 2021.\nPension and Other Post-retirement Benefits: The Company has elected to use the corridor approach to recognize expenses related to its defined benefit pension and other post-retirement benefit plans. Under the corridor approach, actuarial gains or losses resulting from experience and changes in assumptions are deferred and amortized over future periods. For the defined benefit pension plans, the unrecognized gains and losses are amortized when the net gain or loss exceeds 10 percent of the greater of the projected benefit obligation or the fair value of plan assets at the beginning of the year. For the other post-retirement plans, the unrecognized gains and losses are amortized when the net gain or loss exceeds 10 percent of the accumulated pension benefit obligation at the beginning of the year. For plans with primarily active participants, net gains or losses in excess of the corridor are amortized over the average remaining service period of participating employees expected to receive benefits under those plans. For plans with primarily inactive participants, net gains or losses in excess of the corridor are amortized over the average remaining life of the participants receiving benefits under those plans.\nContingent Liabilities: The Company may be subject to investigations, legal proceedings, or claims related to the ongoing operation of its business, including claims both by and against the Company. Such proceedings typically involve claims related to product liability, contract disputes, antitrust regulations, wage and hour laws, employment practices, or other actions brought by employees, consumers, competitors or suppliers. The Company establishes accruals for its potential exposure for claims when losses become probable and reasonably estimable. Where the Company is able to reasonably estimate a range of potential losses, the Company records the amount within that range which constitutes the Companys best estimate. The Company also discloses the nature of and range of loss for claims against the Company when losses are reasonably possible and material.\nForeign Currency Translation: Assets and liabilities denominated in foreign currency are translated at the current exchange rate as of the date of the Consolidated Statements of Financial Position. Amounts in the Consolidated Statements of Operations\nare translated at the average monthly exchange rate. Translation adjustments resulting from fluctuations in exchange rates are recorded as a component of Accumulated Other Comprehensive Loss within Shareholders Investment.\nWhen calculating foreign currency translation, the Company deemed its foreign investments to be permanent in nature and has not provided for taxes on currency translation adjustments arising from converting the investment in a foreign currency to U.S. dollars.\nDerivatives and Hedging Activity: The Company uses derivative instruments to manage its exposure to commodity prices and interest rates. The derivative instruments are recorded at fair value on the Consolidated Statements of Financial Position. The cash flow impacts from the derivative instruments are primarily included in Operating Activities in the Consolidated Statements of Cash Flows. Additional information on hedging activities is presented in Note F - Derivatives and Hedging.\nEquity Method Investments: The Company has a number of investments for which its voting interests are in excess of 20 percent but not greater than 50 percent and for which there are no other indicators of control. The Company accounts for such investments under the equity method of accounting and its underlying share of each investees equity, along with any balances due to or from affiliates, is reported on the Consolidated Statements of Financial Position as part of Investments in Affiliates. The Company records its interest in the net earnings of its equity method investments, along with adjustments for unrealized profits on intra-entity transactions and amortization of basis differences, within Equity in Earnings of Affiliates in the Consolidated Statements of Operations. Financial results for certain entities are reported on a 30- to 90-day lag.\nThe Company regularly monitors and evaluates the fair value of its equity investments. If events and circumstances, such as ongoing or projected decreases in earnings or significant business disruptions, indicate that a decline in the fair value of these assets has occurred and is other than temporary, the Company will record a charge in Equity in Earnings of Affiliates in the Consolidated Statements of Operations. The Company recorded a $7.0 million impairment in fiscal 2023 related to a corporate venturing investment. The Company did not record an impairment charge on any of its equity investments in fiscal 2022 or 2021. See additional information pertaining to the Companys equity method investments in Note D - Investments in Affiliates.\nThe Company uses the cumulative earnings approach to determine the cash flow presentation of distributions from equity method investments. Distributions received are reflected in operating activities in the Consolidated Statements of Cash Flows unless the cumulative distributions exceed the portion of the cumulative equity in earnings of the equity method investment. Distributions in excess of the cumulative equity in earnings are deemed to be returns of the investment and classified as investing activities in the Consolidated Statements of Cash Flows.\nRevenue Recognition: The Companys customer contracts predominantly contain a single performance obligation to fulfill customer orders for the purchase of specified products. Revenue from product sales is primarily identified by purchase orders (contracts), which in some cases are governed by a master sales agreement. The purchase orders in combination with the invoice typically specify quantity and product(s) ordered, shipping terms, and certain aspects of the transaction price including discounts. Contracts are at standalone pricing or governed by pricing lists or brackets. The Company's revenue is recognized at the point in time when performance obligations have been satisfied and control of the product has transferred to the customer. This is typically once the shipped product is received or picked up by the customer. Revenue is recognized at the net consideration the Company expects to receive in exchange for the goods. The amount of net consideration recognized includes estimates of variable consideration, including costs for trade promotion programs, consumer incentives, and allowances and discounts associated with distressed or potentially unsaleable products.\nA majority of the Companys revenue is short-term in nature with shipments within one year from order date. The Company's payment terms generally range between 7 to 45 days and vary by sales channel and other factors. The Company accounts for shipping and handling costs as contract fulfillment costs and excludes taxes imposed on and collected from customers in revenue producing transactions from the transaction price. The Company does not have significant deferred revenue or unbilled receivable balances as a result of transactions with customers. Costs to obtain contracts with a duration of one year or less are expensed and included in the Consolidated Statements of Operations.\nThe Company promotes products through advertising, consumer incentives, and trade promotions. These programs include discounts, slotting fees, coupons, rebates, and in-store display incentives. Customer trade promotion and consumer incentive activities are recorded as a reduction to the sale price based on amounts estimated as variable consideration. The Company estimates variable consideration at the expected value method to determine the total consideration which the Company expects to be entitled. Estimated amounts are included in the transaction price to the extent it is probable that a significant reversal of cumulative revenue recognized will not occur when the uncertainty associated with the variable consideration is resolved. The Companys estimates of variable consideration and determination of whether to include estimated amounts in the transaction price are based largely on an assessment of anticipated performance and all information (historical, current, and forecasted) that is reasonably available.\nThe Company discloses revenue by reportable segment and class of similar product in Note P - Segment Reporting.\nAllowance for Doubtful Accounts: The Company estimates the Allowance for Doubtful Accounts based on a combination of factors, evaluations, and historical data while considering current and future economic conditions.\nAdvertising Expenses: Advertising costs are included in Selling, General, and Administrative and expensed when incurred. Advertising expenses include all media advertising but exclude the costs associated with samples, demonstrations, and market research. Advertising costs for fiscal years 2023, 2022, and 2021 were $160.1 million, $157.3 million, and $138.5 million, respectively.\nShipping and Handling Costs: The Companys shipping and handling expenses are included in Cost of Products Sold in the Consolidated Statements of Operations.\nResearch and Development Expenses: Research and development costs are expensed as incurred and are included in Selling, General, and Administrative expenses in the Consolidated Statements of Operations. Research and development expenses incurred for fiscal years 2023, 2022, and 2021 were $33.7 million, $34.7 million, and $33.6 million, respectively.\nIncome Taxes: The Company records income taxes in accordance with the liability method of accounting. Deferred taxes are recognized for the estimated taxes ultimately payable or recoverable based on enacted tax law. Changes in enacted tax rates are reflected in the tax provision as they occur.\nIn accordance with ASC 740, Income Taxes, the Company recognizes a tax position in its financial statements when it is more likely than not that the position will be sustained upon examination based on the technical merits of the position. That position is then measured at the largest amount of benefit that is greater than 50 percent likely of being realized upon ultimate settlement.\nStock-Based Compensation: The Company records stock-based compensation expense in accordance with ASC 718, Compensation - Stock Compensation. For options subject to graded vesting, the Company recognizes stock-based compensation expense ratably over the shorter of the vesting period or the individual's retirement eligibility date. The Company estimates forfeitures at the time of grant based on historical experience and revises in subsequent periods if actual forfeitures differ.\nShare Repurchases: The Company may purchase shares of its common stock through open market and privately negotiated transactions at prices deemed appropriate by management. The timing and amount of repurchase transactions under the repurchase authorization depend on market conditions as well as corporate and regulatory considerations. For additional share repurchases information, see Part II, Item 5 - Market for Registrants' Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities.\nSupplemental Cash Flow Information: Non-cash investment activities presented in the Consolidated Statements of Cash Flows primarily consist of unrealized gains or losses on the Companys rabbi trust. The noted investments are included in Other Assets on the Consolidated Statements of Financial Position. Changes in the value of these investments are presented in the Consolidated Statements of Operations as Interest and Investment Income.\nReclassifications: Certain reclassifications of previously reported amounts have been made to conform to the current year presentation. Amortization related to operating leases and debt issuance costs were reclassified from Amortization to separate line items within the operating activities section of the Consolidated Statements of Cash Flows. These reclassifications had no impact on the Consolidated Statements of Operations, Consolidated Statements of Financial Position, or the Increase (Decrease) in Cash and Cash Equivalents in the Consolidated Statements of Cash Flows.\nAccounting Changes and Recent Accounting Pronouncements:\nNew Accounting Pronouncements Recently Adopted\nFiscal 2023\nNo new accounting standards were adopted during fiscal 2023.\nFiscal 2022\nIn December 2019, the Financial Accounting Standards Board (FASB) issued Accounting Standards Update (ASU) 2019-12, Income Taxes - Simplifying the Accounting for Income Taxes (Topic 740). The updated guidance simplifies the accounting for income taxes by removing certain exceptions in Topic 740 and clarifying and amending existing guidance. The amendments are effective for fiscal years beginning after December 15, 2020, with early adoption permitted. The Company\nadopted the provisions of this new accounting standard at the beginning of fiscal 2022 and adoption did not have a material impact on its consolidated financial statements.\nNew Accounting Pronouncements Not Yet Adopted\nIn November 2023, the FASB issued ASU 2023-07 Segment Reporting - Improving Reportable Segment Disclosures (Topic 280). The update is intended to improve reportable segment disclosure requirements, primarily through enhanced disclosures about significant expenses. The ASU requires disclosures to include significant segment expenses that are regularly provided to the chief operating decision maker (CODM), a description of other segment items by reportable segment, and any additional measures of a segment's profit or loss used by the CODM when deciding how to allocate resources. The ASU also requires all annual disclosures currently required by Topic 280 to be included in interim periods. The update is effective for fiscal years beginning after December 15, 2023, and interim periods within fiscal years beginning after December 15, 2024, with early adoption permitted and requires retrospective application to all prior periods presented in the financial statements. The Company is currently assessing the timing and impact of adopting the updated provisions.\nRecently issued accounting standards or pronouncements not disclosed have been excluded as they are currently not relevant to the Company.\nNote B\nAcquisitions and Divestitures\nAcquisitions: On June 7, 2021, the Company acquired the Planters® snack nuts business from The Kraft Heinz Company. The acquisition includes the Planters®, NUT-rition®, and Corn Nuts® brands. The final purchase price, including working capital adjustments, was $3.4 billion. The transaction was funded with the Companys cash on hand and from the issuance of long-term debt.\nPlanters® is an iconic snack brand and this acquisition significantly expands the Company's presence, and should broaden the scope for future acquisitions, in the growing snacking space. Operating results for this acquisition have been included in the Company's Consolidated Statements of Operations from the date of acquisition and are reflected in the Retail, Foodservice, and International segments. The acquisition contributed $952.5 million, $1.0 billion and $410.8 million of net sales during fiscal 2023, 2022 and 2021, respectively. As the acquisition has been integrated within the Company's existing operations, post-acquisition net earnings are not discernible.\nAcquisition-related costs were $30.3 million for the fiscal year ended October 31, 2021, which are reflected in the Consolidated Statements of Operations as Selling, General, and Administrative. Additional one-time adjustments related to the revaluation of acquired inventory of $12.9 million were recognized in the Consolidated Statements of Operations as Cost of Products Sold for the fiscal year ended October 31, 2021. The combined impact of these one-time acquisition costs and accounting adjustments was $43.2 million for the fiscal year ended October 31, 2021.\nThe acquisition was accounted for as a business combination using the acquisition method. The Company determined the acquisition date fair values of the assets acquired using independent appraisals. The Company completed purchase accounting allocations in the fourth quarter of fiscal 2021. Allocations of the purchase price to acquired assets, including goodwill and intangibles assets, are presented in the table below.\nIn thousands Purchase Price Allocation\nInventory $ 149,224\nProperty, Plant, and Equipment 170,958\nGoodwill 2,313,064\nOther Intangibles:\nTrade Names 712,000\nCustomer Relationships 51,000\nPurchase Price $ 3,396,246\nGoodwill is calculated as the excess of the purchase price over the fair values of the identifiable net assets acquired and is deductible for tax purposes. The goodwill recorded as part of the acquisition primarily reflects the value of the potential to expand the Company's presence in the growing snacking space and serve as a platform for innovation.\nThe following unaudited pro forma financial information presents the combined results of operations as if the acquisition of the Planters® snack nuts business had occurred on October 27, 2019. These unaudited pro forma results do not necessarily reflect the actual results of operations that would have been achieved had the acquisition occurred on that date, nor are they necessarily indicative of future results of operations.\nFiscal Year Ended\nIn thousands October 31, 2021\nPro Forma Net Sales $ 12,061,686\nPro Forma Net Earnings Attributable to Hormel Foods Corporation 985,881\nThe pro forma results include charges for depreciation and amortization of acquired assets and interest expense on debt issued to finance the acquisition, as well as the related income taxes. The pro forma results also reflect an adjustment to add back the transaction costs incurred and revaluation of inventory acquired along with the related income tax effects.\nSee Note C - Goodwill and Intangible Assets for amounts assigned to goodwill and intangible assets.\nNote C\nGoodwill and Intangible Assets\nGoodwill: Goodwill was reallocated as of October 31, 2022, due to organizational changes as described in Note A - Summary of Significant Accounting Policies. The changes in the carrying amount of goodwill for the fiscal years ended October 29, 2023 and October 30, 2022, are:\nIn thousands Grocery\nProducts Refrigerated\nFoods Jennie-O\nTurkey Store Retail Foodservice International Total\nBalance at October 31, 2021\n$ 2,398,354 $ 2,094,421 $ 176,628 $ - $ - $ 259,699 $ 4,929,102\nForeign Currency Translation - - - - - (3,273) (3,273)\nBalance at October 30, 2022\n$ 2,398,354 $ 2,094,421 $ 176,628 $ - $ - $ 256,427 $ 4,925,829\nGoodwill Reallocation (2,398,354) (2,094,421) (176,628) 2,916,796 1,750,594 2,013 -\nForeign Currency Translation - - - - - 2,635 2,635\nBalance at October 29, 2023\n$ - $ - $ - $ 2,916,796 $ 1,750,594 $ 261,074 $ 4,928,464\nIntangible Assets: The carrying amounts for indefinite-lived intangible assets are:\nOctober 29, October 30,\nIn thousands 2023 2022\nBrands/Trade Names/Trademarks\n$ 1,636,807 $ 1,665,190\nOther Intangibles 184 184\nForeign Currency Translation (5,893) (6,599)\nTotal $ 1,631,098 $ 1,658,775\nThe gross carrying amount and accumulated amortization for definite-lived intangible assets are:\nOctober 29, 2023 October 30, 2022\nGross Gross\nCarrying Accumulated Carrying Accumulated\nIn thousands Amount Amortization Amount Amortization\nCustomer Lists/Relationships $ 168,239 $ (82,658) $ 168,239 $ (69,779)\nOther Intangibles 59,241 (15,857) 59,241 (11,606)\nTrade Names/Trademarks 6,540 (5,089) 10,536 (7,828)\nForeign Currency Translation - (4,344) - (4,551)\nTotal $ 234,020 $ (107,947) $ 238,016 $ (93,764)\nAmortization expense on intangible assets for the last three fiscal years was:\nIn thousands\n2023 $ 18,386\n2022 19,274\n2021 17,518\nEstimated annual amortization expense on intangible assets for the five fiscal years after October 29, 2023, is as follows:\nIn thousands\n2024 $ 16,381\n2025 14,681\n2026 14,210\n2027 13,940\n2028 13,009\nDuring the fourth quarter of fiscal years 2023, 2022, and 2021, the Company completed required annual impairment tests of indefinite-lived intangible assets and goodwill. In fiscal 2023, an impairment was indicated for the Justin's® trade name, resulting in an impairment charge of $28.4 million. The expense is reflected in the Retail segment and included in Goodwill and Intangible Impairment in the Consolidated Statements of Operations. No other impairment was indicated. Useful lives of intangible assets were also reviewed during this process with no material changes identified.\nNote D\nInvestments in Affiliates\nEquity in Earnings of Affiliates consists of:\nIn thousands % Owned\nFiscal Year Ended\nOctober 29, 2023\nOctober 30, 2022\nOctober 31, 2021\nMegaMex Foods, LLC (1)\n50% $ 40,501 $ 19,861 $ 38,178\nOther Equity Method Investments (2)\nVarious (20 - 50%)\n2,253 7,324 9,585\nTotal Equity in Earnings of Affiliates\n$ 42,754 $ 27,185 $ 47,763\n(1) MegaMex, Foods, LLC, is reflected in the Retail Segment.\n(2) Other Equity Method Investments are primarily reflected in the International Segment but also include corporate venturing investments.\nDistributions received from equity method investees include:\nIn thousands Fiscal Year Ended\nOctober 29, 2023 October 30, 2022 October 31, 2021\nDividends\n$ 38,160 $ 43,039 $ 44,999\nOn December 15, 2022, the Company purchased from various minority shareholders a 29% common stock interest in PT Garudafood Putra Putri Jaya Tbk (Garudafood), a food and beverage company in Indonesia. On April 12, 2023, the Company purchased additional shares increasing the ownership interest to 30%. This investment expands the Company's presence in Southeast Asia and supports the global execution of the snacking and entertaining strategic priority. The Company has the ability to exercise significant influence, but not control, over Garudafood; therefore, the investment is accounted for under the equity method.\nThe Company obtained its Garudafood interest for a purchase price of $425.8 million, including associated transaction costs. The transaction was funded using the Company's cash on hand. Based on a third-party valuation, the Company's basis difference between the fair value of the investment and proportionate share of the carrying value of Garudafood's net assets is $324.8 million. The basis difference related to inventory, property, plant and equipment, and certain intangible assets is being amortized through Equity in Earnings of Affiliates over the associated useful lives. As of October 29, 2023, the remaining basis difference was $324.6 million. Based on quoted market prices, the fair value of the common stock held in Garudafood was $291.2 million as of October 29, 2023.\nIn fiscal 2023, the Company recorded a $7.0 million impairment charge related to a corporate venturing investment to recognize a decline in fair value not believed to be temporary. The impact is reflected in Equity in Earnings of Affiliates on the Consolidated Statements of Operations. The Company determined that no other-than-temporary impairment existed for any other equity method investments as of October 29, 2023.\nThe Company recognized a basis difference of $21.3 million associated with the formation of MegaMex Foods, LLC, of which $9.3 million is remaining as of October 29, 2023. This difference is being amortized through Equity in Earnings of Affiliates.\nNote E\nInventories\nPrincipal components of inventories are:\nIn thousands October 29, 2023 October 30, 2022\nFinished Products $ 954,432 $ 974,160\nRaw Materials and Work-in-Process 448,535 440,193\nOperating Supplies 168,289 206,289\nMaintenance Materials and Parts 109,151 95,417\nTotal $ 1,680,406 $ 1,716,059\nNote F\nDerivatives and Hedging\nThe Company uses hedging programs to manage risk associated with commodity purchases and interest rates. These programs utilize futures, swaps, and options contracts to manage the Companys exposure to market fluctuations. The Company has determined its designated hedging programs to be highly effective in offsetting the changes in fair value or cash flows generated by the items hedged. Effectiveness testing is performed on a quarterly basis to ascertain a high level of effectiveness for cash flow and fair value hedging programs. If the requirements of hedge accounting are no longer met, hedge accounting is discontinued immediately and any future changes to fair value are recorded directly through earnings.\nCash Flow Commodity Hedges: The Company designates grain, lean hog, and natural gas futures, swaps, and options contracts used to offset price fluctuations in the Companys future purchases of these commodities as cash flow hedges. Effective gains or losses related to these cash flow hedges are reported in Accumulated Other Comprehensive Loss (AOCL) and reclassified into earnings, through Cost of Products Sold, in the periods in which the hedged transactions affect earnings. The Company typically does not hedge its grain or natural gas exposure beyond the next two upcoming fiscal years and its lean hog exposure beyond the next fiscal year.\nFair Value Commodity Hedges: The Company designates the futures it uses to minimize the price risk assumed when fixed forward priced contracts are offered to the Companys commodity suppliers as fair value hedges. The programs are intended to make the forward priced commodities cost nearly the same as cash market purchases at the date of delivery. Changes in the fair value of the futures contracts and the gain or loss on the hedged purchase commitment are marked-to-market through earnings and recorded on the Consolidated Statements of Financial Position as a Current Asset and Current Liability, respectively. Gains or losses related to these fair value hedges are recognized through Cost of Products Sold in the periods in which the hedged transactions affect earnings.\nCash Flow Interest Rate Hedges: In the second quarter of fiscal 2021, the Company designated two separate interest rate locks as cash flow hedges to manage interest rate risk associated with the anticipated debt transactions required to fund the acquisition of the Planters® snack nuts business. The total notional amount of the Company's locks was $1.25 billion. In the third quarter of fiscal 2021, the associated unsecured senior notes were issued with a tenor of seven and thirty years and both locks were lifted (See Note L - Long-Term Debt and Other Borrowing Arrangements). Mark-to-market gains and losses on these instruments were deferred as a component of AOCL. The resulting gain in AOCL is reclassified to Interest Expense in the period in which the hedged transactions affect earnings.\nFair Value Interest Rate Hedge: In the first quarter of fiscal 2022, the Company entered into an interest rate swap to protect against changes in the fair value of a portion of previously issued senior unsecured notes attributable to the change in the benchmark interest rate. The hedge specifically designated the last $450 million of the notes due June 2024 (the 2024 Notes). The Company terminated the swap in the fourth quarter of fiscal 2022. The loss related to the swap was recorded as a fair value hedging adjustment to the hedged debt and will be amortized through earnings over the remaining life of the debt.\nOther Derivatives: The Company holds certain futures and swap contracts to manage the Companys exposure to fluctuations in grain and pork commodity markets. The Company has not applied hedge accounting to these positions. Activity related to derivatives not designated as hedges is immaterial to the consolidated financial statements.\nVolume: The Company's outstanding contracts related to its commodity hedging programs include:\nIn millions\nOctober 29, 2023 October 30, 2022\nCorn 30.7 bushels 34.3 bushels\nLean Hogs 144.2 pounds 177.5 pounds\nNatural Gas\n3.0 MMBtu - MMBtu\nFair Value of Derivatives: The gross fair values of the Companys derivative instruments designated as hedges are:\nIn thousands Location on Consolidated\nStatements of Financial Position\nOctober 29, 2023 October 30, 2022\nCommodity Contracts(1)\nOther Current Assets $ (13,233) $ 13,504\n(1) Amounts represent the gross fair value of commodity derivative assets and liabilities. The Company nets the derivative assets and liabilities for each of its commodity hedging programs, including cash collateral, when a master netting arrangement exists between the Company and the counterparty to the derivative contract. The amount or timing of cash collateral balances may impact the classification of the commodity derivative on the Consolidated Statements of Financial Position. The gross liability position as of October 29, 2023, is offset by the right to reclaim net cash collateral of $32.2 million contained within the master netting arrangement. The gross asset position as of October 30, 2022, is offset by the obligation to return net cash collateral of $1.3 million. See Note I - Fair Value Measurements for a discussion of these net amounts as reported on the Consolidated Statements of Financial Position.\nFair Value Hedge - Assets (Liabilities): The carrying amount of the Companys fair value hedged assets (liabilities) are:\nIn thousands Location on Consolidated\nStatements of Financial Position\nOctober 29, 2023 October 30, 2022\nCommodity Contracts\nAccounts Payable(1)\n$ (4,914) $ 5,725\nInterest Rate Contracts\nCurrent Maturities of Long-term Debt(2)\n(442,549) -\nInterest Rate Contracts Long-term Debt Less Current Maturities(2)\n- (430,050)\n(1) Represents the carrying amount of fair value hedged assets and liabilities which are offset by other assets included in master netting arrangements described above.\n(2) Represents the carrying amount of the hedged portion of the 2024 Notes. As of October 29, 2023, the carrying amount of the 2024 Notes included a cumulative fair value hedging adjustment of $7.5 million from discontinued hedges. In the third quarter of fiscal 2023, the 2024 Notes and the fair value hedging adjustment were reclassified from Long-term Debt less Current Maturities to Current Maturities of Long-term Debt on the Consolidated Statements of Financial Position.\nAccumulated Other Comprehensive Loss Impact: As of October 29, 2023, the Company included in AOCL hedging losses (before tax) of $24.5 million on commodity contracts and gains (before tax) of $12.5 million related to interest rate settled positions. The Company expects to recognize the majority of the losses on commodity contracts over the next twelve months. Gains on interest rate contracts offset the hedged interest payments over the tenor of the associated debt instruments.\nThe effect on AOCL for gains or losses (before tax) related to the Company's derivative instruments are:\nGain/(Loss)\nRecognized in AOCL(1)\nLocation on\nConsolidated\nStatements\nof Operations Gain/(Loss)\nReclassified from\nAOCL into Earnings(1)\nIn thousands Fiscal Year Ended Fiscal Year Ended\nCash Flow Hedges: October 29, 2023 October 30, 2022 October 29, 2023 October 30, 2022\nCommodity Contracts $ (50,353) $ 56,371 Cost of Products Sold $ 1,225 $ 57,592\nExcluded Component(2)\n1,127 (4,748) - -\nInterest Rate Contracts - - Interest Expense 988 988\n(1) See Note H - Accumulated Other Comprehensive Loss for the after-tax impact of these gains or losses on Net Earnings.\n(2) Represents the time value of corn options excluded from the assessment of effectiveness for which the difference between changes in fair value and periodic amortization is recorded in AOCL.\nConsolidated Statements of Operations Impact: The effect on the Consolidated Statements of Operations for gains or losses (before tax) related to the Company's derivative instruments are:\nFiscal Year Ended\nIn thousands October 29, 2023 October 30, 2022 October 31, 2021\nNet Earnings Attributable to Hormel Foods Corporation $ 793,572 $ 999,987 $ 908,839\nCash Flow Hedges - Commodity Contracts\nGain (Loss) Reclassified from AOCL\n1,225 55,350 31,787\nAmortization of Excluded Component from Options\n(5,835) (4,369) (3,033)\nGain (Loss) Reclassified from AOCL Due to Discontinuance of Cash Flow Hedges(1)\n- 2,242 (743)\nFair Value Hedges - Commodity Contracts\nGain (Loss) on Commodity Futures(2)\n656 (18,122) (28,078)\nTotal Gain (Loss) on Commodity Contracts(3)\n$ (3,955) $ 35,101 $ (67)\nCash Flow Hedges - Interest Rate Locks\nGain (Loss) Reclassified from AOCL\n988 988 399\nFair Value Hedge - Interest Rate Swap\nGain (Loss) on Interest Rate Swap - 928 -\nAmortization of Loss Due to Discontinuance of Fair Value Hedge(4)\n(12,499) (1,923) -\nTotal Gain (Loss) on Interest Rate Contracts(5)\n$ (11,511) $ (7) $ 399\nTotal Gain (Loss) Recognized in Earnings $ (15,466) $ 35,094 $ 332\n(1) In fiscal years 2022 and 2021, the Company discontinued hedge accounting related to corn usage that was deemed no longer probable to occur resulting in the immediate recognition of gains of $2.2 million (1.0 million bushels) and losses of $0.7 million (2.8 million bushels), respectively.\n(2) Represents gains or losses on commodity contracts designated as fair value hedges that were closed during the year, which were offset by a corresponding gain or loss on the underlying hedged purchase commitment. Additional gains or losses related to changes in the fair value of open commodity contracts, along with the offsetting gain or loss on the hedged purchase commitment, are also marked-to-market through earnings with no impact on a net basis.\n(3) Total Gain (Loss) on Commodity Contracts is recognized in earnings through Cost of Products Sold.\n(4) Represents the fair value hedging adjustment amortized through earnings.\n(5) Total Gain (Loss) on Interest Rate Contracts is recognized in earnings through Interest Expense.\nNote G\nPension and Other Post-retirement Benefits\nThe Company has several defined benefit plans and defined contribution plans covering most employees. Benefits for defined benefit pension plans covering hourly employees are provided based on stated amounts for each year of service, while plan benefits covering salaried employees are based on final average compensation, age and years of service. In the fourth quarter of fiscal 2022, an amendment was enacted for the salaried pension plan which changed the design from a stable value benefit to a cash balance benefit effective January 1, 2023. The cash balance design establishes hypothetical accounts for employees that are credited with an amount equal to a specified percent of their pay plus interest. Total costs associated with the Companys defined contribution benefit plans in fiscal years 2023, 2022, and 2021 were $41.0 million, $47.9 million, and $46.7 million, respectively.\nCertain groups of employees are eligible for post-retirement health or welfare benefits. Benefits for retired employees vary for each group depending on respective retirement dates and applicable plan coverage in effect. Contribution requirements for retired employees are governed by the Retiree Health Care Payment Program and may change each year as the cost to provide coverage is determined.\nNet periodic cost of defined benefit plans included the following for fiscal years ending:\nPension Benefits Post-retirement Benefits\nIn thousands October 29, 2023 October 30, 2022 October 31, 2021 October 29, 2023 October 30, 2022 October 31, 2021\nService Cost $ 35,607 $ 40,076 $ 37,127 $ 248 $ 469 $ 533\nInterest Cost 68,630 50,558 50,399 12,064 7,684 7,945\nExpected Return on Plan Assets (78,285) (108,248) (102,693) - - -\nAmortization of Prior Service Cost (Credit)\n(1,843) (1,496) (1,496) 8 8 (669)\nRecognized Actuarial Loss (Gain)\n13,303 12,530 22,742 (29) 2,439 2,020\nNet Periodic Cost $ 37,413 $ (6,581) $ 6,080 $ 12,290 $ 10,600 $ 9,830\nNon-service cost components of net pension and post-retirement benefit cost are presented within Interest and Investment Income in the Consolidated Statements of Operations.\nActuarial gains and losses and any adjustments resulting from plan amendments are deferred and amortized over periods ranging from 8 to 21 years for pension benefits and 13 to 14 years for post-retirement benefits. The following amounts have not been recognized in net periodic pension cost and are included in Accumulated Other Comprehensive Loss:\nPension Benefits Post-retirement Benefits\nIn thousands October 29, 2023 October 30, 2022 October 29, 2023 October 30, 2022\nUnrecognized Prior Service (Cost) Credit\n$ (7,549) $ (2,399) $ (138) $ (146)\nUnrecognized Actuarial (Loss) Gain\n(270,468) (272,401) 35,483 18,044\nThe following is a reconciliation of the beginning and ending balances of the benefit obligation, fair value of plan assets, and funded status of the plans as of the measurement dates:\nPension Benefits Post-retirement Benefits\nIn thousands October 29, 2023 October 30, 2022 October 29, 2023 October 30, 2022\nChange in Benefit Obligation:\nBenefit Obligation at Beginning of Year $ 1,200,013 $ 1,711,958 $ 211,986 $ 274,666\nService Cost 35,607 40,076 248 469\nInterest Cost 68,630 50,558 12,064 7,684\nActuarial (Gain) Loss(1)\n(51,106) (515,995) (17,421) (51,219)\nPlan Amendments 3,307 (2,722) - -\nParticipant Contributions - - 2,137 1,808\nMedicare Part D Subsidy - - 449 448\nBenefits Paid (82,071) (83,862) (23,263) (21,868)\nBenefit Obligation at End of Year $ 1,174,380 $ 1,200,013 $ 186,199 $ 211,986\n(1) Actuarial gains in fiscal 2022 were primarily due to the change in the discount rate assumptions utilized in measuring plan obligations.\nPension Benefits Post-retirement Benefits\nIn thousands October 29, 2023 October 30, 2022 October 29, 2023 October 30, 2022\nChange in Plan Assets:\nFair Value of Plan Assets at Beginning of Year $ 1,240,200 $ 1,698,596 $ - $ -\nActual Return on Plan Assets 15,810 (387,244) - -\nParticipant Contributions - - 2,137 1,808\nEmployer Contributions 11,733 12,711 21,126 20,060\nBenefits Paid (82,071) (83,862) (23,263) (21,868)\nFair Value of Plan Assets at End of Year $ 1,185,672 $ 1,240,200 $ - $ -\nFunded Status at End of Year $ 11,292 $ 40,187 $ (186,199) $ (211,986)\nAmounts recognized on the Consolidated Statements of Financial Position are as follows:\nPension Benefits Post-retirement Benefits\nIn thousands October 29, 2023 October 30, 2022 October 29, 2023 October 30, 2022\nPension Assets $ 204,697 $ 245,566 $ - $ -\nEmployee-Related Expenses\n(12,023) (11,571) (18,313) (19,962)\nPension and Post-retirement Benefits (181,382) (193,808) (167,886) (192,024)\nNet Amount Recognized $ 11,292 $ 40,187 $ (186,199) $ (211,986)\nThe accumulated benefit obligation for all pension plans was $1.2 billion as of October 29, 2023 and October 30, 2022. The following table provides information for pension plans with projected and accumulated benefit obligations in excess of plan assets:\nIn thousands October 29, 2023 October 30, 2022\nProjected Benefit Obligation $ 193,404 $ 205,379\nAccumulated Benefit Obligation 191,888 204,302\nFair Value of Plan Assets - -\nWeighted-average assumptions used to determine benefit obligations are as follows:\nOctober 29, 2023 October 30, 2022\nDiscount Rate 6.49 % 5.92 %\nRate of Future Compensation Increase (For Plans that Base Benefits on\nFinal Compensation Level)\n4.06 % 3.95 %\nInterest Crediting Rate (For Cash Balance Plan)\n4.98 % 4.42 %\nWeighted-average assumptions used to determine net periodic benefit costs are as follows:\nOctober 29, 2023 October 30, 2022 October 31, 2021\nDiscount Rate 5.92 % 3.00 % 3.06 %\nRate of Future Compensation Increase (For Plans\nthat Base Benefits on Final Compensation Level)\n3.95 % 4.14 % 4.09 %\nExpected Long-term Return on Plan Assets\n6.50 % 6.50 % 6.75 %\nInterest Crediting Rate (For Cash Balance Plan)(1)\n4.42 % - % - %\n(1) Cash balance plan enacted in the fourth quarter of fiscal 2022.\nThe expected long-term rate of return on plan assets is based on fair value and developed in consultation with outside advisors. A range is determined based on the composition of the asset portfolio, historical long-term rates of return, and estimates of future performance. The interest crediting rate is determined annually based on the U.S. 30-year Treasury rate with a floor of 2.65 percent.\nFor measurement purposes, an 8 percent annual rate of increase in the per capita cost of covered health care benefits for pre-Medicare and post-Medicare retirees coverage is assumed for 2024. The pre-Medicare and post-Medicare rate is assumed to decrease to 5 percent for 2029 and remain steady thereafter.\nThe Companys funding policy is to make annual contributions of not less than the minimum required by applicable regulations. The Company expects to make contributions of $31.3 million during fiscal 2024, which represent benefit payments for unfunded plans.\nBenefits expected to be paid over the next ten fiscal years are as follows:\nIn thousands Pension Benefits\nPost-retirement Benefits\n2024 $ 85,068 $ 18,871\n2025 87,841 18,430\n2026 92,386 17,865\n2027 95,000 17,262\n2028 97,973 16,649\n2029-2033 517,376 73,091\nPlan assets for certain defined benefit pension plans are held in the Hormel Foods Corporation Master Trust (Master Trust). The investment strategy for the Master Trust attempts to minimize the long-term cost of pension benefits, reduce the volatility of pension expense, and achieve a healthy funded status for the plans. The Company establishes target allocations in consultation\nwith outside advisors through the use of asset-liability modeling in an effort to match the duration of the plan assets with the duration of the Companys projected benefit liability.\nThe actual and target weighted-average asset allocations for the Companys pension plan assets as of the plan measurement date are as follows:\nOctober 29, 2023 October 30, 2022\nAsset Category Actual % Target\nRange % Actual % Target\nRange %\nFixed Income 47.6 40 - 60 43.3 40 - 60\nGlobal Stocks 31.2 20 - 55 36.9 20 - 55\nReal Estate 8.0 0 - 10 8.6 0 - 10\nPrivate Equity 6.7 0 - 15 7.1 0 - 10\nGold\n2.4 0 - 5 - 0 - 0\nHedge Funds 2.1 0 - 10 2.1 0 - 10\nCash and Cash Equivalents 2.0 0 - 5 1.9 0 - 5\nThe following tables show the categories of defined benefit pension plan assets and the level under which fair values were determined pursuant to the provisions of ASC 820. Assets measured at fair value using the net asset value (NAV) per share practical expedient are not required to be classified in the fair value hierarchy. These amounts are provided to permit reconciliation to the total fair value of plan assets.\nFair Value Measurements as of October 29, 2023\nIn thousands Total\nFair Value Quoted Prices\nin Active\nMarkets for\nIdentical Assets\n(Level 1) Significant Other\nObservable\nInputs\n(Level 2) Significant\nUnobservable\nInputs\n(Level 3)\nPlan Assets in Fair Value Hierarchy\nCash Equivalents(1)\n$ 23,643 $ 461 $ 23,182 $ -\nPrivate Equity(2)\nDomestic 31,383 - - 31,383\nInternational 48,065 - - 48,065\nFixed Income(3)\nU.S. Government Issues 171,949 123,683 48,266 -\nMunicipal Issues 9,884 - 9,884 -\nCorporate Issues - Domestic 226,202 - 226,202 -\nCorporate Issues - Foreign 36,133 - 36,133 -\nPlan Assets in Fair Value Hierarchy $ 547,258 $ 124,144 $ 343,667 $ 79,448\nPlan Assets at Net Asset Value\nReal Estate - Domestic(4)\n$ 95,315\nGlobal Stocks - Collective Investment Funds(5)\n369,513\nGlobal Stocks - Gold(6)\n28,163\nHedge Funds(7)\n24,965\nFixed Income - Hedge Funds(8)\n64,613\nFixed Income - Collective Investment Funds(9)\n55,845\nPlan Assets at Net Asset Value $ 638,414\nTotal Plan Assets at Fair Value $ 1,185,672\nFair Value Measurements as of October 30, 2022\nIn thousands Total\nFair Value Quoted Prices\nin Active\nMarkets for\nIdentical Assets\n(Level 1) Significant Other\nObservable\nInputs\n(Level 2) Significant\nUnobservable\nInputs\n(Level 3)\nPlan Assets in Fair Value Hierarchy\nCash Equivalents(1)\n$ 23,162 $ - $ 23,162 $ -\nPrivate Equity(2)\nDomestic 37,032 - - 37,032\nInternational 51,122 - - 51,122\nFixed Income(3)\nU.S. Government Issues 166,461 109,643 56,818 -\nMunicipal Issues 10,541 - 10,541 -\nCorporate Issues - Domestic 244,044 - 244,044 -\nCorporate Issues - Foreign 41,759 - 41,759 -\nPlan Assets in Fair Value Hierarchy $ 574,121 $ 109,643 $ 376,324 $ 88,154\nPlan Assets at Net Asset Value\nReal Estate - Domestic(4)\n$ 106,951\nGlobal Stocks - Collective Investment Funds(5)\n458,045\nHedge Funds(7)\n26,273\nFixed Income - Hedge Funds(8)\n62,025\nFixed Income - Collective Investment Funds(9)\n12,785\nPlan Assets at Net Asset Value $ 666,080\nTotal Plan Assets at Fair Value $ 1,240,200\nThe following is a description of the valuation methodologies used for instruments measured at fair value, including the general classification of such instruments:\n(1) Cash Equivalents: These Level 1 and Level 2 investments consist primarily of cash and highly liquid money market mutual funds traded in active markets in addition to highly liquid futures and T-bills with an observable daily settlement price.\n(2) Private Equity: These Level 3 investments consist of various collective investment funds, which are managed by a third party, invested in a well-diversified portfolio of equity investments from top performing, high quality firms focused on U.S. and foreign small to mid-markets, venture capitalists, and entrepreneurs with a concentration in areas of innovation. Investment strategies include buyouts, growth capital, buildups, and distressed, as well as early stages of company development mainly in the U.S. The fair value of these funds is based on the fair value of the underlying investments.\n(3) Fixed Income: The Level 1 investments include U.S. Treasury bonds and notes, which are valued at the closing price reported on the active market in which the individual securities are traded. The Level 2 investments consist principally of U.S. government securities, which are valued daily using institutional bond quote sources and mortgage-backed securities pricing sources, and municipal, domestic, and foreign securities, which are valued daily using institutional bond quote sources.\n(4) Real Estate - Domestic: These investments include ownership in open-ended real estate funds, which manage diversified portfolios of commercial properties within the office, residential, retail, and industrial property sectors. Investment strategies aim to acquire, own, hold, or dispose of investments with the goal of achieving current income and/or capital appreciation. The real estate investments are valued at the NAV of shares held by the Master Trust. Requests to redeem shares are granted on a quarterly basis with either 45 or 90 days advance notice, subject to availability of cash.\n(5) Global Stocks - Collective Investment Funds: These investments include commingled funds consisting of a mix of U.S. common stocks and foreign common stocks. The collective investment funds are valued at the NAV of shares held by the Master Trust. The investment strategy is to obtain long-term capital appreciation by focusing on companies generating above average earnings growth and are leading growth businesses in the marketplace. All funds are daily liquid with the exception of one that is available on the first business day of the month for subscriptions and withdrawals.\n(6) Global Stocks - Gold: This investment is a limited partnership consisting of physical gold, global mining industry common stocks, and to a limited extent, other precious metals. The limited partnership is valued at the NAV of shares held by the Master Trust. This fund allows for weekly subscriptions and monthly redemptions.\n(7) Hedge Funds: These investments are designed to provide diversification to an overall institutional portfolio and, in particular, provide protection against equity market downturns. They are comprised of Commodity Trading Advisor Managed Futures, Global Macro (Discretionary and/or Quant) and Long Volatility/Tail Risk Hedging strategies. The hedge funds are valued at the NAV of shares held by the Master Trust. Requests to redeem shares are granted daily, monthly or quarterly.\n(8) Fixed Income - Hedge Funds: These investments target absolute, risk-adjusted returns by taking advantage of price dislocations and inconsistencies within credit markets. Funds are comprised primarily of U.S. and European corporate credit and structured credit. The investments are valued at the NAV of shares held by the Master Trust. Requests to redeem shares are granted on a quarterly basis on the three year fund anniversary with a ninety day notice period.\n(9) Fixed Income - Collective Investment Funds: These investments include commingled funds consisting of a mix of U.S. government and investment grade corporate bonds. The collective investment funds are valued at NAV of the shares held by the Master Trust. The investment strategy is to achieve an investment return that approximates as closely to the Bloomberg Barclays U.S. Aggregate Bond Index over the long-term by investing in the securities that comprise the benchmark. There are no restrictions on redemptions.\nA reconciliation of the beginning and ending balance of the investments measured at fair value using significant unobservable inputs (Level 3) is as follows:\nIn thousands October 29, 2023 October 30, 2022\nFair Value at Beginning of Year $ 88,154 $ 109,419\nPurchases, Issuances, and Settlements (Net) (8,926) (29,188)\nUnrealized Gains (Losses)(1)\n(8,525) (18,027)\nRealized Gains 6,455 (604)\nInterest and Dividend Income 2,290 26,554\nFair Value at End of Year $ 79,448 $ 88,154\n(1) Included in Accumulated Other Comprehensive Loss on the Consolidated Statements of Financial Position.\nDuring fiscal 2023, the value of the Level 3 investments ranged from $77.8 million to $88.2 million, with an average value of $81.2 million.\nThe Company has commitments totaling $151.9 million for the investments within the pension plans. The unfunded commitment balance for each investment category is as follows:\nIn thousands October 29, 2023 October 30, 2022\nDomestic Equity $ 16,835 $ 2,146\nInternational Equity 11,396 10,466\nUnfunded Commitment Balance $ 28,231 $ 12,612\nFunding for future capital calls will come from existing pension plan assets and not from additional cash contributions by the Company.\nNote H\nAccumulated Other Comprehensive Loss\nComponents of Accumulated Other Comprehensive Loss are as follows:\nIn thousands Foreign\nCurrency\nTranslation Pension & Other Benefits Derivatives & Hedging Equity Method Investments\nAccumulated\nOther\nComprehensive\nLoss\nBalance at October 25, 2020 $ (64,161) $ (333,178) $ 2,089 $ - $ (395,250)\nUnrecognized Gains (Losses)\nGross 12,980 72,623 75,084 - 160,687\nTax Effect - (17,715) (18,259) - (35,974)\nReclassification into Net Earnings\nGross - 22,597 (1)\n(31,443) (2)\n- (8,846)\nTax Effect - (5,538) 7,652 - 2,114\nChange Net of Tax 12,980 71,967 33,034 - 117,981\nBalance at October 31, 2021 $ (51,181) $ (261,211) $ 35,123 $ - $ (277,269)\nUnrecognized Gains (Losses)\nGross (38,612) 73,361 51,623 - 86,372\nTax Effect - (17,942) (12,384) - (30,326)\nReclassification into Net Earnings\nGross - 13,481 (1)\n(58,580) (2)\n- (45,099)\nTax Effect - (3,312) 14,073 - 10,761\nChange Net of Tax (38,612) 65,587 (5,267) - 21,708\nBalance at October 30, 2022 $ (89,793) $ (195,624) $ 29,856 $ - $ (255,561)\nUnrecognized Gains (Losses)\nGross 3,771 3,878 (49,226) 15,082 (26,495)\nTax Effect - (880) 11,998 - 11,118\nReclassification into Net Earnings\nGross - 11,439 (1)\n(2,213) (2)\n(8,235) (3)\nTax Effect - (2,806) 501 - (2,305)\nChange Net of Tax 3,771 11,632 (38,940) 6,847 (16,691)\nBalance at October 29, 2023 $ (86,022) $ (183,993) $ (9,084) $ 6,847 $ (272,252)\n(1) Included in computation of net periodic cost. See Note G - Pension and Other Post-Retirement Benefits for additional information.\n(2) Included in Cost of Products Sold and Interest Expense in the Consolidated Statements of Operations. See Note F - Derivatives and Hedging for additional information.\n(3) Included in Equity in Earnings of Affiliates in the Consolidated Statements of Operations.\nNote I\nFair Value Measurements\nThe Companys financial assets and liabilities carried at fair value on a recurring basis as of October 29, 2023 and October 30, 2022, and their level within the fair value hierarchy are presented in the table below.\nFair Value Measurements at October 29, 2023\nTotal Fair\nValue Quoted Prices in Active Markets for Identical Assets (Level 1) Significant Other Observable Inputs (Level 2) Significant Unobservable Inputs (Level 3)\nIn thousands\nAssets at Fair Value\nCash and Cash Equivalents(1)\n$ 736,532 $ 735,387 $ 1,145 $ -\nShort-term Marketable Securities(2)\n16,664 2,499 14,164 -\nOther Trading Securities(3)\n188,162 - 188,162 -\nCommodity Derivatives(4)\n9,330 9,603 (273) -\nTotal Assets at Fair Value $ 950,688 $ 747,489 $ 203,199 $ -\nLiabilities at Fair Value\nDeferred Compensation(3)\n$ 55,222 $ - $ 55,222 $ -\nTotal Liabilities at Fair Value $ 55,222 $ - $ 55,222 $ -\nFair Value Measurements at October 30, 2022\nTotal Fair\nValue Quoted Prices in Active Markets for Identical Assets\n(Level 1) Significant Other Observable Inputs (Level 2) Significant Unobservable Inputs (Level 3)\nIn thousands\nAssets at Fair Value\nCash and Cash Equivalents(1)\n$ 982,107 $ 980,730 $ 1,377 $ -\nShort-term Marketable Securities(2)\n16,149 8,763 7,386 -\nOther Trading Securities(3)\n186,243 - 186,243 -\nCommodity Derivatives(4)\n12,448 12,228 220 -\nTotal Assets at Fair Value $ 1,196,947 $ 1,001,721 $ 195,226 $ -\nLiabilities at Fair Value\nDeferred Compensation(3)\n$ 57,790 $ - $ 57,790 $ -\nTotal Liabilities at Fair Value $ 57,790 $ - $ 57,790 $ -\nThe following methods and assumptions were used to estimate the fair value of the financial assets and liabilities above:\n(1) The Companys cash equivalents considered Level 1 consist primarily of bank deposits, money market funds rated AAA, or other highly liquid investment accounts, and have a maturity date of three months or less. Cash equivalents considered Level 2 are funds holding agency bonds or securities recognized at amortized cost.\n(2) The Company holds securities as part of a portfolio maintained to generate investment income and to provide cash for operations of the Company, if necessary. The portfolio is managed by a third party who is responsible for daily trading activities, and all assets within the portfolio are highly liquid. The cash, U.S. government securities, and money market funds rated AAA held by the portfolio are classified as Level 1. The current investment portfolio also includes corporate bonds and other asset backed securities for which there is an active, quoted market. Market prices are obtained from a variety of industry providers, large financial institutions, and other third-party sources to calculate a representative daily market value, and therefore, these securities are classified as Level 2.\n(3) The Company maintains a rabbi trust to fund certain supplemental executive retirement plans and deferred compensation plans. The majority of the funds held in the rabbi trust relate to supplemental executive retirement plans and have been invested primarily in fixed income funds managed by a third party. The declared rate on these funds is set based on a formula using the yield of the general account investment portfolio supporting the fund as adjusted for expenses and other charges. The rate is guaranteed for one year at issue and may be reset annually on the policy anniversary, subject to a guaranteed minimum rate. As the value is based on adjusted market rates and the fixed rate is only reset on an annual basis, these funds are classified as Level 2.\nUnder the Company's deferred compensation plans, participants can defer certain types of compensation and elect to receive a return based on the changes in fair value of various investment options which include equity securities, money market accounts, bond funds or other portfolios for which there is an active quoted market. The Company also offers a fixed rate investment option to participants. The rate earned on these investments is adjusted annually based on a specified percent of the U.S. Internal Revenue Service (IRS) applicable federal rates. These liabilities are classified as Level 2. The Company maintains funding in the rabbi trust generally mirroring the selections within the deferred compensation plans. These funds are managed by a third-party insurance policy, the values of which represent their cash surrender value based on the fair value of the underlying investments in the account. These policies are classified as Level 2.\nThe rabbi trust is included in Other Assets and deferred compensation liabilities in Other Long-term Liabilities on the Consolidated Statements of Financial Position. Securities held by the rabbi trust are classified as trading securities. Unrealized gains and losses associated with these investments are included in the Company's earnings. Securities held by the rabbi trust generated gains (losses) of $3.2 million, $(16.8) million, and $21.2 million for fiscal years 2023, 2022, and 2021, respectively.\n(4) The Companys commodity derivatives represent futures, swaps, and options contracts used in its hedging or other programs to offset price fluctuations associated with purchases of corn, natural gas, hogs, and pork, and to minimize the price risk assumed when forward priced contracts are offered to the Companys commodity suppliers. The Companys futures and options contracts for corn are traded on the Chicago Board of Trade, while futures contracts for\nlean hogs are traded on the Chicago Mercantile Exchange. These are active markets with quoted prices available, and these contracts are classified as Level 1. The Company holds natural gas and pork swap contracts that are over-the-counter instruments classified as Level 2. The value of the natural gas swap contracts is calculated using quoted prices from the New York Mercantile Exchange, and the value of the pork swap contracts are calculated using a futures implied USDA estimated pork cut-out value. All derivatives are reviewed for potential credit risk and risk of nonperformance. The net balance for commodity derivatives is included in Other Current Assets or Accounts Payable, as appropriate, on the Consolidated Statements of Financial Position. As of October 29, 2023, the Company has recognized the right to reclaim net cash collateral of $32.2 million from various counterparties (including cash of $42.6 million less $10.4 million of realized loss). As of October 30, 2022, the Company had recognized obligation to return net cash collateral of $1.3 million from various counterparties (including cash of $27.5 million less $26.2 million of realized gain).\nThe Companys financial assets and liabilities include accounts receivable, accounts payable, and other liabilities, for which carrying value approximates fair value. The Company does not carry its long-term debt at fair value on the Consolidated Statements of Financial Position. The fair value of long-term debt, utilizing discounted cash flows (Level 2), was $2.7 billion as of October 29, 2023 and $2.7 billion as of October 30, 2022. See Note L - Long-Term Debt and Other Borrowing Arrangements for additional information.\nThe Company measures certain nonfinancial assets and liabilities at fair value, which are recognized or disclosed on a nonrecurring basis (e.g., goodwill, intangible assets, and property, plant, and equipment). During fiscal year 2023, the Company recorded a $28.4 million impairment charge on the Justin's® trade name and a $7.0 million impairment charge on a corporate venturing investment. See additional discussion in Note C - Goodwill and Intangible Assets and Note D - Investments in Affiliates. During fiscal years 2023, 2022, and 2021, there were no other material remeasurements of assets or liabilities at fair value on a nonrecurring basis subsequent to their initial recognition.\nNote J\nCommitments and Contingencies\nPurchase Commitments: To ensure a steady supply of hogs and turkeys and keep the cost of products stable, the Company has entered into contracts with producers for the purchase of hogs and turkeys at formula-based prices over periods up to 5 years and 9 years, respectively. The Company has also entered into grow-out contracts with independent farmers to raise turkeys for the Company for periods up to 25 years. Under these arrangements, the Company owns the livestock, feed, and other supplies while the independent farmers provide facilities and labor. In addition, the Company has contracted for the purchase of corn, soybean meal, feed ingredients, and other raw materials from independent suppliers for periods up to 2 years. As of October 29, 2023, the Company is committed to make purchases under these contracts, assuming current price levels, for future fiscal years:\nIn thousands\n2024 $ 1,228,731\n2025 762,253\n2026 415,489\n2027 182,925\n2028 114,843\nLater Years 58,931\nTotal $ 2,763,172\nPurchases under these contracts for fiscal years 2023, 2022, and 2021 were $1.4 billion, $1.2 billion, and $1.1 billion, respectively.\nOther Commitments and Guarantees: The Company has commitments of approximately $48.2 million related to infrastructure improvements supporting various manufacturing facilities and $62.0 million for a media advertising agreement as of October 29, 2023.\nAs of October 29, 2023, the Company has $48.6 million of standby letters of credit issued on its behalf. The standby letters of credit are primarily related to the Companys self-insured workers compensation programs. This amount includes revocable standby letters of credit totaling $2.7 million for obligations of an affiliated party that may arise under workers compensation claims. Letters of credit are not reflected on the Consolidated Statements of Financial Position.\nLegal Proceedings: The Company is a party to various legal proceedings related to the ongoing operation of its business, including claims both by and against the Company. At any time, such proceedings typically involve claims related to product liability, labeling, contracts, antitrust regulations, intellectual property, competition laws, employment practices, or other actions brought by employees, customers, consumers, competitors, or suppliers. The Company establishes accruals for its potential exposure, as appropriate, for claims against the Company when losses become probable and reasonably estimable. However, future developments or settlements are uncertain and may require the Company to change such accruals as proceedings progress. Resolution of any currently known matter, either individually or in the aggregate, is not expected to have a material effect on the Companys financial condition, results of operations, or liquidity.\nPork Antitrust Litigation\nBeginning in June 2018, a series of putative class action complaints were filed against the Company, as well as several other pork-processing companies and a benchmarking service called Agri Stats in the United States District Court for the District of Minnesota styled In re Pork Antitrust Litigation (the Pork Antitrust Civil Litigation). The plaintiffs allege, among other things, that beginning in January 2009, the defendants conspired and combined to fix, raise, maintain, and stabilize the price of pork and pork products-including through the use of Agri Stats-in violation of federal antitrust laws. The complaints on behalf of the putative classes of indirect purchasers also include causes of action under various state unfair competition laws, consumer protection laws, and unjust enrichment common laws. The plaintiffs seek treble damages, injunctive relief, pre-and post-judgment interest, costs, and attorneys fees. Since the original filing, certain direct-action plaintiffs have opted out of class treatment and are proceeding with individual direct actions making similar claims, and others may do so in the future. The Company has not recorded any liability for these matters as it does not believe a loss is probable, and it cannot reasonably estimate any reasonably possible loss as the Company believes that it has valid and meritorious defenses against the allegations.\nThe Offices of the Attorney General in New Mexico and Alaska have filed complaints against the Company and certain of its pork subsidiaries, as well as several other pork processing companies and Agri Stats. The complaints are based on allegations similar to those asserted in the Pork Antitrust Civil Litigation and allege violations of state antitrust, unfair trade practice, and unjust enrichment laws based on allegations of conspiracies to exchange information and manipulate the supply of pork. The Company has not recorded any liability for these matters as it does not believe a loss is probable, and it cannot reasonably estimate any reasonably possible loss as the Company believes that it has valid and meritorious defenses against the allegations.\nTurkey Antitrust Litigation\nBeginning in December 2019, a series of putative class action complaints were filed against the Company, as well as several other turkey-processing companies and a benchmarking service called Agri Stats, in the U.S. District Court for the Northern District of Illinois styled In re Turkey Antitrust Litigation. The plaintiffs allege, among other things, that from at least 2010 to 2017, the defendants conspired and combined to fix, raise, maintain, and stabilize the price of turkey products-including through the use of Agri Stats-in violation of federal antitrust laws. The complaints on behalf of the putative classes of indirect purchasers also include causes of action under various state unfair competition laws, consumer protection laws, and unjust enrichment common laws. The plaintiffs seek treble damages, injunctive relief, pre-and post-judgment interest, costs, and attorneys fees. Since the original filing, certain direct-action plaintiffs have opted out of class treatment and are proceeding with individual direct actions making similar claims, and others may do so in the future. The Company has not recorded any liability for these matters as it does not believe a loss is probable, and it cannot reasonably estimate any reasonably possible loss as the Company believes that it has valid and meritorious defenses against the allegations.\nPoultry Wages Antitrust Litigation\nIn December 2019, a putative class of non-supervisory production and maintenance employees at poultry-processing plants in the continental United States filed an amended consolidated class action complaint against the Company and various other poultry processing companies in the United States District Court for the District of Maryland styled Jien, et al. v. Perdue Farms, Inc., et al. The plaintiffs allege that since 2009, the defendants directly and through a wage survey and benchmarking service exchanged information regarding compensation in an effort to depress and fix wages and benefits for employees at poultry-processing plants, feed mills, and hatcheries in violation of federal antitrust laws. The plaintiffs seek, among other things, treble monetary damages, punitive damages, restitution, and pre-and post-judgment interest, as well as declaratory and injunctive relief. In July 2022, the Court partially granted the Companys motion to dismiss, and dismissed plaintiffs per se wage-fixing claim as to the Company. The Company has not recorded any liability for this matter as it does not believe a loss is probable, and it cannot reasonably estimate any reasonably possible loss as the Company believes that it has valid and meritorious defenses against the allegations.\nRed Meat Wages Antitrust Litigation\nIn November 2022, a putative class of non-supervisory production and maintenance employees at red meat processing plants in the continental United States filed a class action complaint against the Company and various other beef- and pork-processing companies in the United States District Court for the District of Colorado styled Brown, et al. v. JBS USA Food Co., et al. The plaintiffs allege that since 2014, the defendants directly and through a wage survey and benchmarking service exchanged information regarding compensation in an effort to depress and fix wages and benefits for employees at\nbeef- and pork-processing plants in violation of federal antitrust laws. The plaintiffs seek, among other things, treble monetary damages, punitive damages, restitution, and pre-and post-judgment interest, as well as declaratory and injunctive relief. The Company has not recorded any liability for this matter as it does not believe a loss is probable, and it cannot reasonably estimate any reasonably possible loss as the Company believes that it has valid and meritorious defenses against the allegations.\nNote K\nLeases\nThe Company has operating leases for manufacturing facilities, office space, warehouses, transportation equipment, as well as miscellaneous real estate and equipment contracts. Finance leases primarily include turkey growing facilities and an aircraft. The Company's lessor portfolio consists primarily of immaterial operating leases of farmland to third parties.\nLease information included on the Consolidated Statements of Financial Position are:\nIn thousands Location on Consolidated Statements of\nFinancial Position October 29, 2023 October 30, 2022\nRight-of-Use Assets\nOperating Other Assets $ 131,920 $ 73,613\nFinance Net Property, Plant, and Equipment 37,999 45,563\nTotal Right-of-Use Assets $ 169,919 $ 119,176\nLiabilities\nCurrent\nOperating Accrued Expenses $ 26,238 $ 21,183\nFinance Current Maturities of Long-term Debt 8,597 8,391\nNoncurrent\nOperating Other Long-term Liabilities 109,237 55,571\nFinance Long-term Debt Less Current Maturities 27,488 36,082\nTotal Lease Liabilities $ 171,560 $ 121,227\nLease expenses are:\nFiscal Year Ended\nIn thousands October 29, 2023 October 30, 2022 October 31, 2021\nOperating Lease Cost (1)\n$ 34,209 $ 25,702 $ 21,993\nFinance Lease Cost\nAmortization of Right-of-Use Assets 7,594 7,965 8,104\nInterest on Lease Liabilities 1,361 1,707 2,019\nVariable Lease Cost (2)\n511,906 463,439 544,635\nNet Lease Cost $ 555,070 $ 498,813 $ 576,751\n(1) Includes short-term lease costs, which are immaterial.\n(2) ASC 842 - Leases requires disclosure of payments related to agreements with an embedded lease that are not otherwise reflected on the balance sheet. The Company's variable lease costs primarily include inventory related expenses, such as materials, labor, and overhead from manufacturing and service agreements that contain embedded leases. Variability of these costs is determined based on usage or output and may vary for other reasons such as changes in material prices.\nThe weighted-average remaining lease term and discount rate for lease liabilities included on the Consolidated Statements of Financial Position are:\nOctober 29, 2023 October 30, 2022\nWeighted-average Remaining Lease Term\nOperating Leases 6.0 years 5.3 years\nFinance Leases 5.3 years 6.3 years\nWeighted-average Discount Rate\nOperating Leases 4.43 % 2.08 %\nFinance Leases 3.37 % 3.44 %\nSupplemental cash flow and other information related to leases for the fiscal year ended are:\nIn thousands October 29, 2023 October 30, 2022 October 31, 2021\nCash Paid for Amounts Included in the Measurement of Lease Liabilities\nOperating Cash Flows from Operating Leases $ 29,436 $ 24,098 $ 20,305\nOperating Cash Flows from Finance Leases 1,361 1,707 2,019\nFinancing Cash Flows from Finance Leases 8,407 8,491 8,598\nRight-of-Use Assets obtained in exchange for new finance lease liabilities\n19 - -\nRight-of-Use Assets obtained in exchange for new operating lease liabilities 84,087 19,646 31,962\nThe maturity of the Company's lease liabilities as of October 29, 2023, are:\nIn thousands Operating Leases Finance Leases (1)\nTotal (2)\n2024 $ 31,718 $ 9,637 $ 41,355\n2025 29,050 8,101 37,152\n2026 26,066 5,666 31,732\n2027 19,769 4,314 24,083\n2028 12,873 10,542 23,414\n2029 and beyond 35,608 685 36,293\nTotal Lease Payments $ 155,084 $ 38,944 $ 194,028\nLess: Imputed Interest 19,609 2,859 22,468\nPresent Value of Lease Liabilities $ 135,475 $ 36,085 $ 171,560\n(1) Over the life of the lease contracts, finance lease payments include $8.1 million related to purchase options which are reasonably certain of being exercised.\n(2) Lease payments exclude $31.2 million of legally binding minimum lease payments for leases signed but not yet commenced.\nNote L\nLong-term Debt and Other Borrowing Arrangements\nLong-term Debt consists of:\nIn thousands October 29, 2023 October 30, 2022\nSenior Unsecured Notes, with Interest at 3.050%\nInterest Due Semi-annually through June 2051 Maturity Date\n$ 600,000 $ 600,000\nSenior Unsecured Notes, with Interest at 1.800%\nInterest Due Semi-annually through June 2030 Maturity Date\n1,000,000 1,000,000\nSenior Unsecured Notes, with Interest at 1.700%\nInterest Due Semi-annually through June 2028 Maturity Date\n750,000 750,000\nSenior Unsecured Notes, with Interest at 0.650%\nInterest Due Semi-annually through June 2024 Maturity Date\n950,000 950,000\nUnamortized Discount on Senior Notes (7,016) (7,750)\nUnamortized Debt Issuance Costs (16,278) (19,856)\nInterest Rate Swap Liabilities(1)\n(7,451) (19,950)\nFinance Lease Liabilities(2)\n36,085 44,473\nOther Financing Arrangements 3,908 2,429\nTotal $ 3,309,247 $ 3,299,345\nLess: Current Maturities of Long-term Debt 950,529 8,796\nLong-term Debt Less Current Maturities $ 2,358,719 $ 3,290,549\n(1) See Note F - Derivatives and Hedging for additional information.\n(2) See Note K - Leases for additional information.\nSenior Unsecured Notes: On June 3, 2021, the Company issued $950.0 million aggregate principal amount of its 0.650% notes due 2024 (2024 Notes), $750.0 million aggregate principal amount of its 1.700% notes due 2028 (2028 Notes), and $600.0 million aggregate principal amount of its 3.050% notes due 2051 (2051 Notes). The 2024 Notes may be redeemed in whole or in part one year after their issuance without penalty for early partial payments or full redemption. The 2028 Notes and 2051 Notes may be redeemed in whole or in part at any time at the applicable redemption price. Interest will accrue per annum at the stated rates with interest on the notes being paid semi-annually in arrears on June 3 and December 3 of each year, commencing December 3, 2021. Interest rate risk was hedged utilizing interest rate locks on the 2028 Notes and 2051 Notes. The Company lifted the hedges in conjunction with the issuance of these notes. See Note F - Derivatives and Hedging for additional information. If a change of control triggering event occurs, the Company must offer to purchase the notes at a purchase price\nequal to 101% of their principal amount, plus accrued and unpaid interest, if any, to the date of purchase. During the third quarter of fiscal 2023, the 2024 Notes were reclassified to Current Maturities of Long-term Debt on the Consolidated Statement of Financial Position.\nOn June 11, 2020, the Company issued senior notes in an aggregate principal amount of $1.0 billion due 2030. The notes bear interest at a fixed rate of 1.800% per annum, with interest paid semi-annually in arrears on June 11 and December 11 of each year, commencing December 11, 2020. The notes may be redeemed in whole or in part at any time at the applicable redemption price set forth in the prospectus supplement. If a change of control triggering event occurs, the Company must offer to purchase the notes at a purchase price equal to 101% of their principal amount, plus accrued and unpaid interest, if any, to the date of purchase.\nUnsecured Revolving Credit Facility: On May 6, 2021, the Company entered into an unsecured revolving credit agreement with Wells Fargo Bank, National Association as administrative agent, swingline lender and issuing lender, U.S. Bank National Association, JPMorgan Chase Bank, N.A. and BofA Securities, Inc. as syndication agents and the lenders party thereto. The revolving credit agreement provides for an unsecured revolving credit facility with an aggregate principal commitment amount at any time outstanding of up to $750.0 million with an uncommitted increase option of an additional $375.0 million upon the satisfaction of certain conditions.\nOn April 17, 2023, the Company entered into a first amendment (Amendment) to the Companys $750.0 million revolving credit agreement. The Amendment provides for, among other things (i) the replacement of London Interbank Offered Rate (LIBOR) with Term Secured Overnight Financing Rate (SOFR) and Daily Simple Singapore Overnight Rate Average (SORA) for the Eurocurrency Rate for U.S. Dollars and Singapore Dollars, including applicable credit spread adjustments and relevant SOFR benchmark provisions, (ii) permitting two one-year extension options to be exercised at any anniversary, (iii) removing the change in debt ratings notice requirement, (iv) shortening the notice period requirements for Base Rate Loans to allow for same day notice, and (v) increasing the number of permitted interest periods from 8 to 15.\nThe unsecured revolving line of credit bears interest, at the Companys election, at either a Base Rate plus margin of 0.0% to 0.150% or the Adjusted Term SOFR, Adjusted Daily Simple Risk-Free Rate (RFR) or Eurocurrency Rate plus margin of 0.575% to 1.150% and a variable fee of 0.050% to 0.100% is paid for the availability of this credit line. Extensions of credit under the facility may be made in the form of revolving loans, swingline loans and letters of credit. The lending commitments under the agreement are scheduled to expire on May 6, 2026, at which time the Company will be required to pay in full all obligations then outstanding. As of October 29, 2023 and October 30, 2022, the Company had no outstanding draws from this facility.\nDebt Covenants: The Company is required by certain covenants in its debt agreements to maintain specified levels of financial ratios and financial position. As of October 29, 2023, the Company was in compliance with all covenants.\nInterest Payments: Total interest paid in the last three fiscal years is as follows:\nIn millions\n2023 $ 57.1\n2022 57.0\n2021 25.1\nNote M\nStock-Based Compensation\nThe Company issues stock options, restricted stock units, restricted shares, and deferred stock units as part of its stock incentive plans for employees and nonemployee directors. Stock-based compensation expense for fiscal years 2023, 2022, and 2021, was $24.1 million, $24.9 million, and $24.7 million, respectively. The Company recognizes stock-based compensation expense ratably over the shorter of the vesting period or the individual's retirement eligibility date.\nAs of October 29, 2023, there was $16.2 million of total unrecognized compensation expense from stock-based compensation arrangements granted under the plans. This compensation is expected to be recognized over a weighted-average period of approximately 1.6 years. During fiscal years 2023, 2022, and 2021, cash received from stock option exercises was $12.0 million, $79.8 million, and $45.9 million, respectively.\nShares issued for option exercises, restricted stock units, restricted shares, and deferred stock units may be either authorized but unissued shares or shares of treasury stock. The number of shares available for future grants was 10.1 million at October 29, 2023, 11.1 million at October 30, 2022, and 12.5 million at October 31, 2021.\nStock Options: The Companys policy is to grant options with the exercise price equal to the market price of the common stock on the date of grant. Options typically vest over four years and expire ten years after the date of the grant.\nA reconciliation of the number of options outstanding and exercisable as of October 29, 2023, is:\nShares\n(in thousands) Weighted-average\nExercise Price\nWeighted-average\nRemaining Contractual\nTerm (Years)\nAggregate\nIntrinsic Value\n(in thousands)\nStock Options Outstanding at October 30, 2022\n16,130 $ 36.85\nGranted 1,002 46.46\nExercised (518) 29.24\nForfeited (147) 41.51\nExpired (84) 42.55\nStock Options Outstanding at October 29, 2023 16,384 $ 37.61 4.3 $ 18,845\nStock Options Exercisable at October 29, 2023 13,611 $ 36.00 3.5 $ 18,845\nThe weighted-average grant date fair value of stock options granted and the total intrinsic value of options exercised are:\nFiscal Year Ended\nOctober 29, October 30, October 31,\nIn thousands, except per share amounts 2023 2022 2021\nWeighted-average Grant Date Fair Value $ 10.06 $ 7.09 $ 7.52\nIntrinsic Value of Exercised Options 6,350 109,745 94,108\nThe fair value of each option award is calculated on the date of grant using the Black-Scholes valuation model utilizing the following weighted-average assumptions:\nFiscal Year Ended\nOctober 29, October 30, October 31,\n2023 2022 2021\nRisk-free Interest Rate 3.5 % 1.6 % 1.0 %\nDividend Yield 2.4 % 2.4 % 2.1 %\nStock Price Volatility 21.1 % 20.4 % 20.0 %\nExpected Option Life 7.4 years 7.5 years 7.4 years\nAs part of the annual valuation process, the Company reassesses the appropriateness of the inputs used in the valuation models. The Company establishes the risk-free interest rate using U.S. Treasury yields as of the grant date. The dividend yield is based on the dividend rate approved by the Companys Board of Directors and the stock price on the grant date. The expected volatility assumption is based on historical volatility. The expected life assumption is based on an analysis of past exercise behavior by option holders. In performing the valuations for option grants, the Company has not stratified option holders as exercise behavior has historically been consistent across all employees.\nRestricted Stock Units: Restricted stock units are valued equal to the market price of the common stock on the date of the grant and generally vest after three years. These awards accumulate dividend equivalents, which are provided as additional units and are subject to the same vesting requirements as the underlying grant. A reconciliation of the restricted stock units as of October 29, 2023, is:\nShares\n(in thousands) Weighted-\naverage\nGrant Date\nFair Value\nWeighted-average\nRemaining Contractual\nTerm (Years)\nAggregate\nIntrinsic Value\n(in thousands)\nRestricted Stock Units Outstanding at October 30, 2022\n681 $ 45.53\nGranted 237 45.96\nDividend Equivalents 18 41.44\nVested (185) 45.88\nForfeited (28) 45.64\nRestricted Stock Units Outstanding at October 29, 2023\n723 $ 45.59 1.3 $ 22,692\nThe weighted-average grant date fair value of restricted stock units granted, the total fair value of restricted stock units granted, and the fair value of restricted stock units that have vested are:\nFiscal Year Ended\nOctober 29, October 30, October 31,\nIn thousands, except per share amounts 2023 2022 2021\nWeighted-average Grant Date Fair Value $ 45.96 $ 44.14 $ 47.52\nFair Value of Restricted Stock Units Granted 10,889 15,980 10,699\nFair Value of Restricted Stock Units Vested 8,466 1,893 1,460\nRestricted Shares: Restricted shares awarded to nonemployee directors annually on February 1 are subject to a restricted period which expires the date of the Companys next annual stockholders meeting. Newly elected directors receive a prorated award of restricted shares of the Company's common stock, which expires on the date of the Company's second succeeding annual stockholders meeting. A reconciliation of the restricted shares as of October 29, 2023, is:\nShares\n(in thousands) Weighted-\naverage\nGrant Date\nFair Value\nRestricted Shares Outstanding at October 30, 2022 37 $ 47.11\nGranted 44 44.14\nVested (37) 47.11\nRestricted Shares Outstanding at October 29, 2023 44 $ 44.14\nThe weighted-average grant date fair value of restricted shares granted, the total fair value of restricted shares granted, and the fair value of shares that have vested are:\nFiscal Year Ended\nOctober 29, October 30, October 31,\nIn thousands, except per share amounts 2023 2022 2021\nWeighted-average Grant Date Fair Value $ 44.14 $ 47.11 $ 46.92\nFair Value of Restricted Shares Granted 1,920 1,760 1,760\nFair Value of Restricted Shares Vested 1,760 1,760 2,133\nDeferred Stock Units: Nonemployee directors can elect to receive all or a portion of their annual retainer in the form of non-forfeitable deferred stock units which vest immediately. The deferred stock units accumulate dividend equivalents, which are provided as additional units. Each deferred stock unit represents the right to receive one share of the Companys common stock following the completion of the directors service.\nDuring fiscal 2023, the Company granted 17.5 thousand units, credited dividend equivalents of 2.7 thousand units and distributed 6.9 thousand units, which had a weighted-average fair value on the grant date of $38.93, $42.70, and $17.26 per share, respectively. As of October 29, 2023, 118.2 thousand units were outstanding, which had a weighted-average fair value on the grant date of $37.84 per share and an aggregate intrinsic fair value of $3.7 million.\nNote N\nIncome Taxes\nThe components of the Provision for Income Taxes are as follows:\nFiscal Year Ended\nIn thousands October 29, 2023 October 30, 2022 October 31, 2021\nCurrent\nU.S. Federal $ 161,016 $ 67,638 $ 171,732\nState 20,166 20,054 7,541\nForeign 7,576 13,185 9,079\nTotal Current 188,758 100,877 188,352\nDeferred\nU.S. Federal 23,221 164,091 23,507\nState 8,602 13,638 2,220\nForeign (29) (729) 2,950\nTotal Deferred 31,794 177,000 28,677\nTotal Provision for Income Taxes $ 220,552 $ 277,877 $ 217,029\nThe Company has elected to treat global intangible low-taxed income (GILTI) as a period cost.\nDeferred Income Taxes reflect the net tax effects of temporary differences between the carrying amounts of assets and liabilities for financial reporting purposes and the amounts used for income tax purposes. Significant components of the deferred income tax liabilities and assets are as follows:\nIn thousands October 29, 2023 October 30, 2022\nDeferred Tax Liabilities\nGoodwill and Intangible Assets $ (477,282) $ (404,295)\nTax over Book Depreciation and Basis Differences (233,802) (246,411)\nOther, net (33,105) (21,467)\nDeferred Tax Assets\nPension and Other Post-retirement Benefits 42,952 42,794\nEmployee Compensation Related Liabilities 65,958 65,461\nMarketing and Promotional Accruals 16,972 29,045\nInventory\n46,856 10,368\nOther, net 75,562 51,966\nNet Deferred Tax (Liabilities) Assets $ (495,889) $ (472,539)\nReconciliation of the statutory federal income tax rate to the Companys effective tax rate is as follows:\nFiscal Year Ended\nOctober 29, 2023 October 30, 2022 October 31, 2021\nU.S. Statutory Rate 21.0 % 21.0 % 21.0 %\nState Taxes on Income, Net of Federal Tax Benefit 2.5 2.4 0.8\nStock-based Compensation (0.1) (1.5) (1.6)\nForeign-derived Intangible Income Deduction\n(1.3) (0.4) (0.4)\nAll Other, net (0.3) 0.2 (0.5)\nEffective Tax Rate 21.8 % 21.7 % 19.3 %\nAs of October 29, 2023, the Company had $299.3 million of undistributed earnings from non-U.S. subsidiaries. The Company maintains all earnings as permanently reinvested. Accordingly, no additional income taxes have been provided for withholding tax, state tax, or other taxes.\nTotal income taxes paid during fiscal years 2023, 2022, and 2021 were $205.0 million, $93.1 million, and $167.0 million, respectively.\nThe following table sets forth changes in the unrecognized tax benefits, excluding interest and penalties, for fiscal years 2023 and 2022.\nIn thousands\nBalance as of October 31, 2021\n$ 22,092\nTax Positions Related to the Current Period\nIncreases 3,618\nTax Positions Related to Prior Periods\nIncreases 1,890\nDecreases (1,789)\nSettlements (2,509)\nDecreases Related to a Lapse of Applicable Statute of Limitations (3,782)\nBalance as of October 30, 2022\n$ 19,520\nTax Positions Related to the Current Period\nIncreases 3,876\nTax Positions Related to Prior Periods\nIncreases 2,131\nDecreases (1,708)\nSettlements (811)\nDecreases Related to a Lapse of Applicable Statute of Limitations (3,881)\nBalance as of October 29, 2023\n$ 19,127\nUnrecognized tax benefits, including interest and penalties, are recorded in Other Long-term Liabilities. If recognized as of October 29, 2023 and October 30, 2022, $17.0 million, and $17.2 million, respectively, would impact the Companys effective tax rate. The Company includes accrued interest and penalties related to uncertain tax positions in Provision for Income Taxes, with immaterial losses included during fiscal 2023, 2022 and 2021. The amount of accrued interest and penalties at October 29, 2023 and October 30, 2022, associated with unrecognized tax benefits was $2.4 million and $2.3 million, respectively.\nThe Company is regularly audited by federal and state taxing authorities. The IRS concluded its examination of fiscal 2021 in the second quarter of fiscal 2023. Previously, the IRS placed the Company in the Bridge phase of the Compliance Assurance Process (CAP) for fiscal 2020. In this phase, the IRS will not accept any disclosures, conduct any reviews, or provide any assurances. The Company has elected to participate in CAP for fiscal years through 2023. The objective of CAP is to contemporaneously work with the IRS to achieve federal tax compliance and resolve all or most of the issues prior to filing of the tax return. The Company may elect to continue participating in CAP for future tax years; the Company may withdraw from the program at any time.\nThe Company is in various stages of audit by several state taxing authorities on a variety of fiscal years, as far back as 2015. While it is reasonably possible that one or more of these audits may be completed within the next 12 months and the related unrecognized tax benefits may change based on the status of the examinations, it is not possible to reasonably estimate the effect of any amount of such change to previously recorded uncertain tax positions.\nThe Inflation Reduction Act of 2022 was signed into law on August 16, 2022. The 15% corporate minimum tax will apply to the Company in fiscal year 2024.\nNote O\nEarnings Per Share Data\nThe reported net earnings attributable to the Company were used when computing basic and diluted earnings per share. Diluted earnings per share was calculated using the treasury stock method. The following table sets forth the shares used as the denominator for those computations.\nFiscal Year Ended\nIn thousands October 29, 2023 October 30, 2022 October 31, 2021\nBasic Weighted-Average Shares Outstanding 546,421 544,918 541,114\nDilutive Potential Common Shares 2,562 4,648 6,466\nDiluted Weighted-Average Shares Outstanding 548,982 549,566 547,580\nAntidilutive Potential Common Shares 6,834 1,915 2,839\nNote P\nSegment Reporting\nThe Company develops, processes, and distributes a wide array of food products in a variety of markets. As described in Note A - Summary of Significant Accounting Policies, the Company transitioned to a new operating model in the first quarter of fiscal 2023 and now reports its results in the following three segments: Retail, Foodservice, and International, which are consistent with how the Company's chief operating decision maker (CODM) assesses performance and allocates resources. Prior period segment results have been retrospectively recast to reflect the new reportable segments.\nThe Retail segment consists primarily of the processing, marketing, and sale of food products sold predominantly in the retail market. This segment also includes the results from the Companys MegaMex Foods, LLC joint venture.\nThe Foodservice segment consists primarily of the processing, marketing, and sale of food and nutritional products for foodservice, convenience store, and commercial customers.\nThe International segment processes, markets, and sells Company products internationally. This segment also includes the results from the Companys international joint ventures, equity method investments, and royalty arrangements.\nThe Company's CODM reviews assets at a consolidated level and does not use assets by segment to evaluate performance or allocate resources. Therefore, the Company does not disclose assets by segment. Intersegment sales are eliminated in\nconsolidation and are not reviewed when evaluating segment performance. The Company does not allocate deferred compensation, investment income, interest expense, or interest income to its segments when measuring performance. The Company also retains various other income and expenses at the corporate level. Equity in Earnings of Affiliates is included in segment profit; however, earnings attributable to the Companys corporate venturing investments and noncontrolling interests are excluded. These items are included below as Net Unallocated Expense and Noncontrolling Interest when reconciling to Earnings Before Income Taxes.\nFinancial measures for each of the Companys reportable segments and reconciliation to consolidated Earnings Before Income Taxes are set forth below. The Company is an integrated enterprise, characterized by substantial intersegment cooperation, cost allocations, and sharing of assets. Therefore, the Company does not represent that these segments, if operated independently, would report the profit and other financial information shown below.\nIn thousands Fiscal Year Ended\nOctober 29, 2023 October 30, 2022 October 31, 2021\nNet Sales\nRetail $ 7,749,039 $ 7,987,598 $ 7,418,079\nFoodservice 3,639,492 3,691,408 3,130,174\nInternational 721,479 779,799 837,936\nTotal Net Sales\n$ 12,110,010 $ 12,458,806 $ 11,386,189\nSegment Profit\nRetail $ 577,690 $ 721,832 $ 690,127\nFoodservice 595,682 547,686 431,992\nInternational 55,234 107,642 116,585\nTotal Segment Profit $ 1,228,606 $ 1,377,161 $ 1,238,704\nNet Unallocated Expense 214,482 99,297 112,836\nNoncontrolling Interest (653) 239 301\nEarnings Before Income Taxes $ 1,013,472 $ 1,278,103 $ 1,126,170\nDepreciation and Amortization\nRetail\n$ 145,690 $ 135,824 $ 124,627\nFoodservice\n74,370 69,577 53,954\nInternational\n15,627 16,072 16,482\nCorporate 17,623 14,413 14,246\nTotal Depreciation and Amortization\n$ 253,311 $ 235,885 $ 209,309\nThe Companys products primarily consist of meat and other food products. Total revenue contributed by classes of similar products are:\nFiscal Year Ended\nIn thousands October 29, 2023 October 30, 2022 October 31, 2021\nPerishable $ 8,511,795 $ 8,737,486 $ 8,437,851\nShelf-stable 3,598,215 3,721,320 2,948,338\nTotal Net Sales\n$ 12,110,010 $ 12,458,806 $ 11,386,189\nPerishable includes fresh meats, frozen items, refrigerated meal solutions, bacon, sausages, hams, guacamole, and other items that require refrigeration. Shelf-stable includes canned luncheon meats, nut butters, snack nuts, chili, shelf-stable microwaveable meals, hash, stews, tortillas, salsas, tortilla chips, nutritional food supplements, and other items that do not require refrigeration.\nRevenues from external customers are classified as domestic or foreign based on the location where title passes. No individual foreign country is material to the consolidated results. Additionally, the Companys long-lived assets located in foreign countries are not significant. Total net sales attributed to the U.S. and all foreign countries in total are:\nFiscal Year Ended\nIn thousands October 29, 2023 October 30, 2022 October 31, 2021\nU.S. $ 11,515,094 $ 11,776,883 $ 10,653,088\nForeign 594,915 681,923 733,101\nTotal Net Sales\n$ 12,110,010 $ 12,458,806 $ 11,386,189\nIn fiscal 2023, sales to Walmart Inc. (Walmart) represented $2.0 billion or 15.5% of the Companys consolidated gross sales less returns and allowances compared to $2.1 billion or 15.6% in fiscal 2022. Walmart is a customer for the Company's Retail and International segments. Item 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE\nNone. Item 9A. CONTROLS AND PROCEDURES\nDisclosure Controls and Procedures\nAs of the end of the period covered by this report (the Evaluation Date), the Company carried out an evaluation, under the supervision and with the participation of management, including the Chief Executive Officer and the Chief Financial Officer, of the effectiveness of the design and operation of our disclosure controls and procedures (as defined in Rule 13a-15(e) of the Securities Exchange Act of 1934, as amended (the Exchange Act)). In designing and evaluating the disclosure controls and procedures, management recognized any controls and procedures, no matter how well designed and operated, can provide only reasonable assurance of achieving the desired control objectives. Based on that evaluation, our Chief Executive Officer and Chief Financial Officer concluded, as of the Evaluation Date, our disclosure controls and procedures were effective to provide reasonable assurance the information we are required to disclose in reports we file or submit under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in Securities and Exchange Commission rules and forms, and such information is accumulated and communicated to our management, including our Chief Executive Officer and Chief Financial Officer, as appropriate, to allow timely decisions regarding required disclosure.\nInternal Control over Financial Reporting\nManagement's report on the Company's internal control over financial reporting is included on page 35 of this report. The report of the Company's independent registered public accounting firm related to their assessment of the effectiveness of internal control over financial reporting is included on page 36 of this report.\nThere were no changes in the Companys internal control over financial reporting (as defined in Rule 13a-15(f) under the Exchange Act) through the fourth quarter of fiscal 2023 that have materially affected, or are reasonably likely to materially affect, the Companys internal control over financial reporting. Item 9B. OTHER INFORMATION\nDuring the fiscal quarter ended October 29, 2023, no director or officer of the Company adopted or terminated a \"Rule 10b5-1 trading arrangement\" or \"non-Rule 10b5-1 trading arrangement,\" as the terms are defined in Item 408(a) of Regulation S-K.\nItem 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNone.\nPART III Item 10. DIRECTORS, EXECUTIVE OFFICERS, AND CORPORATE GOVERNANCE\nInformation under Item 1 - Election of Directors, Board Independence, and information under Board of Director and Committee Meetings in the definitive proxy statement for the Annual Meeting of Stockholders to be held January 30, 2024, is incorporated herein by reference.\nInformation concerning Executive Officers is set forth in Part I of this Annual Report on Form 10-K, pursuant to Instruction to Item 401 of Regulation S-K.\nThe Company has adopted a Code of Ethical Business Conduct in compliance with applicable rules of the Securities and Exchange Commission that applies to its principal executive officer, its principal financial officer, and its principal accounting officer or controller, or persons performing similar functions. A copy of the Code of Ethical Business Conduct is available on the Companys website at www.hormelfoods.com, free of charge, under the caption, Investors - Governance - Governance Documents. The Company intends to satisfy any disclosure requirement under Item 5.05 of Form 8-K regarding an amendment\nto, or waiver from, a provision of this Code of Ethical Business Conduct by posting such information on the Companys website at the address and location specified above. Item 11. EXECUTIVE COMPENSATION\nInformation commencing with Executive Compensation through \"CEO Pay Ratio Disclosure, and information under Compensation of Directors in the definitive proxy statement for the Annual Meeting of Stockholders to be held January 30, 2024, is incorporated herein by reference. Item 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nInformation regarding the Company's equity compensation plans as of October 29, 2023, is presented below:\nPlan Category Number of\nSecurities to be\nIssued Upon\nExercise of\nOutstanding\nOptions, Warrants\nand Rights(1)\nWeighted-average Exercise Price of Outstanding Options, Warrants and Rights(2)\nNumber of Securities Remaining Available for Future Issuance\nunder Equity Compensation\nPlans (Excluding Securities Reflected in Column (a))\n(a) (b) (c)\nEquity Compensation Plans Approved by\nSecurity Holders 17,268,449 $37.61 10,099,031\nEquity Compensation Plans Not Approved by\nSecurity Holders - - -\nTotal 17,268,449 $37.61 10,099,031\n(1) Includes 16,383,844 stock options, 722,899 restricted stock units, 43,502 restricted shares and 118,204 deferred stock units.\n(2) Only includes the weighted-average exercise price of outstanding stock options.\nInformation under Security Ownership of Certain Beneficial Owners and Security Ownership of Management in the definitive proxy statement for the Annual Meeting of Stockholders to be held January 30, 2024, is incorporated herein by reference. Item 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nInformation under Related Party Transactions and Board Independence in the definitive proxy statement for the Annual Meeting of Stockholders to be held January 30, 2024, is incorporated herein by reference. Item 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nInformation under Independent Registered Public Accounting Firm Fees and Audit Committee Preapproval Policies and Procedures in the definitive proxy statement for the Annual Meeting of Stockholders to be held January 30, 2024, is incorporated herein by reference.\nPART IV Item 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\nThe following consolidated financial statements of Hormel Foods Corporation for the fiscal year ended October 29, 2023, are filed as part of this report:\nConsolidated Statements of Operations - Fiscal Years Ended October 29, 2023, October 30, 2022, and October 31, 2021.\nConsolidated Statements of Comprehensive Income - Fiscal Years Ended October 29, 2023, October 30, 2022, and October 31, 2021.\nConsolidated Statements of Financial Position - October 29, 2023 and October 30, 2022.\nConsolidated Statements of Changes in Shareholders Investment - Fiscal Years Ended October 29, 2023, October 30, 2022, and October 31, 2021.\nConsolidated Statements of Cash Flows - Fiscal Years Ended October 29, 2023, October 30, 2022, and October 31, 2021.\nNotes to the Consolidated Financial Statements\nReport of Management\nReport of Independent Registered Public Accounting Firm (PCAOB ID: 42)\nFINANCIAL STATEMENT SCHEDULES\nThe following consolidated financial statement schedule of Hormel Foods Corporation required is submitted herewith:\nSchedule II - Valuation and Qualifying Accounts and Reserves-Fiscal Years Ended October 29, 2023, October 30, 2022, and October 31, 2021.\nHORMEL FOODS CORPORATION\nSCHEDULE II - VALUATION AND QUALIFYING ACCOUNTS AND RESERVES\nIn thousands\nAdditions/(Benefits)\nClassification Balance at\nBeginning\nof Period Charged to Cost and Expenses Charged to Other Accounts (Describe)\nDeductions\n(Describe)\nBalance at\nEnd of Period\nValuation reserve deduction from assets account:\nFiscal year ended October 29, 2023\nAllowance for doubtful accounts receivable\n$ 3,507 $ 289 $ - $ 275 (1)\n$ 3,557\n(36) (2)\nFiscal year ended October 30, 2022\nAllowance for doubtful accounts receivable\n$ 4,033 $ (646) $ - $ 31 (1)\n$ 3,507\n(151) (2)\nFiscal year ended October 31, 2021\nAllowance for doubtful accounts receivable\n$ 4,012 $ 146 $ (12) (3)\n$ 138 (1)\n$ 4,033\n(25) (2)\n(1) Uncollectible accounts written off.\n(2) Recoveries on accounts previously written off.\n(3) Consolidation of the Sadler's reserve.\nFINANCIAL STATEMENTS AND SCHEDULES OMITTED\nAll other financial statements and schedules for which provision is made in the applicable accounting regulations of the Securities and Exchange Commission are not required under the related instructions or are inapplicable, and therefore have been omitted.\nHORMEL FOODS CORPORATION\nLIST OF EXHIBITS\nNUMBER DESCRIPTION OF DOCUMENT\n3.1(1)\nRestated Certificate of Incorporation as amended January 27, 2016. (Incorporated by reference to Exhibit 3.1 to Hormels Annual Report on Form 10-K dated December 21, 2016, File No. 001-02402.)\n3.2(1)\nBylaws as amended to date. (Incorporated by reference to Exhibit 3(ii) to Hormels Current Report on Form 8-K dated May 21, 2018, File No. 001-02402.)\n4.1(1)\nDescription of Capital Stock. (Incorporated by reference to Exhibit 4.3 to the Company's Annual Report on Form 10-K filed on December 6, 2019, File No. 001-02402.)\n4.2(1)\nIndenture dated as of April 1, 2011, between the Company and U.S. Bank National Association. (Incorporated by reference to Exhibit 4.3 to Hormels Registration Statement on Form S-3 filed on April 4, 2011, File No. 333-173284.)\n4.3(1)\nForm of 1.800% Notes due June 11, 2030. (Incorporated by reference to Exhibit 4.1 to the Company's Current Report on Form 8-K filed on June 11, 2020, File No. 001-02402.)\n4.4(1)\nPursuant to Item 601(b)(4)(iii) of Regulation S-K, copies of instruments defining the rights of holders of certain long-term debt are not filed. Hormel agrees to furnish copies thereof to the Securities and Exchange Commission upon request.\n4.5(1)\nForm of 0.650% Notes due 2024 (Incorporated by reference to Exhibit 4.1 to the Company's Current Report on Form 8-K dated June 3, 2021, File No. 001-02402.)\n4.6(1)\nForm of 1.700% Notes due 2028 (Incorporated by reference to Exhibit 4.2 to the Company's Current Report on Form 8-K dated June 3, 2021, File No. 001-02402.)\n4.7(1)\nForm of 3.050% Notes due 2051 (Incorporated by reference to Exhibit 4.3 to the Company's Current Report on Form 8-K dated June 3, 2021, File No. 001-02402.)\n10.1(1)(3)\nHormel Foods Corporation Supplemental Executive Retirement Plan (2007 Restatement). (Incorporated by reference to Exhibit 10.2 to Hormels Current Report on Form 8-K dated November 21, 2011, File No. 001-02402.)\n10.2(1)(3)\nFirst Amendment of Hormel Foods Corporation Supplemental Executive Retirement Plan (2007 Restatement). (Incorporated by reference to Exhibit 10.3 to Hormels Current Report on Form 8-K dated November 21, 2011, File No. 001-02402.)\n10.3(1)(3)\nSecond Amendment of Hormel Foods Corporation Supplemental Executive Retirement Plan (2007 Restatement). (Incorporated by reference to Exhibit 10.4 to Hormels Current Report on Form 8-K dated November 21, 2011, File No. 001-02402.)\n10.4(1)(3)\nThird Amendment of Hormel Foods Corporation Supplemental Executive Retirement Plan (2007 Restatement). (Incorporated by reference to Exhibit 10.5 to Hormels Current Report on Form 8-K dated November 21, 2011, File No. 001-02402.)\n10.5(1)(3)\nHormel Foods Corporation 2000 Stock Incentive Plan (Amended 1-31-2006). (Incorporated by reference to Exhibit 10.1 to Hormels Current Report on Form 8-K dated January 31, 2006, File No. 001-02402.)\n10.6(1)(3)\nHormel Foods Corporation Executive Deferred Income Plan II (November 21, 2011 Restatement). (Incorporated by reference to Exhibit 10.1 to Hormels Current Report on Form 8-K dated November 21, 2011, File No. 001-02402.)\n10.7(1)(3)\nForm of Indemnification Agreement for Directors and Officers. (Incorporated by reference to Exhibit 10.1 to Hormels Quarterly Report on Form 10-Q for the quarter ended April 29, 2012, File No. 001-02402.)\n10.8(1)(3)\nHormel Foods Corporation 2009 Nonemployee Director Deferred Stock Plan (Plan Adopted November 24, 2008). (Incorporated by reference to Exhibit 10.2 to Hormels Quarterly Report on Form 10-Q for the quarter ended January 25, 2009, File No. 001-02402.)\n10.9(1)(3)\nHormel Foods Corporation 2009 Long-Term Incentive Plan. (Incorporated by reference to Appendix A to Hormels definitive Proxy Statement filed on December 18, 2013, File No. 001-02402.)\n10.10(1)(3)\nHormel Survivor Income Plan for Executives (1993 Restatement). (Incorporated by reference to Exhibit 10.11 to Hormels Annual Report on Form 10-K for the fiscal year ended October 29, 2006, File No. 001-02402.)\n10.11(1)(3)\nHormel Foods Corporation 2018 Incentive Compensation Plan. (Incorporated by reference to Appendix A to Hormel's Definitive Proxy Statement filed on December 20, 2017, File No. 001-02402.)\n10.12(1)(3)\nHormel Foods Corporation Restricted Stock Award Agreement Under the 2018 Incentive Compensation Plan (Non-Employee Directors). (Incorporated by reference to Exhibit 10.1 to Hormel's Current Report on Form 8-K dated January 30, 2018, File No. 001-02402.)\nNUMBER DESCRIPTION OF DOCUMENT\n10.13(1)(3)\nHormel Foods Corporation Stock Option Agreement Under the 2018 Incentive Compensation Plan. (Incorporated by reference to Exhibit 10.2 to Hormel's Current Report on Form 8-K dated January 30, 2018, File No. 001-02402.)\n10.14(1)(3)\nHormel Foods Corporation Restricted Stock Unit Agreement Under the 2018 Incentive Compensation Plan. (Incorporated by reference to Exhibit 10.15 to Hormel's Annual Report on Form 10-K for the fiscal year ended October 27, 2019, File No. 001-02402.)\n10.15(1)\nFirst Amendment to the Credit Agreement, dated as of April 17, 2023, among the Company, Wells Fargo Bank, National Association, as Administrative Agent, Swingline Lender and Issuing Lender, and the lenders identified on the signature pages thereof. (Incorporated by reference to Exhibit 10.1 to Hormel's Quarterly Report on Form 10-Q for the quarter ended April 30, 2023, File No. 001-02402)\n21.1(2)\nSubsidiaries of the Registrant.\n23.1(2)\nConsent of Independent Registered Public Accounting Firm.\n24.1(2)\nPower of Attorney.\n31.1(2)\nCertification Required Under Section 302 of the Sarbanes-Oxley Act of 2002.\n31.2(2)\nCertification Required Under Section 302 of the Sarbanes-Oxley Act of 2002.\n32.1(2)\nCertification Pursuant to 18 U.S.C. Section 1350 as Adopted Pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n97.1(2)\nHormel Foods Corporation Compensation Recovery Policy\n101(2)\nThe following financial statements from the Company's Annual Report on Form 10-K for the fiscal year ended October 29, 2023, formatted in Inline XBRL: (i) Consolidated Statements of Financial Position, (ii) Consolidated Statements of Operations, (iii) Consolidated Statements of Comprehensive Income, (iv) Consolidated Statements of Changes in Shareholders Investment, (v) Consolidated Statements of Cash Flows, and (vi) Notes to the Consolidated Financial Statements, tagged as blocks of text and including detailed tags.\n104(2)\nThe cover page from the Company's Annual Report on Form 10-K for the fiscal year ended October 29, 2023, formatted in Inline XBRL (included as Exhibit 101).\n(1)\nDocument has previously been filed with the Securities and Exchange Commission and is incorporated herein by reference.\n(2)\nThese exhibits transmitted via EDGAR.\n(3)\nManagement contract or compensatory plan or arrangement.\nItem 16. FORM 10-K SUMMARY\nNot applicable.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nHORMEL FOODS CORPORATION\nBy: /s/ JAMES P. SNEE December 6, 2023\nJAMES P. SNEE Date\nChairman of the Board, President and Chief Executive Officer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated.\nSignature Title Date\n/s/ JAMES P. SNEE Chairman of the Board, President and Chief Executive Officer December 6, 2023\nJAMES P. SNEE (Principal Executive Officer)\n/s/ JACINTH C. SMILEY Executive Vice President and Chief Financial Officer December 6, 2023\nJACINTH C. SMILEY (Principal Financial Officer)\n/s/ PAUL R. KUEHNEMAN Vice President and Controller December 6, 2023\nPAUL R. KUEHNEMAN (Principal Accounting Officer)\n/s/ PRAMA BHATT*\nDirector December 6, 2023\nPRAMA BHATT\n/s/ GARY C. BHOJWANI* Director December 6, 2023\nGARY C. BHOJWANI\n/s/ STEPHEN M. LACY* Director December 6, 2023\nSTEPHEN M. LACY\n/s/ ELSA A. MURANO* Director December 6, 2023\nELSA A. MURANO\nDirector\nSUSAN K. NESTEGARD\n/s/ WILLIAM A. NEWLANDS* Director December 6, 2023\nWILLIAM A. NEWLANDS\n/s/ CHRISTOPHER J. POLICINSKI* Director December 6, 2023\nCHRISTOPHER J. POLICINSKI\n/s/ JOSE L. PRADO* Director December 6, 2023\nJOSE L. PRADO\n/s/ SALLY J. SMITH* Director December 6, 2023\nSALLY J. SMITH\n/s/ STEVEN A. WHITE* Director December 6, 2023\nSTEVEN A. WHITE\n/s/ RAYMOND G. YOUNG* Director December 6, 2023\nRAYMOND G. YOUNG\n/s/ MICHAEL P. ZECHMEISTER* Director December 6, 2023\nMICHAEL P. ZECHMEISTER\n*By: /s/ PAUL R. KUEHNEMAN December 6, 2023\nPAUL R. KUEHNEMAN\nas Attorney-In-Fact"
}