{
    "cik": "50292",
    "company": "IEH Corp",
    "filing_type": "10-K",
    "filing_date": "2023-10-06",
    "period_of_report": "2023-03-31",
    "sic": "3678",
    "state_of_inc": "NY",
    "state_location": "NY",
    "fiscal_year_end": "0331",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/50292/0001213900-23-081163-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/50292/000121390023081163/f10k2023_iehcorp.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/50292/0001213900-23-081163.txt",
    "filename": "50292_10K_2023_0001213900-23-081163.htm",
    "content": "Item 1. Business:\nIEH Corporation (hereinafter referred to as IEH or the Company) began operations in New York, New York in 1941 and was incorporated as a New York corporation in March 1943, when Louis Offerman founded L. Offerman Tool & Die with his two sons, Bernard and Seymour.\nIn the late 1960s, IEH bought a license to manufacture HYPERBOLOID sockets, and began making printed circuit board (PCB) connectors for the defense and aerospace industries, in accordance with the MIL-DTL-55302 military specification. We have been making these connectors and variations of them ever since, and today, we are one of the leaders in HYPERBOLOID connectors and contacts.\nIn use for nearly 50 years under demanding conditions, HYPERBOLOID technology has proven itself to be the leading design for integrity and reliability. On avionics platforms, military and commercial aerospace equipment, engine control systems, missiles and torpedoes, vehicular electronics, satellites and rocket launchers, medical devices, industrial and environmental controls, test equipment, pin grid array (PGA) sockets and countless other rugged applications, HYPERBOLOID aims to be the highest reliability connector available.\nAt IEH, we design and manufacture HYPERBOLOID connectors that not only accommodate, but exceed military and aerospace specification standards. Years after inception, our HYPERBOLOID solutions continue to prove their reliability and benefits. Our engineers have long provided reliable and innovative HYPERBOLOID interconnect solutions for defense, commercial, aerospace and medical use.\nWe are a family managed business, as Louis great-grandson David is the President and Chief Executive Officer, and we believe that we still manufacture the highest quality products for the most demanding environments. But most importantly, we are always looking ahead. We are committed to developing new technology that meets the demands of our fast-paced customers, and we are steadfast about always exceeding our customers expectations.\nIEH serves customers in the United States and internationally. Our customers include defense contractors, commercial aerospace equipment manufacturers, medical device manufacturers, oil and gas exploration firms, and commercial space launch companies. We sell both directly and through distributors. We maintain a Military Specification QPL (Qualified Product Listing), and an ISO (International Standards Organization) 9001:2015 Certification.\nFor the fiscal years ending March 31, 2023 and 2022, approximately 56.3% and 59.1%, respectively, of the Companys sales were for defense applications, 25.7% and 14.7%, respectively, for commercial aerospace, and 18.0% and 26.2%, respectively, for the remainder for commercial space launch, medical, oil and gas and industrial markets.\nNew Product Development:\nIEH continues to expand the scope and range of its PCB connector offerings. We have also increased the breadth of our products by introducing high-speed connectors for data transmission, as well as hybrid power/signal connectors. New product developments are primarily driven by customer demand. IEH also continues to specialize in custom interconnects designed specifically for customer applications. Our engineers work in conjunction with customer engineers to create, refine and manufacture connectors and interconnect solutions that meet their specific, demanding needs. IEH engineers are renowned for their flexibility and creativity in solving customer interconnect challenges and providing innovative solutions.\nMarketing and Sales:\nThe market for connectors and interconnect devices, domestic and worldwide, is highly fragmented as a result of the manufacture by many companies of a multitude of different types and varieties of connectors and interconnects. For example, connectors include: printed wiring board, rectangular I/O, circular, planar (IOC) RF coaxial, IC socket and fiber optic. The Company has been servicing a niche in the market by manufacturing connectors containing HYPERBOLOID contact designs in the printed wiring board style of connectors.\nThe Company is continuously experimenting with innovative connection designs, which may cause it to alter its marketing plans in the future if a market should develop for any of its current or future innovative designs. The Company is continually reviewing product lines being sold in the connector and interconnect marketplace. We are committed to expanding our product offering and we consider that many of our current or future custom designs will become product lines.\nThe Companys products are marketed to Original Equipment Manufacturers (OEM) directly and through authorized representatives and distributors serving primarily the Defense, Aerospace, Medical, Space, Industrial, Test Equipment and Commercial Electronics markets. The Company is also involved in developing new connectors for specific uses, which result from changes in technology. The Company assists customers in the development and design of connectors for specific customer applications. This service is marketed to customers who require the development of connectors and interconnection devices specially designed to accommodate the customers own products.\nThe Company is primarily a manufacturer and its products are essentially basic components of larger assemblies of finished goods. During the year ended March 31, 2023, there were no individual customers whose revenues were 10% or more of the Companys net revenues. During the year ended March 31, 2022, approximately 37.1% of the Companys total net sales represented three customers, and consisted individually of 12.5%, 12.3% and 12.3% of net revenues.\nThe Company currently employs 22 independent sales organizations to market its products in all regions in the United States as well as in Canada, the European Union (EU), Southeast Asia, Central Asia and the Middle East. These independent sales representatives also promote the product lines of other electronics manufacturers; however, they do not promote the product lines of manufacturers which compete directly with the Companys products. These sales representatives accounted for approximately 75% of the Companys net sales for the fiscal year ended March 31, 2023 (with the balance of Company net sales being generated via direct customer contact).\nInternational sales accounted for approximately 14.8% and 23.8% of net sales for the fiscal years ended March 31, 2023 and 2022, respectively. Approximately 39.8% and 68.2% of the aforementioned international net sales for fiscal years ended March 31, 2023 and 2022, respectively, represent sales to customers located in China.\nWe also market our products and capabilities through our website, www.iehcorp.com. Our product series HBH Hybrid Power/Signal HYPERBOLOID Connectors, has a configuration tool that allows users to build their own hybrid connector and download 3D models to incorporate into their modules.\nBacklog of Orders/Capital Requirements:\nOur customers typically enter into supply arrangements for the purchase of our products which we will produce and deliver over time. On an as-needed basis, our customers place specific production orders, and these orders are generally filled and shipped within twelve weeks. Our backlog consists of supply arrangements where the anticipated unfulfilled shipping dates are within approximately twelve months. Because of the possibility of customer changes in delivery schedules or the cancellation of orders, our backlog as of any particular date may not be indicative of revenue in any future period. The backlog amounted to approximately $13,724,000 at March 31, 2023 as compared to $7,909,000 at March 31, 2022. The increase in total backlog as of March 31, 2023 compared with the previous year is primarily due to increases in aerospace and defense customer demand, driven in large part by the recovery of commercial aviation after the earlier grounding of the Boeing 737 Max jet and the impact of COVID-19, as well as increases in orders from our defense customers.\nA portion of these backlog orders are subject to cancellation or postponement of delivery dates and, therefore, no assurance can be given that actual sales will result from these orders. The Company does not foresee any problems which would prevent it from fulfilling these orders.\nForward Looking Business Trends:\nImpact of COVID-19 and Other Factors:\nSince early 2020, the world has been impacted by the novel coronavirus (COVID-19) pandemic. In previous periods, COVID-19 (including its variants and mutations) and measures to prevent its spread disrupted our business in a number of ways, including strains on supply chains, and general economic conditions. Although restrictions in the United States have largely been lifted, in international markets, such as in China, there continue to be disruptions from the COVID-19 pandemic. If new COVID-19 variants emerge or additional governmental restrictions are imposed domestically or internationally, our business may be harmed. For example, in the future, the COVID-19 pandemic may cause reduced demand for certain products we provide. We are not able to predict the full extent of the impact of the COVID-19 pandemic on our financial and operating results and how the COVID-19 pandemic will evolve domestically and internationally.\nAdditionally, our operations are subject to global economic and geopolitical risks. For example, while the Company does not have a presence in these regions, the ongoing conflict between Russia and Ukraine has impacted economic activity as well as the availability and price of raw materials and energy. The Company continues to actively monitor these factors and find ways to mitigate the impact on its operations.\nFor additional information on risk factors that could impact our results, please refer to Risk Factors in Part II, Item 1A. Risk Factors:\nIn evaluating our company and our business, you should carefully consider the risks and uncertainties described below, together with the other information in this Annual Report on Form 10-K. The occurrence of one or more of the events or circumstances described in these risk factors, alone or in combination with other events or circumstances, may have a material adverse effect on our business, reputation, revenue, financial condition, results of operations or future prospects, in which case the market price of our common stock could decline, and you could lose part or all of your investment. The material and other risks and uncertainties summarized in this Annual Report on Form 10-K and described below are not intended to be exhaustive and are not the only ones we face. Additional risks and uncertainties not presently known to us or that we currently deem immaterial may also impair our business. This Annual Report on Form 10-K also contains forward-looking statements that involve risks and uncertainties. Our actual results could differ materially from those anticipated in the forward-looking statements as a result of a number of factors, including the risks described below. See the section titled Cautionary Statement Regarding Forward-Looking Statements.\nRisks Related to Our Business:\nWe operate in a niche industry and our business results may vary from year to year depending upon, among other things, the nature of the ordering cycle of our products which makes it hard to predict demand for our business and may adversely impact our business and results of operations.\nWe manufacture PCB connector offerings for specialized applications and our customers include defense contractors, commercial aerospace equipment manufacturers, medical device manufacturers, oil and gas exploration firms, and commercial space launch companies. Our products are typically a small part in a larger end product used by our customers. Supply shortages or other factors impacting third party suppliers that supply different parts to our customers for use in the same end product in which our product is used can impact demand for our products. For example, we believe that recent supply shortages for parts produced by other manufacturers in the end product in which our product is used has caused delays in ordering our products. In addition, due to the specialized nature of our products, we often manufacture limited quantities of our products. Since we are producing customized products in smaller quantities, we are not able to achieve economies of scale, we are unable to obtain bulk discounts on our orders for raw materials and sometimes the fulfillment of the supply of the raw materials used in our products is delayed because our suppliers may prioritize larger orders. All of these factors may have an adverse impact on our business and results of operations.\nIn addition, the ultimate end product in which our products are used have long and irregular ordering cycles which may cause our business results to vary year to year. For example, some of our products are used in airplanes which often are operable for about thirty years and thus are replaced over longer time horizons than many other products and are susceptible to changes in the demand for travel. The ordering cycle for our customers is often irregular and hard to predict. For example, our sales have declined, generally on a quarter over quarter basis, from the quarter ended September 30, 2020 through the quarter ended March 31, 2023, and we are unable to predict if or when they will increase in the future. This makes it difficult for us to anticipate when demand increases will occur and adjust our business and ordering to accommodate fluctuations in demand. If we are not able to ramp production up or down quickly enough in response to rapid changes in demand, we may not be able to effectively manage our costs, which could negatively impact operating results, and we may lose sales and market share.\nThe loss of certain substantial customers could materially and adversely affect us.\nDuring the fiscal year ended March 31, 2023, there were no individual customers whose revenues were 10% or more of the Companys net revenues. During the year ended March 31, 2022, approximately 37.1% of the Companys total net sales were from three customers, and consisted individually of 12.5%, 12.3% and 12.3% of our total net sales for the year. We believe that the loss of one or more of our larger customers could have a material adverse effect on our financial position and results of operations. We have experienced significant concentrations of customers in prior years. Furthermore, factors that negatively impact the businesses of our major customers could materially and adversely affect us even if the customer represents a relatively small part of our net sales.\nWe may need additional funding in the future and if we are unable to raise capital when needed, we could be forced to delay, reduce or eliminate our production or business efforts.\nAlthough we have enough working capital in the short term, we may need to raise additional funding in connection with our continuing operations through the debt or equity markets in the future. If we are unable to raise capital when needed or on attractive terms, we could be forced to delay, reduce or eliminate our business efforts. Any capital raising efforts would also be impacted by our administrative proceeding with the SEC pursuant to Exchange Act section 12(j), and whether the SEC suspends for up to twelve months, or revokes, the registration of our securities. Any additional fundraising efforts may divert our management from their day-to-day activities, which may adversely affect our business. In addition, we cannot guarantee that future financing will be available in sufficient amounts or on terms acceptable to us, if at all. Additionally, market volatility resulting from macroeconomic conditions or other factors could also adversely impact our ability to access capital as and when needed. Moreover, the terms of any financing may adversely affect the holdings or the rights of our stockholders and the issuance of additional securities, whether equity or debt, by us, or the possibility of such issuance, may cause the market price of our shares to decline. The sale of additional equity or convertible securities would dilute all of our stockholders and may decrease our stock price. The incurrence of indebtedness could result in increased fixed payment obligations and we may be required to agree to certain restrictive covenants, such as limitations on our ability to incur additional debt, limitations on our ability to acquire, sell, or license intellectual property rights and other operating restrictions that could adversely impact our ability to conduct our business. We could also be required to seek funds through arrangements with partners or others and we may be required to relinquish rights to some of our intellectual property or otherwise agree to terms unfavorable to us, any of which may have a material adverse effect on our business, operating results and prospects. If we are unable to obtain funding on a timely basis, our business, financial condition and results of operations may be materially affected.\nOur failure to prepare and timely file our periodic reports with the SEC limits our access to the public markets to raise debt or equity capital.\nWe did not file our Quarterly and Annual Reports for the years ended March 31, 2022 and March 31, 2021 and the related quarterly periods until we filed a Form 10-K for these periods on June 22, 2023. The Quarterly and Annual reports for the fiscal year ended March 31, 2023 and the related quarterly periods were not filed until October 6, 2023. Thus, we have not remained current in our reporting requirements with the SEC. We are not currently eligible to use a registration statement on Form S-3 that would allow us to continuously incorporate by reference our SEC reports into the registration statement, or to use shelf registration statements to conduct offerings, until approximately one year from the date we regain and maintain status as a current filer. If we wish to pursue an offering now, we would be required to conduct the offering on an exempt basis, such as in accordance with Rule 144A, or file a registration statement on Form S-1. Using a Form S-1 registration statement for a public offering would likely take significantly longer than using a registration statement on Form S-3 and increase our transaction costs, and could, to the extent we are not able to conduct offerings using alternative methods, adversely impact our ability to raise capital or complete acquisitions of other companies in a timely manner.\nThe Company may have limited intellectual property protection.\nThe Company possesses certain proprietary intellectual property, including but not limited to, trade secrets, know-how and proprietary processes. The Company relies on this intellectual property, know-how and other proprietary information, and requires employees, consultants and suppliers to sign confidentiality agreements. However, these confidentiality agreements may be breached, and the Company may not have adequate remedies for such breaches. Third parties may independently develop substantially equivalent proprietary information without infringing upon any proprietary technology. Third parties may otherwise gain access to proprietary information and adopt it in a competitive manner. Any loss of intellectual property protection may have a material adverse effect on the business, results of operations or prospects.\nWe are a niche manufacturer of highly engineered products that are high value/short run, using a unique mix of labor and capital equipment.\nOur engineers provide HYPERBOLOID interconnect solutions for defense, commercial, aerospace and medical use. Our products are specialized and require special equipment and skilled workers to operate our machinery. Our reliance on our skilled labor and capital equipment subjects us to a number of risks that could negatively affect our ability to manufacture our products and harm our business, including interruption of supply. We expect our overall reliance on our mix of labor and capital equipment to continue. Any significant delay or interruption in our mix of labor and capital equipment could impair our ability to meet the demand of our customers and could harm our business. With changes in demand, labor costs, and capital equipment costs, there can be no assurance that we will be able to maintain the labor and capital equipment mix and therefore maintain our margins.\nA significant design, manufacturing or supplier quality issue could adversely affect profitability.\nAs a manufacturer of highly engineered products, the performance, reliability and productivity of the Companys products are some of its competitive advantages. While the Company prides itself on implementing procedures to ensure the quality and performance of its products and suppliers, a significant quality or product issue, whether due to design, performance, manufacturing or supplier quality issue, could lead to scrapping of raw materials, finished goods or returned products, the deterioration in a customer relationship, or other action that could adversely affect costs, future sales and profitability.\nIn December 2021, we opened a secondary facility in Allentown, PA and if we are unable to successfully achieve the planned volume and operating capacity in this facility, our manufacturing and business could be adversely impacted.\nIn December 2021, we opened a new manufacturing facility in Allentown, PA. We have commenced operations and have initially staffed and equipped the facility for targeted levels of production. We expect to continue to add staff and equipment within the facility as we target higher levels of production at the facility. We will need to hire additional personnel to staff and maintain this facility with the technical qualifications to do so. Labor is subject to external factors that are beyond our control, including our industrys competitive market for skilled workers. Cost, inflation and workforce participation rates are additional factors that could impact our ability to effectively hire additional staffing. The failure to achieve targeted levels of production at the facility and the failure to successfully hire and train qualified personnel for the new facility could seriously harm our business and prospects. In addition, ramping up production at the new facility is time intensive, costly and inefficient. If we are unable to successfully ramp up and operate at targeted levels, our business and results of operations may be adversely affected.\nA shortage of availability or an increase in the cost of raw materials and other resources may adversely impact our ability to manufacture our products at cost effective prices and thus may negatively impact profit margins.\nOur results of operations may be materially adversely impacted by difficulties in obtaining raw materials, supplies, power, labor and any other items needed for the production of our products, as well as by the effects of quality deviations in raw materials and the effects of significant fluctuations in the prices. Many of these materials and components are produced by a limited number of suppliers and their availability to us may be constrained by supplier capacity. In 2021, pandemic-related issues created port congestion and intermittent supplier shutdowns and delays, resulting in additional expenses and increasing prices of raw materials generally. In recent periods, we have seen the impacts of inflation drive up costs of materials and labor significantly. Any material disruption to or continuing increases in prices of our raw materials and other resources could materially adversely affect our financial results. Profit margins will be materially and adversely impacted if we are not able to reduce our costs of production, introduce technological innovations, or pass through cost increases to customers.\nWe may be subject to work stoppages at our facilities or those of our principal customers and suppliers, which could seriously impact the profitability of our business.\nOur unionized workforce and those of our customers and suppliers may experience work stoppages during collective bargaining agreement negotiations. In the future, if we are unable to negotiate an acceptable new agreement with the union, upon expiration of the existing contract, we could experience a strike or work stoppage. Contingency plans have been developed that would allow production to continue in the event of a strike.\nOur success is dependent on the performance of our management and the cooperation, performance and retention of our executive officers and key employees.\nOur business and operations are substantially dependent on the performance of our senior management team and executive officers. If our management team is unable to perform it may adversely impact our results of operations and financial condition. We do not maintain key person life insurance on any of our executive officers. The loss of one or several key employees could seriously harm our business. Any reorganization or reduction in the size of our employee base could harm our ability to attract and retain other valuable employees critical to the success of our business.\nIf we lose key personnel or fail to integrate replacement personnel successfully, our ability to manage our business could be impaired.\nOur future success depends upon the continued service of our key management, technical, sales, finance, and other critical personnel. We cannot assure you that we will be able to retain them. The loss of any key employee could result in significant disruptions to our operations, including adversely affecting the timeliness of product releases, the successful implementation and completion of Company initiatives, the effectiveness of our disclosure controls and procedures and our internal control over financial reporting, and the results of our operations. In addition, hiring, training, and successfully integrating replacement sales and other personnel could be time consuming, may cause additional disruptions to our operations, and may be unsuccessful, which could negatively impact future revenues.\nWe are a small business that competes globally in a competitive industry that is highly fragmented.\nThe market for connectors and interconnect devices, domestic and worldwide, is highly fragmented as a result of the manufacture by many companies of a multitude of different types and varieties of connectors and interconnects. The Company has been servicing a niche in the market by manufacturing connectors containing HYPERBOLOID contact designs in the printed wiring board style of connectors. The connector and interconnect device industry is competitive and fragmented and includes numerous small organizations capable of competing in the markets we target. Although large companies tend to not compete directly with us due to the customized and small batch nature of our business, large companies compete in adjacent industries and possess substantially greater financial and other resources than we do. Larger competitors greater resources could allow those competitors to compete more effectively than we can. Our competitors have successfully built their names in the industry in which we compete. These various competitors may be able to offer products more competitively priced and more widely available than our offerings, and also have greater resources to acquire members and suppliers than us. Failure to compete in the industry in which we operate would adversely affect our results of operations.\nOur results of operations and financial condition have been and may in the future be adversely impacted by the COVID-19 pandemic.\nOccurrences of epidemics or pandemics, depending on their scale, may cause different degrees of disruption to the regional, state and local economies in which we offer our products. The COVID-19 pandemic caused changes in customer behavior, as well as economic disruptions. Although consumer activity has improved since the start of the pandemic and government restrictions have been lifted in the United States, recovery varies globally and the ongoing COVID-19 pandemic and its effects continue to evolve. Supply chain issues, inflationary pressures, the emergence of new variants and the reinstatement and subsequent lifting of restrictions and health and safety related measures in response to the emergence of new variants have contributed in the past to the volatility of ongoing recovery. We are unable to predict the future path or impact of any global or regional COVID-19 resurgences, including existing or future variants, or other public health crises. The reinstatement and subsequent lifting of these measures may occur periodically, which could adversely affect our business, operations and financial condition, as well as the business, operations and financial conditions of our customers and suppliers.\nAccounting Related Risks and Other Factors:\nManagement identified material weaknesses in our internal control over financial reporting. Such weaknesses may lead to additional risks and uncertainties, including stockholder lawsuits or other actions, loss of investor confidence and negative impacts on our stock price. Failure to achieve and maintain effective internal control over financial reporting could result in our failure to accurately or timely report our financial condition or results of operations, which could have a material adverse effect on our business and stock price.\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting and for evaluating and reporting on the effectiveness of our system of internal control. Our internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external reporting purposes in accordance with U.S. GAAP. As a public company, we are required to comply with the Sarbanes-Oxley Act and other rules that govern public companies. In particular, we are required to certify our compliance with Section 404 of the Sarbanes-Oxley Act, which requires us to furnish annually a report by management on the effectiveness of our internal control over financial reporting.\nManagement performed an assessment of the effectiveness of our internal control over financial reporting as of March 31, 2023 and concluded that our internal control over financial reporting was not effective as of March 31, 2023, as certain of the Companys controls associated with reconciliations of inventory and cost of products sold were not operating effectively. Further, the Company has not fully established an effective control environment due to the ineffective design and implementation of Information Technology General Controls (ITGC). The Companys ITGC deficiencies included improperly designed controls pertaining to change management and user access rights over systems that are critical to the Companys system of financial reporting. We have taken and continue to take remedial steps to improve our internal control over financial reporting. For further discussion of the material weaknesses identified and our remedial efforts, see Item 9A, Controls and Procedures.\nManagement is working to remediate the identified material weaknesses. Remediation efforts place a significant burden on management and add increased pressure to our financial resources and processes. We may not be able to fully remediate these material weaknesses until additional steps have been completed and have been operating effectively for a sufficient period of time. We cannot assure you that the measures we have taken to date and plan to take will be sufficient to remediate the material weaknesses we identified or avoid the identification of additional material weaknesses in the future. If we are unable to successfully remediate our existing material weaknesses or any additional material weaknesses in our internal control over financial reporting that may be identified in the future in a timely manner, the accuracy and timing of our financial reporting may be adversely affected; our liquidity, our access to capital markets, the perceptions of our creditworthiness and our ability to complete acquisitions may be adversely affected; we may be unable to maintain or regain compliance with applicable securities laws, applicable listing requirements and other requirements; we may be subject to regulatory investigations and penalties; investors may lose confidence in our financial reporting; our reputation may be harmed; we may suffer defaults, accelerations or cross-accelerations under our debt instruments or derivative arrangements to the extent we are unable to obtain additional waivers from the required creditors or counterparties or are unable to cure any breaches; and our stock price may decline.\nMoreover, because of the inherent limitations of any control system, material misstatements due to error or fraud may not be prevented or detected and corrected on a timely basis, or at all. If we are unable to provide reliable and timely financial reports in the future, our business and reputation may be further harmed. Restated financial statements and failures in internal control may also cause us to fail to meet reporting obligations, negatively affect investor and customer confidence in our management and the accuracy of our financial statements and disclosures, result in events of default under our banking agreements, or result in adverse publicity and concerns from investors and customers, any of which could have a negative effect on the price of our common stock, subject us to regulatory investigations and penalties or stockholder litigation, and have a material adverse impact on our business and financial condition.\nEfforts to comply with the applicable provisions of Section 404 of the Sarbanes-Oxley Act involve significant expenditures, and non-compliance with Section 404 of the Sarbanes-Oxley Act may adversely affect us and the market price of our common stock.\nUnder current SEC rules, we are required to report on our internal control over financial reporting pursuant to Section 404 of the Sarbanes-Oxley Act. We are required to review on an annual basis our internal control over financial reporting, and on a quarterly and annual basis to evaluate and disclose changes in our internal control over financial reporting. As a result, we expect to incur additional expenses that may negatively impact our financial performance. This process also results in a diversion of managements time and attention. We cannot be certain as to the timing of completion of our evaluation, testing and remediation actions or the impact of the same on our operations, and we may not be able to ensure that the process is effective or that our internal control over financial reporting is or will be effective in a timely manner. In the event that we are unable to maintain or achieve compliance with the applicable provisions of Section 404 of the Sarbanes-Oxley Act and related rules, we and the market price of our common stock may be adversely affected.\nWe identified certain misstatements to our previously issued financial statements and have restated the financial statements described below, which has exposed us to a number of additional risks and uncertainties.\nOn June 22, 2023, we filed our Form 10-K for the fiscal years ended March 31, 2022, 2021, and 2020. Included therein, we reported that we had restated our previously issued audited financial statements for the year ended March 31, 2020 and our interim financial statements for the quarterly periods ended September 27, 2019 and December 31, 2019. We further reported that these restatements were in connection with the Companys migration to its then new accounting system, including the reconciliation of the old and new systems.\nAs a result of the misstatements and the restatement, we have become subject to a number of additional risks and uncertainties and unanticipated costs for accounting, legal and other fees and expenses, including risks of lawsuits. Any actions, lawsuits or other legal proceedings related to the misstatements or the restatement could result in reputational harm, legal defense and other costs, regardless of the outcome of the lawsuit or proceeding. In addition, we continue to be at risk for loss of investor confidence, loss of key employees, changes in management or our board of directors and other reputational issues, all of which could have a material adverse effect on our business, financial position and results of operations.\nOur ongoing efforts to remediate our internal control weaknesses may continue to divert management from the operation of our business. The absence of timely and accurate financial information has hindered and may in the future hinder our ability to effectively manage our business.\nThe Board of Directors, members of management, and our accounting and other staff previously has spent significant time on the restatement and remediation and will continue to spend significant time on remediation of internal control over our financial reporting. These resources have been, and will likely continue to be, diverted from the strategic and day-to-day management of our business and may have an adverse effect on our ability to accomplish our strategic objectives.\nWe may face litigation and regulatory action relating to the restatement of our financial statements.\nWe cannot ensure that litigation or other claims by shareholders will not be brought in the future arising out of the restatement of our financial statements. We may also be subject to further examinations, investigations, proceedings and orders by regulatory authorities, including a cease and desist order, suspension of trading of our securities, delisting of our securities and/or the assessment of possible civil monetary penalties. Any such further actions could be expensive and damaging to our business, results of operations and financial condition.\nWe have incurred and expect to continue to incur significant expenses related to the restatement and remediation of deficiencies in our internal control over financial reporting and disclosure controls and procedures, and any resulting litigation.\nWe have devoted and expect to continue to devote substantial internal and external resources towards remediation efforts relating to the restatement of our financial statements, the management review process and other efforts to implement effective internal controls. Because of these efforts, we have incurred and expect that we will continue to incur significant fees and expenses for legal, accounting, financial and other consulting and professional services, as well as the implementation and maintenance of systems and processes that will need to be updated, supplemented or replaced. As described in this Annual Report on Form 10-K, we have taken a number of steps in order to strengthen our accounting function so as to allow us to be able to provide timely and accurate financial reporting. However, we cannot assure you that these steps will be successful. To the extent these steps are not successful, we could be required to incur significant additional time and expense. The expenses we are incurring in this regard, as well as the substantial time devoted by our management towards identifying and addressing the internal control deficiencies, could have a material adverse effect on our business, results of operations and financial condition.\nRISKS RELATED TO THE COMPANYS EFFORTS TO BECOME CURRENT IN ITS PERIODIC REPORTING AND BEING A PUBLIC COMPANY\nAs a result of the Companys late periodic filings, the SEC instituted an administrative proceeding pursuant to Section 12(j) of the Exchange Act to determine whether it is appropriate to suspend for up to twelve months or revoke the registration of the Companys common stock. Although we have filed an answer to the Order, conducted a prehearing conference with the SECs staff, and filed an Opposition Brief to the SEC Division of Enforcements Motion for Summary Disposition, the ultimate outcome of the administrative proceeding may be adverse to the Company, and may result in the suspension or revocation of the registration of our common stock.\nThe Company is currently delinquent in its periodic reporting obligations and as a result the SEC instituted administrative proceedings on August 17, 2022 (the Order) pursuant to Section 12(j) of the Exchange Act to suspend or revoke the registration of our common stock. On October 3, 2022, we filed an answer to the Order and on October 13, 2022, we conducted a prehearing conference with SEC staff in the Division of Enforcement. On March 1, 2023 the SECs Division of Enforcement filed a Motion for Summary Disposition, on March 15, 2023, IEH filed an opposition brief to the SEC Division of Enforcements Motion for Summary Disposition, and on March 29, 2023, the SECs Division of Enforcement filed a Reply in Support of its Motion for Summary Disposition. The Commission will issue a decision on the basis of the record in the proceeding. The Company cannot at this time predict the timing of a decision by the Commission or the outcome of such decision. Although the Company continues to make progress towards completion of its periodic reports and intends to vigorously defend against the allegations in the Order to avoid possible suspension or revocation of the registration of its common stock, if the SEC issues a final order to suspend or revoke the registration of the Companys common stock, brokers, dealers and other market participants would be prohibited from buying, selling, making a market in, publishing quotations of, or otherwise effecting transactions with respect to, such common stock until, in the case of suspension, the lifting of such suspension, or, in the case of a revocation, the Company files a new registration statement with the SEC under the Exchange Act and that registration statement is declared effective. As a result, public trading of the Companys common stock would cease and investors would find it extraordinarily difficult to acquire or dispose of the Companys common stock or obtain accurate price quotations for the Companys common stock, which could result in a significant decline in the value of the Companys stock. In addition, the Companys business may be adversely impacted, including, without limitation, an adverse impact on the Companys ability to issue stock to raise equity capital, engage in business combinations or provide employee incentives.\nThe Company faces challenges in producing accurate financial statements and periodic reports as required on a timely basis.\nAs discussed in this Annual Report on Form 10-K, we have identified material weaknesses in our accounting systems, processes and procedures in connection with the accounting for inventory and cost of products sold. Ultimately, there have been a number of issues with the SAP System, including system design and implementation issues as well as utilization issues. As a result, the Company has hired a number of third party consultants and additional personnel and enhanced many aspects of its accounting procedures. Although the Company believes it has discovered and made improvements to its critical inventory accounting systems, the Company is still in the process of making further refinements in these complex systems and making system and process changes to improve system utilization. The Company continues to have material weaknesses in internal control over financial reporting and, as a result, cannot assure you that the Company will not experience additional errors or delays with respect to the preparation of its financial statements and its periodic reports in the future.\nIn addition, as previously noted, the Company has engaged outside consulting firms and other external consultants to assist its finance organization in completing the preparation of its financial statements, and preparing this Annual Report and other periodic reports. The Company relies heavily on these third party consultants who assist in the preparation of financial statements, including extracting financial data from our SAP System, and the timely filing of periodic reports with the SEC. If our third party consultants are unable to provide the Company with the necessary assistance and financial information in a timely manner, the Company will be unable to file its periodic reports when due. In addition, replacing these consultants with new employees may result in the loss of important institutional knowledge or otherwise create transitional issues that could delay the preparation of financial statements and periodic reports. If we are unable to rely on our third party consultants in the future or we do not receive their assistance in a timely manner, we may in the future have delays in reporting which could adversely affect our business.\nPotential for future errors in the application of accounting rules and pronouncements.\nThe completion of the audits of our financial statements involved significant review and analyses, including highly technical analyses of data and business practices and the extraction of data from the SAP System. Given the complexity and scope of this process, and despite the extensive time, effort and expense that went into it, additional accounting errors may in the future come to light in these or other areas that may result in future restatements.\nEfforts by the Company to become current in its periodic reporting obligations have required diversion of managements attention from business operations, led to concerns on the part of investors about the financial condition of the Company and potential loss of business opportunities and resulted in the incurrence of substantial expenses.\nSince discovering the issues with the Companys previously reported financials in connection with the Companys transition to the SAP System and the Companys recognition of related material weaknesses in its systems of internal control regarding the accounting for inventory and cost of product sold, the Companys management, including its finance and accounting personnel, has devoted and continue to devote substantial time, effort and resources to its efforts to become current in its periodic reporting obligations, in addition to performing its day-to-day duties. These efforts and the exigent circumstances have diverted and may continue to divert, managements attention away from our business. In addition, the delay in the completion of the Companys periodic reports and the financial condition of the Company have caused concerns on the part of investors and may have resulted in the loss of potential business opportunities or declines in the value of the Companys common stock.\nIn addition, to assist their respective finance and accounting teams, the Company engaged outside accounting consulting firms and other external consultants to assist in the preparation of financial statements and periodic reports and has incurred and continues to incur substantial expenses for their services, in addition to incurring substantial expenses for external legal, tax and other professional services.\nThe staff of the SEC may review the periodic reports of the Company and may request amendments of financial information or other disclosures.\nFollowing its review of periodic reports (including, but not limited to, this Annual Report) filed with the SEC, the staff of the SEC may request that the Company make additional changes to its reporting of financial information contained in such periodic reports, potentially requiring amendments to our financial information or other disclosure.\nAny further amendments to the financial information of the Company, among other things:\n● would distract managements attention from our business and operations;\n● may require the Company to suspend the exercise of options by employees until it becomes current again in its periodic reporting obligations under the federal securities laws;\n● would result in incurring substantial additional professional expenses;\n● may adversely affect the Companys reputation, credibility with customers and investors and its ability to raise capital; and\n● may subject the Company to the risk of additional litigation and regulatory investigations and actions.\nThe requirements of being a public company may strain our resources, divert managements attention and affect its ability to attract and retain qualified board members.\nAs a public company listed in the U.S., we are subject to the reporting requirements of the Exchange Act, the Sarbanes-Oxley Act and any rules promulgated thereunder. Our management team may not successfully or efficiently manage being a public company that is subject to significant regulatory oversight and reporting obligations under the federal securities laws and the continuous scrutiny of securities analysts and investors. Operating a public company requires significant attention from our senior management and could divert their attention away from the day-to-day management of our business, which could harm our business, results of operations and financial condition. For example, the requirements of these rules and regulations increase our legal and financial compliance costs, make some activities more difficult, time-consuming or costly, and increase demand on our systems and resources. The Sarbanes-Oxley Act requires, among other things, that we maintain effective disclosure controls and procedures and internal controls for financial reporting. In order to maintain and improve our disclosure controls and procedures and internal control over financial reporting to meet this standard, significant resources and management oversight is required and, as a result, managements attention may be diverted from other business concerns. The costs of compliance with public company reporting requirements and our potential failure to satisfy these requirements could have a material adverse effect on our operations, business, financial condition or results of operations.\nIn order to satisfy our obligations as a public company, we may need to hire additional qualified accounting and financial personnel with appropriate public company experience.\nAs a public company, we need to establish and maintain effective disclosure and financial controls and adhere to certain corporate governance practices. We may need to hire additional accounting and financial personnel with appropriate public company experience and technical accounting knowledge, and it may be difficult to recruit and retain such personnel. Even if we are able to hire appropriate personnel, our existing operating expenses and operations will be impacted by the direct costs of their employment and the indirect consequences related to the diversion of management resources from other business concerns.\nRISKS RELATED TO OUR COMMON STOCK\nOur stock price is volatile and could decline; there is currently a limited trading market for our common stock and we cannot predict how liquid the market might become.\nThere has been a limited trading market for our common stock and we cannot predict how liquid the market for our common stock might become. On September 28, 2021 our stock began trading in accordance with the OTC Pink Sheet No Information tier. Broker dealer firms are not able to provide stock quotes for IEHs common stock and transactions are limited to the Expert market. The quotation of our common stock on the OTC Pink Sheets does not assure that a meaningful, consistent and liquid trading market exists. The market price for our common stock is subject to volatility and holders of our common stock may be unable to resell their shares at or near their original purchase price, or at any price. In the absence of an active trading market, investors may have difficulty buying and selling, or obtaining market quotations for our common stock; market visibility for our common stock may be limited; and a lack of visibility for our common stock may have a depressive effect on the market for our common stock. While we intend to regain listing on an actively traded platform, there can be no assurance that we will be successful.\nThe price of our common stock has been, and is likely to continue to be, volatile. For example, our stock price during the fiscal year ended March 31, 2023 traded as low as $6.20 and as high as $12.50 per share and during the fiscal year ended March 31, 2022, our stock price traded as low as $11.95 per share and as high as $18.25 per share. Fluctuations may be exaggerated since the trading volume is and would likely be volatile, limited, and sporadic. These fluctuations may or may not be based upon any business or operating results. We cannot assure you that your investment in our common stock will not decline.\nExcept for a single dividend declared and paid in 2017, we have not paid dividends in the past and do not expect to pay dividends in the future. Any return on investment may be limited to the value of our common stock.\nExcept for a single dividend declared and paid in 2017, we have never paid cash dividends on our common stock and do not anticipate doing so in the foreseeable future. The payment of dividends on our common stock will depend on earnings, financial condition and other business and economic factors affecting us at such time as our board of directors may consider relevant. If we do not pay dividends, our common stock may be less valuable because a return on your investment will only occur if our stock price appreciates.\nThe Offerman family has substantial influence over our management and policies, and their interests may conflict with ours or yours in the future.\nGail Offerman and Dave Offerman, our Chief Executive Officer, (the Offerman Investors) beneficially own approximately 46.7% of our common stock as of October 6, 2023, and will generally vote together as a single class on matters submitted to a vote of our stockholders. As a result, the Offerman Investors may exert substantial influence on other actions requiring a shareholder vote, potentially in a manner that you do not support, including the election and removal of directors and the approval of any merger, consolidation or sale of all or substantially all of our assets. In addition, the ownership of such stockholders could preclude any unsolicited acquisition of us, and consequently, adversely affect the price of our common stock. In addition, the Offerman Investors and their affiliates exercise significant influence over the operations of our Company because the Company has been a business led by the Offerman family for generations. These stockholders may make decisions that are adverse to your interests.\nWe have reduced disclosure and governance requirements applicable to smaller reporting companies, which could result in our common stock being less attractive to investors.\nWe have a public float of less than $250 million and therefore qualify as a smaller reporting company under the rules of the SEC. As a smaller reporting company, we are able to take advantage of reduced disclosure requirements, such as simplified executive compensation disclosures, exemption from the provisions of Section 404(b) of the Sarbanes-Oxley Act requiring that our independent registered public accounting firm provide an attestation report on the effectiveness of internal control over financial reporting and reduced financial statement disclosure requirements in our SEC filings. Decreased disclosures in our SEC filings due to our status as a smaller reporting company may make it harder for our investors to analyze our results of operations and financial prospects. We cannot predict if investors will find our common stock less attractive due to our reliance on these exemptions. If some investors find our common stock less attractive as a result, there may be a less active trading market for our common stock and our stock price may be volatile.\nThere are risks related to the implementation of our perpetual accounting system.\nSince 2020, we have been operating on a new perpetual accounting system, SAPs Business One system along with an add-on inventory and production module, Beas Manufacturing (New SAP System) in order to improve our financial reporting. Since implementation, we have been engaged in a multi-year process to refine the functionality of the New SAP System, most significantly around the accounting for inventory and costs of products sold. We have identified the causes of the errors that led to the restatement of previously reported financials and have made enhancements to the New SAP System to remediate those causes. There remains further work to improve and optimize the New SAP System, and that work is ongoing. Any significant deficiency in the design and implementation of the SAP System could negatively impact our financial data and may result in inaccurate financials or delays in our periodic reports with the SEC, which may have a material adverse effect on our business, financial condition or results of operations.\nRisks Related to General Economic Conditions and Other Factors:\nChanges in general economic conditions, geopolitical conditions, U.S. trade policies and other factors beyond the Companys control may adversely impact our business and operating results.\nThe Companys operations and performance depend significantly on global, regional and U.S. economic and geopolitical conditions. The United States has from time to time experienced challenging economic conditions, including in connection with the COVID-19 pandemic, and the global financial markets have recently undergone and may continue to experience significant volatility and disruption. Our business, financial condition and results of operations may be materially adversely affected by changes in consumer confidence, levels of unemployment, inflation, interest rates, tax rates and general uncertainty regarding the overall future economic environment. A recession or slowdown in the economy may cause a decline in demand for our products and have a negative impact on our business.\nWe are also impacted by changes in trade policy. In recent years, there has been discussion and dialogue regarding potential significant changes to U.S. trade policies, legislation, treaties and tariffs. Changes to current policies by the U.S. or other governments could affect our business, including potentially through increased import tariffs and other influences on U.S. trade relations with other countries. The imposition of additional tariffs or other trade barriers could increase our costs in certain markets, and may cause our customers to find alternative sourcing. In addition, other countries may change their own policies on business and foreign investment in companies in their respective countries. Additionally, it is possible that U.S. policy changes and uncertainty about such changes could increase market volatility and currency exchange rate fluctuations. Market volatility and currency exchange rate fluctuations could have a material adverse effect on our business, financial condition, results of operations or cash flows. As a result of these dynamics, we cannot predict the impact to our business of any future changes to the U.S.s trading relationships.\nA number of other economic and geopolitical factors both in the United States and abroad could have a material adverse effect on the Companys business, financial condition, results of operations or cash flows, such as:\n● a global or regional economic slowdown in any of the Companys market segments;\n● postponement of spending, in response to tighter credit, financial market volatility and other factors;\n● effects of significant changes in economic, monetary and fiscal policies in the United States and abroad including significant income tax changes, currency fluctuations and inflationary pressures;\n● rapid material escalation of the cost of regulatory compliance and litigation;\n● changes in government policies and regulations affecting the Company or its significant customers or suppliers;\n● employment regulations and local labor conditions, including increases in employment costs;\n● industrial policies in various countries that favor domestic industries over multinationals or that restrict foreign companies altogether;\n● longer payment cycles; and\n● credit risks and other challenges in collecting accounts receivable.\nThe global nature of our operations exposes us to numerous risks that could materially adversely affect our financial condition and results of operations.\nWe serve customers in the United States and abroad, with a sales presence in over 40 countries. Sales outside of the United States are subject to various risks that may not be present or as significant for our U.S. operations. Economic uncertainty in some of the geographic regions in which we sell our products could result in the disruption of commerce and negatively impact cash flows from our operations in those areas. Risks inherent in our international operations include, among others:\n● COVID-19-related closures and other pandemic-related uncertainties in the countries in which we operate;\n● Import and export regulations that could erode profit margins or restrict exports;\n● Foreign exchange controls and tax rates;\n● Foreign currency exchange rate fluctuations, including devaluations;\n● Changes in regional and local economic conditions, including local inflationary pressures;\n● Difficulty of enforcing agreements and collecting receivables through certain foreign legal systems;\n● Variations in protection of intellectual property and other legal rights;\n● Inability or regulatory limitations on our ability to move goods across borders;\n● Changes in laws and regulations, including the laws and policies of the United States affecting trade, tariffs and foreign investment;\n● Restrictive governmental actions such as those on transfer or repatriation of funds and trade protection matters, including antidumping duties, tariffs, trade wars, embargoes and prohibitions or restrictions on acquisitions or joint ventures;\n● Unsettled political conditions and possible terrorist attacks against U.S. or other interests; and\n● Political tensions and armed conflict, such as the ongoing war between Russia and Ukraine.\nIf we are unable to anticipate and effectively manage these and other risks, it could have a material and adverse effect on our business, our results of operations and financial condition.\nWe are the primary source for various commercial and aerospace applications in China. There is always a risk of being second sourced by domestic manufacturers, and trade tensions or nationalizing supply chains adversely impacting our business.\nSales to customers located outside the U.S. accounted for approximately 14.8% and 23.8% of our revenue in the fiscal years ended March 31, 2023 and March 31, 2022, respectively. Of these amounts, approximately 39.8% and 68.2% were attributable to sales to customers located in China in the fiscal years ended March 31, 2023 and March 31, 2022, respectively. We expect that revenue from international sales to China will continue to be a significant part of our total revenue. Any weakness in the Chinese economy could result in a decrease in demand for consumer products that contain our products, which could materially and adversely affect our business. In addition, there is a risk that manufacturers in China may compete with us and replace us. The imposition by the U.S. of tariffs on goods imported from China, countermeasures imposed by China in response, U.S. export restrictions on sales of products to China and other government actions that restrict or otherwise adversely affect our ability to sell our products to Chinese customers may have a material impact on our business. In addition, we may be subject to rules and regulations of the PRC or the jurisdiction of other governmental agencies in the PRC that may adversely affect our rights and obligations. In the event of a dispute, we will likely be subject to the exclusive jurisdiction of foreign courts.\nFluctuations in exchange rates could adversely affect our business and the value of our securities.\nThe value of our securities will be indirectly affected by the foreign exchange rate between the U.S. dollar and RMB and between those currencies and other currencies in which our sales may be denominated. Appreciation or depreciation in the value of the RMB relative to the U.S. dollar would affect our financial results reported in U.S. dollar terms without giving effect to any underlying change in our business or results of operations.\nTo date, we have not entered into any hedging transactions. While we may enter into hedging transactions in the future, the availability and effectiveness of these transactions may be limited, and we may not be able to successfully hedge our exposure at all. In addition, our foreign currency exchange losses may be magnified by PRC exchange control regulations that restrict our ability to convert RMB into foreign currencies. As a result, fluctuations in exchange rates may have a material adverse effect on your investment.\nIf relations between the U.S. and China worsen, our business could be adversely affected by the trade war and investors may be unwilling to hold or buy our stock and our stock price may decrease.\nAt various times during recent years, the U.S. and China have had significant disagreements over political and economic issues. Controversies may arise in the future between these two countries. Any political or trade controversies between the U.S. and China, whether or not directly related to our business, could reduce the price of our common stock. These controversies also could make it more difficult for us to sell our products to our customers in China. The international trade policies of China and the U.S. could adversely affect our business, and the imposition of trade sanctions relating to import and export of goods, taxes, tariffs and duties and other charges on imports from China or exports to China. Due to an increase in tariffs imposed by China on products from the U.S., some of our customers might seek alternatives, which could have a negative impact on our sales as we mainly sell our own products to customers in China. In order to avoid these tariffs, the market has shifted towards an uncertain era including sourcing from other countries. Our sales during this stage may also be negatively impacted by this shift in behavior.\nChanges in defense expenditures may reduce the Companys sales.\nApproximately 56.3% and 59.1% of the Companys net revenues for the fiscal years ended March 31, 2023 and March 31, 2022, respectively, came from sales to the defense market. The Company participates in a broad spectrum of defense programs. Accordingly, the Companys sales are affected by changes in the defense budgets and policies of the U.S. government. A significant decline in U.S. government defense expenditures for programs in which we participate could have an adverse effect on the Companys business, financial condition and results of operations. U.S. government expenditures are also subject to political and budgetary fluctuations and constraints, which may result in significant unexpected changes in levels of demand for our products.\nWe may be adversely affected by natural disasters, pandemics and other catastrophic events and by man-made problems such as terrorism that could disrupt our business operations, and our business continuity and disaster recovery plans may not adequately protect us from a serious disaster.\nOur business operations are located in Brooklyn, New York and Allentown, PA. If a disaster, power outage, computer hacking, or other event occurred that prevented us from using all or a significant portion of our facilities, that damaged critical infrastructure, such as enterprise financial systems, IT systems, manufacturing resource planning or enterprise quality systems, or that otherwise disrupted operations, it may be difficult or, in certain cases, impossible for us to continue our business for a substantial period of time. As an example, the New York City area was significantly impacted by the COVID-19 pandemic and, due to safety considerations for our employees and government restrictions, including stay-at-home orders, certain of our employees worked from home for an extended period of time. In addition, our suppliers facilities are located in locations susceptible to natural disasters or similar events, such as tornadoes, fires, explosions or large-scale accidents or power outages, or IT threats, pandemics, acts of terrorism and other geo-political unrest, which could severely disrupt our operations and have a material adverse effect on our business, financial condition, operating results and prospects. All of the aforementioned risks may be further increased if we do not implement a disaster recovery plan or our partners or manufacturers disaster recovery plans prove to be inadequate. To the extent that any of the above should result in delays in the manufacture or distribution of our products, our business, financial condition, operating results and prospects would suffer.\nOur business and operations would suffer in the event of system failures, cyber-attacks or a deficiency in our cyber-security.\nDespite the implementation of security measures, our internal computer systems and those of our contractors and consultants are vulnerable to damage from computer viruses, unauthorized access, natural disasters, terrorism, war, artificial intelligence related cyber-attacks, and telecommunication and electrical failures. The risk of a security breach or disruption, particularly through cyber-attacks or cyber-intrusion, including by computer hackers, foreign governments, and cyber-terrorists, has generally increased as the number, intensity and sophistication of attempted attacks and intrusions from around the world have increased. If such an event were to occur and cause interruptions in our operations, it could result in a material disruption of our development programs and our business operations. Item 1B. Unresolved Staff Comments:\nNone. Item 2. Properties:\nThe Company renewed its lease for its manufacturing facility located at 140 58th Street, Suite 8E, Brooklyn, New York on December 1, 2020, and entered into a 120 month lease agreement extension, running through November 30, 2030. The lease is approximately 20,400 square feet of space, of which it is estimated that 6,000 square feet are used as executive, sales and administrative offices and 14,400 square feet are used for its manufacturing, testing and plating operations. The basic minimum annual rental payments remaining on this lease is $2,325,237 as of March 31, 2023.\nThe Company entered into a lease on January 29, 2021 for a building at 200 Cascade Drive, Bldg. 2, Suite H, Allentown, PA 18109 running through March 30, 2028. The lease is approximately 28,800 square feet of space, of which it is estimated that 4,800 square feet are used as executive and administrative offices and 24,000 square feet are used for its manufacturing and testing operations. The basic minimum annual rental payments remaining on this lease is $1,256,346 as of March 31, 2023. Item 3. Legal Proceedings:\nThere are no legal proceedings that have occurred within the past year concerning our directors, or control persons which involved a criminal conviction, a criminal proceeding, an administrative or civil proceeding limiting ones participation in the securities or banking industries, or a finding of securities or commodities law violations.\nOn August 17, 2022, the SEC issued an Order Instituting Administrative Proceedings and Notice of Hearing pursuant to Section 12(j) of the Exchange Act. The stated purpose of the administrative proceeding is for the Commission to determine whether it is necessary and appropriate for the protection of investors to suspend for a period not exceeding twelve months, or revoke the registration of each class of securities registered pursuant to Section 12 of the Exchange Act of the Company. The Company filed an Answer in the proceeding on October 3, 2022 and on October 13, 2022 we conducted a prehearing conference with SEC staff in the Division of Enforcement. On March 1, 2023 the SECs Division of Enforcement filed a Motion for Summary Disposition, on March 15, 2023, IEH filed an opposition brief to the SEC Division of Enforcements Motion for Summary Disposition, and on March 29, 2023, the SECs Division of Enforcement filed a Reply in Support of its Motion for Summary Disposition. The Commission will issue a decision on the basis of the record in the proceeding. Item 4. Mine Safety Disclosures:\nNot applicable.\nIEH CORPORATION\nPART II Item 5. Market for Registrants Common Equity and Related Stockholder Matters and Issuer Purchases of Equity Securities:\nPrincipal Market:\nBeginning on September 28, 2021, as a result of the SECs amendments to Exchange Act Rule 15c2-11 which requires listed companies to be current in their SEC periodic reports or provide alternative information, trading in the Companys shares of common stock is in accordance with the OTC Pink Sheet No Information tier and transactions are limited to the Expert market. As a result, broker dealer firms are not able to provide stock quotes for the Companys common stock. Persons who hold our common stock or wish to purchase our common stock will have to contact their brokers directly in order to buy or sell shares. Prior to September 28, 2021, on March 22, 2019, the Companys shares of common stock (the common stock) commenced trading exclusively on the OTCQX Marketplace. Prior to March 22, 2019, the common stock was traded exclusively on the OTCQB Marketplace commencing on March 17, 2017. The shares are quoted under the ticker symbol IEHC. Investors are able to view real-time quotes at http://www.otcmarkets.com. Because we are quoted on the OTC Pink Sheet, our common stock may be less liquid, receive less coverage by security analysts and news media, and generate lower prices than might otherwise be obtained if it were listed on a national securities exchange.\nMarket Information:\nThe range of high and low bid prices for the Companys common stock, for the periods indicated, are set forth below as reported by the OTC Markets. The table below provides the high and low bid prices of the common stock during the periods indicated. These prices represent quotations between dealers without adjustment for retail mark-up, markdown or commission and may not represent actual transactions.\nHigh Bid Low Bid\nFiscal Year ended March 31, 2022\nApril 1, 2021 - June 30, 2021 $ 18.25 $ 14.99\nJuly 1, 2021 - September 30, 2021 $ 16.50 $ 12.00\nOctober 1, 2021 - December 31, 2021 $ 12.75 $ 11.95\nJanuary 1, 2022 - March 31, 2022 $ 12.50 $ 12.00\nFiscal Year ended March 31, 2023\nApril 1, 2022 - June 30, 2022 $ 12.50 $ 12.15\nJuly 1, 2022 - September 30, 2022 $ 12.25 $ 10.50\nOctober 1, 2022 - December 31, 2022 $ 10.50 $ 6.50\nJanuary 1, 2023 - March 31, 2023 $ 10.00 $ 6.20\nHolders:\nThe number of record holders of the Companys common stock as of September 29, 2023 was 187. Such number of record owners was determined from the Companys shareholder records, and does not include the beneficial owners of the Companys common stock whose shares are held in the names of various security holders, dealers and clearing agencies.\nDividends:\nExcept for a single cash dividend declared and paid in 2017, we have never declared or paid a regular, quarterly cash dividend on our Common Stock, and we do not expect to pay any regular, quarterly cash dividend on our Common Stock in the foreseeable future. Payment of future dividends, if any, on our Common Stock will be at the discretion of our Board of Directors after taking into account various factors, including our financial condition, operating results, anticipated cash needs, and plans for expansion.\nRecent Sales of Unregistered Securities:\nNone. Item 6. [Reserved]\nNot Applicable. Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations:\nStatements contained in this report, which are not historical facts, may be considered forward-looking information with respect to plans, projections, or future performance of the Company as defined under the Private Securities Litigation Reform Act of 1995. These forward-looking statements are subject to risks and uncertainties, which could cause actual results to differ materially from those projected. The words anticipate, believe, estimate, expect, objective, and think or similar expressions used herein are intended to identify forward-looking statements. The forward-looking statements are based on the Companys current views and assumptions and involve risks and uncertainties that include, among other things, the performance of the Companys business, actions of competitors, changes in laws and regulations, including accounting standards, employee relations, customer demand, prices of purchased raw materials and parts, domestic economic conditions, and foreign economic conditions, including currency rate fluctuations.\nThe following discussion and analysis should be read in conjunction with our audited financial statements and related footnotes included elsewhere in this report, which provide additional information concerning the Companys financial activities and condition.\nOverview of Business:\nThe Company designs, develops and manufactures printed circuit board connectors and custom interconnects for high performance applications.\nAll of our connectors utilize the HYPERBOLOID contact design, a rugged, high-reliability contact system ideally suited for high-stress environments. We believe we are the only independent producer of HYPERBOLOID printed circuit board connectors in the United States.\nOur customers consist of OEMs (Original Equipment Manufacturers) and distributors who resell our products to OEMs. We sell our products directly and through 22 independent sales representatives and distributors located in all regions of the United States, Canada, the European Union, Southeast Asia, Central Asia and the Middle East.\nThe customers we service are in the Defense, Aerospace, Space, Medical, Oil and Gas, Industrial, Test Equipment and Commercial Electronics markets. We appear on the Military Qualified Product Listing (QPL) MIL-DTL-55302 and supply customer requested modifications to this specification. Our offering of QPL items has been expanded to include additional products.\nThe customers we service by industry as a percentage of total revenue is provided below:\nFor the Fiscal Years Ended March 31,\nIndustry % %\nDefense 56.3 59.1\nCommercial Aerospace 25.7 14.7\nSpace 9.4 17.7\nOther 8.6 8.5\nWe are exposed to and impacted by macroeconomic factors and U.S., state and local government policies. Current general economic conditions, including the current levels of inflation, have created uncertainties, resulting in market volatility. We have adopted particular measures to protect our employees at our manufacturing operations in Brooklyn, New York, and Allentown, PA, and we expect to execute on our contracts through carefully designed arrangements.\nWorldwide Supply Chain Disruptions\nWorldwide supply chain disruptions, which were initially brought about by the impact of the COVID-19 pandemic, have persisted despite the recovery in the global economy and financial markets. The Company has experienced longer lead times for raw materials and has experienced raw material cost increases compared to prior fiscal years. These and other issues resulting from worldwide supply chain disruptions, including the conflict between Russia and Ukraine, have stabilized but are expected to continue to some degree into fiscal 2024 and could continue to have a material adverse effect on the Companys business, operating results and financial condition. The precise financial impact and duration, however, cannot be reasonably estimated at this time.\nCritical Accounting Policies and Estimates:\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States of America (US GAAP) requires management to make estimates and assumptions about future events that affect the amounts reported in the financial statements and accompanying notes. Future events and their effects cannot be determined with absolute certainty. Therefore, the determination of estimates requires the exercise of judgment. Actual results inevitably will differ from those estimates, and such differences may be material to the financial statements. The most significant accounting estimates inherent in the preparation of our financial statements include estimates associated with revenue recognition, valuation of inventories, accounting for income taxes and stock-based compensation expense.\nOur financial position, results of operations and cash flows are impacted by the accounting policies we have adopted. In order to get a full understanding of our financial statements, one must have a clear understanding of the accounting policies employed. A summary of our critical accounting policies is presented within the footnotes in the financial statements presented within this Annual Report.\nRevenue Recognition\nPursuant to ASC 606, Revenue from Contracts with Customers, revenue represents the amount received or receivable for goods and services supplied by the Company to its customers. The Company recognizes revenue and the related cost of products sold when the performance obligations are satisfied. The performance obligations are typically satisfied upon shipment of physical goods. In addition to the satisfaction of the performance obligations, the following conditions are required for revenue recognition: an arrangement exists, there is a fixed price, and collectability is reasonably assured.\nThe Company does not offer any discounts, credits or other sales incentives. Historically, the Company believes that it has no collection issues with its customer base. The Companys policy with respect to customer returns and allowances as well as product warranty is as follows:\nThe Company may accept a return of defective product within one year from shipment for repair or replacement at the Companys option. If the product is repairable, the Company at its own cost, will repair and return it to the customer. If unrepairable, the Company will replace the defective product with a new item. The cost of defective products is immaterial at this time. Billing terms vary by customer and product but generally do not exceed 30 days.\nThe Company provides engineering services as part of the relationship with its customers in developing the custom product. The Company is not obligated to provide such engineering service to its customers. The Company does not invoice its customers separately for these services.\nThe Company records a liability when receiving cash in advance of delivering goods or services to the customer. This liability is offset against the receivable recognized when those goods or services are delivered. Deposits from customers were $20,639 and $97,885, as of March 31, 2023 and 2022, respectively.\nValuation of Inventories\nRaw materials are stated at the average cost on a first-in first-out basis which does not exceed net realizable value. Finished goods and work in process are valued at the lower of actual cost, determined on a specific identification basis, or the net realizable value of each product. The Company estimates which materials may be obsolete and which products in work in process or finished goods may be sold at less than cost, and adjusts their inventory value accordingly.\nAccounting for Income Taxes\nThe Companys current provision for income taxes is based upon its estimated taxable income in each of the jurisdictions in which it operates, after considering the impact on taxable income of temporary and permanent differences resulting from different treatment of items for tax and financial reporting purposes. Deferred tax assets and liabilities are recognized for the future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases and any operating loss or tax credit carryforwards. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the year in which those temporary differences are expected to be recovered or settled. The ultimate realization of deferred tax assets is dependent upon the generation of future taxable income in those periods in which temporary differences become deductible. Should management determine that it is more likely than not that some portion of the deferred tax assets will not be realized, a valuation allowance against the deferred tax assets would be established in the period such determination was made.\nStock-Based Compensation Expense\nStock-based compensation expense recognized in the statement of operations is based on options ultimately expected to vest. We chose the straight-line method of allocating compensation cost over the requisite service period of the related award in accordance with the authoritative guidance. The expected term of options granted to employees is calculated using the simplified method, which represents the average of the contractual term of the option and the weighted-average vesting period of the option, which, for options granted in fiscal 2023 and 2022, resulted in an expected term of approximately five years. We used our historical volatility to estimate expected volatility in fiscal 2023 and 2022. The risk-free interest rate is based on the U.S. Treasury yields in effect at the time of grant for periods corresponding to the expected life of the options. The dividend yield is 0% based on the fact that we have no present intention to pay dividends. Determining some of these assumptions requires significant judgment and changes to these assumptions could result in a significant change to the calculation of stock-based compensation in future periods.\nResults of Operations:\nAnnual Results of Operations\nComparison of the Years Ended March 31, 2023 and March 31, 2022:\nThe following table summarizes our results of operations for the fiscal years ended March 31, 2023 and March 31, 2022:\nFor the Fiscal Years Ended\nMarch 31, Period-to-Period\nChange\nRevenue $ 19,136,890 $ 24,265,589 $ (5,128,699 )\nOperating expenses:\nCost of products sold 18,395,865 19,328,249 (932,384 )\nSelling, general and administrative 5,519,278 5,039,072 480,206\nDepreciation and amortization 1,034,559 837,201 197,358\nTotal operating expenses 24,949,702 25,204,522 (254,820 )\nOperating loss (5,812,812 ) (938,933 ) (4,873,879 )\nOther income (expense):\nOther income (a) 85,231 2,214,030 (2,128,799 )\nInterest income (expense), net 31,037 30,646\nTotal other income (expense), net 116,268 2,214,421 (2,098,153 )\n(Loss) income before (provision for) benefit from income taxes (5,696,544 ) 1,275,488 (6,972,032 )\n(Provision for) benefit from income taxes (806,380 ) 162,646 (969,026 )\nNet (loss) income $ (6,502,924 ) $ 1,438,134 $ (7,941,058 )\n(a) For the fiscal year ended March 31, 2022, other income consists of $2,103,885 of debt forgiveness income from the forgiveness of the PPP Loan (See Note 5 - PPP Loan).\nRevenue for the fiscal year ended March 31, 2023 was $19,136,890, reflecting a decrease of $5,128,699, or 21.1%, as compared to $24,265,589 for the fiscal year ended March 31, 2022. The decrease in revenues for fiscal year 2023 compared to fiscal year 2022 was primarily due to a softness in orders from our defense and space customers. Our revenues continue to be negatively impacted by reduced government spending in these sectors for programs in which we participate. The decline in defense and space customer revenue was offset somewhat by increases in commercial aerospace revenues. We are seeing increases in commercial aerospace, generally, as consumer aviation traffic has been returning to pre COVID-19 levels, and from the Boeing 737-Max program, in particular, as Boeing has resumed its production after having earlier grounded the production of this aerospace program.\nCost of products sold for the fiscal year ended March 31, 2023 was $18,395,865 reflecting a decrease of $932,384, or 4.8%, as compared to $19,328,249 for the fiscal year ended March 31, 2022. The decrease was principally attributable to the 21.1% decrease in revenue, offset by the increase in our cost of products sold, especially in light of declining revenues, which reflects the additional costs we have incurred in staffing the Pennsylvania location, the costs of maintaining our highly trained labor force through periods of reduced production and the impacts of inflation.\nSelling, general and administrative expenses for the fiscal year ended March 31, 2023 was $5,519,278, reflecting an increase of $480,206, or 9.5%, as compared to $5,039,072 for the fiscal year ended March 31, 2022. The increase was primarily attributable to an increase in legal and accounting fees of $701,917 partially offset by a decrease in stock-based compensation expense of $383,083.\nDepreciation and amortization for the fiscal year ended March 31, 2023 was $1,034,559, reflecting an increase of $197,358, or 23.6%, as compared to $837,201 for the fiscal year ended March 31, 2022. The increase was principally attributable to an increase in capitalized leasehold improvements related to our new Pennsylvania facility, as well as increases in capitalized molds and dies for new products.\nTotal other income (expense) for the fiscal year ended March 31, 2023 was income of $116,268, reflecting a decrease of $2,098,153, as compared to income of $2,214,421 for the fiscal year ended March 31, 2022. The decrease was primarily attributable to the debt forgiveness income recognized from the forgiveness of the PPP loan of $2,103,885 in the fiscal year ended March 31, 2022.\n(Provision for) benefit from income taxes for the fiscal year ended March 31, 2023 was a provision of $806,380, as compared to a benefit of $162,646 for the fiscal year ended March 31, 2022. The change was primarily attributable to fully impairing the deferred income tax assets, net. During the three months ended June 30, 2022, we determined to record a full valuation allowance on our deferred income tax assets, net. As such, during the three months ended June 30, 2022, we recorded a full valuation allowance for the opening period deferred income tax asset, net and then beginning on June 30, 2022, recorded an adjustment to fully impair any increase in the deferred income tax asset, net. As such, for the fiscal year ended March 31, 2023, the effect of recording a full valuation allowance resulted in an income tax provision of $806,380.\nLiquidity and Capital Resources:\nOur primary requirements for liquidity and capital are working capital, inventory, capital expenditures, public company costs and general corporate needs. We expect these needs to continue as we further develop and grow our business. For the year ended March 31, 2023, our primary sources of liquidity came from existing cash. Based on our current plans and business conditions, we believe that existing cash, together with cash generated from operations will be sufficient to satisfy our anticipated cash requirements, and we are not aware of any trends or demands, commitments, events or uncertainties that are reasonably likely to result in a decrease in liquidity of our assets. We may require additional capital to respond to technological advancements, competitive dynamics or technologies, business opportunities, challenges, acquisitions or unforeseen circumstances and in either the short-term or long-term may determine to engage in equity or debt financings or enter into credit facilities for other reasons. If we are unable to obtain adequate financing or financing on terms satisfactory to us, when we require it, our ability to continue to grow or support our business and to respond to business challenges could be significantly limited. In particular, inflationary pressures and interest rates, the 2023 banking crisis and the conflict between Russia and Ukraine have resulted in, and may continue to result in, significant disruption and volatility in the global financial markets, reducing our ability to access capital. If we are unable to raise additional funds when or on the terms desired, our business, financial condition and results of operations could be adversely affected.\nAs of March 31, 2023, our cash balance was $8,344,706. For the fiscal year ended March 31, 2023, we recorded a net loss of $6,502,924. As of March 31, 2023, we had working capital of $20,303,090.\nOur principal source of liquidity is cash flows generated by operating activities and cash reserves.\nCash Flow Activities for the Years Ended March 31, 2023 Compared to the Year Ended March 31, 2022\nThe following table summarizes our cash flow activities for the fiscal years ended March 31, 2023 and March 31, 2022:\nFor the Fiscal Years Ended March 31, Period-to-Period\nChange\nCash flow (used in) provided by\nOperating activities $ (3,785,051 ) $ 1,414,493 $ (5,199,544 )\nInvesting activities (545,514 ) (2,646,764 ) 2,101,250\nDecrease in cash and cash equivalents $ (4,330,565 ) $ (1,232,271 ) $ (3,098,294 )\nNet cash (used in) provided by operating activities was ($3,785,051) for the fiscal year ended March 31, 2023, a decrease of $5,199,544, as compared to $1,414,493 for the fiscal year ended March 31, 2022. The period over period decrease in cash from operating activities of $5,199,544 was primarily due to the decrease in net (loss) income of $7,941,058 (as adjusted for the fiscal year ended March 31, 2022 non-cash gain of $2,103,885 on forgiveness of debt, a decrease in net income (loss) of $5,837,173), offset principally by the non-cash charge to fully impair the deferred income tax asset, net.\nNet cash used in investing activities was $545,514 for the fiscal year ended March 31, 2023, a decrease of $2,101,250, as compared to a use of $2,646,764 for the fiscal year ended March 31, 2022. The decrease in cash used in investing activities during the fiscal year ended March 31, 2023 was due to a reduction in purchases of leasehold improvement related to our new Pennsylvania facility.\nThere were no financing activities during either fiscal year ended March 31, 2023 or 2022.\nPPP Loan and Note\nOn April 13, 2020, the Company entered into an unsecured note (the PPP Note) evidencing an unsecured loan (PPP Loan) in the principal amount of $2,103,885 pursuant to the Payment Protection Program (PPP) under the Coronavirus Aid Relief and Economic Security Act (CARES Act).\nOn April 21, 2021, the Company received notice that the PPP Loan was forgiven. The Company recorded the forgiveness of the principal balance of $2,103,885 as debt forgiveness income in the quarter ended June 30, 2021.\nBacklog of Orders\nOur customers typically enter into supply arrangements for the purchase of our products which we will produce and deliver over time. On an as-needed basis, our customers place specific production orders, and these orders are generally filled and shipped within twelve weeks. Our backlog consists of supply arrangements where the anticipated unfulfilled shipping dates are within approximately twelve months. Because of the possibility of customer changes in delivery schedules or the cancellation of orders, our backlog as of any particular date may not be indicative of revenue in any future period. The backlog amounted to approximately $13,724,000 at March 31, 2023 as compared to $7,909,000 at March 31, 2022. The increase in total backlog as of March 31, 2023 compared with the previous years is primarily due to increases in aerospace and defense customer demand, driven in large part by the recovery of commercial aviation after the earlier grounding of the Boeing 737 Max jet and the impact of COVID-19, as well as increases in orders from our defense customers.\nA portion of these backlog orders are subject to cancellation or postponement of delivery dates and, therefore, no assurance can be given that actual sales will result from these orders. The Company does not foresee any problems which would prevent it from fulfilling these orders.\nInflation\nIn the opinion of management, inflation has begun to impact the costs of our operations and depending upon the current duration and degree of higher inflation levels, is expected to have an impact upon our operations in the future. Management will continue to monitor inflation and evaluate the possible future effects of inflation on our business and operations. Item 7A. Quantitative and Qualitative Disclosures About Market Risk\nNot required. Item 8. Financial Statements and Supplementary Data\nSee our audited Financial Statements for the fiscal years ended March 31, 2023 and 2022 which follows Item 16 of this Annual Report on Form 10-K. Item 9. Changes In and Disagreements With Accountants on Accounting and Financial Disclosure\nNone. Item 9A. Controls and Procedures\n(a) Evaluation of Disclosure Controls and Procedures\nWe maintain disclosure controls and procedures (as defined in paragraph (e) of Rules 13a-15 and 15d-15 under the Exchange Act) designed to ensure that the information we are required to disclose in reports that we file or submit under the Exchange Act is recorded, processed, summarized and reported within the time periods specified under the rules and forms of the SEC. Disclosure controls and procedures include, without limitation, controls and procedures designed to ensure that such information is accumulated and communicated to our management, including our Chief Executive Officer and our Chief Financial Officer, as appropriate to allow timely decisions regarding required disclosures. As required by paragraph (b) of Rules 13a-15 and 15d-15 under the Exchange Act, our Chief Executive Officer (our principal executive officer) and our Chief Financial Officer (our principal financial officer) carried out an evaluation of the effectiveness of the design and operation of our disclosure controls and procedures as of March 31, 2023.\nManagement has used the framework set forth in the report entitled Internal Control-Integrated Framework published by the Committee of Sponsoring Organizations of the Treadway Commission (2013 framework), known as COSO, to evaluate the effectiveness of our internal control over financial reporting. The following material weaknesses have been identified:\n● Certain of the Companys controls associated with reconciliations of inventory and cost of products sold were not operating effectively. These deficiencies, combined with inadequate compensating review controls represent a material weakness in the Companys internal control over financial reporting.\n● The Company has not established an effective control environment due to the ineffective design and implementation of Information Technology General Controls (ITGC). The Companys ITGC deficiencies included improperly designed controls pertaining to user access rights over systems that are critical to the Companys system of financial reporting. The ITGC deficiencies, combined with a lack of properly designed management review controls to compensate for these deficiencies, represent a material weakness in the Companys internal control over financial reporting.\nAs of March 31, 2023, our Chief Executive Officer and our Chief Financial Officer concluded that our internal over financial reporting and disclosure controls and procedures were not effective based upon the identified material weaknesses noted above.\nManagement is actively engaged in the planning for and implementation of remediation efforts to address the identified material weaknesses. The remediation plan includes (i) the engaging of additional experienced financial resources, (ii) the development and implementation of enhanced controls designed to evaluate the appropriateness of policies and procedures, (iii) the implementation of review and monitoring of transactions to ensure compliance with the new policies and procedures, (iv) improvements in the design and implementation of enhanced monitoring of ITGC controls, and (v) the enhanced training of personnel.\n(b) Managements Report on Internal Controls over Financial Reporting\nOur management is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Exchange Act Rules 13a-15(f) and 15d-15(f). Internal control over financial reporting refers to the process designed by, or under the supervision of, our principal executive officer and principal financial officer, and effected by our Board of Directors, management and other personnel, to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles.\nInternal control over financial reporting cannot provide absolute assurance of achieving their objectives. Internal control over financial reporting is a process that involves human diligence and compliance and is subject to lapses in judgement and breakdowns resulting from human failures. Due to their inherent limitations, there is a risk that material misstatements may not be prevented or detected on a timely basis by internal control over financial reporting. It is possible to design safeguards to reduce, but not eliminate, this risk. Management is responsible for establishing and maintaining adequate internal control over financial reporting for our company.\nMitigation Steps\nIn order to address the material weaknesses stated above, Management undertook the following mitigation steps:\n● hiring and/or engagement of additional qualified resources;\n● the implementation of new controls designed to enhance the monthly and quarterly financial close process;\n● the implementation of additional review and monitoring of transactions to ensure compliance with the new policies and procedures;\n● the implementation of improvements in the design and implementation of enhanced monitoring of ITGC controls;\n● the training of personnel responsible for preparation and review of financial information.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect all misstatements or fraud. Any control system, no matter how well designed and operated, is based upon certain assumptions and can provide only reasonable, not absolute, assurance that its objectives will be met.\nThis Annual Report does not include an attestation report of our registered public accounting firm regarding internal control over financial reporting. Managements report was not subject to attestation by our registered public accounting firm pursuant to SEC rules, which permit us to provide only managements report in this Annual Report.\nOur management, including our Chief Executive Officer and Chief Financial Officer does not expect that our disclosure controls and procedures or internal controls over financial reporting will prevent all errors or all instances of fraud. A control system, no matter how well designed and operated, can provide only reasonable, not absolute, assurance that the control systems objectives will be met. Further, the design of a control system must reflect the fact that there are resource constraints, and the benefits of controls must be considered relative to their costs. Because of its inherent limitations, internal controls over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n(c) Changes in Internal Controls Over Financial Reporting\nExcept as described above, there were no changes in our internal controls over financial reporting (as defined in Rule 13a-15(f) and 15d-15(f) under the Exchange Act) identified in connection with the evaluation of our internal controls that occurred during the fiscal quarter ended March 31, 2023 that materially affected, or are reasonably likely to materially affect our internal controls over financial reporting. Item 9B. Other Information\nNone.\nItem 9C. Disclosure Regarding Foreign Jurisdictions that Prevent Inspections\nNot Applicable.\nIEH CORPORATION\nPART III Item 10. Directors, Executive Officers and Corporate Governance\nExecutive Officers and Directors\nAs of March 31, 2023, the executive officers and directors of the Company are as follows:\nName\nAge\nOffice\nClass\nDavid Offerman\nChairman of the Board of Directors, President and Chief Executive Officer\nII\nWilliam H. Craig\nChief Financial Officer and Treasurer (Mr. Craig resigned effective May 17, 2023) (1)\nAllen Gottlieb\nDirector\nII\nGerald E. Chafetz\nDirector\nII\nEric C. Hugel\nDirector\nI\nSonia Marciano\nDirector (Ms. Marciano resigned effective July 31, 2023) (2)\nI\nMichael E. Rosenfeld\nDirector\nI\n(1) Effective May 19, 2023, Subrata Purkayastha was appointed to the positions of Interim Chief Financial Officer and Treasurer.\n(2) Effective August 1, 2023, John P. Spiezio was elected to fill the vacancy created by the resignation of Dr. Sonia Marciano.\nIEHs Certificate of Incorporation provides that the directors of the Company are to be elected in two (2) classes; each class to be elected to a staggered two (2) year term and until their successors are duly elected and qualified. As of March 31, 2023, the Board of Directors consisted of six (6) members divided into two classes with three Class I Members (Mr. Hugel, Ms. Marciano and Mr. Rosenfeld) and three Class II Members (Mr. David Offerman, Mr. Gottlieb and Mr. Chafetz). Effective August 1, 2023, John P. Spiezio was elected to fill the vacancy created by the resignation of Dr. Sonia Marciano. All officers are elected by and serve at the discretion of the Board of Directors.\nDavid Offerman. On March 26, 2017, Mr. Offerman was elected to the positions of Chairman of the Board, President and Chief Executive Officer. David succeeded his late father, Michael Offerman, who passed away on March 24, 2017. David Offerman has been a member of IEHs Board of Directors since July 15, 2016. Prior to March 24, 2017, he was the Vice President - Sales and Marketing of the Company. He joined the Company in September 2004 as the National Sales Manager and was appointed to Vice President - Sales and Marketing in April 2011. Prior to joining IEH, Mr. Offerman worked as an account executive and sales manager in the telecommunication industry.\nMr. Offerman graduated from the University of Michigan in 1997 with a Bachelor of Arts in film and communications. In 2016, he received an MBA from the NYU Stern School of Business with a concentration in leadership and management. We believe Mr. Offermans expertise in manufacturing, sales and strategy along with his extensive experience, qualifications, attributes and skills make him well qualified to serve as a director of our Company.\nWilliam H. Craig. On August 27, 2020, the Company appointed William H. Craig as its Chief Financial Officer and Treasurer. His appointment became effective on the next business day following the Company filing its Annual Report on Form 10-K for the fiscal year ended March 31, 2020 with the U.S. Securities and Exchange Commission and upon the official retirement date of the then current Chief Financial Officer and Treasurer, Robert Knoth. From March 2012 to March 2020, Mr. Craig served as Chief Executive Officer and Chief Financial Officer of Tarantin Industries, Inc., a family owned industrial distributor based in Freehold, NJ with operations in the eastern third of the U.S. From October 2007 to September 2011, Mr. Craig served as Chief Financial Officer of Fifth Street Capital, Inc., an externally managed closed end non-diversified Regulated Investment Company operating as a Business Development Company and based in White Plains, NY. From March 2005 to September 2007, he was the executive Vice President and Chief Financial Officer of Vital Signs, Inc., a medical device manufacturer based in the United States with global operations. Vital Signs, headquartered in Totowa, NJ, is a NASDAQ listed company (VITL). From 1999 to 2004, Mr. Craig served as the Executive Vice President of Finance and Administration and Chief Financial Officer of Matheson Tri- Gas, Inc., an industrial specialty gas company with global operations including 20 significant plants in the U.S., nearly 100 retail outlets and production/marketing joint ventures in Europe and Asia. From 1997 to 1999, he served as Executive Vice President and Chief Financial Officer of Empire of Carolina, an AMEX-listed consumer products company.\nOn September 21, 2022, the Company entered into a new employment agreement with Mr. Craig effective as of July 1, 2022 and such agreement would have expired on June 30, 2027. Mr. Craig resigned his employment with the Company, effective May 17, 2023.\nSubrata Purkayastha. On May 19, 2023, the Company appointed Subrata Purkayastha as its Interim Chief Financial Officer and Treasurer. Ms. Purkayasthas appointment became effective on May 19, 2023. Ms. Purkayastha has served as Controller of the Company since November 2021. Prior to joining the Company, from January 2019 to May 2021, Ms. Purkayastha served as Controller of Sprouts Foods, Inc., a producer and distributor of premium organic foods intended for babies and toddlers. From July 2017 to January 2019, Ms. Purkayastha served as Accounting Manager at Sprouts Foods, Inc. where she provided timely and accurate financial reporting to the Chief Executive Officer and Chief Financial Officer and private equity partners. Prior to Sprout Foods Inc., from July 2015 to June 2017, Ms. Purkayastha served as Accounting Manager of Champions Oncology, Inc., a publicly-traded company engaged in the development of advanced technology solutions and services to personalize the development of oncology drug development. Ms. Purkayastha holds a Bachelor of Science in Accounting from Carson-Newman University in Jefferson City, Tennessee and also received a Masters in Arts degree with a focus in International Banking and Finance from Fordham University. Ms. Purkayastha is also a Certified Public Accountant.\nEffective on June 1, 2023, the Company entered into a new employment agreement with Ms. Purkayastha and such agreement expires on November 30, 2023.\nAllen Gottlieb. Mr. Gottlieb has been a board member since 1992. He has a BS from NYU in Accounting and Finance, and an LL.B. and JD from Brooklyn Law School. He currently operates his own firm specializing in Labor Relations and Human Resources consulting. He also has extensive entrepreneurial experience in manufacturing, distribution, logistics, and hospitality, in both domestic and international markets. The company believes that his broad experience as well as his knowledge of IEH qualifies him to serve as a director of our Company.\nGerald Chafetz. Mr. Chafetz has been a member of the Companys Board of Directors since 2009. He is President of GEC Enterprises, LLC since 2011. GEC Enterprises, LLC is a property management company headquartered in Rockville Centre, New York. He was previously President of Capitol City Companies. Prior to founding Capitol City Companies, he had an extended 22-year executive career in the textile industry with several knitwear and high fashion manufacturers, including Arista Knitwear, Berwick Fashion Knitwear and Beged-or Knitwear. Mr. Chafetz graduated from the University of Hartford in 1965 with a Bachelor of Science degree in business. We believe Mr. Chafetzs expertise in executive management and manufacturing along with his extensive experience, qualifications, attributes and skills make him well qualified to serve as a director of our Company.\nEric C. Hugel, CPA, CFA. Eric C. Hugel has been a member of IEHs Board of Directors since July 15, 2016. Since May 2023, he has served as the Chief Financial Officer of Americraft Marine Group LLC, a company with the mission to support and strengthen the U.S. shipbuilding industry and infrastructure. From July 2014 to May 2023, Mr. Hugel served as the Co-Chief Executive Officer and Chief Financial Officer of Hugel Corporation, an online retailer. From March 2013 to February 2014, Mr. Hugel held the position of Senior Institutional Specialist in U.S. Fundamental Equity Research Analyst at McGraw Hill Financial - S&P Capital IQ providing investment advisory services. In particular he provided research and analysis in the U.S. aerospace and defense and industrial conglomerates sectors. From July 2002 through June 2012 he was a managing director at Stephens Inc. providing investment research and analytical services in the U.S. aerospace and defenses sectors. Mr. Hugel graduated from Lehigh University in 1993 with a Bachelor of Science in accounting. We believe Mr. Hugels expertise in manufacturing in the aerospace industry and finance along with his extensive experience, qualifications, attributes and skills make him well qualified to serve as a director of our Company.\nDr. Sonia Marciano. Dr. Sonia Marciano was a member of IEHs Board of Directors from July 15, 2016 until July 31, 2023. She is a clinical professor at the NYU Stern School of Business since July 2007 where she teaches courses and manages academic programs. She graduated from the University of Chicago in 1984 with a Bachelor of Arts degree. In 2000, Dr. Marciano received from the University of Chicago her MBA in Economics and Finance and her PhD in Business Economics. We believe Dr. Marcianos expertise in corporate strategy along with her extensive experience, qualifications, attributes and skills made her well qualified to serve as a director of our Company.\nDr. Marciano resigned from the Companys Board of Directors, effective July 31, 2023.\nMichael E. Rosenfeld has been a member of the Companys Board of Directors since 2018. He is a co-founder, Principal, and Chief Operating Officer of Olive Tree Holdings, a mission driven private investment company headquartered in New York City, Atlanta, and Houston specializing in the acquisition, management and transformation of multifamily communities across dynamically growing markets within the U.S. With vertically integrated asset management, property management, construction, technology, and marketing services, Olive Tree Holdings devises 360-degree business plans to dramatically increase the value of its invested assets while creating a higher standard of living for its residents. To date, the firm has a lifetime portfolio value of $2 billion, has acquired and transformed 16,000 units of workforce and affordable housing across 8 states. From 2013-2016 he was Vice President and Chief of Staff at Bert E. Brodsky & Associates, Inc., a private investment firm with a diverse portfolio of companies across several industries. Prior to that from 2006-2013, he served as Vice President of Business Development of Mobile Health Management Services, Inc., a subsidiary of Bert Brodsky & Associates, Inc. Mr. Rosenfeld received his Bachelor of Arts in Political Science from Emory University in 2006, and his Master of Business Administration (MBA) in Corporate Finance from the New York University Stern School of Business in 2016. We believe Mr. Rosenfelds expertise in finance and accounting along with his extensive experience, qualifications, attributes and skills make him well qualified to serve as a director of our Company.\nJohn P. Spiezio, appointed on August 1, 2023, has extensive experience in the aerospace and defense industries. After studying Economics, Computer Science, and Mathematics at Marquette University, he returned to New York and began his 33-year career as the third-generation leader at Hicksville Machine Works, Inc. (HMW), a supplier to prime aerospace & defense contractors throughout North America and Europe as well as the Department of Defense directly. Over that time he gained extensive experience in operations, business development, and governance of a business operating in this specialized industry. After HMW was sold in 2019, Mr. Spiezio worked, from March 2019 to April 2021, for a private equity firm engaged in building a vertically integrated company that could produce and supply entire integrated systems to the aerospace and defense industries. Mr. Spiezio serves on the corporate boards of MicroMetl Corporation and GRC Reality. Mr. Spiezio is also currently the Chairman of ADDAPT, an industry group focused on defense and aerospace suppliers based in New York State.\nCompliance with Section 16(a) of the Exchange Act\nSection 16(a) of the Exchange Act requires the Companys directors and officers and persons who own, directly or indirectly, more than 10% of a registered class of the Companys common stock, to file with the SEC initial reports of ownership and reports of changes in ownership of our common stock.\nOfficers, directors and greater than 10% shareholders are required to furnish the Company with copies of all Section 16(a) reports that they file. Based solely on review of the copies of such reports received by the Company, the Company believes that filing requirements applicable to officers, directors and 10% shareholders were complied with during the fiscal year ended March 31, 2023.\nDirector Independence; Meetings of Directors; Corporate Governance; Committees of the Board\nOur Board of Directors currently consists of six individuals. Five of our directors are independent as defined in the Marketplace Rules of The NASDAQ Stock Market. During the fiscal year ended March 31, 2023, our Board of Directors held six meetings, the Audit Committee met on one occasion to discuss the Companys progress in preparing its updated Form 10-K and 10-Qs, and the Compensation Committee met on one occasion.\nDuring the fiscal year ended March 29, 2019, our Board of Directors approved the formation of an audit committee and a compensation committee, and each committee would initially have three (3) members consisting of independent directors. The Board nominated the following directors to each such committee: (i) Audit Committee - Eric Hugel (Chair), Allen Gottlieb and Michael E. Rosenfeld; and (ii) Compensation Committee - Gerald Chafetz (Chair), Michael E. Rosenfeld and Dr. Sonia Marciano. Each of these Board committees has a written charter approved by the Board of Directors. Each of the charters of these Board committees is available on the Companys website, www.iehcorp.com (click on Investors, then on Corporate Governance.\nFor the fiscal year ended March 31, 2023, a general description of the duties of the committees were as follows:\nAudit Committee. Our Audit Committee acts to: (i) review with management the finances, financial condition and interim financial statements of the Company; (ii) review with our independent registered public accounting firm the quarterly and year-end financial statements; (iii) review implementation with the independent registered public accounting firm and management any action recommended by the independent registered public accounting firm; and (iv) engage, retain and terminate our independent registered public accounting firm. Mr. Hugel, the Chair of the Audit Committee was also designated as our Audit Committee Financial Expert. On August 1, 2023, the board appointed Mr. John P. Speizio to its Audit Committee.\nDuring the fiscal year ended March 31, 2023, all of the members of our Audit Committee were independent within the definition of that term as provided by NASDAQ rules.\nCompensation Committee. The Compensation Committee acts to: (i) review, approve and administer compensation arrangements for our executive officers; (ii) administer our equity-based compensation plans, (iii) establish and review general policies relating to the compensation and benefits of our executive officers and other personnel, (iv) evaluate the relationship between executive officer compensation policies and practices and corporate risk management to confirm those policies and practices do not incentivize excessive risk-taking, and (iv) evaluate and make recommendations to our Board of Directors regarding the compensation of our non-employee directors.\nSecurity holder recommendations of director nominees. The Board did not adopt any modifications to the procedures by which security holders may recommend nominees to its Board of Directors.\nCode of Ethics. The Company has adopted a Code of Ethics, which has been made available on its website https://www.iehcorp.com/ethics-code Item 11. Executive Compensation\nThe following table sets forth below the summary compensation paid or accrued by the Company during the fiscal years ended March 31, 2023 and March 31, 2022, respectively, for the Companys Chief Executive Officer and Chief Financial Officer:\nName and Principal Position\nYear\nSalary ($) (1)\nBonus ($) (2)\nOption\nAwards ($)\nAll Other\nCompensation\n($) (3)\nTotal ($)\nDavid Offerman\n474,000\n75,000\n-\n-\n549,000\nChief Executive Officer, President\n459,868\n-\n-\n1,731\n461,599\nWilliam H. Craig(4)\n245,000\n-\n-\n-\n245,000\nChief Financial Officer\n237,002\n-\n-\n237,867\n(1) Amounts reported in this column reflect the base salaries earned during the applicable year.\n(2) Amounts reported in this column are related to the Cash Bonus Plan that was adopted in 1987.\n(3) Amounts reported in this column are related to COVID-19 benefit payments.\n(4) Mr. Craig resigned his employment with the Company, effective May 17, 2023.\nDavid Offerman - Employment Agreement\nOn July 29, 2019, IEH entered into an employment agreement with David Offerman, its Chief Executive Officer and President. The employment agreement with Mr. Offerman is effective as of July 29, 2019 and will expire on December 31, 2024. Under the employment agreement, Mr. Offerman receives a base salary of $395,000 per annum and is eligible to receive an annual bonus of up to 100% of base salary for each fiscal year of employment based on performance targets and other key objectives established by the Compensation Committee of the Board of Directors.\nDuring the term of the employment agreement, he is also eligible to receive equity or performance awards pursuant to any long-term incentive compensation plan adopted by the Compensation Committee.\nIn the event of the termination of Mr. Offermans employment by us without cause or by him for good reason, as such terms are defined in the employment agreement, he would be entitled to: (a) a severance payment of 36 months of base salary; (b) continued participation in our health and welfare plans for up to 24 months; and (c) all accrued but unpaid compensation. Further, under the employment agreement, if within the three (3) year period of a change in control (as defined in the employment agreement) either Mr. Offermans employment is terminated, or his title, position or responsibilities are materially reduced and he terminates his employment, the Company shall pay and/or provide to him substantially the same compensation and benefits as if his termination was without cause or for good reason, subject to limitation to avoid the imposition of the excise tax imposed by Section 4999 of the Internal Revenue Code of 1986, as amended (the Code) if such payments would constitute an excess parachute payment as defined in Section 280G of the Code. Pursuant to the employment agreement, Mr. Offerman is subject to customary confidentiality, non-solicitation of employees and non-competition obligations that survive the termination of such agreement.\nWilliam H. Craig - Employment Agreement\nOn August 27, 2020, the Company entered into an employment agreement with Mr. Craig. Pursuant to the agreement, Mr. Craigs appointment as its Chief Financial Officer and Treasurer became effective on the next business day following the Company filing its Annual Report on Form 10-K for the fiscal year ended March 31, 2020 with the U.S. Securities and Exchange Commission and upon the official retirement date of the then current Chief Financial Officer and Treasurer, Robert Knoth (Effective Date). From June 24, 2020 and up to the Effective Date, Mr. Craig served as a consultant to the Company. Under the initial agreement, Mr. Craig received a base salary of $225,000 per annum.\nOn September 21, 2022, the Company entered into a new employment agreement with Mr. Craig. The new employment agreement with Mr. Craig was effective as of July 1, 2022 and would have expired on June 30, 2027. Under the new employment agreement, Mr. Craig was to continue to serve as the Chief Financial Officer and Treasurer of IEH and receive a base salary of $247,200 per annum and be eligible to receive an annual bonus for each fiscal year of employment based on performance targets and other key objectives established by the Compensation Committee of the Board of Directors of the Company. During the term of the agreement, Mr. Craig was also eligible to receive equity or performance awards pursuant to any long-term incentive compensation plan adopted by the Committee or the Board of Directors. Mr. Craig was also able to receive cash bonuses in the sole discretion of the Compensation Committee of the Board of Directors for each fiscal year of employment and based on performance targets and other key objectives established by the Compensation Committee. The new agreement further provided for the payment of severance pay and continued participation in health and welfare plans for up to 24 months in the case of termination without cause or a change of control of the company. Mr. Craig is subject to customary confidentiality and non-compete obligations that survive the termination of the agreement. Mr. Craig resigned his employment with the Company, effective May 17, 2023.\nSubrata Purkayastha - Employment Agreement\nOn June 1, 2023, the Company entered into an employment agreement with Ms. Purkayastha to serve as the Companys Interim Chief Financial Officer and Treasurer.\nThe employment agreement with Ms. Purkayastha was effective as of June 1, 2023 and will expire on November 30, 2023. Under the employment agreement, Ms. Purkayastha will receive a base salary of $200,000 per annum and be eligible to receive a bonus based on performance targets and other key objectives established by the Compensation Committee of the Board of Directors of the Company. The agreement further provides for the payment of severance pay and continued participation in health and welfare plans for up to 6 months in the case of termination without cause. Ms. Purkayastha is subject to customary confidentiality and non-compete obligations that survive the termination of the agreement.\nCash Bonus Plan\nIn 1987, the Company adopted a cash bonus plan (the Cash Bonus Plan) for non-union, management and administration staff. Unless otherwise approved by the Companys Board of Directors, contributions to the Cash Bonus Plan are made by the Company only when the Company is profitable for the fiscal year. As of March 31, 2023 and 2022, the Companys accrued bonus was $354,250 and $408,000, respectively. Bonus expense recorded for each of the years ended March 31, 2023 and 2022 was $82,901 and $402,000, respectively. The Company paid the bonus earned during the fiscal year ended March 31, 2023 of $354,250 in June 2023 and the bonus earned during the fiscal year ended March 31, 2022 of $137,750, in June 2022, respectively. During the fiscal year ended March 31, 2023, the Company determined that bonuses accrued for the senior leadership team for the fiscal year ended March 31, 2022 in the amount of $270,250 were reversed and not paid.\nStock Option Plans\nOn November 18, 2020, the Board of Directors approved the Companys 2020 Equity Incentive Plan (the 2020 Plan) for submission to shareholders at the next Annual Meeting. On December 16, 2020, the Companys stockholders approved the adoption of the 2020 Plan, which provides for options and restricted stock awards to purchase up to 750,000 shares of Common Stock to award in the future as employee incentive compensation to employees, management and directors of the Company.\nOptions granted to employees under the 2020 Plan may be designated as options which qualify for incentive stock option treatment under Section 422A of the Internal Revenue Code, or options which do not qualify (non-qualified stock options).\nUnder the 2020 Plan, the exercise price of an option designated as an incentive stock option shall not be less than the fair market value of the Companys common stock on the day the option is granted. In the event an option designated as an incentive stock option is granted to a ten percent (10%) shareholder, such exercise price shall be at least 110 percent (110%) of the fair market value or the Companys common stock and the option must not be exercisable after the expiration of ten years from the day of the grant. The 2020 Plan also provides that holders of options that wish to pay for the exercise price of their options with shares of the Companys common stock must have beneficially owned such stock for at least nine months prior to the exercise date.\nExercise prices of non-incentive stock options not may be less than the fair market value of the Companys common stock. The aggregate fair market value of shares subject to options granted to a participants(s), which are designated as incentive stock options, and which become exercisable in any calendar year, shall not exceed $100,000.\nOutstanding Equity Awards as of March 31, 2023\nThe following table sets forth certain information regarding outstanding equity awards granted to our named executive officers that remain outstanding as of March 31, 2023.\nOption Awards\nName\nNumber of\nSecurities\nUnderlying\nUnexercised\nOptions\nExercisable\nNumber of\nSecurities\nUnderlying\nUnexercised\nOptions\nUn-exercisable\nOption\nExercise\nPrice\nOption\nExpiration\nDate\nDavid Offerman 46,217 - $ 6.00 7/1/2025\n225,000 - $ 20.00 7/29/2029\nWilliam H. Craig(1) 50,000 - $ 15.10 10/9/2030\n(1) William Craig resigned effective May 17, 2023. These options were forfeited by William Craig on August 15, 2023.\nNon-Employee Director Equity Awards\nThe following table sets forth certain information regarding outstanding equity awards granted to our non-employee directors that remain outstanding as of March 31, 2023.\nOption Awards\nName\nNumber of\nSecurities\nUnderlying\nUnexercised\nOptions\nExercisable\nNumber of\nSecurities\nUnderlying\nUnexercised\nOptions\nUn-exercisable\nOption\nExercise\nPrice\nOption\nExpiration\nDate\nAllen Gottlieb - - N/A N/A\nGerald E. Chafetz 4,000 - $ 6.00 7/1/2025\nEric C. Hugel 5,000 - $ 5.30 8/15/2026\nSonia Marciano(1) 5,000 - $ 5.30 8/15/2026\nMichael E. Rosenfeld 5,000 - $ 12.75 10/27/2028\n(1) Sonia Marciano resigned effective July 31, 2023. These options will be forfeited by Sonia Marciano on October 31, 2023.\nNon-Employee Director Compensation\nThe following table sets forth the compensation (cash and equity) received by our non-employee directors during the fiscal year ended March 31, 2023.\nName Fees Earned or\nPaid in Cash Option\nAwards Total\nAllen Gottlieb. $ 10,000 $ - $ 10,000\nGerald E. Chafetz 12,500 - 12,500\nEric C. Hugel 12,500 - 12,500\nSonia Marciano. 10,000 - 10,000\nMichael E. Rosenfeld 15,000 - 15,000\nThrough March 31, 2023, non-executive directors were compensated through an annual director fee of $5,000, payable quarterly. Each director also received an annual fee of $5,000 for service on each committee, payable quarterly. The chairman of each committee received an additional annual fee of $2,500, payable quarterly.\nEffective after March 31, 2023, non-executive directors were compensated through an annual director fee of $10,000, payable quarterly. Each director shall also receive an annual fee of $5,000 for service on each committee, payable quarterly. The chairman of each committee shall receive an additional annual fee of $2,500, payable quarterly. Item 12. Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters\nThe following table sets forth certain information as of October 6, 2023 with respect to: (i) the persons (including any group as that term is used in Section 13(d)(3) of the Exchange Act), known by the Company to be the beneficial owner of more than five percent (5%) of any class of the Companys voting securities; (ii) each Named Executive Officer and Director who owns common stock in the Company; and (iii) all Executive Officers and Directors as a group. As of October 6, 2023, there were 2,370,251 shares of common stock issued and outstanding. The figures stated below are based upon Schedule 13Ds, Schedule 13D/As, Form 3s and Form 4s filed with the SEC by the named persons.\nThe following table sets forth certain information regarding the ownership of our common stock as of October 6, 2023 by:\n● each person or entity known by us to be beneficial owners of more than five percent of our common stock;\n● each of our directors;\n● each of our named executive officers; and\n● all of our executive officers and directors as a group.\nWe have determined beneficial ownership in accordance with the rules of the SEC. Under these rules, beneficial ownership includes any shares of common stock as to which the individual or entity has sole or shared voting power or investment power. In computing the number of shares beneficially owned by an individual or entity and the percentage ownership of that person, shares of common stock subject to options held by such person that are currently exercisable or will become exercisable within 60 days of October 6, 2023 are considered outstanding, although these shares are not considered outstanding for purposes of computing the percentage ownership of any other person.\nUnless otherwise indicated, the address of each beneficial owner listed in the table below is c/o IEH Corporation, 140 58th Street, Brooklyn, NY 11220.\nEach of the stockholders listed has sole voting and investment power with respect to the shares beneficially owned by the stockholder unless noted otherwise, subject to community property laws where applicable.\nBeneficial Ownership\nBeneficial Owner Number of\nShares Percent of\nTotal\nGreater than 5% Stockholders\nDavid Offerman(1) 676,665 25.6 %\nGail Offerman(2) 499,606 21.1 %\nZeff Capital LP(3) 232,862 9.8 %\nCove Street Capital, LLC (4) 136,349 5.8 %\nDirectors and Named Executive Officers\nDavid Offerman(1) 676,665 25.6 %\nSubrata Purkayastha(5) 10,000 *\nGerald E. Chafetz(6) 9,000 *\nAllen Gottlieb(7) 5,000 *\nMichael E. Rosenfeld(8) 10,000 *\nEric Hugel(9) 10,000 *\nJohn P. Spiezio (elected as a Director effective August 1, 2023)(10) 5,000 *\nAll executive officers and directors as a group (7 persons) 725,665 27.0 %\n* Denotes ownership percentage of less than 1%.\nAll shares set forth above are owned directly by the named individual unless otherwise stated.\n(1) Owns vested options to purchase 270,217 shares of common stock.\n(2) Based on a Form 4 dated September 21, 2021 filed by the reporting person. The address of the principal business office of each of the reporting persons is 27110 Grand Central Parkway, APT. 10-V, Floral Park, NY 11005.\n(3) Based on a Schedule 13G dated January 4, 2022 filed by the reporting person. The address of the principal business office of each of the reporting persons is 400 S. McCadden Pl., Los Angeles, CA 90020.\n(4) Based on a Schedule 13D dated May 16, 2023 filed by the reporting person. The address of the principal business office of each of the reporting persons is 525 South Douglas Street, Suite 225, El Segundo, California, 90245.\n(5) Owns vested options to purchase 10,000 shares of common stock.\n(6) Owns vested options to purchase 9,000 shares of common stock.\n(7) Owns vested options to purchase 5,000 shares of common stock.\n(8) Owns vested options to purchase 10,000 shares of common stock.\n(9) Owns vested options to purchase 10,000 shares of common stock.\n(10) Owns vested options to purchase 5,000 shares of common stock.\nEquity Compensation Plan Information\nThe following table provides information as of March 31, 2023, regarding shares of common stock that may be issued under the Companys equity compensation plans (the Equity Plan). Information is included for both equity compensation plans approved by the Companys stockholders and not approved by the Companys stockholders.\nPlan Category (a)\nNumber of\nsecurities\nto be issued upon\nexercise of\noutstanding\noptions,\nwarrants\nand rights (b)\nWeighted-\naverage\nexercise\nprice of\noutstanding\noptions,\nwarrants\nand rights (c)\nNumber of securities\nremaining available\nfor future issuance under equity\ncompensation plans\n(excluding securities\nreflected in\ncolumn (a))\nEquity compensation plans approved by security holders 467,217 $ 14.72 730,000\nEquity compensation plans not approved by security holders - - -\nTotal 467,217 $ 14.72 730,000 Item 13. Certain Relationships and Related Transactions, and Director Independence\nOther than the employment terms for its executive officers as described elsewhere in this Form 10-K, and as described below, there have been no related party transactions that are required to be disclosed pursuant to Item 404. Messrs. Gottlieb, Chafetz, Hugel, Rosenfeld, Spiezio, and Ms. Marciano are deemed independent directors of the Company pursuant to the SEC rules and regulations. Item 14. Principal Accountant Fees and Services\nOn June 29, 2023, the Board of Directors engaged Marcum LLP (Marcum LLP) (PCAOB ID: 688) as the independent auditor of IEH for the fiscal year ended March 31, 2023.\nAudit Fees. During the fiscal years ended March 31, 2023 and 2022, IEH audit fees were $386,000 and $142,500 to Marcum LLP for fees related to the audit of its financial statements, respectively.\nAudit Related Fees. During the fiscal years ended March 31, 2023 and 2022, respectively, $0 and $0 were paid.\nTax Fees. During the fiscal years ended March 31, 2023 and 2022, $10,558 and $8,250 were paid for tax related services, respectively.\nAll Other Fees. During the fiscal years ended March 31, 2023 and 2022, respectively, IEH did not pay any other fees for services to its independent auditor.\nThe Board of Directors has determined that the services provided by Marcum LLP and the fees paid to it for such services during the fiscal years ended March 31, 2023 and 2022, have not compromised the independence of Marcum LLP and has been approved by the Audit Committee.\nIEH CORPORATION\nPART IV Item 15. Exhibits and Financial Statement Schedules.\n(a) Documents filed as part of this report.\n1. The following financial statements of IEH Corporation and Report of Independent Registered Accounting Firm, are included in this report:\nPage\nNumber\nIndependent Auditors Report - Marcum LLP\nBalance Sheets\nStatements of Operations\nStatements of Stockholders Equity\nStatements of Cash Flows\nNotes to Financial Statements\n2. List of financial statement schedules:\nAll schedules have been omitted because they are not applicable or the required information is shown in the financial statements or notes thereto.\n3. List of Exhibits required by Item 601 of Regulation S-K. See part (b) below.\n(b) Exhibits\nThe exhibits filed as part of this annual Report on Form 10-K are set forth on the Exhibit Index, which Exhibit Index is incorporated herein by reference.\nEXHIBIT INDEX\nExhibit No.\nDescription\n3.1\nAmended and Restated Certificate of Incorporation of the Company (filed as Exhibit C-4 to Current Report on Form 8-K, dated February 27, 1991).\n3.2\nBy-Laws of the Company (filed as Exhibit 3.2 on Annual Report on Form 10-KSB for the fiscal year ended March 27, 1994).\n4.1\nForm of Common Stock Certificate of the Company (filed as Exhibit 4.1 on Annual Report on Form 10-KSB for the fiscal year ended March 27, 1994).\n4.2\nDescription of Securities (filed as Exhibit 4.2 on Annual Report on Form 10-K for the fiscal year ended March 31, 2022).\n10.1()\n2011 Equity Incentive Plan (filed as Exhibit A to definitive Proxy Statement dated August 31, 2011).\n10.2()\n2020 Equity Stock Based Compensation Plan (filed as Annex A to definitive Proxy Statement dated November 23, 2020).\n10.3()\nEmployment Agreement between the Company and David Offerman, dated as of July 31, 2019 (filed as Exhibit 10.1 to the Companys Current Report on Form 8-K filed on July 31, 2019).\n10.4()\nEmployment Agreement between the Company and William H. Craig dated as of September 21, 2022 and effective as of July 1, 2022 (filed as Exhibit 10.1 to the Companys Current Report on Form 8-K filed on September 21, 2022).\n21*\nSubsidiaries of the Company\n23.1*\nConsent of Marcum LLP\n31.1*\nCertification of Chief Executive Officer pursuant to Section 17 CFR 240.13a-14(a) or 17 CFR 240.15d-14(a) pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n31.2*\nCertification of Principal Financial Officer pursuant to Section 17 CFR 240.13a-14(a) or 17 CFR 240.15d-14(a) pursuant to Section 302 of the Sarbanes-Oxley Act of 2002\n32.1**\nCertifications by Chief Executive Officer and Principal Financial Officer, pursuant to 17 CFR 240.13a-14(b) or 17 CFR 240.15d-14(b) and Section 1350 of Chapter 63 of Title 18 of the United States Code adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002.\n101.1*\nThe following information from IEH Corporations Annual Report on Form 10-K for the fiscal year ended March 31, 2023, formatted in Inline XBRL (Extensible Business Reporting language) and filed electronically herewith: (i) the Balance Sheets; (ii) the Statements of Operations; (iii) the Statements of Stockholders Equity; (iv) the Statements of Cash Flow; and (v) the Notes to Financial Statements.\n101.INS*\nInteractive Data Files pursuant to Rule 405 of Regulation S-T formatted in Inline Extensible Business Reporting Language (Inline XBRL)\n101.SCH*\nInline XBRL Taxonomy Extension Schema Document\n101.CAL*\nInline XBRL Taxonomy Extension Calculation Linkbase Document\n101.DEF*\nInline XBRL Taxonomy Extension Definition Linkbase Document\n101.LAB*\nInline XBRL Taxonomy Extension Label Linkbase Document\n101.PRE*\nInline XBRL Taxonomy Extension Presentation Linkbase Document\nCover Page Interactive Data File (formatted in Inline XBRL and contained in Exhibit 101)\n* Exhibits filed herewith.\n** Exhibits furnished herewith.\nIndicates management contract or compensatory plan or arrangement.\nItem 16. Form 10-K Summary.\nNone.\nIEH CORPORATION\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, as amended, IEH Corporation has duly caused this Report to be signed on its behalf by the undersigned, thereunto duly authorized.\nIEH CORPORATION\nBy: /s/ David Offerman\nDavid Offerman\nChairman of the Board, President and\nChief Executive Officer\n(Principal Executive Officer)\nDated: October 6, 2023\nPursuant to the requirements of the Securities Exchange Act of 1934, this Report has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated.\n/s/ David Offerman\nOctober 6, 2023\nDavid Offerman,\nChairman of the Board, Chief Executive Officer\n(Principal Executive Officer) and President\n/s/ Subrata Purkayastha\nOctober 6, 2023\nSubrata Purkayastha,\nInterim Chief Financial Officer\n(Principal Financial Officer)\n/s/ Allen Gottlieb\nOctober 6, 2023\nAllen Gottlieb, Director\n/s/ Gerald E. Chafetz\nOctober 6, 2023\nGerald E. Chafetz, Director\n/s/ Eric C. Hugel\nOctober 6, 2023\nEric C. Hugel, Director\n/s/ Michael E. Rosenfeld\nOctober 6, 2023\nMichael E. Rosenfeld, Director\n/s/ John P. Spiezio\nOctober 6, 2023\nJohn P. Spiezio, Director\nIEH CORPORATION\nPage\nNumber\nIndependent Auditors Report - Marcum LLP\nBalance Sheets\nStatements of Operations\nStatements of Stockholders Equity\nStatements of Cash Flows\nNotes to Financial Statements\nReport of Independent Registered Public Accounting Firm\nTo the Shareholders and Board of Directors of\nIEH Corporation\nOpinion on the Financial Statements\nWe have audited the accompanying balance sheets of IEH Corporation (the Company) as of March 31, 2023 and 2022, the related statements of operations, changes in stockholders equity and cash flows for each of the two years in the period ended March 31, 2023, and the related notes (collectively referred to as the financial statements). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of March 31, 2023 and 2022, and the results of its operations and its cash flows for each of the two years in the period ended March 31, 2023, in conformity with accounting principles generally accepted in the United States of America.\nBasis for Opinion\nThese financial statements are the responsibility of the Companys management. Our responsibility is to express an opinion on the Companys financial statements based on our audits. We are a public accounting firm registered with the Public Company Accounting Oversight Board (United States) (PCAOB) and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audits to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. The Company is not required to have, nor were we engaged to perform, an audit of its internal control over financial reporting. As part of our audits we are required to obtain an understanding of internal control over financial reporting but not for the purpose of expressing an opinion on the effectiveness of the Companys internal control over financial reporting. Accordingly, we express no such opinion.\nOur audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provides a reasonable basis for our opinion.\nCritical Audit Matters\nThe critical audit matters communicated below are matters arising from the current period audit of the financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.\nValuation of Inventories\nWe identified inventory valuation as a critical audit matter. The principal consideration for our determination that the valuation of inventory is a critical audit matter is because of the significance of the balance sheet item, the significant assumptions management makes with regards to its valuation of inventory and the high degree of subjective auditor judgment associated with evaluating managements determination of the value of inventory.\nTo address the matter, it involved performing procedures and evaluating audit evidence in connection with forming our overall opinion on the consolidated financial statements. Our procedures related to the valuation of inventory included, among others:\n● We obtained an understanding and evaluated the design of the internal controls over managements valuation of inventory.\n● We evaluated the significant assumptions stated above and the completeness and accuracy of the underlying data used in managements costing and valuation.\n● We obtained from management the master schedule of inventory values with adjustments from raw materials, work in process, and finished goods; the schedule for calculation of manufacturing overhead; and the analysis of inventory reserve.\n- We assessed the qualifications and competence of management; and\n- We evaluated the methodologies used to determine the reasonableness and accuracy of adjustments, overhead rates, and allowance for obsolete inventory.\n● We tested the pricing used to determine the average costs of raw materials and supplies, the net realizable value of finished goods and work in process, and the estimates of which materials may be obsolete.\n● We assessed the reasonableness of the schedules of managements estimates by inquiring with management to understand the analysis of inventoried raw material parts as applied to quantities and costs for each of the periods presented.\n● We evaluated managements provision for slow-moving and obsolete inventory calculation, by reviewing inputs, including historical sales activity versus on-hand inventory levels, we reviewed current selling prices versus current cost.\n/s/ Marcum llp\nMarcum llp\nWe have served as the Companys auditor since 2019.\nNew York, NY\nOctober 6, 2023\nIEH CORPORATION\nBALANCE SHEETS\nAs of March 31,\nAssets\nCurrent assets:\nCash $ 8,344,706 $ 12,675,271\nAccounts receivable 2,985,936 3,039,468\nInventories 9,446,392 9,728,387\nCorporate income taxes receivable 1,723,473 2,096,480\nPrepaid expenses and other current assets 96,783 112,173\nTotal current assets 22,597,290 27,651,779\nNon-current assets:\nProperty, plant and equipment, net 3,865,066 4,354,111\nOperating lease right-of-use assets 2,661,779 2,980,820\nDeferred income tax assets, net -\n806,380\nSecurity deposit 75,756 75,756\nTotal assets $ 29,199,891 $ 35,868,846\nLiabilities and Stockholders Equity\nCurrent liabilities:\nAccounts payable $ 1,054,078 $ 808,631\nCustomer advance payments 20,639 97,885\nOperating lease liabilities 317,334 285,275\nOther current liabilities 902,149 951,106\nTotal current liabilities 2,294,200 2,142,897\nOperating lease liabilities, non-current 2,589,121 2,906,455\nTotal liabilities 4,883,321 5,049,352\nCommitments and Contingencies (Note 11)\nStockholders Equity\nCommon Stock, $0.01 par value; 10,000,000 shares authorized; 2,370,251 shares issued and outstanding at March 31, 2023 and March 31, 2022 23,703 23,703\nAdditional paid-in capital 7,566,324 7,566,324\nRetained earnings 16,726,543 23,229,467\nTotal Stockholders Equity 24,316,570 30,819,494\nTotal Liabilities and Stockholders Equity $ 29,199,891 $ 35,868,846\nThe accompanying notes are an integral part of these financial statements.\nIEH CORPORATION\nSTATEMENTS OF OPERATIONS\nFor the Fiscal Years Ended\nMarch 31,\nRevenue $ 19,136,890 $ 24,265,589\nCosts and expenses:\nCost of products sold 18,395,865 19,328,249\nSelling, general and administrative 5,519,278 5,039,072\nDepreciation and amortization 1,034,559 837,201\nTotal operating expenses 24,949,702 25,204,522\nOperating loss (5,812,812 ) (938,933 )\nOther income (expense):\nOther income (for fiscal year ended March 31, 2022, consists principally of $2,103,885 debt forgiveness income from the forgiveness of the PPP Loan, see Note 5) 85,231 2,214,030\nInterest income (expense), net 31,037\nTotal other income (expense), net 116,268 2,214,421\n(Loss) income before (provision for) benefit from income taxes (5,696,544 ) 1,275,488\n(Provision for) benefit from income taxes (806,380 ) 162,646\nNet (loss) income $ (6,502,924 ) $ 1,438,134\n(Net loss) earnings per common share:\nBasic $ (2.74 ) $ 0.61\nDiluted $ (2.74 ) $ 0.59\nWeighted-average number of common and common equivalent shares (in thousands):\nBasic 2,370 2,370\nDiluted 2,370 2,448\nThe accompanying notes are an integral part of these financial statements.\nIEH CORPORATION\nSTATEMENT OF CHANGES IN STOCKHOLDERS EQUITY\nCommon Stock Additional\nPaid-in Retained Total Stockholders\nShares Amount Capital Earnings Equity\nBalances at March 31, 2021 2,370,251 $ 23,703 $ 7,183,241 $ 21,791,333 $ 28,998,277\nStock-based compensation expense - -\n383,083 -\n383,083\nNet income - -\n-\n1,438,134 1,438,134\nBalances at March 31, 2022 2,370,251 $ 23,703 $ 7,566,324 $ 23,229,467 $ 30,819,494\nNet loss - -\n-\n(6,502,924 ) (6,502,924 )\nBalances at March 31, 2023 2,370,251 $ 23,703 $ 7,566,324 $ 16,726,543 $ 24,316,570\nThe accompanying notes are an integral part of these financial statements.\nIEH CORPORATION\nSTATEMENTS OF CASH FLOWS\nFor the Fiscal Years\nEnded March 31,\nCash flows from operating activities:\nNet (loss) income $ (6,502,924 ) $ 1,438,134\nAdjustments to reconcile net (loss) income to\nNet cash (used in) provided by operating activities:\nDepreciation and amortization 1,034,559 837,201\nStock-based compensation expense - 383,083\nInventory obsolescence provision 222,000 (14,000 )\nDeferred income taxes, net 806,380 (164,427 )\nOperating lease right-of-use assets 502,876 484,359\nGain on forgiveness of PPP loan -\n(2,103,885 )\nChanges in assets and liabilities:\nAccounts receivable 53,532 2,607,255\nInventories 59,995 (412,590 )\nCorporate income taxes receivable 373,007 (1,561,384 )\nPrepaid expenses and other current assets 15,390 27,227\nAccounts payable 245,447 189,577\nCustomer advance payments (77,246 ) 59,224\nOperating lease liabilities (469,110 ) (367,008 )\nOther current liabilities (48,957 ) 11,727\nNet cash (used in) provided by operating activities (3,785,051 ) 1,414,493\nCash flows from investing activities:\nAcquisition of property, plant and equipment (545,514 ) (2,646,764 )\nNet cash used in investing activities (545,514 ) (2,646,764 )\nNet decrease in cash (4,330,565 ) (1,232,271 )\nCash - beginning of fiscal year 12,675,271 13,907,542\nCash - end of fiscal year $ 8,344,706 $ 12,675,271\nSupplemental disclosures of cash flow information:\nCash paid during the year for:\nInterest $ -\n$ 110\nIncome Taxes $ 7,804 $ 1,274,539\nThe accompanying notes are an integral part of these financial statements.\nIEH CORPORATION\nNotes to Financial Statements\nNote 1 DESCRIPTION OF BUSINESS:\nOverview:\nIEH Corporation (hereinafter referred to as IEH or the Company) began in New York, New York in 1941. IEH was incorporated in March, 1943.\nThe Company designs and manufactures HYPERBOLOID connectors that not only accommodate, but exceed military and aerospace specification standards.\nNote 2 SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES:\nRevenue Recognition\nThe core principle underlying Accounting Standards Codification ASC 606 Revenue from Contracts with Customers (ASC 606), is to recognize revenue to depict the transfer of promised goods or services to customers in an amount that reflects the consideration to which the entity expects to be entitled in exchange for those goods or services. ASC 606 sets out the following steps for an entity to follow when applying the core principle to its revenue generating transactions:\n● Identify the contract with a customer\n● Identify the performance obligations in the contract\n● Determine the transaction price\n● Allocate the transaction price to the performance obligations\n● Recognize revenue when (or as) each performance obligation is satisfied\nThe Company recognizes revenue and the related cost of products sold when the performance obligations are satisfied. The performance obligations are typically satisfied upon shipment of physical goods. In addition to the satisfaction of the performance obligations, the following conditions are required for revenue recognition: an arrangement exists, there is a fixed price, and collectability is reasonably assured.\nThe Company does not offer any discounts, credits or other sales incentives. Historically, the Company has not had an issue with uncollectible accounts receivable.\nThe Company will accept a return of defective products within one year from shipment for repair or replacement at the Companys option. If the product is repairable, the Company at its own cost, will repair and return it to the customer. If unrepairable, the Company will provide a replacement at its own cost.\nIEH CORPORATION\nNotes to Financial Statements\nNote 2 SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES (Continued):\nRevenue Recognition, continued\nThe Companys disaggregated revenue by geographical location is as follows:\nFor the Fiscal Years Ended\nMarch 31,\nDomestic $ 16,297,959 $ 18,480,329\nInternational 2,838,931 5,785,260\nTotal $ 19,136,890 $ 24,265,589\nApproximately 39.8% and 68.2% of the international net revenues for fiscal years ended March 31, 2023 and 2022, respectively, represent sales to customers located in China.\nThe Companys the aggregated revenue by industry as a percentage of total revenue is provided below:\nFor the Fiscal Years Ended\nMarch 31,\nIndustry % %\nDefense 56.3 59.1\nCommercial Aerospace 25.7 14.7\nSpace 9.4 17.7\nOther 8.6 8.5\nInventories:\nInventories are comprised of raw materials, work-in-process and finished goods, and are stated at cost, on an average basis, which does not exceed net realizable value. The Company manufactures products pursuant to specific technical and contractual requirements.\nThe Company annually reviews its purchase and usage activity of its inventory of parts as well as work in process and finished goods to determine which items of inventory have become obsolete within the framework of current and anticipated orders. The Company estimates which materials may be obsolete and which products in work in process or finished goods may be sold at less than cost. A periodic adjustment, based upon historical experience is made to inventory in recognition of this impairment. The Companys allowance for obsolete inventory was $433,000 and $211,000 as of March 31, 2023 and 2022, respectively, and was reflected as a reduction of inventory.\nConcentration of Credit Risk:\nFinancial instruments which potentially subject the Company to concentrations of credit risk consist primarily of cash and cash equivalents and accounts receivable.\nAt times, the Companys cash in banks was in excess of the Federal Deposit Insurance Corporation insurance limits. The Company has not experienced any loss as a result of these deposits.\nIEH CORPORATION\nNotes to Financial Statements\nNote 2\nSUMMARY OF SIGNIFICANT ACCOUNTING POLICIES (Continued):\nProperty, Plant and Equipment:\nProperty, plant and equipment are stated at cost less accumulated depreciation and amortization. The Company provides for depreciation and amortization on a straight-line basis over the estimated useful lives (5-7 years) of the related assets.\nMaintenance and repair expenditures are charged to operations, and renewals and betterments are capitalized. Items of property, plant and equipment, which are sold, retired or otherwise disposed of, are removed from the asset and accumulated depreciation or amortization account. Any gain or loss thereon is either credited or charged to operations.\nIncome Taxes:\nThe Companys current provision for income taxes is based upon its estimated taxable income in each of the jurisdictions in which it operates, after considering the impact on taxable income of temporary and permanent differences resulting from different treatment of items for tax and financial reporting purposes. Deferred tax assets and liabilities are recognized for the future tax consequences attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases and any operating loss or tax credit carryforwards. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the year in which those temporary differences are expected to be recovered or settled. The ultimate realization of deferred tax assets is dependent upon the generation of future taxable income in those periods in which temporary differences become deductible. Should management determine that it is more likely than not that some portion of the deferred tax assets will not be realized, a valuation allowance against the deferred tax assets would be established in the period such determination was made.\nUncertain Tax Positions:\nThe Company has recorded liabilities for underpayment of income taxes and related interest and penalties for uncertain tax positions based on the determination of whether tax benefits claimed or expected to be claimed on a tax return should be recorded in the financial statements. The Company may recognize the tax benefit from an uncertain tax position only if it is more likely than not that the tax position will be sustained on examination by the taxing authorities based on the technical merits of the position. The tax benefits recognized in the financial statements from such position should be measured based on the largest benefit that has a greater than fifty percent likelihood of being realized upon ultimate settlement. The Company recognizes accrued interest and penalties associated with unrecognized tax benefits as part of the income tax provision.\nIEH CORPORATION\nNotes to Financial Statements\nNote 2\nSUMMARY OF SIGNIFICANT ACCOUNTING POLICIES (Continued):\n(Net Loss) Earnings Per Share:\nThe Company accounts for earnings per share pursuant to ASC Topic 260, Earnings per Share, which requires disclosure on the financial statements of basic and diluted earnings per share. Basic (loss) earnings per common share are computed by dividing net (loss) income by the weighted average number of common shares outstanding for the fiscal year. Diluted (loss) earnings per share is computed by dividing net (loss) income by the weighted average number of common shares outstanding plus common stock equivalents (if dilutive).\nBasic and diluted (net loss) earnings per share is calculated as follows:\nFor the Fiscal Years Ended\nMarch 31,\nNet (loss) income $ (6,502,924 ) $ 1,438,134\n(Net loss) earnings per common share:\nBasic $ (2.74 ) $ 0.61\nDiluted $ (2.74 ) $ 0.59\nWeighted average number of common shares outstanding-basic (in-thousands) 2,370 2,370\nDilutive effect of options to the extent that that such options are determined to be in the money for the period (in thousands) -\nWeighted average number of common shares outstanding-fully diluted (in thousands) 2,370 2,448\nPotentially dilutive securities outlined in the table below have been excluded from the computation of diluted (net loss) earnings per share because the effect of their inclusion would have been anti-dilutive.\nFor the Fiscal Years Ended\nMarch 31,\nPotentially dilutive options to purchase common shares 467,217 330,000\nIEH CORPORATION\nNotes to Financial Statements\nNote 2\nSUMMARY OF SIGNIFICANT ACCOUNTING POLICIES (Continued):\nFair Value of Financial Instruments:\nThe carrying value of the Companys financial instruments, consisting of accounts receivable and accounts payable, approximate their fair value due to the relatively short maturity of these instruments. The Company is exposed to credit risk through its cash but mitigates this risk by keeping these deposits at major financial institutions.\nThe Financial Accounting Standards Board (FASB) ASC 820, Fair Value Measurements and Disclosures, provides the framework for measuring fair value. That framework provides a fair value hierarchy that prioritizes the inputs to valuation techniques used to measure fair value. The hierarchy gives the highest priority to unadjusted quoted prices in active markets for identical assets or liabilities (level 1 measurements) and the lowest priority to unobservable inputs (level 3 measurements).\nFair value is defined as an exit price, representing the amount that would be received upon the sale of an asset or payment to transfer a liability in an orderly transaction between market participants. Fair value is a market-based measurement that is determined based on assumptions that market participants would use in pricing an asset or liability. A three-tier fair value hierarchy is used to prioritize the inputs in measuring fair value as follows:\nLevel 1 - Quoted prices in active markets for identical assets or liabilities.\nLevel 2 - Quoted prices for similar assets or liabilities in active markets, quoted prices for identical or similar assets or liabilities in markets that are not active, or other inputs that are observable, either directly or indirectly.\nLevel 3 - Significant unobservable inputs that cannot be corroborated by market data and inputs that are derived principally from or corroborated by observable market data or correlation by other means.\nUse of Estimates:\nThe preparation of financial statements in conformity with generally accepted accounting principles (GAAP) requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, revenues and expenses, and disclosure of contingent assets and liabilities at the date of the financial statements. The Company utilizes estimates with respect to determining the useful lives of fixed assets, the fair value of stock based instruments, an incremental borrowing rate for determining for its leases the present value of lease payments, the calculation of inventory obsolescence, as well as determining the amount of the valuation allowance for deferred income tax assets, net. Actual amounts could differ from those estimates.\nSegment Information:\nThe Company identifies its operating segments in accordance with Accounting Standards Codification (ASC) 280, Segment Reporting (ASC 280). Operating segments are defined as components of an enterprise about which separate discrete financial information is available for evaluation by the chief operating decision maker, or decision-making group, in deciding how to allocate resources and in assessing performance. The Companys chief operating decision maker, its Chief Executive Officer, manages the Companys operations on a combined basis for the purposes of allocating resources. Accordingly, the Company has determined it operates and manages its business in a single reportable operating segment.\nIEH CORPORATION\nNotes to Financial Statements\nNote 2\nSUMMARY OF SIGNIFICANT ACCOUNTING POLICIES (Continued):\nImpairment of Long-Lived Assets:\nThe Company has adopted the provisions of ASC Topic 360, Property, Plant and Equipment-Impairment or Disposal of Long Lived Assets, and requires that long-lived assets and certain identifiable intangibles to be held and used by an entity be reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable. There were no long-lived asset impairments recognized by the Company for the fiscal years ended March 31, 2023 and 2022, respectively.\nStock-Based Compensation:\nCompensation expense for stock options granted to directors, officers and key employees is based on the fair value of the award on the measurement date, which is the date of the grant. The expense is recognized ratably over the service period of the award. The fair value of stock options is estimated using the Black-Scholes valuation model. The fair value of any other non-vested stock awards is generally the market price of the Companys common stock on the date of the grant.\nThe Company determined the fair value of the stock option grants based upon the assumptions as provided below. There were no stock options granted during the fiscal year ended March 31, 2023.\nFor the Fiscal Years Ended\nMarch 31,\nWeighted Average Stock Price $ -\n$ 15.18\nExpected life (in years) -\nExpected volatility -\n% 55 %\nDividend yield -\n% 0 %\nRisk-Free interest rate, per annum -\n% 1.4 %\nRecent Accounting Standards:\nFinancial Instruments - Credit Losses\nIn June 2016, the FASB issued Accounting Standard Update (ASU) 2016-13 - Financial Instruments - Credit Losses (Topic 326): Measurement of Credit Losses on Financial Instruments (ASU 2016-13), which was subsequently revised by ASU 2018-19 and ASU 2020-02. The ASU introduces a new model for assessing impairment on most financial assets. Entities will be required to use a forward-looking expected loss model, which will replace the current incurred loss model, which will result in earlier recognition of allowance for losses. The ASU will be effective for the Companys first interim period of the fiscal year ended March 31, 2024. The Company has evaluated the impact of the adoption of ASU 2016-13, and related updates, and has determined that the impact would not be material to its financial statements and disclosures.\nSubsequent Events:\nThe Company evaluated subsequent events and transactions that occurred after the balance sheet date up to the date that the financial statements were available to be issued. The Company did not identify any subsequent events that would have required adjustment or disclosure in the financial statements.\nIEH CORPORATION\nNotes to Financial Statements\nNote 3\nINVENTORIES:\nInventories are comprised of the following:\nAs of March 31,\nRaw materials $ 8,332,522 $ 7,875,015\nWork in progress 1,048,097 1,505,614\nFinished goods 498,773 558,758\nAllowance for obsolete inventory (433,000 ) (211,000 )\n$ 9,446,392 $ 9,728,387\nNote 4 PROPERTY, PLANT AND EQUIPMENT:\nProperty, plant and equipment are as follows:\nAs of March 31,\nComputers $ 639,204 $ 572,423\nLeasehold improvements 2,922,521 2,784,674\nMachinery and equipment 7,989,915 7,909,982\nTools and dies 5,286,624 5,030,650\nFurniture and fixtures 357,352 352,372\nWebsite development cost 9,785 9,785\n$ 17,205,401 $ 16,659,886\nLess: accumulated depreciation and amortization (13,340,335 ) (12,305,775 )\nProperty, Plant and Equipment, net $ 3,865,066 $ 4,354,111\nDepreciation and amortization expense for the fiscal years ended March 31, 2023 and 2022 was $1,034,559 and $837,201, respectively.\nNote 5 PPP LOAN AND NOTE:\nOn April 13, 2020, the Company entered into an unsecured note evidencing an unsecured loan (PPP Loan) in the principal amount of $2,103,885 pursuant to the Payment Protection Program (PPP) under the Coronavirus Aid Relief and Economic Security Act (CARES Act).\nOn April 21, 2021, the Company received notice that the PPP Loan was forgiven. The Company recorded the forgiveness of the principal balance of $2,103,885 as debt forgiveness income in the quarter ended June 30, 2021.\nIEH CORPORATION\nNotes to Financial Statements\nNote 6\nOTHER CURRENT LIABILITIES:\nOther current liabilities are comprised of the following:\nAs of March 31,\nPayroll and vacation accruals $ 788,136 $ 871,117\nSales commissions 58,685 48,681\nOther current liabilities 55,328 31,308\n$ 902,149 $ 951,106\nNote 7\nLEASES:\nUnder ASC 842, lease expense is recognized as a single lease cost on a straight-line basis over the lease term. The lease term consists of non-cancelable periods and may include options to extend or terminate the lease term, when it is reasonably certain such options will be exercised.\nThe Company enters into contracts in the normal course of business and assesses whether any such contracts contain a lease. The Company determines if an arrangement is a lease at inception if it conveys the right to control the identified asset for a period of time in exchange for consideration. The Company classifies leases as operating or financing in nature and records the associated lease liability and right-of-use asset on its balance sheet. The lease liability represents the present value of future lease payments, net of lease incentives, discounted using an incremental borrowing rate, which is a management estimate based on the information available at the commencement date of a lease arrangement. With respect to operating lease arrangements, the Company accounts for lease components, and non-lease components that are fixed, as a single lease component. Non-lease components that are variable are expensed as incurred as in the statement of operations and comprehensive loss. The Company recognizes costs associated with lease arrangements having an initial term of 12 months or less (short-term leases) on a straight-line basis over the lease term; such short-term leases are not recorded on the balance sheet.\nBalance sheet information related to our leases is presented below:\nAs of March 31,\nBalance Sheet Location\nOperating leases:\nRight-of-use assets Operating lease right-of-use assets $ 2,661,779 $ 2,980,820\nRight-of-use liability, current Operating lease liabilities $ 317,334 $ 285,275\nRight-of-use lease liability, long-term Operating lease liabilities, non-current $ 2,589,121 $ 2,906,455\nThe lease expense for the fiscal years ended March 31, 2023 and 2022 was $550,904 and $573,125, respectively. In addition to the base rent, the Company pays insurance premiums and utility charges relating to the use of the premises. The Company considers its present facilities to be adequate for its present and anticipated future needs.\nThe basic minimum annual rental remaining on the leases is $3,581,583 as of March 31, 2023.\nIEH CORPORATION\nNotes to Financial Statements\nNote 7\nLEASES (continued):\nThe weighted-average remaining lease term and the weighted average discount rate for operating leases were:\nAs of March 31,\nOther information\nWeighted-average discount rate - operating leases 6.00 % 6.00 %\nWeighted-average remaining lease term - operating lease (in years) 6.8 7.8\nThe total remaining operating lease payments included in the measurement of lease liabilities on the Companys balance sheet as of March 31, 2023 was as follows:\nFor the fiscal year ended March 31:\nOperating Lease\nPayments\n$ 483,184\n497,684\n519,036\n547,460\n563,891\nThereafter 970,328\nTotal gross operating lease payments 3,581,583\nLess: imputed interest (675,128 )\nTotal lease liabilities, reflecting present value of future minimum lease payments $ 2,906,455\nIEH CORPORATION\nNotes to Financial Statements\nNote 8\nINCOME TAXES:\nThe Company accounts for income taxes under the provisions of ASC Topic 740, Income Taxes. Under ASC Topic 740, deferred income tax assets or liabilities are computed based upon the temporary differences between the financial statement and income tax bases of assets and liabilities using the currently enacted marginal income tax rates. Deferred income tax expense or credits are based on the changes in the deferred income tax assets or liabilities from period to period.\nThe provision (benefit) for income taxes consists of the following:\nFor the Fiscal Years Ended\nMarch 31,\nCurrent:\nFederal $ -\n$ -\nState and local -\n-\nTotal current tax provision -\n-\nDeferred:\nFederal 755,981 (150,204 )\nState and local 50,399 (12,442 )\nTotal deferred tax expense (benefit) 806,380 (162,646 )\nTotal provision (benefit) $ 806,380 $ (162,646 )\nIEH CORPORATION\nNotes to Financial Statements\nNote 8 INCOME TAXES (Continued):\nThe tax effects of temporary differences that give rise to significant portions of the deferred tax assets are as follows:\nAs of March 31,\nDeferred tax assets:\nNet operating loss $ 1,556,081 $ 424,263\nOperating right-of-use liability 624,914 714,947\nStock options 798,083 883,522\nAccrued expenses 18,045 67,146\nInventory 189,282 150,460\nTotal deferred tax assets 3,186,405 2,240,338\nValuation allowance (2,049,283 ) -\nDeferred tax assets, net of valuation allowance 1,137,122 2,240,338\nDeferred tax liabilities:\nDepreciation 564,816 766,255\nOperating lease right-of-use assets 572,306 667,703\nTotal deferred tax liabilities 1,137,122 1,433,958\nDeferred tax assets (liability), net $ -\n$ 806,380\nIEH CORPORATION\nNotes to Financial Statements\nNote 8\nINCOME TAXES (Continued):\nA reconciliation of the provision for income taxes with the amounts computed by applying the statutory Federal income tax rate to income before provision for income taxes is as follows:\nFor the Fiscal Years Ended\nMarch 31,\nU.S. federal statutory rate 21.0 % 21.0 %\nState taxes, net of federal benefit 0.5 % 1.4 %\nStock-based compensation (0.4 )% 1.6 %\nOther 0.3 % 0.2 %\nDebt forgiveness income of the PPP Note- not subject to income tax - % (36.9 )%\nTrue-up of tax provision 0.4 % - %\nValuation allowance (36.0 )% - %\nEffective tax rate (14.2 )% (12.7 )%\nDuring the fiscal year ended March 29, 2019, the Company received a remittance of $460,442 from the Internal Revenue Service. The remittance did not indicate the basis for the payment. The Company has reported this payment as a current liability in the accompanying financial statements until such time that the basis for this remittance can be determined.\nFor the year ended March 31, 2023, the Companys effective tax rate was (14.2)%, which consisted principally of a federal rate of 21%, and the Companys estimate of state taxes, net of federal benefit, of 0.5%, offset by a charge of (36.0)% for the establishment of a full valuation allowance for the Companys deferred tax assets at March 31, 2023.\nFor the year ended March 31, 2022, the Companys effective tax rate was (12.7)%, which consisted principally of a federal rate of 21%, and the Companys estimate of state taxes, net of federal benefit, of 1.4%, offset by the impact of a gain on the forgiveness of debt that was not subject to income tax.\nAs of March 31, 2023, for U.S. federal and state income tax reporting purposes, the Company has approximately $7,237,000 of unused net operating losses (NOLs) available for carry forward to future years. As a result of the Tax Cuts and Jobs Act of 2017 (TCJA), for U.S. income tax purposes, NOLs generated in tax years beginning after December 31, 2017 may be carried forward indefinitely to offset future taxable income. The total amount of the Federal NOL as of March 31, 2023, may be carried forward indefinitely. The state and city NOLs may generally be carried forward for twenty years and may be applied against future taxable income. Further, the benefit from utilization of NOL carry forwards could be subject to limitations due to material ownership changes that could occur if the Company issues additional shares of common stock.\nThe Company remains subject to examination by tax authorities for fiscal tax years ended March 31, 2020 and later.\nBased upon the Companys recent taxable losses, the Company performed an analysis and determined that it was necessary to establish a valuation reserve with respect to its net deferred income tax assets as of and for the fiscal year ended March 31, 2023.\nAs of March 31, 2023, management does not believe that the Company has any material uncertain tax positions that would require it to measure and reflect the potential lack of sustainability of a position on audit in its financial statements. The Company will continue to evaluate its uncertain tax positions in future periods to determine if measurement and recognition in its financial statements is necessary. The Company does not believe there will be any material changes in its unrecognized tax positions over the next year.\nIEH CORPORATION\nNotes to Financial Statements\nNote 9 EQUITY INCENTIVE PLANS:\n2011 Equity Incentive Plan\nOn August 31, 2011, the Companys stockholders approved the adoption of the Companys 2011 Equity Incentive Plan (2011 Plan) to provide for the grant of stock options and restricted stock awards to purchase up to 750,000 shares of the Companys common stock to all employees, consultants and other eligible participants including senior management and members of the Board of Directors of the Company. The 2011 Equity Incentive Plan expired on August 31, 2021 after which no further awards will be granted under such plan.\n2020 Equity Incentive Plan\nOn November 18, 2020, the Board of Directors approved the Companys 2020 Equity Incentive Plan (the 2020 Plan) for submission to stockholders at the next annual meeting. On December 16, 2020, the Companys stockholders approved the adoption of the 2020 Plan to provide for the grant of stock options and restricted stock awards to purchase up to 750,000 shares of the Companys common stock to all employees, consultants and other eligible participants including senior management and members of the Board of Directors of the Company.\nOptions granted to employees under both the 2011 Plan and the 2020 Plan (together the Plans) may be designated as options which qualify for incentive stock option treatment under Section 422A of the Internal Revenue Code, or options which do not qualify (non-qualified stock options).\nUnder the Plans, the exercise price of an option designated as an incentive stock option shall not be less than the fair market value of the Companys common stock on the day the option is granted. In the event an option designated as an incentive stock option is granted to a ten percent (10%) or greater stockholders, such exercise price shall be at least 110 percent (110%) of the fair market value of the Companys common stock and the option must not be exercisable after the expiration of ten years from the day of the grant. The Plans also provide that holders of options that wish to pay for the exercise price of their options with shares of the Companys common stock must have beneficially owned such stock for at least six months prior to the exercise date.\nExercise prices of non-incentive stock options may not be less than the fair market value of the Companys common stock.\nThe aggregate fair market value of shares subject to options granted to a participant(s), which are designated as incentive stock options, and which become exercisable in any calendar year, shall not exceed $100,000.\nIEH CORPORATION\nNotes to Financial Statements\nNote 9\nEQUITY INCENTIVE PLANS (Continued):\nStock-based compensation expense\nStock-based compensation expense is recorded in general and administrative expenses included in the statement of operations. For the fiscal years ended March 31, 2023 and 2022, stock-based compensation expense was $0 and $383,083, respectively.\nAs of March 31, 2023 there was no unrecognized compensation expense related to unamortized stock options.\nStock option activity\nThe following table provides the stock option activity:\nShares Weighted Avg. Grant Date Fair Value Weighted Avg. Exercise Price Remaining Contractual Term (Years) Aggregate Intrinsic Value (in thousands)\nBalance as of March 31, 2022 482,217 $ 7.91 $ 14.69 6.56 $ 865\nGranted -\n-\n-\nExercised -\n-\n-\nForfeited or Expired (15,000 ) 6.76 13.70\nBalance as of March 31, 2023 467,217 $ 7.94 $ 14.72 5.51 $ 105\nExercisable as of March 31, 2023 467,217 $ 7.94 $ 14.72 5.51 $ 105\nThe aggregate intrinsic value in the table above represents the total pretax intrinsic value (i.e., the difference between the Companys closing stock price on the last trading day of the period and the exercise price, times the number of shares) that would have been received by the option holders had all option holders exercised their in-the-money options on those dates.\nNote 10 CASH BONUS PLAN:\nIn 1987, the Company adopted a cash bonus plan (the Cash Bonus Plan) for non-union, management and administration staff. Unless otherwise approved by the Companys Board of Directors, contributions to the Cash Bonus Plan are made by the Company only when the Company is profitable for the fiscal year. As of March 31, 2023 and 2022, the Companys accrued bonus was $354,250 and $408,000, respectively. Bonus expense recorded for each of the years ended March 31, 2023 and 2022 was $82,901 and $402,000, respectively. The Company paid bonus earned during the fiscal year ended March 31, 2023 of $354,250 in June 2023 and the bonus earned during the fiscal year ended March 31, 2022 of $137,750 in June 2022, respectively.\nIEH CORPORATION\nNotes to Financial Statements\nNote 11\nCOMMITMENTS AND CONTINGENCIES:\nThe Company maintains its operations in facilities located in both New York and Pennsylvania.\nOn December 1, 2020, the Company entered into a 120 month extension of its lease agreement for an industrial building in Brooklyn, NY, expiring December 1, 2030. Monthly rent at inception was $20,400, such monthly rent escalates annually to a monthly rent of $28,426 for the final year of the lease term. The Company maintains a security deposit of $40,800, which is included in other assets on the accompanying balance sheet.\nOn January 29, 2021, the Company entered into an 87 month lease agreement for an industrial building in Allentown, Pennsylvania, expiring March 30, 2028. Monthly rent at inception was $18,046, such that the monthly rent escalates annually to a monthly rent of $20,920 for the final year of the lease term. The Company maintains a security deposit of $35,040, which is included in other assets on the accompanying balance sheet.\nThe rental expense for the fiscal years ended March 31, 2023 and 2022, was $550,904 and $573,125, respectively.\nThe Company has a collective bargaining multi-employer pension plan (Multi-Employer Plan) with the United Auto Workers of America, Local 259 (ID No. 136115077). The Multi-Employer Plan is covered by a collective bargaining agreement with the Company, which expires on March 31, 2024. Contributions are made in accordance with a negotiated labor contract and are based on the number of covered employees employed per month. With the passage of the Multi-Employer Pension Plan Amendments Act of 1990 (the 1990 Act), the Company may become subject to liabilities in excess of contributions made under the collective bargaining agreement. Generally, these liabilities are contingent upon the termination, withdrawal, or partial withdrawal from the Multi-Employer Plan. The risks of participating in a multiemployer plan are different from single-employer plans, for example, assets contributed to the multiemployer plan by one employer may be used to provide benefits to employees of other participating employers, if a participating employer stops contributing to the multiemployer plan, the unfunded obligations of the plan may become the obligation of the remaining participating employers, and if a participating employer chooses to stop participating in these multiemployer plans, the employer may be required to pay those plans an amount based on the underfunded status of the plan.\nBased upon the Multi-Employer Plans consulting actuary, the actuarial certification of plan status for the years ended December 31, 2023 (preliminary assessment) and December 31, 2022 is neither endangered nor critical under the Pension Protection Act of 2006. The total contributions charged to operations under the provisions of the Multi-Employer Plan were $52,815 and $56,791 for the fiscal years ended March 31, 2023 and 2022, respectively. For the plan years ended December, 31, 2022 and 2021 respectively, the Company was listed in the United Auto Workers of America, Local 259 as providing less than 5% of the total contributions for the plan. The Company has not taken any action to terminate, withdraw or partially withdraw from the Multi-Employer Plan nor does it intend to do so in the future.\nIEH CORPORATION\nNotes to Financial Statements\nNote 12\nCONCENTRATIONS:\nDuring the fiscal year ended March 31, 2023, no customers accounted for greater than 10% of the Companys net sales.\nDuring the fiscal year ended March 31, 2022, three customers accounted for 37.1% of the Companys net sales, each represented 12.5%, 12.3% and 12.3%, respectively.\nAs of March 31, 2023, three customers accounted for 44.5% of accounts receivable, each represented 23.2%, 11.0% and 10.3%, respectively.\nAs of March 31, 2022, one customer accounted for 15.0% of accounts receivable.\nDuring the fiscal years ended March 31, 2023 and 2022, one vendor accounted for 10.0% and 10.3% of the Companys purchases, respectively.\nAs of March 31, 2023 and 2022 one vendor accounted for 20.9% and two vendors accounted for 21.4% of accounts payable, respectively.\nNONE\nfalse FY\n2022-04-01 2023-03-31\n2022-09-30\n2023-10-06\n2023-03-31\n2022-03-31\n2021-04-01 2022-03-31\nus-gaap:CommonStockMember\n2021-03-31\nus-gaap:AdditionalPaidInCapitalMember\n2021-03-31\nus-gaap:RetainedEarningsMember\n2021-03-31\niehc:TotalMember\n2021-03-31\nus-gaap:CommonStockMember\n2021-04-01 2022-03-31\nus-gaap:AdditionalPaidInCapitalMember\n2021-04-01 2022-03-31\nus-gaap:RetainedEarningsMember\n2021-04-01 2022-03-31\niehc:TotalMember\n2021-04-01 2022-03-31\nus-gaap:CommonStockMember\n2022-03-31\nus-gaap:AdditionalPaidInCapitalMember\n2022-03-31\nus-gaap:RetainedEarningsMember\n2022-03-31\niehc:TotalMember\n2022-03-31\nus-gaap:CommonStockMember\n2022-04-01 2023-03-31\nus-gaap:AdditionalPaidInCapitalMember\n2022-04-01 2023-03-31\nus-gaap:RetainedEarningsMember\n2022-04-01 2023-03-31\niehc:TotalMember\n2022-04-01 2023-03-31\nus-gaap:CommonStockMember\n2023-03-31\nus-gaap:AdditionalPaidInCapitalMember\n2023-03-31\nus-gaap:RetainedEarningsMember\n2023-03-31\niehc:TotalMember\n2023-03-31\n2021-03-31\ncountry:CN\n2022-04-01 2023-03-31\ncountry:CN\n2021-04-01 2022-03-31\nsrt:MinimumMember\n2023-03-31\nsrt:MaximumMember\n2023-03-31\niehc:DomesticMember\n2022-04-01 2023-03-31\niehc:DomesticMember\n2021-04-01 2022-03-31\niehc:InternationalMember\n2022-04-01 2023-03-31\niehc:InternationalMember\n2021-04-01 2022-03-31\niehc:DefenseMember iehc:ConcentrationRiskMember iehc:RevenueMember\n2022-04-01 2023-03-31\niehc:DefenseMember iehc:ConcentrationRiskMember iehc:RevenueMember\n2021-04-01 2022-03-31\niehc:CommercialAerospaceMember iehc:ConcentrationRiskMember iehc:RevenueMember\n2022-04-01 2023-03-31\niehc:CommercialAerospaceMember iehc:ConcentrationRiskMember iehc:RevenueMember\n2021-04-01 2022-03-31\niehc:SpaceMember iehc:ConcentrationRiskMember iehc:RevenueMember\n2022-04-01 2023-03-31\niehc:SpaceMember iehc:ConcentrationRiskMember iehc:RevenueMember\n2021-04-01 2022-03-31\niehc:OtherMember iehc:ConcentrationRiskMember iehc:RevenueMember\n2022-04-01 2023-03-31\niehc:OtherMember iehc:ConcentrationRiskMember iehc:RevenueMember\n2021-04-01 2022-03-31\nus-gaap:ComputerEquipmentMember\n2023-03-31\nus-gaap:ComputerEquipmentMember\n2022-03-31\nus-gaap:LeaseholdImprovementsMember\n2023-03-31\nus-gaap:LeaseholdImprovementsMember\n2022-03-31\nus-gaap:MachineryAndEquipmentMember\n2023-03-31\nus-gaap:MachineryAndEquipmentMember\n2022-03-31\nus-gaap:ToolsDiesAndMoldsMember\n2023-03-31\nus-gaap:ToolsDiesAndMoldsMember\n2022-03-31\nus-gaap:FurnitureAndFixturesMember\n2023-03-31\nus-gaap:FurnitureAndFixturesMember\n2022-03-31\niehc:WebsiteDevelopmentCostMember\n2023-03-31\niehc:WebsiteDevelopmentCostMember\n2022-03-31\niehc:PPPLoanMember\n2020-04-13\niehc:PPPLoanMember\n2021-06-30 2021-06-30\n2018-04-01 2019-03-29\nus-gaap:StateAndLocalJurisdictionMember\n2023-03-31\niehc:TwoZeroOneOneEquityIncentivePlanMember\n2011-08-31\niehc:TwoZeroTwoZeroEquityIncentivePlanMember\n2020-12-16\niehc:TwoZeroTwoZeroEquityIncentivePlanMember\n2022-04-01 2023-03-31\n2020-12-01 2020-12-01\n2020-12-01\n2021-01-29 2021-01-29\n2021-01-29\niehc:NetSalesMember\n2022-04-01 2023-03-31\niehc:CustomersMember\n2021-04-01 2022-03-31\niehc:OneCustomersMember\n2021-04-01 2022-03-31\niehc:SecondCustomersMember\n2021-04-01 2022-03-31\niehc:ThirdCustomersMember\n2021-04-01 2022-03-31\niehc:CustomersMember\n2022-04-01 2023-03-31\niehc:OneCustomersMember\n2022-04-01 2023-03-31\niehc:SecondCustomersMember\n2022-04-01 2023-03-31\niehc:ThirdCustomersMember\n2022-04-01 2023-03-31\niehc:OneCustomerMember us-gaap:AccountsReceivableMember\n2021-04-01 2022-03-31\niehc:OneVendorMember\n2022-04-01 2023-03-31\niehc:OneVendorMember\n2021-04-01 2022-03-31\niehc:OneVendorMember us-gaap:AccountsPayableMember\n2022-04-01 2023-03-31\niehc:OneVendorMember us-gaap:AccountsPayableMember\n2021-04-01 2022-03-31\niso4217:USD\nxbrli:shares\niso4217:USD\nxbrli:shares\nxbrli:pure"
}