{
    "cik": "50493",
    "company": "INGLES MARKETS INC",
    "filing_type": "10-K",
    "filing_date": "2023-11-29",
    "period_of_report": "2023-09-30",
    "sic": "5411",
    "state_of_inc": "NC",
    "state_location": "NC",
    "fiscal_year_end": "0930",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/50493/0000050493-23-000021-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/50493/000005049323000021/imkt-20230930x10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/50493/0000050493-23-000021.txt",
    "filename": "50493_10K_2023_0000050493-23-000021.htm",
    "content": "Item 1. BUSINESS\nGeneral\nIngles Markets, Incorporated, a North Carolina corporation (collectively with its subsidiaries, Ingles, or the Company, we, us or our), is a leading supermarket chain in the southeast United States and operates a total of 198 supermarkets in North Carolina (75), Georgia (65), South Carolina (35), Tennessee (21), Virginia (1) and Alabama (1).\nThe Company remodels, expands and relocates stores in these communities and builds stores in new locations to retain and grow its customer base while retaining a high level of customer service and convenience. Ingles supermarkets offer customers a wide variety of nationally advertised food products, including grocery, meat and dairy products, produce, frozen foods and other perishables, and non-food products. Non-food products include fuel centers, pharmacies, health and beauty care products and general merchandise. The Company also offers quality private label items and locally-sourced items throughout its market areas.\nThe Company believes that customer service and convenience, modern stores and competitive prices on a broad selection of quality merchandise are essential to developing and retaining a loyal customer base. The Company has an ongoing renovation and expansion plan to add stores in its target markets and modernize the appearance and layout of its existing stores. The Companys new and remodeled supermarkets provide an enhanced level of customer convenience in order to accommodate the lifestyle of todays shoppers. Design features of the Companys modern stores focus on selling products in perishable departments featuring local organic and home meal replacement items, in-store pharmacies, on-premises fuel centers, and an expanded selection of food and non-food items. The Company offers online ordering of its products for pickup at its stores.\nSubstantially all of the Companys stores are located within 280 miles of the Companys warehouse and distribution facilities, near Asheville, North Carolina. The Company operates 1.65 million square feet of warehouse and distribution facilities. These facilities supply the Companys supermarkets with approximately 57% of the goods the Company sells. The remaining 43% is purchased from third parties and is generally delivered directly to the stores. The close proximity of the Companys purchasing and distribution operations to its stores facilitates the timely distribution of consistently high quality perishable and non-perishable items.\nTo further ensure product quality, the Company also owns and operates a milk processing and packaging plant that supplies approximately 72% of the milk products sold by the Companys supermarkets as well as a variety of organic milk, fruit juices and bottled water products. In addition, the milk processing and packaging plant sells approximately 81% of its products to other retailers, food service distributors and grocery warehouses in 17 states, which provides the Company with an additional source of revenue.\nThe Company owns 167 of its supermarkets, either in free-standing stores or as the anchor tenant in an owned shopping center. The Company also owns 29 undeveloped sites suitable for a free-standing store or development by the Company or a third party. The Companys owned real estate is generally located in the same geographic region as its supermarkets.\nAs of September 30, 2023, Mr. Robert P. Ingle II, our Chairman, beneficially owned approximately 72.2% of the combined voting power and 22.9% of the total number of shares of the Companys outstanding Class A and Class B Common Stock (in each case including stock held by the Companys Investment/Profit Sharing Plan and Trust of which Mr. Ingle II serves as one of the trustees). Beneficial ownership is calculated in accordance with Rule 13d-3 promulgated under the Exchange Act. The Company became publicly traded in September 1987. The Companys Class A Common Stock is listed on The NASDAQ Global Select Market under the symbol IMKTA. The Companys Class B Common Stock is not publicly listed or traded.\nThe Company was incorporated in 1965 under the laws of the State of North Carolina. Its principal mailing address is P.O. Box 6676, Asheville, North Carolina 28816, and its telephone number is 828-669-2941. The Companys website is www.ingles-markets.com. Information on, or accessible through, the Companys website is not a part of and is not incorporated by reference into this Annual Report on Form 10-K. The Companys annual report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and amendments and supplements to these reports filed or furnished pursuant to Section 13(a) or 15(d) of the Exchange Act are available free of charge on the Companys website as soon as reasonably practicable after they are filed with or furnished to the Securities and Exchange Commission.\nUse of our Website and Social Media to Distribute Material Company Information\nWe use our website as a channel of distribution for important Company information. We routinely post on our website important information, including press releases and financial information, which may be accessed by selecting the Corporate sections of www.ingles-markets.com. We also use our website to expedite public access to time-critical information regarding our Company in advance of or in lieu of distributing a press release or a filing with the SEC disclosing the same information. Therefore, investors should look to the Corporate sections of our website for important and time-critical information. Visitors to our website can also register to receive financial information press releases. Information contained on, or accessible through, our website is not a part of and is not incorporated by reference into this Annual Report on Form 10-K.\nBusiness\nThe Company operates one primary business segment, retail grocery. Information about the Companys operations is as follows (for information regarding the Companys industry segments, see Note 11, Segment Information to the Consolidated Financial Statements contained in this Annual Report on Form 10-K):\nFiscal Year Ended September\n(dollars in millions)\nRevenues from unaffiliated customers:\nGrocery\n$\n2,062.4\n$\n1,940.4\n$\n1,762.9\nNon-foods\n1,326.9\n1,204.5\n1,136.3\nPerishables\n1,482.1\n1,445.0\n1,349.1\nFuel\n792.5\n885.8\n583.7\nTotal retail\n5,663.9\n96.1%\n5,475.7\n96.4%\n4,832.0\n96.9%\nOther\n228.9\n3.9%\n203.1\n3.6%\n156.0\n3.1%\n$\n5,892.8\n100.0%\n$\n5,678.8\n100.0%\n$\n4,988.0\n100.0%\nIncome from operations:\nRetail\n$\n263.2\n90.0%\n$\n353.0\n93.7%\n$\n327.6\n93.6%\nOther\n29.1\n10.0%\n23.9\n6.3%\n22.5\n6.4%\n292.3\n100.0%\n376.9\n100.0%\n350.1\n100.0%\nOther income, net\n8.3\n5.9\n2.9\nInterest expense\n22.1\n21.5\n24.3\nLoss on early extinguishment of debt\n-\n-\n1.1\nIncome before income taxes\n$\n278.5\n$\n361.3\n$\n327.6\nThe Grocery category includes grocery, dairy and frozen foods.\nThe Non-foods category includes alcoholic beverages, tobacco, pharmacy, and health/beauty/cosmetic products.\nThe Perishables category includes meat, produce, deli and bakery.\nThe Other category consists of fluid dairy operations and shopping center rentals.\nSupermarket Operations\nAt September 30, 2023, the Company operated 189 supermarkets under the name Ingles, and nine supermarkets under the name Sav-Mor with locations in western North Carolina, western South Carolina, northern Georgia, eastern Tennessee, southwestern Virginia and northeastern Alabama. The Sav-Mor store concept accommodates smaller shopping areas and carries dry groceries, dairy, fresh meat and produce, all of which are displayed in a modern, readily accessible environment.\nThe following table sets forth certain information with respect to the Companys supermarket operations.\nNumber of Supermarkets\nPercentage of Total\nat Fiscal\nNet Sales for Fiscal\nYear Ended September\nYear Ended September\nNorth Carolina\n41%\n41%\n41%\nSouth Carolina\n19%\n19%\n19%\nGeorgia\n32%\n32%\n32%\nTennessee\n8%\n8%\n8%\nVirginia\n-\n-\n-\nAlabama\n-\n-\n-\n100%\n100%\n100%\nThe Company believes that todays supermarket customers focus on convenience, quality and value in an attractive store environment. As a result, the Companys shopping experience combines a high level of customer service, convenience-oriented quality product offerings and low overall pricing. The Companys modern stores provide products and services such as home meal replacement items, delicatessens, bakeries, floral departments, greeting cards and broad selections of local organic, beverage and health-related items. At September 30, 2023, the Company operated 114 pharmacies and 108 fuel stations, in each case at the Companys grocery store locations. The Company plans to continue to incorporate these departments in substantially all future new and remodeled stores. The Company trains its associates to provide friendly service and to actively address the needs of customers. These associates reinforce the Companys distinctive service-oriented image.\nSelected statistics on the Companys supermarket operations are presented below:\nFiscal Year Ended September\nWeighted Average Sales Per Store (000s) (1)\n$\n28,565\n$\n27,622\n$\n23,926\n$\n22,215\n$\n20,189\nTotal Square Feet at End of Year (000s)\n11,403\n11,342\n11,342\n11,256\n11,247\nAverage Total Square Feet per Store\n57,589\n57,281\n57,281\n57,138\n56,806\nAverage Square Feet of Selling Space per Store (2)\n40,313\n40,097\n40,097\n39,997\n39,765\nWeighted Average Sales per Square Foot of\n‎ Selling Space (1) (2)\n(1)Weighted average sales per store include the effects of increases in square footage due to the opening of replacement stores and the expansion of stores through remodeling during the periods indicated, and fuel sales.\n(2)Selling space is estimated to be 70% of total interior store square footage.\nMerchandising\nThe Companys merchandising strategy is designed to create a comprehensive and satisfying shopping experience that blends value and customer service with variety, quality and convenience. Management believes that this strategy fosters a loyal customer base by establishing a reputation for providing high quality products and a variety of specialty departments.\nThe Companys stores carry a broad selection of quality meats, produce and other perishables. The Company offers a wide variety of fresh and non-perishable organic products, including organic milk produced by the Companys fluid dairy plant. The Companys market areas contain numerous providers of quality local products, which is in line with current customer preferences for goods produced where they live. Management believes that customers perceive supermarkets offering a broad array of products and time-saving services as part of a solution to todays lifestyle demands. Accordingly, a principal component of the Companys merchandising strategy is to design stores that enhance the shopping experience. The Company operates fuel stations at 108 of its store locations.\nA selection of prepared foods and home meal replacements are featured throughout Ingles deli, bakery, produce and meat departments to provide customers with easy meal alternatives that they can eat at home or in the store. Many stores offer daily selections of home meal replacement items, such as rotisserie chicken and pork, international foods, fried chicken and other entrees, sandwiches, pre-packaged salads, sushi, cut fruit and prepared fresh vegetables. The bakery offers an expanded selection of baked goods and self-service options. Ingles bakes most of its items on site, including bread baked daily, cakes made to order in various sizes, donuts and other pastries. The deli offers salad, chicken wing and olive bars, an expanded offering of cheeses, gourmet items and home meal replacement items. The Company also provides its customers with an expanded selection of frozen food items (including organics) to meet the increasing demands of its customers.\nThe Ingles Curbside service allows customers to order any product in the Companys stores online. The order is picked by store associates and loaded into the customers vehicle. This service is currently offered at 129 of the Companys stores, with additional stores expected to be added each month.\nIngles private labels cover a broad range of products throughout the store, such as milk, bread, organic products, soft drinks and canned goods. Ingles believes that private label sales help promote customer loyalty and provide a value-priced alternative to national brands.\nThe Company seeks to maintain a reputation for providing friendly service, quality merchandise and customer value and for its commitment to locally-sourced products and community involvement. The Company employs various advertising and promotional strategies to reinforce the quality and value of its products. The Company promotes these attributes using traditional advertising vehicles including radio, television, direct mail and newspapers, as well as electronic and social media. The Ingles Advantage Card is designed to foster customer loyalty by providing information to better understand the Companys customers shopping patterns. The Ingles Advantage Card provides customers with special discounts throughout the Companys stores and fuel stations.\nPurchasing and Distribution\nThe Company currently supplies approximately 57% of its supermarkets inventory requirements from its modern warehouse and distribution facilities. The Company has 1.65 million square feet of office, warehouse and distribution facilities at its headquarters near Asheville, North Carolina. The Company believes that its warehouse and distribution facilities contain sufficient capacity for the continued expansion of its store base for the foreseeable future.\nThe Companys centrally managed purchasing and distribution operations provide several advantages, including the ability to negotiate and reduce the cost of merchandise, decrease overhead costs and better manage its inventory at both the warehouse and store level. From time to time, the Company engages in advance purchasing on high-turnover inventory items to take advantage of special prices offered by manufacturers for limited periods, or to ensure adequate product supply during tight distribution market conditions.\nThe remaining 43% of the Companys inventory requirements, primarily beverages, pharmacy, fuel, bread and snack foods, are supplied directly to the Companys supermarkets by local distributors and manufacturers.\nGoods from the warehouse and distribution facilities and the milk processing and packaging plant are distributed to the Companys stores by a fleet of 183 tractors and 864 trailers that the Company owns, operates and maintains. The Company invests on an ongoing basis in the maintenance, upgrade and replacement of its tractor and trailer fleet. The Company also operates truck servicing and fuel storage facilities at its warehouse and distribution facilities. The Company reduces its overall distribution costs by capitalizing on back-haul opportunities (contracting with third parties to transport their merchandise on our trucks that would otherwise be empty).\nThe effects of the COVID-19 pandemic, which began in March 2020, have eased considerably over the fiscal year ended September 30, 2023, but the earlier portion of the pandemic substantially impacted supermarket operations, and some effects have continued through the fiscal year ended September 30, 2023. At the onset of the COVID-19 pandemic, the Company implemented several enhanced cleaning and social distancing protocols designed to keep our customers and our associates safe and continued to monitor and update its protocols as the pandemic evolved. Since March 2020, the Companys stores have experienced increased customer traffic and occasional product shortages due to supply chain issues. The currently tight labor market has impacted the Companys ability to attract and retain qualified store personnel, but these impacts have not materially affected our operations. The economy has continued to recover from the effects of the pandemic, which has included inflation not seen in decades. Inflation impacts product costs, labor costs and the cost of other goods used by the Company, which could negatively impact our results of Operations.\nWhile the COVID-19 pandemic was officially declared to have ended in May 2023, at the present time, we cannot predict how long and to what extent the ongoing effects of the pandemic and inflation will impact our sales and financial performance.\nThe Company receives product recall information from various subscription, government and vendor sources. Upon receipt of recall information, the Company immediately contacts each of its stores to have the recalled product removed from the shelves and disposed of as instructed. The Company may also use social media to communicate product recall information to the public. The Company has a policy of refunding and/or replacing any goods returned by customers. The details of this policy are posted inside each of the Companys stores.\nStore Development, Expansion and Remodeling\nThe Company believes that the appearance and design of its stores are integral components of its customers shopping experience and aims to develop one of the most modern supermarket chains in the industry. The ongoing modernization of the Companys store base involves (i) the construction of new stores with continuously updated designs, and (ii) the replacement, remodeling or expansion of existing stores. The Companys goal is to maintain clean, well-lit stores with attractive architectural and display features that enhance the image of its stores as catering to the changing lifestyle needs of quality-conscious consumers who demand increasingly diverse product offerings. The construction of new stores by independent contractors is closely monitored and controlled by the Company. During fiscal year 2023, the Company slowed some of its new store and remodeling plans due to inflation and supply chain issues in building materials and equipment, as well as due to the tight labor market conditions for construction labor. As described above, we cannot currently predict how long these conditions will persist, but the Company has continued to build and remodel stores albeit at what management believes will be a temporarily slower pace.\nThe Company renovates and remodels stores in order to increase customer traffic and sales, respond to existing customer demand, compete effectively against new stores opened by competitors and support its quality image merchandising strategy. The Company decides to complete a remodel of an existing store based on its evaluation of the competitive landscape of the local marketplace. A remodel or expansion provides the quality of facilities and product offerings identical to that of a new store, capitalizing upon the existing customer base. The Company retains the existing customer base by keeping the store in operation during the entire remodeling process. The Company may elect to relocate, rather than remodel, certain stores where relocation provides a more convenient location for its customers.\nThe following table sets forth, for the fiscal years indicated, the Companys new store development and store remodeling activities and the effect this program has had on the average size of its stores:\nNumber of Stores:\nOpened\n-\n-\n-\nClosed\n-\n-\nStores open at end of period\nSize of Stores:\nLess than 42,000 sq. ft.\n42,000 up to 51,999 sq. ft.\n52,000 up to 61,999 sq. ft.\nAt least 62,000 sq. ft.\nAverage store size (sq. ft.)\n57,589\n57,281\n57,281\n57,138\n56,806\nThe Companys ability to open new stores is subject to many factors, including the acquisition of satisfactory sites, as well as zoning limitations and other government regulations. In addition, the Company continually reviews its expansion, remodeling and replacement plans, which are subject to change. See the Liquidity and Capital Resources section included in Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations regarding the Companys capital expenditures.\nCompetition\nThe supermarket industry is highly competitive and characterized by narrow profit margins. The degree of competition the Companys stores encounter varies by location, primarily based on the size of the community in which the store is located and its proximity to other communities. The Companys principal competitors are, in alphabetical order, Aldi, Inc., Earth Fare, Inc, Food City (K-VA-T Food Stores, Inc.), Food Lion (Koninlijke Ahold Delhaize America N.V.), The Fresh Market, Inc., Harris Teeter (owned by The Kroger Co.), The Kroger Co., Lidl (Lidl Stiftung & Co. KG), Publix Super Markets, Inc., Sprouts Farmers Market, Inc., Target Corporation, Whole Foods Market, and Wal-Mart Stores, Inc. Increasingly over the last few years, competition for consumers food dollars has intensified due to the addition of, or increase in, food sections by many types of retailers (physical and online) and by restaurants.\nSupermarket chains generally compete based on location, quality of products, service, price, convenience, product variety, online ordering/delivery capabilities, and store condition.\nThe Company believes its competitive advantages include convenient locations, the quality of service it provides its customers, competitive pricing, product variety, quality and a pleasant shopping environment, which is enhanced by its ongoing modernization program.\nBy concentrating its operations within a relatively small geographic region, the Company is also positioned to monitor its markets and the needs of its customers more carefully within those markets. The Companys senior executives live and work in the Companys operating region, thereby allowing management to quickly identify changes in needs and customer preference. Because of the Companys size, store managers have direct access to senior corporate management and can receive quick decisions regarding requested changes in operations. The Company can then move quickly to adjust its business in response to changes in the market and customer needs.\nThe Companys management monitors competitive activity and regularly reviews and periodically adjusts the Companys marketing and business strategies as management deems appropriate considering existing conditions in the Companys region. The Companys ability to remain competitive in its changing markets will depend in part on its ability to pursue its expansion and renovation programs and its response to remodeling and new store openings by its competitors.\nSeasonality\nSales in the grocery segment of the Companys business are subject to slight seasonal variances due to holiday related sales and sales during portions of the year in which customers return to seasonal homes. Sales are traditionally higher in the Companys first fiscal quarter due to the inclusion of sales related to Thanksgiving and Christmas. The Companys second fiscal quarter traditionally has the lowest sales of the year, unless Easter falls in that quarter. In the third and fourth quarters, sales are affected by the return of customers to seasonal homes in the Companys market area.\nThe Companys fluid dairy operations have a slight seasonal variation to the extent of its sales into the grocery industry. The Companys real estate operations are not subject to seasonal variations.\nHuman Capital\nAt September 30, 2023, the Company had approximately 26,420 associates, of which 93% were supermarket personnel. Approximately 56% of supermarket personnel work on a part-time basis. Management considers labor relations to be good. The Company values its associates and believes that associate loyalty and enthusiasm are key elements of its operating performance. The Company has responded to the tight labor market by increasing resources devoted to associate recruitment and retention, and by expanding the ways in which it markets itself to prospective associates; however, competition for labor has become more intense, resulting in higher costs to attract and retain associates.\nThe Company has various programs to ensure adequate store staffing levels at any given time during the week. Store managers are given tools to assist in scheduling and levels of staffing. We provide flexible scheduling to accommodate the needs of our full and part-time associates, and we also provide incentives for associates based on the achievement of operating and safety goals. The Company has made technology investments to allow efficient remote work environments for associates that do not work in our stores or distribution center.\nTrademarks and Licenses\nThe Company employs various trademarks and service marks in its business, the most important of which are its own Laura Lynn and Harvest Farms private label trademarks, The Ingles Advantage service mark, and the Ingles service mark. These service\nmarks and the trademarks are federally registered in the United States pursuant to applicable intellectual property laws and are the property of Ingles. The Company believes it has all material licenses and permits necessary to conduct its business.\nThe current expiration dates for significant trade and service marks are as follows: Ingles - December 9, 2025; Laura Lynn - March 13, 2024; Harvest Farms Organic - August 5, 2024; and The Ingles Advantage - August 30, 2025. Each registration may be renewed for an additional ten-year term prior to its expiration. The Company intends to timely file all renewals. Each of the Companys trademark license agreements has a one year term which, with respect to one license, is automatically renewed annually, unless the owner of the trademark provides notice of termination prior to the expiration date and, with respect to the other licenses, are renewed periodically by letter from the licensor.\nEnvironmental Matters\nUnder applicable environmental laws, the Company may be responsible for remediation of environmental conditions and may be subject to associated liabilities relating to its stores and other buildings and the land on which such stores and other buildings are situated (including responsibility and liability related to its operation of its gas stations and the storage of fuel in underground storage tanks), regardless of whether the Company leases or owns the stores, other buildings or land in question and regardless of whether such environmental conditions were created by the Company or by a prior owner or tenant. The presence of contamination from hazardous or toxic substances, or the failure to properly remediate such contaminated property, may adversely affect the Companys ability to sell or rent such real property or to borrow using such real property as collateral. The Company typically conducts an environmental review prior to acquiring or leasing new stores, other buildings or raw land.\nFederal, state and local governments could enact laws or regulations concerning environmental matters that affect the Companys operations or facilities or increase the cost of producing or distributing the Companys products. The Company believes that it currently conducts its operations, and in the past has conducted its operations, in substantial compliance with applicable environmental laws. The Company, however, cannot predict the environmental liabilities that may result from legislation or regulations adopted in the future, the effect of which could be retroactive. Nor can the Company predict how existing or future laws and regulations will be administered or interpreted or what environmental conditions may be found to exist at its facilities or at other properties where the Company or its predecessors have arranged for the disposal of hazardous substances.\nThe Company strives to employ sound environmental operating policies, including recycling packaging, recycling wooden pallets, and re-circulating some water used in its car washes. The Company offers reusable shopping bags to its customers and will pack groceries in bags brought in by its customers. The Companys store modernization plans include energy efficient lighting and refrigeration equipment.\nGovernment Regulation\nThe Company is subject to regulation by a variety of governmental agencies, including, but not limited to, the U.S. Food and Drug Administration, the U.S. Department of Agriculture, the Occupational Safety and Health Administration, and other federal, state and local agencies. The Companys stores are also subject to local laws regarding zoning, land use and the sale of alcoholic beverages and tobacco products. The Company believes that its locations are in material compliance with such laws and regulations. The Company is not aware of any proposed regulations that would materially affect the Companys business, financial condition, or results of operations. Item 1A. RISK FACTORS\nBelow is a series of risk factors that may materially affect the Companys business, financial condition and results of operation. The Company operates in a continually changing business environment, and new risk factors emerge from time to time. The following information should be read together with other information contained in this Annual Report on Form 10-K, including the consolidated financial statements and the notes thereto and Managements Discussion and Analysis of Financial Condition and Results of Operations.\nRisks Related to Our Business and Industry\nThe Companys warehouse and distribution center and milk processing and packaging plant, as well as all of the Companys stores, are concentrated in the Southeastern United States, which makes it vulnerable to economic downturns, natural disasters and other adverse conditions or other catastrophic events in this region.\nThe Company operates in the southeastern United States, and its performance is therefore heavily influenced by economic developments in the Southeast region. The Companys headquarters, warehouse and distribution center and milk processing and packaging plant are located in North Carolina and all of the Companys stores are located in the Southeast region. As a result, the Companys business may be more susceptible to regional factors than the operations of more geographically diversified competitors. These factors include, among others, changes in the economy, weather conditions, demographics and population.\nVarious aspects of the Companys business are subject to federal, state and local laws and various operating regulations. The Companys compliance with these regulations may require additional capital expenditures and could adversely affect the Companys ability to conduct the Companys business as planned.\nThe Company is subject to federal, state and local laws and regulations relating to zoning, land use, workplace safety, public health, community right-to-know, beer and wine sales, country of origin labeling of food products, pharmaceutical sales and fuel station operations. Furthermore, the Companys business is regulated by a variety of governmental agencies, including, but not limited to, the U.S. Food and Drug Administration, the U.S. Department of Agriculture, and the Occupational Safety and Health Administration. Employers are also subject to laws governing their relationship with employees, including minimum wage requirements, overtime, working conditions, insurance coverage, disabled access, and work permit requirements. Recent and proposed regulation has had or may have a future impact on the cost of insurance benefits for associates and on the cost of processing debit and credit card transactions. Compliance with, or changes in, these laws could reduce the revenue and profitability of the Companys supermarkets and could otherwise adversely affect the Companys business, financial condition or results of operations.\nThe Company is affected by certain operating costs which could increase or fluctuate considerably.\nThe Company depends on qualified associates to operate the Companys stores. A shortage of qualified associates could require the Company to enhance the Companys wage and benefit package in order to better compete for and retain qualified associates, and the Company may not be able to recover these increased labor costs through price increases charged to customers, which could significantly increase the Companys operating costs.\nThe Company is self-insured for workers compensation, general liability and group medical and dental benefits. Risks and uncertainties are associated with self-insurance; however, the Company has limited its exposure by maintaining excess liability coverage. Self-insurance liabilities are established based on claims filed and estimates of claims incurred but not reported. The estimates are based on data provided by the respective claims administrators and analyses performed by actuaries engaged by the Company. These estimates can fluctuate if historical trends are not predictive of the future. The majority of the Companys properties are self-insured for casualty losses and business interruption; however, liability coverage is maintained.\nEnergy and utility costs have been volatile in recent years. The Company attempts to increase its energy efficiency during store construction and remodeling using energy-saving equipment and construction.\nOur business, financial condition and results of operations may be materially adversely affected by a resurgence of the COVID-19\npandemic.\nThe unprecedented global outbreak of the novel coronavirus (COVID-19) that began in the first quarter of 2020 has adversely impacted economic activity and conditions worldwide, including workforces, liquidity, capital markets, consumer behavior, supply chains and macroeconomic conditions. While the COVID-19 pandemic was officially declared to have ended in May 2023,and while the direct effects of the COVID-19 pandemic on our business have significantly lessened during the fiscal year ended September 30, 2023, some effects have continued through the fiscal year ended September 30, 2023, and we may continue to be impacted by the continuing effects of the COVID-19 pandemic, including resurgences and variants of COVID-19 or outbreaks of any new viruses or contagions. These impacts may include difficulties and delays in sourcing, transporting and stocking products: inabilities to staff our stores and warehouse and distribution facilities at adequate levels to conduct our operations, resulting in store closures or operating hour reductions; and incurring significant costs in support of our front-line store team members for enhanced benefits, safety measures and government-mandated wage increases.\nThe extent to which a future COVID-19 outbreak could impact our business and operating results in the future depends on future developments that are highly uncertain and cannot be accurately predicted, including new information that may emerge concerning COVID-19 and variants of the virus and the actions to contain or treat their impact, as well as the impact of any new federal, state and local mandates or other regulations associated with COVID-19.\nThe Company is subject to risks related to information systems and data security.\nThe Companys business is dependent on information technology systems. These complex systems are an important part of ongoing operations. If the Company were to experience disruption in these systems, did not maintain existing systems properly, or did not implement new systems appropriately, operations could suffer. The Company is currently undergoing a systematic program to enhance its information technology abilities.\nThe Company has implemented procedures to protect its information technology systems and data necessary to conduct ongoing operations. The Company cannot, however, be certain that all these systems and data are entirely free from vulnerability to attack.\nCompliance with tougher privacy and information security laws and standards, including protection of customer debit and credit card information, may result in higher investments in technology and changes to operational processes.\nIn recent years, more industry transactions have been online for ordering and fulfillment. This trend places a higher reliance on effective and efficient information systems.\nThe Company is affected by the availability and wholesale price of fuel and retail fuel prices, all of which can fluctuate quickly and considerably.\nThe Company operates fuel stations at 108 of its store locations. While the Company obtains gasoline and diesel fuel from several different suppliers, long-term disruption in the availability and wholesale price of fuel for resale could have a material adverse effect on the Companys business, financial condition and/or results of operations.\nFluctuating fuel costs could adversely affect the Companys operating costs which depend on fuel for the Companys fleet of tractors and trailers which distribute goods from the Companys distribution facility and for the Companys fluid dairy operations.\nFurthermore, fluctuating fuel costs could have an adverse effect on the Companys total fuel sales (both in terms of dollars and gallons sold), the profitability of fuel sales, and the Companys plans to develop additional fuel centers. Also, retail gas price volatility could diminish customer usage of fueling centers and, thus, adversely affect customer traffic at the Companys stores.\nThe Companys industry is highly competitive. If the Company is unable to compete effectively, the Companys financial condition and results of operations could be materially affected.\nThe supermarket industry is highly competitive and continues to be characterized by intense price competition, increasing fragmentation of retail formats, entry of non-traditional competitors (both physical and online) and market consolidation. Furthermore, some of the Companys competitors have greater financial resources and could use these financial resources to take measures, such as altering product mix, reducing prices, home/in-store fulfillment, or online ordering which could adversely affect the Companys competitive position.\nDisruptions in the efficient distribution of food products to the Companys warehouse and stores may adversely affect the Companys business.\nThe Companys business could be adversely affected by disruptions in the efficient distribution of food products to the Companys warehouse and stores. Such disruptions could be caused by, among other things, adverse weather conditions, fuel availability, shortage of truck drivers, food contamination recalls and civil unrest in foreign countries in which the Companys suppliers do business.\nThe Companys operations are subject to economic conditions that impact consumer spending.\nThe Companys results of operations are sensitive to changes in overall economic conditions that impact consumer spending, including discretionary spending. Future economic conditions such as employment levels, business conditions, interest rates, energy and fuel costs and tax rates could reduce consumer spending or change consumer purchasing habits. A general reduction in the level of consumer spending or the Companys inability to respond to shifting consumer attitudes regarding products, store location and other factors could adversely affect the Companys business, financial condition and/or results of operations.\nInflation could impact the Companys operations.\nThe following table from the United States Bureau of Labor Statistics lists annualized changes in the Consumer Price Index that could have an effect on the Companys operations. One of the Companys significant costs is labor, which increases with general inflation. Inflation or deflation in energy costs affects the Companys fuel sales, distribution expenses and plastic supply costs. During fiscal year 2023, inflation reached its highest level in a number of years, impacting food costs, transportation costs, and labor costs.\nTwelve Months Ended\nSeptember 30,\nSeptember 24,\nAll items\n3.7\n%\n8.2\n%\nFood at home\n2.4\n%\n13.0\n%\nEnergy\n(0.5)\n%\n19.8\n%\nRisk Related to Ownership of Our Common Stock\nThe Companys principal stockholder, Robert P. Ingle II, has the ability to elect a majority of the Companys directors, appoint new members of management and approve many actions requiring stockholder approval.\nMr. Ingle IIs beneficial ownership represented approximately 72.2% of the combined voting power of all classes of the Companys capital stock as of September 30, 2023. As a result, Mr. Ingle II has the power to elect a majority of the Companys directors and approve any action requiring the approval of the holders of the Companys Class A Common Stock and Class B Common Stock, including adopting certain amendments to the Companys charter and approving mergers or sales of substantially all of the Companys assets. Beneficial ownership is calculated in accordance with Rule 13d-3 promulgated under the Exchange Act.\nThe Company is a controlled company under NASDAQ Rules. As a result, the Company is exempt from certain of NASDAQs corporate governance policies, including the requirements that the majority of Directors be independent (as defined in NASDAQ Rules), and that the Company have a nominating committee for Director candidates. Item 1B. UNRESOLVED STAFF COMMENTS\nNone.\nItem 1C. CYBERSECURITY\nNot currently applicable. Item 2. PROPERTIES\nOwned Properties\nThe Company owns 167 of its supermarkets either as free-standing locations or in shopping centers where it is the anchor tenant. The Company also owns 29 undeveloped sites which are suitable for a free-standing store or shopping center development. The Company owns numerous outparcels and other acreage located adjacent to the shopping centers and supermarkets it owns. Real estate owned by the Company is generally located in the same geographic regions as its supermarkets.\nThe shopping centers owned by the Company contain an aggregate of 8.6 million square feet of leasable space, of which 4.1 million square feet is used by the Companys supermarkets. The remainder of the leasable space in these shopping centers is leased or held for lease by the Company to third-party tenants. A breakdown by size of the shopping centers owned and operated by the Company is as follows:\nSize\nNumber\nLess than 50,000 square feet\n50,000 - 100,000 square feet\nMore than 100,000 square feet\nTotal\nThe Company owns a 1,649,000 square foot facility, which is strategically located between Interstate 40 and Highway 70 near Asheville, North Carolina, as well as the 119 acres of land on which it is situated. The facility includes the Companys headquarters and its warehouse and distribution facility. The property also includes truck servicing and fuel storage facilities. The Company also owns a 139,000 square foot warehouse on 21 acres of land approximately one mile from its main warehouse and distribution facility.\nThe Companys milk processing and packaging subsidiary, Milkco, Inc., owns a 140,000 square foot manufacturing and storage facility in Asheville, North Carolina. In addition to the plant, the 20-acre property includes truck cleaning and fuel storage facilities.\nCertain long-term debt of the Company is secured by the owned properties. See Note 7, Long-Term Debt to the Consolidated Financial Statements of this Annual Report on Form 10-K for further details.\nLeased Properties\nThe Company operates supermarkets at 31 locations leased from various unaffiliated third parties. The Company has six owned store buildings that are on ground leases. The Company leases one other former supermarket location, which is subleased to a third party. The majority of these leases require the Company to pay property taxes, utilities, insurance, repairs and certain other expenses incidental to occupation of the premises. In addition to base rent, most leases contain provisions that require the Company to pay additional percentage rent (ranging from 0.75% to 1.50%) if sales exceed a specified amount.\nRental rates generally range from $3.00 to $7.77 per square foot. During fiscal 2023, 2022 and 2021, the Company paid cash supermarket rent of $9.4 million, $10.0 million and $10.3 million, respectively. These amounts exclude property taxes, utilities, insurance, repairs, other expenses, and non-cash rent adjustments. The following table summarizes lease expiration dates as of September 30, 2023, with respect to the initial and any renewal option terms of leased supermarkets properties:\nYear of Expiration\nNumber of\n(Including Renewal Terms)\nLeases Expiring\n2023-2034\n2035-2049\n2050 or after\nManagement believes that the long-term rent stability provided by these leases is a valuable asset of the Company.\n‎ Item 3. LEGAL PROCEEDINGS\nVarious legal proceedings and claims arising in the ordinary course of business are pending against the Company. In the opinion of management, the ultimate liability, if any, from all pending legal proceedings and claims would not materially affect the Companys business, financial condition, results of operations or cash flows. Item 4. MINE SAFETY DISCLOSURES\nNot applicable.\nPART II Item 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS, AND ISSUER PURCHASES OF EQUITY SECURITIES\nMarket Information\nThe Company has two classes of Common Stock: Class A and Class B. Class A Common Stock is listed on The NASDAQ Global Select Market under the symbol IMKTA. There is no public market for the Companys Class B Common Stock. Under the terms of the Companys Articles of Incorporation, a holder of Class B Common Stock may convert any or all of the holders shares of Class B Common Stock into an equal number of shares of Class A Common Stock at any time. For additional information regarding the voting powers, preferences and relative rights of the Class A Common Stock and Class B Common Stock, please see Note 8, Stockholders Equity to the Consolidated Financial Statements contained in this Annual Report on Form 10-K.\nAs of November 27, 2023, there were approximately 315 holders of record of the Companys Class A Common Stock and 90 holders of record of the Companys Class B Common Stock.\nDividends\nThe Company has paid cash dividends on its Common Stock in each of the past 39 fiscal years, except for the 1984 fiscal year when the Company paid a 3% stock dividend. During both fiscal 2023 and fiscal 2022, the Company paid annual dividends totaling $0.66 per share of Class A Common Stock and $0.60 per share of Class B Common Stock, paid in quarterly installments of $0.165 and $0.15 per share, respectively. The Companys last dividend payment was made on October 19, 2023 to common stockholders of record on October 12, 2023. For additional information regarding the dividend rights of the Class A Common Stock and Class B Common Stock, please see Note 8, Stockholders Equity to the Consolidated Financial Statements of this Annual Report on Form 10-K.\nThe Company expects to continue paying regular cash dividends on a quarterly basis. However, the Board of Directors periodically reconsiders the declaration of dividends. The Company pays these dividends at the discretion of the Board of Directors. The continuation of these payments, the amount of such dividends, and the form in which the dividends are paid (cash or stock) depends upon the results of operations, the financial condition of the Company and other factors which the Board of Directors deems relevant. The payment of cash dividends is also subject to restrictions contained in certain financing arrangements. Such restrictions are summarized in Note 7, Long-Term Debt to the Consolidated Financial Statements of this Annual Report on Form 10-K.\nRepurchase of Equity Securities\nNone.\nStock Performance Graph\nSet forth below are a graph and accompanying table comparing the five-year cumulative total stockholder return on the Class A Common Stock with the five-year cumulative total return of (i) the S&P 500 Comprehensive-Last Trading Day Index and (ii) a peer group of companies in the Company's line of business. The 2023 peer group consists of the following companies: Koninklijke Ahold Delhaize N.V., Weis Markets, Inc., The Kroger Co., Supervalu Inc., SpartanNash Co., Sprouts Farmers Markets, Inc., and Village Super Market, Inc.\nThe comparisons cover the five-years ended September 30, 2023 and assume that $100 was invested after the close of the market on September 29, 2018, and that dividends were reinvested quarterly. Returns of the companies included in the peer group reflected below have been weighted according to each companys stock market capitalization at the beginning of each section for which a return is presented.\nINGLES MARKETS, INCORPORATED\n‎COMPARATIVE RETURN TO STOCKHOLDERS\n‎\nINDEXED RETURNS OF INITIAL $100 INVESTMENT*\nCompany/Index\nIngles Markets, Incorporated Class A Common Stock\n$\n115.89\n$\n110.67\n$\n201.35\n$\n253.47\n$\n235.26\nS&P 500 Comprehensive - Last Trading Day Index\n$\n104.25\n$\n120.05\n$\n156.07\n$\n131.92\n$\n160.44\nPeer Group\n$\n100.62\n$\n128.92\n$\n152.76\n$\n150.51\n$\n168.35\n*Assumes $100 invested in the Class A Common Stock of Ingles Markets, Incorporated after the close of the market on September 29, 2018.\nThe foregoing stock performance information, including the graph, shall not be deemed to be soliciting material or to be filed with the Securities and Exchange Commission. Item 6. [Reserved] Item 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nOverview\nIngles is a leading supermarket chain in the Southeast United States and operates a total of 198 supermarkets in North Carolina (75), Georgia (65), South Carolina (35), Tennessee (21), Virginia (1) and Alabama (1). Ingles supermarkets offer customers a wide variety of nationally advertised food products, including grocery, meat and dairy products, produce, frozen foods and other perishables and non-food products. Non-food products include fuel centers, pharmacies, health/beauty/cosmetic products and general merchandise. The Company offers quality private label items in most of its departments. In addition, the Company focuses on selling products to its customers through the development of certified organic products, bakery departments and prepared foods including delicatessen sections. As of September 30, 2023, the Company operated 114 in-store pharmacies and 108 fuel stations. Ingles also operates a fluid dairy and earns shopping center rentals.\nCritical Accounting Policies and Estimates\nCritical accounting policies are those accounting policies that management believes are important to the presentation of Ingles financial condition and results of operations, and require managements most difficult, subjective or complex judgments, often as a result of the need to estimate the effect of matters that are inherently uncertain. Estimates are based on historical experience and other factors believed to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Management estimates, by their nature, involve judgments regarding future uncertainties, and actual results may therefore differ materially from these estimates.\nSelf-Insurance\nThe Company is self-insured for workers compensation, general liability, and group medical and dental benefits. Risks and uncertainties are associated with self-insurance; however, the Company has limited its exposure by maintaining excess liability coverage of $1,000,000 per occurrence for workers compensation and for general liability, and $500,000 per covered person for medical care benefits for a policy year. Self-insurance liabilities are established based on claims filed and estimates of claims incurred but not reported. The estimates are based on data provided by the respective claims administrators which is then applied to appropriate actuarial methods. These estimates can fluctuate if historical trends are not predictive of the future. The majority of the Companys properties are self-insured for casualty losses and business interruption; however, liability coverage is maintained. The Companys self-insurance reserves totaled $32.9 million and $31.0 million for employee group insurance, workers compensation insurance and general liability insurance at September 30, 2023 and September 24, 2022, respectively. These amounts were inclusive of expected recoveries from excess cost insurance or other sources that are recorded as receivables of $4.3 million at September 30, 2023 and $4.0 million at September 24, 2022.\nAsset Impairments\nThe Company accounts for the impairment of long-lived assets in accordance with Financial Accounting Standards Board Accounting Standards Codification (FASB ASC) Topic 360. Asset groups are primarily comprised of our individual store and shopping center properties. For assets to be held and used, the Company tests for impairment using undiscounted cash flows and calculates the amount of impairment using discounted cash flows. For assets held for sale, impairment is recognized based on the excess of remaining book value over expected recovery value. The recovery value is the fair value as determined by independent quotes or expected sales prices developed by internal associates, net of costs to sell. Estimates of future cash flows and expected sales prices are judgments based upon the Companys experience and knowledge of local operations and cash flows that are projected for several years into the future. These estimates can fluctuate significantly due to changes in real estate market conditions, the economic environment, capital\nspending decisions and inflation. The Company monitors the carrying value of long-lived assets for potential impairment each quarter based on whether any indicators of impairment have occurred.\nVendor Allowances\nThe Company receives funds for a variety of merchandising activities from the many vendors whose products the Company buys for resale in its stores. These incentives and allowances are primarily composed of volume or purchase based incentives, advertising allowances, slotting fees, and promotional discounts. The purpose of these incentives and allowances is generally to help defray the costs incurred by the Company for stocking, advertising, promoting and selling the applicable vendors products. These allowances generally relate to short term arrangements with vendors, often relating to a period of one month or less and are negotiated on a purchase-by-purchase or transaction-by-transaction basis. Whenever practical, vendor discounts and allowances that relate to buying and merchandising activities are recorded as a reduction of item cost in inventory and recognized in merchandise costs when the item is sold. Due to the use of the retail method for store inventory and the nature of certain allowances, it is sometimes not practicable to apply allowances to the item cost of inventory. In those instances, the allowances are applied as a reduction of merchandise costs using a rational and systematic methodology, which results in the recognition of these incentives when the inventory related to the vendor consideration received is sold. Vendor allowances applied as a reduction of merchandise costs totaled $128.9 million, $110.6 million and $116.3 million for the fiscal years ended September 30, 2023, September 24, 2022, and September 25, 2021, respectively. Vendor advertising allowances that represent a reimbursement of specific identifiable incremental costs of advertising the vendors specific products are recorded as a reduction to the related expense in the period that the related expense is incurred. Vendor advertising allowances recorded as a reduction of advertising expense totaled $8.5 million, $7.1 million, and $8.1 million for the fiscal years ended September 30, 2023, September 24, 2022, and September 25, 2021, respectively.\nIf vendor advertising allowances were substantially reduced or eliminated, the Company would likely consider other methods of advertising as well as the volume and frequency of the Companys product advertising, which could increase or decrease the Companys expenditures.\nSimilarly, the Company is not able to assess the impact of vendor advertising allowances on creating additional revenue, as such allowances do not directly generate revenue for the Companys stores.\nResults of Operations\nFiscal Year\nIngles operates on a 52- or 53-week fiscal year ending on the last Saturday in September. The consolidated statements of income for the fiscal year ended September 30, 2023 had 53 weeks. The consolidated statements of income for fiscal years September 24, 2022, and September 25, 2021 each consisted of 52 weeks of operations.\nComparable Store Sales\nComparable store sales are defined as sales by grocery stores in operation for five full fiscal quarters. The Company has an ongoing renovation and expansion plan to modernize the appearance and layout of its existing stores. Sales from replacement stores, major remodels and the addition of fuel stations to existing stores are included in the comparable store sales calculation from the date of completion of the replacement, remodel or addition. A replacement store is a newly opened store that replaces an existing nearby store that is closed. A major remodel entails substantial remodeling of an existing store and may include additional retail square footage. Comparable store sales for the fiscal year ended September 30, 2023, included 198 stores and, for the fiscal year ended September 24, 2022, comparable store sales included 197 stores.\nThe following table sets forth, for the periods indicated, selected financial information as a percentage of net sales.\nFiscal Year Ended September\nNet sales\n100.0%\n100.0%\n100.0%\nGross profit\n23.8\n24.9\n26.1\nOperating and administrative expenses\n18.9\n18.3\n19.3\nGain from sale or disposal of assets\n0.1\n-\n0.2\nIncome from operations\n5.0\n6.6\n7.0\nOther income, net\n0.2\n-\n0.1\nInterest expense\n0.4\n0.4\n0.5\nIncome before income taxes\n4.8\n6.4\n6.6\nIncome tax expense\n1.2\n1.6\n1.6\nNet income\n3.6\n4.8\n5.0\nFiscal Year Ended September 30, 2023 Compared to the Fiscal Year Ended September 24, 2022\nNet income for the fiscal year ended September 30, 2023 was $210.8 million, compared with net income of $272.8 million for the fiscal year ended September 24, 2022. Comparisons of fiscal year 2023 to fiscal year 2022 are affected by the difference in the number of weeks in each year. Fiscal year 2023 had 53 weeks and fiscal year 2022 had 52 weeks. Net income as a percentage of sales was 3.6% for fiscal year 2023 compared with 4.8% for fiscal year 2022. Inflation in the cost of goods and increases in operating expenses due to the competition in the labor market contributed to this decrease.\nNet Sales. Net sales for the fiscal year ended September 30, 2023 totaled $5.89 billion, compared with $5.68 billion for the fiscal year ended September 24, 2022.\nIn fiscal years with 53 weeks, such as 2023, management analyzes comparable stores sales for the 53 weeks of the year with the corresponding 52 calendar weeks of the previous year plus one additional week. On this basis, retail grocery comparable store sales excluding fuel increased 4.0% for fiscal 2023 compared with 2022. The number of transactions (excluding fuel) increased 2.9% while the average transaction size (excluding fuel) increased by 0.9%. Comparing fiscal 2023 with 2022, fuel gallons sold decreased 0.4% and per gallon fuel prices decreased 10.2%.\nSales by product category for the fiscal years ended September 30, 2023 and September 24, 2022 were as follows:\nFiscal Year Ended September\n(dollars in thousands)\nGrocery\n$\n2,062,416\n$\n1,940,414\nNon-foods\n1,326,907\n1,204,443\nPerishables\n1,482,089\n1,445,042\nFuel\n792,524\n885,801\nTotal retail grocery\n$\n5,663,936\n$\n5,475,700\nThe Grocery category includes grocery, dairy and frozen foods.\nThe Non-foods category includes alcoholic beverages, tobacco, pharmacy, and health/beauty/cosmetic products.\nThe Perishables category includes meat, produce, deli and bakery.\nChanges in retail grocery sales for the fiscal year ended September 30, 2023 are summarized as follows (in thousands):\nTotal retail grocery sales for the fiscal year ended September 24, 2022\n$\n5,475,700\nComparable store sales increase\n75,615\nEffect of 53rd week\n106,715\nSales growth from stores opened fiscal 2023\n3,099\nOther\n2,807\nTotal retail grocery sales for the fiscal year ended September 30, 2023\n$\n5,663,936\nIncreased sales for fiscal year 2023 were due to comparable store sales through enhanced loyalty programs and special offers, as well as the additional 53rd week in fiscal year 2023.\nGross Profit. Gross profit for the fiscal year ended September 30, 2023 decreased $10.9 million, or 0.77%, to $1.40 billion compared with $1.42 billion for the fiscal year ended September 24, 2022. As a percentage of sales, gross profit totaled 23.8% for the fiscal year ended September 30, 2023 as compared to 24.9% for the fiscal year ended September 24, 2022.\nRetail grocery gross profit as a percentage of total sales (excluding fuel) decreased 182 basis points in fiscal year 2023 compared with fiscal year 2022. The gross margin decrease was primarily due to inflation and supply chain factors that impacted prices and mix of products sold. In addition to the direct product cost, the cost of goods sold line item for the grocery segment includes inbound freight charges, which generally increased in fiscal year 2023 as compared to fiscal year 2022, and increased costs related to the Companys distribution network, including the impact of higher diesel prices.\nOperating and Administrative Expenses. Operating and administrative expenses increased $75.2 million, or 7.2%, to $1.1 billion for the fiscal year ended September 30, 2023, from $1.0 billion for the fiscal year ended September 24, 2022. As a percentage of sales, operating and administrative expenses were 18.9% and 18.3% for fiscal years 2023 and 2022, respectively. Excluding fuel, which does not have significant direct operating expenses, the ratio of operating expenses to sales was 21.7% for fiscal year 2023 compared with 21.5% for fiscal year 2022.\nA breakdown of the major increases and (decreases) in operating and administrative expenses is as follows.\nIncrease\nIncrease\n(decrease)\n(decrease)\nas a % of\n(in millions)\nsales\nSalaries and wages\n$\n55.2\n0.94\n%\nRepairs and maintenance\n$\n11.6\n0.20\n%\nAdvertising and promotion\n$\n(6.3)\n(0.11)\n%\nStore supplies\n$\n5.7\n0.10\n%\nSalaries and wages increased due to increased competition in the labor market in the Companys market area, in addition to the extra week of expense for the 53rd week.\nRepairs and maintenance increased due to higher refrigerant costs and the cost of other supply items, as well as increased wear and tear on equipment to accommodate sales volume, in addition to the extra week of expense for the 53rd week.\nAdvertising and promotion costs decreased due to absorbing some of the activity in-house and moving towards lower-cost types of advertising.\nStore supplies, which include customer packaging containers, increased as a result of increased sales, market costs of certain supplies, and supply chain issues for certain raw materials, in addition to the extra week of expense for the 53rd week.\nGain from Sale or Disposal of Assets. Gains on sale or disposal of assets totaled $2.8 million for fiscal year 2023 and $1.4 million for fiscal year 2022.\nOther Income, Net. Other income, net totaled $8.3 million and $5.8 million for the fiscal years ended September 30, 2023 and September 24, 2022, respectively. Other income consists primarily of interest earned and sales of waste paper and packaging.\nInterest Expense. Interest expense totaled $22.1 million for the fiscal year ended September 30, 2023 and $21.5 million for the fiscal year ended September 24, 2022. Total debt was $550.2 million at the end of fiscal year 2023 compared with $571.9 million at the end of fiscal year 2022.\nIncome Taxes. Income tax expense totaled $67.7 million for fiscal year 2023, reflecting an effective tax rate of 24.3%. This compares with an income tax expense totaling $88.5 million and an effective tax rate of 24.5% for fiscal year 2022.\nNet Income. Net income totaled $210.8 million for the fiscal year ended September 30, 2023 compared with net income of $272.8 million for the fiscal year ended September 24, 2022. Basic and diluted earnings per share for Class A Common Stock were $11.35 and $11.10, respectively, for the fiscal year ended September 30, 2023 compared with $14.69 and $14.36, respectively, for the fiscal year ended September 24, 2022. Basic and diluted earnings per share for Class B Common Stock were each $10.32 for the fiscal year ended September 30, 2023 compared with $13.35 of basic and diluted earnings per share for the fiscal year ended September 24, 2022.\nFiscal Year Ended September 24, 2022 Compared to the Fiscal Year Ended September 25, 2021\nSee Item 7. Managements Discussion and Analysis of Financial Condition and Results of Operations, in Ingles Annual Report on Form 10-K for the year ended September 24, 2022, filed with the SEC on November 23, 2022, for a discussion of the year ended September 24, 2022 as compared to September 25, 2021.\nLiquidity and Capital Resources\nCapital Expenditures\nThe Company believes that a key to its ability to continue to increase sales and develop a loyal customer base is providing conveniently located, clean and modern stores which provide customers with good service and an increasingly diverse selection of competitively priced products. As such, the Company has invested and plans to continue to invest significant amounts of capital toward the modernization of its store base. The Companys modernization program includes the opening of new stores, the completion of major remodels and expansion of selected existing stores, and the relocation of selected existing stores to larger, more convenient locations.\nCapital expenditures totaled $173.6 million and $119.6 million for fiscal years 2023 and 2022, respectively, with the increase driven primarily by the purchase of new sites and land parcels. Major capital expenditures included the following:\nNew stores\nStore sites/land parcels purchased\nNew fuel stations added\nCapital expenditures include upgrading and replacing store equipment, technology investments, those related to the Companys distribution operation and its milk processing plant, and expenditures for stores to open in subsequent fiscal years.\nIngles capital expenditure plans for fiscal year 2024 include investments of approximately $120 to $170 million. The Company currently plans to dedicate the majority of its fiscal 2024 capital expenditures to continued improvement of its store base, as well as technology improvements, upgrading and replacing existing store, warehouse and transportation equipment and improvements to the Companys milk processing plant.\nThe Company currently expects that its net annual capital expenditures will be in the range of approximately $100 to $160 million going forward in order to maintain a modern store base. Among other things, planned expenditures for any given future fiscal year will be affected by the availability of financing, which can affect both the number of projects pursued at any given time and the cost of those projects. The number of projects may also fluctuate due to the varying costs of the types of projects pursued including new stores, major store remodels/expansions, and build-out of tenant space under the long-term leases. The Company makes decisions on the allocation of capital expenditure dollars based on many factors including the competitive environment, other Company capital initiatives and its financial condition.\nIn general, the Company finances its capital expenditures to the extent possible from cash on hand and cash flow from operations. Additional financing sources for capital expenditures could include borrowings under the Companys $150 million of committed line of credit (described below), other borrowings that could be collateralized by unencumbered real property and equipment with a net book value of approximately $1.2 billion, and the public debt or equity markets. The Company has used each of these to finance past capital expenditures and expects to have them available in the future.\nThe Company does not generally enter into commitments for capital expenditures other than on a store-by-store basis at the time it begins construction on a new store or begins a major or minor remodeling project. Construction commitments at September 30, 2023 totaled $3.0 million.\nLiquidity\nThe Company generated $266.4 million of cash from operations in fiscal 2023 compared with $339.5 million for fiscal year 2022. The decrease resulted primarily from a $61.9 million decrease in net income for fiscal year 2023 compared with fiscal 2022.\nCash used by investing activities for fiscal year 2023 totaled $170.1 million compared with $112.0 million for fiscal year 2022. The Companys most significant investing activity is capital expenditures, which increased in fiscal year 2023 as compared to fiscal year 2022.\nThe Companys cash used by net financing activities totaled $35.0 million and $30.6 million for fiscal years 2023 and 2022, respectively.\nThe U.S. Dollar LIBOR panel ceased following June 30, 2023, and the Companys debt agreements and interest rate swaps that utilized LIBOR discontinued the use of LIBOR and adopted the Secured Overnight Financing Rate (SOFR).\nIn June 2021, the Company issued at par $350.0 million aggregate principal amount of 4.00% senior notes due 2031 (the 2031 Notes) and used a portion of the proceeds to redeem the remaining outstanding $295.0 million principal amount of the Companys 5.75% senior notes due.\nThe Company has a $150.0 million unsecured senior line of credit (the Line) that matures in June 2026. The Line provides the Company with various interest rate options based on the prime rate, the Federal Funds Rate, or SOFR. The Line allows the Company to issue up to $10.0 million in letters of credit, of which none were issued at September 30, 2023. The Company is not required to maintain compensating balances in connection with the Line. At September 30, 2023, the Company had no borrowings outstanding under the Line.\nIn December 2010, the Company completed the funding of $99.7 million of Recovery Zone Facility Bonds (the Bonds) for the construction of new warehouse and distribution space adjacent to its existing space in Buncombe County, North Carolina (the Project). The final maturity date of the Bonds is January 1, 2036.\nUnder a Continuing Covenant and Collateral Agency Agreement (the Covenant Agreement) between certain financial institutions and the Company, such financial institutions hold the Bonds until December 2029, subject to certain events. Mandatory redemption of the Bonds by the Company in the annual amount of $4.5 million began on January 1, 2014. The outstanding aggregate principal amount of the Bonds was $54.4 million at September 30, 2023. The Company may redeem the Bonds without penalty or premium at any time prior to December 17, 2029.\nIn September 2017, the Company refinanced approximately $60 million of secured borrowing obligations with a SOFR-based amortizing floating rate loan secured by real estate, which matures in October 2027. The Company has an interest rate swap agreement for a current notional amount of $24.5 million at a fixed rate of 3.962%. Under this agreement, the Company pays monthly the fixed rate of 3.962% and receives the one-month SOFR plus 1.75%. The interest rate swap effectively hedges floating rate debt in the same\namount as the current notional amount of the interest swap. Both the floating rate debt and the interest rate swap have monthly principal amortization of $0.5 million and mature October 1, 2027.\nIn December 2019, the Company closed a $155 million SOFR-based amortizing floating rate loan secured by real estate, which matures in January 2030. The Company has an interest rate swap agreement for a current notional amount of $124.6 million at a fixed rate of 2.998%. Under this agreement, the Company pays monthly the fixed rate of 2.998% and receives the one-month SOFR plus 1.60%. The interest rate swap effectively hedges floating rate debt in the same amount as the current notional amount of the interest swap. Both the floating rate debt and the interest rate swap have monthly principal amortization of $0.65 million and mature in fiscal year 2030.\nThe fair market value of the interest rate swaps is measured quarterly with adjustments recorded in other comprehensive income.\nThe Companys long-term debt agreements generally have cross-default provisions which could result in the acceleration of payments due under the Companys Line, Bonds and 2031 Notes indenture in the event of default under any one instrument.\nThe Bonds and the Line contain provisions that under certain circumstances would permit the acceleration of the indebtedness under such instruments or would otherwise permit lending institutions to terminate or withdraw their respective extensions of credit to the Company. Included among the triggering factors permitting the termination or withdrawal of the Bonds and the Line to the Company are certain events of default, including both monetary and non-monetary defaults, the initiation of bankruptcy or insolvency proceedings, and the failure of the Company to meet certain financial covenants designated in its respective loan documents. As of September 30, 2023, the Company was in compliance with these covenants. Under the most restrictive of these covenants, the Company would have been permitted to incur approximately $1.8 billion of additional borrowings (including borrowings under the Line) as of September 30, 2023.\nThe Companys principal sources of liquidity are expected to be cash flow from operations, borrowings under the Line and long-term debt financing. The Company believes, based on its current results of operations and financial condition, that its financial resources, including cash balances, the existing Line, short- and long-term financing expected to be available to it and internally generated funds, will be sufficient to meet planned capital expenditures and working capital requirements for the foreseeable future, including any debt service requirements of additional borrowings. However, there can be no assurance that any such sources of financing will be available to the Company when needed on acceptable terms, or at all.\nIt is possible that, in the future, the Companys results of operations and financial condition will be different from that described in this Annual Report on Form 10-K based on a number of intangible factors. These factors may include, among others, resurgence of the COVID-19 pandemic virus, increased competition, changing regional and national economic conditions, adverse climatic conditions affecting food production and delivery and changing demographics as well as the additional factors discussed above and elsewhere under Item 1A. Risk Factors. It is also possible, for such reasons, that the results of operations from the new, expanded, remodeled and/or replacement stores will not meet or exceed the results of operations from existing stores that are described in this Annual Report on Form 10-K.\nQuarterly Cash Dividends\nSince December 27, 1993, the Company has paid regular quarterly cash dividends of $0.165 per share on its Class A Common Stock and $0.15 per share on its Class B Common Stock for an annual rate of $0.66 and $0.60 per share, respectively.\nThe Company expects to continue paying regular cash dividends on a quarterly basis. However, the Board of Directors periodically reconsiders the declaration of dividends. The Company pays these dividends at the discretion of the Board of Directors and the continuation of these payments, the amount of such dividends, and the form in which the dividends are paid (cash or stock) depends upon the results of operations, the financial condition of the Company and other factors which the Board of Directors deems relevant.\nCertain of the Companys long-term debt agreements contain various restrictive covenants requiring, among other things, minimum levels of net worth and maintenance of certain financial ratios. These covenants have the effect of restricting certain types of transactions, including the payment of cash dividends generally and in excess of current quarterly per share amounts.\nNew Accounting Pronouncements\nFor new accounting pronouncements, see Note 1 to the Consolidated Financial Statements included in this Annual Report on Form 10-K.\nOutlook and Trends in the Companys Markets\nThe COVID-19 pandemic that began in March 2020 substantially impacted supermarket operations during fiscal years 2020, 2021 and 2022. While the effects of the pandemic on the Company have eased considerably over the fiscal year ended September 30, 2023, some effects have continued through the year ended September 30, 2023, and we do not know how long and to what extent COVID-19 will impact our markets in fiscal year 2024.\nThe Company continually assesses and modifies its business model to meet the changing needs and expectations of its customers. In connection with this review, the Company assesses the trends present in the markets in which it competes. Generally, it is difficult to predict whether a trend will continue for a period of time and it is possible that new trends will develop which will affect an existing trend. The Company believes that the following trends are likely to continue for at least the next fiscal year:\nThe supermarket industry will remain highly competitive and will be characterized by industry consolidation, fragmented food retail platforms, and continued competition from super centers and other non-supermarket operators.\nTraditional supermarket products will be acquired by customers in new and diverse ways, including online ordering, home delivery and pre-picked for customer pickup.\nEconomic conditions will continue to affect customer behavior. Economic conditions may affect purchasing patterns with regard to meal replacement items, private label purchases, promotions and product variety.\nThe Company and its customers will continue to become more environmentally aware, evidenced by the Companys increased recycled waste paper and pallets and customers increased usage of reusable shopping bags.\nVolatile petroleum costs will impact utility and distribution costs, plastic supplies cost and may change customer shopping and dining behavior.\nRetail fuel costs and retail prices will continue to be volatile, affecting the Companys fuel sales and gross margin.\nThe Company plans to continue to focus on balancing sales growth and gross margin maintenance (excluding the effect of fuel sales) and will carefully monitor its product mix and customer trends. Item 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISKS\nThe Company is exposed to changes in interest rates primarily as a result of its borrowing activities, which include borrowings under the Line, real estate and equipment financing, and the bonds. The Line, along with cash flow from operations, is used to maintain liquidity and fund business operations. The 2031 Notes bear a fixed rate of interest and do not expose us to interest rate risk.\nThe nature and amount of the Companys debt may vary as a result of future business requirements, market conditions and other factors. The definitive extent of the Companys interest rate risk is not quantifiable or predictable because of the variability of future interest rates and business financing requirements, but the Company does not believe such risk is material.\nThe table below presents principal amounts and related weighted average rates by year of maturity for the Companys debt obligations at September 30, 2023 and September 24, 2022, respectively (in thousands):\nSeptember 30, 2023\nThereafter\nTotal\nFair\n‎Value\nLine of credit\n$\n-\n$\n-\n$\n-\n$\n-\n$\n-\n$\n-\n$\n-\n$\n-\nAverage variable interest rate\n-\n%\n-\n%\n-\n%\n-\n%\n-\n%\n-\n%\n-\n%\nLong-term debt, variable interest rate (1)(2)\n$\n13,750\n$\n13,750\n$\n13,750\n$\n13,750\n$\n8,237\n$\n87,833\n$\n151,070\n$\n151,070\nAverage interest rate\n6.99\n%\n6.99\n%\n6.99\n%\n6.99\n%\n6.94\n%\n6.93\n%\n6.95\n%\nRecovery Zone Bonds, variable interest rate\n$\n4,530\n$\n4,530\n$\n4,530\n$\n4,530\n$\n4,530\n$\n31,790\n$\n54,440\n$\n54,440\nAverage year-end interest rate\n5.20\n%\n5.20\n%\n5.20\n%\n5.20\n%\n5.20\n%\n5.20\n%\n5.20\n%\nSenior Notes, fixed interest rate\n$\n-\n$\n-\n$\n-\n$\n-\n$\n-\n$\n350,000\n$\n350,000\n$\n287,875\nAverage interest rate\n-\n%\n-\n%\n-\n%\n-\n%\n-\n%\n4.00\n%\n4.00\n%\nSeptember 24, 2022\nThereafter\nTotal\nFair\n‎Value\nLine of credit\n$\n-\n$\n-\n$\n-\n$\n-\n$\n-\n$\n-\n$\n-\n$\n-\nAverage variable interest rate\n-\n%\n-\n%\n-\n%\n-\n%\n-\n%\n-\n%\n-\n%\nLong-term debt, variable interest rate (1)(2)\n$\n13,750\n$\n13,750\n$\n13,750\n$\n13,750\n$\n13,750\n$\n96,083\n$\n164,833\n$\n164,833\nAverage year-end interest rate (1)(2)\n4.13\n%\n4.13\n%\n4.13\n%\n4.13\n%\n4.13\n%\n4.06\n%\n4.09\n%\nLong-term debt, fixed interest rate\n$\n$\n$\n4,002\n$\n-\n$\n-\n$\n-\n$\n4,188\n$\n4,185\nAverage interest rate\n4.40\n%\n4.40\n%\n4.40\n%\n-\n%\n-\n%\n-\n%\n4.40\n%\nRecovery Zone Bonds, variable interest rate\n$\n4,530\n$\n4,530\n$\n4,530\n$\n4,530\n$\n4,530\n$\n36,320\n$\n58,970\n$\n58,970\nAverage year-end interest rate\n2.94\n%\n2.94\n%\n2.94\n%\n2.94\n%\n2.94\n%\n2.94\n%\n2.94\n%\nSenior Notes, fixed interest rate\n$\n-\n$\n-\n$\n-\n$\n-\n$\n-\n$\n350,000\n$\n350,000\n$\n292,250\nAverage interest rate\n-\n%\n-\n%\n-\n%\n-\n%\n-\n%\n4.00\n%\n4.00\n%\n(1)Excludes interest rate swap that fixes at 3.962% the interest rate on $24.5 million of variable interest rate debt.\n(2)Excludes interest rate swap that fixes at 2.998% the interest rate on $124.6 million of variable interest rate debt.\nThe Company will occasionally utilize financial or derivative instruments for interest rate risk management but has typically not utilized highly leveraged financial instruments. On the basis of the fair value of the Companys market sensitive instruments at September 30, 2023, the Company does not consider the potential near-term losses in future earnings, fair values and cash flows from reasonably possible near-term changes in interest rates and exchange rates to be material. Item 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA\nThe Companys financial statements required by this item are set forth as a separate section of this Annual Report on Form 10-K and incorporated by reference in this Item 8. See Part IV, Item 15 of this Annual Report on Form 10-K. Item 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE.\nNone. Item 9A. CONTROLS AND PROCEDURES\nConclusion Regarding Disclosure Controls and Procedures\nThe Company maintains disclosure controls and procedures designed to provide reasonable assurance to achieve the objective that information in its Exchange Act reports is recorded, processed, summarized and reported within the time periods specified and pursuant to the regulations of the Securities and Exchange Commission. Disclosure controls and procedures, as defined in Rule 13a-15(e) and 15d-15(e) under the Exchange Act, include controls and procedures designed to ensure the information required to be disclosed by the Company in the reports it files or submits under the Exchange Act is accumulated and communicated to the Companys management, including its Chief Executive Officer and Chief Financial Officer, as appropriate, to allow timely decisions regarding required disclosure. It should be noted that the Companys system of controls and procedures, however well designed and operated, can provide only reasonable, and not absolute, assurance that the objectives of the system are met.\nAs required by Rule 13a-15(b) under the Exchange Act, the Company carried out an evaluation, under the supervision and with participation of its management, including its Chief Executive Officer and Chief Financial Officer, of the effectiveness of the design and operation of its disclosure controls and procedures as of September 30, 2023, the end of the period covered by this Annual Report on Form 10-K.\nBased on this evaluation, the Companys Chief Executive Officer and Chief Financial Officer have concluded that our disclosure controls and procedures were effective at a reasonable assurance level as of September 30, 2023.\nManagements Annual Report on Internal Control Over Financial Reporting\nManagement is responsible for establishing and maintaining adequate internal control over financial reporting, as defined in Exchange Act Rule 13a-15(f). Internal control over financial reporting is designed to provide reasonable assurance regarding the reliability of financial reporting and preparation of financial statements for external purposes in accordance with U.S. generally accepted accounting principles. The Companys internal control over financial reporting includes those policies and procedures that:\n(i)\npertain to the maintenance of records that, in a reasonable detail, accurately and fairly reflect the transactions and dispositions of the Companys assets;\n(ii)\nprovide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the Company are being made only in accordance with authorizations of the Companys management and directors; and\n(iii)\nprovide reasonable assurance regarding prevention or timely detection of unauthorized acquisitions, use or disposition of the Companys assets that could have a material adverse effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\nThe Company has assessed the effectiveness of its internal control over financial reporting as of September 30, 2023, using the criteria described in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO).\nBased on its assessment of the design and related testing of the Companys internal control over financial reporting management has concluded that, as of September 30, 2023, the Company maintained effective internal control over financial reporting based on the criteria set forth in the COSO framework.\nThe Companys independent auditors, Deloitte & Touche LLP, a registered public accounting firm, are appointed by the Audit Committee of the Companys Board of Directors. Deloitte & Touche LLP has audited and reported on the consolidated financial statements of the Company and the Companys internal control over financial reporting. The reports of the independent auditors are contained in this Annual Report on Form 10-K.\nChanges in Internal Control Over Financial Reporting\nThere has been no change during the Companys fiscal year ended September 30, 2023, in the Companys internal control over financial reporting that was identified in connection with the evaluation required by Exchange Act Rule 13a-15(d) which has materially affected, or is reasonably likely to materially affect, the Companys internal control over financial reporting.\nAs noted above, management has concluded that the Companys disclosure controls and procedures were effective as of September 30, 2023. Item 9B. OTHER INFORMATION\nDuring the three-month period ended September 30, 2023, none of our officers or directors adopted or terminated any contract, instruction or written plan for the purchase or sale of our securities that was intended to satisfy the affirmative defense conditions of Rule 10b5-1(c) under the Exchange Act or any non-Rule 10b5-1 trading arrangement, as defined in Item 408 of Regulation S-K. [In addition, during the three-month period ended September 30, 2023, we did not adopt or terminate any Rule 10b5-1 trading arrangement.]\nItem 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTIONS\nNot applicable.\nPART III Item 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE\nThe information required by this Item, including the information concerning the Companys directors and officers, audit committee, and compliance with Section 16 of the Exchange Act, is incorporated herein by reference to the information to be contained in the Companys definitive Proxy Statement to be used in connection with the solicitation of proxies for the Company's 2024 annual meeting of stockholders. The definitive Proxy Statement will be filed with the Securities and Exchange Commission (the Commission) pursuant to Regulation 14A no later than 120 days after September 30, 2023.\nThe Company has adopted a Code of Ethics that applies to its senior financial officers, including without limitation, its Chief Executive Officer, Chief Financial Officer and Controller. The full text of the Code of Ethics is published on the Companys website at www.ingles-markets.com under the caption Corporate Information. In the event that the Company makes any amendments to, or grants any waivers of, a provision of the Code of Ethics applicable to its principal executive officer, principal financial officer or principal accounting officer, the Company intends to disclose such amendment or waiver on its website. Information on the Companys website, however, does not form a part of this Annual Report on Form 10-K. Item 11. EXECUTIVE COMPENSATION\nThe information required by this Item is incorporated herein by reference to the information to be contained in the Companys definitive Proxy Statement referred to above in Item 10. Directors, Executive Officers and Corporate Governance. Item 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS\nThe information required by this Item is incorporated herein by reference to the information to be contained in the definitive Proxy Statement referred to above in Item 10. Directors, Executive Officers and Corporate Governance. Item 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE\nThe information required by this Item is incorporated herein by reference to the information to be contained in the definitive Proxy Statement referred to above in Item 10. Directors, Executive Officers and Corporate Governance. Item 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES\nThe information required by this Item is incorporated herein by reference to the information to be contained in the definitive Proxy Statement referred to above in Item 10. Directors, Executive Officers and Corporate Governance.\nPART IV Item 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES\n(a)Documents filed as part of this report:\n1. The following financial statements of the Registrant are included in response to Item 8 of this Annual Report on Form 10-K:\nConsolidated Balance Sheets as of September 30, 2023 and September 24, 2022;\nConsolidated Statements of Income and Other Comprehensive Income for the years ended September 30, 2023, September 24, 2022, and September 25, 2021;\nConsolidated Statements of Changes in Stockholders Equity for the years ended September 30, 2023, September 24, 2022, and September 25, 2021;\nConsolidated Statements of Cash Flows for the years ended September 30, 2023, September 24, 2022, and September 25, 2021;\nNotes to Consolidated Financial Statements.\n2. Exhibits\n(b)Exhibits:\n3.1\nComposite Articles of Incorporation of Ingles Markets, Incorporated (included as Exhibit 3.1 to Ingles Markets, Incorporateds Quarterly Report on Form 10-Q for the fiscal quarter ended March 26, 2022, File No. 0-14706, filed with the Commission on May 5, 2022 and incorporated herein by this reference).\n3.2\nAmended and Restated By-Laws of Ingles Markets, Incorporated (included as Exhibit 99.1 to Ingles Markets, Incorporateds Current Report on Form 8-K, File No. 0-14706, previously filed with the Commission on August 30, 2007 and incorporated herein by this reference).\n4.1\nArticles 4 and 9 of the Articles of Incorporation of Ingles Markets, Incorporated (included as Exhibit 3.1 to Ingles Markets, Incorporateds Registration Statement on Form S-1, File No. 33-23919, (filed on paper - hyperlink is not required pursuant to Rule 105 of Regulation S-T) and Exhibit 3.3 to Ingles Markets, Incorporateds Annual Report on Form 10-K for the fiscal year ended September 25, 2004, File No. 0-14706, respectively, each of which were previously filed with the Commission and are incorporated herein by this reference).\n4.2\nArticles 2, 3, 10, 11 and 14 of the Amended and Restated By-Laws of Ingles Markets, Incorporated (included as Exhibit 99.1 to Ingles Markets, Incorporateds Current Report on Form 8-K, File No. 0-14706, previously filed with the Commission on August 30, 2007 and incorporated herein by this reference).\n4.3\nIndenture, dated as of June 17, 2021, by and between Ingles Markets, Incorporated and Truist Bank, as Trustee, governing the 4.000% Senior Notes Due 2031, including the Form of 4.00% Senior Notes Due 2031 (filed as Exhibit 4.1 to Ingles Markets, Incorporateds Current Report on Form 8-K, File No. 0-14706, filed with the Commission on June 21, 2021 and incorporated herein by this reference).\n4.4\n*\nDescription of Capital Stock (included as Exhibit 4.5 to Ingles Markets, Incorporateds Annual Report on Form 10-K for the fiscal year ended September 26, 2020, File No. 0-14706, previously filed with the commission and incorporated herein by reference).\n10.1\nAmended and Restated Ingles Markets, Incorporated Investment/Profit Sharing Plan effective September 29, 2002 (included as Exhibit 10.11 to Ingles Markets, Incorporateds Annual Report on Form 10-K for the fiscal year ended September 28, 2002, File No. 0-14706, previously filed with the Commission and incorporated herein by this reference).\n(Management contract or compensatory plan or arrangement required to be filed as an exhibit to this Annual Report on Form 10-K pursuant to Item 15(b) of Form 10-K.)\n10.2\nSecond Amendment to the Ingles Markets, Incorporated Investment/Profit Sharing Plan dated November 2, 2011 (included as Exhibit 10.5 to the Ingles Markets, Incorporated Annual Report on Form 10-K for the fiscal year ended September 24, 2011, File No. 0-14706, previously filed with the Commission and incorporated herein by this reference).\n(Management contract or compensatory plan or arrangement required to be filed as an exhibit to this Annual Report on Form 10-K pursuant to Item 15(b) of Form 10-K.)\n10.3\nIngles Markets, Incorporated Non-qualified Plan dated May 30, 2005 (included as Exhibit 10.5 to Ingles Markets, Incorporateds Annual Report on Form 10-K for the fiscal year ended September 24, 2005, File No. 0-14706, previously filed with the Commission and incorporated herein by this reference).\n(Management contract or compensatory plan or arrangement required to be filed as an exhibit to this Annual Report on Form 10-K pursuant to Item 15(b) of Form 10-K.)\n10.4\nIngles Markets, Incorporated Executive Non-qualified Excess Plan amended and restated Effective January 1, 2013, dated November 1, 2012 (included as Exhibit 10.10 to Ingles Markets, Incorporateds Annual Report on Form 10-K for the fiscal year ended September 29, 2012, File No. 0-14706, previously filed with the Commission and incorporated herein by this reference).\n(Management contract or compensatory plan or arrangement required to be filed as an exhibit to this Annual Report on Form 10-K pursuant to Item 15(b) of Form 10-K.)\n10.5\nIngles Markets, Incorporated Investment/Profit Sharing Plan (Amended and Restated effective January 1, 2017) (included as Exhibit 10.9 to the Ingles Markets, Incorporateds Quarterly Report on Form 10-Q for the quarter ended December 30, 2017, File No. 0-14706, previously filed with the Commission and incorporated herein by this reference).\n(Management contract or compensatory plan or arrangement required to be filed as an exhibit to this Annual Report on Form 10-K pursuant to Item 15(b) of Form 10-K.)\n10.6\nIngles Markets, Incorporated Investment/Profit Sharing Plan Description (included as Exhibit 10.10 to the Ingles Markets, Incorporateds Quarterly Report on Form 10-Q for the quarter ended December 30, 2017, File No. 0-14706, previously filed with the Commission and incorporated herein by this reference).\n(Management contract or compensatory plan or arrangement required to be filed as an exhibit to this Annual Report on Form 10-K pursuant to Item 15(b) of Form 10-K.)\n10.7\nAmendment to Investment/Profit Sharing Plan to Permit In-Plan Roth Transfers (included as Exhibit 10.11 to the Ingles Markets, Incorporateds Quarterly Report on Form 10-Q for the quarter ended December 30, 2017, File No. 0-14706, previously filed with the Commission and incorporated herein by this reference).\n(Management contract or compensatory plan or arrangement required to be filed as an exhibit to this Annual Report on Form 10-K pursuant to Item 15(b) of Form 10-K.)\n10.8\nParticipation Agreement for Milkco, Inc. (Amended and Restated effective January 1, 2017) (included as Exhibit 10.12 to the Ingles Markets, Incorporateds Quarterly Report on Form 10-Q for the quarter ended December 30, 2017, File No. 0-14706, previously filed with the Commission and incorporated herein by this reference).\n(Management contract or compensatory plan or arrangement required to be filed as an exhibit to this Annual Report on Form 10-K pursuant to Item 15(b) of Form 10-K.)\n10.9\nCredit Agreement, dated as of June 17, 2021, by and among Ingles Markets, Incorporated, as borrower, Bank of America, N.A., as Administrative Agent, Swing Line Lender and L/C Issuer, and the other agents and lenders party thereto (included as Exhibit 10.1 to the Ingles Markets, Incorporateds Current Report on Form 8-K, File No. 0-14706, previously filed with the Commission on June 21, 2021 and incorporated herein by this reference).\n(Management contract or compensatory plan or arrangement required to be filed as an exhibit to this Annual Report on Form 10-K pursuant to Item 15(b) of Form 10-K.)\n21.1\nSubsidiaries of Ingles Markets, Incorporated (included as Exhibit 21.1 to Ingles Markets, Incorporateds Annual Report on Form 10-K for the fiscal year ended September 29, 2012, File No. 0-14706, previously filed with the Commission and incorporated herein by this reference).\n31.1\n*\nCertification of Chief Executive Officer Pursuant to Section 302 of Sarbanes-Oxley Act of 2002.\n31.2\n*\nCertification of Chief Financial Officer Pursuant to Section 302 of Sarbanes-Oxley Act of 2002.\n32.1\n*\nCertification by Chief Executive Officer Pursuant to Section 906 of Sarbanes-Oxley Act of 2002.\n32.2\n*\nCertification by Chief Executive Officer Pursuant to Section 906 of Sarbanes-Oxley Act of 2002.\n*\nThe following financial information from the Annual Report on Form 10-K for the fiscal year ended September 30, 2023 formatted as Inline XBRL (Extensible Business Reporting Language) and furnished electronically herewith: (i) the Consolidated Statements of Income; (ii) the Consolidated Balance Sheets; (iii) the Consolidated Statements of Cash Flows; (iv) the Consolidated Statements of Changes in Stockholders Equity; and (v) the Notes to the Consolidated Financial Statements.\n*\nCover Page Interactive Data File (formatted as Inline XBRL and contained in Exhibit 101).\n___________________________________\n* Filed herewith.\nItem 16. FORM 10-K SUMMARY\n‎\nNone.\n‎\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Stockholders and Board of Directors of Ingles Markets, Incorporated\nBlack Mountain, North Carolina\nOpinion on the Financial Statements\nWe have audited the accompanying consolidated balance sheets of Ingles Markets, Incorporated and subsidiaries (the \"Company\") as of September 30, 2023 and September 24, 2022, the related consolidated statements of income and other comprehensive income, changes in stockholders equity, and cash flows for each of the three fiscal years in the period ended September 30, 2023 and the related notes (collectively referred to as the \"financial statements\"). In our opinion, the financial statements present fairly, in all material respects, the financial position of the Company as of September 30, 2023 and September 24, 2022, and the results of its operations and its cash flows for each of the three fiscal years in the period ended September 30, 2023, in conformity with accounting principles generally accepted in the United States of America.\nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Company's internal control over financial reporting as of September 30, 2023, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission and our report dated November 29, 2023, expressed an unqualified opinion on the Company's internal control over financial reporting.\nBasis for Opinion\nThese financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on the Company's financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audits in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether the financial statements are free of material misstatement, whether due to error or fraud. Our audits included performing procedures to assess the risks of material misstatement of the financial statements, whether due to error or fraud, and performing procedures that respond to those risks. Such procedures included examining, on a test basis, evidence regarding the amounts and disclosures in the financial statements. Our audits also included evaluating the accounting principles used and significant estimates made by management, as well as evaluating the overall presentation of the financial statements. We believe that our audits provide a reasonable basis for our opinion.\nCritical Audit Matter\nThe critical audit matter communicated below is a matter arising from the current-period audit of the financial statements that was communicated or required to be communicated to the audit committee and that (1) relates to accounts or disclosures that are material to the financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the financial statements, taken as a whole, and we are not, by communicating the critical audit matter below, providing a separate opinion on the critical audit matter or on the accounts or disclosures to which it relates.\nVendor Allowances - Refer to Note 1 to the consolidated financial statements.\nCritical Audit Matter Description\nThe Company receives funds for a variety of merchandising activities from certain vendors whose products the Company buys for resale in its stores. These incentives and allowances are primarily comprised of volume or purchase based incentives, advertising allowances, slotting fees, and promotional discounts. These allowances generally relate to short term arrangements with vendors, often relating to a period of a month or less and are negotiated on a purchase-by-purchase or transaction-by-transaction basis. Vendor discounts and allowances that relate to buying and merchandising activities are recorded as a reduction of inventory cost and recognized in cost of goods sold when the related inventory is sold. Vendor advertising allowances that represent a reimbursement of specific identifiable incremental costs of advertising the vendors specific products are recorded as a reduction to the related expense in the period that the related expense is incurred.\nWe identified vendor allowances as a critical audit matter because of the number and diversity of individual vendors agreements. This required an increased extent of effort when performing procedures to evaluate whether the vendor allowances were recorded in accordance with the terms of the vendor agreements.\n‎\nHow the Critical Audit Matter Was Addressed in the Audit\nOur audit procedures related to whether vendor allowances were recorded in accordance with the terms of the vendor agreements included the following, among others:\nWe tested the operating effectiveness of controls over vendor allowances, including managements controls over the accrual and recording of vendor allowances as a reduction to the cost of inventory, cost of sales, or advertising expense in accordance with the terms of the vendor agreements.\nWe selected a sample of transactions and tested for the appropriateness of recorded reductions to inventory, cost of sales or advertising expense.\nWe selected a sample of vendors and sent confirmations to test the completeness of programs as well as the accuracy of amounts earned and terms of the agreement directly with the vendor.\n/s/ DELOITTE & TOUCHE LLP\nCharlotte, North Carolina\nNovember 29, 2023\nWe have served as the Company's auditor since 2012.\nREPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\nTo the Stockholders and the Board of Directors of Ingles Markets, Incorporated\nOpinion on Internal Control over Financial Reporting\nWe have audited the internal control over financial reporting of Ingles Markets, Incorporated and subsidiaries (the Company) as of September 30, 2023, based on criteria established in Internal Control - Integrated Framework (2013) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). In our opinion, the Company maintained, in all material respects, effective internal control over financial reporting as of September 30, 2023, based on criteria established in Internal Control - Integrated Framework (2013) issued by COSO.\nWe have also audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the consolidated financial statements as of and for the fiscal year ended September 30, 2023, of the Company and our report dated November 29, 2023, expressed an unqualified opinion on those financial statements.\nBasis for Opinion\nThe Companys management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying Managements Annual Report on Internal Control Over Financial Reporting. Our responsibility is to express an opinion on the Companys internal control over financial reporting based on our audit. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our audit in accordance with the standards of the PCAOB. Those standards require that we plan and perform the audit to obtain reasonable assurance about whether effective internal control over financial reporting was maintained in all material respects. Our audit included obtaining an understanding of internal control over financial reporting, assessing the risk that a material weakness exists, testing and evaluating the design and operating effectiveness of internal control based on the assessed risk, and performing such other procedures as we considered necessary in the circumstances. We believe that our audit provides a reasonable basis for our opinion.\nDefinition and Limitations of Internal Control over Financial Reporting\nA companys internal control over financial reporting is a process designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements for external purposes in accordance with generally accepted accounting principles. A companys internal control over financial reporting includes those policies and procedures that (1) pertain to the maintenance of records that, in reasonable detail, accurately and fairly reflect the transactions and dispositions of the assets of the company; (2) provide reasonable assurance that transactions are recorded as necessary to permit preparation of financial statements in accordance with generally accepted accounting principles, and that receipts and expenditures of the company are being made only in accordance with authorizations of management and directors of the company; and (3) provide reasonable assurance regarding prevention or timely detection of unauthorized acquisition, use, or disposition of the companys assets that could have a material effect on the financial statements.\nBecause of its inherent limitations, internal control over financial reporting may not prevent or detect misstatements. Also, projections of any evaluation of effectiveness to future periods are subject to the risk that controls may become inadequate because of changes in conditions, or that the degree of compliance with the policies or procedures may deteriorate.\n/s/ DELOITTE & TOUCHE LLP\nCharlotte, North Carolina\nNovember 29, 2023\n‎\nINGLES MARKETS, INCORPORATED AND SUBSIDIARIES\nCONSOLIDATED BALANCE SHEETS\nSEPTEMBER 30, 2023 AND SEPTEMBER 24, 2022\nASSETS\nCURRENT ASSETS:\nCash and cash equivalents\n$\n328,539,922\n$\n267,198,517\nReceivables (less allowance for doubtful accounts of $143,753 - 2023 and\n‎ $382,657 - 2022)\n107,570,690\n97,157,614\nInventories\n493,859,775\n457,945,539\nOther\n22,585,958\n15,830,032\nTotal current assets\n952,556,345\n838,131,702\nPROPERTY AND EQUIPMENT, NET\n1,431,872,289\n1,374,031,169\nOPERATING LEASE RIGHT OF USE ASSETS\n39,602,202\n38,594,968\nOTHER ASSETS\n49,814,897\n44,752,886\nTOTAL ASSETS\n$\n2,473,845,733\n$\n2,295,510,725\nLIABILITIES AND STOCKHOLDERS EQUITY\nCURRENT LIABILITIES:\nCurrent portion of long-term debt\n$\n17,526,289\n$\n17,620,789\nCurrent portion of operating lease liabilities\n7,594,971\n7,797,975\nCurrent portion of finance lease liabilities\n635,559\n-\nAccounts payable - trade\n204,040,546\n213,388,385\nAccrued expenses and current portion of other long-term liabilities\n100,735,784\n94,969,902\nTotal current liabilities\n330,533,149\n333,777,051\nDEFERRED INCOME TAXES\n67,187,000\n73,578,000\nLONG-TERM DEBT\n532,631,960\n554,287,420\nNONCURRENT OPERATING LEASE LIABILITIES\n34,016,670\n32,794,609\nNONCURRENT FINANCE LEASE LIABILITIES\n3,059,938\n-\nOTHER LONG-TERM LIABILITIES\n47,444,876\n41,479,220\nTotal liabilities\n$\n1,014,873,593\n$\n1,035,916,300\nCOMMITMENTS AND CONTINGENCIES\n-\n-\nSTOCKHOLDERS EQUITY:\nPreferred stock, $0.05 par value; 10,000,000 shares authorized; no shares issued or outstanding\n-\n-\nCommon stocks:\nClass A, $0.05 par value; 150,000,000 shares authorized; issued and outstanding,\n‎14,497,075 shares for 2023, 14,377,575 shares for 2022\n724,854\n718,879\nClass B, convertible to Class A, $0.05 par value; 100,000,000 shares authorized;\n‎ issued and outstanding, 4,497,301 shares for 2023, 4,616,801 shares for 2022\n224,865\n230,840\nPaid-in capital in excess of par value\n-\n-\nAccumulated other comprehensive income\n13,233,631\n12,406,551\nRetained earnings\n1,444,788,790\n1,246,238,155\nTotal stockholders equity\n1,458,972,140\n1,259,594,425\nTOTAL LIABILITIES AND STOCKHOLDERS EQUITY\n$\n2,473,845,733\n$\n2,295,510,725\nSee Notes to Consolidated Financial Statements.\nINGLES MARKETS, INCORPORATED AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF INCOME AND OTHER COMPREHENSIVE INCOME\nFISCAL YEARS ENDED SEPTEMBER 30, 2023,\nSEPTEMBER 24, 2022 AND SEPTEMBER 25, 2021\nNet sales\n$\n5,892,781,732\n$\n5,678,835,032\n$\n4,987,919,603\nCost of goods sold\n4,487,866,518\n4,263,066,672\n3,684,486,289\nGross profit\n1,404,915,214\n1,415,768,360\n1,303,433,314\nOperating and administrative expenses\n1,115,380,833\n1,040,193,885\n963,331,599\nGain from sale or disposal of assets\n2,769,751\n1,358,109\n9,955,890\nIncome from operations\n292,304,132\n376,932,584\n350,057,605\nOther income, net\n8,269,117\n5,845,479\n2,971,629\nInterest expense\n22,068,290\n21,508,135\n24,332,143\nLoss on early extinguishment of debt\n-\n-\n1,082,633\nIncome before income taxes\n278,504,959\n361,269,928\n327,614,458\nIncome tax expense\n67,693,000\n88,511,000\n77,883,000\nNet income\n$\n210,811,959\n$\n272,758,928\n$\n249,731,458\nOther comprehensive income:\nChange in fair value of interest rate swap\n$\n1,094,080\n$\n20,951,691\n$\n9,031,156\nIncome tax expense\n(267,000)\n(5,119,000)\n(2,206,000)\nOther comprehensive income, net of tax\n827,080\n15,832,691\n6,825,156\nComprehensive income\n$\n211,639,039\n$\n288,591,619\n$\n256,556,614\nPer-share amounts:\nClass A Common Stock\nBasic earnings per common share\n$\n11.35\n$\n14.69\n$\n13.06\nDiluted earnings per common share\n$\n11.10\n$\n14.36\n$\n12.73\nClass B Common Stock\nBasic earnings per common share\n$\n10.32\n$\n13.35\n$\n11.87\nDiluted earnings per common share\n$\n10.32\n$\n13.35\n$\n11.87\nCash dividends per common share:\nClass A\n$\n0.66\n$\n0.66\n$\n0.66\nClass B\n$\n0.60\n$\n0.60\n$\n0.60\nSee Notes to Consolidated Financial Statements.\nINGLES MARKETS, INCORPORATED AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CHANGES IN STOCKHOLDERS EQUITY\nFISCAL YEARS ENDED SEPTEMBER 30, 2023,\nSEPTEMBER 24, 2022 AND SEPTEMBER 25, 2021\nPAID-IN\nACCUMULATED\nCLASS A\nCLASS B\nCAPITAL IN\nOTHER\nCOMMON STOCK\nCOMMON STOCK\nEXCESS OF\nCOMPREHENSIVE\nRETAINED\nSHARES\nAMOUNT\nSHARES\nAMOUNT\nPAR VALUE\nLOSS\nEARNINGS\nTOTAL\nBalance, September 26, 2020\n14,212,360\n$\n710,618\n6,047,416\n$\n302,371\n$\n12,311,249\n$\n(10,251,296)\n$\n816,258,015\n$\n819,330,957\nNet income\n-\n-\n-\n-\n-\n-\n249,731,458\n249,731,458\nOther comprehensive income net of tax\n6,825,156\n6,825,156\nCash dividends\nClass A\n-\n-\n-\n-\n-\n-\n(9,396,169)\n(9,396,169)\nClass B\n-\n-\n-\n-\n-\n-\n(3,234,276)\n(3,234,276)\nStock repurchases, at cost\n-\n-\n(1,265,400)\n(63,270)\n(12,311,249)\n-\n(67,624,069)\n(79,998,588)\nCommon stock conversions\n58,975\n2,949\n(58,975)\n(2,949)\n-\n-\n-\n-\nBalance, September 25, 2021\n14,271,335\n$\n713,567\n4,723,041\n$\n236,152\n$\n-\n$\n(3,426,140)\n$\n985,734,959\n$\n983,258,538\nNet income\n-\n-\n-\n-\n-\n-\n272,758,928\n272,758,928\nOther comprehensive income net of tax\n15,832,691\n15,832,691\nCash dividends\nClass A\n-\n-\n-\n-\n-\n-\n(9,450,149)\n(9,450,149)\nClass B\n-\n-\n-\n-\n-\n-\n(2,805,583)\n(2,805,583)\nCommon stock conversions\n106,240\n5,312\n(106,240)\n(5,312)\n-\n-\n-\n-\nBalance, September 24, 2022\n14,377,575\n$\n718,879\n4,616,801\n$\n230,840\n$\n-\n$\n12,406,551\n$\n1,246,238,155\n$\n1,259,594,425\nNet income\n-\n-\n-\n-\n-\n-\n210,811,959\n210,811,959\nOther comprehensive income net of tax\n827,080\n827,080\nCash dividends\nClass A\n-\n-\n-\n-\n-\n-\n(9,511,647)\n(9,511,647)\nClass B\n-\n-\n-\n-\n-\n-\n(2,749,677)\n(2,749,677)\nCommon stock conversions\n119,500\n5,975\n(119,500)\n(5,975)\n-\n-\n-\n-\nBalance, September 30, 2023\n14,497,075\n$\n724,854\n4,497,301\n$\n224,865\n$\n-\n$\n13,233,631\n$\n1,444,788,790\n$\n1,458,972,140\nSee Notes to Consolidated Financial Statements.\n‎\nINGLES MARKETS, INCORPORATED AND SUBSIDIARIES\nCONSOLIDATED STATEMENTS OF CASH FLOWS\nFISCAL YEARS ENDED SEPTEMBER 30, 2023,\nSEPTEMBER 24, 2022 AND SEPTEMBER 25, 2021\nCash Flows From Operating Activities:\nNet income\n$\n210,811,959\n$\n272,758,928\n$\n249,731,458\nAdjustments to reconcile net income to net cash provided\n‎ by operating activities:\nDepreciation and amortization expense\n115,979,172\n117,801,654\n117,103,658\nNon cash operating lease cost\n6,878,571\n7,935,225\n8,006,820\nGain from sale or disposal of assets\n(2,769,751)\n(1,358,109)\n(9,955,890)\nLoss on early extinguishment of debt\n-\n-\n1,082,633\nReceipt of advance payments on purchases contracts\n4,154,945\n2,766,995\n2,328,167\nRecognition of advance payments on purchase contracts\n(3,156,909)\n(3,037,321)\n(2,889,553)\nDeferred income taxes\n(6,658,000)\n(4,309,000)\n(2,772,000)\nChanges in operating assets and liabilities\nReceivables\n(10,413,074)\n(2,075,600)\n(13,723,657)\nInventory\n(35,914,236)\n(67,992,082)\n(23,129,018)\nOther assets\n(10,743,707)\n2,708,240\n(3,948,861)\nOperating lease liabilities\n(6,866,749)\n(8,316,444)\n(8,384,435)\nAccounts payable and accrued expenses\n5,109,120\n22,615,984\n(7,152,634)\nNet Cash Provided By Operating Activities\n266,411,341\n339,498,470\n306,296,688\nCash Flows From Investing Activities:\nProceeds from sales of property and equipment\n3,495,707\n2,618,907\n17,612,326\nPurchase from short term investments\n-\n(110,210,267)\n(295,000,000)\nProceeds of short term investments\n-\n115,210,267\n290,000,000\nCapital expenditures\n(173,591,468)\n(119,608,974)\n(140,597,162)\nNet Cash Used By Investing Activities\n(170,095,761)\n(111,990,067)\n(127,984,836)\nCash Flows From Financing Activities:\nProceeds from short-term borrowings\n-\n-\n653,623,780\nPayments on short-term borrowings\n-\n-\n(692,507,850)\nDebt issuance costs\n-\n-\n(5,576,832)\nProceeds from issuance of bonds\n-\n-\n350,000,000\nRepayment of Financing Lease\n(231,291)\n-\n-\nPrincipal payments on long-term borrowings\n(22,481,560)\n(18,367,504)\n(327,812,521)\nStock repurchases\n-\n-\n(79,998,588)\nDividends\n(12,261,324)\n(12,255,732)\n(12,630,446)\nNet Cash Used By Financing Activities\n(34,974,175)\n(30,623,236)\n(114,902,457)\nIncrease in Cash and Cash Equivalents\n61,341,405\n196,885,167\n63,409,395\nCash and Cash Equivalents at Beginning of Year\n267,198,517\n70,313,350\n6,903,955\nCash and Cash Equivalents at End of Year\n$\n328,539,922\n$\n267,198,517\n$\n70,313,350\nSee Notes to Consolidated Financial Statements.\n‎\nIngles Markets, Incorporated and Subsidiaries\nNotes To Consolidated Financial Statements\nFiscal years ended September 30, 2023, September 24, 2022 and September 25, 2021\n1. Summary of Significant Accounting Policies\nNature of Operations - Ingles Markets, Incorporated (Ingles or the Company), a leading supermarket chain in the southeast United States, operates 198 supermarkets in North Carolina (75), Georgia (65), South Carolina (35), Tennessee (21), Virginia (1) and Alabama (1).\nPrinciples of Consolidation - The consolidated financial statements include the accounts of Ingles Markets, Incorporated and its wholly owned subsidiaries, Sky King, Inc., Ingles Markets Investments, Inc., Milkco, Inc., Land O Sky, LLC, Shopping Center Financing, LLC, and Shopping Center Financing II, LLC. All significant inter-company balances and transactions are eliminated in consolidation.\nFiscal Year - The Companys fiscal year ends on the last Saturday in September. Fiscal year 2023 was 53 weeks. Fiscal years 2022 and 2021 each consisted of 52 weeks.\nSegment Information - The Company operates one primary business segment, retail grocery sales (representing the aggregation of individual retail stores). The Other segment includes our remaining operations -- fluid dairy and shopping center rentals. The Company defines its segments as those operations for which the Companys chief operating decision maker regularly reviews results to analyze performance and allocate resources.\nNew Accounting Pronouncements - In March 2020, the FASB issued ASU 2020-04, Reference Rate Reform (Topic 848): Facilitation of the Effects of Reference Rate Reform on Financial Reporting. The ASU provides optional guidance to ease the potential burden in accounting for reference rate reform on financial reporting in response to the risk of cessation of the London Interbank Offered Rate (LIBOR). This amendment provides for optional expedients and exceptions for applying generally accepted accounting principles to contracts and hedging relationships that are affected by LIBOR and other reference rates. The ASU generally allows for hedge accounting to continue if the hedge was highly effective or met other standards prior to reference rate reform. Entities are permitted to apply the amendments to all contracts, cash flow and net investment hedge relationships that existed as of March 12, 2020. The relief provided in this ASU extends through December 31, 2024. The U.S. Dollar LIBOR panel ceased following June 30, 2023, and the Companys debt agreements and interest rate swaps that utilized LIBOR discontinued the use of LIBOR and adopted the Secured Overnight Financing Rate (SOFR), which did not materially impact our consolidated audited financial statements.\nCash and Cash Equivalents - Outstanding checks in excess of bank balances are included in the line item Accounts payable - trade on the Consolidated Balance Sheets. There were no such balances at September 30, 2023 and September 24, 2022, respectively.\nAt September 30, 2023 demand deposits aggregating approximately $323.5 million in five banks exceed the $250,000 FDIC insurance limit per bank.\nShort Term Investments - From time to time, the Company purchases financial products that can be readily converted into cash and the Company accounts for such financial products as short-term investments. Financial products include money market funds, bonds, and mutual funds. The carrying values of the Companys short-term investments approximate fair value because of their liquidity.\nInterest Rate Swaps - The Company utilizes interest rate swap contracts to reduce its exposure to fluctuations in variable interest rates applicable to some of its debt instruments. For determining the fair value of the interest rate swap contracts, the Company uses significant observable market data or assumptions about counterparty risk. The fair value estimates reflect an income approach based on the terms of the interest rate swap contracts and inputs corroborated by observable market data including interest rate curves. The Company has designated its swaps as cash flow hedges, for which the Company records the effective portions of changes in its fair value, net of tax, in other comprehensive income (expense). To the extent interest rate swaps are determined to be ineffective, the Company recognizes the change in the estimated fair value of the swaps in earnings.\nAllowance for Doubtful Accounts - Accounts receivable are primarily from vendor allowances, customer charges and pharmacy insurance company reimbursements. Accounts receivable are stated net of an allowance for uncollectible accounts, which is determined through analysis of the aging of accounts receivable at the date of the consolidated financial statements and assessments of the collectability based upon historical collection activity adjusted for current conditions.\nInventories - Substantially all of the Companys inventory consists of finished goods. Warehouse inventories are valued at the lower of average cost or market. Store inventories are valued using the retail method under which inventories at cost (and the resulting gross margins) are determined by applying a calculated cost-to-retail ratio to the retail value of inventories. As an integral part of valuing inventory at cost, management makes certain judgments and estimates for gross margins, allowances for vendor consideration, markdowns and shrinkage. Warehousing and distribution costs are not included in the valuation of inventories. The Company reviews its judgments and estimates regularly and makes adjustments where facts and circumstances dictate.\nProperty, Equipment and Depreciation - Property and equipment are stated at cost and depreciated over the estimated useful lives by the straight-line method. Buildings are generally depreciated over 30 years. Store, office and warehouse equipment is generally depreciated over three years to 10 years. Transportation equipment is generally depreciated over three years to five years. Leasehold improvements are depreciated over the shorter of the subject lease term or the useful life of the asset, generally from three years to 30 years. Depreciation and amortization expense totaled $116.0 million, $117.8 million and $117.1 million for fiscal years 2023, 2022 and 2021, respectively.\nAsset Impairments - The Company accounts for the impairment of long-lived assets in accordance with FASB Accounting Standards Codification (FASB ASC) Topic 360. Asset groups are primarily comprised of individual store and shopping center properties. For assets to be held and used, the Company tests for impairment using undiscounted cash flows and calculates the amount of impairment using discounted cash flows. For assets held for sale, impairment is recognized based on the excess of remaining book value over expected recovery value. The recovery value is the fair value as determined by independent quotes or expected sales prices developed by internal associates, less costs to sell. Estimates of future cash flows and expected sales prices are judgments based upon the Companys experience and knowledge of local operations and cash flows that are projected for several years into the future. These estimates can fluctuate significantly due to changes in real estate market conditions, the economic environment, capital spending decisions and inflation. The Company monitors the carrying value of long-lived assets for potential impairment each quarter based on whether any indicators of impairment have occurred.\nNonqualified Investment Plan - The purpose of the Executive Nonqualified Excess Plan is to provide retirement benefits similar to the Companys Investment/Profit Sharing Plan to certain of the Companys management associates who are otherwise subject to limited participation in the 401(k) feature of the Companys Investment/Profit Sharing Plan. Participant retirement account balances are liabilities of the Company. Assets of the plan are assets of the Company and are held in trust for associates and distributed upon retirement, death, disability, in-service distributions, or termination of employment. In accordance with the trust, the Company may not use these assets for general corporate purposes. Life insurance policies and marketable securities held in the trust are included in the caption Other assets in the Consolidated Balance Sheets. The liability to plan participants totaled $21.8 million at September 30, 2023 and $18.4 million at September 24, 2022. The settlement of this obligation is dependent upon participant elections to withdraw funds, which cannot be predicted.\nSelf-Insurance - The Company is self-insured for workers compensation, general liability and group medical and dental benefits. There are risks and uncertainties associated with self-insurance; however, the Company has limited its exposure by maintaining excess liability coverage of $1,000,000 per occurrence for workers compensation, and for general liability, and $500,000 per covered person for medical care benefits for a policy year. Self-insurance liabilities are established based on claims filed and estimates of claims incurred but not reported. The estimates are based on data provided by the respective claims administrators, which is then applied to appropriate actuarial methods. These estimates can fluctuate if historical trends are not predictive of the future. The Companys self-insurance reserves totaled $32.9 million and $31.0 million for employee group insurance, workers compensation insurance and general liability insurance at September 30, 2023 and September 24, 2022, respectively. These amounts include expected recoveries from excess cost insurance or other sources of $4.3 million at September 30, 2023 and $4.0 million at September 24, 2022, and are recorded as receivables. The Company is required in certain cases to pledge certificates of deposit or obtain surety bonds to support its self-insured status. The Company carries casualty insurance on only those properties for which it is required to do so. The Company has elected to self-insure its other properties.\nIncome Taxes - The Company accounts for income taxes under FASB ASC Topic 740. Deferred tax assets and liabilities are determined based on differences between financial reporting and tax bases of assets and liabilities and are measured using the currently enacted tax rates. The Company accounts for uncertainty in income taxes by prescribing a recognition threshold and measurement attribute for financial statement recognition and measurement of a tax position taken or expected to be taken on a tax return.\nThe Company files income tax returns with federal and various state jurisdictions. With few exceptions, the Company is no longer subject to federal or state income tax examinations by tax authorities for the years before tax year 2019. Examinations may challenge certain of the Companys tax positions. Actual results could materially differ from these estimates and could significantly affect the effective tax rate and cash flows in the future years.\nValuation allowances are established when necessary to reduce deferred tax assets to the amount more likely than not expected to be realized.\nGross unrecognized tax benefits as well as interest and penalties related to uncertain tax positions could affect the Companys effective tax rate. These amounts are insignificant for fiscal years 2023, 2022, and 2021.\nPre-Opening Costs - Costs associated with the opening of new stores are expensed when incurred.\nPer-Share Amounts - The Company calculates earnings per share using the two-class method in accordance with FASB ASC Topic 260.\nAdvertising - The Company expenses advertising as incurred. Advertising and promotion expenses, net of vendor allowance reimbursements, totaled $14.6 million, $20.8 million and $18.6 million for fiscal years 2023, 2022 and 2021, respectively.\nUse of Estimates - The preparation of financial statements in conformity with U.S. generally accepted accounting principles requires management to make estimates and assumptions that affect the amounts reported in the financial statements and accompanying notes. Although these estimates are based on managements knowledge of current events and actions it may undertake in the future, they may ultimately differ from actual results. Such estimates include the allowance for doubtful accounts, various inventory reserves, realizability of deferred tax assets, and self-insurance reserves.\nCost of Goods Sold - In addition to the direct product cost, cost of goods sold for the grocery segment includes inbound freight charges and costs of the Companys distribution network. Milk processing is a manufacturing process. Therefore, cost of goods sold include direct product and production costs, inbound freight, purchasing and receiving costs, inspection costs, warehousing costs, internal transfer costs, and other costs of distribution. Depreciation expense included in costs of goods sold totaled $15.2 million, $15.0 million and $16.4 million for fiscal years 2023, 2022 and 2021, respectively.\nOperating and Administrative Expenses - Operating and administrative expenses include costs incurred for store and administrative labor, occupancy, depreciation (to the extent not included in Cost of Goods Sold), insurance and general administration.\nRevenue Recognition - The Company recognizes revenues from grocery segment sales at the point of sale to its customers. Sales taxes collected from customers are not included in reported revenues. Discounts provided to customers by the Company at the point of sale, including discounts provided in connection with loyalty cards, are recognized as a reduction in sales as the products are sold. Product returns are not significant.\nThe Company recognizes fluid dairy revenues at the time the risk of loss shifts to the customer pursuant to our terms of sale. Therefore, approximately 43% of fluid dairy revenues are recognized when the product is picked up by the customer at our facility. The remaining fluid dairy revenues are recognized when the product is received at the customers facility upon delivery via transportation arranged by the Company.\nRental income, including contingent rentals, is recognized on the accrual basis. Upfront consideration paid by either the Company as lessor or by the lessee is recognized as an adjustment to net rental income using the straight line method over the term of the lease.\nVendor Allowances - The Company receives funds for a variety of merchandising activities from the many vendors whose products the Company buys for resale in its stores. These incentives and allowances are primarily composed of volume or purchase based incentives, advertising allowances, slotting fees, and promotional discounts. The purpose of these incentives and allowances is generally to help defray the costs incurred by the Company for stocking, advertising, promoting and selling the vendors products. These allowances generally relate to short term arrangements with vendors, often relating to a period of a month or less, and are negotiated on a purchase-by-purchase or transaction-by-transaction basis. Whenever practical, vendor discounts and allowances that relate to buying and merchandising activities are recorded as a component of item cost in inventory and recognized in merchandise costs when the item is sold. Due to system constraints, the use of the retail method for store inventory, and the nature of certain allowances, it is sometimes not practicable to apply allowances to the item cost of inventory. In those instances, the allowances are applied as a reduction of merchandise costs using a rational and systematic methodology, which results in the recognition of these incentives when the inventory related to the vendor consideration received is sold. Vendor allowances applied as a reduction of merchandise costs totaled $128.9 million, $110.6 million and $116.3 million for the fiscal years ended September 30, 2023, September 24, 2022 and September 25, 2021, respectively. Vendor advertising allowances that represent a reimbursement of specific identifiable incremental costs of advertising the vendors specific products are recorded as a reduction to the related expense in the period that the related expense is incurred. Vendor advertising allowances recorded as a reduction of advertising expense totaled $8.5 million, $7.1 million, and $8.1 million for the fiscal years ended September 30, 2023, September 24, 2022 and September 25, 2021, respectively. During fiscal years 2022 and 2021, the continuing effects of the COVID-19 pandemic contributed to an increase in the Companys sales. As a result, vendors offered a lower level of incentives for the Company to sell their products.\nIf vendor advertising allowances were substantially reduced or eliminated, the Company would likely consider other methods of advertising as well as the volume and frequency of its product advertising, which could increase or decrease its expenditures.\nSimilarly, the Company is not able to assess the impact of vendor advertising allowances on the creation of additional revenue; as such allowances do not directly generate revenue for its stores.\n2. Income Taxes\nDeferred Income Tax Liabilities and Assets - Deferred income taxes are determined based on the difference between the financial statement and tax bases of assets and liabilities using enacted tax laws and rates. Significant components of the Companys deferred tax liabilities and assets were as follows:\nDeferred tax liabilities:\nProperty and equipment tax/book differences\n$\n78,008,000\n$\n82,457,000\nInterest rate swaps\n4,278,000\n4,011,000\nProperty tax method\n1,462,000\n1,450,000\nTotal deferred tax liabilities\n83,748,000\n87,918,000\nDeferred tax assets:\nInsurance reserves\n5,115,000\n4,303,000\nAdvance payments on purchases contracts\n731,000\n487,000\nVacation accrual\n1,724,000\n1,977,000\nInventory\n1,777,000\n1,571,000\nDeferred compensation\n5,282,000\n4,483,000\nOther\n1,932,000\n1,519,000\nTotal deferred tax assets\n16,561,000\n14,340,000\nNet deferred tax liabilities\n$\n67,187,000\n$\n73,578,000\nRefundable current income taxes totaling $8.0 million and $4.2 million at September 30, 2023 and September 24, 2022, respectively are included in the line item Other current assets on the Consolidated Balance Sheets.\nIncome Tax Expense - Income tax expense differs from the amounts computed by applying the statutory federal rates to income before income taxes. The reasons for the differences were as follows:\nFederal tax at statutory rate\n$\n58,396,000\n$\n75,783,000\n$\n68,818,000\nState income tax, net of federal tax benefits\n9,247,000\n12,032,000\n10,872,000\nFederal tax credits\n(1,449,000)\n(1,500,000)\n(1,700,000)\nOther\n1,499,000\n2,196,000\n(107,000)\nTotal\n$\n67,693,000\n$\n88,511,000\n$\n77,883,000\nCurrent and deferred income tax expense (benefit) was as follows:\nCurrent:\nFederal\n$\n61,562,000\n$\n76,647,000\n$\n66,526,000\nState\n12,789,000\n16,173,000\n14,129,000\nTotal current expense\n74,351,000\n92,820,000\n80,655,000\nDeferred:\nFederal\n(5,802,000)\n(3,565,000)\n(2,482,000)\nState\n(856,000)\n(744,000)\n(290,000)\nTotal deferred (benefit) expense\n(6,658,000)\n(4,309,000)\n(2,772,000)\nTotal expense\n$\n67,693,000\n$\n88,511,000\n$\n77,883,000\n3. Property and Equipment\nProperty and equipment, net, consisted of the following:\nLand\n$\n457,048,257\n$\n417,414,333\nConstruction in progress\n43,281,401\n38,591,661\nBuildings\n1,414,696,772\n1,350,593,056\nStore, office and warehouse equipment\n1,053,056,285\n1,045,266,039\nTransportation equipment\n78,531,980\n75,163,558\nLeasehold improvements\n60,950,486\n60,958,847\nFinance lease right-of-use assets\n3,656,078\n-\nTotal\n3,111,221,259\n2,987,987,494\nLess accumulated depreciation and amortization\n1,679,348,970\n1,613,956,325\nProperty and equipment - net\n$\n1,431,872,289\n$\n1,374,031,169\n4. Property Held for Lease and Rental Income\nAt September 30, 2023, the Company owned and operated 93 shopping centers in conjunction with its supermarket operations. The Company leases a portion of its shopping center properties to third parties. The leases are non-cancelable operating lease agreements for periods ranging up to 20 years.\nRental income is included in the line item Net sales on the Consolidated Statements of Income. Depreciation on owned properties leased to others and other shopping center expenses are included in the line item Cost of goods sold on the Consolidated Statements of Income.\nRents earned on owned and subleased properties:\nBase rentals\n$\n24,964,305\n$\n20,091,776\n$\n19,146,124\nVariable rentals\n203,823\n166,890\n271,569\nTotal\n25,168,128\n20,258,666\n19,417,693\nDepreciation on owned properties leased to others\n(7,788,344)\n(6,318,888)\n(5,855,749)\nOther shopping center expenses\n(3,752,407)\n(2,968,660)\n(3,299,391)\nTotal\n$\n13,627,377\n$\n10,971,118\n$\n10,262,553\nOwned properties leased or held for lease to others under operating leases by major classes are summarized as follows:\nSeptember 30,\nSeptember 24,\nLand\n$\n111,407,692\n$\n91,607,085\nBuildings\n286,022,850\n241,280,289\nTotal\n397,430,542\n332,887,374\nLess accumulated depreciation\n(120,412,929)\n(112,986,048)\nTotal\n$\n277,017,613\n$\n219,901,326\nThe above amounts are included on the Consolidated Balance Sheets in the caption Property and equipment, net.\nThe following is a schedule of minimum future rental income on non-cancelable operating leases as of September 30, 2023:\nFiscal Year\n$\n17,423,525\n15,644,942\n12,295,836\n9,476,486\n6,968,550\nThereafter\n26,637,601\nTotal minimum future rental income\n$\n88,446,940\n5. Leases and Rental Expense\nThe Company conducts part of its retail operations from leased facilities. The initial term of the leases is generally 20 years. The majority of the leases include one or more renewal options and provide that the Company pay property taxes, utilities, repairs and certain other costs incidental to occupation of the premises. Several leases contain clauses calling for percentage rentals based upon gross sales of the supermarket occupying the leased space. Step rent provisions, escalation clauses, capital improvements and other lease concessions are taken into account in computing lease payments. Operating lease expense is recognized on a straight-line basis over the minimum lease term.\nOperating Leases - Rent expense for all operating leases of $10.6 million, $10.9 million and $11.1 million for fiscal years 2023, 2022 and 2021, respectively, is included in operating and administrative expenses. This amount included short-term (less than one year) leases, common area expenses, and variable lease costs, all of which are insignificant. Cash paid for lease liabilities in operating activities approximates operating lease cost. Sub-lease rental income of $0.3 million for each of fiscal years 2023, 2022 and 2021, is included as a reduction of rental expense.\nFinance Leases - Finance lease cost of $270.7 thousand included amortization expense of $231.3 thousand, included in operating and administrative expense, and $87.2 thousand of interest expense for fiscal year 2023. No finance lease cost was incurred during fiscal years 2022 and 2021.\nFuture maturities of lease liabilities as of September 30, 2023 were as follows:\nFiscal Year\nOperating Leases\nFinance Leases\n$\n8,752,051\n$\n840,000\n7,955,926\n840,000\n6,673,979\n840,000\n5,823,729\n840,000\n4,281,763\n840,000\nThereafter\n19,744,205\n101,500\nTotal lease payments\n53,231,653\n4,301,500\nLess amount representing interest\n11,620,013\n606,003\nPresent value of lease liabilities\n$\n41,611,640\n$\n3,695,497\nOn the Consolidated Balance Sheets, lease extensions exercised during fiscal year 2023 increased the line items Operating lease right of use assets and Noncurrent operating lease liabilities by $7.9 million each during the year ended September 30, 2023. The weighted average remaining lease term for the Companys operating leases is 12.2 years. New financing leases entered into during fiscal year 2023 increased the line item Property and equipment by $3.9 million and Current portion of financing lease liabilities by $0.6 million and Noncurrent financing lease liabilities by $3.1 million. The weighted average discount rate used to determine operating lease liability balances as of September 30, 2023 was 5.5%, and was 6.0% for finance lease liability balances.\n6. Supplementary Balance Sheet Information\nAccrued Expenses and Current Portion of Other Long-Term Liabilities - Accrued expenses and current portion of other long-term liabilities are summarized as follows:\nProperty, payroll, and other taxes payable\n$\n25,203,091\n$\n23,306,546\nSalaries, wages, and bonuses payable\n50,836,143\n49,619,593\nSelf-insurance liabilities:\nEmployee group insurance\n4,536,309\n4,969,709\nWorkers compensation insurance\n4,711,748\n4,607,267\nGeneral liability insurance\n4,726,301\n3,543,885\nInterest\n5,111,666\n4,590,254\nOther\n5,610,526\n4,332,648\nTotal accrued expenses and current portion of other long-term liabilities\n$\n100,735,784\n$\n94,969,902\nEmployee insurance expense, including workers compensation and medical care benefits, net of employee contributions, totaled $35.2 million, $37.0 million and $35.5 million for fiscal years 2023, 2022 and 2021, respectively.\nOther Long-Term Liabilities - Other long-term liabilities are summarized as follows:\nAdvance payments on purchases contracts\n$\n2,992,494\n$\n1,994,459\nNonqualified investment plan liability\n21,768,079\n18,445,157\nSelf-insurance liabilities:\nWorkers compensation insurance\n13,297,179\n13,287,189\nGeneral liability insurance\n5,628,963\n4,552,162\nOther\n4,804,238\n3,942,604\nOther long-term liabilities\n48,490,953\n42,221,571\nLess current portion\n1,046,077\n742,351\nTotal other long-term liabilities\n$\n47,444,876\n$\n41,479,220\nThe Companys fuel operations contain underground tanks for the storage of gasoline and diesel fuel. The Company reviewed FASB Topic ASC 410 and determined that we have a legal obligation to remove tanks at a point in the future and accordingly determined we have met the requirements for an asset retirement obligation. The Company followed the FASB ASC 410 model for determining the asset retirement cost and asset retirement obligation. The amounts recorded are immaterial for each fuel center as well as in the aggregate at September 30, 2023 and September 24, 2022.\nAdvance Payments on Purchases Contracts - The Company has entered into agreements with suppliers whereby payment is received in advance and earned based on purchases of product from these suppliers in the future. The unearned portion, included in other long-term liabilities, will be recognized in the results of operations in accordance with the terms of the contract.\n7. Long-Term Debt\nLong-term debt and short-term loans are as follows:\nBonds payable:\nSenior notes, interest rate of 4.00%, maturing 2031\n$\n350,000,000\n$\n350,000,000\nRecovery Zone Facility Bonds, maturing 2036\n54,440,000\n58,970,000\nNotes payable due to banks, weighted average interest rate of 6.29% for 2023\nand 2.31% for 2022\n151,069,954\n169,021,513\nLess unamortized prepaid loan costs\n(5,351,705)\n(6,083,304)\nTotal long-term debt\n550,158,249\n571,908,209\nLess current portion\n17,526,289\n17,620,789\nLong-term debt, net of current portion\n$\n532,631,960\n$\n554,287,420\nThe U.S. Dollar LIBOR panel ceased following June 30, 2023, and the Companys debt agreements and interest rate swaps that utilized LIBOR discontinued the use of LIBOR and adopted SOFR, which did not materially impact our consolidated audited financial statements.\nIn June 2021, the Company issued at par $350.0 million aggregate principal amount of 4.00% senior notes due 2031 (the Notes).\nThe Company may redeem all or a portion of the Notes at any time at the following redemption prices (expressed as percentages of the principal amount) if redeemed during the 12-month periods beginning June 15 of the years indicated below:\nYear\n102.000%\n101.333%\n100.667%\n2029 and thereafter\n100.000%\nAdditionally, the Company may also redeem all or part of the Notes at any time prior to June 15, 2026 at a redemption price equal to 100% of the principal amount of the Notes to be redeemed plus the Applicable Premium (as defined in the indenture governing the Notes), as of, and accrued and unpaid interest to, the redemption date. Additionally, the Company may redeem up to 40% of the aggregate principal amount of the Notes prior to June 15, 2024 with the net cash proceeds of certain sales of its capital stock at a redemption price equal to 104.0% of the principal amount of the Notes, plus accrued and unpaid interest, if any, to the date of redemption; provided, that, after such redemption, at least 60% of the aggregate principal amount of the 2031 Notes originally issued remains outstanding.\nThe Company has a $150.0 million line of credit (the Line) that matures in June 2026. The Line provides the Company with various interest rate options based on the prime rate, the Federal Funds Rate or SOFR. The Line allows the Company to issue up to $10.0 million in letters of credit, of which none were issued at September 30, 2023. The Company is not required to maintain compensating balances in connection with the Line. At September 30, 2023, the Company had no borrowings outstanding under the Line.\nIn December 2010, the Company completed the funding of $99.7 million of Recovery Zone Facility Bonds (the Bonds) for construction of new warehouse and distribution space adjacent to its existing space in Buncombe County, North Carolina (the Project). The final maturity date of the Bonds is January 1, 2036.\nUnder a Continuing Covenant and Collateral Agency Agreement (the Covenant Agreement) between certain financial institutions and the Company, such financial institutions hold the Bonds until December 2029, subject to certain events. Mandatory redemption of the Bonds by the Company in the annual amount of $4.5 million began on January 1, 2014. The Company may redeem the Bonds without penalty or premium at any time prior to December 17, 2029.\nInterest earned by bondholders on the Bonds is exempt from Federal and North Carolina income taxation. The interest rate on the Bonds is equal to SOFR plus a credit spread, adjusted to reflect the income tax exemption.\nThe Companys obligation to repay the Bonds is collateralized by the Project. The Covenant Agreement incorporates substantially all financial covenants included in the Line.\nThe Notes, the Bonds and the Line contain provisions that under certain circumstances would permit the acceleration of the indebtedness under such instruments or would otherwise permit lending institutions to terminate or withdraw their respective extensions of credit to the Company. Included among the triggering factors permitting the termination or withdrawal of the Line are certain events of default, including both monetary and non-monetary defaults, the initiation of bankruptcy or insolvency proceedings, and the failure of the Company to meet certain financial covenants designated in its loan documents. The Company was in compliance with all financial covenants related to the Notes, the Bonds and Line at September 30, 2023.\nIn September 2017, the Company refinanced approximately $60 million of secured borrowing obligations with a SOFR-based amortizing floating rate loan secured by real estate, which matures in October 2027. The Company has an interest rate swap agreement for a current notional amount of $24.5 million at a fixed rate of 3.962%. Under this agreement, the Company pays monthly the fixed rate of 3.962% and receives the one-month SOFR plus 1.75%. The interest rate swap effectively hedges floating rate debt in the same amount as the current notional amount of the interest swap. Both the floating rate debt and the interest rate swap have monthly principal amortization of $0.5 million and mature October 1, 2027.\nIn December 2019, the Company closed a $155 million SOFR-based amortizing floating rate loan secured by real estate, which matures in January 2030. The Company has an interest rate swap agreement for a current notional amount of $124.6 million at a fixed rate of 2.998%. Under this agreement, the Company pays monthly the fixed rate of 2.998% and receives the one-month SOFR plus 1.60%. The interest rate swap effectively hedges floating rate debt in the same amount as the current notional amount of the interest swap. Both the floating rate debt and the interest rate swap have monthly principal amortization of $0.65 million and mature in fiscal year 2030.\nThe Company recognizes differences between the variable rate interest payments and the fixed interest rate settlements with the swap counterparties as an adjustment to interest expense each period over the life of the swaps. The Company has designated the swaps as cash flow hedges and records the changes in the estimated fair value of the swaps to other comprehensive income each period. For the fiscal year ended September 30, 2023, the Company recorded $0.8 million of other comprehensive income, net of income taxes, in its Consolidated Statements of Comprehensive Income. Unrealized gains of $17.5 million are recorded as an asset at fair value in the line Other Assets on the Consolidated Balance Sheet as of September 30, 2023. For the fiscal year ended September 24, 2022, the Company recorded $15.8 million of other comprehensive income, net of income taxes, in its Consolidated Statements of Comprehensive Income. Unrealized gains of $16.4 million are recorded as an asset at fair value in the line Other Assets on the Consolidated Balance Sheet as of September 24, 2022.\nFailure of the swap counterparty to make payments would result in the loss of any potential benefit to the Company under the swap agreement. In this case, the Company would still be obligated to pay the variable interest payments underlying the debt agreements. Additionally, failure of the swap counterparty would not eliminate the Companys obligation to continue to make payments under the existing swap agreement if it continues to be in a net pay position.\nAt September 30, 2023, property and equipment with an undepreciated cost of approximately $257.2 million was pledged as collateral for long-term debt. Long-term debt and Line agreements contain various restrictive covenants requiring, among other things, minimum levels of net worth and maintenance of certain financial ratios. While there are no current restrictions on net income or retained earnings available for the payment of dividends, certain loan agreements contain provisions outlining minimum tangible net worth requirements that restrict the ability of the Company to pay cash dividends in excess of the current annual per share dividends paid on the Companys Class A and Class B Common Stock.\nComponents of interest costs were as follows:\nTotal interest costs\n$\n23,056,378\n$\n21,848,860\n$\n25,463,076\nInterest capitalized\n(988,088)\n(340,725)\n(1,130,933)\nInterest expense\n$\n22,068,290\n$\n21,508,135\n$\n24,332,143\nMaturities of long-term debt at September 30, 2023 were as follows:\nFiscal Year\n$\n18,280,000\n18,280,000\n18,280,000\n18,280,000\n12,766,620\nThereafter\n469,623,334\nLess unamortized prepaid loan costs\n(5,351,705)\nTotal\n$\n550,158,249\n8. Stockholders Equity\nThe Company has two classes of Common Stock: Class A and Class B. Class A Common Stock is traded on The NASDAQ Global Select Market under the symbol IMKTA. There is no public market for the Companys Class B Common Stock. However, each share of Class B Common Stock is convertible at any time, at the option of the holder, into one share of Class A Common Stock. Upon any transfers of Class B Common Stock (other than to immediate family members, other eligible holders, and participants in the Investment/Profit Sharing Plan), such stock is automatically converted into Class A Common Stock.\nThe holders of the Class A Common Stock and Class B Common Stock are entitled to dividends and other distributions when declared out of assets legally available therefore, subject to the dividend rights of any preferred stock that may be issued in the future. Each\nshare of Class A Common Stock is entitled to receive a cash dividend and liquidation payment in an amount equal to 110% of any cash dividend or liquidation payment on Class B Common Stock. Any stock dividend must be paid in shares of Class A Common Stock with respect to Class A Common Stock and in shares of Class B Common Stock with respect to Class B Common Stock.\nThe voting powers, preferences and relative rights of Class A Common Stock and Class B Common Stock are identical in all respects, except that the holders of Class A Common Stock have one vote per share and the holders of Class B Common Stock have ten votes per share. In addition, holders of Class A Common Stock, as a separate class, are entitled to elect 25% of all directors constituting the Board of Directors (rounded to the nearest whole number). As long as the Class B Common Stock represents at least 12.5% of the total outstanding Common Stock of both classes, holders of Class B Common Stock, as a separate class, are entitled to elect the remaining directors. The Companys Articles of Incorporation and Bylaws provide that the Board of Directors can set the number of directors between five and eleven.\n9. Earnings Per Common Share\nThe Company calculates earnings per share using the two-class method in accordance with FASB ASC Topic 260.\nThe two-class method of computing basic earnings per share for each period reflects the cash dividends paid per share for each class of stock, plus the amount of allocated undistributed earnings per share computed using the participation percentage which reflects the dividend rights of each class of stock. Diluted earnings per share is calculated assuming the conversion of all shares of Class B Common Stock to shares of Class A Common Stock on a share-for-share basis. The tables below reconcile the numerators and denominators of basic and diluted earnings per share for current and prior periods.\nYear Ended\nSeptember 30, 2023\nClass A\nClass B\nNumerator: Allocated net income\nNet income allocated, basic\n$\n163,599,005\n$\n47,212,954\nConversion of Class B to Class A shares\n47,212,954\n-\nNet income allocated, diluted\n$\n210,811,959\n$\n47,212,954\nDenominator: Weighted average shares outstanding\nWeighted average shares outstanding, basic\n14,417,916\n4,576,460\nConversion of Class B to Class A shares\n4,576,460\n-\nWeighted average shares outstanding, diluted\n18,994,376\n4,576,460\nEarnings per share\nBasic\n$\n11.35\n$\n10.32\nDiluted\n$\n11.10\n$\n10.32\nYear Ended\nYear Ended\nSeptember 24, 2022\nSeptember 25, 2021\nClass A\nClass B\nClass A\nClass B\nNumerator: Allocated net income\nNet income allocated, basic\n$\n210,480,738\n$\n62,278,190\n$\n185,964,771\n$\n63,766,687\nConversion of Class B to Class A shares\n62,278,190\n-\n63,766,687\n-\nNet income allocated, diluted\n$\n272,758,928\n$\n62,278,190\n$\n249,731,458\n$\n63,766,687\nDenominator: Weighted average\n‎ shares outstanding\nWeighted average shares outstanding,\nbasic\n14,330,809\n4,663,567\n14,242,276\n5,370,894\nConversion of Class B to Class A shares\n4,663,567\n-\n5,370,894\n-\nWeighted average shares outstanding,\ndiluted\n18,994,376\n4,663,567\n19,613,170\n5,370,894\nEarnings per share\nBasic\n$\n14.69\n$\n13.35\n$\n13.06\n$\n11.87\nDiluted\n$\n14.36\n$\n13.35\n$\n12.73\n$\n11.87\n10. Employee Benefit Plans\nInvestment/Profit Sharing Plan - The purpose of the qualified investment/profit sharing plan is to provide retirement benefits to eligible associates. Assets of the plan, including the Companys Class B Common Stock, are held in trust for associates and distributed upon retirement, death, disability or termination of employment. Company contributions are discretionary and are determined quarterly by the Board of Directors. The plan includes a 401(k) feature. Company contributions to the plan, included in operating and administrative expenses, were approximately $5.7 million, $5.0 million and $5.1 million for fiscal years 2023, 2022 and 2021, respectively.\nNonqualified Investment Plan - The purpose of the Executive Nonqualified Excess Plan is to provide benefits similar to the Companys Investment/Profit Sharing Plan to certain of the Companys management associates who are otherwise subject to limited participation in the 401(k) feature of the Companys Investment/Profit Sharing Plan. Company contributions to the plan, included in operating and administrative expenses, were approximately $509,000, $440,000 and $375,000 for fiscal years 2023, 2022 and 2021, respectively.\nCash Bonuses - The Company pays monthly bonuses to various managerial personnel based on the performance of the operating units managed by these personnel. The Company pays discretionary annual bonuses to certain associates who do not receive monthly performance bonuses. The Company pays discretionary bonuses to certain executive officers based on Company performance. Operating and administrative expenses include bonuses of approximately $34.4 million, $32.3 million and $27.2 million for fiscal years 2023, 2022 and 2021, respectively. The accrued liability for cash bonuses totaled $23.6 million at September 30, 2023 and $26.0 million at September 24, 2022. These amounts are included in the caption Accrued expenses and current portion of other long-term liabilities in the Consolidated Balance Sheets.\nMedical Care Plan - Medical and dental benefits are provided to qualified associates under a self-insured plan. Expenses under the plan include claims paid, administrative expenses and an estimated liability for claims incurred but not yet paid.\n11. Segment Information\nThe Company operates one primary business segment, retail grocery sales (representing the aggregation of individual retail stores). Other includes the Companys remaining operations -- fluid dairy and shopping center rentals. Information about the Companys operations by lines of business (amounts in thousands) is as follows:\nRevenues from unaffiliated customers:\nGrocery\n$\n2,062,416\n$\n1,940,414\n$\n1,762,872\nNon-foods\n1,326,907\n1,204,443\n1,136,250\nPerishables\n1,482,089\n1,445,042\n1,349,081\nGasoline\n792,524\n885,801\n583,749\nTotal retail\n5,663,936\n5,475,700\n4,831,952\nOther\n228,846\n203,135\n155,968\nTotal revenues from unaffiliated customers\n$\n5,892,782\n$\n5,678,835\n$\n4,987,920\nIncome before income taxes:\nRetail\n$\n263,220\n$\n353,006\n$\n327,563\nOther\n29,084\n23,927\n22,495\nTotal income from operations\n292,304\n376,933\n350,058\nOther income, net\n8,269\n5,845\n2,971\nInterest expense\n22,068\n21,508\n24,332\nLoss on early extinguishment of debt\n-\n-\n1,083\nIncome before income taxes\n$\n278,505\n$\n361,270\n$\n327,614\nAssets:\nRetail\n$\n2,159,883\n$\n2,042,730\n$\n1,794,160\nOther\n317,479\n255,880\n226,762\nElimination of intercompany receivable\n(3,516)\n(3,099)\n(2,578)\nTotal assets\n$\n2,473,846\n$\n2,295,511\n$\n2,018,344\nCapital expenditures:\nRetail\n$\n168,154\n$\n106,508\n$\n138,005\nOther\n5,437\n13,101\n2,592\nTotal capital expenditures\n$\n173,591\n$\n119,609\n$\n140,597\nDepreciation and amortization:\nRetail\n$\n106,225\n$\n109,642\n$\n108,745\nOther\n9,754\n8,160\n8,359\nTotal depreciation and amortization\n$\n115,979\n$\n117,802\n$\n117,104\nThe Grocery category includes grocery, dairy, and frozen foods.\nThe Non-foods category includes alcoholic beverages, tobacco, pharmacy, and health/beauty/cosmetic products.\nThe Perishable category includes meat, produce, deli and bakery.\n12. Commitments and Contingencies\nVarious legal proceedings and claims arising in the ordinary course of business are pending against the Company. In the opinion of management, the ultimate liability, if any, from all pending legal proceedings and claims is not expected to materially affect the Companys financial position, the results of its operations or its cash flows.\nConstruction commitments at September 30, 2023 totaled $3.0 million. The Company expects these commitments to be fulfilled during fiscal year 2024.\nThe Company has entered into supply contracts to provide approximately 85% of the fuel sold in its fuel centers. Pricing is based on certain market indices at the time of purchase. The suppliers can modify or terminate the contracts if the Company does not meet certain minimum monthly purchase requirements.\nThere have been no other material changes in contractual obligations and commercial commitments subsequent to September 30, 2023 other than as described elsewhere in this Annual Report on Form 10-K.\n13. Fair Values of Financial Instruments\nThe following methods and assumptions were used by the Company in estimating its fair value disclosures for financial instruments:\nCash and cash equivalents: The carrying amounts reported in the Consolidated Balance Sheets for cash and cash equivalents approximate their fair values.\nShort term investments: The carrying amounts reported in the Consolidated Balance Sheets for short term investments approximate their fair values.\nReceivables: The carrying amounts reported in the Consolidated Balance Sheets for receivables approximate their fair values.\nThe fair value of the Companys debt is estimated using valuation techniques under the accounting guidance related to fair value measurements based on observable and unobservable inputs. Observable inputs reflect readily available data from independent sources, while unobservable inputs reflect the Companys market assumptions. These inputs are classified into the following hierarchy:\nLevel 1 Inputs -\nQuoted prices for identical assets or liabilities in active markets.\nLevel 2 Inputs -\nQuoted prices for similar assets or liabilities in active markets; quoted prices for identical or similar assets or liabilities in markets that are not active; and model-derived valuations whose inputs are observable or whose significant value drivers are observable.\nLevel 3 Inputs -\nPricing inputs are unobservable for the assets or liabilities and include situations where there is little, if any, market activity for the assets or liabilities. The inputs into the determination of fair value require significant management judgment or estimation.\nThe carrying amount and fair value of the Companys debt, interest rate swaps, and non-qualified plan assets at September 30, 2023 is was follows (in thousands):\nCarrying\nAmount\nFair Value\nFair Value Measurements\nSenior Notes\n$\n350,000\n$\n287,875\nLevel 2\nFacility Bonds\n54,440\n54,440\nLevel 2\nSecured notes payable and other\n145,718\n145,718\nLevel 2\nInterest rate swaps derivative contract asset\n17,515\n17,515\nLevel 2\nNon-qualified retirement plan assets\n20,074\n20,074\nLevel 2\nThe fair values for Level 2 measurements were determined primarily using market yields and taking into consideration the underlying terms of the debt.\n14. Cash Flow Information\nSupplemental disclosure of cash flow information is as follows:\nCash paid during the year for:\nInterest (net of amounts capitalized)\n$\n21,546,878\n$\n21,398,985\n$\n26,537,234\nIncome taxes\n78,406,107\n87,187,808\n77,515,577\nNon cash items:\nProperty and equipment additions included in accounts payable\n5,067,861\n8,724,576\n6,920,759\n15. Related Party Transactions\nThe Company will from time to time make short-term non-interest bearing loans to the Companys Investment/Profit Sharing Plan to allow the plan to meet distribution obligations during a time when the plan was prohibited from selling shares of the Companys Class A Common Stock. At September 30, 2023 there was an aggregate of $330,000 of outstanding loans, and there were no such loans outstanding at September 24, 2022.\nDuring the twelve months ended September 30, 2023, a limited liability company having Robert P. Ingle II, the Companys Chairman of the Board, as one of its principals, purchased a shopping center from an unrelated party at which the Company has a long-term lease in place. The Companys lease was in place prior to such purchase, and the terms of the lease have not changed since it was originally negotiated.\nDuring the twelve months ended September 30, 2023, the Company purchased two properties, which join property owned by the Company, for a combined $5.8 million from a limited liability company having Mr. Ingle II as one of its principals. In accordance with the Companys Related Party Transaction policy, independent fair market value appraisals were obtained to determine the purchase price, and the Companys Audit Committee reviewed and approved the transaction.\nDuring the twelve months ended September 30, 2023, the Company and a limited liability company having Mr. Ingle II, as one of its principals swapped adjoining properties in an even exchange. In accordance with the Companys Related Party Transaction policy, independent fair market value appraisals were obtained, and the Companys Audit Committee reviewed and approved the transaction\n‎\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nINGLES MARKETS, INCORPORATED\nBy:\n/s/ James W. Lanning\nJames W. Lanning\nPresident, Chief Executive Officer\nand Chief Operating Officer\n(principal executive officer)\nDate: November 29, 2023\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Registrant and in the capacities and on the dates indicated:\n/s/ Robert P. Ingle, II\nNovember 29, 2023\nRobert P. Ingle, II, Chairman and Director\n/s/ James W. Lanning\nNovember 29, 2023\nJames W. Lanning, President, Chief Executive Officer,\nChief Operating Officer and Director\n(principal executive officer)\n/s/ Patricia E. Jackson\nNovember 29, 2023\nPatricia E. Jackson, CPA,\nVice President-Finance, Chief Financial Officer, and Director\n(principal financial and accounting officer)\n/s/ Catherine L. Phillips\nNovember 29, 2023\nCatherine L. Phillips, CPA, Secretary and Controller\n/s/ John R. Lowden\nNovember 29, 2023\nJohn R. Lowden, Director\n/s/ Fred D. Ayers\nNovember 29, 2023\nFred D. Ayers, Director\n/s/ Laura Sharp\nNovember 29, 2023\nLaura Sharp, Director\n/s/ Brenda S. Tudor\nNovember 29, 2023\nBrenda S. Tudor, Director\n/s/ Ernest E. Ferguson\nNovember 29, 2023\nErnest E. Ferguson, Director"
}