{
    "cik": "54187",
    "company": "MAYS J W INC",
    "filing_type": "10-K",
    "filing_date": "2023-10-19",
    "period_of_report": "2023-07-31",
    "sic": "6512",
    "state_of_inc": "NY",
    "state_location": "NY",
    "fiscal_year_end": "0731",
    "filing_html_index": "https://www.sec.gov/Archives/edgar/data/54187/0001206774-23-001194-index.html",
    "htm_filing_link": "https://www.sec.gov/Archives/edgar/data/54187/000120677423001194/mays4229211-10k.htm",
    "complete_text_filing_link": "https://www.sec.gov/Archives/edgar/data/54187/0001206774-23-001194.txt",
    "filename": "54187_10K_2023_0001206774-23-001194.htm",
    "content": "ITEM 1. BUSINESS.\nJ.W. Mays, Inc. (the Company or Registrant) with executive offices at Nine Bond Street, Brooklyn, New York 11201, operates a number of commercial real estate properties, which are described in Item 2 Properties. The Companys business was founded in 1924 and incorporated under the laws of the State of New York on July 6, 1927.\nThe Company has 30 employees and has a contract, expiring November 30, 2025, with a union covering rates of pay, hours of employment and other conditions of employment for approximately 27% of its employees. The Company considers that its labor relations with its employees and union are good.\nCAUTIONARY STATEMENT REGARDING FORWARD-LOOKING STATEMENTS\nThis Annual Report on Form 10-K may contain forward-looking statements which include assumptions about future market conditions, operations and financial results. These statements are based on current expectations and are subject to risks and uncertainties. They are made pursuant to safe harbor provisions of the Private Securities Litigation Reform Act of 1995. The Companys actual results, performance or achievements in the future could differ significantly from the results, performance or achievements discussed or implied in such forward-looking statements herein and in prior U. S. Securities and Exchange Commission (SEC) filings by the Company. The Company assumes no obligation to update these forward-looking statements or to advise of changes in the assumptions on which they were based.\nFactors that could cause or contribute to such differences include, but are not limited to, changes in the competitive environment of the Company, general economic and business conditions, industry trends, changes in government rules and regulations and environmental rules and regulations. Statements concerning interest rates and other financial instrument fair values and their estimated contribution to the Companys future results of operations are based upon market information as of a specific date. This market information is often a function of significant judgment and estimation. Further, market interest rates are subject to potential significant volatility. ITEM 1A. RISK FACTORS.\nRisks Relating to Ownership Structure\nThe controlling shareholder group may be able to vote its shares in favor of its interests that may not always coincide with the interests of shareholders not part of such group. This risk may be counter-balanced to a degree by the actions of the Board of Directors whose composition is made up of a majority of independent directors.\nThe controlling shareholder group includes a corporation that owns a significant percentage of the Companys common stock and which does business with the Company, as further described in the Notes to the Consolidated Financial Statements. In theory, this could result in a conflict of interest; nevertheless, the Company and its largest shareholder have put in place some controls to reduce the effects of any perceived conflict of interest.\nCertain conflicts of interest may be perceived by the relationship between the Company and its largest shareholder. Both entities have the same Chief Executive Officer, and certain management personnel work for both entities. Nevertheless, the Companys Board of Directors (Board) is composed of a majority of independent directors. In 2005, in a case involving both entities, the Delaware Supreme Court in connection with an attempt to obtain books and records of the Company through a proceeding against the Companys significant shareholder, held that the actions of the Companys Board were proper.\nRisks Related to Our Business\nWe are a part of the communities in which we do business. Accordingly, like other businesses in our communities, we are subject to the following risks:\nthe continued threat of terrorism;\neconomic downturns, both on a national and on local scales;\nloss of key personnel;\nthe availability, if needed, of additional financing;\nthe continued availability of insurance (in different types of policies) at reasonably acceptable rates;\nthe general burdens of governmental regulation, at the Local, State and Federal levels;\nclimate change;\ncyber security; and\npandemics, such as COVID-19.\nRisks Related to Real Estate Operations\nOur investment in property development may be limited by increasing costs required to fit up property to be leased to tenants. Also, as the cost of fitting up properties increases, we may be required to wait and forsake opportunities that would be revenue producing until such time that we obtain the necessary financing of such ventures. This risk may be mitigated by obtaining lines of credit and other financing vehicles, although such have significant limitations on the amounts that may be borrowed at any point in time.\nWe also may be subject to environmental liability as an owner or operator of properties. Many of our properties are old and when we need to fit up a property for a new tenant, we may find materials and the like that could be deemed to contain hazardous elements requiring remediation or encapsulation.\nThe impact of COVID-19 on demand for commercial real estate rental space has been significant. As online retail operations continued to expand nationwide during the pandemic, retailers are facing increased competition which reduces the need for the leasing of properties which is our business. Professionals working remotely during the pandemic has resulted in tenants careful evaluation of office space needs and a decline in demand of commercial office space rentals and increasing competition. The Company emphasizes retention of tenants over a long period of time which helps in difficult economic conditions. The Company also aggressively markets available space to tenants including governmental agencies, medical and educational institutions.\nWe try to lease our properties to tenants with adequate finances, but as a result of recent business downturns, even formerly financially strong tenants may be at risk. The Company mitigates risks of tenants with less than adequate finances by leasing our properties to multiple tenants where applicable in order to diversify the tenant base.\nRisks Related to our Investments\nExcess cash and cash equivalents may be invested from time to time. We seek to earn rates of return that will help us finance our business operations. These investments may be subject to significant uncertainties and may not be successful for many reasons, including, but not limited to the following:\nfluctuations in interest rates;\nworsening of general economic and market conditions; and\nadverse legal, financial and regulatory developments that may affect a particular business.\nRisk Factors Summary\nThese are some of the Risk Factors that could affect the Companys business. The Company endeavors to take actions and do business in a way that reduces these Risk Factors or, at least, takes them into account when conducting its business. Nevertheless, some of these Risk Factors cannot be avoided so that the Company must also take actions and do business that negates the adverse effects that these may have on the Company. ITEM 1B. UNRESOLVED STAFF COMMENTS.\nThere are no unresolved comments from the staff of the U. S. Securities and Exchange Commission as of the date of this Annual Report on Form 10-K. ITEM 2. PROPERTIES.\nThe table below sets forth certain information as to each of the properties currently operated by the Company:\nLocation\nApproximate\nSquare Feet\n1. Brooklyn, New York\nFulton Street at Bond Street\n380,000\nLivingston Street\nTruck bays, passage facilities and tunnel-Schermerhorn Street\n17,000\nBuilding-Livingston Street\n10,500\n2. Brooklyn, New York\nJowein building at Elm Place\n201,000\n3. Jamaica, New York\nJamaica Avenue at 169th Street\n297,000\n4. Fishkill, New York\nRoute 9 at Interstate Highway 84\n203,000\n(located on\n14.6 acres\n)\n5. Levittown, New York\nHempstead Turnpike\n10,000\n(located on 75,800 square feet of land )\n6. Massapequa, New York\nSunrise Highway\n133,400\n7. Circleville, Ohio\nTarlton Road\n193,350\n(located on 11.6 acres )\nProperties are leased under long-term leases for varying periods, the longest of which extends to 2073, and in most instances renewal options are included. Reference is made to Notes 4 and 10 to the Consolidated Financial Statements contained in the 2023 Annual Report to Shareholders, incorporated herein by reference. Properties owned and subject to mortgage are the Brooklyn Fulton Street at Bond Street and Fishkill buildings.\n1. Brooklyn, New York\nFulton Street at Bond Street\n90% of the property is owned by the Company and the remaining 10% of the property is leased by the Company under five separate leases. Expiration dates are as follows: 12/8/2043 (1 lease) which lease currently has one thirty-year renewal option through 12/8/2073, 4/30/2031 (1 lease), and 4/30/2044 (3 leases).\nThe property is currently leased to twenty-five tenants of which nine are retail tenants, three are fast food restaurants, ten occupy office space, three are dental or medical offices. One tenant leased in excess of 10% of the rentable square footage; the tenant is a department store, occupying 20.60%.\nIn August 2022, a tenant who occupies 25,423 square feet of office space notified the Company of its intention to extend its lease for one year through September 30, 2023.\nOn October 4, 2022, a tenant who occupies 1,140 square feet of retail space agreed to terminate their lease effective October 31, 2022. In July 2023 another retail tenant took occupancy of this space.\nIn December 2022, a tenant who occupies 5,167 square feet agreed to terminate the lease.\nIn February 2023, an office tenant who occupies 46,421 square feet agreed to terminate their lease effective March 31, 2023.\nIn June 2023, a retail tenant who occupies 63 square feet extended their lease an additional five years until June 30, 2028.\nIt is the intention of the Company to negotiate the renewals of the expiring leases as they come due, providing the tenants maintain adequate finances.\nOccupancy\nLease Expiration\nRent\nYear\nEnded\nRate\nYear\nEnded\nNumber of\nLeases\nArea\nSq. Ft.\nAnnual\nRent\nPercentage of\nGross Annual Rent\n7/31/2019\n75.65%\n7/31/2024\n26,923\n$ 1,210,990\n5.364\n7/31/2020\n70.07%\n7/31/2025\n3,080\n126,000\n.558\n7/31/2021\n62.31%\n7/31/2026\n15,261\n735,522\n3.258\n7/31/2022\n63.38%\n7/31/2027\n3,558\n156,431\n.693\n7/31/2023\n59.51%\n7/31/2028\n6,633\n231,076\n1.024\n7/31/2030\n87,070\n2,497,642\n11.063\n7/31/2031\n1,090\n45,126\n.200\n7/31/2032\n49,268\n2,080,043\n9.213\n7/31/2033\n1,140\n16,499\n.073\n194,023\n$ 7,099,329\n31.446\nThe Company uses 17,810 square feet of available space.\nAs of July 31, 2023 the federal tax basis is $22,607,989 with accumulated depreciation of $14,453,318 for a net carrying value of $8,154,671. The lives taken for depreciation vary between 15-40 years and the methods used are straight-line and declining balance.\nThe real estate taxes for this property are $2,670,914 per year and the rate used is averaged at $11.135 per $100 of assessed valuation.\nLivingston Street\nThe Company has a long-term lease with the City of New York and another landlord for a garage at Livingston Street opposite the Companys Brooklyn Fulton Street at Bond Street Properties. The lease expires in 2043, with a renewal option to 2073. The garage includes truck bays and passage facilities through a tunnel to the Properties. The truck bays, passage facilities and tunnel, total approximately 17,000 square feet. The lease also includes a 20 x 75-foot land plot on which the Company constructed a building of six stories and basement annexed to the Properties.\n2. Brooklyn, New York-Jowein building at Elm Place\nThe building is owned. The property is currently leased to fourteen tenants of which one is a retail store, one is fast-food restaurant, two are for warehouse space and ten leases are for office space. Three tenants leased in excess of 10% of the rentable square footage; each occupies office space of 15.64%, 11.74% and 11.44%, respectively.\nEffective November 1, 2022, a tenant who occupies 10,000 square feet agreed to terminate their lease.\nIn February 2023, an office tenant who occupies 3,300 square feet extended their lease an additional ten years until June 30, 2033. Also in February 2023, another office tenant who occupies 10,569 square feet extended their lease an additional year until March 31, 2024.\nIt is the intention of the Company to negotiate the renewals of the expiring leases as they come due, providing the tenants maintain adequate finances.\nOccupancy\nLease Expiration\nRent\nYear\nEnded\nRate\nYear\nEnded\nNumber of\nLeases\nArea\nSq. Ft.\nAnnual\nRent\nPercentage of\nGross Annual Rent\n7/31/2019\n85.14%\n7/31/2024\n25,016\n$ 935,925\n4.146\n7/31/2020\n73.22%\n7/31/2025\n17,364\n579,035\n2.565\n7/31/2021\n72.54%\n7/31/2026\n5,640\n180,042\n.797\n7/31/2022\n80.84%\n7/31/2027\n54,530\n.242\n7/31/2023\n83.46%\n7/31/2028\n5,600\n152,701\n.676\n7/31/2030\n31,438\n981,386\n4.347\n7/31/2033\n3,300\n89,760\n.398\n7/31/2036\n12,105\n52,566\n.233\n7/31/2037\n41,028\n1,898,972\n8.411\n7/31/2059\n19,437\n161,173\n.714\n161,428\n$ 5,086,090\n22.529\nAs of July 31, 2023 the federal tax basis is $7,550,837 with accumulated depreciation of $5,168,848 for a net carrying value of $2,381,989. The lives taken for depreciation vary between 15-40 years and the methods used are straight-line and declining balance.\nThe real estate taxes for this property are $816,733 per year and the rate used is averaged at $11.115 per $100 of assessed valuation.\n3. Jamaica, New York-Jamaica Avenue at 169th Street\nBuilding, improvements and land (property) are leased from an affiliated company, principally owned by a director of the Company (Landlord). In July 2022, the Company entered into an agreement with Landlord giving the Company four five-year option periods for a total of twenty years through May 31, 2050. In April 2023, the Company exercised the first five-year option period, extending the lease expiration date to May 31, 2035. Upon lease termination, all property included in operating lease right-of-use assets and leasehold improvements will be turned over to the Landlord.\nIn August 2022, a tenant who occupies 38,109 square feet of office space notified the Company of its intention to extend its lease for one year through September 30, 2023.\nIn April 2023, a retail tenant who occupies 28,634 square feet extended their lease an additional ten years until February 28, 2034.\nIn May 2023, an office tenant who occupies 2,000 square feet at the Companys Jamaica, New York property extended their lease an additional year until June 30, 2024.\nThe property is currently leased to ten tenants: four are retail tenants and six occupy office space. Four tenants each occupy in excess of 10% of the rentable square footage: two retail stores occupy 15.86% and 17.66%, respectively; and two office tenants occupy 14.22% and 12.83%, respectively.\nIt is the intention of the Company to negotiate the renewals of the expiring leases as they come due, providing the tenants maintain adequate finances.\nOccupancy\nLease Expiration\nRent\nYear\nEnded\nRate\nYear\nEnded\nNumber of\nLeases\nArea\nSq. Ft.\nAnnual\nRent\nPercentage of\nGross Annual Rent\n7/31/2019\n80.50%\n7/31/2024\n104,404\n$ 2,900,639\n12.848\n7/31/2020\n80.51%\n7/31/2025\n24,000\n.106\n7/31/2021\n80.41%\n7/31/2026\n6,095\n177,537\n.786\n7/31/2022\n80.51%\n7/31/2027\n34,800\n.154\n7/31/2023\n80.58%\n7/31/2029\n99,544\n1,966,978\n8.713\n7/31/2034\n28,634\n621,720\n2.754\n239,329\n$ 5,725,674\n25.361\nUntil the lease agreement terminates, the Company remains solely entitled to tax depreciation and other tax deductions relating to the buildings, improvements and maintenance of the property. As of July 31, 2023, the federal tax basis is $13,863,981 with accumulated depreciation of $9,889,906 for a net carrying value of $3,974,075. The lives taken for depreciation vary between 15-40 years and the methods used are straight-line and declining balance.\nThe real estate taxes for this property are $1,018,571 per year and the rate used is averaged at $11.137 per $100 of assessed valuation.\n4. Fishkill, New York-Route 9 at Interstate Highway 84\nThe Company owns the entire property. In July 2019, the Company leased 47,000 square feet to a community college at its Fishkill, New York building, for a term of fifteen years with two five-year option periods.\nIn August 2022, the Company leased 58,832 square feet at the Companys Fishkill, New York building for use as storage space for six months which expired in February 2023.\nThere are approximately 156,000 square feet of the building available for lease. There are plans to renovate vacant space upon the execution of future leases to tenants, although no assurances can be made as to when or if such leases will be entered into.\nOccupancy\nLease Expiration\nRent\nYear\nEnded\nRate\nYear\nEnded\nNumber of\nLeases\nArea\nSq. Ft.\nAnnual\nRent\nPercentage of\nGross Annual Rent\n7/31/2019\n45.42%\n7/31/2036\n47,000\n$ 992,301\n4.395\n7/31/2020\n21.48%\n7/31/2021\n20.42%\n7/31/2022\n22.27%\n7/31/2023\n22.27%\nAs of July 31, 2023 the federal tax basis is $22,423,614 with accumulated depreciation of $15,861,531 for a net carrying value of $6,562,083. The lives taken for depreciation vary between 15-40 years and the methods used are straight-line and declining balance.\nThe real estate taxes for this property are $135,702 per year and the rate used is averaged at $3.016 per $100 of assessed valuation.\n5. Levittown, New York-Hempstead Turnpike\nThe Company owns the entire property. In October 2006, the Company entered into a lease agreement with a restaurant. The restaurant constructed a new 10,000 square foot building, which opened in May 2008. In September 2022, the restaurant extended its lease for an additional five years expiring May 3, 2028. Ownership of the building reverts to the Company at the conclusion of the leasing arrangement, currently May 3, 2028.\nOccupancy\nLease Expiration\nRent\nYear\nEnded\nRate\nYear\nEnded\nNumber of\nLeases\nArea\nSq. Ft.\nAnnual\nRent\nPercentage of\nGross Annual Rent\n7/31/2019\n100.00%\n7/31/2028\nBuilding\n10,000\n$ 434,036\n1.923\n7/31/2020\n100.00%\nLand\n75,800\n7/31/2021\n100.00%\n85,800\n7/31/2022\n100.00%\n7/31/2023\n100.00%\nThe real estate taxes for this property are $188,232 per year and the rate used is averaged at $944.797 per $100 of assessed valuation.\n6. Massapequa, New York-Sunrise Highway\nThe Company is the prime tenant of this leasehold. The lease expired May 14, 2009, and there was one renewal option for twenty-one years, which the Company exercised in April 2008. The leasehold is currently subleased to two tenants; one tenant occupies 113,400 square feet of the property, and the other tenant occupies 20,000 square feet of the property. The subleases expire in May 2030, with no renewal options.\nOccupancy\nLease Expiration\nRent\nYear\nEnded\nRate\nYear\nEnded\nNumber of\nLeases\nArea\nSq. Ft.\nAnnual\nRent\nPercentage of\nGross Annual Rent\n7/31/2019\n85.01%\n7/31/2030\n133,400\n$ 847,362\n3.753\n7/31/2020\n85.01%\n7/31/2021\n93.75%\n7/31/2022\n100.00%\n7/31/2023\n100.00%\nThe real estate taxes for this property are $244,620 per year and the rate used is averaged at $639.81 per $100 of assessed valuation.\nThe Company does not own this property. Improvements to the property, if any, are made by tenants.\n7. Circleville, Ohio-Tarlton Road\nThe Company owns the entire property. The property is currently leased to two tenants. The tenants use these premises for warehouse and distribution facilities. In October 2013, one tenant signed a lease agreement for a five-year period to occupy 48,000 square feet and in May 2015 signed a modification of lease to occupy 72,000 square feet. In August 2016, this tenant signed a further modification of lease to occupy 84,000 square feet, which in December 2020 was extended for an additional three years to expire October 31, 2024. The other tenants lease agreement was executed in May 2015, for a five-year period effective June 1, 2015, and allows the tenant to have permanent space of 108,000 square feet. In April 2023, the tenant further extended the lease until May 31, 2026. Brokerage commissions were $88,841.\nOccupancy\nLease Expiration\nRent\nYear\nEnded\nRate\nYear\nEnded\nNumber of\nLeases\nArea\nSq. Ft.\nAnnual\nRent\nPercentage of\nGross Annual Rent\n7/31/2019\n99.10%\n7/31/2025\n84,000\n$ 368,982\n1.634\n7/31/2020\n99.30%\n7/31/2026\n108,000\n512,956\n2.272\n7/31/2021\n99.30%\n192,000\n$ 881,938\n3.906\n7/31/2022\n99.30%\n7/31/2023\n99.30%\nAs of July 31, 2023 the federal tax basis is $4,493,846 with accumulated depreciation of $4,183,897 for a net carrying value of $309,949. The lives taken for depreciation vary between 15-40 years and the methods used are straight-line and declining balance.\nThe real estate taxes for this property are $38,300 per year and the rate used is averaged at $4.987 per $100 of assessed valuation.\nIn the opinion of management, all of the Companys properties are adequately covered by insurance.\nSee Note 8 to the Consolidated Financial Statements contained in the 2023 Annual Report to Shareholders, which information is incorporated herein by reference, for information concerning the tenants, the rental income from which equals 10% or more of the Companys rental income. Item 3. Legal Proceedings.\nThere are various lawsuits and claims pending against the Company. It is the opinion of management that the resolution of these matters will not have a material adverse effect on the Companys Consolidated Financial Statements.\nIf the Company sells, transfers, disposes of or demolishes 25 Elm Place, Brooklyn, New York, then the Company may be liable to create a condominium unit for the loading dock. The necessity of creating the condominium unit and the cost of such condominium unit cannot be determined at this time. ITEM 4. MINE SAFETY DISCLOSURES.\nNone\nPART II ITEM 5. MARKET FOR REGISTRANTS COMMON EQUITY, RELATED STOCKHOLDER MATTERS AND ISSUER PURCHASES OF EQUITY SECURITIES.\nCOMMON STOCK INFORMATION\nEffective November 8, 1999, the Companys common stock commenced trading on The Nasdaq Capital Market tier of The Nasdaq Stock Market under the Symbol: Mays. Such shares were previously traded on The Nasdaq National Market. Effective August 1, 2006, NASDAQ became operational as an exchange in NASDAQ-Listed Securities. It is now known as The NASDAQ Stock Market LLC.\nOn September 5, 2023, the Company had approximately 800 shareholders of record.\nRECENT SALES OF UNREGISTERED SECURITIES\nDuring the year ended July 31, 2023 we did not sell any unregistered securities.\nRECENT PURCHASES OF EQUITY SECURITIES\nDuring the fourth quarter of the year ended July 31, 2023, we did not repurchase any of our outstanding equity securities. ITEM 6. SELECTED FINANCIAL DATA.\nNot required. ITEM 7. MANAGEMENTS DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS.\nThe information appearing under the heading Managements Discussion and Analysis of Financial Condition and Results of Operations on pages 22-26 of the Registrants 2023 Annual Report to Shareholders is incorporated herein by reference. ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK.\nNot required. ITEM 8. FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA.\nThe Registrants Consolidated Financial Statements, together with the report of Prager Metis CPAs, LLC, independent registered public accounting firm, dated October 23, 2023, appearing on pages 3 through 21 of the Registrants 2023 Annual Report to Shareholders is incorporated herein by reference. With the exception of the aforementioned information and the information incorporated by reference in Items 2 and 7 hereof, the 2023 Annual Report to Shareholders is not to be deemed filed as part of this Form 10-K Annual Report. ITEM 9. CHANGES IN AND DISAGREEMENTS WITH ACCOUNTANTS ON ACCOUNTING AND FINANCIAL DISCLOSURE.\nThere are no disagreements between the Company and its accountants relating to accounting or financial disclosures. ITEM 9A. CONTROLS AND PROCEDURES.\n(A) EVALUATION OF DISCLOSURE CONTROLS AND PROCEDURES.\nThe Companys management reviewed the Companys internal controls and procedures and the effectiveness of these controls. As of July 31, 2023, the Company carried out an evaluation, under the supervision of, and with the participation of the Companys management, including its Chief Executive Officer and Chief Financial Officer, of the effectiveness of the design and operation of the Companys disclosure controls and procedures pursuant to Rules 13a-14(c) and 15d-14(c) of the Securities Exchange Act of 1934. Based upon that evaluation, the Chief Executive Officer and Chief Financial Officer concluded that the Companys disclosure controls and procedures are effective in timely alerting them to material information relating to the Company required to be included in its periodic SEC filings.\n(B) CHANGE TO INTERNAL CONTROLS OVER FINANCIAL REPORTING.\nThere was no change in the Companys internal controls over financial reporting or in other factors during the Companys last fiscal quarter that materially affected, or is reasonably likely to materially affect, the Companys internal controls over financial reporting. There were no significant deficiencies or material weaknesses noted, and therefore there were no corrective actions taken.\n(C) MANAGEMENTS ANNUAL REPORT ON INTERNAL CONTROL OVER FINANCIAL REPORTING.\nThe Companys management is responsible for establishing and maintaining adequate internal control over financial reporting as such term is defined in Rule 13(a)-15(f). Our internal control system has been designed to provide reasonable assurance to the Companys management and its Board of Directors regarding the preparation and fair presentation of published financial statements. All internal control systems, no matter how well designed, have inherent limitations. Even those systems that have been determined to be effective can provide only reasonable assurance with respect to financial statement preparation and presentation. The Companys management assessed the effectiveness of our internal control over financial reporting as of July 31, 2023. In making this assessment, the Companys management used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission in Internal Control - Integrated Framework published in 2013. Based on the Companys assessments, we believe that, as of July 31, 2023, its internal control over financial reporting is effective based on these criteria.\nThis Form 10-K Annual Report does not include an attestation report of our independent registered public accounting firm regarding internal controls over financial reporting. Managements report was not subject to attestation by our independent registered public accounting firm pursuant to the permanent exemption for smaller reporting company filers from the internal control audit requirement of Section 404(b) of the Sarbanes-Oxley Act of 2002. ITEM 9B. OTHER INFORMATION.\nReports on Form 8-K - One report on Form 8-K was filed by the Company during the three months ended July 31, 2023.\nItem reported - The Company reported its financial results for the three and nine months ended April 30, 2023. Date of report filed - June 7, 2023.\nITEM 9C. DISCLOSURE REGARDING FOREIGN JURISDICTIONS THAT PREVENT INSPECTION.\nNot Applicable\nPART III ITEM 10. DIRECTORS, EXECUTIVE OFFICERS AND CORPORATE GOVERNANCE.\nThe information relating to directors of the Company is contained in the Definitive Proxy Statement for the 2023 Annual Meeting of Shareholders and such information is incorporated herein by reference.\nExecutive Officers of the Registrant\nThe following information is furnished with respect to each Executive Officer of the Registrant (each of whose position is reviewed annually but each of whom has a three-year employment agreement, effective August 1, 2011 and renewed August 1, 2014, August 1, 2017, August 1, 2020 and August 1, 2023). On October 3, 2023, Mr. Greenblatt tendered his resignation as Executive Vice President and Chief Financial Officer of the Company effective December 31, 2023. He will continue to be subject to the terms and conditions of his Employment Agreement with the Company through December 31, 2023.\nName\nAge\nBusiness Experience During\nthe Past Five Years\nFirst Became\nSuch Officer\nor Director\nLloyd J. Shulman\nPresident\nNovember, 1978\nChairman of the Board, Chief Executive Officer and President\nNovember, 1996\nMark S. Greenblatt\nVice President\nAugust, 2000\nChief Financial Officer and Treasurer\nAugust, 2003\nDirector\nAugust, 2003\nWard N. Lyke, Jr.\nVice President\nFebruary, 1984\nAssistant Treasurer\nAugust, 2003\nGeorge Silva\nVice President-Operations\nMarch, 1995\nAll of the above mentioned officers have been appointed as such by the directors and have been employed as Executive Officers of the Company during the past five years. ITEM 11. EXECUTIVE COMPENSATION.\nThe information required by this item appears under the heading Compensation in the Definitive Proxy Statement for the 2023 Annual Meeting of Shareholders and such information is incorporated herein by reference. ITEM 12. SECURITY OWNERSHIP OF CERTAIN BENEFICIAL OWNERS AND MANAGEMENT AND RELATED STOCKHOLDER MATTERS.\nThe information required by this item appears under the headings Security Ownership of Certain Beneficial Owners and Management and Information Concerning Nominees for Election as Directors in the Definitive Proxy Statement for the 2023 Annual Meeting of Shareholders and such information is incorporated herein by reference. ITEM 13. CERTAIN RELATIONSHIPS AND RELATED TRANSACTIONS, AND DIRECTOR INDEPENDENCE.\nThe information required by this item appears under the headings Compensation, Certain Transactions, and Board Interlocks and Insider Participation in the Definitive Proxy Statement for the 2023 Annual Meeting of Shareholders and such information is incorporated herein by reference. ITEM 14. PRINCIPAL ACCOUNTANT FEES AND SERVICES.\nThe following table sets forth the fees paid by the Company (on a cash basis) to its independent registered public accounting firm, Prager Metis CPAS, LLC, for the fiscal years 2023 and 2022.\nFiscal Year\nAudit fees\n$ 170,000\n$ 170,000\nAudit related fees\n12,500\n12,100\nTax fees\n45,000\n45,000\nTotal Fees\n$ 227,500\n$ 227,100\nAudit Fees for fiscal year 2023 and fiscal year 2022 were for professional services rendered for the audits of the consolidated financial statements of the Company, interim quarterly reviews of Form 10-Q information and assistance with the review of documents filed with the U. S. Securities and Exchange Commission.\nAudit related fees for fiscal year 2023 and fiscal year 2022 consist of audits of real estate tax matters and consultations concerning financial accounting and reporting standards.\nTax fees for fiscal year 2023 and fiscal year 2022 were for services related to tax compliance and preparation of federal, state and local corporate tax returns.\nThe officers of the Company consult with, and receive the approval of, the Audit Committee before engaging accountants for any services.\nPART IV ITEM 15. EXHIBITS AND FINANCIAL STATEMENT SCHEDULES.\nThe following documents are filed as part of this report:\n1. The Consolidated Financial Statements and report of Prager Metis CPAs, LLC, independent registered public accounting firm, dated October 19, 2023, set forth on pages 3 through 21 of the Companys 2023 Annual Report to Shareholders.\n2. See accompanying Index to the Companys Consolidated Financial Statements and Schedules.\n3. Exhibits:\n(2) Plan of acquisition, reorganization, arrangement, liquidation or succession-not applicable.\n(3) Articles of incorporation and by-laws:\n(i) Certificate of Incorporation and certificate of amendment - incorporated by reference.\n(ii) By-laws, as amended - incorporated by reference.\n(4) Instruments defining the rights of security holders, including indentures-see Exhibit above.\n(9) Voting trust agreement-not applicable.\n(10) Material contracts-(i) Retirement Plan and Trust, Summary Plan Description - incorporated by reference.\n(ii) Employment agreements - Employment Agreements with Messrs. Shulman, Greenblatt, Lyke and Silva, each originally dated August 1, 2005, were incorporated by reference to Registrants Form 8-K dated August 1, 2005. Each of these Employment Agreements had been extended on multiple occasions, the most recent as of August 1, 2023, for three year periods. Each Employment Agreement dated as of August 1, 2023 and scheduled to end on July 31, 2026 is attached as an Exhibit to this Form 10-K. On October 3, 2023, Mr. Greenblatt tendered his resignation as Executive Vice President and Chief Financial Officer of the Company effective December 31, 2023. He will continue to be subject to the terms and conditions of his Employment Agreement with the Company through December 31, 2023.\n(11) Statement re computation of per share earnings-not applicable.\n(12) Statement re computation of ratios-not applicable.\n(13) Annual Report to security holders.\n(14) Code of ethics-not applicable.\n(18) Letter re change in accounting principles-not applicable.\n(21) Subsidiaries of the registrant.\n(22) Published report re matters submitted to vote of security holders-not applicable.\n(24) Power of attorney-none.\n(28) Information from reports furnished to state insurance regulatory authorities-not applicable.\n(31) Certifications pursuant to Section 302 of the Sarbanes-Oxley Act of 2002.\n31.1-Chief Executive Officer\n31.2-Chief Financial Officer\n(32) Certification pursuant to Section 906 of the Sarbanes-Oxley Act of 2002; 18 U.S.C. Sec. 1350.\nSIGNATURES\nPursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.\nJ.W. MAYS, INC.\n(Registrant)\nOctober 19, 2023\nBy: LLOYD J. SHULMAN\nLloyd J. Shulman\nChairman of the Board,\nChief Executive Officer and President\nOctober 19, 2023\nBy: MARK S. GREENBLATT\nMark S. Greenblatt\nVice President, Chief Financial Officer\nand Treasurer, Director\nOctober 19, 2023\nBy: WARD N. LYKE, JR.\nWard N. Lyke, Jr.\nVice President\nand Assistant Treasurer\nPursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the Registrant in the capacities and on the date indicated.\nSignature\nTitle\nDate\nLLOYD J. SHULMAN\nChairman of the Board, Chief Executive\nOctober 19, 2023\nLloyd J. Shulman\nOfficer, and President\nMARK S. GREENBLATT\nVice President, Chief Financial Officer\nOctober 19, 2023\nMark S. Greenblatt\nand Treasurer, Director\nJENNIFER L. CARUSO\nDirector\nOctober 19, 2023\nJennifer L. Caruso\nROBERT L. ECKER\nDirector\nOctober 19, 2023\nRobert L. Ecker\nSTEVEN GURNEY-GOLDMAN\nDirector\nOctober 19, 2023\nSteven Gurney-Goldman\nJOHN J. PEARL\nDirector\nOctober 19, 2023\nJohn J. Pearl\nDEAN L. RYDER\nDirector\nOctober 19, 2023\nDean L. Ryder\nINDEX TO REGISTRANTS FINANCIAL STATEMENTS AND SCHEDULES\nReference is made to the following sections of the Registrants Annual Report to Shareholders for the fiscal year ended July 31, 2023, which are incorporated herein by reference:\nReport of Independent Registered Public Accounting Firms (pages 20-21)\nConsolidated Balance Sheets (page 3)\nConsolidated Statements of Operations (page 4)\nConsolidated Statement of Changes in Shareholders Equity (page 5)\nConsolidated Statements of Cash Flows (page 6)\nNotes to Consolidated Financial Statements (pages 7-17)\nFinancial Statement Schedules\nReal Estate and Accumulated Depreciation (page 18)\nReport of Management (page 19)\nAll other schedules for which provision is made in the applicable regulations of the U. S. Securities and Exchange Commission are not required under the related instructions or are inapplicable and, accordingly, are omitted.\nThe separate financial statements and schedules of J.W. Mays, Inc. (not consolidated) are omitted because the Company is primarily an operating company and its subsidiaries are wholly-owned.\nEXHIBIT INDEX TO FORM 10-K\n(2) Plan of acquisition, reorganization, arrangement, liquidation or succession-not applicable\n(3) (i) Certificate of incorporation and certificate of amendment - incorporated by reference\n(ii) By-laws, as amended - incorporated by reference\n(4) Instruments defining the rights of security holders, including indentures-see Exhibit (3) above\n(9) Voting trust agreement-not applicable\n(10) Material contracts-(i) Retirement Plan and Trust, Summary Plan Description - incorporated by reference\n(ii) Employment agreements - Employment Agreements with Messrs. Shulman, Greenblatt, Lyke and Silva, each originally dated August 1, 2005, were incorporated by reference to Registrants Form 8-K dated August 1, 2005. Each of these Employment Agreements had been extended on multiple occasions, the most recent as of August 1, 2023, for three year periods. Each Employment Agreement dated as of August 1, 2023 and scheduled to end on July 31, 2026 is attached as an Exhibit to this Form 10-K. On October 3, 2023, Mr. Greenblatt tendered his resignation as Executive Vice President and Chief Financial Officer of the Company effective December 31, 2023. He will continue to be subject to the terms and conditions of his Employment Agreement with the Company through December 31, 2023.\n(11) Statement re computation of per share earnings-not applicable\n(12) Statement re computation of ratios-not applicable\n(13) Annual Report to security holders\n(14) Code of ethics-not applicable\n(18) Letter re change in accounting principles-not applicable\n(21) Subsidiaries of the Registrant\n(22) Published report re matters submitted to vote of security holders-not applicable\n(24) Power of attorney-none\n(28) Information from reports furnished to state insurance regulatory authorities-not applicable\n(31) Certifications Pursuant to Section 302 of the Sarbanes-Oxley Act-1 and 2\n31.1-Chief Executive Officer\n31.2-Chief Financial Officer\n(32) Certification Pursuant to Section 906 of the Sarbanes-Oxley Act\nEX-101.INS XBRL INSTANCE DOCUMENT\nEX-101.SCH\nXBRL TAXONOMY EXTENSION SCHEMA\nEX-101.PRE\nXBRL TAXONOMY EXTENSION PRESENTATION LINKBASE\nEX-101.LAB\nXBRL TAXONOMY EXTENSION LABEL LINKBASE\nEX-101.CAL\nXBRL TAXONOMY EXTENSION CALCULATION LINKBASE\nEX-101.DEF\nXBRL TAXONOMY EXTENSION DEFINITION LINKBASE"
}